{
  "WvyjB6VYeguRF65wLPc_8Q": {
    "date": "7/18/2017",
    "text": "Great NY slice...  Owner is a hands on guy...  My favorite and only pizzeria...  And I have tried them all...  Love the pepperoni, sausage, onion and extra cheese pie...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hutFptdtH0qMNDg9yQ5rZg"
  },
  "ef0v9HstWGpf6kBsl59lIg": {
    "date": "7/7/2017",
    "text": "Hands down the Best! When you walk in this pizza joint, you have left Phoenix and walked right into NY city. The staff is always great and the pizza is awesome. Fuhgettaboutit",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PK5XDUX9TgnUjoLnrzjG8Q"
  },
  "pczWqudtzvOcE30k1VU9TQ": {
    "date": "3/7/2016",
    "text": "My mom was craving pizza so we decided to dine in for dinner. It appears this is a mostly pick up business and the ambiance inside isn't that great. Our waiter was very nice but also in training so it appeared he was in charge of all diners, the phone and any take out business while at least one other employee just watched. He was clearly overwhelmed- it was too much for one person. As you may imagine, the service consequently suffered.  We split the garlic knots, BBQ pizza and Ziggy's pizza. We all liked the pizza so next time I'd either order for carry out or just have no service expectations.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jbqGTp-JV38gLutJ_w7Z1w"
  },
  "AMfFu3O4fnsqe-P3ROsDcg": {
    "date": "11/13/2015",
    "text": "Absolutely the same taste we experienced on the Upper West Side of NYC where we lived for the last 3 years.  Anything we could do to find the right place and they're right here near us!  I told them in my order online that \"IT BETTER BE GOOD!\" and the delivery guy said, \"We're not afraid of you.\" Justifiably so, they are GREAT!    You guys need to jump on GrubHub because a lot of us New Yorkers are used to it and you need to give another (less qualified) place a run for their money.    TOTALLY GENUINE!!  Thanks Pauly!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "z8gjfwEmpYjlUjBzPR0Q5w"
  },
  "qpfVBGLUB7mwEodOte_IbA": {
    "date": "3/2/2017",
    "text": "Came in last night for a pie and couldn't be more impressed. Staff was super friendly and we're talking it up with us. Garlic knots...just order them and you'll understand. For the pizza they do half and half's and you can't go wrong selecting two. We did The Godfather and a three topping. Ordered a large and took the rest home for a late night snack. If/when we come out for spring training again this will be our first stop.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y5w6PhP28JM5ogCOstKCGQ"
  },
  "7tz0KsXM-tmzCEJ4Z_BmTg": {
    "date": "6/15/2017",
    "text": "Delicious! One of the best pizzas in town! Also the pizzas are massive and the garlic knots are addicting",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JSwrBhTkRPRAwmTda7lbnw"
  },
  "Sy13XCZr9mSvdSvtW_f-sw": {
    "date": "10/8/2016",
    "text": "I used to order delivery all the time from here. Now, $85 min. order for delivery... I don't think so! Too bad they're going to loose business over this new policy. On to the next NY pizza joint.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "2kcGOUqxhrq5AxJVJSO2wA"
  },
  "fclK9HTFyJF0FuVr9uN17w": {
    "date": "11/18/2013",
    "text": "Another hidden gem amongst the eateries hidden away in the corner of the Fry's shopping center on the corner of 90th & Via Linda.   I stopped in here for lunch recently and it was solid. They have several lunch specials for pizza by the slice, salads & calzones, and they all include drinks. I got a single slice of white pizza w/tomato & spinach w/a Cesar salad. The pizza was yummy! My parents are from NY. I've been to NY. I've had NY pizza. Honestly, I don't get all the hullabaloo about the pizza there (probably because I wasn't raised on it), but this pizza definitely seemed like authentic NY pizza. My NY parents both had plain cheese slices (which I tasted) and they were impressed. The Cesar salad that I had was pretty basic, but still good (and pretty good size for a lunch portion side salad).  The calzone & pasta options all sounded good as well, and one of these days I'd love to order a 24\" pie, just to see what it looks like.  The restaurant itself is pretty small (it seems like it caters more to takeout), but the staff is very friendly & I detected NY accents so you know this place is the real deal. I'd definitely come back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "W5cwxNwGiZJd393PCDQEvA"
  },
  "R33g_084Rclpn6Dv4ozJ7w": {
    "date": "12/28/2016",
    "text": "This pizza is always so good! I haven't tried a pizza I haven't liked. All the ingredients are fresh and great tasting. The garlic knots brought to the table beforehand are super yummy. The staff is also friendly.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ie8Gtzi_wZG3E-qX_R_H1g"
  },
  "d1TkuFxoDRgH7OUAW70WiQ": {
    "date": "12/13/2016",
    "text": "I haven't been to a pizzeria this good in years! Everything was perfect. My friend and I ordered wings, pizza and a garden salad. The crust was flavorful and slightly crisped-different from the \"chewy\" crust you usually get with new york style pizzas. The garlic knots were lightly buttered and delicious. Our food came out hot and in perfect order and time. The table and sitting area were clean.   The owner, Pauly, was very friendly. We could tell he really took pride in his business. I could totally see this becoming a chain restaurant. I was just visiting, but my friend stated that he would be back. Thanks for the great service! I definitely recommend this restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jQFmkAtOxSsYSBxKrvqDdQ"
  },
  "Oo7fZQk6NHjYxmz0wy2mIQ": {
    "date": "10/28/2016",
    "text": "Terrible. Ordered wings and a caesar salad. For over $23 bucks I got soggy wings, and a \"caesar\" salad that consisted of lettuce, a couple lemon wedges and dressing. I'll never order from here again. So disappointing.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DBOTsNiu8s5jUGbHy1t2yQ"
  },
  "ovQMfniOQVOZUshaT3wyPQ": {
    "date": "10/13/2016",
    "text": "Had a craving for a calzone. Ordered the tristate and got pepperoni, mushrooms and extra cheese. Based of pictures I wasn't expecting much, as most calzones in Arizona are nothing close to NY/NJ. However I was pleasantly surprised by the nice crispy crust wrapped around a tasty filling. The marinara is pretty good too, slightly on the sweeter side. I just wish there was a little more pepperoni and mushrooms inside. But I'd visit this place again and try their pizza.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "neyY3hqqir9RS6uQq5yr1g",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States. Calzone with pepperoni, mushroom and extra cheese.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/neyY3hqqir9RS6uQq5yr1g/o.jpg"
      }
    ],
    "user_id": "8eZ1RH16-hqK2nqKjwSH3A"
  },
  "nAu9FKARsPpq7Kv--pWYXg": {
    "date": "6/19/2015",
    "text": "I've only been once but wow. I was impressed. This place came highly recommend by my husband's New York born and bred boss.  This is the only place he will get pizza. I can see why.    My husband tried the pizza (cheese pizza's are on special this summer, just sayin').  He got his loaded with pepperoni, sausage, pineapple and ricotta. He downed a personal sized pizza in record time. I've never seen him so happy.  I decided to try the chicken parmesan meal. It was terrific. The chicken was crispy, juicy and flavorful. Not greasy as some tend to be.  The red sauce, which I hope is what they use on the pizza because it was perfect, was just the way I like it. Not a hint of sugar. There is nothing worse than sweet tomato sauce in my book.  I would happily go again and I would recommend highly.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "veeaBpjDwo-xfHSz3z3PWg"
  },
  "SN3v2z34-_XAtjCV-hGu6A": {
    "date": "11/28/2017",
    "text": "It's been nearly a week since our family took over this place the evening before Thanksgiving, however, the memory will last so much longer... Yo Pauly's knows what they're doing in service, food and ambiance.  A True gem tucked away in a shopping center in East Scottsdale, a neighborhood pizzeria with friendly owners and staff.  The glasses stay full, the pizza comes out hot and flavorful, the salads are fresh and the garlic knots shouldn't be missed.  As we say back home.... great grinds!  We'll see you again when we're in town!  Aloha for now, ~Miriam",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "chtqJ6vgjToY7zu8a0lkKQ"
  },
  "6R2QWoHFDiejSY95jU6EgA": {
    "date": "11/22/2017",
    "text": "Mine and my family's favorite place for pizza. The place really makes you feel at home in New York and everything is good and fresh. It is my go to place fore ordering pizza for any event.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "izaS9C1Jk-RXYhV4F_kfSA"
  },
  "Eox6aWQSI-6gxIGOv8TXAA": {
    "date": "11/9/2015",
    "text": "I would say that Yo Pauly's is one of my favorite places in Scottsdale to get pizza delivered. My coworkers and I have ordered delivery on numerous occasions and it has been great each time. Though I enjoyed the garlic knots, the main attraction here seems to be the giant 24\" pizza that they have on offer. My favorite would have to be the BBQ Chicken as I really liked the sauce they used on it. I also tried the Cheese Louise which was good as well.  I've always had a positive experience when it comes to delivery orders. From the person that picks up the phone to the delivery driver, each person has been very friendly and helpful. I would say that the customer service here has been excellent. Hopefully I can make it to their storefront sometime to check it out, that is if I'm not eating their awesome pizza already...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4suJsf9Q2uruOwKlnBixow"
  },
  "sL2c6oEABsCBfAbF6vOW7A": {
    "date": "10/25/2017",
    "text": "From the minute you walk in you get a good feeling alway greeted and is just a good welcoming feeling. The food there is phenomenal. So if you're looking for good food good atmosphere and have a good night this is the spot you got a try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KjeviyGH3eVazZAcz9HolQ"
  },
  "UTkmemQT21I0uaxDcgzvew": {
    "date": "3/20/2017",
    "text": "Had a coupon for a free cheese slice. The owner gave me a Huge piece, was very nice and the pizza was tasty!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lpNIhAJzkM1Y5NzsP2OW0g"
  },
  "MxcuQICy5LA7eGimkB6myg": {
    "date": "8/11/2015",
    "text": "A little place tucked away in the corner of a shopping center with all the charms of New York City. My husband and I first tried Yo Pauly's because of an entertainment book coupon and were pleasantly surprised by how good the pizza was, especially the crust!  We returned for another visit and I decided this time to try the stromboli while my husband ordered the pizza.  While the stromboli was good, I ended up having two slices of his pizza and took half the stromboli home.  They served us some complimentary garlic knots on both visits before our food came out, which were delicious.  Part of the charm of the place is the people.  Brittney behind the counter was very friendly and engaging, and chatted with us about the restaurant and the space (it's the original location of NYPD Pizza, so there's some history there).  There's definitely a good neighborhood vibe in there, which I love.  We're sure to be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dvJy79XmbMXnI_EzAcdSsA"
  },
  "yaI-TSIyf_3WQ9OoCyCIMg": {
    "date": "8/28/2016",
    "text": "I am a NY pizza snob.  Born and bred in Brooklyn, I know good NY pizza and have been searching for a slice since I moved to Scottsdale eight years ago.  I can now say that I've reached the promised land.  Yo Pauly's is a True pizza joint.  It's in a strip mall and is nondescript.  That's usually where you find the best pizza in NY.  So without further ado, here's my review (yeah, I like to rhyme a bit).  In my snobbish opinion, there are three things that make a good pizza. First, the crust must be crispy but not burnt from the edge to the center. Second, the sauce should be garlicy and salty with just the right level of acidity. Third, the cheese has to be just the right amount and should be of high quality.  Pauly gets five stars on each of these points.  The crust was just perfect, the sauce should be named a new food group, and the cheese was delicious and not over the top (I hate when places just dump cheese onto the pizza and it overwhelms everything else).    My family and I ordered the 24 Inch pizza with 1/2 plain and 1/2 mushroom.  It was truly enormous and I'm happy to say that we have leftovers (but not much).  A normal NY pizza is 18 inches and it would nicely feed three people.  The 24 inch needs at least four people.  Before the pizza came out, we were served complimentary garlic knots with Pauly's sauce.  They were delicious and my wife wanted to drink the sauce.    My son (not a real pizza eater) ordered the spaghetti and meatballs.  Once again the sauce was outstanding, the pasta was good (al dente) and the meatballs were great.  I'd actually consider ordering that occasionally.    This is a joint so the service is jovial and personal.  David, our server, was fun and attentive.  He made sure everyone was happy and joked around with us. Pauly was also very attentive and fun.  I can't tell you how much the food and people reminded me of home.  If you're from NY or just know real NY pizza, this should be at the top of your list.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zdtwe5YcVP8hLXR2ZEfllQ"
  },
  "JciWkoZf4htrZtdU_0d9wA": {
    "date": "11/26/2017",
    "text": "We pretty much took over the restaurant with our pre-Thanksgiving get together.  If they were overwhelmed, they didn't show it. The pizza and salads were served with a smile. They even made sure pizza's came out hot and fresh to the patio area where our overflow sat. My wine glass never went dry either. It felt like we were part of their family.  This was my first time here and I thought they did a great job. The pizza was excellent tasting also. Fresh, hot, bubbly cheese with Chunky toppings. Crust was not doughy and the sauce was flavorful. I did not have the salad but it looked delicious and full of stuff, not just a bowl of lettuce. Thanks to all for a special night!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "rtRVb54VIXOUI_5mT1rhgQ"
  },
  "0Nv-hC1rwmTbfYMSYOR-6Q": {
    "date": "8/25/2018",
    "text": "Best fat slabs of NY pie I've had in Phx. BTW, went in once for lunch and ordered. I then realized I'd left my wallet at home. Said as such to Pauly. He said \"I remember you. I know you're good for it. You can pay next time you come in.\" I'd only been there once before. I still went home and got my wallet because I don't like being in debt, but, that's how Pauly treated a customer he'd only met once. Awesome!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OvfWYdkqE_4dv26TIQ9wtw"
  },
  "ap6ZiaOenI8uG5zy8cDzNg": {
    "date": "3/30/2017",
    "text": "This is our go to pizza place in Scottsdale.  The 24 inch pizza is massive!    The staff is friendly and try to make your interactions fun.    One thing especially that we like is that their pizza sauce is not overall salty.  The crust tastes good and the toppings are fresh and flavorful.    Da Midtown Meltdown is our favorite Friday night dinner.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Y-tJGKZchvTjC9YeQ5sxgQ",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States. 24 inch pizza.  It was great for a full house of guests.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Y-tJGKZchvTjC9YeQ5sxgQ/o.jpg"
      }
    ],
    "user_id": "vhTnC1lr4-UjvgOLk4kbzw"
  },
  "ffT4_eTle3hnT_XiHc7xXA": {
    "date": "12/28/2017",
    "text": "An update to the famous \"Steve-arino\" sandwich (half chicken parm / half meatball parm). I just added a little baked ziti to that sandwich - yes, they were able to fit all that on the same sandwich, though it was a challenge. This was the \"icing on the cake\" that was needed, absolutely AWESOME!!! Clearly, this is THE BEST sandwich in town, you MUST give it a try.  Wyatt, Phil, Dave and all the crew at Yo Pauley's totally take care of their customers, best Italian food in town. Try that Steve-arino sandwich!!!  Steve W 12/ 28/ 2017",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "D3BBeHgUFhrEDcROS0hZxw"
  },
  "RjYbpoh1PvdO1PRuhKNkYA": {
    "date": "8/28/2018",
    "text": "I love Sonny's Spaghetti! The staff here is wonderful. Very nice. Plus they remember me when I come in and I'm from Oklahoma. My parents ate here and fell in love with their sauce and their knots. So I always grab some and take them back to Kansas for them. I would highly recommend eating here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ENewcr--Sa8JchjwAYa4JA"
  },
  "_7qJfBaK5JdwxAb1qhN1fA": {
    "date": "9/18/2018",
    "text": "My favorites are chicken Parmesan sandwich or meal, garlic knots. Normally get pizza slices - excellent. Always do take out. Staff always friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7geeXqjthB7hyZfxF9U7PA"
  },
  "_HdlZy9-BjqwA4yyoJ12_g": {
    "date": "9/14/2018",
    "text": "Great service and even better pizza! My wife is from NY and says this is the closest thing you can get to being back east.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SUSjX4KzfL8z367FyCeDew"
  },
  "1s_Mq3xLeB5Oobsg2XYtLA": {
    "date": "5/26/2018",
    "text": "Yo Pauly's....where Brooklyn meets Scottsdale. Can't say enough about this place, it's freaking amazing. My mouth is watering as I write this review! Best NY pizza in the valley. If you are a New Yorker and you miss home, go to Yo Pauly's for some nostalgic bliss.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dBupz8zNZHEkxCXTtquzmQ"
  },
  "9kyZaiuo4PK_jAuWtgS2FQ": {
    "date": "5/23/2018",
    "text": "Called for delivery. They don't do it you have to use a third party app for delivery. Thank but no thanks, I'm not letting Postmates or some other service screw up my order like they always do. YO PAULY, you just lost a costumer since you didn't want to do it yourself, ya lazy bum.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dv24ifGmtG6RoFqP0Aqpyg"
  },
  "bgoz7e1jprQV9df-wGxn1A": {
    "date": "6/17/2018",
    "text": "Best NY pizza you are gonna find outside NY. Wyatt and Sarah both took really good care of us. Service was great and the pizza was on point. We will be back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RVEHp2IayDaDw4HLA-JhGA"
  },
  "nEV2Y7FuKREPzpJAGlAoYg": {
    "date": "9/30/2016",
    "text": "Recommended to us by a guy named Mikey from New Jersey or New York , a friend of a friend, who I mentioned to in passing conversation that most Italian food in Phoenix doesn't meet up to what I'm used to back east. Well this place does. First thing I noticed: clean and bright with great ambiance. Soon after, they make you feel like family and friend. Food has fresh ingredients and is very good. Garlic knots win you over soon after entering the door. Bend over backwards staff and owner. The kind of place you can gather with your family and friends. They do a huge takeout business. We love this place first time in.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "pTMdll_OUEBJ1fSRYY0O9Q",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States. I think it&amp;#39;s  an East coast sign of hospitality.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pTMdll_OUEBJ1fSRYY0O9Q/o.jpg"
      },
      {
        "img_id": "ZeHjU5oFV8aFGMpIKo1-FA",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States. Good outdoor patio. Clean and bright.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZeHjU5oFV8aFGMpIKo1-FA/o.jpg"
      },
      {
        "img_id": "kaXypVT-bujW6L0FWOVY5A",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kaXypVT-bujW6L0FWOVY5A/o.jpg"
      }
    ],
    "user_id": "i3uxV-4BqJLZsp9qGp5wVQ"
  },
  "_YQgpqPZbm55rvT7fK4ygw": {
    "date": "2/16/2019",
    "text": "We drove a bit out of our way, but so glad we did! Fantastic pizza and great Pizzaria atmosphere. The 24 inch pizzas were impressive to witness.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NouM1D82z2kBI9RPg-rJrA"
  },
  "LLKanfmqAtQOlsYtozGBVg": {
    "date": "8/14/2018",
    "text": "Stopped in last night for a quick slice of pizza- wasn't disappointed, But, then again I never am when I'm at Yo Paulys.  From the delicious food down to the exceptional customer service which by far exceeds any customer service experience I've ever had. They truly make you feel like you're a part of the family. It's a great feel good place tucked in the corner but not too hard to find. Quaint and charming it's like visiting an/your Italian grandmothers home for lunch or dinner. Recently voted top 50 restaurants to eat in the Valley I say it's a FOR SURE MUST TRY!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V1XeAYmYZM_IBwsOZ6YyqA"
  },
  "69UZv9H2bhS-AAiDp9Ym6A": {
    "date": "7/14/2018",
    "text": "Went through yelp for pizza and ran across this place. Called in a half cheese half pepperoni pizza for pick up. Go to pick it up and had amazing customer service!! He opened the pizza and half of it was flopped over and he was shocked, apologized said he would make a new one. And gave me a free pizza coupon and let me have the messed up pizza with a fresh new one. Very nice. get home to try it... O M G! Soooo good! New favorite pizza place here! I can't wait to tell people about this place! AMAZING CUSTOMER SERVICE! AMAZING FOOD! Hit the jackpot with this place :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8q9XpzWw9b5BQh1qqTRm4w"
  },
  "-II0RsbU8PKA1OX8z0aXnw": {
    "date": "8/5/2018",
    "text": "It's not Danny's pizza in Kew Gardens (NY) but it's the best New York Pizza in Arizona",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LJ5LVla3coDMhY9iYm9VNA"
  },
  "exIBIT0s5zLi-qqhV6tbgQ": {
    "date": "11/26/2017",
    "text": "I absolutely LOVE this place! The food is amazing, can't wait to go back and try each pizza on the menu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gY58CGl2jGUDB6WShWk--A",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States. Loved the look of the place!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gY58CGl2jGUDB6WShWk--A/o.jpg"
      },
      {
        "img_id": "LvmeB8vLHAOdj1CvrIDqKg",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States. OMG Meatballs were delicious!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LvmeB8vLHAOdj1CvrIDqKg/o.jpg"
      },
      {
        "img_id": "zBiNchXlNHqDq5R8jBYt5g",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States. The Godfather!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zBiNchXlNHqDq5R8jBYt5g/o.jpg"
      }
    ],
    "user_id": "n0hng6ZfTAKyR3Wp5q-org"
  },
  "bESnBHlJJtfHgWfQjwJyNw": {
    "date": "10/14/2018",
    "text": "Looks good very disappointing. The sausage is disgusting no sauce no cheese. I would have giving less stars but the staff was nice so they get two starts for that.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kQLWcN-gRpmDhxHrH8K8kw"
  },
  "Rjq9V_cIowBEbJ6_aRY9xw": {
    "date": "7/22/2018",
    "text": "I'm not supposed to eat wheat but tonight I treated myself to a pepperoni pie with a Greek salad and I'm so glad we ordered from Yo Pauly's. This is hands down the best pizza in AZ. We ordered our pizza well done and David, Anthony and Wyatt made all of our food to perfection. Thank you guys. You're the best!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eEvzcFqHQU74MjFM4sUbjA"
  },
  "ZuPwBe3bMgBSW8hpr1l-Sg": {
    "date": "6/5/2018",
    "text": "The guy at the counter is an awesome representative of the restaurant. Very personable and feels like a buddy.  Food is really good and will continue to come back.  A really great feel all around.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pa0_LuscRddN9gPsNxUhJw"
  },
  "bti6R9rPGSbNRpLKaKAHNg": {
    "date": "4/17/2018",
    "text": "Serious legit NY pizza in the heart of Scottsdale.  I'm from NY and a pizza expert.  Top 3 in all of greater Phoenix hands down that I've experienced thus far and I've done quite a few.  Always start with a cheese slice as my base test case and you should too.  Plus great people and service which is why it's 5 stars.  They actually care.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_nrUhoV7DRrPocrmC-SLtQ"
  },
  "RG_jTIQiIKzxeq_rWUEs6w": {
    "date": "1/1/2014",
    "text": "I just moved here from California and was thrilled to discover Yo Pauly's. Their New York pizza is delicious. A must to accompany your meal is their garlic knots with marinara sauce! Tonight I tried their baked ziti. Their portions are generous and they don't skimp on the cheese. I love the atmosphere at the restaurant. I am usually someone who has our pizza delivered but really enjoy dining there. The staff is very friendly. Definitely a two thumbs up!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "luGAGU9dMYWezC89sMLzXA"
  },
  "SMP6nDSlR9hQGDjndAIy5g": {
    "date": "4/7/2012",
    "text": "My family loves the Pizza.  In fact my wife just left to go pick some up because they had a 1 1/2 hour wait for delivery on a Sat night.  No doubt because this crispy crust authentic New York style pizza is in high demand.  When we dine in the owner always takes time to talk with us.  They are kinda located in a horrible spot tucked back in the corner of a shopping center but once you find this place its worth it.  Prices are reasonable food is full of flavor and did I say I love the crust.  Highly recommended.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VY229X2pjyVuX_PFjSSbPw"
  },
  "A2Nt3FSW3K6QAuvQhdra2A": {
    "date": "4/6/2011",
    "text": "This place really hit the spot! I'm from Jersey so it's pretty hard to earn a 5 star from my on a NY style pizza place. But this place did it perfect. A lot of times I find that places in AZ tend to be way to greasy. Yo Pauly's had the perfect amount of grease. You can order by the slice and they are nice and big and nice and flat, perfect to fold in half. I also ordered a house salad that was very fresh with yummy house dressing. I can't wait to go back and try some hot wings! Lucky I work right in the area so I will be back often.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "7M1zIE6OzpySDlqLU6MnEg"
  },
  "BtGaF7nuPLCU1I5a7mhEjg": {
    "date": "11/11/2010",
    "text": "Yo Pauly's makes incredible pizzas.  Great, New York style pizza and a charming, family environment. They always greet you when you walk in the door and make you feel welcome.   We often pick up pizza to take home and one night one of the staff (not the owner) told us to \"come by and eat in one night\".  Another night we showed up 5min before close and they kept the ovens on and made us our pizza. Great service for a $20 sale.  If you like thin, New York style pizza this is a place not to be missed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IIanEo7i7t5Jr6lujGFA8g"
  },
  "1K2QNU1awMPK5UNl45JsVA": {
    "date": "6/11/2011",
    "text": "Best NY pizza in town.  The lunch specials are great, it's just unfortunate I work too far away to enjoy them as much as I would like.  The godfather pizza is great for those you like peppercinis and various meats. They also have great buffalo wings.  Every time I go in, Pauly is there and treats his customers with great respect.  Go once and you'll become a regular.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zjNrfOC4LmTkHCIHQl1e-A"
  },
  "opAlcel5u6mMViH1dJoGiw": {
    "date": "5/29/2014",
    "text": "LOVE this place!! Really delicious food that's got their homemade taste & touch to it. Prices are very reasonable. Exc quick service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wyZGWI29JwVRh6FqSv80YA"
  },
  "Nq23-bN2hFMEFsheFqVghw": {
    "date": "8/31/2014",
    "text": "We ordered cannolis for takeout. The owner Pauly was really sweet and made sure to let me know they would wait until we got there to fill them so that they would be fresh for us. We were greeted right when we arrived, they filled the cannolis immediately, and the were delicious (and very reasonably priced). The pizza also looked great- we will definitely be back to get pizza and cannolis!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3-3QMiAwyV_xPRaMjc-XAg"
  },
  "bWcmmUzY6LXe30_IE0WRjA": {
    "date": "1/22/2014",
    "text": "This was always a family favorite, in fact we had a few birthday celebrations here. We hadn't been back for years as we spend a lot of time in Northern Arizona.  Returned this past week-end, and was very happy to discover the food was as excellent as it has always been.  The waitress who assisted us was both gracious and helpful.  The Astonia wings were just like I remembered.  Our pizza was made to perfection.  Oh, did I mention I'm a native New Yorker, and like most of us, I'm a pizza snob.  The fact that they have been around so long and are making it through this difficult economy speaks volumes about the quality of food and service.  Can't wait to go back.  It will not be years.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DV0zJfDoKkFdjFtjXZkuRw"
  },
  "KpHzzFfd_DYvOYuRm-0lgQ": {
    "date": "3/29/2014",
    "text": "We love this place - we've been coming here for nearly three years; we absolutely  love the food and also really enjoy the charm & character of the restaurant. The Pizzas are a rich blend of traditional and inspired flavors, (we love the Whitestone best, but enjoy everything we've tried - you can't go wrong) and Pauly's roots give the food and the place a unique personal/local feel. The salads are practically addicting; once I start eating them I wanna keep going!  Also, it's a real treat to get good service from the staff who always seem to be enjoying themselves - gives a nice welcoming warmth to the place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "35i31BaP_Xc0e-5ZQZ-hVQ"
  },
  "alOZOwGGLrDnBJLn6INSIA": {
    "date": "5/24/2010",
    "text": "Good NY style pizza. Good garlic knots. You should eat here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "AlDQJ0TVR-GKc7wx8qN5mQ"
  },
  "s-siqAtITaxDQaGLNxSF1A": {
    "date": "3/9/2011",
    "text": "Great pizza and wings! Meatball sub was bland.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XSsKtY1zY-Sy4Z8S6cBtVw"
  },
  "0HD56PoL45ouPFwyQPDOvA": {
    "date": "2/10/2011",
    "text": "Stopped for a slice & loved it. Crispy & chewy crust, good sausage.  Based on the pizza, I will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1vGQIKU6kTsSRSVMetAYQw"
  },
  "NmUtVmaBoO2f-IdTa5RecQ": {
    "date": "4/10/2011",
    "text": "I have been eating at this location since '98 when it was called NYPD Pizza.  It is owned by the same person who is a very friendly guy.  The other employees are always courteous and the service is prompt.  The pizza here is a little on the greasy side but is awesome none the less.  Their Garlic and Cinnamon knots are great and I almost always grab a dozen of each when I order from here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jqj1iXNVyRYy48iitp6Fsg"
  },
  "TsAW1kBARKkMMD-Ho1Zk6g": {
    "date": "6/9/2010",
    "text": "Pizza was so so. Charging 75 cents for drink refills after spending $25 is a bit ridiculous.  Surely there are better pizza places in Scottsdale, unfortunately, we missed them.  Save yourself on this one - keep looking for better.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hl73Al357Vuma-QkW31GMA"
  },
  "jrv9TyVHb3Q9OJdeVALzhw": {
    "date": "3/8/2011",
    "text": "Great neighborhood family pizza place.  Good food and friendly service. We will definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jCMBEV88pEHwoKANl9dMyg"
  },
  "6Qhzf7amQzLF0zYw2axiCg": {
    "date": "6/6/2011",
    "text": "Great Pizza!  NY style thin crust.  They get the doe right.  Clean and polite staff plus great food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zbl-p0FVGy88XS4rub6BnQ"
  },
  "FaUep4I7Qj-hh3A1nC7fwg": {
    "date": "9/7/2008",
    "text": "I challenge you to find a better slice in town.  Seriously, this is better than the pizza we've had in NY.  The cheese, crust and sauce become one.  The crust is to die for.  When ordering take out, the car is filled with such an amazingly appetizing aroma that I can barely wait to tear open the box as soon as I walk through the door.  Eating in the restaurant is equally pleasurable.  The restaurant is super clean, the staff is very friendly and attentive and the owner is the real deal.  If you love low-key places with awesome food and great service, you should definitely try out Yo Pauly's.  We live 20 miles away...but it is always worth the drive when I'm craving pizza.  The wings are good too!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "M4tENbg6oHnNOZWHipRgfQ"
  },
  "bgYCTit4e9MzVvlLGcZVog": {
    "date": "7/13/2009",
    "text": "More people really need to know about this cute little restuarant.  They have the best Ziti I have  ever had and the portions are HUGE.  My boyfriend and I will order one serving and share it and still have a bit left over.  I recommend adding the chopped meatballs.......so good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "gp8QXcOgSK2fJryCXrpDug"
  },
  "P6I5sYAc-zHw6b5sP_Bvaw": {
    "date": "7/24/2010",
    "text": "Best NY style pizza in the Phoenix Metro.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ieIPsyIpYWZAncuWcP78Sw"
  },
  "Kk6Tc0_88C0U_gCpt1k26w": {
    "date": "2/18/2010",
    "text": "My favorite pizza, super calzones. But the BEST are Pauly's Astoria Wings, yum-a-rooski with oregano and a hint of lemon. Delicious!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bV6PvsDHr6SZiYs22Zoo1A"
  },
  "RWQtW18KQdWpbNgrOn89gw": {
    "date": "9/25/2012",
    "text": "Oh, Phoenix, when will you deliver me to my pizza nirvana?  Not today, it seems.  After moving here from the tri-state area (CT, NY, NJ) in June, I've been relentlessly pursuing pizza hoping that something, ANYTHING, would hint at that sweet, sweet taste of home.  In the tri-state, hole-in-the-wall pizza joints can be found more frequently than gas stations (as in, more than one on every corner), and knock the socks off of what you Phoenicians like to call \"pizza.\"    I digress;  I tried Yo Pauly's because I saw garlic knots on the menu.  Surely, any pizzeria that has the staple food of Long Island on its menu must know how to make a good pie.  Wrong.  Yo Pauly's is merely a shell of a NJ pizza joint;  all (stereotypical) show, without substance.  The dough was bland;  sauce, tasteless; and cheese... well, it's cheese... but still wasnt all that great.  You see, pizza joints in the tri-state are heralded as the go-to quick spot for cheap, quality meals (all pizza places should be judged as such).  Yo Pauly's isnt quality and it isnt cheap ($8+ for two slices and a soda).  I guess you could go here if you want quick...   To \"Pauly:\"  Take a trip to Long Island (I know you have the $$$, based off your prices) and go into the first pizza joint you see.  Order a cheese slice, grandma slice, and some knots.  Come back home, ditch the stereotypes, and do your best to come close.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ex8GDBZUnf1_vCUQbp6FTQ"
  },
  "PWEbrtuR3RfdIRuP54fBXQ": {
    "date": "8/8/2014",
    "text": "Terrible customer service.  I ordered 3 pizzas with soda (almost $90.00 tab) and the delivery guy brought no cups, ice, plates nothing.  Called the restaurant, got no apologies, took them over 20 minutes to bring the items that should have come the first time.  The pizzas were not hot when they arrived and of course cooled even more waiting for the cups and ice.  The guy who took my order made all kinds of promises how great things would be said he would call back after we ate our meal to see if everything was ok.  He could care less, never called.  You can bet I will never go back.  No way were the pizzas worth 3 times pizza hut or other stores.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "ydR5Pj0FHM73iCs0LTJ1uw"
  },
  "Z5UoVyI-HDeW5xKKNGGwZQ": {
    "date": "7/9/2013",
    "text": "We had a little bit of a delivery issue the other night and the owner not only called us to apologize over the phone, but when we got there, he came out and apologized and more than fixed the issue. GREAT CUSTOMER SERVICE! And the pizza is always the best! We highly recommend Yo Pauly's, you will not be disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zngK6fa1hScQp3j3rVUXKg"
  },
  "tW7B6a6W3zG5ooty5Q35Rw": {
    "date": "12/30/2012",
    "text": "Mediocre pizza, but good enough for when we are too lazy to pick up our favorite, Grimaldi's. They have always delivered to us, but for some reason, Pauly was having a bad day and was in an extremely bad mood last night. He told us he wouldn't deliver to our address, eventhough they have always done it. I was so confused. I'll stick to Joes Pizza for delivery from now on. Yo Pauly, due to your cockiness and rudeness, you just lost some pretty cool customers. Buh bye.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4tkEmV-hPA21NyiXEIouPQ"
  },
  "1V7vEP3ehJpMGowtZ6OYQg": {
    "date": "8/29/2011",
    "text": "Customer service does not exist like this anywhere these days! Pauly really goes above and beyond to make sure he's doing business well!   The pizza was FANTASTIC - thin, crispy, gooey... perfect! And it was really quick! We didn't even have to wait very long!  The place was really neat -- it was small and comfy with a fun \"Italian-in-New-York\" vibe! He even had Rocky playing on the TV in the corner!   Some of the best pizza we've had in a long time, and hands down the best customer service we've had in YEARS!  Thanks Pauly! We'll definitely be back!! :) And we will definitely be recommending this place to others!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VvZo_KT5pp7AFn_dZJTd_Q"
  },
  "A8og19MSTj9w0AXGmaJ29w": {
    "date": "11/29/2015",
    "text": "Just found this pizza spot and I'm so happy I did! My boyfriend and I had the \"Godfather\" pizza and it was delicious..highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "392Z3foD2-XY0o8Fs4kYwA"
  },
  "UHC9O6-xWMOle2nrDrPi_w": {
    "date": "8/1/2011",
    "text": "Ordered a pizza from here the other night, seems like I have found a good place to compete against Grimaldi's...  Pizza came quickly and was delicious... A little on the expensive side... The thing I like about it is that it seems very home-made and not part  of a repeatable equation like Grimaldi's...   I will be ordering here again, no doubt about it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ZWHjoWFFWBV1C1J8KqKmw"
  },
  "8xHCojpggr36HcNf4T9yhg": {
    "date": "3/10/2011",
    "text": "So I got the chance to go back and do a full pie, salad, and cheesecake.  Alas, while the service, and owner were wonderful [as before]  if I have to get pizza, I will stick with Grimalde or NYPD for now.  Still have to visit 3 other high end pizza places, in Phx.  All food tasted good, and service was excellent, but can not do 4 stars, as its not GREAT.  Still very good, however.  Rocky on the DVD player was amusing!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RcRUF3EnoWWQysAHQNn6fw"
  },
  "EFxHBDHhX6ADTCyA5_KQ5A": {
    "date": "4/5/2013",
    "text": "We came here in a group of 6 at 8:30 (which is right before closing) and they gave us great service! We ordered a Sicilian pizza and wings an it did not disappoint. Not only was it delicious, but we were all stuffed after the meal (and we're a bunch of big boys). To top it off, the owner, Pauly, gave us an order of garlic knots on the house! Truly great service and exceptional food! Definitely recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l1nqw7-0a9480ifudwfL-Q"
  },
  "v88wL4B80YjAFcl3TSzfbA": {
    "date": "8/2/2015",
    "text": "Only been here once but will definitely be back! Pizza and cannolis are amazing! It's a family restaurant and Pauly, the owner is very personable!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dMz8ZOpUKhq1TshlRHW5Jw"
  },
  "iZNhbBfzJHTY49iGreD_SA": {
    "date": "2/9/2012",
    "text": "Mehhh. I love pizza and I love NY style pizza but this place just didn't do it for me. My slice was kind of floppy and on the cold side. I didn't think the sauce tasted particularly flavorful and would have liked a little bit of a crispier crust. The lunch specials didn't really seem all that special, $7-8 for an okay slice of pizza and a small salad isn't much of a deal. The garlic knots were pretty good, but seemed a tiny bit on the stale side. I much prefer Streets of New York Pizza for lunch when I'm around this area.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "O7ojHP59iSi32uhEDUR44A"
  },
  "z2fWRXAK-JEQ-3Ldgm3qsg": {
    "date": "10/27/2010",
    "text": "My new favorite pizza: The Godfather, seriously pizza is my all time favorite food and after my boyfriend started working near Yo Pauly's, it has become mandatory for him to bring it home once a week.  nice ppl, clean place. Its more expensive than your local Pizza Hut or Dominos but WAY worth it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cJMaKn8XpZG0nfAOu2sjvw"
  },
  "8fp2QaRlsfrwemwvKmb5ig": {
    "date": "9/2/2012",
    "text": "Hello to all of my fellow arizonians and visitors!  As always I will mention that I am the pickest person I know and detest spending good money on bad food....and with that, here's my opinion of Yo Paulys.  I have ordered 4 times now and I gotta be honest, the first time around I wasent too impressed but saw a great deal of potential.  Lets start from the moment they answer the phone, If a very personable guy answers and calls you \"dear\" then I believe its Pauly? or the owner.  Who doesnt like to be schmoozed a little! lol  He was very helpful and took time to answer all my questions.  We had an all meat pizza, Not my choice (but the hubby likes the meat).  The pizza was a bit soggy and just not fantastic, although he did throw in some yummy garlic knots.  A couple of weeks later I tried again and ordered a pepperoni and mushroom pizza and was completed delighted!  The crust was a little soft and doughy but not too much so....it was perfect for my taste.  The pepperoni was very tasty and the mushrooms fresh ....but the Cheese.....the cheese was creamy very tasteful and generous.  Overall I was very satisfied....but wait....not so fast!  I tried again just to make sure It wasent a fluke.  This time I ordered a White pizza (I know it has a real name) and since I am not a sauce lover I found this to be an AMAZING pizza!  The ricotta added a delightful rich flavor that complimented the roma tomatoes and the pizza is my FAV so far.  Tonight we tried again and stuck with an easy choice, half sausage and mushroom and half pepperoni and mushroom and again, it was a great pizza.  So thats it in a nutshell....I think this is a \"must try\" pizza joint and would love to hear your thoughts.  And as for you PAULY.....keep up the good work.....4 stars from me is a raved review!  As for the rest of you out there, give it a try and I hope you in enjoy, and until then.....  Bon Appetite'",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "euGnsP66zbvc2pfgxeBSGQ"
  },
  "eLLh1udmJ89Yz46MJEbGVQ": {
    "date": "4/27/2013",
    "text": "This was my first visit to Yo Pauly's.  I ordered the chicken parm, Margarita Village and the Whitestone Bridge pizza.    The dough was excellent.  Cooked just right, not too soft, not too crispy.  Toppings were good not great.  The fresh tomatoes were bland.  Need a little salt.  Cheeses were just OK.  The chicken parm was tasty, but not outstanding.  Sauce was a bit acidic, more like tomato paste.  I like a smoother marinara.  I'll give it another try.  Maybe order something else.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3yyWwC1NSgJLvrv-kD96qQ"
  },
  "UvH_ctV5cQiq45vjWeNtAA": {
    "date": "7/28/2013",
    "text": "This was our first time to Pauly's. We're from back east and haven't found many great pizza places in AZ but Pauly's ROCKED!! The pizza & wings were awesome! Perfect crust, tasty sauce, & fresh veggies! As first-timers, Pauly gave us free canolis & they were delish!! The service was awesome! Pauly was so welcoming & friendly! Would definitely recommend this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jxAQTpjTB0ntrJgA-V2y9Q"
  },
  "frwWj8FFk8uoOF0zI8yK5A": {
    "date": "1/4/2009",
    "text": "On a scale from 1 to 10, this place is a 2.  I eat a lot of pizza.......and I can honestly say it's downright awful.  It tastes like cardboard with canned sauce on it.  I don't own a pizza place & I have no reason not to be objective.  With all of the choices we have in PHX, I wouldn't recommend this place.  You're probably wondering why others voted this 5 stars and now you're reading a 1 star.  The only thing I can think of is that some of the reviewers: 1) either don't eat good pizza or 2) they know the owners.  I can't understand, for the life of me, understand how people are voting this 5 stars.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "d6xvYpyzcfbF_AZ8vMB7QA"
  },
  "ULLWFN21Xvi14s9czipLyg": {
    "date": "7/31/2011",
    "text": "Have ate there quite a few times, love the Greek salad and always get the Melting Pot pizza!! Never have been disappointed and my boyfriend likes it too, he ordered the Chinatown Wings this time (he's from Buffalo) and raved about them. Our server Melissa was very friendly, great job!",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 5,
      "cool": 5
    },
    "photos": [],
    "user_id": "neMj2M0RyIhYYfXwCl8kEw"
  },
  "zfpypE-1_REjCOjM___6Uw": {
    "date": "8/22/2009",
    "text": "One day at work, our office decided to bring in pizza for lunch, and when my co-worker walked in with two of the largest pizza boxes I've ever seen, the smell of garlic was, I will say, a bit overwhelming. From the odor, I was expecting the pizza to be excessively garlic-y.   However, the pizza was hot and delicious, with a nice balance of cheese and sauce. The crust was nice and chewy, the way I love it. It was a bit lacking in the topping department, though. I know I had some salad as well but I don't remember anything about it; take from that what you will. I think the garlic I smelled was from the garlic bread they threw in (I didn't try any but the consensus was positive). I guess we ordered enough food to warrant some coupons, because they gave us a bunch of free slice coupons.   Having enjoyed the pizza we had ordered, I decided to swing by one afternoon about a week later to redeem my free slice. I had never been to the restaurant, so I didn't really know what to expect. I walked up to the counter where a deli case was filled with slices on display. These slices did not resemble the pizza I had eaten the previous time. They had obviously been sitting out for a while and had a sad, grayish hue. I didn't see any cheese slices in the case, though, so I crossed my fingers that my slice would be somewhat fresher. The slice I got was (thankfully) relatively fresh, but it still wasn't nearly as good as the pizza we had in the office.   If you are planning a trip to Yo Pauly's, I definitely suggest ordering a whole pie, since you'll get it fresh from the oven. The slices, on the other hand, are somewhat of a gamble.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "HhRm0GQPhn88gN_1oAeRJg"
  },
  "YuywGsLQ6fA2j21c4R2Wng": {
    "date": "9/10/2008",
    "text": "Yo Pauly's is the best! I felt like part of the family after being there once.   It's like taking a step into NYC. What you will find here is friendly service from a real New Yorker, either Pauly or JT, a mural of New York on the wall, a few tables and  a counter displaying pizza-by-the-slice, cannoli and garlic knots.   When I asked JT if the meatball sub was any good, he replied \"i never met a meatball that I didn't like.\" This is absolutely the case with their meatball sub. There is no way to describe the marriage that happens between the cheese, sauce and bread. It is truly delicious. The same phenomenon happens with the pizza.   If you like NYC pizza joints  you'll love this place.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "-dVy4QOJOKzowC5WTc6cyw"
  },
  "EW7fwXPVEPVQH3Z3y9WmvA": {
    "date": "12/24/2009",
    "text": "Yo Pauly's is the closest I've found in the Valley to \"northeastern\" style pizza (i.e. NYC/Boston-non-PizzeriaRegina style) that I've found.  I have to admit that I'm not crazy about their entrees, and I've tried several of them, so I'd stick to the pizza.  The owner is (mercifully) not a Yankees fan - he's a Mets fan, so that's good, and he's very friendly in that Noo Yawk way.  As others have said here, it's really not a place to sit down and a quiet meal, it's definitely geared for takeout.  Glad to have a decent pizza place just down the street from me!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "I21VUcLDfPh8_Gg9spiFEw"
  },
  "puMAYPiiEd0ziiH-ORLO7w": {
    "date": "7/12/2018",
    "text": "This was really good pizza! grabbed it to go when staying at a nearby hotel. Amazing flavor. Wings were not the best, but we like them really crispy.  Inside had a super cool vibe. Totally wanna check it out and dine in sometime too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ppZVs6Dg9z6pYU-_lWxWIQ"
  },
  "vSDY2qaZBhl36s5lSMbboA": {
    "date": "3/9/2019",
    "text": "My husband and I were in the area wanting to try a new pizza place. He googled one, and this is the one that caught our eye. Such a nice environment, nice and friendly employees. We got the garlic knots.. DELICIOUS! The pizza, AMAZINGLY DELICIOUS! The flavors were just right, and the crust was the best of all! My husband never eats pizza crust but this one he ate. So soft, yet a little crunch to it. You MUST come here to see and taste yourself. HIGHLY recommend this place!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gBYwQMs7hhl4kY8Mi2ivkg"
  },
  "Yf751msFodWjRn8Eo95x8w": {
    "date": "3/22/2019",
    "text": "Really good pizza. Entire family loves it. Fast service even on Superbowl Sunday when I saw some guy order 50 pizzas for his work colleagues. They still got my pizza and wings done within 15 mins of the promised time. Simple but good food. Consistent. Have been here several times dining in and takeout. Always good.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "CRI9pS-F4wMxLhzyGUel7g"
  },
  "l0DbuOL--n-bQK6cnQQwpg": {
    "date": "4/20/2018",
    "text": "YO PAULY !!! WAT YOUS DOING !!!!   LOVED this place very much a NY feel  Great staff, garlic knots to die for and great NY style pizza. if you want thick crust GETOUTAHERE.  Its not a real Italian or NY place if they don't have canolis, THEY DO CANOLIS and they do them well, get 2 one is never enough.  Thank you Yelp for helping me find this place while out of town.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "NrB-XGbjBEkZ7sEMSzOAMQ"
  },
  "hOQ3VteDY8Xs6XMBov22yA": {
    "date": "11/4/2018",
    "text": "I have to say this is the First place that comes close to New York pizza and I have tried 7 different spots. I was beginning to use hope. It is a bit pricey because manhattan pizza is only 16 dollars for a large cheese pie. The place is nice and the guy that answers the phone is always up beat never rude which is awesome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "42bXFktJTMyuPV3zjR_LFg"
  },
  "13kXiXCAYwzYxKXyZZRM7g": {
    "date": "2/27/2018",
    "text": "Wow....it's been over four years since I dined here, so gotta get back here more often. Just was craving some NY pizza and this place does deliver on that food item. They warmed the slices in the back and I could easily fold my slices. They do have oregano on the tables, so that is basically the difference as in NY they sprinkle that spice on the pizza for you. For two slices of cheese and a soda it was about six bucks. Good to know that I can get a decent NY slice anytime (except between 2 and 4:30pm), so Pauly is the real deal here in Scottsdale.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "8GbpGeA7ZVYng3Ug3Zzb6g",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States. Two slices",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8GbpGeA7ZVYng3Ug3Zzb6g/o.jpg"
      }
    ],
    "user_id": "ELcQDlf69kb-ihJfxZyL0A"
  },
  "I6Xhk89ZDahQoL3q282NWQ": {
    "date": "6/14/2018",
    "text": "Back home pizza.   Like being back in Brooklyn.  Get a slice and you are on Roebling St 1968!  That's in Williamsburg near Marcy ave and Broadway under the El.   Family place small and friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aPcru5PhDKyNR3vWfFQDsg",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aPcru5PhDKyNR3vWfFQDsg/o.jpg"
      }
    ],
    "user_id": "q6zNmRAEvji1Yx_uI-kuog"
  },
  "24yerTVXrnuX4v4eekBvZA": {
    "date": "12/9/2018",
    "text": "Great local place. Pizza is fantastic. True NY style. Crust is great. Owner is a Michigan guy. Love this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LKmYGetWzVZ09MXJ9eAzPg"
  },
  "if0701Z3saXZgKhhCEg9oQ": {
    "date": "3/6/2019",
    "text": "this is truly a nyc style pizzeria!!!!! the food & staff is top notch. mr. anthony gave us outstanding service & the pizza and garlic knots are........fo get about it...........!!!!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "AMm4XGNYTV1ru2Or_eKJmA"
  },
  "ccvI6hhoKsLs4VQ9yxcVeg": {
    "date": "9/7/2017",
    "text": "Staying near Yo Pauly's while our AC is getting repaired.I couldn't stand the thought of Pizza Hut or Papa Johns again. Real NY Style pizza, Let's give it a try. OMG! So good. And huge sliced. We tried Ziggy's favorite. pepperoni, sausage and basil..My husband was impressed and he's a hard sell so we WILL be back!! Antipasto salad and garlic knots. garlic knots were kinda burnt, so I'll skip them next time. But they in no way took away from the delicious pizza :)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "h2AML5vaZ_YNAnS_Q1oraQ"
  },
  "LkiszgGiow_tOGJi4HqWCA": {
    "date": "9/3/2017",
    "text": "I love these guys and I love this pizza. I try not to throw around five stars willy nilly but Yo Pauly deserves the five star treatment because I feel like I get five stars from them.  Friendly service, delicious pizza, and always a good time.   The space is small but the pizza is big. I mean big! The 24 inch is what you want when you have a crowd to feed or when you are trying to feed your emotions, not that I've ever done that.   I haven't even tried their other menu items because I love this slice of New York so much. But eventually I'll try something else and get back to you ...",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ha9HcZOC9N0fX4OiM6ElHQ",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States. Look at it! Da Mid Town Meltdown. So good. Perfect for folding and stuffing your face!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ha9HcZOC9N0fX4OiM6ElHQ/o.jpg"
      }
    ],
    "user_id": "YnGa16TSqBCcQyJDm9PIuA"
  },
  "3VGtI9FA4yBl4cbTh1ZAog": {
    "date": "4/28/2019",
    "text": "We go to Yo Pauly's to kick off our summer vacations every year and we love it. We've tried a little of everything and have never been disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l5qeX7FjGIg9YDA6ycO6EA"
  },
  "TInBbCJOgBC7SQlfIin1dg": {
    "date": "4/15/2019",
    "text": "I'm from Long Island and this is the only real NY pizza in town.  A few other places try but nobody else comes even close.  I crave this stuff all of the time...can't get enough!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wbjXL9usi7MkJelwVbVeFw"
  },
  "Jeq76-Binop6lebu2Oxh1w": {
    "date": "10/11/2018",
    "text": "Seriously the best pizza joint around. Their lunch specials are amazing and you can even get a punch card and work your way up to a free lunch. This place has ruined all other pizza for me. Nice staff as well. One you go yo paulys you can never go anywhere else.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "zxGnQ0RnM7rlHsB5j1GlhA"
  },
  "0N0-MpY9wqPOYyHIEDaapg": {
    "date": "2/13/2018",
    "text": "Awesome food!  I thought I was in a pizza parlor on Long Island! Calzone was fresh dough , was perfect!  My slice was just how I remembered it back home!!!!  The service was great!, David made us fe like we were coming there for years!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "HiV6ZLtwC_oNexSmzno8GQ",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HiV6ZLtwC_oNexSmzno8GQ/o.jpg"
      },
      {
        "img_id": "PJ4iclWP1kEt3JpszqOtjQ",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PJ4iclWP1kEt3JpszqOtjQ/o.jpg"
      }
    ],
    "user_id": "4lfZBEo3uUfyaRnMYSpRFw"
  },
  "_d-WO49oW6DZzObAPrjbhw": {
    "date": "3/26/2018",
    "text": "Total dive spot and it's got some very good pizza and amazing meatballs.  The guy working the counter is probably 30 and not the best at customer service but nice enough.  Fantastic meatballs and the 2 slices I had were some of the best NY style pie around.   Considering it's literally next door to the best Italian join in AZ that's impressive it's doing so well.  Order your pie well done IMO.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m35ODBrr76JYr20nxoMg_w"
  },
  "2rtIAmROyxbXEqZMu-nTHA": {
    "date": "2/15/2018",
    "text": "First time in tonight. I was looking for a great pizza and I followed the reviews for this little hidden gem.  The Pizza was made with TLC using  High end ingredients. Hubby and I enjoyed with extra left overs.  Everyone is super nice.   I WILL be back.  Thanks for delivering the pizza to my trunk.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zFilldFT_xzPHw4s7Bip6w"
  },
  "vXHwQUsD5XD4e082YgSf2A": {
    "date": "11/21/2018",
    "text": "Delicious sauce and chewy crust. Busy night yet great service! Thanks for the complimentary knots , best pre thanksgiving feast ever!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SEzxANOIIq7t2J04scaULQ"
  },
  "eqG2ov-IewoD_lvSl2K3hw": {
    "date": "10/3/2018",
    "text": "Stopped in for a bite to eat. Left stuffed. Great pizza, great service. 5 outta 5 for the complementary garlic knots; which were delightful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7BUvGUx_AAUTjwsQFTEhuw"
  },
  "Jltfxp1mkdPFh2KZ-6ClIw": {
    "date": "8/31/2018",
    "text": "I was craving NY pizza the other night, so we came on Yelp and Yo Pauly's had the best reviews. We decided to give it a try, and I'm glad we did. My fiance went to pick up the pizza, and he said the staff was so friendly and greeted him both on the way in and on the way out (I love that!!). When he got it home, it was love at first sight for me...the pizza looked amazing, and it tasted even better! The garlic knots were perfect, too. Even my son, who is the PICKIEST KID IN THE ENTIRE WORLD, and who is even pickier with pizza...loved it. He even had seconds and extra garlic knots. I have always had trouble getting him to keep weight on, so I guess we'll have to have Yo Pauly's more often! It was all around great! Thank you!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GghgeSF0Infg9i-DRxedFg"
  },
  "pjArWouWTK3loqsU4Aeg8g": {
    "date": "12/29/2016",
    "text": "Hands down, Yo Pauly serves the best NY Style pizza in the valley.  Even though their crust is perfect, and the toppings are plentiful, its the sauce that blows me away!   Much Love Guys",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7QLQd9itlwHgJ0fYg51KJQ"
  },
  "7E4aBylvBGHXrKJBEmMMJA": {
    "date": "11/20/2017",
    "text": "Great Pizza.  Try the Brooklyn.  We have had it a couple times.  It's great.  I've called in orders and they are always on time and helpful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EWaNxeT8sPHISFhRHGJ2Yg"
  },
  "4UH9voVXriaWVDZfvsA2eA": {
    "date": "2/17/2015",
    "text": "Pretty freakin good, and huge portions.  I'm from the east coast, and this pizza definitely has authenticity.    We order the Cheese Louise.  This is real pizza with plenty of cheese and sauce, and some weight to the slice.  This isn't some fancy, tiny gourmet pie with odd, scanty toppings (not that I don't also love that).    Watch out for the 24\" pie - it's enough to feed two grown adults for several days and the box barely fit in the car (check out the photo if you don't believe me) - the plain is a phenomenal deal for like $23!  I might go a little smaller next time, but if you have a party or a huge appetite, it's really THAT big!  We also got to try the garlic knots, and they were super delicious - treat yourself!  Next time, I'm ordering the Not So Whitestone Bridge pizza - sounds amazing!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "-dEFzn6__TkRF9Ozo-_BGw",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States. This is how 24&amp;#34; pizza fits in a jeep! It&amp;#39;s a lot of pizza!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-dEFzn6__TkRF9Ozo-_BGw/o.jpg"
      },
      {
        "img_id": "n8Fos0HoEUPvVr9f2pcY_w",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States. 24 inch pizza - enough pizza for a week and it&amp;#39;s delicious! That&amp;#39;s a full dinner plate being dwarfed by a slice.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/n8Fos0HoEUPvVr9f2pcY_w/o.jpg"
      }
    ],
    "user_id": "xR4engcg6Vm8xToBgKI5FA"
  },
  "TNXRHERDl8PiW1gFkmXFRQ": {
    "date": "11/17/2017",
    "text": "I do not order delivery-chain pizza any more! Can't do it knowing this amazing option is available. Their pizzas are AMAZING! Tired of the typical pepperoni or veggie? Try their White Stone Bridge Pizza and bask in its astounding flavor as you say goodbye to all other pizza restaurants. YO PAULYS IS PIZZA, PERIOD.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bzX-LxPoAgqL_7RJYrgGQA"
  },
  "lp-z81xuTM0Osuk6H2zcOA": {
    "date": "10/3/2017",
    "text": "Place was good not great but real good. Wings where just ok but the pizza was good owner came out was very nice and the service was great. Not the best but real good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6iLMVC8lL_vYCE9UxPfvAQ"
  },
  "ummfjppSRSUBAEtaDAo9wQ": {
    "date": "11/4/2017",
    "text": "The pizza is really good. NY style, not too greasy (a little grease is good) and the crust is firm but not dry.  The problem is the wait: they always take at least 30 minutes for a pizza, even for carryout. This week it was 60 minutes for pickup! No thanks.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2C2wHU2z5hGavTTP6p6-pQ"
  },
  "k0iUpwdfxQ_BlLBKUqJS0g": {
    "date": "10/29/2017",
    "text": "Had pizza at this small but really cool little New York style pizzeria. The server was excellent, Tony, and the pizza is unbelievably good. Next time we go to Salt Flat Field we are definitely going to Paula's. Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aTJazTQhmdU16G6TaYli6w"
  },
  "ZFaw6w_dQSoKpM9LsodWoQ": {
    "date": "9/5/2017",
    "text": "It took a while but I finally found great pizza by the slice, New York style, in the desert.  Very casual spot, everyone there is very cordial and efficient.  Will have to try their sandwiches next time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GA3FcrYg6Co2DSvx-p8j7g"
  },
  "ZT0Vdt71uA4yff2xp4sCAg": {
    "date": "9/18/2017",
    "text": "It's a great spot and the pizza is the closest to New York since I've moved from there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LMTX7TCYzy8cPADxFQgBNQ"
  },
  "EZZvPZEKOWgWESLsxm8RXA": {
    "date": "9/11/2017",
    "text": "What a great find! Wonderful staff and a big thanks to Mike. Garlic knots are fantastic and seriously wonderful New York pizza. We will be back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rjBbC_jMXYJ4mO66cIiA1A"
  },
  "HUCuWauQatCApyqV44h5lw": {
    "date": "5/18/2018",
    "text": "First time take out. Cheese Pizza good, meatball sandwich, fantastic. Service was awesome. Will be back for sure. If you are in the neighborhood please check them out, you won't be sorry.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cZFHLeRdpptd8JuSQZ1uCA"
  },
  "Ex6TfR1ZHzsDWsNrBxFwaA": {
    "date": "5/27/2016",
    "text": "This place is gem. I'm so happy we found this place! Exactly the type of pizza we were craving.  Their food is BOMB! Antipasto salad is loaded, marinara sauce is so flavorful and the pizza... THE PIZZA!!! BOMB!! We ordered 18 in but can't wait to try the ultimate 24 in pizza. It'll be humongous piece of heaven.  Will be returning to this place for sure.  So so yummy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lztAp-TEGLjaVmXVfF7G4w"
  },
  "-fn4WytJYWsvEE4Aj4y8bA": {
    "date": "3/20/2016",
    "text": "Tried to get a delivery tonight. The fellow who answered the phone stated delivery was no longer available. They were changing some of the services offered.  NO MORE DELIVERY?? Really??",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "fOlaB0zVwj6gn2YtnDZCkA"
  },
  "btk4NHOr7y1ALQT0uQMZKg": {
    "date": "11/2/2017",
    "text": "Exceptional. Super friendly staff, and the most authentic ny pizza not only in arizona, but that I've had in probably over 15 years living from state to state since born and raised in ny and nj. Reasonably priced, once you factor in how large the pies are. Will visit again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Ft0HhzBP-iknnHt-PFX8g"
  },
  "spSA-6qeCR24smK1rIGKMg": {
    "date": "10/16/2017",
    "text": "Some of the best pizza I've ever tasted in Arizona. Plus great friendly service and a nice atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E-2dT3WOGyeZeYK-dv8z9g"
  },
  "B298R4P3Vgp-4Dwxkd9aAQ": {
    "date": "5/1/2018",
    "text": "Great pizza place!  Very friendly and good pizza. We visited it while in town and have saved it to visit again when we are back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9UXCNrP-M3IbQYvEJ84cjg"
  },
  "xC_BD7NpseGI8xRHASueGQ": {
    "date": "3/9/2017",
    "text": "The best pizza I have had in 12 years  since living in NY. Authentic and delicious and great beer specials. Can't go wrong with anything here. Add on some garlic knots and peronis",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "U5dWYklsu7fmvmWbJXBZxA"
  },
  "sDUjarbhNTrIrv37dRZNGQ": {
    "date": "5/16/2017",
    "text": "Paul has been making pies and great food for over 25 years. Truly a great place to go!!!  He will do what ever it takes to make your experience great!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yEdUymEjTwSNZyxuPiXpjQ"
  },
  "xgt7dK497FdJf0TVRiggag": {
    "date": "6/4/2017",
    "text": "I'm from NY, lived in Scottsdale and Vegas for a combination of 10+ years and I've got to say- this is the BESTTTT and CLOSESTTTTT to NY pizza I have ever tasted in over ten years! I waited on David at talking stick pool party and he told me this was the place to go! And he was RIGHT! Thank you so so so much! I will continue coming back here as this was our first order tonight and deff won't be out last!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O1zRC0Eso_dTvhmxDykRTA"
  },
  "3CTsBYGLOmst4s1owsLL_A": {
    "date": "3/9/2016",
    "text": "Yo Pauly's is so. le. git. A solid Pizza Friday (or any day) choice!  They're always super friendly when on the phone and when we go to pickup (haven't dined in yet--it's right down the street and I prefer yoga pants in my living room when I'm drowning myself in pizza and wine after a long week.) and the food is FANTASTIC.  We've only had three things on the menu, but those three things keep us ordering the same over and over again: Margarita Village pizza (charred crust, perfect toppings), Jimmy the Greek salad (perfect combo; but be warned: a small size is ENOUGH for 2 people.), and garlic knots (perfect little bites of garlicky goodness with super tasty marinara for dipping.) Not going to lie: the leftover pizza is just as amazing cold the next day as it is fresh out of the oven. Get on it.  So happy to live in close vicinity to Yo Pauly's!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sJX-ZcPQbXF8NgPzI-cutQ"
  },
  "DA1EdkwZpjVaQVy8i0vi1A": {
    "date": "9/14/2018",
    "text": "Let's put aside the fact that the hospitality is beyond amazing; we'll get back to that in a NY minute...  First, a literal quote from my ten year old step-daughter, \"They had magical meatballs, awesome pizza, and 'real' cannolis\"; mind you, she only knows what a \"real cannoli\" is because I am her personal advisor on all things NY. I'm not gonna argue with the kid on this one though. Only one word can describe the slices of cheese I experienced here: Authentic. I've searched the Valley for something even somewhat \"close\" to a real slice of a cheese pie, and thank the Lord, I have found this hidden gem in good ol' North Scottsdale. I almost hate to rave about how fantastic this place is because I don't want to see it over crowded; however, I'll take the chance to ensure that this local business stay open for a long, long time to come.  Now, let's talk atmosphere: perfection. We were immediately greeted and invited in as if we were distant cousins coming in for a weekend. Originally from Long Island, I often crave the little Italian pizzeria that you'd see on just about every corner back home. From the red table cloths, to the street signs, and pictures of the City sprawled around, I fell in love with this restaurant. I want to give kuddos to the guys working there tonight. They were just the best. I don't want to refer to them as employees or staff because they were more than that. You could tell they were more than financially invested in the joint; they loved what they were doing. You could see that they were proud of their product and their home away from home. These guys are the real deal!   While I wish I lived closer so I could stop by more often, I am thankful I don't because I'd probably be here everyday for a slice. Seriously. Every day.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "OqKhkGXKlzMY4TDjXnEh0Q"
  },
  "sB9muGBqt_Y-F3EJEk14lA": {
    "date": "5/13/2019",
    "text": "A shout out to Dave (one of the owner's) who stepped up to the plate and corrected a glitch for a past experience of mine.  My recent experience was one of top notch food (pizza and wings) that were truly amazing and the quality which I have become to expect and appreciate over the years.  I tip my hat to you Dave and your excellent establishment......I'll be back !!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "anU9K14BH9R2R3ClItj8gQ"
  },
  "Da-kJK9MI2mp7iEVMLpfbw": {
    "date": "3/22/2019",
    "text": "Crust was burnt and overpowered any other flavors of the pie. Thin crust? yes. Crispy crust? yes. Delicious? no. The sauce and cheese were bland and toppings were tired and not savory. They also have a very limited selection of pizza by the slice. If you get there for lunch before they close at 2, they may only have 2 or 3 different kinds of slices available. In terms of taste and super variety, Slices on North Tatum Blvd and in the Tempe Marketplace is far better. Btw, the operating hours posted here are incorrect. They shut down completely and lock the door between 2 and 5pm. And one more thing...take a tip from Tony Soprano...customers don't want to hear you talking, singing and joking...they want to eat their food in peace.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8zvoABdUO8RXM-CUvpp7iw"
  },
  "cH7YY8SktmvTUayVrU-BkA": {
    "date": "5/12/2019",
    "text": "You want \"Authentic New York Style \" this is the place in Scottsdale, AZ.  My comparison of nine surrounding pizza places all left me saying \"Yo Pauly's beats them all\".  I have had the opportunity to travel the U.S. and this pizza is great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PIf_5ekb2UJNmxJvVbFbiQ"
  },
  "krQHvyN5OLa2nHh4-vN3sA": {
    "date": "3/8/2019",
    "text": "If your are looking for pizza ala the Big Apple, look no further. Some times you just got to have a slice. You know what I mean. I'm talkin' about a beautiful hot out of the oven slice that you fold in half and take a wonderful bite out of before burning the roof of your mouth. I burn the roof of my mouth cause I just can't wait to enjoy the amazing taste of Yo Pauly's. I can't vouch for the rest of the menu because I go there for what I'm hankering for....give them a shot-you won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "btQIR1IwKiZlZFZVfwjTmg"
  },
  "AmpAcHFVJNvit97VJCF1Pg": {
    "date": "2/16/2019",
    "text": "Best place for pizza and wings !!, the customer service is great the food is awesome and they have all sorts of lunch specials.  Would recommend too all friends and family",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "TpQEbXMifLmUhPYQkziOXQ"
  },
  "LODL8DAfdt8KBJQW29oq8w": {
    "date": "11/27/2018",
    "text": "Amazing... best pizza outside of the city.  Yo Pauly's pizza is made to order and has the qualities you're looking for in a NY pizza. Best crust,  specialty blend sauce and who can resist that epic pizza flop! Forgettaboutit! Don't go anywhere else or you'll have buyers remorse.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "msXv87kJBkMPeZI8OGBahA"
  },
  "0Ytuu3wmNKuNiwUE-_-9wQ": {
    "date": "2/26/2019",
    "text": "The closest you're gonna get to NJ NY pizza out here in the Valley hands down. These guys know what they're doing. Hell of an operation. Love going here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "U7qVOus3WpcLjTNAmXBNWA"
  },
  "mxQXfpnN0NdpATh8sZWbLw": {
    "date": "7/15/2018",
    "text": "Visiting from LA and craving pizza. Read the reviews and gave it a try. It is a small hole in the wall with yummy food. The owner was from NY,  friendly and gracious. Because it was our 1st time, he brought out garlic knots with marinara sauce (nice and tomatoey). We split a dish of pasta and a small pizza. The pasta was brought to the table already split into 2 bowls!!!  It was great, and the pizza was the epitome of comfort food.   Give it a try, and you will be under the spell of their charm and hospitality, as well as the quality of their food.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "7BMz7QY0s75noHKt3Mp5dg"
  },
  "E59gyRaab_vv08lc_cJusg": {
    "date": "4/18/2019",
    "text": "A big shout out to the boys at Yo Pauly's for once again making my Dad's birthday a HUGE SUCCESS! He's 97 born in the Bronx in 1922 and Yo Pauly's is his favorite place for dine in or delivery. We had the 7 pies delivered to his Assisted care place and the 20 of us loved it!  Wyat, David and Anthony are always a joy to work with and made sure the event was a knock out. Mille Grazzi!  Tommy from Yonkers",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "52kR3D4uR6pBGC4Mh3ZPmg"
  },
  "BWO60cOaFbtna2m-ACIVcA": {
    "date": "1/21/2019",
    "text": "Stopped in for a slice today. Pretty much reminded me of a NJ/NY pizza place. I'll be back for sure in larger quantities I'm sure",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "aKBe5QsCroM9C6mxxPu7AA"
  },
  "6AyVp5HIwX7uS9U0LneOng": {
    "date": "12/21/2018",
    "text": "The one thing that we could not find  and really, really missed when we relocated to Scottsdale was a True NY style pizza (Yes, I am a New Yorker). A clerk from DMV who is from Brooklyn suggested that we try Yo Pauly's. OMG.... I thought that we were back in The City!  We started with \"a slice\", in my opinion the only way to really judge if it's a True NY pizza. AMAZING!  So then we tried the garlic knots and a Margarita Pizza. Let's just say, the search is over!  While eating our pizza I overheard a gentleman raving about his pasta dish. Can't wait to try everything!  Also note worthy is the service was top notch, space was clean and the prices are very fair. If you love True Italian sauce and pizza this is a must try. I believe the difference is in the high quality ingredients they obviously use. The restaurant is casual and cozy. But, they also offer take out and catering.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "NtElo1a3uM_AD7fm-5v_Vw"
  },
  "VeSSKV3oNn_geY80XhOLCQ": {
    "date": "4/10/2019",
    "text": "Was looking for a place to pickup a quick couple slices of pizza because I had an intense craving.  Decided to choose this place and it was awesome.  The man who helped me was super nice and courteous, and the pizza was wonderful",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4vqQDGEbSW9F0Z1xAF-ImQ"
  },
  "r8d2gMmyzcbwrWU5ZZxnrg": {
    "date": "3/5/2019",
    "text": "I'm from Brooklyn, and I ate at Yo Pauly'D NY Pizza for the first time. It was surprisingly very much like the pizza in NY! I had the original cheese pizza, and it was great! One of our friends raved about their salads and \"Bensonhurst Baked Ziti\".  We all enjoyed some good wine, and finished it off with delicious cannelloni! Also loved the NY decor, really cool. Service was terrific, and I would definitely recommend it to anyone wanting authentic NY pizza.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cnmmayNAr-TypBXia1fa1A"
  },
  "KVxnnezuvAoyDIhCsJW0dw": {
    "date": "2/8/2019",
    "text": "Delicious pizza. Friendly staff. We dined in and had the free garlic knots and they were hot and fresh out of the oven. I was in heaven here. I will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "2GU6KI5-A10U8zMk6XT_qQ"
  },
  "TwwLMKr1h8TOYzTm_nIIOw": {
    "date": "6/22/2018",
    "text": "THIS. THIS is NY pizza. Seriously--this is the place. Dont even need to go anywhere else. Yo Pauly you friggin nailed it.  The staff? So nice.  and they have CANOLI nuff said.   Just Belive me. NYC resident 6 years. This is IT!!! :)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2Fkoi8qYBwDoBmKxUWMnAg"
  },
  "59wpYU__oeKcR7QRZZVqjA": {
    "date": "6/19/2018",
    "text": "Wow.  Amazing place. The pizza is great.  They have fried eggplant - and I'm sure you've never had great fried eggplant.    And the pasta is great. The penne marinara has great taste, flavor.  And fresh garlic knots right out of the oven.   And - the marinara sauce is warmer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "w_LnazdTAXb__wLqzR8Xrg"
  },
  "fICJxOD9WVAr1U1yyGeagw": {
    "date": "6/18/2018",
    "text": "Highly recommend. I read about this place in an article on the 50 best places to eat in Phoenix. I went and tried two pepperoni slices but was disappointed. However, they weren't fresh--they were reheated and were originally cheese slices, so I knew it wasn't fair to judge them based on that. I went back a few days later and got a fresh pie and was blown away. This is hands down the best pizza I've had in Phoenix. After eating top notch pizza in NYC I've struggled to find a go-to pizza spot in the Phoenix area, but I think I've found it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "MlPjXsn4Dlibp6O7xV5uRQ",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States. 14&amp;#34; pepperoni pizza.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MlPjXsn4Dlibp6O7xV5uRQ/o.jpg"
      }
    ],
    "user_id": "rKJvEf3SAxnIPk1xxYximA"
  },
  "B_y416lEHHBFYFqsFn3PDg": {
    "date": "5/3/2019",
    "text": "This was the first pizza that was worse than horrible!!!!!! Ordered the 14\" pizza and brought home for my family. Picked up just before closing. Obviously they had run out of ingredients. There was not one meatball, only one small green pepper,no mozzarella nor sauce. Basically just a round piece of dough. Threw it in the garbage and made dinner. Cannot believe they just couldn't tell me they ran out of all ingredients.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OU9qcBo7Irql_CCaqEOynw"
  },
  "5ht0RawsWCjXosXDnROamg": {
    "date": "1/17/2019",
    "text": "First time eating here and it was the best pizza I've ever had!! The pizza crust is perfect. Thin and crispy with a thick outer crust. We did the Hawaiian and cheese 24' and it was a huge pizza. You can't beat the price too for a pizza that big! The staff was very friendly and took good care of us. We took our 3 small kids and they were so helpful and made us feel at home. Will definitely be going back;)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tWGT4W1K6Y-6muaDEbA2Uw"
  },
  "7iSq32LGUyLXu78ZWLl1gA": {
    "date": "8/27/2014",
    "text": "Best pizza in Scottsdale!  Great for lunch or dinner.  Staff is always nice and their food is amazing.  Pauly is a character!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zRsShdp3QV9ugeqJLZFn2Q"
  },
  "_15MpJt-8m-AjUmdaSEL1g": {
    "date": "3/28/2014",
    "text": "We came back because the first visit was so good.  This time I tried the gyro -- OMG!!! The best I have ever had. They make their own tzitziki,  and grill the meat for a perfect taste. ..WOW!! Hubby had the lasagna,  which we figured would be wonderful based on the white pizza we had on first visit. But, we were not prepared for the DYNAMITE flavor of that marinara sauce with the light noodles, meat combo. The marinara is so fresh, light on flavor without any heavy herbs drowning out that wonderful fresh tomatoes taste. Love this place!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v0v8HZT2KnlCBMVjBn78HQ"
  },
  "rSKMZy9g43CzIPMEaSljQg": {
    "date": "7/5/2013",
    "text": "Yo Pauly's is a pizzeria.  Pauly makes terrific pizza.  You shouldn't come here expecting to get gourmet osso buco or lobster fra diavolo.  Order the pizza and you'll be very happy.  Service is wonderful and, as a New Yorker, I can say you will be hard pressed to find better pizza in Scottsdale.  It can even be ordered by the slice!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "YreDoaAL_w-YUBXWfKhrkw"
  },
  "i_WkytMggoYvkNh2JOBfeA": {
    "date": "3/15/2011",
    "text": "Wow, I was disappointed. I rolled in for dinner at 7:00 pm looking for a couple slices and a soda. They only had some cheese left and the the slices were really small. I mean like half the size of anybody elses regular slice. The pizza tasted OK, nothing spectacular.",
    "rating": 2,
    "rated": {
      "funny": 7,
      "useful": 10,
      "cool": 8
    },
    "photos": [],
    "user_id": "Zr1nDJrWUUDnGcj2e24tFg"
  },
  "CNaxcAjBnTzDTlhGo94ypQ": {
    "date": "8/30/2014",
    "text": "Best pizza I have ever had!! My boyfriend took me here and its my favorite place to go now. The customer service is awsome. Its nice to go into a place and they really make an effort to get to know you and really take care of you. I also really appreciated the complimentary canoils. Was my first time trying them and they were amazing. Will recommend to everyone. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_8qo9QG_vfmdmApJsHRADA"
  },
  "6Icx6cFDFZqHBH856-c28g": {
    "date": "4/19/2016",
    "text": "Had dinner here on Saturday evening.  Have been coming here for years.  The pizza is always delicious, food is very fresh, establishment is very clean, owner and staff extremely friendly.  A joy to be appreciated as a customer!  Never been disappointed!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yWVOL7Ay_MTk7stzXmIZ9w"
  },
  "lqRbvBNTMl8MGE3xGIImPg": {
    "date": "5/18/2014",
    "text": "We happened upon this pizza two weeks before we moved  back to California. Too bad, I spent four years looking for good pizza in this desert non-oasis otherwise known as Scottsdale, and when we finally found it, we were leaving.  Well it's the closest you'll get to New York style pizza in this part of the world.  I would recommend not ordering the extra-large, on our last night in Scottsdale we made this mistake.  The slices are ridiculously huge, and they comped us garlic knots because the pizza came out of the oven in a weird blimp/oblong shape?  Actually it was slightly burned on the bottom once we got it home.  The free garlic knots would have been great paired with pasta and salad, but not burned pizza. Otherwise I would have given them 5 stars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TlFmbWWAM39dYjl-UQPmdg"
  },
  "Lrx3a4XMx39OXg3q-kSuwg": {
    "date": "4/11/2016",
    "text": "Best pizza in Arizona- and that's coming from a native New Yorker. I highly recommend Yo Paulys to anyone in the area looking for the Italian takeout experience that I grew up with in NY",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GJ6y14Y60w6y7SfpieTr1w"
  },
  "Zy8NtlYli9JAOJ8qRJeOdQ": {
    "date": "1/11/2014",
    "text": "Got a 10\" cheese pie, wish I got a 14\" because I devoured that thing so fast!! I think I found a new pizza takeout/delivery place.  I've lived in a neighborhood nearby there for many years and am surprised I did not try this place earlier.   Being from Chicago originally, I am picky when it comes to pizza. It is hard to find a good pizza place here and often make my own pies at home.    If you love NY style pies, check it out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "khEdiP59yUCdVA58PPlH9w"
  },
  "604XEKkO3A1GOQQPhisTJQ": {
    "date": "2/22/2014",
    "text": "Pizza and calzone were perfect. We will be ordering takeout again. Delicious crust on the pizza and wonderful ingredients for toppings.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J_6akD_OC2trl90xZStRHw"
  },
  "Ic-5AUhF6OO3ykgrxyvZGg": {
    "date": "1/8/2014",
    "text": "Went back for a return visit, only to find it was just as exceptional as the first time. Takes me back home on the first bite. The crust is perfect. The cheese is delicious. Sauce just exactly right. When it comes to True NY pizza, consistency is king. Glad Pauly has it!! And the yelling in the kitchen? Now that's as authentic as it gets.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8RP-swaO2T9FTGxjAS0Wlw"
  },
  "UjudUGYQ9UDyvd0C5QqW0w": {
    "date": "7/20/2014",
    "text": "Best pizza in town ! I order from them at least once a week. They have a huge 24' pizza called the New York giant and it is monstrous we ordered it when my family came to visit from out of town and they tell their friends and family about it back home. The ziggts favorite Za is my favorite",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IUABKxUmx3x9dQe-nc97qg"
  },
  "tyF_g0XUmbxclFH7LjQxJQ": {
    "date": "7/18/2011",
    "text": "This used to be the original location of NYPD Pizza, but the owners sold it to Pauly and the food has gone downhill since. I'll stick with NYPD Pizza, thank you very much.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ox8U8eXF7KrhYmMr7D0AAQ"
  },
  "vZe4dpomOgAWpp-ToWU3mQ": {
    "date": "11/21/2015",
    "text": "My mom and dad have taken me here, and the food is delicious! His pizza is AMAZING, and the customer service is great! We love Pauly and his accent!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UO16bTutgR1ZIJTrKBUw3Q"
  },
  "sNbX4UX3cDGgZSTjfEPGUw": {
    "date": "12/6/2010",
    "text": "New York Pizza? Although I have eaten pizza all my life, I had no idea what New York style pizza was or how it was defined.  But I was watching Sunday night football,  was hungry for a pizza.  I decided to give Yo Pauly's a try, since it was not to far away.  During halftime, I drove over to look at the menu, and order a pizza.  The owner was there, and was quite helpful in my ordering. After I ordered, I was sitting reading the menu (which really extensive - calzones, salads, sandwiches, wings, dinners, desserts and Greek food).  The owner came over and offered his suggestions of menu items to try in the future.  I did not know what to expect.  I took the pizza home, without looking at it, because I was in a hurry to watch the game. Wow!!  I loved it - thin crust, delicious toppings, and baked to perfection.  I normally eat half a pizza, and save some for the following day to see how it reheats.  However, I liked this one so much that I ate the whole thing before the game was over.  Is it New York style pizza? I have no idea - but I do know I liked it, and will be back and try other things on the extensive menu.  Great food, great owner!!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "EV6-TcSMzKURTpkMKCuQww"
  },
  "mKEWp-wufPtcDEq_e0fCpQ": {
    "date": "12/22/2013",
    "text": "Best pizza in Scottsdale. Crust is fluffy and crispy. If you're looking for authentic NY pizza, this is the place to get it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OPdj80klEaMFSXzUWq34WA"
  },
  "ac5rs0Y_U1dM-dI4iHMoKw": {
    "date": "2/10/2016",
    "text": "Probably the best pizza place I've ever been. The owner is such a nice guy. He's down to earth and treats everyone like family. Absolutely try this place. You'll love it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4NC5Ez002hGZxg41GHcn1A"
  },
  "vtPqTsDEAFkX1G2r2AMo2A": {
    "date": "3/8/2011",
    "text": "WOW! The proprietor is a friendly, NY kinda guy who offers both Italian and Greek fare on his menu.  His gyros rank near to the top on my list with juicy, tender, microscopically thinly sliced pieces of meat in a soft pita topped with tomatoes and lettuce and capped with a bit of deliciously tasty tzatziki sauce.  Mouthwatering and filling, I ain't kiddin'.  We also ordered meatballs in marinara and this did not disappoint.  No way, no how.  These were by far the juiciest, flavorful meatballs and if I may add a very generous serving of three topped with savory marinara sauce.  The husband and I quickly devoured it and left not a drop of sauce in the platter!  And the pizza.  Mama mia!  Thin crust, just the right amount of sauce, generous portions of breaded eggplant.  We were in heaven!  Pauly knows how to do it right!    Head on down to visit them you will be delighted at their menu offerings, the pizzeria ambiance (fabulous wall murals), and their magnificent, tasty food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XCPiiJLYSJNCnc8fGdi7oQ"
  },
  "c2Gt37RO9jRcYdVv0dmIhA": {
    "date": "10/24/2013",
    "text": "Aa a NY native, it's as NY pizza as I gets. Crust is light, crisp bottom and chewy.  Cheese and sauce are quality.  If you like NY pizza, you'll enjoy Pauly's.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_s9NIO-sVo0FFNnLwniYMA"
  },
  "rW6U8xxsvJtM4nagmGHNvA": {
    "date": "4/7/2014",
    "text": "Went there last night as a party of 8.  Pauly and his waiter, Cal took care of us.   We loved the quality and authenticity of the food, environment and personality.  The 24 inch pizza is amazing, as is the baked ziti. If we still lived in the area, this would be a weekly stop.  I picked Pauly's because of Yelp reviews, and once again it shows I can trust consumer opinion.  I love that.  There are a number of comments on pricing.  Paying $2.25 for a giant soda with free refills, and $6 for a pizza lunch are not unusual or expensive, especially if you value quality.  If Little Caesar's is your idea of good pizza, well, this might not be your place then.    I have a very high bar for food quality, quantity, and service, which is how I define value.  This place rocks, and I'd recommend Pauly's to anyone seeking a good Italian meal and experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8MiqIYkSAb0LmqmZfIhk4Q"
  },
  "HMECSAHE_gGuR7PNYFK22g": {
    "date": "7/21/2015",
    "text": "Went here for the first time today and it was delicious! Brittany was extremely friendly! I'm definitely coming back here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gTBz3PVf6WzRO8V0KkeTCA"
  },
  "ZWFaHNyaURqgMjViNZsiGw": {
    "date": "11/28/2015",
    "text": "Sometimes the best pizza comes from the little hole in the wall places that are hard to find.    I got a takeout pizza which was quite good and ready on time.  While I was there I asked for a sample of the garlic knots.  It looks like they are made from pizza dough and these guys make excellent pizza dough!  They are really quite tasty and they include some of their tomato sauce for dipping.  If I were planning a party for a bunch of guys, I would definitely consider ordering a big batch of the garlic knots or pizza, but no need for both as the flavors are similar.  Can't wait to go back and try more items on their menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GMYrVXXxQXaxK0YqTHaaQw"
  },
  "TnKyy_n9olibl9vkTFwypQ": {
    "date": "6/15/2015",
    "text": "Didn't know they were closed from 2:30-4:30 on weekdays and stopped in at 3:30pm for a slice. We were welcomed in and served a couple a great slices of pizza. Great place and great service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GEnrf3vjFrSWgOwsZSHeDw"
  },
  "3IYebBXyq2VpUmKr65dbkA": {
    "date": "5/23/2014",
    "text": "Yuck...we ordered take out for lunch... $10.00 for a child size portion of dry disgusting lasagna....the lasagna taated store bought & old. It was very vrry dry.  WAY OVER PRICED......as for the 24 inch giant rustic....head down the 101 to the actual Giant Rustic Pizza Joint & get it for abt half the price of yo paulys & much better tasting....Terrible day old food for very high prices..lots of other choices in scottsdale to go to...avoid this one....YUCK..",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "MAmijW4ooUzujkufYYLMeQ"
  },
  "_-i3RHnbr4eov9t-YkzgTQ": {
    "date": "9/3/2016",
    "text": "I'm not one to gush but what a great place.  This is better than NY pizza.  Everything is fresh and flavorful!  Garlic knots were crusty on the outside, soft on the inside and did I mention the flavor. The staff is fun and attentive.  Can't wait to come here again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3HKl0YriGNXOGkSgzAZFOQ"
  },
  "ZK-Ru-oZEh8Vlx8v4CIAdQ": {
    "date": "9/30/2016",
    "text": "Decided to try a new pizza place.  We were looking for thin crust pizza, that would be crispy.  One of our pizzas was burnt on the bottom and both pizzas were \"floppy/soggy\".  They had thin crusts, but not what we were hoping for.  Menu stated there were chocolate chips in the cannoli - we just had a little chocolate drizzle.  Overall, disappointed in this choice.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DEJ-Y9Y269TIv01awxEBBg"
  },
  "BXD3gLUO8bBvSbwsLLzrjQ": {
    "date": "1/21/2015",
    "text": "Very impressed with the customer service, and since I was a first time customer, my slice of pizza was on the house. This is something you don't see very often. They have gained a customer for life. Brit, the manager was very friendly, and made it a point to give the history of the establishment and she truly made me feel like i was at home. And to top it off, the pizza was great. Very rarely do I encounter a place were I enjoy being at. Highly recommended this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GJse4lzagAVf9YbZ_20fXg"
  },
  "6NSVhwZesEPfBQFY5IE5Dw": {
    "date": "7/29/2016",
    "text": "Very disappointed with the sausage pizza we got last week, hardly any sausage and no flavor! We have been getting our pizza there for almost a year and mostly were satisfied.  Then tried their Whitestone Bridge pizza which was great.  Went back to regular last week and now we're not sure if we will continue going there since it was so different we couldn't believe it!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WyX7p0Q9-GEcmNWvz3i-vw"
  },
  "nfE4XPJJQS8QJAvNmWC1Yw": {
    "date": "7/1/2017",
    "text": "If you are looking for exactly the same taste and quality of Real New York Pizza, look no further! I've been in the valley for forty years listening to all the excuses, the dough,the water can't get this or that to make it the right way... all BS, this man does it! I've sent all of my NY Italian friends and non- Italians to this tiny pizza shop,and have heard nothing but the best praises and thank you from every single person . I personally drive twenty-five miles ,round trip to buy what Pauley's offers, everything is excellent, always! When you order your pie tell them that Steve the Pinstriper sent you, then enjoy the knots and the delicious marinara sauce while your incredible pie is being prepared for you. I have a hard time wiping the smile from my face every time I'm there. The people ,especially my friend Pauley all add to this experience. Sure Bianca's and Grimaldies are excellent pizza ,but they don't remind me of what was available in Times Square which set the bar. Trust me you'll love this experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_1qqZ6DO1SXdHfKYsH5bVA"
  },
  "fc7edj_o1YMkJw74a4n2XQ": {
    "date": "3/1/2012",
    "text": "Order two slices of the Ziggy's Favorite (sausage, pepperoni and fresh basil) with a side of marinara...fuggedaboudit..you'll be in pizza heaven",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "vgj6JFMtaeJmB9FvhNPwtA",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vgj6JFMtaeJmB9FvhNPwtA/o.jpg"
      }
    ],
    "user_id": "F4Rqf2-mrAWkmeMIiHkvjA"
  },
  "R0DV41vC1hpIypZvKfj2wA": {
    "date": "11/15/2014",
    "text": "Stumbled across this place Thursday brought friends back tonight.  Had salads & entrees we were all satisfied and full.  Staff was very friendly felt like we'd  been there 100 times.  Definitely going back for the pizza.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8jVsF-aZpk9iIG5BBd2FOQ"
  },
  "3Vsy8eQ7yi2HY2W5kQQ-xw": {
    "date": "7/26/2015",
    "text": "The best neighborhood pizza joint in Scottsdale. Excellent food and service to match. Trying to figure out the hours of operation? Fuhgedda'boud it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CXvVPilb84YiZzdqdtGlJw"
  },
  "O0yAkZJDGNiu8wAr1YgoXg": {
    "date": "9/17/2009",
    "text": "8/25 Thin-crusted Whitestone Bridge pizza (garlic, ricotta, mozz, spinach, tomatoes, and olive oil) was good!  Could've been a little bit crispier, but I was happy.  Spotted their thick-sliced Sicilian pizza and mentioned to Paul that I was not a fan of thick-crusts, bec. I found them too soggy and too doughy, and he graciously offered me samples.  Thank you Paul, but I'm still not a fan of (approx. two-inch) thick pizza. Bensenhurst baked ziti was very delicious!  Penne, ricotta, house marinara, parm, and mozz.  This must-try dish came w/ garlic knots, a popular appetizer.  Perhaps these knots are better when they're fresh- I tried them re-heated (toaster oven), and they didn't do anything for me.  Will have to visit with a few friends in tow to try this dish and app fresh from the oven! Also tried a gyro sandwich.  Not bad, but for the price, I'd rather swing by Tempe's Haji-Baba's and spend a buck more (plus gas money) and get TWO wonderful gyro sandwiches.   Five tables present, but the space didn't feel inviting enough to stay and dine in.  This venue screams \"take-out\" loud and clear.",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 10,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "vW6Ye2BR1pGMm2TLZzVmSQ",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States. Bensenhurst baked ziti- delicious!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vW6Ye2BR1pGMm2TLZzVmSQ/o.jpg"
      },
      {
        "img_id": "GdB7vWpjLVm70dZpWiMFRA",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States. Sicilian-style (thick-sliced)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GdB7vWpjLVm70dZpWiMFRA/o.jpg"
      },
      {
        "img_id": "8fKLLZAcQOynGBwlEdfY5Q",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8fKLLZAcQOynGBwlEdfY5Q/o.jpg"
      }
    ],
    "user_id": "M9rRM6Eo5YbKLKMG5QiIPA"
  },
  "vbMkd9c0HihPdjLNwrVPmQ": {
    "date": "7/15/2014",
    "text": "The pizza was very good. You can order half the pizza one style and order the other half with different toppings. The garlic knots were great.  The customer services was really great.  Very friendly waitress. We were visiting and I would go back the next time were in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QFg42t_bfKep0dutmQju9w"
  },
  "SpGaWqJEmabwyluSLj8eAw": {
    "date": "2/4/2015",
    "text": "I don't usually leave reviews, but I can't not leave one after ordering tonight. First, the gentleman on the phone who took my order was so positive and cheery, it completely brightened my day. He quoted me 35 minutes and they were here in a speedy 25, they brought me a complimentary specialty slice of pizza, and the pepperoni pizza I ordered was great. Wonderful customer service - I will definitely be ordering again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s2OWK84BBuPa4DyoIuBMtQ"
  },
  "Kc2DDkjcG0w_Huqi6U0QsQ": {
    "date": "8/17/2014",
    "text": "We decided to try Yo Pauly's since we had an entertainment book coupon for it. The moment we walked in we were immediately greeted by the friendly owner, Pauly.  He welcomed us, thanked us for coming in, and grabbed a high chair for our son.  Our server was just as friendly and brought out complimentary garlic knots with amazing marinara for dipping for us to try.  Seriously, the marinara was so good!  The monthly special on beer was a great deal!  $2 domestics and $3 imports.  We enjoyed a large Hawaiian style pizza.  The only reason this isn't a 5 star review is because our pizza was a little over done for my personal liking.  It was crisp and as a Native New Yorker I prefer it easily foldable.  I will definitely we back.  Wish there was a half star to add to my 4 stars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y7019L7fz3l156_AICqhDg"
  },
  "4HZBKI3F44cPv8NIJgeuGw": {
    "date": "6/8/2009",
    "text": "Lot of pre-made slices lingering in the display area just waiting to be reheated.  I didn't get the feeling I would be eating a fresh slice unless I arrived right at the opening.  A lot of places have the 2 slices w/drink, but most do not end up being $6.22 with tax.  Normally you can get this combo for $5 tax included.  NY mural on the main wall, and certainly has the NY pizzeria feel to it.  Red & White checkered tablecloths, garlic knots, etc.  Hard to find the first time because the mini shopping area is tucked away off the road.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "xeQef09UfoGKs9-VfgtGtw",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xeQef09UfoGKs9-VfgtGtw/o.jpg"
      }
    ],
    "user_id": "Q4Qfu-3vYtL1LRm2X1b0Gg"
  },
  "9b2MBXw_8hyFEKs27Hs85Q": {
    "date": "6/16/2016",
    "text": "Finally!! Weve been searching a year for real new york pizza. This is it. I could tell just by smelling it that it was amazing. The buffalo wings are also delicious, the sauce actually has flavor. It is so good and finally tastes like home. Just wish they delivered!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "86_g-bOF3IGIo4ML2b5DIg"
  },
  "coWNzm3jicdjtSAmpvGYJw": {
    "date": "11/18/2015",
    "text": "Last visit disappointed.   My coworkers and I stop in often and always love it.   This time we went at 1:30.   4 dried up slices available and nothing fresh being made.  After being told that by the young man behind the counter I turned and asked the person with me if she wanted to go to the sandwich place next door because there was very little to choose from.    At this point I was told by the counter \" I don't have a problem with you going next door at all ..go ahead \".   We did.  The owner was not there and probably has no idea of how rude this was..the service has always been wonderful.. But with all of the choices to eat in that area..we won't be back soon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Fq7NMyVI3DipYYj1EKltg"
  },
  "GSLdeEx41Zjzu1i8BgwCZw": {
    "date": "8/30/2014",
    "text": "Pauly is a NYC transplant and makes some of THEE best pizza you'll find west of the Mississippi.  If you're hankering for some original NYC pizza pie then definitely go by Yo Pauly's and give him a try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "62GLbQJWiWxtu1vaDjcQHw"
  },
  "OxXJaLTb984ADuD-I9Rt0w": {
    "date": "6/17/2019",
    "text": "TRUE NY pizza! We searched all over for my mother in law who is from NY, once we found Yo Pauly's the search was over! So delicious! Good value! Smaller family feel venue, excellent customer service!! Would absolutely recommend!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "A0HTXXwmI_-s92nqxNrrcw",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/A0HTXXwmI_-s92nqxNrrcw/o.jpg"
      }
    ],
    "user_id": "JCezpJBTpA_YqqNzRp2_uQ"
  },
  "Zc--cikBYVu4PqkLHO_yKw": {
    "date": "9/17/2018",
    "text": "Okay so we tried it again. !! This time ordered an 18\" half ziggy & 1/2,godfather. ER Doc hubbie ate it but said please don't order this again !! He eats anything in 11 sec. job requirement !! Truly this is shitty pizza. Maybe we are just use to better quality moving from Newport & Palm Beach ?? . This was definitely not good ! No more ... Three strikes & they are out. Ugh  To be more specific the sauce is bland. No flavor. The pizza is greasy. One basically can't tell the difference between the pepperoni & the sausage which looks slapped on. I am just amazed by the good reviews. Maybe if I was still in college I might think so. But I doubt it.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "nX55th0dv0MLodYjzuTDxA"
  },
  "u_pSWTDEmA6HTr2jfTNZVA": {
    "date": "10/26/2018",
    "text": "Very good pizza! Thin and crunchy!  This time I got the lasagna, next I'm gonna go for the spaghetti meatballs. Will be coming back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tyuhgYgeZGqKA4xAcwmLDw",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tyuhgYgeZGqKA4xAcwmLDw/o.jpg"
      }
    ],
    "user_id": "CPGycPRELRKSJbzEdKKsGw"
  },
  "XMY95kedo_6ntH5BUPwsNQ": {
    "date": "4/1/2019",
    "text": "Came here for a few slices of pizza and they were so good! The service was great and everything was super reasonable. Will definitely be back. Also complimentary garlic knots if you dine in.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "lvXRpJfSzWSGvADk7yHs3g"
  },
  "4P1sU7J7RvwNe14lo9l7fg": {
    "date": "12/9/2018",
    "text": "Two rad dudes from Detroit, the best pizza EVER and unbeatable customer and quality service!? This little gem was truly one of the best dining experiences I've EVER had! I don't know if I've ever  met more accommodating people and I worked in hospitality for 10+ years.  Additional hightlights: The restaurant ranch is on point, incredibly accommodating for vegan options, you get to write on a wall, I don't even like canollis and I ate two... Did I mention the owners are from Detroit!?  THANK YOU, ANTHONY & DAVID!!! PS - please come to LA... Detroit would be great too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "65SwS0doXSij-f8voWiohA",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/65SwS0doXSij-f8voWiohA/o.jpg"
      }
    ],
    "user_id": "lWKe9vg_sEPY8x5RO_Cy1g"
  },
  "IELnJLMUBXPSobGLbcHV1Q": {
    "date": "3/4/2019",
    "text": "We are here for the first time... so good!!! We ordered the chopped salad, garlic knots, pizza and a Stromboli. Everything was delicious! This is some Of the best pizza we've had in AZ!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rDq2ErSEX621wWbfNy6ENQ"
  },
  "2RIgJwubFx93DkU3culZ0g": {
    "date": "3/16/2019",
    "text": "My party ordered the two 24\" pizzas during our first time here and it did not disappoint. The bbq chicken was sweet and savory while the lasagna style was rich and filling. Portion sizes were more than enough and service was excellent. Would come again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qY6mHllfK3wr7wW0BvpXPQ"
  },
  "vob5vHb9t-jvtOcgQlLghg": {
    "date": "7/27/2019",
    "text": "Our absolute FAVORITE go to pizza place. Coming from the East Coast people here seem to like some really bad pizza places. This place is the best one I've found yet and is True NY style pizza. It's thin and has tons of flavor. Love the wings too",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_e-zZ6KBzlr5LP_tI9fZxg"
  },
  "KFCl4FExzieKk-P45FH_Pg": {
    "date": "6/28/2019",
    "text": "Okay.. but seriously?! How does this not make anyone's mouth water? I have told so many of my people who I'm sure have told their people about this BOMB pizza joint! I have tried everything from the famous garlic knots to the Greek salad and of course \"Ziggys favorite.\" Also, can we talk about how amazing the lunch specials are and the pricing on everything?! Talk about a deal! I have never been disappointed every time I come in, and the best part to save for last is the outstanding staff and customer service they bring to the table!!! I 100000% recommend Yo Pauly's for any type of lunch meeting, catering/events and of course to hang out with some friends and family for a nice juicy fresh pizza! Thanks Yo Pauly's for your outstanding work",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lIjI3RUopJsCx1_HcyIaWQ",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lIjI3RUopJsCx1_HcyIaWQ/o.jpg"
      }
    ],
    "user_id": "_7uR3qUFW4FddtCpsSSrFg"
  },
  "KC5taYyIpJ9cdO80SGwuwA": {
    "date": "1/7/2018",
    "text": "This place gets better and better.  Sunday dinner offerings were spaghetti and meatballs--super large and super delicious.  Two sides of meatballs and a greek salad.  Can you tell we like their meatballs?  Well, if you tasted them you would too!   They gave us complementary garlic knots, super hot, fresh and of course delicious.   Great service, lots of attention.  We thank you for the great dinner.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "YwWTcX4O7ddKez0ui-bMqw",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States. Side order of meatballs.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YwWTcX4O7ddKez0ui-bMqw/o.jpg"
      },
      {
        "img_id": "qv_s1trmKslGeq2XOObt5w",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States. Greek salad. Yum.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qv_s1trmKslGeq2XOObt5w/o.jpg"
      },
      {
        "img_id": "2u8DmmaXoxs7Dxeb8AOpYQ",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States. Spaghetti and meatballs classic!!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2u8DmmaXoxs7Dxeb8AOpYQ/o.jpg"
      }
    ],
    "user_id": "ahwwAXJ_qwGmuRjTOHHMWg"
  },
  "Gwp8oGxCjMcOGQ79p42KpA": {
    "date": "5/31/2019",
    "text": "Definitely my all time favorite NY style pizza, must try The Godfather pizza, it's amazing!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k5UOWwtQilf5mNOBqRT7Kw"
  },
  "P7Kz8O-BentlFNcCH_gzAQ": {
    "date": "6/19/2019",
    "text": "My husband and I have been dining here for years... Love the pizza, but their gravy sauce is amazing!!! The chicken Parm, Eggplant Parmigiana , they have Ravioli and salads are the best all served with garlic knots Yummmmy...why bother go anywhere else. Jeeze.. I don't have to cook Italian now I'm cooking Asian.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Rq83FQBfZLXGU8RD39KQg"
  },
  "FCO2H9iuB7Zgwkriwalv2g": {
    "date": "11/4/2017",
    "text": "Wow do I feel bad for myself. I tried this place when they first opened (almost 11 years ago) and never came back. I thought the slices were way too big and floppy. Not bad, just too large for me personally.  Well, it turns out they have giant slices on certain days but have normal slices all the time and the normal slices are AMAZING!   Fast forward 11 years and well over 500 slices later and NOW I finally found my favorite slices in Scottsdale! No cornmeal, no conveyor belt ovens just a good honest NY style pizza joint I'd be proud to take my New York friends to try!  Slices are foldable like a real NY pie slice should be. Folding a slice is commonplace in the Big Apple. Folding a slice was originally designed to make the bread on top and bottom of your bite to help prevent burns in your mouth. Well, it's post 2000 so now folding a slice helps you keep a hand free to use your phone instead of engaging in conversation with your friends and family! Talking at the table is so 20th century!   Friendly service, great pizza, good daily specials from 11-2. Wish I could go back in time and revisit Yo Pauly's a 2nd time and had the regular slices. Hope you found this useful, funny and cool ;-)  Update : had Chinatown wings twice. Sweet with heat on the back end.  Nice crispy outside and meaty inside. Served piping hot so be careful!",
    "rating": 5,
    "rated": {
      "funny": 9,
      "useful": 23,
      "cool": 19
    },
    "photos": [
      {
        "img_id": "TjE0EJriWvHuTdrBr1GEJg",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States. Honey BBQ wings and slice special. $9.25 plus tax",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TjE0EJriWvHuTdrBr1GEJg/o.jpg"
      },
      {
        "img_id": "yYJgwHr0c0v5k5HDdAVR3w",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States. Daily lunch specials!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yYJgwHr0c0v5k5HDdAVR3w/o.jpg"
      },
      {
        "img_id": "A5aVd4xaDgEqfVS8AYH_rw",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States. Slice n wings special! Chinatown wings. Sweet with a spicy bite a few minutes later. Beautiful!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/A5aVd4xaDgEqfVS8AYH_rw/o.jpg"
      }
    ],
    "user_id": "hZFzo6HD06gtj4J7O2ki_Q"
  },
  "uB03PhbDennVoMdJw0i1yQ": {
    "date": "5/17/2019",
    "text": "Great pizza and owner David is a great guy. It has a classic pizzeria vibe. I'll be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_g-OxEabw4CVz9UTFHzLsQ"
  },
  "6UnXqufL_h7yXiyniBTG_g": {
    "date": "5/25/2019",
    "text": "Best pizza in town hands down. Great people and amazingly authentic food. We used to order from Rays every Friday which is closer to our house. We now go to Yo Paulys.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gq3uY0ozAyfZmVHUatjMxg"
  },
  "SGCncn9m-Ckwy9il2Y7P6w": {
    "date": "5/27/2019",
    "text": "Very good pizza perfect crust had a lunch special 2 slices and drink very friendly staff will definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tResbFNS9vcc-gXgb53qEA"
  },
  "Ukr7QT7V089caq8IVC5jlw": {
    "date": "10/27/2018",
    "text": "Amazing pizza and first class service set this pizzeria apart from others. We've lived in Arizona for six years and have finally found True New York style pizza. Many places advertise NY Style but this is the first to truly deliver.  Thank you for the delicious meal and the fantastic service. We will be back again and again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Y3iQdD6hgFWp5zw6akB4GA"
  },
  "MDrG_Veo30z2b6eV32G7Pw": {
    "date": "4/14/2019",
    "text": "Excellent, well priced pizza!!! Great garlic knots too, free if you dine in! Had a couple slices here for dinner and was happy. They had a very friendly staff and was very helpful. You can go during lunch and have more individual slice options. Cant wait to try a full pie next time",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g6X4spc36JT_lcneDuoUNA"
  },
  "xPnuEcoU78iuqOn1C5aNag": {
    "date": "4/27/2019",
    "text": "This was our 1st time here. Neat, clean place. Lots of NY representation going on in here. Friendly staff. We ordered a few slices and a couple of pops. Large slices with good flavor. Pizza slices came hot from the oven and have crispy crust. Our table was given some garlic knots with dip to try. We will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NXiKYfOGDZJOo47kpkLNqg"
  },
  "HUVseOwhA97m0_R_LwvIqA": {
    "date": "3/19/2019",
    "text": "Spring Break in Scottsdale at the Hyatt Regency Gainey Resort. Room full of teenagers wanting Pizza and we found Yo Pauley's!! We ordered the massive 24\" Pepperoni and Hot wings! Totally awesome quality! There wasn't one table in the lobby not jealous of that massive pie! Score 5 Stars kids loved it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "br7BB7Jp8lHa048jxABZUQ"
  },
  "Sk7qhZ7yRjVdZoGrEVwXhg": {
    "date": "6/27/2017",
    "text": "Stopped in for lunch while out in Scottsdale celebrating our anniversary. Food was very delicious and the place had a cozy family vibe. I enjoyed their slice of pizza and 6 wing lunch special. Amazing New York style pizza and the wings were crispy and delicious. Staff was friendly and welcoming. I will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZLBFxGkzd1--zJZz5dIYmg"
  },
  "delvQrccnz1qLpvqilJ9NQ": {
    "date": "2/9/2016",
    "text": "Delicious! Cheesy and delicious! The sauce was great. Pauly's is authentic East Coast pie. Just moved here from Jersey/Philly area in July, and finally found something comparable to what we're used to. We'll be back! Thanks for the canoli Pauly! I'm giving it 4 stars because I'm waiting til I try the wings. ;)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HcjAOTBgumqAYsVKjdhFPA"
  },
  "BlYFHagXhYp3z0UB8mHnOw": {
    "date": "3/2/2017",
    "text": "Great NY Style pizza!  Brings my back east. A toss up vs Ray's as the best I've had in AZ!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uZ6SbMVbFqpJu5W6vxLJnQ"
  },
  "V9rMtF9yEyz3zPkTpJ-qpQ": {
    "date": "1/24/2016",
    "text": "I used to go to Yo Pauly's on a consistent basis whenever I had a craving for their salad, sandwiches, or appetizers. However, they took some of my favorites off of the menu such as the pepperoni rolls, and the service and quality of the food has become inconsistent. There are more reliable places in town serving the same style of food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HPuywU9mgUcRwf7W-yYz-w"
  },
  "Pyj3RjnB71yFZOWte6yvJg": {
    "date": "5/30/2016",
    "text": "This was seriously great pizza. I'm kinda picky about my pizza and I hate the chains so I look for mom n pop places like this when I'm craving pizza and this place hit the spot. Its all in the sauce and they do an amazing job. The sauce was on point. The garlic knots are not as great as my favorite place in CO - haven't been able to find a place that does it like them - but the pizza was delish!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GzWDTh71-8zC4GnyKq-_FQ"
  },
  "Z1Dq5nJTGN0lyp0G8HU5Pw": {
    "date": "11/12/2016",
    "text": "The absolute best pizza I've had since I left NY 28years ago. The thin, crispy crust topped with delicious sauce and chewy cheese transported me like a magic carpet ride right back to my youth. But now in my advanced age, 2500 miles from home, I will make the 45 minute car ride to go see Pauly just to eat a couple of slices to remind myself of the incredible pizza I left so long ago and far away. Thank you Pauly for making pizza the way it's supposed to be made! Try his amazing wings too, you won't get better.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "o-pK09_JzRL88koFSWfB4Q"
  },
  "fCvQe7Xyn_KVo_IOwoseEQ": {
    "date": "12/9/2015",
    "text": "Yo Pauly's is great!! My favorite restaurant in Scottsdale! The lunch special is a good price for a large portion and the food is very tasty and authentic! Pauly is a great guy and gives great customer service every time... we went one time when it was closed and Pauly still served us!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vGFqTZoXXQvwzMNDW1ytLw"
  },
  "OphLpC4WiHFG1PCDlxL8MA": {
    "date": "2/22/2017",
    "text": "This place is fantastic! I'm from NY and will search high and low for good AUTHENTIC NY style pizza. My 14 year old son went here with some friends and told me it was the best pizza he ever tasted. This is from a kid who gets his share of pizza from all over the country. Anyway, I knew I needed to go and I was not disappointed!  We went on a slow night (a late Tuesday) and it was quiet. Pauly, the owner, was there and we talked shop. He's a New Yorker, of course, and knows his pies! He was a warm and wonderful host. He was friendly to everyone who came in. It truly felt like a neighborhood restaurant in Queens or Long Island - and the food was just as terrific! Can't wait to get back there - it can't be soon enough!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mZzAqUgmOoXrWI6DWExzLA"
  },
  "esHGLgbUnUdszQJQVeXxHA": {
    "date": "4/1/2013",
    "text": "As a New Yorker, I am pretty skeptical of any pizza places outside of my home state, thinking they can't taste as good.   When I lived here, I used to frequent NYPD Pizza but last I visited them, they went waaaaay downhill.  Decided to try Yo Pauly's after reading the reviews on Yelp and I was not disappointed. While I have had better pizza, it was still on par with many pizzza places back home. We had one plain pie and one pineapple pie and I thought both were good.   Would definitely order a takeout pie from here again next time I am in town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "hLlmddIRRXKV8Dv_vTjxAQ"
  },
  "XJpB-3Wg2MZ031vVivcgtQ": {
    "date": "4/26/2017",
    "text": "Great NY pizza joint with great people!  Great garlic knots and their pizza is da bomb!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C8N-4wJ27qx64wz75uAanQ"
  },
  "QIeTgbkRSP6A0cL1PSgM7Q": {
    "date": "7/11/2015",
    "text": "Always great pizza here.  Slices are good, but nothing better than a fresh made pie.  Excellent customer service on top of amazing pizza and entrees - highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Vt9kXftjitRV4uX3f3CGQ"
  },
  "tKz4FlAtYSJW3erT5nVOSw": {
    "date": "2/19/2015",
    "text": "FAVORITE PIZZA IN AZ. This is my favorite type of sicilian (square/thick) pizza in the state of Arizona. Pauly & staff are also very friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "8AmodeNldnnq5iEOnZV_Kg"
  },
  "-wbqPFKOMWgfIf4PY-tf8A": {
    "date": "4/1/2015",
    "text": "Wow, let's just talk about Yo Pauly's for a moment. This is easily the best restaurant in the entire Scottsdale area. What makes it so great you ask? Impeccable service down to the tiniest detail, incredible food that makes you salivate at every bite, and an intense atmosphere that makes you feel right at home. Each and everyone of my needs were met, and the host (Pauly) greeted me with utmost and genuine respect. Definitely get the cheese pizza, so good. Also, make sure you inquire about desserts - as they were fantastic. Just woah, I am utterly speechless.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QFWMqp3hrMYQd9UYY3P4qw"
  },
  "rxn1foXtmwkC3ZeV6tQElw": {
    "date": "2/13/2016",
    "text": "Yo Pauly! This is True NY pizza! Great dough, awesome sauce, and great quality cheese! Will definitely be back for more while in town",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C4IS2AqipFou5lu_OQAIRg"
  },
  "a1wi1XeJIea7vyUlYhdWRA": {
    "date": "4/15/2015",
    "text": "We love Yo Pauly's!  Great food, excellent customer service!  I feel like I am back east when I enter this little joint.  Our favorite pizza is wise guys, extra cheese, sausage, black olive! We always ask for specials, a great way to get wings and pizza on a Friday night in.  The best way to bring NY pizza to AZ!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NCYbGXB2WGym6cuecuiR5w"
  },
  "vDpBghO-3nHmUjo1tuN6HA": {
    "date": "6/17/2013",
    "text": "My boys and I were running errands far from home, and decided to stop here based on the Yelp reviews. We were very pleased with our choice. Each of us ordered the slice and garlic knots special. The slices were very tasty, but the garlic knots were terrific! My only tip on the knots would be for the kitchen not to let them get over-browned. Pauly is a very smart man, because the majority of business owners today don't seem to value customer service. Pauly joked with us as we ordered, then checked up to see how our meal was. He was very personable and funny - even bringing us a complimentary dessert. We very much appreciated both the good food, and being treated like we were a valued customer. I hope to see them have continued success.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pZ3EtXuJu6SjKVKP_I2Byw"
  },
  "vrecR5BdpzNNHGgK9vSb1A": {
    "date": "4/16/2015",
    "text": "Very poor customer service! I had recently ordered on the phone , and they didn't have one of the items I ordered made. I realize that mistakes happen,but his lack of customer service to make it right , was just terrible ! He said \" not my problem\" . I was just in shock.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dIv4SmVFruueXKtPXZsksw"
  },
  "cDktVR4otTC5gRa2kp6ISg": {
    "date": "5/21/2013",
    "text": "We found this place in the Entertainment Book, any pizza 50% off (instead of the bogo which isn't very practical) and decided to stop in for lunch while in the area.  We just ordered the 18\" cheese pizza and some drinks.  The place wasn't very busy on a Tuesday afternoon so the service was great.  The pizza came out quick and was nice and ooey gooey.  The cheese pizza wasn't very greasy and had a good amount of cheese.  The crust was delicious - probably the BEST crust I've tasted in Phx and, trust me, I've been on the hunt!  It was crispy and flaky on the outside while moist and chewy on the inside.  It wasn't doughy at all and even my husband and daughter ate most of it - they NEVER eat the crust!  The only downside was the tomato sauce, it was just that - tomato with no discernable flavor of garlic or herb or anything really.  This was really disappointing because the rest of the pizza was great!  It may have been ok if we had spicy or flavorful toppings to make up for it like pepperoni or sausage or veggies, I'm not sure.  My daughter loved it because she's 8 and she doesn't like basil or oregano or garlic - she loves the sauce you get in a pizza lunchable.  The only other drawback was the $5 import beer (Peroni), my husband only had one which is kind of a first!  Good thing the pizza was only $8 which made up for it.  Overall, a good spot for pizza if you get some toppings!  If they fixed the sauce, I'd make the drive to Scottsdale at least once a month!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T6Gti8sicxZZ28fuS1JFKA"
  },
  "lRGu3bc2fMogtTmYBqRgdw": {
    "date": "9/28/2014",
    "text": "Bessssst calzone ever! From east coast and gotta say this place is really good. Cheese cake to die for and pizza is delicious!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kgAiZU60RefGdjkeRdi0pA"
  },
  "1i1gGXm5kzLHm-6GuOb3Bw": {
    "date": "4/30/2014",
    "text": "The owner Pauly is rude.    I work in an office close by and we received free delivery if over $15.00.  I ordered three lunch specials and got grief from him stating they are usually only used for large orders.  Well Pauly, don't put max of $15.00 on the delivery and be more specific.  He always rubs me the wrong way and comes off very rude.  I guess that's the New York type of guy that is RUDE!  Today, my family came by my work to have lunch with me and so I called and preordered it for take out b/c I wasn't sure if we were eating there or not or back at the office.  But after I took the order over the phone, my coworkers wanted to order out as well and I was going to pick it up for them.  So it ended up being a dine in instead of take out. So we got our food and I could hear the owner wasn't happy that I got take out and we ate in.  Saying that was a take in NOT a take out.  He is not a friendly person but obnoxious and arrogant! When I was walking out the door, I noticed that my coworkers pizza was placed in a bag with plates instead of a box to go like they always do. The owner doesn't clearly understand quality of his product. He just threw it in the bag to go.  Normally, they put the piece in a to go.  I took a picture  of it and it's my screen picture.  This is ridiculous and the owner can.......  Morale of the story is Don't eat there.....  not a good person.  Never eating there again!!",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 1
    },
    "photos": [],
    "user_id": "JA9ebZW4GrJcP0GC3uMIUg"
  },
  "efH00Ok4GLqtqGCtZi2UXQ": {
    "date": "6/1/2019",
    "text": "Found this place while visiting the hospital. Went in for lunch with my family and it was a good choice. Greek salad was fresh with good dressing. Buffalo wings - extra crispy,  like we ordered. The pizza was very good. Not greasy or soggy. Sauce had good flavor. The crust was really spot on. When you can eat your slice with the east coast fold - piping hot, you know you've got a good crust. Service was excellent.  If I could make one suggestion, it would be  to the bussers. Make sure to wipe all of the condiment containers. Salt, red pepper, oregano...you get the idea. We would all go again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "mbgJnarUs4k1pvDSjSQEag"
  },
  "CyUy5w_CDwIUDVWsbh8B5A": {
    "date": "5/31/2019",
    "text": "What in the NO CHEESE antipasto is this? This was all the meat included in my antipasto order tonight.   This is the 2nd time I've experienced these guys being \"frugal\" at the customers expense. Its actually just one specific guy, not the team giving poor service. Unfortunately I think he's one of the owners.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "m-JT1cVbBpythzKRmpytew",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States. Antipasto",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/m-JT1cVbBpythzKRmpytew/o.jpg"
      }
    ],
    "user_id": "HQ_8mx9OMIg3WlAvTK_GDA"
  },
  "trpuL3dtbVzmIbM3UCZTrw": {
    "date": "3/31/2019",
    "text": "The pizza and salad were only worth 2 stars. Pizza was disappointing. Very watery. I'd suggest that they pre-cook their mushrooms to prevent this. Not enough cheese on pizza. Pizza sauce too watery, not enough flavor to sauce. Good crust.  Greek salad disappointing. Not enough of the good stuff; very light on feta, kalamatas, no pepperoncinis. If this is authentic NY style, then Ill stick with Chicago style.",
    "rating": 2,
    "rated": {
      "funny": 6,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "aUvblT94haCcDBFAhoIvig"
  },
  "wT2mIDckHGP3QUCePFu6EA": {
    "date": "8/31/2019",
    "text": "Yummm, pictures don't do this place justice. That's some very very tasty NY style pizza! Ordered from here last night. I ordered an 18\" cheese pizza and 12 garlic knots. Unfortunately when I came to pick it up they said they didn't have any garlic knots left. I was a little sad as I had been dreaming of garlic knots all day, but they made it up to me buy telling me I get a free order next time! That was good customer service, I was glad with how they handled that.  The pizza was so delicious, just the right amount of grease, good quality ingredients, I ate nearly half of the pizza, and I'd gladly do it again! I look forward to coming back for my garlic knot order and to hopefully try a different pizza too!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 5
    },
    "photos": [],
    "user_id": "18qEoFOVEernpVLh97PQPQ"
  },
  "voPpHPRy7S6GYRUXGkKs1Q": {
    "date": "7/26/2019",
    "text": "Yummmmmm NY style pizza  True to the taste. Love the atmosphere! The pizza was amazing the garlic knots were awesome too! Must go! We're looking to move and this definitely makes me want to move to this area for this very reason!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "7WOAlkivllY9PRo97hwW-A",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7WOAlkivllY9PRo97hwW-A/o.jpg"
      },
      {
        "img_id": "JiqN0X7i5k6Bp4kKBZ7fow",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JiqN0X7i5k6Bp4kKBZ7fow/o.jpg"
      }
    ],
    "user_id": "Pn91FgNLSAPKz53AmnaDFw"
  },
  "71Ia98SBCDWXjzip8jhc4A": {
    "date": "7/20/2019",
    "text": "Great attitude = great service! I ordered a large pie to take with me to a poker game yesterday and called in the order. David, one of the owners picked up the phone and said that he would have the pie ready for me even though they weren't officially open at that time. Beat that fellow restaurateurs! Plus all my pizza buddies loved the pie. Service and quality equals Five Stars. The end.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "e9uQpxkW1ciHZu5RY5UwDg"
  },
  "Fu7OvZ7HDFf3wa3VDaJkZQ": {
    "date": "8/24/2018",
    "text": "Yo Pauly's is literally the only place I get pizza from.  Now, don't get me wrong.  I have no issues with the other local Scottsdale pizza parlors.  I've just never tried them.  Okay, maybe once when Yo Pauly's was closed.  Anyhow we moved to Scottsdale from Ohio in 2016 and the first night we wanted pizza we used Yelp to find close places.  Yo Pauly's was the closest.  My wife is from New York (Long Island) and was naturally inclined to try Yo Pauly's since they are New York style.   The XL Godfather pie is the only way to go.  That's all we buy.  Maybe 2 of them if we have company. I like cold pizza for leftovers.  The key to good pizza is to only use the best ingredients.  NO skimping.   Theirs is ~delicious~!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "ElO_bHAI2niKITNdzhd9gA",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ElO_bHAI2niKITNdzhd9gA/o.jpg"
      },
      {
        "img_id": "ZjccMcMDa2nqtTGK0UbJwg",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZjccMcMDa2nqtTGK0UbJwg/o.jpg"
      }
    ],
    "user_id": "sabwyIBd5jMWNimKVNllaQ"
  },
  "7JCZP8gd4fgdRXJcEY2Yig": {
    "date": "8/4/2019",
    "text": "This has become my new favorite pizza place! Two slices and a drink for only $5 is a sweet deal! The pizza is phenomenal. I could eat this everyday. This is exactly what I was searching for. We are new to AZ and from the east coast. I highly recommend it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8LNN-znF59s4_2DZppDCPw"
  },
  "t5JO3v0HJSYK6sgl9SGNIg": {
    "date": "5/31/2019",
    "text": "I've gotta say, I should have went to this place 6 months ago when a friend of mine from the east coast told me I need to try it. I'm from Philly originally and frequent NYC so I know what to look for in pizza and Yo Pauly's does a great job bringing that NYC food we love soo much to Scottsdale! Keep up the great work y'all! I look forward to coming back soon. Both the regular NYC thin crust and the Sicilian pizza were excellent and my friends enjoyed it as well!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "4jMF53owDw_wEd4Y3saOjQ",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States. Cheese Pizza NYC style",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4jMF53owDw_wEd4Y3saOjQ/o.jpg"
      },
      {
        "img_id": "rgquly9zyeL4x0vbNiBpNA",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States. Sicilian Cheese Pizza",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rgquly9zyeL4x0vbNiBpNA/o.jpg"
      }
    ],
    "user_id": "kJifhGizDLVJ4VK9_YvYoA"
  },
  "adyukzyr8srTZUn4QGiwsQ": {
    "date": "8/1/2019",
    "text": "Favorite new Pizza spot! Being from the east coast, I needed that pizza fix and Pauly's is it. Filled up on their lunch special and my next order will be a 24\" for the family. Perfect crunch, perfect sauce and perfect cheese. Thanks Pauly's see you soon",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "V1cYUqKxaIRt2mQh8M3BHw"
  },
  "f1jMXXZjQ1tR8EBZIZHpBQ": {
    "date": "7/21/2019",
    "text": "I moved here from Long Island 4 years ago, and I am so over joyed to FINALLY find a good pizza place! THIS is quality New York style pizza! Pizza by the slice, or any of their many pie options. Their lunch specials are a deal! A slice, salad, and a soda, it's perfect. To be honest, I've never tried any of their entree options, but that's because I come for the pizza. The guys who run this place remind me of home, it's comforting to just be in the old school Italian atmosphere. Yo Pauly's is worth the drive from just about anywhere in the valley.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "rml3MbEsHkgGt-QzNhzgpA"
  },
  "f5lLMu-lX3NshXj8n8f6MA": {
    "date": "5/19/2019",
    "text": "Wow... wow... wow.... This pizza was a pinnacle for my visit to Scottsdale. I'm from NY and haven't had real pizza in too many years. This was so wonderful and so was the service. I could eat here every day if I lived here. Thank you for an exceptional experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UCo527oGwBtfHrUnyoWt0g",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UCo527oGwBtfHrUnyoWt0g/o.jpg"
      },
      {
        "img_id": "7NAUqI9aNxQKqbwrHsL37g",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7NAUqI9aNxQKqbwrHsL37g/o.jpg"
      }
    ],
    "user_id": "SbIDdkSfWVIvsfzj30dbXQ"
  },
  "nWoh0bRCS7wQWhq6EWXJLA": {
    "date": "4/28/2019",
    "text": "Wow this place did NOT disappoint! I ordered a 14\" Cheese Louise for carryout. I was given a pickup time of 35-40 minutes. I showed up at the 35 minute time and was told they were a bit backed up and it'd be another 20 minutes. Not a big deal, just sat on my phone. Got the pizza and drove back to my hotel and it was still piping hot. Perfect amount of cheese, flavorful sauce without being loaded on and a delicious chewy crust. I will definitely be back next time I'm in the area!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yY8b54JmC-Kk_Nl05fqj0g"
  },
  "YJt8LkS9tv3yEmcGuAzqoA": {
    "date": "7/6/2019",
    "text": "Great pizza from a great group of Guys working there!  The garlic knots hit the spot with heir great marinara sauce.  Bring your appetite for their Big Pie!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ylbloQXL-rW5AJQVBxt2Lg"
  },
  "B808yUS3s0djqq0_Ukab5w": {
    "date": "4/22/2018",
    "text": "Yo Pauly's is one of a few pizza places here in The Valley, that serve up some authentic East Coast/ New York pizza.   We started coming here on grocery night a few months back and found it fun. There are a few other places that serve NY/NJ pizza, but none seem to have mastered that east coast feel and attitude. LOL  Yes you can buy a pie, or if you like, you can buy by the slice. Nice. I've taken a few photos to give you some idea of the atmosphere and the pizza. Expect to pay under $10 for a few slices and a soft drink.   Enjoy!",
    "rating": 4,
    "rated": {
      "funny": 28,
      "useful": 43,
      "cool": 40
    },
    "photos": [
      {
        "img_id": "9p_BWWVcWdQwUlGmS9brxQ",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9p_BWWVcWdQwUlGmS9brxQ/o.jpg"
      },
      {
        "img_id": "nM6_kqry-mLEgcKkIY3p2w",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nM6_kqry-mLEgcKkIY3p2w/o.jpg"
      },
      {
        "img_id": "pdt3TorAxGe7hHq36gCmpg",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pdt3TorAxGe7hHq36gCmpg/o.jpg"
      }
    ],
    "user_id": "A0j21z2Q1HGic7jW6e9h7A"
  },
  "MAu3bdYct5EqzuYFzonbDA": {
    "date": "7/3/2019",
    "text": "The best crust I ever had.  Great pasta dishes.  Good lunch specials.  Meatballs to die for.  Greek salads are awesome.  What else could you want.  Just Sayin'",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "B91zxPvL8lnmQXF6nka0zQ"
  },
  "gryG9lkdY84btnlziHgwSQ": {
    "date": "11/16/2018",
    "text": "The pizza was deliciously on point and the service was top notch. Definitely authentic New York pizza. And the cannoli was perfect. Not too sweet just the right texture My new pizza place for sure  #PizzaIsLife  4 month update* I cannot get enough of this place and go at least once a week ",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "iJCnQLfr-jOO3xiZsP25sg",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iJCnQLfr-jOO3xiZsP25sg/o.jpg"
      }
    ],
    "user_id": "mYvgkvo1dHtm1ktKnBjV_g"
  },
  "CD-4CP1k_FuXw2AoZyD9yg": {
    "date": "8/10/2019",
    "text": "Best pizza anywhere in the valley. True New York style. I had the cheese pizza. Perfect crust... thin but not hard nor droopy. Delicious cheese...melty but not greasy. The side salad I had was so fresh and delicious also. I liked Yo Pauly's so much I went two days in a row and I might just make it three. For sure I want to try their ravioli and their meatballs next. Also the guys working there are so nice and funny. All-around great experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "3GF6jW1cHcg7DyJK_lqWcQ"
  },
  "WQUMS_2M9NsKxkE7FwwibQ": {
    "date": "6/23/2019",
    "text": "Easily the best pizza in Scottsdale and possibly Arizona. The guys in there are friendly, legit, and know how to make a True New York Pizza. Affordable prices, friendly service, and a quality product, the recipe for a great business.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "UE5QHgXeuaMLqIbKZXbQjA"
  },
  "8pkC2FNAP0AASq4b5aXpWw": {
    "date": "10/4/2018",
    "text": "Delicious, authentic, NY style pizza in Scottsdale, Arizona. Went here with my coworkers during our lunch break. After ordering, it took maybe ten or so minutes before we got our food, which was nice and hot!   I ordered two slices of the pepperoni and sausage pizza for $5.75 (a deal!), after ordering they put them into their large over to reheat. My coworkers raved about the garlic knots and ended up ordering those, which smelled and looked heavenly (I couldn't afford the extra carbs lol). When they brought the pizzas to our table they were crisp and hot and the cheese ooey-gooey.   The guys working their were kind, VERY NY (it's not a NY restaurant in name only). Definitely would return!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "93TZil6GOtB2FfT9mIbZYQ"
  },
  "uLWy8X-5iLLNEhxPDRWokg": {
    "date": "1/16/2017",
    "text": "Excellent pizza, Stromboli, garlic knots and Antipasto Salad. Food is great. They have beer and wine only, pizza and beer? What more could you ask for?  Small hole in the wall place, one waiter but super nice. Not much seating. They apparently have a lot of carry out orders as people kept coming and going.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DsoF9YX2lsYZJ3GYt6KVbw"
  },
  "bJjUilqTrQDVug7IeiEQAg": {
    "date": "12/31/2016",
    "text": "I'm from New Jersey so my pizza standards are pretty high. I don't really care for that Chicago style bs because as Jon Stewart said \" Not only is it not better than New York Pizza it's not pizza at all\" I got a 14 inch and some wings last night. The pizza tasted just like home pizza and I ate the whole thing. I asked them to add some garlic to the wings because hot garlic is how I eat my wings back home. The wings were a good size but they weren't cooked long enough I like or my wings well done. So next time I'll ask for them that way. I will be back soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IE5tDJQtNya5J_hZ7Y-sVw"
  },
  "PSi1J_y98kK_YUsG9WaitA": {
    "date": "4/18/2015",
    "text": "So happy. I just moved here from LA and have had a hard time finding a good pizza place. Well I was driving around and saw YO Pauly's and went inside.  I ordered a small pizza and an eggplant parm sandwich to go.  YUMMMMMMMMMMMMMMMMMMMM   great place and great service.  My new go to.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "P26Oih5WLcBC6U1zIEnf_w"
  },
  "IaddKO41vlKeh2XHQErwOw": {
    "date": "12/14/2016",
    "text": "I live about a half mile from here. Truly a great local neighborhood pizzeria with authentic NYC style pies and a good menu of other salads and pasta dishes.  Read the other 5 star reviews for a taste of the quality. It's tough to find a place that can make a show stopping 24\" pizza too. Show up anywhere with a pie in that big box and you'll be a Star.    What impresses me is Pauly who is always there and it is obvious he takes a lot of pride in his very friendly and very clean business.   I took a copy of his paper newsletter menu. I plan to try everything on the menu.  Then I can say \"I've been around the block\".    Run, don't walk, OK - maybe drive to Yo' Pauly's.  Buy local. Support the local merchants.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DxQGFfxcC7ny4RuZoeqYIQ"
  },
  "XseWhUzHdYXjyts2ogyc7A": {
    "date": "5/2/2015",
    "text": "I have lived in Scottsdale since 1992.  We have been coming there since they opened.  I have tried a number of things both takeout (haven't done delivery) and eat-in.  They are busy, because the pies are very good.  The balsamic salad dressing is really very good, not sweet, (actually one of the best) and my non-salad boys (15 and 12) ask for salad for their house salads -- I prefer the chopped..  They are always good to make it our way, (i.e., leave off the olives please).    We've tried several styles of pizza, my family loves the cheese and pepperoni most, and I like to try different pizzas, besides the ones I've named, I've had the Whitestone and Margarita Village (love basil).  ALL and I mean ALL of us love the garlic knots, they are addictive.  Try one of the calzones (excellent) or the meatball sub.  (I'm not a salami or pepperoni person).  Anyways, I do not think you will be disappointed slightly in the food, we all have different tastes.  You know I was a little surprised anyone would give Pauly a bad review in personality.  My family has always been treated well.  However, I have seen him on busy days, and doing business with NY, I can understand how some people don't understand a NY personality when there is a high rate of traffic, and no one hits it all the time, but honestly, I think this is one of the best pizza places around.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "H46Jkf_im8inh8fmHE3JZw"
  },
  "MamevDinsz-IXBWZrjucXQ": {
    "date": "7/23/2015",
    "text": "As a New Yorker who's now living in the desert... It's been hard finding a great pizza place. I'm giving this location 4 stars instead of 3 because their sauce was very tasty and their staff was friendly and courteous.   Their pizza dough? Not great. Which is sad. I was completely excited when I saw this location and couldn't wait to try it. The dough was too stiff to be even compared to NY dough.   I'll definitely go back and try other dishes. Alas, I won't be consuming the pizza again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kta6QqE36T7GU3qBJIKIXg"
  },
  "LBeM9RzpVy6r4UmXgcP2JQ": {
    "date": "7/25/2016",
    "text": "I've eaten Yo Pauly's only twice. The first time was just a single sausage and pepperoni pie and it was SO GOOD! I've lived in the valley for 10 yrs and it's very hard to find a good pie. Either the crust is chewy and turns hard or it's super doughy and too filling...not Pauly's. It's a good NY Style, a little crispy, yet soft, and just the right amount of floppy! 2nd visit we had take-out and got a bit of everything. Pizza (the original, cheese), the Stromboli, modified with no ham, add ricotta, a garden salad and garlic knots. I am still dreaming about that Stromboli. It was FANTASTIC. Pauly, your dough is delicious and you really nailed it with everything we've tried. We are new fans and super happy we found you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NJznaeQ4wOrtbsqfz14lTg"
  },
  "dN6kXwrNSyY1SDxmiw9LPg": {
    "date": "3/11/2017",
    "text": "Not sure how this got 4 stars.  As a an E. coast transplant the pizza was  barely Edible.   The Mariana sauce had no flavor seemed canned.   Wife got the baked ziti which was mush.   Only reason not a 1 star waiters were nice. Not a return in the future.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "5mRySJzbaW-nTItjOWiK-A"
  },
  "jcjm4xpwnGotk3mM7paaIQ": {
    "date": "11/1/2017",
    "text": "I'm from New York and this is real NY pizza everything was great the pizza the salad perfect",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NKMbQPK9mBOcUU0odLnD_Q"
  },
  "eA3cISYe_g_gsixmEFz6RA": {
    "date": "9/27/2017",
    "text": "I am new to Arizona and had just about given up finding good pizza here. I read all the great reviews about Yo Pauly's from East Coasters who raved about it. They are right! I just had this pizza and it was fantastic!!  The service was also excellent. I am definitely going to be a regular. If you are looking for great pizza, look no further than Yo Pauly's!!!  FANTASTIC!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gsFZjex28_XBvq7naoDMsg"
  },
  "YjzTzElCyE3_KQp5b8ckjA": {
    "date": "10/10/2016",
    "text": "I went here for lunch and got a couple of slices. They were very good and was close to what I got when I lived in NY.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hjQW9Zv4U5Ezw4r_WgaEqA"
  },
  "G1bqSk_T34wQwyBDp_b7hQ": {
    "date": "4/22/2014",
    "text": "HORRIBLE CUSTOMER SERVICE!  My husband and I decided to come here tonight, as he has had this pizza before at work. Big mistake.  We walk in and the guy greets us and is very nice. He tells is we can sit anywhere we want, so we do. We look at the menu and wait for someone to come by to get our drink order.  Doesn't happen right away, as the guy and girl that seem to be the only 2 working, continue their conversation.  A group of people come in and the girl comes out to their table and jokes about how she's the manager (I sincerely hope not!). Then she asks them what they would like to drink.  Apparently, serving your regulars/friends takes priority over guests that were there first. That was our cue to leave. Not spending time and money at an establishment with such rude service.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 8,
      "cool": 1
    },
    "photos": [],
    "user_id": "w2qWVEq9GAcDPXMVtoxpJA"
  },
  "-p5vQSvv5jwwbsfHNpCn4A": {
    "date": "11/1/2015",
    "text": "First timer here. Wanted pizza dine-in (half and half; Hawaiian/Greek) and wings to go. Why 5 stars? It's a combination of things.   Ambiance - Nice, nothing too fancy but better than a fast-food feel to it.   Big selection - You can have a little or a lot. Everything from a Greek salad and single slice of pizza to a 24\" pizza. Sandwiches, wings, desserts.  Pricing - More than fair; especially with their quality ingredients and items prepared in-house. Thin crust pizza with very edible crust.  Service - Top notch by people who care. She was enthusiastic and friendly.   Extras - Free garlic knots with marinara sauce while waiting! FRESH out of the oven. Yum!  She knew I wanted the wings to go so she waited to have them prepared until we were finished with perfect timing. A sincere \"thank you\" from them is always nice.  Haven't tried them yet? Do it! You can even try a slice first, then you'll see. As Ahnold says in the movie: \"I'LL BE BACK!\"",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qlxFFY78s8NTe_uW9HMPqw"
  },
  "SPIZNZrAN9DvLN0J9nFgig": {
    "date": "2/23/2012",
    "text": "So I came by yesterday to peek at the menu and decided to go the Vermont Sandwich place next door instead. Today, I came in and the lady at the counter remembered...\"hey, you came in yesterday and then left!\"....So either the staff is super attentive or their business is so slow that they remember every customer. Something tells me that it's the first one though.   I've been to New York and I've eaten pizza while I was there, and I don't quite remember it tasting what I tasted today. I had a slice of the Margarita Village which had olive oil, garlic, sliced tomatoes, basil & mozzarella. As I bit into the za, i had oil drip down my arm. Yeah, this bad boy could have been on the SI Swimsuit cover with all the glistening oil that rolled off of it. Too oily for my taste and the crust wasn't crispy at all. You can, however, taste the basil and the freshness of the mozzarella. The cheese was gooey, but I don't think there was enough. About $3.50 for a specialty slice and the slices are a pretty decent size.  Leaving this place, it looked like I had been attacked by the Baby Oil Monster. My scrubs were thoroughly dirtied.   Tip: They deliver for free within 3 miles of their restaurant. And there is a 15% off coupon for your dine-in bill by the register...so grab it!  Overall, if you're in this complex, I would suggest eating at Andreolli's Italian Grocer #1 or the Vermont Sandwich Company as your #2 choice. If you really really want some pizza, then go for it, but I think I'll pass on this place next time.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "6p1NDChnIpGl29Ce3cMKWg"
  },
  "RxjW46TM-OVOSkiVJ1oH_w": {
    "date": "8/15/2014",
    "text": "I would say 5 stars if we're purely just talking about the pizza, but I have to drop it to 3 when you consider customer service as well. After having ordered delivery from Yo Pauly's multiple times, I have concluded that the owner, Pauly, appears to be aggressive and simply rude at times. If you're okay with possibly running into a not-so-friendly environment or lackluster customer service, but AMAZING pizza, this is the place for you. It's a shame Pauly isn't nicer or more helpful because that would easily bump this 3 stars up to a 5.   P.S. For all those ricotta lovers who don't like giving up the marinara with the typical white pizza, order the \"Not So Whitestone Bridge\" pizza. It's on their secret menu and TO DIE FOR!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wTS__Z_wbq58nXR5HeznZQ"
  },
  "N1pwm2po9JIocH4Xfpl7fQ": {
    "date": "10/11/2012",
    "text": "I am born and rasied in Manhattan- the real NYC and I am very picky about my Pizza. Yo Pauly's is the best NY Style Pizza in the State of Arizona! The Crust is good and you can pick it up and fold it as we all do in NY and the yummy oils come running down the pizza to create a yummy piece of Heaven! Don't miss out on this beautiful little\"Little Italy and Greenwhich Village style Restaurant! All od their food is delish!  Try it you'll like it!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ReukP7PSu0Q3hU4cbpQjpQ"
  },
  "5K726rFkkReLQG-VVQCnZg": {
    "date": "5/30/2016",
    "text": "Yo! This place is the real deal. I'm a New Yorker -- born and raised -- I should know. The owner and the crew are just superb. I haven't seen anything like this place since I moved here from New York 20 years ago. I wish I'd known about it sooner. Fountain Hills...shame on you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wr4uW7dG61pNx9EoHM1_EA"
  },
  "HgxkkR03T0h_UC19IeTEjQ": {
    "date": "7/6/2017",
    "text": "Being from Chicago and visiting Scottsdale,  AZ and grand canyon/Sedona. We loved the NY style piazza. Go figure. I ordered four extra large 24\"  pies. Sausage and onion/jalapeno.  After feeding 20 people I still had a whole pie left which we finished after a late night game of charade. Friendly establishment and really excellent quality pizza. Kids were given a choice of anothee local establishment. And they chose hand over fist Yo Pauly's.  Would definitely hit them up again when we are in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uFt59YJ5sWY0mPUgJrwblg"
  },
  "nDK8ATuzmFAMz8GFj5F9dw": {
    "date": "5/4/2014",
    "text": "I really liked this place. I had never heard of it before and went in based on a friend's recommendation, and I was really glad that I did. The pizza slices are huge, but more importantly they are delicious! I just went with pepperoni, but I'm looking forward to going back and trying their other slices.   Oh, and get a cannoli if you go there. SO GOOD!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bYyomE-ZL3cHFXykwGfpIg"
  },
  "scYXxfSkvDl6zlNGLilcJA": {
    "date": "10/29/2011",
    "text": "I took my team (9 including me) here recently for a $7 14\" cheese pizza special they were running for October. We ordered 3 pizzas (two with one topping), a couple orders of the garlic knots, a large Caesar salad ($8), and some sodas for the team. I felt like I had sticker shock when I got the $65 bill. I didn't realize how expensive the sodas were ($2.5) each and I think the toppings were $2.5 each. I also think the basic Caesar salad was overpriced. Clearly it all added up really fast!   Other than that, the food was great. The garlic knots were insane. If I wasn't going to the fair after, I probably would have taken an order to go. Plus, the owner was very friendly and grateful for our business. He and the food would make me go back although I do think there were overpriced components to this place.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Y_2jMUKz6pvJ0JSWG3u10A"
  },
  "w_T5DqJQVvLoT739k3QRNA": {
    "date": "12/30/2017",
    "text": "This is a great place. We did carry out and the pizza was so good. I ordered the pasta and for me the sauce was a little too spicy but it was tasty . The canoli was outstanding. I'll be giving this place another shot no doubt.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zrUHC7UGh1OqHSRThylLzA"
  },
  "p9nmIFb4LdFVA2PaxRAt8w": {
    "date": "2/3/2018",
    "text": "Such a delicious pizza! I had the sausage, broccoli rabe and ricotta and it was as good as an east coast pie.  Delicious for days (because the large pizza is truly large).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jYrAZeBG1YaXrvcrWduO6Q"
  },
  "FI5PfWw2IxIm1YPMRT680g": {
    "date": "1/23/2018",
    "text": "Please refer to my original review. This is the best pizza in the valley. We had a little misunderstanding, thus my negative review, but the issue is resolved, so I take it back. Yo Pauly's always has & always will deserve 5 STARS. I will always eat here & always continue to recommend it to EVERYONE.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bXP6qqtmDlughN1XcN1HVA"
  },
  "R6baeVl15AYRWDHf2wRmQQ": {
    "date": "4/29/2017",
    "text": "Great Pizza, Great Service Enough Said !!  Love, Mary & Carl Knapp :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "19l5HDscHZMiejs2V7c0YQ"
  },
  "n8zILAhBQy4RLOPObBxDrw": {
    "date": "2/9/2018",
    "text": "Yo Pauly's is the BEST pizza in town!!! Amazing service, great food and great lunch specials!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_uEn3cxgJ0eDt8T_JzC3Wg"
  },
  "SR4D80XBGPboOid0O-ackA": {
    "date": "1/15/2017",
    "text": "We tried this place based off of reviews and some of the best pizza! Their delivery was fast and the pizza was hot and fresh! The  cannoli's were nice and fresh and even came chilled with the ice cream fill.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nUQHXlFGs-5KJlPpKIuBIA"
  },
  "5c4oojqQOTErJa8Q5u2D6g": {
    "date": "10/21/2017",
    "text": "Got the monster 24 inch and it was perfect-o as we say in Jersey... good group of guys working the place. Maybe they own it. Maybe ones Pauly. I dunno. Lots of pizza places around. This one is unique.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wsE9Q8U3rEAQgvWF6nEsUg"
  },
  "QP2vM0FUcVaAp2XRS1mQTA": {
    "date": "7/6/2018",
    "text": "This place was so good! It was my first time trying it and I was not disappointed. Just ordered a plain cheese pizza but it was delicious!! This will definitely be my new go to pizza place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5i-CY0znGssKeypD1SZO6g"
  },
  "mGps1Z1QoDtcM1pER7dT_w": {
    "date": "1/2/2018",
    "text": "Awesome east coast, NY pizza joint. The staff is so funny and pays attention to every detail. We have been looking for a genuine place to east some yummy pie. The crust is light and airy, yet crispy. This place is a must!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4YtBCyPeejwtQ2h6hvgC9w"
  },
  "CucdgHlJs3xWi6dPDHhBCw": {
    "date": "4/22/2018",
    "text": "Man, this used to be my favorite pizza place, but tonight changed that.  I called and was quoted 30 mins for a take out order, and arrived after about 25 mins.  The girl at the counter said that it should be about 6 mins, and I sat and watched the folks come and go.  I paid close attention to the pizza's that were sitting on top of the oven, and figured that one of those had to be mine.  Well, after 55 mins from my call, they said my order was ready.  Unfortunately my pizza was one of two that was sitting the whole time on the oven, and I called them out about it.  They claimed they just boxed it up, but since I had nothing to do while waiting except to pay attention to the pizza that was on top of the oven, I know that wasn't the case.  And, of course, when I got home the pizza was cold, and pretty much a waste of money.  I understand it gets busy, but don't call me a liar when I call you out, just own it and make a fresh pizza...no point for me to wait 55 mins and then make something up in order to wait another 10.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VyYiA5WHCN7SgujdxDdHGw"
  },
  "B7ENgrvM4QwY2n8Pz5Qo2w": {
    "date": "10/11/2017",
    "text": "Tg only real \"New York/Jersey\" style Pizza in the area.. it's very we it's owners us from Long Island.. enuff said.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GHlG95AIO8eN3HmIKsnZqg"
  },
  "A_6wInCYb1N5mipMubhQJw": {
    "date": "10/22/2017",
    "text": "Friendly bunch of guys, great service, they made me feel at home as soon as I walked in the door.  A good pizza starts with a great crust and this place has it.  Salad and wings were great as well.  Thanks guys!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OOL6Q3Aj-hfgUI4DJ7VoiA"
  },
  "AA_kYLV0qTJZBzoF8c7zkQ": {
    "date": "6/14/2017",
    "text": "My husband and I placed a take out order here and it was AMAZING!  We got the white pizza. The fresh garlic really was fresh garlic and it had big chunks of ricotta. SO GOOD. My husband got the chicken wings (extra crispy) and they were perfect. The customer service was great. The best part was when we asked for ranch it wasn't this tiny little container - it was a HUGE container of great ranch! 3 of them!! Thank you, Yo Pauly's NY Pizza Co. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GJE0kJ0EuopxsnEUWB_JIA"
  },
  "biGyHuVvB6tJ3_0UW0b4HQ": {
    "date": "10/6/2017",
    "text": "Best NY pizza and I am from NYC.   This is the only place I go for pizza.   The baked ziti is also authentic.  The Greek salad is very good as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9R66qSElDudAvga9x91D9Q"
  },
  "ja2VEKoSC_IGJGbHoe0dfA": {
    "date": "9/3/2016",
    "text": "Mother of god! Perfect crust, perfect sause you name it and custimer servise! Legit NY pizza here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FBZL0-_jMsYdc4EgrKOliA",
        "caption": "Photo of Yo Pauly's NY Pizza - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FBZL0-_jMsYdc4EgrKOliA/o.jpg"
      }
    ],
    "user_id": "9lTAufK5AwZ8323Se6PvLA"
  },
  "I0YYNUtHfpyfe48jD4xE7Q": {
    "date": "1/29/2017",
    "text": "One of the best pizzas I've ever had.  The ingredients were fresh and tasteful. The cheese is out of this world,  just wow.  We had the 24 inch pizza,  enough for a big family.  Our first time here and we loved it.  Keep it up Pauly",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YmnSgJLSJD9kKwVLw4s93w"
  },
  "tVRVw98qsgqUZO8c9q96Gg": {
    "date": "1/12/2017",
    "text": "I have to thank Pauly. I have a dental office here in Scottsdale. They normally have a minimal amount for delivery which we didn't meet. Paul went out of his way to still make our office luncheon still go off without a hitch. I forgot how incredible his pizza is. Truely a Brooklynites favorite. Thanks Pauly, from all of us at Puma Dental. Dr Schwartz",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mlFHCWZudGIvn9fTpuod3A"
  },
  "7J4CXDS7xuBSx7KEuyXgAQ": {
    "date": "7/5/2018",
    "text": "Was recommended to me by a friend who said it was the best Pizza in town. I would have to agree!  Friendly staff as well!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YEgmPTV0pKOzSL2DRSPgEA"
  },
  "nq0i-c_X9QGNKJEFSqo3ng": {
    "date": "1/7/2018",
    "text": "This is one of my favorite pizza places in Phoenix. The pizza is delicious! Super fresh toppings, always cooked just right, and they offer a HUGE 24\" pie which is great for our game nights. My favorite is the Madison Square Garden pie, which is their veggie pizza, and I love to get a side of garlic knots. I'm drooling just writing this review!  We typically get take out and every time I've gone in to pick it up they are total sweethearts. Seriously, these guys are great! I have been coming to Yo Pauly's for about 4 years now and I absolutely love it every single time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ux8tlzv-Zt-MyprxSQdtRA"
  },
  "PVyk89rvWs47HNb9c-G1tg": {
    "date": "3/24/2018",
    "text": "My husband and I have lived here in Arizona since 2010 and have gone to just about every place for pizza. Finally found Yo Paulys and hit the jackpot. Truly a New York Pizza. We go there at least 1 time a month. Their cannolis and zeppoles are spectacular.. All home made! Do yourself a favor and check them out. You most definitely won't be disappointed!!! Manga... J & H",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mXEutlL3dFfNCK0EtTEzDg"
  },
  "HVOPE2cF3JuPk8U9cthvig": {
    "date": "11/25/2018",
    "text": "Best pizza in Phoenix! Real New York pizza! A hidden gem behind the Italian market. Slices are gone before I get out of the parking lot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FpKOs77ZUzYBgS_Z1eJ6kg"
  },
  "syYzsnusxvpMC1BPwxfvig": {
    "date": "3/11/2018",
    "text": "This place is amazing! Small but everything we tried was the real deal! Must try the calzones, egg plant parmesan, and the canolies, oh the canolies! This TX family will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8altrKdh09TI2tG6xVzwYg"
  },
  "9CY576u8jlznfG93mWWq3A": {
    "date": "8/15/2017",
    "text": "I ate at Yo Pauly's again last Weds and as usual it was great. Living in Chandler makes it hard to eat here more often, but I will try harder. :)  The Garlic Knots are as always incredible as they give you a complimentary order with Dinner.  My wife ordered the Chicken Parm Dinner and it was amazing. I had the left overs and it was. :)  My son in law and myself ordered the Stromboli and the taste was incredible. The only thing was it was a little well done on the bottom, but delicious. I also ordered a White 18\" Pizza to go with some Cheesecake. We had some the next day and the pizza was wonderful. The cheesecake was very good.  Now, I have to try to talk Pauly into opening a place in Chandler. lol. I would be there every 2 days. :) You won't be disappointed with their food. Great New York food.   A side note, the service was a bit off that night, not many people there on a Weds night, and two young men were kind of talking too much to each other than taking our order. I tried to get their attention for awhile. No reflection on the food, just hoping next time they will be a little more attentive.. Still give it 5 stars.. Hey, I'm a New Yorker. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bddUo7w9fuHk3GOaPJ2kLQ"
  },
  "Epy2PNR_lRhlHsAiSr7RIw": {
    "date": "6/7/2018",
    "text": "YO! Pauly's!!! WOW!!! This is authentic! There's really no other way to describe this pizza! This is the pizza of all pizza! All the ingredients are fresh and what tops it off is the owner and his staff. Such a great experience. We come out here from Lake Havasu City and Yo! Pauly's is now a mandatory stop. Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lub5C5D3fO_7RwcyeI5kEw"
  },
  "HwH9TPiHuiwi7Lrc_geobg": {
    "date": "8/28/2017",
    "text": "I'd give Pauly's 6 stars if I could.  I'm a Brooklyn native and this is the only place in Arizona that knows how to make a True NY pizza.  The crust is hand thrown, thin, and crispy right to the center.  The sauce is garlicky and has just the right amount of salt.  The cheese is fresh and does not overpower the pie.  Forget the wannabees with NY in their names.  Pauly's is the real deal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i0cc4tZ0K3J56fvebxpvGw"
  },
  "KE-xBaqOHl0meT39YiOr_Q": {
    "date": "4/11/2018",
    "text": "I've always struggled to find good, simple, New York-style pizza in the Phoenix Metro Area, but fortunately I finally found Yo Pauly's . The pizza is delicious and exactly what I've been searching for here in Phoenix. Additionally, the staff are extremely friendly and professional. If you're from the east coast and have found the pizza in Phoenix lacking, i highly recommend Yo Pauly's. I can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xjd1LR7fAy9j0SM2FNt10w"
  },
  "D6FMkKknFH0N10oEaEfvSw": {
    "date": "4/9/2018",
    "text": "Great lunch specials! The Whitestone Bridge Pizza is incredible. My husband got a pepperoni and a cheese slice and said it was the best pizza he's ever had.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L_Mgp65onodK2eNCKA_WSA"
  },
  "1wNasMuHfBGPKigK01tZtg": {
    "date": "10/6/2018",
    "text": "This is my first visit to Yo Pauly's and let me just say if you want good pizza you come here! Service is great! Must try the garlic knots!  Highly recommend Yo Pauly's!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fxp8Z0JlUALRDaVoaA-U1w"
  },
  "E2msxxYiF-PQJppOhSg03g": {
    "date": "4/28/2018",
    "text": "What a fantastic surprise! A total hidden gem. The food & service were great. Ordered a cheese pizza and the baked ziti. Baked ziti was one of the best and something I will order again. One of the best pizzas I  have found here in Arizona & I would highly recommend Yo Pauly's!! Can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QjB8Dgypw0YqfKCJ7U2KYg"
  },
  "T1Mx5IhyH710-d_oGJUJVA": {
    "date": "3/15/2018",
    "text": "Definitely the best NY style pizza both my wife and I have tasted in the Valley and would highly recommend. Meatball parm sandwich is outstanding also. The place is small with limited seating with no bar but does serve beer and wine. They DO prepare a 24\" True NY pie too, feeds several people. Enjoy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rRfx0TVMZ5NvdBkN8555Tw"
  },
  "guZ9mv0IFHw4JOgrvxoKug": {
    "date": "11/15/2018",
    "text": "My wife and I were looking a pizza place.  Thankfully we found Yo Pauly's NY Pizza.  I was in NY two weeks ago and this pizza is spot on.  I know where I'll be eating the next couple of days.  I can't wait to come back.  By the way, they also have cannolis.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WQWmWv-cWwS6mvo-4wbQLg"
  },
  "Q3q0h5CljqGUuHYPSP0fUg": {
    "date": "9/29/2018",
    "text": "Excellent sauce, very good pizza overall. Greek salad also good. Service in the restaurant is great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5s8DH-fmB_eAYrSRZ5iK5g"
  },
  "LFQM-jKozMcPww5_VM8SrQ": {
    "date": "3/18/2017",
    "text": "I agree with Marcus. I'm an east coast transplant also. The pizza here is pretty good for AZ. The baked ziti was mushy and bland and the top crust mozzarella had meatball in it. Weird. Just stick to the basics, because it works, ya know?   We also got a salad with chicken. The lettuce was green and fresh and not many bad or rotten pieces, which is rare in restaurants. The produce was very good. But the chicken was cold, definitely not grilled fresh and put on the salad. And it also tasted like it might have been pre packaged with preservatives. Not good.   The sauce is sort of sweet but also acidic and the food is really rich. I think the sauce is what really makes Italian food good, and the sauce here just isn't great. I've had worse, but I've definitely had better. I had high hopes because I heard these guys are from NY. But It's just ok. Not great but not terrible either.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Dnf_R1HYEWruga6bDRJPhQ"
  },
  "n9vq3QaVGSzH4fE1C098tQ": {
    "date": "1/20/2018",
    "text": "My first visit to Yo Pauly's was several years ago. I haven't been back until last night,  and our visit did not disappoint. The service and food was absolutely amazing. Pizza is flavorful and fresh! One of my top 2 favorite pizza places of all time. It's very far from my home, but always worth the drive. If you haven't checked out Yo Pauly's,  I highly recommend you do.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ewtL3plKywXuLtmFZoUczw"
  },
  "rF7MRopap7Z9lmyoI4Qr4g": {
    "date": "10/6/2018",
    "text": "Really good, no BS pizza.  Reminds me of the stuff you get on New York City.  In a city crawling with Chicago pizza, this is a welcome respite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GMuozn2XneXCbTFfGTLaeQ"
  },
  "9qZQOqlm-kYh_mZ_j52t-Q": {
    "date": "3/4/2017",
    "text": "Yo Paulys makes legit NY style pizza....period! Tested by me....a New Yorker!! I watched Pauly at the oven for 30 minutes and he is legit!! The True test of their pizza was the reheat test.......3 days in the fridge and those slices heated up in the toaster oven to crunchy perfection. Good dough baby....good dough! The end.... :)",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XY9LvJU8DwY2jsxJSUOivA"
  },
  "AVFsS3VgbKiM2DPbccRVAQ": {
    "date": "9/29/2018",
    "text": "I finally  found a place with pizza almost as good as the pizza in New York. Try the 24 inch pizza it's huge. Will certainly stop in whenever I'm in the neighborhood. If you like real New York pizza this place is for you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lybJO_ujbkzkNhresofLSQ"
  },
  "2lGAmMDm4Bf5-dTI3uVEag": {
    "date": "3/27/2018",
    "text": "I am originally from Connecticut where that classic east coast pizza derives from and I have eaten at many of what I consider the best pizza joints in the New England/ New York region of the U.S.  I can absolutely say Yo Pauly's is the best slice of Pizza I have had so far on the west coast. Everything from the dive atmosphere, and the friendly & personable staff makes this joint so classic. My first time ever eating here I felt like I knew the staff as if they were already my boys and that is the type of atmosphere that gives a good slice joint that edge in service.  This pizza truly has that authentic east coast quality and you can tell just by the ingredients they use and the way the pizza looks upon arrival. A classic thin crust, well done pizza, just the way its supposed to be. These guys know what they are doing.  Will be coming here from now on!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7EUxWSSkMB6k2v4762rATQ"
  },
  "aN7ZPFFo0eCiJSXjnfWqcw": {
    "date": "1/8/2018",
    "text": "This place is a hidden gem with great customer service! Their lunch specials are great and they have a variety.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sPOVeMXUqUpnm9PzUeSczg"
  },
  "Yz5dfYbaHGU1AplLYHFPLQ": {
    "date": "9/4/2018",
    "text": "I tried thus place today. Their ziti is exceptional and salads are awesome when your there try their garlic bread. Pizza brings back memory's like New York style. I would go back every week.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wwS6vbqtRRYt1lDCc53fBg"
  },
  "Sps8O5Cx3AflsBUiu1_dLw": {
    "date": "6/7/2011",
    "text": "Great pizza! Authentic NY style. I eat there almost every week.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gQG-ztc_U_apGJqqbXPNBw"
  }
}