{
  "_BV4wd1_NGv10UqgPRPkhQ": {
    "date": "8/30/2017",
    "text": "It wasn't the best. I had pretty high expectations. Maybe it's because I'm used to actual traditional Mexican street tacos. The tortillas were very good though.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "93BEGv7Xy6zoHBQNBB8ebg"
  },
  "VoeGBkJ4gjfESw9GvLws0Q": {
    "date": "7/9/2017",
    "text": "The tacos were not worth the price, they were semi-alright tacos but just not a taco that is actually worth 3$. The tacos here are really overpriced. I order two corn carne asada tacos without cheese and they still got the order wrong. The tacos were filled with grease! Grease kept falling out of my mouth every time I took a bite and that pretty much ruined the experience for me here.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kaWkQskemvxZhKb1MRnTYA"
  },
  "Tuj3NiZBUj_4cPOC64Od4g": {
    "date": "2/7/2016",
    "text": "I've never had street tacos before, and these were awesome! They were super simple but so good! Your choices are either steak or chicken, and each taco just has cheese and the meat on it. Then you can top it with choices of a hot red sauce, a green sauce, lettuce, pico de gallo, and limes.  They are a very reasonable price and very delicious! I really enjoyed them and would definitely go back when I'm in the area.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "u3QxrLwAFum2fVte8tm7Kw"
  },
  "E7M5bFJxOry084SM6NtEwg": {
    "date": "5/18/2017",
    "text": "I'm a fan. Picky with street tacos too. They keep it simple with Carne or Pollo. good size portions, even on taco tuesday. fast service and clean location. careful, the sign doens't lie! the red hot salsa IS fire!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jxvPwLY3U0a-Cpwd7O6kPA"
  },
  "SWBhjM6DYx86czdfrxAzLw": {
    "date": "9/17/2017",
    "text": "We tried the Thunderbird location after reading all the great reviews. We were not impressed. The menu is extremely limited. The only option for my vegetarian daughter was a quesadilla, which was two small tortillas with cheese in the middle for $2.65. The quesadilla looked like it was pressed and so as it was flattened the cheese that spilled out became crispy. I ordered tacos, and while they were larger than the typical street taco, it was nothing spectacular. The chicken was bland and I found a few pieces of chicken bone in my tacos.  The tacos are almost $3 each and chips have to be purchased separately for $3.50.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UrYd6QAN_--DgnuXUNqIRw"
  },
  "TNXNsKfEuRMYxmc9R-Q93Q": {
    "date": "3/19/2018",
    "text": "Meh. I USED to love this place until my visit yesterday when there was a new mgr. A lot less inviting and the meat was not freshly grilled. They ask you to sign up for their rewards program and something about a free taco when you do, it's also on yelp. Yesterday I went and 3 people were working, none of them greeted and when I went to order, they asked what do you want? Normally the old manager was super polite and as anyone came in she would say, WELCOME TO WADAA TACOS! with a smile. The new mgr barely uttered a word while we were there and it looked like all 3 of them workers hardly said one word to each other in the back. It was like they did not want to be there, awkward. My 5 year old even asked where the nice lady was. Usually we see them grilling our taco meat fresh, this time we seen them scoop it out of a metal container and spoon it onto semi cold corn tortillas. By the time we got our tacos, it was soaked more than normal in fats and looked like it was just carelessly thrown together. While we were there two guys came in, no one said one word to them. It was odd considering the old manager (either native or Mexican lady short with dark hair) would always beam with a smile and greet every single customer. They stood around for a bit and when no one finally said anything to them, they just walked out. I politely asked if the point system works because I sighed up a few weeks ago and received no text. The cashiers response, I don't know, I don't deal with that part *walks off*. The new mgr saw me asking and offered no help. A few minutes later she leaves carrying  her belongings looking unhappy. This may not be a big deal, but the reason I was drawn to this place was the freshly grilled meat and the inviting atmosphere. Looks like the old mgr was much nicer that even a 5 year old noticed. Pretty sure we won't be back. Prices raised  as well. $3 tacos now. Used to be $2, then went to $2.55.t",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7ID3XfDE-b1yh6IkpyI2wg"
  },
  "3L-L6VWTG7jYuI4qfarY3g": {
    "date": "5/29/2017",
    "text": "Came back in tonight and couldn't be happier. The staff was excellent and the food and salsa bar was on point and delicious! I'm looking forward to my next trip and hopefully meeting the owner to compliment him on his establishment.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hYK4MQ1nPngrZX71-3pyig"
  },
  "BIlQ9YS--tuVvP4jrt9-uA": {
    "date": "4/13/2018",
    "text": "Great tacos ... people are friendly. Looking for a great taco stop by for the experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rOhKXDaazt4W9R8y38ggiw"
  },
  "xHOZkn01NXX6WYWp0-etbg": {
    "date": "4/21/2017",
    "text": "Gave one star because 0 wasn't a choice. The salsa bar looks one step from Ebola central. They said chicken 4 times, even though we ordered steak. The meat looks like jerky and couldn't be more dry. The place didn't smell like food, not at all. Horribly disappointing and tasteless. 4:30 on a Friday and it's dead. That should say something. They told us to have a good day when we left, if they had looked at the food they served us, they wouldn't have bothered. Filibertos, we will be seeing you later tonight!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "13F6gDJ40Ylm6ZBqaDjBYA"
  },
  "OLGuZ8883wOacdwi28BBQg": {
    "date": "2/7/2016",
    "text": "Dude. These tacos are BOMB. Now my 5-star isn't the toughest to obtain but if I say \"WOW that is a good taco\" multiple times, and the service is kind, and nothing else goes quite wrong, it gets a 5-star.  Chicken was AWESOME and grilled legitimately, and same with the beef. Warning - the red sauce is pretty spicy! Give it a shot before you douse!! Green sauce was creamy and WONDERFUL. Pico de gallo and limes added a great touch. Would love to hit it again someday! Give it a shot if you love street tacos.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kXR3CaSuo2X2YQHMO0XoUw"
  },
  "mWNJv6iwoNe8-YRNnh3DTg": {
    "date": "3/10/2017",
    "text": "Love Wadaa tacos! But everything I order thru UberEATS they forget something! Still I feel like Wadaa should get the order correct! So sad!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RIH4l6K4udm--9iLqK9-Qw"
  },
  "zhVyAikdfJh9WXOEJJQ1gg": {
    "date": "10/19/2016",
    "text": "Food was great no complaints and im extremely picky taco critic,by far the best ive had in phoenix.I recommend they are fast, fresh,authentic, I recommend the chicken,great job wadaa keep it up.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JEJZUM2SK8hw1L5a9uc6ag",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Wadaa tacos, best place for tacos in phoenix.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JEJZUM2SK8hw1L5a9uc6ag/o.jpg"
      },
      {
        "img_id": "zQZw789b3Rz-du6YRqNnZw",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Wadaa tacos, best place for tacos in phoenix",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zQZw789b3Rz-du6YRqNnZw/o.jpg"
      }
    ],
    "user_id": "LfbWnWWBW66W-5gSgiPO7g"
  },
  "2HRxYkWnkXtV8FhcODOpgg": {
    "date": "7/9/2017",
    "text": "SO delicious. Do your belly a favor. That grilled flavor is not something you're getting everywhere. Smoky, yummy... Mmmmmm",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JLV-DkUw31o65sysZ48l1Q"
  },
  "BsB87ZrCgYlZeJNtJEmRmg": {
    "date": "3/20/2016",
    "text": "No seats, no sides, just tacos! This little taco stand is simple but amazing. You can get either chicken or steak tacos, each one is $3. They come with just cheese and the meat and your choice of toppings that you add yourself. I highly recommend the pico. Just be warned that there are some hot peppers mixed in.  If you like spicy, get the hot sauce too. Very good but the heat creeps up on you fast.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eCJDs0dzrPAzlqVxgUfnvw"
  },
  "yWO_JPhhjOr2cQAKMyUxNA": {
    "date": "3/2/2018",
    "text": "First timer at this place. Good tacos, and as previously mentioned from another poster, think they cook the meat in batches. At least my food was prepared that way. Anyway, it's still tasty, yet bit pricey in my opinion.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xGPVz0VHZuDlAQLvD3uLKA"
  },
  "uWZODyigy-GfHmHSHhBtRA": {
    "date": "8/15/2017",
    "text": "My husband and I were on our way home from a concert in Tempe last night and were hungry. My husband suggested fast food, which I wasn't keen on since it was so late and I intended to go to bed soon after we got home. This prompted me to head to trusty Yelp and try to find something better and still open. I'm so glad I checked it out b/c I found Wadaa Street Tacos and it happened to be just off the freeway on our way home. It had the best reviews of anything open at nearly 11p on a Monday night and we decided to try it.   WOW! We were not disappointed! The menu is super simple w/only tacos, a quesadilla and beverages. This made the ordering process very easy and our food was ready quickly as well. I got the Carne Asada tacos on corn tortillas and topped them w/all the salsas, onions, and pico de gallo they had which made my taco taste so good and fresh! I was happily surprised that regular sized corn tortillas were used b/c I was expecting the small corn tortillas. I was glad I had ordered two instead of three as I was barely able to make it past one and a half when my husband helped me out and finished the rest. He ordered the Pollo tacos on flour tortillas and was equally pleased with his meal! He even complimented me on having found this place so quickly on our way home! I also picked up a pack of small flour tortillas since we were running low at home and the were delicious warmed up with a little bit of butter!   The interior is clean, basic, and well decorated w/awards and community photos.  Being right off the freeway makes it a good place to stop off and grab a quick bite before you head back on the road!  Since this place is on our way to/from home, I know we'll definitely be coming here again and can't wait!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L_8LydLhpceNEKzIPo75Qg"
  },
  "ZYv1E2F-ip8M3vXING2B1Q": {
    "date": "5/15/2016",
    "text": "Loved it! It has an ethnic feel in a very urban place. The food and service was amazing!! Must check out for tourist! (Preferably at night)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "x43Rjo-149SnfqpmIrNqxg",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Steak tacos. Yum",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/x43Rjo-149SnfqpmIrNqxg/o.jpg"
      }
    ],
    "user_id": "U21PmnJRw6I2rEhqX5pRIw"
  },
  "YLMGzfCVuELKHJ_hD6OKQw": {
    "date": "4/7/2017",
    "text": "This place is legit! Nice clean establishment with 2 big family style tables to eat at. Restaurant also has a garage style door that they open during the nicer weather months that opens onto a patio with more seating. Now to the good stuff, the TACOS! Your choice of Carne Asada or Pollo with either corn or flour tortillas. They also have a quesadilla option but nothing else and trust me you don't need anything else! The tacos are the bomb! They have a fully stocked salsa bar with everything from limes to roasted peppers, 3 or 4 different salas/hot sauces to choose from and even the onion/cilantro mix that every good street taco needs. During the week for lunch tacos are only $2ea from 11am-3pm. Normal price is $3ea. during other operating hours. I used Yelp to find this place and can't wait to go back and brings friends and family!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5mJV1AtbVmPJfVCxXYTyAQ"
  },
  "tUE3B6f7rG5GYVhZlTELeg": {
    "date": "3/8/2016",
    "text": "Delicious, fast and great service! Perfect for lunch or late night meal. Everything is fresh and made to order!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DmYZZkPfCdJ1yN8xWooZJw",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DmYZZkPfCdJ1yN8xWooZJw/o.jpg"
      }
    ],
    "user_id": "AMXZ8UpU8q2WjJJf7ybFfQ"
  },
  "_La623WqCnO2LMWZplQIuA": {
    "date": "4/23/2017",
    "text": "His place is great. It's great for the munchies or a late night snack because they are open pretty late. (1AM) the indoor is pretty small. With 2 large tables with a self serve condiments bar. This place is also really tready and has a open space that leads out to a patio with outdoor seating.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hgSvHwCles5N8kSC-loINQ"
  },
  "W01Uj8ivHPZM1RU0G1Z22Q": {
    "date": "10/16/2015",
    "text": "Damn....as soon as you walk up you can smell the deliciousness! Closest thing I have had to street tacos in Mexico in a LONG time! These are great!  The meat is perfectly cooked and the Service is friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5AVOKgt2LvrGZYeSfxMygA"
  },
  "vBsN3xmXlkrDUH8MuCbioQ": {
    "date": "1/9/2016",
    "text": "I go here for lunch at least twice a week. GREAT tacos! Say hello to Gabriella for me!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BZAhUYnMUQVXVdnBWNccuA"
  },
  "BhYY1zpeL9sj0JR828dvqw": {
    "date": "11/9/2015",
    "text": "New favorite for street tacos in Scottsdale - simple, cheap, and very good.  Homemade salsa has some heat and very addicting!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OMn1-WPcDkehWGegAz-E2Q"
  },
  "rl27EzdCIGyZdtsEjjO2cw": {
    "date": "7/9/2015",
    "text": "Don't let the limited menu and hole in the wall venue fool you. This place has the best tacos in old tow. The meat his cooked on a wood stove giving the meat an authentic flavor. Their homemade verde sauce is very tasty. Best tacos I've ever had.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WYTcRh-BMVzTO8tU9P2Qsw"
  },
  "iHDC9uLRXV8DlwfsMCF6ag": {
    "date": "4/25/2015",
    "text": "They mastered the hole in the wall/taco stand look, thus it looked very promising while sitting at the bar across the street.  I have to agree with the yelper that said it will mainly appeal to the drunk partying crowd.  I like my food authentic so when the server asked me if I wanted cheese with that, I knew that this was not the place for me.  Plus the bar had shredded cabbage and pico de gallo.  All the taco stands, authentic Mexican joints, and roach coaches I've eaten at, when you ask for carne asada taco con todo (with everything), it's usually dressed with onions, cilantro, and salsa.  I was also looking for cut up radishes and pickled vegetable medley (onions, jalapeno and carrots) at the salsa/self serve bar and no dice.  :(",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M3wC8JtWO0hEIzWYxJd_Mw"
  },
  "3hS-b2G-nfTlvwXztKSm-A": {
    "date": "1/10/2018",
    "text": "I have been going to this place for a while now for their lunch special and it has been great... prices were good and the food was great.... bu today was a different story I walk in normal buisness but I find out that they raised the prices on their lunch special which is kind of a bummer but oh well I just got 1 less taco.. second the salsa bar looked empty everything wasn't even put out i had to ask for salsa and guac.. then there was one of the employees that brought her lunch inside and was having a loud conversation on her phone while cursing and yelling about her living problems which was crazy unprofessional... so not only did the prices go up but the quality of the employees went down... guess I will have to find somewhere else to eat this happened today 1/10/2018 at 11 am",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "7zRZfJYmhRxvYPa79KpqCw"
  },
  "DCQIh20Lr35lOyLO58qCXA": {
    "date": "4/7/2018",
    "text": "I had carne asada quesadillas and oh my were they delicious! I love their salsa bar for chili options. The chef and the lady who checked me out was so sweet and welcoming. It's also a very clean restaurant. I will come again and bring my family!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V_7hQ-RaJQrQVcKLLcEeoA"
  },
  "tkFoYvGjLFY_DMARLH2tpA": {
    "date": "12/28/2017",
    "text": "I've been to this location about 5 times now, and each visit has gone down hill from the last. It's gone from fantastic, hot, flavorful, brag worthy food to cold, stale, small portions and definitely lacking customer service. Young kids at the counter and cooking food seem so bothered to take your order, payment and cook your food. How is the food cold if it's made to order?! So so disappointed because I really used to enjoy this place. When the owner/manager is in, everything is in point. However, when he's not, I'd rather walk out.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "nGi8dtOFJl4KQVoYHJ2rVQ"
  },
  "qJpKf5YTBY0h1BmXDoKcTg": {
    "date": "6/19/2016",
    "text": "After a day of shopping, the last thing I wanted was to eat in the food court or go to a chain restaurant so it was nice to stumble across this, a few minutes walk from Fashion Square on a one way street.   The service was friendly, the food came out quick and most importantly, a good portion of meat on my carne tacos. The meat was nicely cooked and the toppings fresh, which ultimately made for a tasty and quick lunch. The only downside? Not much shade eating out on a sunny Arizona day.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "JyxU6E2s2hMmnjBCYj6uyg",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Carne + Cabbage + Limes",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JyxU6E2s2hMmnjBCYj6uyg/o.jpg"
      },
      {
        "img_id": "x8Ihx0yAI8pTuQ5FETghtw",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Carne Asada + Cheese + Salsa Fresca + Cabbage",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/x8Ihx0yAI8pTuQ5FETghtw/o.jpg"
      },
      {
        "img_id": "KH9Y4fyqnAiqm0AeYXaqPA",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KH9Y4fyqnAiqm0AeYXaqPA/o.jpg"
      }
    ],
    "user_id": "uYc-1zHkxPgQE19ciyK4sQ"
  },
  "Yz3TKnA23QTPMEtLh-cX5Q": {
    "date": "1/22/2018",
    "text": "Disappointing. We spent $43 for cold and flavorless tacos. Save your money and go to salsitas. Don't be fooled by the pics. Don't expect authentic tacos. Place looks clean and customer service was nice",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "a86A6OBsA34iY-DcPG02Vw"
  },
  "sgwN1VOGsJfi33zh-DlcPA": {
    "date": "5/17/2018",
    "text": "I plan events for a community in Peoria. I called Wadaa Tacos to see if they were available to come out on Cinco de Mayo. Their taco cart was luckily available. I work off of a budget and was able to negotiate with Miguel to get the price I needed. We have to pay vendors with a company check, and although Wadaa Tacos typically uses an app to receive payment, Miguel was flexible and trusting of me to get the check in.   On the day of the event two men came out to work the cart. They arrived and were set up with plenty of time. The men were very kind and professional. My director and I were very impressed with the taco cart and all of the food and salsa they provided. Plus, our residents LOVED the tacos.   I highly recommend Wadaa Tacos because of their professionalism, trustworthiness, flexibility, and amazing tacos! We will be keeping them in mind for future events.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T2MjW5GeFuODzHIweld9bA"
  },
  "Nb2r8Tfp9eNGYtwMzNwnaw": {
    "date": "3/8/2016",
    "text": "Good little taqueria in Old Town right in the Bar district. Only have two kinds chicken and steak $3 each with your choice of corn or flour tortillas. And good salsa bar.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "SMsFTrdFimKyZeTE2V6JWw",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SMsFTrdFimKyZeTE2V6JWw/o.jpg"
      }
    ],
    "user_id": "KxGeqg5ccByhaZfQRI4Nnw"
  },
  "UxLS8NOzXDWbBfah92Nl_A": {
    "date": "1/19/2018",
    "text": "If I could give no stars, I would! DON'T EAT THE TACOS! Don't know if it was the bad meat or the toppings that made me so sick for days, but I thought i would die! Avoid at all costs! Someone doesn't know what they are doing here. I mentioned something was off and they said I was crazy. Next day tho...ugh!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "a0eigNHiJVsezrOuPfYTuQ"
  },
  "IIdD0yE73A0O_BXIRD9KQA": {
    "date": "3/25/2018",
    "text": "Service was great and tacos were good. I would give them more stars but the taco bar ingredients were not fresh. Other then that, it was a good spot for a quick bite.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IZzkAUnRtJtw3tGNdZtrJg"
  },
  "YnCqx0AXzdnuLJMyvzEBdw": {
    "date": "10/14/2018",
    "text": "I created an account just to write this review. I enjoy trying new places but this place may be the worse choice I have made, as agreed to be my family. To start off the cashiers was rude. Place felt unclean. Salsa bar was unkempt. Tried their special street corn.. took one bite and closed the cover not going to do it.. none of the other three at my table wanted to try.. Street tacos Asada  had a weird after taste.. as I type this my stomach is grumbling... not going back a swing and a miss.. one out of five is generous...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HUs_7iIAFilvKkd_2hoqhg"
  },
  "ZaKA2PNHo9IqzoFufbocTA": {
    "date": "5/10/2018",
    "text": "Tacoooosss!!!!  I went at lunch time and the wait wasn't long. I got carne asada tacoooosss and they were pretty tasty.  They are a bit expensive for my liking ($3 a piece!) I didn't care for the salsa or hot sauce,  both were way too spicy but had no flavor.   Their customer service is on point though.  Would go again if I'm I'm the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MCDox9M2dDcHxPs3a3BdKg"
  },
  "uBnI3hY_TtTOOGBmqxWVrA": {
    "date": "5/9/2018",
    "text": "Worse service in Arizona for tacos! I recommend never going here! They got new workers and they are very rude and don't know how to make a taco for the life of them...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FBTja2Gl2qCYFM8KcPRwgQ"
  },
  "r2esQ_kge2LcCN-wyoJ2GQ": {
    "date": "4/28/2018",
    "text": "Okay food but kinda bland, the street corn was delicious though. Don't think the tacos are the best for the price to be honest.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0IEw1qcy0XuCA8wTe55U5g"
  },
  "ZeReq1ILrdi6n03-lLx93A": {
    "date": "4/29/2016",
    "text": "Located in the Entertainment District, I suspect most of their customers love it here because who doesn't love eating when they are drunk and quite frankly everything tastes delicious when wasted. But that being said, the tacos here are actually quite yummy.  There are only two types of tacos to choose from: beef or chicken. I love a place that keep things simple. Each taco is priced at $3 a piece. Order your taco, get your taco, and dress it up however you'd like at the salsa bar. I came here during daytime and the toppings from the salsa bar was empty and looking like it was from last night which was kind of a turn off... But then again this place is pretty divey so I wasn't exactly expecting much.  Overall, I think the tacos speak for themselves. Simple, tasty, A-okay!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "7Dykd1HolQx8mKPYhYDYSg"
  },
  "LTeVaciOmMKIl4x0XP2RBw": {
    "date": "7/5/2018",
    "text": "Terrible service.  Messed up my order and sent m 6 I teas.  And one taco.  They blamed Grub Hub and Grub Hub gave me no justice.  Like I would order 6 iced teas and a single taco.  I hope all read this review",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X5YhIXxlpH8-kZS7hBRSRA"
  },
  "oeMNn5ds1arC8Da5ALSgXQ": {
    "date": "3/29/2017",
    "text": "I'm very critical when it comes to Real Mexican Tacos. When I discovered Wadaa Street Tacos in 2012, I was pleasantly surprised. Miguel really understands what a real Sonoran street taco is all about. The flavors, the ingredients and the style of the street taco has been perfected by these guys.   I'm from Sonora. I know what a real street taco tastes like. Let me say, these are the closest you will get to crossing the border.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dYFuJTou16gTJIDl_I64AQ"
  },
  "uWmJ1NQP6pQwEcebV6AyYw": {
    "date": "1/14/2018",
    "text": "I pick up food orders here all the time and I am amazed at how high the prices are grant it this is during dinner time though. The employees are friendly enough but they are not efficient and fast. It shouldn't take that long to prepare street tacos let alone quesadillas. Anyways, I have since learned that have lunch specials as in $2 tacos so I am definitely going to try them out because the food does smell good and I always see patrons happily grubbing away but I refuse to pay the after lunch prices.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZQsculZs_WMVFnBGQee1EQ"
  },
  "Tq7qMVvgOdaPE8QZBB4VkA": {
    "date": "1/16/2016",
    "text": "WORST TACOS and misleading advertising. Let's start with the fact that just because you have a open window store front on a street doesn't give you the right to label you're tacos \"street tacos.\" Let's leave that honor to the proper establishments like King Taco in Los Angeles.   Moreover, a traditional \"street taco\" has the basics starting with and most importantly...A CORN TORTILLA, NOT FLOWER! Now if you're trying to have the basic \"street taco\" then you missed the point by just offering asada y polo. Maybe substitute your chopped cabbage, with some cilantro. Try substituting your liquid green paste with real avocado guacamole. Instead of generic store bought pico de gallo, maybe serve diced white onions. And last but not least, maybe substitute your ground red chile with water for some actual flavorful salsa.  I would like to note that I have never given a bad review in Yelp, but these tacos reminded me of eating a Taco Bell taco...only worse.  Oh, and I believe it is state law to offer your customers a receipt and not tell them that you can't or to come back in an hour, just saying.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PLhxuL7fQBBEMcjnOLMNUg",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Childs play!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PLhxuL7fQBBEMcjnOLMNUg/o.jpg"
      }
    ],
    "user_id": "gjeIXSxgc-79ZxI8iVESUQ"
  },
  "31E3fpANOQZNl9H_8M-swQ": {
    "date": "4/14/2018",
    "text": "I wish I could give 10 stars!!! The service was excellent along with the hospitality of Miguel being not only friendly but help you to feel comfortable almost as if you're one of their own family member... And the food speaks for itself absolutely no need to praise something that is not of this world...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o1_8AMhCCw-qAxo6GcwHPQ"
  },
  "3EQCSflb01pArhuBUb3Mbw": {
    "date": "4/12/2018",
    "text": "So Disappointed i ordered steak tacos 3$ ea and steak quesadilla 4$ea and corn 3.50$ ea. Wadaa fu**k salsa bar is nasty, service is poor, total cleanliness sucks and food serving is ridiculously small and nothing like in the pictures on their social media also wheres the authentic taste part? Freaking kidding me.. can hardly find my meats on my extra small size quesadilla, tortilla texture on tacos that I ordered like old and left open in the fridge! Corn that i order looks un appetizing taste like left over and just reheated in microwave! They serve it to me stocks in top of each plates so my food was touching the bottom of the plate! So nasty! Cashier and cook looks like they don't wanna serve anyone! So over all don't waste your money and time here! Its really wadaa sucks!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0gVkXDJT_r2qzAqp83tSAw",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0gVkXDJT_r2qzAqp83tSAw/o.jpg"
      },
      {
        "img_id": "h4SouOp4WCJ8Z7XUQvwPqg",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/h4SouOp4WCJ8Z7XUQvwPqg/o.jpg"
      },
      {
        "img_id": "AOUuZJDdbfLIfbVufAOrUw",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AOUuZJDdbfLIfbVufAOrUw/o.jpg"
      }
    ],
    "user_id": "SwPruH_pqrVD3iak8eOmcA"
  },
  "y_oExwhgvwTKk2c5wff_sg": {
    "date": "5/8/2017",
    "text": "I was expecting a clean, fresh, and tasty meat after the reviews.  I got just the opposite chicken tacos was very dried. Worst chicken I ever had, and the sides were old it didn't look fresh, or taste fresh, so it's quite disappointing being my first time experience here. I don't think I'll ever go back which is a shame it was nearby, but thanks for trying.......I should have went to Wendy's considering its on the same street and a second away.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xtlP3NGcsXbMdH3DWmFWRA"
  },
  "jNA1MxgEuydjCM7nT7_qMg": {
    "date": "5/8/2016",
    "text": "These are not street tacos. How are flour tortillas the default? Fail. They're way too large and overpriced. Not to mention they come with a surly attitude.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0CShii4C7Foiid1lzAnA2Q"
  },
  "rENfERAMY99mZrZTLQBLpA": {
    "date": "2/26/2016",
    "text": "These tacos are good. Really good. The tortillas tasted fresh and authentic just like the taco stands in Rocky Point. The meat was good and smokey and void of any gross gristle parts. The size was generous, larger than most street tacos. I do wish they had some pickled onions which IMO are a street taco staple but I'll let that slide.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WgGelmNHNLQOttARs07Uzw"
  },
  "V8A8v-B8VFMD0KMnmThQfA": {
    "date": "2/24/2016",
    "text": "Delicious tacos, quick service, and friendly staff. 2 tacos was a filling and satisfying lunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CBoDivUidOBwfTH1gH2suQ"
  },
  "Ayml3KFI3PPJmrWBmrKxVg": {
    "date": "9/13/2016",
    "text": "This place is awesome! I was doing for a quesadilla, so I looked on Yelp and found this place.  I had the streak quesadilla and the chicken taco, and while the questions was just was I was looking for, I eat blown away by the chicken taco.  The flavor is explosive in the best way. I recommend the Pico on everything!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JcYcX0gqeZEbvseD_qITKg"
  },
  "5thzvDZ8qJXlPrDClMB64w": {
    "date": "12/19/2015",
    "text": "Paid $16 for 2 disappointing street tacos. They were on one corn tortilla with meat on one box then the other had the toppings thrown in that box. If I knew $3 Tacos meant 1 taco on a single tortilla, I would've gone to Garcia's Mexican restaurant paid $11 for 3 street tacos with rice and beans. I will not be ordering from a place that left me hungry after almost paying $20 and unsatisfied. I don't recommend, Just go somewhere that will serve you appetizing food instead.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QsV_gjZb4bhbypw4zjqU8A"
  },
  "4S3Uj7APMI-K4j4VO9BJsQ": {
    "date": "11/24/2016",
    "text": "Overpriced. Not authentic. Cheesy seating room. Staff seemed stoned when we arrived. No soda machine, have to get a bottle of coke. Tacos are very basic and about twice the price they should be.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SiJfhPeVqodJZtB-5aQPRA"
  },
  "myxcJZC5_B2-D5--QJRR6w": {
    "date": "11/28/2015",
    "text": "I have came here about 5 times now. I've experienced this sober and not sober. At first I thought they were so good because I was drunk and anything is delicious when drunk. But ohhhhhh was I wrong. I wanted to try these before I got intoxicated and they were probably even better... I do prefer the chicken over the steak ones because they have more flavor in them. Also throw some of that guacamole sauce... These tacos change Mexican food for you. Nothing touches how good these are and I've had a a lot of Mexican food in my lifetime. Fresh, hot, and fast! The customer service is also amazing for how busy they are at certain parts of the night. One time I came and they were closing down and they gave us two free taco cards for each of us. So 6 free total! That's amazing if you ask me! All I can say is if you're around this area and you are intoxicated or not you should try this amazing place.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HkgaFgKlqFC-pNYs2lHqJw",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. This is what ART looks like.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HkgaFgKlqFC-pNYs2lHqJw/o.jpg"
      },
      {
        "img_id": "4sFmbmjIvIdL4J6kvb3P5A",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Fire sauce! (Def: Something that is just so tasty you don&amp;#39;t know what to say)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4sFmbmjIvIdL4J6kvb3P5A/o.jpg"
      }
    ],
    "user_id": "a3TYCglZRpfeA9kXTGtqgw"
  },
  "1lZqEhJz2Qz_aX8bZvBzMA": {
    "date": "1/20/2017",
    "text": "I just tried this place because it was Postmates recommended. Two tacos in and I can say they are great!! This is my new taco place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_ij3m7tWgv6INqkC37VTEQ"
  },
  "4wMQbv2iIt-wBPppSZ3smg": {
    "date": "4/2/2015",
    "text": "Pretty awesome set up they have over here. They only have chicken or steak tacos and that is a good thing. They are great and the tortillas are like nothing I've had [I had corn]. The tortillas did not fall apart or dry or any of the negatives that go with corn.   This place is great for a quick bite or take it back to the office for lunch. Fast and they were very nice. Most authentic place for this area, too.  Hope you try it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sWndBHUTkVHPbrrYuj4eBA"
  },
  "WBbdGJCz8ljFjAULFZQEJA": {
    "date": "1/2/2016",
    "text": "Soooo delicious!! I love the steak taco & how fast the service is! So glad there's an alternative to Gus' pizza after drinking! Thank you",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NUaCiok-sTDeGi2DWBQAfQ"
  },
  "NvmVymwmC9nk3ewt_XgQFA": {
    "date": "8/1/2015",
    "text": "They only have tacos...but they do a great job with them! These tacos are simple and amazing. They offer carne asada and chicken , both which are delicious, but My favorite is the chicken.  Definitely the best tacos in the scottsdale area and possibly the best I've had in Phoenix! Fresh, yummy and quick! Ive only been during the daytime...and both times there was no wait...but I hear it gets pretty busy at night on the weekends, so I'd recommend going earlier in the day!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "8kZP5Viuo8oO8jnra4XrXw"
  },
  "ULMpjQhlMfcHmVQ8ES7fIw": {
    "date": "12/30/2015",
    "text": "$3 tacos what more is there to say? It's a small walk up taco stand with beef or chicken tacos, old school bottle sodas and that's it. Non place to sit so we sat on the curb across the street in the sun. Great spot for a quick snack or lunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G-9QboxmMfNLafH_X_HZvQ"
  },
  "8UQJftYCAiGYsQQvs2LHUA": {
    "date": "9/15/2013",
    "text": "Wadaa is attached to Barney's Boathouse and is both delicious and an incredible bargain. The menu consists of only two items, steak tacos and chicken tacos. The meat is marinaded beautifully so the flavors are intense and satisfying. And they are only $2 each! Incredible bargain! Cheese is an extra buck. You really will be blown away by something so tasty being so inexpensive!  It isn't advertised but they will also make you a quesadilla for the same price as a taco, and I find them a bit more filling! So if you want to get something a little bigger for the same price try one out!  You really can't beat this deal in oldtown and they are superb!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "MWww0eiHa1YY-MdU1faNKA"
  },
  "96wdPK32B8KLA4kZcZrIjQ": {
    "date": "4/13/2017",
    "text": "First off when the food is done right here, its pretty good. The carne asada is very tasty and the tortillas are awesome.  I discovered this spot through UberEATS a few weeks ago and have ordered several times since then(I love tacos!). I do have an issue when my order isn't correct. I always request hot salsa cups and the past few times I haven't received any.  I'm a huge fan of their hot salsa and for the amount of money that I spend, I would appreciate if my order/request are done correctly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "65CZ4vGtqUr7WR-DfBLFhA"
  },
  "p7ma00RHlZuQbTtDKqDaFg": {
    "date": "12/14/2015",
    "text": "If your near old town (Entertainment District) your not going to find a better and authentic street taco than Wadaa Street Tacos. The beef or chicken is cooked to order and everything is simple and fresh! I am so addicted I have been eating there for lunch and dinner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YTCwe5_GZWxRTpgI7cWJ3Q"
  },
  "KSJ9oBYjDQqQYoHdRg-hNw": {
    "date": "3/31/2017",
    "text": "The best tacos I've had in years! Rad employees with great customer service skills. Thank you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hCd-Shdr9RhqCmKleWfNuA"
  },
  "eNYvmaXCSjQiXDbO6VQKIA": {
    "date": "12/5/2015",
    "text": "I'm from Hawaii visited wadaa and I'm amazed, only 2 options, must open in Waikiki! Fresh and authentic ;)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ARxfEY27E5lem3OXwyN2gQ"
  },
  "dGbkY6vUohmml2dS09ue2g": {
    "date": "10/26/2015",
    "text": "Great tacos here, they have discounts for uber drivers. Love that there's only two choices for tacos makes the line go quick. Chicken and steak are the only options so if you're vegetarian this is not the place for you. Unless you're in the mood for some homemade horchata.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "idfpYEud05YMb7T3bzi0Xw"
  },
  "cxKhuJjzoTzUGjQf6Mc8Ig": {
    "date": "3/18/2017",
    "text": "I was actually quite disappointed considering the reviews. Good portions but both the chicken and carne asada flavor was too bland.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tOB-OJ5v1HUQKen3AGQjfA"
  },
  "YzfMXvhiamU-zMqteMeBbQ": {
    "date": "2/25/2015",
    "text": "Authentic delicious tacos!  Carne Asada are bomb, I have been crushing these weekly since arriving in Scottsdale for ST.  Makes me wish I lived in the area year round!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-u8qr_7pPxPNwCzUq5dDRA",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Walk up and get your delicious tacos!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-u8qr_7pPxPNwCzUq5dDRA/o.jpg"
      }
    ],
    "user_id": "hfBr9kOgp3cAhppZRBaReQ"
  },
  "hVHrX83FgbrpGGu2zPPYPA": {
    "date": "3/9/2017",
    "text": "The only reason they are even getting one star is because you can't give anything less.  Online ordering is completely misleading. Ordered tacos. Image shows a plate with three tacos. Online menu description doesn't say how many on the plate, so one would assume it would be what the image indicates if not otherwise specified. Ordered corn tortillas for the tacos. Ordered cheese for the tacos. Received one taco with only steak and cheese, not even the standard pico. Corn tortilla was clearly a yellow corn tortilla from a bag like you get at the grocery store. Not even remotely close to street taco tortillas (which are not dyed yellow btw and about half the size). It was cold and hard and the meat tough, way over cooked, and was barely warm. Worst tacos ever. $20 for 2 inedible tacos, a horchata (also awful), and a limeade (tolerable). Will not order from them again. So many other places that actually make AUTHENTIC street tacos that are hot, fresh, use fresh street taco style tortillas, and always come topped with fresh pico. Horrible experience. Highly advise you to save your money and go somewhere else.  Bad. Bad. Bad. Bad. Bad.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "LRlS34lR_wawZeaU-Iyxrg"
  },
  "BMn9K5fgkd6GVYDgofPipg": {
    "date": "5/23/2016",
    "text": "I've been coming here for 7 years now. I remember when Mike had his street tacos just as a little stand on the side of a bar/nightclub. I'm from Las Vegas so the girls and I would come down to Scottsdale just for these tacos. If we were in town going to get these tacos was always in the itinerary. The tacos are definitely authentic. I love the steak tacos. But the chicken is just as good. Dress the tacos up however you want. The red and green sauce is amazing!!! I like my tacos spicy so it definitely hits the spot. If you're looking for street tacos in Scottsdale you need to come there for sure. It will be worth your while.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lMTCG3qG5prxSzLTArZV3g"
  },
  "4FVzVpNbnccVrnuwID6AEg": {
    "date": "11/25/2016",
    "text": "After a long day at work, I wanted something that was going to be quick but not deep fried! These tacos hit the spot!! Fast and friendly service is what I got!!! I would recommend this place to anyone in the Metro area!! Can't wait to go back for more with my friends and coworkers !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_E9_JUYGmFxNKjVThW5LCA"
  },
  "hjGBq93SVxhGihNo71qing": {
    "date": "3/25/2016",
    "text": "We stumbled across this gem and we're so impressed we came back within a few hours. I could have eaten my weight in the grilled chicken alone, but to wrap it up in a soft tortilla and smother it in their avacado salsa and fresh Pico...*drool* Not to mention they are $3 each, which is the best deal of a little piece of heaven.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "q4YFzPNj595T1ayoptpchw"
  },
  "iYXDWdDEujdHxiO9bwqQAA": {
    "date": "7/2/2016",
    "text": "Don't let the fact that this is a literal hole in the wall fool you, this is street style Mexican at its best. They have anything you want as long as what you want is delicious carne Asada or grilled chicken. The best thing about the restaurant is that they grill everything on real wood chunk charcoal, which imparts such a fantastic smoky flavor to the meat. Meat is well seasoned and marinaded and I've never been disappointed. Salsa variety is good, but I'd love to see a chipotle or smoker option than either the verde or the nuclear red.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_aZe5YId5eCTGm8bWWt4nA"
  },
  "--fTxom4Ux4NqxRQjE29DA": {
    "date": "3/4/2016",
    "text": "I'm from California and this place is legit. The hot sauce is f\"@& hot. Definitely a good place to grab a late nite taco.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jRAX9nO9p0-vgkO3K6vx0w"
  },
  "tsxw3kgGgDHyOuaPb87XXQ": {
    "date": "5/17/2016",
    "text": "Two choices (steak/chicken). Walk up, order. $3/ea. No place to sit. Extra delicious. Good, but small, salsa and garnish bar. Their Horchata was not my favorite but it was perfectly fine and not even close to meriting a docked star.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jyZ9S0Jwo3zIDsmUvLK8ig"
  },
  "_0fNuql0MvJu6laDcd2JqA": {
    "date": "11/18/2016",
    "text": "Wadaa!!!! Street Tacos is delicious!!! I really love street tacos and they give you the combination of authentic and  modern taste!!! You must have the flower carne taco and quesadilla with carne asada!!! Don't forget the horchata!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "70X4uE7rZsVBccMTf08bmg"
  },
  "PFJgKPRXLPimeCejOo6OLQ": {
    "date": "9/15/2017",
    "text": "So disappointing. We went here looking for some late night tacos because there's nothing besides Filiberto's close to us, and this place had good reviews. The menu was underwhelming but whatevs...keep it small and do it well, right? We could dig it. When we got our food it was cold, the cheese wasn't melted on our quesadillas, and they gave my husband chicken when he ordered steak. They literally have two meat choices so it shouldn't be hard to mix up and the place was dead. He went back right away and the lady (she seemed like the owner) argued with him about it.  She said that she had our receipt in front of her and she gave us food based off the receipt. She was talking over him when he tried to explain that they must've keyed it in wrong. I totally get it if people return food after they had a bite, but he literally took it right back and she was incredibly rude. The other party at our table could relate because apparently they didn't give them cheese OR grilled onions (which they charge an extra dollar for) on their tacos. But I guess they didn't get yelled at. WTF. Don't waste your money or your time.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GiK34zWrgl9EcUSn46fD6g"
  },
  "BH1t5vI6L7BP5wfybvkkBQ": {
    "date": "5/26/2016",
    "text": "Seriously one of the best tacos I have ever eaten here in my 20 some years of living here. Reminds me of the tacos you see on the streets of Mexico. In the perfect spot for late night snack after having a good night in old town",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m6_jKNYUA4IahunwyEvtog"
  },
  "wmY1t59EOFNs93_fkQbozw": {
    "date": "5/21/2016",
    "text": "Great cheap street tacos!!!  We walked over from the Drip Room and some lunch, a maybe a little whole in the wall but those are truly the best.  Both steak and chicken have great flavor plus they are larger than normal size street tacos & on homemade flour tortillas yummy.  They have fresh salsa, guacamole sauce and the fixings are super fresh",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9FmL644lbb4g3YIiiwdK-Q"
  },
  "c-Z5akcdVgQp70cz47M80g": {
    "date": "10/8/2016",
    "text": "Amazing street tacos!!! my new favorite place. 3$ tacos. bomb bomb bomb. no pork which is awesome. only steak and chicken.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bD3FWAYGLQgJKye1HWvEOg"
  },
  "T9SKWUfiHwuSxhTfjKbO7Q": {
    "date": "6/27/2017",
    "text": "Tacos were ok but all toppings were tossed in a separate box.  Chips are old and just tossed in a bag.  I ordered chips and salsa and got a bag of chips, no salsa.  Quesadilla was a complete joke.  It was tiny soft, way to much cheese it was likr one i made as a kid in the microwave.  Only thing decent was the taco.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TrFGkzOZ0gijaaq0RWdKtg"
  },
  "k9SThptxOQcdoK2HAEaBsQ": {
    "date": "9/28/2016",
    "text": "Great Customer Service! The food was top notch. A place I will visit regularly! Would recommend to anyone!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gix8Jhpq8-grj9oCcRzmzA"
  },
  "PEYS0wvjY6hBMsFsZKNDjg": {
    "date": "6/9/2017",
    "text": "Had a fun night out with the girls and we were scrolling though nearby places that were still open. Saw this place, read the reviews and decided to give this place a whirl. Good tip: get the pico! Tastebuds thoroughly enjoyed the tortillas!:-)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pDkx1Z5lSTgFPpWEhctL0A"
  },
  "Jo9QhKWY0UrihGJDC5sf6A": {
    "date": "12/10/2015",
    "text": "You haven't experienced Old Town until you've been to Wada drunk. Or sober. It doesn't matter, just come here.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "9fxcWkZJrEH3RTV119VM9A"
  },
  "ZAo-kvCVwma7EFtu_yzgdA": {
    "date": "2/2/2016",
    "text": "I drive uber stopped here on a whim and was not disappointed some of the best steak tacos I ever head that you dress yourself this will be my #1 uber stop spot from now on",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "G1PHV6IfU7klSokEwvgguQ"
  },
  "ewLlKlqv8DEs4sdMOMhsDQ": {
    "date": "3/22/2016",
    "text": "Super, super good. Meat has amazing smoked flavor and tortillas are done just right. Service was fast and friendly...wish they had one of these near me (and I live in San Diego where good street tacos are everywhere!)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hgILJP8evBDHWFBU_8T79g"
  },
  "wm-pWWu02TrDM0H8FcyFrg": {
    "date": "3/16/2016",
    "text": "You only have 2 choices: Chicken and Carne Asada. Both are delicious. They have a nice toppings bar with cabbage, pico de gallo, and some salsas. Since my boyfriend and I like spicy food we didn't think much before pouring a ton of red salsa all over our tacos. It was incredibly spicy! The tacos were delicious, but they should have a warning on the red salsa saying it's hot. I came to Yelp to look for reviews about the red salsa, but found none. I definitely recommend this place to everyone, but beware of the red salsa.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lb1hjjxOuhZQHxo2vRd4RQ"
  },
  "DM7iXYM95RXOBAGTuvJWOg": {
    "date": "9/27/2017",
    "text": "My idea of street tacos is pure heaven, and this place has been on my list of places to try for a while now. I first noticed them when I was shopping at zia records next door. When I walked in the atmosphere was great with a few large tables that would fit about 8 people each with one of those tables completely full as well as the outside dining full as well. So far it looked very promising. There is also a huge salsa bar with quite a few options. Once I got to the counter to order however my level of awesome decreased right away. There was no greeting, just a minimal what do you want to order monotone question from the guy at the register. No smile. No communication. I asked a few questions since I'd never been here and again it was we have this etc... I asked what he thought the favorites of regulars were and with a blank look said nothing really. We have chicken or steak soooo. I was a bit taken back, but whatever. My order was quick and came out perfect. It's basically the meat and cheese if you'd like and you can add your own salsa. The price was pretty decent and I loved the fact that the check in gave you a free taco with purchase. I'd be back again and again for the food, but the service needs some help and maybe a smile",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Vr3IAKKPfxf2y8o3deManQ",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Vr3IAKKPfxf2y8o3deManQ/o.jpg"
      },
      {
        "img_id": "L_wvFZVJPJQmyvg9pFBwdQ",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/L_wvFZVJPJQmyvg9pFBwdQ/o.jpg"
      },
      {
        "img_id": "T22t9gJNd9BziyZ0idJSaw",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/T22t9gJNd9BziyZ0idJSaw/o.jpg"
      }
    ],
    "user_id": "QbDJB-4XAxn3BGwi6Rrzjw"
  },
  "PofRsxd8TYMh0gillRbBfA": {
    "date": "7/1/2018",
    "text": "Best tacos around!! Any time family comes in we take them here right away! It's also the first place they ask to go when they visit again! Their tacos can not be beat! The avacado sauce is amazing as well!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aaJKlf2ByZd0dJrC--Igng"
  },
  "jsp2qqXK52bQezPBgEqG5A": {
    "date": "11/10/2016",
    "text": "Simple menu. Tacos and quesadillas. That is it. You have them with chicken or steak. Great fresh add-on ingredients. Small seating area. Cheap. Worth while. Love it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3bCaiK2Mo6q9RS06-v6hZw",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. 3 tacos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3bCaiK2Mo6q9RS06-v6hZw/o.jpg"
      },
      {
        "img_id": "znZ-klp39ynm-XusbSxf_A",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Love grabbing a grape fanta",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/znZ-klp39ynm-XusbSxf_A/o.jpg"
      },
      {
        "img_id": "NT4uKcxIsysHqBxe-zWcfg",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. A single taco and quesadilla is all you need for a filling lunch.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NT4uKcxIsysHqBxe-zWcfg/o.jpg"
      }
    ],
    "user_id": "pKksEJAIIC2FZpjKe9fhyQ"
  },
  "m37Uy5oX0oOBxv09flcm3g": {
    "date": "10/26/2017",
    "text": "We tried this place today and it was great.  Their menu is simple, so there isn't much fuzz about ordering. We tired the chicken,  the carne asada and al pastor tacos. They were all delicious and savoury.  Simple goodness!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5EehxF5ThFG1iqZd5iHejg"
  },
  "30LvMWCj4WRE1U1wtsDRaQ": {
    "date": "8/22/2018",
    "text": "So today we were craving some good \"street\" tacos. We Yelp'd some places and found WADAA STREET TACOS. We saw that YELP was offering a \"$27 for $33\" YELP Deal, so we bought it (sort of like a GROUPON deal). After reading many good reviews, we decided to give it a try. We got there and placed our order. The young lady behind the counter didn't know what deal we were talking about. We were about to leave and asked them to call someone who knew about this deal. We just told her let us know when we can come back and redeem our purchase. She called the owner. He came over really fast, and TOOK CARE OF IT and US!!! It was sooo GOOD!!! THAT Red Salsa tho... Wow!!! We told them we were craving so.e good street tacos like in Yuma, then the owner told us they were from San Luis. That's why they were so good. If you are on this side of town... STOP BY. I Highly recommend it. We definitely will be returning. Thank you Miguel and Thank the Ladies who helped us.   We ordered:  Carne Asada Quesadilla 3 Carne asada taco w/corn tortillas 3 carne asada tacos w/flour tortillas Al Pastor Taco 1 cookie  Mexican Coke Chips salsa Street Elote",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "dBHxWnzTW0Pj8jBoMChzDg"
  },
  "eCEiSU_3keatSXfyr-gOOg": {
    "date": "3/9/2018",
    "text": "This place could be good if the employees gave a shit.  They don't actually make you tacos, they just throw all the ingredients of tacos in a styrofoam container and make you build it yourself. If that wasn't annoying enough, every single time they literally just dump everything in there carelessly and basically give you a taco salad.   Not like this happens once, it's happened almost every time I've come.   The store is always trashed and nasty. Food pieces everywhere. Employees seem annoyed your there. Horchata tastes like shit, they served me old and rotten horchata twice.   Never ever again.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EqYjWkwKzj3CPnOq46eZ4Q"
  },
  "tkucNBru7moEb7_n3U0U7g": {
    "date": "11/15/2017",
    "text": "This is by far the best tacos especially for a late night crave.  I usually go to Charlie's but this is closer and open everyday hehe",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BD3KjUFbYM7zlMR5LBQiuw"
  },
  "sQDLGhwyb3kQMU2pOt_3wA": {
    "date": "6/12/2016",
    "text": "I'm a fan of authentic street tacos and this is a great place to get them. They grill the meat right in front of you, so the whole place smells great when you walk up. The tacos are tasty and I can easily eat 4 or 5 for lunch. It's truly just a hole in the wall, and there is no place to sit, so be prepared to find a spot on the sidewalk or take your food somewhere else.  Oh, and don't get the red sauce on your fingers and then rub your eye or you'll be looking for an eyewash station pretty fast, LOL.  P.S. I'll bet these tacos taste even better after a night out at the clubs in the area!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "KTK_ws8lu_TWfR7DtDWjMA"
  },
  "KoDrlA20c26g1JNSNfb2BQ": {
    "date": "5/12/2018",
    "text": "Was at Zia and decided to roll the dice on this place. We ordered 3 tacos (pollo, carne asada and pastor) and also a chicken quesadilla. The pastor taco was by far the best thing. Tasty and not very greasy. The pollo and carne asada both were pretty bland. I liked their avacado sayce and the lady liked the jalapenos from the salsa bar that were soaked in soy sauce. Not the worst place to eat but definitely nothing to get excited about or go out of your way for. I make better food myself IMHO. ",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q5oNbbSmLmmmtSYWksE5yw"
  },
  "hkUCUVBngcT2pqwmJa2jXw": {
    "date": "11/9/2018",
    "text": "Very disappointing--a friend raves about this place, so we tried it. We were both sadly so disappointed, we regretted going here.  Shame as it would be great to have a good restaurant in this spot. Don't know if we just hit an off day, as many others rated this highly, but we'll never go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Se45Ae3Dz6OYVMdrs_OAkA"
  },
  "EdnAzGSBdMF-2YBTsPqJrw": {
    "date": "8/28/2017",
    "text": "Maybe I'm just a snob for food ( mexican) but cheese on every taco? Eh. Yes, an option that doesn't have to be selected but the tacos weren't overly exciting or nothing to take home about.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZRXG3Fh7XcDl6QvDnB5FZQ"
  },
  "Sn4gFifbCPjEKyYm3e3f5g": {
    "date": "7/3/2018",
    "text": "These guys are amazing the street corn is so buttery spicy and sweet.  The tacos have no equal.  Very friendly.  I am hooked they deliver via uber eats and postmates.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TT56KqK9sOqFDjVmsgP7rw"
  },
  "JsSHmFQzOdrJRSeJug4cxQ": {
    "date": "6/15/2018",
    "text": "So, i finally tried the Al Pastor tacos...dissapointed...nothing more than probably pork meat with chorizo mixed in...and, no trompo, like the real al pastor tacos. The place was slow, just myself and a couple that walked in later...yet, the salsa bar was unkept and the trash cans on the way out, were full with trash...take the time to keep the place clean and tidy.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y6oqZozCb9jBhQi7DYDRTA"
  },
  "_wEfu4H-hREBqKAkI-Mkvw": {
    "date": "6/14/2018",
    "text": "Omg loooooove their chicken tacos and their hot sauce! Limeade is on point and homemade. I just wish they were closer to me!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nEIjJaNEX4FpvyFds7REIA"
  },
  "KMoJNSVtNSfWwq7vNMbCnw": {
    "date": "6/10/2018",
    "text": "One employee on shift seemed annoyed to make my order that I put in online to pick up. I thanked her after receiving my food, and she avoided the counter and turned away from me?? thought that wad kind of rude. Also, the chicken in the taco I ordered is literally half the portion of my steak one, as well as a significantly smaller amount than I usually get. Great food but disappointed in service this time",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lyakg4OhrvnIuV6ueXaeMw",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. who portions a taco like this??",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lyakg4OhrvnIuV6ueXaeMw/o.jpg"
      }
    ],
    "user_id": "shcgZsVPIm6AkUAJqCKSSQ"
  },
  "wQB_Ii7s0PwRFqtnxpNiRA": {
    "date": "9/2/2018",
    "text": "The Bad & The Ugly: The Agua Fresa was lime Kool-Aid, The 12-year-old white girl pop that was playing (loudly) was just irritating... both of which could've been overlooked if the already disgruntled 19-year-old boy at the counter wasn't permanently locked in a resting bitch face position. So he screwed up my order, which is impressive because they only have steak, chicken, or pork tacos with corn or flour tortillas. When I got my steak tacos with corn tortillas and explained that I ordered the flour tortillas, he said without a beat \" no, no man you ordered corn\". To which I replied \"not in 42 years\". And then he told me, I kid you not...\"no, just a few minutes ago\". The Good: The chips and salsa are $4.75 but totally worth it. They even give you a nice 8 ounce container, so there is plenty of salsa to take home and plenty of chips left in the bag they give you. The tacos were yummy if you customize them at the salsa bar which was jammin.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r6SgLKw6Yt17DQf30EkCgg"
  },
  "_Qv9HJNBFqPBOVzqW21dzA": {
    "date": "4/17/2018",
    "text": "Went here in a Sat evening, found on yelp. Didn't enjoy my tacos at all care them because I was hungry.  The meat wasn't good at all!  Chewy and bad tasting",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_nKDsC75Rfev0zeMaucQJw"
  },
  "NxYt4URJVNeH_d0plVutVQ": {
    "date": "3/6/2018",
    "text": "Loved this place when it was in Scottsdale and love it even more now that it's closer to home and open late! I have always gotten carne asada tacos with cheese and add my own toppings. Never ever disappoints. The meat is perfect!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IZRNjWe_RzdN0HcCnPTymw"
  },
  "6D72igtDs_ZFntEs7zzE3g": {
    "date": "12/1/2017",
    "text": "First of all this place is extremely awesome! I love there tacos! And the employees are so sweet always nice and friendly, place is clean every time I come. Everything prepare nicely and fresh ***** By far my favorite place to eat tacos",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Bjj-g5POq9re2_HoNHHPqQ",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Bjj-g5POq9re2_HoNHHPqQ/o.jpg"
      }
    ],
    "user_id": "q2xt9s2NhegjYax4Vy8y_w"
  },
  "Sl8Pj4fWqXlgm-IUCMkcWg": {
    "date": "5/5/2018",
    "text": "Delicious!! Great street tacos. Good condiments bar. The People are friendly. It's perfect for that late night restaurant before going home.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oVS5WteDjNfC7vDG1XLrCw"
  },
  "8F0eyhVn2pygfbIHALoyGA": {
    "date": "10/5/2016",
    "text": "forgot to write a review on this yesterday. as it was #nationaltacoday i figured i would try this out as some co-workers said it was good tacos and not expensive. went there placed my order and the tacos were a pretty decent size. flavor was great but i honestly was not a fan of the hotsauce, not sure why but i will give that another shot. otherwise all great food/ great price and location",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ln-pti8W4P30socDlJHcdA"
  },
  "LenoSH43Biye42n5yDBXUQ": {
    "date": "7/21/2015",
    "text": "These are awesome tacos.  Simple, traditional, tasty. The place looks like, well, a little dumpy shack.  It is a little dumpy shack, but if you're in the area, stop by.  So worth it. I would have given 5 stars but there's no seating, no sides, no nothing but awesome f-ing tacos. Enjoy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "opy-n6iAjm8tSmL9BHFu3g"
  },
  "kOJAn-DAVZNJBCv79urPhg": {
    "date": "5/23/2016",
    "text": "Had to try this place after all of the rave reviews on here! It wasn't what I expected but it was good.. The staff were friendly as I didn't know how it worked and they picked out an order for me, one of each taco. I preferred the chicken taco but they were both great and seasoned perfectly. The green and red sauces both tasted fresh and yummy. The only complaint is no seating... Maybe just add a little table or 2! Thanks for a good lunch after flying all day!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pocW97lWviH9A2y285C6hA"
  },
  "8jwmmZsS5-AwubdH1dAw5A": {
    "date": "7/29/2015",
    "text": "Just a walk up, no seating. Amazing carne asada tacos. Amazing!!  Guacamole sauce topping for tacos was so good. I can't say enough about this tiny, tiny place.  I'll go back again and again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LgmSMuGWmF74Qo7MuuCyvw"
  },
  "TpDZcfGVFiGDHh2vJow9nA": {
    "date": "4/11/2015",
    "text": "Are you piss drunk? Is your stomach churning? Do you want to make sure you don't wake up tomorrow morning feeling like shit? Then you MUST go to Wadaa Street Tacos!  I stumbled over to this literal hole in the wall after a night out in Scottsdale during my Spring Training trip. This is as close as it gets to authentic Mexican street tacos stateside. Only chicken or steak tacos and that's fine-I don't need a damn quesarito with a bunch of processed bullshit in it!   Service is great-these guys are literally shoulder to shoulder in a couple hundred square feet of space busting their asses off serving a bunch of drunk assholes, and they always do it with a smile on their face. There's always a line, but it moves FAST. These guys definitely know how to hustle.   $3 a taco and they have a full section of sauces, salsas, and other add-ons off to the side. This place is a MUST. No chairs or tables, but it's probably for the best, because I'm betting if you sit down you'll get the spins anyway.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8W3eec1nm6LXTklaerSVAA"
  },
  "yEX8BakaXB490bPMPDCs2w": {
    "date": "1/27/2016",
    "text": "best drunken taco spot, probably ever. keep in mind this is like a walk up, there is no seating around, not a bad thing, just a heads up.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nkRrf3qg7zGZbss_lq9pOg"
  },
  "ZHHp_W0wD68f5U8BM_OxNQ": {
    "date": "6/15/2015",
    "text": "5 Stars for these tacos. 6 when your drunk off tequila. Now go here and cherish every chewing moment.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0SFFXpagLXGcjGNnnwb7Bg"
  },
  "yr3DsdHJdairiSt_DRGn-A": {
    "date": "2/10/2015",
    "text": "First time trying this place heard lots of good things about the tacos and they were really good! I would recommend this place and I will definitely be going back",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rPcLpEWlp5hgfEtJSsEiEA"
  },
  "jqNo4FrxtdsRLUCnNgDFEw": {
    "date": "4/3/2016",
    "text": "The real deal.  Simple and delicious street tacos.  Choice of chicken or steak and add your own toppings.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P6VE9CaDyjA7mZOY_kGNfQ"
  },
  "3ER1NBfBOSjUd5J04x-E7w": {
    "date": "4/1/2016",
    "text": "Honestly some of the best tacos I've ever had. Went here for lunch a couple times. Reasonable prices, great food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ou8GYYz6Kkrob5EHD7CjXw"
  },
  "hmfLathUPXLWXPpBtG6lFQ": {
    "date": "2/22/2016",
    "text": "Great Tacos.  Generous portions for the price.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u8ABaMW8aepuulXcnPBpZQ"
  },
  "BWAjTvZematB9bXy-dFiZA": {
    "date": "7/2/2017",
    "text": "wish i could give it a 4.5 stars! soooo yummy! i got the chicken, it was tasty with all the onions and pico i put on it lol. didn't give it a 5 because the corn tortilla literally just disintegrated. i had to eat with a fork it was falling apart in my hands.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dnrSVNy54t4LxJXTnWghZg"
  },
  "LAdgw1VK18EzeUZZfVV7cw": {
    "date": "4/3/2016",
    "text": "Best street tacos ever!  Hole in the wall, no place to sit or eat, takeout only.  Chicken tacos or beef were only options, we had chicken and they were awesome!!!  We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u7G93snngsIuzRswRLWvjQ"
  },
  "KI5kJHBo9CxtPPHUymGA3Q": {
    "date": "5/11/2016",
    "text": "The best ever maybe. Fiund it a few months ago and have gone back every week after. Sent several friends there thst are taco lovers and they are addicted now!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mgkqTJOEoO99jJSY8B5Vuw"
  },
  "vvmkRWYoEuuU2xbNmBIcEQ": {
    "date": "2/23/2016",
    "text": "Awesome tacos - the wood/charcoal grill gives them an amazing smoky flavor and the fresh tortillas are great. The steak is my personal favorite, but the chicken is solid as well. Condiments are simple: chopped green stuff, salsa verde or red salsa, and lime. The green salsa is tangy, the red is ridiculously hot. I would not recommend the red sauce - I like hot stuff and it was unbearable.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hsrho5YAkXFQsLaKRBjA_g"
  },
  "hbbCucA5DJBeDXEMoGrwGg": {
    "date": "3/17/2017",
    "text": "bland and over cooked (burnt) asada. wouldnt go eat there again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tL7Av5Qxjrj4FM2rL-ChDg"
  },
  "ni5Rb9hqK_K8Ijpr19II8g": {
    "date": "7/14/2015",
    "text": "Fast and Yummy!  Too bad they had a jerk yelling at the employees while we were there. The employees are awesome but they were getting a tongue lashing from some lady that was getting her hair colored next door- not sure if she was the landlord or manager or what but she was super rude and not even embarrassed to be so rude in front of others (especially customers).",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bWSjTkMAVrDyjQLSonaOKQ"
  },
  "YmhZHIhQqRF0TNLdCtaS1A": {
    "date": "9/8/2015",
    "text": "WOW!  Where has this place been my whole life!  INCREDIBLE STREET TACOS!  Some of the best I've ever had.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CpuO-YzLVqRG5L-UvwiQdQ"
  },
  "AvETv0zdEHJrGsdGPKs_1w": {
    "date": "2/3/2016",
    "text": "Best street tacos I've had in the USA.   Service was fantastic also.  Ate there 4 times over a 3 day period - yes they're that good.  Had both tacos and quesadillas.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DifE9jVllT2P1mKrecVgfg"
  },
  "aVUOdMbMohEStzB0rFQNpw": {
    "date": "10/22/2015",
    "text": "If you are in the area you must stop by,  had any street tacos all over Mexico.  This place is amazing I can still taste the mestique flavor off the smells of my shirt!  I'm sure on a Friday or Saturday night it could be a little wait, but I'd walk back over there right now for another one or two it's worth it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LdwZVQIDDKCv-o1neTD-ZQ"
  },
  "Eic6NRLLIpxgmWUCkxSS9g": {
    "date": "8/6/2017",
    "text": "I really like this place! The meat had great flavor, the vibe was modern meets taco shack. They had good a vibe, good drinks, and good food. I have to say this place was EXTREMELY clean, as well. The only thing that hurt my foodie soul was that the tacos were so cold, the cheese didn't even melt. So other then that, I would go definitely considering coming back to Wadaa when the craving for street tacos is strong!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gJPyzy6oZz5WJheIOs-Sdw"
  },
  "9FFCQIP55dLahsM-VMtRnA": {
    "date": "3/11/2015",
    "text": "You will NOT be disappointed with these amazing-mouth watering-to die over -Tacos!! These guys know what's up. Super FRESH, high in flavor and best bang for your buck. I could say there're top 3 taco joints I have ever had.   The guys there were super friendly, made us laugh and gave us over all a great experience along with great food. It was super fast and I love how you can see them making the food, you can see how extremely CLEAN everything is- Which was the cherry on top. I'm for sure a new regular!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BvHwmGfA8jpikoPIaz-_-w",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Best thing I had in a really long time!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BvHwmGfA8jpikoPIaz-_-w/o.jpg"
      },
      {
        "img_id": "hH5nk5iofabx3aZ8ZASRMA",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Walk up and order- super fast service!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hH5nk5iofabx3aZ8ZASRMA/o.jpg"
      }
    ],
    "user_id": "977fzzCmI2f1OlDPWhvj0g"
  },
  "5Otxoni8p5TZzwsn1agd0Q": {
    "date": "5/29/2017",
    "text": "Stopped for a bite on our way home from Vegas since they were open late.. by far some of the best tacos I've had in my life and I know tacos. Carne Asada was filled with flavor, melted cheese on top mixed with their homemade salsas made this by far the best meal of the weekend. Menu is simple but it has all you need! 10/10 recommend, and will stop by every time I'm in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "52FexKFxsyKFVf5RYIOXZw"
  },
  "13KjuWiQDx_FWKwjxryI3w": {
    "date": "6/8/2016",
    "text": "Not much to say really. Small, simple menu but they execute it well. The tacos are consistently delicious, pico de gallo is made fresh and is VERY good. Staff has always been friendly.  Definitely stop in for some great tacos.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "glCPfEqLkikL3vFmBcQfTg"
  },
  "uOJ53PKoUCa4YINsgZmZvg": {
    "date": "10/30/2016",
    "text": "I was a little leery paying $3 per taco but it was totally worth every penny. The tacos are not you typical small street taco size. The tortillas are big and they are fully loaded with meat. The options on the salsa bar are a bit lacking but the salsa and guacamole is pretty good. The menu is super simple and the service is great. Tacos are $2 between 10am and 3pm.  I totally recommend Wadaa Street Tacos.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xIdqXpf0MjaLhr-EXZGy-Q",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. 2 asada and 2 pollo on corn with a roasted onion. Boom! Always loaded with the meats!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xIdqXpf0MjaLhr-EXZGy-Q/o.jpg"
      },
      {
        "img_id": "GjSMWlD-8PLwCwKUydXhqQ",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. 1 asada and 1 pollo taco with a little grilled onion!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GjSMWlD-8PLwCwKUydXhqQ/o.jpg"
      }
    ],
    "user_id": "5db45iRwNB7Ui-Vst8veSw"
  },
  "R77WhCM377gfRLMAt9suKQ": {
    "date": "8/22/2017",
    "text": "This is the best taco place that i have ever been to!!!!!! Simply amazing with great conversation!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zGOe5Jj9H7XbeSHggBU8Dw"
  },
  "v6RMCC3pP08-t7cyrSLHWA": {
    "date": "5/14/2016",
    "text": "Small taco place that has probably the best tacos I've found so far!!! It might have been the beer, but pretty sure it wasn't. Its A small shop with self serve Pico Dr Gallo which was delicious and spicy, limes, and salsa. My only complaint is they only offered flour tortillas from what I saw. Either that or I got it as default. A corn tortilla would have earned this place 5 stars! Delicious carne asada made right behind the cashier over a wood fire, doesn't get,more authentic then that... If it wasn't for that flour tortilla...... I think I might hit it back up and bring,my own corn! Definatly hit it up for a late night bite! Totally worth it!!!  *** update *** apparently seen in their update they do sell corn tortillas!!! That's all I was missing to have one of the best street tacos in East valley area! Congrats man... I'm very picky about my tacos!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "bDF4XoMF-bApT_YQD_duTg"
  },
  "HGTRRCJAw_Yrw0Nlsoj1Lw": {
    "date": "9/30/2017",
    "text": "Not what I was hopping for not much selection either won't return. Chips and salsa were alright but that's about it...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TWtAPoj4-r0FrJfgfQlo6w"
  },
  "bpJWAoBl3xE_5DPjL7UPDQ": {
    "date": "5/20/2015",
    "text": "Miguel's tacos are so yummy. The food is fresh. The pico is awesome with a little bite of spice. They now have flour tacos! The price is super reasonable. Try the homemade Horchata!  There's street tacos and then there's the ones from this location. I seriously need them each week. That's not a joke. I wish Miguel made his pico for sale because I would use it at home. Yes. It's that good.  The chicken and steak tacos are some of the best I have had in the valley. Gabriella (one of the awesome people who work there) told me that they marinate the meat to make sure it's as tasty as possible.  When you drive by them, no matter the time of day, there are always people in line. That says a lot when you look around and see who their neighbors are in the area who also have tacos on their menus.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IDP94ki91ElMT-HZ180CbQ",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Homemade Pico made with love from Gabriella.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IDP94ki91ElMT-HZ180CbQ/o.jpg"
      },
      {
        "img_id": "Dpqr-Rg7cRoS0DQOZP6T3w",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Steak taco. NomNom. Nothing better than tacos from chef Miguel.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Dpqr-Rg7cRoS0DQOZP6T3w/o.jpg"
      }
    ],
    "user_id": "kta6QqE36T7GU3qBJIKIXg"
  },
  "yrkI_lAWIidOybGuFFhzlA": {
    "date": "10/21/2017",
    "text": "Chicken on corn tortillas..the best. Close to home and work. Fresh ingredients...good food for a good price",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r7JYgkuuM8WRhbcN30Vc0Q"
  },
  "iKAEtAMKOkOrMIGIwEn16g": {
    "date": "6/14/2016",
    "text": "My favorite Taco spot in AZ. By far the best Carne Asada Taco's anywhere in Arizona. Nowhere can come close. They are <a href=\"/redir?url=http%3A%2F%2Fbomb.com&s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\">bomb.com</a>. Wadaa is a must try and my go to spot on Taco Tuesday. I highly recommend Wadaa to everyone.  *Phoenix Foodies Approved",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Qd3hGg0JQEeMETlpiV5uw"
  },
  "ykPZ45h7MFsYZw1omItJow": {
    "date": "10/14/2016",
    "text": "Randomly found this place during my lunch break. Super yummy tacos. The staff was very friendly and the place was pretty clean for a taco shop. It's a great place to stop by after studying all day. I will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BvI__uwS1CEdRwIfRC8b3g",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Carne asada tacos with onions, cilantro and sauce. Super yummy!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BvI__uwS1CEdRwIfRC8b3g/o.jpg"
      }
    ],
    "user_id": "LnPZ1itzibJuhR6uc0w3gQ"
  },
  "I5bBvQGnzr5m-IsIuBxR7Q": {
    "date": "4/1/2016",
    "text": "These are some of the best tacos that I have had in a while. For those of you that are wondering these are most definitely authentic street tacos similar to the ones that I have had in Mexico. The beauty lies in the simplicity in their menu as the only two offerings are either chicken or steak tacos. They are only $3 each which is a phenomenal deal as long as you don't mind how there is no place to sit down with chairs and tables.  The location can be good or bad depending on the circumstances. I like how it's situated within the entertainment district however if I were to only come to this area for the tacos the parking situation can be a pain as usually the parking nearby is already taken. Other than that this spot is especially good for late night food as they are open late every day. Just beware of the crowds especially after 1-2 AM as there will definitely be a wait for these tacos.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "4suJsf9Q2uruOwKlnBixow"
  },
  "oObqyTQOPMtPFC_99F7hDw": {
    "date": "9/21/2017",
    "text": "Meat and chicken cold wasn't fresh. Looks authentic but the people cooking nope I couldn't of made better tacos. Sorry but I spent money there and at least the salsa was delsih",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vP7ed46TOaJirQPsehIH2w"
  },
  "Rgb1lpDT8Wck7leQKxY5yg": {
    "date": "9/16/2017",
    "text": "Nothing good to say. Do not waste your money or time. Probably the worst tacos I've ever had.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CKsWr4dQbcsTwSdYVnjerA"
  },
  "mf-RAxvLTF_H8ekzdCA8WQ": {
    "date": "4/27/2017",
    "text": "These are absolutely amazing! Super simple menu and delicious! My families new favorite taco spot.  GET THE STEAK",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "quLoJyKZyWPeP2ZQy6N8pg"
  },
  "Y15w1_ZUAHyYu-vR_LOokQ": {
    "date": "9/12/2016",
    "text": "Tacos were so good! I loved the salsa bar as well everything tasted fresh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "d_LuOk9cNYnGcPHvRDG4Og",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Steak tacos. They were amazing!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/d_LuOk9cNYnGcPHvRDG4Og/o.jpg"
      }
    ],
    "user_id": "7nLiALXeb4L5JYImGrQ_oQ"
  },
  "r9csx6ejlUm4hnN3l00_Zg": {
    "date": "10/3/2017",
    "text": "Called before going to confirm they had white meat chicken. Once we got there I ordered two tacos to much dismay, the chicken was dark meat..... my husband got the carne asada quesadilla which we're tiny and said the cheese tasted funny. Only reason I did three star was because the worker was nice and polite. The chips were ok and so was the corn tortilla. Won't be going back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8tAp_md2oYNELR3RvbPOgQ"
  },
  "dT-ppV253IsiKJVeLLPiew": {
    "date": "7/29/2017",
    "text": "Very good, very fresh tacos and quesadillas for a reasonable price. Friendly employees, also. Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BnMUyEzBlzfCBb1EmSKBxg"
  },
  "YxK8FyfZv_WRAJoIGfvNgw": {
    "date": "4/24/2016",
    "text": "Best tacos ever! I not only work in old town, but I also like to go out in old town from time to time. Whether I'm on my lunch break from work, or its 2 am after an evening out, the quality and freshness is always on point. I love how simple the menu is! Plus, you can't beat coke in a glass bottle to wash it all down! Solid tacos, solid price, solid location! Can't really ask for much more!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cbmYeEuLIUIZm4xom6exZw",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cbmYeEuLIUIZm4xom6exZw/o.jpg"
      }
    ],
    "user_id": "XcNXIrwBYUNE9JpSFoeKfA"
  },
  "9GllTxRBLZ_ukN-UTkGGwA": {
    "date": "3/13/2016",
    "text": "I gotta say I feel ashamed for coming to this area for almost 2 years and just finding out about this spot. The good news is I found it at the beginning of my 5 day stay...  I was wanting something quick and delicious so I looked up this place on Yelp. I didn't realize it was literally 5 min walk from where I usually stay.   I got there and there was no line. I got 2 beef and 1 chicken taco. They give them to you with meat and cheese. They then have a \"salsa bar\" that you can choose the rest of your toppings.   Each taco was awesome and what made them even better they were $2 each. 3 tacos was just enough.   Don't go if your expecting to sit down or have a fine culinary experience. These are tacos done right, nothing else.   I'll be back I'm guessing 2-3 more times in the next 5 days",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rbU_okk5zXGQ8Y9KyMgIFw",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Tacos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rbU_okk5zXGQ8Y9KyMgIFw/o.jpg"
      }
    ],
    "user_id": "-63dYc-Xxdmxo1EBO-TjRA"
  },
  "1JEMnqHFoRQeDhLJUmS9XQ": {
    "date": "2/16/2017",
    "text": "I love street tacos! I have been hearing about this place since I've moved to Phoenix. I haven't had a bad pollo street taco yet from anywhere, but the asadas have all been alright. Not at Wadaa! This place has some tasty freakin asada! Not burnt, but flavorful! The salsa bar is clean and filled with cilantro and onions, a pico de gallo, roasted salsa, guacamole sauce and a hot hot sauce. Yum yum yum! Only tacos and quesadillas! Good sizes of tacos! Will be coming back!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "T8ldlBdwsKaBmTghUFB09w",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. 2 carne asada tacos and a pollo taco on corn tortillas!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/T8ldlBdwsKaBmTghUFB09w/o.jpg"
      }
    ],
    "user_id": "YmK6PYrnHikusFZh7z0Kuw"
  },
  "jeJYA416RBIoyEJ0WTvy7Q": {
    "date": "9/29/2018",
    "text": "Awesome! Steak soft Tacos and beans (done right)! You gotta have. All tacos are NOT created equal",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1n9Us3oM7Oj2DXn7teKF0Q"
  },
  "no14Bn0y3P9o0_L8eY5Jgw": {
    "date": "9/26/2018",
    "text": "Their food has always been really good. The menu is pretty basic you have a choice between Asada or Pollo tacos on corn or flour tortilla and they have a bar with all the fixings you want to put on your taco. They also have Nachos, and Asada and Pollo quesadillas on flour or corn. They are serving Elote now too and that's really good too. The prices are pretty good and they are right around the corner from where I live.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FM-O1nlImKD7EAIAsgacOg"
  },
  "7GcNpYmRXT0I8B_QFjE74A": {
    "date": "8/3/2018",
    "text": "Yummo! Visiting the area from NC, we were super excited to find this gem. Highly recommend....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RpyRU6w0WVP0yebLOKDVjw"
  },
  "KS7jXthlCzEXIuhEuOvUiw": {
    "date": "7/1/2018",
    "text": "Five stars for tacos ? Not sure how one could do that . The tacos are good, I mean, I ate all of them. Chips were not complimentary. The owner was nice enough . He sat with us , chatted us up,and told us about his business model. We were the only ones in the place on this Tuesday afternoon just after lunch time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QcgkeDbQj8t-JR14JzeYTQ"
  },
  "yQtC-FlYumRewzQeP_y9lQ": {
    "date": "7/11/2018",
    "text": "Got FOOD POISONING from here last night. I am so freaking sick. I ordered one chicken, beef and pork taco..... not food poisoning. Stay Away. I will never come back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NuBpiAGvfIrNJU-LkZQbHA"
  },
  "JDxmQglWkNPU8s_3DKpaOg": {
    "date": "7/7/2018",
    "text": "This could've gotten at least 4 stars but service was lacking. Not sure if it was a bad day but the cashier seemed like she didn't want to be there and screwed up my order. I think her name was Harvey or she was using someone else's cashier login which is normal. This was my first time visit and my first impression was that I should choose somewhere else lol. She didn't know the menu either which was odd to me if shes supposed to be able to recommend food for the customer. Food was good, at least the tacos. The poppers had too much cheese but the steak was good. But the grilled street corn comes boiled which is weird and with only parmesan cheese? Street corn is grilled, covered in mayo, parmesan cheese, lemon and chilli. So that was a let down as well. Well this visits was at around noon so maybe it's different at other times. Hope it gets better.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6EUNlfxpe_EeS5a_qQmBmQ"
  },
  "qD-4XvJ28tV-u-Pu7Opnqg": {
    "date": "4/22/2018",
    "text": "Cynthia is professional and made my family from out of town feel like they were taken care of! She is a wonderful addition to Wadaa street tacos!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "GhwsF0saSrT5aC1PRHHqvQ"
  },
  "NhxmeJjBU8ohNU81Y9yXIA": {
    "date": "11/5/2017",
    "text": "I placed an order via postmates and did not receive any of the toppings. Just the tortilla and meat. The photos attached will show you what I ordered n what I received.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1MFeZ_tplf-E4oAFlZFQVg",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1MFeZ_tplf-E4oAFlZFQVg/o.jpg"
      },
      {
        "img_id": "GZ4r6ZO-CN06E6BNtwMYyg",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GZ4r6ZO-CN06E6BNtwMYyg/o.jpg"
      }
    ],
    "user_id": "NVpsr-aMPKuXCQN1rAiIhw"
  },
  "D-DuGeEDu-fBSDiKU0r6bQ": {
    "date": "7/13/2018",
    "text": "They have a simple menu but what they do, they do well. The carne asada is awesome and they have the condiments bar onsite so you can dress them up like you like em. A good spot to eat when you want something quick and easy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tes3r9YwbjOprFAbJoRc7A"
  },
  "LLOkt8WreLF-s4OZzCDgHQ": {
    "date": "6/21/2018",
    "text": "Stop by the restaurant tortillas are the best! But when we went it like the meat was a bit over cooked. It was like the meat was already cooked and sat there not freshly grilled like the pop ups. Still love the concept! Keep up the great community work!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_jzLE5IWfDsIMsYneXDp0g"
  },
  "02xZF-0aQWNYJ5y9SoYh8w": {
    "date": "5/2/2018",
    "text": "I Hired Wadaa Street Tacos to do my husband's 40th party and they were the hit of the party. Everyone raved about the food and how great it was. Omar was so great a communicating throughout the whole process. If you are planning any type of event in the future I would highly recommend Wadaa Tacos!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nJWjZ_LRMMO-7ZSflwyG5w"
  },
  "lTMjH0BUM9IsrsVkcMH8Qw": {
    "date": "3/2/2018",
    "text": "The chicken quesadilla is so good. Definitely coming back. I've seen it open for a while and I finally decided to give it a try. The food was great service was fast and friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tw54RaRdvy-GYPM2k4Hkpw",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Super easy menu.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tw54RaRdvy-GYPM2k4Hkpw/o.jpg"
      }
    ],
    "user_id": "zfjwAHMvndmoXYf6LIkiDw"
  },
  "G0SfCHxZwVcBI9J_t4UYnQ": {
    "date": "8/26/2018",
    "text": "My go-to street tacos. Awesome staff, fast service and always a fun atmosphere with their music. Convenient if you're in a rush. Steak and chicken tacos on a corn tortilla - bomb!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OwuRInTHgXL3sQOXoPBm8A"
  },
  "arGI3HGwl-gopfhm1A_J8A": {
    "date": "7/23/2018",
    "text": "The red hot sauce is burning hot!  This is how red salsa should be made.  Got a couple carne asada, one was free because of the yelp deal.  Small menu but they do it well",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uQIZiVAU6SLOQszpFbDoQQ"
  },
  "JHRn4rqhnlUOgaEveRoFdA": {
    "date": "4/6/2018",
    "text": "Horrible! I was here when they opened, moving over from Scottsdale, and it was great. I'm not sure if they're under new management or what, but the quality is not there anymore. Not at all.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZksPFTgeXUKTlMHDaY2Lfw"
  },
  "FmClLR1L7skTiBgBeLbcJQ": {
    "date": "12/14/2018",
    "text": "Saw this place numerous times when I was in that area. Went to try it tonight and I wasnt to impressed. The tacos are way over priced. You get a better deal off an actual taco truck. They had the garage side door open and it was about 62 out. Food was just cold by the time I ate the first taco. The steak didnt really have flavor. Tasted like old oil. Oh yea you have to pay extra for cheese.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q-09xI7WhGLWuT3cvj8kEQ"
  },
  "q6jP2tpGD0Nwp8OqYGzYEg": {
    "date": "5/12/2018",
    "text": "Don't pass this place up! I stopped in on a whim, I was hungry without a plan for dinner. I ordered two asada tacos, chips & salsa & even a glass bottles Dr Pepper. They chips are made in house & they have a salsa bar. This was SO tasty, affordable and it is all made to order!  Clean place & friendly people.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QsfB6wIGBvoBOkP1_GaH_A"
  },
  "kcqIOvyOIQsFyPpz7ReP3w": {
    "date": "6/14/2018",
    "text": "LAZY. I came here after shopping at ZIA next door. Their menu is extremely simple, street tacos, quesadilla, elote, beans, chips & salsa, and drinks. I ordered one carne asada taco and an elote. They have pictures up of the elotes so it was safe to assume it was theirs, nope it was pictures pulled from google. They give the corn burning hot in the husk, it was boiled not grilled. I had to tear off the husk and that took a bit because of how hot it was. They don't put ANYTHING on it, you have to yourself. They give you cups of cheese for it. At the salsa bar there are two salsas for the corn, no chili powder. The crema and hot sauce for the elote is nothing special especially because it melts off from how hot it is.To pay $3 for it is absurd if they just throw it in hot water and expect you to prepare it. I understand building your street taco from the bar, but not a $3 \"elote\".  As for how it tastes, it's edible but doesn't taste like anything special.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QbzNF4OGt2WbakF5I6T8vw",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QbzNF4OGt2WbakF5I6T8vw/o.jpg"
      }
    ],
    "user_id": "evAxQJwBn9_CyW-EFQyUjA"
  },
  "2YJQ0sP6_ze61Qw-oFNi9g": {
    "date": "8/2/2016",
    "text": "It's just the absolute best! Go eat there! The employees are SO nice and inviting. You can feel that they genuinely appreciate your business. Helping a small, locally owned business grow is SO awesome! Love you guys!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8K4gpP5aRb-45ID8J2dMPg"
  },
  "dT1LvVBqwSS6kH9cJllrjA": {
    "date": "11/23/2016",
    "text": "Tacos! They only do one thing, but they do it damned well! Meat and fire make a bad ass taco. Could be cheaper, but then you'd buy too many and eat too many tacos... If there is such a thing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CVrSg62TlOtmhMBX7TX8cA"
  },
  "_6BmXBjUH04BwNYVU6h_ww": {
    "date": "10/10/2016",
    "text": "I love this place and the owner handed me the food and was so nice even gave me free quesadillas because they came out a bit crispy but they where amazing :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1LCCiCl2WD4q-V1c3b0-LQ"
  },
  "3A6tkSOM1r6ciCOGoC7x5w": {
    "date": "2/24/2017",
    "text": "Great tender and crispy carne asada and chicken tacos!! Fresh tortillas and very flavor ful and filling grub! Tastes like the street tacos from Rocky Point!!! Must give it a try you will come back for more!! Oh yeah one more thing if you see Jordan on the grill expect nothing but the best tasting chicken and carne!!! He's straight killing it!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HT_V_exQcTtGmDfClqX0lQ"
  },
  "ay3fqBISRlszD_arE3Omcw": {
    "date": "11/3/2017",
    "text": "Yummy food!  Easy to order!  Chicken or steak tacos, quesadilla or nachos. The steak is very tasty!  This place is open till 1am!  Whaaat?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zri2KbWAg_RB6IU6rdQJWQ"
  },
  "Qv-FxlDkg7-GqFRBUXPuBQ": {
    "date": "6/14/2015",
    "text": "These tacos are incredible!  Only two options - asada and pollo I wish they had a place to sit and eat them but you will be blown away by the flavor of these  Friendly service and reasonably priced",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nl271xl-ud9bJTQRYHJvHQ"
  },
  "tqVgFwnXud4M7jyy0fHcdw": {
    "date": "10/28/2016",
    "text": "I like the Scottsdale location more than the West Valley one. This used to be one of my favorite taco places in town but my last visit the carne asada was grisly, tasted fatty (not in a good way) and had less meat than I'm used to.  I wouldn't say they were worth $3 each,  at least not this time. I hope it was just a one time thing because there is a lot of good competition in the Phoenix area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7YhXrvwA6fK9KSb6QdSsdQ"
  },
  "2gVdZvp5UorwNJB-aghJ-A": {
    "date": "5/30/2015",
    "text": "ATTENTION: All you degenerates out at these ridiculous bars and clubs in the area, leave where ever you are and come here immediately. You can probably smell the wood fire burning a few blocks away. These guys just don't mess around. Two types of tacos: chicken or steak. Both are ridiculously simple and tasty. The salsa options are also plain and simple but REALLY FREAKING GOOD.   This has got to be the best place in the area for food and especially for tacos. Leave the douchey clubs with all of the worst people in the world and come have some tacos that will surely be a great end to the night",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P-ZjU0RMtsDmSyQF0TDvag"
  },
  "A_x93CvHSfVaeXbigTEC3Q": {
    "date": "2/2/2017",
    "text": "I actually tried them for the first time through Ubereats. I will never eat there, ever. Carne was burnt. No taste. Tortillas were burned and the toppings werent even on the tacos like I asked. I wouldnt recommend this place to anyone. No stars from me.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9K4X_o9IhLubISpt9RnR4g"
  },
  "i24ebT5huMDprUdvpArPYw": {
    "date": "6/2/2016",
    "text": "Not street tacos, for sure. Location probably helps the rating - many things taste better when inebriated.  Food was less than average and service was worse...  on top of it, staff was rude.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "47PVqHT_rb_A8Xh--VppvQ"
  },
  "TV6CzvsMQb2kRKsSR5ZFeQ": {
    "date": "5/5/2015",
    "text": "It is SO nice to see this business doing well. They took about a year to open but it was worth the wait. I love seeing lines even on a weekday during the day. I love that they have the condiments for a perfect taco",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WsAejVneMXU-_yp_W0b_2A"
  },
  "CyFp-t9OMtbMkse73z8nnA": {
    "date": "12/2/2015",
    "text": "Really good for a quick bit! Wish the have bigger salad bar and chairs to sit.. Anyway... great service!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AfGzijkt-90aDszY3m1OJw"
  },
  "kqUfI1o2uQKe4BLX7N3RbQ": {
    "date": "9/1/2016",
    "text": "Just opened today!!!  The carne asada and pollo tacos were awesome. Great place, friendly people. I'll be back soon....likely tomorrow.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fxu4pMpuVbK5ujzds3I0dw"
  },
  "sai2uLhWD8HoCTkOpLWJZg": {
    "date": "1/12/2017",
    "text": "The best tacos ever!! Carne asada is the best ive had..and they have a friendly staff.ill alwatlys come here to eat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1AtVbWuKBVh7t_2R9qyj5Q",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1AtVbWuKBVh7t_2R9qyj5Q/o.jpg"
      }
    ],
    "user_id": "EHGERu-k5-GoAB2IXYBHqA"
  },
  "dnDTbAC8MN0CNQGTGm2HJA": {
    "date": "9/29/2016",
    "text": "Meh. I would be there frequently if the price was lower... but I would stick with the Pollo taco. As it is, I'll stick with places closer to me that cost 1/3 as much.  Pros:  Pollo is tender and flavorful Asada has good flavor Open late A red cooked salsa which had great flavor  Cons: Asada taco had gristle in every bite $3 for a street taco - it is a $1 size a lot of places Greasy tortillas",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qr_rXsbGjxT-qlxVrO0-jA"
  },
  "8GXplV89jdWhnxrRwwV7eA": {
    "date": "1/8/2017",
    "text": "Fast and smart concept of authentic Mexican culture that can be expressed in the flavor and very affordable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fiBIV7u3k5YZSHSs5hfSdA"
  },
  "SD8fmxNrzzcH6R_3hr1jVw": {
    "date": "5/10/2018",
    "text": "Neighborhood place I have tried now four or five times and each time I leave regretting I visited this place! If you're looking for service with a smile, this ain't the place! These people barely talk to you! The tacos are ok and the toppings are ok if you catch them fresh. The limeade is great, however! Today I got three carne asada tacos, chips and salsa, and the limeade. Didn't even get a container for the salsa. I asked for large limeade and the clerk asked me if I wanted ice with it? Hello? It's a 100 degrees today! I paid her and she gave me change and then went over to the ice machine and filled my cup with ice. I hope it was not with her bare hands that she just handled the money with? Anyway, the salsa bar is often in disarray with empty or nearly empty containers and today was no exception as the green sauce was empty so I took the squeeze bottle to the counter for a refill and the clerk was deep into a checkbook ledger and looks up at me and says \"uno momento\", I think, because I could hardly hear her! Anyway, she soon forgot about me and I left...again shaking my head about why I didn't learn my lesson the last time I was here! Didn't even take any salsa with me! Some courtesy, attention to detail, and customer service would make this place a whole lot better!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xw9ZWqwSqYMYoUpE27Isug"
  },
  "CMwVVMVVMjo2D7DpK0N4jg": {
    "date": "9/20/2016",
    "text": "Chicken or carne asada. $3 each. Don't be fooled by the low price. So good. Fantastic tacos. Choice of corn or flour tortilla. Fresh condiment bar. Friendly staff. Just try it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6bA_vxlz_GvPxfrIVwvHmA"
  },
  "F7xGVo6c7A0kgPGou9jtfw": {
    "date": "12/19/2016",
    "text": "Perfect hangover food!  Yelp never fails me! Amazing reviews gave it a shot, Miguel was great! Daily specials from 10-3 $2 tacos! They are well served portions, flour an corn tortillas and quesadillas! All amazing! Definitely recommend stopping by an grabbing some tacos, red salsa is Hot! But delicious!  You also receive a coupon for a free taco on your next visit! Only down fall... ASU fans.. lol jk gave Miguel a hard time as my BFF is a UofA fan!  Overall amazing food good taste and responsibly priced! Will be back for more!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "65p1Op35PY2I93yOktUrvw"
  },
  "BSgX8U6Yi3h16OL92i7Jbw": {
    "date": "8/29/2017",
    "text": "Tacos with dried out the meat Thick & chunky. It's still stuck in my throat. I told the guy behind the counter and he didn't seem to give a shit about the dried-out meet",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EXYveaY1z7c6-LNhucTqow"
  },
  "KsFx1eyeDaf6rgyfLXnf1g": {
    "date": "1/30/2017",
    "text": "The asada tacos are droned in from Jalisco, Mexico. At least that's what they taste like. Authentic does not describe the taste or the freshness. And I was pretty sure the owner Miguel went out back and grabbed a chicken to make my pollo tacos. He denied it, although I thought a feather fall off his baseball cap when he served me!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LCJS0uL_TmMyLEcceY4uGg"
  },
  "H5bEt7ewbUOPFuo0YtMJTg": {
    "date": "5/9/2016",
    "text": "Great  street tacos great service absolutely love the salsa verde. Super fast service",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gfD1uHKmHQfL3WS-yHzy1A",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gfD1uHKmHQfL3WS-yHzy1A/o.jpg"
      }
    ],
    "user_id": "dIGzH_0Eo0TmEamuhK-s2w"
  },
  "m0IBaznZb0ttDKjgV7Zosw": {
    "date": "1/23/2017",
    "text": "Carne asada with flour tortillas, also chicken quesadilla. Both very flavorful and worth every dollar. Simple menu, quality simple food. Nice salsa bar... I love hot spicy salsa and their red salsa is freakin' hot!! Limeade is good too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KSWaQa0gD_86lks6NTbLcw"
  },
  "8u29LJaDSbX0jmPcCsSaJg": {
    "date": "1/6/2018",
    "text": "The tacos were awesome - We had the pollo & asada tacos. Service was good, maybe the person taking orders was just having a bad day. The food & price made up for it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "63lmf3s3MYqKduIuxipaaw"
  },
  "vcOBqx6bsNd-70gPuKzqEQ": {
    "date": "6/27/2015",
    "text": "THIS PLACE ROCKS! Great food, great prices - best addition to old town that I can think of!  This is LITERALLY as straightforward as it gets:   Street Tacos - chicken or steak - flour or corn. $3  Quesadilla - Chicken or steak - flour or corn. $4  Homemade pico, chopped cabbage and lime to squeeze. Homemade red and green sauces.   Mexican cokes/fanta's. horchata fountain.  Don't be stupid - GO",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "s1AbuVOlBXD0_QTyk0B3jw"
  },
  "0Wv91gAdfeWNasqOijifHQ": {
    "date": "12/9/2015",
    "text": "When the tortillas are hot and the cheese is melted   There's no better street taco in AZ.  Period.  They're that damn good.  I'm addicted",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f6M50dZNFNFBIGarOJ8Myg"
  },
  "hEM0f4q7bE1AG3DGr5lpKQ": {
    "date": "5/5/2015",
    "text": "At first I was wary of this street taco shop and not excited about standing up while eating tacos, but I was pleasantly surprised by how amazing, fast and cheap these tacos were. Had to come back twice in one night.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "RCohfydH3wqDK24Aafhl6w",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. 2 chicken 2 steak tacos. FAST and delicious",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RCohfydH3wqDK24Aafhl6w/o.jpg"
      }
    ],
    "user_id": "pG-0fg0xNjjpWiFjAJN_pQ"
  },
  "DM8Y6wejMBXss0pAZWdL6g": {
    "date": "9/10/2016",
    "text": "Probably the worst street tacos I have ever had. Super bland, and charred meat with absolutely no flavor, super hard to chew.  Salad bar had no flavor, no taste. And the girls at the counter still didn't get our order right after literally repeating it 6 times, and watching them write it down...never going back... Extremely disappointed",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7FOSP2JRTdlNNFI0HyZsMg"
  },
  "16IKBVrzXAqZTcKgxE3B7Q": {
    "date": "3/3/2017",
    "text": "Tried three different times ( at opening, during lunch, and during 6-7pm) with all three times being a let down. All hype. Ok tacos, just a big old town Scottsdale following. J-box tacos are awesome when you're drunk right?",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BpNr9EE1xr1D2dS1uUy0OQ"
  },
  "r0Y93o7DuiQOoc8ujSP9zA": {
    "date": "3/20/2015",
    "text": "I came here for lunch and was really not impressed. The lady behind the counter had her food-handling gloves on while she was sweeping the floor and cleaning up the place, and then she came over to take our orders while handling the money and cash register with her gloves still on.   Can you guess what she did next? You bet... she went right over and started handling our food with her dirty gloves. I spoke up and asked her if she was going to change her gloves and she replied \"Why?\" I told her and she replied \"Oh, don't worry the broom is always clean.\" I explained again and she finally acquiesced.   OK, so now let's talk about the food... I had one chicken and one steak taco. The most notable flavor on the chicken was a burnt taste. She charred the crap out of it. Now on to the steak... it was overcooked to the point of losing all its juices, so it was very dry and chewy. Completely underwhelming.   This place is clearly an after-dark spot where all the drunken people from Whiskey Row can grab some fast food to soak up all that alcohol. To that crowd, things like flavor, quality and cleanliness probably don't matter so much. But to me, they matter very much and this place absolutely failed in my experience.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "lyxcBgfBzmXjfcmdQshU5Q"
  },
  "Lh1JoHro1Za5_Q--SYVJMg": {
    "date": "4/15/2017",
    "text": "Simple street tacos, beef or chicken, you dress them yourself from a well appointed condiment bar.  Really cool restaurant decor. Friendly staff.  All in all an enjoyable experience and I will stop bye again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7KvzrErLBNh3jSzPvBWh4g"
  },
  "vPd9bVf7PTs08OuWF2mfWg": {
    "date": "2/13/2017",
    "text": "Great service very friendly employees, the food was delicious reminds me of good old BK'S in Tucson. Will definitely be coming back and telling my friends about this New Place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CE0BRNv0G3_ORHOuXDqJlg"
  },
  "ezpk2ATm4Uqiu4h6w8X18g": {
    "date": "11/26/2017",
    "text": "Great food go see it for yourself.  Wife liked the chicken I liked the beef *** watch out for the hot sauce it's really really hot.  Quality food and good value....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iq5zpmvAUv3Whmsrl4npwg"
  },
  "KxplThp0RyTST0M0Bvzbyw": {
    "date": "2/14/2015",
    "text": "This review is LONG overdue. My friends and I went to Scottsdale in mid December and came across wadaa tacos. The owner told us it was their opening night at that location. We ordered a buncha carne asada tacos and they were incredibly delicious! So delicious that we went back the next night for more. They had very fresh toppings too. The guys that work there really know how to make authentic tacos and are very nice. I would go back every time I make a trip to Scottsdale",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "JpiGb8X0a5fNfLW_qjvXEQ",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JpiGb8X0a5fNfLW_qjvXEQ/o.jpg"
      }
    ],
    "user_id": "yWEMzq4gQIdaXEaZp5iIVw"
  },
  "uszBKgdsSmC6oBSIeyhY8g": {
    "date": "4/29/2015",
    "text": "Late night delight here. It will clearly help if you have had at least three beers. You can find the folks that have had more than that - they are sitting on the curb eating and those are usually girls. I snagged dos carne asada or beef (can't recall) tacos to go and after I downed them there were no issues with fatty pieces of meat etc. They were not serving quesadilla's, but the tacos were 3 bucks each.  Good addition to the land of late night pizza.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "73eG09X7cLgvkeo-VPOZSw",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Drink up, then eat",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/73eG09X7cLgvkeo-VPOZSw/o.jpg"
      }
    ],
    "user_id": "ELcQDlf69kb-ihJfxZyL0A"
  },
  "zVZiKBE90vqtXSGKJ_988g": {
    "date": "4/13/2015",
    "text": "Sunday fun day downtown Scottsdale as I just ate and found this place, it instantly reminded me of Cabo. I stopped to tell them how awesome the carne asada smelled and expressed my remorse for just eating. He hands me 2 cards for 2 free tacos anyway.......and I came back a few hours later to cash in........FABULOUS!! A must stop if your in old town!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "PdCR2ElSc0cVym5dCN3Zsw"
  },
  "c244b4WJNxkRadAlZrbzcQ": {
    "date": "10/5/2016",
    "text": "These tacos were pretty rough. The carne asada and the chicken were chopped into HUGE chunks of meat. The corn tortillas were the dark really hard kind that scratch your mouth on every bite. The food didn't have much flavor and the huge chunks of meat were very distracting. Each bite was difficult. The cashier was friendly enough but this place was not cheap and the food was below par.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HpxxA8If_msfkIstTkdwvA"
  },
  "udLoaW394TkZPa91H1q3aA": {
    "date": "4/24/2017",
    "text": "I can't begin to explain how much I ADORE WADAA TACOS! From the atmosphere to the mind blowing tacos. The steak is always seasoned to perfection and cooked with care. The set up for all the toppings are always stocked and clean. Not to mention the INCREDIBLE staff Jordan, Oscar etc have done nothing but take care of anything I need with the utmost professionalism. Also, the ease the have with relating to any and all guest Friday night 12am I stumble in to see the cashier with hickies and immediately think YES! This place is awesome! They get it! Our life's are crazy and fun and it just made me bring all of my friends and family in. If it wasn't for Oscar being so real I would've never returned or brought anyone else in. THANK YOU GUYS FOR BEING SO REAL AND COOKING FOOD WITH LOVE!!!! I come in once a day Mon Tues wed Thurs before school I can't think of anywhere else I'd rather be",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WcsIgr9QLhRs2nHPJU6AkQ"
  },
  "moNn_bdbodL27YnlFF2FwA": {
    "date": "3/17/2017",
    "text": "Had lunch here today but it is not the first time!  My kids and I came to check it out when it first opened and I will tell you that it is really good food.  How refreshing to have a menu that has nothing BUT tacos or quesadillas.  One price and super deal from 10-3.  I was surprised at the size of the taco being that it says street tacos. I assumed they would be the little ones but quite the opposite.  Its a cool little joint and basic...  gotta love straight forward food.    For two bucks a taco, take a chance, you cant lose.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ggBwEnSNxI2aEKzpbhWWdg"
  },
  "OVqcrO4RUox2jVmvayJKJg": {
    "date": "12/9/2017",
    "text": "Great prices, great service, and clean environment. There isn't much by the way of options, but if you frequently get the munchies for tacos like myself this is the most solid option on the west side. And the late hours definitely steal a lot of business from other businesses near by. Give them a try!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4yJOqIfCwxxSS7BUBzw7aQ"
  },
  "L2Kcx1UYG33WYwjuej8vjA": {
    "date": "9/6/2017",
    "text": "Best tacos ever.  The steak tacos are great.  The place is small, with only a couple of tables, but worth a stop.  You can add seasonings and sauces but do not have to because the meat by itself is great.  And the service is very good. Great place to stop when you arrive in Phoenix.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5StHxnjSujsJP7xtTkPJ5A",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Steak tacos with cheese - very good.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5StHxnjSujsJP7xtTkPJ5A/o.jpg"
      }
    ],
    "user_id": "pD_W9KOdAOGhAV2_9UsfqQ"
  },
  "UNoCP21sXPEEZj4Ws1kIoQ": {
    "date": "1/7/2019",
    "text": "Absolutely best tacos i had ever since i been exposed to one of their mobile carts. It is not bad for the price and give you a lot on the taco. There green is off the chain. I always love getting tacos from here and the service was very nice",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0HNQbkxQ_o60I8Zb2ocYZg"
  },
  "jEd8LuO9yvH2AufoBL9BPg": {
    "date": "5/12/2018",
    "text": "I used to have their tacos almost every weekend when they were in Scottsdale and they were the best!!  I saw they moved right down the street from my house on thunderbird but never was able to stop in. Well I finally got that opportunity and I don't ever take the time to write a review but these tacos were so bad and greasy that I had no choice it was a huge disappointment. I ordered 2 carne asada tacos and 1 carne asada quesadilla and small horchata ran me almost $20 bucks! The fat ass worker behind the counter was also complaining to the other worker how hungry he was, like I don't want to here your complaining dude.  Take your money to Los Reyes de la torta or la canasta way better!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kJHAVTn91BXE7SDbdNIXdg"
  },
  "PaOzOwfXfslTFB7-39eioQ": {
    "date": "3/4/2018",
    "text": "I tried to like this place and have been here a handful of times but the food quality is just not that great.  The menu is small and simple. The meat both chicken and beef don't taste that great. The first time I went here the chicken was juicy and tasted good but the 4 other times since then not great at all. The quesadillas are horrible to say the least.  They always give me free taco cards when I come here, which I always give away, I don't know how they make money with all the free taco cards i get. Once they gave me a stack of them.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "PfpRvMAESbC2bC8FUIMdNg"
  },
  "dPRMLj3a9IGCvdArmSLAdA": {
    "date": "12/19/2018",
    "text": "Where to start with this ridiculous place called authentic...... the young lady working couldn't be of age( Alexa) I think , she tried so hard while being alone , which I'm sure isn't legal for her age , cash register , cooking and dispatching ! The one star is the fact she was the only good thing about the place . Food horrible ! Old meat and old oil !!! Elote was okay , rice and beans as well as their salsa  Fraud , ranch market's product 100 percent sure on that . I ate it with out trying to be a baby . Till the whole family ends up with diarrhea . The only thing we all Ate in common . This is the second time we tried . Never going back.. 3 bucks for one taco . Veggies chopped bigger then the meat . ! Oh and the garage door was opened I asked why  it's freezing in here .. she replied something about the vent not working . The health inspector need to make a real inspection smh",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sXWR_G1mVYSmtH4kr3Id8Q"
  },
  "_HntuNIdy5Hv0AwuRjfeTw": {
    "date": "1/1/2019",
    "text": "Sucks came here for the new years to get tacos for taco Tuesday drove out of my way to get here says on the sign they close at 5 o'clock 347 they're closed disappointing to say the least after driving across town to get this  Not to mention when you call the phone number it gives an excuse saying that it can't take messages or there something wrong with the service all around seems too convenient to close early. If you wanted to leave early just post it but don't say you have until 5 o'clock then don't answer your phone or anything at 3:30 or 4  clock",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ynvO23V8svAIU-vVhkih2A"
  },
  "tFJAILCKrC61AX0fg7pleg": {
    "date": "3/19/2018",
    "text": "We hired Wadaa Street Tacos to cater our boat renaming ceremony at the lake. They did an outstanding job! First of all they came early, scoping out the space for setup, very professional. The food was delicious, everyone loved it! The red sauce is HOT HOT, everything you want in a street taco, we had the chicken, beef, and pork. All were warm fresh and yummy, served with cabbage instead of lettuce so it's crisp, I love that, everything they make from scratch. I will definitely use them again if I'm having catering. This was a gift to me, as I didn't have to worry about food, especially as our boat was still under construction. Who doesn't love a taco?! These guys nailed it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YdFmEHLUI8T0ZgK-UO2d3g",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YdFmEHLUI8T0ZgK-UO2d3g/o.jpg"
      },
      {
        "img_id": "mUoG3Opwnes6XNPmEyYgyg",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mUoG3Opwnes6XNPmEyYgyg/o.jpg"
      }
    ],
    "user_id": "l_eKEodnye8g5jlysmo66w"
  },
  "yoynRZqbWcqVKxEexkCTNw": {
    "date": "5/3/2017",
    "text": "This place is good! Came here on a Taco Tuesday to grab a few tacos. They have $2 tacos from 10am - 3pm pretty good deal. I'm pretty much a taco expert since I'm from LA where there are taco trucks everywhere. I gotta say, these tacos were one of the best I've had in Arizona so far.  I had two pollo and two asada, I liked the asada better but both were good. If you're up for the challenge try the red hot sauce they have. Not for the faint of heart though!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BPRI70WsAY5LXkX7yUcFJg",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. &amp;#39;Wadaa&amp;#39; you lookin at?",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BPRI70WsAY5LXkX7yUcFJg/o.jpg"
      }
    ],
    "user_id": "KvAnScuhUjfz2xUQcbHTjg"
  },
  "xYwD-epgCzz3TAbR0S4hDQ": {
    "date": "12/7/2018",
    "text": "The food is just trash do they even season the meat like this isn't even authentic nobody should come here!! They charge way to much for shit food",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LsNLAhmQOtQ671m3JSIz_A"
  },
  "hNckpR-v30UQIceKUWmQXQ": {
    "date": "7/14/2017",
    "text": "I noticed the original Taco stand in Scottsdale a while back and was interested due to the Yelp reviews yet we were put off because there was no where to sit and it was date night so even though not required, we prefer a bit more formality  on a Friday night. Anyway, I was interested enough that when they opened a storefront close to home I knew it was a must try. Despite a few negatives, overall it was very good for a quick bite.    Put off #1 was the service - counter person was a bit impatient and did not really seem like he was behind the product he was there to sling.  Although not all out rude, there was some frostiness about his demeanor.    Put off #2 has been mentioned in other reviews and is definitely annoying. The chips come in a huge bag which I would not ever imagine myself eating. Sorry I am into portion control on most days and a big bag of tortilla chips is not a worth it for me like a cobbler or cupcakes might be.  Who doesn't like a few chips and salsa with their taco's? Smaller portions please!  Ok, so now the good stuff:  Flavor of meats, flour tortillas, low, low prices and the worth it sugar fix - a peanut butter cookie!  I did not expect the cookie to be anything special so I was shocked and am kinda embarrassed to say that it was the best part of the meal.  I will definitely be back for more tacos, but no chips and salsa until they break down those big bags.  You bet I will be looking forward to many more cookies.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ucFH9zp8U_wwqbVM7XOhxg"
  },
  "EGv9aI-RovT1XpRkh68EQQ": {
    "date": "1/2/2018",
    "text": "Found this place on yelp and went the same day for lunch. We walked in and initially we were treated with the amazing smell of meats cooking and an employee that was very friendly. She asked us if it was our first time and let us know her recommendations. We were waiting for friends so we waited to order. Once we were ready to order, another employee was at the cash register to take our order. I feel like she was new because she seemed very frazzled by our orders and had issues entering the items into the system. We paid for our food and waited for our friends to order. Meanwhile, I read my receipt and the gal rang up steak quesadillas instead of pork tacos for three of our items. I went back up to the other gal and let her know and she corrected or order. Our friends also seemed to notice that the one employee seemed very frazzled by the ordering.  Now for the food. We received our food and on one wall they have the salsa/topping bar. They had cabbage, pico, a guacamole sauce, a very mild salsa, a rip your lips off salsa,  and some jalapenos. Not very much to decorate your food with, especially since you only had the two salads to choose between, but it did the trick. Then on each of the two communal tables they had seasoning salt that you could use. Food was good especially for the price. They were good size tacos, it includes the cheese if you want it. The only main bummer about the place was that there aren't fountain drinks. Glad we brought our own bottled water because I wouldn't have wanted to spend the extra money on a bottled drink.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "glqkmIPzX-5SWJ8r3SGBNQ",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/glqkmIPzX-5SWJ8r3SGBNQ/o.jpg"
      }
    ],
    "user_id": "Iy9q6toLRRPAAlM0klOMAg"
  },
  "JCAZND2vVLhXA0WTCPKGhQ": {
    "date": "5/24/2017",
    "text": "Fucking legit, love these tacos, they are bigger than street tacos, (roughly 2 times the size).   Order two steak tacos, and buy a bag of chips, add your toppings= better than filibertos nachos, top it off with a coke and you're good to go",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pt2b-P4YYogUjE8nIfuwEg",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pt2b-P4YYogUjE8nIfuwEg/o.jpg"
      }
    ],
    "user_id": "lVoSexyOBJ9wdLZZ4B_QZA"
  },
  "UA9PQ-BVQKbg9fvXBZe0OQ": {
    "date": "6/14/2018",
    "text": "I had nachos at the Old Town location and they were delicious! Not so much at this location. The nachos served here include chips, cheese, and whatever meat you select. They mix the cheese in with the meat and what you get is a hard ball of carne and cheese on top of stale chips. If you're going to charge $15 for nachos make sure they're edible and maybe throw in some actual nacho cheese in the mix. What they served me here was offensive. The tacos are okay but I will never order the nachos again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "maK3UBQczh33NuDjBYeHrA"
  },
  "ZsyamdrtFIe9Ns16NRZTHA": {
    "date": "7/9/2018",
    "text": "We had Wadaa Street Tacos come cater our party this past weekend. All I can say is WOW! Every single one of our guests raved about how delicious the food was! Miguel and his coworker were on time, Extremely friendly, and very clean! We will be recommending them over and over to our friends for future parties. The food was simply delicious and they were so nice... Such a great addition to our party! Thank you so much!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aKMBCHeslFnTeG732S9NHA"
  },
  "GEs8vWMcrcxBi8qrcCOU4Q": {
    "date": "3/10/2016",
    "text": "What a gem in the heart of downtown Scottsdale. It's a small little hole in the wall but their taco's are very appetizing..  The menu is small....,chicken or beef tacos with your choice of toppings.. of course flavorful fountain drinks. My favorite is the Jamaica and Pina.   Check this place out! It's open until the wee hours in the morning, for those craving that you need to filled......",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "rBL4GZ_vpeEY9lyaf7BqIQ",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Chicken and beef tacos.  I&amp;#39;m ready.... Come to mama",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rBL4GZ_vpeEY9lyaf7BqIQ/o.jpg"
      }
    ],
    "user_id": "Rp1_suVRaH7Fha0RsT9u5Q"
  },
  "xznMpFMuiqPWJm8_cyUyVA": {
    "date": "10/30/2018",
    "text": "Interesting place with great authentic food. My wife loved them too!  I got both the carne asada and al pastor tacos.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y3N3xzJbzwYNfIFxD0RkZg"
  },
  "-B5qLWr3-Uyd1tgwMg-Vpg": {
    "date": "12/30/2017",
    "text": "We came to this place to eat after the club. The food was ok. However they do not let you use the bathrooms when you are here.  For that might as well eat at MR Miskeet and have amazing tacos and not come here.  I will never visit this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "A0SA2m_nQorsYJOcxJJdXQ",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. We came to this place to eat after the club. The food was ok. However they do not let you use the bathrooms when you are here.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/A0SA2m_nQorsYJOcxJJdXQ/o.jpg"
      }
    ],
    "user_id": "aoLxykjp0s6dAIFssmCrVQ"
  },
  "Avabvm3rLpEotCD4Nr4viQ": {
    "date": "4/21/2018",
    "text": "Absolutely love the food here! They have an amazing guacamole sauce that is to die for! We drove a half hour today just for this amazing food!! I absolutely love them and they also have a great outdoor patio! Caution with the red hot sauce though!! A little bit goes a long way, a ladle overpowered the whole taco. Affordable and delicious overall! Great place for a quick lunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GldqKJq6g-L_UvsTC83-fw",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GldqKJq6g-L_UvsTC83-fw/o.jpg"
      },
      {
        "img_id": "F-DRtEmRqoQcB4q0PqwX9g",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/F-DRtEmRqoQcB4q0PqwX9g/o.jpg"
      }
    ],
    "user_id": "pLmAvbhACPtDj3aNeLeEgA"
  },
  "YVjbbvXrypE3iF-KXAZqdw": {
    "date": "6/8/2018",
    "text": "So one thing I love more than anything is a good Street taco. Saw the sign on the side of the road couldn't resist had to stop in and give it a whirl. Big mistake the meat and my carne asada Taco taste like it was cooked last week. I had to spit out more than meat than I could chew. Not to mention they're more expensive than any Street Taco I've ever had. I couldn't even get through one and a half before I threw them away. If you have taste buds don't waste your time the only thing good in this place was the salsa! The people were nice the food was horrible",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_ibnM0Srq6VLiK_YkQZpEA"
  },
  "K60313EHrbNf4zcrvKIcNg": {
    "date": "11/17/2017",
    "text": "Well..  Once a time a go, when the place was located in Scottsdale they really were amazing. Food was always fresh and fast. I feel as its just not the same.  Every time I go its normally around 12 or 1am when I am off work. With that being said, I am starving and thankful a place still open that's not filabertos, but it ends there. I ( just speaking at the times I seem to go) dont think they freshly Cook the meat. The stove is NEVER on..NEVER to where your seeing actual meat cooking at the timesnI go.. I think its precooked and stored. Which you can tell from the quality of the meat as its generally med warm, greasy and leaves you with a upset stomach. I am speaking from experience of maybe 5 times. Yes, I loved the food....but at a certain point...I gotta throw in the towel.   The salsa is great. Plenty of options. Always fresh and well stocked.   Sigh...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "0UU3JV2Od0sc5CyWWfcU5g"
  },
  "TWAitiwhq_4dFreBg1s2JA": {
    "date": "1/19/2017",
    "text": "Pretty good! I loved the street tacos and the topping bar was fresh! The quesadilla was crazy salty though, which is weird bc the same cheese used on the tacos wasn't salty so I am assuming they added salt to the quesadillas. Just won't order that next time, but I'll be back for the tacos! Before 3 $2 tacos!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QbBYQJ84jxy_sOPqxq1ToA"
  },
  "ITByrhW38B1qjliNHuD31w": {
    "date": "9/4/2016",
    "text": "I tried this place out today after shopping around at the Home Depot next door.  One of the employees was working the parking lot to try and get business to the restaurant. I gave it a try partially because i was actually hungry, but more because i admired her entrepreneurial spirit.  Im always down for supporting local.   TBH i went in with really low expectations because usually street tacos, while delish, are super small. I was really surprised how big and full the street tacos are! The menu is super simple and the tacos were insane!  You have GOT to try these mamma jammas for real.   A chicken Taco and a Horchata made the rest of my day.  Thanks for persuading me to come over!  Definitely will be back, prob this week.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "lZBfGMbJcs_dbL0NQRRvjg"
  },
  "leha7dpF_xBx84ZGD--oRQ": {
    "date": "10/19/2016",
    "text": "Ok, based on the reviews, I believe I'm the first person to review their new location on Thunderbird.   Food- The food in my opinion was, ah-just ok. I found myself wanting more flavor as both the chicken and carne asada did not have much. The chicken were better than the asada, which is strange for me because I love red meat. The asada tacos just weren't seasoned enough and slightly chewy in my opinion. Went to this location with my girlfriend, she didn't even finish her food and we were both hungry and love to try new places around the valley. You definitely get a good portion of meat with your food, small tacos, but lots of meat. The best part of the meal was the limeade, now that was to die for! Freshly squeezed and very tasty, not too sweet, perfect! I live not too far from this location and was hoping to have a good taco place nearby, not the case. I expected a whole lot more from a business who received \"The best of Scottsdale 2015\" award.   Decor- We were slightly confused by the decor to say the least. Only TWO tables, which is more than their scottsdale location, but still not enough unless you don't mind sitting with strangers. The walls and floor had a modern look, but the wooden trim and decorations didn't match the style or color they were going for. Slightly odd, but you go to a restaurant for the food not the decor.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DtCUa_yluIoMlWPoiZh5Kg"
  },
  "9hQN8WjO7pEQvDUCfPb3_A": {
    "date": "5/11/2017",
    "text": "Wadaa is soo good!! They have an awesome deal every day where the tacos are only $2 if you go before 3pm.  Their menu is simple.  Just chicken or steak tacos, queasadillas, and I even saw someone with a veggie taco.  Id definitely recommend this spot if you're looking for great taste and fresh ingredients.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3r9D6OC4Z2Gk45eG59rsDg"
  },
  "dLjiZLcDoiFx4u8uFZBsaw": {
    "date": "3/20/2017",
    "text": "Great street tacos.  Simple menu with asada or polite tacos or quesadillas.  Tacos were bigger than I thought they would be.  Fun decor despite being in a somewhat dicey strip mall.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x5SoFaGPs7u4-mN9HFAV8g"
  },
  "urCVdTI_khFs42PBoXKxBA": {
    "date": "1/8/2017",
    "text": "Overall...the tacos were delicious and fresh. The service was great and they were laid back. It'd be better if they had more variety on the menu. They only have two things you could order. Sad face.  Another thing that you may want to consider is the seating available. The chairs are really low in regards to the proportion to the table height. I went to go sit down and it felt like I was almost going to fall over. A suggestion to keep the simple menu and add more variety were to give two options: tacos and quesadillas, and then up to 5 meats to choose from for those who like both simplicity and variety.  Will definitely be back in the future to see how they improve on things.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5dvkr39ywFUodEqN8FBJ2A"
  },
  "noQQx-bE7aMzw9g6UxRGWA": {
    "date": "10/24/2015",
    "text": "Delicious!! Too good to call it \"drunk food\" even though they cater to the late night crowds.   Its a simple menu. You have choice of chicken or steak / flour or corn tortillas. They come with meat and cheese. You can add their pico, guac , hot sauce and cabbage, limes to your liking.   $3 a piece , good quality street food, you can't go wrong!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rP8glcj2nwZidkOAEo3Bjg"
  },
  "PAKvHs-MkLgDeMb6My4IEQ": {
    "date": "10/25/2015",
    "text": "Been waiting for an authentic mexican taco stand in the scottsdale area and i could say i found it! Authentic food, great service!   Been to Wadaa twice. First time was late night after Jefe's (bar/club) had doubts about going due to a large crowd but surprisingly lines moved fast. 2nd time was on a Sunday afternoon not that many customers but same great service and food. Love the unlimited vegetable/salsa bar and the easy menu Chicken or Carne Asada!   Thanks for being the best in Scottsdale! See you soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ARJdXmRQVo30kvG1oQzt7g"
  },
  "_i0rgHzRRVC7qev-AzCNMQ": {
    "date": "12/29/2017",
    "text": "I was so excited to try this place based off the reviews, however I was thoroughly dissatisfied. Although the serving size was great and they were very good sized tacos, they had absolutely no flavor at all. The chicken was completely dry and unappetizing, and the carne asada had no flavor and tasted like unseasoned ground beef. The pico de Gallo has more onions than tomato in it and was terrible, I would recommend you make tacos at home and avoid this place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "91XW-9oGRAbCEiRHnM_ZPA"
  },
  "epud1smPycrnYitZFDhoWg": {
    "date": "6/21/2015",
    "text": "An outside taco stand in Arizona? This must be madness you say.  Well no this is just delicious street tacos done right. I stood outside on line at Wadaa's stand in 100+ degree weather for 15 minutes just for the chance to get a few of these amazing street taco's.  Yes street taco purists will frown at the addition of cheese or maybe the lack of radish slices but not this hombre. The options are limited: chicken or steak. No matter which you select you will be satisfied.  This place is also open till 3AM and 4AM on Friday/Saturday.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "gVbM75yN60U9ylWhL-hYew"
  },
  "WOOKvAuYO6Fm0WeCnLXOgQ": {
    "date": "10/26/2015",
    "text": "I love how they keep things simple.   Their carne asada tacos are some of the most authentic tacos I have had outside out of Mexico.   If you go late at night, make sure to get your food before 2 am or you're in for a long wait. It's that good",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "yj5Yo0NFYDv4fqju9CnDww"
  },
  "YBMEOWYfJUTBomHTkremNw": {
    "date": "2/19/2017",
    "text": "It was ok. Carne Asada a lot better than the chicken which is bland.   Seating is ackward in that you sit with strangers and no fountain drinks.   Guy at the counter wasn't very welcoming either.  Wanted to give them a fair chance since I read how they got started.   Would try again after they're more settled in and see if they make changes.    Salsa bar was awesome but price was a little high per taco.   Will try it again another time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gCdQ8ro1UsJfNSpf6w-Cdw"
  },
  "N2qQrVnzVT8YT99HpXqU3A": {
    "date": "1/18/2018",
    "text": "Taco Fan! I just so happened to be strolling along and there it was... the taco truck. I cannot pass up a taco truck and am always trying new places. So, naturally, I stopped and ordered 3 tacos (since I couldn't decide on one, I decided to order all three to try them all). The service was good, fast, and friendly. The Al Pastor was by far my favorite, and probably one of the best Al Pastor tacos I've had in a very long time. Perfectly seasoned and cooked meat with a sprinkle of cheese. I added the pico de gallo and the guacamole. Nothing fancy. Fantastic! I also ordered the carne asada and pollo tacos as well and they were great too, but there was something about that Al Pastor. You should definitely hit up this taco truck when you're downtown!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z3UUJTKB84DPnJMkgqH9ZQ"
  },
  "ZFL-m66tRv4gjT7BSrIlRg": {
    "date": "7/27/2015",
    "text": "Pricey for street tacos ($3 each--WTF??) but they are as good as you can get in Scottsdale.  I was actually quite surprise since I don't normally hold \"2am drunk food in the club district\" to high standards but these tacos are really good even when you are sober.   The chicken is my favorites.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "z82b6JZqZVO0sVJFEhunIw"
  },
  "fHHgUReWaX5YT2M0gNHApw": {
    "date": "9/5/2016",
    "text": "Holy fricken moly!!!! This white girl may become Mexican if I can get my hands on these tacos every day!!! Carne asada makes my tummy happy!!! I would have posted a pic but they were gone before I could. The home made limeade is a must with your taco!!!! Don't be dumb, come get tacos!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zLMiO1f5nu6kuMeXS5byQA"
  },
  "EVkidHNM12UBPpjD5OVEGg": {
    "date": "9/21/2016",
    "text": "Wow, the reviews online must have actually been for the Scottsdale location because this new place is awful!  It's worse than a taco cart.  Even drunk you're going to have a hard time enjoying this tough, gristly carne.  And I had such hopes for a new place in the hood.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OFksM3859Kji6eEZgDSppw"
  },
  "unZgaY45qM7jz-8ubQk48g": {
    "date": "11/6/2016",
    "text": "Cool idea here. You can get steak or chicken then hit the veggie bar to finish it off.  Its good, I really liked both the chicken and the steak. The pico is good, the hot sauce is HOT.  Everything was fresh and the staff was super nice.   Priced appropriately.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "izryknWtwWVEEQdgFlnK9Q"
  },
  "idRY0wbsUqvmJ_z4UBRTRw": {
    "date": "10/11/2015",
    "text": "Some damn good tacos. Cheap, quick, and surprising filling!   Ask them to hold the flys. There are a lot flying around. But then again, they are street tacos. You can't expect a 5 star presentation   Would recommend.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zkeaeCzdZ-V5ei2_UR1L0g"
  },
  "_3Yn5UWymBDaS5dzPG6EUg": {
    "date": "3/21/2017",
    "text": "Modern clean eatery with simple delicious grub! Salsa bar had all the necessary hot stuff.  Staff was very friendly/welcoming and had my food out quick. Great place, wish I lived closer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HVg80XLoq5V8-nuFouSXeA"
  },
  "o_pfS4nJEGGNq9StKZ_wqw": {
    "date": "9/4/2016",
    "text": "They have decent chicken and carne asada $3 each or $2 from 10-3. That's the whole menu but the will make you a quesidilla if you ask and they also have a salsa bar.  We tried both types of tacos on corn and flour. I recommend getting the carne asada on corn and a limeade. The horchata was not that great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GwOM1kyHnwTU-FgiDhbO1A"
  },
  "42XVoR3nCIOAghGAYHevbA": {
    "date": "5/18/2019",
    "text": "One of the best tacos in town. Lots of meat, quick service, open late at night! Near my house too!  Love the big salsa bar, I can't eat the hot salsa though since it's very HOT, the warning on the bar is correct. I have the tacos with mild salsa and they are perfect!  If you want the best street tacos, try them now :-)  P.S: I came back last week and they gave me 3 voucher for free taco. Love it, you guys are awesome :-)) They are closed now! New Encinas is okay, not as good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9-wri2K8Bkh1B4h9DQ2F2A"
  },
  "d1yZaEK3l81WLVaHSAxn0Q": {
    "date": "8/27/2018",
    "text": "Hubby and I were headed back from Sedona and couldn't find a place open for dinner late on a Sunday night. I open my trusty yelp app and this place pops up! Tacos, ok!  Small place, a few tables set up, and no one in there. We order 6 tacos, and one of them was free since we checked in on yelp. 3 steak, 3 chicken, a water, and a pop. Pretty quick service! And so glad since we were starving. Dress your own tacos, sit down, scarfed them down. The portion of the meat was awesome, definitely not skimpy! If we are ever in the area again I would stop in for lunch, or a late night snack.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JrpaKwu6wJV2F6m1psenxw",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JrpaKwu6wJV2F6m1psenxw/o.jpg"
      }
    ],
    "user_id": "n2VFF6zplEmEiGF44a9bNA"
  },
  "P1fg3BoPqQ9ZLCUwuerP4w": {
    "date": "8/4/2018",
    "text": "First thing, they have really cool atmosphere and ambience inside restaurant. Disco colourful lights and music.  Good to try once and experience a new approach to street tacos. But the Meat is not so great. I tried all 3 available meat - chicken , beef and marinated pork. Pork is far out the best of them and i loved it but chicken & beef were very dry. They have good selection of sauce though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "okn-lnc_U4ZCDW50PrdEZw",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/okn-lnc_U4ZCDW50PrdEZw/o.jpg"
      },
      {
        "img_id": "n33XM2rJ3aUTaBNvCKnM_Q",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/n33XM2rJ3aUTaBNvCKnM_Q/o.jpg"
      }
    ],
    "user_id": "t85AWhHl2zFAbRNj7O_WoQ"
  },
  "Q2MaBGebcfW8OqyUEwuvIA": {
    "date": "11/7/2018",
    "text": "Look guys I'm going to give this place another shot on another day, but this was our first time ordering tacos thru Grubhub. No issues with Grubhub delivery guy was on time. The time did say 1130-1140 and at 1140 it said 1205-1210. We get the tacos and nachos and we were so disappointed. Both came literally with nothing. Luckily, I had all the extra stuff to put on everything. It was from bad to Ok. It was cold. The nachos had half a cup of meat and barely any cheese. At the end of it all, we winded up putting the meat from the tacos onto the nachos. Maybe because it was late on a week day, but hopefully next time is better.",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 7,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "Rj9qJyA7EguznYsrP3Ut2w",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. This is after I added stuff. They didn&amp;#39;t even put hot sauce.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Rj9qJyA7EguznYsrP3Ut2w/o.jpg"
      },
      {
        "img_id": "WsqgCctjDloYfUx7AAiJQg",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Might look like a ton but it really wasn&amp;#39;t",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WsqgCctjDloYfUx7AAiJQg/o.jpg"
      },
      {
        "img_id": "61tzVi0QN2XSjxO4qM7iKA",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Plain cold meat soggy tortillas",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/61tzVi0QN2XSjxO4qM7iKA/o.jpg"
      }
    ],
    "user_id": "80U-J9pRef6qNP-UgW4wOg"
  },
  "SFg7IpzIih-PPrysZuCl0A": {
    "date": "2/18/2019",
    "text": "Meh it was my first time trying this tacos and to be honest I don't think I'll be back. They were ok but the meat was on the cold side seen it had been seating there for a while, the tortillas were cold. The stars are mainly for the staff because they great us as we walk in, were super friendly and nice and the tacos came fast.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zMo372Fxe74gWDNNWD5WPw",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zMo372Fxe74gWDNNWD5WPw/o.jpg"
      },
      {
        "img_id": "avgpT3zAgS2y_wbnz1mQzw",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/avgpT3zAgS2y_wbnz1mQzw/o.jpg"
      },
      {
        "img_id": "kViRr4AuSeIJNos9OIjlPg",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kViRr4AuSeIJNos9OIjlPg/o.jpg"
      }
    ],
    "user_id": "Yqn1eFmISC_MOBJR_6AGiQ"
  },
  "iiIXO-JtfFCKruQE7hqobw": {
    "date": "10/30/2017",
    "text": "I remember going to this Wadaa location when it had just opened after their recent move from Scottsdale. I remember liking their tacos - even though it took us an incredibly long time to return and use the \"free taco\" cards we received from the owner.   Wadaa has a simple menu. I ordered both a carne asada and pollo taco, with both a flour and corn tortilla. I also ordered a cheese-only quesadilla, while my girlfriend opted for two asada. They sprinkle a bit of cheese on top and you're free to add what you like from the salsa bar.  Honestly, the tacos are just okay. The tortillas are very good quality. The asada has more of a marinated/wet flavor to it, as opposed to the smoky and slightly charred style that I usually prefer. My girlfriend thought she remembered it tasting a bit better during our first visit. The chicken had a bit more of a flavor pop, but only slightly.   As another reviewer states, due to their late hours, it might just be the kind of place where you need to show up loaded on alcohol at midnight in order to truly appreciate what they're doing here. It seems odd that they would leave Scottsdale, an area that probably offers far more drunken nightlife traffic - but also a higher priced location, so it probably makes sense.  The place is clean, the tacos are simple, and although they aren't quite up to the level where I would place them in the upper-end of cheap-eating tacos in The Valley, they're still worth a try every now and again.  Check them out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AS1OQMgXttjmTjzghOVkug",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. After",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AS1OQMgXttjmTjzghOVkug/o.jpg"
      },
      {
        "img_id": "8TJFY6tVzK4-aZB1CncGDA",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Before",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8TJFY6tVzK4-aZB1CncGDA/o.jpg"
      },
      {
        "img_id": "vVSot8mvse-uhCP6gQRk7Q",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Two Asada Tacos",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vVSot8mvse-uhCP6gQRk7Q/o.jpg"
      }
    ],
    "user_id": "TCPLaprJm4FFei2DkW6K6g"
  },
  "bvzezNEp4LOD6kc57jVWhg": {
    "date": "10/19/2018",
    "text": "Shitty service, OVER PRICED FOOD, joke of a \"menu\" and lack of customer service skills. The salsa bar has the tiniest to go containers and another thing, since when does the customer bag their own food?   By the way, the food made me sick-tons of bubble guts.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ArB5lcEvZrq6yhtYjNbadw"
  },
  "fYCLQAz9Lmqf6Z4rr0zTfg": {
    "date": "6/6/2019",
    "text": "A friend hired Wadaa Street Tacos to cater a graduation party for out 8th graders.  We loved them!  Choices to please everyone, mild to hot and spicy.  Can't say enough good things about them.  Highly recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MqGD5kYG_6MTlwYpSG8w4g"
  },
  "j0XuonXcjzl2WToAzX-VmQ": {
    "date": "3/30/2018",
    "text": "Okay okay so yes it's taken me a bit to make it here, but I have finally made it to the building! It's not an easy place to find but in the same strip mall as zia records. This is not just any taco shop, it's a \"taqueria\"! This place gave me the feel of being at puerto penaso aka Rocky Point. From the individual bags of tortilla chips to purchase to the flavorful meats of the charred pollo asado , carne asada, and pastor pork tacos . Very and I mean very authentic flavors with your choices of corn or flour tortillas . This restaurant is a must visit when in the  north Phoenix area! I Will be back shortly !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "fmh_o3IhCKU2REuXLY0p4Q",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Pollo asado corn tortilla tacos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fmh_o3IhCKU2REuXLY0p4Q/o.jpg"
      },
      {
        "img_id": "PFme84YidNHGcmcyhWN0pw",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Carne asada and El Pastor tacos with flour tortillas",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PFme84YidNHGcmcyhWN0pw/o.jpg"
      },
      {
        "img_id": "CABlvIW7UHd6rPoPylM1qQ",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Bag of tortilla chips",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CABlvIW7UHd6rPoPylM1qQ/o.jpg"
      }
    ],
    "user_id": "s76BDmBx_8kcxGFDiU6k_g"
  },
  "SovDBf6IOiiaZkEy2iGxlQ": {
    "date": "6/1/2018",
    "text": "When I first noticed Wadaa tacos in this location, I was super stoked because I remembered the Wadaa tacos stand in old town Scottsdale and how delicious those were. How awesome that I don't have to drive all the way down there if I'm craving these these tacos! But my experience here fell flat. I'm not sure if it was because it was super slow in there and I was the only customer that had walked in in a while but I felt like I was being rushed out of there and this reflected in the quality of the food that I received. I asked for steak tacos with a flour tortilla. I also requested that the tortilla be well done and I was told that this could not be done- which I've never had a problem with at the stand I go to in old town Scottsdale. But I let it go. When I opened up my tacos, I noticed that not only was the tortilla not well done but it was completely undercooked :(   Did not have a very good taste. Flavors fell kind of flat. I guess it's back to old town for me.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9qNU75q9tFS-c7eRGeZ3ig",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9qNU75q9tFS-c7eRGeZ3ig/o.jpg"
      }
    ],
    "user_id": "HLDo2_WkFxdhXoYf3VvX2g"
  },
  "IBVT_d4DtBhOF2VpfoSiEA": {
    "date": "8/20/2017",
    "text": "I love the food here, very simple menu - don't expect a full Mexican food restaurant. They specialize in carne asada and chicken tacos & quesadillas. I love the corn tortillas for the tacos and flour for the quesadilla. Salsas are delicious. The guacamole salsa is my fave.  But my only disappointment is it's not cooked fresh to order, premade & refrigerated - fine if it's the same day - BUT IF ITS A TIME SAVER, it's NOT HELPING. Food takes forever! Also no room to sit - I'd love to see them get smaller tables and put more in - I'd rather eat it fresh but we had to go because no seating. For a simple menu, they've gotten my order wrong 3/3 visits. Still...food is great! Just a few tweaks and it would be 5 star amazing!!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aOgwWEBOqeGr4TmzzsI3Dg",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Chicken &amp;amp; Carne asada tacos with the grilled onion on corn - mmmmm",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/aOgwWEBOqeGr4TmzzsI3Dg/o.jpg"
      }
    ],
    "user_id": "46aM0kni0GXjS0zx0-zTfA"
  },
  "t29uZQRt257Ueope_hv71A": {
    "date": "8/18/2018",
    "text": "I order jalapeno poppers and super nachos. There weren't any descriptions of each item but  it's jalapeno poppers and super nachos. Since most nachos has tomatoes on it, I added a note to put the tomatoes and cilantro in the side. Both items my girlfriend hates and both items used in a lot of mexican food.   The jalapeno poppers had meat and minimal cheese in them. Not what I was expecting at all and not what i wanted. I wouldn't have ordered them had I known.  The \"super\" nachos had a ton of chips covered in meat and a little cheese. Nothing else. No guac? No sour cream? No lots of cheese? No jalapenos or salsa or pico?  Super?! Super what? Super let down?   Never ordering from here again.  Advice: include a description of your food items in your Yelp menu.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "v2TIKW_qxmgG6Zb_Sq1FGg"
  },
  "W-hOUa6PPI7P2xQPw0bSQw": {
    "date": "7/7/2017",
    "text": "So happy we found this hidden gem open on the 4th of July when everything else was closed. They are open holidays and late nights till 1am. They also do delivery through grub hub.   It's a very nice small walk up and order type shop. There is two large tables in there to eat at but on a weekend it might get full fast so you can always grab it to go.   Simple menu of chicken or steak tacos. They are street taco size but they load them up with meat. I would say 3-4 will fill you up when hungry and 2 would satisfy. They give you the option of flour or corn tortillas and if you want cheese. Food is ready pretty fast. They have a self serve salsa bar with your choice of toppings from salsa, pico, limes, cabbage, and a really good avocado cream sauce.   I tried both the chicken and steak tacos and both were super good. The chicken was my favorite. Mixture of dark and light meat with lots of flavor. I added pico and the avocado sauce which made it delicious.  We will be back for more tacos. Thank you wadaa for satisfying our authentic Mexican taco craving!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "J-9a4OfL7cF6WaUyx0l-hQ",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Small but nice shop. Self serve salsa/topping bar to left.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/J-9a4OfL7cF6WaUyx0l-hQ/o.jpg"
      },
      {
        "img_id": "zGc3TmNhfihhduu3F3QJTw",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. 2 chicken &amp;amp; 2 steak Street Tacos with cheese, pico, and avocado sauce. Delicious with a bottle of coke!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zGc3TmNhfihhduu3F3QJTw/o.jpg"
      },
      {
        "img_id": "aDn3B5eoKd1eQn86OdbOaw",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. 2 chicken &amp;amp; 2 steak Street Tacos with cheese, pico, and avocado sauce. Delicious!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aDn3B5eoKd1eQn86OdbOaw/o.jpg"
      }
    ],
    "user_id": "MQwSyZ2MZ6N7rtAmphZCow"
  },
  "ikcO_78_-1wpA_ztwXSZQA": {
    "date": "2/26/2018",
    "text": "I love places that have a simple menu, for two reasons. First, you know exactly what you want when you go in to order. Secondly, it's the place you want to go when a specific food pops into your mind. Wadaa is that place when I think of tacos, which happens fairly often since I live in Phoenix.  This place has a really upbeat atmosphere. Always has some kind of high energy pop music and crazy lights going when I show up. Also a very clean store, so major points for that. I usually go for the carne asada tacos, and I'm never disappointed. They have a great salsa bar, with a very spicy salsa option, a smooth guacamole, and all of the onions + cilantro and limes you could ever need. Prices are reasonable too. I don't mind paying $3 per taco for something of this quality.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XlNPoDzkG582ExyZk9v-QA",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XlNPoDzkG582ExyZk9v-QA/o.jpg"
      }
    ],
    "user_id": "qqJ61BP7DPkzK9aSQnP7lA"
  },
  "ag4vwAn_nvI-5klH494iGQ": {
    "date": "1/26/2019",
    "text": "They still show as open and are taking orders through Yelp. They are taking your credit card order and charging it when they are not open in the location.  I called the number still listed and was advised they sold the store and only do catering and that I have to get this resolved through yelp and not them  Please DO NOT place orders and save yourself a hassle just not good business and just not right!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "I1HOe4mAaH9eDMPUrMY5Aw"
  },
  "jTzsBZjirtebYXi2ie6uEw": {
    "date": "9/27/2018",
    "text": "This place used to be in Scottsdale and their tacos were amazing. I don't know what happened but if you like paying 3 dollars for horrible quality chicken and steak then by all means come and eat at this place. The food wasn't cooked right and it tasted horrible! It seems like the owner tried to cut down on costs to boost profits by sacrificing the quality of their food.  Never coming here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a-tbiweSpvO53_b4J-9iLg"
  },
  "YrTXOl35ve_1M8B8iCL2HQ": {
    "date": "3/30/2017",
    "text": "Eh..schmeh!   My buddy at work, Bill, and I had the same lunch break last week.  We decided to hit up some lunch and Bill suggested some tacos.  I am ALWAYS down with tacos for lunch, so I Yelp searched a few spots near work and decided to try this place out.  4.5 star average reviews, close to work, and it sounded like it would be pretty good.  About that...........  We pulled up to the place, walked inside and placed our orders.  They keep things simple here and offer just 2 meats...carne asada and pollo asado.  I went with 4 tacos total, 2 pollo and 2 carne asada.  During lunch, they have their tacos discounted to $2.00 each, instead of regularly priced $3.00 each.  Total was just under $9.00.  I made my way to the salsa bar (the one good thing about the visit), loaded up on their 2 salsa choices, some pico and some cilantro/onion mix.  A couple of minutes later, my tacos were ready. Here is how they were............  Carne Asada-  These tacos came on a flour tortilla with carne asada and some cheese on top.  You dress them yourself.  They looked ok, but unfortunately the taste was not that great.  The carne asada was cubed up a little more than I like, plus the texture and flavor was kind of  \"off\".  It almost tasted like they soaked/grilled the carne asada in soy sauce.  It was a weird flavor.  I am a simple man when it comes to my asada.  Charcoal grilled (if possible), or just some salt and pepper if done on the flat top.  I also hit a few pieces of gristle throughout the 2 tacos.  They weren't disgusting, but I have had WAY better carne asada tacos. The tortillas they were on WERE good though.  I'll give them props on their tortillas but that's about it.  Pollo Asado-  Same presentation as the carne asada.  Chicken, cheese on a flour tortilla.  The pollo asado tasted better than the carne asada, but even then, it was a little too soft for my liking and had the same kind of marinade on it.  Once again, not disgusting, but far from great.  Overall, I think I am just spoiled from having lived in San Diego for 10 years.  We had SO MANY GOOD TACO joints down there that are head and shoulders above anything I have found in Phoenix so far.  I don't see myself ever craving this place or ever coming back.  Thank goodness it was during lunch and the discounted pricing because if these 4 tacos would have cost me $13-14 dollars, I would have been pissed!  Anyways.....Meh.  2 stars!",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "i_SMu8CN4Z6C00ooOa5rCA",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. 2 carne asada, and 2 pollo asado tacos.  Meh...not disgusting, but not good either.  Tortillas were solid at least!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/i_SMu8CN4Z6C00ooOa5rCA/o.jpg"
      }
    ],
    "user_id": "6jz_Yr6_AP2WWLbj9gGDpA"
  },
  "5nXYzO1egpSEutzxK0ktIg": {
    "date": "11/4/2017",
    "text": "I had really high hopes of this place based on the reviews but seriously not worth it. The meat tasted old as if it were cooked and recooked multiple times. The sauces not at all impressive. The horchata was not good and definitely not fresh or homemade style. The good thing is they have coke products but other than that there was nothing special about this place. Maybe when it first opened it was good but for the fact they only offer two types of tacos and quesadillas I wasn't at all impressed.  We can we tried and left disappointed",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "j_DuiJHWdEJqyjYEt2kAlQ"
  },
  "A8XmAcvEDIsh8YKQrLmNGA": {
    "date": "10/11/2018",
    "text": "Not the best tacos . Steak cold , veggies chopped in to big pieces service not good at all , place dirty and expensive 3 dlls each taco it's not worth it",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "S-9fzD0yRUdWo5XUZD6mgg",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/S-9fzD0yRUdWo5XUZD6mgg/o.jpg"
      },
      {
        "img_id": "SIrIp4XXi1yhIIhSJ9XEPQ",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SIrIp4XXi1yhIIhSJ9XEPQ/o.jpg"
      },
      {
        "img_id": "HOB5NUbUfCsBc5Xkgouexg",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HOB5NUbUfCsBc5Xkgouexg/o.jpg"
      }
    ],
    "user_id": "mImLNY9KmczcXoRX2wUaCA"
  },
  "j16MufLFasuuVrSX15yyPQ": {
    "date": "9/13/2017",
    "text": "Great tacos, great locations, great staff!!  Another great eating spot just walking distance from where I live. Been here 3 or 4 times now and hoping to visit many more times. The place is small and they don't have a lot of variety on their menu, but what they have is DELICIOUS!!  They have Asada (Steak) and Pollo (chicken) tacos which are $2.74 each. Quesadillas $3.65 with meat each. They also have drinks like Fresh lemonade, Horchata, Jamaica, Soda, and water. Prices vary based off of what you want. Chips and salsa are $3.50. I have only tried the tacos and Quesadillas. Amazing! Simple, but very good.   They have a nice size salsa bar with different kinds of salsa, cilantro, onions. cabbage and limes.   Open late 10 am to 1 pm daily.  Staff are very friendly and helpful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "zudZl2wYpmZYyoklPVhV-A"
  },
  "2KhVvWRj9QSt-vgrijoYig": {
    "date": "1/9/2017",
    "text": "It didn't take me long to fall in love with this place - the first visit, actually.  The menu is simple: Tacos.  Two choices: steak or chicken.  And the tacos are LOADED, meaning that they don't skimp on the steak or chicken. The salsa bar is fantastic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zgg6477l--g13mg6JbTc_Q"
  },
  "EkjXJZEkQdU14GbK-AKOew": {
    "date": "3/3/2016",
    "text": "Just discovered this gem only a few blocks from home.  I'm a fan, really hits the spot when I'm craving street tacos!    The Good: - Meat is tender and flavorful beyond. - Portion size and prices are ok by me. - Workers are chill and food comes fast. - The hours are great, can grab a late bite.   The Bad: - No rice, beans, or burritos options. - No place to sit or stand and eat.  - Cabbage is too chunky (should finely shave it).   The Ugly: - Take out packing doesn't let taco hold up well.   - Patrons are sauced from nearby bar (but nice).  - Taco so good you'll look deranged when eating.    Bottom line is the negatives aren't really a biggie when the food is so frickin tasty.  Couple of tweaks and this place would crush it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j9B6EZ6aHyg73zZCG1gz0Q"
  },
  "IDbPMPpWlB1DnIr_vv4gNQ": {
    "date": "11/2/2015",
    "text": "Eh.  If you like gummy, soggy flour tortillas that can't be picked up, then you would love it here.   I was totally enchanted by the hot coals and cooking meat, but it should have been seasoned before hitting the fire and the add ons could be more exciting.   The tortillas were a disaster though. Since there are no seats, I ended up sitting in the car picking the meat, etc with my fingers and leaving the gum wads behind.   Sorry. They could step up the game a bit.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "ec5Ax2aNBUDp7g9f4Ed30Q"
  },
  "8c6wZ0K-MU9w52JgrQ5qgQ": {
    "date": "10/17/2015",
    "text": "Two types of tacos only (chicken/steak). $3 each. The meat is high quality. The flour tortillas not so much (very doughy/not homemade or warmed up etc.).  They have a station where you can get limes, pico and cabbage. None of which were maintained well.   Overall just ok.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "0ygWZ_gXF8qTm0bY95JJqA"
  },
  "8QMW3oHGu-fKUxohPsIt4Q": {
    "date": "4/3/2017",
    "text": "I'm wondering why this place is rated so high. The tacos were decent but on the expensive side for a street taco. The only meat options were chicken and carne asada. Not really what I was looking for in a taco. I'd rather hit up a taco cart on the side of the road",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0IfJ5KTBbUjD-Q2f6SdQ8g"
  },
  "HTGTxp3UEvrNVK4XO6JaBg": {
    "date": "5/10/2017",
    "text": "I would give them 5 stars if they had burritos.  I love burritos!  Best chicken and Steak street grilled tacos I've had in Phoenix. You get chicken or steak as well as your choice of flour or corn tortillas.  I will become a regular.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tGVRPMpvtS7GowqCCeg9MA"
  },
  "vsNsJFVLcTboTziSpLdnNA": {
    "date": "5/9/2017",
    "text": "I couldn't post a picture because I ate my food too fast, but the food was delicious and the employees Oscar and Julian made the experience great! And I couldn't believe how fast they had our order! Definitely will be coming back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bn7QX-xhc6CUNkMdsInulQ"
  },
  "Wnw7UvNrnNad3sm265D6bA": {
    "date": "1/30/2016",
    "text": "This place is pretty awesome. I love street tacos its been a new thing of mine. Ive been to plenty of taco shops and this one is amazing. Im craving them right now. Menu is pretty simple. We got 4 Asada tacos and 2 chicken tacos. Let me just say the meat was the best. You can really tell that they grilled it with the flavor. Meat was tender enough. Chicken was juicy. A bit expensive but i think well worth it!   One thing i would change is they should add a little more array of salsa. They have one REALLY hot red one and a nice green one. Maybe add a mild one in there?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eBytDMXhIcjfcCfXgL4pgQ"
  },
  "-Zl1Q4pyIlXBjnA_PkmHcw": {
    "date": "8/12/2017",
    "text": "Great food!! Good taste... the red salsa is amazing... but watch out for it because is really hot! Is open until late... and the staff is very friendly... definitively will come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3vl6qAoVUnb36TXSZ9dgdg"
  },
  "kiIpYRFbv6meUfj31B2Rng": {
    "date": "2/25/2018",
    "text": "What a great little spot for tacos! The menu isn't huge, just simple street food, but they do it so well. I had the asada tacos and elotes, my boyfriend had chicken tacos and it was all good. The service was quick and the guys working the counter were incredibly nice. Your taco comes with just the meat and cheese, and they have a nice selection of toppings (different salsas and lettuce, etc.) to make them how you like them. I don't think I've ever eaten a taco as fast as I did here, because it was so good and I couldn't wait for the next bite. Definitely don't pass on this one for a quick and delicious bite to eat!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1-ncq63eXCBTUUNieudCrA"
  },
  "KEGMokbgdIk4Di6uH7asFQ": {
    "date": "8/7/2017",
    "text": "Super good tacos!   They even made me a veggie taco since I don't eat meat! Clean and fresh!   I wish there was one in Surprise where I live!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wLyXHowdpY9o0o6a9gkpoA"
  },
  "pTnC5Wiq90gceD7KLlF_ag": {
    "date": "4/24/2016",
    "text": "These are some of the most amazing, authentic, fresh tasting, healthy tacos you can find in Arizona! I'm not even a taco loving person as I'm super picky with food, but I literally crave these tacos all the time and stop by all times of the day to get them.  Great location, amazing quick service, very reasonable prices and a very simple menu so it's easy for indecisive people like me to choose what I want. I highly recommend Wadaa Tacos! Even on a weekend night when the line is super long (because it's so good everyone wants it) it makes waiting for the tacos worth every minute.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D5lIW0TA7AOpkAQMrsCUOw"
  },
  "HaLsPFTLcRpeMe_nnUs6Hw": {
    "date": "12/18/2015",
    "text": "Love this place. Fast and good. I get the steak tacos with no cheese. Add a little pico and guac sauce and you are good to go! $3 each - just 2 choices here- steak or chicken! Busy at lunch but they keep the line moving.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Xacd-HlOwuCLnyZMjRVyBw",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Steak tacos - yum !",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Xacd-HlOwuCLnyZMjRVyBw/o.jpg"
      },
      {
        "img_id": "EiyDBefVYoDRZT-QrXXxxw",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. One year anniversary!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EiyDBefVYoDRZT-QrXXxxw/o.jpg"
      },
      {
        "img_id": "OeDmSqsIj_6JGPVzT0YjWg",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Wadaa&amp;#39;s tacos !",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OeDmSqsIj_6JGPVzT0YjWg/o.jpg"
      }
    ],
    "user_id": "o-GAkbTTcHFY3KqVDCE8sA"
  },
  "-3tJ9x5MAdZzJvDMtkeRGw": {
    "date": "2/17/2018",
    "text": "These street tacos are amazing!! You have to try their fresh squeezed limeade. Everyone working here is very nice and it has a cute/cozy atmosphere. Will definitely be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wraPe0nDXNOhUFsytCK6Ew"
  },
  "G-k6pA71AKiQNnscCTjqHg": {
    "date": "3/5/2016",
    "text": "If you can't fly to Mexico with Cap'n Lefty, go to Wadaa Street Tacos in Scottsdale. Without a doubt, the best food on our trip!     Save your time and waistline and enjoy high quality superb unpretentious food. This is the real deal! My F/O loves it too. This is a destination, not an alternate!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R2hJ59d0yuKxvBAd029Q7Q"
  },
  "wLssyCU8aWWVDFDR82KOjw": {
    "date": "10/20/2015",
    "text": "Location for this place is obviously great, but that's not what makes this spot a 5 star for me.  The food alone deserve a 5 star.  They are huge tacos, so don't assume you will eat as many as you would with smaller sized tacos.  On a side note, you will smell like bbq by the time you're with your order, but well worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "3o4KYUZexmKV3cooeUsTCQ"
  },
  "GXFwZKsGMJvWNV6R8Q58gA": {
    "date": "10/19/2016",
    "text": "Not all its hyped up to be, the meat is poor quality and the price of a $3 taco is not worth quality. It wasn't bad but it wasn't knock your socks off. I think it's cool to have new businesses around that are not big chains they should have better quality for the price.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "gxYsLtosNDh9EAoT87MD8g"
  },
  "1DfBY7gr9T-nNyeRQpgpsg": {
    "date": "5/27/2017",
    "text": "We stop by Wadaa Street Tacos on occasion. Always have a great experience... simple, fast, taste great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dl3vInjjn0HHsOge516qNg"
  },
  "luem6Ld-jJeHurExJeEKQg": {
    "date": "8/27/2015",
    "text": "Hands down my favorite street taco ever! You're bar-hopping through old town Scottsdale when suddenly you smell burning meat goodness. Is it BBQ? Someone grilling steaks? You follow your nose a little further though the bars and it leads you to WAdAA! a cool little taco stand. There they're grilling up their meats using wood. Walk a little closer to where the action happens and you feel the aromatic heat hit you full force. How they work in that open oven I have no idea. But I'm glad they do it. The meat has this beautiful char, and as you bite through it, it's the most perfect tender/juicy meat you'll find in a taco. Add all the fixings they have on the side and you're golden. I can't tell you the name of any bars we went to that night, but WAdAA! is where it's at! We ate there 3 times in the 2 days we visited.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "iNZP_p1EjmL_j7VqyrfrUg",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. The wood permeates throughout the bars.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iNZP_p1EjmL_j7VqyrfrUg/o.jpg"
      },
      {
        "img_id": "xJl_HomnfuYWNUM9Lu6ROA",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Came back that night for seconds..",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xJl_HomnfuYWNUM9Lu6ROA/o.jpg"
      },
      {
        "img_id": "Eyn1lvlLtagoRmJYoPY7Vg",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Follow your nose to their little stand.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Eyn1lvlLtagoRmJYoPY7Vg/o.jpg"
      }
    ],
    "user_id": "YTSJME0IcoanvIvgqNGvKQ"
  },
  "OQGf5zsLjrM-EbvtD0TIag": {
    "date": "8/22/2015",
    "text": "Drunk food doesn't get better than this. Carne, salsa, lime, $3, it's perfect. Plus the people watching here at 2 AM is great. Loads of terrible people with impaired judgement. The last time I was here I saw a girl knock another girl's cell phone out of her hand, breaking it and subsequently refusing to pay for it after repeated drunken demands. Proceed to escalation: name calling, stumbling around in high heels, aggressive posturing, male friends stepping in trying to defuse the situation. No such luck, as girl A hops into a golf cart, girl B runs over to her, grabs her phone and spikes it on the concrete. More escalation, followed by the storming off of Girl B with her broken cell phone after threats of police intervention.  Where else in the Phoenix metro area do you get to see live-action Jersey Shore while eating a delicious $5 taco?  Entertainment, price, product, Wadaa has it all.",
    "rating": 5,
    "rated": {
      "funny": 9,
      "useful": 4,
      "cool": 5
    },
    "photos": [],
    "user_id": "sKd6tuqt1W9HHYG3ZEO9xg"
  },
  "i9v1nyMVjYdStxCnO9IOkQ": {
    "date": "11/4/2015",
    "text": "The aroma will lure you. I was going to a business next door.  I couldn't resist the smell, it was amazing. Fresh everything! Definitely recommend this establishment!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ia4_8rK1CJzLnRgdoMUEGg"
  },
  "dWy1pfkBX0cGD3EvI9b1yA": {
    "date": "3/8/2016",
    "text": "I must say I was born & raised in Scottsdale & I have not had better tacos than Wadda street tacos!!!! So addicting!!!!!!! The staff is incredibly friendly every time I'm there but & the owner Miguel is such a gentleman & definitely knows what hes doing when it comes to his Tacos!!!! Love the carne esada on some corn tortilla throw some cheese on that bitch top it off with lime, pico, cabbage, guacamole, & more cheese then boom- orgasm in your mouth!!!!!!!!!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hAL6wUR1FoKRVg5QO1fZMA"
  },
  "Av2z0KCHAaphVrBSp89M4g": {
    "date": "1/4/2015",
    "text": "If you want delicious, fresh tacos after a night out this is the place to be. The owners are very friendly! They made an amazing quesadilla!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VIgIN3MQqiWejSXdeslzkQ"
  },
  "4sSB5imJoQLfzdJgR8UFEw": {
    "date": "6/22/2015",
    "text": "There's always a line over the weekend and usually I'm a little too intoxicated to wait. I tried the tacos on a Sunday night when there wasn't a line and wow! Heaven in my mouth. I've been looking for delicious, hangover helpers, street tacos and I think I found the place. Gabe, I think that was his name, was very friendly and he had great service. The horchata was really <a href=\"/redir?url=http%3A%2F%2Fbomb.com&s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\">bomb.com</a> too! I will be back maybe everything I need a hangover cure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yKBenWMLCe5UBVi_gXWIBA"
  },
  "l2Q7Yfq-0J5D_SQ_7tMtKg": {
    "date": "10/5/2015",
    "text": "I am uprooting my family, moving to an apartment across the street so I can eat here everyday for the rest of my life.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZIQjG_DM6oY9XXRw3W5-Gg"
  },
  "mhDe9c1-ZTtn03ABFVxg4g": {
    "date": "6/9/2015",
    "text": "Sunday Funday brought me here and damnnnnn I thought Rickys Tacos had the best chicken tacos ever, this place just became my #1 spot for chicken tacos!!! Everything tastes like street tacos in Cabo, expect you in Scottsdale!!! They are like crack I crave them all day and night....Im about to get my taco full now as we speak....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cqNmg3qGdFTYJCGHQXC8zw"
  },
  "Ph1nwUqRDiAflSE7y2Bfmg": {
    "date": "8/22/2014",
    "text": "A MUST GO FOR SURE! Amazing tacos, only $2. Owner is great...very passionate and knows how to make delicious tacos.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "E1kXdtyEYZjUUvV0KFEC1w"
  },
  "kHq4KFYkFjDD5_RSnwyOoA": {
    "date": "9/21/2016",
    "text": "The best Tacos ever..They have got two options for tacos pollo and asada. They have also got quesadillas. Everything you get here is awesome. The sauces red and the avocado cilantro cream are amazing. The red sauce is hot, for real and the green one is mild, both flavorful at the same time. Loved every bit if it. Thanks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j-uexupT_uDRmEHQzUVnWg"
  },
  "O5i1qkqMKyBdw5fMeBd31A": {
    "date": "5/5/2015",
    "text": "Super good tacos. Reminds me of street tacos I used to eat in TJ when I lived in San Diego. Consistent seasoning and toppings bar to make the tacos to your liking. Get the beef tacos and make sure to add the green avocado sauce!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DioLqi1rbqA4EjOe45xj0A"
  },
  "FaTeTcU1SlygPzuiVemqnw": {
    "date": "9/6/2015",
    "text": "Amazing Tacos, so delicious, a tad pricier than I would like, but well worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TmWxTIaEVzhXeQ8qQGBbxg"
  },
  "9nbWuyXFInN0YLdKR9xsVQ": {
    "date": "9/3/2015",
    "text": "I was staying at a local hotel and decided to walk around to find a place to eat. This was one of the very few places open around 10am.. The tacos were great. Regular sized tacos, lots of meat, delicious salsa, friendly service... Would highly recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PA0Xs2lY8S10T3_9vtx9Eg"
  },
  "ZqzZVmzlaS_s-RuGuW9jSg": {
    "date": "10/22/2016",
    "text": "This place was amazing!!! We will be back on a regular basis!!! Service was awesome, clean, so much for the money. Loved it!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MMCYEZUJrDwjbbdEeA8cQA"
  },
  "DOPGAzE0DCsN3d-YpQK79w": {
    "date": "6/2/2015",
    "text": "LOVE THESE TACOS!! Not only is it the perfect after club snack but I crave it all the time!! Good amount so simple yet so good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "On3YvQALv_5kajNS8C3V8w"
  },
  "0lh0CDvUyWWv4qRP3TWrJQ": {
    "date": "8/22/2015",
    "text": "Just had a chicken and a beef taco. Very tasty. Don't walk up expecting a menu. They just sell the basics but very good at it. Would have given it 4 stars but they had a very distasteful comedian playing on the radio that kind of ruined the experience for me.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bCGBvaFK5-VNb1429pOQ3A"
  },
  "0wOSUt8TphapJThgn84Yyg": {
    "date": "4/3/2015",
    "text": "Good for a quick cheap lunch.  Worth going just for the smell of the grill!  Flies in abundance a little annoying but oh well.  $3 per taco, the steak ones had a little kick.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N0Bw1q4XNjxyqyl4Ncfj9A"
  },
  "2Qz78jLwfDsU0nMdf3qtbA": {
    "date": "3/17/2015",
    "text": "Awesome original street tacos! The best I've ever had, anywhere. Be prepared to stand in line, even at 3am! Miguel the owner is friendly, he'll take care of you...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e2PGYqTADcIYOd-sL71JXQ"
  },
  "qX25fLMx3hgULdCTvTutvA": {
    "date": "7/19/2015",
    "text": "I eat here easily 3 days a week. Great street tacos and great staff. They are always open and always so friendly. You can smell the amazing tacos around the whole area because they cook with the mesquite wood in their grill. Real meat, fresh warmed tortillas and simple toppings which makes it easy to decide. They are seriously at the very top of my list for tacos in this state. Try it, you will love it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gq3uY0ozAyfZmVHUatjMxg"
  },
  "Zqzo830wZFdnQPl5dxM2WQ": {
    "date": "3/8/2015",
    "text": "Padres vs Giants sold out, Yelp'd for Mexican food and Wadaa Street Tacos came up, with plenty of stars so we made our way.  Being from San Diego, I have to say that these tacos are tastier than Tacos El Gordo.  We will be back next year to enjoy these tacos again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Q2NILEHg0ZPy56UaamVow"
  },
  "W69go3IcrEbL6pXCflXFSQ": {
    "date": "9/3/2016",
    "text": "Now open new location on 25th ave and thunderbird, same great food. Best street tacos in Arizona.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7mQDdA7zJKBYqdO8t_VStA"
  },
  "VPXUblGipmnoeI0-W6798g": {
    "date": "10/5/2016",
    "text": "Very good! For those on here complaining about yellow corn or flour tortillas and somehow determining that's not authentic because of that...it's simply silly and ignorant. There are red corn, white corn, blue corn tortillas...all that is authentic. Just because you don't like them isn't enough to rate something as unauthentic. Flour tortillas are preferred in the northern region of Mexico. All in all, decent and good food. Simple, only two kinds of meat. The only thing: I'm more of a private, I need my own space guy. Two huge tables for all were not really my thing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c2_5K6VrhZosAn0K5RjAGQ"
  },
  "02RLnt97OgFbvdFtnPZ40Q": {
    "date": "12/5/2017",
    "text": "I know a good taco. And this place used to have good tacos with hot juicy meat and melted cheese, this was when there was 2 gentleman working this place. Went in today and it was not what it used to be. Not only did the prices go up, receipt had $3.00 per a taco and the board showed 2.74! 3.00 per a taco those a restaurant prices. The corn tortilla was not warmed enough was crumbling while a ate it,  there were several time while eating a had to stop to pull a piece of not warmed enough fat out of my mouth that was to hard and chewy to swallow. Not to mention I asked for cheese and it was not melted into the tortilla like it used to be,  this may be my last time visiting this place. Be warned",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gvb75QQAcYQmAF7nLdTTrQ"
  },
  "KWgphYfEpAI4Zr2KiwcZEA": {
    "date": "11/4/2017",
    "text": "First time here at 11pm, never seen such bad service and disrespect for customers watching. Waiting to order but the cooks are too pissed off to take it. One of them is literally throwing plates and food around as he puts orders together and smacking the register as they receive online orders.  I walked away, not thanks I don't want my food made that way. Saturday, November 4th at 11pm.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G_B_I5W1nI_A3MRlzTLGtw"
  },
  "_mNxedz46kCkWtBlIfQN_w": {
    "date": "9/28/2017",
    "text": "Everyone raved about this place saying it was great. To be honest they where just ok nothing really special",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "6iIH4r_thzKEKH7Qmeulcw"
  },
  "HCWEvSo_iJxup08PVdzDJQ": {
    "date": "7/9/2018",
    "text": "have no idea about the quality because the order i was trying to pick up was apparently 'too confusing' for the guy working. after telling me it would be at least 20 minutes because he hadn't even started it until i got there, i walked outside for a minute. when i returned there was a new customer and he told me he would not be filling the order at all because 'people keep coming in'. waste of time, which, as a delivery driver is basically taking money out of my pocket. adding insult to injury, I had to hear TWO Black Eyed Peas songs while dealing with this",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hIG5qvEbM0qLavmUet7qNw"
  },
  "1gO5DRgT1E8I7Kk9XsKOYg": {
    "date": "3/16/2017",
    "text": "Best street tacos in town! Fresh meat, fresh veggies and the salsas are amazing! Great service and very clean. Must try if you are a taco lover! Thanks Wadaa for being #1!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4l8F6Apww1mSegJXxTVY-w",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Wadaatacos!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4l8F6Apww1mSegJXxTVY-w/o.jpg"
      }
    ],
    "user_id": "Ydtz6Rv93Wy0Qs9bsM-vPQ"
  },
  "uh0--pAXoSeV9bpDFhT6NQ": {
    "date": "10/25/2017",
    "text": "Love the simplicity of their menu and approach!  Authentic street taco, 2 choices, pollo or asada, everything else you can add from their fresh condiments bar.   They also serve late night !   We were helped by Wayne and Rhonda, they were very informative and the food was quick and delicious!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "toLRXRmY4yN7KTHNfYmBcQ"
  },
  "39lBh2sPAAO9XadT2xZvow": {
    "date": "11/14/2017",
    "text": "Their menu is extremely Limited. They only had two different types of street tacos. Their prices were pretty high $2.65 for a taco, a single taco!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FvGRZu7mw6uWkwNiCMv0qA"
  },
  "V8OWewAdCUlAjOfKPQIW-A": {
    "date": "6/6/2018",
    "text": "I had the asada and pastor tacos. Biggest issue is the quality of the steak, it is very greasy and I found multiple chunks of fat in my taco. The pastor was better but not amazing. Prices are also high $3/Taco.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MST53rmGX8C3xc2bjJ6mBA"
  },
  "O1aIPlBGId5RmuIEnWGUYg": {
    "date": "6/21/2016",
    "text": "These are legit.  Literal street tacos, but the smell is to die for.  I like that the meat is grilled, and the fire is impressive to see.  Great salsas on the side and cheap.  If this were in a restaurant, people would pay $15 for three and be loving it.    I'll be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "BundOhhU66aDA5evpfxFhQ"
  },
  "FlqA_JliF6Z-TfB1IeNg2Q": {
    "date": "9/22/2016",
    "text": "Excellent eats! No nonsense eating are. All about the tacos! A must try for anyone that likes street style tacos!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fO5mXQNKJKSJIsG0B7a_lQ"
  },
  "aesitwAEoDVQd-QQG2KYsg": {
    "date": "10/17/2017",
    "text": "I read many positive reviews about the location in Scottsdale so was excited when they opened up near Moon Valley. I think it needs to be well after midnight and after drinking a lot of alcohol to truly appreciate this place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gf8uKTlsGiwShWnciVynEw"
  },
  "74uzkpo2T-ZsVqSfnvYpLw": {
    "date": "10/28/2016",
    "text": "These tacos are amazing! I got the asada and chicken tacos on corn tortillas with grilled onions and cheese. Sooo good, and they were PACKED  with meat. Don't forget the free fixins at the condiment table, either. these tacos are da bomb!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "t78gnQWtLSrHYWn15MytSA",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/t78gnQWtLSrHYWn15MytSA/o.jpg"
      },
      {
        "img_id": "YouHDORBpaKKYLTeWEAwGA",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Wadda Street tacos @ 2510 W. Thunderbird Ave. YUM.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YouHDORBpaKKYLTeWEAwGA/o.jpg"
      }
    ],
    "user_id": "fsra4bYoi8etCEE71tSDIQ"
  },
  "UOQLUBg8xZeTah9A0TXbRw": {
    "date": "6/18/2018",
    "text": "Best tacos in town!! Mike Vargas is extremely friendly, helpful and up beat, haven't had customer service like that in sometime. If you haven't been, it's a must go. Amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JypPeojxPQhyqsVMnNU70g"
  },
  "GWaTSU_JI5kYhxaEKmAcrw": {
    "date": "4/28/2018",
    "text": "I really enjoyed my pastor taco and quesadilla, they were both super tasty. My Carne Asada taco was good but nothing special. Small menu but less items = more fresh ingredients. I will defiantly be back late night, not many places open as late as this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hwzOkCZmk8egXK3DmC9WAw"
  },
  "m4kOA1Usm5Jp_9LCoidyvw": {
    "date": "3/13/2017",
    "text": "Kinda spicy, but good!  Interesting experience, to say the least.  Great limeade, and nice music, too...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cKyegoyEiKsL8hKZ-smDww",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cKyegoyEiKsL8hKZ-smDww/o.jpg"
      },
      {
        "img_id": "0Us7Uz8hoVqtpGHWXfupQg",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0Us7Uz8hoVqtpGHWXfupQg/o.jpg"
      }
    ],
    "user_id": "DpK98lP9YirvCaUx5Ew5rQ"
  },
  "NIP6tghmHctN8WsCQX_NbQ": {
    "date": "1/20/2017",
    "text": "Food was delicious! Just off the I-17 and thunderbird. Next to my other favorite place Zia records. I overly enjoyed the carne asada quesadilla. And they even hooked it up with a free taco coupon for next time. Two thumbs up",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZxXRsn0Of9zVfNGcF85uRg",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZxXRsn0Of9zVfNGcF85uRg/o.jpg"
      },
      {
        "img_id": "JKBf3favQooM0frLiMEBxA",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JKBf3favQooM0frLiMEBxA/o.jpg"
      }
    ],
    "user_id": "0wVdiA7XnlysKv45GYffiA"
  },
  "XbS_ogXVmfy_-9ZZfBj8zg": {
    "date": "1/7/2015",
    "text": "These tacos are absolutely the closest thing to real Mexican street tacos. I had the steak and chicken. The chicken was moist and tender. The steak on the other hand was a little bit tougher but similar to that on really taco truck.    The salsa bar includes fresh pico de gallo, guacamole sauce, a spider salsa, crisp lettuce and key baby lines.   I LOVE MEXICAN sodas. The coca cola taste much better with real sugar. They also had fanta and sprite as well.   This spot will hit the spot after a night of bar hopping Scottsdale. Cheap tacos and a friendly and funny staff.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "p3VGRn-9b76nt_uPF6TK5g",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Tacos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/p3VGRn-9b76nt_uPF6TK5g/o.jpg"
      }
    ],
    "user_id": "MWxtO33T4WdOmuzIaSQijA"
  },
  "Epxq9JGmxkmxim4dAmqO2A": {
    "date": "4/12/2016",
    "text": "Most definitely NOT AUTHENTIC street tacos. I'm from LA and I KNOW street tacos. This is not it.   A fellow patron warned me about the hot sauce and he advised it's \"very spicy\", so spicy, he said his eyes \"teared\". Well now, lets get to business, I thought! Wamp. It tasted like a generic store brand salsa. Not hot, no kick and flavorless. Their asada is tasty, however, they use flour tortillas (again, that's NOT a street taco) instead of corn, so the portion of meat is a joke. Tacos cost $3, which is way too expensive for a street taco. If you go to any taco stand/cart/truck in East Los, El Monte, South Gate, Whittier, Lincoln Heights, Highland Park or Boyle Heights, you pay anywhere from $.55 (on Taco Tuesday) to $1.25 for a REAL street taco.   My friend turned around and asked me, \"What street are these tacos from?! Beverly Hills?\" It's obviously geared toward Scottsdale people.   Nice try Wadaa, but no dice.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 12,
      "cool": 1
    },
    "photos": [],
    "user_id": "qEX4Rz0nzYFlxK3cAvI7tQ"
  },
  "J3JY6ASbketpSOrDquD_ow": {
    "date": "4/18/2016",
    "text": "I think I patronized this place incorrectly. The way their menu read and the way the stand was set up made me think you needed to pay extra for the salsas and toppings...not sure if this is accurate. I had a couple tacos just plain and they were fine, but nothing special. You can watch them grilling their meat, so you know it's fresh. As I bit into the taco a stream of grease ran down my hand.... maybe not what people are going for when out on a Friday night. The tacos were a bit bland and crying for some salsa. I'll have to check this place out again and get some toppings to truly judge. Will be back.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "d_TBs6J3twMy9GChqUEXkg"
  },
  "ZkGP1U68HH1V9k56no1qrQ": {
    "date": "2/5/2015",
    "text": "I've been to my fair share of taco shops, trucks, stands, etc. and this little gem of a place is quite amazing.  They use charcoal to cook the meat so it has the amazing grill flavor.  I once went a bit early and had to come back because the coals weren't at the right temperature yet.   I usually go with the steak and chicken tacos which are flavorful and fresh.  Throw some pico and fresh chopped cabbage on it and you have a substantial little taco.  Oh, the spicy red sauce has a real kick to it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KNlvPD9ayGCwIGvIfMbnbw",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Chicken and steak tacos hit the spot",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KNlvPD9ayGCwIGvIfMbnbw/o.jpg"
      },
      {
        "img_id": "ca6MrwfZEvxvWehTeIMFmw",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. Steak and Chicken Tacos @Wahaa",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ca6MrwfZEvxvWehTeIMFmw/o.jpg"
      }
    ],
    "user_id": "5w53Cqr1lpK3kIhTjRyWmw"
  },
  "TTi4nJSr6cZWiDfZEGRbGQ": {
    "date": "4/11/2018",
    "text": "Can't tell you how disappointing my visit was there last night!!! My daughter and went there at 6 pm nobody was there . We ordered 6 tacos 2 steak, 2 pork and 2 chicken  . Not only was the meet dry and hard the tortillas wore just as bad . No wonder no one was there . Just a shame wasted $20 bucks there. I hope this show the owner what happens when he lets kids run the place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BUyeb7xVOzrPkCsu8xOkhQ"
  },
  "EjavtTBYClypQhCjcv2nsg": {
    "date": "9/19/2018",
    "text": "Looking for a street taco place for Taco Tuesday and found this one so close to home.  Never knew it was even in a strip center I am familiar with.  Was a bit taken when we walked in and no other customers were present. So I tried to not judge a book by its cover. The place is cute and cozy and I was pleasantly surprised by the condiment bar . It was fully stocked with fresh salsa, pico de gallo, limes etc.  The tacos though a bit pricey were stacked with lost of meat and flavorful. The best part was Alexia behind the counter.  Her welcoming smile, friendliness and good service made this one my new go to places.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xE5ttnpwmuikWQSYB7O_bg"
  },
  "0GZXuXcnmOrg0XnuE1nsmg": {
    "date": "6/10/2017",
    "text": "Quick to prepare. Lots of meat. Totally worth it. I tried both steak and chicken and both were really good although the recommendations I got before going was for chicken.   The hot salsa was HOT. It's not the I can handle some heat hot but for the extreme hotness lovers which I am so I had no problem. I assume it was a bit of a vinegar based hot so it wasn't my favorite flavor but the heat made up for that.   The quesadilla was simple. Two tortillas with meat and cheese sandwiched between. I probably wouldn't do the quesadilla again simply because it was essentially two tacos with more cheese and less meat. Very good but not my preference.   All in all, it gets the full 5 stars and I will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w2nR6u01R4XY8b9Vnf6oqQ"
  },
  "r6mUZ_6F984xMHUWtguSng": {
    "date": "7/1/2018",
    "text": "Hard to see sign from the street but worth seeking out, we had the very good steak tacos and the pork tacos as well.  These are larger size tacos than the mini size most taco places have.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9nfVh6e4WVmBa1OQqgRTNw"
  },
  "djLbHj58uCY5L5ECi32OHg": {
    "date": "3/8/2018",
    "text": "Being from central Mexico and having traveled around different parts of Mexico experiencing tacos from all over I'd have to rate this place two stars. The flavor and intent is good but the quality of meat is poor. I'd have these tacos on a 75 cent taco Tuesday night but would definitely never again pay $2 a taco. If you are used to eating \"Mexican\" food from Taco Bell, then this is one step above that. The meat and tortillas are poor quality and I'm sure the owners and cooks know this, if not then they themselves have not had quality Mexican food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XlLGngCuhwfaN5E_An6ZxA"
  },
  "qMNyMW7WfeGT31Py1v67iQ": {
    "date": "1/28/2017",
    "text": "Greasy, gristly, cheesy and expensive. Only asada and pollo on the menu. Bland salsas. We won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eDqH7Gr6Pqo7adfZwfQetg"
  },
  "q8E5AFyy2urpEMAHAZ66IA": {
    "date": "8/28/2018",
    "text": "First time here, had carne asada taco and the elote, both were delicious!  Selection of salsas very good and the red really is very hot! The elote was best north of the border and we will return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OMqmrrdDH7NTNPTOPoWg9g"
  },
  "lhY589qqxJ6-coQk5saS5Q": {
    "date": "10/8/2015",
    "text": "Oh my goodness, if you love authentic street tacos, you will die and go to heaven at Wadaa. It is a simple walk-up window and there are no tables so plan on enjoying your scrumptious tacos elsewhere. The menu is very basic, you order chicken or steak, flour or corn tortilla (meat comes with cheese sprinkled on it) and then you add your own fresh salsas, cabbage, lime juice, etc. They are literally to die for! Each taco is $3 and for me, 2 tacos were plenty because I loaded on the cabbage and salsa! I got 1 of each and loved them both equally! I will be back very soon!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "YUGk3zB_9ZVfxe3o-WEz7w",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YUGk3zB_9ZVfxe3o-WEz7w/o.jpg"
      }
    ],
    "user_id": "e6iCOIhtupBCiw-VwBvJ4A"
  },
  "77PNMU2k5AB_FjPXctBI3g": {
    "date": "5/8/2017",
    "text": "Super tasty tacos. $3 each. They don't complicate it. Chicken or Steak. This place makes some damn good tacos.  Hit the spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hUAxxeRX9LfmvUcEHjUBmg",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hUAxxeRX9LfmvUcEHjUBmg/o.jpg"
      }
    ],
    "user_id": "rH8u1gAGMfvetr9YrJwO1g"
  },
  "83vSRMCJeT3lzfQ9CV_2FA": {
    "date": "1/28/2018",
    "text": "I'm always up to trying new places for tacos so when I saw this place next to Zia's (which I frequent), I decided why not. My husband ordered two carne asada tacos to try and I wasn't that hungry but saw a sign that said \"Authentic Elote.\" So I decided to have that, I love a good elote. After we paid, the lady told us where the salsa bar was and she mentioned, \"the mayo is over there also.\" I asked my husband...\"do I assemble myself?\" When I got my \"elote\" it was just a steamed corn with a small container of cheese. The cheese was parmesan cheese, not cotija cheese. The mayo was mixed with melted butter in a squeeze bottle. I had to put together my elote. This was not an \"authentic elote\" and I was very disappointed. My husband didn't like his tacos either. He said there was no flavor and the tortillas served on were cold. The only thing we enjoyed was our bottle of orange Fanta and the friendliness of the cashier. She gave us these coupons since it was our first time there; I'm sorry but we won't be returning.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "m4_dMrhtliwX0OSYLQihMQ",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/m4_dMrhtliwX0OSYLQihMQ/o.jpg"
      }
    ],
    "user_id": "iuTdZD7ONqi_g6eRRBA4rg"
  },
  "dN1c0LLuJL39vd2HiiCnEQ": {
    "date": "1/25/2018",
    "text": "Went here for my birthday lunch. What a disappointing experience! Chicken quesadilla was flavorless. Elote corn was boiled corn with nothing on it. Tried the carne asada and no flavor there either. Asked for our money back on corn and they said NO, YOU TOUCHED IT.  ~ Don't waste your time or money.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NjBp5E9QTHsJbyN-gYd3xQ"
  },
  "PG63UrbS9z0orXjcoNTylg": {
    "date": "10/5/2016",
    "text": "Tacos where mediocre... how can one call them self street tacos when you serve them with yello corn tortillas and flower tortillas ... what a joke ...  I will not be back ...",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wiW2IoOU2F-viIEjP1Dm8A",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. You see nothing special... just tacos ... and no there not street tacos ..... blah blah blah ...",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wiW2IoOU2F-viIEjP1Dm8A/o.jpg"
      }
    ],
    "user_id": "eg2sfX_6V4evuEN41W0KZA"
  },
  "KqqmDc4iU38ORmDZW7l9jQ": {
    "date": "11/18/2017",
    "text": "Great little make your own taco place. Fast service and great quality food. If you get the quesadilla be sure to toss toppings on top and fold it like a taco. Best decision you'll ever make.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oQu2bKFiMTuy5Du30phrYQ"
  },
  "Jgbo9iDPWVxxJX8Xb4UHCg": {
    "date": "1/15/2018",
    "text": "Originally ended up here picking up food for a friend and decided to get something for myself too. They are a bit pricy for what are essentially street tacos but they are so good. I can't complain too much because they were so good that we ended up going back that night so we had more for in the morning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BFsU4JdHG9Z_OXB43boH0g"
  },
  "7zdEb2SO-ZBlYiMI3N0IxA": {
    "date": "12/16/2017",
    "text": "Awesome food. Even better service. Jess and Sergio took every great care of me. I will visit this place again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8rJL651FYZinwCxd9tBW_w"
  },
  "mtiOunfsgsWpaQ5MfUyFmA": {
    "date": "12/8/2015",
    "text": "Awesome tacos for $3 each.  It's a lot larger than I thought so I was pleasantly surprised.  It's a super good deal and it brings authentic flavors, even though it's on a flour tortillas.  (which I would think a lot of people would prefer anyways... especially in the hood that it's in)  Definitely a great place to go daily!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kgVnm1g7mqwN-7EihEvOSg"
  },
  "ESMCRqYKIVmFg8gvYS5ooA": {
    "date": "8/3/2015",
    "text": "hold on, licking my fingers.... ok, im ready.  I expected this to be 2am bar closing food.  And, 10/10 would smash this after a club night.  However...its also perfect at 11:44-11:46 am.  4 Tacos down in two min.  Yum.  Grilled over Mesquite Wood.  Tried steak and Chicken and both corn and flour.  I suggest Steak on Corn.  Pico is fresh and really good.  Im impressed, best street tacos ive had in AZ so far.   Id love a buy 3 get one free @ $3 a piece...but that was a damn fine $12 lunch.  Will be back. ***I expect the pic below is not meant as an insult, not meant as a salute.  I think its merely a friendly reminder to lick your fingers clean of the deliciousness after your are done inhaling your order.",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "pmNToyGW7YtrFKQ4XSCdRw",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States. An Invite, courtesy of Google Maps street view.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pmNToyGW7YtrFKQ4XSCdRw/o.jpg"
      }
    ],
    "user_id": "_hUm7LjMn6MjCCRjyWwS2A"
  },
  "uumri1uZsZH6tK91eCA-RQ": {
    "date": "12/6/2016",
    "text": "I remembered when they were in old town Scottsdale! The best food and greatest tacos you could after a long night of partying in the clubs. I'm glad their new location is near my work! I usually go twice a week! Ask Miguel for free taco cards! This is the best authentic tacos around the valley! Also, the shop is very well organized and clean!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CxBmYKfwRHNq4Wlefx5PYg",
        "caption": "Photo of Wadaa Street Tacos &amp; Catering - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CxBmYKfwRHNq4Wlefx5PYg/o.jpg"
      }
    ],
    "user_id": "LIj_X_4luQAWf3i10Gx1OA"
  },
  "5ZMD56hvgVsRDr7FNfHuUA": {
    "date": "11/19/2017",
    "text": "Came on a Sunday night at 1130p and the service was friendly and the salsa bar was fresh.  The food was outstanding.  Great late night visit",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fq050V8wbUPLH1UmOm1Www"
  },
  "2iLS14IIBKJUtayVgrV7mQ": {
    "date": "9/3/2016",
    "text": "Delicious food, lively staff, restaurant and salsa bar are sparkly clean.   I never thought I would eagerly go to that location, sometimes Zia, but the Circle K crowd and the parking can be challenging.  DO NOT BE WEAK!  Alongside Wadaa Street Tacos is Lucky Donuts, another delicious reason to go.  Come on, the tacos are damn healthy, everything fresh, you can get a few donuts.  Tacos and Donuts two minutes from my house.   At long last, the prophecy has become fullfilled.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "wLJr_yVfv5i8HWuD3dNCHQ"
  },
  "rr8hDlqD9eY2P4VnEqFB2Q": {
    "date": "7/21/2015",
    "text": "These guys and gal... never disappoint! Amazing food and price  best Tacos in Old Town",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "geHdVkGXF2lsuxZFS3Cp-g"
  },
  "f85kOpyblZ-_BxUdwwFEmQ": {
    "date": "6/7/2016",
    "text": "Their esquisite authentic tacos simply take me back to Mexico. Their fast service along with their friendly workers make it the perfect lunch experience.   The red salsa has a great spicy flavor. The green salsa is my favorite, the fresh avacado that is in every bottle is amazing and the lime juice they squeeze in there is perfect.   The only thing that frustrates me are the long lines during the weekends, but I still manage to stay. It is defenetly a must stop for all tourists visiting Scottsdale, Arizona. Best tacos so far I've had in the U.S.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KNjAm0xQ1vD22aqSWARqHw"
  },
  "e7iqCsMuirZUqA0lKM320Q": {
    "date": "1/13/2017",
    "text": "Great tacos, delicious marinated jalapenos, and great service. Will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SuVg0oPH3bUs9mt4dlg2Xw"
  },
  "0nO_sTCYtfuO5004NKOxVg": {
    "date": "2/29/2016",
    "text": "Tried it for the first time last night after reading all the Yelp reviews and it was amazing!  The people were so nice and helpful and the food was phenomenal. Great chicken and steak tacos!! I had just gotten home from a 5 hour flight and was craving tacos. I wanted to see what places had great tacos on my way home from the airport. This place caught my eye and am so glad I went!!  I just wish they had a place close by where I live.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iYdHi7YYELcnV9ACmmKFQw"
  },
  "2oBZIpOqGabWC4DtIN0-9w": {
    "date": "2/29/2016",
    "text": "Just what the name says. You walk up to a rolled up garage door and order tacos, asada or pollo. Thats the whole menu. Now let me re-phrase that. You NEED to walk up to a rolled up garage door and order tacos, steak or chicken.  Wadaa is cooking the meat on a grill over mesquite hardwood charcoal. The tacos are simply served on a tortilla with cheese, then you add lettuce, pico de gallo, and fresh lime. There are two sauces. a mild green sauce that appears to be a creamy cilantro avacado sauce and a red sauce. Don't let that red sauce fool you. It's fire in a bottle. Unless you are into heat, stick with the green sauce. If you want corn tortillas instead of flour, ask for them. The drink selection is very limited, only three iced drinks and some canned sodas. I ordered three tacos. 2 asada and 1 pollo. I tried 1 of the asada tacos with the red sauce and the other two tacos with the green. I loaded each with lettuce and a generous portion of the rustic house made pico. The meat was flavorful and tender. I splashed too much sauce on the steak tacos without knowing how hot the sauces were. Let's just say you can't judge a book by it's cover. The red sauce is definitely hot and left my mouth numb. It is well made and flavorful and the heat kicks in at the end. If you are walking around downtown scottsdale, find this place. But be prepared to keep walking. there are no seats.  Warm Fuzzies (the good stuff) -fantastic flavor -Basic, simple and done right. -food and sauces made in house. -a real hardwood charcoal grill, not gas or briquettes. -friendly staff (owners?) -Limited menu. Just a couple things and they are perfected.   Cold Baldies (the not so good stuff) -no seats -limited menu. Need fountain drinks. -sauce pours out of bottles very quickly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_ZT8oo9oTUwAaKlf5IQeeA"
  },
  "HvOdAUj7A3dJsDm0eLNebQ": {
    "date": "10/8/2015",
    "text": "We got carne asada tacos on yellow corn tortillas and they were delicious! Tacos come with meat and cheese and then you add your own lime, cabbage, pico and choice of salsa. I was looking forward to a good street taco while in AZ and I found it! We also ordered the horchata and it was sweet and delicious. My tummy is happy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2fMcZdoD2YgHg5VhAMdkhw"
  },
  "fmW4R46N9VNqrCTAUuy-Mw": {
    "date": "4/6/2016",
    "text": "Wadaa! Street Tacos is definitely the place in Scottsdale...actually all of AZ to get yourself some authentic street tacos! I usually get two tacos one on a flour tortilla and one on a corn tortilla mixed(chicken/steak) the avocado sauce is heaven in my mouth and the red salsa is the perfect spicy hotness. I top mine off with fresh pico, cabbage and lime. I could eat these tacos everyday!! Definitely worth the $3 per taco price and every once in awhile they give me a free taco card  #ilovewadaastreettacos #tacoseverydamnday #wadaa #tacolove #tacolife #streettacos #aztacos #scottsdale",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YC6DKXcuVezHC9QKDgYnvQ"
  },
  "MGUjZNqpm4J0mMC0DVf1-w": {
    "date": "4/6/2017",
    "text": "Showed up on time and as promised to our catering event.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dDLr_k-eFdjDUIRlCfv7Mw"
  },
  "dZGBlPil36_gyT0b9BtUrA": {
    "date": "4/10/2015",
    "text": "Bomb ass tacos. I had both a chicken and and steak tacosand both were on point. If I had to chose steak was better but chicken was still great. Finally I found some real tacos in Scottsdale. Definitely coming back here after a night out in old town, open til 4!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "RbtBpIhkQ970wUxOaN-9sQ"
  },
  "aUQI5_gIhs_-C98IzPXb1Q": {
    "date": "9/21/2015",
    "text": "Best. Street. Tacos. Ever. Authentic, delicious, just as if you were in Mexico. Inexpensive but awesome quality. Can't be beat. Keep it goin guys! I recommend them to everyone I know.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SPOwpvhPSdM0Ge6cu2wWXw"
  },
  "11oq9IOzYBh6B9xcoctMbQ": {
    "date": "2/2/2017",
    "text": "The man who served me was nice enough to explain the menu and the different taco options. Ordered carne asada tacos, they were mad good 10/10 will come again. It's my new taco spot. Def have to try the pollo tacos and quesadillas.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4gcFpBBwfXO-aJMHBuNOdA"
  },
  "Y8QOBMxhMN05rRxOnfXqiQ": {
    "date": "3/20/2016",
    "text": "Soooooo good. Love this place. The steak tacos are seasoned and cooked perfectly and they are never fatty. Staff is always very friendly. I love a place that doesn't need all the frills, just good food. We keep on coming back and we tell all of our friends as well!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pB3Oo7Lh6WkCewceXI_LbA"
  },
  "s7umgihlZ59AJxXbvmJNUQ": {
    "date": "6/22/2015",
    "text": "Absolutely delicious Authentic street tacos with the protein ingredients grilled over mesquite coals.  Homemade guacamole sauce, Pico de Gallo and limes. Option; flour or corn tortillas.  This Lil walk up window & order spot, will hit the mark with your tastebuds. Aqua Fresa, Jimaica (hibiscus), Horchata, Tea and other drinks available.  Reasonably priced, Waddas does what you want it to, delight your street tacos taste budz.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "IjTTkW-u357q4XdXIIroOQ"
  },
  "h2mCJLfmq1GMMr7rXK9bXQ": {
    "date": "10/20/2016",
    "text": "Fast and delicious. Just what we needed as our welcome to the dessert from Indiana. House made limeade and horchata are where it's at! Also add the grilled onions to your order - slow roasted and sweet.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "12jXaF_rr8yZR2zciW4byw"
  },
  "0U_IqgFWw9mQRX2U8CKVsA": {
    "date": "3/26/2015",
    "text": "Ordered the steak tacos... Literally got pieces of steak on a tortilla. Salsa? cilantro? Next time I'll shell out a whopping $4 to get a real taco.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "RqZStxhaz__PgkCOHX6VYw"
  },
  "lJxuUezf2-2O97JFFQ8ykQ": {
    "date": "10/11/2015",
    "text": "Very good tacos - I can see why drunk folks flock there late nights - I just hiked the Camelback and was starving, pulled up yelp and found the highest rated but 1 $ cheap food - Wadaa's hit the spot.  Was a bit surprised not to see a fish or shrimp taco, as those are my absolute favorite (coulda been 5 star!), but once I saw they cook the steak and chicken over an open wood fire - ok I get it.  I always go for corn tortillas if they offer it, and these were good.  I'll be back next time in Scottsdale fo sho.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5G93zwtATXuX9hbJ8Nw4WQ"
  },
  "DGlfEE-hiUoD3XKn5iWW2Q": {
    "date": "3/1/2016",
    "text": "Amazing street tacos, authentic and a great price.   The homemade salsa is simply wonderful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "119NAyk0tP0KWnv4eQRTSQ"
  },
  "SF6VXeluKhX3uJLbI9L9Vw": {
    "date": "2/28/2017",
    "text": "The best tacos by far! Glad they opened closer to our house; we would trek to Scottsdale to grab some of these.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yc4R3-vG9JkhVJzrn7QJ5w"
  },
  "XN6J9l4Q3Da4Vv5LrC8qMg": {
    "date": "3/6/2015",
    "text": "Wadaa is the real deal! I'm a bit of a taco snob, having enjoyed street tacos in San Luis, Mexicali, and Tijuana for decades. I've rarely, and I mean *very* rarely, ever encountered tacos that approximate what you can get from a simple street vendor in Baja. The most important thing is grilling over mesquite hardwood, followed by grilling home style corn tortillas, and of course providing the right toppings: Pico de gallo, cabbage, that deep red super spicy salsa, and a nice thin aguacate salsa. Mmmmm...delish! Both the carne Asada and chicken were outstanding. At $3/taco a bit on the pricey side for a roadside stand, but worth every penny!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "aOYhF7JwDVBC6t-_RqhEWg"
  },
  "n6j9fpPeK5O0zLZTKpD9Ng": {
    "date": "2/5/2015",
    "text": "It's literally the ending of a rager at Old town.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "HgiCpkM_rJ1P8bliasfCbA"
  }
}