{
  "8KGwrB3mUSQdj0TzRPyXcg": {
    "date": "3/16/2016",
    "text": "We love this place! We usually go on Sunday's and we've been bringing our baby since she was born! Fred and Sophie are the best! They make you feel right at home! (Probably why they call it Chez Vous) The crepes are amazing savory or sweet. Also, the goat cheese spinach quiche is to die for! My husband loves the tuna sandwich. The salad served on the side is so fresh and the balsamic dressing is the best. (They sell to take home,too!) You can't go wrong here!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Eo3taPGnvSV79nNkNYhgA"
  },
  "q1BzM37O7yey3ltYni5q4g": {
    "date": "1/30/2016",
    "text": "Great place to have breakfast. The staff is very welcoming and very nice. The entire restaurant gave me a warm feeling the entire time. Food was also amazing. I will return. Very happy with my visit",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Axdhci7Y9g0Ft2WSA-LluQ"
  },
  "PbJF66TqJRIWRSz-MurjKA": {
    "date": "3/1/2016",
    "text": "Great Croque Monsieurs, very tasty croissant.  Good service and ambiance.  Recommended for breakfast or a lunch break.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rlaxs11CQJ6f_SLEFou9Tw"
  },
  "JIJWIEr3otyg2WQe913Sqg": {
    "date": "2/17/2016",
    "text": "Stopped by this place for Brunch with a friend, and we can't believe we haven't been here before! They have a bit of everything, but all authentically French. It seems like a family run business by the sweetest people. Everything tasted amazing and handcrafted, and the patio was the perfect way to enjoy the beautiful Spring weather!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "7He_zXw_RQ1vV9Mk1FSbNQ"
  },
  "VRITXG1MEfD5SrrpROnU_Q": {
    "date": "2/16/2016",
    "text": "My friend and I both had the Brie crepe. It was amazing.  The place was very cute inside and the owners are from the French countryside.  Everyone should try this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "rk0Qv6NB7kFC1qVUMIETeg"
  },
  "vmYKZNO9XbZcy_hQRoVj6w": {
    "date": "5/1/2014",
    "text": "Outstanding crepes and quiches, etc. And with truly wonderful real French coffee. Great Service too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "P5sIeGBWQNBA2qBBCuQxhg"
  },
  "5XHRgCX6diWYI4CtqKhxBQ": {
    "date": "1/10/2014",
    "text": "My favorite coffee ever is served here! I've come multiple times just for a couple cups of their delicious French press. I have also had some food here and most of the dishes have impressed me. This is a crepe restaurant, but I do not love the texture of their buckwheat crepes. They do have some excellent pastries, which go really well with their coffee.  It's a small eatery, but I've never had issues with finding a table and their staff remains consistent and very friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "JaWyPlPiQajclZbaa19PDg"
  },
  "qh4s2O43BL_Kv9a5452D0w": {
    "date": "5/22/2016",
    "text": "FABULOUS!! The best restaurant we know for breakfast and lunch. Wonderful location and the owners are so authentic. We travel miles to come each week for something scrumptious.  The best kept secret in Scottsdale",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EtD5X56hrbsNXSLcbB58eQ"
  },
  "hZB5jV2lIW_sPlma5K05AA": {
    "date": "2/24/2017",
    "text": "Nice small restaurant.  Excellent food.  Friendly staff.  Fast service.  Outdoor seating in nice weather.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "7geeXqjthB7hyZfxF9U7PA"
  },
  "LSMe0iqQX0YlmLJaWpW0Jw": {
    "date": "5/19/2014",
    "text": "Two more recent visits, post morning mountain runs :) delicioso! Lovely crepes for the whole bunch !   Many \"Thank you!\" 's from our little ASU bunch -- ciao :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "gWaBBFIZWI6kb6rfCTmMaw"
  },
  "rcLP9aC8E8jtrp1Gj5O2ag": {
    "date": "6/4/2014",
    "text": "My friend and I tried this place when we were in town for the day. It was a great place for a girls day. The staff was friendly and laid back. The patio was shaded enough to be comfortable on a record breaking hot day at lunch time. And the crepes were delicious. My friend had the Brittany and I had something very rich the name of which I cannot remember but it was recommended and delicious. We split a pear crepe and left full, satisfied, and happy.  The savory crepes were served with just enough side salad with a delicious dressing to make me feel like I had eaten something healthy. Ha!  Well worth who knows how many calories.   The restroom was clean too and well stocked with a variety of luxury soaps and lotions. Ooooh la la. It's the little things.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "u4fFVUjT_vu40KoEGgC1Aw"
  },
  "mV1yc2e7UvoviJGqLV0b8g": {
    "date": "2/20/2016",
    "text": "My wife and I have the pleasure and joy of having brunch 2-3 times a week for the past few years while we visit Scottsdale during the winter months. To dine at the Chez Vous in Gainey Village  is my favorite way to start our day. The food is exceptional, the atmosphere is charming and the owners take great pride in making sure each patron have a wonderful experience. Over the years we've gotten to know Fredrick and Sofia, owners of Chez Vous. I love how they intermingle with their guests, creating a homely atmosphere. Please enjoy your day more and visit the gem of a restaurant.  Dr. Stephen and Mrs. Frances Miller",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DbKawBpRBr8qecKT3Fgd-w"
  },
  "FrKp3-HhhSBxQWqJyJfblw": {
    "date": "9/28/2014",
    "text": "Some of the friendliest staff I've ever encountered. The food at Chez Vous is sublime especially the crepes, but also their salads, sandwiches and other deserts. One of my favourite items on their menus is the croque monsieur, a sandwich made with ham, cheese and creme fraiche and then toasted in the oven.   I love the atmosphere of the place but its really the terrific staff that makes it special including the owners Isabelle and Richard and their son Romain.  Recently, they have added fruit tarts, made in house fresh and they are to die for.  Also do not miss their coffee, espresso, cappucinos or lattes...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YfvMjY-G6y86Ov2tS5Txww"
  },
  "T1B4CqjLJ8xlUuUUpjH0pg": {
    "date": "2/7/2016",
    "text": "St. Jaques and the brie crepes were both amazing yesterday.   Moka too.  Today the quiche Lorain and tutti frutti crepe stole our hearts.  Late breakfast both days that made our day even better.   Too bad they are closed tomorrow  (Monday).  Good service and great food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DZT3Lt2Nvml8_gKdcj2ukQ"
  },
  "c67in-iK9DwyeeYGlRetzw": {
    "date": "12/15/2013",
    "text": "Amazing! Five stars for sure. Could be a cafe in Paris. The staff is French so it feels authentic and they know the regulars. Super friendly even if it's your first time in. Tried the Nutella crepes - awesome. Tried to pear and chocolate crepes - awesome. Tried the Lorraine quiche and it was delicious and moist. This may be the best brunch spot in Scottsdale.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_1143FLX1RgI18LJrWJb_w",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_1143FLX1RgI18LJrWJb_w/o.jpg"
      }
    ],
    "user_id": "Rvz1CWPyQ-HE4C3LgqcMUw"
  },
  "5MaYWn7sUKP1iIEA8RA2hA": {
    "date": "4/7/2014",
    "text": "I love, love this place! The savory crepes are a great meal w salad. The regular coffee is one of my favorites and the cappuccino is even better. The creme brulee is the soo amazing. This place gets really busy on weekends and I find going close to 2p on Sunday is the best time .one hour before closing..great little place run by some great friendly people",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DXgzzs8rNWoURkqWbR4GSA",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Cappuccino!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DXgzzs8rNWoURkqWbR4GSA/o.jpg"
      }
    ],
    "user_id": "apU0Z6St6wEd6aZAyY6GPw"
  },
  "aPsEgWplFL2PGK4sHk73-g": {
    "date": "12/28/2014",
    "text": "Nice menu. Close to Scottsdale resort.  French staff.  Unfortunately mediocre food.  Cappuccino had great foamy milk but lousy bitter coffee.  Hot chocolate was dilute and lacking rich coca flavor. Crepes were tough instead of light and fluffy.  Tried the Nutella crepe with strawberry, exotic crepe, and crepe with raspberry jam.  All uniformly disappointing. Chocolate croissant was ok but not what you would expect from True French patisserrie.  We ordered the mushroom omelet and it had hair on top.  We returned gross omelet and they gave us a free chocolate croissant instead.  Croque Monsieur was tasty.  In sum, nice looking place with nice menu listings but subpar food. A bit pricey for what you get.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "93O_DRhn65HOdsKUN6RlZQ",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Nutella crepe, raspberry jam crepe, cappuccino and hot chocolate all disappointing.  Chocolate croissant was ok",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/93O_DRhn65HOdsKUN6RlZQ/o.jpg"
      },
      {
        "img_id": "z5HzXpMx00qIF88_kGVUew",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Outside view looks promising",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/z5HzXpMx00qIF88_kGVUew/o.jpg"
      }
    ],
    "user_id": "45S7FvfWLJNbyuAVIQqAAg"
  },
  "WTw7XKhpKoqTepWXEwxgVg": {
    "date": "9/7/2015",
    "text": "What a hidden gem! If you haven't been here, make sure to add it to the top of your list! Very authentic French food, friendly staff, and excellent decor. I have yet to have a bad experience and have been coming here for about 4 years now. This spot is a tradition for my two friends and I every time we are all in town.   Their Lyon sandwich is one of my favorite items on the menu.  It has grilled chicken, mixed greens, Swiss, sundried cranberries on freshly baked bread. You cannot go wrong with any of their savory desert crepes. I have tried just about every one of them and still cannot decide which is my favorite!   They are closed Monday's and it does get crowded so I would recommend going during off hours. I have never had a wait, but the tables are pretty close together. Overall great experience and will be returning again shortly!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "B2cLvaPisnPKHAi6OdOKCQ"
  },
  "A6qogibODR31Th0ZZGm7YQ": {
    "date": "4/8/2017",
    "text": "I and two friends had lunch there.  I for the very first time and I will be back soon. the patio is dog friendly and my dog loves french food. Both friends had different types of crepes and I had the Croque Supreme. We all immensely enjoyed our entrees.  Their coffee is exceptional and comes from a local coffee roaster. Next time I will try the desserts which look scrumptious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LwUkvIN4WafV4k8KZpTxhQ"
  },
  "XCUlIbFFNZ92K6y8jYVTQg": {
    "date": "7/21/2013",
    "text": "Chez Vous is one of those hidden gems that you wouldn't know about unless heard from a friend or in my case, some heavy sluething on Yelp. It can be found towards the center part of the strip mall on the NE corner of Via de Ventura and Scottsdale Rd. It's not really a place you would run across unless on a mission to find it.  I've had the pleasure to stop by Chez Vous twice now. On the first go around, I tried a savory crepe that had chicken and a goat cheese quiche. This time around I tried the Forestiere crepe, which had ham, swiss and mushrooms, and also sampled the vegetarian crepe. I had a fried egg on the Forestiere, which added some extra flair and flavor to the dish. Every dish I've had at Chez Vous has been an enjoyment.  Amazingly enough, the wait staff just so happens to enhance the experience. They are all french speaking with accents and all, and to top thing off, attentive!  This restaurant comes with my recommendations for very selfish reasons. I want them to bring in more business so I can continue eating their awesome food!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "3zsO6B1p5L1sDUbIbZuaxw"
  },
  "aGQs6HWC29ulUFlWHMteIw": {
    "date": "8/22/2017",
    "text": "Food was ok.  Ordered Crepe Chez Vous and it was too salty.  The chicken was processed (like the ones in subway sandwiches) and the mushrooms tasted like it was either canned or jarred.  The smoked salmon sandwich (forgot the name) was good, except the bread was tough and chewy.  I was hoping the bread was warm and toasty on the outside and softer inside.  The chocolate croissant was good.  The coffee was \"eh\", especially for it being $3.  I gave 2 stars bc it was too pricey for the quality of the food.  Update to my review (after owner's response): to be clear, she is 1 1/2 years old and we immediately moved her legs when she was fighting to get out of my husband's lap.  The plates were not \"cleared\" as you claimed.  Also, I said food \"ok\" not disgusting (as is your attitude to my opinions), so since we were paying $$ for brunch and haven't had breakfast, we ate more than half the portion.  The chicken was definitely processed and I don't understand why you would argue otherwise.  But rest assured, I will never come back to support an owner who displays such a childish reaction.   You've lost all the stars.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "N-zdrTqHDs3Mxxzc6h798Q"
  },
  "TpSL5xsAsF3HCK2fV6mgcg": {
    "date": "11/6/2016",
    "text": "Absolutely wonderful experience from beginning to end. We were the first ones for breakfast. The coffee was excellent,  strong but smooth , like the real French coffee. I have been to Paris, so I know.  We ordered several extra croissants with our omelettes and crepes. Wonderfully presented and delicious.   Although I went about a year ago, I never wrote a review.  We went in the winter to enjoy a cool morning on the outdoor tables. We left with several dessert croissants. Trey bien! It is a quaint but not fancy place. However the food and service are worth the trip. This place is much closer than Paris,  so try it now!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "f7DcJDzDD3Rb5fmrx39_6g"
  },
  "ZLUbq55UUQ7Wp8By8qp96A": {
    "date": "2/12/2017",
    "text": "Amazing crepes. Must return. Had the French favorite. The shaved ham made the entire dish and the crepe was well done. Also ordered the veggie omelet. The crepe was better. Hot chocolate was done well. The salad had an amazing dressing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "S9P2iNF2i9Kz1EvjHu3EBQ",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Veggie omelet. Good. Really enjoyed the salad dressing.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/S9P2iNF2i9Kz1EvjHu3EBQ/o.jpg"
      },
      {
        "img_id": "uBsJ1DSX99kJs7_B2ey0ig",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. French favorite crepe with fried egg on top. Delicious",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uBsJ1DSX99kJs7_B2ey0ig/o.jpg"
      }
    ],
    "user_id": "h6BfoCTmWlzN2NMVLHbVcg"
  },
  "0iCVpDH5fZbAoZvzJ-yNNQ": {
    "date": "6/30/2016",
    "text": "- 1 star but five stars for ignorance!    This Restaurant I cannot review for food because I was discriminated against due to my disability.    It seems the person in charge of this establishment needs to read the laws concerning service animals.",
    "rating": 1,
    "rated": {
      "funny": 5,
      "useful": 10,
      "cool": 2
    },
    "photos": [],
    "user_id": "OfNC1uGzErvDZJdtYe_TRg"
  },
  "UVNBsdnDwGYn6e3Ulljy4Q": {
    "date": "11/21/2017",
    "text": "Such a charming place! We met the husband and wife who run the creperie, and chatted a bit with them about their home region in the haute Savoie of France. We were astounded to find such a gem in a shopping complex, it's so refreshing. My Husband had the classic ham crepe, I had the surf and turf and it was so nice with the Cote de Rhone. Wines are french and very good for the price which was reasonable. I noticed there is some sort of happy hour 4:30-5:30 half off wine and champagne, We especially will plan to come Thursday night when they serve dinner, as well as make this our petite bistro while we are here through March. I'm looking forward to many more visits. Merci!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fszSPN9J2jCxNu70QpAi6A"
  },
  "cfkfJw2wBlW-Zi3Ncgy95A": {
    "date": "10/16/2016",
    "text": "Great service and delicious food! My husband got the omlette and I got the orangeade crepe and cappucino and it was all sooo good!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZDX7b0w7xl-ujxE7cKcJ1Q",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZDX7b0w7xl-ujxE7cKcJ1Q/o.jpg"
      }
    ],
    "user_id": "6FlqLBa3LZJaa_xr4XHfVw"
  },
  "X10rY-9c4b05tOrnxNDWWw": {
    "date": "6/25/2017",
    "text": "This place is colossally awful. I can't express my annoyance with the owners and their terrible business practices.  Brunch on Sunday ends at 11am. Bc that makes sense.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "wCyJuj97X7IEE2um2fS57w"
  },
  "pxp2J8ZkSvyA2gqI-7FAOQ": {
    "date": "9/29/2016",
    "text": "Stopped by for a quick snack after my Pilates class. I love the atmosphere and the coffee was excellent. I tried one of the crepes as well. It was very good! The portions sizes are large for a French restaurant but expected for the US. I definitely plan on returning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7UOaT_uYt-JjHXfoPdoBmA",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7UOaT_uYt-JjHXfoPdoBmA/o.jpg"
      }
    ],
    "user_id": "-GdpGPz1icmdoBHWCt4tNA"
  },
  "jy3StSxOTbD1b_yDI_YAGg": {
    "date": "6/9/2016",
    "text": "My mother and I went and both enjoyed delicious savory crepes and then followed it up with a desert crepe. The flavor combinations inside the buckwheat crepes were great and you can't go wrong with a Nutella and strawberry crepe. All three crepes were fantastic and we plan on going back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "GZFC2iXPedaJYFbFnD4Ljg",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Delicious Nutella and strawberry desert crepe!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GZFC2iXPedaJYFbFnD4Ljg/o.jpg"
      }
    ],
    "user_id": "UiM3fcYkOxNyknyd_01mdA"
  },
  "Lg4h4f0OupTsTZMLc-Z1Nw": {
    "date": "2/4/2017",
    "text": "One word to describe this place is amazing. The staff is friendly and prompt, atmosphere is quaint and chic. The food is delicious, every bite my taste budds were doing a dance.  If i could i would eat here every day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VDQFEADHuH4ZeqV2j4TdwQ",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VDQFEADHuH4ZeqV2j4TdwQ/o.jpg"
      },
      {
        "img_id": "MYVOwRKb14qR2tUssgBD3Q",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MYVOwRKb14qR2tUssgBD3Q/o.jpg"
      }
    ],
    "user_id": "1yET7sh0wqpEqlZtkPHINQ"
  },
  "8swQFMbtIaLyhIaVtdJLPg": {
    "date": "10/22/2017",
    "text": "A croque madame (French ham and cheese sandwich) is so tough to find in Arizona!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZLXZuq6C7zix4OD2nzUi9g"
  },
  "sIMKgvqqGz6LbCKAs7xD2Q": {
    "date": "4/25/2015",
    "text": "Super cute and inviting decor as you walk in to Chez Vous to be greeted by their friendly staff.  They had AMAZING crepes! I'm visiting from NJ and loved the Nutella crepe with bananas. It was blissfully delicious! Only here for 5 days but I already have plans to return tomorrow with the girls for round two :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RjMXIXXTcH1J1UV3NyzUQQ",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Yummy Nutella crepe with bananas!!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RjMXIXXTcH1J1UV3NyzUQQ/o.jpg"
      }
    ],
    "user_id": "cG9h990HyMxgtTeFw7Po-w"
  },
  "rK6gG3dbPpH6SaCuDq8Mgg": {
    "date": "5/12/2018",
    "text": "We came over from Hash Kitchen because the wait was too long. How lucky were we!! The quiche was off the charts as well as the goat cheese spinach crepe with fried egg on top .. sealed the deal with the Exotic dessert crepe .. Good coffee too.. We highly recommend this place!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EjowbIxIECpE0aX82z2OHA"
  },
  "jtLprRYiZPRhiuPAXCij0A": {
    "date": "5/21/2016",
    "text": "Crepes did not seem as though they were freshly made. Had two different crepes.  One dessert, one savory. Neither seemed fresh, chocolate dark chocolate drizzle seemed like it was something you might put on ice cream. It got hard when was on colder plate.    Could be much better.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "6VOq5a3lZsnyhDwK4W48lw"
  },
  "HtNBijG31Ko7uRV58OQCNQ": {
    "date": "3/19/2017",
    "text": "Tried to have breakfast this morning but left after waiting 15 minutes at our table. No offer of coffee while we waiting to order and rude response when we asked who our server would be. They were busy and obviously understaffed. No excuse for being rude. Felt like being back in Paris!",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "oGduluoUu_v7D6q0UmYFGg"
  },
  "XKy0i3GGjqnZxmuIlMVTGw": {
    "date": "8/5/2017",
    "text": "Quaint atmosphere and delightfully decorated.  The service was good the food was outstanding it's very small but it was easy to get a table on a Sunday.  The quiche was amazing as was the Nutella crepes!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kk6Vc-cqibvOUvtsR-am4g"
  },
  "hGiySYJYNApTRvVkPm4oew": {
    "date": "5/19/2014",
    "text": "Chez Vous Crepes can either be rated 5* or 3*, depending on your expectations.  I choose 5* because I look at Chez Vous as a casual creperie, as indicated by its business hours which do not include dinner.  If you are looking for fine French dining, with each dish packing \"WOW\" power, you will probably find it modestly disappointing.  But as a destination for a thoroughly enjoyable breakfast or lunch, Chez Vous can scarcely be topped.  The room is bright, clean, inviting, and comfortable, and there is an outdoor patio as well if the weather is fine.  The look, feel, and service would not be out of place in France.  The menu contains a good selection of both sweet and savory crepes, some French-inspired sandwiches such as Croque Monsieur, quiche, and a few salads.  The food is flawlessly executed and does not disappoint in any way except perhaps in inventiveness.  For example, I had a crepe \"overstruffed\" (no complaint) with ham, Swiss cheese, mushrooms, and creme fraiche.  Whether by design or not, the four ingredients were not completely mixed, so each bite was different, one dominated by salty ham, one by mushrooms, etc., but each having some of the other flavors in it as well.  Delicious!  By all means, give Chez Vous Crepes a try, leave your fine dining expectations in your car, and just enjoy living in Paris for a few minutes.  HINTS: 1.  It gets crowded - try slightly off hours.  If the day is too hot to eat outside, there are only about six or seven tables available. 2.  The dessert crepes do not appear to be as good as the savory ones.  We had a pear crepe and it had no complexity of flavors.  They have other deserts too, such as lemon pie the day we were there - might be worth a try.  Save room. 3.  The salads looked pedestrian but we didn't try one.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 1
    },
    "photos": [],
    "user_id": "moj7DUHkP4j9yfwFm-oOHQ"
  },
  "HS3woIhtNS90K-Yv28ITRA": {
    "date": "8/12/2017",
    "text": "This restaurant is one of my favorites.  The crepes are outstanding the ingredients are extremely fresh and everything on the menu is put together perfectly and complements the dish.  You can't have a bad meal here.  Five star for sure",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZvBKEL6Yxi4qSg_0_RZotQ"
  },
  "fhAKLwCPabPEJsKf-9Rb3Q": {
    "date": "1/20/2018",
    "text": "I do not write reviews but I felt compelled to write my first one about Chez Vous. My boyfriend and I decided to give Chez Vous a try instead of The Hash to support a local business. On this day, Chez Vous was not even at half capacity. All the tables that seated 4 people outside were empty and there were two empty tables inside. We asked for the end table so that we could order more items and have a bigger table to spread everything out. We are foodies and typically on our first visit we order a lot. As we walked towards the bigger table the owner rudely pointed for us to sit at a two top table that was squished in between two other tables. We asked if we could have the end table because we like to sit side by side and we order a lot. He said, \"no, you cannot sit there because as you can see we are a small place.\" My boyfriend said, \"we will spend for a table of 4.\" He then repeated himself in an even ruder tone and said no. He then gestured for us to leave without saying sorry or that he wished he could have accommodated us.  I would be more understanding if they were packed with people waiting in line but on this day half the place was empty. We left and due to the owners extremely rude behavior we will never go back nor will we ever recommend this place to anyone. What's most shocking is reading many of the other reviews with the same type of experience. I will instead go to the Crepe eatery at the Biltmore.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "lkAal17afy_ktiqLnBonVQ"
  },
  "p8qDYm-z36fVW5WdeL9Ldw": {
    "date": "11/10/2017",
    "text": "Stopped in here for breakfast with my wife. The food is way overpriced for the quality. The waiter was extremely rude and had an terrible attitude. I would not recommend this place.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "9trOQSgaWNfzTBl052EZ1A"
  },
  "czWzILB1DzQ8PeT6xQmWdw": {
    "date": "3/31/2015",
    "text": "Excellent food. Excellent service. Anniversary breakfast. We couldn't make it to Paris this year and Chez Voux was the next best thing. We each had a breakfast crepe and split an order of scrambled eggs. The dessert pear crepe was fantastic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vHowV2lky2yPPQ1c8AxyhQ"
  },
  "1oo16cB1BjBFoNNO8B32DQ": {
    "date": "11/15/2012",
    "text": "I love this place!  I have ordered a few different types of crepes and they have all been delicious.  My favorite is the brie crepe.  I even love the side salad!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7iljWwtMZPH6gjDY9DKa6Q"
  },
  "qP7g9jd2EEa_JAuJS8tKdA": {
    "date": "1/3/2016",
    "text": "Once again our meal at Chez Vous was a delight. On this breakfast occassion, we had four adults in our party and one toddler. Frederic and Sophie (the owners and hosts) welcomed us with warm \"Happy New Year\" greetings and cheerfully provided us with a high chair for the little one in our party.  We'd dined here numerous times before and had never seen children, so we were relieved they could accommodate us.  Some of the best coffee around was our first treat.  We started our meal with a cheese board to share - something for everyone.  Mimosas came next to add to our enjoyment. Between the four of us, we savoured  three different savory crepes (Atlantic, American, and Southwest) and one dessert crepe (Emily's Favorite). All were outstanding. We've still not tried every item on the crepe menu, so future visits are certain. Bonne annee, Frederic and Sophie. You certainly got our New Year off to a great start!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "J6IB2z4XZhZHTBRaes5WmQ"
  },
  "3A7mRurqIdO1WtCrAaTfVA": {
    "date": "9/4/2011",
    "text": "Check this out!  We had lunch there last week...I wasn't sure because it seemed like a small place and wasn't always crowed...but I sure was wrong...the place became packed 15 minutes after we got there!  We had the Bree and Chicken Crepe and it was savory and tasty also the French Favorite which had Ham and Swiss and a fried egg on top...cooked perfectly!  We shared a dessert crepe with Nutella and banana and it was a home run!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "hddbff7JsR4Wb273XmE4NQ"
  },
  "i4P0K2nhtlLshP0eQ4Fe6Q": {
    "date": "10/25/2014",
    "text": "Had lunch at Chez Vous Crepes today.  It is a wonderful restaurant with great atmosphere and service.  I just wish they were open for dinner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C3gHKomaUAqMDqSUgHZBLQ"
  },
  "z1W4UaX5Ysc8CDvbJ6NyoA": {
    "date": "8/29/2011",
    "text": "I was a little scared to try this place but I'm a sucker for a good crepe. This place was a bit out of my way but the recent good reviews on Yelp made me want to make the journey. Let me start by saying that I've  been to Paris many times and know a good crepe/croissant should taste and feel like. I'm very snooty about it. Me and hubby made it to Chez Vous on Saturday morning. We started out with coffee. Delicious! Found out it was grown in Vietnam and roasted nearby the Scottsdale Airpark. We wanted by buy some to take some but unfortunately it wasn't for sale. Next on the agenda was a croissant. Flaky? Oui! Layered? Oui, Oui. Buttery? Oui, oui, oui! A great croissant doesn't need butter or jam or anything put on it. This croissant was eaten plain and was perfect. Then came the crepes. I had the classic Chez Vous crepe - powdered sugar with a lemon drizzle. Loved! Though, wish there was a wee bit more of the lemon drizzle on it. The hubby ordered the confiture crepe - apricot jam with powdered sugar. He said it was one of the best he'd had. Will we be returning? Oui! I can't wait to try the savory crepes and their famous creme brulee.  Upon reading the other reviews, I must say something about the service. On a Saturday morning there was only one waiter. Even with several people to serve and his running around constantly, he was extremely attentive and we never felt rushed as customers. Our crepes were delivered fresh and hot. And, the coffee cups were never empty except for when I licked mine clean before we left.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "VdFFLg8f-MkhViik8f_WUw"
  },
  "1bsqCAd78joJL3lg1-wl5g": {
    "date": "2/16/2014",
    "text": "Had a great brunch here with my wife and two young daughters.  They were awesome to my girls and took great care of them.  The Raisin Croissant was a great item to hold off the hunger in my girls.  Then the entrees were perfect: my Quiche Lorraine was perfect, light and airy yet full of flavor.  The girls Croque Monsieur was nice and crunchy, just the way kids like a grilled cheese...even though it did not look like ones they are used to. My wife had the Lyon sandwich and said it was one of the best chicken sandwiches she has ever had.  Then we finished with a sweet crepe; Nutella with Banana...NUFF SAID!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Exf69xAHPQUnysirE7jzBQ"
  },
  "Cohh8X5yxQZ-bVrPvEzgig": {
    "date": "4/16/2011",
    "text": "This place is great! I can't complain about a single thing. I order the salad nicoise and my boyfriend ordered the Chev Vous crepe. Both were delectable! We also ordered the half and half crepe (half orange syrup, half nutella) for dessert, and talk about delicious. Seriously, these are the best crepes I have ever had!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "_fDRGe1o3bqSDgTl0Zj8EQ"
  },
  "ElCFAANzhAOQ3p2oRiCLCQ": {
    "date": "4/27/2012",
    "text": "Super cute place, friendly service and decadent food!!! The cute French guy that served us completed the experience! European sized food portions are perfect! Quiche is to die for... As is everything else!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qAwpUp_32yb4FvZjyeiE0w"
  },
  "hDjeoN5IDuDlDuAJqS35_w": {
    "date": "7/19/2014",
    "text": "Always my favorite lunch spot. It is family owned with great decor. Make sure you check online before going because they sometimes have odd hours, but aside from that everything is great. I recommend the st. tropez sandwich (which comes with the side salad) and the Nutella crepe is always fantastic. a crepe is enough for two if splitting for dessert.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XmWZ_AB3iMVx5-xeH4scIQ"
  },
  "Z6p8jC-FbZ8va3pzB2geeg": {
    "date": "5/17/2014",
    "text": "Met up with a friend for branch at this lovely little gem on Saturday morning.  I had my 16 months old baby girl with me.  Upon entering, the staff welcomed us with warm and genuine smile!  Everything we tried was to die for, and the service was impeccable!  Our coffee cups were never less than 1/2 empty because they kept refilling them.  One very friendly lady staff kept bringing toys to my daughter so she wouldn't get bored!  The best part was not even once they rushed us out, which allowed us to enjoy the food and catch up with each other.  Amazing place!!  I cannot wait to return!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XNjz3aSOhli6tEIthSwL8w"
  },
  "MjvFo7v2-lbGuYr2YCunaA": {
    "date": "11/10/2011",
    "text": "A Real French Creperie ...Finally! I think Chez Vous has the best Crepes and Croque Monsieur. I've only been a couple of times, but everytime I've gone, I'm doing I love what im eating dance. Anything with good Bechamel makes me dance.  Its a little pricy for crepes and sandwiches, but sometimes that's what you pay for quaility food. Cant wait for my next visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pTUh580nYtGi5Go0U0iI7w"
  },
  "wUh2uaelLRrCYoyuIMBYrw": {
    "date": "9/7/2013",
    "text": "I really, really love this place!  I've only ever had their crepes, so my review is limited to that area of their menu.  They make exceptional crepes; both the savory and sweet are amazing!!  They make them traditionally, so they are brown.  I always have the \"Brittany\" which has roasted chicken, roasted tomatoes, caramelized onions, and creme fraiche.  I substitute the creme fraiche for goat cheese, and the flavor and texture are great.  I love the pear crepe for dessert, which has dark chocolate and poached pears inside.  Their dessert crepes are never too sweet or too rich.  They also have delicious coffee that will make you want to spend your entire Saturday morning there.  In the past, I have experienced a few cafes with great food and bad coffee, or great coffee and so-so food, but not here!  It's important to note that the prices are a tad high, but that is understandable given where they are located. Gainey Ranch has sky-high rent, so expect each entree to be about $1 to $3 more than you would find in any other zip code. I'd also like to add how clean everything is and how nice and extremely attentive the staff is.  I think the longest I have had to wait for a coffee refill was 30 seconds.  And my food always comes out within 5 minutes of ordering it.  I'm not quite sure how they do that, but who cares? Also, one of the servers has a very charming French accent that adds to the experience (in my opinion). If you close your eyes and ignore the ridiculous heat, it's almost like being transported to France.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "vSlHFC4uUewWuLJIXaPkdg"
  },
  "bjcqsf9nbqir-rHysKNFTw": {
    "date": "5/29/2014",
    "text": "Went for lunch. Cozy, friendly, fresh, delicious and reasonably priced. Save room for dessert. The Nutella crepe is worth every calorie!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q8GZQHdO69_3-EQysiZIdA"
  },
  "YlzMClLu2J3m0SwgvhcXlg": {
    "date": "12/7/2011",
    "text": "Love this place.  Excellent service, great  coffee and yummy buckwheat crepes.  I can not wait to go back and try other selections.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dGxvrEt4JqkS0jDVCx3QUQ"
  },
  "IFoezvIsyGQ-oXOvq1i5bA": {
    "date": "2/14/2012",
    "text": "So good! We had two different sweet crepes, both were excellent! Our crepes were accompanied by coffee, which was also pretty amazing. The cafe is very charming and comfortable, we definitely had a good time getting dessert here. Pretty much the only french food the boyfriend eats are crepes, lol. I'd love to come back and try their savoury crepe selections as well as a sandwich or two as their menu offerings all look quite tasty. I'm sure once I return I will end up giving them 5 stars! Service was awesome as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dzjGCb6YmjK9jk9jyD_qrg"
  },
  "PGOjCK9zDTZUL0FAk97uHw": {
    "date": "4/6/2014",
    "text": "Such great ambiance and fantastic food. Coffee is pretty much the best we've ever had.  Wait staff were so friendly.  Will definitely return with friends!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e7L10LpQQPQKsFSS-txAPA"
  },
  "y5X5hI118EyFz-ThY3LDIQ": {
    "date": "12/16/2011",
    "text": "I love this place!  After a trip to Paris a couple years ago where I literally LIVED off ham & cheese baguettes and crepes... I was searching for a place locally to get my \"fix.\"  Found Chez Vous and so glad I did.  I always order the same thing, the croque sandwich and one of the crepes.  Both are always amazing and service is attentive as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O5w8hszgXvZGIJf0ngg-3A"
  },
  "MAtOnl2ocbv6PYvOED5i4w": {
    "date": "9/22/2011",
    "text": "So excited that a True French creperie opened in the Phoenix area!  I enjoyed a wonderful nutella crepe with an Orangina - True French heaven for me!  I will definitely be back to get my fix of all things French.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cMEtAiW60I5wE_vLfTxoJQ"
  },
  "lPuehPkrSRwiGlv1Ion-NQ": {
    "date": "12/31/2010",
    "text": "I don't know the first thing about French cooking. So, you can rightfully dismiss my opinion. But I do know a tasty brunch.  And when a table of seven bon vivants  all agree, I think we are on to something. I had the  \"Brittany\" Crepe with roasted chicken, roasted tomato and creme sauce which was delicious.  The dark French roast coffee couldn't have been much better company for the wonderful lemon meringue and crepe deserts. About the color of the crepes. They're buckwheat. That is what buckwheat looks like. Perhaps they should offer a choice but I like the taste of buckwheat  despite its appearance.  The service was excellent. Maybe it took a while for Chez Vous to find its rhythm but during a busy morning the food came out in a reasonable amount of time and our waitress was very good.  I live near Surprise so I don't get to Scottsdale that often. But when I do, Chez Vous  will be a definite consideration.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "vpKDy3YvgiP4QApoeznN3w"
  },
  "PSeVyjLUnx6ojaVHf1Z5pw": {
    "date": "6/6/2013",
    "text": "Delicious!  Both the savory and sweet crepes are hits.  I don't normally indulge in dessert at lunchtime but I couldn't resist.  After devouring the veggie crepe (yum) I split the Tutti Fruiti with my dining companion.  Pure heaven.  It helps that the service here is attentive and friendly.  Such an adorable family-run spot.  I will definitely return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZbFEkjjWrtf41m5LFhEdFw"
  },
  "WMg9jJ8RxtxIGMk22GEfWg": {
    "date": "7/2/2012",
    "text": "I couldn't even remember how many times I've been back and how many friends I have brought in, I must say, everyone loves Chez Vous! Cappuccino and exotic crepes, hmmmm, I'm coming for more!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "soc2J5OHH7V6JQ7t211Icg"
  },
  "5FwbYj4p2ICzuh2m9cgrdA": {
    "date": "8/23/2015",
    "text": "Best crepes I've had so far in the valley. This restaurant is a cute little French cafe, and I knew the food would be good when I noticed all the French customers surrounding our table. The service, coffee, and crepes were all outstanding. My group ordered both sweet and savory crepes and every dish was delicious. Can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q9hxH5mqiWifpVtpHvVCVA"
  },
  "pPev4aXGisTMslDvX2Ma6g": {
    "date": "10/4/2012",
    "text": "Im not sure how this place has gotten so many great reviews. I ordered the Brie Crepe and had a hard time even finishing it. It states it had carmelized onions but they were more on the raw side. The chicken was not fresh, tasted more like it was processed. The service was just ok also. They need to hire more help.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "6bWBB3qYRhaPelhoZUQK4w"
  },
  "EbpfYxnDPinSs_yk_Z8K1w": {
    "date": "4/1/2011",
    "text": "More like...Chez Yummy!  What a quaint place.  Having been to Paris I had high expectations and Chez Vous didn't disappoint.  We tried the Chez Vous Crepe, one of the sandwiches, the Nutella crepe and creme brulee.  Everything was authentically delicious!  They even had Orangina and outdoor tables.  I really did feel like I was at a french cafe watching the world go by.  Service was friendly and excellent.. definitely worth checking out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BxYTSV_ooUoK16HQ0s1QYQ",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Creme Brulee",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BxYTSV_ooUoK16HQ0s1QYQ/o.jpg"
      },
      {
        "img_id": "YrLGDbTOz4C4qyXQRSG1qQ",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Nutella Crepe with Strawberries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YrLGDbTOz4C4qyXQRSG1qQ/o.jpg"
      }
    ],
    "user_id": "1Z8g8lyU6ILsItOKJmJmxQ"
  },
  "CGElqNEAvSQZz8rmxLeh1A": {
    "date": "10/29/2015",
    "text": "What a great find!!  Amazing food, great service in their small quaint restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7rGJzXctXChXIcs5OMMrpQ"
  },
  "pxRMHivf0aBAg9wSOp5SGw": {
    "date": "8/1/2012",
    "text": "love this place the real french food excellent service food just like in the south of france! a must!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "828ie7XO6BvmsMEYSU2lIA"
  },
  "IPA2bAzwEHrtCtcyN9_I2g": {
    "date": "8/31/2010",
    "text": "I went here with a friend immediately upon arrival at the airport.  It's a charming place, and the proprietors really seem to know what they are doing.  Though I wasn't hungry (had eaten on the plane) all the food looked wonderful.  Had a latte that was great.  This is a great place to practice your French as there are people who show up who speak French, as well as the owners.  The owners are very friendly and professional and it's a lovely, classy atmosphere with convenient parking in the Gainey Shops.    I plan to patronize Chez Vous frequently because I am moving to the area soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "YaGq6_tgIM3F40x2c-yK1Q"
  },
  "pN6H7jAsE2qB5bNrorBC1g": {
    "date": "6/15/2011",
    "text": "I simply can not account for others less than stellar reviews. I found this spot to be delightful. A True, no-pressure European cafe experience and crazy good salad and crepe. I had a smoked salmon/dill crepe that was accompanied by a delicious handful of fresh greens that were lightly dressed and my extremely well behaved son [yeah for a 9 year old with some self control...] had creme brulee that was superbly delightful. I love the decor, it has a casual sophistication and we listened to some wonderful guitar music while we ate.   I didn't feel rushed; the owner and the waiter were both lovely and conversational. Made me wish I lived closer so I could be a regular and sip my orangina in the sunshine...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_y54HcEDbKSnFo8QZcKvqA"
  },
  "wphaMGaKjnnvKxuHOACcVA": {
    "date": "6/13/2015",
    "text": "I've never had anything bad here and the family who owns it is super nice!!  Only issue is that it is pretty small inside.  I would highly recommend you check it out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7OV-VoOK1MNGLDXINlb-_Q"
  },
  "k6eDv3w3MhXl8q2s3Z0xzA": {
    "date": "7/12/2014",
    "text": "bunch of cool people. sooo nice, great quiche! jaime ce que tu ne!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "VNhR3sSkG3T-4oZPOYyaWQ"
  },
  "8Va15tYi0vTbYHSrnNQ5JA": {
    "date": "5/3/2015",
    "text": "I HEART Chez Vous.& there isn't much more to it than that. I go to Chez Vous for lunch & brunch all the time. I usually get a savory crepe of some sort & have never been disappointed. What takes Chez Vous from great to excellent is the service. I frequently bring my two little dogs with me & we eat on the patio. The wait staff provides excellent service, but they also inevitably bring a small bowl of water for my little guys, offer them some woofie love, & sometimes they bring them a little piece of chicken or bacon to snack on. It makes all the difference to me. The staff is so friendly & personable that it is like being in Europe all over again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zDZdakrCK63V9Ee2BdYWZA"
  },
  "yL-tuTKiBtCiAlfckG_Bsw": {
    "date": "7/20/2014",
    "text": "Excellent!  We had the french toast and a ham/swiss/fried egg crepe which were very good.  The best part for us was that the staff provided a box of toys for our two kids to play with.  Very attentive staff and great food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZFgE6LALDTpd4Z45mkYvYQ"
  },
  "qC1GNB0QyG0wQdno8vPCCg": {
    "date": "7/5/2014",
    "text": "Seriously such an authentic little cafe. The associates actually speak fluent French and the food was delicious! I will be returning to try the Nutella crepes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "mUnuewB3_UwsK9xxyxafvg"
  },
  "qsn688Dvn3H0-hC8CYBM1w": {
    "date": "10/4/2012",
    "text": "I love crepes, but I sadly did not enjoy my experience at Chez Vous. I went here with a few of my cousins after one of them read all the yelp reviews.  Upon getting there I was super excited, the tables were all adorable, and it was super busy, which I thought meant it had to be good. But....my experience was much different than the many reviews that had helped us decide on this place.  The crepes were so-so, the ingredients far from fresh, and the portion size very small for the price.  The service was okay, but nothing great.  The only positive thing I can say is that the coffee was good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "w7ivcXcJYWOQ3Icq1xLBxQ"
  },
  "ahhMQloTo5Ra04Actf7XCg": {
    "date": "9/6/2010",
    "text": "I came to Chez vous a few weeks ago for a late breakfast, and was pleasantly surprised! I lived in Lyon a little while ago and I really really really miss good crepes. I had the Crepe Campagne, which has fingerling potatoes, swiss and prosciutto in it. It was absolutely delicious! True to form, I also got a nutella and banana dessert crepe, as well as a coffee. It did not disappoint! The coffee was a tad weak, but other than that the meal was fantastic.  The decor is very cute but modern at the same time. I love the plates on the wall, and the wonderful color scheme. The service was prompt but not pushy and i got to practice my french a bit. I cant wait to come back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "U7htIjuZIBCfOZ-Pe2hptQ"
  },
  "u1HsPvynLs5-PKHqAf8Beg": {
    "date": "4/12/2015",
    "text": "Brunch on Sunday. The food is superb. The coffee excellently prepared. Sitting outside on a warm summer morning was great at this fine Scottsdale establishment.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6c1RlEYYDT-FXGX5zoDkNA"
  },
  "EKN8BJHui5bE16tL58HLsA": {
    "date": "5/29/2015",
    "text": "My husband and I were introduced to this amazing restaurant by friends and in turn have spread the word.  I am a fan of their exquisite french toast.  None better.  My husband has enjoyed varied items and we keep going back.  Great service by Josh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R507bJZYSCd4BClRx4VIIw"
  },
  "HCx1xXaIuSWsE_UKLerz9A": {
    "date": "4/28/2013",
    "text": "We tried chez vous after searching for places with good croissants. More on that in a second.  I got the French Favorite crepe and my wife got the Campagne. I thought the French Favorite was excellent. My wife liked hers as well, but thought it was a little dry and could have used a sauce.  The hot chocolate was... disappointing. We were told it would be dark and strong, but it seemed rather weak and thin actually. In comparison, the french hot chocolate at Scratch (also in Scottsdale) is amazing; thick and flavorful.  However, the croissants... the thing that brought us there, were absolutely spectacular. The best I've had outside of Paris, and maybe even better than the ones I had there. The chocolate croissants had a little more chocolate than you usually get, and they were moist, buttery and wonderful. I'll be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HWZ6A8Otul7frS_kWxy2Tw"
  },
  "5i0kfEqBSpVVRC7w5aSzjA": {
    "date": "4/13/2015",
    "text": "We were on a family trip in Scottsdale and found Chez Vous. It's a great little french place with very warm and friendly service. The quiche and omelette were very good, as was the coffee. I also had the tarte tatin which was exquisite. If you are in the area it is well worth a visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0I7mJavfKmtHDOtGqmzB9A"
  },
  "FgWtriEHrzy4BJPzBG1Ajw": {
    "date": "11/5/2017",
    "text": "This is my favorite breakfast place here. It has a wonderful quiet atmosphere, delicious food, and the staff is extremely nice. Whether you're looking for a really nice cup of coffee and a croissant, or a bigger breakfast everything here is delicious with a variety of tasty options! I always get the breakfast skillet and a stuffed croissant, this is my 3rd time here and it hasn't disappointed once. I'll be back here many times!   Update: Back again! It was very busy this time, but service was as good as ever! This place has the most welcoming and happy atmosphere of any restaurant I've been in. I got one of the gluten free crepes today and it was so good, perfectly cooked and the side salad that comes with it was very fresh. I'll always look forward to coming here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IKChKlREnBy7JX_xhhD3AQ"
  },
  "QWF7dHojdZE19A67I18fGA": {
    "date": "7/29/2017",
    "text": "This is my favorite place for crepes! I've been coming to Chez Vous forever. Ton of lunch & sweet flavors to choose from. Ive tried different crepe places but this one beats all. Sophie & Frederic run an amazing restaurant. They keep everything fresh and healthy! If you're looking for a relaxing/quiet place for brunch, this is the place!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "CZx8modWTarvS2zkRHuKBg"
  },
  "odtctWhiPep-yD44cLIeeQ": {
    "date": "5/22/2018",
    "text": "Great place with delicious food. Only reason for 4 stars is the level of customer service. In such a fancy place you expect nicer service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I58Uv1-mPeXJTJe_oPY_JA"
  },
  "-SqwXE4RKIjdGo5W0R13Mg": {
    "date": "5/29/2016",
    "text": "Awesome place, awesome food! Super delicious crepes and the mamamango, omg! So good! I loved the ambience of the place as well. A perfect place to kick start your weekend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UIJ61ig51pQ-sl_2whw2Lg",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Tropical crepe and mamamango! Yum!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UIJ61ig51pQ-sl_2whw2Lg/o.jpg"
      }
    ],
    "user_id": "GRIfC4ooNcs4IvOJaTBjWA"
  },
  "kN-81hbPPRY65U5pjBm0yA": {
    "date": "12/4/2014",
    "text": "This is my love and it's a rarity I want to share. When I extend an invite, it means you certainly are in my happy circle!!!! Every time I come here, I just walk out covered in love. The staff, service and food are stellar. What can I add that others haven't already gushed? I love sitting next to the piano on weekends and letting the music flirt with you as you sip the best cappucino ever, next to the hot cocoa. The patio is always taken up by lovely patrons that remind you to slow down and just relax. This place is so Parisian from the decor to the French being spoken by the staff. I love it.  They know crepes, both savory and sweet. I have tried all of them but always go back to Lorangade because well who resists dark chocolate with orange? The vanilla gelato alone is the superstar. It's like having the healthiest combo of what is good for your body - antioxidants, milk and vitamin C. Otherwise have the Brie savory crepe. The diced apples and caramelized onion with brie will make your belly very very happy.  I am somewhat nervous now that they changed ownership and hope that everything I fell in love with remains. I am looking forward to seeing what will transpire.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "tkML_EqnqTOBsbeUF-WVDQ",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. L&amp;#39;orangeade crepes. To die for.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tkML_EqnqTOBsbeUF-WVDQ/o.jpg"
      },
      {
        "img_id": "1R0IziZkICa7CmNwnmbFzQ",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. The cutest little cup of cappuccino I ever set my eyes on :)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1R0IziZkICa7CmNwnmbFzQ/o.jpg"
      }
    ],
    "user_id": "zEBjQm_S26TI1Etpvie9sw"
  },
  "A75j-AgBGK8jaaWXr9RUAg": {
    "date": "4/23/2017",
    "text": "I struggled with how many stars to give the restaurant. I've eaten here maybe 5 times. The first 2-3ish times the food and service were excellent but the last 2 times were awful experiences. The food is always good so there's that but the I've had two horrible customer service experiences the last two visits.   The first was a few months back and I was feeding my 1 year old a banana I had brought with me. She has an egg allergy so I bring her food with me to most places and especially a crepe/breakfast place which serves predominately egg. The female owner scolded me and pointed to the sign that says \"no outside food or drink\" and I explained to her the egg allergy and that my daughter is 1 and was scolding me really necessary? She waited at my table until I put the banana away and \"ordered\" a banana from their restaurant. I had also finished a coffee I brought from Starbucks as I was walking in so maybe they were more offended by that and the banana was just secondary?? We decided to give it another try thinking maybe it was all just a big misunderstanding.   The second bad experience was this morning. The family sitting next to us was literally asked to leave the restaurant because their 4 year old was playing with the (cheap) plastic placement. There was some sort of sarcastic exchange between someone from the family and the owner so maybe that played a part in the owner asking them to leave but regardless.... it was all super unprofessional and I honestly felt like a sellout for staying and finishing my breakfast. I wish I had left in support of the other family because of how they were treated.  Moral of all the rambling is that from my experiences.. they don't want kids at their restaurant and they treat you very poorly when you bring them. Which is unfortunate because the food is good but it's not worth it  and we won't be back since strike 2.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "MRCpvAfrg6yNnSgBzmhXdA"
  },
  "edYGbZ_JJJB5_EEMNVbwGw": {
    "date": "12/2/2014",
    "text": "I was really excited to try Chez Vous.  My parents saw it featured on a AZ food show, so off we went for a weekend lunch.  I was not impressed.  Maybe it was an off day.  The service was nice, very Parisian, but it was a bit pushy.  The older woman who waited on us had so much perfume on that every time she came to the table I was overcome with the smell of it.  Not appetizing.  She was nice, but it was just too much.  I'm very sensitive to perfume, so too bad.  Another thing I didn't care for was that they were busing the table in the hallway near the bathrooms.  Dropping all the dishes in a tub.  It was really loud.  Just tossing plates and silverware in there made a tone of noise.  Really unappealing.    Honestly I was not impressed with their crepes and neither were my parents.  I had some chicken creme thing, and it was bland to me.  Very boring.  We had a dessert crepe, and it was rubbery.  I just don't get the hype.  I think Crepe Bar does a better job with crepes, theirs are outstanding.",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uIukH1ZHjfgb8ClktjD-sw",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uIukH1ZHjfgb8ClktjD-sw/o.jpg"
      },
      {
        "img_id": "yODevXrO64wqwKp4hucpRg",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yODevXrO64wqwKp4hucpRg/o.jpg"
      }
    ],
    "user_id": "r9tjKaqLvLKF7PvDnUsFnA"
  },
  "XjKE-VBf-q9vHwPqkIjKeA": {
    "date": "6/18/2017",
    "text": "Thoroughly average food. The vinaigrette with the salad was cloyingly thick. The Savoyarde crepe was heavy and filling but the buckwheat crepe it came in was very just okay. Also over priced for the product the provide even if it is in Scottsdale.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CkAiU_ED3uaeGU9D0rn1tg",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CkAiU_ED3uaeGU9D0rn1tg/o.jpg"
      }
    ],
    "user_id": "s_pwqJd5DBKY10Unpvzhlw"
  },
  "Gw0IrFsavZhArCJ1kmK2lg": {
    "date": "10/14/2017",
    "text": "I love this place. Best croissant in the valley! Nice and flaky with wonderful flavor.  Best French baguettes! All you can drink coffee with attentive servers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mbwaNJADIBd3edwq7uQdFQ",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Luca&amp;#39;s first public outting while mommy and daddy had the best crepes, croissants, and french baguettes",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mbwaNJADIBd3edwq7uQdFQ/o.jpg"
      }
    ],
    "user_id": "M6Jg2VM4-dEbW2mj5BH1ew"
  },
  "-mZmoGwnvkRoBvi-FJEsqQ": {
    "date": "8/11/2014",
    "text": "I finally made it to Chez Vous Crepes last week after bookmarking this biz well over a year ago...  I did make a few attempts prior, but they are closed on Mondays and they took a vacation for a week or two (perhaps to head back home to France?) at one point last year, when I was planning on heading in.    Regardless of how long it took me to patronize Chez Vous, it was worth the wait... I had a delightful lunch with a friend and look forward to my next visit!  I walked in around 12:45 on a Friday to meet my friend and there was literally just one table open.  I snagged it and was greeted within minutes.  The place had a good energy and friendly atmosphere.  I believe it was the owner, Isabelle, and perhaps her son, that waited on my friend and I.    I went with a savory brie crepe.  Filled with roast chicken, sauteed apples, caramelized onions, sliced brie, and apple cider sauce, I was told this is the best selling crepe on the menu.  I ordered it without the onions, but it came with them anyways.  I picked around them.  It also came with a fresh side salad and the combo made for a perfect filling lunch.  My friend enjoyed his omelet.  We skipped dessert this time, but I will definitely return to try some of their homemade sweets next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "8Rxbh4jUnYIJ-cMBZBeHPg",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Omelette",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8Rxbh4jUnYIJ-cMBZBeHPg/o.jpg"
      },
      {
        "img_id": "NRYw8CKotw69Mdu0A5MZfw",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Brie crepe",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NRYw8CKotw69Mdu0A5MZfw/o.jpg"
      }
    ],
    "user_id": "dIIKEfOgo0KqUfGQvGikPg"
  },
  "WYLttRHLhzurVYkZk5fgsw": {
    "date": "10/20/2018",
    "text": "Delicious!!! Love the crepes. It's like being in a small Parisian creperie. My friends loved the quiche and salad.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F-3a3yz8rBMXfwb64AFQ1g"
  },
  "o2pfeYjnmSwTdcgcudYO9A": {
    "date": "10/29/2017",
    "text": "We just came here for breakfast and they turned us away at the door. They weren't very busy but she said she only had one cook so she wasn't going to take any more customers. We weren't even given the option to wait. She wasn't very friendly about it either. Didn't even say sorry. If you care about how businesses treat people, I wouldn't patron this one. The cook situation is one thing, the attitude is something else. Not to mention its a managers duty to step in when shorthanded.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "RQK1xgA-LSdMfdEowwCmoA"
  },
  "O9YSSh4Yp5cbQkDjBKC5ow": {
    "date": "4/13/2018",
    "text": "This has great bread and their selection is amazing. From time to time they introduce new things. My roommate was French Canadian and made great crepes but with him not around this is a good second choice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GgTQfM8HZbv7kgzBdknucA"
  },
  "50DyvEPlRFSAo_SuvQ1Wqg": {
    "date": "5/9/2017",
    "text": "Excellent. It's a cute little shop with everything from sandwiches, savory crepes, sweet crepes, coffee, and wine. I had the Chez Vous savory crepe and it was savory! In every aspect, it came with a salad with a delicious dressing. Must try! Had a Cafe Latte and it was perfext too.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "J1M05UfBjf8ISuMs_Kqqag",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/J1M05UfBjf8ISuMs_Kqqag/o.jpg"
      },
      {
        "img_id": "WtJcxpbQGziF2JCsEpBT6A",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WtJcxpbQGziF2JCsEpBT6A/o.jpg"
      },
      {
        "img_id": "JITXlBhQya0DzQ0WjkIVEA",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JITXlBhQya0DzQ0WjkIVEA/o.jpg"
      }
    ],
    "user_id": "SHcPVk0oUk_ZROCyE1tTSQ"
  },
  "-n18mFxGWtgMA0nvr3sTMw": {
    "date": "3/4/2018",
    "text": "Little french decor place. Known for its bakery and crepe. Coffee is not bad too. I love their almond croissant  Freshly bake to order. Like biting on pillow. Breakfast was awesome. Service - the woman was friendly. The man wasn't smiling at all.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HPYlVSaZbl4c9dx_P_97FQ"
  },
  "Wq70vmBk09JI5a0FijXR8A": {
    "date": "10/8/2017",
    "text": "So place looked cute and was really looking forward to ordering... we were sat (to clarify we walked inside and asked to be sat and there were about three empty tables one 2 person and 2 four person tables. Outside there were another two or three empties. We were asked if we would prefer inside or out. We choose out and were directed to the end table of two... upon which we sat and were given menus) then we proceeded to watch person after person sat after us recieve food and coffee and in general acknowledged. Unfortunately the man who seated us (the rude apparently owner) finally approached us and we told him we had been waiting for 15 minutes... he told us we weren't. My friend said no one has come to speak to us and we watched others seated after us served. He arrogantly and rudely said well I am speaking to you now. What do you want to do order or go??? At that point I stood up and said we are leaving and he got even ruder and made a comment I can't begin to repeat... it was  racist. Do NOT go here with friends of any skin color. They apparently don't serve \"mixed\" parties. Its 2017... racism is real. He was exceptionally rude and derragatory to my black girlfriend if thats not racist I don't know what is. So yeah you are a racist sir and you are RUDE.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "yx9Y9IZOccnPh4Lix_e6rA"
  },
  "PwhuA_daK-gylbasbKtRLg": {
    "date": "5/5/2017",
    "text": "This hidden Scottsdale treasure! My friend told me about Chez Vous and tried it about a year ago. We've been coming for a late breakfast ever since! It's a small establishment so don't bring all your friends at once and expect to fit on a busy morning. But I have zero complaints! The quiche Lorraine is AMAZING! I eat it every time and try the new things my boyfriend gets.   Most dishes are served with a side salad, homemade dressing. So light and the best breakfast. Serves is great and the food comes out fast. They have mimosas if that's what your craving, the iced tea my favorite. But the coffee is also quality.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ap1EdDAO81JE9otPBNu6qQ"
  },
  "JtZ7tcKOHRFF0LfC_r362A": {
    "date": "10/22/2017",
    "text": "Tried to give this place a second chance. Last time the service lacked and were rude. So I thought I'd give it another go. Went there near brunch time. Not too busy, four staff passed by us, didn't acknowledge us, no greeting much less a table. We left after being there 10 minutes with nobody to acknowledge our existence.   Goodbye Chez vous, you're officially off my dining list.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "vBz0tctXSzSL0HzCk7eo9g"
  },
  "Eyu7gFZk2yyKnB76oY4Dpg": {
    "date": "2/9/2018",
    "text": "Consistently perfect crepes. Personally love the Saint Jacques and South West, and then finish with the Classic dessert crepe for a refreshing palate-cleansing experience. Chocolate croissants are the best around.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VR0N6fPNsfAiIo_n41ztkg"
  },
  "hQCQuDF-g7xCTXJ6XEjx-w": {
    "date": "11/19/2016",
    "text": "The food was amazing, however, the service was really slow! We had issues with the orders getting on time and getting the server On our table, he wasn't so friendly to be honest.. ! I loved the atmosphere and the design of the table, it felt it was so cozy and relaxing!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jv__ZTuPkpwM2MygzCg-jg",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jv__ZTuPkpwM2MygzCg-jg/o.jpg"
      },
      {
        "img_id": "coIsekzdKPLp0hFcZwfxnw",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/coIsekzdKPLp0hFcZwfxnw/o.jpg"
      },
      {
        "img_id": "JKDvdt-rIQTs6zsoPFERJA",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JKDvdt-rIQTs6zsoPFERJA/o.jpg"
      }
    ],
    "user_id": "d_Q7j1KMCLG6nwNjZ9K0xg"
  },
  "JZiNtnVEJLL1YosWnOszaA": {
    "date": "10/2/2016",
    "text": "This place is amazing! Quaint, great food and wonderful service! Will come back many more times to taste the various crepes they have. Thank you for a wonderful Sunday morning meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LDO6YRricsiXtju8mIe2lw"
  },
  "Un6gVtOigbKkoaotJm49hg": {
    "date": "8/7/2016",
    "text": "Chez Vous presents a tremendous, and authentic, French food experience. My wife, and her parents, enjoyed breakfast at Chez Vous and as we sampled our respective crepes, omelettes, and coffees. Friendly owners and staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_eaon8lRIE0KRqj2F5dWzA"
  },
  "n9HvP7Prf7jfQl5c_plytg": {
    "date": "5/22/2016",
    "text": "Best brunch in town!  There are fewer and fewer places that offer fresh home made meals. We've been to France a few times and eating at Chez Vous makes us feel like we are there.  The owners and staff and very hands on.  You can tell that they have a love for their restaurant and a great appreciations for the customer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "RxG3KAmjG8ey5iyMOsdNTQ"
  },
  "9-3Vv0mUof151M1M6Eko_g": {
    "date": "5/28/2015",
    "text": "Hidden gem! Great menu choices with authentic French cuisine at a very reasonable price. Very friendly staff, will definitely come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9D72AE3j-feVNZCJnzXSxA",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9D72AE3j-feVNZCJnzXSxA/o.jpg"
      }
    ],
    "user_id": "hIJ8UUO7_WndE4NhyNuebA"
  },
  "zGt3CI-stI-RzWMVacPYPw": {
    "date": "5/22/2016",
    "text": "One of my favorite places to come when in Scottsdale.  Crepes are fresh and the eggs are perfect.  The owners are incredibly accommodating and will do anything to make your visit delightful.  Outdoor patio is nice and they are very dog friendly.   Scottsdale/Phoenix need more small places like Chez Vous.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "W5jXsivLLc7LQmx_7f8VHA"
  },
  "xFIFqa4_5pASt_lbKuzXIg": {
    "date": "11/6/2015",
    "text": "Great crepe, just wish they had a longer opening hours. I like the variety of the menu. And love the drinks. It's a cozy environment. Friendly staff and good service. They used to give a discount when you upload the photo of your order in Instagram but I'm not sure if they still have that offer or not. Give a try and you won't be disappointed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PiAez4G8xCXfkoXqUDdS6w"
  },
  "3LaXZL6mO-q4q4qDsf0kTQ": {
    "date": "11/2/2017",
    "text": "Outstanding! Always have such great service and excellent food when I come here! The savory crepes are my favorite, but it's almost impossible to say no to their dessert crepes! You can tell that the staff are all very close, and that there is a lot of love in the food! I've only ever been for breakfast and brunch but I'm so excited that they started to do dinners on certain nights! The dinner menu looks devine! They've included so many new items including duck leg confit and escargots! (Two of my favorites) great job! Can't wait to come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hJBMYScaDG_V0Sw5m4IYYA"
  },
  "ul-1zQHIs0F6WXlzUxNe0Q": {
    "date": "4/29/2017",
    "text": "Beware of this restaurant...especially if booking an after hours party here! Frederic, the owner, claims to entertain parties at Chez Vous after their normal business hours.  Per a phone conversation 3 weeks prior to the event I wanted to host at this establishment, we booked the event... settling on the date, time, and number of guests.  I met with Frederic at his restaurant the next week to finalize menu plans and go over table set up.  I was very excited to host my daughter's sweet 16 at Chez Vous.  1 week prior to my event, I took my $200 down payment check into Chez Vous to give to Frederic.  It was at this time he informed me that he would not host my event.  His staff did not want to work after hours.  I was very upset and he did NOTHING!  He did not even offer an apology!  I told him invitations had already been sent and that 13 16 year old girls were planning to be at his establishment on the date we had both agreed upon. His reply was, \"Well I won't be here.\"   Regardes of how good the food is, I will never dine in his restaurant again.  I think people who frequent Chez Vous need to understand how poorly this restaurant is run and how incompetent and completely callous the owners are.   Since being let down by Chez Vous, we discovered another charming crepe restaurant at the Biltmore called  The Crepe  Club.  This is where I will be taking my business from now on!  This is a reply to Chez Vous response below:  An apology was never offered.  Frederic simply stated he would do the party at 4:00 instead of 6:00.  The point is, Frederic, that you had already committed to this date and time for my party!  The invitations had already been sent and it was a DINNER party!  I wanted to serve my guests dinner at 6:00.  4:00 is too early for dinner.  You should have made this work as we had discussed the time and date on SEVERAL occasions!  I strongly feel you handled this situation poorly and that your patrons need to beware of your business ethic!  It's quite horrible!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "69vPt4vjq_MNcjzTk5755A"
  },
  "_WZ9bRS6Z9NGuh-2eJXuqA": {
    "date": "4/26/2015",
    "text": "Super yummy! This was my first time here,  it was very cute and quaint inside, they also had a patio.  I originally went here for the crepes, but ended up getting French Toast and the Brassiere Omelet. The French Toast was to die for! The service was excellent as well. I can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fwPMzFdUKcPChzLVKdyTQg",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fwPMzFdUKcPChzLVKdyTQg/o.jpg"
      }
    ],
    "user_id": "QatO2pfuAKpTwxj_ZwCG8g"
  },
  "cuiQHVWelAm9s_ddW7Zb0Q": {
    "date": "11/27/2016",
    "text": "Their crepes were very delicious!!  Service was pretty good,  too, although they seemed to struggle a little to keep up once more customers started coming in.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Okscq2ORPoSFzkLkLGKQA"
  },
  "0Fp3Lg2TI4WkEzC-3M6eyw": {
    "date": "3/10/2016",
    "text": "Absolutely delicious crepes! In addition, it is quiet enough that you can actually have a conversation over a leisurely lunch.  Very authentic French cuisine in a small cafe with nice patio seating.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "rnN8s0goLrJFuYUfBXq2_Q"
  },
  "AOk8jk1xErtQTCwp6wGUfQ": {
    "date": "4/21/2017",
    "text": "This is a cute little local neighborhood breakfast place with some tasty items on the menu. HOWEVER, the owner/waiter is very rude and disrespectful.  I've been there twice:  The first time, I was so excited to find a creperie here but was disappointed in how rude the owner/waiter was.  The second time was because I was trying to give him the benefit of the doubt and a second chance.  But never again!  On the second time we went there for breakfast, before I could even finish my plate, the waiter/owner came up from behind me and grabbed my knife by the blade and grabbed my plate.  First of all, it was very obvious that I wasn't finished yet.  Second, he just grabbed it without asking if I was finished or still working on my food, as common courtesy dictates.  He just came up from behind me and grabbed my silverware and plate before I even realized what was going on.  It was actually my friend sitting across the table from me who stopped him and said I wasn't finished yet.  And when she did, the guy just dropped my knife back on the plate (the knife which he held with his hand on the blade--not the handle--the blade, dropped the plate back in front of me, and walked away without apologizing or saying a single word.  It was so disgustingly rude!  I never went back there again, and I never will.  There are so many other great places in Scottsdale to which I would rather give my business.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "u0xVzfCIHo8HFX6oihj22Q"
  },
  "cqIeeuCPjqN_B8lP4inSAA": {
    "date": "8/1/2017",
    "text": "We stopped in for lunch after a round of golf, so we were hungry.  The menu includes salads, sandwiches, wine, coffee & tea, as well as sweet & savory crepes.  The decor is refreshing.  The outdoor seating has misters as well as spacious tables.  No pets on the patio.  Owners are hands on and very inviting.  We had the buckwheat crepes:  the forestiere and the chez voux (yum!).  Iced tea (with refills) and generous size crepes, with side salads-$35.    Fast, attentive service.  We will return to explore other menu items.  Note the 2pm closing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "u6gipd_Gj8XffwUb3xbmPw"
  },
  "DHSFoSlXykEweP0MZG6c1A": {
    "date": "6/6/2017",
    "text": "The crepes were great! The service was terrible. The waiter rushed us after sitting over 20 minutes waiting for some assistance. We were paying in cash, intending to leave a cash tip as well once we got the change back. The waiter then made a snobby comment under his breath  about not tipping the waitress. So inappropriate! Won't be going back again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "o7814pofupYNyR4S9xO5yA"
  },
  "KsL7sPhCFpvG90CGGJvzGQ": {
    "date": "6/29/2017",
    "text": "One of our favorite brunch places. Owned by French. They know how crepes should be done.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OQOMqsk8B4tnPNa-VfT6mw"
  },
  "S1gsYlgeZlWZFZaFTNYMww": {
    "date": "11/11/2015",
    "text": "I'd been to this location a couple of years ago which I think is where they get most of their high star rating from. A friend of mine and I met up at Chez Vous just a couple of weeks ago and were completely disappointed by the reception and unfriendly demeanor of the new owners. Restaurateurs need to keep in mind that when people dine at their restaurant, they're coming there not only for a meal but also for the service.   From the point that I walked in, I was met with awkward sour faces and a very unfriendly attitude, I smiled and said hello like I normally do and asked if I could grab the last table on the patio. I was unsure if it was just in my head at first, but the same type of service continued after we sat down. What sealed the deal was when my friend tried to small talk and break the ice with the gentleman asking if there were new owners... his response: \"well, obviously...\" EW. Can it be more straight-up rude? And for no apparent reason.  I've never gotten up and left a place after being seated, but we felt so unwelcome and uncomfortable that we got up and walked over to Hash--which by the way is an awesome place with a diverse menu and a welcoming friendly atmosphere. I truly believe the owners were purposeful in their behavior and wanted us to leave. We obviously won't be going back there again and we'll be discouraging our friends from going too.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 15,
      "cool": 2
    },
    "photos": [],
    "user_id": "BpIHiiTkp_JyUVjK4BZ_Gg"
  },
  "pmPHddfXBqC5Dvj9Ur9JBg": {
    "date": "2/24/2016",
    "text": "This is a place that I go to quite often and normally I would have given it 4-Stars. The other day I met a friend for lunch on the patio, which is dog friendly, but any dogs that I have seen there in the past have been on the ground or under the table. On this day, a young woman comes in with her dog (who has a tutu on) and she is carrying the dog's bed with her.  She plops the dog's bed down on a chair next to me and puts the dog in it. She sat there taking picture after picture of her pooch.  I was not a happy person.  Maricopa County has a law that all pets that are in a restaurant, must be on the ground, not in a chair or in the patron's lap.  I was very surprised, that no one from the restaurant said anything to her.  If we had not been ready to leave, I would have said something to the owners.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "pX_pUHKm8VZWho4RDwo7fw"
  },
  "p1ppVzdvZ19HFsTlfqowVQ": {
    "date": "1/3/2015",
    "text": "Was definitely a fan of this place. It seemed like it was run my French people, so you know it's the authentic stuff.   I wasn't trying to eat too much, so I got the Nutella crepe with strawberries. It was light and simple, but I still enjoyed it. My parents got a savory crepe and were similarly pleased.  The service is excellent as well; our waiter was attentive and funny, and that was definitely a great part of our visit as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ORloFtZj3Cul8XeBw5wa1A"
  },
  "TdCfD0JG-AdWVW1bkW4gYQ": {
    "date": "7/15/2014",
    "text": "Great place for crepes..delicioussss!!! Very nice French owners! Highly recommended :-)   ... ...,, ......",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "WUqEhABwjHqzQnEKZL25cg"
  },
  "QJO_VMl3lJCeqdsaUA6yHg": {
    "date": "12/3/2014",
    "text": "If I only gave one piece of advice, I'd say: get the hot chocolate!!! Mmm, it's delectable  The crepes didn't really do it for me but the service/ambience was stellar. I would   go back and try a sweet crepe instead.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "b4Ie47uteUB_nxJ4y02pvA"
  },
  "YgyUui8pzW01Z7kq-3Q-eA": {
    "date": "6/10/2018",
    "text": "Up until today, we have ALWAYS had a great eating experience here. Even though it is a little out of the way for us, we decided this was where we both wanted to go for breakfast/lunch.   The restaurant was about half full and we sat outside, where only two tables had diners. We had even told them we were sitting outside, because we normally sit outside.   After 10 or 15-minutes of waiting, we could see the owner, his wife and another waitress moving around cleaning tables (no one was waiting) and still no water, or coffee, or taking our order. Since we were regulars before, we both knew what we going to order.   I finally got up and walked inside and spoke with the owner to tell him we had no water or coffee. He looked at me and said that they would get to us. I said they were waiting on tables who came after us! He looked at me and said, \"Then why don't you leave!\"   I told the owner that we just wanted to get water and coffee, and went outside to sit with my wife. Then the owner came out with food for the next table! When that happened, we got up and left!  I can understand and appreciate that when a restaurant is busy, you have to wait a little longer! Chez Vous was half full! We left and went to Butters, and even though we waited to get our table, once we were seated, the service was prompt and courteous!  No stars (I had to give one star to post this)!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 2
    },
    "photos": [],
    "user_id": "9aEDnGrkbzQl-3jSjeg7EQ"
  },
  "Gdoi48dSTnG55GDqIvfhXg": {
    "date": "10/28/2018",
    "text": "This is by far one of the best brunch experiences in a long time. The owners are a delight and the food was amazing. I had the Croque Madame and my Other had the Forestiere crepe. We'll definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dJj5GAWK8XYyY6lwncn0fg"
  },
  "RjLH0_RTuK3a_WKLOdfIjw": {
    "date": "12/29/2017",
    "text": "This is the real DEAL Owners from France just three years ago. We love France and the food. Chez Vous is just like traveling 7,000 miles Coffee and Latte a 10  Crepes original with many fresh ingredients  If your in Scottsdale stop by Sit out on the patio and enjoy",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "qbZlO17MDbzkYLgVv5Kj5w"
  },
  "X_nJ9tIxTpNuctjl5bMXRA": {
    "date": "8/6/2018",
    "text": "Delicious.  I had the best time with my girlfriend.  The crepes are so light and the Swiss cheese was just a perfect match. The server was sweet and very attentive.  I can't wait to go back. Oh... and the coffee addiction!   Don't just bookmark this place, try it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7meCAiR4R2jPI7iv-NdXVA"
  },
  "gaPVf5bpxZN9dDtEq6KHGQ": {
    "date": "3/24/2018",
    "text": "The owner is a jerk before being seated I walked over to the bathroom, while shutting the door the owner grabbed the door and flung the door open... he asked if he could help me and I said I was just going to use the bathroom, he said are you seated somewhere and I said no due to the barging in of the bathroom. He then decided to follow me out of the resultant to make sure I left.",
    "rating": 1,
    "rated": {
      "funny": 5,
      "useful": 11,
      "cool": 2
    },
    "photos": [],
    "user_id": "bjh0dByHOMCo7YHzNf1oNQ"
  },
  "ekdxXh_EwNqt6xfeGmxhhQ": {
    "date": "9/5/2018",
    "text": "What a charming place. One of my favorite culinary memories is from a little creperie called Chez Suzette in the heart of Paris. Owned by two brothers, with about 10 little cozy tables inside. Best service and food I had ever had.  Chez Vous brings me back to there. This little treasure is flawless. Every time I enjoy a meal there, I am returned to that sleepy street in Paris. The care, passion, and love the owners have for their business is evident. I was walking in and I saw Sophie polishing the coffee machine with a cloth. A machine that already looked flawless. The entire cafe is clean, bright, and decorated with taste and originality.   Their recipes are treasures in and of themselves. Delicious, perfectly prepared, and with nothing missing. The freshness of their ingredients is obvious, from the magnificent hams and cheeses, down to the bright greens in their salads.  This business is truly family owned and operated, and it shows. There is no rush, no pressure; this charming gem makes me feel at home every time.   Fredric and Sophie have brought a slice of home with them from France here to Scottsdale, and I believe the town is better of for it.   Thank you to you both; may you continue to enjoy prosperity and full tables.  I eagerly await the day I return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wRG_EuwppWQWRzGqRwrmew"
  },
  "1Mw8JeRs6x8sOKOHbI8r_Q": {
    "date": "1/26/2018",
    "text": "Just had lunch here with my 8 year old daughter. Very unassuming little bistro in a strip mall area.  We sat on the front patio, as the restaurant was relatively full. We each had a crepe, my daughter had the Tutti Fruity and I had the savory crepe with ground beef, mushrooms, potatoes and cheese.  We had them prepared with gluten free crepes as we have allergies. Absolutely delicious, both crepes.  Very good size portions for the price!  We both left stuffed.  They also made me a decaf cappuccino that was amazing! Definitely a great find!  So happy we stumbled onto it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DxD9RHIWdtQB13JP-PrMkA"
  },
  "FOXhp49fmgRBQFjDJJBxwg": {
    "date": "4/22/2018",
    "text": "Im really kean on customer service . They are not welcoming with a smile. They are very serious as if you are there for a business transaction than to get a service. Cmom people smile and greet people customers with smile and be inviting .. the moment i sat i was ready to leave. And then i left after the owner /server the guy with the arm tattoo ...and as we are ordering he cuts off and says just order drinks right now. And then ofcourse its disappointing they dont serve their breakfast after 11 cuz they have great croissants.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "pNypSW5PeXiGLSh0JhDKDQ"
  },
  "5IoWGHXO_CtGRg2W37jl4g": {
    "date": "3/11/2018",
    "text": "I don't write reviews often, but was compelled to do so because the owner of this establishment is extremely rude.    I've eaten at this place numerous times and the food is good.  The owner is very snobby and very rude.  On our last visit we made the staff aware of multiple mistakes on our bill.  The owner's response was to tell us not to come back.  This was after they took 15 minutes to acknowledge our table.  The situation could have been handled much differently.  Confronted the owner about his attitude and response and he made it very awkward going back and forth with insults in front of other restaurant guest.  He was also very rude to the female friend with me who has food allergies, which he showed little care about.  We asked specifically that nuts not be put in the food due to food allergies.  The food was delivered with nuts.  He was extremely rude when we brought this to his attention.  Have introduced many people to this establishment in the past and was a regular patron with little to no complaints previously. Won't step foot in this place again!!  Bad attitudes and bad service!  Worst of all a bad owner who is very offensive.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 10,
      "cool": 0
    },
    "photos": [],
    "user_id": "gfw126UbW_NLOE1Kb66pog"
  },
  "H0tWhPcQBZExwGT4i0V-Wg": {
    "date": "11/15/2016",
    "text": "I tried this place for lunch and thought it was great! I ordered the forestiere and thought it was great! The portion is actually very filling & they give you a side salad! I also got a croissant to go & it was probably one of the best I've had :)  All of that was less than $20 (with tip)! Such a deal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VmS5fHN-1chUokXQLPep7g",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VmS5fHN-1chUokXQLPep7g/o.jpg"
      }
    ],
    "user_id": "4EZ5xQfZGVvzQyQuo7TInw"
  },
  "atChSq3LoNt5Kmc4vxVXHw": {
    "date": "1/7/2018",
    "text": "Having little continental flair, traditional European food stylings is not my forte however,  Chez Vous is a French tour de force.  The quiche is always great. I enjoy the Chez Vous skillet; but be warned that it's only available for breakfast and NO exceptions to that rule.  You will grow accustomed to and appreciate the aloof French  hospitality.  Arrive early enough to grab a table outside to enjoy el fresco dining.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-rr8yexI0JRT_pqyNgu6jg"
  },
  "Q1H48oECioOlHIXx5g6e-Q": {
    "date": "3/4/2017",
    "text": "Delicious French food in a very cute quaint location.  My daughter and I were prom dress shopped my and found this great place to have some lunch. They have a great patio, and delicious food! Check it out, you won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Pxjst8MD-VLXj_mUNz3CAw",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Lyon sandwhich. Cranberry chicken Brie and mixed greens.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Pxjst8MD-VLXj_mUNz3CAw/o.jpg"
      },
      {
        "img_id": "bQuwN8tHbXUkhA4TZ0Kl2g",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Goat cheese and spinach quiche.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bQuwN8tHbXUkhA4TZ0Kl2g/o.jpg"
      }
    ],
    "user_id": "SYsyf6MPzWpUr50ibKaRMA"
  },
  "4NErGBsYh9bTMxCQ791CaQ": {
    "date": "11/22/2017",
    "text": "I tried this restaurant out for brunch after they had just reopened. I had the French Favorite served with a salad which were both delicious. I personally prefer my fried eggs over hard and the egg was over medium. I would recommend this place for a breakfast or brunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sxAqe5Ae24sc-ZvJgPKuCg"
  },
  "fCAQdJhR2OuT_K-80LDdNw": {
    "date": "9/1/2016",
    "text": "This place was so delicious for brunch last weekend. We were in the area just walking around in the early AM when we decided that crepe bar in Tempe sounded amazing but too far, I pulled this place up on Yelp (to my amazement really) and we walked less than three minutes.   We were warmly greeted by the owners and immediately sat down inside. I ordered a cappuccino and my boyfriend ordered black coffee. We split a chocolate croissant to start and it might've been the best croissant I've had in the states! It was so rich and flakey. Then we ordered our entrees, I got the quiche with goat cheese and he got a savory crepe with prosciutto and I forget what else. Needless to say they were both amazing, but he kept stealing bites of the quiche because the goat cheese was just so fluffy.   Service was impeccable. I did not feel rushed and the server assistant came around and did water and coffee refills at the perfect time every time.   I will be taking my mom here for a croissant and a crepe when she visits because I think this place is so lovely. When fall (haha, technically January when weather is crisp enough) I'll sit on the patio!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "ICw4trkmmulxI-SwmY0yiQ"
  },
  "iF5YUocqYU7bIDwi-CgSWg": {
    "date": "7/29/2018",
    "text": "I am happy to report this place is better than ever! I have been coming here 2-3 times a year for awhile. My last visit left me worried that new ownership was going to ruin a wonderful place. Well the new owners (has been over a year since the transition) definitely landed on there feet and have built a wonderful piece of France for us Phoenicians and visitors to enjoy! Great food, great atmosphere, and the best coffee in Phoenix!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sxx9myJ01LxTA1yuURlmZA"
  },
  "A79-xlNct9T4zOfzgCTGJA": {
    "date": "10/29/2017",
    "text": "Visited Chez Vous today for a delicious Sunday brunch. Noticed some handwritten signs requesting patience. Seems there were issues with staff or equipment.  The restaurant business can be so unpredictable at times. How appreciative it is, to forewarn customers in case they don't have the extra time. Most restaurant's wouldn't communicate this. &, it really wasn't all that slow. The service was great, the food was  excellent and our expectations as always were met.    They made us feel so welcome and treated us like family. Looking forward to going back again very soon. Love this beautiful cafe and the people who make it happen!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "IIA9V5Ybz1MrQiE7ZmIr0A"
  },
  "SjtMKaA3DvC470T8e83w3g": {
    "date": "8/23/2015",
    "text": "Absolutely delicious! An authentic French cafe, run by French staff. At the last minute we decided to have Bloody Mary's, and we were happy we did. Simple, yet delicious. My father ordered a coffee which was bold and full-bodied. For our crepes, we all had something different... my parents both had crepes with Brie in them, which they described as awesome. I had the prosciutto, tomato and balsamic crepe, which was very different than anything I'd had before, but absolutely delicious. Although we probably didn't have room, we then ordered dessert crepes - enjoying Emily's favorite and Pomme (apple in French). Emily's favorite was caramel-filled decadence, with rich and creamy vanilla ice cream on the side. Pomme was filled with apple and cinnamon, and also amazing.   The only complaint was that it felt as though the service was a little overwhelmed when it got a bit more busy, but they still maintained a good attitude. Additionally, the owner was aware of the increased strain when it got busy, and made sure to go out of her way to make sure everyone was still well taken care of.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QKXlegrjAqKTa8qMSWGFzQ",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Emily&amp;#39;s Favorite (and now mine too!)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QKXlegrjAqKTa8qMSWGFzQ/o.jpg"
      },
      {
        "img_id": "3H2WxtMknstnTkzu6tzZrA",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Provencale",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3H2WxtMknstnTkzu6tzZrA/o.jpg"
      },
      {
        "img_id": "K6i-vf4479xYE13uHzcM4A",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Franco Americaine",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/K6i-vf4479xYE13uHzcM4A/o.jpg"
      }
    ],
    "user_id": "1Hli30gVYEIEZsi6QfuHkA"
  },
  "DedRocxhO0Ie5QRbnidcGg": {
    "date": "9/28/2016",
    "text": "Surprisingly good! Don't mean it as a put-down, it is just that when you come in and get the luke-warm reception and look at the tables and the whole place, it doesn't feel like a real restaurant. Still, the crepes were perfect; stuffing just right and they did nail the bechamel.  Sweet crepes are also great, not too overwhelming.  Maybe next time we'll get a warmer reception, but given the location, maybe they are just used to a different kind of clientele.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "IeLDko6S37mC0RL2tobD1Q"
  },
  "I9iQrGSjMXGJlteX9JB6Rw": {
    "date": "7/1/2018",
    "text": "Amazing !!!  So yummy.  The crepes are heaven  Fantastic service  Looking forward to returning",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WcrpxjpDkKO7lSim8mo9oQ"
  },
  "tmp4AOZ_At8bHTbx2pGdqg": {
    "date": "6/3/2015",
    "text": "I love crepes!!!  Having savory crepes is a new concept to me because I feel like crepes should be sweet, however I have found several good spots that has a great variety for both! This is one of them.   First off, the area is very nice. We took advantage of the outdoor shaded seating because it wasn't Arizona-hot yet. The atmosphere was friendly and relaxing; the waiter was great even when we were (not purposely) difficult - we were just indecisive because of the diverse menu!   The crepes my friends and I got were really good. I got the provencale with an egg on top (because runny yolk makes things that much better). The omelette my other friend got look really fluffy. Also important, the mimosas were also on point!  This place is definitely worth a try. The other items like the omelettes and sandwiches look good too but it'll be hard for me to try one of those over a crepe...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "C4DhbPCTrUR7IDeZrpYzwQ",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Provencale with an egg on top!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/C4DhbPCTrUR7IDeZrpYzwQ/o.jpg"
      }
    ],
    "user_id": "mlnSOJBxe-BI5KGOSS4jgQ"
  },
  "1PDkrnfJ9DOwlo92CDogtA": {
    "date": "11/1/2014",
    "text": "My favorite by far! Great local place, fabulous quiches, crepes, croissants, etc. great service, always greats us personally. Our family tradition is to have breakfast here every weekend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GlGxyTx_KADcmAC6lb-9Wg"
  },
  "4e2rplrhh391SnkRZtCgmg": {
    "date": "2/8/2014",
    "text": "This place is absolutely \"darling\" pronounced \"dahhhling.\" Such a friendly, family owned business. They remember you even after only one time. They are french and even speak to you in French. It's very cute. The ambience, decorations, and food was a delicacy. The Lorraine omelette was fabulous. Even the outside seating was gorgeous!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8eVdfEe2c8c8IUCW2M9uGQ"
  },
  "YdTtv2nqFRcOsS8nk1ecXg": {
    "date": "5/22/2013",
    "text": "I came with my Mom, and we are both french. We were expecting a lot because we know how good crepes are in France.  First, the welcome was so-so, just came in and a guy told us \"hello, sit down where you want\", leaving us abandoned in the middle of an empty room (all the other customers were outside). The second employee was so rushed, expecting for our order quickly.  Then, the food. I chose the salade nicoise, nice but unexpected ingredients inside. Never seen potatoes in real french salade nicoise. I had to order more dressing because the tuna was a bit dry. My mother took a crepe \"brittany\", with chicken, tomatoe, cheese and bechamel sauce. The crepe was gray instead of brown in France, the side salad was awful, just a slice of tomatoe and the green salad was not fresh at all... So bad ! The creme brulee was nice, but too much sugar on the top.  Fortunately, the expresso was wonderful and delicious, the best drunk in Arizona !",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "akYZ59PZo8wkvdGlVcsWvg"
  },
  "Ti54RT5IY85c5aaMyghuKA": {
    "date": "5/25/2014",
    "text": "The food here is decent.  I would definitely recommend ordering the french toast.  It is to die for.  Most likely coming back here next time in town.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Gky11o22qPeeRtMis1ofYg",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Gky11o22qPeeRtMis1ofYg/o.jpg"
      },
      {
        "img_id": "0aCgad2GcdQMHAM-ba-SCQ",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0aCgad2GcdQMHAM-ba-SCQ/o.jpg"
      },
      {
        "img_id": "TWDNFc-_GI2dbpM-TVub3w",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TWDNFc-_GI2dbpM-TVub3w/o.jpg"
      }
    ],
    "user_id": "009U_T7U644EAk5U3Bxmew"
  },
  "Ug417G3y2Vtxwr6d-sKsZQ": {
    "date": "2/15/2014",
    "text": "Loved this place. Exceptionally attentive and relaxed service .  I had the chicken , Brie, onion, apple crepe for lunch and a clAssic crepe for dessert. BAsic coffee accompanied my meal And it wAs delicious! I can't wait to return !",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YSTyY5DU4-9wWx7lluTADA"
  },
  "A36viLyAAK7yJSx1lGZBVA": {
    "date": "2/14/2014",
    "text": "We went for Breakfast on Valentin's Day.  The French Toast is the best I have ever had.  I had a smoked bacon, onion and Swiss cheese Omlette.  Very nice.  And Pete had a smoked bacon onion and Swiss Quiche. Very light. Excellant.  We brought home a piece of chocolate eclair pie for tonight. Very cozy atmosphere and excellent service!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uqBRaeI-8vBwnzLppfsWaw"
  },
  "czhg7Fj3buSE0q35i0qj1g": {
    "date": "10/10/2015",
    "text": "Please, please offer toast.  Or at least bake your croissants more, they are almost raw and doughy.  You do offer a baguette with jam but this is barely warm and definitely NOT toasted.  Maybe buy a toaster?  The service is great and so are the salads but it's crazy not to offer toast/toasted baguette at a breakfast place.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ea4yiFKKahJk5bRDi25jUQ"
  },
  "lJk3HTxwrzdCE0cbb3a3mw": {
    "date": "4/1/2012",
    "text": "Tres Bon~~  Wonderful food, friendly staff.  Truly a hidden gem.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "VeiXn0H9afeDrqGejwk_tg"
  },
  "EekyxVg6k07T7hgh1kpmNA": {
    "date": "1/25/2014",
    "text": "Went to lunch with daughter-in-law and loved everything about this intimate French brasseire/cafe. My dil had a veggie crepe and I had a spinach/bacon quiche that was fantastic. I loved the creme brulee dessert and forget what my dil had for dessert but she loved it. I tried to practice some French pronunciation of menu items the night before to impress the dil but I failed. Attentive, friendly staff and a great alternative to the big box breakfast/lunch places.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "n0SDXunCvTiU2NxT2WXqMA"
  },
  "Ulz5hhOsR9qx2GGbrpjfdg": {
    "date": "6/7/2014",
    "text": "Terrific breakfast and brunch.  The Lorraine omelet and quiche Lorraine were fantastic, service absolutely outstanding.  Very kid friendly.  Have eaten breakfast here three times in vacation and would come back again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u2kbb_1tHnve6hbDK_IZxA"
  },
  "ckAXmSx-_Uj4LwP4Y_r3Ug": {
    "date": "5/18/2015",
    "text": "I had the specials (salmon and shrimp in curry crepe and raspberry tiramisu). OMG. I felt like I was back in Europe. The food was so REAL. When you eat this type of food, you do not need much. One bite and you want it to linger there because the texture, the smell, the taste . . . it is perfect. My friend who went with me is a chef and enjoyed it all, too. Also, the cappuccino was amazing. It is just a quaint place that delivers a little bit of Paris right to your palate.Je voudrais manger ici tous les jours si je pouvais me le permettre . Croyez-moi. Donnez-vous le don de manger ici. Excellente. Magnifique. Belle. Divine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Nk6t5JSt8nPy490niMJeHw"
  },
  "d-jTvhcfpmuazw3E0D-WPw": {
    "date": "4/1/2014",
    "text": "Tried this place out based on reviews.  It's a little far from us, but it was worth the drive.  The decor was lovely, the staff friendly, and the food was delicious.  The coffee was as amazing as others have said.  We ordered the Brie crepe and the Brasserie omelet.  The food was well seasoned and appropriate portions.  You leave satisfied not stuffed.  I was tempted to get a dessert crepe, but it would've been too much so next time.  The group next to us had two rounds of croissant so I guess I must try that next time as well.  Actually, there are many items on the menu we would like to try.  Definitely a place we will revisit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rAHymytvThRPf7sQa8Mr2g"
  },
  "Ld4RdwpbnARpD6wepqSk1w": {
    "date": "2/18/2015",
    "text": "Worse owner EVER, I returned my eggs because the salmon tasted wrong, smelled bad, the owner cam me to me furious to argue that there was nothing wrong with it, I told him that my friend also tasted it and she thought he same as me and he kept arguing, incredible, I don't normally return food unless something is really wrong but definetely this is the first time the owner comes to me upset to argue otherwise, very rude , I'm never coming back here again unless there's a change of owner.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "6ONXjNLhhaf-GQIm1wkRSg"
  },
  "UNEm7ya0ezN176jTScEa2A": {
    "date": "2/12/2016",
    "text": "If you want a little escape to France without leaving Scottsdale, CHEZ VOUS is it.  Good food and great service and the owners are really nice -- and here from France. Crepes are delicious, as well as the coffee and croissants. Food is fresh, and the menu has a good selection of French cuisine for breakfast and lunch. You have to visit this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v0_AE0Nb_v_0mCyNsoqY-w"
  },
  "wPtA74UC7x1FIgow69fFpw": {
    "date": "2/19/2014",
    "text": "Authentic French bistro. Beautiful crepes, amazing coffee and a charming atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JKsLmKoR9LV7J54Az1A28A"
  },
  "Y3U8PpCk-b2ltsO2secFKg": {
    "date": "12/28/2011",
    "text": "An quaint little spot to enjoy a pleasant lunch or breakfast.  I'm only aware of a handful of other creperies in the valley, so the uniqueness makes it stand out.  Our server (I'm guessing she was the owner) was outstandingly friendly.  It really felt like she was going all out to make sure we enjoyed our late lunch at her establishment.  We tried two savory and two sweet crepes.  Each was fresh and delicious.  The crepes themselves are a little different, but in a good way.  They don't have the buttery and eggy taste that you get at lot of places.  I was surprised that this didn't disappoint me.  It turns out I enjoyed that it did not distract me from the wonderful taste of the fillings.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "3cC726zwgerKNNasnidAww"
  },
  "lsW_5Z8sYcHHIDEgTCECLw": {
    "date": "3/18/2014",
    "text": "Great simple food. Usually very busy and it is a small place so plan ahead. Very nice French owners.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hssLYIMnYRPd9A_3o2A-gA"
  },
  "hyQ-3F9dO0-W8jYdYd2Sqw": {
    "date": "8/13/2013",
    "text": "Awesome place. First good sign of any ethnic place: when you walk in and see people from the home country. Half the people in the place were speaking French, which only added to the experience. Owner and we assume her family greet you when you walk in, and all of them are gracious and pleasant.   We did not get a chance to sit on the patio, though it was large and looked very nice. Misters kept it cool as well.   K had the Chez vous crepe and I had the Forestiere crepe with coffee. Coffee was very good, and K loved her hot chocolate. Honestly looked like everything on the menu was delicious. Staff was attentive and did not rush us. Definitely a beautiful place to go if you want to sit, enjoy a nice wine and good brunch food. Our only regret was we didn't get to try the dessert crepes. That's next week.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IF9EaKtrJdLI0Rlfo2Xa0g"
  },
  "xdt-mG98704Y4p2QPci4mQ": {
    "date": "1/5/2014",
    "text": "Crepes to die for. We'll be back for more crepes--and to try the great looking sandwiches. Don't miss out on the pies: lemon meringue was never my favorite, but I'm now a believer after tasting the best ever.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nk2Bg6Z32AtaucIpNk65Fg"
  },
  "POBIn_HNWem8GrcnRdm3aA": {
    "date": "12/20/2010",
    "text": "I went here for lunch a few days ago and it was pretty good.  I sampled 3 crepes (2 savory, 1 sweet)  and they were all fresh and delicious.  I could venture a guess and bet that each one of their 15 or so crepes are excellent.  Our waitress (the owner?) was also very friendly.  The only drawback of this places is that it takes forever to get your crepe.  I understand that freshly made crepes take time, but I think they need a few more crepe maker people in the back to get them out a bit faster.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "8959F5stCzJWI_I7dgxurg"
  },
  "Na6L7r021r_41NF22RJSEw": {
    "date": "11/25/2014",
    "text": "I'm a French fanatic so I was stoked to find this place on a recent trip to Scottsdale. The place is adorable and the staff speak French!! I'm so glad my husband doesn't mind me translating the conversations I hear around me :) After being twitterpated we ordered food which was amazing-authentic and delicious. I can say authentic having been to France several times at length now. The staff was very friendly and accommodating to getting us out on time for our flight home. I even ordered a croissant to go so I could have a little taste of France on the plane although it didn't make it that far...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AJAutODYH_q4OHTCwc0qMg"
  },
  "YZ5kbKFtzCgS1ULR7VAX_A": {
    "date": "9/3/2015",
    "text": "Yum yum yum!!! The food here is so good! Quiches, crepes in a variety of flavored both savory and sweet made fresh to order. Small and sometimes you may need to wait for a table onSunday morning, but it's worth it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BkWJECzaEOJDDNKKU7j4CA"
  },
  "UJwYRgqafjFY9ibnaQc_Pg": {
    "date": "1/11/2014",
    "text": "We visited town for my great grandmother's birthday, and the party was hosted here.    It was absolutely delicious!  I ordered the atlantic.  I love smoked salmon, and this was some of the best.    Did I mention they opened the place after hours just to accommodate our party?   That alone is 5 stars, but their awesome service, and awesome food sealed the deal.    Definitely recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "j8H-3a-KXqRpeGnAjNnpMw"
  },
  "zk0xGRwR36BVS-0jyac-Gg": {
    "date": "8/29/2015",
    "text": "Excellent. Small place but delicious food. We had a chicken and cranberry chutney sandwich which was huge, comes with a salad, and the brie and chicken crepe, also came with a salad. Both were delicious. To full to have a dessert crepe but will be back to try them another time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XzvdDq5VTiRZTd_6BHT08w"
  },
  "wMXXDBmDNyihqEWvkKPiMw": {
    "date": "9/23/2012",
    "text": "After looking at Yelp for top rated breakfast joints in the North Scottsdale area, we decided to finally make a stop here.  I am so glad we took all of your advice!  Chez Vous was quite a treat and now ranks among my list of top breakfast locales that are worthy a drive to visit.  Since the weather was nice, we sat outside at a cute little table and enjoyed prompt service by a young french speaking gentleman.  He gave us some wonderful recommendations for crepes and brought us bellinis with fresh peach since they ran out of mimosas.    I ordered the Croque Madame after seeing the photo on their website - and it was everyone's favorite!  fresh ham, eggs cooked to perfection.... yum!  We also got the provencale crepes and a lorraine omelet.  Nothing disappointed and came out looking like it could be photographed.  So thank you fellow yelpers for bringing me to what is now one of my favorite breakfast spots in the valley!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ijE2o5vt7VNdB9DCFOYX_w"
  },
  "pI9Z49Xhv8HZpuAMxN1cQg": {
    "date": "12/28/2011",
    "text": "The Brittany crepe with Spinach. That's what reeled us in.  That, and the superfriendly and hospitable owners, the charming Parisian decor, and the great service. It was an added bonus also to discover that our Saturday morning Chez Vous crepe expedition coincides with the once a month Cars and Coffee that takes place in the shopping center (my husband was thrilled!).   But back to the food. The Brittany crepe is amazing (even more so with added spinach, recommended by the owner). Sometimes they add some spices and herbs to the chicken also, which makes it just through the roof delicious!  We've also tried the Brie and Apples crepe, the smoked Salmon crepe, and several of the dessert crepes. All were delicious but the Brittany remains our #1!  We also frequently get the Goat Cheese and Spinach quiche. It's absolutely perfect! Most quiches we've tried here in America have been very eggy, which I don't like at all.  The Chez Vous quiche has a smaller ratio of egg, which allows you to taste the spinach, goat cheese, and crust so much more. Try it, it's just delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "aVaqOyPwZlLLaNUcHCZIZQ"
  },
  "_q5lnWM70wAZz8wuUGTxNg": {
    "date": "8/31/2014",
    "text": "Tried this place for the first time today. WOW. walked in and it looked very small but comfortable as soon as we walked in we were welcomed and told to sit where ever we'd like. We were promptly green with waters and asked what we'd like. We each got crepes. Mine has fresh mozzarella, tomatoes, and prosciutto with a balsamic drizzle. Oh my god this was to die for. My boyfriend got a chicken and mushroom crepe which he said was amazing. Food took a little longer to come out than expected but we didn't mind. The owner came over and apologized for the wait which was very nice. Once we go to pay out bill they gave us a chocolate filled croissant. Which was by far the best I ever had. This is  a great little restaurant with a great family feel. We will for sure go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fbZ4zILBzojttp2FJwh46g"
  },
  "3giciWm3NIUtAqzG2UtpDw": {
    "date": "2/23/2015",
    "text": "A very good place to get authentic French cafe experience in this area.  I tried the sweet crepes (strawberry/nutella), the savory crepes (coquilles St Jacques), the quiche lorraine and the salmon omelet.  All were cooked perfectly and served pleasantly.  The hot chocolate was great.  The coffee was fine. I will return again to try the croissants.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U9YF99nXf1bt4bRkSlFbvQ"
  },
  "8XaTE2Ycx2aNGD5nRm3Kew": {
    "date": "8/14/2013",
    "text": "This has to be one of the best places for crepes in AZ.Its privately owned by the sweetest French woman, who works with her son and I believe mother.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "JHCs-fyEMnKjWQkQvRSORQ"
  },
  "S5hxBt_E49GgIvMUcFH_KQ": {
    "date": "12/27/2014",
    "text": "The service was outstanding, Romain is probably the nicest and happiest people on this planet!!!  Good it's outstanding!!!! A must have if in Scottsdale",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dW9weacXClic4Pkwuwq8zQ"
  },
  "KQNWZoj4vhTjw5K41_N4OQ": {
    "date": "3/8/2015",
    "text": "Excellent ambiance and food. Money well spent. The crepes were healthy but awesome. Would visit often",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hzULZrvknqxxVFKC30k3kA"
  },
  "tfSJ4C1iRhqYQxsQB9W-QQ": {
    "date": "7/26/2014",
    "text": "I had such a wonderful time here! my friend and I ordered delicious savory crepes for lunch and shared a sweet crepe as a dessert! such a nice atmosphere too, they had a pianist and the server was running around singing in French.  I can't wait to come back and try more of their crepes!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "v48n_tCHi0DPxtD_E9Klzw"
  },
  "rTC1LqeXnUHPh9WlbrkD7A": {
    "date": "11/23/2014",
    "text": "Wow. Just discovered this place. It hits on all levels : food, service and atmosphere.  You'll feel like you're eating at a Parisienne patisserie.  The quiche Lorraine is perfect; and fluffy.  Bonus Appetit",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MtmyHZmNI16iYhu7fLGyXg"
  },
  "uE8ePMzo_JrvGKJBeCG2qg": {
    "date": "8/17/2014",
    "text": "My wife and I are regulars at Chez Vous and we had another 5-star experience at this wonderful French Creperie today.  The cusine is wonderful the owners and staff are always very hospitable and friendly. We enjoy supporting them and have always had a 5 star experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Ib-GWJQTOrpCNEDhLKZ8g"
  },
  "8Q_dIQUz1dr8V405oi6_RQ": {
    "date": "5/10/2015",
    "text": "The service is incredibly poor. I wAs told my table would be ready in 30-44 minutes. I set my timer,sat in the shade because there was inadequate waiting room outside or inside. I came back in 20 minutes. The rude,discourteous ,arrogant hostess informed me that since he had already called my name and I didn't show up I would have to be put at the bottom of the wait list. Then the manager had no time to speak with me to remedy the situation. NEVER GOING BaCK THRre but they don't appear to care about there customers.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "V9Tq91qy-p68UMiSt33thw"
  },
  "NEyQm1es6OgBycniknHOJA": {
    "date": "1/7/2015",
    "text": "Absolutely love the food, atmosphere and service of this little French gem in Scottsdale. Whether it's lunch with the girls, or a late snack with my husband, Chez Vous doesn't disappoint. Go when the weather's nicest and enjoy the charming patio. You won't regret time or money spent here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hn21Q92tHuA-6Niz35UZXw"
  },
  "uArYBtvCz9TTGaa9yhk2hQ": {
    "date": "10/24/2014",
    "text": "Went there a couple months ago...  It was fabulous and I forgot to write a review...  I was reminded today and had to give my 5 stars... Raisin croissant was amazing, hot and fresh!!!  Go there and try it!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mClAYxrDs--kv9M6EKnYog"
  },
  "Ho85drRbdmG2aqGN4yBPgA": {
    "date": "12/21/2014",
    "text": "The brie savory crepe is the best (haven't liked the others I have tried nearly as much).   A mango cocktail is lovely, and so is the coffee.  They offer Harney teas, which I love.  Atmosphere is quaint. Service is prompt. Tables can be rather small.  I will be back...I want to try their chocolate croissants...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7XLTUrYpOLnI7lQln5X1VA"
  },
  "3rC2VdJbcg4e_JjdjP6iVQ": {
    "date": "9/28/2014",
    "text": "Great brunch and drinks any day of the week. Always a crowd so arrive early. Excellent service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WQakCeKYhvKycnWtes086w"
  },
  "aJVREC1GseFE-odIqKgvFA": {
    "date": "4/3/2016",
    "text": "My wife and I visited Scottsdale and decided to try this place. Owner operated both were very polite and we had a nice conversation with the gentleman who is the owner and waiter.  Nice outside seating and both my wife and I enjoy the sweet and savory crepes.  Food was ordered and served about 10 minutes later. Great place.  Will hopefully return if ever in the area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DGiDwCW4fvVblmze2EVs9g"
  },
  "2g6LverMllukQmmhjYu4ew": {
    "date": "5/20/2017",
    "text": "My friend and I had been planning on coming to the restaurant the past week, but when we arrived at 1:45pm today, after having driven 30min, we were turned away saying the restaurant was closed. The owner and an employee were busy putting up the chairs, and the owner turned to us just to acridly say, \"Can't you READ the sign? We're CLOSED.\"   However, it's posted everywhere that the store closes at 2pm on Saturdays. I just thought it was quite rude and showed a lack of integrity. If he wanted to go home whenever they wanted, don't post that the store closes at 2.",
    "rating": 1,
    "rated": {
      "funny": 9,
      "useful": 14,
      "cool": 1
    },
    "photos": [],
    "user_id": "vxdyFpyiWkbSOYHefhB_dg"
  },
  "3Fme76U1DdV-3QGs27PPoA": {
    "date": "4/19/2017",
    "text": "My daughter has been here before and always raves about this place having some of the best crepes. I'm not a big crepe fan but my son wanted to try this place. Came here to Chez Vous on a Saturday at the brunch time. Little worried cause all the tables outside were full. To my surprise inside all the tables were open.   They have lots of tables outside and they have it setup where the whole outside tables are shaded. That's why everyone loves to sit outside. Inside it was bright and modern. Little European flare to the place.   Since they are known for their crepes I had to try them. I got the South West crepe which had all my favorite. Prosciutto, goat cheese, bell pepper, artichoke and dried tomatoes. It came with a small side salad with house dressing. Of course I had to get this with a cappuccino. The crepe was pretty good. Trying to cut the Prosciutto was little difficult but it was really good. Little salty but good. The cappuccino and crepe did hit the spot. I thought the salad went perfectly with the crepe.   My wife got the Potato Omelette which had caramelized onions, potatoes(of course) and mushrooms. I was able to sneak a few bites and really liked it. Surprised my wife ordered this cause she always adds protein. She complained a little cause it was a little dry but I helped her realize that there wasn't anything in it to keep it moist but chunks of potatoes. Surprisingly, it was good and she enjoyed it.   My son got the Che-Vous crepe with chicken and mushrooms. Didn't complain and just gobbled it up.   So the service was really great. Our server was good. Brought us our water cups and coffee. Filled out cups. Food came out in a timely manner.   So this place is good food for breakfast and bunch, great service and just loved the ambiance. Like I said before wasn't a big crepe fan and still not but food was good. I saw the server bringing out some French Toast that looked really good. So I'm really looking forward to trying other items on their menu. Enjoy.",
    "rating": 4,
    "rated": {
      "funny": 42,
      "useful": 66,
      "cool": 66
    },
    "photos": [
      {
        "img_id": "x4-i-QxvNRHosB3ATzE-tA",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Raisin Croissant",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/x4-i-QxvNRHosB3ATzE-tA/o.jpg"
      },
      {
        "img_id": "vG2ZfH1OyJ33ixxv5A_qvQ",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. French Favorite Crepe",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vG2ZfH1OyJ33ixxv5A_qvQ/o.jpg"
      },
      {
        "img_id": "w7o2e9WWRKGNUQ6axeR9VA",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. South West Crepe",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/w7o2e9WWRKGNUQ6axeR9VA/o.jpg"
      }
    ],
    "user_id": "asL1d04xS3y8YQtU5ota-g"
  },
  "ep13bkUKz-wSpRjTJFDW1w": {
    "date": "1/14/2018",
    "text": "I am from Florida and also a foodie, I traveled quiet a bit so when visiting new places I always rely on our yelpers review for good food and services. if you are in a crave for authentic \"francois\" crepes this is the place to stop. Everything is made from scratch which makes the food even better.  Yesterday I have the \"norvegienne crape\" which is a salmon crepe,  and for desert the tutti frutti, if you like chocolate hazelnut like me, please add Nutella. all exceptional.  I'm back today for a second round, had the \" chez vous\" skillet, sooo delicious... and once again the tutti fruitti. Excellent service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HWIzaZBlOqrWEtuSEbtjoA",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HWIzaZBlOqrWEtuSEbtjoA/o.jpg"
      },
      {
        "img_id": "tsfgLnGiqKgyd4XfYp_D5w",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tsfgLnGiqKgyd4XfYp_D5w/o.jpg"
      },
      {
        "img_id": "NZT-Y7BkwWm1xTF615P-sg",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NZT-Y7BkwWm1xTF615P-sg/o.jpg"
      }
    ],
    "user_id": "tMEdZaMYP0kOaCBVGvmPaA"
  },
  "_jmXzvPs-Du_IjWGqbKvLQ": {
    "date": "9/29/2018",
    "text": "What a charming place !  Good coffee, yummy crepe  delicious Brie/fig Jam sandwich  !  unpleasant service , we were served by the owner Mr personality , rude , unfriendly and impatient ....I would highly suggest for him to stay behind the counter.....",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4JIR6fvvG3eWMHKKKfRFEw"
  },
  "vb2Lvv_vuP2CvvmHZbTXAA": {
    "date": "11/30/2018",
    "text": "Worst service ever... crepes were very mediocre ... they couldn't even be bothered to fill a water glass or bring an extra plate",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "5rEeGdtSQBFhCPrdFLG5EA"
  },
  "duBV8eekptSirdJ6ABhLEw": {
    "date": "6/22/2019",
    "text": "Love the food and my favorite are the croissants but my only gripe is that they don't answer their phone when we try call to place a take out order... should really work on that... or at least have a website you can order from and not have a full mailbox",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sNa4xW4GsvZj3s6gKkMZdQ"
  },
  "mDhdk0lroJXD8BSLuXtJMA": {
    "date": "5/15/2019",
    "text": "When I was reading the post before heading there for lunch, I was a little concerned because of how negative the reviews were. That was not our experience. The owners were very nice. They came to us right when we sat down. And checked in on us throughout the meal and OMG, the food was so good. I had the quiche Lorraine. It was hands down the best quiche I have ever had. The salad dressing was yummy. Then for dessert I had the white chocolate/raspberry crepe. It was the perfect balance of sweet. My mouth is watering just thinking about it. So good. Not super expensive and the portions are pretty good size. Definitely worth the price. Definitely will visit again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wTGhamk9ZRXOcJtUdEz-cA"
  },
  "_4S_Z8KYmsy3sNf-IjCMGg": {
    "date": "4/8/2019",
    "text": "You are thinking of the wrong person lady!  I was not there on the weekend and I did not kick the door!  Furthermore I am not twice your size and I did not yell or speak inappropriately to you.  You told me you only had one cook and nothing about being a small restaurant. What if you had two parties of three or three parties of two come in--would you turn them away?  As I said, you were not busy and there were plenty of empty tables. Obviously you have so many confrontations with customers that you can't keep them straight. Scottsdale has many fine restaurants that appreciate their customers and bend over backwards to accommodate them--you don't deserve mine or anyone else's business.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "YhQ0gmdTnQro8Rhjtg6pEw"
  },
  "OfGV9G0TruKWi0t4wB2YiA": {
    "date": "8/17/2016",
    "text": "One of my Yelp friends (who hardly ever writes reviews) had five star for this place. I know his wife is originally from France, so if they said authentic, must be so.  I came here for lunch the other day and really enjoyed my visit here. We were seated by the window, facing outside.  Sitting there with a cup of mocha made me feel I was at a cafe in France.  I started my lunch with Lyon Sandwich. Chicken and sundried cranberry citrus chutney went so well together, very light, perfect for lunch.  Portion size was perfect too. Not too large or too small.   Best part was my desert, Trio Macaron. 3 macarons, vanilla ice cream, whipped cream topped with almond. Unfortunately he didn't let me pick my macarons flavor (he explained if everyone picks what they want, they end up with left over).  I understand why they do that and I guess they do so to keep their cost minimum. They are small business owner after all.  They did pick pistachio, which happened to be my favorite.  I think I would have enjoyed their macarons more if served at room temperature. (Then I would have to wait longer for my desert to be served, so next time I would ask for my desert early to have time to take macarons out to room temperature).  I saw many crepes on the menu. They looked very tasty.  I would love to come back here for branch on weekend and enjoy their crepes and a glass of wine at their patio when weather becomes nicer.",
    "rating": 5,
    "rated": {
      "funny": 16,
      "useful": 37,
      "cool": 36
    },
    "photos": [
      {
        "img_id": "mkjqLP1hzkNBgAZQBsBeWg",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Mocha, over looking patio from inside",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mkjqLP1hzkNBgAZQBsBeWg/o.jpg"
      },
      {
        "img_id": "BZl9g5TYmtrP-BkDIVHVUw",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Lyon sandwich (chicken)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BZl9g5TYmtrP-BkDIVHVUw/o.jpg"
      },
      {
        "img_id": "655wGU5OVi0dfWJ5sbdzPA",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Macarons and ice cream desert",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/655wGU5OVi0dfWJ5sbdzPA/o.jpg"
      }
    ],
    "user_id": "Gfxb_D1k8tueAoGn4cseoA"
  },
  "Z0ejd4R3LwSnunRuJCMtUw": {
    "date": "9/30/2018",
    "text": "After reading their reviews you would think owners would realize they have poor service and they are rude!  This many people cannot be wrong right?  I will begin but saying their food is awesome, but sadly they are on the bottom of our list when choosing a breakfast place.  Our conversation...   \"Do you want to go to Chez?\"   \"No, I am not in the mood for their rudeness today.\"   \"The food is really good.\" \"OK if the other restaurants on the way have a line I will go.\"  I am not kidding!  Could you imagine if they were kind to their customers?  They would have a line too.  It is amazing that they are defensive to the poor reviews rather than just changing their attitudes towards their customers.  Why be in customer service if you do not like it?!  Sadly, the staff learns from the owners.  2 stars for the food - 0 stars for the customer service.  We always have a bad feeling when we leave there and talk about our bad experience.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fg9ihXZk_ulzMy9K94wQ1g"
  },
  "HkjyfnaaRtNgBL-2ntMpZw": {
    "date": "10/6/2018",
    "text": "These are the worst owners. 2 weeks ago We entered the restaurant feeling very unwelcomed. After swallowing my pride, we sit we wait for ever to be served and it's not because they are busy it's because they have a conversation that is more important than clients I guess. The two owners looks like they are so miserable it makes disaster victims look like party goers. After all that the food is just bland and I'm just thinking I can do better at home with pre made Kroger flavorless mix. This place is garbage. Can't wait for them to be out of business and replaced by anything because anyone would be better than this insult. Sad but True.  Haha Sophie's comment is way off. I didn't just order coffee and stayed for 3hours. I tried to order and get out as fast as I could. Maybe you should re think if the restaurant industry is for you. That's what the issue is.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "ozQeWfoxw4GYuGY0edyjug"
  },
  "mjpidc1zaHdeI4yblr7vqg": {
    "date": "12/14/2018",
    "text": "This cafe is exactly what I personally want from a breakfast place: delicious food I can't make at home. Well, I can try, but I won't come close. Coffee is terrific black, croissants are the closest to France you can get in this part of town. Crepes (savory, the superior type, as well as sweet) and omelette and quiche are terrific. Prices are fair and ambience is ideal. Your friends and family will always be satisfied. Why anyone pays for eggs and pancakes, I don't understand. Come here and pay for something you can't fix at home.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "w4MxhOHe--4gS6e_K7Ddsg"
  },
  "FE0cVL2HudRY3dqJYwyUYQ": {
    "date": "8/14/2018",
    "text": "I came here with a group of friends   Really  bad service!! The guy is very rude if you have kids this is not the place",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "kGUOA3Qs5_bgypMNtrbVfg"
  },
  "N_rDPQIhKtl8XPe2LCz22Q": {
    "date": "7/30/2017",
    "text": "Extremely slow service but everything else was fantastic! I got the reinette crepe which was a buckwheat crepe filled with apples, goat cheese, walnuts, and a honey drizzle. I loved the blend of sweet and savory, delicious! The side salad was tasty as well, good dressing. I can't remember the name of the dish my BF ordered, but there was an egg and bacon and bread so he was happy haha. We also needed to try a dessert crepe, there were so many incredible options. We decided on the Snow White which was white chocolate and raspberry sauce, a delicious combination of flavors!! Prices were as expected, a little high but very much worth it.  Our server was nice but I was a little surprised by how slow moving everything was. Like they greeted us but didn't tell us to seat ourselves or wait to be seated so we weren't sure. Then they took quite a while to get us water. I understand they were busy but the wait was like abnormally long like I don't think there are very many times I've ever waited that long to order and then get my food. Was worth it though and I'd gladly come back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "cgdoPixLfGI7vpO3TsAEjw",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Snow white",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cgdoPixLfGI7vpO3TsAEjw/o.jpg"
      },
      {
        "img_id": "-ezGRC79A3W0kIiFU_-hng",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Reinette",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-ezGRC79A3W0kIiFU_-hng/o.jpg"
      }
    ],
    "user_id": "18qEoFOVEernpVLh97PQPQ"
  },
  "bLiRo_tfwUWcJ79ucH4O8w": {
    "date": "11/7/2018",
    "text": "Went to Chez Vous for the first time. Had the best experience, food was amazing and they even accommodated my special request. I cant have gluten or onions and tried the Printemps crepe which has goat cheese, Roma tomatoes and spinach. The dressing in the salad had onions in it so they let me substitute for the fruit cup and I was able to get my crepe gluten free as well. Unfortunately I did not get any pictures of the food, it was so good that I ate it all before reviewing. I then tried the Dame Blanche which has toasted almonds and your choice of raspberry sauce or milk chocolate sauce . I went with the raspberry over the icecream . I always send the guests that stay at the Sonesta Suites Scottsdale over to Chez Vous but never got a chance to try it until today. I am definitely going to continue to send guests to this cute french boutique establishment within walking distance of my job .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BPeqNWAKu0ta0hCCh-6YNA",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Went to Chez Vous for the first time. Had the best experience!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BPeqNWAKu0ta0hCCh-6YNA/o.jpg"
      }
    ],
    "user_id": "kr1pjxTHoxIcoJpLYYVivw"
  },
  "nJ_VSbhoaT0PPr5x9HKYQA": {
    "date": "4/26/2019",
    "text": "Delicious French food made by French people in a clean and relaxing environment. If you go with an open mind and don't expect the usual big American breakfast, you might be pleasantly surprised by your experience. It is my favorite breakfast spot in Phoenix.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5ts2MueVyhMRuVSx58KDIw"
  },
  "1Pe1-CL0gn8AXsIa-9QPig": {
    "date": "9/23/2018",
    "text": "My bf and I come to chez vous each Saturday because the breakfast never fails to impress.. trying something new each time.. the food is fresh and delicious!  The staff and owners are warm and funny, this is such a great place!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "UG2y54Iri9q2h4bZMyD1Qg"
  },
  "X40tDJPOCVomA0k9UwonfQ": {
    "date": "10/21/2018",
    "text": "I love this place for breakfast, great location, very nice and kind customer service, and foods are very delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EfKNXjVCvh6nCP6hxd-Xrg"
  },
  "GHPjliqw-fmPb7hpdj8rQw": {
    "date": "8/24/2017",
    "text": "Absolutely loved dining at this sweet piece of French heaven!  First time today. Mid-week Brunch. Sophie was awesome!  Food, service was perfect!  Deliciousness!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7zqpuA32Sk0YU3daZHCz8Q",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7zqpuA32Sk0YU3daZHCz8Q/o.jpg"
      },
      {
        "img_id": "k4xWNOt_mg-RMxrRrctupg",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/k4xWNOt_mg-RMxrRrctupg/o.jpg"
      },
      {
        "img_id": "QlM7BEarclYE4zlOBLaN9Q",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QlM7BEarclYE4zlOBLaN9Q/o.jpg"
      }
    ],
    "user_id": "4dvQbT-xg-bG-3atFWqfNw"
  },
  "NhBPjXg45dfzyko31flpPQ": {
    "date": "5/13/2018",
    "text": "Food was nice but waiting time was long. Definitely a good place to go at leisure. The desert was great. Crepes were nice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IHcbGm-An1ab4eZ022_lnA",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IHcbGm-An1ab4eZ022_lnA/o.jpg"
      }
    ],
    "user_id": "AuFnL3ICaVkf6EbvDDwEtA"
  },
  "P7fM7gN_9Un6tne1ITPKEw": {
    "date": "6/8/2017",
    "text": "I've been here a few times and never really had a good or bad experience, but this time it was hands down the worst restaurant experience I've ever had. The owner is not professional and has no sense of customer service. I walked in around 1:40, and the guy told me I have to hurry because they close at 2:00. I was understanding and told him I  already know what I wanted to order. I got my drink and told him what I wanted. Food comes out, it was ok- I asked for chicken added to my sandwich but there was none. I decided to let it go because the owner was already rude to me so I didn't want to say anything. Next, I stood up to go pay and he held the door open for me as in to leave, I said jokingly \"I still have to pay.. unless you wanna let me go\" and we walked over to the register. I wrote my total and didn't leave a tip because I don't prefer to tip on a card. About to pull out my cash, I realized I left it in the car. So I start to walk away, totally intending to bring some cash in once I got it out of the car, and he was like \"excuse me, you come to a restaurant and don't tip?\" I was absolutely STUNNED. I explained to him that I left my cash in the car and planned on getting it however I didn't want to now that he came off so rude. He then asked why I don't tip on the card. I told him I don't like to do that.  He replied with \"well there is no point in coming to a restaurant if you don't tip. Don't come back.\" Honestly, I could've walked out easily when he opened the door and not paid. He's very lucky that I'm honest. And I just walked away in shock. And the fact that he's the owner shocks me even more- how do you expect to have a returning clientele if you have no sense of customer service, not even the basics!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ms03CCMUf91Ru0sxm5YDeQ"
  },
  "nRbbNJ1L_HYxgb7caz069A": {
    "date": "8/22/2015",
    "text": "Simply the best crepes and croissant around. Actually, everything including the staff, is awesome. Go here!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3MFnsmoMzFLp2II-FYQdfQ"
  },
  "IdAklE9M6FyqcIgyk6zClA": {
    "date": "5/24/2015",
    "text": "Very disappointed with the service. We were seated and then no one came by to provide water or take our order! In fact, 3 tables that were seated after us were attended to first. We waited for quite some time but were completely ignored; we finally just left.  I understand they were busy but don't flat out ignore customers!",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aaJviEl338UFQ-e_HMYefQ"
  },
  "VK7ZVmf_HrbL2fTtuplyhQ": {
    "date": "2/11/2016",
    "text": "When my husband and I got to Chez Vous, nobody said anything to us and we found that very odd. I mean absolutely nothing...no \"hi\", or \"all of our tables are full right now\"...nothing. We continued to stand there next to a sign that said, \"Please wait to be seated\" for twenty minutes and still nobody said anything to us. There had been a table open for 5 minutes and yet, there we still stood. Already, I had a bad taste in my mouth about this place and we were about to leave but based on the great reviews on Yelp, we waited assuming the food was great. Finally, we got seated and the service was horrible the whole time. My husband and I both ordered crepes and my husband ordered a creme brulee. My husband's crepe was soggy and mine lacked any taste (the best part of my crepe was the fruit and I can buy fruit anywhere). My husband assumed the creme brulee would be great which is why he even ordered it. To his disappointment, he said that it was the worst creme brulee he has ever eaten. My parents have talked about trying this place, and I told them not to bother.  ***The rude owner just messaged saying that at least now I know French food isn't for me...interesting considering I've had amazing French food made by my French friends including crepes. I just don't like lack luster French food. Learn how to treat customers with respect.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y9sHzrd7mA4Hr7WPwi-Wbw"
  },
  "FHVlc5b8RWwwr5t2rM4XeQ": {
    "date": "7/26/2015",
    "text": "\"i love really thin pancakes\" I made sure to try both sweet & savory because Im just that person who wants the best of both worlds ;) I want to try the creme brulee next time. Chez vous , thanks for making me buy my first crepe maker !",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "o2FbUvgG9MJIxYo8SIH7dg"
  },
  "fMLe4okadbKkRza9bFpg-Q": {
    "date": "5/6/2017",
    "text": "Their speciality is crepes. If you have never had real French crepes before, this cafe would be entertaining.  However, having lived in Europe - including France - for over 20 years, this is not even close.  If you look on the internet, crepes are described as \"A crepe or crepe is a type of very thin pastry, usually made from wheat flour (crepes de froment).  They should be light, very thin and filly on the edges.  Both dessert and savory crepes should have these characteristics.'  You will not find such crepes at Chez Vous.  You will also not see anyone cooking a crepe in front of you.  Rather, the crepes are heavy, not warm and need a knife to cut them.  They are gummy and chewy - which real French crepes are not.  Our best guess is that they cook several thickers and sturdier crepes hours or days before, and then heat them in the stove or microwave with whatever fillings you have requested.  As a result of using thicker crepes and reheating them, the crepes have all of the taste and consistency of a rubber tire patch.  When we complained to the owners about the unacceptable quality of a savory crepe and a dessert crepe, the owner offered to not charge us for the food to avoid us writing about our experience on the interest.  We did not agree.  Try it at your own risk.  There are other places with authentic crepes in the Phoenix area and without the condescending European attitude.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4VRYQxjYVLHpKx-1e8F3uA"
  },
  "OifCITA5HbrSMRrmz-O0Cw": {
    "date": "2/8/2015",
    "text": "Yes, quiche, yes, salads, yes, service, yes, croissants! I love this place, the service is parfait, the space is great, so is the outdoor seating. I came a few times with the kids, and they are so great, they bring little baskets of toys for the table. Just so thoughtful. They are great and I can't wait for my next lunch there! Merci!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "5LdAsiZvBsr_BTEj4XCNrA"
  },
  "-exo5TBaVK9jIFYT_mGO0A": {
    "date": "5/9/2015",
    "text": "Took my daughter to lunch here--or at least that was my intent. We were told to sit anywhere and we did. An older couple with a small dog (licensed as a service dog--don't get me started on that) came in after we did and sat one table away. They were acknowledged and their order was taken. I mistakenly believed a waiter or waitress would soon, at least, acknowledge we were there. Nothing. The table next to us was cleared and cleaned. Still nothing. This is a teeny restaurant so I know they knew we were there. After 15 to 20 minutes of being assiduously ignored, we got up and left and we won't be returning.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UXeq8282qVc4iUrgUj0HDg"
  },
  "ux-id7Mth2wbiTN1r4Ullw": {
    "date": "11/6/2014",
    "text": "Food is always fresh and delicious. Service is great and the scene is very comforting. The Chez Vous crepe or the Tutti Frutti are always a good bet",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "CtRA0upwImEBb8zAncKreA"
  },
  "sAmozhp0MN80YSFgdrCDpA": {
    "date": "12/1/2015",
    "text": "In a strip mall off Scottsdale Blvd, this business is nice enough to command its own courtyard, but it manages to compensate well by offering outdoor seating to its guests.  The seating is not intimate inside, and the square tables are small, and the staff work fast and swift to try to serve everybody.  Their strengths are their classic crepes, especially the chicken crepe with the Bechemel sauce.  The dessert crepes seen on others plates look convincing enough to not wonder whether it's delicious or not, but if consumed, blood sugars will skyrocket.  The owners, from what we've heard when there appear to be fluent in speaking French, and would probably appreciate hearing the same spoken in kind.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YKWpz5K2-MrPHxErDCsSnQ"
  },
  "AVkx2xH4CGeKWSuzfWbtPw": {
    "date": "8/5/2012",
    "text": "Food and Service were excellent!  Went this morning for the first time and was  impressed.  Great coffee with plentiful refills which is very important in a breakfast location for me.  A restaurant that shall remain unnamed lost my business due to this.    Everyone loved what they ordered, I had the quiche Lorraine and it was creamy, cheesy, very  flavorful with an amazing crust.  My mother in law had the Croque and was crazy about it .   Cute patio area and we saw someone had a dog with them.    The chocolate croissant had me written all over but I was full from my meal.  New place for weekend breakfast with the dog, absolutely!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "QYNAVWjbwZobunCcNzk51Q"
  },
  "5J5sqnA3tYSP4Km3Ipvt-g": {
    "date": "4/26/2015",
    "text": "Amazing crepes in a cute little place! Visiting in Arizona and was craving Nutella, banana and strawberry crepes. Found this place and was so ecstatic it was great! Can't wait to go back for a savory crepe.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vA2vYW65uTMu1o746ZiqSA"
  },
  "hUuSfztjC2F3eiHbmGsP1Q": {
    "date": "11/16/2015",
    "text": "INCREDIBLY HORRIBLE AND RUDE service and behavior by owners!!! BEWARE it's new ownership ( the 5 stars were for prior owners) and they are nothing like the prior owners. I have to set this review up by stating my husband and I are foodies. We frequent all the best restaurants in Arcadia and Scottsdale...but of course we've also eaten at our fair share of smaller mom and pop restaurants which have good reviews, are \" hidden gems\" or local secrets. Never have I walked out of a restaurant in my life. But I did that day at Chez Vous. I had such wonderful memories of this place as it was our regular breakfast/brunch spot a couple years back when we lived in Gainey Ranch. The couple always greeted with a warm smile, and occasionally would treat us to a piano concerto. However when I decided to come back with a friend after a couple years, I was completely taken aback by the sour expressions of the new French husband wife owners as we walked in. They didn't smile once when we asked for a table, looked highly pissed when I used the restroom and then he gruffly asked us \"what do you want\"? He made a rude face when I laughingly asked him what he recommended. The question, \" did ownership recently change?\" Was met with an eye roll and \" obviously!!\". My friend and I could NOT for the life of us understand why he had his panties in a twist. For what? We finally ordered but as he walked away the angry French man muttered under his breath in French. Now I've taken French for about 5 years and know some French slang...let's just say he wasn't very happy about having to serve us. Which was fine. I promptly went inside and cancelled our orders and told him he needed to treat people with respect. We then headed over to Hash Kitchen across the parking lot where we are always met with open arms, smiles and every effort is made to made to accomadate their EVERY customer. It gives me the same feeling I used to have at Chez Vous  before it was invaded by rude and racist people.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 1
    },
    "photos": [],
    "user_id": "WtqZSO7WZ7PUtJga2KLM8g"
  },
  "a27ixKbqJjRwfRZH5vMSFg": {
    "date": "6/14/2012",
    "text": "\"First time here. As good as all the reviews say. Isabelle, the owner was our server early Saturday AM. She was great to talk with and we all loved our breakfast.   Get the Croque Madame. Outstanding.  it was perfectly cooked, and the egg on top was perfect too. so creamy and good. wow.  i may not try anything else  We'll all be back soon\"",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "BTRYak2vLiW-D7I-pkfA9Q"
  },
  "AQQA4vIIVrIRQXPvxVlPUw": {
    "date": "8/24/2014",
    "text": "My experience here was almost perfect.  Food, atmosphere, service and coffee were exceptional.  French family who are proud of what they do, and it shows.  Can't wait for next saturday morning.  Oui Oui.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "wToOwEzBkP6v2JwSUldi6A"
  },
  "7r2E8IT58ZCCRZi9sYSBYg": {
    "date": "12/14/2014",
    "text": "What a quaint little place tucked into the Shops at Gainey Ranch. It really makes you feel like you are transported to France.  Take a bite into a chocolate filled croissant while sitting on their front patio with a latte.      Their savory crepes are delicious with an egg added on top.  I had the chicken and Brie with Caramelized onions. Bring fido too-their patio isn't enclosed so it is dog friendly. The staff is super friendly and will let you know all the specials-great place to brush up on your French skills if you have them :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DSDL_v5dvLOIJ-o5sRhz4w"
  },
  "cuMA1WRpAOAzdR8IGpD2QA": {
    "date": "6/12/2016",
    "text": "Dined here for lunch with my sister and daughter. We each ordered a crepe. My sister ordered a hot water with a lemon after we finished eating, while I ordered a latte. The owner charged us $1 for her hot water. When she told him, and not rude but rather incredulously, why he charged a dollar for a hot water, he actually yelled at her in front of a room full of customers that it's normal to charge a dollar for hot water and to never come back if she doesn't like it. All I can say is, wow, losing customers and reputation over a dollar. Not the best crepes in town and certainly a horrible way to treat nice customers.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ydjah-dNU_UiHunKDIQ7A"
  },
  "HnHJd8zmd5UaoqhJjzulPA": {
    "date": "10/29/2010",
    "text": "We came here because we saw the words: crepes & gelato and couldn't resist.   The food and service was both excellent while the atmosphere was fun and Parisian.  Sadly they non longer offer gelatos, but that didn't stop us.  Enjoy!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "A0j21z2Q1HGic7jW6e9h7A"
  },
  "TP2qIg7LO9zQWesG4qtL_A": {
    "date": "6/8/2012",
    "text": "Quaint. Yummy. Friendly service.   Loved the service and the food.  I tried the Brittany crepe and it was good!  The chicken was tender and full of taste and the roasted tomatoes were a treat.  I forgot to ask for spinach and wish I had remembered to because I love greens, but it was good as is.  The savory crepes come with a delicious salad and it's a lot of food.  Next time I will eat less of my entree and try a dessert.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "-0aInSHjCWLfiNqfgmWnow"
  },
  "d1KWu9oab_z7AFzA0us9gg": {
    "date": "7/5/2014",
    "text": "It is a very good place. Be ready to wait for a table and for your food...if your are in a time crunch, do not go here! just saying...we had a great time! enjoyed the food and the service was great!.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "mTTh17ni9X3AWfOFkku-gQ"
  },
  "qYurgeuEC5YQnetbWwWRHw": {
    "date": "4/20/2019",
    "text": "Visit Chez Vous every time we are in Scottsdale. I want support the excellent restaurant Sophie and Frederick have developed and I want to remind some of the reviewers that we all have our favorite places--why would you trash a restaurant just because you didn't like it? Please, just leave. And for those of you who read bad reviews then pile on, I ask, why? This reminds me of the Masterpiece Cake Shop near Denver. It was a rabid attack. JUST GO SOMEWHERE ELSE AND SHUT UP!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LBUiSgzLyY2FrPaLEU_ckA"
  },
  "BX7WWswF_6iI9pnMb5Oq3Q": {
    "date": "9/3/2019",
    "text": "Absolutely the WORST experience EVER. We went for a quick brunch with our friends(she is a native of France and he is a former West Point Army grad who now has a service dog for PTSD.) All is the seats were taken outside so we waited patiently and finally asked a groups of 3 if they were possibly leaving soon.   The owner and his wife became so irate that we finally decided to just leave. We went across the parking lot and were eating our lunches when the male owner literally walked through the the parking lot, and interrupted our lunch by cursing us out in French???!?! Ummm....this is AMERICA!! PTSD is real and your treatment of our war hero was nothing short of the most embarrassing tantrum in front of a restaurant. EVER!! NEGATIVE 100!  Not to mention, we talked to an elderly couple they turned away because it was 10 minutes before closing. All she wanted was some fresh orange juice! Who does that??!????  I hope I can post the look on his face when he realized I was videotaping him! What a non American way to behave!  UPDATE: The owner never even bothered with an explanation....because there is NO EXCUSE!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kzy-hixnF2El8xB7SYtRlA",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. You vous people should get your facts straight...and maybe take your French rules back to your home country....France, perhaps?",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kzy-hixnF2El8xB7SYtRlA/o.jpg"
      },
      {
        "img_id": "RHQKr7hHjmuVNoKetKyEDw",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Next time, we should bring our mini pony! Hahaha",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RHQKr7hHjmuVNoKetKyEDw/o.jpg"
      },
      {
        "img_id": "CtXe-Vrh4xvOOsYhpndC-Q",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. This guy is in the parking lot in front of PANERA because we finally left. Who behaves this way????? This is one of the owners!! Seriously!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CtXe-Vrh4xvOOsYhpndC-Q/o.jpg"
      }
    ],
    "user_id": "XleZbXeWu_zkc6ZrMfjmIA"
  },
  "pj_MonoCIJ2657wmDKJ7Hg": {
    "date": "7/15/2019",
    "text": "I used to enjoy Chez Vous a lot but I do not think I will be back. Crepes here have always been expensive for what they are but we recently ordered 2 orders of the classic lemon crepes (citron sucre) after our main crepes and were disappointed to find that they had not had lemon squeezed on them in the kitchen - only a tiny (the size for an iced tea) wedge of lemon to squeeze on ourselves. Not great for $7.50 each and such a simple crepe.  Also - their new ordering system is a bit confusing... a mix between full service and counter service.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "QfP6FS0kXgopjph0KhEk5Q",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QfP6FS0kXgopjph0KhEk5Q/o.jpg"
      }
    ],
    "user_id": "JmBs_hVnqHHidm1bbLy0IQ"
  },
  "osHmEVrqav8332MFijrYpA": {
    "date": "6/26/2019",
    "text": "Considering the location, being tucked away in the Sprouts shopping center, I was shocked at how good this place was.  Crepes were outstanding, and the espresso was the best I can remember having in Scottsdale.    This is certainly now on our short list any time we're looking for brunch, dessert, and espresso.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ITFKHyVqm3Q4TvRhBGCfRQ"
  },
  "En4ShBZHVqJCVXqfbqsGqw": {
    "date": "9/1/2019",
    "text": "I stated going to Chez Vous when it originally open with Richard and Isabelle.  They were the most congenial hosts and were truly excited to have your patronage.  I consequently brought al of my friends over the years.  When they sold the business to Fredrick and Sophie there was a clear difference I. The lack of warmth to those that came.  While there were moments that were better clearly Richard and Isabella they were not.  It has gotten so bad that they would prefer to turn away business than to allow a Duce table to be shared by three people even though the patrons didn't mind being a little crowded.  While the food is reasonable, the invitation to their Restuarant is not.  If I am going to spend my money it would be nice to know I am appreciated.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "0-tvtrwGKmoAB-QOaPVZ1g"
  },
  "MAdNGxGxY6lHKrONpF53KQ": {
    "date": "3/24/2019",
    "text": "If I can give a 0 star I would!! I went in with my mom, sisters, & friend. We were wanting to celebrate a special occasion together with brunch & walked into this Cafe. No one bother to acknowledge us or welcome us until we asked if it was open seating or not. After the staff stated it wasn't, they contiued to ignore us & didnt say they were getting a table ready for us. After about 5-10 mins of waiting, we were ready to walk out & that's when they decided to let us know that our table was being made. I should have just walked out, service was horrible & all of the staff did not seem interested in helping us out. They seemed very annoyed the entire time. Food wasn't bad, but It was one of the worst services Ive had & decided not to tip bc of it. Mind you, I am pretty easy going & always leave at least a 15% tip. For me not to leave a tip, it has to be pretty shitty service. A few hours after my meal, I received an email notification that the restaurant decided to help themselves a $10 tip! How disrespectful & rude for a restaurant to feel entitled enough to give themselves to a $10!! I am literally appalled that someone would feel the need to steal from me, especially with such poor service! Clearly I am not the only one who feels this way about their service... Do not waste your time here. Save yourself the disappointment.  In response to the owner:   Please stop, my family was very quiet & respectful while waiting for the table. No one gave attitude nor raised our voices. Not one of us actually said anything for 10 mins, but we should have. We were literally walking out when someone decided to acknowledge us. There were plenty of seats open so please don't tell me you were busy. The fact that youre just responding 8 days ago, I guarantee you don't even remember who we were. So don't tell me we were \"rude\" to the staff. That's literally your go to phrase if anyone writes a negative review on your restaurant. Also, dont say your staff did not help themselves to a $10 tip, when I have a copy of the receipt below. You honestly need to work on your attitude. You have such poor people skills. It's honestly embarrassing how petty you are to people's responses to your page. I have never seen a business owner so wrong. Like I said before, please save yourself the disappointment from this shady company. There are better restaurants out there with better costumer service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 15,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BG9iDlf-qiHg15febt5mUw",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BG9iDlf-qiHg15febt5mUw/o.jpg"
      }
    ],
    "user_id": "ZNRdk9-YlS98teYE1zERAA"
  },
  "-afPVPtAVo2ApHZMD3tI1w": {
    "date": "6/17/2019",
    "text": "Terrible place treated me like a dog when I asked for iced tea he looked at me and did like I don't care face when I ordered my croissant he basically threw the plate at me and my family and we had two croissants and he did the same thing will never ever go back there I would not recommend at all",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "B4fudZmhMi679f6p9yGezQ"
  },
  "kga7e4xDhIpgYCFUI-olzQ": {
    "date": "3/12/2018",
    "text": "I guess when you're hit with three one-star reviews in a span of three days, you know it's simply just not a good week for Chez Vous. And unfortunately, despite actually having some pretty decent food based on my experience, the owner's bad attitude makes any positive remarks I previously said about this restaurant completely irrelevant.   Most reviews of Chez Vous are good. But if you do a little skimming, you'll see some negative experiences that all voice a similar complaint. And that complaint appears to be the attitude of the owner. Adjectives like \"arrogant\" and \"rude\" are littered throughout. I knew about this beforehand but didn't really think anything of it until he decided to throw out a snarky remark about my three-star review - seven months after the fact.   What's strange is that my review was largely positive (see below). I spoke highly of the restaurant's unique style and expansive menu. I praised the croquet madame and also gave a nod to my French soda. For the crepes we ordered, I noted that everything was good quality, but questioned why the crepes were barely warm. Despite this little hiccup, I still gave them a strong recommendation, suggesting that the menu probably requires some experimentation.   Well, apparently, the owner doesn't take to kindly to any type of criticism whatsoever, fully living up to his rude reputation by telling me to \"Get a life.\"   After reading some of these negative reviews that share stories of his questionably racist behavior, kicking people out of the restaurant, and just all-out being rude to patrons, I guess I shouldn't be surprised. Getting angry and flipping off people who leave poor tips or yelling at customers who write one-star reviews? Okay. I get it, dude. Some people have anger issues. But if you're lashing out at diners because they don't blindly give you five-stars and aren't afraid to constructively question your food preparation? Well, that's just being flat-out delusional.   Customer service is a powerful tool. If a basic sixteen-year-old working fast food can learn it, I'm pretty sure that anyone can. Maybe there's still hope for this guy. But if not, well, I guess you can chalk me up on the \"One-Star\" board for the same reason everyone else says.   The bottom line is: If you can't nail down the basic courteousness required to run a successful restaurant in America, then I'd suggest staying in the kitchen and hiring people who don't suffer from so much free-floating hostility to deal with customers.   Not recommended!",
    "rating": 1,
    "rated": {
      "funny": 5,
      "useful": 23,
      "cool": 1
    },
    "photos": [],
    "user_id": "TCPLaprJm4FFei2DkW6K6g"
  },
  "MQ03-V5XT20x8NTRuFVY-g": {
    "date": "8/24/2019",
    "text": "Crepe is great. Place is clean. Very authentic French. Croissants are good.  Nice and friendly staff.  The owner Sophie was very courteous.  I have picked up orders and eaten at the restaurant. Each time I have been there, Sophie was very helpful and clear on instructions.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uFCeBJKYKT1pmroSJkNrOA"
  },
  "WG2wGY3jQU8U1p3rTNle0A": {
    "date": "1/31/2019",
    "text": "The food was good. It's overpriced for what it is. I don't like eating a salad for breakfast and every dish comes with one unless you specify fruit.  Service was HORRIBLE, slow and rude. We had to ask multiple times for water, additional napkins and plates.  The place is very small and the tables are mostly 2-tops, unless they can push together for a larger table. Don't go with a big group. Worth going to taste the food, but don't expect anything fast or friendly. And after writing the above I checked out their other reviews and see that everyone says almost the same thing. You would think the owners would get the hint that they need to be nicer to their customers. Reading some of those reviews was shocking!",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 12,
      "cool": 0
    },
    "photos": [],
    "user_id": "bZ1v6GGqdJVnKOG_biX29w"
  },
  "HaRge9KK0LOAJjzkXYYlTw": {
    "date": "2/18/2018",
    "text": "A perfect place for valentine's brunch or just casual breakfast or lunch. Delicious French crepes, pastry and other French food. Beautiful modern decor with the touch of french style. The picture of black and white Eiffel Tower in the wall brings the whole statement of Paris. I had chocolate banana crepe it was superb! Will comeback here in the future.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "LP883AysBJqOAIzQnIvqnA"
  },
  "-DHXlVcvmnI97nzYtaQGRw": {
    "date": "1/17/2018",
    "text": "When I thought I couldn't love this place more.. they outdid themselves by opening Thursday nights for dinner. Last week I was able to score a Thursday night off work and made a reservation here. The atmosphere was relaxed and quiet; one of the many good qualities of this restaurant. Service was, of course, extremely personable and polite. They really love what they do here and it shows through their food.   Our server convinced us to try the escargot, we were iffy on it but very opened to trying new things so we decided to try it as our starter. The escargot was amazing! The chewy texture is not for everyone but I thought it was a match made in heaven with the garlic butter sauce.   We ordered the beef bourguignon and the Chez Vous gluten-free crepe. Outcome? Outstanding! The beef bourguignon was fall apart tender, the flavor was intense and savory. I still think about how it's one of the best stews to exist. The Chez Vous crepe had tons of perfectly cooked chicken and vegetables covered in a thick cream sauce that ties everything together.   Stuffed and satisfied, we still shared the Pear Belle Helene for our dessert. It was so cute I didn't want to eat it! Not overly sweet, exceedingly delightful! I will come back any Thursday nights that I have off for dinner.   (Side note: I'm a huge germaphobe but I went to wash my hands in their restroom and it's one of the cleanest public restrooms I've ever seen. I was impressed!)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "7IwzD1u42949m70zm39ffw",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Brie Crepe",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7IwzD1u42949m70zm39ffw/o.jpg"
      },
      {
        "img_id": "iHmB_iHASZJG9KDKpf1H5Q",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Croissant with fresh fruit",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iHmB_iHASZJG9KDKpf1H5Q/o.jpg"
      },
      {
        "img_id": "Q70mJYuH1E-BmjgeKBA2Og",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. The skillet comes with a side salad!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Q70mJYuH1E-BmjgeKBA2Og/o.jpg"
      }
    ],
    "user_id": "fQGcWW4VCmAYGnmgLOSBDg"
  },
  "kp1BdSeU2aqUSztqDzouAw": {
    "date": "9/15/2018",
    "text": "I was craving a chocolate strawberry crepe and this place  has it just right! So fresh, amazing quality, and delicious! Their menu is extensive and the savory crepes look fabulous as well. I need to visit here more often!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rgKPP-EXqNrSlRYHn3300g",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rgKPP-EXqNrSlRYHn3300g/o.jpg"
      }
    ],
    "user_id": "xiaJ1lug7dz3EjwF03FlrA"
  },
  "MN5spJ7C7NDPxOjhi7ys-w": {
    "date": "3/7/2019",
    "text": "Okay, so I read down some of the terrible reviews ... My breakfast was straight out of Paris. Been there, done that.  My Croques Madame tasted like that in the 3rd Arrond.  The salad dressing is the best.  Coffee is excellent.  However, they should have heavy cream on hand for my coffee. Always ready with fresh coffee ( and yes, the place wasn't busy at the time).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zYP44bhwu4hXIPM2fuvimA"
  },
  "nkMexpPh-2iI4wbwO-v1_Q": {
    "date": "4/29/2018",
    "text": "I am shocked to have experienced insult after being declined to purchase an iced tea drink. I don't know what triggered his snarky remarks and discrimination, when all I did was walked in to order a beverage.   What's noted on your establishment and what's was visible on your counter of To-Go/ Take-Out orders must not be a clear information. Just by your demeanor of rude and discriminatory antics, it was clear of your racist behavior.   You must be mistaken; I was yelling at you? That's preposterous of you to state that. Only you; the narrow minded had acted in disgrace! You had caught me off guard with your actions, I didn't have the chance to talk back. My jaw dropped to have experienced racism and it's 2018.  As I walked out dumbfounded of what I just experienced, I was observant enough to noticed that all the people he was serving are white people. After recollecting the insult he stated to me; there is no doubt that the French accent, bald headed guy with eyeglasses is racist and only does selective services. For the note: French accent is a descriptions not an insult.   I will not recommend this place to anyone. No one should be supporting a business with no moral principle! Browse through  and read all the 1 stars on Yelp or other review sites about Chez Vous owner Fred C. ; you can determine what kind of person Fred C is from all of his response. HE IS COMPLETELY RUDE, RACIST AND UNAPOLOGETIC!   I'm glad I did not waste my money with a poorly managed and disgraceful owner.   Fred you must be tone deaf to my statement of your poor management, rude and racist behavior. Your response is irrational in regards to your issues. What you wrote were bunch of excuses. Have some self awareness of your actions!   Perhaps you should consider taking class in Business Management while your at it take Anger Management course!   Best of luck to you!",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 10,
      "cool": 1
    },
    "photos": [],
    "user_id": "dwA_BlDHYeQ4Pj1HlvXE5g"
  },
  "K2c9BaJ4Zi2cF7XzmiSiZg": {
    "date": "10/20/2018",
    "text": "Terrible place. Went there today with some family in from out of town and staying nearby. They walked by yesterday and thought it would be a good place to meet for lunch. We ordered and were told 30 minutes into our wait that our server \"forgot\" to turn in the ticket. Food came about 10 minutes later and certainly did not make up for the terrible service. I ordered the salmon crepe and it was one piece of lox folded into a grey crepe. Very dry and unappealing. After we finished, the waiter said he knew the service was bad but how was the food? We all just shrugged. Check came, no discount or offer of anything else. We left a $1.00 tip and the woman took the bill holder off the table, opened it, saw the tip amount and proceeded loudly to try to shame us. Trust me, the tip was reflective of the (self-proclaimed) lousy service. Ugh. Skip this nasty place with the incredibly rude staff.  ***In response to her response.... it's rude and disrespectful to let you know we weren't ready to order at the moment?  And it's rude and disrespectful not to tip someone who admitted they gave you terrible service?  You're adorable.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 10,
      "cool": 0
    },
    "photos": [],
    "user_id": "eNPLqZXnpOpoU7ahHnU9tQ"
  },
  "r0v8R59I0o-GUqIgRSiD_A": {
    "date": "3/29/2019",
    "text": "Simple french food served with a bad attitude. On my last, and i mean last visit, we were sent away because we arrived 30 minutes before closing. Enough time for a simple sandwich and coffee.   All requests, even to have a simple meal seem to be a burden.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "4ETydf9WpWzkEsFAEpty7w"
  },
  "wesxnhcYJ0qqpXqu3Mjhxw": {
    "date": "10/6/2018",
    "text": "This place is the worst place to be welcomed correctly! We wanted to sit outside on the patio and we have been kicked out because our dog wasn't accepted. I was shocked, they don't let people sitting on their patio if you have a dog, their reason is a question of sanitary. How can you kicked out someone who has a dog and be sitting outside ???  We haven't had the chance to taste their food, but at this point I won't recommend you to go there because their service seemed very unpleasant. I see that I am not the only one who has been chocked of this behavior.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "pgyJmVCJnKNKGOUA348Emg"
  },
  "6VC2rkwRJSptt2zZ9i9_sw": {
    "date": "2/16/2019",
    "text": "Delicious savory crepes! Restaurant very clean, friendly and reminds me of my trip to France.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "x3oepuedqI6pvDwLQdUYeA",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/x3oepuedqI6pvDwLQdUYeA/o.jpg"
      }
    ],
    "user_id": "HfCB-eQXuVGdvi7FwgwbqQ"
  },
  "HXZTwdp5UcwnV5dQCdrlag": {
    "date": "7/20/2019",
    "text": "Just came from Paris last month and chez vous is still my favorite crepe spot ever! The chez vous crepe savory crepe is my go-to dish.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D7DZDE1NAMQ-KcMuEjqnkg"
  },
  "zeThVNLLIWXf6ZxrzKF61g": {
    "date": "9/21/2015",
    "text": "My wife and I came here for our anniversary breakfast. It was very good. Unusual, in that the fillings (banana, strawberry and nutella) were put on tops instead of inside. But, it tasted great none the less. The service was good, the atmosphere was nice and quaint and relaxing. I've tried some other creperies in the valley and this place is by far my favorite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "jxe7X8JV4kuYCiqPwjSqJw"
  },
  "6cA0IYuFHXbGzSgrwPOfhQ": {
    "date": "12/10/2015",
    "text": "Took my husband here for his birthday because he's a big crepe fan, and he had tears of joy after eating the crepe suzette (gran marnier). Everything was delicious and the servers were friendly and courteous. Can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "MH1q-gN88Z3qGaQe9L8waw"
  },
  "3FK-byzuQKdqoezmB8PPNQ": {
    "date": "8/3/2015",
    "text": "This was delicious, I want to go back again and try some of the other crepes :)  Also, the staff is friendly and attentive and I absolutely love what they have done with the space, very classy and cozy!  Update 8/10/2015 So I went back here yesterday and got: The Forestiere (DELICIOUS - will be getting again) The Brittany (Alright, not for me though) The Chefs Choice (Did not care for this at all) The Nutella + Bananas (DELICIOUS - will be getting again)  So, upon my return (and I will come back), I plan on getting the Forestiere for my main course and the Nutella + Bananas for dessert :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZD0qPbmylYvA8bIXDZlcBg"
  },
  "dCF3FNna53xO8vVr8R5n1w": {
    "date": "6/9/2014",
    "text": "Took a chance on this place and glad I did.  The seating outside (earlier in the morning mind you) was nice but there is seating inside as well.  I had the Lorraine omelet with potato chunks and a small salad and even though there wasn't enough bacon in it for me (bacon fiend here) the Swiss that was in there? C'est magnifique!   Not the speediest service on the block but it was good enough.  Just had to make them take notice that more water was necessary.  I mean it is Scottsdale during 100+ degree weather.    The prices are very reasonable - my omelet was only $8.75 - and an OJ was less than $2.  I saw another table get their French toast order and was determined to try it the next time I'm in town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dk5yqirSwDH7Cpp52NdhUA"
  },
  "FP5Zu6o-T-w3DfmuGkwSOA": {
    "date": "12/6/2016",
    "text": "Over rated! Bad service from the owner or manager, server very nice and caring. I would of gone back and try again something else from the menu, but simply because of the attitude of the older man that takes your order I will definitely NOT!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "1b0OPCVUbp4bfRHXe3TM6w"
  },
  "-bHdo4SZHiixmXWxtAonqg": {
    "date": "7/10/2014",
    "text": "These are delicious authentic crepes bretonnes. The best crepes in the Phoenix area. I had the Forestiere and every bite was splendid and full of flavor. The coffee is really good as well. I will be going back to try some more very soon.  The service is good, atmosphere is very nice but be prepared to wait for a table since the place has only a couple of tables. Worth the wait.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UsqLT-j6EfzQ2n_WxC5VfQ"
  },
  "1U2WoCzviDQqsF7IAmJeCw": {
    "date": "12/13/2015",
    "text": "Best Crepes in Arizona by far!  Great spot for breakfast or brunch.  I had a Nutella Crepe with strawberries and it was on par with the best I've had when traveling in Europe.  They have a nice patio and excellent service to top it off.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_ZjF4PdWGxqohPdrI6YHcw"
  },
  "WfTGkdXxX4SP9IjFSKz20g": {
    "date": "6/7/2013",
    "text": "I wish I had a picture to post of my lunch today...but I eated it. I plan to eated more in the very near future. As I sit here typing my review, I have Nutella all over my face. *money shot* SCORE!  So my coworker and I were fiending for some crepes, so of course I grabbed my Yelp app and looked for something near work...up pops Chez Vous. VOILA!!!   We ordered (to-go) a croque monsieur to split, she had the classic crepe for dessert and I looked through the menu looking for the perfect fix for me sweet tooth. After hemming and hawing for a while, I located the tutti frutti...but it was missing something...something crucial to my dream of the perfect sweet crepe...NUTELLA! Lucky for me, they were very accommodating and added it to my beautiful buckwheat (or is it regular wheat? Bah! WHO CARES?!)  treasure.  The croque monsieur was THE BEST I've ever had, here or abroad. (So very sorry La Grande Orange, but since you are in my neighborhood I am sure I'll return to you eventually...when I can find a parking spot.)   The bread was baked (golden as promised on the menu), but soft and doughy and covered with melted cheese and shmeared with creme fraiche...why oh why did I agree to split you my dear little sammich?! I may have to stop back on my way home to have it for dinner. It was decadent. It was sinful. It was perfection!  My Nutella, banana & strawberry crepe didn't even get a chance to scream for mercy. If it had fresh cream on it I probably would've tried to inhale the damn thing and drowned. So I guess I should thank them for holding back on that...drowning is a terrible way to go, even if it's done while asphyxiated with hazelnut spread and fresh fruit.   C'etait delicieux, merci bien, a bientot.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "mzHRaYLoV-lwX79HghP6lw"
  },
  "b1xwODnPwPk0ON5i-j51RA": {
    "date": "5/14/2017",
    "text": "Went for crepes and discovered the salad. The staff was nice, friendly, and quick to take my order. I got one of the savory crepes and one dessert crepe. The savory crepe was surprisingly better than the dessert crepe. I am a bit disappointed since I was hoping the dessert crepe would be the best part. Both crepes weren't anything to crave. The best part of the crepes was the side salad that came with the savory crepe. The house dressing made the entire salad. I will be back to try a salad next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RvDxUJgPThMGd8YJfTiBkw"
  },
  "d6Pl8_PE8fEvu3oiKijXQg": {
    "date": "9/18/2015",
    "text": "Came here for the first time with some friends who had visited several times before.  I let them guide me with the brunch selections and all were fantastic - croissant to start, quiche Lorraine and salad for the main dish, and Crepes with Nutella for dessert.  Had to take a long nap afterwards, but worth it.  Will come back soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "GE7DgP1uFPEBCr81NEWMjg"
  },
  "-EIUPvcxFtD3BmYuz1UZvQ": {
    "date": "9/8/2013",
    "text": "This place very much reminds me of the cafes I've visited in Paris, except the staff is very friendly and the service is better.  We stumbled on this place when we brought our car to the \"Cars & Coffee\" gathering that is hosted at Gainey Ranch the first Saturday morning of every month (where you can peruse dozens and dozens of exotic and classic cars - check it out!).  We see some of the same people and the staff is always friendly -- feels like dining with family (close family, not the freak-show family that crawls out of the woodwork for Thanksgiving).  My fave is probably the Croque Madame sandwich, which is a classic and well prepared here.  We've always tended toward the savory, but anything with Nutella in it can't be bad.  This is definitely the kind of place you can come with a newspaper and just chillax. And you can even bring Fido, which makes it even more homey.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "CwK495oQNfCkbfQS56dLeg"
  },
  "E6wvGkve4JmX1G-oQU9uEA": {
    "date": "4/4/2014",
    "text": "Love this place! Fantastic customer service. Amazing food and ambiance. Mamamangos are delicious. For chocolate lovers you must try the Nutella crepes, I add strawberries! The perfect place for a Sunday brunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ugRkZmlhUF6jK8j9TuoTkQ",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Chocolate eclair pie! Mammamango!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ugRkZmlhUF6jK8j9TuoTkQ/o.jpg"
      }
    ],
    "user_id": "ADVGxYLPRFoDSxKYODL3Kw"
  },
  "I-rAZEkI77WJxVGRk58QrQ": {
    "date": "5/12/2015",
    "text": "Went there for Mother's Day, They were very busy but the staff did a good job of accommodating everyone. The food was as good as usual and we had two of the specials for that day,  We eat by here often and find it a pleasant place to be with good food. The only bad thing on this past sunday was an arrogant and demanding woman who made a scene because she didn't hear het number being called.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "qZlph1tPtV2iD0lyFt5wAA"
  },
  "LPj2JO-Ndul8oaddE48TXA": {
    "date": "7/24/2014",
    "text": "A fantastic family run creperie with desert and entree crepes as well as excellent kiche. Great service, great people, great experience. Andy W",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X10yrB0N6yNhLLlTR1dlwg"
  },
  "wc6GQ-Fj6_KuVWpaxKFSvA": {
    "date": "9/6/2014",
    "text": "My wife and I had a late breakfast here during our \"staycation\".  We chose to sit inside the small restaurant, but the patio seating would be lovely earlier in the morning or during a more temperate month.   Service was excellent, it felt like being a guest in this family's home and they wanted to share the food that they were proud of with others.  My wife had the croque Madame which came with a small side salad and I had the nutella & banana crepe.  All were phenomenal.  We are already planning on the next time we can be in the area, so we can come back and try more from the menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HQf12eyVTNOAlZIrdx8hww",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Nutella &amp;amp; Banana Crepe",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HQf12eyVTNOAlZIrdx8hww/o.jpg"
      },
      {
        "img_id": "cTYg5Yqkl0Hhh9xdOo2zzg",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Croque Madame",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cTYg5Yqkl0Hhh9xdOo2zzg/o.jpg"
      }
    ],
    "user_id": "Rq5-UgC7EZseZs4KeSupMQ"
  },
  "n07P9smpbaP_xmKHBRVMsw": {
    "date": "3/6/2015",
    "text": "My family and I absolutely adore this French-owned and operated creperie in Scottsdale and we come whenever we are in town. On a mild day, we adore sitting outside and catching some sunshine while indulging in Chez Vous' wonderful crepes and omelettes. After all this time, we have tried everything on the menu at least once, and you can't go wrong. Everything is heavenly! The staff is French-speaking from western France (I believe Breton) and they very much enjoy chatting in French with their patrons. Children and groups are welcome (whenever we come as a family, en masse, we check both of these boxes and the owners are happy to accommodate us). 'Chez Vous' is the perfect name for this place, as you will immediately feel at home here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "LemDESTKgAfeTiHOaE08jg"
  },
  "ZDfzl74J853qhmROWwzTCw": {
    "date": "5/24/2015",
    "text": "Rude staff the lady working today walked up to us and turn and walked away. The guy took 3 orders from other tables that came in after us.  No one said anything to acknowledge us. We had been sitting for about 15mins. We ended up walking out and informing the staff.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nt77mYeLPKBXpexytEqDKQ"
  },
  "t8m6uXYuLe76LllMlzEuaA": {
    "date": "8/9/2016",
    "text": "Me and my mom went here nearing the end of the Summer. I'm guessing that it's more busy during the Winter, because we were the only people there, but it was super nice all the same. They had good coffee, and of course excellent crepes!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "FBCTuNI_6zFxg_Ly3dHsaw"
  },
  "p9anZGZxDGYilfbc1tBlUg": {
    "date": "9/14/2012",
    "text": "Recently I became consumed with the over whelming desire to consume crepes. After searching Yelp, I came across this place. Luckily, it's pretty close to my work so the husband and I had to check it out. It's in a shopping center near a Pei Wei, which is sort of a turn off, but that doesn't detract from the food. The husband ordered the Chez-vous, which had roasted chicken, sauteed mushrooms, and bechamel sauce while I ordered the Brittany (chicken, tomato, caramelized onions, and creme fraiche). Both came with a side salad, which had a very good dressing. I wasn't expecting the crepe to be an organic buckwheat crepe, but it was delicious! Afterwards, we split the Exotic crepe - shredded coconut, melted dark chocolate, and bananas. I'm a sucker for anything coconut, so let's just say it was amazing. I can't wait to come back!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "XJYFjbH-oTmu2dATTqyauQ"
  },
  "G0PbDQafVOZmMutsg1oEyQ": {
    "date": "9/27/2015",
    "text": "I just recently tried Chev Vous and hands down it has the BEST French toast I have ever tasted! It is decorated so cute and quaint. Can't wait to sit on the patio when it cools down a bit. One tip: get there early, because it does get packed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "N6lxuEpTs5ZuADzReSkJFQ"
  },
  "K-9AlElbxQeaDGq-nl7UKw": {
    "date": "2/12/2017",
    "text": "This place was outstanding. We each got an omelet and they were both so so good. I got the potato omelet and it was such a great savory flavor. The service was also incredible. Our coffee cups barely hit the bottom before they were back out. They checked on us often and made our first experience here perfect. I highly suggest this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YRV_9sbJo777IBvcQ_spGQ"
  },
  "kSDyvNOLeMIKeoCs7YYw1A": {
    "date": "4/15/2017",
    "text": "This is a jewel of a place. Excellent breakfast & lunch menu. Fresh ingredients, made to order, beautifully. Lovely, lovely owners. Nothing is a bother for them. Highly recommended! If there were more stars I would give them",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BaEnwP3NNZ047eSG7vRkIQ"
  },
  "Jno-xUgJd9wC9fMMqdREbQ": {
    "date": "3/18/2017",
    "text": "Went for breakfast and food was fresh and served quickly. Although we were there for the crepes, the pastry was really what stood out. Excellent flavors and taste. Crepes were solid and were presented nicely. This place doesn't look fancy, but the food is down to earth and very tasty. I'd recommend it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WZblgaY-vSRuMbg-GXXzbw"
  },
  "eaJijOOSXs8y27qj2IDvCg": {
    "date": "4/17/2013",
    "text": "Arrived around 7:30 am to find CV closed and not due to open for another 30 minutes, so I drove further down to Wildflower Bread Co. to check out its breakfast selections.  Perhaps it was the few bites of the two scones I purchased to-go there that caused me not to thoroughly enjoy my staple selection of a raisin croissant ($2.75) today. <a href=\"http://www.yelp.com/biz_photos/chez-vous-crepes-scottsdale?select=52oY8x3SL4Rc4R4xt9BNOQ#52oY8x3SL4Rc4R4xt9BNOQ\">yelp.com/biz_photos/chez...</a>  (I agree with an article I'd read years ago that only the first few bites (four, I seem to recall) are the most pleasurable, and succeeding portions lose their potential to cause excitation of the sensory nerves.)  I also ordered a Moka ($3.50) <a href=\"http://www.yelp.com/biz_photos/chez-vous-crepes-scottsdale?select=ABggPbd3PviD8f9pdwEBgg#ABggPbd3PviD8f9pdwEBgg\">yelp.com/biz_photos/chez...</a> and tried a new (to me!) crepe, a savory one called French Favorite (shaved ham, Swiss, and sunny-side egg in a Sarazin buckwheat crepe, $9.50).  The Moka was delicious- it came unsweetened, which was OK with, since the bites of scones and croissant had enough sugar to sweeten the occasional sips I took of it.  The crepe was very tasty!  I forgot to inquire how the fried egg would be presented, and I wasn't asked, so I'm assuming the kitchen cooks it sunny-side up.  If you like your eggs cooked differently, make sure to speak up!  Today's version wasn't so bad, and it made for the \"money shot,\" anyway. (Or maybe not!) <a href=\"http://www.yelp.com/biz_photos/chez-vous-crepes-scottsdale?select=VoSHxUsHFXKGGQS_wPfjNg#VoSHxUsHFXKGGQS_wPfjNg\">yelp.com/biz_photos/chez...</a>  Isabelle was sweet and accommodating, as always, as she did not rush anyone out of the cafe, switched out the salads when I asked if the vinaigrette contained mustard (it did), and brought me regular coffee when my Moka ran out.  Tip- order the Moka when you are with a friend, as you will garner not only two cups of delicious mocha coffee, but a pot containing about three extra servings!  Then again, the first and last time I did order this coffee selection, I was with my younger, and ultra-sexy cousin (guys NEVER fail to look twice when she's around!), so maybe it was a one-time deal...  I won't name names, but I think someone had a crush on my beautiful cousin!  ;)  In any case, I enjoyed my delightful Moka and savory crepe, and, at a lesser extent, the raisin croissant, so thank you Chez Vous! ----- -----  After posting the above review back in 2013, the products I've received from Chez Vous have been average at best.  All of the raisin croissants were burnt.  After two visits, I stopped going.  Back in November 2015, I'd heard from guests at The Hash Kitchen that CV has switched owners.  I do not have plans on going back to see if the food has improved.  Good luck, Chez Vous!",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 10,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "VoSHxUsHFXKGGQS_wPfjNg",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. French Favorite: Sarazin buckwheat crepe, shaved ham, melted Swiss, and fried egg, with accompanying mixed greens salad.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VoSHxUsHFXKGGQS_wPfjNg/o.jpg"
      },
      {
        "img_id": "52oY8x3SL4Rc4R4xt9BNOQ",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Today&amp;#39;s raisin croissant.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/52oY8x3SL4Rc4R4xt9BNOQ/o.jpg"
      },
      {
        "img_id": "ABggPbd3PviD8f9pdwEBgg",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Moka!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ABggPbd3PviD8f9pdwEBgg/o.jpg"
      }
    ],
    "user_id": "M9rRM6Eo5YbKLKMG5QiIPA"
  },
  "p_lEjudSj7p0_2OApK1HcA": {
    "date": "10/22/2016",
    "text": "Best breakfast crepes in AZ no doubt! I've tried a few places around town and was disappointed but this place had perfect crepes to satisfy any palette.  I enjoy the Nutella w strawberries but once in awhile I go savory and I'm always pleased! Everyone here is friendly and attentive. And the presentation is almost too beautiful to eat ... but I get past it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "2-U928U3Oh6ojhjKuP6gXA"
  },
  "uiCRWbCIncA7trn-_1EZyg": {
    "date": "2/26/2017",
    "text": "This review is not a reflection of the food or the staff of Chez Vous... it is a direct reflection of who we assumed to be the owner.   Our party was rejected on the basis that we were one too many to be seated. DO NOT show up to Chez Vous with seven people - only six or less is acceptable - even when there are multiple empty tables and zero wait.   Upon being rejected for service, our party waited out front so we could figure out a plan B. It was during this time that a one star yelp review - very polite and honest - was written. This angered the assumed owner - a very angry Frenchman wearing a hoodie - who came out told told us to stick our one star review up our ass.   Ultimately, the root of his anger was discovered to be that a one star review was written without the experience of the staff nor the food of Chez Vous. To that, it is quite ironic since our party was turned away and were unable to have such an experience, hence, the disclaimer at the beginning of this review.   I will never support any establishment that does not realize the basic cornerstone of any business: customer service and politeness. The owner of Chez Vous is the antithesis of both of these.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BQaluFZmWLqq5Yc2IyCIqg"
  },
  "nc7xxxh7TfvJKPKXg4MSvg": {
    "date": "9/11/2016",
    "text": "We never had a bad experience. The owners are always polite and generous. Food is amazing and very tasty coffee. We always bring our dog and they make us a little cucumber and chicken dish. Thank you so much!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bs-zg8OHe6FpDvbKmYprfA"
  },
  "89AbjURRf-w6LDG4tC3YNQ": {
    "date": "8/14/2015",
    "text": "Stopped in for a mid morning meal (aka brunch) and enjoyed this cute spot. First of all, I have to say that Scottsdale shops, restaurants, etc. remind me of Omaha as a lot as many of them are in strip malls! Anyways, we ordered a sweet crepe- the exotic and Brie for savory. I also ordered an egg on the side. I thorough enjoyed the savory crepe but the sweet one seemed a bit over cooked. Also, I ordered an over easy egg and it was over hard. Our meals were good but those points knocked it down a star for me. Also, the service was very friendly and attentive but almost a bit too attentive...I would basically set my fork down and they were immediately taking the plate. I am sure many people appreciate this, I just wanted a second to maybe take a breath. I would still encourage others to stop by this cute spot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "vGe22FBPeP-woeKnal4ieQ"
  },
  "Y8LRo-wE8jFhR05EvCaZzw": {
    "date": "6/18/2016",
    "text": "On their dessert menu it says \"pie of the day\".  When I asked what the pie of the day was , it was like the waitress had no idea , and she had to go get the owner, this guy who came out with a major chip on his shoulder.  Gave me total attitude.  Gee I'm sorry for bothering you!  Instantly turned off by this place.  Cute patio and outside seating tho.  But I won't go back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "l4u_QOlSCErpHYu6JInpRw"
  },
  "KAioc3QP7ShX_b0jLPEoDA": {
    "date": "2/23/2015",
    "text": "I absolutely love this little restaurant! The crepes are spectacular and so freshly made. The service is tres bien! :) delicious coffee, fresh mimosas and cocktails, and just great ambiance. I hope this restaurant continues to do well and can expand into a larger space. I highly recommend and always leave this restaurant smiling because of the wonderful service and food!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "KuEmun7kYxjo8suC5cjjtg"
  },
  "VnoIPLzTpkI99FqSlCKVAw": {
    "date": "5/17/2014",
    "text": "Great place for crepes, although not as good as the crepe bar.   The chocolate croissant was very good. The French toast amazing. The iced tea very good. However maybe we are more used to the crepe bar's crepes which are much more flavorful and the crepe itself much more light and crispy which my wife and I prefer. Here the crepes are made with buckwheat which may be more authentic but are a but too thick and heavy for the inside ingredients to shine thru like at the crepe bar.   We will be back but for crepes we prefer the crepe bar.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2VOWNrWndTG-og33u5t7hg"
  },
  "DfCKVjFE5-tLAmqBxNd6vw": {
    "date": "8/27/2016",
    "text": "We happened on Chez Vous this a.m. on our way to the Hash House and decided to stop in. What a happy surprise. It's a cute place with dog friendly patio seating. The French owners were attentive and super fun to talk to. The menu is extensive, more than just crepes, but hey, when in Paris...get the crepes. Or croque madam. Quiche Lorraine? I love that they offer a whole quiche if ordered a day ahead. How great would that be for brunch at home? We ordered the Forestier (ham, mushrooms, Swiss cheese and bechamel) and the South West (prosciutto, Sun dried tomatoes, cheese) savory crepes. The thin, warm, chewy buckwheat crepes were amazing. The little side salad was a great side. Perfectly portioned. Too bad we didn't have room for a sweet crepe. Next time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "fmDobR17kQBUmvPWfGh66Q"
  },
  "WGUG95yOvEVN7sisdnZDSg": {
    "date": "9/18/2016",
    "text": "Great food and great atmosphere. The omelette was light and fluffy. The crepes were amazing. All the food was very fresh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "wwGf7jJhEFwfl7ZjDIZupg"
  },
  "MDfCyZ40N67D2olVA8jjdQ": {
    "date": "5/14/2017",
    "text": "I cannot speak to the quality of food nor will I ever at this sore excuse for a restaurant.  I called and emailed this restaurant several days ago to find out if they had anywhere my 89 year old father could sit while waiting for a table on Mother's Day due to no reservations.  No response.  Went there with my family of five a few minutes ago and asked woman (owner?) how long the wait would be...45 minutes.  Started to explain I had emailed to see if anywhere for my dad to sit while we waited.  Male owner loudly snapped at me in front of everyone that they didn't have time to deal with me.  Wow.  Very sad.  Very rude.  We left.  Karma will be yours.  I will write again when I hear your doors have closed forever.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "m8XtHXnkxDsvl0DGccpKPQ"
  },
  "AEDz7NLOIHNBJ9dlYoc9oA": {
    "date": "11/10/2016",
    "text": "I had a good monsieur croque sandwich (pardon my spelling), but the crepe I had was impossible to cut because it was hard. The crepe was not fresh,  it was a big disappointment. I have not gone back in a while.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Io1_oe9nVLk3425wwuaIw"
  },
  "jWOsvV8_7QicVfswryrlcA": {
    "date": "5/11/2016",
    "text": "ok for a one time visit; was not impressed by the buckwheat crepes and the bland flavor.  My wife also had the same opinion with the menu item she selected.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "dZv5rN0OBhtSrKorY7NIUg"
  },
  "WBJ-vjAOwYo10u-p8Ed2Sw": {
    "date": "3/28/2016",
    "text": "AWFUL..MEAN..No Gratitude for your business..No Compassion what so ever..went here with my 18 month old and fiance early on Easter Sunday to beat the rush and have a nice breakfast..ordered 1 crepe and 1 omelette ..40 mins and no food..I decided to walk my toddler around cause of course she was done waiting and she fell and started bleeding so we asked for it to go..the French a-hole owner guy said \"that's why U shouldn't bring babies to his restaurant\" annoyed that we were upset cause we wanted to leave..NEVER GOING HERE AGAIN!!!",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 8,
      "cool": 0
    },
    "photos": [],
    "user_id": "3rh8p3EHoGXTzyIdKBvAOQ"
  },
  "AXLX0t6wNwIPeqiVNXJqCA": {
    "date": "8/31/2016",
    "text": "Plain and simple a wonderful lunch, with a perfectly made Croquet Madam sandwich, a glass of champagne and awesome service.  What a great choice!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "EYBf3v2_Da4E6nMl-c3HXg"
  },
  "LGum3zFo6xOV7Xt9AWB3_A": {
    "date": "5/9/2016",
    "text": "Mother's Day Brunch on the patio. It was lovely. There was a little bit of confusion on being seated, you have to go inside past the tables to register, and it took a while to be served, but they were super busy and the waiter/owner was super apologetic about the wait. He recommended the Mother's Day Special, a crepe filled with shrimp/chicken/zucchini and creamy sauce, my daughter had the Croque Madame. It was really good. Chez Vous a great honest family business. Highly recommend it. Bon Appetit!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "zR1C3UzHrSzgzzX_JF3b7A"
  },
  "HPZBCncTl0ZeT1hK21vLwQ": {
    "date": "1/2/2017",
    "text": "My wife and I ate breakfast here on Dec. 30, 2016.  My wife had the goat cheese quiche with spinach and said it was one of the best quiches that she had ever eaten--very flaky crust and light filling.  I had the Norvegienne (smoked salmon, creme fraiche, dill and I added spinach--absolutely delicious.  For dessert we shared an \"Exotic\" (coconut, melted dark chocolate, and bananas)--delicious, but a bit over the top for us and we probably would order something different the next time.  The buckwheat crepes are a bit thick for my taste; but they were delicious.  Chez Vous is a solid 4+ out of 5.  We will return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GeevUN6zyegsAUeugWS6tw"
  },
  "vMa4u4_HOCg0ABq44ayemA": {
    "date": "8/23/2017",
    "text": "This is my favorite French cafe. Their organic crepe wt home made Bechamel sauce is simply devine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZsInE0yrea0FBMrIJZjFCA"
  },
  "nXv81YVuDSD2jfRVPKtcHQ": {
    "date": "9/13/2017",
    "text": "I have been going to this place since 2013. They have a very small set up and same dishes since then. But the quality of their food is excellent. The place gives you feel of being in France. Even its restrooms are really clean and have French theme. I again visited them in Sep 2017 since I was travelling back to  Phoenix. Again same awesome experience in service and food quality. I really miss my days in Phoenix when I used to be regular at their place for crepes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HsWisfvSLVvcbz1pduEM0Q"
  },
  "5PUm2S6RWhrHwgbPJm7arQ": {
    "date": "9/9/2017",
    "text": "This place is divine. I am absolutely in love with the food here. The Croque Monsieur is so unbelievably delicious that I will literally drive almost 30 minutes just to eat here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H4-vxusdtYXXlw1xVNoH9w"
  },
  "a8vE6ZXHk4H3ogyGdLvEZw": {
    "date": "6/21/2017",
    "text": "What a fantastic place to enjoy a different kind of breakfast. My girlfriend and I enjoyed two breakfast crepes and we both commented how fresh they tasted. I had the ham and swiss but also added prosciutto which made for an amazing crepe. The service was excellent as well, we never had to ask for our coffee and water to be refilled. The only problem I have is I am now slightly addicted to this place and will probably have to return soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rHedOfm9JHi60QORxUmtDQ"
  },
  "Agg-8XjciLaLoFSaBS9h5Q": {
    "date": "11/10/2017",
    "text": "When my husband and I were looking for a nice place to have mimosas and breakfast we stopped in and asked if they did in fact have mimosas... they did we stayed and ordered mimosas and a crepe... upon enjoying the patio and lovely convo.. the owner was rude and not friendly at all.... service was not good, others were asked if they wanted more ice tea... which my husband had and never got a refill!! We left and did not leave a tip as the service and owner attitude was horrible!! As we left the owner flipped my husband the bird!! Totally unacceptable!!",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "1mt4YNMNSZ2hoLKX9DrO9A"
  },
  "T7m8nfQxGh9WpIpcN8IwFg": {
    "date": "11/7/2015",
    "text": "Horrible service; mediocre food. We've eaten here a couple of times, and always find the food is lacking. The crepes lack flavor; despite the interesting fillings on the menu, the crepes themselves are plain and flavorless.  What I find most atrocious however, is the terrible business savvy and customer service of the management at Chez Vous. The Euro trash that run this joke of a restaurant are rude and inconsiderate. Today, while waiting for a table I was accosted not once, but twice by the owners, asking why I was using the restroom. I don't think they knew that I was waiting for a table, but even if I wasn't, I could have been a potential customer, or someone ordering to go and popping in the restroom before placing an order at the counter.   Either way, it's not good business sense to treat any one in your establishment as if they were garbage. The first time was bad enough when the owner asked if he could \"help me\" as I was walking into the restroom and making a snarky comment that I just come into his restaurant to use the restroom. What really tipped me over the edge was that his wife was actually waiting for me when I came out, and asked me as well if she could \"help me\". I informed her that I was indeed waiting for a table, intending to dine, and not just \"randomly entering restaurants to use the facilities.\"  At that point, the owners \"helped me\" immensely by making me realize that Chez Vous is not a restaurant that I will patronize again.",
    "rating": 1,
    "rated": {
      "funny": 6,
      "useful": 20,
      "cool": 1
    },
    "photos": [],
    "user_id": "h_3CYgfZJqI2Evi_AHDelw"
  },
  "2vmfdChm1lCdnh37NUB4ow": {
    "date": "11/12/2014",
    "text": "Amazing staff and incredible food.   I did not have the crepes but I had the Parisian salad and have been craving it again. Best hot cocoa I have had in AZ (only time I have had better was at Serendipity in NYC).  I went there for a private event and they were exceptional.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "O_Lv215HYUkpF12fL_MjOw",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Parisian salad (if you are gluten free, specify no croutons because it is not listed on the menu!)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/O_Lv215HYUkpF12fL_MjOw/o.jpg"
      },
      {
        "img_id": "9wfmBPglHqrn87dRH1ymHg",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. ChezVous Private Event: Bridal Shower",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9wfmBPglHqrn87dRH1ymHg/o.jpg"
      }
    ],
    "user_id": "2Lo6TlTMkyqHYguc7AjHWg"
  },
  "yrWcQ8FMKAYyfS4PkXBCtA": {
    "date": "4/5/2014",
    "text": "Wonderful location, splendid food, extremely fast and VERY attentive service.  This would be an easy 5 star rating in anyone else's book but I hold those for super special ratings.  HIGHLY RECOMMENDED! Our group of 8 arrived after the monthly Cars N Coffee event and as we strolled in we changed our group size from 6 to 8 within minutes yet were warmly greeted and the change was no problem.    The setting was wonderful and beverage orders were quickly taken as we were given options for the daily specials.  I spied the Crepes Tutti Frutti and at $7.25 was pleasantly greeted with a large crepe of abundant fresh blueberries, strawberries, raspberries covered with whip cream and almonds then drizzled with honey.  Sacre bleu!  I will be back - Thank you.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "NKmO3F4IQZmUkEdvYh98Ow",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NKmO3F4IQZmUkEdvYh98Ow/o.jpg"
      },
      {
        "img_id": "_uPTn2df7-akWRnycOzHZw",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_uPTn2df7-akWRnycOzHZw/o.jpg"
      }
    ],
    "user_id": "yaJPtrrvckma2OcUpvcGpA"
  },
  "2tiBEsgjrVlytvxHtQa7Hw": {
    "date": "6/17/2017",
    "text": "First time here, but people are friendly, coffee is good, crepes are AMAZING!if you are in the neighborhood give them a tray for brunch or breakfast. However, the service is very slow, so be ready to wait to order and get your food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2ge_pT0DvJCqWNQO64nQXg"
  },
  "1NvT0vd3GWh-p36FZEdBIQ": {
    "date": "6/24/2017",
    "text": "Sophisticated and clean environment. Attention to plating detail and beautiful presentation. Authentic crepe recipe. Taste is delicious for both savory and sweet crepes. A must go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nmAPzrtQwHdUiYCeRco0zQ",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Beautiful decor",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nmAPzrtQwHdUiYCeRco0zQ/o.jpg"
      }
    ],
    "user_id": "6SbTdzmvuBJcc-BsB6llEA"
  },
  "BfG4HhnU3huFa72vOFCOCA": {
    "date": "3/5/2018",
    "text": "Gorgeous patio, nice & talented staff, and *very* good crepes - would definitely go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zCGoQt3VCVP0iT6WtIeHZA"
  },
  "uBivU-2tNWl9gRj02ax0XA": {
    "date": "2/12/2017",
    "text": "The food was fantastic. My son for breakfast and I had lox on a brioche. Even the ice tea was good.  They were very accommodating.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "3EUJTlKvvFGZ715U8r8iQQ"
  },
  "1nuFexIZnKcR5u1cjRasDQ": {
    "date": "3/15/2017",
    "text": "First time I been  Today is the 03/15/17 I love try new food places  And this place have a great sandwiches  I had the tune sandwich and its was amazinggg! You must to try this place!! Definitely coming back here to try new food",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Dhjf2sxkdMfTRyXrFnK2w"
  },
  "-pd48SaBKtG7N8OD65tJMA": {
    "date": "2/2/2017",
    "text": "Cute little place for brunch. I loved my Nutella crepe. My husband ordered an omelet but was not a fan. It was very nice of them to even let him order the omelet though because it was after breakfast hours. Service was good, they constantly refilled my coffee and had no problem splitting our checks up with our friends. We sat outside because inside was full but it was a great covered patio and they had heating lamps which weren't needed because it was a beautiful day. I would go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "IFpLMCn5zcMxINEiHXs7uQ"
  },
  "ANaLQ-Q-Rk6-DJz2HiYXJA": {
    "date": "4/22/2017",
    "text": "Food and service was great! Great little French cafe. Definitely will be coming back!! They have gluten free crepes too!! Which is awesome and perfect for me with celiac disease! My husband said that it was the best quiche he's ever had.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HzArgPA976WMt8F-uPZg0A"
  },
  "A8HulWayj5UIG1VkDO6-hg": {
    "date": "4/30/2017",
    "text": "Love this place! Frederick and Sophie are always warm and welcoming and the food is fantastic! My favorite is the spinach and goat cheese quiche and my husband tells the owner just to surprise him and he's always happy. This is our weekend go to brunch spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ogvesAcQ7uMB0nfqR3W0iQ"
  },
  "snSr5quu4Svr9YCpPuwN9w": {
    "date": "4/28/2017",
    "text": "Amazing crepes, coffee, and croissants.  I had a croissant with bacon and swiss and it was very filling.  The chocolate crepe was also declious.  In my party of four, everyone enjoyed their meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LZF1LgD3ghBvzcZHGvLcjA"
  },
  "yCkC_JSpFYAoup912cmnTQ": {
    "date": "1/29/2017",
    "text": "I have been looking for some great authentic crepes. I loved the French feel of the restaurant and the crepes were amazing! The staff were very friendly as well. This is definitely a place I will be going to again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "UPtVhClvGKizWkPgHz3fXQ"
  },
  "FjgN0VBs_d6682QUQYvUlg": {
    "date": "9/21/2013",
    "text": "Wow! This place is adorable. The food is sumptuous but light - perfection.   We tried the printemps savory crepe - the cheese was warm and melty, the vegetable were light, the crepe was smooth and thin. Melts in your mouth. Even the croutons in the little side salad were delicious.   We also ordered a chocolate croissant - delicate inside, a little bit crispy outside, amazing chocolate...just wow.  The atmosphere is incredibly cute and French, and the people who own/run it are delightful. We are coming back tomorrow!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "lkNbe92HaQF-gkqGeU0X3A",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Pear and dark chocolate or chestnut cream and dark chocolate - either way, delicious!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lkNbe92HaQF-gkqGeU0X3A/o.jpg"
      },
      {
        "img_id": "SGyBY5H4qjf3K2TwYlCwLA",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Lunch for our anniversary - what a lovely place for a celebration!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SGyBY5H4qjf3K2TwYlCwLA/o.jpg"
      },
      {
        "img_id": "rZroQ638pVD_l7UTTdBuZA",
        "caption": "Photo of Chez Vous - Scottsdale, AZ, United States. Incredible chocolate croissant! Pardon the missing bite on the left - my husband got to it before I could snap the photo.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rZroQ638pVD_l7UTTdBuZA/o.jpg"
      }
    ],
    "user_id": "xR4engcg6Vm8xToBgKI5FA"
  },
  "URwRT-N5rGTp6o-mKdt3zw": {
    "date": "11/11/2015",
    "text": "Our first time... Really special!!! Everything we had (omelettes and crepes) was wonderful!!!  My new favorite place!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gd6JWGneYmfiRXn_TuyyGQ"
  },
  "17sV56OpN3XVVwu-u7jAig": {
    "date": "11/12/2011",
    "text": "After hearing from neighbors that they liked this restaurant we decided to go there for breakfast.   Very nice ambience.   Then, got water and there was hair stuck to it. Had the Lorraine Omelet - not the french eggs I'm used to. The omelet was overcooked and the bacon very overcooked. Otherwise, tasty. Accompanying potatoes very good. Food was only ok and poor value for the money.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "loFTUrqbTAgLYIvSjbBmrw"
  },
  "Epkb149FrFmNk3NETWvx6A": {
    "date": "8/1/2011",
    "text": "Chez vous is delicious! It began with the perfect cup of coffee I had, it was so rich and creamy. Then I had the champagne crepe, and it was heaven! The decor is very lovely. I felt like I had taken a little trip to Paris.  The waiter was very attentive. Couldn't have asked for more. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KWqpqJiyzMKo417SSp2XYA"
  },
  "T13gd6wz4vZsOY05LbVqRw": {
    "date": "10/8/2011",
    "text": "How did I not know this place existed??!?!? I have to admit, my girlfriend turned me on to yelp, I used to make fun of her for checking in to places and always having to consult Yelp before we did ANYTHING, but I totally get it now and am obsessed myself.   I would never have ever indulged in the most delicious crepes just up the road from my work if it weren't for the beautiful thing they call yelp. This little quaint restaurant has outdoor seating and maybe 10 tables inside. It is run by this super sweet french family and their menu is out of this world!!   My gf had the brie crepe that had apples and chicken and I had one with goat cheese and tomatoes and both were soo delish, we actually both let out a food'gasm after our 1st bite :) Ooo and it only gets better, their dessert crepes, how do i choose?! We went for the nutella with strawberries, I wanted another one!   Cant wait to go back....hmm it actually is getting close to breaky time....che vous it is!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xSoodQUHrm9TMG7dwklKoA"
  },
  "Em4rxvFBQ-v2JU-4-bJrPQ": {
    "date": "7/29/2011",
    "text": "Chez Vous is great! It has a pleasant atmosphere and we received excellent service. We ordered two savory crepes (served in delicious buckwheat crepes) and one dessert crepe (served in a buttery, golden brown crepe). All of them were cooked perfectly and tasted wonderful. I will definitely go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NJWaGyyFIl97gx41KT0zbw"
  },
  "CC9g4X7y6GzgcqQFg5oM8Q": {
    "date": "6/6/2012",
    "text": "Great place for a lunch date.  I love the savory crepes as well as the sweet!  Nutella, banana, and strawberry is my favorite. Cute decor.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Un8WyzqAPKaqW4dSK-NBdA"
  },
  "5O2K4qdCPWWfXp3aJpfYog": {
    "date": "8/15/2010",
    "text": "I recently attended the Scottsdale Moms Blog Mom's Night Out that was hosted at Chez Vous - yum!!!!! they served a sampling of sweet and savory crepes.  Everything was great and they did a great job with the huge crowd.  Can't wait to go back and order a meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hLv0UHsogVJP1mWKJ_l8ww"
  },
  "QJkUFcu-Ql2M8LODZclgsQ": {
    "date": "11/27/2012",
    "text": "I have been here twice now. I love it!! Just went on Sunday with my best friend. The atmosphere is fabulous and the food is amazing. The employees are always so helpful and attentive without being annoying, difficult to achieve. I even told my French boss about this place. I am that convinced that she will love it as much as my best friend and I do. A must try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "85iVLtl2YvGL37AGo8PQxA"
  },
  "uRNJIMFXdDh6tdb6FOIBdA": {
    "date": "1/29/2011",
    "text": "Yikes, the spot was soooo cute - and super close to my home. But the  SERVICE was horrible!  The food was good - but I assume it was the owners day to wait on tables?  She needs to stay in the back!  Wait, this place is super tiny...maybe there is not a back area! She rushed us to order.  Worse part was she tapped her finger on our check and said, \"can we settled up?\"  I guess she was in a hurry to count her \"winnings\" for the day? I have NEVER been treated in such a way before.  My associate said he had been there before and stated, I should have warned you, while the food is good, the service is really bad!  Yikes, I won't be back - unless the Southern Belle who served us disappears! The other staff (a cute guy who appeared to be a barista) was smiley and nice - wished he had waited on us!  Mind you, all the while we were being rushed, there was clearly no wait for our table!  As we parted - I looked back and notice all three staff people huddled around the cash drawer with there days tickets - people, get an office!  While, in this crazy business market - I get you need to make money, but while your place is open, focus on good customer service - and trust me, your business with thrive!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "kiles73Q8nqTUZMmfjtBpQ"
  },
  "e2MopRqrdeStq-uQysO0tQ": {
    "date": "6/8/2012",
    "text": "Always delicious. I usually have the pear and dark chocolate crepe, but the lemon meringue pie and creme brulee are great too! The owners Richard and Isabelle are so welcoming and friendly. We work near by and always take friends, family and work realated people too. A charming place, highly reccomended!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tm2Srk3D5ADGMHT2xl9FSw"
  },
  "iTZD7S2dG_u_DZaNsKHUng": {
    "date": "12/28/2010",
    "text": "Stopped in at Chez Vous last week with hubby and son. A lovely place with a definite french feel to the decor. The owner, Isabelle Horvath, is charming and makes everyone feel at home. We had Kir Royales to start which were lovely. Hubby and I ordered Savory Crepes- I had the Roasted Chicken Bress with melted swiss and chive and hubby had the Campage- potato, swiss and prosciutto.  They are made from a large organic buckwheat crepe which was very different in color for AMerican palates. It also did not have the consistency of a traditional crepe but the flavor was good. I would suggest giving people the option of what type of crepe they would like and it would help with some of the other Yelpers' dislike of the buckwheat crepe. I liked it but had had something similar in Paris.Our son had the Tutti Frutti which looked divine- traditional crepes filled with strawberries, banana and blueberries and topped with toasted almonds. It was light, airy and wonderful.We had the Creme Brulee for dessert and it was delish (and I am not a dessert eater). A few menu tweaks (a dressing option other than balsamic or ceasar- maybe a champage vinagrette) and a chance to choose crepes will make this a favorite spot!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "3WPLPXt0-N0wyvHpkM3Vhw"
  },
  "qIuF-VIGeo25jDXFQ5rtbg": {
    "date": "2/14/2012",
    "text": "A lovely spot with a pianist Sunday mornings! Good service, a broad array of French items beyond crepes, including omelettes and quiches, even a glass of wine!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SyXdoIsdIBcpocgll3OIcQ"
  },
  "B81blEhPEcekP3x0Xxw3wQ": {
    "date": "1/12/2011",
    "text": "Can't comment on the food, it takes forever to come out.  The owner was sooo rude and reeked so badly of cigarettes that we left.  You may want to try it quickly as I dont suspect this place will make it.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PkKY4X1WOFNucUKv0SFmOQ"
  },
  "ZmnfJN0a8l3WzBSW2Idtig": {
    "date": "7/13/2011",
    "text": "We have been here several times for breakfast. If you love crepes, croissants, and typical French hospitality (always unpredictable)  this is the place to go. As we expect with any real French restaurant, the service was very leisurely paced. Our early morning butter croissants were light, warm and crisp. The cheese crepes well cooked and crisp too. Coffee was good and strong. One morning our server (the owner?) even played the piano for us!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ndh4EowXB598zpFbudbRtw"
  },
  "Lr2zOlT3CQzHmGzbjGwa5g": {
    "date": "2/5/2011",
    "text": "This Little Restaurant is absolutely Wonderful. Try it and you will be back again and again. The Salads are Fresh as is everything on the menu including the sandwiches and Crepes. Prices are extremely reasonable and the Owners and service are as nice as can be.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bU9PIg6_keBBlaqTlWhsIA"
  },
  "kYNVNawPNfJ6fz3vDBYTxA": {
    "date": "8/16/2010",
    "text": "i grew up thinking a crepe was golden brown in color, this one was purple or grey,  i'm not quite sure.  The chicken with swiss cheese was just alright, i certainly wouldn't rush back.  It is a very cute place, all the appointments were great, maybe they need to practice the cooking.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gsxo4hlXIL5Y505XWCW2lQ"
  }
}