{
  "p4v_OZFqaaj7WfIrREUgiA": {
    "date": "8/23/2015",
    "text": "Food was delicious and was great serving sizes.  Only complaint was that they did not bother to tell me my order was ready, after they told me to wait at the counter.... and after the promise they would tell me when it was ready... it went to the front while we both (me and the food) waited twenty more minutes at separate counters ...  I'm sure it was an anomaly :)~",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1xEpRT7ASF8CBdbd0YXAEQ"
  },
  "bxmhmqSiuWzIK5TTi7S73w": {
    "date": "10/24/2015",
    "text": "The ancient grain pancakes are crazy delicious. CRAZY. DELICIOUS. CRAZY.. I'm not sure if it is fair for me to say that though, since they were the first pancakes I have had in a very very very long time, and I had them with real maple syrup, which is good on just about anything. Oh well, I guess I will have to try them again just to be sure... The rest of the food was ok. The bacon looks very soggy and limp, wouldn't order that if you're into bacon. The vegetables were previously frozen I'm pretty sure. Everything else was pretty much what you'd expect, good enough but nothing fancy.  As for the service, it was prompt and relatively professional, and I was given everything I asked for, but I can't say I felt 100% welcome. Never before have I been asked to close out a check while I was still in the middle of eating. I might have understood if the guy's shift was ending, or the restaurant was about to close, or if they wanted me to hurry up and leave because they needed the table. However, none of these things were True. Did they think I was going to hop into my Lexus and split without paying that tiny check? I don't get it? Additionally, the server addressed me as ma'am every single time he came over to my table. I don't know anyone who appreciates being called ma'am. It's quite rude. Even grandmas prefer to be called miss. Also, When I first walked in, the host asked, \"can I help you?\" which I thought was odd. Yeah, obviously I want to eat..wtf.. this is a restaurant isn't it? Don't hosts usually ask \"how many?\" or something like this? Did I look like I didn't belong there? I don't understand. Very strange experience, service wise.  Prices are extremely reasonable. For all the things I got, my bill was super cheap.  The restroom is good.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "K0-YFeC4QiSHg2-RbiwyHg"
  },
  "UE0W64LKZgM19Jlb-lig_A": {
    "date": "8/17/2014",
    "text": "First visit for breakfast today and our server was great. The food was mediocre.  I loved the multigrain pancake, bacon & egg whites.  Husband had a green chile omelette (cold) with hash browns (very cold) and biscuits and gravy.   No reason to really return...   Coffee was very good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "771OWzbzelsEeSlx8QsfsQ"
  },
  "i4yjX5wUYV4DbWWHoMdIxQ": {
    "date": "5/29/2014",
    "text": "Good neighborhood restaurant with homestyle food. I particularly love the fish and chips. It's hard to get that anywhere these days. Love the giant cups of soda the give you with the crushed ice.  Servers and staff are friendly (but see below). The time between ordering and getting your food is good.  I would have given it 5 stars except for the fact that they need to work on the attentiveness of their servers. It's hit or miss and the servers don't always come back to check on you enough. I know it's a fine line between not enough service and too much. I think Ranch House is tipping toward the not enough side. I want to emphasize though that servers are very friendly with a great attitude.  Overall, great neighborhood feel. Glad to support a local business. I'll be going back!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "rxk524nowsOUvVuY_AsjaA"
  },
  "ciDw82pxqgBV_5vBM4w6nw": {
    "date": "6/26/2016",
    "text": "Great fast service, and the food was delicious. Our server was Maria and she was super friendly and attentive. Definitely would come back to this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lpyBmzXtVEc9aoovGQfwCQ"
  },
  "6gY_K1GyR0B0KhfBmf8KDg": {
    "date": "5/13/2016",
    "text": "The food is delicious.  We had the green chile chicken fried steak, which was to die for.  The pancakes are not to be missed.  The food is always prepared perfectly and the service is fantastic.  We drive all the way from New River to eat here.  Love it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5_t2-fcePMgUHad82utQnA"
  },
  "44VsMH6rcLYDXKBSGNZUyQ": {
    "date": "9/6/2014",
    "text": "Yummy!!  Will be back!  Had hot roast beef sandwiches  with mashed potatoes.  Honey, great service and delicious!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wxX-dWipx_MmOKTF06Tvew"
  },
  "ALEkYNLv1u7WohyHzhO7-Q": {
    "date": "1/7/2016",
    "text": "Really good place for a heavy breakfast or lunch. Portions are very generous. The atomic burger was amazing as well as the chicken fried steak with their special green chilies! Wish they served alcohol!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K3FB2yrb7pHs7D6-MVlkDg"
  },
  "4UOpNYp-KpFY0zW9E32mYQ": {
    "date": "12/21/2015",
    "text": "Makes me sad to say, but I can't bring myself to order there again... Even though the French toast might have been yummy. They delivered it with no syrup.  I had none at home so, I called and they said they would bring some. I had tipped the driver $5, so I was hopeful. He did return, but with packets of peanut butter?!?!  After this review, the owner promptly responded and was very kind with his offering.  I told him, even reheated, his toast was amazing!  I'll be back.  Thanks for taking care of your patrons!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "W8KGJ_QbwuPltJ6eTu9uAA"
  },
  "pPSTGmwE7xx7gY5Zw26IGg": {
    "date": "11/3/2015",
    "text": "We prefer the Ranch House Grill to the big chain stores as it has the feel of a family run business, and it's close.  The fare is simple, fresh and delicious.  The wait staff os friendly and attentive.  The patio is dog friendly.  Nothing not to like!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JOrraHp_ohZ0btmHWoVOvQ"
  },
  "AlSuPUmzISqKf3EF96Vkpw": {
    "date": "4/28/2016",
    "text": "I went her with a colleague. Everyone at work raved about it being so delicious. I wasn't impressed. I had the Light Southwest Chicken Fried Steak Smothered in the famous pork chili verde with 1 egg, small hash browns. I paid a $1 more for the biscuit and gravy instead of toast. The chili was good, but not fabulous. The chicken fried steak was tough and chewy. My favorite chicken fried steak is from Texaz Grill and this place didn't compare. And, the service wasn't that great either and it wasn't that crowded during lunch on a weekday. Overall, I'm glad I tried it. Maybe if I go back next time, I'll try something different.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h10dyxQY4nZo4L6BXaZ3Qg"
  },
  "0OFQKktabOqklJq_ckpS1A": {
    "date": "4/11/2016",
    "text": "What a pleasant surprise.   Great menu.  Great food.  This is exactly the type of old style breakfast joint that I love.  And ANY restaurant that has Loco Moco on the menu and does it well gets 5 stars from me.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RKfrLs9os5x6U-PNgawzFA"
  },
  "79V4g24lFh-zey8BAhpm9g": {
    "date": "5/14/2015",
    "text": "stopped by for early lunch and decided to go with late breakfast instead - after a long agonizing review of the menu - a lot of seriously good-looking choices.  Ordered the huevos rancheros and when it was delivered by my very friendly server, I just stared at it,,,,,,,,,, almost overflowing platter of gorgeous goodness:  tortillas, perfect over-easy eggs, hash browns, excellent beans, rice, and an incredibly yummy  green chile pork sauce.  I settled in and slowly savored every delicious bite.  Then I saw my neighbor get a biscuit, and it looked so good, I ordered one too; and Damn that is better that Grandma used to make - whole different kind of flour, with great texture and flavor. As I was getting ready to leave, I saw her plating some peach cobbler, and figured that since the biscuit was so good, the cobbler had to be good too, so I got one to go.  It was really good later that night. I live in the neighborhood, and love it even more now that I know what an excellent restaurant sits right there. I'll be back.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "fJQh95jx1v8AulFxS1TKFQ"
  },
  "pi0Gcm3fZWpm31cxkS4iBw": {
    "date": "1/10/2017",
    "text": "we had brunch here and it was delicious. better still, it was a short distance from where we live. would recommend this place, even though parking can get tricky if this is your first visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UlAuvYbk4xJZKls0warTyA"
  },
  "V0PCHI-MhyZbe3OY-zspCA": {
    "date": "8/24/2015",
    "text": "An absolute train wreck. After watching my buddy completely finish his meal I then started to question where mine was. When I was told the chef was working on it, I knew it was time to pick up and leave. I honestly do not get how restaurants can still survive in an age where people like me can immediately pick up their phones and place a review, negative or positive, in an instant.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eUpfvPufEHIZ2BgpKbupqw"
  },
  "LETPilOZkREAkn3EHpKqHQ": {
    "date": "3/15/2013",
    "text": "Huge portions, great service, clean, confortable surroundings all welcomed me today to the Ranch House Grille.     I ordered the chicken fried steak with Homemade Pork Chili Verde $10.  Normally I would never in a million years order this, as I have stopped ordering chicken fried steak years ago because nobody makes it right.  After being talked into trying it, it arrived on my table and OMG, it is the BEST!  Tender, crispy steak with a perfect Chili Verde.  The breakfast also came with 2 eggs and a huge portion of hash browns.    Definately recomended.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "iT9-cHTEkzUmb85Evy7xcg"
  },
  "ZrYFv6zg2AgvSegILUJEcA": {
    "date": "4/18/2016",
    "text": "This place is a neighborhood gem. It's a greasy spoon on steroids. It's always busy, at least when I'm there, and the waitstaff are working triple time to keep customers happy. I've been there several times now and I have never been disappointed with the food. Go early for brunch on the weekends bc there tends to be a wait.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9DCBzMawCAlU5zjK3YzbfA"
  },
  "HrKslJGpmD-GbiC_d_5N3A": {
    "date": "7/27/2013",
    "text": "I went here for breakfast a few days ago with my mom and sister.  My mom had been wanting to try it for some time. It's a nice place, very open floor plan, with Native American art pieces hanging on the wall.  It's a seat your self kind of place.  The food was good. They serve the usual breakfast items. Our waitress was really nice. But the service was slow.   The place was about half full, so maybe that had something to do with it. I believe I just saw the one waitress going around to everyone.   I liked it! I'll come back for sure!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PufQ0bMCOGdgyAnfnCdMxg"
  },
  "eb6vNx6TzoCpJgnDJLGEAw": {
    "date": "1/14/2017",
    "text": "We eat there a lest once a week. I usually have the southwest Chicken fry and it is delicious   One of best breakfast  in town",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-yWW1a8amR0Bd7BaAj3hOg"
  },
  "wBFIhdJOUi-4_05vb97jVQ": {
    "date": "1/14/2016",
    "text": "Was recommended by a co-worker and I absolutely love it. There is a huge selection of menu items to choose from. I have tried the green chili,country fried steak and several of the burgers, I have never had an issue. They have an outside patio that is just lovely when the weather is right. I recommend everyone try this at least once.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E0KoeSFSDCzSf18V5X3I4w"
  },
  "4jscAykFJz5PR1lpqBw1Pw": {
    "date": "9/7/2015",
    "text": "Wanted a nice Labor Day brunch, and figured Ranch House Grille would work! The wait wasn't too long, and we were seated fairly quickly.  The food, as always, was delish! I had the Atomic Burger - spicy, but not 'over the top' hot. It was very flavorful though, and I would order it again.  Unusual for this place, our server was quite distracted. It began when she tried to give us another table's food. And she didn't check on us very much, and forgot to bring an extra plate as requested, so we could share.   Still, we had our food fairly quickly and everyone was happy with their meals.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "7Ar91OEmBQrsWe0vHLUDgw",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Atomic Burger - spicy, but not &amp;#39;over the top&amp;#39;.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7Ar91OEmBQrsWe0vHLUDgw/o.jpg"
      },
      {
        "img_id": "P9Lrmt72_eM2GPTS5oQtQA",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/P9Lrmt72_eM2GPTS5oQtQA/o.jpg"
      },
      {
        "img_id": "JGYuh8FBpqmx7uHaG9v-pw",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Red Chile Omelette with biscuit and gravy in the side.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JGYuh8FBpqmx7uHaG9v-pw/o.jpg"
      }
    ],
    "user_id": "e0pVHbAZE3B_iwRenLfImA"
  },
  "I0681woxbPLwQHnRLcNmJQ": {
    "date": "3/19/2017",
    "text": "The chicken friend steak with the pork child verde was great. I wasn't impressed with the mushy hash browns though.  I also tried the Belgium waffle \"aloha style\" and it was great. Nice diner food and overall good atmosphere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZSB_9FmKPHkGCcVP4fUG1A"
  },
  "YPoU7C85hXGuY0Em9Lb8Mw": {
    "date": "3/19/2017",
    "text": "Food always fresh and delicious, staff very efficient and friendly, only drawback is they do not serve grits",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cLZ1LtNExPG0ztzd68LT_A",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cLZ1LtNExPG0ztzd68LT_A/o.jpg"
      }
    ],
    "user_id": "tdPJ8RotPh1hJBBEs0RYKg"
  },
  "Fro61YG5I362mEhGPi3rsA": {
    "date": "11/2/2015",
    "text": "This place was OK. I was not really impressed. Breakfast for 2 came to over $27.00, a little over priced in my opinion.  My wife had a Grilled Chicken wrap and the meat was burnt. The waiter ageed. He apologized and didn't charge me for it - took off bill. Arnold Palmer was watered down.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "m6l4o5ix2whDEjWt3lfvIg",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/m6l4o5ix2whDEjWt3lfvIg/o.jpg"
      }
    ],
    "user_id": "Dpdh_IGRnq6X_FOh34in-w"
  },
  "jgmKASv-1pFW7nRAyMUtcg": {
    "date": "4/19/2015",
    "text": "This is a long awaited and deserved review. I've been to coming to Ranch House Grille for awhile now and have loved it since the beginning. They offer all your breakfast essentials and more. I love how all the dishes are traditional but have a little something extra.  My absolute favorite thing is the breakfast biscuits- fresh biscuits topped with sausage patties and gravy topped with eggs over medium. Everything I've tried is great but I'm a sucker for biscuits and gravy. They have all the traditional comfort food (eggs, pancakes, waffles) to the southwest style burritos. The menu is big but not too big!  This place is a total hidden gem! It's off the beaten path which is another reason why I love it. Come check it out, they also do a great lunch and carry out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "uP5LpFmvm5F4V3l3fc-FkA",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Delicious",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uP5LpFmvm5F4V3l3fc-FkA/o.jpg"
      }
    ],
    "user_id": "qvat0m7wArVfWVJ8l0DYjw"
  },
  "ORrmYY_dFION6UKRiEcALA": {
    "date": "6/3/2018",
    "text": "This is our go to morning drop off at the airport place.  Excellent breakfasts.  Service is always right.  Tip, park in back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cNO-iv0SlxqUjZjs2MR1Tw"
  },
  "uIHrXZVZh5r9aKHSwcFm4w": {
    "date": "3/20/2015",
    "text": "I really enjoy the Arcadia area and its many little hidden patio dining spots. Ranch House Grille is a family home breakfast/lunch eatery that serves up Southwestern-style comfort food. It's in a nice location with a great shaded patio area. I found the staff warm and welcoming. The food wasn't bad (about 4 out of 5) and the portion sizes were great. I ordered the Chicken Fried Steak and Eggs and enjoyed a quiet morning here. I would for sure stop in again.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "ieD34ItDuLOLiRMdbC7KZg",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. The Original Chicken Fried Steak &amp;amp; Eggs",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ieD34ItDuLOLiRMdbC7KZg/o.jpg"
      },
      {
        "img_id": "prjattuvljVR-4e1adh2vw",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/prjattuvljVR-4e1adh2vw/o.jpg"
      },
      {
        "img_id": "8uMIXAnRTdK4JM5ZVs5PPA",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8uMIXAnRTdK4JM5ZVs5PPA/o.jpg"
      }
    ],
    "user_id": "XPZVfP7DQCSL3Nb9t2vxsA"
  },
  "CXmqSUhTE6xXp6H2pPBzIg": {
    "date": "1/5/2018",
    "text": "I always order the chicken fried steak. The clam chowder is like nowhere else.  The hours open are short. But take the effort to try :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ftTu-zHEzdSVJ20IAblb-Q"
  },
  "4hLb4SC5Ztc_QqzRpPs7cw": {
    "date": "11/4/2016",
    "text": "Very trendy place, as this was once a drive-through liquor store back in the day. I like what they've done with the place. I came in for brunch with my siblings and they weren't too busy on a Thursday at around 11am. They had a nice menu, and we sat outside, which was nicely shaded. The food took a bit longer than I had hoped to get out, and the waitress was a bit slow. The food was decent for the price, and I'd probably be back. One thing to note is that they're only open for breakfast and lunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JLxUtiOW_jPxvhyn4hHP0Q",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Turkey avocado wrap",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JLxUtiOW_jPxvhyn4hHP0Q/o.jpg"
      }
    ],
    "user_id": "kztwOpP0SW7JztPSYFMsBw"
  },
  "BgqH3DgQKRminu2eLdzRXQ": {
    "date": "11/22/2017",
    "text": "Most disappointing restaurant experience in a while. Ordered crepes with blueberries and bananas which had a gooey sweet white filling inside that was inedible. Played tug of war with waitress when she tried to yank plate out of my hand as I was scraping off untouched fruit. She took it back to kitchen where she loudly complained about me. I could hear every word & told her so. Completely unprofessional! New plate without white glop much better. Waitress did deliver bill but did not speak to us for remainder of time. Will not ever go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XEQSLkKEmj_oX9PfrWlQhw"
  },
  "OH-u7jdd5xXjtPg1CSkmFg": {
    "date": "11/16/2015",
    "text": "I love little diners like this! I come from the east coast where these are everywhere. You don't come across them too often in Scottsdale! Food was really good but it's pricey for breakfast food. I will definitely be back though!  I had a basic breakfast, sub egg whites and it was $9. My boyfriend had an omelet and it was $13.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "b2XY7LiGYrgqEucdonpEVg",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Basic breakfast, sub egg whites. Heinz ketchup holds a special place in my heart",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/b2XY7LiGYrgqEucdonpEVg/o.jpg"
      }
    ],
    "user_id": "Vd84P1O_aui6-BAElpZk6A"
  },
  "Uzty-Y3X1UvHKOMnuaiSOw": {
    "date": "12/10/2017",
    "text": "I'm not exactly sure how long I've been coming here, it's at least a year, I was searching for a place that had good steak and eggs. I forget what search I used, but Ranch house grill was in the top 3 and for good reason. The order comes in 16oz or 8oz and it's cooked over a open flame, and comes with 3 eggs hash browns and choice of bread, it's amazing. I encourage people to not take my word for it and come try it, you'll become hooked like me. It's not standard cooking, it's very home like, the only disappointment I would have is that they're not open for dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yNibXUqB4xT5jlJrmS4YsQ"
  },
  "BXvHVxpoaFGp5qwkEz1vpg": {
    "date": "3/28/2015",
    "text": "Loved this local place that is homey and warm with a nice indoor area as well as an outside area that appears dog friendly! Yes!  We had a great breakfast. We love breakfast!  While the potatoes Could use more seasoning everything else was great. Will have to go back and try some other items on menu but this place is a keeper!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "6Nk8WX1STMTEuKjmRlrh6A"
  },
  "sDVaStm7Mn0Rnw4lO6zhJA": {
    "date": "12/28/2017",
    "text": "Ranch house is amazing!!! Nothing better than home style breakfast, I love getting the corned beef and hash it's amazing. Plus the atmosphere is so friendly and warming. The staff is also super friendly and welcoming. I recommend to anyone!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LoJbpNmCKV2d7pZfD2QpMg"
  },
  "J7qJvYHnNcpqbH8A33aoEA": {
    "date": "3/2/2015",
    "text": "I have been coming to the ranch house for years. they specialize in breakfast and lunch. They do not serve dinner. Breakfast is what I know them for.   It's a southwestern menu with lots of healthy options. A meal with coffee is going to run about $12 but it'll fill you up. I've only seen a wait line on a Sunday and normally you can seat yourself and get served quickly and friendly. The staff are great and quick to fill your water or coffee.   Try adding pork verde chili on your eggs. I found that option only recently and will make it \"my usual\" going forward.   Everything is fresh and highly awarded by food critics. You will be in agreement.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "r6JowTVHxa9yUMn2GPmtbg",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Turkey sausage with eggs smothered in pork verde chili. Yummy",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/r6JowTVHxa9yUMn2GPmtbg/o.jpg"
      },
      {
        "img_id": "mO4AarAD5a07kErvZAusdg",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Turkey sausage with eggs",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mO4AarAD5a07kErvZAusdg/o.jpg"
      }
    ],
    "user_id": "5XnTaWyjgwVVohu7WubwNw"
  },
  "ORXCbEodUn5iqvX8edb32A": {
    "date": "5/14/2018",
    "text": "My husband and I are from Cali and I went online to find the best breakfast in Phoenix, wasn't sure if we wanted to travel 30 minutes to eat, but it was well worth the travel. The food was excellent, we even had a side of the green chili and poured it over the fried chicken. The service was also excellent. We'll definitely be back next time we're in Phoenix",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pIzghSKm6DaTW_F2q6goQQ"
  },
  "Na0YYJ_2DGkmbNH9RvCO4w": {
    "date": "2/19/2017",
    "text": "I usually like this restaurant. Decent food. Warm friendly atmosphere. Good prices. Huge portions. But I was very disappointed in their $20.00 whole cobbler. I feel anyone can make a cobbler. I also believed if you had to order a cobbler and wait several days for it--it would be spectacular. It was gross. It had a hard 3+inch dried cracker crust with 1/8 inch peach jam in the middle.  The dried crust on top sounded like a countertop when thumped. On top of that was slightly burned oatmeal topping. Never get this!!  Never!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MyJLrvaV0yBIIhL-DuYJow",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MyJLrvaV0yBIIhL-DuYJow/o.jpg"
      },
      {
        "img_id": "l_Z_iwExaOyN-KUAuxJDqw",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/l_Z_iwExaOyN-KUAuxJDqw/o.jpg"
      }
    ],
    "user_id": "wP9HgY4g03jzn-xyz6WB-g"
  },
  "rZa4W2Ep-Vme27FqQacqkA": {
    "date": "3/11/2015",
    "text": "SOUTHWEST CHICKEN FRIED STEAK. Holy COW. This is a rainbow, a kaleidoscope of flavors. Wowzers. I only wish I had two stomachs, because I'd switch to the second tank and order the same thing again...right then and there.  My advice?  COME HERE...soon, now, anytime.  Just come here.  I will dream about this dish. I will wake up in the middle of the night after having dreamt about it and be sad that I am in California with no reasonable way to get a fix.  Do not suffer my fate.  Go to Ranch House Grille.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pwiuWlPZsVAwVqNlSiQaOA",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pwiuWlPZsVAwVqNlSiQaOA/o.jpg"
      },
      {
        "img_id": "IgvSIMqprs3UEE3YNeDjYg",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IgvSIMqprs3UEE3YNeDjYg/o.jpg"
      },
      {
        "img_id": "AWffqwfx9C8vuDpSyOZqOg",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Biscuit and Gravy",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AWffqwfx9C8vuDpSyOZqOg/o.jpg"
      }
    ],
    "user_id": "RhoUvLtOpakWGHt5WQKEiw"
  },
  "5M3mWe0TM0ldEop6eEY31w": {
    "date": "8/2/2014",
    "text": "After a bit of running around this morning and afternoon, we stopped in here for a later lunch and were seated right away. I liked the laid back feel of it, sort of like someone's living room with a lot more seating options.   Our waitress was over worked, being the only one to wait tables and during our visit she began to seem more and more over whelmed. I felt bad for her. I'm sure with better staffing she's be a stellar waitress. She apologized profusely when she had to come back and let me know that they were our of roast beef. I'm flexible though so I went with the avocado burger medium rare which was sooo goooood.   The food came quickly and everyone was happy with their food. I'd like to come back another day and hopefully there will be better staffing.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 5,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "08bLSa6bXT2xYwX0OJQsKw",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Avocado Burger. All the yum.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/08bLSa6bXT2xYwX0OJQsKw/o.jpg"
      }
    ],
    "user_id": "DIZ2I8nLKq8M8aTIB8_RJw"
  },
  "BMt4EftSKB_euJojD52Qog": {
    "date": "4/4/2018",
    "text": "Stopped by for a late lunch. Was told the kitchen closed at 1:45 pm. However the website, ads, and door sign states they are open till 2:00 pm. It was 1:47 pm when i was told this. Guess they're not into customer service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "naMi8AVwi9QA6mgEyy56aw"
  },
  "3UOqzj8hilXIs0CI2VGk0w": {
    "date": "3/9/2008",
    "text": "In my suicidal quest to find a chicken fried steak equal to the one I had outside of Houston, I insisted to Hubby that we try the Ranch House Grille today, on the NE corner of Thomas and 56th street, across from the Walgreens. It's open from 6am-3pm only, and when we arrived at 2:00, there were few other customers. It's pretty homey (if home is Oklahoma) and casual, with around 15 tables inside and several outside.  I ordered the CFS, and it was quite good, very tender with a white sausage gravy on top. The rest of the meal ranged from mediocre (mashed boxed taters and Texas toast) to awful (the vegetable mix that was just this side of baby food soft).  Hubby had a better meal overall- an egg burrito with some truly delicious homemade pork chili verde sauce, paired with crispy but not greasy shredded hash browns. They needed some seasoning, but were nowhere near the disaster that was the biscuits. Something was just wrong with them, besides being pale and puckish- too much baking powder, maybe?   I think there are some tasty gems on the menu, but you may have to wade through a few sub-par items to suss them out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "NjLRgbRZiwEIMpAgXypJtw"
  },
  "IAVDyTuwXwt7Jqrs8S5AWw": {
    "date": "12/5/2010",
    "text": "Service was a tad sketchy. Had to ask a few times for coffee. Maybe he was in the weeds. But wondered if we just didn't look like decent tippers. That would be a shame. I've always enjoyed the food here though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ed20VafL85uOo3FXFD1Ukg"
  },
  "bdWANMUcPyM8Avb9o7YcLA": {
    "date": "4/27/2009",
    "text": "Really a cute place.  I loved patio area and thought the service was great.  Big giant Oreganos-sized soda cups kept me happy and the crowd was a great mix of people.  Also, there was no wait on a Saturday morning which is a good thing since we drove by Over Easy and there was a small mob standing outside.  As far as the food goes, it was okay.  On par with Denny's or IHOP, I guess.  The hashedbrowns were overly hashed and turned to mashed.  The breakfast sandwich I had was pretty tasty but was only saved by the massive amount of cheese on it.    I might got back but there are so many other options.  I give it four stars simply because no wait, food is adequate, and the service is excellent.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-RhRXVW9z9fs5zzxhFfnHg"
  },
  "U-ADyOrKRpH3w4uTiT_dsw": {
    "date": "1/12/2014",
    "text": "Hello, we love your place but was wondering why you do not serve the minced bacon or minced ham on your menu any more? It is the best ever! Please bring it back!!! Thank you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ah9Yefofbpe0_i61nTMpvg"
  },
  "4wHR54qSG73dVf_s5O-6pQ": {
    "date": "2/19/2015",
    "text": "My mom and I ordered this one morning for breakfast while we were at her office! It was absolutely delicious they delivered it and it was still hot by the time we got it. I had the biscuits and gravy and it was fantastic! The biscuits are fluffy and delicious and humongous, while the gravy is peppery and savory.  Definitely recommend to anyone who's looking for a good breakfast!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VnNos201x7JntskXNFytPw"
  },
  "FKoKAA_tmhs0yt5XEN51-Q": {
    "date": "11/27/2010",
    "text": "Hope these guys open back up soon! LOVE their chicken fried steak and eggs!!! Miss their super friendly staff to start the weekend mornings off! If you like affordable, delicious home-style breakfast, this is your place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kPJPSyaduH6xYeitNZ17QA"
  },
  "H4mh9oQQx5cfqP2NFPW4Jg": {
    "date": "11/17/2014",
    "text": "I had been here once before and tried the CF steak w/eggs, it was very good but nothing I got too excited about. This weekend we went again and I decided to try the belgium waffle with candied pecans inside and sliced banana on top, it was the best damn waffle I've ever had in my life! Can't wait to go back and have it again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B4FbS1NXltJMwoPmMNTBtQ"
  },
  "89E3lGAIfeWIAxLY2csMdw": {
    "date": "2/28/2010",
    "text": "This is a nice local breakfast and lunch place with a southwestern style theme. Eating here makes you feel like your in a small town with very friendly service and hearty food. I ordered the Southwestern style country fried steak which comes covered in their chili verde sauce (doesn't look like much but very good) and upgraded to the biscuits and gravy ( good gravy, ok biscuits).  My only complaint was the hasbrowns were undercooked and mushy. I will order them extra crispy next time.   The others at my table got the huevos reancheros which wasn't that good and the Lumberjack which included eggs and three breakfast meats, all which looked good.   Consensus was large portions, decent food, and a nice comfortable place with good service. Check it out if your in the neighborhood.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m0Y9cnGMwIuqxQq92Z0YCQ"
  },
  "FuhmsOSqz0Zps3inju_S0w": {
    "date": "11/22/2014",
    "text": "I ordered a to go chicken tortilla soup. It was $6 which I thought was a little much for a bowl of soup. I did not think it was a difficult order especially since it was the only soup listed. When I opened the bag back at work, it was a bacon potato clam chowder?? Not a fan of clams or bacon so I was not a fan of the soup.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VLeaPTFoT6R_WYmgbQBSCA"
  },
  "VB9MVr_Ct2uI-g9FwzxeCw": {
    "date": "7/15/2012",
    "text": "Ok the price for 2 for breakfast was over $27.00 without tip. The eggs were not cooked correctly runny when should have been firm. The chicken fried steak was ok not great. Biscuits doughy in the middle. Sausage grave just ok. Will not be going back anytime soon. The service was ok but the food was not really great.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fMP7FvnrWB5s3q2F_qc0Bw"
  },
  "vSsbMZD5NgsTv3TTI4Otag": {
    "date": "4/20/2009",
    "text": "Broke out of the hood to go to Ranch House Grill. Wow, down home service,  comfortable patio - with a view, and awesome Eats. Breakfast burritos really hit the mark. Good beans, as a side option. Coffee kicks.  One small note by the Beau: gravy for the biscuits was a bit salty.  Overall, great option for breakfast with good value and satisfying food. Go with an appetite!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3h3qmd0qgTA_-hnlcCodFw"
  },
  "VwCLnjbAoUmMrOeGRKqhXA": {
    "date": "8/6/2014",
    "text": "Been coming here at least once a week for a year or more.  Food is always good.  Wait staff is always friendly.  Chicken fried steak and eggs are the best.  Good food, good value!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BJqtwSx9lvq4DRZLmvWF5A"
  },
  "FfggKDRevST3hb75xnp2fQ": {
    "date": "12/22/2013",
    "text": "Ate here for breakfast this morning! Nick was our outstanding server, make sure to request him!! Food was delicious and fresh. My husband had the southwest chicken fried steak, very original and tasty. I enjoyed eating the cinnamon raisin French toast. The restaurant was packed, but no wait. Nick went out of his way to please our two year old!!! Great family restaurant!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4vgmt4xLD_cvKGyfCWpJwQ"
  },
  "Al81YHy5ss3KEhCgvcnWbQ": {
    "date": "6/10/2012",
    "text": "They are \"known for\" the Chicken Fried Steak.  I ordered the overly expensive dish hoping for the best.  What I got was pre-breaded frozen item with packet gravy.  Really? The soda is $2.50 the most expensive I have ever paid.  When I  got to the register to pay for what was already the most expensive packaged breakfast I ever had the clerk recalculated the bill and said it was now higher.  Really? $32 for a breakfast for two.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "_5nPYIpqyi9s0t4F0YIelw"
  },
  "EDut2M4dVRkLSF6yL6wcCQ": {
    "date": "12/13/2013",
    "text": "I've eaten here several times but recently have been taking advantage of their evening menu on Thursday-Saturday from 4:30-8:00 pm.  Prices do seem a little high until you witness the mountain of food delivered to your table or into your takeout containers.  A previous reviewer said that you won't leave hungry, Truer words never said.  I have liked everything I've had here, but really recommend the green chile option where available.  Huevos rancheros, biscuits and gravy, chicken fried steak,  pork chile verde on anything, burgers & sliders, good basic diner food, there's something for everyone on this menu.  Service has been good for me, and takeout orders have been ready promptly, but more important:  accurately,  so no complaints there.  Delivery is available for the evening menu, which can be nice if you're being especially lazy.  Good to have a nice little place like this in the neighborhood, so I'm doing my part to keep them in business.  Oh, I do wish they'd use Heinz or Hunt's ketchup; that restaurant supply house brand sucks.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mJZrUKpQSK2lWK0VxJuuZA"
  },
  "tmSgq_vQiq7sEC8GCoY9KQ": {
    "date": "6/29/2012",
    "text": "We went back for the first time since they reopened after the fire and had an exceptional lunch.  Chicken fried steak for one and fried chicken for the other.  Both were more than substantial in size and flavor.  The service was great..  It is nicer inside than it used to be.  Can't wait to go back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZAwsN-jV2DO0REqsAfAibg"
  },
  "-s8NH0iaRZ1sKB47vXrjhg": {
    "date": "2/5/2011",
    "text": "Came at the last minute for a lunch, party of 3.  Had one of the best burgers I've ever had.  I was happy for days after that one.  Cooked exactly as I ordered, medium rare, great bun, great steak fries.  This will be on my regular rotation for a good burger, though hopefully I can try things others have mentioned if I can be swayed away from the burger!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kw6MlCtQ9sd4p7x2PlYKaA"
  },
  "sUI9VAK9pp1jqG8swfJS4g": {
    "date": "10/11/2010",
    "text": "Nothing bad about this place. Charming and cute. A little expensive for what it is. I prefer 5th Ave Cafe, which has similarly good quality but for a lot less.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_yXm8kPkmtFWtr25XH7XNw"
  },
  "enje4MPZuaXsLPB8ypLnvg": {
    "date": "12/13/2012",
    "text": "I went for the first time last week. The service is awesome! They were right on top of water and coffee refills, and the waitress couldn't have been friendlier. I had the bacon and eggs, hash browns and multi grain toast.  Tasted great, with good portions. I'll be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZzBgxz76VzapGy58-eOPEA"
  },
  "dGVbsclr_nD5nzwmINalMw": {
    "date": "3/22/2013",
    "text": "Nice, comfy, clean ... good food - had the grilled chicken salad in a taco bowl - lots of chicken & the chicken was actually WARM!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AWbrEQ1bToEk9m0OcxNMyQ"
  },
  "bTOF9HQ7PaBrr1IT3BpzfA": {
    "date": "9/14/2013",
    "text": "I took my husband here for breakfast for his birthday. It was very good! I had the huevos rancheros and the green chile pork was delicious! The rest of it was good too. My husband had bacon and eggs and he said it was good. The staff was friendly and we were served quickly. We'll definitely go again",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iu5cbqe0VevZEFmMbTkObw"
  },
  "koRVMP65qg1E4aIrOCqv0Q": {
    "date": "3/24/2013",
    "text": "Had to try this out! YAY, now I have a new place for breakfast & lunch. Got the Chicken Fried Steak breakfast with scrambled eggs, only problem, got the Chicken Fried Steak with chorizo and scrambled egg whites...but now I have a new favorite addiction!!! The biscuits were okay, just not tasty enough for me. Might be good with honey. Got a sample of the pork chile verde, know why it gets awards for it. Thank you, Thank you, Thank you.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w34SWUnjFpmpQMYOLrs51A"
  },
  "5ZFWMpomqCr8WlbQL09cAw": {
    "date": "7/28/2010",
    "text": "This is a great mom and pop type restaurant. They have good food and good service. You walk in and it feels like home. I have ate there a few times now and have had good food every time. The hot burger is unique. The green onion burger was awesome. Nothing you can get is bad.   I am trying the chicken fried steak there next!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "nD0UiEiYhzRbZEWeK47f_g"
  },
  "ju1whYTql03jwJSetEiUXQ": {
    "date": "5/26/2015",
    "text": "My boyfriend and I came here for Saturday brunch. We were starving so we both ordered the biscuits and gravy. The food was decent and the potions were huge, however the service was horrible! Since we were unable to get a table, we chose to  sit at the bar. I am not sure if the waiting staff was new, or what was going on but we had like three different waitresses randomly ask us who was serving us and getting annoyed when we couldn't locate the last person that helped us. I don't know if everyone was just really confused on how seating worked or what was going on but it seemed like the only thing the staff cared about was who was going to get the tip off the ticket. Near the end of the meal, the waitress laid down our ticked and walked away and didn't even bother to interact with us and ask us about our experience. My boyfriend and I were bother servers through college and we could not believe how much we were being treated as just a tip and not a customer. I honestly think they could not have cared less that we were there. I am super disappointed because this restaurant is super close to my house. I never judge a restaurant off of the first visit, I  try this establishment again and update my review if my experience is better.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6KgSkerFoBlECvmbSvpn7g"
  },
  "quq-EW6AA_-T9BSx_aRyJA": {
    "date": "12/13/2012",
    "text": "I love this place!!! Its 5am and Im up and ready to head there in about an hour. The food is home cooking at its finest. I love the service and the country fried chicken.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "XRgZph2vZ2TeN68m2ya2yQ"
  },
  "aj1_pJo-kcweb1V0zJ65NA": {
    "date": "3/10/2010",
    "text": "Only the best for the Beautiful Carin...that's what I tell her constantly...that's why she chose me...that's why I take her only the best places...Like Ranch House Grille:)  Surprisingly, she hadn't been to RHG with me before now, so off we went for Saturday \"Lunfast\" after our workout...(I was going to call it brunch, but it was Saturday and about 1:00 pm so it kind of felt like a retox lunch time thingy, but I had breakfast, so...:-)  Carin was charmed by the rustic decor and the family atmosphere at RHG (these folks are from up around Page, Arizona...this is the southern outpost of the family restaurant empire:)  She was more charmed by the food:)  I ordered up a Chili Verde Omelet (I need to digress for minute...I've always been a red chili \"snob\" when it comes to chili omelets...I mean who thinks Green Pork Chili on an Omelet?...well, I do...now:-)...this is really the adult version of \"Green Eggs and Ham\" (BTW, RHG can steal that for their menu if they want...I don't mind:)  I am astonished at how well the flavors of the rich and meaty green pork chili work with the fresh fluffy eggs in the omelet...this is what the word \"sublime\" was invented to describe:)  Carin continued her very healthy ways with a veggie omelet made with egg whites...although I did notice that about 20% of my omelet was \"missing\" when I returned from a brief visit to the clean and shiny restrooms:)  She said there was a commotion in the restaurant while I was gone, and when she turned back from gawking, part of my Lunfast omelet was missing...but I don't know...there were unexplained Chili Verde traces on her plate:-)  She said next time we go, I can get the Chicken Fried Steak and eggs and she will get the Chili Verde Omelet...maybe she'll let me share:-)",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "SrF972IxsELYQ3eaWB5X4A"
  },
  "DnRJgQdTae_lHkcNDP6kNQ": {
    "date": "10/20/2014",
    "text": "I recently went back to RHG for breakfast. This was during the week, service was very good and the food was much better. My eggs were poached correctly and my has browns were cooked fresh and hot. I noticed that the price has increase but I had a 3.00 off coupon that made it worth while. I have also noticed that they are some more vegetarian items on the new menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8381cDXbQs5LDMwQo2DIcA"
  },
  "3ALMzfb11eGI43X-7zoFRg": {
    "date": "1/28/2013",
    "text": "They were certainly packing in the customers on a Sunday morning, but that didn't stop us from being seated almost immediately.  Waitservice was rapid and pleasant.  My wife ordered the waffle and eggs benedict.  She was happy (not overjoyed) with the eggs--which I thought were PHENOMENAL--excellent hollandaise sauce.  She was overjoyed with the waffle, which I thought was great.  I had Chicken Fried Steak with eggs and silver dollar pancakes.  The steak was great, gravy was tasty, and the pancakes were at least 6 inches in diameter--which pleasantly surprised me, as I was expecting them to be a lot smaller.  They tasted really great as well.  We left full (but not exploding) for $30 plus tip.  All in all, a good experience and we'll defintely be back!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qSJdtutqvDrZQSXcHXyBwQ"
  },
  "qiQW_Wx6HL1z5lxqtCddCw": {
    "date": "4/28/2010",
    "text": "Two or three times a year, when my dad comes to town, we have to go eat a chicken fried steak at the Ranch House.  We heard about this place from our old roommate who is a chef, and my dad couldn't wait to go try it.  Typically a healthy eater, my dad loves to splurge on something artery-clogging from time to time.  I'm just glad I get to go along for the ride.  The first time we went, my dad noticed a not-so-svelte man sitting at a table in front of the window.  My dad looked toward him and said \"Ooohh.  This is gonna be GOOD!\"  He was right.  The chicken fried steak is tender and juicy, the eggs have always been perfectly fine and the gravy is so thick and creamy I can feel it taking years off my life.  Pancakes are an easy kid-pleaser, so everyone comes out full and content.    I'm glad I get to go here once or twice a year and that's enough for me.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "NIHuPRTp7Ff9DwyT2XPONg"
  },
  "L3T1N9VOxoANPgz2nB-ssw": {
    "date": "6/27/2012",
    "text": "The best chicken fried steak.  I recommend it with the chili verde gravy.  The prices are good and the service is excellent.  I am so glad that they came back after the fire!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5KB58o92jJkAwg25CDr-cQ"
  },
  "6G-lngDQ1LArNYrcuxf5oQ": {
    "date": "4/13/2010",
    "text": "Sorry, I can never get over the \"I don't care if you eat here\" philosophy from the host, wait staff and anyone else who's brought my food to the table during the 6-8 x's I ate here as I'm all about supporting the 'hood'.  I grew up in the business and completely understand how it operates, runs, and what service means.   But come on, when a table is open and I don't have the appropriate amount of people, wait for 15 minutes, get served by someone who wished they were at home and that I would mail them a grat for doing nothing, all the while staring at that one empty table....it was the last straw.  I guess I'll have to go to one of the 10 other breakfast spots within a 5 mile radius.  BP",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "SDidMBbEn6nO745hY3B91w"
  },
  "DRvZs-mqvD5rrqX2w3M9Iw": {
    "date": "4/22/2012",
    "text": "In spite of the Malayan curse and being a victim of an untimely conflagration in it's building, this gem is officially reborn and doing wonderful things once again!  As many of you know, Ranch House re-opened its doors last Monday, and today Peggy and I had the absolute pleasure of having breakfast there. The food is superb, as always, and the service is excellent.  Chicken-fried steak (either with cream gravy or with green pork chili) is wonderfully favorable and not just breading. The burritos are always top notch.  It is a pleasure to welcome back this neighborhood place!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "QTZvgss0rIfPmauPaSj2nw"
  },
  "blKJTk0c9DbQlaXwwoU1ug": {
    "date": "1/22/2013",
    "text": "We were searcing for a yummy breakfast place.  Yelp* to the rescue again.  We were able to be seated immeediately.  The decor is not moderate or chic but homey.  They offer smaller portions of breakfast favorites like chicken fried steak.  It was great, tender and just the right size.  The chorizo breakfast burrito was nice and spicy.  Overall, worth every penny.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0HOPaU9TtEUCVCQhQZdKaA"
  },
  "NaphMbGMCpLjIIDvxCfbiA": {
    "date": "3/15/2014",
    "text": "sometimes you just want to go to an old fashioned country style restaraunt and order some biscuits n gravy and don't need all the over the top fixins some of the other places put (hint hint: snooze putting carrots in their gravy realllllyyyyy?!?!?!?!) in their dishes. the place serves generous size portions and I am a fan!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "kG_BlIu2f6wsou_dZNyMMw"
  },
  "Q1wothVGU-h4O-vN-Ua7Rg": {
    "date": "8/16/2015",
    "text": "Delicious Breakfast Biscuits! Swapped the sausage out for their chorizo and it was really really good! Was trying to decide between that and the Original Chicken Fried Steak...have to try that next time because this was a home run. We've driven by this place thousands of times without even realizing it was there. Great service and food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tR9Hqyso8YB180ezkB70IQ"
  },
  "5TW4grubp5LLqUkfWhGrGA": {
    "date": "9/19/2008",
    "text": "This spot has been previous host to Anna's Cafe (RIP), BYOBistro (RIP), Nix (RIP). But finally, I think someone put the right thing in here. A casual, daytime breakfast and lunch spot that caters to a slightly older crowd. We can literally walk here, so we hit it from time-to-time. But it doesn't have the same charm or unique menu favorites (Eggs Maximillian, Parisienne, etc) that a place like Harlow's in Tempe does. You need that to pull people from outside the hood.  DECOR I would call it kitchsy country cafe, but they mean it. So it's not kitschy. It seriously looks like a midwestern diner, in 1974. No nonsense.  FOOD Pretty good. Wish it were better. Good, hearty breakfast. Eggs cooked nicely, as ordered. Meats and sides prepared competently. Standard, reliable comfort food. It's straight-up midgrade foodservice stuff. Ultimately, frozen Shamrock/Sysco everything. Some things are better than others: the green chile poured over greasy fries is an excellent gutbomb. But the burgers are overcooked - maybe the meat necessitates that. Seems like a kickass burger should be a staple at a place like this.  I still have some menu exploration to do, so I'll update.  All in all, they seem to be doing well and serving their demographic what they want. I just wish Matt's was across the street instead.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "axGqLJ9UWb7P4sBXafOeeA"
  },
  "Qlq2mwsbYhTfiBlBD8XRIw": {
    "date": "8/22/2010",
    "text": "Total random location in a strip mall type thing. Had to park in the back, as the front is almost always full.  I have no idea how I happened upon this place, but I'm glad I did, it never disappoints. The wait staff seem like a family, I could be wrong, but I liked that about it.  The food was very good. I had an omelette on one occassion and the country fried steak on another. Always have leftovers, the portions are pretty big. The prices are excellent for the amount of food you get. You might have to wait a bit for your food, but its worth it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D2olw_tyQWAsBb9XTQhv8w"
  },
  "SncPTeeY_N7uE5p5xhBYEQ": {
    "date": "12/15/2014",
    "text": "This is one of those places that is hard to find. This is a place where people come to have a home style  breakfast with old friends. Usually pretty busy, I have never waited to long. There is outside dining which is nice in Arizona. The food is good not great, large portions, decent prices; sometimes the bacon is over cooked, stale biscuits are served, and hash browns get burnt.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_-HNMitNGWrPFldcLQlBzQ"
  },
  "AKFrPReTK2rAMiVQCd6Xmg": {
    "date": "11/2/2008",
    "text": "If your looking for a traditional, down home, country breakfast, then Ranch House Grille is your destination. From the moment you walk in, you are taken back to a small town eatery, where everyone would have to know each others names. Located just East of 56th Street and North of Thomas Road, Ranch House is within walking/beach cruiser distance for anyone in the Arcadia and South Scottsdale neighborhoods. From traditional favorites such as biscuits and gravy, pancakes, scrambled eggs, thick cut bacon, waffles and baked goods, Ranch House has the stick to your insides good breakfast that is much needed on a relaxing Saturday or Sunday morning. Although during the work week, they open at 6am, and you can start off a boring Tuesday with a Chicken Fried Steak and Eggs, what could be better?  If you want good comfort breakfast, with no frills other than great flavors, check  out the Ranch.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "xkPF7TuwSq0V15fnmSGFgg"
  },
  "iTonLsUhAHFtO_3HXR7cow": {
    "date": "10/3/2012",
    "text": "I absolutely love the Ranch House!  Even when I have to wait to be seated, it is worth it.  The food is consistently excellent (especially the chicken fried steak)!  I also sincerely appreciate the always friendly customer service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h2MgCVVvqbg7Jgcb2rDQnQ"
  },
  "Mjfiasdy6xf7mODLUvxGKw": {
    "date": "8/26/2018",
    "text": "my new local fav, a quaint old home style restaurant. home cooked fresh food. came in on Sunday at 10am no wait but saw people wait a few minutes as food is served quick so tables turn quick. servers are happy nice and positive. very friendly. I ordered a strawberry crepe it was fresh and the whipped cream was fresh an amazing. my friend ordered a large breakfast with sausage and bacon eggs sliced tomatoes and dry wheat toast. it was all fresh and cooked to perfection as ordered. this is the best breakfast place I've been to in scottsdale. youre coffee and water will not go empty",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3QzyP39joOFR171k8gUMdg"
  },
  "NlVvp7Tnm4As6IUValH8Ww": {
    "date": "1/12/2015",
    "text": "Went here on a late Sunday afternoon for lunch and arrived at 2:20 pm and the restaurant  closes at 3:00 pm.   We ordered quickly and got the Steak & Eggs and shared the Loco Moco.  The Steak and Eggs came on 3 plates with the steak covering one plate by itself. The Eggs and Hashbrowns came on another  plate while the slightly burnt pancakes had their own plate. The steak was huge and fairly juicy but pretty thin, the hash browns were crispy  and on the dry side with the pancakes a little on the burnt side.  Definitely quantity over quality.  The Loco Moco was also generous and pretty good with the gravy and topped of course  with an egg.   The incident that most stuck in my mind was I asked for a take out box loaded it up paid for the meal and left without it. As I drove off my son mentioned  the left overs so the restaurant closes ar 300 pm and we left at 310 pm and were a mile away when I decided  to drive back. When I got there the door was locked so I knocked and our waitress opened the door and said she kept  the take out container knowing I would come back.  So impressed by the waitress who's name I don't  know but she had blond hair and was very thin built.  Will definitely come back here because of her.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "qSHD9gq1NtQppNGZmwGjIA",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Loco Moco",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qSHD9gq1NtQppNGZmwGjIA/o.jpg"
      },
      {
        "img_id": "bfyknVtgB2qDFQJxtfx40A",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Eggs and Hashbrowns",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bfyknVtgB2qDFQJxtfx40A/o.jpg"
      },
      {
        "img_id": "Ics_r9zNzZdD8Sp-zeCiBg",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Pancakes",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Ics_r9zNzZdD8Sp-zeCiBg/o.jpg"
      }
    ],
    "user_id": "SRK_sUnvRmMwfexoL_DLQA"
  },
  "3zG6QXfkgT_HYwrxjJfpXQ": {
    "date": "2/1/2018",
    "text": "First time here and am truly impressed with how good the hamburger was. I like the locations decor and good ol rock and roll background music. Will come again!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "C6MxUErq9JQbPJPCp4Va8Q"
  },
  "vmKWgsecSs-IWjCic0IdEg": {
    "date": "9/27/2017",
    "text": "My prior review was a 1-star for dinner. And, tbh, haven't been back for lunch / dinner since. But I go here for breakfast at least once a week now that my other casual neighborhood spot closed, and I love it. The omelettes are plain fantastic, service is always fast and super friendly, the staff is great, and all that adds up to one of the best breakfast spots in the Valley.   Plus I just love the atmosphere - straight out of another, more comfortable, casual era.   Worth the visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ryDattwRHu89e2eNiIjJOw"
  },
  "lO2kVa8oI56TechyPcnhXw": {
    "date": "8/12/2018",
    "text": "Even though it was packed, the atmosphere was very relaxed.  My son had the 3 pigs burrito, very good portion and huge hash browns! Also came with a side of chili verde which was tasty .  From living in Hawaii, I ordered the Loco Moco. Portion was huge, as it came with hash browns too. The eggs were cooked perfectly. The brown gravy was tasty as well.  Great food, gotta give this place a solid 4.5 stars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BAkZsBHUxFr0w62aD-o9ZA"
  },
  "6023FF47R40seB1_JJZufg": {
    "date": "12/9/2018",
    "text": "This used to be our go to breakfast place for two major reasons: great food at a very nice price. We had to move from Phoenix for three years and recently moved back. We ate there just before we left and we ate there again this past weekend. Both of those times the food was subpar and this past time we see the prices were significantly increased. Prices were at the same level as Butterfield's in Scottsdale and yet the food quality and ambiance aren't even close. Just as an example, 2 eggs, hash browns, and toast, no meat is $9. In addition we couldn't eat the hash browns. The flavor picked up the taste of a greasy, burnt griddle. My wife and I both left ours uneaten. Made for a pretty expensive breakfast. After two disappointments we'll not be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GT-3yXjoAae_GoTRyQZ61w"
  },
  "bsqQn-2OnlrmDZkNfPkJkQ": {
    "date": "2/3/2019",
    "text": "Today I experienced the worst service ever. It was so bad we walked out... our server Jill was extremely rude. Several folks around us had placed their orders, plus a gentleman that came well after us placed his order and they were all served. I simply looked over to our server Jill as she walked by and motioned as to where is our food. She immediately smirked shrugged as she motioned to the kitchen. Finally food arrived, I asked what happened and she snapped  with such anger \"I don't control the kitchen!\".  I responded as why she was so upset and she walked away. She was so angry and not to mention disrespectful. A simple sorry for the delay would have been good. As she walked back to the kitchen I decided to ask to speak to the manager, she then came stomping out yelling I'm the manager. At this time I requested to speak with the owner and she said to return sat 1 pm when he is in. Why in the world does something like this need to happen. We work hard for my money and choose to spend it at this restaurant for terrible service. Hell no! It was so upsetting we couldn't stay let alone eat. We will not put up with such horrible service. No more bad service! We as a community have been accepting mediocre service for so long it has become the norm. It is time for us to say something about it, we need to put our foot down . We choose to patronize these places and they choose the service they want to provide. It would be preferable to have good food and excellent service to go along with it. I don't know if Leland can do anything to make what happened today right, we do enjoying coming here so just maybe we will try again. On thing for sure I will never allow Jill to serve us.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nro1ul7LRMQSnu0u2Wk77g"
  },
  "6z5Sbu8srnmv6rd9yWVuvg": {
    "date": "8/7/2017",
    "text": "Nothing fancy just good home cooking with a southwestern flair. Green chiles dominate the menu but there are a few Hawaiian items like Loco Moco and Aloha Pancakes! The omelette was fluffy and well flavored. Hashbrowns \"so-so\" but I like them really crispy. Biscuits and gravy are a southern classic and done right!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KGBv_LIPdQWKofJqfniv0A"
  },
  "HXIWmaXvCY6fZNBe2Bz1Mg": {
    "date": "6/26/2016",
    "text": "Excellent traditional diner breakfast  Saw great reviews of RHG on Yelp! and a bit in Phoenix Magazine. So, knocked it off my list when my cousin was in town and we met up for breakfast.   Since RHG's chili verde was noted as extra special, I went with the R.H.G. Huevos Rancheros. My cousin went with the Pork Chili Verde Omelet. YUMS! This is real comfort food in the morning.   Serving sizes are substantial. Service was quick and she made sure things landed together while keeping drinks topped off. And the crowd feels like old-town America, where the waitress new a lot of them as regulars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aOAqs5leMNiPSbszvE-_Cw"
  },
  "MdjFxO8cIEDNxJvhg6p2JA": {
    "date": "3/22/2018",
    "text": "Been driving past this cafe for years on my way to work, every time thinking I would stop but never did. Today I had a flyer menu on my truck so I decided to try it . Food is EXCELLENT and the portions are very generous.  Price is competitive for the area. I would definitely recommend stopping by for lunch....next time I will try breakfast-lol!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EP_FYGU4yCJu8cKmPmF9YA"
  },
  "QbZULX7P5RtW7ixua2gnAQ": {
    "date": "4/19/2018",
    "text": "Excellent food, great service, and it's a good place for locals. I would go here every day. They are the best of their kind. I recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fE1w5C54uEuiQgWeAXcUNA"
  },
  "86UMyQZOjUMIavk2D3YJqA": {
    "date": "3/13/2017",
    "text": "I can't give another 5 stars? How about 10? Yes this place is that good! Two years later and the staff is still friendly and the food!! Still fabulous! Chicken fried steak is still my absolute favorite! That chili verde sauce ...Good Lord, sooo good. This time my daughter ventured off and order the French toast. Another meal that was fabulous! You just can't go wrong with this quaint little spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "E1wGaAQElUA-pKUIEEf4cg"
  },
  "tr1AdlwOG4RbDP3n3vlgBw": {
    "date": "11/23/2017",
    "text": "Great comfort food -this isn't fancy and doesn't serve drinks but it's good food at a great price",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VNjd0iwrMFfOxQgBlwKo2Q"
  },
  "ExHv-sWQTCma4PlvPMVSoQ": {
    "date": "3/27/2018",
    "text": "By far the best breakfast in all of Arizona!!! Southwestern chicken fried steak is amazing. I make a 20 minute drive anytime I get the opportunity just to eat their food. Have never had a bad experience,  always satisfied!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RAlyqPK_HDFjrMhlYyZABQ"
  },
  "1Q2dAnNn4aCRsEQBC3u2eQ": {
    "date": "7/30/2017",
    "text": "Terrible service. Took waitress forever to take our order. Then while taking our order walks to another customer because something was wrong with his order.  Then walks to bar and gives customers who just sat menus. Then spends time  at the register. Finally comes back to our table and told her she was rude for not excusing herself.  After taking our order she asks if we wanted another waiter and I told her NO as she has taken our orders already.   Food finally arrives. My Mary Jane sandwich was alright but the hash browns had a taste that I could describe as soapy. Maybe they were frozen.   The gravy was very salty. The servings were massive but will not compensate for mediocre flavor.  Coupled with bad service - Not coming back. Disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HEe91_-JjRFrrjkRilQL6Q"
  },
  "TCGk6YT2d_xgGobrUvz-3Q": {
    "date": "1/29/2018",
    "text": "Great greasy spoon serving comfort food. Seems they specialize in pork chili verde and it looked super fantastic but wrong protein for me. If it were chicken, I would have jumped at the chance to try it. Our service was prompt and accurate, our server was very kind. Good food, good service, minimal atmosphere but that's okay. Very popular spot!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J_hEXVokV9CUIRDEe1Og8g"
  },
  "vETdRtzqddB3O0E-eVyG1g": {
    "date": "3/6/2016",
    "text": "It's good grub. We went there yesterday for lunch and today for brunch. Pretty good. Some things better than others.   French toast, onion rings, french fries are marvellous. Pork chops were on the dry and overcooked side but the only reason I got the chops only because they were all out of corned beef hash that I really wanted. I got my chops smothered in green chili Verde, which was good, but not marvellous. They were also all out of meatlof that my husband wanted, so he instead got a turkey melt that was good.  Service on Sat afternoon when it was not busy at all was not very good. Extremely slow and kind of lackadaisical.  Service on Sunday at 11 am when they were slammed was quite good.   Overall, it's good grub in a nice atmosphere with decent service. Cant wait to eat outside on a nice day.  Decent prices too. We will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wN7jGqK_ZpB9KoYSAUyr0g"
  },
  "x1ZPciqI91ALoU5JhMk8XA": {
    "date": "2/17/2018",
    "text": "I've heard great things about this place and finally made time to visit. I was greeted promptly with a smile and seated quickly. Service was prompt friendly, and fast. Met the owner who was very gracious.  And then the food came...what can I say but awesome!  Definitely going to make this a regular stop!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qO9hYovbM3HFruLonpNWCw"
  },
  "yVG6XG-MKtmGq3BGljQHXQ": {
    "date": "9/24/2017",
    "text": "Great place after the football game at Veritas! All of us were happy, great portions and delicious! So happy to have found this gem on Yelp!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "NbsWvy7zzyihtHZRbXoJaw"
  },
  "sdAYdFZInJbgTDjvvxU6WA": {
    "date": "4/18/2017",
    "text": "My family and I have been going to Ranch House Grille since they opened 10 years ago - btw, a huge congratulations is in order to them for making it this far!! Their food is incredible, the staff is always friendly and fast, and did I mention their Southwest Chicken Fried Steak? Do yourself the biggest favor, go order the Southwest chicken fried steak, and fall in love. I now live in Colorado but everytime I come back into town, I order that exact same dish, and it's always as delicious as I remember. Thank you Ranch house, and congrats on 10 year!!!! P.S. If you're like me and can't finish their amazingly large portions, ask for the Lite version of your order, for example my lite southwest chicken fried steak comes with less hash browns, one less egg, and half the toast (but all of the meat), for a couple bucks less. Love this option.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ao_Vnm5fx2lcEBYnAOJGTQ"
  },
  "oqILYw1BMYO_0env7ki3aQ": {
    "date": "3/30/2017",
    "text": "If you like to eat breakfast, this is YOUR place. BIG breakfast, big on taste...LOVE this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cfqAkmnG_kbFeOjRe_EQMg"
  },
  "vRlBqbkV61lzooEiupx94A": {
    "date": "11/5/2016",
    "text": "Ranch House Grille did not disappoint! The portions were HUGE and tasted phenomenal! Our server was so nice and attentive. So glad we went this morning!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q1XXyZZNU32x_4OJlb5zqg"
  },
  "QZICOwhi8teFg8yspkJ1Fw": {
    "date": "6/13/2015",
    "text": "I like to try new places out every now and then. I was in search of a breakfast place and stumbled upon this hidden gem. I discovered coming in early afternoon is the best time to come by. You get seated right away and can find good parking. I had the Southwest Country Fried steak it was delicious. I love eating country fried steak and I love green chili and this plate brought the two together. We also found the place with the best and most amazing biscuits and gravy.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JYwpAw2nlWYRHNOyE_M6Vg",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JYwpAw2nlWYRHNOyE_M6Vg/o.jpg"
      }
    ],
    "user_id": "mPDMjIZpMRNSr-b3ch6dhg"
  },
  "nhT9FDUEAOosw6L-HkzeOA": {
    "date": "7/20/2016",
    "text": "Looking for a delicious all day breakfast spot near home. This place looked like it fit the bill perfectly. 2nd highest rating out of all restaurants near me...I assumed the service would reflect this but I was certainly mistaken. I placed a pick up order through Yelp and received my confirmation e-mail that my order would be ready within 10-35 mins. 20 mins later I come by and have someone go in to pick up the food. When they asked the waitress for the order under one of our names, the waitress said she did not have any orders under that name but handed us an order that seemed similar and we paid. When I checked the take out boxes to see our food, I quickly realized that it was someone else's order. I went inside and informed the waitress that this was not our order and specified what I had ordered. She went to the kitchen and came back and said my order was not done yet. I went outside to wait in the car expecting it to be a couple minutes long. When I come back inside the waitress tells me they never received any order and asked what I would like to eat. Just asked for my $ back and left!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "JQX-e817VhtewvoIOMVJ6Q",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Belgian Waffle",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JQX-e817VhtewvoIOMVJ6Q/o.jpg"
      }
    ],
    "user_id": "VehpWjb9Rm-xjSKLXLywYg"
  },
  "o8drEujCElEqaeraCKRIUg": {
    "date": "9/13/2016",
    "text": "Been going here for a while now.  The wife introduced me to it and I have actually been having different items each visit.  Its consistently good food, you cant go wrong with anything you choose.  The green chili stew is a good accompaniment to any meal.  The croissant breakfast sandy is superb, get it with sausage.  I had the biscuits and gravy last time which was enormous, maybe share that with someone else.  We will be back for sure since its right around the corner from the house.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cvSHQGhCVC98VSnJYnySXg"
  },
  "fWisz5wmj6WGmlj0eknWzw": {
    "date": "8/26/2012",
    "text": "Seven of us met for breakfast today, and I didn't hear one complaint from my party.  We showed up at 9:30 and were seated within 5 minutes.  I was a little hesitant, reading the negative reviews for this place, but left pleasantly surprised.  I'm not sure if they changed out their biscuits (based on previous reviews), but my friend who ordered them, complimented their biscuits and gravy.  I ordered the huevos rancheros with green chile, and loved it.  The dish came with rice, beans and hash browns.  Good job RHG!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "rMsB82tk9uOB6JumPMgczg"
  },
  "B5aUoparnywoofOs8ClS6A": {
    "date": "8/16/2015",
    "text": "My second time here. They say first impression are the most important. I was definitely impressed. Now to have some delicious food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TWnAIfxdFBgw05fvspt0Gg"
  },
  "GhUcaMNe_cxKp6Oovm35xA": {
    "date": "12/31/2014",
    "text": "We come just about every weekend! We know the staff and owner as if they were family! The food is amazing. And for me, my orders are always very complicated (vegan) and they just don't mind and happy to accommodate! This is the place we all like to get our sat or sun breakfast, brunch, or lunch on!! Coffee and belly's always full! Thanks guys! Craig and angel",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sSLYtZ8pMdr2DHh9JBObiQ",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. We are regulars &amp;amp; I&amp;#39;m vegan. It&amp;#39;s embarrassingly complicated when ordering out! NOT here! Their like family. Ranch house rocks!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sSLYtZ8pMdr2DHh9JBObiQ/o.jpg"
      }
    ],
    "user_id": "l-HLK3YdVQLRNzKilZBTIg"
  },
  "uz1Mey6GWIbTvAJStBzDJA": {
    "date": "1/26/2015",
    "text": "May I suggest teamwork? Working as one unit for the same cause? When you see your co-worker multi tasking and overloaded and all you are doing is cleaning a table that doesn't need to be cleaned that particular second with no customers waiting to be seated.....Stop, Think, & Assess. Little Miss Waitress, when our waiter was multi tasking and overloaded and we had waited quite a while for our order to be taken and we asked you for assistance, we were looking for more than \"He'll be with you in a second. He is busy.\" You were cleaning a table next to us. No one waiting for that table and no one else beckoning for you. What would have been 90 seconds of your time to take an order for 2 to help your co worker out and make a customer happy? And your eye roll didn't help the matter. If you had taken our order for him and gave it to him, saying, \"Buddy, I saw you were busy. I took the initiative and took their order to help you out. And here it is....    You would have made us happy and also him. Another option is asking for help. Our waiter could have asked for assistance from his coworkers that were not busy to please pack TO GO orders, ring the cash register, or to take our order. Wondering if there was a supervisor or manager monitoring the floor at this time that could have identified the breakdown of coordination.  Our meals were tasty. Portions were filling. However, I do question my mashed potatoes because there was a side that had a hard crusty spot and a little discolored. The Texas Toast was actually toast. Quite different from what I am accustomed. I am used to the bread being grilled instead of going through a toaster. The toaster makes for a dried out center. The sausage gravy was \"spot on\" good.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "B4hulz6g2dLGW5vQ4IaGMw",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Notice my potatoes have a dried out clump area. Must not be freshly served",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/B4hulz6g2dLGW5vQ4IaGMw/o.jpg"
      },
      {
        "img_id": "UevBGofRChat-SoxhYqOuA",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Chicken Fried Steak lunch",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UevBGofRChat-SoxhYqOuA/o.jpg"
      }
    ],
    "user_id": "BZn136yDXErK78LYZw9udQ"
  },
  "fZmSosRatDVWqyRalb6jQg": {
    "date": "7/8/2016",
    "text": "As expected, it was crowded with other Sunday morning patrons looking to have breakfast. We were seated at our table relatively quickly. Nothing fancy, small restaurant but the food was great and very filling. Large portions, I was only able to eat 1 of the 2 very large protein pancakes, they were delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WvKrRF73eiy0WV1751oobQ"
  },
  "gj_TFaoGGpm4yA0_powfNg": {
    "date": "6/24/2015",
    "text": "So disappointed. I came here based on the great reviews and it's proximity to my grandma's house. I ordered the R.H.G. Wrap and a cup of their famous soup. We came around 1pm on a Wednesday. There were not many people there. I did bring my 2 year old and 2 month old. My grandma, mother-in-law, and husband were also with me. The wrap was so-so. The chili soup was way too spicy.   The main thing that irritated me is, they locked the doors at 2pm! My husband went to take my two year old outside for fresh air and it was locked with the keys hanging from the keyhole! Multiple customers had issues getting out because the hostess/waitress kept opening and locking different doors. Hostess' response to this was \"We're closing soon.\" In an hour?!? Food and service not worth the price. Bummer.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DDxDnognetud7SKSzXp6ZQ"
  },
  "qYWD-Jl-daoM0ERBT7F6jw": {
    "date": "11/19/2016",
    "text": "I won a $50 gift card to this place. The food was amazing!! The portions are so big, well worth the money! The staff was so friendly and efficient! I highly recommend this place! Thank you, Ranch House!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4SwG1ugTObHNStiahy9ZUA"
  },
  "eezDZdXuL5avvofJi8tRCQ": {
    "date": "6/10/2016",
    "text": "Fabulous ambiance! Superb service by Felicity! The food was fantastic. My husband says that the hash browns were the best in the valley. Steak was perfectly cooked. Eggs were perfectly poached. Coffee was great as well. It's our first time here. We will be back!!!! My husband also went to the back to compliment the cooks...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mR0N5-ypFf2lFZn8SJ-cUw"
  },
  "pkUZapoRJOr8nX6gFrcrXA": {
    "date": "4/29/2016",
    "text": "Hmm. .so I've been to this restaurant a good amount of times and had good service and good food. Today, on the other hand was a disappointing experience. My server was prompt but rude. My food was cold and served wrong. I asked for sunny side up eggs well done. .I got cold eggs with runny whites. I asked my server she said you wanted sunny side up. .I said yes, but well done. Meaning cooked! She took my plate back and a few minutes later brought back my plate minus my eggs. They simply wiped off my eggs and brought back the remainder. Really! I wasn't happy with this place today.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1LZDcKBH3sOyCpI5mpqVyA"
  },
  "bLNwApdEjGWiegu0FJT8Pg": {
    "date": "1/24/2015",
    "text": "Went here in search of a hearty breakfast and man did I find it. I've had many Country Fried Steak in my life however the Green Chile Country Fried Steak was amazing. My friend enjoyed the Steak and Eggs which like any good \"Ranch\" worded restaurants would try to pull off, Ranch House Grilled Steak was fantastically cooked and very flavorful. I went for the biscuits and gravy on the side which like the rest of the meal, came in a generous portion. Hash browns were crispy as I ordered and the service was excellent. I also met the owner who was very friendly. Support this place, it's worth the dime to dine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VYzptiFFGS7ObTwgB6sctg",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Green Chile Country Fried Steak",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VYzptiFFGS7ObTwgB6sctg/o.jpg"
      }
    ],
    "user_id": "n5TbOFpspfiZKHuk5kdqnA"
  },
  "x3vZUhJeNMlwDx3Bd-bu9Q": {
    "date": "3/17/2014",
    "text": "Driven by this place for years and it is always too busy to stop . . . today . . . not many cars, so I thought I would take a chance . . . I thought to myself before I got out of the car . . . either this place has gotten really bad . . . due the lack of cars . . . OR . . . It is my lucky day.  IT WAS MY LUCKY DAY  Service was great . . . my waitress recommended the meatloaf sandwich special . . . and I was skeptical . . . meatloaf with grilled onions and barbeque sauce on grilled sour dough . . . I died and went to heaven . . . Fries were hot crispy and great with the barbeque sauce that oozed out of the sandwich.  Not only was this place a strong 5 stars . . . but it was a 7 napkin sandwich . . . I will definitely be back . . .",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "LTWwc5SMKVd5UHN7Y-sxsw"
  },
  "iupKOsJb6xWawtYv5GQlyw": {
    "date": "9/4/2017",
    "text": "Great food, great service. This is our favorite breakfast spot in the neighborhood. The only knock is they don't have booze, but still a must try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p9tR34bGpGCvZwMSnA7qug"
  },
  "MoLRsF4ggq0HRKcpI9e9xA": {
    "date": "7/23/2016",
    "text": "All the hype is True. The pork green chili verde sauce is the bomb. Highly recommend the southwest chicken fried steak.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p-Mi4TCGgCODU1DPyj889w"
  },
  "uozt6N7S-1a1dEEIrNfZLw": {
    "date": "5/23/2014",
    "text": "My boyfriend and I went there for breakfast one weekend and were unimpressed. The parking was terrible and service just OK. I ordered the eggs benedict which had the sweetest hollandise sauce and my boyfriend said IHOPs chicken fried steak was better. The server never came back to fill up our drinks and just dropped off the check to never be seen again (pay upfront). Wouldn't recommend this place to anyone.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-tQ3UVVdNBZBR_HOVFROzw"
  },
  "AOcQ6yFIJSD7Vsjpt7Yfqw": {
    "date": "10/9/2014",
    "text": "Girlfriend had the Philly burger it was Great, with charbroiled taste were thinking this is becoming our New Burger joint.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "AKiqtFMh2dcgr8uoNprLFw",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Loving the Fish and Chips. .",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AKiqtFMh2dcgr8uoNprLFw/o.jpg"
      },
      {
        "img_id": "wQxsIqDu_h6oaqujwCMXYA",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Green chili verde. Omelet",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wQxsIqDu_h6oaqujwCMXYA/o.jpg"
      },
      {
        "img_id": "WOjiP6zGCb6t3MSN1BX27A",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Chicken Fried Steak",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WOjiP6zGCb6t3MSN1BX27A/o.jpg"
      }
    ],
    "user_id": "LcaCbjrPDnwN90tomnYvhQ"
  },
  "JNKahocfMZnwS2XIsDQymw": {
    "date": "3/31/2018",
    "text": "The service was A1 - 5 stars, super nice staff and very attentive. I got the RHG Club w/fries and it was so-so, nothing special at all. I got the cherry cobbler and it really wasn't cobbler in my opinion or at least like any cobbler I've ever had. I had been wanting to try this spot since I got in the Phoenix area because it had pretty solid reviews and a larger menu, but I wasn't impressed the first showing. I'll give it another try eventually and hopefully get a little more adventurous with my choices. My eye will be on the breakfast menu next go.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pR-2juhg1LnIh84Qtaz8CA",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. some type of granola on the crust and it was super thick, not a fan at all.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pR-2juhg1LnIh84Qtaz8CA/o.jpg"
      },
      {
        "img_id": "uH7Ty70OuUEdb2tvWgL87Q",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. bread sucked and each section fell apart as I ate it. pickle was fresh though.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uH7Ty70OuUEdb2tvWgL87Q/o.jpg"
      }
    ],
    "user_id": "rqwVbCucnoY93D90CBkLgg"
  },
  "rAGeGX6AswwLukbx25jGCA": {
    "date": "3/14/2019",
    "text": "Very Bad attitude by the waitress. Had to wait to take our drink order . The place was Less then half filled . Then had to wait to take our food order. Did not refill our drinks . Then after waiting 45 mins on our food the lady comes to tell us our Order did not go through??? Tried to wave down the waitress a couple times but they just walked by us . Do not go here if you want good service . Go here if you want to waste your time . I will not come here again .",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "QLzMhRe29lx1HKMFa0brlA"
  },
  "v0CxER1jauzaaBg8UNjQ3A": {
    "date": "7/15/2017",
    "text": "Talk about great steak and eggs. I opted for the 16oz sirloin, med. rare and was not disappointed. We told Jill, our server that it was our first visit. She promptly brought out a sample of their award winning green chile. It was so tasty, we ordered a pint to bring home. My wife really liked it also. We drove 36 miles across the valley to try this place and will be going back that's for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xb49y6JmxS39lJR-_tRkaw"
  },
  "XO7kvCyvrWsWzp_b_tOXeA": {
    "date": "12/15/2018",
    "text": "This place is awesome!!! They have the best pork green chile! Do try the southwest chicken fried steak! The loco moco is amazing as well.  Great breakfast joint!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "424jU8F0BqZ67oGkXghugQ"
  },
  "73sIL5xO0oLsYQ26QtsnRA": {
    "date": "2/18/2018",
    "text": "Another disappointing meal. Have you ever had microwaved pancakes? It's been a while, but we wanted to give them another try because for years they were our favorite breakfast place. But today the only thing we got warm was the coffee and hash browns, and the coffee didn't come with refills until my food had been sent back for being cold and returned to me microwaved. The hash browns were good. Pancakes should melt butter, these didn't either time I got them. They did take it off my bill, but since I didn't eat it that seems reasonable to me.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TJL860tmPzOdu_4qN_CHaw",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TJL860tmPzOdu_4qN_CHaw/o.jpg"
      }
    ],
    "user_id": "ZzxEPupxULItP3MJSlQmxw"
  },
  "8HUJmhjUpFe1G3rsIOoIzg": {
    "date": "11/19/2018",
    "text": "Regular customer. Always very solid. Surprisingly succulent chicken! A better cup of coffee, and the RHG is easily a 5+.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "axfeWTmso4tY7Dh1QePhmQ"
  },
  "_GJ62ortY0R39kXGSwAVwQ": {
    "date": "6/28/2017",
    "text": "The Ranch House Grille is a great spot for breakfasts and lunches. I'm sure the dinner offerings are good but have not tried any. They also serve green and red chile which I love. Today I have the veggie salad with cilantro lime vinaigrette. It was served in a large tostada shell, much like a taco salad. The salad was huge and all of the ingredients were fresh and delicious.  The dressing was very good and I would get it again. My friend had the berry & blue cheese salad which included strawberries and pecans ( they were out of blueberries so they just added additional strawberries) with grilled chicken.   The salad was also delicious and the grilled chicken looked amazing.  Our server also Offered us ice teas to go which was very nice given that it is extremely hot today.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "03oV2C0XMBDjnzvPYbgC4Q",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/03oV2C0XMBDjnzvPYbgC4Q/o.jpg"
      }
    ],
    "user_id": "121ruQUFk6Bl2V1wBwa31A"
  },
  "2zlXUYbXuDjgaZsq-AnpTQ": {
    "date": "1/30/2017",
    "text": "I have visited this location twice now and am getting hooked! The first time I visited we sat outside which gives you a cool view of Camelback Mountain. I ordered some type of sandwich and also one of their famous bowls of soup. I recall the soup being amazing and we had leftovers for a second meal later.  My second visit was Friday morning. I took a co-worker out after work and we both decided to try breakfast. I ordered the Pork Chili Verde (topped with cheddar, smothered in pork chili verde) and my friend ordered some meat omelet and added veggies. We also had biscuits and gravy for our sides. My food was amazing. Words cannot explain how tasty it was. The gravy for the biscuits was like crack! It was so addicting I want more just thinking about it right now. The service was good as well. I will return in the future and bring more guests. This hidden gem deserves to be discovered!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "f-8BKEVPqiqRaNNmhjAU8Q"
  },
  "VpJ6Dw1Y5td_sA0Ty2VbsA": {
    "date": "9/28/2018",
    "text": "This place is seriously legit. We've lived in the area for 2 years and never discovered this gem prior to today...so glad we did. I ordered the SW Chick fried steak with hash browns and 3 eggs + 2 silver dollar pancakes for abt $13.00! All well seasoned, served hot and delicious. Extremely satisfied and we'll be regulars, now.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J0iR6_YqeV6BGC9JkvVx0Q"
  },
  "tteG6WhPUkY082O_yOx1tQ": {
    "date": "9/16/2018",
    "text": "My favorite breakfast/ brunch spot! I love coming to this little place for the country fried steaks- the food is absolutely phenomenal. Every person I've brought with me comes back, and we all love it! I would definitely recommend checking the place out for a casual sit down breakfast or brunch if you've ever got a chance",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J8BzGAAIXNslEJq5rjsKqw"
  },
  "uz4_FcW-LlOqSIwHPhBswQ": {
    "date": "8/26/2018",
    "text": "A local, down home traditional breakfast spot. The food is pretty decent and they have a good family restaurant type vibe.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZQMdFowt6689elBr7JuRDA"
  },
  "BspQdTh9ranC1p_ZoL6kVg": {
    "date": "5/13/2018",
    "text": "This place is like a secret little gem I almost don't want to review because I don't want others knowing about it. ;) Amazing delicious food every time I go and being there my friend and I totally feel like we're away camping up north or something in a tiny town. Just the wholesome family home cooked food feeling. Highly recommend!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "XpSMKLHLne-MAzi7mnU-jg"
  },
  "JovCIgTrZJlSRbzOH6bZpQ": {
    "date": "5/2/2018",
    "text": "Best chicken fried steak! I come here all the time and it it never fails to amaze. Best breakfast!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ikSLvjFI-clPM7NriHj_YQ"
  },
  "J7-JQR6GmwM5xoblX-p7-A": {
    "date": "6/2/2018",
    "text": "Chicken fried steak was the best we had in AZ (being a southern boy). Peach cobbler eas well made. Hash browns were more if a cake. But service was great! Our waiter was fast and a hard worker,  attentive, and friendly.   See you there!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "foywHk5LIoY-C_0wQ4ecMg"
  },
  "k9LRAcAKyOt3izwDHwPCmA": {
    "date": "2/2/2019",
    "text": "Great selection on the menu but the food was mediocre and the service was mediocre (aka grouchy).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m8EcuUD_iMMGiziHyKe8Zw"
  },
  "I5b59cXv2ls6fQnai1Yaww": {
    "date": "12/15/2017",
    "text": "If you enjoy Philly cheese steak sandwich and if you enjoy really good customer service a decent cup of coffee and a fair price and you need to put this place on your list. Awesome",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CvZaf2yBOCCCwDuf6W_3XA",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CvZaf2yBOCCCwDuf6W_3XA/o.jpg"
      }
    ],
    "user_id": "ohQtaUXUOIPhrnp2Ve4wbQ"
  },
  "lb38rNpsAIg6QCLtrdos9Q": {
    "date": "3/5/2018",
    "text": "I think I found my new favorite breakfast spot! Annette steered me to the Breakfast Biscuits. 2 Biscuits with Gravy topped with 2 sausage patties and sausage gravy. On top of this 3 eggs any way you want them accompanied with delightful hashbrowns. Delicious!!! We'll be back soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Kgr2unsZ7djBQtlk35Vlg"
  },
  "2GVjs0FQd4ZmaG2OkMnacg": {
    "date": "10/10/2017",
    "text": "This place is the epitome of down home cooking. They have the best chicken fried steak I've ever had and I have tried my fair share. They also have really good burgers and I love their fish and chips. Great spot for a filling breakfast and lunch!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bbIu4JknI5IJbQIGChd6EQ"
  },
  "qn4QRWurgFoEBu1UD-PjQA": {
    "date": "1/29/2018",
    "text": "I'm always on the prowl for new breakfast spots! This place looks a little old fashioned, but isn't that how you want your breakfast to taste? Homemade just like mom or grandma cooked when you were a kid, well that's what you can expect at Ranch House Grille. The menu selection is huge so you can satisfy your craving for eggs, pancakes, omelets or a burger. Maybe split a few meals between the family or friends, that's what I do, and trust me no one is disappointed with a variety of flavors to go around. Awesome service, too - thanks to Noah! I didn't have to wait long for the meals to arrive, so add this spot to your brunch to-do list!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "_9WKSGfBn193Wl3vd7kt1A"
  },
  "EbSGAtPqelC1sF7B3n7ijQ": {
    "date": "2/14/2018",
    "text": "I finally made it to the Ranch House this morning. I had the Chicken Fried Steak and eggs. I must say it was quite good although a little smaller than I had seen in photos, nonetheless it was adequate. The Country Gravy was excellent as we're the scrambled eggs and hash browns. I plan on returning once the construction is complete on Thomas as it's currently a little rough to get in and out of.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2wWBCnfF_gynz26BZXfhxg"
  },
  "HYjaYsapdKXt0NPVkny8pg": {
    "date": "2/15/2016",
    "text": "Onion rings are the best I've ever had! The ranch that they're served with is also really good and tastes homemade. I ordered the French Toast combo and they were pretty standard, but I'm not really a breakfast foodie, the eggs and bacon were perfect. My boyfriend had the chicken fried steak and really loved it! Will definitely go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZIzxUOSWr6mfe8zTIZCmzw"
  },
  "Iq4kO7E-Ps7j5I9IfoVwAA": {
    "date": "11/24/2015",
    "text": "If you're looking for a yummy, hearty local breakfast spot, look no further. This place pack a ton of deliciousness onto a plate for a reasonable price. Coffee is bottomless and also delicious.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XGaRRRpyukK8xjEIZCFwZw"
  },
  "zbVy8UyjD7CGrbdl2Su2Bw": {
    "date": "9/12/2014",
    "text": "Happened to be driving by this place as it is close to our house. Stopped in for breakfast and was blown away! The customer service was very attentive, but the food is incredible. I had a half size breakfast plate and there was plenty! It was a fairly normal order eggs, sausage, hashbrowns, and toast but it was prepared exactly how I like it. My boyfriend had the special, breakfast chimis w rice and beans the first time and ouevos ranchero the next and he LOVED both! Huge portions, he didn't finish it and the flavor was amazing. They make their own salsa too and it's delicious. Atmosphere is a small family diner type, definitely comfortable and they take pride in their establishment. I recommend this restaurant for breakfast over any other in Scottsdale purely for the outstanding quality to price ratio.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GoTzlifbQlEJcWxC9wFYRA"
  },
  "uJ4eTkatJ_Jdpb_g43uVig": {
    "date": "8/26/2012",
    "text": "Went today to use our Amazon Deal coupon.  Since the place was busy and there was a waiting line, the hostess offered the option to sit at the counter.  We gladly accepted since we often find the service at the counter a step above table service.  We weren't disappointed.  Our waitress as very friendly and rountinely checked in with us during our meal.    Wife and I love steak and eggs so we both ordered the smaller 8oz portion.  In addition I ordered a side of biscuits and gravy for .75.  We got three eggs cooked perfectly, mine sunnyside up and the wife's basted.  Each platter (yes I said platter) had a large portion of golden hash browns, and two, not one cut of perfrectly cooked steak to order.  Not since our days in CHicago had we seen such a generous portion of steak on a plate.  The biscuits were just average at best, more like a dinner roll but the sausage gravy was the best I've had in the valley since we have been here,  Bottomline, this is the first time my wife has asked for a to go box for her steak.  She was stuffed as was I.  In fact we were so stuffed that on way home we decided to change our dinner plans to only a light salad!!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LvDh4IoBHdtojqZI1G3vrg"
  },
  "RJbweZ5_BkIwaShyIJ9B-A": {
    "date": "10/24/2014",
    "text": "The food here is awesome! Good sized portions for the money and they cook it more like a home made meal. I'll be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eFLi2n7M1EvdMsX7qtspDQ"
  },
  "jrinEjn1ehyEA29D5GZp7w": {
    "date": "3/2/2014",
    "text": "Green chili pork, chicken fried steak.  Nothing else needs yo be said!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XLGgliAown151yxQxAOOWw"
  },
  "ItIOsKdahjsGMIdg0iR_Gw": {
    "date": "12/17/2013",
    "text": "Love the chicken fried steak.  I will have to say it's the best in the valley.  Service was wonderful.  I have no complaint and I will be back very soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "dDNF_PFvFEa7I0MrricRdg"
  },
  "lxHetFahLeSORKDiyl_S0A": {
    "date": "8/3/2014",
    "text": "Always awesome, we go to other places for breakfast sometimes to try something new but we always fall back to Ranch House Grill.   It's always a struggle to decide between the biscuits and gravy and the pancakes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fhbYagaTxGXNK5ECJkGCzw"
  },
  "PUC_JtEgE3QsPdKq0Ht_TA": {
    "date": "5/12/2016",
    "text": "A diamond in the rough. If you're looking for that authentic local experience, you must try Ranch House Grille. Good food, huge portions, friendly service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uqmo-jLe2HKKpBeUGHyojA"
  },
  "IuGWZG9X1IWa6l_cZi48iw": {
    "date": "9/8/2014",
    "text": "Always the place to go for a great meal. Good comfort food! The chili Verde is just right, try in on the chicken fried steak.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cXBPgj8erM7_M-EW-JpGWA"
  },
  "Inbm_lnaY8_lAD6yOTkvKg": {
    "date": "10/18/2013",
    "text": "Ranch House Grille has quickly become my favorite breakfast spot.  Everything is from scratch and tastes homemade.  I love that the menu has a good variety.  You can get serious and order country fried steak with biscuits and gravy or something on the lighter side like yogurt, fruit and granola.  I think the pricing is fair.  You definitely won't leave hungry.  <a href=\"/redir?url=http%3A%2F%2FLocalDines.com&s=b3a868eecea41696fff670b5911cb1abce078fbfa98366740f764a2b33316cdb\" target=\"_blank\" rel=\"nofollow\">LocalDines.com</a> generally offers a $10 for $20 deal.  I highly recommend Ranch House Grille!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "O6Tl7DNU7fkI3VbJshSrnA",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Bacon jalapeño omelet with biscuits and gravy",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/O6Tl7DNU7fkI3VbJshSrnA/o.jpg"
      }
    ],
    "user_id": "1jOOUeDqLV6uOFVWmTUqlQ"
  },
  "pN1QOdVzi_41_OkxVTkFSg": {
    "date": "11/16/2014",
    "text": "The place gives the feel of a small town diner which is pretty cool and our server was very prompt and friendly.   As for the food, it was ok but nothing to get excited and recommend friends to. I've read that the chicken fried steak was amazing but the server told me they're not fresh but frozen which killed that idea.   Here's the why for 3 stars: We had a breakfast burrito smothered with a $.99 side of pancakes and coffee. Huevos rancheros with coffee and a strawberry crepe with water. Our bill total was $48 for the three of us and the girl at the register couldn't explain why. And that didn't include the tip!   We came here because our other favorites had long waits and when I called they said they could sit us immediately, should've known something wasn't right.  Bottom line we would not go back as nothing stood out, if the food was out of this would I wouldn't mind the expense.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "za_VSdmrCXd8Hp2alX5IkA"
  },
  "wlxoYZ9NDN7r-2NU6lzjmg": {
    "date": "11/11/2014",
    "text": "First time here and loved it. The food was awesome and the portions are big. I would recommend the pork verse omelet.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eedaGddKBhp2rzIXAnmy7A"
  },
  "ZASm5qBTCWEJrk_OmaHC8Q": {
    "date": "9/22/2013",
    "text": "My husband and I LOVE this place for breakfast.  Their \"Green Chili Gravy Chicken Fried Steak\" is fantastic!  The ambiance is \"corner cafe\" style... the breakfast fabulous.  Not sure about other meals, but breakfast is worth a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "zMGEA8imdpUfj68zgF8PlA"
  },
  "Dwt7oww6Uh_cYnKfySTnQw": {
    "date": "4/15/2013",
    "text": "We were out driving around and came upon this place. Checked the Yelp reviews which were good so we stopped for bkfst. Excellent portions and very reasonable prices. We were fortunate to have been able to sit outside and while we were out there we kept hearing honking..Well, I guess the sign on the street said \"honk if you love chicken fried steak\"! I guess it's pretty well loved...very good food and service!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "m-YNLs1N58gcEM4Ee2EIgg"
  },
  "XzEt7UMoLJ99AHU7DEEDKg": {
    "date": "11/1/2010",
    "text": "The green chile that they are known for is, in fact, quite good. Everything on the breakfast menu is a little overpriced, but not horribly so. It's a locally owned place, I think run by a family, which counts for some points with me. Too bad the service is horrible. After we checked in with the host, multiple parties (larger, smaller, and the same size as ours) were all seated before us. When we finally did get seated, the waitress was inattentive and not knowledgeable about the menu. After a 40 minute wait (for breakfast!) she brought out the wrong plate of food, which my friend was just going to eat because we didn't want to wait for another plate to be made. Instead, after he had taken a bite, she did bring out the correct plate. That would have been great except we saw her JUST BRING THAT SAME PLATE OVER TO ANOTHER TABLE!!! Wow. When we complained later to the manager, he said \"I know, I've heard it all before. Just pay up and don't come back, I guess.\" That has got to be the worst customer service I've ever experienced! Too bad Ranch House Grille, I really wanted to add you to my Phoenix rotation!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "YIMeEHUYm69m-Mqf-NjPHw"
  },
  "ad6QzV0130xgGnF2bvSrDg": {
    "date": "8/14/2014",
    "text": "Best biscuits and gravy ever!  Love this place and the overall atmosphere.  Everyone is super friendly and the food is always great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rzgNJZPYZuP74HPpZ9ozag"
  },
  "yN9T7LGKa2WIiiq6u7gEuw": {
    "date": "12/16/2013",
    "text": "Down home comfort food! This has become a favorite for our friends & family when then come to visit from the midwest. The best biscuits & gravy I've had in Phoenix. Super friendly staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nrwz6YqWgOojg4T0tbSIQw"
  },
  "2rytU8jZBcVrKpCW_FyJng": {
    "date": "7/7/2013",
    "text": "I am not a food critic, I am more of a traveling foodie.  So, from the reviews & comments asserting this restaurant has the best chicken fried steak & green chili in Phoenix, that did not hold True for me.  The food was not bad but not great. The combination omelet I had was quite good. The hash browns were ok but the oil used to fry them tasted old. The pancakes were just ok.  The service was friendly. You get the atmosphere a decent local establishment that certainly has its following. They make their own hot sauces which I tasted.  We went to try some place new. I am glad we did but it was a drive. I wouldn't go out of my way to go back anytime soon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rove-_SK-PAezQPQS7cnaQ"
  },
  "VPWIdfgaCEpvBsTh1HrroQ": {
    "date": "8/25/2010",
    "text": "Ranch House Grill gets a big fat \"Meh\" from me. I love breakfast joints and am always looking for new places to try. When I got a Groupon for Ranch House Grill I was hoping I would find a new place to add to our rotating list of breakfast hot spots. Not so much.  The boyfriend and I went there on a Sunday morning, there was a wait but nothing too long. I ordered the special - cinnamon raisin french toast, eggs and bacon. Boyfriend got a ham and cheese omelet which he did say was pretty good. My food was okay but nothing special. The french toast was kinda small and didn't have a ton of flavor. Eggs were fine, bacon was okay. There was nothing bad about the food but there just wasn't anything great about it either. At least nothing to make me want to go back. Except maybe the Savers down the street - I found some great clothes there!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "A2JGzkvNjckSmps_4FbKWw"
  },
  "SmFb0liy8tJ032SZEL29qQ": {
    "date": "8/6/2015",
    "text": "Stopped by this morning for breakfast, after reading the yelp reviews. I had been craving some corned beef hash and eggs, but after consulting with the staff, I decided to go with their specialty, the Southwest Chicken Fried Steak (and eggs). . when prompted to toast or biscuit and gravy, I decided to go with the biscuit and gravy...  After a short wait, my food arrived. It was a FULL plate of food.. a big rectangular block of shredded hash browns, with a nice, brown crispy crust on them. Three eggs, cooked to the perfect over easy, and the chicken fried steak. But instead of the usual sausage/cream gravy, this southwest version was covered with a pork chili verde. And on the side plate was a big square biscuit with a cup of sausage gravy. The main plate was delicious and very filling. The biscuit was a little unusual. Not sure what kind of flour they use, as it was more of a tan color inside instead of the usual white, and while it was very light and fluffy, it was VERY crumbly. It was different from any biscuit I have ever had before.. The crumbly-ness of it made it hard to eat with the gravy.  Service was so so.. They man who came over with my menu when I first sat down, was very helpful. I let him know I was a first timer, and he gave me a little low down on the place and the menu. My waitress (Pam, I think), did an ok job but never did come over to offer a tea refill (until I was getting up to pay). My main complaint with service was that I was offered toast or biscuit/gravy, but was not informed that the biscuit/gravy would be an additional 99cents.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KnqLjBIIhe_Orqs6XFZ-NA"
  },
  "yNhP_LBh3cX-yeiZ77Hqew": {
    "date": "6/8/2012",
    "text": "Service is good and friendly also.  Each of us got a personal greeting when we walked in the door.  We went with a 4-person lunch crew, and we ALL liked EVERYTHING we ordered.  The fried fish was crispy and flaky-tender.  Onion rings, we could smell the beer batter.  Potato salad made in house.  Pastrami and cheese sammich was a winner.  Green chili burro was good, but the \"red chile\" bowl that came with it was even better.  Portion sizes are a good value and taste is even better.  If you are in the area, you should stop by and give these nice ladies some business - we need more places like this to stick around !!  P.S.  Corrected info.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "jfGevhcYLxY13Fa3drpzoA"
  },
  "yAP0tX6xuAd4MjkGdqIauw": {
    "date": "4/21/2015",
    "text": "This place is AMAZING! !! Underrated. . Great home style cooking .. Friendly staff.. Perfection to its finest",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4WbaUQUhqt1XtxyAJMb_lA"
  },
  "VW7Zxrg8h3hMBAlE8AnCZg": {
    "date": "3/26/2015",
    "text": "Food was good and well prepared. The service was very friendly but a bit befuddled. I had ordered avocado to be added to my omelet, and the waitress noted it, but the omelet came with no avocado. The bill didn't include the avocado either, so no big deal. Portion sizes were large and filling. Food was well presented. The only drawback was that I had two different people ask me if I wanted to take my drink to go, giving the impression they were trying to rush me out as soon as my meal was finished. The restaurant wasn't crowded, so it seemed a bit odd. But overall, a nice dining experience with True \"comfort food\".",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IaCrdO80MUoYaPPymqwZrQ"
  },
  "ox9TfVKlykbrQbqFzBQ23A": {
    "date": "9/5/2015",
    "text": "Way over due, been here about 4 or 5 times never disappointed, never waited more than 5'minutes for a table even on the weekends. So delicious, the gravy!! Friendly staff. Only knocked one star off because our most recent visit seemed to take a lot longer to get our food/drinks/boxes. But other than that, this is my go to for breakfast on the weekends.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W6F-hJTDVKCU8vajEtbKug"
  },
  "H-X27eyaKombKWNGS1d8GA": {
    "date": "8/20/2015",
    "text": "Its decent but not great. Food usually needs seasoning. My girlfriend ordered a hard boiled egg with her salad. It is not on the menu, so they did us a favor for sure. But just say no, they did it they even cooked it to order. They also sent it out still in the shell piping hot. Why wouldn't you take the shell off? Just little details that this restaurant could work on. It has potential to be truly delicious if they put the effort in.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GDgP6uaNKmqGTbiHRJfhNQ"
  },
  "_GifBPgWRrreTCmryqUGqw": {
    "date": "12/9/2014",
    "text": "Just had my first meal from this establishment after finding one of their flyers in my door. I got the French Toast with eggs and bacon for takeout. Everything was hot and fresh. The generously-sized bacon strips tasted wonderful, and the eggs were just fine. The middle of the French Toast was kind of mushy, but oh well. Some people like it that way and it still tasted great. They're a little (emphasis on \"little\") bit pricey for what you get, but I'm definitely planning on another trip.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jp_iVkai-ja70icN5ahvhw"
  },
  "Cv7HbyB-S0_hmYYipRxRdA": {
    "date": "7/10/2014",
    "text": "The chicken-fried steak topped with green chile pork was phenomenal. It was accompanied by perfect hash browns and two eggs cooked just right to order. Instead of toast we opted for the biscuits and gravy- an amazing upgrade for just 75 cents more. We headed out the door as full as if we just had a Thanksgiving feast. Oh, and we were holding go-cups of the drinks we had with our meals. Excellent service and management at a place that does it right.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1VNFh8ch36AjWQ7G8Oz1Tw"
  },
  "FlUlzreC49mEAioRJleLlQ": {
    "date": "12/2/2014",
    "text": "Have been here numerous times and love the breakfast food! My boyfriend can't get enough of the country fried steak and eggs, also the southwest version. I'm a huge fan of the veggie omelet, always such a fresh vegetables!! Ask for your hash browns southwest style and they chop up peppers and onion and mix those in. Yum! I've never tried anything from the lunch menu but they have recently expanded their menu and it is tempting if I can straw away from my love for breakfast food. Always, always friendliest of service. Has a mom and pop shop feel, you go to the counter to pay your bill. Adorable little place that's always on my good list!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fw2tuIZjSnQkvpYxOpBpUg"
  },
  "s9VvnrYv67C9OYK3jxQyGA": {
    "date": "4/11/2015",
    "text": "Dropped in for an impromptu lunch today. The service and the food was what we would have expected, Very good. Thanks for a great dining experience and we'll see you again soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sEyyJfPayDvacYa89rDF9w"
  },
  "S3lumkWs-savEEIhIFFgwA": {
    "date": "4/4/2015",
    "text": "Went there today for the first time. I had a Denver omelette  which was very good. Everything was cooked perfectly, and the service was very good. What really stood out was the coffee. Some of the best i've had in the area. I would highly <a href=\"/redir?url=http%3A%2F%2Fwww.uber-az.com%2Fvehicle-inspections%2F&s=ba8d0f2d04e6d5e316077e1b428f47f24a76809d148bb8111585df069e50dca5\" target=\"_blank\" rel=\"nofollow\">uber-az.com/vehicle-insp...</a>",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PSsJ58tNaFu_cp5BS-rphw"
  },
  "NvU1WsaRdjeyW7ojkxJC_A": {
    "date": "8/17/2014",
    "text": "Our family's all time favorite breakfast spot with chicken fired steak & gravy to die for!  We tried other menu items, all good, but now we all fill up on their chicken fried steak 'light' that comes with crunchy good hash browns, egg & toast.  The full size CFS is too large.  The cooks are talented in 'Real Arizona' style food.  I felt comfy and at home on the first visit.  The AZ western art decor reminded me of my youth and a little cafe in Page, AZ Mom used to take us to.  The wait staff are friendly and efficient every time we go.  Which is every other weekend for two years!  Ok to be honest, once in that time the kitchen messed up our order and another time a new waiter wasn't on the ball.  But RHG always attempted to make it right for us.  Go try RHG for quality Arizona cafe style food and you won't regret it. There is parking in the back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4k96hr2XzTl4EkFj-TLkaA"
  },
  "LiSbxbvEd0gJIsBKe5D1GQ": {
    "date": "6/25/2012",
    "text": "So badly wanted this place to work out, because of the proximity to the house, but it just didn't fare out as much as I hoped O_O womp womp. I need consistency in the restaurants I visit, and after a couple of visits, Ranch House Grille got progressively dissapointing.  First visit: we ordered the half order of the chicken fried steak breakfast and the fried chicken and waffles. Yum! Loved that the half order was perfectly proportioned and at $7, perfect price. This visit topped it off and made us want to come back the next weekend.   Second visit: womp. womp. womp. This visit may have been a bad day for the chef because not only did they have to recook our chicken (leading to a really long wait) but the biscuits and gravy order was just not appetizing at all. The biscuits were so dense that after a while, it was actually tiring to chew!  So I don't know.. I need more Arcadia/East Phoenix brunch options.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mAB2w4Er2fL5PmTIvMdE_g"
  },
  "9FOqn1M26AtFa5cnqcmoxw": {
    "date": "5/14/2015",
    "text": "As a frequent traveler I eat out most every night, and I always try to find a local restaurant where I can get a good home cooked meal.  Well friends, I have found my new home away from home.  First time visiting this restaurant, but most certainly will not be the last.  I will definitely return for a great meal the next time I am in the Phoenix area.  Had the chicken fried steak, which came with fresh mixed vegetables, mashed potatoes, and Texas toast.  A most excellent meal...  The service was great, and the waitresses was very friendly.  I would recommend that you stop by and give this little gem a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ecFOD5j7SdTHNtIIEanM3w"
  },
  "9Y8b5cvVPf2vhUsGa2L2Zw": {
    "date": "7/19/2014",
    "text": "The decor isn't gonna blow you away but the food will knock your socks off. Their green chili pork is ridiculous. Service is always good. Rarely a wait. And they deliver!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UoFxbcINqAnyzmQVF6V8vA"
  },
  "Wzo8wLKhFejaIy_reDptuw": {
    "date": "8/29/2014",
    "text": "I've always had excellent service. The superb chicken fried steak, classic diner like setting, and affordable prices are what sets this place apart from the Old Town breakfast joints. The parking can be difficult during the weekends, but there is an abandoned strip mall parking lot across the street with plenty of spots available.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6paUV2gA4H2oNbSpQmtxsw"
  },
  "vCX_RR9IX_TRKUEpALCV0w": {
    "date": "8/16/2014",
    "text": "Food was great. The atmosphere could use some attention to spruce it up. I would recommend this restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hmat1aWi3kq_VYJEgjGwoA"
  },
  "BWBtjsH4ZB8zaNQ9wPsHWA": {
    "date": "6/19/2016",
    "text": "I love this restaurant, however today was horrible. We waited 20 minutes to order. We had ask other servers for refills because ours was ignoring her tables. The table next to us had the same server and got 2 out of 3 of there order after an hour and were still waiting when we walked out. We finally got our order an hour after ordering and we got 1 1/2 of our order after we flagged down another waitress to ask for it, and it was cold because it was sitting at the pass for awhile. All the other waitresses were getting there orders out on time and hot. When we complained the waitress said this is what I have ready I can't make them cook faster do you want to talk to someone else. Similar response from the manager and counter person. We walked out.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pgi0AjI08hF3RKifWnIlCQ"
  },
  "e49scim3M4C0i4wdfNuz3A": {
    "date": "3/19/2014",
    "text": "Great place to go for green chili, super tasty!  Also, the omelettes are fantastic, very fresh and good sized portion.  The service was friendly and efficient.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "uetcvDjcnAMnq072Vf9xPQ"
  },
  "2yfVY8GVqtCfvZEDoTcWHg": {
    "date": "10/4/2014",
    "text": "So glad I chose to come here. It was delicious.  I got the southwest chicken fried steak and a side of biscuits and gravy. The other plate ordered at the table was corned beef hash. Both plates were phenomenal. The service was great, the flavor was great, and the portions were good. It was a bit pricy for the ambiance but $32.00 for two people before tip is still decent, all things considered. Can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WHCTZkug0YfO8uUdYlsqWw"
  },
  "39uSEop0ujyPqVydESvQUw": {
    "date": "8/16/2019",
    "text": "Out dated breakfast joint with big prices. $14.00 for Corn beef hash burnt and salty. Asked for rye toast instead got dry toast. Hotel prices in a old setting. Go to Butterfields",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0rQFQGh1VACmAGtN9kN5rg"
  },
  "CBay-oQ99KDsE5ShcTbI-g": {
    "date": "11/19/2018",
    "text": "Warning!: their prices online are not their actual prices!!!! beware!!!! never again will i be ordering from this place!!! i went online to look at their menu and was interested in the chicken tenders. so i called and placed my order. i get to the restaurant and the lady says \"it'll be $15\" what?! your menu says $9.99 for the lunch meal!!!!  $15 for chicken tenders and fries?! who does that?! you all just lost a loyal customer. never again will i order nor recommend this place again!  if y'all wanna pay an arm and a leg for some mediocre meal go here!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cix4taxC7W2Bht_m2msi2A"
  },
  "jvx9ro5s16NxBaZXBll92w": {
    "date": "6/17/2018",
    "text": "This place is the real deal. Amazing food. Perhaps the best southern biscuits and gravy in the phoenix are. I came from the midwest and for all ten years I have been valley i have searched for the good stuff here. I found it today at Ranch House. Soft flakey biscuits, substantial gravy, accurate flavor. The texas style french toast is also amazing, thick slices lightly sweet batter. Not going to say it is as good as grandma's but a darn good substitute.   It's a casual place with ample table space and rustic decor. The staff is pleasant and generally attentive with our rushing you. Prices are fare and you get a-lot of food for the money.  Over all highly rated and worth-it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "f2TnoexoBNV1H4shoAUN_w",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/f2TnoexoBNV1H4shoAUN_w/o.jpg"
      }
    ],
    "user_id": "4nFAqlAy0rdMSmAKALHzJA"
  },
  "qbnk5vo5xU9KoheF-z4ZPw": {
    "date": "3/28/2019",
    "text": "First time here. It's a little place and very clean. Service was friendly and attentive. The server was on top of the coffee refills our cups never went empty. The food all came out fast and exactly as ordered. I had the Huevos Rancheros.... OMG was it great the green chili sauce was for sure the best I've ever had. The Rancheros comes with three eggs, rice, beans, and hash browns. Beans and rice both homemade and delicious. Portions size is giant, the price is a little more, but it's definitely worth it. A must try if you are looking for local home cooking!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ynKM7yr-ila2NPfFGucXfQ",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Veggie Omelette",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ynKM7yr-ila2NPfFGucXfQ/o.jpg"
      },
      {
        "img_id": "qJd3uUKTRIlAwVbYK0Z20Q",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Bacon and Eggs",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qJd3uUKTRIlAwVbYK0Z20Q/o.jpg"
      },
      {
        "img_id": "caZxUupQPJV8b6xduK87gw",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Huevos Rancheros",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/caZxUupQPJV8b6xduK87gw/o.jpg"
      }
    ],
    "user_id": "PqJ_4wjooGMK2YwkEW7PyA"
  },
  "BnGWf-dcWliP_OyTHOhXyA": {
    "date": "4/22/2018",
    "text": "Today was our third trip to Ranch House Grille - we keep coming back because it's been amazing every time. The food and the service are both top notch. They have a small outdoor patio (about 5 tables), which is dog friendly. The menu is large, but not intimidating.  My personal favorites are the biscuits and gravy & the strawberry Belgium waffle.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jQjuysPsJRdeUGkvSEIOcA"
  },
  "MbQcpPlubqj22BtvNznaGQ": {
    "date": "10/23/2018",
    "text": "After a fun Friday night out I awakened on a Saturday morning in need of a hearty breakfast. The craving was for Fried Catfish and Eggs, which is not an easy thing to find here in the Valley. I turned to Yelp for assistance and Ranch House Grille showed up in my feed. After seeing pictures posted by others I was SOLD! Let me just say that RHG did not disappoint. From the moment I walked in everything was absolutely Fabulous! My coffee was divine, they had flavored creamer. My food came rather quickly and even though I was dining alone my server Annette did not forget about me (which happens a lot when you dine alone), she made sure to check on me often  I watched as she greeted a few regulars who came in like old friends and instantly started writing this post in my head. THE FOOD was also amazing! My catfish was perfectly seasoned and fried! The eggs were fluffy and the hash browns were delightful. The star of the meal however, was this individual biscuit and gravy that I ordered, I wanted to drink that gravy! I decided not to, lol!   Five Diamonds From Me Here! This was an incredibly fabulous experience, will absolutely visit again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "e-j73ZDgOcL_Hlg5y-FZMQ",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. YumYAY!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/e-j73ZDgOcL_Hlg5y-FZMQ/o.jpg"
      },
      {
        "img_id": "zeP_HI-MpTo9zihRLcQSmA",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. To Good To Even Stop Eating To Take The Picture  Gravy Was Almost Drinkable!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zeP_HI-MpTo9zihRLcQSmA/o.jpg"
      }
    ],
    "user_id": "EQ-eglc90E9C8Y0Ki4IpVw"
  },
  "3dWktwMEHeSlGZBXh3z9eg": {
    "date": "8/29/2019",
    "text": "My boyfriend and I dine here about once every 2 weeks. They offer a great selection on the menu, so I don't seem to find myself eating the same dish each time we visit. Today I discovered their \"award-winning pork chile verde\" and my life will pretty much never be the same! To say that I hate onions is an understatement, and much to my surprise, they have masterfully created this menu item WITHOUT them! I had ordered it on top of the veggie omelette, and there was enough to also eat it with our side of homemade potato chips and my boyfriend's bacon cheeseburger. I cannot wait to go back now and try the pork chile verde on top of the chicken fried steak, and then maybe on top of the meatloaf, and then maybe even on a salad. The restaurant is always clean as a whistle, and I appreciate that the servers have come to know us. They even recall our beverage order upon seating us. It's not fancy, but with great food, great service, and a strong sense of community, it remains a go-to for us.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "znjVl3zRhR2fBBBxlD2bCg"
  },
  "-8Cq-t5Cwn-T0iqplJGR7A": {
    "date": "3/24/2019",
    "text": "I could have sworn I wrote a review. This place habits an abundance of food reasonable cost then when you leave you want to go home and take a nap. I definitely recommend the chicken fried steak and eggs, the fish and chips and any number of burgers.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1VeI1gx9MkRzdm4_I1TLMw"
  },
  "JKBSVJeElj-D0NmgXCXWMA": {
    "date": "8/14/2017",
    "text": "Nice little breakfast place with tons of menu options.   Thanks The service was okay, overall they served us well and we're attentive. We went on a Sunday morning and they were busy which explains why it took a while to get a coffee refill, getting our menus and taking our order.  The food selection and pricing was good. Tons of menu items to select from. Portions are huge and well priced.  It was a little out of our way but we would definitely go back if we were around the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "v6ooG_1G4CbW3qv-HgzDXw",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Southwest chicken fried steak, so yummy!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/v6ooG_1G4CbW3qv-HgzDXw/o.jpg"
      },
      {
        "img_id": "KzLytVoHSOcp6fZY4oyLaw",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Steak, super well priced and tasty",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KzLytVoHSOcp6fZY4oyLaw/o.jpg"
      },
      {
        "img_id": "TgnOhw_r_AEJkvb_qWpXqg",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Healthy choices",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TgnOhw_r_AEJkvb_qWpXqg/o.jpg"
      }
    ],
    "user_id": "sTvGHkUu1u1_SWUstqafjQ"
  },
  "2zfCxmIzB1rkBAsMf5P9rQ": {
    "date": "7/7/2017",
    "text": "We really liked the food here, so much that we came back a second time during our trip to the Phoenix area. The food was great, and I especially liked the waffles and chicken plate.  It is a bit \"divey\" inside but the workers were very nice. Parking was also a bit of an issue as they only have a small number of spots in their lot in front of the place, so we ended up parking at the business next door on the right that had a big lot. Seems like others were doing this too.  They have some outdoor seating but it was too hot when we were here so we dined inside where it was nice and cool. They have tables and also some counter seating available.  If ever in the area again I'd come back for sure. It is a good place to come after an early morning at the Zoo or the Botanical gardens as it is close by.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "4tYAfUUGgXbV4_I0HhNvTA",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. So good!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4tYAfUUGgXbV4_I0HhNvTA/o.jpg"
      }
    ],
    "user_id": "L80Godmtx0M7RCpDLjOw7A"
  },
  "rQy2C40xURLlZvtPjskJ9A": {
    "date": "3/4/2019",
    "text": "Came here with the family before a Cubs game. All five of us enjoyed our breakfasts. We came again a 2nd day.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "IHtRR77Yfe35kUkp7tEzqQ"
  },
  "HttzwdTV3gF6No-Jw-wdUA": {
    "date": "1/12/2018",
    "text": "Great breakfast spot!! We aren't usually on this side of town but since we were, we wanted to take advantage of a finding local spot (thanks to Yelp). This one did not disappoint.   Cozy, family atmosphere. Not too crowded - about 1/2 the tables wwre full at 10:30 on a Friday. Reasonable prices especially for the amnt of food you get. We both coyld only finish half of our meals.  Our server was friendly & very attentive.   I had the Spicy Tortilla. Amazing! My husband had the Huevos Rancheros. Equally amazing!   The Southwest Chicken Fried Steak looked wonderful and that is what I'm getting my nxt visit. Yes, we will be back! I highly recommend this place for breakfast!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4uaZ8Ui3_EFX5G3ND5z36w"
  },
  "zITaGWHs5Xk5bqUp8qAK-w": {
    "date": "2/3/2019",
    "text": "I love supporting local businesses and this place had been around for over 20 years. This place has a great staff and good food. Generous portions. Want to eat Southwestern? Really eat SW? Try the SW chicken fried steak. The sauce is homemade pork chili verde. They make their own and homemade salsa. Get there early. Dog friendly covered patio. Lisa menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GowYMkTI6z_9Ds3oTX1b7Q"
  },
  "IWNbPj__3KTLIxHbJCTtsw": {
    "date": "8/14/2018",
    "text": "Best place ever love mom and pop like places and this is like that but Oh.. My ... Goodness.. they have an amazing green chili .. that is the best to put on everything and anything you get  Lol",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oB29FXEaPefgjyuVPRT8eA"
  },
  "PivNl8D5SnSfAbLOJbQT_g": {
    "date": "3/14/2019",
    "text": "Nice country looking place..for breakfast..big portions of food!!Our waitress was very friendly.. Annette..did a fantastic job...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-pjcLZwPZp5gXilGZUCvCQ"
  },
  "1dftEhQ9IAjoR6Rzr2tuTQ": {
    "date": "10/25/2018",
    "text": "As usual, food was delicious. I tried the Irish burrito with corned beef hash, onions and eggs inside. Yum!! I got a side of sausage links as well and they came with 4 links that were cooked perfectly. I love this place! My only complaint was that the online menu said the burrito is 9.99 but I got my bill and I was charged 12.99 when I picked it up. $3 price hike is pretty significant. Sausage was nearly $5 and my tea was $3 so breakfast was over 20 bucks. But....it was delicious.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "OvYN86BmZyP87SaTO7mHkQ"
  },
  "lB7d3CjjuzTWRpmB6tL_Bw": {
    "date": "4/29/2018",
    "text": "If you take eggs seriously this is your breakfast spot.   I order my eggs over med, at most breakfast places this can be a toss up of what will actually come out but I can rest assured my eggs won't be undercooked which happens sometimes if you order over easy. I went with a group of 8 and everyone's eggs came out perfect just as ordered over easy was perfect, over medium, etc..   My friend has been coming here for many years and suggested I try the southwest chickens fried steak. Wow the green chili that smothers the steak is next level I could eat a bowl of it alone.   This is a original breakfast spot with good home style feeling and great people.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "P3jAg6Z6J12MiCBEyLNNBw"
  },
  "oZ2VL9YOYbUY1GRW8oUbBA": {
    "date": "3/11/2019",
    "text": "The Ranch House Grille is The place to have breakfast or lunch.   It's a great way to start your day!  From their famous chicken fried steaks to healthy choices and everything in between.  There is something for everyone on the menu.   YOU REALLY GET your money's worth because the PORTIONS ARE HUGE!!!  For the burger fans....the burgers are CERTIFIED ANGUS beef!  Nice tall iced teas, cold refreshing lemon aid, great coffee.  The staff is friendly and fast!  It has a warm & inviting atmosphere with southwest decor.  It's a great place to bring your out of town guests.  I highly recommend The Ranch House Grille!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Fz3343F9mMaBWYMr_3tiXA"
  },
  "NrmhAYV4PM_eWQ5Dd-2Wlw": {
    "date": "1/14/2019",
    "text": "This place is just awesome. Awesome food, selection and service! Portions are huge ant the price is right!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5ftYx_Jck9jKeSYFyPVeyw"
  },
  "_VRQDk0M7jE5WDlRklxvfQ": {
    "date": "4/6/2018",
    "text": "The food was good and they have a nice selection of pancakes.  The place has a bit of a run down vibe but the road construction out front was probably a major factor in the ambiance.  The price is fair and the portions are generous.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mpIcm8fM2eXN8JbRd-30bw"
  },
  "XhF7Of5VJMCD8XlnClnA3g": {
    "date": "8/25/2012",
    "text": "This morning, I was on a date with 'self'.  I was in between clients and had a good 2.5 hours to spare and I was starving after my 3 hour massage session.    The Ranch House Grille is a homey place and the waiters are very attentive even before you are seated!  This morning was no different.  The waiter was so friendly, I thought he was going to ask me out, which was not an issue.  Friendliness over moodiness any day!  I have been about a dozen or so times with my clients to this country bit of a cafe in the Arcadia/Biltmore area.  The eggs are always fresh yet the coffee isn't worth a bean ~ AND I LOVE COFFEE!  I adore steak and eggs and the steak is less than moovelous ; -(    SOOO, I'll try the pancakes next time.  I like to stay in my neighborhood when I go out to eat, it will be worth another shot!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "COF3FhGUWVm-XxHkI80ciA"
  },
  "GExdr0skUvuaQxEeHB34bQ": {
    "date": "10/20/2015",
    "text": "Great breakfast in bed at our hotel from Ranch House. Great order taking and prompt delivery. Definitely consider them as an alternative to your hotels complimentary breakfast.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kz48Yw2w5sKT95a8yEIRKg"
  },
  "VndzPx3ngZJ9e5ZxZ020Zw": {
    "date": "3/17/2015",
    "text": "The chicken fried steak breakfast place is my boyfriends favorite dish ever, I had just the simple breakfast with eggs and bacon. We haven't eaten lunch here but can definitely vouch for the breakfast. Service was great, didn't have any issues with refills on coffee and anything else we asked for. Place gets pretty busy on weekends so head over early. Will definitely be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "epX4X5X_7JYIa8u7FAr2iA"
  },
  "PTiXzzAibAMp8etKxHPXZA": {
    "date": "4/5/2013",
    "text": "Just as advertised, exactly what we were looking for. Small cafe style, excellent service & small town feel. Good food generous portions & homemade taste.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "orO4O_7InPaJk32SJk2XYA"
  },
  "YmAJiY6QjpqR0BlWWvGkjQ": {
    "date": "11/10/2015",
    "text": "We order the green chili omelette. It was awesome, the best, and great customer service. highly recommended!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xlErhLFkdZpttQcqNk2JBQ"
  },
  "noI8c3HAHLqM3ZsJ-obm4w": {
    "date": "11/6/2016",
    "text": "Wow! I had the Southwest chicken fried steak with eggs, hash browns, and pancakes (I got blueberry ones) and my husband had the fried catfish breakfast! Yum, yum, yum! Sourdough toast was relish! Friendly waiter too! We are here from Texas and will definitely come back next time we are in Phoenix.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "28pCu_sxNSk2OdsAm_SOlw"
  },
  "TcqDfHlETQ3akjpVXi1CRw": {
    "date": "11/21/2014",
    "text": "I go here for breakfast at least once a month. If you're in the mood for a big plate of breakfast this is the place to go. I love the chicken fried steak covered in pork chile verde sauce. Service is always friendly too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vr4ZY4tFSerRbMGkHmoKmQ"
  },
  "OK-cYEPN2c0Hr9UdLjw81A": {
    "date": "7/11/2012",
    "text": "If my neighbors, Joe and Craig (like you care what their names are) hadn't discussed this place in my presence, I wouldn't be here today. I ordered the huevos rancheros, and my husband ordered the steak and eggs. He loved his breakfast so much that he barely spoke.  I loved my breakfast. And I mean, loved it.  Out of a sense of duty, i offered the hubby a bite, and luckily, he was too busy devouring his steak and eggs, thus declining.. My huevos rancheros had perfectly cooked (over well) eggs on top of corn tortillas. On top? A delicious pork green chili that was to-die-for delish. In addition, you get rice and beans, AND hash browns!  Yummy, yummy, yummy!  The place is darling, very comfortable and has very nice personnel that are will to please.  We've already been back, and it was just as good the second time as it was the first! This place is a winner!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "EfGC2QTeePSn3-NhObhRcg"
  },
  "q4cw6XdcgekbciO8cLlGlg": {
    "date": "1/1/2016",
    "text": "Great spot for breakfast or lunch! Mom and pop owned and operated, and great attention is paid to their food quality. If you go, try Burke's Catfish sandwich! It's a tasty (and large!) sandwich. You won't be disappointed. (If you go on a weekend, get there before the rush. This place gets packed).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zaY_2idt1iaa_T__5VMgVw"
  },
  "PgFNvew5jzByAgTwML8kxg": {
    "date": "8/6/2010",
    "text": "Poor guy that was waiting on tables was by himself the day their Groupon went live. He currently has 9 tables for lunch. We'll see how the food is....  It was really good. Chicken fried steak. Yum.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "d35PeG8-qLIzcHcgOnZCXQ",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/d35PeG8-qLIzcHcgOnZCXQ/o.jpg"
      },
      {
        "img_id": "HZGJI89xlo5zjDU-6I_5vQ",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HZGJI89xlo5zjDU-6I_5vQ/o.jpg"
      }
    ],
    "user_id": "aOvAMSHkonbQa2QQSVbibA"
  },
  "m7mGal0seJ6DKj2aHtHrAw": {
    "date": "2/21/2016",
    "text": "Outstanding breakfast joint!  Getting anything on the menu smothered in their award winning pork chili verde is a must.  Every time I come here I feel like I'm in a small town eating at a hidden gem that everyone talks about.  Great service, even when they are busy.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "MVZj1RprovyuuDIX950VXg"
  },
  "zzYnWF10rsEq6up3YAYGiQ": {
    "date": "8/28/2016",
    "text": "The best homemade corn beef hash ever had! Great atmosphere and you can even get catfish and eggs!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YuBjZBra3RUDzPZuhsxIwA"
  },
  "e91tG08pEeSiqLD6dull1Q": {
    "date": "4/5/2015",
    "text": "This place is like a hidden gem, hiding in plain site as its on a busy street. Everything was better than expected.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T8XILAmS-HcxIpbuDUPkPQ"
  },
  "KwEhlL8Y4kRj9p479srKsw": {
    "date": "4/2/2015",
    "text": "Love this place. The chicken fried streak is awesome. They also give LARGE portions. Parking can be tricky around 9ish on the wkends but other than that, this place is great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cjzjOubh5VPSNHl4O7k5IQ"
  },
  "GY4g-YvnKMHfcoHiL0Yl7Q": {
    "date": "2/26/2015",
    "text": "I really liked this place. Food is tasty and hearty - we left really full!  Biscuit and gravy side (instead of toast) is not shy on the gravy portion!  Their pork chili verde sauce is really delicious - we'd never been here before and when the waitress found out, she brought each out a little sample.  Really nice of her!   Country music on in the background.  Inside is a little plain, but it's clean and pleasant enough. I had the southwestern chicken fried steak, which was delicious, and came smothered in their famous and delicious pork chili verde sauce.  The hashbrowns were perfectly crispy, but could have used a bit of salt/seasoning.  Thankfully, I had plenty of gravy from my biscuit with gravy side to spare, to top my hashbrowns off with.  My friend had the omelette special of the day, which had bacon, jalepenos and jack cheese - he opted to have his smothered in the pork chili verde sauce as well.    The waitress mentioned they offer delivery service for only $2 - so we got menus to go, just in case we want to have some delivered to our hotel room before we go.  Yum!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kz17__AxsgjQ_h0NO9k0Ww"
  },
  "E4AMcgFOookheFX2HHUL_w": {
    "date": "3/26/2015",
    "text": "we bought a groupon for RHG and weren't sure what to expect.   What we found was a very homey atmosphere and a cute waitress who treated us as if we were family.  The food tasted as if you were in someone's home as well.  Nothing fancy but still very good!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4SxcUfHAVHzMBqb6TtNPQw"
  },
  "H4nUnhN9fq7CobhJMtAfbQ": {
    "date": "3/17/2010",
    "text": "This place is just down the street from my house, so we finally made our way over here to check it out, as my partner and I both love a good brunch.  I don't think either of us will be back. The wait was only a couple in front of us, but took almost 25 minutes to be seated, and the way the restaurant was laid out, we had to basically stand in front of the door while waiting.  Also, I had to chase down the waiter to even get on the wait list.  Once seated, I opened the menu, ready to get the black bean burger I'd seen online...their only non-egg vegetarian item.  I had purposely scouted the menu online before coming in, since they didn't seem super veg friendly.  Yeah. Apparently, they no longer serve veggie burgers. Nope.  So when I asked our server, as a vegetarian, what I could get, she told me there was some sort of dish that one of the servers made with cottage cheese, mushrooms and avocado.  I had no option but to ask for that.  When it came out, after a good deal of time, it was a small cup of oily mushrooms, a plate with half an avocado on it, and a small cup of cottage cheese.  Um. Gross.  I stole a piece of my partner's toast, mixed in ketchup with the mushrooms, and put it on the toast with a little avocado on top. It was ok, but I could have made it better myself, and for less than the almost $7 they charged me for my \"meal.\"  Add to that the homophobia and transphobia we felt, plus the coffee refill guy walking past my partner's empty cup not once, not twice, but three times, and we'll not be back. Which is too bad, because my partner love love loved her Denver omlette and hashbrowns.  Folks, it takes more than good food to make a good restaurant.",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZW217qAFcBZIFYQleDnm8g"
  },
  "D7l916eCRRI7jNqIo4UrVg": {
    "date": "6/28/2015",
    "text": "Great food and service. The plates are huge and it tastes homemade. Get the biscuits and gravy. The omelettes r delicious, the pancakes huge.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kzWbXDwF8GqaI6QLQPXB6A"
  },
  "qIWVGzph2b5NCHddsidLnQ": {
    "date": "9/3/2015",
    "text": "Service was wonderful, southwest chicken fried steak is what I ordered. It tasted great, then asked if fresh or frozen. Was told frozen, that brought me down. Later of day became bloated and had problems rest of evening. They say are known for best chicken fried steak, have to disagree. If it isn't fresh cut and made there, then it can't be the best.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F5OLxalr0N4hbhGo5075Vw"
  },
  "96OlOaWPrAxiuPmqtSlgmQ": {
    "date": "6/5/2014",
    "text": "For us, this is the best breakfast in Phoenix, and maybe lunch too. Packed with old time regulars who know what they like, this is a throwback cafe with a great menu and even greater food. Don't miss the green chile on anything, I like the pork chop and eggs. M'lady orders hash everywhere it is fresh, and declares theirs a winner",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "HwkJ5Mdkv9klRcWReR3dkg"
  },
  "9-zh-Vb_Lr416xWdr5u6NA": {
    "date": "8/9/2019",
    "text": "A Great Start to the Day  Today the family and I stopped into the Ranch House Grille (RHG) for breakfast. All I have to say is, what took me so long! RHG offers an extensive menu thats has something to satisfy everybody's appetite.  On this visit we had the Breafast Biscuits,  the Original Chicken Fried Steak & Eggs, and  the R.H.G. Breakfast Sandwish.  All our entrees were absolutely delicious and the portion sizes are very generous so come hungry.  The Breakfast Biscuits are served open faced topped with sausage patties, smothered in prpper gravy, topped with eggs and served with hash browns.  The biscuits and gravy are absolutely delicious and definitely enough to feed two.  The chicken fried steak and breakfast sandwich looked appealing and my family members confirmed their entrees were absolutely delicious.  Great service and reasoable pricing. I would definitely recommend if you're in the area.",
    "rating": 5,
    "rated": {
      "funny": 7,
      "useful": 14,
      "cool": 13
    },
    "photos": [
      {
        "img_id": "C3Se-jFl_GeVbMTKvM_GLQ",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/C3Se-jFl_GeVbMTKvM_GLQ/o.jpg"
      },
      {
        "img_id": "cUsmxFd4OB6FcjhmELOEZg",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cUsmxFd4OB6FcjhmELOEZg/o.jpg"
      },
      {
        "img_id": "S73kvaU3Qz4dq4wHDAZnkA",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/S73kvaU3Qz4dq4wHDAZnkA/o.jpg"
      }
    ],
    "user_id": "MMf0LhEk5tGa1LvN7zcDnA"
  },
  "E1WTgK9mbrk4C3Cx7QZ0rg": {
    "date": "6/28/2019",
    "text": "First, let me say the food was good and the people were nice.  Now that we've got that out of the way, some comments:  -$18 for loco moco and coffee was pretty steep - Serving was huge, 3 eggs, rice gravy, burger patty, hash brown,  and toast - I was surprised it came with hash browns...you don't see that in Hawaii.  That being said there were enough hash browns for 3 people - They could easily reduce food cost by eliminating one egg and all or at least part of the hash browns and that would get the bill under $18  Overall, good most likely somewhere between a 4 and 5.  But, the pricing was just out of line.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Lyj3OLJOGkqnjq2ZApa1lg"
  },
  "MZD0b9kRu7_Z0WIHU1lz4w": {
    "date": "4/10/2019",
    "text": "We tried this place for breakfast while visiting the Phoenix area because the Yelp reviews were so good and it was relatively close to our hotel. We were not let down. In fact, we liked it so much we ate here 4 times during the week we were in Phoenix.  The food was very good. Their Pork Chili Verde is phenomenal. Service was outstanding too.  I highly recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0_3KQG5DnBAxG6O8CC1t3A"
  },
  "kw6xZLnGCZJOe_iH-fkqeg": {
    "date": "8/24/2019",
    "text": "Love this place, feels like home breakfast, minus all the work and cleanup. Place is small but rotated pretty fast for seating. Have bacon pancakes this time and OMG so awesome!!! Service was fast and friendly and coffee is great",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "WOFthZJXf1dTIHerfUhCpg",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WOFthZJXf1dTIHerfUhCpg/o.jpg"
      },
      {
        "img_id": "MQMhNWhbf8tz7JkPSyEtXw",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MQMhNWhbf8tz7JkPSyEtXw/o.jpg"
      },
      {
        "img_id": "AH2iIfZnYZbyl8ThdHjo3Q",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Yum!!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AH2iIfZnYZbyl8ThdHjo3Q/o.jpg"
      }
    ],
    "user_id": "XmvKKMAkSwyhB9F_C1Ze-Q"
  },
  "c6cuWXbVoqpI9-UrXmlNpg": {
    "date": "9/3/2019",
    "text": "We stopped here on a whim on the way to the airport. I am so very happy we did! We came on a Friday morning and there was actually a good amount of people inside. We were sat immediately. The waitress was the only one but she was very attentive. The menu is huge! I had a lot of trouble deciding. I ordered the corned beef hash, now this is the worst thing our table ordered. It was okay, you can tell it came from a can. I had a side of biscuit and gravy. The gravy was so good! You could've convinced me we were in the south. My boyfriend ordered the chicken and waffle. It was a ginormous portion, definitely enough to share. The chicken was tenders not whole pieces of chicken. But the tenders were good! Nice and crispy. The waffle was very fluffy, tasted nice with butter and syrup. My boyfriends brother got the country fried chicken. I was most skeptical about this dish as instead of the typical white gravy, it was served with green chili gravy. This ended up being my favorite dish! The gravy went perfectly with the crispy chicken. I will mention, every meal was a huge portion. Everything could be split.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1pc2sy0Qt0djqwB6fDsd5w",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Corned beef hash",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1pc2sy0Qt0djqwB6fDsd5w/o.jpg"
      },
      {
        "img_id": "KgpBbXtaVP6bQZZlkVoomQ",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Chicken and waffles",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KgpBbXtaVP6bQZZlkVoomQ/o.jpg"
      }
    ],
    "user_id": "PBp8waf3zZ1C339zxPv3tA"
  },
  "JkWNJBI_V2R8lExuShKpVg": {
    "date": "5/11/2019",
    "text": "Nice breakfast here. Local hangout,  good food, hot coffee, exceptional service. Had the Light Weight with grilled chicken, egg whites, tomato slices and fresh fruit. The chicken breast was butterfly cut and grilled to perfection. Outside or inside seating. Parking much better behind the building. Old school charm and family owned. I will be back.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "mpLXFphxTu2f7ow2m_sWbg",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mpLXFphxTu2f7ow2m_sWbg/o.jpg"
      },
      {
        "img_id": "R23u1T114d6B4Wzzxf0BEQ",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/R23u1T114d6B4Wzzxf0BEQ/o.jpg"
      },
      {
        "img_id": "7kEqi3Q0OKXhetwTWAMupA",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Light Weight",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7kEqi3Q0OKXhetwTWAMupA/o.jpg"
      }
    ],
    "user_id": "LQi0uu43n0jSTulZFvXtwA"
  },
  "qMLNsYrVmuLT5ZYhhxKqLA": {
    "date": "9/1/2019",
    "text": "Cute ace, fast service, friendly staff and the food was great!! Highly recommended for breakfast!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WUz4x-QREvtl_mpI3neZxw"
  },
  "NcvidWjcS4Lz5C_XeyYKLQ": {
    "date": "8/17/2019",
    "text": "Service was fantastic, food for delicious, and the price was affordable!!  Come hungry and leave happy!  I love the complimentary to go drink too!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nN2PDIE2gqND1Q3W7URXVg"
  },
  "d_SCCuhglB51VRhFmuGtSw": {
    "date": "1/3/2019",
    "text": "I discovered this little gem from a work friend as it's right down the street from our office.  I would drive by every day and see their \"Honk if you love Chicken Fried Steak\" sign and laugh, but it never looked like somewhere I would ever go.  Man i'm glad i did stop by though!  It's super hard to deviate from their chicken fried steak breakfast because it's just that good.  so tender you can cut it with a fork and the flavors are perfect.  The white gravy is perfect and the green chili verde sauce adds a great lunch twist to it as well!  The staff is always friendly and greet you with a smile, the prices are very reasonable and you'll always walk away full.  Highly recommend",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "3IZC92G8kpoW0vBosH1i3w"
  },
  "m0225VPP7D5S0ByR6JXi2A": {
    "date": "8/10/2019",
    "text": "Stopped here for the first time and was so pleasantly surprised. What a great spot for some really, really, good comfort food!  We came for breakfast and I had the veggie omelette...YUM!  It was packed full of fresh vegetables (and no cheese so it felt pretty healthy)!  My husband had the Heuvos Rancheros ... YUM!  I had several bites of his breakfast and have to say it was one of the best chili verde I have ever had!  It came with rice and beans which were also great!  Be ware however....the portions are HUGE (so bring you appetite)!  Seriously, this is a great spot and I highly recommend it. Great food and great service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lPwuQvbhG0ZakRhjJMBI8A"
  },
  "rOuLLY8raVFbG26WKzF-jg": {
    "date": "8/3/2019",
    "text": "Visiting Phoenix and came for breakfast. Based on past reviews regarding portion sizes husband and I shared the chicken fried steak and kids got strawberry crepes with fresh sweet creme. Definitely glad we shared--they are very generous with portions! The food was fantastic. Their pork chile verde sauce is perfection and the steak was nicely breaded and tender. Children claimed it was the best breakfast ever. Wonderful coffee as well. And the service is second to none. So happy we found this gem. Will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0uV-EoAInIlXzK8cjp1wtw"
  },
  "a1_BS0i757HmG9af_r0kxw": {
    "date": "7/21/2019",
    "text": "I love that this restaurant is no frills, laid back old style coffee shop. The food is good, and the portions are huge. They even offer a mini menu that allows you to scale back your breakfast portion and save money that may have been wasted. The coffee is high quality for a coffee shop and the waitresses are always friendly. My favorite perk is that they listen to oldies from the 60's constantly and I never feel rushed to leave. Just wonderful experience overall.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Kblt8wABhgpyMFCzZj8UA"
  },
  "yJhGozHsJSv3Nvbd_ezW2g": {
    "date": "8/31/2019",
    "text": "Went here on my birthday with my girlfriend, sister, and cousin. And we were seated promptly and had our orders taken within a reasonable time. We saw how the one person on staff was swamped so we just tried to make it simple and ordered water and coffee for the table. Once we ordered however it took up 45 minutes for us to get our food while people who sat down after us had already got their food to them and were ready to pay. But again we did see how busy she was so we kept quit and waited patiently. When we finally received our food it was cold. Not just one dish, all of ours was cold. We told the waitress and she was quick to catch an attitude and told us how swamped she was and what we wanted her to do. We weren't trying to get a free meal or anything we just wanted to let her know.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WKwyesySDQ7ny1EFnBWtZA"
  },
  "hFkq4ZkSoz6GNg3V0HDKjg": {
    "date": "11/4/2018",
    "text": "First time here and it's a cute little breakfast lunch place that closes at 2pm. I got the Mary Jane's breakfast sandwich on sourdough and it was delicious! I also ordered the Cali Columbian Coffee because I thought it was a 'special' coffee drink like the amazing Thai iced tea. But No! It's just their house coffee! She gave it to me free so nice of her! Really friendly and accommodating. Will be back:)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EyNimK4-dh1l3Tec8O8DRQ",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Mary Jane&amp;#39;s Breakfast Sandwich with avocado spinach tomato and egg whites",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EyNimK4-dh1l3Tec8O8DRQ/o.jpg"
      }
    ],
    "user_id": "5l9NSEbIqvKcyvApsmj4tg"
  },
  "3INT4J95ZGo0pCTKE2rokg": {
    "date": "7/21/2019",
    "text": "First time coming to this place and the vibe was the greatest! The girl in the front she never said hi and after a few minutes she said she will get us a table and we stand there for so long and then she comes back ohh she said your table is ready and we seat and the table was not clean and she never offer a menu , second we seat there for a while and ask for the menu and she said ooh yea so we walk out of the place!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i6mHgPRKRQtnXJZgDk9R_Q"
  },
  "1kxEplBz8B6lL-uzrQefEQ": {
    "date": "7/20/2019",
    "text": "Cute atmosphere. Good menu choices. However, wayyyyyy over priced. Neighbors often say they would go more often if it wasn't so expensive. The food is good but not fantastic or at least not worth $14 for a burger. Prob won't go again",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vBKhv8d6HbYCWhT3jIeaVA"
  },
  "KAvKVDdw2upw_ErCloDkww": {
    "date": "3/24/2019",
    "text": "Best way for me to describe the RHG is: Solidly good, old fashioned comfort food.   Having lived in Scottsdale now for over five years I have probably passed the RHG 20-30 times, but had yet to eat there. Before deciding to try it for breakfast, I read the reviews, and as expected there were some complaints, but mostly the reviews were positive, as is mine. I am a believer that anyone can have a bad experience at any restaurant; Bad day for the server or cook, or simply mistakes can happen. It is always best to judge for yourself based on your experiences.  Being my first experience I must say that the breakfast menu is fairly extensive with a wide variety of omelets, pancakes, breakfast sandwiches, steak and eggs and other choices.  I ordered off the 'Light' menus and I must say the  use of the word 'light' was misleading. Mine was to be one egg, sausage patty and a pancake with crumbled bacon.  The pancake was huge and overflowing the plate. If it had been half the size, I would have been fine with it!    I did also order a side of a biscuit (no gravy), just to try one. The biscuit was very light and fluffy with an excellent taste. One minor complaint was the biscuit was so light it literally fell apart on the plate. But the flavor was very good.  Service was prompt, efficient and friendly.  If you are looking for large servings of basic comfort food, this is the place.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Hn0cuTVCml1jI4rbODSFlA"
  },
  "6RG9aiL9ug55WVOewck0NA": {
    "date": "8/24/2018",
    "text": "I eat here regularly ... the food is THAT tasty. Their pork chili verde is THE STUFF OF LEGEND! I order the RHG Breakfast Burrito - minus ham, plus sausage - with a bowl of the Verde on the side ... OMG.  Their portions are huge (see the Spicy Tortilla below), prices are reasonable for quality with quantity, and the place does a brisk business. Parking is tough, but there are spaces in back, and things turn over quickly.  Sooooo worth your time to investigate this locals' hang!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "66LDE_TPUleNppGR1KTevw",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/66LDE_TPUleNppGR1KTevw/o.jpg"
      }
    ],
    "user_id": "TT10Ye6UQIR5pDLRcx2FOQ"
  },
  "kvZqOWoJ_c_ZE1sd5jEQfg": {
    "date": "3/27/2019",
    "text": "Great food and great service! It was our first visit here, but it won't be the last. We arrived at 6 a.m. (opening time) for breakfast. The coffee refills were frequent; the pork chile verde omelet with hash browns and gluten-free toast was huge (two meals'-worth) and very tasty. My friend's corned beef hash looked delicious, and another friend's biscuits and gravy appeared quite satisfying. Our server was attentive and had excellent, thoughtful recommendations. Highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "syKO-UuC3YY1B3b8QdqSog",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Pork chile verde omelet, hash browns, and gluten-free Udi&amp;#39;s toast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/syKO-UuC3YY1B3b8QdqSog/o.jpg"
      }
    ],
    "user_id": "uY4PgHv88CDcVgflA3pHxQ"
  },
  "9wxK69gL2NDLQhtjy4wqBA": {
    "date": "12/6/2017",
    "text": "I've been wanting to check out the Ranch House Grille for some time now, ever since my boss raved about how good it was. I believe the original recommendation was about a weekend breakfast he had enjoyed. I finally had an opportunity to check it out at lunch time with one of my colleagues.  Ranch House Grille is just as cozy on the inside as it appears on the outside. And it's all perfectly in line with what you would expect in a breakfast/lunch type \"cafe\". More importantly, the atmosphere is relaxing and the dining room is clean.  Our server was very friendly too. It wasn't very busy, so I can only presume that the breakfast crowd must be their bread and butter. I hope I'm wrong, because the lunch menu is extensive. Ranch House Grille may only be open til 2:00, but the menu has several options that would satisfy any dinner cravings. In other words, I already know I want to come back for some breakfast... and \"dinner\".  Back to my lunch. I was in the mood for a simple burger and found a great option. The Crazy Bills was a single burger with blue cheese crumbles, bacon and lettuce, tomato & onion. The char-grille flavor is wonderful and the kitchen nailed the medium cook I requested. This was a delicious burger and the fries are excellent.  This was a very good first impression of Ranch House Grille. I'm sure I will be back with other co-workers and maybe my sons to check out breakfast. Thanks y'all!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "OZErOKA1RaH2J6flZhU-zA"
  },
  "NicomUwwYZ6uUWnLS5w3QA": {
    "date": "1/6/2016",
    "text": "I just ate at Ranch House Grille 10 minutes ago. I found them very sweet and friendly, all of them helpful. They gave a second glass of tea, which is important to me. I need a lot of water with food. The food was very good. I had biscuits and gravy. price was good if not better. Very generous portions. I noticed the eggs seemed very fresh and looked healthy like the kind I buy. I buy organic,  cage free eggs. I think we all need to start supporting non cruel practices. jmho. lol. I like this place and will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BjvHHoJLf2HJvsWZ3mTyvw"
  },
  "sxqcgeGYSx79SkYwqiws_Q": {
    "date": "2/9/2013",
    "text": "Generally, I am NOT a breakfast person, but I LOVE this place.    Pros:  Good Service, seating quickly, good time,  always taken care of .  They definitely do know the meaning of Customer Service! Always greeted right away, not too long of a wait, etc...  Cons:  my husband is not a fan of the biscuits here.  He thinks that they are more like dinner rolls than biscuits.  The juice leaves a weird after taste in my mouth, I don't know what that is, it's almost kind of 'soapy'   The chicken fried steak is better than good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "S84d5FZ-uYGChDaAavZkgA"
  },
  "atWD4igYcBKKgncIhVYe2Q": {
    "date": "6/9/2013",
    "text": "I've lived within walking distance for almost seven years but yesterday morning was my first visit to the Ranch House. I had received a $5 off coupon in the mail so I decided to check it out.  I was expecting it to smell of smoke from the recent building fire next door, but there wasn't even a trace of it. (The RH was closed for about 6 months after the fire.) I found a seat by a window, sat down and was greated by the waitress. I ordered an orange juice, one egg over medium (the waitress helped me order my eggs cooked just the way I like them) with buttered toast. I substituted the hash browns for a fruit cup.  Everything was great and almost free after my coupon! Next time I'll bring my Kindle to read while I dine. I might even bring Peekaboo when it cools off outside because I noticed a couple with a Great Dane sit down at a table on the outside patio. Dog friendly? It must be.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "-tBJZffckiQC6zhPlwVpVQ"
  },
  "BlGLIkAZkJYPHS8b1Yg2Lw": {
    "date": "10/7/2014",
    "text": "Service:  When entering the restaurant you are either greeted right away or are able to sit where you please depending on the time of day.  All servers are very attentive, friendly, and check on you frequently.    Food:  I have only been for breakfast but can honestly say I never leave disappointed.  The steak and eggs breakfast is just right when heading out for a busy day.  Steak is always cooked perfectly to order as are the eggs.  Also, the chile verde omelette is a fantastic combination of flavors.    Final thoughts:  The restaurant has seating inside and outside to suit your taste.  Service is always quick and friendly.  Pricing is extremely fair with great deals every week. I have never left disappointed and will always stop by when I can.  Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XbYquGwieSzQTLfykb8-2g"
  },
  "G7FI5t-6nDa07pMWqOSMLQ": {
    "date": "11/22/2015",
    "text": "Another excellent breakfast!! Eggs Benedict are very good. This place is clean, and food is always consistently good. The staff is very friendly as well!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GMfF7EtQ4_lYXNjXtM08kw"
  },
  "QC9yjmmP3BXOzb3VSn2riw": {
    "date": "7/14/2015",
    "text": "I have been coming here for years, as of late the prices have seemed to raise. I ordered an egg white veggie omelet, add avocado, side of 2 turkey sausages, and a coffee with no side. My bill was $23.00. The seems absolutely ridiculous, up charge for avocado and egg whites. These prices have turned me off of Ranch House, I will be eating breakfast at Kitchen 56 just up the road. They have breakfast entrees for $9.56 and the quality is great and food gets to the table very quickly. Ranch house has really started to go down hill, the prices are outrageous, the amount of time it takes for the food to hit the table is too long, and the hand writing checks is archaic. Very unhappy customer of many years.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VwgkI0wpzUppjmSlDmhl4w"
  },
  "lLAm2NIFAWNfdpVn09SQ7Q": {
    "date": "8/25/2014",
    "text": "Its been about 5 yrs since I ate there last before their fire there.  will say nice new refresh looking inside, but as far as the food had the red chile omelette with toast the omelette chili was cold an toast over saturated with melted butter, could only eat 1/4 of the meal even the cheese on the inside of the omelette was 1/2 cooked, should have sent it back.  Oh would I go back - will say very doubtful.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A0EncLDAlrzj82kKl-_DvA"
  },
  "wq4iRBiuZ6aQuBAL3Mvxlg": {
    "date": "12/11/2015",
    "text": "Wow! Best breakfast! I had blueberry crepes and he had steak and eggs. Steak grilled to perfection and crepes were incredible and bursting with blueberries. Waiter David was excellent and very very attentive and efficient. Highly recommend and moderately priced as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S8LIsjizMyzR-3xAqJGP0g"
  },
  "psLL-ohhXQ6i0pT7BCJGzA": {
    "date": "1/11/2016",
    "text": "After an excellent first meal at RHG, I brought the whole family this week. Another great meal. Highly recommend the southwest style chicken fried steak-tender,tasty and large.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w7030Cdhi1tRAKlfvjU9hw"
  },
  "YB9HtJH6su3CcpSIGiq0zg": {
    "date": "4/26/2015",
    "text": "I was far from pleased. The service was slow, the food was not hot...warm yes, hot NO! Some of the food was not cooked thoroughly and I asked for SOFT bacon and what I was given was almost burnt! I will not return nor will I recommend it!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ql93rV5Xodo3yiYQvK7H6w"
  },
  "6nDUJ15QsYx2IhkfMkwNsg": {
    "date": "2/14/2016",
    "text": "Great food! The biggest downfall here is their unorganized service when they are busy.  3 of us waited 40 min for a table, while they sat other people who came in after us.   Took our order within 3min of sitting down and then we waited another 25min for our food. Again, while other tables that came in after us got their food.  The log jam starts at the front with reception trying to seat people and cash out checks. Simplify, let the servers run the checks, and let the host manage tables.  Get it together Ranch House Grille!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nzEI7Odmkuffzm4egLOTZA"
  },
  "wdna2lrxIuipxT_t55w4jA": {
    "date": "3/4/2015",
    "text": "The reason I gave it three stars is because the peach cobbler was just terrible. And the vibe is for old rednecks so yeah three stars at its best. And that's mainly because the service was proper and they treated my granddaughter very nice.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qob38th2TJwOOFX3bbfUxQ"
  },
  "UK0BmSTmU2mCdZ9T8r6UCQ": {
    "date": "9/19/2015",
    "text": "Filling and delicious food. I'm eager to return to try more items from the menu, yet so far I keep coming back to their array of hearty breakfasts. Most recently, the French toast was outstanding.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eY6SPjejFVWbiiKEYjEScA"
  },
  "VZgsfQJONIUPczpIbTQwEQ": {
    "date": "5/4/2015",
    "text": "This restaurant is impeccable. The owners are experienced and knowledgeable. The staff is attentive and efficient. There are numerous regulars, and it is evident that they are well taken care of. Even in my time there, a server David has memorized our drink order and the usual requested fruit cup for the kids to tide them over until we order our food. It is a comfortable environment with meals that taste like you are back in your mom's kitchen. There is incredible cobbler made from scratch and SO MANY other original southwest style meals.   My favorite dishes are the California Chicken sandwich and the Atomic Chicken sandwich. The menu is flexible, and it is easy to customize your order to fit your taste.   I highly recommend this restaurant for food, service and staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "G3uA3ZrMeoE5w1l1OqFsrg"
  },
  "1JxOK55FwwvLhsGmCDL6Aw": {
    "date": "7/31/2015",
    "text": "The SW chicken fried steak!!!!!!!! Mike had the corned beef and hash which was fine, but nothing when compared to the SW CFS.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Pr1Ga7yn5AFFAXyRD63FA"
  },
  "jpsB5ajVAHHcWhJbcw32Hw": {
    "date": "8/26/2010",
    "text": "I'm dropping Ranch House Grill into the diner category, and in that category they rate a nice 3 stars.  The service was prompt and friendly, the prices were fair and the food was pretty good.  The huevos rancheros with roasted pork green chili was very tasty.  I would probably get that again if I were dining at Ranch House Grill again.  The diced green chili and cheese omelet was less impressive.  The green chili in the omelet didn't have alot of flavor and the omelet itself needed more cheese.  The shredded potatoes were nice and buttery but I like them with some crispiness, at least on the top and bottom.  These were a bit soggy but still good.  They just needed another minute on the grill.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 4
    },
    "photos": [],
    "user_id": "QuZbJquRtbY9O9JrB9NpxQ"
  },
  "2EYt7MltFKDlXz5lVWZn3Q": {
    "date": "5/2/2015",
    "text": "Decided to try this place based on a friends recommendation.  Stay away. The service was slow. And the food was awful.  Nothing was cooked as asked for. The server didn't even apologize or could care less that the only thing I ate on my plate was the toast.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OHrQym1a-fmcobvEw2hXjg"
  },
  "F5T9AYEinijaxHrO77w1hw": {
    "date": "5/13/2015",
    "text": "My new go to place when visiting the valley.  Hearty home cooking and fun and sassy waitresses!  Really just a nice relaxed atmosphere with great food",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RMqrUdfD4syPHLWHItkiZA"
  },
  "ykRzSedemGJI4JPN02GBLg": {
    "date": "8/8/2015",
    "text": "Food is pretty good. I like that its never too busy so theres never a wait for seating and food comes fast.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ht8c1bzqhO0t0NxzUls4jQ"
  },
  "rWsdLwCwD09VbC7lO2uzwg": {
    "date": "4/17/2015",
    "text": "What a great little place we discovered through Yelp.   I was practically hidden from view on a busy street.   We had breakfast on the patio surrounded by blooming native plants.   I had the omelet covered in chili verde, and my friend had the special jalapeno omelet with pepper jack.   Out of this world and very affordable. The indoor ambiance was less appealing.   Go for the food.  That us reason enough!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rUTjsNouE1eVvdq7l9zkeA"
  },
  "OxierwjghC3-EhXxyqKnEA": {
    "date": "7/11/2017",
    "text": "LOVE this place! the staff always make me feel at home, the vibe here is very \"laid back\" and calm, every single cook here is great at what they do! and dont EVEN let me get started on the dishwasher! he or she should get hired by scientists to help clean up the air because they are just that good at cleaning plates!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R4jR9v4lOxh2ANT7npQMsw"
  },
  "9Wvmy-T2uquMB4Z0oQV3qw": {
    "date": "1/10/2016",
    "text": "I wish it was closer to home. The best breakfast I've had in a long time. I ordered the southwest chicken fried steak. Instead of gravy they smother it in pork green chile it was delicious. My wife ordered juevos rancheros it looked great. Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kc7WkdUYm3Xvb0YT4A70Iw",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Southwest chicken fried steak.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kc7WkdUYm3Xvb0YT4A70Iw/o.jpg"
      }
    ],
    "user_id": "Cdcc3DcHUiDXy7_AwbIvcQ"
  },
  "8QzZI8UzPMTOb5XfmFRlbQ": {
    "date": "11/22/2015",
    "text": "GF TOAST AVAILABLE.   I have never been disappointed with a meal from here.  The chorizo omelette is my favorite. They also have gluten free toast: Udi's and Ezekiel.   The waiters and waitresses are friendly but sometimes they seem to be short staffed.  We always go in on the weekends and our poor servers are scrambling around because there doesn't seem to be enough helping hands.     Overall great meals!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "MHRQ5K1pL_bPybVRi27wIw"
  },
  "Kxx_o1mDLIcnuwRr4HXr2g": {
    "date": "2/24/2018",
    "text": "This place is great. Good food big portion have to take it home. Everything here is good I love the chicken fried steak as well. One of the best places been to many in the valley with long lines and not as good. This place most times they don't have to wait prices are good food is great service is nice and friendly. You have to come check this place out",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DBHZ0gtkPxoKaG08DI3q5A"
  },
  "PB8u5qQZNbL_s8_lrAO6bA": {
    "date": "4/5/2017",
    "text": "Love Ranch House Grille! It was right across the street from our apartment so perfect walking distance when we wanted to get out of the house in the morning for breakfasts. My husband LOVES their chicken fried steak and I usually just go for the omelette or traditional breakfasts.  All are good and the coffee is pretty darn good too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DMZxEUe-cK_xT2ichXeWvA"
  },
  "l6ieXGmSvjICC30ewD9tjA": {
    "date": "5/1/2016",
    "text": "Here for a family funeral, after dropping sister off at airport wanted a good breakfast place. Plentiful food. Great service. Reasonable prices If our family needs to come back to Arizona we will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EG0ag6m3vD1MZxcim0xciA"
  },
  "rjwhctaJFyUnPsL04FnAlQ": {
    "date": "3/21/2017",
    "text": "Love  this place. A small town feeling in all the hubbub of the Valley.  home-cooked meals like you would get back home.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DW7lIda-88OMrb4O3yhcrQ"
  },
  "pkWtgAXfCVc6LBS9Fm3xpg": {
    "date": "12/10/2016",
    "text": "Gotta say i was really disappointed. Scrambled eggs were runny then burnt when they came back. The biscuits are terrible. They are dry like cornbread and the hashbrowns were hella soggy and the coffee was burnt... Time to replace kitchen staff with peeps that kniw what they are doing. Wont be coming back here and i dont recommend anyone else come.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JDcJkIfucvcG7BElg0iyBw"
  },
  "eb27R8015WhZlAeCD7i7ug": {
    "date": "11/29/2015",
    "text": "My husband and I went there about a month ago and he loved (and since craves) the green chili chicken fried steak. I had the fried fish which was great...had a few issues with the rest of my order. Main reason I chose it was for the fried okra and cole slaw. I got mashed potatoes and veggies. Apologized to the new waitress and asked for the correct sides. Got my okra which was wonderful but with cottage cheese. It was actually funny and I felt bad for the waitress (who was brand new) and felt badly but said the kitchen was confused. :-)   Took a friend there for dinner about a week ago and the dinners were great-I had the regular chicken fried steak and will again! We were full but wanted to treat ourselves with peach and cherry cobbler...mmm-not much flavor, too much batter and it was ice cold. Sorry, just did not care for it. Might try it again and ask for it heated with ice cream.   We like the place and will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HzrptZ8ZCIVeLKz9ZwUK-w"
  },
  "V_4wEQU4XU6_hA2F-u5KhQ": {
    "date": "2/14/2016",
    "text": "Fabulous place for breakfast. This was our first time here we drove all the way up from the East Valley. I highly recommend this place. The staff is super friendly",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xlqMO0mkLIV9kZvKnsjWmA",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Addison enjoying his fabulous breakfast",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xlqMO0mkLIV9kZvKnsjWmA/o.jpg"
      },
      {
        "img_id": "9z5RS_E9LW95vJs4zXrp6w",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. This is the friendly kitchen",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9z5RS_E9LW95vJs4zXrp6w/o.jpg"
      }
    ],
    "user_id": "Pcabjcxn78kwuR-5QYexwg"
  },
  "s9DHHxTUVLfQPkwJEHZtbQ": {
    "date": "6/29/2017",
    "text": "Really good food, perfectly cooked and friendly staff. I've eaten here a dozen times and always been satisfied.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KGfFE3pMUpFR3UjkCYGaQQ"
  },
  "amRmxU1VHPbRh0f9gU7TxQ": {
    "date": "11/30/2015",
    "text": "Ranch House Grill is a 10 minute walk from my house and happens to be an awesome local restaurant. The food is good and the staff are very friendly.  The music is always at a nice volume and the music choice is always good. I've come here for over 5 years and I'll keep coming as long as the doors are open!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "4xbS5Is4sMINpra8JwRmfg",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Bacon Smoked Cheddar Burger with Sweet Potato Waffle Fries. AMAZING!!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4xbS5Is4sMINpra8JwRmfg/o.jpg"
      }
    ],
    "user_id": "XCvk1nyFO-yCAz3zExnTNQ"
  },
  "YpRdBemMHkDhCjqpEjGFKA": {
    "date": "3/25/2017",
    "text": "Very pleasantly surprised at how good the food is here. My chicken and waffles were really delicious! The chicken is fresh, cooked perfectly, crispy, flaky and savory. A must! They are celebrating their 10 year anniversary and I certainly see why! Better than 9 out of 10 breakfast places in my book",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y2WVaQ55ix2xXppSi0OliA"
  },
  "PMwH1k1Z6lvP8N23qtFPEw": {
    "date": "5/15/2016",
    "text": "Arrived for a family breakfast after church around 8am with grandparents. We had a party of 7 whereas 5 of us were present but still could not be seated until the WHOLE party was here. I figured the host would bypass that policy due to the fact that there were elderly people who have a hard enough time walking.     Once we were seated and ordered our food, we were able to enjoy each other's company. The food was brought out to us but somehow every plate at the table had one minor error. One person received something he did not even order. Another had ordered strawberries and whipped cream on her waffle and received a waffle with strawberries sloppily plated (no whipped cream).  She stopped the waitress and asked for whipped cream and the waitress did not acknowledge her request and walked away. She came back with a bowl of whipped cream.   Fortunately the food was delicious.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "S21elEQMoHUWCSHzyfKlVg",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Plating of Belgium waffle with strawberries and whipped cream. (Whipped cream missing)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/S21elEQMoHUWCSHzyfKlVg/o.jpg"
      }
    ],
    "user_id": "A5aWgOLUIXcHgPcZdMx_Tw"
  },
  "qoaCA8VykHqlRJSrxTwW3w": {
    "date": "4/29/2017",
    "text": "On the Mt. Rushmore of places to eat breakfast.  I had the Loco Moco, and it was equal to any I have eaten in Hawaii, except this one had 3 eggs!  The Little Dove had the Chorizo Burrito, it was perfect.  The chorizo was the real kind, little grease, little spice, and lots of flavor.    We could not have been more pleased!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dQ38S9QJjPRf9kNF46LIXA"
  },
  "hk8ppAgyKo8ZAuJgplGCpw": {
    "date": "1/28/2017",
    "text": "I just moved into the neighborhood and was out to find my new favorite breakfast place. This is the first one I have tried but it's going to be hard to beat. I had a chicken fried steak and it was exceptional!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ak9G1ntnXv-k_3Di0s0obw"
  },
  "SoIUOPfRZSTf5QBWgGflEg": {
    "date": "12/28/2017",
    "text": "best breakfast place ever. The people here are so friendly and kind. And the breakfast is AMAZING",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vLDya1cwIpSNw-63IXUGEg"
  },
  "GFVdGe9oxoX0sbRLJEgSGg": {
    "date": "7/15/2015",
    "text": "Truely Satisfying!  I had been intending to have breakfast here for months, and today I finally did. I was totally pleased with every aspect of my visit. The restaurant itself is inviting, and I loved the table I chose in the corner by the window. It was bright and sunny.   Almost immediately after I seated myself one of the servers brought me a menu and let me know that Anne would be my server, and that she would be right with me. Anne came to my table with a smile on her face, and I ordered coffee and asked for a few minutes to study the menu.  I really didn't need much time since I had studied the menu online, and so when she returned with my coffee I went ahead and ordered the Original Chicken Fried Steak and substituted a biscuit for the toast..   The coffee was actually good, not the usual afterthought that many restaurants serve. When my meal came, there was so much food that I literally didn't know where to start, so I took my time buttering my biscuit which I figured was as good a place to begin as any.   Of all of the biscuits I've had in restaurants over the years, this was far and away THE BEST. It was like a really good home made biscuit, and begged to be followed by a mouth full of chicken fried steak with sausage gravy. The chicken fried steak was crisp on the outside and perfectly cooked (not dry) on the inside. The gravy was to die for and the whole dish was nicely seasoned. My eggs were cooked exactly the way I ordered them, and everything was piping hot.   Every mouthful was delicious, but the portion was so large that I soon realized that I wouldn't be able to finish the meal. My decision? I didn't want to leave any of the biscuit behind, it was just too good, so I focused on that and ate almost all of it.   My experience - large helpings of really delicious food, great service, and a really nice friendly environment. Next time I'll order something smaller so that I have room to try the cobbler.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1BcNXW9_Y16TIofPVpFqIA"
  },
  "IszVipEWz1nVApVBxPiWAA": {
    "date": "2/24/2013",
    "text": "She planned for us to go here for sunday brunch! I was thoroughly surprised that she planned it here. Her backing was that its a \"hole-in-the-wall local\" place like how I like it. I was like sure lets give it a try.   It took them 20 minutes to seat us, as it was busy and too cold & windy to sit outside. The service was good and people amiable. It was a typical breakfast place, right from pancakes, omlettes, salads, burgers, burritos, etc.   Had a few veggie options, like a typical breakfast place. I got the avacado and black bean patty omelette. Check pix. Havta say didn't like the patty since it was soy based (like BOCA) and not a black bean garden based. I got a side of the southwestern hash browns and a French toast, both were good as well.   All said and done, no particular reason I havta go back to this place when there are places like Mimi's and lolo's. it's a small place with good people and decent food at almost the same price as other places.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ZCmZQWAJXslAMOBAl-WxFg",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. French toast",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZCmZQWAJXslAMOBAl-WxFg/o.jpg"
      },
      {
        "img_id": "ShkCCo41IlFO8EfjWMAfdw",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Black bean patty &amp;amp; avacado omelette with southwestern hashbrowns",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ShkCCo41IlFO8EfjWMAfdw/o.jpg"
      }
    ],
    "user_id": "9450TymL5lmb_rrmLOwjQQ"
  },
  "Jh3oL46OICPCE8R0IBAgcg": {
    "date": "1/18/2015",
    "text": "In an odd situation were I had to be up all night, but had four hours to kill before a 10:00am flight, and had no desire to drive from downtown Phoenix to Desert Ridge then back south to the airport, I decided one of the best ways to kill some time was to sit down and have breakfast. Since I didn't want to spend any more money than I had to, I decided to hit up local dines (<a href=\"/redir?url=https%3A%2F%2Fwww.localdines.com%2Fphoenix%3Fref%3D19485&s=13f273d311728f7448ff75fcf55bdaf2585245ad2d7e3c3cc0823dcdee2befc9\" target=\"_blank\" rel=\"nofollow\">localdines.com/phoenix?r...</a>) and found a $20 for $10 gift certificate to Ranch House Grille, a breakfast spot pretty close to Sky Harbor that starts service at 6:00am. It's open. I have a coupon. Why not?  The food is good for what it is. I had a Denver Omelet. The eggs were cooked well, and the fillings were fine. The hash browns were awful. The portion is massive, but bland is too kind of a word to describe the taste. There wasn't enough salt, ketchup, or hot sauce on the table to give these potatoes any flavor. I would definitely recommend subbing with any of the other sides. The coffee was good and refilled often. A large orange juice was not worth the $4.59 price. If it was fresh squeezed, it certainly didn't taste like it. If isn't, then I could've bought a gallon of Tropicana down the street at Fry's for less.  Not that I was looking for anything fancy, but the restaurant is nothing special in terms of ambiance and decor. It looks a lot like an old office that's been gutted into one big room. There's some stuff hanging from the walls, but nothing all that pleasant to look at. Service was great. There was just one woman handling the handful of tables and cashiering duties. She was as pleasant and efficient as could be. She also was one of the first servers that I have ever handed a local dine certificate (<a href=\"/redir?url=https%3A%2F%2Fwww.localdines.com%2Fphoenix%3Fref%3D19485&s=13f273d311728f7448ff75fcf55bdaf2585245ad2d7e3c3cc0823dcdee2befc9\" target=\"_blank\" rel=\"nofollow\">localdines.com/phoenix?r...</a>) who knew exactly how it worked. The total was a little less than my local dine. I gave her a few bucks in cash for a tip and made my way to the airport.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "3cC726zwgerKNNasnidAww"
  },
  "xhfu5nybt8nDQT6t63O5lw": {
    "date": "8/15/2017",
    "text": "They tried to be open at Night, but apparently it did not work out. They are now back to just breakfast and lunch.   Same great food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-QZH7mJUYfaLwXFjG0yI8w"
  },
  "_WYVglX9KKJ-jCS7hiZFXA": {
    "date": "8/2/2014",
    "text": "Lunch time!  Small and cosy, we drove last it by the time we realized where it was. But this kinda adds to it's charm. Good size patio as well, but we did not eat there. $6 kids meals are awesome!  I ordered the \"Coronary Burger\". A whopping $10! (Actually really worth it). This burger came with two huge pieces if bacon, an egg, and all the trimmings. It was delicious!  The wait staff was a bit understaffed, not the waitresses fault but this place lost a star for that. Out waitress was great though, when she could get to us. She was very pleasant despite being obviously overwhelmed. Total meal cost was about 45 bucks for two kids and two adults, worth it. If you get a chance to stop you should. Next time I'm getting breakfast.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "HVM62rouLcHUji92-6GPzw",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Burger!!! And bucket of coke!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HVM62rouLcHUji92-6GPzw/o.jpg"
      }
    ],
    "user_id": "r6fWFaUa4m_x8q1cCtsJRA"
  },
  "ClLcvjPESpMrGJh0MDskyg": {
    "date": "4/29/2016",
    "text": "Eh, I won't  go back ! I wanted to eat on the patio, but it was full. Service  was good- Felicity, but food, not so much!  Eggs were right, bacon- asked for extra crisp, it was limp and super  greasy. I ordered a waffle, been craving, soooooo disappointed!  It was very heavy and dense, tastless... not worth the calories!  The French Toast my dining partner got tasted  much better and it was  a large serving! Oh well, cross it off the list!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vIXERF0XKk9T3a1R9Rpgvg",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Front sign",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vIXERF0XKk9T3a1R9Rpgvg/o.jpg"
      }
    ],
    "user_id": "57Hg2ad5RO6OjIzwT6lPQw"
  },
  "mON4w01Q0dns3GCI-MJVFw": {
    "date": "10/26/2017",
    "text": "I love going here for breakfast. Simple and tasty. Relaxed feel. Good service. And I feel like I can take my time. Makes me feel like home. Definitely recommend to all.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "53eWqW-XvfF31HIqVBih4A"
  },
  "8rchXDcXtuARzFvpkD2gkQ": {
    "date": "5/28/2016",
    "text": "This is s a place that you visit when you are looking to chow some classic American breakfast food with a bit of a southwest twist. The food quality is pretty good although I think they could improve by minimizing the amount of grease/oil that ends up on the plate for final presentation. I guess I'm a little picky/sensitive about that. Can be busy on the weekends but their staff can turn through tables efficiently.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xlSnjFjbh_zxqZi7aKc34w"
  },
  "bqLs6rcVRM5u0_AHvzW1HA": {
    "date": "6/24/2017",
    "text": "This place was great!.  I, first went there for breakfast.  I was in a bit of a hurry, but not familiar with my surroundings, I opted for a local diner.  They slowed me down, in a good way, the waiter was polite and super laid back.  The food was awesome! So good, I went back for lunch. They didn't disappoint! Thank you!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rAOAjqS3RDRjigVwWYb5PQ"
  },
  "MVfNg6ztV3uyZJuzIVuFgg": {
    "date": "10/11/2017",
    "text": "We arrived at 1:00 PM. They were open until 2:00.  Serving staff seemed to be in back room most of the time.  My daughter Ordered bowl of red chili I ordered bowl of pork chili verde My granddaughter ordered Kale salad - specifically because it would be gluten free, with the blueberries and the avocado on the side because she did not want them but was giving them to me. She also added chicken.  My daughter received red chili too extremely spicy for any of us to eat My granddaughter received a salad in a fried flour tortilla shell with no kale in it, her added chicken was put on the side - my granddaughter said she couldn't eat the chicken because it wasn't completely cooked and was still \"squishy\"  The blueberries, which came to me, were mostly very over ripe, and spoiling. Some were even moldy. After trying to pick through them, I just gave up on eating any  The pork chili verde which I received had skin of some sort in it, but otherwise seemed to be okay though it tasted unlike anything I had ever had, but later I got horribly ill with extreme, painful intestinal cramping, diarrhea, and chills.  When we asked where was the kale in my granddaughter's kale salad, we were told that they had discontinued that salad so they just gave us something else. They seemed offended that we objected and expected to receive what we ordered. They even asked what was wrong with the salad they had brought us! Specifically, they said, \"Is there something WRONG with the salad we brought you?\"  When my daughter said she wanted the salad taken off the bill they acted offended.  They began sweeping the floor near us and putting the chairs up on the tables while we were still eating.  I am not sure why ANYONE would like this place. The only thing it has going is location and that is simply not enough - not for me.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y267PuW91Ua-Oc6VEzllSA"
  },
  "s8zBpn8US77lz6cBEDxvXg": {
    "date": "4/4/2018",
    "text": "Destination after  a walk along the canal from Scottsdale. Googled breakfast near me and that's how I ended up here. Delicious burrito, large portions and service was fast and professional. Casual and family friendly! I would definitely recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ba2iH9Z402V7SswN0PA19Q"
  },
  "2LRDvj3bEIu-ZYnpvVkXEw": {
    "date": "5/3/2016",
    "text": "Love love love this place! I was introduced to their wonderful breakfast many years ago when my brother-in-law lived nearby. I was instantly hooked on their chicken fried steak; and after bringing my fiance to try it, he was too! The service has always been nice and they keep things quick. The portion sizes are huge! They do sometimes get very generous with the gravy on the chicken fried steak so be sure to ask for lite gravy if you're not that big of a fan. Definitely stop by this restaurant if you're looking for a great breakfast or lunch!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bEM8yTAsOhTGkKFBCj8USA",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Chicken fried steak",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bEM8yTAsOhTGkKFBCj8USA/o.jpg"
      },
      {
        "img_id": "d2AAXA0-IkBtntvKKk_n3g",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/d2AAXA0-IkBtntvKKk_n3g/o.jpg"
      }
    ],
    "user_id": "PsMejLu0T73PnFvKU8AICA"
  },
  "oFZJlQAvRirgC5875ceWow": {
    "date": "5/29/2017",
    "text": "Best breakfast place in town. LOVE the BLT and I always ask for my hash browns a little crispy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YGXh8s5c28YOzTuB4nZi9Q"
  },
  "GzOsjCHuKFfrEq68GkyyGA": {
    "date": "9/2/2017",
    "text": "Ranch House Grille is the only restaurant in Arcadia that knows how to serve breakfast right.  They have a hometown very friendly service atmosphere, something you don't experience in this area full trendy restaurants.  The food is awesome and you don't leave feeling hungry.   Try the Green Chile Chicken Fried Steak or Breakfast Chorizo.   They also have an awesome Protein Plate with grilled Chicken or Beef, cottage cheese, avocados and fresh tomatoes.   Awesome!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MPJuMnTcR01LVJ88vMZU8A"
  },
  "0QLVSwbSTnkvNmAfGwdR0w": {
    "date": "9/24/2017",
    "text": "This place doesn't even deserve one star the food was not very appetizing. I order the southwest chicken fried steak and I was only able to eat a few bites it tasted weird and had a chewy texture. My kids pancakes were borderline burnt they give you butter in a package and cold syrup. Definitely not up to my standards. The service was also bad no refills and dirty plates on the table. Waitress walk right past our table with empty cups and dirty plates. Everybody else got better service than us maybe because we are not white. Overall worst breakfast of 2017 and wouldn't recommend this place to anyone.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "m1Vp7eh6JZ0IgFF5oCPU9g",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Nasty southwest chicken fried steak",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/m1Vp7eh6JZ0IgFF5oCPU9g/o.jpg"
      }
    ],
    "user_id": "DQsoZkMr3LRqYsT0I768IQ"
  },
  "Z1oCAa7KrFIPCHoNJ0b0dQ": {
    "date": "7/16/2016",
    "text": "This place was so yummy! I got the breakfast biscuits and my boyfriend got the corn beef hash with a biscuit, we were both very satisfied. The place was very cute and they were playing good music. Our waitress, Felicity, was responsive and friendly. This place gets an A+. I will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "t57ZfJiCqoQODds-QP-8Tw",
        "caption": "Photo of Ranch House Grille - Phoenix, AZ, United States. Breakfast biscuits",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/t57ZfJiCqoQODds-QP-8Tw/o.jpg"
      }
    ],
    "user_id": "jrNJo0QAvEK5FHxOqAh90A"
  },
  "LaHTRM9wO8LTFUf3567vxA": {
    "date": "1/7/2016",
    "text": "Gotta admit...I am normally an OHSO brunch fan...it is our tried and True..however these days, if you aren't there by 9 on the dot, then its a huge wait which sometimes we will endure and others, not so much.  A friend suggested this place and said it was like a classic diner. It is...it reminded me of being back east and going to the diners there. I guess I just don't know about as many out here, but I didn't think they had them.   It was a great choice! It is your standard diner feel with the massive delicious portions. I had the crepes with strawberries. My only issue with it was that it was the pre-macerated strawberries and they didn't look good - they came on the side so no harm done, but now I know! It came with hash and a choice of meat. Pretty awesome.  Hubs and our friend got big plates and ate nearly everything and loved it! This place is really cute.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ij7OcAO5FpoNKxS1RzNoWw"
  },
  "ce4CMbpxHW-lcbxkpm6ptg": {
    "date": "5/10/2017",
    "text": "It's OK, nothing special especially when compared to local breakfast alternatives. I liked it more than my wife who yelled at me for taking her here. She thought the food and service were terrible. I thought the food was not bad and the service was fine. I like the history of the place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "byS5I9HMlMqjiTrjqnCscg"
  },
  "AgK50lrGxAAwIr2YtRlIwg": {
    "date": "8/14/2017",
    "text": "Wow, great breakfast, service and atmosphere. The pancakes are excellent and the Mary Jane breakfast was awesome. Definitely will return when in the Phoenix area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CuC_Uu7HwRxhn3T2gdUVeQ"
  },
  "i7lq1JBOce_l6CDTaREJlA": {
    "date": "6/29/2017",
    "text": "Dropped my car off at the auto shop next door and walked here not expecting it to be that great.... but to my surprise it was surprisingly very yummy! The food was great and would for sure recommend. It's very small and the waitress seemed to know everyone by name she was very kind and sweet I appreciate the service. Great spot for breakfast!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yT26yC40Ye13B_LR7tVWKg"
  },
  "rGANBKzoGCHlr90hetlT0Q": {
    "date": "6/20/2016",
    "text": "We Loved LOVED LOVED this place!!  From the friendly welcoming staff to the amazing food! This place WILL NOT DISAPPOINT!  I was looking for someplace different to take my hubby for Father's Day and I came across this lil' diner that reminded me of the small town mom and pop diners of my childhood!!  I am so glad I found it!   We had a little of everything and it was all very good!  You have to try that pork green chili... It's so good... And you can put it on just about anything!! Don't just take my word for it... Go give this quaint lol diner a try",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FCaJVC6jHz1F6nqIMYvyIQ"
  },
  "Tg58lhRZ93hx6pdTUfQVSQ": {
    "date": "11/18/2015",
    "text": "this is a seat yourself place, you walk in, find a table and wait. Now, sometimes you'll get a nice, smart server, and other times you'll get a server who serves up attitude, and doesn't refill your lemonade and tells you that you don't get refills but that's another story.   The menu is extensive, lots of different breakfast options, there's also plenty of lunch options too, and don't forget to check out the large specials board. Servings are substantial, eats are tasty, and price is fair. This is one of my rotation breakfast places after a morning hike.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "NsegE9Mqm3GCQeSx0v0tYw"
  },
  "DKtQ8Ujk-NnWymIAj-5Faw": {
    "date": "8/8/2014",
    "text": "Still pretty good alright after all of these years!  For solid diner food in this part of town, you can't go too wrong.  I usually order huevos rancheros, as it's usually \"brunch\" when I'm here, and sometimes I'm not feeling at the top of my game...  Chicken fried steak and the biscuits are great.  My dining companion is right in his assessment that this place is \"just OK.\"  It's not gourmet, and it's not necessarily the \"bestest\" diner food.  And for some, the pork-based green chili sauce is bland.  (I'ts NOT New Mexico).    But the staff are AMAZING.  And it's predictable, prompt, and the outdoor patio is very, very nice (in Spring and Fall).   When in the area, it's on my \"will eat breakfast here once\" list.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bq4zIzw6s8wZMgZIfjWcag"
  },
  "NAmx9--SE1fLd5RaBn4U_g": {
    "date": "4/27/2009",
    "text": "I almost give this place 3 stars, but as far as my experience goes, it's not there yet, and I would honestly rather have IHOP or Denny's.  Saturday morning at 9:30ish seems to be prime time for breakfast, and Over Easy proved that with the gaggle of people hanging out outside.  Since I was starving we quickly found another place via Yelp Mobile, and we ended up here.   The patio is cute with tons of shade provided by the greenery.  The inside however is awfully tacky and very poorly put together.  I was embarrassed for the owners just looking at it.  We were told to sit anywhere and we found ourselves at a little two top against the wall.  Service was prompt and we were quickly given our GIANT cups of soda, always a plus for me.  I ordered a dish that had hash browns, 3 eggs any way, bacon, and I subbed biscuits and gravy for the bread.  The amount of food on my plate was massive.  The hash browns took up a whole third of the plate real estate, but that was unfortunate as they were rather tasteless.  They were lacking in the salt/grease/butter department.  Next up, my eggs were overcooked in the yolk part but somehow not cooked enough in the whites.  It was weird, but still edible and not the way I like them.  The bacon... well there was a lot of it.  I thought that was a wonderful thing until I bit into overly fatty bacon that was cooked for way too long.  It was just really salty and crunchy.  For the first time ever, I did not eat all of the bacon in front of me.  The biscuits and gravy was by far the worst part of my meal.  The biscuits were very hard, dry, and flavorless.  It was as if they had been sitting out for at least a few days.  The gravy was pretty bad.  It was completely over-peppered and was super thick and congealed.  It wobbled instead of dripped.  Kind of gross.  When I smothered it on top of the hash browns it was a little bit better.  The husband enjoyed his dish much more than I did mine.  Maybe we will go back some time, but I know what to avoid and how to specify my bacon to be cooked.  For now, it's just a meh.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "XNSyl47aXuPsvC5zXm5uhw"
  },
  "p-Prr86CszLXGIjLvRRYHg": {
    "date": "2/26/2011",
    "text": "Breakfasts are good. Service is attentive. Waking for them to reopen. Hope that they change the coffee vendor. With all of the great coffee roasters in town, they shouldn't have lackluster coffee. Rated as 3 due to the coffee.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d6jEpI6rJcQKyFUkl8Wg1Q"
  },
  "GUKrR-ZNiJdFcEEM3bnXWw": {
    "date": "5/17/2009",
    "text": "I took my second visit to Ranch House Grille today for brunch, and I think it was even better than I remembered! I brought two rookies with my, and they both thought that the homey interior made the place so cute and loved the home-style theme of the menu.   The service is wonderful, everyone that works there is so friendly and always have a smile on their face. The coffee is really good, and they are very good about keeping your cup full.   I again had the Light Chicken Fried Steak Breakfast (it is funny that they call it light, because the only light part is that it comes with one egg and a half order of the hashbrowns) but it makes you feel good when ordering! They are known for their Chicken Fried Steak here, and for good reason, it is delicious!! It is nice and tender, with a well seasoned crispy coating and smothered in a peppery white gravy. My two companions had never had Chicken Fried Steak before (which I find hard to believe because I think every elementary school cafeteria had it on the menu!), and they both were pleasantly surprised when they took their tastes. I also upgraded to biscuits and gravy instead of toast, but I could barely make it through half of a biscuit!! They give you two large biscuits and a bowl of their delicious gravy, my mom always makes biscuits and gravy Christmas morning, and while very different from my mom's version, this was very good!   My two companions both had the Eggs Benedict that was the special today. One of them in particular makes it a habit to try Eggs Benedict at every restaurant in town, and she declared this to be an excellent version. She said that the hollandaise was really good, which can make or break the overall dish!   The three of us really enjoyed our meal, and I am thinking we will definitely be back again! They are well known for their Pork Chile Verde, which I have yet to try, but I always seem to get drawn to the Chicken Fried Steak....but maybe next time!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "NFgvM7LMx5Ocsxr7J2_sVA"
  },
  "tplB9gifi8LafyAouugWOg": {
    "date": "10/29/2012",
    "text": "Used a Living Social coupon for my first meal at Ranch House Grille; I will be back.  The place is adorable, the service warm and efficient, and the food excellent.  Mom had liver and onions and oozed happiniess with every bite.  I had the chicken fried steak and was not disappointed.  The portions are huge, the quality of the food high, and the flavors excellent.   Look forward to trying it for breakfast.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2mgGMrNekMyeTlH4lvousA"
  },
  "CTfVSBpHCLqpmXyZn_YZUA": {
    "date": "8/8/2010",
    "text": "At last a breakfast place that delivers. The chicken fried steak and eggs were  very good, hash browns were buttery and crisp. Would have been a 5 star but service was slow.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "flZkE1xwyHDTYHCWI6748A"
  },
  "I9nsRil2a5SXh3Obj1ESSg": {
    "date": "5/27/2008",
    "text": "nice portions of very solid breakfast food; you won't leave hungry.  Decent service, but they should pay closer attention to keeping everything clean, consistently....reasonable prices.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8bZ2PGXH7iLS2ac0biunqA"
  },
  "J86inMpY8KOFmLpkI3c4Ow": {
    "date": "8/25/2011",
    "text": "Only had the country fried steak. Had to say it's been pretty good every time. Large portions. Usually order to go.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1yc1mkAGF08cNu3lKfEzWA"
  },
  "9ta7ujXYup-UK8zWqWiM4w": {
    "date": "6/25/2012",
    "text": "Been going to restaurant since they opened. The interior is better after the fire but they are understaffed.  Breakfast is still good but I had lunch for the first time since they originally opened. My burger was was burned and tasteless. Stick with Breakfast.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E-rxuLKSwHpyNHvLRTsI_g"
  },
  "tObYmzYHdTxSs4ZCxHYzJQ": {
    "date": "4/17/2011",
    "text": "Horrible! Only two waiters. Ran out of meat?! Too expensive. Had to get up and get our own coffee/juice. If I could take stars away I would. Save your time and money; eat at home. Or mcdonalds.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rdifwelsxkuUf-tw2O4o1g"
  },
  "G4Hew6-VSZpvmV9lp_KfEQ": {
    "date": "3/10/2009",
    "text": "Good ol' breakfast joint.  The best kind, too.  Consistent.  Friendly service.  And you won't leave hungry.  The chicken fried steak is so good it's as if they asked Scotty to beam it straight 'n' steamin' from Texas to your danged ol' plate.  My first bite transported me back to the Lone Star State, but I quickly regained consciousness 'cause I wanted to eat more of it.  Order it slathered in either green chile verde or creamy sausage gravy.  Bein' a Texas boy my vote's on the latter.  Do yourself a huge flavor par'ner -- order it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zo9ZJ1EbGO-2xsvvK6A9qQ"
  },
  "13NdIjGHWO-Ba736NhPpqg": {
    "date": "8/22/2009",
    "text": "I want to love this place because it's so close to my house and I really like to see local restaurants succeed. I've eaten here about 5 times and my experience is always the same - mediocre food and slow service.  And the place needs to be cleaned up a bit as the torn table clothes and dingy carpet are rather gross.  Patio area is a decent option when the weather is mild and the staff seems like they want you to have a good experience so I'll give this place another try.  It doesn't hurt that we get a coupon in the mail every month.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tp6Sq_BB1j3NyuB14TgEnA"
  }
}