{
  "W-gILI73Pfo869-sYApNXw": {
    "date": "7/24/2015",
    "text": "Delicious food, reasonable priced,old world feeling, Great night all in all.  This is our second time here  within two months.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XMZ8kzHEHcEqVaw7ud-qtg"
  },
  "VGSrk0_l_wyuawW7UvlBSw": {
    "date": "5/9/2015",
    "text": "Wonderful ambience and service and very reasonably priced. Very friendly servers and family owned!! Had wonderful calamari as an appetizer!! Highly recommended!! Amazingly delicious Dirty Martini's tonight!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2pQHwexbfFpbbea5tNZClw"
  },
  "4s01W-DkeBO_5M_hrDW22g": {
    "date": "7/8/2014",
    "text": "Love this place!  It's surely not hip, and I read another reviewer say it was for the blue hairs which might be True.  There is no way I could know since nobody but us was there mid-day. But the first course was soup or salad, and I picked an Italian soup which had spinach and parmesan in it and was so thick and delicious.  Then the veal I ordered was in a marsala sauce = excellent.  And the fresh veggies were steamed...well, to perfection.  Just a really great meal for only $10!  Talk about worth it!  This is a meal that IF you ordered it in one of the \"hip\" spots would cost $25+, so screw \"hip.\" OK, granted the decor is the same old decor that was popular during the Frank Sinatra and his Rat Pack era--but I didn't come for the decor.  We came to chat and, at least, this place didn't have some blaring techno music, so we actually could hear each other.  See?  Very unhip.  But we could hear each other talk!   The service was super excellent...and darn! but I am having a really hard time finding many things not to like at Christo's.  I like the place.  I plan to go back....soon.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "R6vb0FtmClhfwajs_AuusQ"
  },
  "6EW8QCiyJ4o6gy60YnQ3yA": {
    "date": "3/11/2015",
    "text": "I have enjoyed my dining experience in Arizona these last few days, and Christo's Ristorante has not disappointed. I had the calamari as an appetizer and the chicken limon as my entree. Both were very delicious. The meal also included soup and salad. I was so stuffed, I had to pass up on the appealing desserts. The service was also top notch. I highly recommend this restaurant to anyone looking for some good Italian food in the Phoenix area.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "z3NNir3mtMKbgctKTA8QIg"
  },
  "ZodvBmN9F8_CF6UvokSmrQ": {
    "date": "2/11/2015",
    "text": "I tried this place for take out today. I am a short walk away. I found on yelp some pretty good reviews and decided to try it. I had the mussels and a simple salad and was pleasantly surprised! The interior is very nice and welcoming. I could imagine wanting to come here for a romantic dinner. Friendly people too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "JvCoLD6nguZx1jaWgGvRSg"
  },
  "18RhB4vPod6usY-WhVcI8g": {
    "date": "5/20/2016",
    "text": "Small, family Italian restaurant.  Quaint, relaxing atmosphere.  Great food.  Chicken parmesan and chicken Genovese.  Yum.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "SSHJ1aXj4PIzCkUo3N5NJg"
  },
  "ejuFX_vr4-bPxDAPyObbiQ": {
    "date": "3/11/2015",
    "text": "Nice atmosphere and quality service.  Friendly servers and ambiance. First time, in town for business and read the reviews.  Worth a visit if you're passing through. Had the chicken cordon bleu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-dkCgOCcAG2jJAu6C9O9sQ"
  },
  "cr-SvLYHRi4kdlMZX9E4mw": {
    "date": "6/9/2015",
    "text": "Hadnt been here in a few years and had lunch here yesterday. It was great! I brought a friend that had never been. She LOVED it. The service was great and the food was fabulous!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FlWV_YDzxmntMkesCchX5w"
  },
  "xpZrSV9Ge9AzsehojcvaZA": {
    "date": "7/18/2014",
    "text": "Just had the most delightful dinner at Christo's!  I found them to be so accommodating and friendly. They made me a special salad with blackened salmon to my specifications. Delicious! Thank you Stephanie!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "jIklSu7OsIQNde_7Sv7Jcw"
  },
  "SAOGg6paC37I84nloXFZKw": {
    "date": "9/25/2015",
    "text": "Best Italian food ever... Love the chicken piccata. I don't leave Phoenix without stopping here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S609ZfbH6wjTZRi-Xu3J4g"
  },
  "zBSMtP29gUh_cxGscG3Edw": {
    "date": "10/19/2016",
    "text": "Sweet little neighborhood restaurant. Waiters there for years. Food excellent, reasonably priced and menu is varied and very good. My last meal will be their halibut! It's a bit of an older crowd but love this little place. You get soup and salad with your meal, and sides are included. Best deal in town for a very nice Italian meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pz18XNL6OSn1u-AooDKUEQ"
  },
  "6UvdKI_TNMZdGjhe9ks9oQ": {
    "date": "10/3/2015",
    "text": "We ate at Cristo's tonight and had the best Italian dinner ever.  In addition  to the fine food we had great service.....thanks to AJ and Louis.  We are on vacation and will definitely eat there again and recommend to others. It was a great evening.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gT-S4wyzpQMobU1zkwwfOw"
  },
  "f0lf4TgRJhYsdNpXM1xNjg": {
    "date": "5/9/2014",
    "text": "Great service ..... even better food ..... and surprisingly amazing very low prices! Home made food at a mom and pap's fashion restaurant. We now have a new Italian home made food place. :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "cs0RQ6L0u_8869CUZavl2g"
  },
  "MhrABAvKHBRYCWWheYX7uw": {
    "date": "12/17/2009",
    "text": "If I had to imagine what the dining experience would have been like a couple of decades ago for the first and second generation Italian families living in middle America it would probably look something like Christos.  The place has that ambiance and charm that say's \"You're Family\"....sorry Olive Garden.  The food is good and while there are other Italian places in town that are arguably better in quality and taste, none of them really beat this place in terms of authentic Italiian-American atmosphere.  The place is up there with Durant's, Monti's, and TeePee's as essential Phoenix dining landmarks.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 11,
      "cool": 1
    },
    "photos": [],
    "user_id": "SCo1UBoeN3bhRMkSYuiX1A"
  },
  "3UEByeLCGpZH0-vxtJXtwg": {
    "date": "7/17/2014",
    "text": "Looking for a new spot down town try this place service was excellent food if possible even better I am a former catering chef and my wife is a personal chef so when we go out we are very picky and critical but we honestly have not one comp lainteverything from the time you enter the place until you leave is on point no wonder they've been around for 28 years  our waiter was Scott and very pleasant and a real pro the wine list is great and with a happy hour daily you can't go wrong strongly recommend that you try this spot asap",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "2EE1YyHh6RGvH30mxJ5Kmg"
  },
  "E7BLXWy4rdX7LJa4iuycIg": {
    "date": "12/5/2013",
    "text": "I've been eating here at least once a month since they opened many years ago.  In all that time I've only had one or two meals that weren't outstanding.  The sea bass is wonderful and the daily soups never disappoint.  Santino is one of the best waiters in Arizona and always takes great care of his customers.  The remodel a few months ago really freshened the place up.  Very reasonably priced for what you get.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "r273PJBNWi1ph8-m5CNRmg"
  },
  "bJIwhizdcfqMI6a11GoD1Q": {
    "date": "1/6/2014",
    "text": "Awful canneloni served on a bath of poorly prepared heavy cream. Very 'unItalian', even the bread tastes stale and poorly prepared. The minestroni soup tasted like canned soup, just right for the strictly senior citizen clientele. My husband had a pasta with Italian sausage and chicken in a marinara sauce. The chunks of canned tomatoes were unappetizing. The one star is awarded for the only good item we ate, the Greek side salad. The waiter was totally goofy, rude and uninterested. He flopped the canneloni at the table with the statement, \"Two enchiladas.\" Really??? First time but never again! Disgusting food, terrible service.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "vDGDTSD89yy51R2Ds5W0OQ"
  },
  "mf8KMGBBWfh6tMfKpP7k9A": {
    "date": "3/8/2014",
    "text": "1st time and loved it ! Delicious and fresh  food. Pasta fantasia was perfect and so was the soup and salad before. Dinner was great and so was dessert. Intimate and nice setting at a perfect price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "fp_nGG5bjVKt4c9ASTXWog"
  },
  "nwNUS06G0ODEzjQXRg_WVA": {
    "date": "9/17/2013",
    "text": "The most dependable upscale restaurant I know in Phoenix. First-rate dishes, like melt in your mouth osso bucco and a huge and delicious veal chop, at reasonable prices. Reservations essential. Don't miss their calamari.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "U46t3vLLGal6hnUTDPmrvg"
  },
  "LQAtGeIYQHkZW3MJJpjcpQ": {
    "date": "10/30/2013",
    "text": "Update:  We returned three years later and found that this restaurant is unchanged...really good.  Came for lunch and I had musels and linguini.  There was a choice of sauces.  I had butter and garlic sauce.  Delicious. But wait!! There's more!!  My wife and I had soup which comes with the lunch meal.  The soup was a rice and lemon soup.  It also had diced carrots and celery in it and it was superb.   Wife had for her lunch, sausage with peppers and onions.  She was very pleased with hers. Service was superb.   Prices were very reasonable. We've already decided to come back again....the problem is who do we want to come with us that we can introduce them to this little jem.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "rZwAyWdColv0XQu1VAMpPQ"
  },
  "if3-1Z7H7KQKnpsqI1Uh2A": {
    "date": "11/25/2015",
    "text": "For this Thanksgiving get together, we actually had a little drama. Unfortunately, I was the focus. Fortunately, I was quickly taken away by the Osso Bucco which was delicious and succulent in a tasty broth. A small fork was provided for digging out the marrow but was really needed was an anteater tongue or large sledgehammer to slurp up every morsel of marrow.  The Calamari starter was tender and perfectly seasoned. The maragarita goblets are fantastic old school bar cocktails and 2 were sufficient to make anyone happy. Come bring some family drama with some calamari, osso bucco, and cocktails for a great evening.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QsM6BSlosKUpMnH9iAgvZA"
  },
  "XI_-3I9Jx_DJRatNHSGp1g": {
    "date": "10/16/2017",
    "text": "I can't believe this place has been around for 30+ years and just recently discovered it. Best Italian food so far that I have had in the Phoenix area. They have the best bread and chicken parmigiana around. The sauce is the real deal. Can't remember what salad we ordered but it was also off the charts. Service and staff were very friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "rB5-_8LoliC_C3A44W0OCQ"
  },
  "eXV8uoKwfRlw7qWsywTXJA": {
    "date": "10/8/2015",
    "text": "Wonderful experience! Being from Italy, I always have the urge to check out new places, and when I saw \"Italian cuisine\" I had to stop and test it. As I walked in, I immediately felt welcome. Kelsie, the bartender, was very nice and friendly. Excellent start, since the authentic Italian culture is based on welcoming and well-mannered people. Food was outstanding as well. I had the mozzarella caprese followed by the special of the day: halibut piccata. But what really impressed me was the dessert: limoncello cake!!! It's not like the usual American cakes with tons of sugar and frosting...this cake was at the 'right degree' of sweetness, very light and fluffy. Concluding, 5 stars to Christo's! I'll definitely come back to try the pasta! :-)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xEA3FfXcVI-iurz2NUAT5g",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. Delicious limoncello cake!!!!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xEA3FfXcVI-iurz2NUAT5g/o.jpg"
      }
    ],
    "user_id": "HJfuzbFTwREQJ13sUUzHWA"
  },
  "TEDlSDAIS8mAHh9uAjUSoQ": {
    "date": "11/11/2017",
    "text": "This was our first time here and it definitely won't be our last.  It's older feel is actually a welcome change to the 7th restaurant scene and the people are much more down to earth.  Authentic Italian food in large portions with great prices.  I had the Veal Parmesan and it was amazing. Couldn't even eat it all and will enjoy it for lunch today.  When you go be sure to ask for Meghan.  She's an awesome server with a great personality.  Makes the experience that much better.  Can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pdOiNxPUzGu-B5nKNHsp3A"
  },
  "aNf-R3lvvYZaTUVesTbqXw": {
    "date": "5/7/2018",
    "text": "This has become our new regular spot. Great food, decent prices and good service. Try the camamari its good stuff!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bOPADQQ8-8ah7cUxUb9nrQ"
  },
  "xYitfNQ_Ma_7cNlrZGru9g": {
    "date": "8/6/2016",
    "text": "It was our 1st visit yesterday. Excellent place. Food is very very good. We got mussels with white sauce for appetizer. My boyfriend tried veal saltimbuca for dinner which was amazing and is a must try. I had shrimp scampi, super garlicky and tasty. We couldn't resist tiramisu which came with complimentary shots. Our server was funny and attending. We will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "f__R6DGx_HAAbb90qg9I0Q",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/f__R6DGx_HAAbb90qg9I0Q/o.jpg"
      },
      {
        "img_id": "ukkiccjC5eJ3iyV7DWf0jA",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ukkiccjC5eJ3iyV7DWf0jA/o.jpg"
      }
    ],
    "user_id": "XPhKXWJCGyTTMNXQ_swZpQ"
  },
  "rhTpnuIFmrCDUxJCVAIPOA": {
    "date": "7/14/2017",
    "text": "Late lunch. Bar crowd and some diners in restaurant. Old fashioned ambiance but fresh and cozy. Ordered off the lunch menu linguine with calamari in marinara. Salad was tender spring greens with homemade mustard vinaigrette. Delicious and perfectly dressed. Pasta was fabulous. Linguini cooked perfect al denote, sauce fresh, basil and a touch spicy. Calamari in nice sized tubes and so tender!!  Perfection. Very pleasant staff. I will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ae91IRdSc1jUlOq5dKITVA"
  },
  "RCthnEq1tvx8rwyVJKXylA": {
    "date": "6/11/2014",
    "text": "I feel somewhat uncomfortable giving a so-so rating to a restaurant where I know the family personally.  That said, there's a few things that have been amiss at this place pretty much every time I come here.  The food has been average at best and the atmosphere isn't quite my thing.  Tonight exemplified this feeling for me during a dinner with family members.  For starters, this restaurant has been around forever.  Even many of the staff members have been here forever (our waiter had worked there for decades).  Between the long time staff and the decor, the feeling of this place is old school all the way.  It has some of the feel of an old school italian restaurant, though not so fancy that you have to be super dressy here.  In fact much of the clientele here is quite casual.  The customer crowd here has also typically been much older as I suspect many of their customers have been coming here for years.  I rarely see anyone younger than their forties or fifties in there, so interpret that however you want.  The food is old school classic italian from the pastas, the seafood dishes, the chicken and veal plates, and the steaks.  Tonight I went with the chicken francese.  Essentially a breaded chicken covered in a lemon butter sauce and topped with mushrooms.  First off, I'm not a mushroom guy so thats my fault.  But the chicken and breaded tasted pretty bland even with the sauce (which was way more butter than lemon by the way).  It was edible, but not that great.  I've had similar experiences with a couple of their pasta and veal dishes as well.  Each dish gets soup and a salad to start.  As usual both were okay, but again nothing special.  The prices are actually pretty reasonable so even if the flavors don't impress you, you can count on leaving full.  It may well be that I'm not the target audience of this restaurant.  Its an old school restaurant with old school grub, so maybe they're just looking to appeal to the old school crowd.  I'm not opposed to old world recipes as long as they're done well.  From my multiple visits here I find their cuisine adequate, but not much better than that.  There's plenty of italian joints in the Phoenix area.  This one falls somewhere in the middle of pack, at best.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "WMMI5Q4Rmm1Rqdu0jOvyhQ"
  },
  "BounrZJjJ0CzhOmrAka39w": {
    "date": "9/3/2016",
    "text": "A very nice surprise that we found charming and is now a top 5 list.  Food quality was outstanding as well as customer service.  Very down home family feel to the place and the wait staff go out of their way to make you feel you are special.  Prices are very reasonable for the quality of the overall experience.  We have been visiting on several occasions and they are always spot on and have become our favorite local Italian restaurant.  Food quality, customer service and value are outstanding.  Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RwuRZCj3w9wynrBZh9ds3g"
  },
  "1roL32rMo-HWhSExZ1tIug": {
    "date": "2/20/2018",
    "text": "My wife and I went for lunch.  She had the Veal Meatballs over pasta and I had the Veal Veneto.  My veal was fork tender and the lemon butter  sauce was to die for. Both dishes were wonderful.  Christo's is an old school, white tablecloth, reasonably priced, Italian restaurant that is now our 'go to' spot in Phoenix.  Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Eqetg2PkSL55Sx-jRnR4BA"
  },
  "CeQuCLhkiRIXKd6iSDx5hg": {
    "date": "11/25/2016",
    "text": "An amazing evening at Christo's Ristorante! What an absolute treat. This restaurant is a gem that maintains the hospitality and charm of old world Italian restaurants. The bread is warm and fresh. Wine selection top notch with very reasonable prices on high end wines - don't miss the value here! Soups are family recipes - minestrone is thick and hearty. House dressing delicious on the salad. Wonderful array of nightly specials - fresh fish daily! Don't miss this local family favorite. It doesn't disappoint!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MEWMXkieKvjcsE-Ke0SfAQ",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. Best Italian in Phoenix - hands down!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MEWMXkieKvjcsE-Ke0SfAQ/o.jpg"
      }
    ],
    "user_id": "0CeR3wb2Nz9ewnzqmJjkrQ"
  },
  "ZIw5HvNT138B2CJdy5x6zw": {
    "date": "10/20/2017",
    "text": "Even though we had a reservation, we were kept waiting 10 minutes while \"we find you a table & set it up\".  We could see there were many empty tables already set up.  And finally, when we were seated, the empty tables in our section were still empty when we left an hour later.  Although, the service was fine, our meals were served lukewarm.  We were not made to feel welcome & we will not be returning to this restaurant.  After all the positive reviews, we were looking forward to dining here but sad to say we were very disappointed in the experience.  Update:  We were convinced by our neighbors that Christo must have been having an off night so to try it again.  We did & the experience was much better.  Food good, service very good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q5OxYHmkib-i2YujsGLxDg"
  },
  "PkliRwx0-AKOGCGtZdaLMw": {
    "date": "4/15/2017",
    "text": "Had dinner here last night. I have no idea why it took us so long to try this place but will certainly be back soon.  Sat at the bar and Mike took great care of us. Great drinks and a couple of shrimp appetizers were in order. Had a shrimp cocktail and shrimp scampi (can't help it, for me shrimp is a food group). Then split a veal saltimboca as well as the soup and salad that came with it. All I can say is the food and service as well as the interactions with the staff were wonderful. Discovered a wonderful desert that we co created with the manager. He was going to dispose of a bottle of Chambord with a bit left in it. This was while we were having drinks and before we began ordering. I said don't throw that away. Pour it over some cheesecake. He gave me the bottle lol. After dinner we ordered a slice of cheesecake and he took it in back and served it placed in a saucer of the leftover Chambord. OMG. We shared with him and enjoyed high fives all around!!  Do go to this amazing local favorite!!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "o1hdVCYTWCTHEQZbmVT8Jw"
  },
  "7R6OBUMzvG2UHXjm1vsYew": {
    "date": "5/24/2014",
    "text": "I went to Christos as my 2nd Restaurant Week stop. I sat at the bar and it was a bit crowded there, but with lots of good energy people.  When I mentioned I would be skipping dessert, they were happy to sub a bruschetta for me! And I expected one, but they gave me four! And the goat cheese that came with it was fabulous.  The meal also came with a glass of wine, but as a non-wine drinker I passed on that.  After that, my real appetizer came out. Eggplant with a romesco sauce, shrimp scampi and a stuffed mushroom. A perfect portion and really delicious.  I finished with a chicken marsala roulade. This was just ok. The marsala flavor was a little too light, and the filling in the roulade was a bit stringy and didn't really boost the flavor like I expected it to.  I would definitely recommend it but I would try a different main course item.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "mxwEYOI6V7pPd4OuloSulw",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. Restaurant week appetizer of eggplant, shrimp and a stuffed mushroom.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mxwEYOI6V7pPd4OuloSulw/o.jpg"
      },
      {
        "img_id": "k2y4Pb8XUL1DsqQWVs3ebw",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. Restaurant week bruschetta",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/k2y4Pb8XUL1DsqQWVs3ebw/o.jpg"
      }
    ],
    "user_id": "MWww0eiHa1YY-MdU1faNKA"
  },
  "f2Rtjsv78yQ8nGT2Mufa9w": {
    "date": "12/31/2015",
    "text": "OK, this is entirely sad.  We love Christo's and rely on both their service & quality.  But, not this New Year's Eve. Chaos, overbooked, under-served... all play into simple questions like: How many times might one ask for water?  Bread, butter, olive oil?  The reservation I made weeks ago, we arrived a bit early and had truly wonderful drinks at the bar.  Bar staff was terrific.  That's where terrific ended.  After rechecking at the desk, the new lady said we'd never check in.  I said OK, see the short next-up list you're holding?  I'm 3rd.  You are?  yes, that's me - the one and the same who checked-in over a half hour ago and told the lovely lady who check us in we'd be at the bar.  AND she said she'd come and get us...  Well, the new lady wasn't even believing the list she held.  NOT Christo's usual treatment.  So a while after returning to the bar, someone else came to seat us in the way, way, way back adjacent to a serving station, we were seated at a pop-up folding table for 6 albeit we were 4.  I suppose that's good for room, just not for shaky tables.  The Calamari appetizer was fine.  Entree's have been better.  In spite of a limited holiday menu the venerable Osso Bucco was OK {could have been more tender} the pasta on the same dish was drowned in some light liquid and a bit too slippery.  My entree worked out better than my wife's.  Her Veal Chop was good but the plate was saturated by her pasta slathered in such excessive garlic it was simply not to be eaten or enjoyed.  Note: the menu said the chop came with their wonderful potatoes.  When we asked, the waiter replied: \"sorry, no more left.\"  And we were there at an early seating for a limited menu?  What's up with that.  When I told the waiter she couldn't eat it, without offering, removing or changing plates he just said: \"I'll see what I can do.\"  Some time later he returned with a small side dish of - you guessed it, their potatoes.  Here's my problem.  We love Christo's.  Usually, great service, great food and a good time had by all.  Not tonight and that's sincerely sad.  More like getting the bum's rush, awkward portion sizes, measly salads, etc.  For desert we thought we'd share a tiramisu and we did, even though the tiny piece was a good bit smaller than usual.    So, here's the thing... how can a normally great restaurant botch a holiday and celebratory cheer?  I guess you over-book, don't tend to your customers anywhere near your usual quality and sort of mess-up each dish?  NOT up to their par.  NOT why we chose Christo's over other quality Italian Restaurants in Phoenix & Scottsdale and sadly, NOT a great time.  Goodbye to 2015.  Sadly, at Christo's, we expected much better preparation, portions, service and hospitality.  But, then again, why would anyone go to a place for a celebratory meal to be bummed out or disappointed?  We'll see if we hear from them?  Hopefully, it won't happen again this way?  I hope for the great old Christo's service & quality.  We'll see?",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "fLVyDA09Wku6iTZmZGhzAw"
  },
  "tly-FM7kVZs-fe4rnTjFlw": {
    "date": "5/18/2016",
    "text": "Christo's was the restaurant I picked to thank my parents for helping me during a medical ordeal.  It was exactly the best place to go.  Entrees come with soup and salad.  Monday's soup was lemon rice and it was wonderful.  Entrees were delicious...a very nice portion for the money, without being ridiculously huge.  Todd was our server.  He was very pleasant but almost too efficient...he dashed off more than once before catching our wine selection or our dessert orders.  The pace of our meal was also a tiny bit rushed.  That may be what the local area demands but I prefer a leisurely pace.  These two small negatives do not detract from a five star dining experience.  Try Christo's if you want good, authentic Italian food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FX7BjzTJAuCAul1eXyRWqw"
  },
  "y1L-b53FRI4-JUb3BAdeJA": {
    "date": "6/27/2017",
    "text": "Been going here for years. By far the best Italian food in town. Great service from the moment you walk in the door. Some of my favorites are The Halibut, The Chicken Rollatini, The Chilean Seabass, Pork Chops, and The gnocchi with the pink sauce is to die for. I could go on and on. Their Dirty Martinis are also a great addition as well as their choices of wine, that surely won't disappoint.  I'll be back again soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oL1agPP6EygDCerXJDjS-g"
  },
  "WkQPBg9hNvYusLf3wa7QdQ": {
    "date": "9/3/2017",
    "text": "My husband and I tried this restaurant last weekend for the first time on the recommendation of a friend.  We were greeted warmly and seated at a great table.  Our waiter was efficient and we ordered cocktails and wine along with the Calamari appetizer. It was delicious and cooked to perfection.  My husband ordered the chicken Rollatini with gnocchi special.  He remarked that the chicken was barely warm and didn't enjoy it as much as he could have.  He did say the gnocchi was the best he ever had and wished he had an entire portion of just the gnocchi.  I had the shrimp fradiavolo and enjoyed it very much. It wasn't overly spicy and had a great flavor.  Soup and salads also accompanied our entrees and made for a wonderful, complete meal at a great price.  We would definitely come back here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rsRoERZUe77JSxwwuSzpiA"
  },
  "FZNLPt1x67NJVr1WoDzXEQ": {
    "date": "9/28/2013",
    "text": "Christo's is OK if your into three courses in less than 45 minutes. I was expecting to dine here but it was much more similar to a diner experience were you get whammed bammed and thank you'd as we were in and out in a jiffy.  My husband loves classic Italian Foods and according to reviews Christo's seemed like a top destination. Honestly in general the food was OK but not great and nothing I'd drive out of my way for. I almost never consider service as part of my review since it varies all the time everywhere but in this case it sort of even lessened the experience so MUCH that I have to consider it otherwise I would have given Christo's three stars.  Our waiter quickly greats us and ask if we want the menu or the restaurant week special. Despite being around 70 years old he was very quick talking and very speedy and sort of made us nervous but what really bothered me the most was him  and his helpers standing there not to far from us with his arms crossed just watching us like a hawk eating the whole time.   Now the food.  I started with a Christo's Caesar Salad. I could tell the dressing was house made as well as the croutons. The dressing wasn't properly emulsified nor was it balanced in flavors and was super heavy with lemon. The croutons were crisp and buttery. I pointed out the faults since I know them but it really was an OK salad. I do note I wasn't offered fresh ground pepper, nicer restaurants do offer fresh ground pepper for Caesar Salads.  I was sort of excited to have the classic dish Sole Meuniere here. The Christo's Version is nontraditional as the fish seemed heavily coated (maybe battered not sure) with flour in a lemon white wine sauce in stead of a traditional lightly floured and prepared in browned butter. The fresh spinach on the side was just plain without anything on it.   Desserts seemed house made and were OK. We both liked the lemon cake better over the mousse.  A glass of house wine was included with our dinners and during the meal we finished it and my husband ordered another round. He noticed a price difference from the menu and questioned our server. The server confirmed it wasn't the same price as the menu and said that for restaurant week they up charge the wine. It was only a few dollars but I feel this is bad business and not good for customer relations.  I was really torn between two and three stars but the surprise of the wine up charge, being really rushed though dinner and with the waiter and his help all standing across from us just watching us the whole time in a unprofessional way sort of spoiled the dining experience.  2.5 Stars",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 10,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "th8KgRSX9N1-wZpr571c6Q",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. Veal Braciole",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/th8KgRSX9N1-wZpr571c6Q/o.jpg"
      },
      {
        "img_id": "zGCzNP--_p_MxD6B14I1gg",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. Sole Meuniere",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zGCzNP--_p_MxD6B14I1gg/o.jpg"
      },
      {
        "img_id": "xmN-53DCrodG7ZBX2-PeYw",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. Christo&amp;#39;s Ceaser",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xmN-53DCrodG7ZBX2-PeYw/o.jpg"
      }
    ],
    "user_id": "V-BbqKqO8anwplGRx9Q5aQ"
  },
  "KZA_sdRNFNlsAlmNJzFR5g": {
    "date": "3/19/2017",
    "text": "So we watch Check Please and know they had featured several restaurants in our area so we found Christo's. Made reservations for Saturday evening 3/18. Was seated right away and passed through a very full restaurant with a large party of at least 15 and several 4 tops.  We also noticed very quickly that the majority of the patrons were of the retirement age.  We were attended to by our server Julie. Great personality.  We started with the Calamari and Escargot.  I had never had Escargot so I was glad this was the place to experiment. The Calamari was so good. Crispy and tender.  The escargot. I can now say I've tried it. My husband got the filet mignon and it was so tender and good. Daughter got the strip. Good. My Mom and I got the Chilian Sea Bass with pasta in a lemon oil sauce. So.So.So good.  We were disappointed to find out they didn't have Creme Brulee.  So we didn't get a desert. We really didn't need it either. Definitely will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fpbAkGdUnxcXb79GY2NeEg",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fpbAkGdUnxcXb79GY2NeEg/o.jpg"
      },
      {
        "img_id": "pXym7ChrhYqLAIiGMDvxzw",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pXym7ChrhYqLAIiGMDvxzw/o.jpg"
      },
      {
        "img_id": "5Q3UDumqeWcCZitm0PEaoQ",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5Q3UDumqeWcCZitm0PEaoQ/o.jpg"
      }
    ],
    "user_id": "SpsmKq-8TZX51jp17FdiXg"
  },
  "B6fTBiRn73pblG5I4LWSsg": {
    "date": "4/11/2017",
    "text": "This place is delicious and fairly reasonably priced. Some dishes are certainly better than others (the sea bass is amazing - the sole not so much) but the service is friendly, fast, and overall great.   My family has been coming here for years so I think it has a special place in my heart. I always love their salad and soup that they serve before the meal, and basically any of their appetizers are amazing. Veal marsala is great, linguini with clams is amazing. Their seafood has been plus minus for me - it's sort of a gamble, because it's either the best thing I have ever tasted, or a mediocre piece of fish that I could live without.   Either way, this place is definitely worth your while so stop by!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "abDVSuOm3n3UrH-jtV3oNA"
  },
  "UIaVAHyMgsm28Wx7wCUchg": {
    "date": "11/11/2017",
    "text": "The tone for the evening was set when we were \"greeted\" at the hostess stand by the very old, very cold and rude, very judgmental \"hostess.\"    It was actually surprising to be met by such a cranky, rude and inappropriate woman as the \"face\" of the restaurant.  All I could imagine was that she must have been the wife of the owner because no other owner in their right mind would allow that person to greet people, certainly not at an Italian restaurant where the host is usually friendly and warm.  She couldn't find our reservation so she assumed we were making it up and decided to behave as though we had just been released from federal prison for the felony of lying to get seated on a Saturday night.  Then the suited manager came over and surprisingly, was useless and could barely articulate a sentence, not because he was Italian (which I doubted) but rather because he was somewhat of a dullard who had nothing to say.   But, the hostess witch finally found our reservation, only after I quickly scanned the reservation book and pointed it out to her and without an apology or even an acknowledgement of her inappropriate attitude, she walked us to the table without saying a word.  Like she annoyed that I was being honest and she was doing us a big favor.    The food?  I'm Italian and I've traveled around the world many times, and this tasted like what I imagine Olive Garden would be like.  Over-cooked gluey pasta, veal drenched it too much sauce and tasteless.  My wife's halibut was so overcooked it was tough to cut through, very unusual for fish.   I will say that the waiter who had worked there for decades was very friendly so that was the ONLY pleasant thing about the experience.   It is impossible for me to understand how this place gets any favorable ratings.  By good or great Italian food and atmosphere standards, it's truly disappointing.  Anyway, never again.  Wouldn't consider returning under any circumstances.   By all Italian comparisons, Mora Italian in downtown runs circles around this place in every way.   Christo's feels like an assisted living dining room.   I would highly recommend ignoring the positive Yelp reviews and going somewhere else.   You'll be doing yourselves a favor avoiding having to eat and pay for this slop or endure their frontline staff.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 16,
      "cool": 1
    },
    "photos": [],
    "user_id": "gebc35yy99JpMqsqqyK-0A"
  },
  "3Ir-sjmXiVde07NR-zd3Ng": {
    "date": "6/30/2017",
    "text": "The best place for couple dining! Young couples, old couples, couples in love.. Couples with families...  There aren't a whole lot of places you can go where dining is still considered an honored, intimate experience where people dress nice and converse without phones.   After only a few visits, the staff remembers you-- which is one of the things I look for in a good restaurant.   I have never run out of drink, because they keep water on the table at all times. Maybe I'm petty, but this totally wins my heart over.  The best thing is the prices are reasonable for the amount of food you get. If you don't try their blueberry cheesecake at least once, I feel sorry for you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "JV4OGOTfaNdsNbWzH1TrQQ"
  },
  "3JZRttbfc7WXSUrwPwMnMg": {
    "date": "4/20/2018",
    "text": "Great food reasonably priced. Good wine atmosphere and Close to Downtown PHX. We have made this a regular place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NKMdSnCiJuzbXbLJEUa-eA"
  },
  "somfZnEWpOo-z7gGO4-tFw": {
    "date": "3/27/2018",
    "text": "This is my favorite place to eat in Phoenix bar none. Best food and server in Arizona,  Be sure to ask for Satino!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uTiWOQyMS0t6QKT9inv6Pw"
  },
  "8pun438dLYRWqWMHwHc45g": {
    "date": "2/20/2018",
    "text": "Another Phoenix classic. Excellent Italian food. Top notch service. Among the finest dining experiences available in town. Amazing for more than 30 years.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hSQs5s_Yb8hffrx5J-xlgQ"
  },
  "81QdFBZh5cLJlOKkYhjtcQ": {
    "date": "1/18/2018",
    "text": "Previous Google Maps review was: \"Nice family-owned restaurant with wonderful food and great service.....\", but sadly, is now:  I went back tonight with my daughter because she enjoyed the duck so much the last time we were there that she wanted to go back THERE. We got through bread, a cup of broccoli soup and had just gotten our salad, when my daughter and I both realized at the same time that there was a good-sized German COCKROACH openly on the rim of her salad plate. It may have just as well been standing there doing a polka, it was so hard to miss. Now being from Phoenix, I'm used to the occasional red sewer roach showing its ugly head, as they sometimes crawl from out of the drain. You can't help that. The little German cockroaches, having lived in an apartment at one point in life, only come from a colony of German cockroaches somewhere. Maybe not in the restaurant. All I know is that one of the colony members was on her plate. Maybe it was just visiting town and mistakenly ended up getting lost in Christo's kitchen. Needless to say, and I'm really very sad to say so, because I really liked Christo's prior to this, I will not be going back. What's even more sad is that I didn't even get an apology. I was really enjoying my night prior to this. I think it will be Fox Restaurants from now on. Hopefully, they make regular pest control appointments... and look a bit more closely at what they plate and serve their customers.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ckAlO23LpAHzCmNOJQPtLg"
  },
  "v_8rWtRqdxpa3gttGk_2Ng": {
    "date": "3/28/2017",
    "text": "Wow! I love Italian but THIS Italian is top notch! They've been open for 30+ years & thankfully I've now had the pleasure to taste why. One of the best Tiramisu's I've ever had! The food is amazing! The wine glass prices are incredible and our waitress Julie was wonderful!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fA39oIwjrPGVC24JqSF9wQ",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fA39oIwjrPGVC24JqSF9wQ/o.jpg"
      }
    ],
    "user_id": "jykNSgU17GduiA3Fzhnw3w"
  },
  "43gpe7am8hGkxLAiCV82vA": {
    "date": "8/28/2018",
    "text": "A perfect dining experience accompanied by perfect dishes! Our first time visit tonight but definitely not our last.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AbM0rmdBr8KQpyjtaj3c8w"
  },
  "rAJQlts2YkuFFJcyeB6e9g": {
    "date": "1/3/2018",
    "text": "Such a quiet, nice place. Very surprising find in Phoenix and the service was simply amazing. I wish I remembered her name. She knew the menu, what wine to suggest, and she made the night extra special with a special desert.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ew-jj06dzc1FHLEjkZK8IA"
  },
  "PWEX9kHro9i7AgpGgE3_gA": {
    "date": "4/21/2018",
    "text": "Fantastic pasta and seafood! Great service - Meghan especially is delightful! Try the calamari and the escargot. The sea bass, the special, was the best I have ever had.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "fAJ9mCjEq3wN9zcBTDQ-LA"
  },
  "kYdGO_GjLOMf_xOKfKzcqQ": {
    "date": "7/6/2018",
    "text": "Mixed review. Food was excellent. Ambiance was nice and clean. $40 for a piece of halibut and a small side of spaghetti is irrational. I didn't have dessert or wine. As much as I enjoyed this meal, I won't be back at this price. I'd rather go to a higher end restaurant at that cost.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VU31D-EkYdZ8aMmG1e_uwQ"
  },
  "hRy5nZngFzN_ekQ2xBBp3A": {
    "date": "12/17/2016",
    "text": "This place is incredible, I've been going here for years for anything from Christmas dinners to date night. The service is always top-notch and there is a genuine feeling to the whole establishment. Their food is nothing less then phenomenal; the fish are freshly flown in & everything is prepared with care and expertise. Premium food, a fantastic staff with a classic ambience provides one heck of a dining experience. Not to mention they can make a great dirty martini, something to truly appreciate!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "6WJnCL8qsszhQOhFq-H7uQ",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. The back entrance",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6WJnCL8qsszhQOhFq-H7uQ/o.jpg"
      },
      {
        "img_id": "glnKYF6iBoJ4EPQb59vQcQ",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. Veal Chop",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/glnKYF6iBoJ4EPQb59vQcQ/o.jpg"
      }
    ],
    "user_id": "VZC5t7A2h5FtZKN7FR3RyA"
  },
  "7ErVauMZPqKH-uS5OYbLpw": {
    "date": "10/5/2017",
    "text": "The food here is A.M.A.Z.I.N.G! I had a Vegetarian Fettuccine Alfredo. Let me tell you that this dish was delicious; not like a regular Italian place delicious but above average! This is definitely complemented by the very personable Manager, Sandy! He is a really cool and smart guy who knows how to keep his customers happy.   Go here ONLY if you like great food and great service! 5/5.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-FANrnVFhcTtOYnhr9V70Q"
  },
  "oTjSCGUARp_pvsFZubHgCQ": {
    "date": "8/8/2016",
    "text": "Always delicious with excellent service and atmosphere. We've been here for lunch and dinner and they are always accommodating!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Z23PWtMHFYHfwonDxVjh-w",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. Diningcarea",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Z23PWtMHFYHfwonDxVjh-w/o.jpg"
      }
    ],
    "user_id": "4n7lQDju1y03OFQ3Ibh45w"
  },
  "A0PXP0yG-qLTflt3_nPfWA": {
    "date": "6/6/2018",
    "text": "Very good old fashioned Italian Restaurant.  Excellent food and service.  A group of 15 of us go a few times per year and always enjoy it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Iu4a4tsBYusEABeAOEmngA"
  },
  "QgyZcfR59WzxlGGUD5Qx5w": {
    "date": "6/24/2018",
    "text": "Had an excellent meal here with the family.  Nice atmosphere and waiter provided very good service. Staff was nice and good wine selection.  Sea bass was perfection and order the bruschetta for an appetizer and thank me later, absolutely delicious. Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HhSjfnJ3PfyCy24du2QqMg"
  },
  "ZVAOzjz0baePenE7AYqEGg": {
    "date": "9/27/2015",
    "text": "Went here last night with a group for a friend's birthday. Never been before but will definitely be back in the future. Service was on par. Food was incredibly insanely delicious. I had the Chilean Sea Bass. Real not fake like some other establishments. It was probably the best I've ever had. Ever. Enjoyed some Black Sambucca after the meal. It was a great evening with good friends!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "kc5AolWIXO5KkySCu4bAqg",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. Girls night out",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kc5AolWIXO5KkySCu4bAqg/o.jpg"
      },
      {
        "img_id": "evoxTMhhXrm6HHd3aok6Bg",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. Chilean Sea Bass in a garlic lemon sauce over wilted spinach",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/evoxTMhhXrm6HHd3aok6Bg/o.jpg"
      }
    ],
    "user_id": "0rOldmzos1vjkd0SmHbKZQ"
  },
  "EgEaKgv2fZNPJGGCInKf5Q": {
    "date": "6/13/2017",
    "text": "I can't tell you how much I LOVE Everything about Christo's the very best!! Salmon to die for!!! Santino is the most amazing server! He makes the whole experience!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "_V-Z14635TgAFQTb8yycOA"
  },
  "o66h3C6gNu3NKcY_QgGn_g": {
    "date": "5/21/2018",
    "text": "Best Italian restaurant in Phoenix reasonably priced and the food is fantastic I will keep coming back for more",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IWv77-Hn5ypla2jGEYNmyQ"
  },
  "ymtlvLk424R7rAZe6S9EzQ": {
    "date": "12/29/2015",
    "text": "grate place to come for dinner siting inside the bar from what I exsperince the bar tender aj was wonderful she was on top of everything it was my first time there she suggested    some options I tried them and they were really good I had the sea food dish that was sesame the snails were good but not the best they had a grate drink section  the crowd is way older then me but there cool to talk to they are all welcoming",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kbfpED-6FURIsNlsAXqc2g"
  },
  "pJADhiFkusSOQBnsfpGBmg": {
    "date": "4/16/2016",
    "text": "Great, real Italian food, with attentive staff! I loved the chicken piccata and it was the best I've had in a long time!! Perfect tender crisp fresh veggies on the side, and a very reasonably priced Malbec. The other diners had chicken parm, a stuffed chicken breast, and one picky diner asked for a very simply prepared piece of fish with no oil or butter and she was very pleased.  The waitress came to check that it was just right and it was. All entrees are served with a delicious soup and small dinner salad. Yes, save room for the flourless chocolate cake!!!! We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jGGQBoFA7P0A8jEcQRhCjA"
  },
  "rpk1sUgKfqJjX1jZIdcc0g": {
    "date": "3/26/2017",
    "text": "5 star food & service. Authentic Italian with incredible specials at a reasonable price. Ask for a table serviced by John...he's awesome. Thanks for the Sambuco!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0fXyqi9CJdbUcNLFsiU7mg"
  },
  "T30v7hjiHhHDTCkIBGvKhQ": {
    "date": "2/23/2016",
    "text": "Excellent meal reminded me of a small family restaurant back home from the decor to the attentive staff to even the regular patrons. My dad had pasta with his fish and someone who doesn't really like pasta loved his and wanted for more. Mom had veal and enjoyed it while I had scallops. I loved the quantity and cooking of those scallops and would go back for more. The winner for dessert was the to die for mousse! Will be back but a must for reservations and early for parking as it was limited especially for handicapped. Lastly no booths available so make sure you can sir at the table which were actually comfortable for someone that normally needs a booth.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "sXWkEW6UWgJIxX2p0OzTsw"
  },
  "tPPTFy8OurBm26cwk2J7kw": {
    "date": "1/6/2018",
    "text": "We are loyal fans of Christos and this restaurant never fails to live up to their high standards. First of all, it's family owned and operated, and they care how their patrons' dining experience is. A slight mix-up with our reservation was quickly remedied and our dining service last night was perfect. I had the most yummy salmon with fresh bright veggies and pasta. YUM. Others in my party cleaned their plates too. It's the only restaurant where the price of the meal includes soup AND salad AND the entree and it's reasonable. The wine was great too as was the dessert (those were extras however). There is a bus boy as well as wait staff so one never needs to ask for another glass of water or to tweak a meal that has arrived at the table. Even though a very long drive from our home (45 minutes in rush-hour traffic), it's worth the drive. If you make an advanced reservation- even for two people- they gladly accommodate and appreciate your patronage.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TF6d8FY6aikIQ0hGePmnGg"
  },
  "qzvFrgk1oVfRcyILYuyNQA": {
    "date": "5/20/2016",
    "text": "I go here mainly for happy hour where you can get  good appetizers for $5 each and a cheap beer.  But this is an older place that depends on retired blue hair regulars, customers who are dying off.  Looks like a retirement home in here. Nothing has changed here in years.  An Italian place that doesn't have lasagna on the menu? Are you kidding?  I asked and the owner said they sometime serve it for lunch.  Hmmm. A good place to eat if you live near but I wonder if they will still be around years from now.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h2KVxcdzCYZ0ZBCUQQaB6Q"
  },
  "GA8cZFz9ivmYmYmVsBV1gQ": {
    "date": "8/20/2016",
    "text": "If I could give zero star review I will give that. The smell when you walk in the back door should have been our first sign but as they have good reviews we continued to the front to be seated. The host at the front was on his phone and as we came from behind I saw he was looking for emojis in this texts messages. We waited at least 3 minutes but felt longer as we were just standing in front of him, a server even walked in and past the host. He finally looks up and asked if we called ahead. My husband and I said no, and he said ok follow me. He walked us over to a table with no menus and just stopped so we just sat down at the table. Someone came by to give us water after we sat down. Then we watched and waited again. We sat for 5 minutes until I stopped a waiter and asked for a manager. This server said it looks like our server was busy so he would take care of us. I told him there would be no need I just would like to speak to a manager. The host came over! So the man at the door who first ignored us was also the manager! I asked him if he was really the manager then asked if this is really how they treat customers reminding him he was on his phone for 3 minutes texting when we arrived to seat us to be ignored again! I seriously do not understand this is acceptable to run a business and will never go back!! I am truly appalled!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "21h20c6s9Gg_wzrJ16yj-Q"
  },
  "8gkVZv3MlAGYER3y1-OODw": {
    "date": "1/10/2016",
    "text": "Tried the restaurant  a year later . Service  was better. Place was packed with a waiting list . Again my waiter forgot my drink . Great bread . I had the osobuco  .  The order was larger and extremely  tender I would highly recommend  . The fresh spinach with garlic was great . Big improvement  .",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4ZkQwaOoLT2eJWux9fE1Jw"
  },
  "s6ffbhf00b-kNXS2NEFb2w": {
    "date": "8/1/2015",
    "text": "This is the neighborhood classic. The food never disappoints and the service is excellent. They have amazing weekly specials and their happy hour is great. The only Italian place we go to!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "X-ErIfYW7MYZqdxAdSgkkQ"
  },
  "hyI8Cf-B_t-vnAqCAtUAwA": {
    "date": "2/22/2016",
    "text": "These guys do it right; this is a great date night spot with an awesome wine list and a menu prepared totally in-house.  Service can't be beat!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wwd0SZ3m73-2vzLFJ1nsLg"
  },
  "wtzcb4f7AAb2qm2IOnAdHQ": {
    "date": "1/30/2015",
    "text": "Being from Italy I find that few \"Italian\" restaurants are really good. There are exceptions but few. First, there is no such thing as Italian cuisine since every region in Italy has its own cuisine much as in China where you have Hunan, Mandarin. Cantonese, etcetera. I'm from Tuscany so our cuisine is totally different from Southern Italy or even Rome. One \"Italian\" restaurant cannot cook well all the regional dishes, especially with a Mexican staffed kitchen and a Greek owner. Food is adequate but not authentic.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "VoxCMQQZOb9Qn8ikxArdRw"
  },
  "1Chm0lNtCU74KaODuaMeJQ": {
    "date": "11/13/2012",
    "text": "Yes I have been here before...  Now for a person who has been to Italy and has worked in restaurants for years I think I can give a pretty fair review:  My Girlfriend and I went there very hungry on a Friday night; they were not busy nor slow, about average for October in Phoenix. We called to make a reservation and when we came in we were seated without menus. Now working in restaurants this is almost un-heard of but like I said we were hungry...  The waiter came over and asked if we would like something to drink (A little rudely) but like I keep saying we were hungry. Since we didn't have any menus including a wine menu, we asked the waiter to see some menus. He proceeded to only bring a wine menu...  After we made are choice we laid the menu down in clear vision of the waiter (A definite sign to come back to the table.) He then proceeded to take the other tables' orders. (Perfectly fine). Oh and they had both food and drink menus as this comes back later in the story.  We waited for a solid 10 min before trying to flag down the waiter....NOTHING. We decided to try to flag him down and he was having none of it. We then got up from the table and left! Walking right passed the so called manager (Older lady with short brown hair) she told us to have a good night as if we just had a great dinner.....  We were so hungry we needed to go somewhere else!! On the way to a much nicer and hospitable establishment. I called Cristo's and asked to speak to the manager. The lady who told us to have a good night answered and told us she was the head manager and then proceeded to tell us that not giving people who sit down at a restaurant menus unless they ask... I had never been so offended in my life. A straight up LIE!!   I could not hear any more. Hopefully the owner reads this and make this right. I am not seeking anything free I just don't want this to happen to anyone else ... EVER AGAIN",
    "rating": 1,
    "rated": {
      "funny": 6,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "uIKTc8zFrq7sDS4_sGayNw"
  },
  "9KJpeQzKllXbG0plrL3kZQ": {
    "date": "2/17/2016",
    "text": "My absolute favorite place to dine! I always have the Chicken Rollatini with gnoccis and their salad and soup is excellent.   If you can get at Santini's table you are lucky. He's the best!  If you haven't been there yet, GO!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eGKC9S6I05jC3fnOT6njQQ"
  },
  "XQYwtBWpvcpP2VPQQmtOfQ": {
    "date": "12/21/2015",
    "text": "Service was astounding and the food was top notch.  Great suggestions from the server and the ambiance was great, and the osso buco",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v6Gund4x2alsoha0KX-Kkg"
  },
  "LMXw_EIXEYgRmIJEERQdew": {
    "date": "10/9/2015",
    "text": "My wife and I have been going here for a few years now. We love the atmosphere. On weekdays there is always an open table for us. On the weekends we make sure to call ahead and reserve a spot. During holidays this place is packed! We recommend the Halibut as the best entree in the house!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PNK243RqZRHWHNCWpoqigw"
  },
  "oZh0XfMw3Ay6zWAgqhWSQg": {
    "date": "4/10/2015",
    "text": "Great family owned restaurant!  The service was outstanding and our waitress, Julie, was extremely knowledgeable of the menu and specials.  I had a stuffed chicken dish with a side of gnocchi, which was one of the specials.  It was excellent!  I also had a Greek salad that was almost a meal itself.  I was so stuffed I didn't have room for dessert.  I'll be sure to save room next time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "MJ1H4kFEeQS-vk0gCNB8cg"
  },
  "snm5TTK2BpQELCRhMu5Ktw": {
    "date": "10/2/2012",
    "text": "I went to this establishment while visiting my dad - he's been here before. Now, I'm not among the jaded whose nose sticks up in the air just because it's not NYC fare - and certainly NYC doesn't have any Mexican that can compete with the best of metro Phoenix - so I just want to point out I'm doing my best to be objective.  We ordered mussels with marinara for an appetizer, Dad had veal chop for the main course, and I had a haddock special. All came with salad, which is a nice touch. Everything we ate was of nice quality and absolutely satisfying. If this was NYC, the prices would have been at least twice as much . . . and I would have given the same review anyway. Waiter was also attentive, even sitting down with us as he took our order (relax, people!).  Dad usually has taken me to Barrio Cafe when I visit, but I'm certainly glad he took me here. Clientele tends to be older, so don't come looking here for atmosphere if you're Gen X or younger, but if you come here for the food and service, you won't regret it.  A total surprise . . . a total gem.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 9,
      "cool": 4
    },
    "photos": [],
    "user_id": "WTVr3jCQq6pZWkMFAXnhZw"
  },
  "nwCBxp6zybyLppyeAQRcXA": {
    "date": "8/22/2015",
    "text": "Went for dinner last night after hearing great things about it. It's was okay. Parking was horrid and food was just okay not wonderful. The soup was wonderful best part of the meal. I might return",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oeW8cHUeb7GuHiMVN4hxIQ"
  },
  "OSRBXDjUvFq1CIQ7D3yGmw": {
    "date": "3/30/2015",
    "text": "We have dined here many times over the years and we take guests with us from Europe and they loved it too! They were busy last Sat. night, but since we were late, they found a table for us.  The men serving are always so informed, concise, professional!  I ordered my fave Halibut...DELICIOUS! I always request WITHOUT the Feta...I like the light natural flavor of halibut and do not need strong feta on top...the garlic-butter sauce is perfect! Partner loved the scallops, but said they were just a bit small and too soft. he is accustomed to firmer texture, but flavor of sauce was excellent and he loves it.  We both appreciate the vegies, which are not too soft not too crunchy, but perfectly cooked. Caesar salad is always good and NOT vinegar loaded! Complimentary minestrone soup is good and a nice touch.  Crusty bread with soft center is very good...how about some SOFT butter, instead of the very cold hard stuff?  NOTE: You WON MY HEART! You have a delicious SWEET RED wine from Italy...I really like it and you said it was great seller for you. It is wonderful!  Special touch, I appreciate...there was only about an ounce remaining in the wine bottle at the end of the night...the waiter, came to the table and offered it, poured it and said with our compliments! CLASSY and SMART! After all, the head-space left with only 1 oz in bottom, would oxidize over night and become harsh by next evening...therefore, why not \"make space\" in the wine refrigerator for a fresh bottle...AND MAKE A REGULAR CUSTOMER VERY HAPPY!  Thank you for that. We HIGHLY recommend Christo's ... you will never be disappointed...best to make a reservation...many others love this place too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "G_LkLAnKqj4PUNsx8XUo5Q"
  },
  "Nk91o79QIByFetoNUSecbw": {
    "date": "5/24/2016",
    "text": "Have driven by this place for years never been in, until now. We decided to try it out during restaurant week.  The restaruant has been around since 1986, decor is older but rustic, it is family owned.  We all ordered off AZRW menu, starting out with the hot antipasti, which included a veal and spinach stuffed zucchini, crab stuffed mushroom and shrimp scampi, the sauce on the scampi and zucchini was made for scooping up with the hot bread for sure.  One person at our table had the goat cheese bruschetta and the goat cheese was delicious.  For the main entree 2  out of the 4 got the squid ink lobster ravioli and shrimp dish, I got the Dover Sole and the other person got the Chicken Rollatini.  The food was amazing and the service was top notch even on a very busy Saturday night.  Dessert was Tiramisu and the Black and White Mousse, both were large servings and amazing!  During dinner we were discussing this restaurant and a couple of others we like, we found out that the owners of Christos are the same as Alexis in Phoenix, which is another restaurant we like.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "eU77PxGTK58WVRWoXULlEw"
  },
  "iw-uGdo2KhSnoIziSZD12w": {
    "date": "3/18/2017",
    "text": "Use to come here three times a month many many years ago. Have not been here in probably 10 to 12 years. Everything is as I remember. Very attentive staff friendly helpful Waiters excellent food good portion sizes and all entrees come with soup and salad. Definitely worth coming to and if you're in the neighborhood. We'll be coming back again.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "WYVkxVVT-HDFdzNCifATdg",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. Chicken parmesan",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WYVkxVVT-HDFdzNCifATdg/o.jpg"
      },
      {
        "img_id": "LNHRX4HoPg8960pv5R4_EQ",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. Chicken Parmesan",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LNHRX4HoPg8960pv5R4_EQ/o.jpg"
      },
      {
        "img_id": "pH5EMoXUcJqZul3YEYbylg",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. Bone marrow in Osso buco. Yum",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pH5EMoXUcJqZul3YEYbylg/o.jpg"
      }
    ],
    "user_id": "KxGeqg5ccByhaZfQRI4Nnw"
  },
  "EebgH9Rk--tb39Nk03saWQ": {
    "date": "12/16/2017",
    "text": "Came here with the family for my birthday dinner, none of us had been here before but a friend of mine had recommended it describing it as a fancy place but with a mom and pop type setting and feel. Loved the lighting and decor and the food (and bread that came before it) was very good. I got the lamb shanks cooked to my preference and very filling, only downside was the amount of oil/grease in the plate which was kind of off-putting. For your birthday they give you a slice of cake and I got the lemon cake, tasted really good and was a nice note to end on. Would definitely recommend this place to others and wouldn't mind coming back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "fNxaX7wieQwmS3Xb-KIamQ",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. Lamb shanks",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fNxaX7wieQwmS3Xb-KIamQ/o.jpg"
      },
      {
        "img_id": "t51IcEW-FOvvcStBe46PoA",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/t51IcEW-FOvvcStBe46PoA/o.jpg"
      }
    ],
    "user_id": "eLEcP2LdqU132CjdvLjY8A"
  },
  "15sCT83jVY9ozQtzxyX3zQ": {
    "date": "4/3/2019",
    "text": "Top-Notch in every way!  The food and service are both fantastic.  the atmosphere is also very pleasant and warm.  I will for sure be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qO0dQykBiPfSnbHpOXNSog"
  },
  "cAh2SmTUSbjLjSwUGMwE4Q": {
    "date": "10/7/2018",
    "text": "Great romantic joint with an old school vibe. Unique place and decor, unlike most Italian restaurants in Phoenix. The chicken parm is on point and the prices aren't bad at all.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rIhLe7_MO7wf6iYftlbRaA"
  },
  "0nKEBWQcQwZOjPjSP2KVSw": {
    "date": "1/2/2017",
    "text": "I love Italian food. Not just any Italian food, but very good, authentic Italian food that tastes and feels like an Italian grandmother made the recipes in her Italian kitchen and passed the tried and True down. That's how Christo's Restaurant felt when we decided to make reservations and dine here for the first time on New Years Eve. We made our NYE dining 'decision' pretty late leading up to the holiday night...and thus were only able to reserve in the lounge. They also had a special menu for NYE , not price fixe that we were trying to avoid at some of our other restaurants due to all my food allergy issues. Not seeing the menu online initially worried me, but when we arrived for our reservation I was pleasantly surprised at all of the menu options. Lots of seafood! Christo's was packed and to me, that speaks volumes to its reputation. It seemed that this was a family running the place down to the lady at the hostess stand ; the bartender ; the bus boy and the random chef who came out and greeted some of the diners. Christo's has been in the valley since 1987, so it's safe to say, they are doing things right!  We were shown to our table in the lounge. A nice table in the corner. Christo's is not pretentious , but I get the impression they will turn you away for showing up not dressed appropriately. Okay, it's more of an impression. I witnessed it while waiting when two people showed up wanting a table and Initially were told they could have full service at the bar, the couple was a little intoxicated , the lady very much so.. and dressed not so well, not even very half well. Suddenly the Italian lady said that they were fully booked for the evening! Note : don't show up half conked or yucky. This is old school Italian!  The menu is not an expensive menu, at all! Most dinner entrees seemed to be average of $22-25. The table was white linen and candle lit. I liked it , already , a lot!  We started with Mussels in a Garlic Cream Sauce ( there are sauce choices with the mussels , mind you !)and wines .. the wine list is extensive ! I had Veuve Clicquot because it was NYE! A split usually is hard to find for True French bubbly .. here it is $50. Again, worth the splurge and I got 2.5 full flutes. Whew!  The bread is home made and is endless.. I recommend splurging on this. Use it to drudge up all the amazing sauce wonderful-ness of the Italian dishes. There was an ample portion of mussels! The garlic creamy sauce was heaven. Prior to arriving at Christo's I had my heart set on Osso Bucco or Chicken Piccata .. or maybe a classic Duck a'lorange ! That's tricky to find ; the two latter of my choices were not being served on this NYE. I went with the Lobster Tail stuffed with Crab Stuffing. The dinner entrees are served with both soup and salad! I have not been to a restaurant that serves one or both with the meal in many years... so this was a treat! The soup... I've never had anything like it. It was a creamy mushroom with artichokes. I'm sure that doesn't sound so yummy , trust me.. it is. I actually wanted more. The salad was another ample serving and had a housemade dressing on it. I was afraid of being full by the time my entree came! My lobster tail was very good .. I didn't love the stuffing so much , as I prefer seafood without all the 'fluff' and don't feel the need to stuff and sauce them to the gills. The pasta it was served with was perfect with garlic aloli. My husband had the Lobster Ravioli .. again I thought it was very good! The ravioli was perfectly cooked and not mushy. The sauce was light , yet rich and creamy and full of fresh mushrooms. So much to this portion, he didn't finish it!  I loved our NYE at Christo's.. we even saw someone surprise his girlfriend with getting the staff to bring out his engagement ring!! Our waiter was a little 'off his game ' .. maybe he was grumpy about working on this night. I swear he only smiled at the end of our meal... Nonetheless, everything else was so nice that I can't wait to come back here and sample more pasta from the 'normal' menu... Piccata  awaits me!!!",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 10,
      "cool": 11
    },
    "photos": [
      {
        "img_id": "LyuTvTyMfHgoVkWqGbM-9Q",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. New Years Eve 2016 Menu ..  Lobster Tail stuffed with Crab stuffing served over garlic aloli angel hair pasta .. $40.95",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LyuTvTyMfHgoVkWqGbM-9Q/o.jpg"
      },
      {
        "img_id": "GJSakRlfDQwjRSRVSNTp1g",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. $50 Split for a 375ml ( larger than most splits) of Veuve!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GJSakRlfDQwjRSRVSNTp1g/o.jpg"
      }
    ],
    "user_id": "1sGYXSkJHPhJ6wQtc-RbZw"
  },
  "7881W1ldo5KU098dnaS58A": {
    "date": "9/25/2018",
    "text": "Best wIt staff. Best food best ambience I love this place. Everyone eating here knows good food good service great cocktails. My kind of place. Been a patron since they opened in the 80s   Yes best fresh santinni. Love that waiter. And the owners. Christo and Michael.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1DGACjuYPnyTkUb6uhsudg"
  },
  "JLg_E89dMfxoPQRkKxB5gw": {
    "date": "8/23/2018",
    "text": "Love, love this place. The food and service is always on spot. We've been eating here for thirty years...never disappoints. Thank you Christo and Connie!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "k53u0YM8R5mfse9Tz2tNbw"
  },
  "LRClrz_wJHA5rAI4tNTJDQ": {
    "date": "1/19/2017",
    "text": "Dined at Christo's for New Years Eve, and enjoyed the experience.   With NYE came a special menu and a crowd - it was tough to get a reservation but they shoehorned us in.  Be nice to the hostess, talk her up a little, she appreciates it.  ;)  Once inside, we were greeted by the hostess and like some other Yelpers did notice that we might be a little younger than the average Christo's patron.  But so what?   A good meal is a good meal and Christo's served up a good meal.      We started with mussels and chose the garlic cream broth - ample, prepared nicely and served in that delicious broth.   Don't let it go to waste!  The broth is yum-tastic when soaking a piece of their fresh bread!     Entrees were served with soup and salad I ordered the Lobster Ravioli.   The salad was good, with a great house made dressing, and the soup -- well the house mushroom and artichoke soup didn't SOUND great to me, but it was delicious.  Really blew my taste buds away.  I could have just sipped on a giant bowl of that soup all night!  So good.   And the Ravioli was to die for.   I love rich, savory entrees and this was no slouch in that category.  It was a large portion and I devoured as much of it as I could, but after all the mussels, salad and soup I just couldn't finish it!   If you see Lobster Ravioli on the menu, don't hesitate to order.   Very good.    Pricing was quite reasonable especially considering the portions.  Great wine list as well, and to my wife's pleasure, they serve Veuve Clicquot in a 375ml demi at a pretty reasonable price for a restaurant.  Our service was a little slow and our server was quite stoic, but the restaurant was completely slammed for NYE and we are two people who conversation does not elude.  We will definitely patronize Christo's again.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "s79vzEzqavL_29pmraXZBA"
  },
  "VEUnDYVrAlzQAKe9vHf5bA": {
    "date": "2/24/2019",
    "text": "Was looking for great Italian restaurant to take my father for his birthday.And Christo's was recommended by someone in our family so we made reservations for 11 people they made room for us in the bar lounge area.First off the bread they gave before our meal was like warm and the butter was to cold to even spread on bread the second batch that came out was actually nice warm and toasty but by then I didn't want anymore bread.I had the halibut with feta and marinara sauce with veggie which were lukewarm was okay other people in our party had other dishes which I tried I can say the fettuccine was good though and the calamari.One thing that caught my attention was the floor manager that was working that evening was more busy entertaining his lady friend having a drink at the bar I think he could of done a better job with making sure ours and other guest were happy with everything.I was expecting more everyone experience is different this was mine.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x6jZ80J2fJDEP9apaiAdeQ"
  },
  "YmAf1kNxder2Xr1pUcztWw": {
    "date": "7/12/2018",
    "text": "I have been going to Christos since it opened 32 years ago.  We believe it is one of the best in the valley.  The food the atmosphere and the best waiter in the valley Santino.  He makes this a most excellent experience  dining here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AXZ3XQumRTWb0uIN309WAg"
  },
  "q_bWAVsDlGcuh_N_oEJrjQ": {
    "date": "9/4/2018",
    "text": "BEST Italian restaurant experience. Have been going here for years for the ambience and the delicious food and the fair prices.... Saturday night and the lemon rice soup is my favorite.... The wait staff are always on Mark..... The owner cares about their patrons.... and it shows.....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R4-UbSib_mXK1b7UZiF52w"
  },
  "axGAXdYyKrDOVNqqVEo8dw": {
    "date": "6/23/2018",
    "text": "What a wonderful Dinner!  Staff was top notch!  Spoke with the Owner, Michael who was a very gracious host.  We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xTciIEz31teKtAzadbO8Cg"
  },
  "VjMb4PithEpesQBFMxrrSA": {
    "date": "6/30/2018",
    "text": "Awesome restaurant, food is super delicious and the staff is amazing! They often have seafood specials and if they do, try the halibut...it is fantastic. They also have a great tiramisu! Love it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nq_enQJhNNI5YgdPui4p8w"
  },
  "I874bWMcM-WWNPZvneiAnQ": {
    "date": "11/18/2018",
    "text": "Dinner at Christo's was simply delicious!  This was our first visit to this old-school Italian restaurant, and we loved it!  Serving Phoenix for over 30 years, Christo's offers a relaxed, comfortable ambience paired with classic Italian dishes.  In addition, to the many choices on the menu, they also serve a long list of daily specials.  We opted for 2 different veal dishes, and we're not disappointed.  Prices are reasonable, and dinner includes soup and salad.  Our waiter Santino was great; a friendly, Italian man who clearly has been at this for years, and loves his job.   One of the owners, Michael, was very present and spent some time with us sharing the history of his restaurant.  And to top it off, he sent over two incredible desserts and a shot of Ouzo, making our meal and at evening at Christo's a True delight.  Don't be swayed by the many trendy new restaurants along 7th Street, and make a point to visit Christo's.  We will certainly be back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6Qv4jEtpq0k6k3HmBC1YlQ"
  },
  "IGxuTObRg-GgbYk0g0-OUA": {
    "date": "8/20/2018",
    "text": "Excellent service exceeded my expectations. Food was excellent and our waiter Santino was knowledgeable and was on time to refill my wine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ABq3_fp53LI3E3GcebMmiQ"
  },
  "cNpiXB_3FXsQphD5Gk6Sug": {
    "date": "6/13/2018",
    "text": "Moderately priced but worth it for the amazing food. Santino was the best waiter I had ever had at any restaurant. Christo's is and always has been consistently excellent for 3 decades.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "60W3VeaYGV0umLjj9w-h7Q"
  },
  "OtKqKtc9uFfR-naq_J8Tww": {
    "date": "8/11/2016",
    "text": "I disagree with most of the reviews. I too have been treated like they didn't expect you... Even with a reservation.  I find the staff seemed bored with the clientele.  No interaction. Just get it done.  No thanks. I'll take my business elsewhere.  Continue to not welcome new customers and you will go out of business.  Oldies aren't necessary goodies.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "PT6GrJLyXYtXvprtQ79IMQ"
  },
  "v5R-oxWy4k9ZF5m5plYYXg": {
    "date": "1/3/2019",
    "text": "I did like going here twice sometimes 3 times a week to order the rainbow salad always plenty and pleasant to the eye and i always give a tip but...last week i did not have extra cash on me so i was not able to leave a tip well i recieved half a salad thrown in the box and a bag if noodles crushed was this all because i had no tip i come in often.sometimes your running a lil short but i had $9.00 to pay for a salad needless to say i wont be going back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e3FOJAWq0MLI7FFjnoD5ww"
  },
  "bJCnqHiHQHSzoSVbXaG0Lg": {
    "date": "6/14/2016",
    "text": "What is that smell when you first walk in?  It smells like mold & cleaner gone wrong.   Not appetizing!  Now that I've been back twice more I'm sensing underlying issues.  It seems the regulars like this place mainly is because it's a lot of food for the money!  Pros:  Soup & salad included with entrees  Solid appetizers- calamari & mozzarella Decent service with an elegant attempt Shot of Sambuca at the end   Cons: Weird smell  Slow bar service- (all 3 times... SO slow) Reservations are not timely- They act as if they don't expect you to show and then scramble to fit you in... Even if your family has eaten here for 25 years.  Sub par desserts  Mostly clientele over 60 years of age",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "ZkXVuMHbJm753lYaAcuF_w",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. Sambuca shot!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZkXVuMHbJm753lYaAcuF_w/o.jpg"
      }
    ],
    "user_id": "NwxF1Ftc-4P5Pl_SSXThQA"
  },
  "Ob8jgXwqWGVLUiDgE1mhhg": {
    "date": "8/11/2018",
    "text": "Best Italian food in Phoenix, hands down. Impeccable service, attention to detail, the staff is like one big family. I love this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "QLBWl98rdYIdny_vQ6king"
  },
  "3_Z7SV3IiRzzfoLq-6z7Zg": {
    "date": "6/22/2009",
    "text": "I love this restaurant! The waiters are always very accommodating even if you have personalized requests.  It is important to make a reservation, but usually they will get you in shortly.  The food is very good. The best part is you get a lot for your money. WIth the order of an entree you receive: bread, soup and salad. Try not to finish everything or else you will find yourself full and fat at the end of the meal.  Also, this place is not for children. It is romantic and full of mature adults that really don't feel like hearing a screaming child. I've regretfully been there done that. They have a bar with a nice happy hour. Also is a pianist who plays light jazz and softly sings along.  Overall, I would recommend checking this place out.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8pRXk3EG2IWD5_C6PpFuug"
  },
  "m7wb6lDGf6IiQQJ8H6SSgw": {
    "date": "7/10/2012",
    "text": "Visited Christos for the first time today and was completely unimpressed. Upon arriving at 2pm in 112 degree weather my husband was told that \"normally he would not be admitted with a tank top on, but since we were with a regular, it was okay\". Mind you, he didn't have on some nasty undershirt, but a nice tank top. When I got my salad I was amazed that such a \"high class\" and \"must visit\" restaurant would serve a skimpy salad with iceberg lettuce. At lease when I go to Red Lobster (yikes)  I know what to expect. Needless to say, I pushed the \"salad\" around my plate until the waitress came and got it. I ordered the Pomodore with Grilled Chicken and there was nothing special about it, I only ate about four bites. My husband ordered the Veal Genovese and commented that is tasted funny; it's \"distinctive\" taste made my husband sick to his stomach. Honestly, it was like Italian food that you have at an aunts house even though she's really too old to cook well anymore. Nothing special, nothing mind-blowing, just food. Luckily, we were at a business function and didn't have to pay for this meal. The service was fine but even for a free meal, I wish I hadn't been teased with promises of how \"amazing\" Christos is.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "JCeCieSirlqAR_plkcJaiA"
  },
  "Kwxcx8QTtwS4eh_iiBvWmw": {
    "date": "6/28/2013",
    "text": "we've been going to Christo's since the day they opened -- and we're still going. the menu? -- pretty much the same as 25 yrs ago, but everything delicious. they know us (and most of the other regulars) who have been going there for years. service always great, atmosphere dandy, see someone you know commonly. calamari one of the best in town, cesar: ditto. wine list more than adequate and the prices are better than most other places anywhere near this quality! go -- and you'll know!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vaA7vjijG6NbN9yZM2bllw"
  },
  "LEd1hFhdA0iI99mykCc1HA": {
    "date": "12/18/2007",
    "text": "So, when I was much younger I went to Christos and it was the first place I had escargot.  I remember the good food and calm environment.  Sadly, it appears things have changed since I was a child.  I was with my parents and we arrived later then our reservations had claimed we would.  The workers were very nice and said they would try to fit us in the best they could.  People kept on walking though the door with reservation after reservation.  We waited maybe 15 minutes until we were seated.  After a short time our waiter came by and rattled through the specials.  Once he left we were unsure of what he actually said.  I knew before I arrived I would order some escargot and decided to go with some kind of halibut special.  The escargot came and did not taste as great as I had remembered.  It was all right, don't get me wrong but did not stand out.  Our meals came with salad and soup.  The salad had more then enough dressing, luckily the dressing was good.  The food arrived but did not impress.  The plate looked very plain with items not being placed in any nice manner. The halibut was slightly over cooked and did not have much flavor.  It was difficult to speak to one another over the many other loud conversations.  It would have been nice if the food was as good as I had remembered it.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "z9YGQ3jA9-IjcKWYrOTkdw"
  },
  "PIW6p5mjV8X53Xj3kZFJFg": {
    "date": "1/12/2008",
    "text": "Very good food and if your lucky enough to get Warren as your waiter, exceptional, well informed service.  Wine list is good and very reasonable -  Berringer Knights Valley Cab for $30 when it sells at costco for 20+ - great deal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1F9FLcqcysSKKly8gaJ5_g"
  },
  "inGURGK4NaBq77uGfZj04Q": {
    "date": "3/18/2009",
    "text": "I have a degree in hotel and restaurant management so you could probably say that i am a little more critical than most people when it comes to eating out.  Tonight my girlfriend and I went to Christo's.  Our server was horribly slow at taking our drink orders and a table that came in after us already had their salads before we had even placed our order.  The food was mediocre at best we got to go boxes because after an hour of sitting in the restaurant that apparently caters to close personal friends of Abe Lincoln that have nothing more to do than waste an evening at an overpriced restaurant to fill up on caesar salad that tastes like it was dipped in anchovy paste and wish that you hadn't ordered the veal genovese because it just looks like someone threw up on your plate you just want to get out of there.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "swKXIBHH_kDq-mr2JTmsLQ"
  },
  "qoml_9DkdEkw9m2HNfLnFw": {
    "date": "8/11/2009",
    "text": "Christo's has been one of my favorites for many years - my dad used to take me there when I'd go to the office with him as a little kid (I think they still have some of the same waiters as back then!). It's not the finest Italian food in the city, but it's consistently very good. I always get the same thing - halibut in a lemon, butter, garlic sauce with a side order of fettuccini alfredo. Halibut is not on the menu, but they always have it as a special (with different sauces) and they'll make it however you like it. Their entrees are very reasonably priced, and come with a salad with a great mustard dressing...however, they tend to have a heavy hand with the dressing, so you might want to ask for it on the side, or ask for light dressing. The service is friendly and the atmosphere at lunch is \"business casual\"...while it's a white tablecloth kind of place, you'll find people dressed in everything from jeans to suits. And it's not unusual to spot a governor or mayor here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lROh5HIO2jd2VhDOp8yO6w"
  },
  "xqnCYt1gNAeG3v2VhMTiug": {
    "date": "4/1/2019",
    "text": "Great Italian comfort food.  This is what I wanted in an Italian Restaurant, good ambiance, good service and great food.  I started with the fried mozzarella followed by the salad and soup.  The salad was really good, the soup was okay.  For my main I had the veal saltimbocca which was fantastic.  Paired with a nice Chianti, it really made my night.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_SG4o2LCwbg4LACIWs72RA"
  },
  "vIvtezd3q-zXdJm6AUGz0w": {
    "date": "2/12/2019",
    "text": "My husband and I recently hosted a 50th Anniversary party at Christo's and we cannot express how great the evening was.  Food, service, being so helpful in making our arrangements, all were top notch.  We hosted 35 people in the dining room off to the side.  It was everything we hoped for and more.  We have been going to Christo's for several years and chose their restaurant because we knew it was consistently good and we certainly made a great choice.  Thank you for making our Golden Anniversary such a special night.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "D5JJGeX8fAYz8WJeN3XcXg"
  },
  "mi1Uw5yr38L-XYYbzH9wMA": {
    "date": "10/22/2018",
    "text": "Just went to Christo's for lunch and am beyond disappointed at our experience. I've been in for lunch, on weekdays, several times and everything has always been great. Today, my mother wanted to take me out to lunch as a treat because I'm pregnant and was really craving Italian.  We arrive at 11:15, a few tables are filled but not busy. Takes several minutes to get menus, over 10 minutes after that for the waiter to take our order. We order an appetizer and lunch, which comes with a salad. It took an appropriate amount of time for the appetizer to come out, but then after we were finished it took 20 minutes for them to clear that and bring our salads.  At an hour and 15 minutes into the meal we start trying to get our waiters attention, unable to, we ask a busboy to get him. Then our waiter goes to another table then into the kitchen and comes out with our food and a \"sorry about that\". We tell him that we need to go (I have to get back to work) and we need our food boxed up. He says ok and rushes off. Comes back a few minutes later and says it will be just a minute.  The table behind us was seated after we had our appetizer and got their salads and entrees before we spoke to our waiter about where our lunches were. So not everyone was being ignored.  At this point my mom gets up to speak to a manager, the hostess brings our boxed up meals to the table and gives me the bill saying some of it was taken care of. My mom comes back, told me she talked to the hostess who told her the food was compensated. I told her only her glass of wine was off, so we went to the front.  The hostess when asked, says \"You want all the food comped?!\" My mom says \"That's not what I said, I'm asking for clarification when you said our food was compensated.\" She takes the bill and returns with the wine and one meal taken off.  I'm so embarrassed that I suggested Christo's for our lunch out and this was our experience. It was supposed to be a nice treat and instead I'm eating my boxed up lunch at my desk and my mom took hers home with her. Neither the waiter or the hostesses apologies seemed sincere and we got no explanation as to what took so long.  I sincerely hope that someone from the restaurant reads these reviews and can comment to this because I really do like this place but today was a shit show.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 9,
      "cool": 0
    },
    "photos": [],
    "user_id": "E0aokBVEclyyO3-SrznqqQ"
  },
  "5mgrUQi9LCcrwDVjAuevZA": {
    "date": "7/5/2018",
    "text": "My first visit here. The decor is old. Clean but old and visions of Gordon Ramsay suddenly appearing linger in the back of my mind. I ordered the Chicken Limone and was actually surprised at how greatly I enjoyed it. Everything was fresh and the seasoning was spot on. My apologies for doubting my fellow Yelpers and their many good reviews. I WILL be back, and next time I'm bringing the wife.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "URPjW8ckLuLDLR02uuLpTg"
  },
  "bNqnNGLiGfR8jJyMxp_e5g": {
    "date": "3/22/2019",
    "text": "My parents' favorite restaurant for the last 20+ years. Consistently good, great service, nice atmosphere, and reasonable prices.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gMMxgFonCwo3o1qQ7FyrTg"
  },
  "LYMUhOTUTo0CmNTOXFsVRw": {
    "date": "2/17/2019",
    "text": "We went there  on February 13 . They were super busy but they were able to squeeze us in . With dinner  you get both soup and salad. Their French bread is wonderful.  I had their  spaghetti  with shrimp diavolo which was spicy and great  flavor . We also had fish . Service was very attentive.  Great experience .we also had tiramisu",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AY_cjY1bRAD-I_K11dYvOA"
  },
  "0oD5wefXllZ8YLsV4qvdYw": {
    "date": "2/15/2019",
    "text": "Old style Italian at its best and you can eat  out without breaking the bank.  Very busy and difficult to get parking. I would go back again soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jPBp4tMF7qOPeEQQI9ATCQ"
  },
  "3J0cyQU0SGYUFoR3tEgRkQ": {
    "date": "12/7/2018",
    "text": "Great family owned. I was there yesterday, the scallops & seafood of all kinds is out of this world. Have lunch or dinner, they have specials & happy hour.  Not for Kids anytime. Do Not bring the kids!!!!Desserts are to die for, enjoy",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "v7FPnMzdbl6J7U_8H1BWZA"
  },
  "PzN7TU4oql-wfqrlXnNORQ": {
    "date": "2/17/2019",
    "text": "You can't go wrong with anything on the menu! If you haven't had escargot before, this is the place to try it! They are drenched in an amazing butter garlic sauce. Christo's always has amazing specials and their tiramisu is to die for. One of my favorites in the Central Phoenix area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-c8rL8n7bg0_lOg0ezi7qQ"
  },
  "OxvPlnR8XT4iT7kGknmopA": {
    "date": "10/17/2018",
    "text": "It must have been a busy day, the bartender was also tending the tables. The Caprese was disappointing there was no balsamic glaze to dip the cheese or tomato in, it was just served plain ... Ok so we figured the special which was the halibut would be worth waiting for. Well ....wrong again, it had no flavor very bland. Other than that everything else was good. The bruschetta was delicious and fresh. Good place and great service if your into being a happy hour local.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Me4vOfflIto3Q8po8Z6IQQ"
  },
  "0lCbvNCRGcfuvuET5d_KbA": {
    "date": "9/22/2018",
    "text": "On Thursday afternoon at about 1PM Christo's had adequate, in the rear lot. It appears it might be a problem however during busy times.  The atmosphere is tasteful.  There was no background music. A t-shirt and shorts would have been inappropriate.  Once the entire group was there, we were given our menus and prompt attention shortly thereafter. There were several specials not on the menu including Lasagna and three kinds of fish. All were for $10.95 and included a choice of soup (tomato basil or salad). Bread and butter were when we were first seated and throughout the meal. Most dishes have a sauce. Cannelloni Alfredo were stuffed with veal and spinach. Obviously it was topped with Alfredo sauce.  You can make reservations online. This reservation for 8 was made that way. When doing so separate checks was specified, but we had to return the single check to get single checks. It appeared to be no problem for our waiter to do that.  For the later I am between 4 and 5 but I have eaten there other times, and it was as good as it was three days ago, so it gets a five for consistently good.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "EtJzaQ9aaxFAO2dtbOLOKw"
  },
  "0CAyFIA0xsoYQV9M5XbT6Q": {
    "date": "11/7/2018",
    "text": "Had the veal pecatta. Veal was tough, the opposite of the whole point of veal, and the appetizer salad felt like it has been in the cold freeze for 5 hours. Staff unaccommodating and didn't care. With so many other options, why go here? #hasbeen",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nXWHzjQCBTR39Sh-VBRA6w"
  },
  "iRAKQGsW5DbSwvBNaS2M7w": {
    "date": "10/11/2018",
    "text": "I came here for my bf'a grandma's garden birthday dinner. I liked the food a lot. Vegetable soup was tasty. The bread was divine, hot and toasted, spread w butter (you had to spread the butter on as you liked). The Alfredo pasta was scrumptious! The sauce tasted like it was made from scratch and not store-bought. It was rich and creamy. I also enjoyed the chicken parmesan--it was neither dry nor bland but perfectly crispy and flavorful. I didn't get to see the menu or try other things on it as she had a set meal for the party but I was suitably impressed. Making food for a large party can often be hit-or-miss. In this case it was a hit, at least for me! My boyfriend shared the same sentiments about the food and we resolved to return again, perhaps on our anniversary? The ambience is dim and cosy, very romantic, I'd say! The place seemed quite busy and I think that is a good sign. I can't wait to see what else they offer on their menu!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "lfqrYiczrRLl5g4V0rjbiQ",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. Dinner for MaryAnn&amp;#39;s 80th birthday",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lfqrYiczrRLl5g4V0rjbiQ/o.jpg"
      }
    ],
    "user_id": "oDiOz5_bxtdqLTAnVUd79A"
  },
  "XR8azNR32J0u0oH4YL_fqw": {
    "date": "5/8/2019",
    "text": "We brought nine other people to Christos for a birthday dinner Monday night. Everyone got their meals together except for my wife. Her dinner didn't come until 15 minutes after everyone else is so naturally we were basically done when she was starting her meal and it was very awkward. Twice I checked with the waiter to ask for her meal was both times total would be out in 2 minutes and ended up being 15. No offer of free meal Etc was made by Christos. Very disappointed in the service",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G6dQuQGEVrifNW4jGj7GpQ"
  },
  "8Q9aiR4FYLnGB1azxBjeOQ": {
    "date": "8/22/2018",
    "text": "Opened the door to a completely empty restaurant with all three employees sitting at the bar watching some game.  Was turned away for a \"dress code\"  the place was empty, so who was going to even see what we wore?  I think their priorities were more watching television than serving paying customers.  Will never recommend.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "kBK66RAzOZiv9skqXNPr0g"
  },
  "7tf4ofSjH2l2bJVhB6EoUA": {
    "date": "3/20/2019",
    "text": "I was told the food and service was great, but they failed to tell me you have to be White America.  I went there with my children, soup and salad is included with the meal, we were told they had no more soup. When two couples came in and sat next to us suddenly there was soup!  We ordered the Salmon, but unfortunately there was hair in the food. I still didn't let this deter me I went back for more punishment. Our service was at best slow, again the soup they gave us was a plain broth.  As I looked at the other tables they had real soup No broth. But absolutely the best Dill sauce I have had.  Maybe I'll put on a blonde wig and green eyes to see what kind of soup I'll get or better yet maybe my Salmon will be hairless.   No Soup For Me!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HzKcBweErksunHAXc8Jn8w"
  },
  "uF5x3Hok8NZLARwajsf2Fg": {
    "date": "2/25/2018",
    "text": "Ahhh, food is good and service is decent! But went there for first time with my girlfriend, it was her sisters bday , told the waitress it was her bday because maybe get a slice of cake or something, every place does it!, well they brought out a bowl of pudding with whipped cream!! Lol, could not believe it! Something you would give a 5 year old!! In bad taste and cheap!! Will never go there again!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-9S_Fh-sQebyB1yhEM5zHw"
  },
  "-zsqmHIzbDlwbqmOeWLhXw": {
    "date": "4/2/2017",
    "text": "I can't believe I have driven by this place almost everyday for years and just recently tried this place.  Very cool old school!  This place looks like it has been here for ever!  They have a lot of regular customers.  There was not one open place at the bar. You just know when you fist come in here that this place is the real deal for Italian.  They have almost as many specials as regular items.  Soup AND salad come with the entree plus steamed vegetables cooked to perfection.  You also get a basket of warm bread.  I had the orange duck which was cooked perfectly.  The sauce was too sweet for me but I don't have much of a sweet tooth.  My wife had the sea bass over spinach which was  very good.  Service was good which you would expect.  Wine was good, again no surprise.  Overall a very pleasant experience.  I will be back.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 11,
      "cool": 11
    },
    "photos": [
      {
        "img_id": "jxoWKZj50xQjbLKUqBOf0g",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jxoWKZj50xQjbLKUqBOf0g/o.jpg"
      },
      {
        "img_id": "hWvghsvU4ITt02hpCo2NRg",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. Orange duck",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hWvghsvU4ITt02hpCo2NRg/o.jpg"
      },
      {
        "img_id": "pbSVJABEFy7HeDb9oudi-g",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. Veggies",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pbSVJABEFy7HeDb9oudi-g/o.jpg"
      }
    ],
    "user_id": "p82Oi8n25KffU7SV5yyYzQ"
  },
  "7ljPd29JnR14aXCuZdQXkQ": {
    "date": "11/16/2018",
    "text": "Christo's is our \"go to\" place for great Italian food.  They deliver consistency -- delicious food, great service and very reasonable prices.  From the complimentary bread, soup of the day and salad -- all included with our dinner to the best veal (or chicken) parmigiana.  Their seafood dishes are also amazing.  Hot, fresh and delicious!  The staff are very friendly and attentive without being intrusive whether you eat in the main dining room or in the bar. The atmosphere in the bar is fun and we enjoyed the football game last night with other diners and Todd (who is an amazing bartender and server!).   Don't forget to finish it off with Sambuca.  A great way to wrap up the evening!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dSnqmR-tbTPveyg9lt_S5Q"
  },
  "KJ_M76sW9h93dqihlVSWqQ": {
    "date": "11/8/2018",
    "text": "Best local small Italian  ever. Must go here! Osobuco has s amazing. Great staff.  Great owner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qQ9C92BKTaTw0XYCyO8TfA"
  },
  "3enxXjE0vtVaZ-un4iwVYw": {
    "date": "1/5/2014",
    "text": "Food is good but the bartender Stephanie is rude and ignores customers but caters to the regulars,  it seems like she hates her job and is miserable,  poor management and not so friendly employees,   I called and left a message to speak to Christo or wife Gloria but of course manager intercepted the message so I never received a call back from either,  I hope that Christo would read  these reviews him self so he knows what goes on when he\"s not around.  I will never return or refer anyone and will make sure to let everyone know how rude u employees are specially bartender Stephanie....",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "s5nbm2bPKE84N0UKbShR-A"
  },
  "tSUO9Ddd4m4skQMLDI4Dzw": {
    "date": "4/24/2008",
    "text": "I was here with a very large group, so I'm trying to take that into account when judging the service... and actually the service wasn't bad. The restaurant itself had a bit of an odor to it near the front, but it was nice enough inside. Our table was next to a baby grand where someone was layin out some decent lounge. It provided an interesting atmosphere.  The food... they had a lot of specials and it was really too much to keep track of - I come to find out they are 8 - 15 bucks more than a regular menu item anyway, so I abandoned that idea. I ended up with Fettuccine Alfredo with Chicken. The bread they gave us was good.   For our first course, they brought out some potato soup for every one - including me, even though I said I wouldn't eat it... kinda wasteful when some of their dishes \"go to feed the homeless\" (whatever that means).   They brought out a salad as well - I ordered a Caesar which carried an up-charge from the standard house salad of 3.50. The Caesar was drowning in dressing and all the salads just seemed plopped on the plate after being slathered in heavy dressing. At these prices with courses and such, I kinda expect a little more attention to be paid to presentation. As I said though, we were a large group and they were very good about getting our food out in a timely fashion.  Our entrees were also drowning in sauce. My Alfredo was tasty and the chicken was really good, but the noodles were a little chopped up and difficult to fork up and it was a little too rich and heavy for me. I still feel kinda greasy.  I think this place would earn 4 stars if the prices were more reasonable. We paid 85 bucks between two of us and that included a bottle of wine for 24 bucks (their cheapest red - which I had before elsewhere and was actually very good). I think this is a good place, but I think it sees itself as being better than it is. In some ways, it lives up to these self-imposed expectations and in other ways it doesn't. I liked it, but I didn't love it.",
    "rating": 3,
    "rated": {
      "funny": 6,
      "useful": 13,
      "cool": 5
    },
    "photos": [],
    "user_id": "oaaEXgQ3x51cXE3GTXrT1Q"
  },
  "OtqXV7a11wxBs810xhhxsw": {
    "date": "5/28/2012",
    "text": "My wife and I came for restaurant week and were very impressed. THe lobster and shrimp ravioli was amazing. THe house \"red\" was an OK chianti and the flan was top notch! The bruschetta with goat cheese might have been my favorite, although I had a great hot anti pasti plate as well. The only complaint is that the shrimp was a touch over-cooked, but hey, it's hard to get perfectly cooked shrimp in the desert where it's been frozen for so long.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "vZfqExA2aFK9HDQvC3aFsA"
  },
  "r5TMtPobLPHfEbX9bNHFag": {
    "date": "4/30/2008",
    "text": "Highlights of Christo's * The neighborhoody Italian cafe feel of the restaurant. * Decent food with run-of-the-mill upscale Italian variety. * Piano jazz player serenading guests. * Crowd with a decidedly old-money North Central Phoenix feel as opposed to the \"I eat cat food and go to buffets\" Sun City feel.  * Professional servers with the memory of an elephant and the attitude of a menopausal woman.  I had not been to Christo's in a few years, but upon returning I found the food and atmosphere to be just as consistent.  The restaurant is very neighborhoody and inviting. The white tablecloths and piano player in the corner set the mood just right. You see diners here running into old friends at the bar. I did as well.  Little old bitties threw their judging looks our way from the bar, since our table of 20 is young, mostly female, we must all be lesbians, right?   Right.    Consistently good food, not great and not excellent, but good.   Modest soups and side salads here are part of the drill.  I ordered the chicken limone, breaded and prepared similar to chicken picatta but minus the capers.  I tasted my friend's grilled salmon and penne and it was delicious. Considering out large party, the restaurant handled us OK, especially given the the busyness of the evening since it was Dining Out for Life evening where they donate proceeds toward HIV charities.  I extended the benefit of the doubt, but expressed concerns over the somewhat long wait time.   It was nearly 10 pm when we left given our 7:30 reservations, in which we were promptly seated.  Our server,  who was skilled at reciting the dozen or so specials of the day, was accommodating, up until the billing situation (which I prepared him for beforehand) - when he turned a little catty, but all was well in the end. This is a 3 star place with potential for four stars.",
    "rating": 3,
    "rated": {
      "funny": 6,
      "useful": 10,
      "cool": 7
    },
    "photos": [],
    "user_id": "Yej5B4nd8PqpHMQcmCTDrg"
  },
  "Ev3wEjgZWXNu4mXrE4WUVQ": {
    "date": "5/22/2014",
    "text": "I had a great time at Christos.  It was really good food and great time.  From  tasty appetizers to dessert it was amazing.   It really felt good to find home made Italian in Phoenix AZ.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "xoqubzCTBw9bY9bQzqwL8w"
  },
  "NmAdISPzror15MjIuX1exg": {
    "date": "4/26/2008",
    "text": "I will be the first one to admit that this place would have gotten 5 stars when I first went there 7 years ago.  I went there with a bunch of other Yelpers Thursday...so there were about 20 of us...so this is going to be more about the food then anything else.  I am not going to rate the service, though our waiter, Guy, did a good job considering the large group.  Really couldn't complain about that.  I wasn't a big fan of the wine...but that definitely could have been my fault.  (I have been told in the past that my taste in wine can be better)   Sarah G and I shared the Calamari...which I thought was very full of flavor and cook just right.  The Potato soup was ok...a little too watery for my taste.  I loved the salad especially the house dressing.  I think that was the best part of the meal.  Of course by the time I got my main course, I was full.  But I did eat all of my veggies and half of my chicken (which said it came with lemon butter sauce...but that sauce was not lemony and it had mushrooms on it...which this chicken dish was not supposed to have...oh well.)  I did try Gabi's Sea Bass...now that was yummy!  5 stars though for the awesome company!!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 9,
      "cool": 6
    },
    "photos": [],
    "user_id": "7SFUWbb33dOR8lmO51h3dg"
  },
  "Ic6mL7hNPgoYd_p8KY19Cg": {
    "date": "4/18/2008",
    "text": "Having grown up in a city with a large traditional Italian neighborhood, full of large traditional Italian restaurants, the first thing I tried to find in Phoenix was a good plate of tortellini and a decent piece of Veal Genovese.  I found them at Christos.  The atmosphere at Christos is very traditional... white tablecloth, stemware, cloth napkin and flower centerpieces.  It feels special when you come here for a meal, but the meal is very reasonably priced.  The menu is traditional, with dishes like Pasta Primavera, Linguine with Clam Sauce, Chicken or Veal Saltimbucca, Canneloni, Chicken, eggplant or Veal Parmigiana.  They have Cioppino, decent salads and a good wine list.  What more could you ask for?",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "0E6g9TnZ7tTnfvUoyaR6Cw"
  },
  "pPY40hjoSJ_h_vTtb1YyAA": {
    "date": "12/20/2007",
    "text": "The food is modestly priced and I was impressed. Our waitress was very nice and told us our specials. I went with the angel hair with shrimp and it came with a whole bunch of shrimp. Usually you order something like that and it comes with a few shrimp, but I was shocked at how much came on my dish.  If I live here ever again I would go back again and again, it's an upscale feel but the prices are very low and the food is delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "h0-uWim18PBUDfHq9BWx-Q"
  },
  "tY4rZgP-4ELAVZKVu17L5g": {
    "date": "10/9/2012",
    "text": "Good food for very good prices! The portions are generous, and you also get a soup and/or salad (depending on lunch or dinner). The service is good too. Will definitely return!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vLixm38Zd-xgAvN1LQJfKQ"
  },
  "NQNBFxFWFWOKIm2tWbEPmA": {
    "date": "1/18/2013",
    "text": "The shrimp risotto is delish. The staff is super friendly and very accommodating. Christos is a \"must do\" for first timers....you'll be hooked.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xQdge6wO9QO12gMF_oQpLA"
  },
  "IJogzumHulN_qQbdthgB4A": {
    "date": "8/24/2008",
    "text": "I have to say,  I have been going to this ristorante for the past twenty years with my family.  Every time we go there we have the same server.  We are always greeted well and the alfredo is amazing, and so is the sea bass,  the halibut, and  veal chop.  The homemade house salad dressing is one of a kind too.    The new bar/ lounge area is nice and the pianist is a nice touch.    Love Christo's.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "xBT9BB81RUrS4Vea4583lw"
  },
  "nLkMV2KbfRZhYPrefDWZoA": {
    "date": "1/6/2014",
    "text": "This is one of the best kept secrets of Phoenix. The food here is fantastic and the service is always great. My inlaws love it here so we go a lot and everything i've tried has been delicious. They regularly change their specials so I recommend trying one of those. On my most recent visit we ordered the porkchops, clam pasta, clam stuffed lobster tail, and lobster ravioli. They were all delicious! The lobster pastas were VERY rich so a little goes a long way. The clam pasta was great and had lots of clam. I should mention the prices are very reasonable and you get a ton of food. On top of the meal, you also get soup and salad. We always order appetizers and instantly regret them after getter the soup. On our last few visits, the soup has been a lemon bisque. Honestly with a loaf of bread the soup could easily be served as it's own meal. Now this isn't a trendy Italian place. In fact if you're under 50 you'll probably feel like a youngster here but that's always what I love about it. You will feel like you walked into a different era and everyone seems like a familiar regular.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "43BzJWwV06Y_YnMRRMt_Kw"
  },
  "ypkKx6gc90QU-GK8fCt7Ng": {
    "date": "6/20/2013",
    "text": "Love real Italian food, and this was excellent.  4 courses: spinach soup, Caprese Salad, Chicken Saltimbuca, Tiramisu.   White tablecloths, excellent service, sparkling clean restroom.  If we lived in Phoenix, this would be a regular stop.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "mL52zngfgJBMOefiaUYdBA"
  },
  "XSFv5sNPrL8tbuLbCKgU4Q": {
    "date": "5/13/2013",
    "text": "Great food and excellent service. When you walk in the interior looks a bit dated but don't let that scare you. I am always impressed with the food and service. This is my spot when I want great Italian Food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "wamgLpJKogeWSV2q2nqfBA"
  },
  "YLA99U3WBA46fAjXFdZntQ": {
    "date": "12/14/2012",
    "text": "I have been coming here for years and the quality of the food and service have been consistently 5-star quality every time I dine here. I highly recommend the halibut, but everything on the menu is delicious!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "D2_sGlBkZrDBtems7UPexg"
  },
  "zTfWK-TDO2aYkhm0J5DZ0g": {
    "date": "5/3/2014",
    "text": "We hadn't eaten at Christo's in years.  For my birthday my husband decided to surprise me with a reservation.  Things started poorly.  The hostess walked us towards a table and then pointed. So we sat.  A bus boy brought water but we still sat and waited.  Finally a waiter came and asked us if we wanted drinks.  Then he came back with menus.  He rattled off a long list of specials.  We both decided to try one of the specials.  I really prefer it when the specials are printed out so you can see the details.  I also think to make them \" special\" there should only be a few.  Once our order was placed the rush seemed to be on.  Soup appeared. Then salad. But before I had even finished my salad my Chilean sea bass was in front of me.  I wished I had known the 2 small rectangles of fish were going to be swimming in tomatoes.  I should have asked more questions. The flavor of the sea bass was lost in the tomatoes.  My husband was delighted at what his chicken turned out to be.  We shared a complimentary birthday dessert and left.  There was no one at the  door as we left to thank us or say good bye.  Yes the prices are very reasonable but the food and ambiance are nothing special.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OZj8OUbjtmG9URwZMxesWA"
  },
  "NX2Ulcf2JVPWZ7ku_1hZQw": {
    "date": "12/7/2011",
    "text": "Since 1975 Christos has been consistent with quality of food and fairness with pricing.  Service is always brisk, attentive and thorough.  Unlike some restaurants, it's not necessary to fill up on bread to be filled up.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "74GY0Ba_5R5VKwNtnC6pWw"
  },
  "TvDdCivtXxZl3K9P6jJw1A": {
    "date": "4/20/2012",
    "text": "Again a great meal. I had the poached salmon, one of the best in a long time. As usual service was great and the food was outstanding, can't wait to try his sea bass .",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eRlgitu0pMAk93FZil9txQ"
  },
  "exU731Yfmt4Bxuz6QGf7AQ": {
    "date": "2/19/2012",
    "text": "Went to Christo's past Saturday night. Waited about 15 minutes for a table despite reservation. Restaurant was very busy. As usual, service was professional and excellent. Soup and salad were included, and, as usual, very good. I ordered an terrific veal chop, it could not have been better. My wife had the duck, with orange sauce, which she totally enjoyed. I have never had a bad meal here over a ten year period.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1lFD3AqzgkxjkJKymb9Puw"
  },
  "WmCZaPLJVR2ebaLck5SV0g": {
    "date": "5/21/2012",
    "text": "My wife and I had dinner last Friday evening and I have to say that this is one of the most consistently great restaurants in Phoenix.  The prices are excellent, you get soup and salad with your entree and the service is stellar.  I have been going to this place for over 20 years and (God willing) will continue to go for at least another 20 years.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6nzPErHfnH56Y2LJArnhig"
  },
  "Lypx-7bzb32X69bUV_681w": {
    "date": "6/21/2019",
    "text": "They were EXCELLENT!!!!!! I have found a new favorite place when I'm visiting from Alaska. Food was delicious! We tried the stuffed mushrooms, calamari, veal filet special, sausage, fettuccine alfredo, veal piccata, veal parmesan, mixed white/regular chocolate mousse. All delicious, mouthwatering even!!!   The service was impeccable, wonderful, really some of the best I've ever had anywhere. As a former waitress and bartender I'm critical about service too. Out team of Josh and Scott were absolutely amazing. I'd come back just for them; add in the amazing food and I'm sold!  And if that wasn't enough the atmosphere is also great. Perfect for friends, family, a romantic evening, etc.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "77brie4B6jJHnBam5EMvJQ"
  },
  "ftdue8rjAEuEfDQb8njqbQ": {
    "date": "6/13/2019",
    "text": "Classic Italian.  One of the best places for Italian in the immediate neighborhood. Think old school Italian.   Enjoy",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "ECJr76TU94WWq2tIiKIYXw"
  },
  "RIxnOv0y4qSHnPUpgHpZGA": {
    "date": "6/6/2019",
    "text": "I had a wonderful experience at Christo's Ristorante!     It's difficult for me to find a good meal at an Italian restaurant due to my tomato allergy, but our server - SCOTT - was extremely accommodating and made very sure the marinara for our calamari appetizer was served in a separate dish and my Chicken Genovese was also safe for me to eat.  The chicken was perfectly cooked and extremely flavorful - would definitely order again, but I can't wait to go back and try another dish soon!  The wine list and dessert menu was fantastic!  The restaurant itself is very quiet and cozy... will definitely be back and will definitely ask for Scott!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "My2udpZVNoXSdcu3uU20pg"
  },
  "MzyuOMeIaTXBiJyqZYn_4Q": {
    "date": "9/11/2019",
    "text": "I've been lunching at Christo's for several years with some friends who are life-long lovers of this old-school Italian restaurant.  Such a lovely quiet dining room for lunch or dinner.  Servers are very gracious and know many regulars by name.  All the daily specials are excellent but my favorite is the lasagna.  Servings are generous so if you're dieting you might well make 2 meals of a lunch serving.  Christo's is a neighborhood gem!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lb17DlmxwDOpOz0fpS8frw"
  },
  "OFrU_r6_bSyVLkXpvMUvNg": {
    "date": "2/28/2019",
    "text": "I went here with low expectations based on the reviews about tough service, my usual disappointment with classic Italian food, and the strip mall location.  It turns out I was wrong all the way around.  The service was polished and professional.  The food was right on spot and nicely prepared across the board.  The strip mall, well it was a strip mall but didn't feel like one inside.  The place feels a bit like an old school Italian place out of a movie in a warm and inviting way.    After a few nicely made cocktails, I ordered the Osso Buco, and if it's a special you should too.  It is a huge portion of perfectly prepared Veal with nice pasta to soak up the ample sauce.  Plus you get a spoon to dig out the ample and very tasty bone marrow.  Add in a few carrots and it's a great meal and a bargain at $32. The Salmon was excellent.  The Sea Bass with Feta and Roasted tomatoes was great (ignore that rule about not eating fish and cheese together).  The Tortellini with mushrooms and peas were really good and the Fettuccini Amatriciana was perfect with bacon and tomatoes.    Overall this was a great meal at an amazing price since the entrees all included a really good lemon rice soup and a solid salad with a nice vinaigrette.o",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "-xGpOq_plEzlUZDLkrFeWQ",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. Sea Bass with Feta and Tomato&amp;#39;s",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-xGpOq_plEzlUZDLkrFeWQ/o.jpg"
      },
      {
        "img_id": "WVvKHCMPFc-6gEscL-1CWQ",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. Osso Buco",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WVvKHCMPFc-6gEscL-1CWQ/o.jpg"
      }
    ],
    "user_id": "KWe9PeK3qSXt1pUcwrJPCQ"
  },
  "u4tVr5_cowGEzp9ens48zw": {
    "date": "5/19/2019",
    "text": "This place is fantastic! Not only is the wait staff very polite, but the food is great portions and great prices. Lots of flavor. And it was a cool spot to just have a nice dinner with friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HGPoKJ5Jg0dOiVcURfayZg",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. Love",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HGPoKJ5Jg0dOiVcURfayZg/o.jpg"
      }
    ],
    "user_id": "dWlWo5966YOwirlXb47l-w"
  },
  "04UDClUq41dljGga7Hd_Ew": {
    "date": "8/26/2019",
    "text": "Christo's service is only exceeded by its food. Always reliable quality and variety. It's old world service and classic dining at its best. They graciously accommodate your requests to tweak or customize menu items. Don't miss creamy lemon rice soup, special every Saturday. Yum.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QYNyvw53OKvxm3WzResegA"
  },
  "mkAvY6XWZfVtP672AKUOqA": {
    "date": "1/18/2019",
    "text": "My famiglia enjoyed a great dinner at Christo's tonight. The service was excellent, the food was magnificent and the atmosphere reminded of Italian restaurants back in Chicago.  The menu has many great Italian favorites along with a number of daily specials. The deserts are fantastic.  Christo's is a must try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nl8FqoDJFk-RXY-9LgXy2A",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. Veal parmigiana",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nl8FqoDJFk-RXY-9LgXy2A/o.jpg"
      },
      {
        "img_id": "PvuPUGYAJw_xF6tXM4Intw",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. Limguini",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PvuPUGYAJw_xF6tXM4Intw/o.jpg"
      },
      {
        "img_id": "B6d1Tc2sgK-6ZiKNEtjZhg",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. Fresh bread and butter",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/B6d1Tc2sgK-6ZiKNEtjZhg/o.jpg"
      }
    ],
    "user_id": "w0Kk5vAs1fm58_Eo6kKH3A"
  },
  "4ROLhIhsri1R8eTJg1LWlw": {
    "date": "7/10/2019",
    "text": "Great family owned restaurant with nice old world atmosphere. Service was good. Food was great! We would go back for sure..",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HFAJx3waz2EVxA9ikUL_5g"
  },
  "HchEgi7KlzZ0FNNarC4DWA": {
    "date": "1/28/2019",
    "text": "Holy hell, this place served up a very bizarre lunch experience. Everyone seemed angry; the guy that finally brought menus, the one who slammed water glasses, and the disengaged and indifferent waiter. It seemed to be fully staffed & only had three tables filled...still service was poor.    Bread was basically toast. Appetizers were somehow both over cooked and cold. Salad was meh. Entrees were sub-par, at best. Primavera and linguine were both cafeteria bland. Lasagna did get a thumbs-up. I'd guess that the tiramisu was packaged. Coffee was on point.    A tray full of dirty dishes sat next to our table the whole time.    The gentleman at the hostess station seemed to be a manager, however, his disposition and lack of attention to his customers, staff, and restaurant only added to the overall fail. At one point, while walking past, he asked if we were enjoying the food. He never broke stride; not even when my friend shook his head \"no.\"    And lastly, had we seen the filthy restroom before eating, we would not have.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "xT5Yz1IZNahC3nGvoJH2Zw",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xT5Yz1IZNahC3nGvoJH2Zw/o.jpg"
      },
      {
        "img_id": "EBqaSyZhy3fxilUlMuRw5A",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EBqaSyZhy3fxilUlMuRw5A/o.jpg"
      },
      {
        "img_id": "G9nGhWpSqj1jYFmQ1Cj-nQ",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/G9nGhWpSqj1jYFmQ1Cj-nQ/o.jpg"
      }
    ],
    "user_id": "Qqtb_BDbd8J5rSx2f71GsA"
  },
  "AvwCW08f4Er4EIjhZGhybA": {
    "date": "10/5/2018",
    "text": "What a wonderful and cozy little find! The food itself was wonderful. It was certainly what you would expect from an Italian restaurant... leaving with your tummy full and loved! We went for restaurant week and it was quite the good deal. I had the gnocchi and was overwhelmed by the creamy but also savorful taste! The restaurant itself was slightly outdated and certainly 'lived-in', but at the same time, that was part of the charm!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "F7FnNIJF2yHdD5qhwVzhWw",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. Gnocchi",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/F7FnNIJF2yHdD5qhwVzhWw/o.jpg"
      },
      {
        "img_id": "eynshTkhi__1lj9RDslw9A",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eynshTkhi__1lj9RDslw9A/o.jpg"
      },
      {
        "img_id": "UTf8MBEEwq4ybf59BgIXxQ",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. Tiramisu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UTf8MBEEwq4ybf59BgIXxQ/o.jpg"
      }
    ],
    "user_id": "W2ibSBOqtn6XQqkMULfBJQ"
  },
  "lKSK0rPMDMqbUGaLGehwXA": {
    "date": "6/27/2019",
    "text": "Went here for our first anniversary. Kind of a small place, but good ambiance. The food was amazing and they accommodated our happy occasion very nicely when asked. We had stuffed mushrooms, salad (absolutely best house dressing ever I still think about it to this day) he ordered chicken parm and I had the chicken Alfredo. Great food all around. Very authentic. Somewhat pricey, so this is a special occasion place for me, but worth it. The only negative think I have to say was that the waitress (older white woman) was not very attentive nor friendly.. she favored others over us (checking on them, refills ext) far more than us.. hopefully will be returning for our next anniversary!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "itlLb5Q7ffoyKclQ_2syeA"
  },
  "_FORRSc3i90xocJJp0xXVw": {
    "date": "11/15/2017",
    "text": "We came here for a birthday dinner and it was a good decision. This place had solid reviews and although Italian food isn't my favorite, I was looking forward to this meal.  The place itself is nice, I like how it's set up and how open yet intimate it feels. There was a lot of people there for a Monday night but it never seemed to get too loud or crowded. Our server Julie was excellent as she shared the specials and offered suggestions and approval for dishes. We started off with bread and butter which was great. I ordered the fettuccine alfredo with shrimp and my family all ordered different dishes. Entrees come with soup and salad; I enjoyed the lemon rice soup and how creamy it was but the dressing on the salad wasn't my favorite, kinda like a horseradish flavor. I liked my pasta dish, it didn't taste too heavy but I did have to pack up half to take home. I tried some of the broiled halibut special and it was tasty.   Overall, this is a lovely place to come and enjoy a meal and the service was outstanding, always had our water glasses filled and plates cleared away when finished.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 13,
      "cool": 10
    },
    "photos": [
      {
        "img_id": "RYY-NUt49gzOSkREMzSQTQ",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RYY-NUt49gzOSkREMzSQTQ/o.jpg"
      },
      {
        "img_id": "nsmi2A6gWfbwG62sL79Ang",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nsmi2A6gWfbwG62sL79Ang/o.jpg"
      },
      {
        "img_id": "t8miy1fAX6QpvcO4X1Leeg",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/t8miy1fAX6QpvcO4X1Leeg/o.jpg"
      }
    ],
    "user_id": "4cZ3f3i0Slv2W9mLN_VZBw"
  },
  "05ovguTn-57FCSCIHFdfrA": {
    "date": "5/18/2018",
    "text": "What a wonderful place to have lunch, and it's very appropriate for a business meeting or a date with your significant other.  What a bargain too.  Calamari appetizer was one of the best I've had in the valley and a huge portion for $8.  The average lunch entree, with soup or a large side salad, was about $12.    I'll absolutely be back.  I will say that the average age of the patrons was 65, but that didn't bother me or my wife.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "6ZEIvCcj3xCx8TNH7-R64A"
  },
  "SeahTrbR7K2RszIGV24bJw": {
    "date": "4/4/2019",
    "text": "Blown away by full attention service. Waiter was helpful recommending food choice, and we never had a want. Our drinks were refilled not just topped off, and service as well as food was exceptional. Really, this place for dinner was top of the line. Impressed. Felt like an important client with my own wait staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y_yv_e8NvEzu3XbilK5AFQ"
  },
  "YUc_O7mK9lA3JRhoSvjuBQ": {
    "date": "5/2/2017",
    "text": "Old school charm to the max. The portions are indeed large and the wine is very affordable. What more can one ask?  The bread is that delicious airy inside, crusty chewy outside good ole white bread. I ate too many pieces and got full before my main entree, which was chicken parm.  I like that they give you both a soup and a salad. Both which are delicious. The entrees were great and so was the service!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 10,
      "cool": 13
    },
    "photos": [
      {
        "img_id": "Q5od4xPj1gHcazh-mjtMaA",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. Chicken soup. Yum!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Q5od4xPj1gHcazh-mjtMaA/o.jpg"
      },
      {
        "img_id": "ETNrYFMrXV5h51dctKB22A",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States. Chicken parm",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ETNrYFMrXV5h51dctKB22A/o.jpg"
      }
    ],
    "user_id": "zTCwJg0hPY_cb3vWY0XMbg"
  },
  "Sx-Lqoug81whXQBbIxgzDA": {
    "date": "2/15/2018",
    "text": "Went in for a late night dinner and enjoyed my experience at Christo's. I ordered a chocolate martini and it was yummy. The bartender made it perfectly. I ordered the mussels as an app in the white wine beurre blanc sauce- it was very good. I really loved their white bean soup too. It tasted like home. For my entree I ordered the duck, which was good. My server was really nice. She made me feel like I was in a 'mom and pop' restaurant because she was very passionate about the restaurant and menu. She took the time to explain everything and I would have tried more food if I could!   I ordered tiramisu for dessert and again it tasted very authentic and home made. It was absolutely delicious. Great restaurant :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "RokD72lhLgQbnfVUJg3bkg"
  },
  "XGDo1zS7OmmckVAAZOGVsw": {
    "date": "12/29/2018",
    "text": "This is by far one of the worst restaurants I've tried to eat at. They refused to honor a reservation made for 5 people. The manager is extremely rude and unhelpful. I would never recommend going here nor will I ever go. Truly disgusting.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "_USd5BlczeHcYTUH-hc_Nw"
  },
  "SM6150uT2l8jVo7mc0_4Xg": {
    "date": "3/18/2019",
    "text": "What a great find! Loved the service and the food.  Their sauces were incredible. We will be back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5VDqtZMQEz9Wzftd-Q8W-A"
  },
  "0FXwsTzoFxErmJxny6t3FQ": {
    "date": "7/2/2019",
    "text": "Nice place very good food great salad dressing BUT I expected fresh bread, crispy crust will be going back again. Maybe they'll read the review and do the bread right. Than I'll give them 4 or maybe even 5 stars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lLE3K4btYch8QB-faGiXhA"
  },
  "gnM7PRgkvqte_TUEo1c57A": {
    "date": "10/30/2013",
    "text": "I go  to Christo's about 3 times a year.  This place is great.  The food and service are well above standard.  They really take care of you.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "r_y8FaSLTBeFXpjD3y16rA"
  },
  "nq2NNCul_IjcbaCYZvnR6A": {
    "date": "1/21/2016",
    "text": "This is the kind of restaurant you hope to find in your neighborhood. Excellent food, great service, pleasant environment and reasonable pricing. The Dover sole was excellent and our dinner companion said he had never had better sea bass.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "F7Qrc83WMMOwB8bxC0isbw"
  },
  "bLnlAGX02xDtoFWULxdQig": {
    "date": "1/23/2014",
    "text": "The food here was excellent. ! The service was OK as it was around dinnertime. We did not like the fact that we had to wait for a menu after we were seated.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "59t8OQ4Q3CSFo0dVrKKj8Q"
  },
  "N8EIFNc-5lT-2rmy6jKSMg": {
    "date": "12/26/2015",
    "text": "Excellent meal, old time Italian restaurant, reminiscent of an east coast establishment.   Local diners.  Solid go to for dinner.  Not fine dining, but not charged as such either.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4sk7QvfNXHpTRFIkadKh3A"
  },
  "ausrAXZurkz6uuNU9ymUog": {
    "date": "6/29/2013",
    "text": "Great service, terrible food. I was looking forward to eating at Christo's and the longer I was there, the more disappointed I became. Funky house salad with a creamy ranch (?) dressing and one slice of bad hot house tomato. The lemon rice soup was boiling hot, but not awful. White French baguette bread and butter was plentiful, thank god. The stuffed mushroom appetizer was bland and my veal entree was drowned in sauce. The service was 5 star, I'll give them that. I suppose I came away with the thought that I'd rather have lousy service and good to great food than great service and lousy food. Maybe I should have tried one of the 3,000 specials our Italian waiter rattled off before we ordered. By the time he was finished, the only thing I remembered him saying was, \"...topped with feta cheese.\"",
    "rating": 2,
    "rated": {
      "funny": 5,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "n0SDXunCvTiU2NxT2WXqMA"
  },
  "dENQFvjnEgmebDtY8njJpw": {
    "date": "2/24/2014",
    "text": "Very good restaurant and staff. Low prices and moderate, sensible size portions. Veal chop was great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "STAJD31BGvV6KcIwOALyJQ"
  },
  "fEvkNUq2mw7SKmkw-NQTew": {
    "date": "7/12/2011",
    "text": "Some friends turned me on to this restaurant years ago, and while I have since left AZ, they still live there, go to this restaurant, and still love the consistently GREAT food.  This was one of my favorite restaurants when I lived there.  They made perhaps the BEST cannelloni (melt-in-your-mouth deliciousness) and avgolemeno soup (only rival I've found is Taverna Tony in Malibu).  In fact, we had them cater my daughter's bat mitzvah reception......they were that good.  I'm just sad I haven't been able to enjoy their food since leaving AZ.  In addition to ALWAYS getting their cannelloni and avgolemeno soup, I used to get their Lemon Dill Salmon, Chicken Limone, Chicken Genovese, or Shrimp Scampi.  I know I'll be back to Phoenix one of these days, and when I do, this place will SURELY be on my list of \"to-do's.\"",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "p4UcEYTLJyh96o1R8wrJaQ"
  },
  "Zt8BRtbXUAzHAhHi8XkHnA": {
    "date": "3/17/2013",
    "text": "My new place for Italian! Service was over the top and the food was excellent! Would recommend to anyone",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "fEMdDmchvJeMX4fP9VLZyw"
  },
  "QG5i9JnQIdeCkbJF9TRkZg": {
    "date": "11/13/2013",
    "text": "Christos is a family-owned Italian restaurant that has been around for more than 30 years. Given that it is still crowded for lunch and dinner most days, that says a lot. Whether we visit for lunch or dinner, we are NEVER disappointed. They have a great Caesar salad, and a variety of moderately-priced pastas.  It's a quiet, dignified place with a great wait staff, so conversation is possible.  Our dining companions are always satisfied.  It's a very traditional place, so if that suits you, there is much to enjoy here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2iDmMTrh26dEYSzG2R0C9A"
  },
  "FHuk3G9JOwgUBTeM7NBTVw": {
    "date": "2/26/2011",
    "text": "I usually reserve five stars for places like Kai, but for the price, this restaurant deserves five stars.  This is an excellent restaurant, and that is definitely rare in Phoenix.    We enjoyed a nice bottle of wine while waiting for another couple to arrive, and we were never rushed or made to feel like we were a bother because we didn't order any food for the first 45 minutes.  The sea bass special was some of the moistest fish I have ever eaten.  I am amazed at how they were able to cook such a thick cut perfectly--not one part was over- or under-done.  It was served on a bed of pasta and topped with a marinara sauce that was delicious.    The entire dining experience was very pleasant.  No complaints.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vlssq9KlNYZEr1YxL6VFFw"
  },
  "-snklgMInoE65AXSEtZXUw": {
    "date": "3/17/2013",
    "text": "We went here based on Yelp reviews and were thanking fellow yelpers for the recommendation!! The Osso Bucco was tender, flavorful, and super tasty. The Chilean Sea Bass was perfectly prepared. We had the parisian scallops for an appetizer. DELISH!! And unique. Our service was impeccable. We enjoyed our meal from start to finish.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9cSOleT9b6Jhf3cW_TiHaw"
  },
  "qXqGQ05aE3XdXo-Jt_5Rtw": {
    "date": "3/19/2011",
    "text": "Went there for a business meeting.  The place was packed and the staff quickly accommodated us in the back.  Dining there is kind of like eating a family dinner with Italians.  The food just kept coming and coming.  The ambiance was what I would expect from a traditional Italian restaurant back east, so I found it cozy and inviting.  I had veal parmesan and it was incredible and very delicious.  The pasta was perfected cooked and I found the staff to be old-school and very attentive to our needs.  It's rare to find someone who folds your napkin back when you get up and leave the table.  I will definitely be returning just for the experience and great food.  I do know now I better make a reservation ahead of time because the place is crowded.  I am not sure about the noise level in the main area but in the backroom by the bar, we found it fine to conduct our business meeting.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "dZc-FKDMHpNMaLOJKFYpUA"
  },
  "m1D56vlLQ465-X499KeAcg": {
    "date": "3/15/2015",
    "text": "This is my favorite restaurant in Arizona. The food is always delicious and the price is reasonable. My favorite dish is the eggplant Parmesan.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "FqBn9tPZCTXQtigyhX7Ewg"
  },
  "lo_gH4umrbC5edKZ565bwQ": {
    "date": "7/16/2010",
    "text": "O.k. let me get it right out there. This fabulous local spot in the same strip center as my own business. But after years of eating here I am not sure why they fly so far under the radar with the \"foodie\" crowd. The service is top notch (and ya know I'm a picky girl about this). Some of the servers have been there since the place opened.  It is family owned and operated and they insist on high quality ingredients. The prices are fair and the portions are large. I am a huge fish fan and these guys  deliver up some amazingly well prepared Mediterranean style fish dishes. They serve soup and salad with their entrees and the bread is worth the splurge.  I enjoy their wine selection and this summer there is a great wine special Mondays through Thursdays. I invite all my foodie friends to give it a try!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "9ovtqLdQU-kv2U7BWpdbcQ"
  },
  "YAT_BxtFbxLIGaUFusaWtQ": {
    "date": "8/19/2012",
    "text": "Overall, I would not return to this restaurant nor recommend it. Small tables and cramped. The waiter spoke so fast that we had to have him repeat the specials three times. He served us so fast that I got the feeling he really didn't want us there! We felt uncomfortable even asking him questions and pointing out our issues with one of the entrees. I had the veal piccata and it was perfect! The wine was excellent, but our other three guest where extremely dissapointed. The veal chop is much smaller than it used to be. One pasta dish was served very dry and at a cool tmperature. We sent it back. Bread was just ok. Not the amazing kind that you expect in an Italian place. The other dish was just so so. There are so many restaurants to choose from in this area that I won't go back.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "J979nZWDnT_AeKWzqJLtxQ"
  },
  "nGzT_SB-TAhzZr2uUAW38A": {
    "date": "2/2/2015",
    "text": "Wow!! My parents and I visited Christo's Ristorante on 1/23/15 for dinner before going to see the great Frankie Valli in concert!! We were surprising my mom for her Birthday! We started with Calamari, very good! All meals come with soup, salad. and warm Italian bread all were very good!  I ordered the chicken rollitini! Which is a chicken breast stuffed with cheeses and Italian meats!! I have never had chicken so moist before! It had to be steamed, as it was PERFECT! My mom had the same, it came with a side of Gnocchi pasta! EXCELLENT! I can not remember for the life of me what my dad ordered but I know he liked it! Both of my parents are 100 percent Italian and are VERY picky on Italian food! They both were very pleased with Christo's! The setting is very old school Phoenix as well! The waiters all seemed to have a few regulars they were helping, they were hugging and chatting with customers! Very comfortable and very good service! For dessert we split the Tiramisu and I had a cappuccino both were very good! In fact I being the coffee snob I am, remarked how it was one of the best cappuccino's I ever have had!! ALL IN ALL IT WAS ONE GREAT NIGHT! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "vgxYQdpyKYCFusBaAa80Aw"
  },
  "crhiOMAp2KIkmUChsDGJ4A": {
    "date": "3/2/2015",
    "text": "Such a great find!  It's nothing to look at from the outside, but when you go in, you're transported to an East Coast Italian place!  Our waiter was exceptional, the wine was reasonably priced and delicious, and the meals!  So good!  I basically licked the marinara off the plate.  The prices were out of this world and the food far surpassed my expectations.  I will definitely coming back here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "bRhcFewVfs35EEA-KwLRKQ"
  },
  "7Px5eOqvQOXem34olGtiBQ": {
    "date": "5/18/2010",
    "text": "It is not too often I am overly impressed. However, Christo's did just that yesterday when I had lunch there.  My boss decided to take me and 2 of my coworkers to lunch for my birthday. He (my boss) really had some making up to do since last year he got me a 50 cent crappy brownie and put a candle in it and sang me happy birthday. He was definitely in the dog house. So I knew this year he was going to bring his A-game...hopefully. His choice is restaurants leaves a bit to be desired. Of course I did some research and Christo's appeared to be OK. So I felt a little at ease this time.  I get there early and wait for my party. The hostess is very nice and she knows many of the people that are coming in as they are regulars. I have not seen anything like this since leaving home (NYC). Old world charm restaurants where they know you and you know them. I can't believe it. I grew up around very good Italian food. I have been to a few places here that Italians have recommended and it was just not up to par. Now mind you none of these Italians were east coast Italians. It is something to be said of Italian food on the East Cost.  My party finally comes and we are seated. The place is very nice with the traditional white table cloths. Our server comes over and he is happy and attentive. He gets our drinks and comes back to take our appetizer order. We get the calamari of course. OMG the best I have ever had. It was lightly breaded and the marinara sauce was great. It was all I could do not to eat the whole thing.   Our server comes back to tell us about the specials which btw were all fish dishes. I went with the red snapper, mussels, linguine with marinara and capers. Nobody ordered the same thing which is great cause that means we can share.   The salads come out first and they are pretty basic. But the dressing was great. Ohh the bread was amazing. Jeez it is so hard to stop eating bread and butter. I was trying to save room for the rest of the meal. Our food comes out at the perfect time. Our fantastic server sets our plates out but before he gets to my co-workers plate this guy comes out and grabs his plate then brings it back in a matter of seconds. I thought wow the cook does not want stuff coming out the kitchen unless it is perfect. Come to find out it was Christo himself that came out to fix my co-workers dish.   Looking around at the other plates I am thinking wow everything looks so amazing. The other thing is the portions were right on. I hate going to places and the have so much food it is ridiculous. The linguine was cooked perfectly. The server came over with extra cheese and of course a must have for me fresh cracked pepper.   It was one of those times I did not want to share anything with anyone at the table. I did not want to disturb my palate from the wonderful flavors of my dish. I was thinking everyone else was thinking the same thing because no one was sharing. Well shortly after, every plate on that table was completely cleaned. The server was on point with filling our drinks. I never had a glass that was less than half full. Also I have waited tables and it is a fine line between being a pest and being helpful and friendly. Lets just say the servers at Christo's have this down perfectly.   Well the plates are cleaned up and out comes this cute little cup of vanilla and chocolate mousse with a candle in it. Compliments of the kitchen since it is my b-day. Well is was great. I am not really into mousse because it is a texture thing but the flavor was awesome. I still got to order dessert. I got the flan, others had key lime pie and NY cheesecake. Ohh decisions a toss between cheese cake and flan. Well flan won. I practically licked the caramel sauce off the bottom of the plate. It was the best I have had here. Ohh NYC Christo's has brought a little of you back to me. Sniff Sniff tears of joy. I am so happy. I found a fantastic Italian restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "US72XuETHCnMS0lItZGzMA"
  },
  "whaAxfYTC6wdCRTovWGOmw": {
    "date": "3/4/2010",
    "text": "Been here a couple of times. The first time was to take a date there for his birthday dinner. He is Italian and I wanted to take him out for a good Italian dinner.   I have little experience with Italian so after asking around I found out about this place. He gave it really good compliments (yay for me picking a good place!) and I thought it was good as well.   First time I went we had AMAZING service! Second was decent service, not quite as attentive as the first time, but also it was a winter formal night for a high school nearby so I'll let it slide.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "g_GhhHtMofLnlokoScupBQ"
  },
  "htJDOWa_Sm0rc5ntsYG60A": {
    "date": "10/26/2010",
    "text": "We went there for a family birthday and it was great.    I was the only male out of the 6 people in attendance and these women love to talk!  We were there an hour and half after closing talking and the staff was TOTALLY COOL.  I felt bad for staying so long but the staff kept telling us not to worry about it.  Great food! Great service!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JqNqNWyXDPwqwBuUwDfFiw"
  },
  "4FXnP2At1rm0hPuFDB8LFw": {
    "date": "6/28/2016",
    "text": "On a Tuesday night, turned away from dinner at 9:15 PM in spite of the the website  saying 10 PM and a crowded restaurant.  No explanation.  No apology.  \"We're closed.\"  Not a pleasant experience after the drive.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JzIqp4g7fYjmhwmE-ci3_w"
  },
  "soZbQ7QpBd7XPJlzxqTTnA": {
    "date": "9/4/2016",
    "text": "Had a delicious birthday dinner here last night, Saturday. Perfect martini, fried mozzerella, esccargot,  caesar salad, chicken parmigiana, chianti. Lemoncelli cake, and a shot of sambucco. Forgive the spelling! We dinner reservations, they seated us immediately. The service was impeccable, very friendly. A very fun evening we've enjoyed lunch here before, this is the first time we've eaten here for dinner. I will be back, very special. This is for those people who wrote negative reviews. I don't know where they're used to dining, maybe they don't know the difference between dining and eating fast food! Great resturant!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Op5voAva7pIDgI00oVryA"
  },
  "6kHfUq6YzenHBYoez6OB4w": {
    "date": "8/24/2014",
    "text": "Tonight I met 20 new Meetup friends at Christos for dinner.  What a great experience.  It's always challenging for a restaurant to handle large groups - but especially large groups with individual checks.  Our Service Team was outstanding and it was seamless that they were handling such a large group.  I had the cioppino with a variety of seafood that was clearly fresh and yummy.  The complimentary soup and bread were memorable on their own.  The only disappointment was the extremely strong fresh pepper on the salad.  The lemon cake...to die for.  Dinner was delizioso.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "RTz_E92YRqSdtbNmd-yxoA"
  },
  "qcB0qsaM1kFlWmdNmSS_fA": {
    "date": "5/25/2014",
    "text": "I have been here 3 times and have only had the chicken parm with pink sauce and it's the best I have ever had.   The atmosphere is very outdated - but their demographics are blue hairs, so maybe it's perfect for that crowd!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "e5wCFNp8pBWDPNDdM9P5bQ"
  },
  "wjzUY1jMndTQYS7-LMzI6w": {
    "date": "9/21/2016",
    "text": "This spot is perfect for date night. The appetizer and entree food is delicious overall and the waiters and bussers are nice and knowledgable. It's my favorite Italian food around town with a great drink selection too. Only little negative is that their desserts are just OK, the desserts don't stack up to the rest of the food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ywFNL7X51AtPrzlcI03xMQ"
  },
  "gtmI2-JjOeqiQGmJNr7E8A": {
    "date": "9/4/2016",
    "text": "Christo's is authentic Italian. Not the American version of what Italian cuisine should be. The service is amazing with old school class and professionalism. Growing up back east, I was thrilled to find a REAL Italian restaurant in Phoenix. We had the roasted duck special and it was exceptional. The entire dining experience was the best I've had in a long while. I will be back again and again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "96PcoIE7CfO17YnaP9gOUw"
  },
  "QH-94tibt4ZlyFY4ERjXuw": {
    "date": "6/14/2014",
    "text": "Went for lunch last week, found the atmosphere to be very family and friendly. The meatballs were their lunch special and I must say they were on point. Very tender meat and the pasta was great. Comes with bread and salad and I paid under 10 + tip because the service was great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "51uEgkB7ixFvIQh2LL20Kg",
        "caption": "Photo of Christo's Ristorante - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/51uEgkB7ixFvIQh2LL20Kg/o.jpg"
      }
    ],
    "user_id": "LZHFRhebuM2L_m1ypOgE-Q"
  },
  "Fl_vn9ry-nKRu1dygT7Igg": {
    "date": "10/31/2015",
    "text": "I have read the previous reviews on this restaurant and normally I would agree since we are  returning customers. But as of October 30, 2015, I will have to change my rating.  We had dinner reservations for 4 people and were looking forward to a great meal.  We were seated at our table and waited quite a few minutes for our waiter to come over. When he did arrive there was no greeting of welcome, how are you etc. He only asked what we wanted to drink. We were not able to tell him since he did not bring over the wine menu. When he did return he brought the wine menu and the dinner menu but we had to ask him what the specials were.  We placed our drink and hors d'oeuvre selections and while we were waiting for our selections, a group of six were seated behind us dressed in halloween costumes and acted as if they owned the restaurant. Our server waited on them and brought out wines/drinks and salads to them before we had any items on our table.  This group behind us were definitely in \"party mode\" as they were getting louder and louder. After we finished our soup and salad, the noise level from that table was now at disaster level. We were not able to hear or speak to anyone at our table due to the noise. We asked to move and were seated in the bar area where it was much quieter.  Our entrees were delivered but our server did not come back to our table to see if everything was alright or if we needed anything.We were going to order more wine but since no one came over we cancelled the idea. We had to ask other servers to bring bread etc. So definitely the evening was very disappointing for us and most likely a return visit is not in the future. What was really disappointing is the fact that the managerial staff did not seem to care that we were inconvenienced by other rude customers who had no regard for anyone else in the restaurant.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "b_1ZHDzf7Rp1uMmPY4poVg"
  },
  "A72t1IoTsS6wF_DF4Y9h0Q": {
    "date": "5/13/2016",
    "text": "Loved it! Was starving, driving around lookin for a place, saw it, and pulled in. Never heard of it before. It was delicious. Great piece of fish, perfectly cooked, over perfectly cooked pasta. My date had a dish with veggies. She said they needed another minute or so. They were too tough to eat. The cannoli was incredible! I haven't had a real one in almost 2 decades. My girl had a piece of cheesecake. It was also delicious, cept it had a slight after taste of freezer burn. I suspect it just absorbed some of the fridge odor. Who cares! MY meal was awesome!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "wMtYK7ifsYdjE_k0jPmYxQ"
  },
  "iuV4UA-A0DigWEZjKJ46qw": {
    "date": "8/13/2016",
    "text": "This place is great for Birthdays and Anniversaries! Also the gift certificate are a great thank you gift. I have purchased many for people who have needed thanking. They are always excited. Everyone knows Christos and raves about the great food,drinks and service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bDlG0ciAUhdhBEMrVJ0i1w"
  },
  "B46KTVkTcDg4VugjQWjhwQ": {
    "date": "8/6/2017",
    "text": "Dinner was sooo good. Had veal marsala (and no I don't feel guilty eating veal). came with soup and salad. soup was lemon rice which was piping hot and very flavorful. Service was so fast. We sat down and within less than a minute we had warm bread (deelish) and the soup. Right after came the salad and soon after that, the entrees. Place is very warm and friendly. Can't wait to go back. My veal was $19.95. Good deal and did I mention how good the food was. And I guess it was the manager? who came over twice to ask if everything was going good. Oh yes, my good man. All was great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VkchS1b93Pk7WjS_f0fJew"
  },
  "9PtRIX_ZaKuwKy1xVzeuyw": {
    "date": "1/7/2014",
    "text": "A large group (17) of us came in for NYE and it was fabulous as always.  We started off with a bunch of appetizers for the table followed by soup then salad.  The soup that evening was some sort of mushroom, artichoke, potato combination that was out of this world and if anyone has the recipe, please send it to me!  The salad was the same as always, nothing spectacular but it serves the purpose.   On to the entrees, they had a prix-fixe menu as they do for all major holidays. There were A LOT of seafood options, but no vegetarian (they were able to accommodate but it wasn't listed) and only one chicken option. I was hoping to see at least 2 chicken options for those of us who don't love breaded chicken. There were also a lot of beef and pork options.  The chicken was similar to a Cordon Bleu without the ham, served with gnocchi and some sort of cheese sauce on top. I loved it but others in the party didn't care for it as much as some of the other options you can get when it's not a holiday.   We then finished with desert.   Service was wonderful, the food was great and we will definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "biwNJEk-AHVSyRkrQK8c9w"
  },
  "ypcy7YkUP93003TiHC5d-g": {
    "date": "4/29/2016",
    "text": "Grab your honey and some pals...Christo's Italian Ristorante is \"Molto bene\"! You will not be disappointed.  I had the special , Duck in a succulent orange glaze, and for dessert flourless chocolate cake .all I can say is AMAZING.  from the time we sat down  until the time we left,the waiter, and bussers were on top of their game.  Don't be shy go on and give it a try. Let me know what you think.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ny0vlFSG6s8qr0hWjgUhBA"
  },
  "p8ao5VMaopT4SzPjSuHhjA": {
    "date": "7/9/2017",
    "text": "Had dinner with a good friend here last night.  It was wonderful!  The prices are very reasonable, nice atmosphere, and the food was delicious!  Soup and salad are both served with the meal.  This place is a very nice for dining...lunch or dinner.  Parking is really handy too.  Dining further south in the downtown area is not as handy with the parking issues.  This is the second time I have been here.  There was also a small party dining with us.  The service was fantastic!  Hope to see you here soon...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vWOc4cnPchZILKsEQ9cxcg"
  },
  "7YyC0_VJYotm87DvdpKpdg": {
    "date": "6/28/2017",
    "text": "Went with a group this week for lunch. This restaurant is not to be missed! It has been family owned for many years. Why am I just now hearing of it?? It was excellent. I had Zingerella, (sausage, mushrooms and peppers, with pasta) delish! All entrees come with soup or salad. Menu boasted great appetizers, veal, chicken and seafood dishes. Our waiter, the owner (or manager) could not have been nicer or more accommodating. Serving a bunch of old ladies is not easy but he made it seem so. The restaurant itself is very attractive -- rather old school. I will be back soon -- without the group!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9UzRLBkoQuFSamguUx-U9w"
  },
  "-0ZIleSz1GrMkmqCwusJzw": {
    "date": "3/20/2017",
    "text": "Let me first say that I'm a north central native and appreciate patronizing local establishments who deserve my business.  However, I have an issue with this below average Italian restaurant.  Average food, dated ambiance, and when entering through the east entrance there is an overwhelming smell that reminds one of a nursing home.  I will say that the service is typically good.  A huge makeover, including improving food, updating the interior, or at least more of a classic Italian feel, and take care of the foul smell, could really help this below average dining option.  This hasn't always been the case for this restaurant.  They really need to address these issues.  A better choice would be L'Amore or Tomaso's.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nJdIRBFOt81nXf3lWGoa3A"
  },
  "21Bu3rQm5NcepdyuydqFSg": {
    "date": "8/10/2013",
    "text": "Truly impressed! We got fried calamari that was crispy and fresh, stuffed mushrooms were buttery and not too crabby. Between 4 of us, we all shared each other's food. I loved the tortellini the most. Veal was a delicious and a nice cut too. Calamari at dinner was just as yummy, not chewy, and fresh! Shrimp scampi was a hit too!  Every meal is served with soup and salad. I believe the dressing and soup changes often. I liked them, didn't love them, but everything is homemade and tastes that way.  We ended the night with a nutmegy strawberry cheesecake and the limoncello cake.  I prefer the cake :) I left extremely happy and stuffed.  This is where you go for good homemade Italian food with love, and waiters that are good at their jobs. It seems other reviewers didn't enjoy themselves, and I would blame their expectations. It IS mom and pop, and it's amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "hf6ap8dyTVO6NQBBKamoqA"
  },
  "ZbmyjE2UktfXT9ANJ-k0fg": {
    "date": "10/29/2016",
    "text": "I wouldn't even give this one star after how my fiance and I were treated last night! We walked into this place after I looked this place up for some good Italian food and we walked in the hostess told us do you have a reservation? And also do you have another shirt they don't allow tank tops in dining. She then said we could sit at the bar if not. So we went to sit at the bar and immediately I would have to say the owner came up to me and said we don't serve people in tanks you have to go very rude and then walked away from us! Excuse me I was thinking to myself my money is not good enough to eat here I'm sorry it's 100 degrees out in Arizona and I have a tank top on and wanted to try your food out! I can tell you this I'm Italian from New York and my family or any other True Italian restaurant would not be so not inviting and rude to customers! I felt like after I wasn't good enough to eat there bc I had a tank top on. Needless to say if this is a casual place to eat then there was another way to approach me about it possibly just saying next time you folks come back we do recommend that you wear more casual clothing to our establishment but instead you kicked me out and walked away from me acting very unprofessional! Next time actually there won't be a next time I'll be spreading the word to people about your attitude and unprofessional staff! I went to culinary school and now I work for a Fortune 500 company so my money must not be good enough for your place?? I was taught to be humble and never turn down money but you my friend have a different outlook. If you are Italian you should be ashamed of yourself your ancestors would be rolling in there graves seeing how you treated people tonight!",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "HHixCtmCsBaZDh_omVPKTQ"
  },
  "e2yohV5kPlZ7lnP_J9D6tQ": {
    "date": "1/5/2017",
    "text": "when u can honestly say that a restaurant like christo can be so delicious and easy on the wallet over 25 years is amazing.  just go and eat and say hello to sandy and his wonderful staff and enjoy",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0rQFQGh1VACmAGtN9kN5rg"
  },
  "eoXSYna-By8gfIIUt1muMA": {
    "date": "12/4/2016",
    "text": "We had made reservations for dinner. But because the parties who had reservations before us had not arrived yet, we were still made to wait. Our waiter was completely checked out.  I mentioned that I'm gluten free and he made no attempt to accomodate that. The room was absolute freezing and most of the women were eating with their coats on including myself. The food was average. But I think the worst part of our visit was the hostess discussing our unhappiness to a man who appeared to be an owner and could have cared less. And made it very obvious. We won't be back.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xK4kmUoLNe7U9ueYbM8gsQ"
  },
  "By8_7b66hyT9XyBoSCDgnQ": {
    "date": "5/18/2017",
    "text": "Went here for our wedding anniversary celebration (hubby and I).  A Tuesday night and the place was hopping!  We were seated quickly but it took a while for the waiter to show up...and the slow service continued through the entire night.  Food was very good, best sea bass ever!  Pasta with bolognese sauce, a must! Good dessert-lemon cake. But I have to say service was not very good...too many tables for waiter to service and what's most frustrating is you have employees or owners standing around or at the front door literally doing nothing...they should see more servers are needed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V3y7y4u0N60HpSBb9dcB1w"
  },
  "lXD0hRIy4xVX3W1BXvUugw": {
    "date": "5/22/2017",
    "text": "Went there for restaurant week and oh my gosh we will be back!!! The calamari was the best I've ever had...super light, not rubbery. The lobster and shrimp ravioli was in a flavorful sauce and perfectly cooked. The homemade mousse was rich, definitely enough to share. Great service and my only regret is not learning her name. Definitely try it out. #shoplocal",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gC-q7wKAm1Lies3UrZOfhA"
  },
  "xbmHFoSY9l_HD52zHoYjFA": {
    "date": "4/15/2017",
    "text": "Fantastic place from start to finish. We sat at the bar and started with a wonderful appetizer of shrimp cocktail and shrimp scampi. Literally dunked my homemade, warm bread in all the sauce. I wanted to be sure I got every wonderfully, flavored morsel in my mouth.  We continued on with veal saltimobca.  But, first you get soup and salad with your meal! In today's world that is an extra special treat! No added charge. The soup was minestrone and the most amazing minestrone soup I've ever had. The salad had a mustard vinegarette dressing that puts others to shame. The veal was so tender the cheese melted perfectly on top with a sauce so delightful . It was an AWWWWWW...... moment. Had to have Desert! We had cheesecake on a bed off chambord liquor topped with a drizzle of raspberry sauce. Oh my!!! We couldn't stop smiling. I recommend this place to everyone!!!! Mike was fabulous and so is the whole crew!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7dA7g2AuOwplNMkaCvNc1A"
  },
  "hvNum3XyHNupp6MB2Db8LA": {
    "date": "12/30/2017",
    "text": "Came on an recommendation and we really liked this place.  The service was nice, the food was tasty and the lunch prices were very good. Will come back again. I had chicken, hub had veal. He really liked the dish and the location is nice to drive around and see what else is nearby, which makes this place a good spot to visit again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jRIC1OJp2z7p92PgOAj6dg"
  },
  "4ejcZkrLzO8ievzdNoZvsw": {
    "date": "9/23/2016",
    "text": "Slow service and uncomfortable vibe and stares from staff standing around when we first entered and when we left. Our particular server wound up being friendly in the end, but the fettucini alfredo tasted prepackaged. Our other food was not great either. I do not understand how this restaurant is so highly rated.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "MhKfcsUEiRwwQU0EVVi7rA"
  },
  "9L_SEc53g6IQB3v8Y_wYJQ": {
    "date": "4/13/2017",
    "text": "This restaurant is a must try if you love authentic Italian food! Portions were big and everything was absolutely delicious! It's a quiet atmosphere and comfortable. Pleasantly surprised! This will definitely be a place I will recommend and a place where I will eat at again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IgT3rm-YRwZR_U8EQPs15Q"
  },
  "4ewA3JFBkc2-w3pIvQ_Mmg": {
    "date": "8/16/2016",
    "text": "Shame to lose the best bartender in town.  We will be moving with her.  Service counts and jerky managers do not.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "uoXMIo7Iy8KzZkZEb0HogA"
  },
  "I1C66Q7AKAmmJofNsV6SNA": {
    "date": "1/11/2013",
    "text": "I got to thinking about Osso Bucco the other day.  My new Dutch Ovens brought this on, I'm kind of obsessed with braised meat right  now. What to braise, how to braise, which pot to use... must be because of the freezing cold temperatures.   Anyway.   A few years back my dad and the evil stepmonster (she's gone now, as in they got divorced, in their 70's, can I hear an AMEN sister?) could not stop talking about Christos.   They would talk about it all the time.   In Oregon.  Like, in the middle of a nice dinner at Jake's.   Weird.  Also, rude.   I just chalked it up to stepmonster's name dropping mental health condition.   No seriously, she drops names all the time. ANNOYING. anyway, ahem.  It was Osso Bucco this, Osso Bucco that, Christos this, Christos that.   So, when I was down there on a visit, post stepmonster,  I made my Dad take me.  It's good stuff.   I don't even eat veal.   But the Osso Bucco rocks.   Everything else did, too. I liked the service, the feel of the place, and I liked the calamari, and the wine. All good.   if you're in Phoenix and you want a good meal, I'd say this is one of the places to go.",
    "rating": 4,
    "rated": {
      "funny": 9,
      "useful": 8,
      "cool": 5
    },
    "photos": [],
    "user_id": "z9B25fKtfrxzUws_OOHJSQ"
  },
  "LVpPT1fBwOXsjwvD75xJtg": {
    "date": "12/19/2017",
    "text": "Loved every second of being at this restaurant!! First walked in the hostess greeted us with a very warm welcome and made us feel right at home. We had a big group of us and was seated right away! The waiter was absolutely amazing and wonderful. The food was just to die for! Hostess came to check on our table and made all our night because she is just so friendly and out going! left the restaurant with all happy smiles and a picture of the birthday boy (70 year old dad) with the server and of course the hostess. will definitely be coming back again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5xXCiwyLucdHJC1P1cXsVw"
  },
  "CesSkyB82TDBHOWnSuxqXA": {
    "date": "6/1/2016",
    "text": "Made reservations for 7:00 tonight and let them know it was a birthday celebration for my husband.  We arrived a bit early and sat in the bar and met our sons there.  We were brought to our table.  The waiter seemed a bit scatterbrained, but was gracious.  I mentioned to him that it was my husband's birthday.  No response, no \"Happy Birthday\" comment.  When we were finished, he brought our check and that was it.  Is it just me, or shouldn't someone have acknowledged the fact we were celebrating a birthday?  We could have gone anywhere else but picked Christo's to celebrate.  Disappointing.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "7FMT6gM7QiYAIv441cRdiA"
  },
  "gpWvn_Mzug7gr5X6EzU0kw": {
    "date": "12/9/2016",
    "text": "ROMANTIC OLD-WORLD CLASSIC ITALIAN restaurant.  We had a nice dinner for two.  The food is wonderfully Italian, the way they make it in their homes.  One of the few restaurants you can go to anymore that serves soup, bread and salad with dinner in a stepwise fashion, rather than making you pay for them al la carte.  Nice touch.  The pace was just right as the meal came out and we had a wonderful evening.  My only critique for the chef:  for the caprese salad, the tomatoes need to be room temperature rather than refrigerated.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "UZbbfcINqH4iTc417SgoYA"
  },
  "PPYfkLNJnp3oZJkSt5tOoQ": {
    "date": "8/20/2016",
    "text": "Truth be known that this long has been a local haunt for quite a few years. Their lunch menu is superb, tasty pasta, meat and fish specials satisfy the \"Italian\" tastebuds. However, if you have not tried the establishment before, try their spaghetti and meatball item. If you enjoy a meatball that is light, delectably seasoned and melt in your mouth texture, taaadaaa!! Excellent choice to be considered. The lunch crowd din is omnipresent of course, delightful and colorful to be sure. Waiters are attentive, efficient and long time \" residents\" here. Parking can be a challenge , although a trick is to just go to the rear of the place. Here, the food offsets the price for a rather easy stop lunch venue.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "RZDZ8Q5SQKhhc5ZSfFWG2w"
  },
  "dcjSFvKOYEI-8PNpHDqrmA": {
    "date": "12/13/2017",
    "text": "Went to Christo's on the recommendation of our sales guy at the dealership where we'd just purchased a vehicle. We were very pleased with the food and excellent service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a0lyQfsQUjf38HYCbullnA"
  },
  "a_70ra9pAuoryFsj3nuhMA": {
    "date": "4/6/2016",
    "text": "I am a frequent flyer at many restaurants in Phoenix and other cities. Christo's is interesting to say the least. Very rigid service, slow and it seems that if you don't have a reservation they shun you. The manager appears to do nothing and stands around and does nothing to help his staff in the least. If anything, he does a very good job being rude and has a very high sense of entitlement. Their Happy Hour is wonderful because of their bartender AJ as she understands how to treat people and make them feel welcome. The rest of the staff (mainly) the smug manager need to get over themselves. As, your clientele are all blue hairs and will not continue to frequent their restaurant as life takes it course. You need to reinvent yourself if you want to attract a younger patron.   There are many new places pushing you out if you don't change your bad attitudes.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "ShQo7Q15CGI4GYXJiMCsAg"
  },
  "4fOHBKsC1yxwUmBlN35iRg": {
    "date": "1/19/2015",
    "text": "Went to Chriso's for the first time this past weekend and it was a real 5 star experience! Our waiter was fantastic - on point with recommendations and always right there when we needed something. Everyone was so friendly and attentive.   We started with the mussels with wine sauce - they were fresh, tasty, and perfectly cooked. I had the veal saltimbuca and my date had the chicken cordon bleu - both were incredible and the gnocchi that came with the cordon bleu were a meal on their own - so yummy!  We at this point HAD to try the desserts - I am a huge tiramisu fan, and it did not disappoint. Our waiter suggested the limoncello cake and it was out of this world good.   I would definitely recommend making a reservation - I didn't see one empty table the whole time we were there!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "YRN0XZwTPpgPVaAU9j2bVA"
  },
  "xzrWqYSjXihaEodNl3CpnQ": {
    "date": "7/4/2014",
    "text": "As a native, I've probably driven past this place over a million times.  It doesn't really pop out on 7th street.  My girlfriend and I decided to check it out on a whim of the steering wheel; best impulse decision ever.  When we walked in and were seated, the incredibly friendly waitress placed our napkins on our laps and began reading the specials in a way that would put the Ritz to shame.  My girlfriend looked up and our gazes met; this was going to be 4 star expensive.  Alas we were wrong, the entire meal was around that you would pay at a low-end chain restaurant.  Now the food, the reason for the establishment's existence: unforgettable.   I ordered the Zingarela.  No words describe but delicious.    Word was spread quickly.  I brought my dad to lunch for Father's Day.  I've never heard him praise food like he did that day.  I'm pretty sure he annoyed the waitress my constantly pulling her aside to tell her of his amazement.  As a whole, don't let the restaurant's atmosphere dismay you.  At times it's slow, other times busy.  The demographic is older.  These things, if they matter to you, will melt away when you take that first bite.  It won't be your last.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 8,
      "cool": 1
    },
    "photos": [],
    "user_id": "Si5UJYbQrN-EywTNPALqGw"
  },
  "e8ED7miLwYvaoOi9PHiWeg": {
    "date": "10/15/2016",
    "text": "we had to go again for their $33 Restaurant Week menu because it's soooo delish!  excellent food and service.  even included a glass of wine.  love it....we'll be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ChWFX5QrRn1H6VYa-9eKHg"
  },
  "1jaeu17P-t64K4wBIBif_g": {
    "date": "8/14/2017",
    "text": "Because this is my best friend's Linda's favorite restaurant, I end up eating here a couple of times a year.  She goes with other people, too.  On July 7th, we went for her birthday.  Soup and salad are included with meals.  One mouthful of cream of vegetable was all she wanted.  She complained to the waiter that it tasted canned. He replied that it was made fresh as he removed the bowl. In waiter's point of view that reply solved our complaint. The salad was iceberg lettuce, red onions, and tomato with house dressing. Boring. I ordered Veal Christo's from the regular menu.  I received a large piece of chewy meat in lemon sauce with tiny, bay shrimp, bits of artichoke, and either crab or Krab, not sure which since it was minced.  I was not thrilled. Linda loved her special, Duck a la Orange.  She gave me a bite and it was wonderful.  She is a very lite eater and took half of it home.  The caramelized carrots and steamed broccoli sides were okay.  As the waiter was taking her plate to box up the duck, he announced that he would be bringing the surprise birthday cake I had preordered.  Kind of spoiled the surprise.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7jjWmVmGgdCR9DYKOavSvg"
  },
  "ThjjqhIItBDAFpTeQB7Vww": {
    "date": "7/21/2017",
    "text": "I have eaten here many times, Family came to town and took them for a nice dinner. The food we had was good; sea bass, Duck, Chicken... appetizers were underwhelming for the price. You can feel that they are looking to make their money by reducing portions whenever possible, each time I have gone the size has diminished and the prices have not. Cocktails are a bit weak, wine is way over priced. But I still go, and will probably go again, unless something else opens close.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tnTknVchC57yhJCNAfHjRw"
  },
  "q4hiOuid3eD_hcmrXchmlg": {
    "date": "2/10/2016",
    "text": "My wife and I tried this place out for an early Valentine's dinner to avoid the crowds. We were very pleasantly surprised.  Our waiter, Santino, is an older gentlemen with a nice, thick Italian accent. It's clear he is very experienced with serving, the details of each dish and the daily specials. He was excellent and, as politically incorrect as it may be, having an Italian-accented server really adds to the atmosphere of this authentic Italian restaurant (even if it is owned by a Greek.) Basically, what I'm saying is, if Santino was working at McDonald's, I would eat at McDonald's more often. :)  The food was excellent and each dish came out in a timely manner. We arrived on a Wednesday night and parking was easy, no reservations and we were seated immediately. The restaurant was respectfully busy on a random Wednesday night, so that tell's you something. People obviously like it!  We started with drinks. I had a Coke, my wife an iced tea. They have a fine wine menu with plenty of choices available as well, of course.  They brought a basket with a small loaf of bread (similar to French bread) with a ramekin with about four pats of real butter.   We ordered the fried mozzarella, which arrived not as sticks as you might expect. Instead, there were two triangles (shaped like Arby's potato cakes) put together to form a square and a generous portion of a heavy marinara was on top. I found the marinara a bit strong, but nothing I couldn't scrape away with a fork. I like that it was different, but still good.  My wife ordered the chicken Florentine while I opted for the Angel Hair Pomodore. In fact, trying to find a restaurant in town that served Angel Hair was quite difficult and it was my Google research that landed us here. You'd think Olive Garden, Macaroni Grill, Bucca Di Beppo, and other popular Italian chains would offer it, but sadly, no.  Each meal includes a soup and a salad. We were told when we sat down what the soup was, but there was no mention of the salad or any choices to be made. I guess you get what you get as far as type of salad and dressing. I don't eat soup or salad (I'm a fussy eater) but my wife seemed to enjoy it.  The Angel Hair Pomodore was done right! Old school, no tomato sauce, just real chunks of stewed tomatoes tossed with olive oil, basil and garlic. Often times I find pasta sauces (and pizza sauces) far too sweet. Not a problem here. It was almost bitter. I loved it!  My wife enjoyed her chicken Florentine, though the broccoli, cauliflower and carrots were a bit crunchy for being steamed. A minor issue, really.  The person who refilled our drinks must have visited our table a half-dozen times to top off our glasses of water and my wife's iced tea. He also refilled my Coke for me (which has to be done at the bar.)  I worry that giving this place 5 stars may set unrealistic expectations if you've never dined here before. I know the rating is important to the restaurant, but so many things can change during a dining experience. Think of this place as a 4 star and hopefully it will exceed your expectations (if that makes sense.)  We'll definitely be back!  Iced tea: $2.50 Coke: $2.50 Fried Mozz: $6.95 Chicken Florentine: $15.95 Angel Hair Pomodore: $12.95  Tax: $3.39 Total: $44.24  (service from Santino: $ Priceless!)  That's a bargain for this kind of food in this kind of atmosphere with this kind of service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "-iOeI18tVuwxFHcqCe--fQ"
  }
}