{
  "RU2OJLC7F3lZ_drm1kSH0g": {
    "date": "1/7/2017",
    "text": "Dinner was delicious and the service was great!  A yummy treasure in the heart of Tempe!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rd9vgTqPXTbLZ3V-RzoFdA"
  },
  "yEfjqSxYu5ZYRI4WwblU-A": {
    "date": "1/5/2016",
    "text": "Casa Reynoso is consistently serving 5-Star quality traditional Mexican dishes with excellent service! My favorites are the Flour Cheese Crisp with Green Chile and Green Corn Tamales with a large order of rice!!!!! It's always a pleasant experience dining at this restaurant! Appreciating the great food and welcoming hospitality my overall rating for this establishment is 4.5 Stars, leaving them room for growth.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BBNvUMCfR2etVJ8pJQ0c1Q"
  },
  "bo2K3IjX0hERq626k85hdw": {
    "date": "4/17/2015",
    "text": "For a mexican food joint .have to give it five stars.we come here all the time .sooo good you have to try the gollo burro.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Ovmzw7yPhOKkpKylB8iSw"
  },
  "agrNVC1OJm8qIu2gPr-lZA": {
    "date": "7/16/2012",
    "text": "The salsa here is so flavorful.   I say order a burrito or anything that comes with red or green chili. Neither is too spicy, both are delicious.  -Gollo Burro: flour tortilla filled with green chili, whole pinto beans, onions, cheese topped, melted butter. I usually order it without butter just to spare the extra calories and it's just as delicious.  -Charro Completo: flour tortilla filled with red chili, green chili, refried beans, onions and cheese.   -bean and cheese burrito enchilada style, yum!!  Everyone here is friendly. Four stars because sometimes the service is a little bit on the slower side. But the food makes it worth the wait!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 0
    },
    "photos": [],
    "user_id": "y2Xj-NBnxG6mHMaF9f1d3w"
  },
  "Np_QbiVGyT1cVT3h7xMR6A": {
    "date": "6/21/2012",
    "text": "Awful. Just awful. After being led to our booth (which had a 8\" inch long gash in the seat cushion with material poking out of it) we were eventually greeted by a pregnant woman covered with tattoos. 20 minutes later, she returned with a couple waters and took our order. After another 30 minutes, our food arrived..sort of. We ordered nachos for an appetizer, a bean chimichanga with extra sour cream, and an enchilada combo. What we got, however, was a visibly burnt plate of dark brown nachos they felt proud enough to serve, brought out at the same time as the enchilada combo, and the chimichanga plate..which, mind you, amounted to a chimichanga covered in white glop that looked like it was freshly squeezed from an oversized toothpaste tube. No rice, no beans. Just a luke-warm chimi on a 300'F plate covered in toothpaste fresh from the dairy.   Using her razor sharp perception, she noted that our nachos looked burnt (after she had already brought it out!) and offered to have the kitchen make another plate. We agreed.   It never arrived. In the interim, I took our 3 year old son to the restroom. While there, I found the urine puddle on the floor and the  wide array of pubic hair on the urinal really charming. The half-destroyed/filthy toilet seat had a nice home-spun look to it as well. Why invest $15 at Home Depot for a new toilet seat when you can show your customers how much you think of them, and think of cleanliness in general?   So, that about did it. Between the hole in the seat cushion having more food in it than I had food on my own plate, the hour spent waiting for microwave-quality food and the eagle-eyed wait staff, we left. We literally walked out on the meal, the first time my wife and I had felt compelled to walk out on a restaurant in over a decade. We weren't willing to put in another half hour waiting for the check.   Unless your a fan of filth, and have 3-4 hours to blow, I'd recommend you look elsewhere for Mexican food...   There's a Taco Bell down the street with a higher rating.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "iHPn0SmUcn2JT0VoTieyIw"
  },
  "Al4aRN1phGx4m8Mpk3aGRA": {
    "date": "10/25/2015",
    "text": "Came in on a Sunday afternoon with the girlfriend. I ordered a small menudo which I ate in 4 mintues because of how small it was. That was prbly the best part. I also ordered a green chilli chicken burrito that I couldn't finish because it just didnt taste good. My waitress did her job, but only took our order and came to check on us once.. AFTER we had finished our meal. I probably won't be coming back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mukuUw6ts4jyzSqGd3WqAg"
  },
  "gyVJd86b8gCyuH5jPWCjAQ": {
    "date": "7/20/2012",
    "text": "Love, Love, LOVE Casa Reynoso.   Full Disclosure? I'm a bit biased. My mom went to high school with the owner...or the owner's brother...I'm not quite sure.   But! This place really is the best. Let's get one thing straight - this is a family owned, old restaurant. It is not a fancy, schmancy joint. The food, however, is DELICIOUS, the staff is so friendly, and the atmosphere is comfortable. The salsa is full of flavor, the tortillas are soft, and, in every experience I have had, the food comes out quick. This is home cooked style Mexican food at its best.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YeUYyDBp9CHAeJCpCeXLvw"
  },
  "-iBo7lkLskyCYnmjhDNM5A": {
    "date": "4/3/2012",
    "text": "I can't say enough good things about Casa Reynoso. I just wished I had known about it earlier! It's tucked in the corner of a Fry's strip mall, so for an entire year we never even noticed it was there. I'm so glad we found it, because it really is a little gem. I love the green chili chimi and there 4.00 Margaritas are awesome. The family that owns this place are always there and are SO nice. They love to talk and will recommend all the goods.  Kids are also extremely welcome here. This is just a great little Mexican place with awesome service, yummy food, and a decent atmosphere.  We love it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Hylg642xNVl1NXIRw7LMow"
  },
  "m0gbbV6KZ0Ia-qq0p78tpw": {
    "date": "7/14/2015",
    "text": "good food good service good price  margaritas only fair tho",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cgJNa-MbyOX7rQ_J2VQGEg"
  },
  "TGNBJr7Y57BTTKzjY-fCPw": {
    "date": "7/11/2015",
    "text": "This is my favorite place in the world for green chile!!  It is THE best.  My favorite is a green mixed burro green chile enchilada style.  I'm always craving it!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3XTlquub3qV59kcyR2y0Bw"
  },
  "HFtHE0q-MVLK4TTNsdUpEw": {
    "date": "7/30/2014",
    "text": "Been coming here for many, many years with the family for delicious Sonoran style Mexican cuisine. It has always been great. The gollo burro is to die for. My dad would eat here every week if he could get away with it. Never had a bad meal and I have eaten the entire menu. Wonderful family run business.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "e20odwMKY7UqopQkNC3nLQ"
  },
  "Af9yTjK1WQK4NEOEwX1I3Q": {
    "date": "2/17/2015",
    "text": "Being a Mexican food snob I wasn't sure when we walked in. Let me tell you.....the best Mexican I he had in a long long time.  Authentic, flavorful and just the right spice.    Not overloaded with cheese and grease.    I can't wait to go back.   So excited we found this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "euFb0J3FDCDMQz8DweAyTA"
  },
  "HRuNZAYXhkbb3Bxju0C2pA": {
    "date": "2/11/2015",
    "text": "Fantastic food! Machaca to die for! Green chili sauce and pinto beans were fantastic!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yvTqqVFTS2NHxsKtJXy1YA"
  },
  "LbTvrs6O-9JmoesOpoAU8w": {
    "date": "7/17/2017",
    "text": "I have been dining at Casa Reynoso for literally 25 years. It has had very authentic  \"globe\" style Mexican food which I enjoy.  I believe the owners or their family members have globe roots.  Over the past year, I have been very disappointed with the food.  For some reason they have increased the heat of their hot sauce.  Their sauce is not really salsa as it has a very thin consistency but the heat level has dramatically increased making it really hard to eat.    Additionally the quality level of the food has also dropped off dramatically. I went there Saturday and the taco was literally the smallest one I have ever eaten.  Their red burro, a staple here has virtually no filling and the tiny bits of meat were tough and chewy, really bad. the Tortilla  right out of the bag from Frys. My rice was really old and nasty.  Unfortunately I can no longer recommend the restaurant. Perhaps they have changed cooks but this has been the same over the last 4-5 times I've eaten there.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sl8aVNANSn6S12URbwwVhA"
  },
  "yPccA00PMrspy1een1Qrnw": {
    "date": "3/14/2015",
    "text": "5 stars for the food. Service and atmosphere was blah. Food was amazing. Got the voted #1burro BTW",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9lF0W2Z44pNxi9pWLWhckg"
  },
  "lN9EBSZORfs6_ph6f3o2MA": {
    "date": "12/30/2014",
    "text": "This is one of our family's favorite Mexican food restaurants... Family owned and operated... Mom taught the kids well!  The food is excellent and the service is friendly!  Try the machaca meat, the green chili or the Gollo Burro!  Don't forget a tasty margarita to wash it down!  This is where the neighborhood folks eat once or twice a month!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qQ94hR3TSdzN_ySAMdmaFQ"
  },
  "cfZ5C0nVu6v1nf2M1hVVUg": {
    "date": "12/27/2014",
    "text": "Great place for lunch. Been here a couple of times and I've never been disappointed. Iced Tea with the giant Green Chile Burro. WOW. Place is family friendly, priced perfect, and the service was excellent. Lunch never takes too long and the atmosphere is fun and relaxed. They really make you feel like you're part of a new family here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a5LzjPrEL-Sj5BfHr8xxRQ"
  },
  "O7m_7grUs-LKeyRPP2rQjw": {
    "date": "2/7/2015",
    "text": "I grew up eating La Casita in Mammoth, which is owned by the same family. I have also eaten at their other family owned restaurants in Globe and Showlow, and this one is my favorite. The food is always great and the service is fast and friendly. The beans are tough to beat and their bean burro enchilada style is always a must. I just wish we lived closer so we could eat here once a week.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NWT06Hu3VObAawRyjnymjA"
  },
  "mheDNGDSAsob9msOgms4tQ": {
    "date": "9/14/2015",
    "text": "I grew up down the street, so I went here nearly every weekend as a kid.  I live in chandler and will still drive to get Casa Reynoso.  Its a great family owned restaurant with amazing food.  Do not be fooled by the locations, its not the nicest shopping center, but the restaurant itself is great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZBjaiD5NHp2CN0ZywjxuwQ"
  },
  "nYzoUsgA5GjqBrvY61TfOg": {
    "date": "7/14/2015",
    "text": "Hands down the worst Mexican food ever.  What a disappointment based on Yelp reviews.  I am not even sure I will refer to Yelp reviews for recommendations ever again either.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LjZ7YrQJSUFefMgYPdUp-Q"
  },
  "2fOMIc1jOeM5pvBc1uMKcw": {
    "date": "8/31/2016",
    "text": "The food was great, The service was great, and although I haven't lived in Mexico and don't know what \"authentic\" Mexican food is, Casa Reynoso's food was delicious!   The only thing I didn't care for is that on their menu, it says 50 cents per small bowl of chips but then the first bowl was free - I guess some people just eat the chips?  cheap people! - I had their special, 2 Beef enchiladas w beans and rice for about $9.  I had their green sauce instead of red.  It was a bit salty but I enjoyed it.   It is nice that this establishment still offers the A La Carte menu. Many restaurants have gotten rid of that.   The menu is not too big, easy to understand. I also had their regular margarita.  It was OK.  Not a big drinker, anyway.   I'll go back if I'm in the neighborhood again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "eagsrsZbSIrrNTyRO-0PmA"
  },
  "_fhcyDgH9Nk31BTFj6kXDA": {
    "date": "8/19/2016",
    "text": "Stumbled upon this place after dropping by the grocery store next door.  There was a line and the hostess seemed to acknowledge several regular customers which is usually a good sign. We didn't get anything fancy- taco plate with rice for my husband and cheese enchilada dinner for myself.  It took quite a long time to come out, but they did refill our chips several times.  The salsa was pretty hot.  I had plenty of time to read all the other Yelp reviews and discovered most people get the dish they are famous for.  I'm not mad at the enchiladas; so far the best I've had in Arizona. We'd go back, but it's a little out of the way for us and we'll probably discover other places we like more.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-uuya6_5D2_HqfyejWsgIQ",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-uuya6_5D2_HqfyejWsgIQ/o.jpg"
      }
    ],
    "user_id": "2831Zln_jbAeTpcE8p1OKQ"
  },
  "N696L5l3L9diW4BFSHt-9Q": {
    "date": "11/8/2014",
    "text": "Went here for dinner with my boyfriend and we were not overwhelmed. Mediocre food, but they apparently use family recipes. Maybe we ordered the wrong thing, but our dinners weren't anything special.   We ordered cheese enchiladas, machaca burro, beef taco, rice and beans. The cheese enchiladas, rice and beans were typical Mexican good, tasty but not impressive. The enchilada sauce wasn't that great. The hard shell beef taco was soggy but the meat was flavorful. The machaca burro was dry. I was hoping for a better mix of beef, tomatoes, chilies and onions, but it was mainly beef. Definitely needed a better ratio of meat and veggies.   The highlight of the meal was the salsa and guacamole. I would recommend getting guac!  I doubt I'll come back to Casa Reynoso. I was disappointed in the food, but it was a good value ($25 for our whole meal), nice atmosphere, and pleasant employees.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "105tIg6brHiGDBXuGbbizA"
  },
  "Xby9Qisrp3asbrj7ONMk2g": {
    "date": "10/23/2017",
    "text": "Tucked away in the corner of a shopping center, we went in not expecting much but were surprised to find the place super busy for lunch (a great sign). The food arrived super quickly and was all so tasty. I got a large margarita, expecting just a slightly larger drink, maybe a 2oz shot but WOW this was almost a big gulp sized drink. Super good and now I know what I'm getting myself into! Only downside is they are closed Monday, which is somehow the day my bf and I are always craving their food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iWrAQTJp3JqgIqdPIVxH9g"
  },
  "lEMa-MqA8iqHkO1vgNel-g": {
    "date": "11/9/2017",
    "text": "I've been coming here and to Chalo's in Globe since i was a little girl. The best!! I've never had such amazing Spanish rice. I love me some Casa!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SBbCclI646NWUWPpBGimgg"
  },
  "9hG6708NNJG9ved7T90JrA": {
    "date": "3/24/2018",
    "text": "One of my favorite home style Mexican restaurants in AZ. Me and my family have been coming here for years. If you are coming on a weekend expect to wait. (As you would at most restaurants) THE WAIT IS WORTH IT",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SeGID_4__xMt_Phaa5pgwA"
  },
  "KgrJn6Oyc91ljCFSukCKcQ": {
    "date": "5/3/2017",
    "text": "I have been wanting to try this place for awhile after being by it on a day that it was closed (Monday, I believe) and finally had the chance to try it. I ordered a margarita on the rocks to start (22 oz). It was okay, I've had better and I've had worse. It is worth the money, but I don't know that I'd order more than one again. The second one I got was an after dinner drink, so I got a strawberry margarita blended. I was bummed they didn't put a sugar or salt rim on, and instead of a small, they brought me a large that had the alcohol of a small. I was pretty full from my meal (pic shown, I ate all of it) and so I couldn't finish it, hence why I had ordered a small. I ordered a combo, #13, simply because I could not decide what sounded better and I wanted rice and beans which are extra with most of the combo options. Sour cream and guacamole are extra and are a little over priced too. Between my friend and I, who got the same thing, same drinks, our bill was $80 which seemed pretty steep, but it was excellent food! Our server was great about checking on us and provided excellent recommendations.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rHZEeH0DYYqL7nm3PBKrRg",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. Combo #13",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rHZEeH0DYYqL7nm3PBKrRg/o.jpg"
      }
    ],
    "user_id": "XNSrOA73avkABiA02H0gTA"
  },
  "d1UiLtOo6Fm2BzkTthOytA": {
    "date": "9/15/2017",
    "text": "We really wanted to love this place. But the fountain drinks tasted funny and my hubby found a hair under his burrito. The rellenos were pretty good. The staff is the one thing this place really has going for it. They're very attentive and professional. Kinda bummed it wasn't better, since it was the Mr.s birthday.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wxHuIhKdob4KeJ_saRcO3g"
  },
  "QtvYXKLThfvugwIX8kw2tA": {
    "date": "6/29/2017",
    "text": "I got a to go order today. Machaca Taco, & Green Chile Burro. Both were very good! Very interesting cheese on the outside tacos. Only place I have been to with better burros is Rito's. I will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bwhAa45UoP0vtQzJpHq2mQ"
  },
  "XnBqYz_m0MFbaUGx6KwwqA": {
    "date": "10/17/2016",
    "text": "So I did go to this place and while the food was fine, the service lacked a little bit. I felt a little rushed out and ignored but who really cares. Quite honestly i would've given a higher rating but when i came to write my review i noticed a horrible response to another yelper from the management at this restaurant. really pissed me off and quite honestly i will not be returning to this place after reading that. fat shaming a customer just because they didn't like your food is honestly so childish and completely despicable. I wouldn't take my business here and had i seen that prior to stopping into this place, i would've definitely turned around.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "EejA3YNon_gCTqQzDkCFKQ"
  },
  "1KXFXlUHzdRP1vkgB8Fiww": {
    "date": "3/17/2016",
    "text": "I love this place. Casa's has the best Mexican food. I love the chile relleno with beans and rice. and I've tried their burritos too--super yum! The red burro tastes lovely as well. My boyfriend and his family has been going to this place for years and years since he was little and they all sing its praises. I love the JoAnne special--a small dish but it is SO delish. I haven't had anything I've disliked from here! Highly recommended if you want some good hearty Mexican food that won't break the bank. Only thing is sometimes service can be a little slow, but it's worth the wait in my opinion. Family-owned restaurants always has the best food!!!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oDiOz5_bxtdqLTAnVUd79A"
  },
  "-uik9D8nkfc-tXIc1QAFbQ": {
    "date": "8/16/2014",
    "text": "Gollo Burro excellent customer service and now they have Roger Cline's Mexican Moonshine.  The Fresh Caramel Flan & chips and salsa are also very good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B2HDoWNIzLlon0IhS1cmDw"
  },
  "RAPDY3K6lZ1HoxW2IbEpDA": {
    "date": "3/22/2016",
    "text": "For whatever reason globe is the arizona hub for great mexican food and sets the standard.. these guys brought globe to tempe.  Went for lunch with a mad craving for a taco... the iced tea was so refreshing I left sloshy..the chips and salsa are good.. I tasted cinamon in there somewhere.  The taco enchilada combo hit the spot. The taco was shredded beef crisp and delicious. The enchiladas sauce could have had a little more bite but was tasty. The rice was some of my favorite and beand were good. They nailed the basics!!! Huge compliment. Service was attentive!! Kudos for a great lunch!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WiYaYQzqTIRnlzPg70ZV5Q"
  },
  "XHPw7wHEAYSR33_viMeSYQ": {
    "date": "1/22/2017",
    "text": "I grew up eating at Restaurants owned by this family,  first going to  The LA Casita in Globe and  Mammoth,  my entire family raves about the refried beans, as well as the green and red chili.  We all know the menu by heart and we have a habit of comparing every Mexican Restaurant to especially the beans to Casa Reynoso,  LA Casita,  and  Chalos.   Casa Reynoso has become my favorite of them all, as far as I'm concerned,  there is no better Mexican food Restaurant anywhere in the country!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CxJBTR9lCAVPc5ltZQOitQ"
  },
  "ayy9SmoaG5DT5fdN6Zl_5A": {
    "date": "11/21/2016",
    "text": "Food is pretty good, service is pretty slow. My boyfriend's mom & their family friends love this place so we go every now and then & the food is always pretty good. We get the cheese crisps then some type of combination plate and I'm always satisfied. The margaritas are delicious too. The service on the other hand is pretty slow :-/ I asked for a water since my mouth was on fire from eating a piece of pepper in the salsa, and it took a while for it to come. We will still be back for the food though, worth the trip if you have some time to chill.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TJNkg75ODHabE5GBfV5wRQ"
  },
  "7bYzZXQfUD8IT11yjBoelw": {
    "date": "8/12/2015",
    "text": "If you've ever been to Globe, you've at least driven past some of the best Mexican food this side of the border.  I don't think Casa Reynoso is *quite* to that level, but it is as close as I have found here in the valley.    The ambiance is old-school Mexican and the service is either great or average... but the food is consistently great.  Even a simple bean burro is fantastic.  I either get the bean burro enchilada style (topped with red sauce and cheese) or a combo with an enchilada, a chili relleno, beef taco, or some combination thereof.  Add an ice cold coke and their addicting chips and salsa and you have a recipe for a delicious meal!  All of that and your check is not going to break the bank- prices are super reasonable.  Speaking of the check, note that you'll take it up front to pay your bill!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 9,
      "cool": 6
    },
    "photos": [],
    "user_id": "iN7T3vQoC3v_MPs2TzH5Zw"
  },
  "YNH6-wsqSM8gZZmkPgzDNA": {
    "date": "11/4/2016",
    "text": "You might have to wait a bit for the food, and they can be a little understaffed, but I love the recipies.  Had the best tamale I have ever eaten, there  the other day.  I also like the tacos and the mixed burritos.  The beans are very tasty.  I get a craving for their food, every once and a while.  This is one of those places that you will either love or hate.  Restaurant facility and restroom surely needs a remodel, but it is reminiscent of the old family mexican restaurants of the sixties and seventies in the valley.  Makes for a nice change from Garcia's style mexican food, which has it's place in my cravings sometimes, as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "NDZnyG1sB-ePBgNLphPO3A"
  },
  "T6aoQD4KRBuygXJclvsrdw": {
    "date": "1/19/2017",
    "text": "Wow. Super yummy, and very much like grandma made it. Delicious, excellent service, cozy place to dine and take friends or family. Prices are decent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RUYT3dhCVIJA6mYUquwQQA"
  },
  "vdb8oeder0unGtO92kYJaA": {
    "date": "9/2/2015",
    "text": "This is my favorite mexican food restaurant in Tempe (maybe Phoenix).   Our favorite things to get are a cheese crisp and either a charro completo or gollo burrito. And of course enchilada style. The salsa is really great too. Has a unique spice that we like a lot.  Growing up in Phoenix, I have fond memories of eating great mexican food at mellow, low key, non pretentious places. Many of those places are gone and I miss them. This place reminds of them. This is Arizona mexican food. Killer cheese crisps, great chips and salsa, combo plates with great re-fried beans and cheese melted, good margs...   Great mexican food, good prices, Arizona old school mexican food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "dKfdIVScXWruwUFi_DG0aw"
  },
  "LH1vSAUCPFAMGxwPfhcTNA": {
    "date": "12/5/2013",
    "text": "Food 4/5: I got an enchilada, rice & bean, tostada combo. Pretty good  Service 4/5: staff was working hard and very friendly.   Overall experience 4/5: restaurant is older maybe in need of some update bit it has a charm to it.   I live I'm Tempe I would go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SdrqSczujrCY-HemEoNaiw",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. Cheese enchilada",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SdrqSczujrCY-HemEoNaiw/o.jpg"
      },
      {
        "img_id": "DB1Jj0QCIq5za_Est2YVug",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. Tostada",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DB1Jj0QCIq5za_Est2YVug/o.jpg"
      },
      {
        "img_id": "5uIowpvJ9LKa_EB2vwgK5g",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. Cheese enchilada and rice and beans",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5uIowpvJ9LKa_EB2vwgK5g/o.jpg"
      }
    ],
    "user_id": "wbC0MU6MHMhS880bd_kI1w"
  },
  "CSxU4NPCBD4JGO0JEAaMIA": {
    "date": "1/25/2009",
    "text": "For me it was just OK. I'm a big fan of New Mexico style red vs. green chile sauce debates, so I was excited to see that this is one local place that seems to offer a lot of red/green choices. However while there's a decent mix of offerings, the sauces themselves were simply ho hum. Not bad, but not \"wow.\" If you live near and need a Mex fix, this place would work for some of the basics, but not really a place to journey.  I did like the hominess factor, but service was a bit slow as well.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "aIzN19RssPWSw9nDCPXU3A"
  },
  "KvymTfxf1KDVslWrkmMNvw": {
    "date": "6/25/2010",
    "text": "Great service and wonderful authentic Mexican food. I've been living in this neighborhood for years and just discovered this treasure today.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2TG1lqi_OgL0PKQTeIyM4w"
  },
  "VnRfezzzILeT4s1t7S1l7w": {
    "date": "8/27/2009",
    "text": "Went here for lunch and opened the place up at 11AM. It is a very casual spot, with very decent prices. Started off with the traditional chips and salsa. Chips were ordinary and the salsa was a bit watery for my taste. I had the Gollo burro. Very good. I don't know of too many places that serve this style, but I'm into it. The restaurant is located in the corner of a strip mall next to a fry's supermarket and behind the Jack-in-the-box. Inside, it's actually surprisingly spacious, and we had plenty of room in the booths. I'd go back, but there are way too many spots I have ranked higher that it may be a while. Decent, but not outstanding. Maybe I'm picky...",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xPpqpudzcB2EwyHhIsAjlw"
  },
  "aQ9iWY00I2QqrVEQ-idnHg": {
    "date": "10/22/2008",
    "text": "The first time I decided to visit Casa Reynoso I walked in and immediately turned around and walked out.  The horrible smell that greets you as you walk in and the stuffiness of the place turned me off so much that I wasn't brave enough to even try the food.    But after reading the reviews on Yelp I decided to actually give it a real go.  The food itself was far from spectacular and is hardly even memorable.   In fact the food is the thing I remember the least from my trip.  Here are the things I do remember.   The smell.  I do not find this stale smell inviting at all despite what others have said.  You just kind of get used to it while you are there.  The menu is fairly limited which I would not mind if the items they did make were great.  The chips arrived in a tiny soup bowl that contained about 8 chips.  The salsa was just 'Meh'.   I really wanted a margarita but at $10 for a large I decided against it and just had a Corona instead.   First choice was a Corona Light, but they only had them in the miniature 7oz bottles....kind of odd, but not a huge deal.   There were no knives on the table, just forks.  I thought perhaps it was just our table, but our food came out at the same time as the booth behind us.  And I heard them ask for knives as well.  Now I'm sure this has to be a common occurrence, because how are you going to dig into a burrito without a knife?  So you would think that they would just set the table with them.  But maybe that's just me.  Our waitress brought our check and said she would meet us up front to pay.  Well I still had about 3/4 of a beer left and we hung out for a few minutes to finish our drinks and such.  When we made our way up to the front there was no employee in sight.  Apparently our waitress meant to come at that moment if we wished to pay.  There were also customers who walked in waiting to be seated.  We all waited about 5 minutes for an employee.  One finally came and said she did not know how to work the register and seated the other customers instead.  So we continued to wait close to another 5 minutes where another group of guests had arrived and been seated while we were still standing waiting to pay.  So finally someone came up and took our payment.    Summary:   unmemorable food, bad service, weird smells.  Probably won't return anytime soon.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BqUm1rHPSxlCWr-3HhNQyw"
  },
  "TJnusukVNV_CQJw5y2BuOA": {
    "date": "4/10/2010",
    "text": "Service is often pretty crappy, but their food is good.  The Gollo burro is one of their specialties, getting it \"green style\" is key.  My family and I ordered take out from there a couple weeks ago and they definitely skimped on the portions.  My bean burrito barely had anything to it and my side of rice was only a couple bites.  Kind of frustrating.  Usually bad service can be easily forgotten by good food and decent prices, but I think I will keep my trips to Casa R to a minimum.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iRXOvcM_cvyuTEfWQLkAoQ"
  },
  "Vltc-cyLvsXzWodqY31l4w": {
    "date": "12/17/2012",
    "text": "I'd rather eat dirt than eat here! My kids love it here but they only eat bean burritos. Their chips are usually stale, Their salsa truly sucks ( I could do better with some Rotel & spices) and their chicken burrito has no flavor to it all. It's just mushy. I tried putting some sour cream on it and it still couldn't help this sad dish. The owners are truly nice, but it seems that they don't have a clue. Don't waste your money here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OF0J4hZysukzjFhZ-tkcVw"
  },
  "mJslerf9ofVYycqU7UK0wA": {
    "date": "6/17/2009",
    "text": "There are 2 towns East of Phoenix called Globe and Superior. This area has awesome Mexican food. And a local family moved their business to Tempe. This restaurant is very casual, and a bit of a hole in the wall... it is located in a strip mall. Don't be fooled, it has delicious food! I highly suggest the goyo burro (I think that is the way it is spelled??).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xZuj0FBDj61gCrF8xgPwtQ"
  },
  "TRFA28TucQYbl6sexdRPRg": {
    "date": "12/22/2009",
    "text": "Don't listen to any of the bad reviews.  This is by far the best Mexican restaurant in the valley!  I've also been to the one in Chandler and the original restaurant in Globe called La Casita.  Regardless of the location, the food is always the same and nothing less than superb!  Don't get me wrong, it is a humble, family owned hole in the wall but the food is incredible.  The service is sketchy at times (probably because they have their staff members pulling double and triple duty) and the prices are a bit more than most places but they make up for it with the food.  The biggest complaint most people have is the lack of an endless supply of free chips.  Believe me people...you don't want to fill up on boring chips anyway because the food is that good.    I usually get a combo plate consisting of a chicken taco, chicken enchilada with rice and beans.  I also sometimes mix it up with a bean burrito every now and again.  BTW, the burritos are great reheated if you want to take a few home a la carte to savor the goodness.  The refried beans are very tasty and the enchilada sauce is by far the best I've had anywhere else.  The salsa is a bit spicy for my taste but good nonetheless.  In my opinion, there are only a handful of Mexican places that can even come close to being in the same category as Reynoso's (Macayo's & El Matador to name just a few).  So if you're looking for authentic great tasting Mexican food, look no further than Reynoso's.  My family and I have been coming here for years and will continue to do so.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j_2QBNML1Wx8QPMzLePlrg"
  },
  "0QaOwVkWxoknNfJJiZluSA": {
    "date": "5/20/2011",
    "text": "I was not impressed!! I went here because of the reviews, but found that the service was poor, the food mediocre, and not hot enough for me. I am always checking mexican restaurants for the food and the heat. I love the food, being from NM and also love the heat...this one fails...would not go back!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mC96WCxMfJc9yCQQmv635Q"
  },
  "MX-XDv1kjZTRL3Mg-lOqdA": {
    "date": "5/4/2010",
    "text": "food is good AZ style Mexican food. i have been there 3 times,the food was better then lets say Filberto's or someburros down the street. i do have to say 1 time i stood there for 15 20 mins to pick up my food. but 1 time i took my wife n kids there were fast and did not take much time to sit and eat. so its so so there is better and much worse around!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oKWVVqPWVzq5s6nS4O8sEA"
  },
  "Jfmb2li_zmwOtWuu7a8zHg": {
    "date": "9/18/2008",
    "text": "First off let me just help you understand how much I love Mexican food.... I would eat it for every meal if my husband didnt protest and ask that I cook something else for a change. .. that being said I have dined at many many mexican resturants all over Arizona and today I added a new one to my dining experience! Casa Reynoso !!! BEWARE VERY ADDICITING.. I had a bean burro enchilado style with red sauce and a side of rice... it was... do I dare say it ?  HEAVENLY!!!  This is my new favorite mexican food!! The price is reasonable... but as for pretty much all mexican food it is not low fat to say the least!! But that wont stop me from going again and again... the salsa was more runny rather than chunky but fabulous taste! Not BLAZIN hot but had the perfect kick to it. . .  salsa can either make it or break a resturant in mine opinion!  I cant wait to go back!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4tCHS4lP2Jjks5FB9ofiQg"
  },
  "3djqRsktpvDY6-nu15oFfA": {
    "date": "7/13/2009",
    "text": "I hated Mexican Food until I married a guy from Globe who took me to Chalo's Casa Reynoso up there 14 years ago.   I have been a fan every since and the Tempe restaurant is a little different, but it's still the same wonderful food.   It's our favorite place, we can't stand to go anywhere else.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jghktxVyQy5dkm1TI_1Aqw"
  },
  "U7lA66gDNLZ28QcCzks2Hg": {
    "date": "6/22/2017",
    "text": "I have had mostly really good luck in my life going to hidden Mexican and Italian restaurants. Casa Reynoso is definitely one of those little gems that proves my point. It's a little hard to see, but we'll worth looking for. Their salsa is just Ok (Pace from the grocery store is better), but the entre's were all really good. There were 5 of us at dinner, and we all had different meals, and all of us were very happy with the meals! Service was pleasant and attentive. Ambiance was about what you'd expect from an independent restaurant. Prices were reasonable, except for the tiny $2 dollop of sour cream. We will definitely be back! Regularly.  4 stars because of the so-so salsa and overpriced sour cream.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yvGttJQiYees8dDzfJ-3Xw"
  },
  "5j6J2Y7-4-bYfwpt_P3Cqg": {
    "date": "9/6/2018",
    "text": "I almost didn't try this place because it only had 3.5 stars. Then I went there and don't understand why it doesn't have five stars... it is so good. Authentic Mexican food. They also have really delicious, well made margaritas. I went there for the first time last Friday and went back on Sunday as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DvKGt4bUifkoRp9qBiDkXQ"
  },
  "aCuuXrpb5MF05OlztIDJ9w": {
    "date": "6/24/2018",
    "text": "We had not eaten here in a long time. The place needs help. The plaza is dirty and poorly lit. It is a pain to park and knowing the area well you better keep your eyes open. The restaurant sat us fast but then the brakes went on. We were ignored as the workers clearly visited with friends. Finally they get to us. When our food arrived we had to stop someone to bring tortillas that we were promised where coming. The food is just ok. Beans were runny. Tacos are tiny. Prices have gone up. It sucks we have been to the one in Globe and LOVE that one. They need to send a person from there to give this place a make over now!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QSfk1gGGcW-d2K5d0HWS1w"
  },
  "3fMBmhCdWer8vy405a9FyQ": {
    "date": "3/5/2018",
    "text": "This is an old school classic family owned joint. I moved to Arizona in 1984 and have been eating here with friends and family since that time. The food is homemade and taste great..They have been in Arizona for many years and originally came from the Globe Miami area. Try the Green Chili and do not forget the hand made Margarita to get things started, I suggest a double on the rocks. More than likely a family member is cooking your meal while their sons, daughters are your waiter or waitress..Give it a try and show support for your local business owners..Most of the negative reviews on this place are childish and written by people who should not be allowed to eat out in public in the first place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JAOicXDeYKAWq3LlcDZmHQ"
  },
  "sIhAbSFJhAE5JMgyi_nTGw": {
    "date": "1/2/2018",
    "text": "Excellent. Haven't been here in years, and it is still GR8. Had the Grollo burrito. Sabroso. Really miss this Sonora style food. The stuff in the Bay Area just isn't the same. Think all the cooks came from Michoacan. Que lastima.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9MQIE5fp8bPYqM1dF8O5vQ"
  },
  "Q_nMuHAMrhE4XFwtmITvxA": {
    "date": "1/8/2018",
    "text": "The food and service were amazing!!! Great Mexican food!  Will definitelybe going back.  Green chili was a too spicy for me, but for my roommate that loves spice said it was GREAT.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zejzT40V2_IuMOGGxDd-tA"
  },
  "MfTCf46wnbXgfEhIB_aS5A": {
    "date": "1/24/2018",
    "text": "the Casa Rey's food truck stops by work every week or so and I try not to miss it. The Gollo Burro  (whole beans, green chili with pork, cheese all inside) is awesome. fork and knife required.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zhz_K5KuMTU3TIz_DfTbxw"
  },
  "_Xmqb5p-Ybca6-Cgj7RSYg": {
    "date": "1/27/2017",
    "text": "This is not a flashy, beautiful restaurant. But the Gollo Burro! Come on, it's perfect! Green chili, pinto beans, cheese, awesome tortilla with melted butter on top... So, so delicious! The chips and salsa are good, and the servers do a great job. I think the Gollo Burrito is my favorite Mexican food item in the Valley. (Or at least tied with the carne asada quesadilla at Backyard Taco.) I'll never order anything else here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pZ3EtXuJu6SjKVKP_I2Byw"
  },
  "pgF6i9sAZFpuAh6mUHGLsA": {
    "date": "9/7/2013",
    "text": "We were looking for a good Mexican restaurant and came across this one because of some of the yelp reviews. Anyways, we had a hard time finding this place because its hidden in the corner of the Fry's shopping center.   When we walked in the restaurant it had a Mexican theme but they do have a lot of family pictures. I like it cause this is a family owned restaurant. I can see their kids hanging out and standing by the carts as they serve which I think is fine.   We asked the serve a lot of questions and she knew everything about the menu. Since she knew this was our first time here she gave us little bowls of their green and red chili so we could decide what to order. Oh my goodness. Both of their chili was so good. The green was a little more spicy than the red.   I had the Gallo Burro and a machaca taco. I would have to say the taco was one of the best I've had. Very good. Their Gallo Burro was rated #1 so that's why I ordered it and it was very good green chili burro. Everyone cleaned up their plate so the food was very good.   The service was very good too. Our server was helpful and friendly. Always keeping tabs on us to make sure everything was okay. They also reminded us before the food came out that the plates are very hot and they were. Since the plates are so hot they put the plates on a plastic cart. Haven't seen this style of service in a long time.   Overall, I really enjoyed the meal at this family owned restaurant. This place will be our Tempe hangout whenever we have that  Mexican food craving.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "LZny2CBGc62Jj8e44BgrVg",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. Gollo Burrito and taco",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LZny2CBGc62Jj8e44BgrVg/o.jpg"
      }
    ],
    "user_id": "asL1d04xS3y8YQtU5ota-g"
  },
  "kOLseGIpKr-DTM9v5SXBHQ": {
    "date": "10/12/2017",
    "text": "The short version is, there is just not really a reason to eat here.  The Chili Relleno was good, but not amazing and the only thing that saved this place from hitting the single star.  Everything else was awful.  My Tamales were weird and dry and the Menudo laced flavor.  the meat choices are slim.  Considering this is in the South West, they really need to try harder.  Also, the cushions in their booths need to be re stuffed.  Also, they really, really need to change / upgrade their water filter.  Water stunk.  Service was slow and kind of rude even through the place wasn't that full.  There are so many better choices in the area that I have to give this place a pass in the future.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mFsgzbMr11tQvm58yfuE4w"
  },
  "1l6hfGlzJc0WYjkxzEinkw": {
    "date": "2/10/2018",
    "text": "Fantastic!! We absolutely love this place. Some reviewers say they need an update which may be True. Nothing fancy with the decor and furnishings are outdated. But it's about the food!! Excellent like homemade Mexican food at Nanas House!! People who don't like it want generic food from a Mexican chain restaurant! I will keep coming back for more!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MNJzu49XsFECP25WCVufYw"
  },
  "qiPfhXjPn9vAY12-58I_Mw": {
    "date": "4/18/2017",
    "text": "Where can I start???? Food and drinks are excellent!!!  Janelle, Yvette, Darian, Tatiana, and the entire staff are awesome!!!  I always recommend this place to folk and the only place I'll eat Mexican food.  Btw... I have to try to Gollo burro.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k_QJEoblvMHI_Bux9xjvYA"
  },
  "KUi8QND-QzX-z9zyE2B6Lw": {
    "date": "3/24/2018",
    "text": "Pretty average Mexican food, nothing exciting. The margaritas were uninspiring. The service was okay. Nothing worth returning again for.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nfAxLjPlZq2VkhKqE2m9yA"
  },
  "0faFxKwlxS2wx_rljJyWKw": {
    "date": "10/21/2017",
    "text": "Hubby and I decided to try a New Mexican place last night. This one was one of those places you can't base off the amount of yelp stars. Kind of a divey, old school little place. No frills here. We were greeted by a hostess who said it would be about 20 min. Great, grabbin a drink while we wait. Bartender asks if we would like small or large margs. Obviously large. They were huge! We get sat in less than 20 min. Promptly greeted by our super sweet waitress Janelle. She said she has worked there for 20 yrs. she took great care of us! We got one of the specials of the night, machaca enchiladas and their house special burro. Both were legit. The machaca enchiladas could have used a little more meat, but the flavor was so good. They didn't over do the onions like some places do. The burro was green Chile, beans, BUTTER. SO GOOD. Their beans are nice and lardy too. You can tell everything from the beans to enchilada sauce in made in house. If you want a good, Mexican grandma style meal. This place is it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5DmPSHQQwhvvHzToCjWpBA",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. Machaca enchiladas and their house special burro.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5DmPSHQQwhvvHzToCjWpBA/o.jpg"
      }
    ],
    "user_id": "MYMg0sIS7siycZgR42Cfhg"
  },
  "9LhNjnBW17e7cxiIUhCxYA": {
    "date": "7/3/2018",
    "text": "Not great. We went for dinner and the restaurant wasn't very busy. We sat, ordered, and then had to wait 45 minutes for the food to come out to the table. Once we got the food we had to ask for silverware and napkins because the table seating 4 people only had 2 forks and 2 napkins. The food was not terrible but not great. The red chili beef plate had very little meat in it and the tacos were tiny. I wouldn't be as mad about this if they charged $6/plate instead of the $10/plate on the menu. When it came time to pay I told the checkout girl about our service and there were 3 employees standing behind the counter. I told them about our poor service and they just looked at me and finished ringing me up in silence. For reference, this is my first yelp review. I would not have complained if someone would have apologized or at least tried to acknowledge what I said at checkout. I came straight home and registered for Yelp just so I could write this review.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ksepvBGoUidlOU5tCmthcg"
  },
  "icBpvJiu-X02im147UcxWQ": {
    "date": "10/19/2016",
    "text": "Had the following: Gollo, green style, with egg on top Machaca, chimichanga style, rice and beans Kids tostada, rice and beans Flour crisp with green Chile and pork All the food was tasty, authentic, homemade taste.  I would recommend the chimichanga style, I just prefer chimi style vs enchilada style.   Service? Impeccable! I havn't had service like this in A LOONG time. Good food, good people, good night!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "MjqNt7dwy02S_bYHVWUCvQ"
  },
  "RtlfLMCxiD4mfwIsaoWgRw": {
    "date": "12/16/2017",
    "text": "Their green chili burritos are to die for. SOOOO GOOD. I had one from their food truck at an event and i absolutely loved it. I seriously could have eaten another one. I made sure that i knew where their physical location was so that i could go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NO4b6URqVme9WTyC9DehmA"
  },
  "DMyu79cTwRLpIaKhuoZ5kg": {
    "date": "10/19/2017",
    "text": "First timer.  I took my granddaughter to the bathroom and when we went to wash her hands I noticed the sink handle was laying in the sink.  We had to pick it up and pot it back on to use.  We then got seated and noticed the charge extra for seconds on chips.  Was not to happy about that.  Chips and salsa were good.  I order the cheese enchilada, beef taco and rice and beans.  I must say the rice and beans were delicious.  Red enchiladas and beef taco were just ok. I think this place was overpriced for the portion of food.  Over all the service was good fast and efficient.  I might go back to try the green burro.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bYo2hXBNEtKO4vC56_bbig"
  },
  "wCU7Jy3ljcrLZEWvnRHUBA": {
    "date": "6/23/2017",
    "text": "I was not impressed at all by the food that I ordered from their menu. I had the green chili which had more fat the meat on it. The hot sauce was average, nothing special. The beans were watery and not tasteful. I would not recommend this restaurant to anybody.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_y1OAkgcj2FjxKyxCEO7dQ"
  },
  "Udjjxx9w7medd3vq68F_sA": {
    "date": "6/6/2018",
    "text": "My favorite Mexican Restaurant..Best food for the price...I love the green Chile burrito enchilada style or the bean and cheese enchilada style..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gDQbKrM2TV8e4k1hsswNRA"
  },
  "NOopb6qdk5xpvboqSziCiA": {
    "date": "9/19/2013",
    "text": "I ate here yesterday and I have food poisoning today. Enough said.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q6Dcxo3_lNCzkqK7J3FL7A"
  },
  "8pRbGECfpCGW1KhrDxRF-g": {
    "date": "3/13/2016",
    "text": "Such good authentic Mexican food!!!  Are kids loved it salsa is awesome and the service was A++++ will go there again when in town!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-MPB2Le0TXOoOcAY_kKNpQ"
  },
  "5eq2T4r9P7OaSnuaQWp7KA": {
    "date": "6/4/2016",
    "text": "The service here was stellar! Honestly the service was the best part. The food was good, but not great...and the environment was less than classy. The Relleno was the best part. The vibe was almost too mom and pop.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dt-1bOZt4PbXdelDf-hmhg"
  },
  "d69fNV4RnX4ubDTwQJO5Ew": {
    "date": "1/6/2016",
    "text": "I downgraded my review. I  had to wait 30 minutes for a to go order that was simply nothing flashy chicken cheese rice and beef. I had to wait 10 minutes for my order to even be taken not once did they say it would be long or what was going on then when I got the food there were no utensils what was I supposed to do eat with my hands?!?! They say first impressions are everything which made me return unfortunately it was my second visit that will be my last",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DY8ZMhYITFe_xZgS-EOHiQ"
  },
  "hBI5j9liZK-Uym_4SBaNwg": {
    "date": "7/3/2013",
    "text": "- My service was outstanding! - Food was really good (tried both the red chili and green chili; both good ... but the green chili was awesome!) - Margaritas were great. - Atmosphere was more of a local dive.  If you are looking for a classy Mexican dinner, this is not the place.  However, if you are looking for good Mexican food, with good margaritas in a local joint, this is the place for you.  When I arrived (by myself as I was in Phoenix on business), I was promptly seated.  I was quickly greeted by a gentleman with chips, salsa, and water.  Then, quickly by my waitress who was super nice and took great care of me the whole evening.  I explained to her that I had never been there before and ask for her recommendations.  She shared her favorites but said before I make my decision, I should try both the red chili and the green chile.  She scurried off to the kitchen and came back with two small bowls so I could try each.  The red chili was really good; but I had to agree with her that the green sauce was killer!  I ended up having a burro with green chili and whole beans with a side of  refried beans and a margarita.  Everything was fantastic.   Great food,  great margaritas, great service.  I think they would be a good candidate for Triple D.  I'll be back!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "nDLGtZvrM9M4ePd-8RAJ1Q"
  },
  "T63c4eK_n7xK_zOd_i_5cQ": {
    "date": "9/29/2014",
    "text": "I've been eating there since the 1980's and probably go there almost every week. WARNING: The food is very addicting-go at your own risk!  In other words, it's my favorite Mexican food place of all time.  The staff is friendly, service is good. The most authentic food in Arizona.  I think I'll have my birthday party there....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cCt2gPa3EzQpX-frXmf3hw"
  },
  "MJ610MohMwykikr-rtAh4A": {
    "date": "8/23/2013",
    "text": "Best Beans in the world! My family has been eating here since the 1954 in globe. And it hasn't change from the friendliness to the amazing food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EPvypDHpjoITWcPLdWzu5g",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. Just amazing bean burros!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EPvypDHpjoITWcPLdWzu5g/o.jpg"
      }
    ],
    "user_id": "cB_m6Z9ZqJdvT5TyPLxJyQ"
  },
  "Elr_8tmdccCazYIxd3APFg": {
    "date": "6/3/2013",
    "text": "This is a cry for help. I feel like this place is destined to be a place on restaurant impossible. From the start there were issues. We waited at the front to be seated for several minutes while there were only a couple tables filled. I think there were only 2 servers working which was clearly understaffed but also seemed like its probably normal.  The food was bad. As in, my chile relleno tasted ROTTEN. It was filled with some gross greasy cheese mess and had doubly greasy batter that it was fried in. I honestly wouldn't have fed this to a pig. I probably have more to say but I feel that any more effort is unnecessary and would be a lost cause.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "n9-XwgSU74qTFdTCN5oreQ"
  },
  "zwUFeVRI8gAKJ5S_7dhsaQ": {
    "date": "8/14/2013",
    "text": "I won't hesitate to call Casa Reynoso the best Mexican Food in Arizona. My orders are always delicious and I am a long-time customer. My favorite dishes are their tacos, bean burritos and green chile. As far as sides go, the rice and beans are outstanding.  Along with their excellent food, their service is top notch. If you enjoy Mexican food, you need to give this place a try!  P.S. Don't forget to order a cheese crisp!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8vg-9wN_crOa_hPd04G4sw"
  },
  "yCErPykWxE2FKESvNAUrOA": {
    "date": "8/13/2015",
    "text": "Had the gollo burro...it was amazing. Take the chance a go in. The place looks run down, but you won't regret going in and trying. I will definitely be back and it is going to be hard to try something else after having that burrito.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3faXdPRrysF44UGV6SdW3Q"
  },
  "zd-dxTP_s4PKh5c5pq_Caw": {
    "date": "6/7/2013",
    "text": "The food here is very good and is reminiscent of that in older South Eastern areas of Arizona. I grew up in Globe and love the food here as it reminds me of my youth and my hometown. If you aren't in a big hurry I would recommend anything with the enchilada sauce on it (best I've had) and the tacos are great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Bmt9x2gWpOYuj5NXceftg"
  },
  "c-jU_srF6w51WvQDOWXihg": {
    "date": "8/24/2015",
    "text": "My favorite restaurant hands down.  Gollo burro and taco are to die for!  My kids love the red mix and green mix burros.  Convenient to get to just off the Superstition Freeway at Mill Ave and plenty of parking  too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "paNfQfcwlqLWUHGl1rJwlA"
  },
  "mzF1rxy3SsNkWIppX4CdJQ": {
    "date": "10/12/2016",
    "text": "Hands down the best Mexican restaurant I've ever eaten at. Homemade Mexican food is my favorite. But the last cuisine I want to eat when going out to eat is Mexican. This place change everything for me. Usually request Darian. Sorry if I spelled that wrong buddy. He is Extremely knowledgeable about the menu. Went in this past Saturday kinda late. Nothing changed. Perfect service. Forgot her name, she was extremely helpful guiding us through the menu. Brought in 3 first timers with me. They all loved it. Even being there around close we treated like it was 7pm. Keep doing what you're doing Casa Reynoso! I plan on bringing as many ppl as I can.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bc1XPkeOnoXzoj9LG8hS3g"
  },
  "XbWbiqrDCViXxsihGfFkxw": {
    "date": "12/13/2016",
    "text": "My boyfriend and I eat here regularly and we always enjoy the food! Authentic Mexican food is something we are always looking for!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5KqcTuC0N2Wm6llZr8QJuQ"
  },
  "1r6BkMaY7eEYFwQmpJz8wg": {
    "date": "11/9/2015",
    "text": "Yummy!! Much like craving Chick-fil-la on Sundays, you'll crave this on Mondays when they're closed! Appreciate family owed businesses honoring tradition & family time. Great eats & very friendly staff. Quick lunchtime turnaround too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0bfuwwdT797Sb6g5o7h_Cg"
  },
  "wQa7OzBx96ngPAuPy4bTGw": {
    "date": "7/6/2016",
    "text": "Best mexican food in Arizona. Love the BEAN BURROS ENCHILADA STYLE!!! Great family service & great owners. Can't say enough. Bean Burros forever!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NLGqMI40U02BJ7BtfIPwIA"
  },
  "-vroGUpbz5anT7c7dEH8yw": {
    "date": "12/6/2014",
    "text": "I've been coming here since I was in dipes. I eat here at least twice a month. Sometimes lunch, sometimes dinner, never on Mondays. My dad lives in Washington state and when he comes to visit, he literally goes from the airport directly here. I always get the enchilada/taco combo. Prices are great, food is excellent. The salsa is amazing, with a nice kick. My girlfriend actually doesn't like the enchilada sauce here because it clearly has cinnamon in it and apparently that's not her thing. The only thing I can say I don't like is that the taco has the cheese on the outside of the shell. ?? Weird. Yeah, the place is old, but so what? My grandmas place is old, too, but the best food I've ever had came out of her kitchen. Don't judge a book by its cover! Or, do, more for me.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "WsdITNStlCbB0rOopVukQw"
  },
  "92OHcfCAL8S7wAtBRlxa2Q": {
    "date": "11/26/2017",
    "text": "I have been a Tempe homeowner for 25 years and live 1 block from this restaurant. My wife and I get a craving for Mexican food and a south/border atmosphere about once a month - yet we NEVER go to Casa Reynoso. We'd rather drive a few miles to a more updated and festive place than put up with this mess just because it's close-by. We want to like CR and wander in every few years to see if things have changed, but the place disappoints each and every time and on just about every level. Where to begin: the food is anywhere from inedible to average. Get ready for an outdated menu and food that was made with zero love and delivered by a wait staff that are either rude or just young and inexperienced or both. They act like they're doing YOU a favor by just being there. The seats are uncomfortable, the interior has not been cleaned or updated since the late '70's, and the water stinks. And someone needs to tell them that one huge attraction for a Mexican restaurant is the bar. A fun, aesthetically-pleasing place to have a few beers or marg and watch a game. This bar is a joke and where good times go to die. To begin with, the bar is lined with mirrors all the way around (70's anyone.?) with not a window in sight. No music, dreary, boring, and box-like - not a place I want to spend my time or money. Actually, this place MAKES you want to drink! There's never anyone in the bar - I mean patrons or a bartender - and half the time, the bar itself is used as a dumping ground for dirty dishes. Instant about-face. On top of all that, they offer No Happy Hour. None. Zero. Buh-bye.. In short, Casa Reynoso is a total bust and you could get more festive making tacos in your room at the Pioneer Motor Lodge at 2 in the morning. Historic Tempe.? More like historically indifferent to quality food and caring about.. well, anything. They aim low and hit their mark every time. Avoid this place and give your money to a taco joint that deserves it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4VpaC3qmxtWfhQ_y3y75BA"
  },
  "eqFmCeQ0vgY8L99APymeWg": {
    "date": "6/28/2015",
    "text": "Exactly what the 2 star rating stands for ... \"Meh.  I've experienced better.\"  Old inside, but think like you're in someone's home. Free chips/salsa.  Chips need salt.  Decent general salsa. Order guacamole and asked if it was fresh.  We were told yes.  If it is it's heavily mixed with lots of mayo or something. Dark meat shredded chicken in burrito.  We all ate ... it was all decent.  But we'll try somewhere else next visit to the area. Oh, and service was sloooooow for main course.  Be ready for that.   Extra $3.00 for beans and rice.  I'd rather it be included.  I hate ordering as a side.  All mexican food should come with beans and rice!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "hXKjFLkrPJ_MBQ1yX-dimg"
  },
  "i3-z17hm5V6BbsTBCggTGA": {
    "date": "3/22/2015",
    "text": "Don't believe the hype. This place is a dump. The service  is horrible. No refills on the small glasses of water...warm beer..small plate of chips...waitress answered her own phone when serving us the plates. Mushy pre- made tacos...rice was 3 days old. Prices are fine but you get a better meal at taco bell. Not kidding. Trust me you will be dissapointed. It's terrible. No quality Mexican places in tempe....",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FINv81YUWGDVD8Q7oruERQ"
  },
  "E0TiDHUNaSnNHOZx35-R6w": {
    "date": "5/10/2018",
    "text": "Our bill was $40 for two lunch specials and two sodas - overpriced for the quality and atmosphere. The chicken enchilada had hardly any chicken except for a few small pieces that looked like ground chicken with pepper. It was bland. We ordered one meal very specifically with no cheese due to a food allergy but it still came with cheese, then took forever to be remade correctly as ordered, after the other meal had been finished.  The visit to the bathroom was an experience in itself. To get there you walk through an empty (at lunch) lounge that is a time capsule from the 70's which might of been cool had it not had the stale smoky smell of my first crummy apartment. After you cross the room, you open an old door that leads two more doors to the bathroom. It was an odd location and a little scary being over there all by myself.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S98qBQDBu6VnZVy6U-nquQ"
  },
  "TQZaE5tJ_nTUQTy_XZpMtQ": {
    "date": "10/6/2018",
    "text": "Came here to celebrate my awesome nephew Aaron's birthday. We waited for over an hour for our food. The food was ok and when my husband asked our waitress what the hold up was he was blown off. Then he asked for a manager and was told that there was none but two people in charge. We told the cashier the waitress didn't earn a gratuity but it was still put on our bill. There was NO apologies given. In fact we were told that we requested to wait. Which is True but ONLY for 20 minutes not over an hour. And there was a member of the staff that went to the restroom and didn't wash his hands. So gross and disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JUQW_MxY_qt68Z4AnYFhKw"
  },
  "Om6w3Dafm8izHnhihOkSaw": {
    "date": "2/21/2016",
    "text": "Went here on a recent business trip where I was in charge of finding a good mexican restaurant because I was the only one that lived in the southwest.  Yelp did NOT let me down, nor my fellow yelpers.  I chose this place on reviews/ratings alone.  Located in a strip mall, it is your basic seated/table service restaurant on the inside with old pics of the family (I am guessing) on the wall.  There were four of us... one from Florida, one from Indiana, one from Illinois and me... from Tucson.  All of us LOVED our meals and the only reason I am not giving this place five stars is because the service was really lacking.  We got here expecting a wait, but oddly it was not that busy in the dining room yet there were a bunch of people waiting for tables.  If I had to guess we came on a night when one or two people that worked here called out because they were obviously really short handed with servers taking care of 10 tables at a time.  The upside - despite being chaotic for the two servers -- they were super friendly and did their best.  The food was wonderful, I had the 'special' that everyone raved about in the reviews  the \"Gollo Burro\" with red sauce on top.  Actually three of the four of us had it.  It was everything I had dreamed it would be and if I ever get back to Casa Reynoso it is exactly what I will order!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ecpHNebGnzTV6fgbYWws4w",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. golla burro enchilada style red sauce",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ecpHNebGnzTV6fgbYWws4w/o.jpg"
      }
    ],
    "user_id": "0yrF14nWVAFeI0fG29a63g"
  },
  "NS8HBKJUurSTcvAN6x9UDg": {
    "date": "8/17/2018",
    "text": "Best mexican food in Tempe cheese crisp with green chilies was amazing hands down best menudo in Tempe and the service was wonderful our server was the nicest lady and made our visit that much more enjoyable",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CX0q23wjRoSeqJ1ddKUE_g"
  },
  "mmr6ZBZdsO_Mq-l4J41IGA": {
    "date": "1/5/2017",
    "text": "This burro here with the bean & cheese smothered in enchilada sauce is in the places of must eats before anyone leaves Phoenix. I'm not convinced that the author of the Thrillist article Amy Silverman got the same salty dish filled with more salt than I've witnessed in any dish, if memory serves me correctly.   Although the service was very warm & inviting, & we (fiancee & I) felt very welcomed here.   The chips & salsa were decent but had weird wet pinkish paper on the chip bowl. Wow! See attached picture. Second faux pas.  I understand that salt is one of the most underrated ingredients in preparing food, & most amateur chefs seldom salt foods correctly, but this was beyond salty.   The mining town where the original location of Casa Reyneso is must be a secret salt mine because that's the only reason why the kitchen would want to use up so much salt in their enchilada, orrrrrrr perhaps it's just too hot here as Arizonians bake up dry & lose a lot of salt from their own skin!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "7IQbx_gLNsKrtz9t5l_lkw",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. Wet pinkish artificial sweetener paper in the chip bowl. Second faux pas. First one was the over salted food.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7IQbx_gLNsKrtz9t5l_lkw/o.jpg"
      }
    ],
    "user_id": "joxsgw7JvT33Xfr1CafgMw"
  },
  "xWdzRWz8Tkyw1-xbJmRNjg": {
    "date": "9/23/2016",
    "text": "Did you bother to read the review?  So busy being defensive and passive aggressive you completely missed the point. In my opinion (and, coincidentally, my friend) we didn't like your food.  Our opinion.  Being an a$$ doesn't change my opinion.    And fat shaming?  In a time when discrimination is running rampant in our country you want to drag that into things? Becuse you got a well deserved low rating?  Very lame and unoriginal of you.  Keep your hate to yourself.  P.s. use the time you are taking writing petty revenge messages and use them to bettering your crappy restaurant.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 10,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "wyI9RMk4cfG8vkzdHl66QQ",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. Wow",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wyI9RMk4cfG8vkzdHl66QQ/o.jpg"
      }
    ],
    "user_id": "VB2loWbY1kSglVpMki90oA"
  },
  "R_R7QquM-deusucyrcxHpw": {
    "date": "9/18/2016",
    "text": "It's probably been 20 years since I've come to this restaurant and I have to say I left beyond disappointed. We literally waited 35 minutes for our meals, and although they were hot; they were mediocre at best. We ordered a #1 and #10. The tacos were super greasy, and had no flavor. The chips and enchiladas are made from corn, which is authentic however that's all you taste. The beans were runny and the rice was very dry like it was under a heat lamp too long. See photo.  The problem was our server never came back to check on us, refill drinks etc. The manager refilled our drinks but that was before our food came out.   When we were cashing out, the gal asked how was everything and we said we didn't really enjoy it. We didn't make a big deal, but  instead of getting a manager or ask what was wrong. The gal said \"well you are entitled to your opinion\"..and we paid the bill. This as a sweet younger gal and I'm assuming a relative who's working here and just didn't know how to respond.   Truth is, I really want to like this place for being a staple in Tempe history but I just can't. There's lots of great authentic Mexican places and this place is just a no go for us.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "rZUZRxXma03sUjxesjPjdQ",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. Greasy taco, runny beans, dry rice...kinda  disappointing.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rZUZRxXma03sUjxesjPjdQ/o.jpg"
      },
      {
        "img_id": "3PDNWC6_5PSZhwpOsa3Wig",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. Super greasy taco, not much beef or lettuce, etc inside.  :(",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3PDNWC6_5PSZhwpOsa3Wig/o.jpg"
      }
    ],
    "user_id": "sWeg9ffWlhbxgaGBuPqgCw"
  },
  "Lcg7rg1HgSPpntBmVUmX8Q": {
    "date": "7/7/2018",
    "text": "Awesome dinner and customer service!! Had a delicious chimi. I'll be back there next time I'm in town!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kg-NS2FkAS9ze8Ao0iZYPA"
  },
  "fwYNoPlVLRJv9V93pauxkw": {
    "date": "1/5/2019",
    "text": "If you want authentic tasting Mexican food this is the best.   Menudo to die for and the bowl of gallo green chili bowl.  It's like being at home.  The owner is so kind you feel like family . Such an awesome place to eat.  So recommend it !!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "shyA8p5TzuCdGtYbllBedg"
  },
  "vFUJ8K4XCtZe_eOVlfip8Q": {
    "date": "10/8/2017",
    "text": "Jalapeno cheese crisp, Albondiga soup, chicken tacos and chimi-style  bean burrito are a MUST!!! Family owned that make you feel like family!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KjvJx-lLi0dAH861bFRUgA"
  },
  "wiUlRwFeSOCzPwrAb9oSVA": {
    "date": "10/19/2017",
    "text": "The BEANS. They are the best I've ever had!!!!!!!! Their chip & salsa. Whaaaaaaaaaaaaaat. Chips are different & unexpected for the USA, but  still terrific. They taste like Mexico. And their salsa. OMG Amazing",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HGlZhRateCaYxlflKR0LbQ"
  },
  "LT2wkR3fuAn-t2en8BYw6g": {
    "date": "4/10/2018",
    "text": "Our waitress was fantastic! First, hostess said 10-15 min wait and then when we didn't go into the bar, we were seated on ~2 min in a mostly empty section of the restaurant.  Food was so-so.  Salsa was so runny it wouldn't stay on the chips. Chips were cold and greasy. Enchiladas machaca were a few pieces of cubed beef on top of the enchilada.  Enchiladas verde were great.  Wouldn't go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3DRNRWd1stkxWR63752wAg"
  },
  "APZhcb-yHljfX4bAnRrang": {
    "date": "10/24/2017",
    "text": "This was not good. Hoping for authentic Mexican and got this green mush for 3$. Do not recommend",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cy7WsWCImJ7QWSJQax4zjA",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cy7WsWCImJ7QWSJQax4zjA/o.jpg"
      }
    ],
    "user_id": "T8jIEafO1NzE3KByjN0TkA"
  },
  "5u-OXySfX6KgosvuSlPESA": {
    "date": "2/17/2017",
    "text": "Nice staff, excellent server and friendly bussers. Smelly building, like an old home, needs to be deep cleaned and renovated. Food was good. But the atmosphere and smell is enough to make me not come back.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "atMDkq8TRYMolfuCLNjx1w",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. 1 red 1 green chicken enchilada, one beef taco. Asked for lemons.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/atMDkq8TRYMolfuCLNjx1w/o.jpg"
      },
      {
        "img_id": "JeFGpeZAG6-e3MhBHqhJPg",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. 1 red 1 green chicken enchilada, one beef taco. Asked for lemons.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JeFGpeZAG6-e3MhBHqhJPg/o.jpg"
      }
    ],
    "user_id": "K2MoV_t0cXeDkMQBic2pDw"
  },
  "yMumWmlAvzQkc29FOLMhWw": {
    "date": "3/27/2018",
    "text": "Red enchilada sauce was some of the best I've ever had. A more mellow taste, lots of flavor but not bitter like other places I've tried. Chips and salsa were good but nothing amazing. The only down side is service is slow. The wait is worth it because the food is good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hu0Y9U_l5sEPdn9H10qdUg"
  },
  "vF1tEwmIu7p7n9N_7ScXfQ": {
    "date": "10/13/2017",
    "text": "The food and service is always on point! The fact that they're ALWAYS busy is proof that the food is amazing!! Try the Gollo Bowl or Burrito!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cCrZf_bwUGRaX1-Ytv2Fzw",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. Gollo bowl is the best! Love this place! Always busy and always friendly!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cCrZf_bwUGRaX1-Ytv2Fzw/o.jpg"
      }
    ],
    "user_id": "sOm4Ynug1qPFOF_dr-33mQ"
  },
  "oOulZC9rHjM8ti5xQAN9Iw": {
    "date": "2/13/2018",
    "text": "This is our regular Mexican spot with the family! We go there at least once a week! Their cheese crisp is amazing !! And I always get their green chili pork plate !! My husband and his family been going there for years . Yes they do get busy on the weekends so please be patient :) it's all worth it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g-_TsZNEJ_hls717NuGekw"
  },
  "xztlcTK-4pP_5cHtPvhVKg": {
    "date": "3/9/2018",
    "text": "Excellent food! Very friendly staff. The green chile sauce is fabulous. Order your burro enchilada style! Mouthwatering! They've been in business for over thirty years.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FVKAf_6mhvqXpQTzTMDwUg"
  },
  "wN533D_ZWIDJ_GjYVtxnww": {
    "date": "3/7/2018",
    "text": "Great place all-around for authentic Mexican food.  Went with the Enchilada-Relleno-Rice and Beans combo plate - did not disappoint.  Helpful, friendly, attentive service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZhZ8-BvOOpi8phYXhe8EYw"
  },
  "barkVPyrWy-dMldkFgPi-A": {
    "date": "7/9/2014",
    "text": "I ordered combination #6 - enchilada,   Chile Rellano, rice and beans.  Plate was SUpER hot.  Oven to table!  Chili Rellano was good!  A little greasy though!  Enchilada was good with a tasty red sauce!  Rice and beans were good too!  Chips might have been a day or two old.  Salsa was good with a touch of spiciness.  It was a bit thinner (vs chunky) than I prefer but still good.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uNmNPiBShY8tzVB0RJDgjg",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. #6",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uNmNPiBShY8tzVB0RJDgjg/o.jpg"
      },
      {
        "img_id": "Fousv0Bq1EcFgfG7VO8YXQ",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Fousv0Bq1EcFgfG7VO8YXQ/o.jpg"
      }
    ],
    "user_id": "1l_O3VEl9TV_JjKAzzyz0Q"
  },
  "soD8LPUHmlCJizt9eK7Dqw": {
    "date": "1/22/2012",
    "text": "This place is solid. They had great Tex-Mex cuisine, amazing service, and a comfortable, unpretentious atmosphere. I would give it five stars but it wasn't like their food was mind blowingly original, it was just really good. Well, then again, when I think about it, my mind was pretty blown by the salsa. They had ridiculously good salsa. I highly recommend this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nKiY1Jc1O3SKym71qmLV5w"
  },
  "pJn2KlEpvwx94nf6vGO68g": {
    "date": "7/17/2011",
    "text": "This is one of our favorite spots! Family owned business & food is excellent nearly every time. Prices are reasonable. Go there!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0mnW03wyqy8ENvsd2iHSMA"
  },
  "ehmBoEhqMnz2EvLghyr2hQ": {
    "date": "6/21/2011",
    "text": "Went here for lunch today..not bad. Like everyone else says its not super nice and a little slow. But the Chimichanga I had was good (nice and crispy but not dripping with grease) and it was cheap. We were able to go here for lunch and be back within an hour. I liked it and will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RuzYB1Kxtr32093DURZqVw"
  },
  "7cHTfgQyWp6DmcV6LKyxgw": {
    "date": "11/4/2012",
    "text": "Salsa is sooooooooo good! I got a cheese crisp to start, then a tostada. Delicious. Simply delicious. Watch out though, the plate will burn your hands...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oMP23bOBPL-ZwV8qRSx5gA"
  },
  "BKALDLpFxTn2or-PVNPevA": {
    "date": "11/1/2009",
    "text": "Boring, expensive, and now I know why I've not eaten here after 22 years in the valley.   The salsa and chips were the highlight. Enchilada tasted like nothing, enchilada sauce would have been better if it came out of a can, chili rellanos were OK, maybe less than OK. Prices were high for the quality and quantity. Do yourself a favor and visit Juan's instead.   Quite a crowd here for a Friday night, and why? El Rey in Globe has much better Mexican food, the rest of the Globe-Miami area isn't exactly a mecca of Mexican food so the review of best of Globe-Miami isn't a ringing endorsement.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cIxdWW7MVcUaj-SJ0pGkeA"
  },
  "lJ02OTPw2w_2GsAV6yCq-A": {
    "date": "10/20/2011",
    "text": "Very inexpensive, very cute southern Mexican style decor. The service was very slow, but the staff was friendly. Lacked in silverware. And the food was good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UCV4FPvdcLBeMXOWZ0pCKw"
  },
  "wXNcFPZcDGyjOzdWUOyQzA": {
    "date": "10/20/2013",
    "text": "food was expensive, service was a-ok. mediocore",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aK80tvcpSiHhk8_IeN2AMQ"
  },
  "p6AipaBJoZa8lya9R2NsQA": {
    "date": "6/13/2012",
    "text": "Went there the other night and it was very good.  I had the burro with green sauce and it was great. The others had enchladas and said they were also very good.  The resturant is very clean.  It is tucked into the corner of the Fry's plaza so you have to look for it.  When you find it you will be back.  It is not one of the trendy places just good food at reasonable prices.The drinks were good size and tasty.   Service was excellent. The locals know about this place and recomend it.  I will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "rjX8f6CK_MUm71Mi5SpMVw"
  },
  "5pgy1XiCGskvza7baPfa8w": {
    "date": "12/6/2013",
    "text": "this place is right by my place so its an easy quick run to grab a bite. the food is good, however, not that authentic.... real mexican food doesnt call for cheddar cheese on enchiladas. very \"americanized\" food. still good though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JWPcKII-DokjJTNVBZ6Ykg"
  },
  "1dkpsaePE15HumtNpJxbMA": {
    "date": "7/6/2010",
    "text": "This is my favorite 'sonora styled' mexican food in the entire valley of the sun. Its family owned and operated by the same people that own La casita out of Mammoth and Globe, and the food is notoriously 'the best!\" Watch out on Friday nights as the teenagers pack it up, and they are closed on Mondays.  Try the number 8 combo for a perfect place consisting of a combinations burro, Chili Rejeno, and cheese Enchilada. MUI DELICIOUSO!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "X0hvB6BR4UQWmZ3c_0qMSQ"
  },
  "WcoRmnky4zqUciXH1Fu_oA": {
    "date": "1/7/2011",
    "text": "We went here somewhat often because we lived in the neighborhood. The food is alright. It's never too busy and the service is fast. Pretty cheap. Regular margaritas are small, so get the large.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aWNqcd3hSATns1ctsppjxA"
  },
  "fSwMYRGAiaoAT75C4aEELQ": {
    "date": "3/15/2011",
    "text": "It can be a little hard for first-timers to find, but once you do, you'll never forget the way back.  For me, this is hands down my favorite place for authentic Mexican food; not only here in Phoenix, but anywhere!  I routinely drive 30 miles one way just to get an enchilada combo plate with a taco or burro.  I have taken colleagues, clients, family members, out-of-town guests, and many friends to Casa Reynoso.  Every single one of them, including kids, have left full and rave about the food.  The family atmosphere really adds to the charm.  Their margarita's aren't too shabby either.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RzxdXEbz3Q2ptlDHG6NcjQ"
  },
  "YcT2EtU7SrK0_LdZYJ0Z5Q": {
    "date": "3/28/2011",
    "text": "the rating of 4 stars it is because of their green chili sauce/burro/enchilada etc... i love the chips and the beans.  I agree w/most the service is super slow and the place lacks light and it definitely needs a renovation badly!  their cups are super small - but once again i like their food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aAeaEERZFOE10FZxZ0K9SQ"
  },
  "U6hraYdAuuL6THUMePwbrQ": {
    "date": "10/4/2010",
    "text": "if you love and remember Don Jose's, you'll like this place.  the food is average and they do charge extra for chips and salsa (which is good and spicy!), but there's something about this place that keeps us coming back.   i finally tried the bean burro last night, and it is the reason for my Don Jose's reference. i have been searching for beans like that for years and i FOUND THEM HERE!!!!!!!!!!   in short, i've tried several things on the menu, the bean burro is by far my favorite with the joanne special a close second.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zp5B_Ar8sMudMG62UeLYMg"
  },
  "DDsP7hIbeTjMiJvahi-iNA": {
    "date": "1/5/2013",
    "text": "The Gollo Burro is delicious (I personally love it enchilada style)!  I order this every time I come here.  The green chili is also very flavorful.  As a Hispanic, I am very picky when it comes to Mexican food, and Casa Reynoso meets my high standards!  The staff is also very friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q2lh_2OL_FWB-GW55qLerg"
  },
  "7YG6TRknlo5YxD_gkAt57A": {
    "date": "12/21/2009",
    "text": "I'll be the first to admit, I haven't really had the best of luck with Mexican food in this town. For some strange reason, a lot of the restaurants that I've visited around here have really fallen short of my expectations, much less, they continued to prove to me that you CAN actually F something as simple as chicken up if you try hard enough (Manuel's, I'm looking at you!).  Needless to say, with my track record as of late I was a little hesitant when a friend of mine recommended that we do lunch at Casa Reynoso. Despite my initial hesitation, I'm glad I took his word for it because this place exceeded my expectations in almost every way. The location was low-key and unassuming, clean, and had your typical Mexican restaurant atmosphere (including the music accented with accordion...something I'll never really get). The hostess, who was exceptionally cute by the way, not only helped us to our table, but also did double duty as a cashier, and then rounded out the triple play as our server. The chips and salsa were good, although as other reviews have stated, they do charge you beyond the first bowl. Apparently I was feeling adventurous, since I ordered not one, but TWO chicken dishes...I had a combo plate with a chicken enchilada, a chicken taco, and double rice as I don't mess with beans. The meal was solid, my favorite part was the enchilada with big chunks of tender, white meat chicken on top. The enchilada sauce had a hint of brown sugar, as my friend pointed out, and was different but good. The taco was decent too, with a crunchy shell that wasn't soggy from grease like most other places. Our server kept our glasses full, but sadly, disappeared by the end of the meal. Perhaps they decided to have her try her hand in the kitchen as well... Nonetheless, a solid four star experience and I intend to return in the future.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "obchMlP16GFOlyCVp6Ruug"
  },
  "ZKnNFEQIx0JOwAFqu-T-TQ": {
    "date": "8/29/2013",
    "text": "Good family owned place! Our server was very good and understanding about my autistic daughter. Its awesome Mexican food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cdar95GuKZJBTkwE_fLzrA"
  },
  "wIFc-sb8JaON_t0PIN9qeg": {
    "date": "9/7/2008",
    "text": "Casa Reynoso is habit forming.  We come here at least once a week.  This is the best Mexican food that this native Arizonan has ever had.  Some of our favorites...bean burro enchilada style, beef tacos (I'm always wishing that I ordered two when I'm half way through my first), the gollo burro, machaca beef burro enchilada style, buttery homemade tortillas....Yum!  My only complaint is that they are not open on Mondays and sometimes I get a hankering for Mexican food on Mondays that cannot be satisfied elsewhere.   We love that it is family owned and that they all make us feel like we're part of the family.  Our favorite server is Erica - she had our order memorized after the first time.  The margaritas are tasty and the beer is cold!  The atmosphere is casual, the food is tasty and the prices are reasonable.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "M4tENbg6oHnNOZWHipRgfQ"
  },
  "5go91WvrgMxiygyBnDgDmQ": {
    "date": "4/25/2013",
    "text": "Hands down, this family owned and operated restaurant offers authentic Mexican/American food.  I visit often and order the 1/3 plate, with green chile, beans and rice.  Their tortillas are handmade daily and served buttered, so they always taste fresh.  This place reminds me of my grandmother's cooking, I have not found anything better outside my grandma's house.  I always order their house margarita, which is good.  The family runs this restaurant, so you have younger generations serving and greeting next to older generations.  The service is slower than a typical chain restaurants, so you do have to make sure to carve some time out of your schedule to stop and enjoy.  The food makes up for the slow service.  They are very friendly and by now they know my family by name and are always happy to see us.  The place is very dark inside, no natural light and the decor is a bit outdated.  It is a family friendly restaurant that can accommodate large parties, which we appreciate, having a large family.  Sundays are always busy from open to close, so we like to visit during the week or on a Friday night.  This is a place we frequent because simply we have not found anything that compares to it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rBgbguLT0dt6vmlwKhZzIg"
  },
  "uIMKmoJAaTRu2aJ8su32aQ": {
    "date": "4/10/2013",
    "text": "Best Mexican food in Arizona!!! I have been going to this family owned restaurant for years upon years and their food and service never cease to amaze me. Their refried beans are homemade and melt in your mouth...but who I am kidding, all of their food is delicious; from their enchiladas and tacos to their cheese crisps and fried icecream. Nothing like a mom and pop restaurant! Reynosos will always have my heart!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aXQQFlybJbiYlL6j9EEJRw"
  },
  "nZidZYQnwRRr-vZSKK8ikg": {
    "date": "5/9/2013",
    "text": "Been here twice so far.    Best: - Salsa is addictive,  much spicier than anywhere else around,  which I love.  -Enchilada sauce is great as well.  -They are fairly cheap.   Worst: -The service is soooooo slooooooow. It takes forever for them to take your order or bring your food out.  The first time we went we were there over an hour.  -The food is not that great in my opinion,  Serranos is much better & faster.  -The decor is awful!    Overall I don't think I would go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n0fUZqBOTPnILQsaewgt1Q"
  },
  "JbBps8zX7dQemIuF0ExzaQ": {
    "date": "3/10/2012",
    "text": "Like everyone else said...try the green chile on anything. I'd eat it off of my shoe. Authentic style. NICE staff. Pork was fall apart tender in the burrito. A-OK.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "U-TB3j6X8DU6_YiCCnbuFw"
  },
  "pvid0SMve41VCAwg4U41JA": {
    "date": "4/7/2015",
    "text": "This is a great place.  Reminds me of the good food I got in mexico.  The service was polite and fast.  Even though it was packed.   The burros were wonderful.  My friends who claimed to not like Mexican food loved the food here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MoIC_RGTfjajBGKzgTg0Yw"
  },
  "hUH8o020k5yHQ7Qc3MESnQ": {
    "date": "3/24/2015",
    "text": "This place has the most authentic and delicious food and it is so reasonably priced. I love coming here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xj1u2t9xXrbX2OtZI58InQ"
  },
  "xyqil7wH5juFnTeZXeUYBw": {
    "date": "12/30/2011",
    "text": "This place isn't bad. It's not the pinnacle of Mexican food, nor is it formal dining. It's just there, family owned and operated. My fiancee and I are regulars and after going there with her parents enough times they are now regulars too.   My dad used to take me here a lot as a kid, 20+ years ago. So that has to say something if they've hung in there that long. Don't expect healthy cuisine, but then again that's not what I go here for. It's just regular, home cooked Mexican. Joanne (runs the kitchen to my knowledge & is the owner/co-owner) makes some mean grub. It hits the spot just right when you want some thing without paying over the top.  And please, if anyone else reviews this, don't dare compare it to a crappy chain like Chili's, this is way more authentic. This place is well above the par in food quality compared to these places. They are consistent too, which is hard to find sometimes.   Pros:  Cost is good, food is good, salsa is awesome. I particularly recommend the tacos, red mix burro and Gollo burro. The rice is good and the beans are pretty solid too. It is greasy, but that's okay with me.   Cons:  Kids. Lots of them sometimes, but what do you expect from a family oriented restaurant. Get there early Friday and Saturday nights, they are usually pretty full and it's not a huge restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "HCdrklIvjrfvEaCmym5wkQ"
  },
  "t-zJiR1PVUxUSw5ErECB-Q": {
    "date": "2/26/2013",
    "text": "Terrible food.  If you're looking for nasty variety Sonoran food, then this is the place for you.  I could deal with the 80's decor, the mediocre margarita, the meh chips and salsa (super watery).   With runny beans (my fav), an enchilada sauce that was blah, and an inedible tostada I pretty much reached my limit.  My boyfriend's green chile tamales were comparable to eating a sponge.  Suffice it to say, if left to sit for 10 minutes, one could have eaten their dinner with a straw.  Don't bother.  You would be better off at Chipotle.  Apologies to our waitress, she was nice enough but didn't make up for the awful food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mGrfc8zfV0N5h3RPvyLG7w"
  },
  "1H1Zm07sjHpKxTny66WcIg": {
    "date": "2/25/2013",
    "text": "Service was a bit spotty, but I don't think they expected to be slammed right at 11am on a Sunday.  It took a VERY long time to get the check, we were there for nearly 90 minutes, but, since we weren't in a rush it wasn't a big deal.  The green chili quesadilla is the BEST EVER, just make sure they use green chili (as in meat) instead of green chiles.  It took a while to get it to our table since the chili was still being made, but the flavor was out of this world!  There was a smoky grilled flavor that I've never had on any other dish which just sent it out of the world.    Gollo Burro, chili verde, enchilada style.  You need NOTHING else.  I ordered that and my table was eating off of my plate instead of enjoying their food--it was that good.  Machaca burro is also extremely tasty.    Hooray for a local, family run restaurant.  You will NOT find queso dip, pollo fundito, or any of those 'Mexican chain gang' restaurant foods here.  This is simple, hearty food and you can tell they love what they do by the quality and taste in each dish.  Returning soon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qk-FFxT6Z0bNfw4mTCtvtQ"
  },
  "iRLBUQStwnIezpzHsOuCWg": {
    "date": "2/23/2007",
    "text": "If i could give this place a gazillion stars i would... the service is spotty, and the decor is nothing special, but my god the food is to die for if you like authentic, bad for you Mexican food. the family that owns this place is from Globe, and i hear that city is known for some damn good mexi food (other than that it's pretty much a dump).  when i walk in this joint, it smells like my grandmother's kitchen, and that makes my mouth start watering on the spot. the refried beans are unbelievable and the tortillas are huge, with the brown spots on them that let you know their homemade in house. (p.s., if you don't know, Mexican food is supposed to be made with lard, so if you're vegan, be wary of this spot, because this is def a lard-use mexi joint)  i keep it simple with a red tamale and a bean and cheese burrito. the price is on par with a place like Macayo's. $8 for the plates that would have say, two tacos and beans and rice. and single items range from $3.99 and up. be warned, the first bowl of chips is free, \"thereafter you pay.\" i know that's lame, but what can you do? they have the food equivalent of crack and they know it. i seriously love this joint!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "HhVNG_1NOEyxfxudd6TSCg"
  },
  "GscLsU1ImDUWU-B05AolaA": {
    "date": "4/21/2012",
    "text": "Recently my husband and I were on our way to an appointment, and in need of dinner and having about an hour to kill, we decided to try Casa Reynoso since we see it every time we shop at the Fry's grocery store located in the same strip.  I was interested to see if this family-owned place had decent Mexican food.  Having been raised on New Mexico-style Mexican food, I am always on the hunt for food that tastes like Grandma's.    Casa Reynoso was just ok.  The decor is dated and slightly dingey, but I never judge a restaurant on their decor, it is the service and food that matter, so let's get to that:  -The service was decent.  The waitress seemed to be in a hurry and no one was smiling.  The place wasn't very busy, but we had to wait a while to get our drinks and small little basket of chips and cup of bland, watery salsa.     -The food quality was just ok.  Nothing outstanding in my book.  I ordered the taco, enchilada, and relleno combination plate with rice and beans.  The rice and beans were probably the best thing I ate there.  The beans had great flavor and not too much salt, and the rice was cooked perfectly, also with lots of flavor.  It's difficult mess up a standard fried beef taco, and the one I had was the same as any other taco you'll get on a combination plate at any Mexican place.  The relleno was also ok, but not a lot of flavor and too much egg.  The enchilada was your regular old cheese rolled into a tortilla and smothered in cheese and enchilada sauce.  The sauce was absolutely disgusting and I ended up only eating a bite of the enchilada.  I will say that I appreciate that they didn't mask the blandness of the food by absolutely suffocating it in cheese.  The food was so mediocre that I don't even remember what my husband ordered, and he definitely didn't rave about it.  Overall, I wouldn't jump to recommend this place to anyone.  The food is mediocre, the staff didn't seem to care, and honestly, we could have gone around the corner to Riva's and gotten better food at their drive-through.    Of course, I love to give second chances, and I would love to see more family-owned Mexican restaurants thrive in tempe.  A couple of other reviewers recommended the green chili and burritos.  I will have to try those next time, but I don't really have high expectations for this place and probably won't be going back any time soon.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FtAV7wSo0rWGaQ9YQTH7Jg"
  },
  "AhWm4KQaBzP0OMCm3SlOEA": {
    "date": "8/25/2012",
    "text": "Tried this place tonight because husband loves it.  I, however, did not like it.  Food was gross.  The fried ice cream was good.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZE2_VhRyEfu5MyuEO2kwsw"
  },
  "0nmwLaBM3a2whDy5OU4nSw": {
    "date": "3/15/2014",
    "text": "1st time stopping by CR, oh boy was it a doozy.  to go ordered a gollo burro (pretty tasty) and a machaca taco also very tasty.  food came out in an 8'' x 4'' to go box, for some reason my immediate response was \"um how can a burro&a taco be in one container?\" most places will place them separately rather than in one container. ok so got in the car, opened container and was just underwhelmed by the portion size considering my bill was $10.13. on top of that, there was no cheese on the taco like there was supposed to! maybe that's why they were able to get it out so quickly, slap ingredients together roll it up package it and get it out without quality control before the customer receives it.  walked back in and asked if cheese was supposed to be in tacos, couple employees said yes but by that time I just had been shown enough I just said whatever and left.   after returning home, ate the food and again it was tasty but just didn't feel like I received a good value commiserate to what I paid for. maybe I went off the deep end? who knows, but I called and asked to speak to a manager/supervisor to explain and offer my 1st impressions of CR. well that was a mistake, young lady got on the line and got pretty defensive instead of just listening and asking how things could improve and inviting me back for a second visit she just went off a little bit saying Americans are obese so it's a good thing their portions are not bigger, then saying they were not Garcias or other Mexican places around the valley how it's homemade etc. when I asked how old she was, said that was not relevant to the conversation I only asked because I could tell she just didn't have enough customer service experience to deal with the situation.  food is 3 1/2 stars service as noted above 2 stars. just a not so good 1st impression is all, I would consider going back as it's not far from me.  **oh and why can eat in diners get a free serving of chips, yet take out cannot? they even gave me salsa with my order. just seems like a place that has been around a long time so being objective and asking how could they improve just doesn't seem to happen.  ***oh and btw your relatives places in Globe give bigger portions and are just as good if not better than CR, I will definitely give those places my business again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qpj2J6XanoTasRf9CpvnGA"
  },
  "_3tnx5zbm0CC1viK45D5VA": {
    "date": "4/3/2015",
    "text": "Went in yesterday for dinner.  The waitress took my order but after 25 minutes, no dinner.  Asked about it and was told that it would be \"right out\".  Left 5 minutes later.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nc5QAHOdyCRSE3dMe_Ry_g"
  },
  "PT8hACArVew4To_9PZkJWw": {
    "date": "6/25/2008",
    "text": "Went here for dinner last night with a family friend in from out of town and a few others. This used to be one of her favorites when she lived here.  It's homey. It's old school. The menu is far more limited than your average Mexican joint. And I have had everything at least a little better somewhere else. No one raved (or even commented) about their food except for the cheese crisp we shared and her chile relleno. Oh, and they raved about the cheesecake I made and brought in for my friend, of course. Even the waitresses begged for a piece, which doesn't speak well for their own desserts.  Service was fine and our drinks were constantly filled. We might return if we find ourselves across the street at Pets Inc and hungry for Mexican.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "NjLRgbRZiwEIMpAgXypJtw"
  },
  "QzLLeHZry9_XkdtjYsQPiQ": {
    "date": "3/14/2007",
    "text": "After reading Lauren's review, I made it a plan to go to Casa Reynoso.  It was totally worth the trip.  This is one of those restaurants that looks like it's been there longer than the rest of the strip mall.  Tucked in a corner of the complex with a big wooden door, you definitely know this isn't your standard strip mall spot.  The decor is definitely simple.  But that's not really why you're there.    I totally thought of Lauren's Grandma when that smell hit me on the way in the door.  (See Lauren V's review)  It did similar for me - remembering my neighbor's house.  I loved even walking by the house on a big cooking day.    Service was ok.  I was definitely assisted by kids of the owners.  He both played host and then sat down to take someone else's order. Actually pulled over a chair.  None of the other wait staff did anything like that so I'm thinking he had nothing to lose.  Chips are made on site though at first I wasn't sure because they look TOO perfect.  TOO triangular. And - they were completely cold when they got to me.  Now I know some folks will just use heaters to keep them warm, but I can't help it - I like warm chips.  The Salsa was simple, and not too hot at all.  It was ok with the chips - but it really hit it's high note when put on the taco!    Their menu is super simple.  Like 6 combinations, 1 steak, 2 soups, 2 salads (1 of those is \"dinner salad\") and then ordering a la carte.  That's about it.  So I got a taco/enchilada combo.  It was good, but honestly it was so temperature/hot I couldn't really taste anything until about 10 minutes into the meal.  I know it sounds bizarre, but I'm completely serious!! So I thought it was ok when I started eating, but it wasn't until I was finishing up that it really tasted great.    Update 5/29/7 - After coming here several more times, I'm downgrading it from a 4* to a 3*.  I've only only had one good server ever.  The food is always fine, but different things I've tried have never been outstanding.  It's like a 3.25 star place to me now.  Fine, maybe a bit better than that, but not by too terribly much.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "TryfbZaaGtedncOMq9k86g"
  },
  "rfWwJ6eYLOHX72au4B4l3A": {
    "date": "5/26/2010",
    "text": "Tucked in the corner of a fry's strip mall - a 1980s type of Mexican food sit down joint that is family owned and family run. Hav been there a dozen times or so and have enjoyed it every time. The goyo burrito is pretty dang good - the a bean and cheese with a requested green chili add in is dang nice too. Good rice. Great red sauce. Fun to be there, family ran.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Qqo7TItt-GRiNNXahVQXMw",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. Been burrito enchilada style with an egg on top",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Qqo7TItt-GRiNNXahVQXMw/o.jpg"
      },
      {
        "img_id": "SGCLdNrKLq7-gdDZ4mD4Cw",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SGCLdNrKLq7-gdDZ4mD4Cw/o.jpg"
      }
    ],
    "user_id": "xZhxXL2GJqJ_XGOswVG-iA"
  },
  "nbSUj_3zgAs5G_GLYI_kUg": {
    "date": "9/27/2014",
    "text": "I always get yummy cheesy enchiladas with rice and beans and it's always scolding hot and everything's great. The one reason I don't go as much is because my mom knows the owner and went to high school with her and last time we went the owner just kept talking to her about old times and kind of didn't let us eat in peace. No offense I just know my mom felt awkward so I'll probably be going by myself. But the food is really great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I9Mu63_OC1020h30fOQ7dQ"
  },
  "KMN5PfHzXztucV_o9cAC1w": {
    "date": "8/1/2014",
    "text": "Authentic Mexican food via Globe/Miami, AZ. As good as it gets.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Ql6LqarZs7771bwifYhWQ"
  },
  "9XgrxHXONfSMhcV3y9JEkQ": {
    "date": "1/31/2013",
    "text": "You know you're in a pretty sketchy mexican food joint when the chips come out burned, cold and the salsa is watery. But, because of the positive review I had read in New Times magazine, I went ahead and ordered some food. I ordered a combination plate and a green chile cheese crisp. The cheese crisp was the only thing I found edible. I was sorely disappointed by my whole experience. I will not be returning.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iv4m306dEnLb4l7pAjjbrQ"
  },
  "X7UZkxUG7R39FIOHNCwndA": {
    "date": "3/2/2012",
    "text": "This place is family-owned. It's tucked in the corner of an L-shaped plaza by the Fry's. It's quiet and dark. They try to make it seem like a romantic dinner place, I understand, but the darkness doesn't hide the fact that it's an old place that probably needs renovating. Service and food taste is OK. I must give this place two stars because the cheese enchiladas gave me a small case of food poisoning. My husband had something else and he was fine. So I wonder if maybe the cheese wasn't kept at the proper temp. Thankfully, I didn't vomit. I passed it by laying down for two hours. The map Yelp provides isn't accurate. It's located on the left side further south.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SX7xBRFGfrEjfXDqw0d-ew"
  },
  "sYp4sfwzR8ciis02nOXxkA": {
    "date": "11/14/2012",
    "text": "The green sauce is awesome. I normally only prefer red, but not here. Service is great here too. Also the complimentary salsa is very good, though a little watery. Only reason for four stars is the place is kind of gloomy, not exactly a great date place if you know what I mean.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pSlGLGvZbeTtjgTf_31P2g"
  },
  "2ljkZQ212dtmrC0A-zRRnQ": {
    "date": "12/30/2018",
    "text": "Bomb traditional Mexican food. I always get the number 10 , the red Sauce is amazing! Also the cheese crisps are the best appetizer!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "xAT24Dqk4dpRFMdVztccFQ"
  },
  "bHGHKxk93c6gOA2kp2P11Q": {
    "date": "6/20/2018",
    "text": "My fiance and I have been coming here for years. It's an adorable, family-owned restaurant with fast service and good food. We usually get the tortilla crisps and bean and cheese burritos enchilada style. Orders come out pretty quickly and the waiters are very attentive!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "TLaYAlhxMrV76uHxPuE8gg"
  },
  "QnSMyC2uFjjpKpSihI8kEQ": {
    "date": "4/1/2019",
    "text": "Met some family here for lunch because there was an event on Mill and didn't want to pay for parking and I'm so glad we did! It was absolutely delicious. Some of the best Mexican food I've ever had. The salsa is hot and delicious, the Lisa quesadilla was fantastic, I had a chicken taco, machaca taco and rice and beans and was still talking about it days later. Can't wait to come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BpdWNTgC5BDONdLc-niYAA"
  },
  "xCmc-ZnUZQrqP6CIpEMPAg": {
    "date": "3/31/2019",
    "text": "There are certainly pro's and cons to Casa Reynoso. Pro's: Their Margaritas are wonderful. Be careful ordering a largo one as you may not be able to drive home!   Chips & Salsa are really good. I do wish the salsa was a little thicker but the taste is excellent.   Their Green sauce for Burrito's is crazy good and their Red sauce is good too. Enchiladas are a real treat.   The servers are usually very attentive. The restaurant can be very busy on weekend nights and they do a great job,  Cons: Taco's are too small & sparse and kinda greasy.   The Entrance leaves a lot to be desired. It's gloomy & kinda dirty looking.   The Bar is very dated, it really needs a remodel. The restaurant has ugly tables & chairs, Some may say they add to the character of the place but I don't see it. It's not quite nice enough to bring company to but it's great for a yummy weeknight dinner.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vvo3lVoBL3XJL8Se2raXdg"
  },
  "wddKpGIjAg6AUzGHtWhFRw": {
    "date": "12/28/2017",
    "text": "Their green chili burrito is delicious.  I usually add a side a rice to my order to complete my meal. The quality of the food is great at such an affordable price. If you're looking for a sit in Mexican restaurant in Tempe, this would be a winner for your appetite and wallet.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YvV9mn0BjbNgZ3qOn0Yv-Q"
  },
  "x85KjRh7EMws9RYBL3T9Gg": {
    "date": "12/30/2018",
    "text": "Mediocre at best. The chips always taste overcooked and the food is very salty. They have a large menu with a variety of Sonoran dishes.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6JkYqd8X8XbNXAACo-oWmA"
  },
  "Xxd6_TrOwRmjNgjwcUKzKQ": {
    "date": "1/4/2019",
    "text": "Love the food I always get the 1/3 plate w green chili served w rice beans and a fresh buttered tortilla! Yummy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6iLy5Ea5fuvuZkwENOXt5Q"
  },
  "EQ19QvgLbGbfxEwKveAi3g": {
    "date": "12/27/2018",
    "text": "Ok so I came in around 6:00 pm and wasn't seated till 6:45. The food took way to long to come out. We had 8 people in our party and half of us sent out food back. One of my friends burritos was sweet. Not salty . Long story short, don't waist your time here. It's NOT good and the service is slow.  I saw multiple children that were under the age of 13 that were WORKING. Additionally they tried to charge us 7 dollars a drink when I could have gone to Taco Bell down the road and received better food. Should've gone to any of the places next door. It would have been better than this awful restaurant.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lmHFOv1wTlnHqcnjMLTKvA"
  },
  "DVn18R_98nbDo6UotnLNvg": {
    "date": "12/14/2018",
    "text": "This has just became my favorite Mexican restaurant in The Valley. Came with a group for a Thursday night dinner. We had a little wait, but definitely worth the wait. Our Server was super attentive and gave us good tips. She also brought out a plate (for us to share) with green Chile, red Chile, and refried beans. Def helped me decide on what to order. I had the \"Gollo burro\" switched the whole beans to refried beans and ordered it chimichanga style/ enchilada style (green Chile) I recommend that order 100%",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qUW7U5qRO7xcyLeSu6gDTg"
  },
  "p4KkDKCvMUgAR9XKzqP26Q": {
    "date": "1/28/2017",
    "text": "My grandmother is not from Mexico, but based on my many years of living in AZ, working in southern AZ, and eating A LOT more Mexican foods than any other gringo I know, the food here is as authentic as I have ever eaten, even south of the border.   This great little \"hole in the wall\" place serves a fantastic green chile burro. I don't know about much else here, but the \"Gollo\" Burro, green style is the way to go. I could eat one of those every day!   Sure, they have dishes on the menu that may not be their specialties, but their customers expect them. I would look on the menu for the items with the \"Reynoso special\" logo next to them and order from that subset. Don't just order the beef taco, cheese enchilada, rice, and beans because that is what you always get. Give them a chance and order what they say they are good at!  :)  As for portion sizes, I had just the burrito, smothered in green chile and topped with cheese. No rice, no beans on the side. It was the perfect amount for this evening's meal. I probably eat less than your average college student, so your mileage may vary. You can always add sides to your order.   Other than the burritos, our chips were hot and fresh and our burros came out on plates that were too hot to touch. This place is a bit of a drive from our house, and we have to pass a bunch of other places, but it is worth the trip. We are going to have to add it to our rotation.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "e7ueBW4LPJtLrHXR666baw",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. The Gollo burro, green enchilada style. It&amp;#39;s all you need.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/e7ueBW4LPJtLrHXR666baw/o.jpg"
      }
    ],
    "user_id": "QkNuVpkhV_wTApylrKOMDg"
  },
  "InyDdCeg9KEigK5ZI4FVtQ": {
    "date": "12/10/2018",
    "text": "Incredible green chile, best in Arizona! Recommend the 1/3 plate with green chile or a green chile or gollo  burrito, \"green style\" or anything topped with green chile...tostada, cheese crisp, enchiladas, etc.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xvdl7Q3QomhqQ0l_7A8FBw"
  },
  "NIw8TnlqOghLQlMXnNcLvg": {
    "date": "10/30/2018",
    "text": "When I get the urge to have some good Mexican food from back home I go here. The customer service is good and the food even better. Globe-Miami Mexican food is the best. Sometimes it is slow but the food is worth the wait time. So if your looking for some good ole fashion Mexican food come here! Overall they are very helpful and try their best.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QW9lIOC-bOgNQox6Vh5qKA"
  },
  "TqVyemtFlNvIJz_LcSrSRA": {
    "date": "12/23/2017",
    "text": "My fiance and I love this place. The chips and salsa are so awesome! We always order #9, it comes with enchilada, tostada, rice, and beans. It is amazing! The bean burros are great too!   The restaurant is clean and the interior is nicely decorated. Staff is friendly and attentive, and the prices are reasonable. I love this place, and I totally recommend Casa.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pKTFpHLToMJPuf9SxhpVTw",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pKTFpHLToMJPuf9SxhpVTw/o.jpg"
      }
    ],
    "user_id": "iMeXX-CLrPsWBWagyNp7-w"
  },
  "GHCPEQbmln6ds5LZdyzDKA": {
    "date": "2/25/2018",
    "text": "So we didn't actually get to eat here.  Honestly there was a line, and we were traveling and asked to use the restroom after putting our name on the list.  Mind you with three staff members at the front,  I had to interrupt their conversation to put my name on the list and ask to use the restroom, literally ask where it was. The bathroom was in the back of the restaurant and we were able to see the empty tables and people getting ready to leave as well,  but nobody new was getting seated.    After we came out of the restrooms,  we were over hearing the waitress telling people coming in the wait was 45 minutes.  A lady next to us said,  wow I can't believe they are still saying 45 minutes.  They had already been here that long.  We obviously was not looking to wait that long as it had already been 20 minutes at this point and only one party was sat during this time.    So I decided to get a to-go order which I was told was going to be an hour wait? Wait what? There was many tables still empty and the restaurant looked staffed as far as front of the house was concerned...but after hearing that it sounds like back of the house has timing issues or short staffed.  There is no reason it should take an hour after we've already been waiting 20-25 minutes for a table that was told would be a 45 minute wait.  We left... We were not the only ones to leave.  Sadly to say I don't think I would recommend going here unless you had 2-3 hours to waste from your day.  This isn't a nightclub and nobody should have to wait to hype up the rest of the crowd that it \"might be a good place to go\"... As they was plenty other places I wanted to checkout.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "TjyNcVldWYpuMWXp730scQ"
  },
  "YhXc2ZOFqFFwNJVXBVlVuQ": {
    "date": "2/23/2019",
    "text": "This is my favorite Mexican food place in the state. I am a very picky Mexican food snob (having lived in Mexico for six years). They're famous for their green chile which is amazing but their salsa is incredible as well. Do yourself a favor and make the trip.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "EQfyEX_FavfhT6ndeQNeCA"
  },
  "tG1bovuHbkfy5Pq068nNJg": {
    "date": "8/11/2018",
    "text": "This place is average, nothing real special. First when you walk in it smells like an old musty basement. Once your seated you're given salsa and chips. The chips come in a tiny bowl and tasted stale. If you wanted more chips you had to pay 75 cents for a small bowl or $1 for a large bowl per refill. (We didn't care for the chips so that wasn't an issue). I got the dinner combo number 10 which consisted of an enchilada, taco, rice and beans. Everything was just okay, nothing that was overly good- making me want to come back for more. Cheese enchilada was kinda bland and the taco only had meat and lettuce on it - they put cheese on the taco shell but that was minimal and didn't provide much flavor. Service was slow, took about 25 minutes for our dinner. Server was decent.",
    "rating": 3,
    "rated": {
      "funny": 7,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KF6IKJvAekVjr8CeC99DYg",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. Enchilada, taco, rice and beans",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KF6IKJvAekVjr8CeC99DYg/o.jpg"
      },
      {
        "img_id": "MmHCWYj4exM_YJ-BMtbYvQ",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. Chips that are complimentary. If you want more they charge you.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MmHCWYj4exM_YJ-BMtbYvQ/o.jpg"
      },
      {
        "img_id": "-hOEH1gDrRy_mFDb9fvGYw",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. Chips and salsa",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-hOEH1gDrRy_mFDb9fvGYw/o.jpg"
      }
    ],
    "user_id": "rb9JfMazM1xz-CPDdJI5cw"
  },
  "P_-s2xVeX-jnmYizOSsOTg": {
    "date": "1/9/2018",
    "text": "Here is the deal, it  is not bad, it is not great, it is completely average. Like super average and needs a makeover. My boyfriend and I came here for lunch. Here is the pros and here are the cons.   Pro: A salsa carafe so you don't always ask for more. Con: Salsa is rather bland, didn't want more, chips were cold  Pro: They offer lunch specials Con: Very limited lunch specials and if you order off regular menu nothing includes rice and beans...so a meal ends up costing over 15 bucks for mediocre food  Pro: They have Mexican food (as they better) Con: Very average, underwhelming and little to be desired flavors   Pro: They have a bar Con: The bar resembles something from an Elk's Lodge (nothing wrong with Elk's Lodges, it's just this is a Mexican food establishment)  Pro: They have a staff Con: The staff is rather non-existent (busboy was the most help)  Probably will never return. Needs a makeover, a menu revamp, a service training class, and then who knows???....",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 6,
      "cool": 5
    },
    "photos": [],
    "user_id": "lWwlPEbkR-yUt057Oc_wjA"
  },
  "rxuSbmbIIGWEN7bBKxd5Og": {
    "date": "12/9/2018",
    "text": "Best bean and cheese burritos EVER! They put butter on them which is delicious. The wait is very long and sometimes the new hostesses can be rude but the food is amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-zZmsrUOVLPpWEB2qzQecQ"
  },
  "t02nv3WmVQOr5W_ICpio_g": {
    "date": "2/16/2019",
    "text": "My go to for eat in and take home. Love Joann's Special, & Gollo Burro. AND the Potato Tacos during Lent!!!! Chips and salsa!! I have family in Portland, Or...they give me an \"Order to Bring\". Pack the salsa in my water bottle, Freeze overnight if I have to ... Everything always delish when we unpack, heat and eat. (They're closed on Mondays! Plan ahead.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4jBILhU-G8WFrfnppEoiGQ"
  },
  "YhOJi_ImdCFKqIGlEDA3LA": {
    "date": "1/22/2019",
    "text": "i looked up this place they said it was supposed to be like my nanas food first of all my nanas food is way better. the lady sat us on a booth and one of the booth chairs were broken. our food took so long our waitress never came to fill our drinks the food was not all that it did not taste like homemade it tasted like canned food especially the salsa with their cold burnt chips. last our waitress never came back i didnt know i had to get up n go pay at the register n the man that rang me up had already added the womens tip. i did let him know she didnt really come check on us. she was catering more to another family. dont waste your time go somewhere else.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sbhLZBh2pqDArSocAEvSag"
  },
  "3jvTsRvjI88xAJrpkekkQA": {
    "date": "3/19/2013",
    "text": "Very mediocre. Salsa is spicy, but no fajitas, sauce covered sloppiness. Not coming back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "YCM87v6iRSSqhE_PbI2dmg"
  },
  "bOsmZeietprBUjxNGU8Nhg": {
    "date": "10/10/2011",
    "text": "So... yeeeeah.... We went here for lunch because it was named \"Best  Neighborhood Mexican Restaurant, Tempe\" in the 2011 Best of Phoenix New Times.  The food was \"ok\" - nothing special.  We got the chicken chimichangas which weren't bad, just 'eh' and especially disappointing for being noted as \"the best\".    The service on the other hand was HORRIBLE.   Where we sat we could see people waiting at the front of the restaurant not knowing what to do - no one at the register, no one to greet them and NO ONE acknowledging them!  How no one walked out was beyond me.  They serve you soda in something resembling the size of a dixie cup and then aren't around for refills.  Our food took WAY to long considering when we arrived, there weren't more than 6-7 groups of people and most of them were eating.    At the end, it took forever to get someone to get our bill and when they did, they LEFT OUR CREDIT CARD with the bill at the register (with no one there)!  When someone came by again and we asked about it, she giggled and said \"oh, I didn't know he left the bill up there...\"  Hmmm... luckily NO ONE ELSE saw the credit card unattended...  EPIC FAIL!  :(",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a8wX3Y-I49NOeE9GpmzK6Q"
  },
  "9E3ERnqY2y0nzOIQ28ajzQ": {
    "date": "4/27/2013",
    "text": "Well this place could definitely use a facelift. The service was super slow and unmemorable. At least the food was pretty good, but I can think of a handful of other family owned Mexican restaurants that are much better. My boyfriend didn't like his meal of a taco and chile relleno, I believe. Glad I gave it a try, but probably won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_9WKSGfBn193Wl3vd7kt1A"
  },
  "eE-pAl2rOfZAPfx1r-daMw": {
    "date": "6/17/2014",
    "text": "Wow! is all we can say about this place. It is a family-run restaurant that has been around for many years, and after tasting the food we can see why it's a mainstay in Tempe. It's in the corner of a Fry's shopping center and very unassuming, but don't let the decor fool you. The food is fantastic!  The salsa comes in a little carafe and you get individual bowls to fill for dipping your chips. The food was authentic and amazing, brought to the table piping hot and full of flavor. The (beef) red chili was delicious as were the chile relleno, whole pinto beans and rice. The service was very attentive, and the iced tea glass was quart-sized and never empty.   Only gave it 4 stars because the ambiance is older, but who cares when you're getting the real deal when it comes to the food? We will definitely go back here again and again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wqWXLB6yXrDb-JP_qohiZg"
  },
  "WU94LE0OmZbNj76S82rYEA": {
    "date": "12/18/2015",
    "text": "The service here was excellent.  Our waiter, Darion did a great job. We were Garcia's customers but I think we just converted.The food was also excellent. Their green sauce is the best I've tasted.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "trAgJ5hymN7ed86uUc68-Q"
  },
  "2qw7yxe56lqqS5m5IvE-xw": {
    "date": "7/1/2015",
    "text": "I went in was unsure where the entrance was. I was waiting to be seated and decided to ask to sit in the bar on the left side of the entrance. I was taken care of by Deni or Desi. This girl very nice and personable...actually awesome!!!  I love Mexican food, and after a long day of work I just wanted a margarita and some good homemade food. I ordered the number one which was an enchilada, taco and tamale. This had red sauce on the plate and of course I order the rice and beans all of it, I ate, and it was very good. Their chips and salsa is served with water, I do like spicy but the salsa I was just more of hot with no texture. I also ordered a large house margarita, I thought this was very strong just for one drink and I was only able to finish half of it. There was a gentleman that made too much of a strawberry daiquiri for another order, I asked him if he was making a strawberry margarita he said no but he gave me the rest of their drink that he made from their order and the strawberry daiquiris there are very good.   I grew up in born and raised in Phoenix and I think this is the best one Arizona type has to offer. My future husband is from New Mexico and growing up on Mexican food from Arizona I thought was good, but Mexican food from New Mexico is way better in my opinion. If you're looking for a good Arizona Mexican food this place is it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uL0pptYeX1DNwEIT2rxAkg"
  },
  "owvDKyTSFa-rqWAuCpisug": {
    "date": "3/28/2013",
    "text": "Came here to meet up with family who was in town.  My assessment? Eh.  I have definitely had MUCH better Mexican food.  Salsa was nothing exciting.  Had the golla burro after reading the reviews and it wasn't anything spectacular.  Pretty standard burrito with butter around it.  The beans are homemade so that was a plus.  Wasn't a fan of the fact that additional chips cost you.  It was something like a measly $1 but still.  Guess it's a good thing that the salsa wasn't that good.  After all the reviews I really wish I could have liked the food better especially since it's family owned which are usually pretty good.  Maybe it's what I got.  Worth another try.  Just not the salsa or chips.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fr0Nen1J499HvNml3_6OYA"
  },
  "41l4BY2PPGi5B957RZp2Zw": {
    "date": "2/5/2013",
    "text": "Best Mexican Food in the valley!!!  Yummmmmmy!!!!!!  Super nice family!!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "kg5GvGANA6jFFRVqVpX3IA"
  },
  "kIaEmSgFwvtKT3fkNXGZDQ": {
    "date": "8/14/2015",
    "text": "I have been coming here when the kids were all small and bussing tables that were taller then they were. Excellent food. Family.  Here for special occasions and when I'm hungry. OK I'm always hungry. Never disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AdRh-2ZSHjWtTpOx7vNyXg"
  },
  "lQZticOzFptk-gqosGyZqQ": {
    "date": "1/26/2014",
    "text": "For great, authentic Mexican food...go here.  if you're looking for artsy food that is placed perfectly on your plate and looks better than it tastes, stay away.  The food here is fantastic!  My husband is from Globe (where this family originates from) and we go here anytime he has an itching for Globe/Miami style Mexican.  If they're busy the service can be a little slow, but that can be said for many restaurants. The Gollo burro is a favorite and their enchilada sauce has that down-home flavor that we both absolutely love.  It's not a fancy place.  Yes, the decor is a little outdated and for the most part, the food is just thrown on a plate without any flair, but anyone who has has authentic Globe Mexican knows this is the way it's done.  You're supposed to go to a restaurant to enjoy the food, not stare at the walls.  The food is good...that's all that matters here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E6cYMy1ds7gpi-0nmZJqmg"
  },
  "ZukdGDnN7UHfBgZAbSPwDg": {
    "date": "7/25/2013",
    "text": "I love this place! They are family owned and have the BEST food ever! I dare you to try the Gollo burro with the salsa.... Wait let me tell you about the salsa! It's so good it will make you slap yo momma!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VaFeh6kndST-1R55rhlaNA"
  },
  "lrxFQ5o3UIgsLceO_WRP9A": {
    "date": "8/31/2015",
    "text": "Terrible service. It was hardly busy when we went around 2pm, still waited an hour for food. Ships and salsa were odd and definitely not something I would ever pay for. Food was good, but we were hardly ever acknowleged by any servers",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hEvVdgab4wKtJvIBhd6apA"
  },
  "JTrwCWHUkYqO9PoJhbrRrA": {
    "date": "4/2/2013",
    "text": "Our favorite place in Tempe for Mexican. My wife goes for the Gollo burrito and I the Machaca both green style. It's fantastic and pretty cheap.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YRjaobnBjufclnSiorivMg"
  },
  "2HJxlaYAmmQD1rx8LLISFQ": {
    "date": "9/26/2014",
    "text": "Thank you Casa Reynoso staff for saving 9/25/14.   Our group was looking forward to a pre-game (ASU vs. UCLA) meal, but work schedule wasn't cooperating.  Phone conversations with CR staff got us a reservation and we ordered ahead. Right when we walked in our plates were waiting, dishes still hot to the touch.  All of us raved about our orders.  Among us: red chile bowl, tacos, rellenos, rice, beans, enchiladas, tamales.  Not one complaint.  Two of us who had rellenos agreed the best in memory. I liked that they were served home-style-- not covered in a sauce.  Nice to get that sweet green chile flavor. I very much appreciated that a \"kind of\" off-menu item was dished up -- grandson likes going to Someburros where he always gets a bean burrito. CR doesn't have that on the menu.  Grandson also likes beef roasts, like from a crock pot.  So I asked if he could have a serving of plain machaca-- not in a burro or chimichanga and that was graciously provided.  Good moods all around.  Then we went to the game and got our behinds handed to us.  Going home in different directions we agreed that our dinner was the highlight of our evening.  So, why not 5 Stars?   Chips servings for 6 people kind of skimpy.    Still, we most definitely will be back.   Thank you.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2cY73rX3cxHcreIKMoY78Q"
  },
  "uKTpaVXsUTvWm5z1JFLSig": {
    "date": "7/9/2013",
    "text": "Love this cozy family restaurant.  Super green chile and golla burro!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CUuqanXxU1yd9IEBCJ6dpg"
  },
  "ifGfhChYGMjW9iFyhwCq-g": {
    "date": "7/17/2010",
    "text": "After reading the Yelp reviews I took my family here (they are visiting from out of state). I really would have been better off going to Garcia's or one of the other chains. I really prefer to support locally owned business, but only if they are at least trying.   The service here is poor. The waitress was good enough--she just did not have enough help. You can tell the place is pinching pennies--for instance, they charge for extra chips in addition to understaffing the place.  The food, with one exception, everyone agreed was average. The exception was the menudo, which my wife said was super excellent. Nothing was bad, it is just that nothing other than the menudo stood out.   I really wanted to like this place better--especially since everyone counts on me to find the good places and I told everyone a locally owned place was bound to be better than the chains. Oh well, at least Luigi's Pizza was good at dinnertime today. One out of two for the day.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gCp21sfvL6HnQOvapeV7sw"
  },
  "XP1bpR3kXlUm2fH3kANT7w": {
    "date": "12/29/2009",
    "text": "Let me help you out here: Gollo burro, green style. Chicken enchilada lunch special, green style. There. Don't worry about anything else on the menu. Trust Aunty Erica to lead you along the path of good taste. These are the five-star, absolutely stellar staples of this establishment.  Now I have to admit that at first introduction many years ago I would have rated this place no higher than two stars. The service was spotty (as has been mentioned before) with a couple folks doing quadruple duty as wait staff, busser, host(ess), and cashier. The red sauce was forgettable, the ambiance nearly non-existent and the menu limited. But like a good mold (think high quality blue cheese) Casa Reynoso grew on me. This place is now at the top of my short list of fave lunch spots in Tempe.  The service is a little slow, but come here on the reg and you will be greeted by name and your usual order remembered. The fact that it's a family run joint is the reason why everyone does double time during the lunch rush. The ambiance is a little dated but it's quaint, and the amount of heart this establishment has compared to any other fast food Mexibertos or bland, hot garbage like Macayos is unmatched.  This is Arizona-style Mexican food, make no mistake about it. The Mecca of Mexican food is rooted firmly in Mexico and this place is the Copper State's take on it. Mounds of freshly pressed tortillas and chips made from snowy white peaks of manteca (lard), fresh salsa with the perfect amount of spice, green sauce that will blow your mind and rice an' beans that are good enough to stand on their own.  Just remember: Gollo burro, green style. Chicken enchilada lunch special, green style.  You're welcome.",
    "rating": 4,
    "rated": {
      "funny": 8,
      "useful": 12,
      "cool": 5
    },
    "photos": [],
    "user_id": "dyhTHLIf6eWBvU78Y3T06A"
  },
  "DHKSkp2BhJnWr48mOn2L6Q": {
    "date": "3/24/2014",
    "text": "We stumbled upon this place after a recommendation from the botanical gardens staff (garden also great).  This restaurant doesn't look like much but the food and service was wonderful.  We had the gallo burro which was great and chili relleno, enchilada and taco were also great.  House margarita great.  Wonderful family restaurant.  Go--you won't regret it.  It is great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "CJ8lA3uHKMlWQ3H8xQfxpg"
  },
  "HVgHuKYeaGDqvcnrvSGkaA": {
    "date": "2/28/2012",
    "text": "Went here for dinner and left very full and satisfied.  The family that runs the restaurant is originally from Globe so the Mexican food here is similar to what you'd find in the Globe/Miami area.  Stepping into this restaurant, it feels similar to how other restaurants such as Serrano's and Rosita's feels: Comfy atmosphere serving homestyle, no frills cuisine.  I had the special tonight: 2 chicken enchiladas with green sauce with rice and beans ($8.50).  While the enchiladas looked a bit mangled since chicken pieces were sticking out of the tortilla and the tortilla itself looked prodded and broken, the enchiladas themselves were quite tasty with the green sauce and the rice and beans.  I'm usually a lightweight when it comes to finishing meals, but in this case, I cleaned my plate!  The salsa tastes good, but is very watery which makes it hard to eat with chips.  We ordered iced teas and they were refilled promptly as needed.  I'd definitely be interested in going here again for some tasty and filling meals.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DK57YibC5ShBmqQl97CKog"
  },
  "v3QtSyLaRiYbSFexryp1YA": {
    "date": "5/29/2012",
    "text": "Globe Mexican Food in the heart of Tempe. I prefer Xavier's Casa Reynoso in Mesa, but this place gets me by in a pinch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1J1wECaKO1sw8_iMKyDjKA"
  },
  "vXGBcfMwVFH400UcRMdeUg": {
    "date": "8/30/2019",
    "text": "Love this place. Homey Mexican restaurant tucked away in a corner of a strip mall.  Nice staff.  I would definitely recommend the Gollo Burro, simple but delicious.  Great salsa too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k2BnSTV_wzcAosSXFyhfcA"
  },
  "5OE9-1erRowXbwlFTHfvYA": {
    "date": "7/1/2019",
    "text": "Iike this place. I had been here a few times because everyone says it's the best Mexican food in tempe. The problem is it might actually be. Because there are so few good restaurants left in tempe.  The chili relleno doesn't come with sauce and I notice they taste much better with extra red sauce. So that's my biggest tip. But you will pay extra  They also have very good extra spicy sauce which isn't all that spicy but very tasty if your like me and like the hot spicy stuff.  I can't say I love the service. It always feels like they do just the minimum. Or I get the impression they are doing me a <a href=\"/redir?url=http%3A%2F%2Ffavor.my&s=b06d80d00be7f2a2f6dca45188b1c717c4c4a09ff9f65c2283c63a7c9243a9af\" target=\"_blank\" rel=\"nofollow\">favor.my</a>  spending money isn't doing them a favor. And it's not exactly a bargain prices place. But the service generally isn't bad.   The place feels dark and in bad need of renovation but that's part of the charm.  I feel bad giving three stars but it's just average. I have trouble getting people to go with me. Because if you don't love Mexican food this place has little to offer.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uL1CZ6B1DV6Q8P5SpcOzSw"
  },
  "mM45WgHTdjOXrvlyZs5Wyw": {
    "date": "8/8/2019",
    "text": "My family has been coming here for about 30 years. We get the same thing every time, the Gollo burro and a green chili cheese crisp. The burrito is amazing and my mouth is watering thinking about it.  The chips and salsa are fantastic and and they keep them coming even after your entree arrives. This place is all you could ask for in a sit down Mexican restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "byaE22Kyi_3282sBIGOMDQ"
  },
  "eqHH8fJnpBGaBnZ5UUIDsA": {
    "date": "7/18/2019",
    "text": "I've tried this place twice and the second time was a charm.  Ordered the Gollo Burro Green Chili Enchilada style.  It was SO GOOD!  The only reason why I took a star away is because my to-go burro did not look as big as the one in the picture. Maybe they made it to fit in the small container verses the big plate.  Not sure, but I will probably have to dine in next time.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hTCN6HTFhYAZ7unwN1INRg"
  },
  "ntrTbhY7JVdJ6d_RbabgnA": {
    "date": "7/27/2019",
    "text": "This place is my all time favorite Mexican food joint. There gollo burrito is THE BEST! I've been coming here for years and it's always the same great service and delicious food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zJldn1k8xGKroJVWICiSIg"
  },
  "y0IR-_ZvPNomNE8vi_JtMQ": {
    "date": "6/12/2019",
    "text": "Ate here last night for dinner really enjoyed my meal I left around 8pm thinking wow this place is very clean. But 1 hour after my throat began to itch within a few fours I'm  coughing by midnight I had a dry congested soar throat. Now its 5am and I have no voice to teach my class today in a few hours. I guess I was wrong this place is filthy enough to catch something.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "kHXGAlH6h6jY52mn6SSBDA"
  },
  "NOrTQ9EBAKFp8P3m4iy02w": {
    "date": "10/11/2018",
    "text": "Nothing beats chili verde. One if the best chili verde burro I've tasted in awhile. Reminded me of the hatch chili verde from New Mexico.   Service was but slow due to the crowd during a Wednesday evening. One can only surmise that food is good or the restaurant will not be busy.  Just be patient and you palate shall be rewarded.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "E1LhaxrXib7CiPMu2FM_GQ",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. Nothing beats chili verde. One of the best chili verde burro I&amp;#39;ve ever tasted. It&amp;#39;s comparable to the hatch chili verde from New Mexico!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/E1LhaxrXib7CiPMu2FM_GQ/o.jpg"
      }
    ],
    "user_id": "cl2r-UJA7wrgEgr0fgP25A"
  },
  "1XndGgMreixO4d3t5aDJcA": {
    "date": "6/11/2019",
    "text": "The restaurant looked clean and had a nice look to it and there was plenty of workers at the entrance that were ready to greet us. I got the veggie burrito and a jalapeno flour cheese crisp. The burrito was basically just lettuce and tomatoes with very little whole beans in it and no cheese at all in a cold tortilla that was probably store bought, at least it had that taste to it. What happened \"home made\". I don't appreciate those words next to the restaurants name on the front of the store when it doesn't taste anywhere close to that. My waitress brought me a ice water at the very end of my meal after I asked her one on 3 different occasions. What made it worse is she only brought it to me after I asked another server to bring me one. I thought the food could have been better and the service could have been way better. I'm only giving this place 3 stars cause my girl and stepson liked it. I wont be getting the veggie burrito again. I did like how they give each table a big thing of hot sauce for the free chips and give each person their own little bowl for hot sauce. You don't have to worry about double dipping here if you come with others. I'll probably come in the future but I will never order that veggie burrito again. It was the worst burrito I have ever had. Ok place for the way it looks inside. They need to step up their burrito game for sure.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aeuo-PdHqd4IQSoH-Kueyg"
  },
  "Wee3sJzwwH8_p4HopqRaWw": {
    "date": "2/14/2019",
    "text": "This was my first visit.  My husband took me on Valentine's Day which was super busy.  The service was a little slow but to be expected on such a busy day.  The servers were very nice and accommodating.   She provided great suggestions and although it was a stressful busy day, she always had a smile on her face.   I ordered a mango tequila drink that was HUGE and a the #11 combo plate with a tostada instead of a taco.  My gosh, the burro enchilada style was soooooo good.  The plate was huge and could fee 2 people.  My husband got the green chili bowl w/butter tortilla.   This was the best green chili I have had in Phoenix so far.  Ended with a shared order of fried ice cream.  This had a slight churro flavor..yummy.  Only thing I would change the salsa for the chips.  It had a good flavor but was really watery.   I find a thicker salsa does better with the thin style of chips.    I was so excited to eat I forgot to take pictures.  Next time I will post some pictures.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "aBwuFN_u8mfzSDQ6oDHwpA"
  },
  "rLnMlbEXW5_OGkYmajP8Sw": {
    "date": "7/14/2018",
    "text": "Probably some of the worst Mexican food I've had in a long time. I ordered the THIRDS PLATE, with Chile Verde, I got three pieces of pork; one medium size and two tiny pieces. I remembered this being better than it was tonight, I won't be back!!   When we checked out I complained about not having only three pieces of pork and she seemed very uninterested. All she said was 'Oh' nothing else.   I think we need to celebrate our anniversary again; at a better restaurant!!",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "BLvcPA1GmLVIKvC8CzKiTQ"
  },
  "PfxOAxLlcJK4mX-5yAXikQ": {
    "date": "12/27/2017",
    "text": "I don't know if we got them On a bad day or the Refrral was more impressed by this place then I was.  I'm from California, the place was suggested by a local who raves about it here.  First off I felt like we were seated in a cafeteria (large party) but another large party was so close to use way to crowed for me.   Our waitress also served the drinks ( so you could imagine how that went) they forgot my child's food and when she came (after we were all Almost done) said the first one was burnt. So strange.  The rice would of been amazing except for the over powering taste of burnt rice ( most of know what that taste like don't act like you Never burnt the bottom of a pan of rice)  All and all the food looked great, but I was just super dissatisfied. Thankfully it cheaper over here then Northern California it wasn't such a big deal.  Oh can we talk about my margarita yes it looked like ice water with a splash of lemonade I have no idea what it was I drank but it was the worst margarita I seen and tasted   Save your money go sit at flavas or filaburtos instead   Pictures attached",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "-7REUN6pm1EXx9oHn6WUOw"
  },
  "Qh4e0awnYnfIU5YRABsh8A": {
    "date": "1/5/2019",
    "text": "If you want some good Mexican you are looking up the right place! I go through at least 4 bowls of chips and salsa.  Bean burrito-enchilada style with a side of rice is my go-to and if I want to change it up I get the Gollo burrito.   Staff is always friendly- you may need to get their attention for something due to being busy- but they are always walking-by.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0kzOQiOn4bvWxvukKf_v7g"
  },
  "bXDtBkW_l6GrlVIYdCnPVg": {
    "date": "12/18/2017",
    "text": "Walking in I didn't know what to expect. Casa Reynoso looks like so many Mexican restaurants I have been to before. Looks can be deceiving.   The servers knew the menu well, I took a recommendation on a Gollo Burro and it was awesome. It came with the perfect dusting of butter that made all the difference. It was soooo smooth.   The guacamole was a little thin on texture, but was full of flavor. The chips were nice and warm and the salt level was spot on. I could do that for a stand alone dinner!  They also have several gluten free and dairy free options which is great for those with food allergies.  All in all this was a great meal with great service! Thank you Casa Reynoso!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "P2ZK_uDduvKbKgmNuyZQ4w"
  },
  "W5ojQuqknqNDd2rAZzoS-Q": {
    "date": "4/20/2019",
    "text": "Sometimes I am loathe to tell the crowd about a new favorite place for fear that it will get over run and hard to get into. Not to fear, Cafe Rey has been serving up their fare since 1983. I first tried the Gollo Bowl a couple of years ago off their food truck that visited my work.  When I walked into their restaurant in Tempe for the first time I noted that they already had a line to get in at 5:30! Worth the wait! These recipes speak to me. Not totally gringoized, not Scottsdale. Damn tasty! These are my favorite beans in town! Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2-v5Zt0r3BiT4qruusq58g"
  },
  "1_wj4KljcI2Lf5CfLkfkFw": {
    "date": "3/21/2019",
    "text": "I used to live right down the street from this place and the food is amazing. I brought my bf home from California to meet the parents and HAD to stop here beforehand to show him the real Arizona-Mexican food I grew up loving. We road-tripped 6 hours and we arrived here at about 1pm. It was very busy, and I had my pup with me knowing they didn't have outdoor seating, hoping and praying they would let me tuck her under the booth (yes, it's that good). The manager stepped out to greet us and let us know they couldn't legally have pets inside, but she would be happy to put a table outside for us! The whole staff was very kind and thoughtful, just solidifying my love for this restaurant!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qlOGpDdjphyxZzj3vOLmSA",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qlOGpDdjphyxZzj3vOLmSA/o.jpg"
      }
    ],
    "user_id": "oIpN6IanbYkVAUgqrezwUA"
  },
  "ZVyVBMSlbjCIujzpO64p3Q": {
    "date": "10/31/2018",
    "text": "We were quite disappointed, after trying this joint due to reading of it's longevity.  The bowl of green chili entree had very little pork in it.  It did not seem house made, as it had a tin taste.   The \"third\" plate, whatever that means, came with a burro made with a huge tortilla and little filling which was extended with a lot of thin refried beans, making it a dull gray color.  Where was the red chili, usually rich in color and robust with flavor?  There were just a few small cubes of meat. The taco was terrible, made with a beef paste like baby food and likely had filler added.  The only topping was a bit of lettuce, no cheese or tomato.   Enchilada nothing to rave about either, just cheese and some flavorless sauce.  I doubt this place makes it to the next generation.  Sorry to say, but we thought it was really bad food!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "l7l0U-_MCLV35_DOryOvFw"
  },
  "h81CUa7nN_z0d3a5P7pyRw": {
    "date": "3/7/2018",
    "text": "Definitely some of the better Mexican food I've had in the valley - it's a no-frills place with a typical menu and decent service. Plates came out piping-hot, and the margaritas were great!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "0HaaL-mBuhOODH5j-IqmzQ",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. Combo plate",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0HaaL-mBuhOODH5j-IqmzQ/o.jpg"
      },
      {
        "img_id": "EP8D7bCLwngRLQ5BFb2gfA",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. Combo plate",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EP8D7bCLwngRLQ5BFb2gfA/o.jpg"
      },
      {
        "img_id": "TBEGkvkpvwoQqzLGkF5yRQ",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. Drinks",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TBEGkvkpvwoQqzLGkF5yRQ/o.jpg"
      }
    ],
    "user_id": "j1Ul64xApHG0YI2ycP-vJQ"
  },
  "VJloDOxIdap-hNP17zE2aA": {
    "date": "4/16/2019",
    "text": "My boyfriend and I LOVE this place. It is our comfort food and we crave it all the time. I usually get the machaca burrito but I add in sour cream and they make it just right the only issue is they are so slow. You really need to have time when you go because you'll be here over an hour. I once came with a bunch of friends for our dinner break in rehearsal and it took us 20 minutes to get seated. The restaurant was DEAD empty because it was 4pm. I could have moved the tables quicker than that.  We also came with my boyfriend's family for his birthday because it was all he wanted. We called to make a reservation and they said they'll expect us but they can't take reservations. We waited over an hour with a baby and his elderly mother, and an extra 30-45 minutes for food. I understand they were busy but if they only take reservations for 4+ people, they surely should have taken one for 9 of us. Half of the restaurant was also filled. I don't know if they are short staffed or just don't like to fill every booth. Just sort of odd... but the waitstaff was great, the food is amazing and it is well priced!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L0D6Jscv8qiTmulClHOgBg"
  },
  "3CAuJuHuGckGhBzNZ6JrsQ": {
    "date": "1/10/2019",
    "text": "Eat here. My favorite Mexican food in the Phoenix area. If you've ever eaten in Yuma, this is the closest thing to it elsewhere in AZ.  Flour tortillas are homemade and legit, the beans are phenomenal, and the chips and salsa is delicious. I don't think you'll go wrong with anything on the menu.  It's tucked into the corner of the Fry's shopping center and you'd never really see it if you were just driving by, but it's worth the stop.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "AvyJ_BQPq-4EI7LMI81Oiw"
  },
  "fJwL-Fjhwitvv-xjbaxUnA": {
    "date": "2/8/2019",
    "text": "This place has delicious food, and I highly recommend eating there. It is a family run business that makes traditional U.S. Southwest-style Mexican food. I have been eating there for 25 years, and I have never been disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IGGe3F4rbJgQVopqKuRLoQ"
  },
  "brjJBes1xJgI4Wz7Y8GeRw": {
    "date": "1/28/2012",
    "text": "Coupla issues:  1.  First TINY basket of chips is free.  If you want a larger, second basket, it costs $1.  I can understand that policy if the chips and salsa both were COMPLETELY OFF THE HOOK! but they weren't.  2.  Had to go ask for a chip refill after the first tiny basket vanished in about 2 minutes.  They were really friendly though.  And the food was decent, but far from the best in town.  Standard rice, standard beans.  The tostadas and tacos were the best thing we tried.  There are just too many places better than this one to put it into my rotation.....",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jfGevhcYLxY13Fa3drpzoA"
  },
  "EFdUcpo4Kx8pIT9IBRlhRw": {
    "date": "4/18/2012",
    "text": "1. Most authentic tasting sonoran style mexican food in the valley. 2. Awesome green chile. 3. Can't miss rice and beans are perfect supplement for any entree.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "m96bqeEuGu9s46yVQ9yEpQ"
  },
  "FFNqNEOC203Cj1ZRRyJxvA": {
    "date": "8/24/2014",
    "text": "My mom is from Globe and I've been eating Reynoso family Mexican food my whole life. This is by far the best Mexican food I've ever had. My family has explored outside of Reynoso family restaurants and I always leave disappointed. The green chili is wonderful. My go-to is always a bean burro enchilada style. Yum!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yh2DjWncLvlsiApZ4s5MdQ"
  },
  "VPJ-Cv0fCmDFcCKtpn1QaA": {
    "date": "5/17/2014",
    "text": "Salty. Very SALTY. The service took forever, even though they were not that busy. The waitress walked away from my wife as she tried to ask for another fork. There were 4 of us and only two sets of silverware. Two, literally TWO of the cheap grocery store napkins that you could see through.   The food was very cheap, salty and poorly presented. The everything tasted the same. Horrible.  Overall a very poor place. Never again.  UPDATE: It would seem as if both my wife and daughter both have upset stomach with diarrhea and cramps. They both had Machaco. Let's say I'm not surprised. Maybe the Health Department needs to make a surprise visit...",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C-clCLOMMNo0fp6K0t09DQ"
  },
  "9sQdC11-67lzaK8jNCUmLQ": {
    "date": "8/16/2014",
    "text": "Casa Reynoso was a favorite lunch spot for some of my coworkers, so one day, I decided to join them. Overall, I was impressed with the food -- I had an enchilada style burrito. The only downfall was the pricing: everything comes a la carte, so if you want sides, your meal will probably be above $10 (which is a bit more than most places). Overall, good experience though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i_KBEh6Jkscgul5NtriuTQ"
  },
  "-Ftr3zVuahyqJjExL-5xlQ": {
    "date": "5/11/2015",
    "text": "3rd visit thought I'd give them another try however, it has not changed my opinion.  We had a big group, first we had reserved a table in the bar area n were told they had given our reserved table to someone else, ok so they made room for us however, we had to wait until they rearranged tables, and that took 15 minutes, we were seated, drink orders were taken, after drinks arrive they start taking food orders, I wanted to order carne asada n was told by waitress they could not do that because kitchen could not handle it n it would take longer to prepare, so disappointed that I had to settled for a chimi. Food is ok, service truly sucks. Since its a family owned business they dont properly train their employess which are family members. In my opinion they really dont care for their customers. Food is so so.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X796pPf18vzYm0iILxcn_g"
  },
  "sl900syHe-G5DfDbbNc0iQ": {
    "date": "11/20/2014",
    "text": "Food was decent ordered gollo burro.  Sat in bar as I travel often for work.  Was dark dirty and took ten minutes for someone to ask if I wanted a drink.  Will not visit this place again",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r9eJnjgX1-xVkChyePxhcg"
  },
  "5ZpoPhX2tmi7fKvFKTKjWw": {
    "date": "4/10/2016",
    "text": "Food pretty good if you can get over a 30 minute  wait to be seated to be seated . Only 3 tables occupied about 25 empty seats . They appear to only be capable of  serving three tables at a time .",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gSrnt7RhDKwZZyy_ZtpkzQ"
  },
  "qWmD709fOU4GHl5RH1w4qw": {
    "date": "3/5/2014",
    "text": "This is mine and my wife's favorite Mexican restaurant to eat at!  Their chips and salsa are too die for and then we get a bean and cheese burrito enchilada style.  It's the best place in the valley and won't disappoint!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2vE3B_ShrCfKACc1DAiEAQ"
  },
  "lq7nASAXSQl7MbP2BrqQeg": {
    "date": "3/10/2016",
    "text": "Not the best I've ever had, but definitely solid. I ordered the basics - tamale, enchilada, tostada. All tasted good. Decor could do with some updating. Service was prompt. They don't actually charge for chips despite what the menu says. I'd go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fCRyC-kagxe_EeutBJTILw"
  },
  "l2lJO4invy6wylDxoWKDfQ": {
    "date": "11/7/2014",
    "text": "Best machaca tacos ever - - I get 3 al a carte every time... Also love their chips+salsa.  We go a couple times a month and they remember us... great family owned place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IUaDVlSnk7EX28_Pba2CYg"
  },
  "4Sc2ywZDTpEyPoKsR8G89g": {
    "date": "11/4/2012",
    "text": "This is by far my favorite Mexican food in the valley. The tacos aren't massive, but what they lack in size they make up in taste. If you're going for the first time, get the number 5. It's a great way to try a burro, taco, and enchilada (I love the red sauce, my friend loves the green).  Whenever I go camping, I pick up burros here and eat them with no food prep mess. My friends are always jealous of my food on those trips.  I can't get enough of the chips and salsa. All around, I'm certain you'll love this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nY9Ao682pYS-Mqsu6hW8Wg"
  },
  "CCsq7rdtU3nHS4jIF495fQ": {
    "date": "5/1/2016",
    "text": "Been going here for nearly 30 years. Family owned and operated. Delicious food and great prices. Worth the drive no matter where we live in the metro Phoenix area. Puts the chains to shame. Thanks Reynoso's!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lg9GD-c7RxrmZ3HO1i6Iog"
  },
  "c-lrsF4BzZyu8DTd769igw": {
    "date": "10/10/2014",
    "text": "This place would have gotten five stars, but the service wasn't the best. It took awhile to get seated because there was no one waiting to seat us. Otherwise it was great and the actual server was a cool guy. Definitely a great place to eat.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QwgX5_nzNionCzkGKi-2Aw"
  },
  "e5FF9-9ipqlB-QEMvV-E1g": {
    "date": "6/29/2014",
    "text": "Great food and service with a smile.  Very refreshing after many years of what passes for Mexican food on the east coast.  Prices are good, too.  Only wish it was closer!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZwwtUAcTl8DqbwW731j5Cw"
  },
  "G6kVvSrRLnM4jg_8X4iAEQ": {
    "date": "11/13/2014",
    "text": "Good food, good drinks. Music was a bit too loud on the patio, and the front of the house didn't seem entirely prepared for us to sit on the upper patio. Would definitely recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NRyoCNRjLbvsVphFXPzMKA"
  },
  "5-reu6szliCovwtCz0T60g": {
    "date": "8/27/2014",
    "text": "Casa Reynoso is tucked into the corner of a non descript strip mall but it is some of the best Mexican food around. Excellent machaca and beans served piping hot with a large buttered tortilla. Good chips and salsa (ask for the extra hot). Gollo burrito is also a specialty. The service is always phenomenal. Family owned and operated for generations. The only bad thing is they aren't open on Mondays.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BvV-hiictK2mDE6hmSvt5Q"
  },
  "odtRxCNj_Zz96hcveIcyUQ": {
    "date": "6/15/2016",
    "text": "We went to Casa Reynoso this week. I had the Machaca and beans. Worst tasting stuff I ever had. When it was brought out it looked like dog food. NO KIDDING!! Never had anything like it. I will not go back...Margs were not good either. I do not recommend this place to anyone. GO SOMEWHERE ELSE!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4KxMC-AEiufRCoCvGB4H2g"
  },
  "7jct6kxjzxWuJu0U9re6og": {
    "date": "9/19/2014",
    "text": "Had the Number 6 Chile Rellano and enchilada. Been so disappointed last few places. This was good! I rarely finish my food but I did. Theres a party in my tummy. This is the best mexican food close to my work hands down!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KxrRos1HbkT5a0uCuYUcAg"
  },
  "XTne4j7O0hef-cnnfR-Vuw": {
    "date": "3/17/2016",
    "text": "Best Mexican food I've ever had I've been to the original casa's in globe az. And it's just as amazing. I'd eat there every day but can't call Mexican food the healthiest food out there. Casa Reynosos is the best in town great fresh chips and salsa little on the spicy side but not overwhelming everything is fresh and worth the stop. Try the bean burrito if your not comfortable stepping out of being an American by far the best refried I've ever had .... Great staff and helpful service don't judge this book by it's cover and no you won't spend tomorrow in the restroom. Enjoy. It's worth the trip",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fGNC2VxLJkbZNCJTVBksTg"
  },
  "pZ_rhjEO2hlOqoOJJc-pjg": {
    "date": "5/16/2014",
    "text": "Gollo Burro, Machaca Taco, and Tostada, and make sure you order the \"Extra Hot\" Sauce!!!  If you don't like this place, you're not from around here, that's for sure.  It's definitely not for your average gringo.  This was the first restaurant that I ever went to as a child, and we kept going back because you can have screaming kids, and no one gets on your case about it.  This is truly a family restaurant beyond all family restaurants!    Great atmosphere, great margaritas, great food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "JPEp9OrW0HLZUQ4t-ODM6w"
  },
  "ezOZzHsAdpTmL6Iw_qEnDg": {
    "date": "9/30/2016",
    "text": "Great good and chill atmosphere!  Really good rice and beans which others can't get right. .We will be back!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8GAjQiX6ar77sW-xtPtc7Q"
  },
  "A3Ts9UYfAI0kqmuC_nqJ6w": {
    "date": "7/5/2017",
    "text": "Go to some Burros down the street, save time and money! This place is not worth the price and you can tell that their red enchilada sauce is CANNED which is a disgrace for any \"authentic\" Mexican restaurant. Chips and salsa are decent",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "36vXhwsmhFQdsvMpprRV9Q"
  },
  "Z_Ms2pF8C-e1hDEbJMwRng": {
    "date": "3/26/2016",
    "text": "Ate here with my family. Got there there was a wait and the place was empty.  The hostess was trying to sit us by the entrance and there was there plenty of empty booths. I don't know how long the place has been open but it looked like they just broke in and set up a restaurant. Ceilings tiles are broken. Lightning was like I was in an interrogation room.  Food took a long time. The water tasted like it was unfiltered and straight from the tap. Food was a 4 out of 10. The waiter was very good and attentive. I felt bad not leaving him a tip. But I can't continue tipping when the food is not that great. Sorry. I am not one to complain. I eat in illegal backyard restaurants in LA and lunch trucks in the streets. Sorry for bad review. Hopefully this can help improve the restaurant",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "REWF868KMUBBU5G0eatmcw"
  },
  "XQ-WkiUYkvcVHZOyGUZxIw": {
    "date": "1/7/2015",
    "text": "Super good Mexican food in Tempe. Started with joAnnas special- a nice cheese crisp tostada with green chile and pork-  which was delicious.  The green enchilada sauce on the burros is really good. Best green enchilada sauce I've found.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_biT8GkbJE4_gMyzWT0pHw"
  },
  "kSmNDPYEvVmadxEElnBAEg": {
    "date": "3/4/2017",
    "text": "Casa is a racist and sexist organization. Don't ever go here. They are the worst and will suffer from this. Can't wait until they go out of business.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "z4JAnBZMRpEmtO2MilFFlw"
  },
  "n5ZFuoV8ru7HMAggSbGPJg": {
    "date": "5/31/2015",
    "text": "I am going to start this out with 4 stars, because I really only have had one entree here...and it's a 5 star one. Will re-review when I have tried more.  This place is NOT a dive, as I have seen written on another review. They clearly do not know what a dive is. If they want to see a dive that would have been closer to this family's old restaurant (El Rey) they had in globe which I drove all the way from Tempe a few times to eat at. That was my destination. I would never call it a dive though, I have too much respect for their food. I prefer, hole in the wall or hidden gem. It did have torn seats, but I loved it all. It had such an authenticity and reminded me of times past.   Back to Casa Reynoso. I had the bean burrito green enchilada style once, and have been hard pressed to try anything else. I could eat it every day. They make some of the best beans I have had, and the burrito enchilada style is pretty near perfection.  I mainly get to-go here, but last night actually ate there. Again, not a dive, no complaints whatsoever in seating, decor, etc. Also, not as loud as most chains. Our server (manager I think) was a bit obnoxious, but not enough to deter me from going again.   All in all, I highly recommend this place. I was bummed when the El Rey closed (I found out after taking a drive up), but I was SO elated to know the family had other restaurants down here. This one's about a mile from my house. SWEET!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-g7zjzr4hP_naep0Ed_F9Q"
  },
  "j2z8fh67ZbY3QSFcGYkBFA": {
    "date": "8/29/2016",
    "text": "Best homemade Mexican food there is, I have been going here since I was 2 years old and I am now 20 . Always friendly service and the best food for food prices. They have decent wait times, because there so busy as well. But it's definitely worth the wait!!!! Love them and the food!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xy1PNMJabcD6pAcOzx1EEQ"
  },
  "JA0Pc905rPx35ZgJXzPJBA": {
    "date": "3/12/2016",
    "text": "Don't come here if you want Mexican food go to filibertos. It's a little better than this place. You won't feel rushed! THE FOOD WILL BE SO MUCH MORE DELICIOUS!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RCm1Wb0MRytNmrTHkCe1iw"
  },
  "V3v4uW1PYTsTrhvVHaIcxg": {
    "date": "8/14/2017",
    "text": "Bland, unimaginative Mexican food.  Had to wait a while to be seated, not because the place was full, but because they were understaffed.  Menu is small, the food was boring, and very salty.  I guess there is a market for this, but it was a very forgettable experience.  Also, even though we were there for under 30 minutes, we had to endure the same loop of music twice...yeah, the Mexican Hat Dance.  Maybe this is considered as passable Mexican food and ambiance in Iowa or something like that, I expect more from my city than this flavorless spot.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W6ofirwEbTBuUnetZjaruQ"
  },
  "TaIXKljQ-0DodxIWJhTpZQ": {
    "date": "10/29/2014",
    "text": "This place isn't your fanciest Mexican restaurant, but for authenticity it's awesome. It starts with chips and salsa and this isn't any ordinary salsa it's hot and yummy! For dinner I had the golla burro with melted butter on top. I think it's their specialty. Anyway it's really fresh and delicious and authentic. I would give this restaurant five stars if the interior was a little nicer, but for taste it's a five.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dD-7_HR0y0FdgfyqA8w21A",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. No 9!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dD-7_HR0y0FdgfyqA8w21A/o.jpg"
      },
      {
        "img_id": "2djpR8d5it5I1V-D784osQ",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. Gollo burro",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2djpR8d5it5I1V-D784osQ/o.jpg"
      },
      {
        "img_id": "6_Y8IsXCDobIt3s6KsF7xw",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. Cheese enchiladas. Yum!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6_Y8IsXCDobIt3s6KsF7xw/o.jpg"
      }
    ],
    "user_id": "141lhbCGhduUaFs17MAnww"
  },
  "l6dhBtSMfonwq-770c2W7w": {
    "date": "8/9/2016",
    "text": "My all time favorite restaurant! The food is sooo good best salsa I've ever had. Cheese crisp is great! The rice and beans are amazing..... and my favorite is a green chili mix burro enchilada style .... delicious!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "58YttSuHZt7ReRg8YhOpzA"
  },
  "OaeJPBTLMIAQ51uZYW1ZkA": {
    "date": "8/23/2014",
    "text": "I had the combo plate with chile relleno (the Globe version is better, but it was good), shredded beef taco, and cheese enchilada.  I thought the food was very good.  I forgot to ask about the hotter salsa (doh) but enjoyed their regular salsa and chips.  The iced tea was very, very good.  Overall, with the extremely excellent service, this was a great choice and a great visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H3KluKXf1mp3etCToCJhqg"
  },
  "ldXiE9YtA3-jRKL9fDnHEg": {
    "date": "8/7/2016",
    "text": "Slow service. Got drinks but getting the meal took a long time. I went here before and the service was quick.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lGP_uwCb7tqYwMxdR9nk9g"
  },
  "G9PxW45afpc12NXaD-k6rw": {
    "date": "6/26/2015",
    "text": "This place is actually quite good, for a literal corner spot restaurant. The wonderful family that runs it is beyond nice and goes above and beyond for service.   The food is very delicious. 6 stars if they had the option. Enchiladas are my favorite. I also am in love with the carne asada.... so good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lm4jw84jzA_1YDA175AEow"
  },
  "H0NbCUtCr28zT4o62JD4jA": {
    "date": "9/13/2015",
    "text": "C and I went here to help C's friend celebrate his birthday.  The vibe of this place is old time mexican restaurant. I don't mean a cool new restaurant that decorated to make it feel nostalgic. I mean it's a restaurant that hasn't changed since 1984 when they first opened. If that's your thing, ok. We got there around 3 on a Saturday afternoon. The dining room was empty, but it took awhile for them to set up a space for our group of 9. I found that kind of funny because we waited for 10+ minutes and yet they sat us at two separate tables. Seriously? Why were we waiting for 10 minutes?  While we waited though, I did read some of the reviews for this place.  Our server was ok. She did her job. She took the order, brought the drinks, brought the food, did a little small talk and brought us the check when lunch was done. Nothing special but good enough. The food was boring. Really, nothing special AT ALL. I'm not knocking it, but then again, I'm not praising it either.  There are a lot of family owned Mexican restaurants around so there's no reason for me to seek this place out. The chips and salsa were not memorable at all. I'm still amazed at how many mexican restaurants in the valley have tomatoey watery boring salsa but people rave about the stuff. Seriously? I know the place has long closed but the roasted chile salsa that Chevy's served was the bomb. This red liquidy crap I find consistently around the valley is junk.  I would rather have Herdez salsa from the grocery store. And the chips. Again, nothing special. I ordered the Golla burro enchilada style ($7.50) after it was recommended by the parents of the birthday boy. Pretty normal, non descript burrito. C got a cheese crisp ($4.95). He gave it a thumbs up so I guess if you're heading out for a cheese crisp and you're in this neighborhood, have at it. I think the $3.00 upcharge for beans and rice seems a bit steep. That would have put me at $10.50 for a burrito with rice & beans. Way overpriced considering what the neighbors like Macayo's and/or Abuelo's would charge for the same thing, and it would have been better. I would agree with one review I read that said \"All mexican food should come with beans and rice\". I agree. Average food, average service, a bit pricey. 2 Stars.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 8,
      "cool": 10
    },
    "photos": [],
    "user_id": "5UYjT5YDKSuApFax2t2eqg"
  },
  "9lytVDy5cCU0MllBjqwCPg": {
    "date": "3/12/2016",
    "text": "The food is great. Family atmosphere and def a \"hole in the wall\" for decor. Great spot for authentic Mexican.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fxd4u1AFuOqxUkwxKRf_yA"
  },
  "EYxDdE3I5d-1wSQOyNdVKw": {
    "date": "7/6/2016",
    "text": "It was ok, nothing too authentic about this place. The rice and enchiladas had a weird taste . Would not go out of my way to come back to this place when I travel back to Phoenix.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d_OXZeIqh-iMCORejAqh1w"
  },
  "UTqNYsP9Y3A1oLwJMXaUCQ": {
    "date": "3/10/2017",
    "text": "Great local Mexican food. When. I come in the service is with a smile, the proprietor greets us and we have a outstanding combination plate. Usually good beer selection and best beans and tortillas in Tempe.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "40s0uofTW5OW_EtPe-LR9g"
  },
  "HCZGyvf-pLk0Z21Xa62Caw": {
    "date": "6/18/2016",
    "text": "So I came to this restaurant with a friend who was recommended by her brother. It was our first time for both of us and we had decided we wanted Mexican but authentic Mexican food this place is the place to go. I have neve red tried relleno before and it was AMAZING!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LniQXG83oMdoUb1VgII5qQ",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LniQXG83oMdoUb1VgII5qQ/o.jpg"
      },
      {
        "img_id": "D7uBXX3xEGGGdjgMyUhJGA",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/D7uBXX3xEGGGdjgMyUhJGA/o.jpg"
      }
    ],
    "user_id": "MoAJ6CbaUtMiyNCwENXxHg"
  },
  "k8FYn7zHrnwp9vb4j91kLw": {
    "date": "6/24/2015",
    "text": "If your from Globe Miami, well you know all to well this is a great place!  when we cant make it home to Globe for our yummie food...   Love my regular or half and half red chilie burro and meat, enchilada style ( what we call a burrito when your from Globe /Miami..    Great Salsa always consistent.  Thanks for being in the Valley..",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "oGZTR2Y9c__gnvfkBR1T4A"
  },
  "mHgHJ3VXQ98uf9LQa4aXww": {
    "date": "9/11/2016",
    "text": "I love this restaurant. I live in Orange County, CA and we just don't have Mexican food like they do in AZ. I'm originally from Yuma, AZ and they have amazing Mexican food that really can't be competed with. Except for this restaurant... They are right up there with Yuma Mexican food. Amazing tortillas and refried beans.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "EyTUZLf-tHpe1bC0RyUPIw"
  },
  "z1GrpW-xAXxOBKZpi96PlA": {
    "date": "4/30/2016",
    "text": "This place is always amazing!!! The food always tastes delicious. The service is fast and kind. The food is delivered very quickly. They have a side sports bar for the me. That want to watch sports. And for the moms they have high chairs! The salsa and chips taste homemade (which they probably are :)) and I could eat pints of the stuff! I highly recommend this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pTAaRQAGSWKKRWOwJBPulw",
        "caption": "Photo of Casa Reynoso - Tempe, AZ, United States. Gollo green pork burrito",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pTAaRQAGSWKKRWOwJBPulw/o.jpg"
      }
    ],
    "user_id": "_YWYEFxyzfpIEWHLyoqJQg"
  },
  "Vbahz_K5PWNgVfta7FSsYA": {
    "date": "3/19/2017",
    "text": "Visiting from NC. Found this place with great reviews. Chips were gummmy. Guac wasn't fresh defineitly not made in house. Didn't have queso. Service was eh. Rice was super dry. Not impressed.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wraq2eBGwPvDr55VzLB97Q"
  },
  "zXtqlk86bUmcMBRFNT2NMw": {
    "date": "10/14/2016",
    "text": "I didn't feel like there was anything special about this place. I had chicken tacos with a side of rice and beans with a strawberry margarita and it was alright, but nothing stellar. My taco in particular was just really bland and not really flavorful. Definitely have had better. A lot of people seem to really like this place, so check it out if you're in the area but I don't see myself coming back here in the future.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GCGiOKHumMP98k80psP3fw"
  },
  "maPOFaOQ9gNHnJH18tadPA": {
    "date": "3/9/2016",
    "text": "The waitress was nice. The food was bland. What should have warned me was the extremely hot plate. Like it was warmed in the microwave.   Ordered the Burro enchilada style. Paid an extra $2.95 for rice and beans. The rice was dry, and the amount of beans/rice was not worth the extra money.   My husband did not like it either. His enchilada was mostly tortilla. Both of us got the runs the next day.   Not sure how this place gets so many stars.  I should have said something when we were there.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CB9x1FOM66p4KEZAM366Ig"
  },
  "76F0NOq4fJN8jAdWS_B6Tw": {
    "date": "10/24/2016",
    "text": "Staff was friendly and quick. Food was mediocre Mexican. Nothing was note-worthy. Maybe they have menu items that are their specialties and I just missed out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gxCWcWXSEnkbM7HwUDr4xQ"
  },
  "Gh4TAuwEPnPfyXCx1ZcoPA": {
    "date": "12/5/2012",
    "text": "Pretty good.  Another gentleman (Bowie P) reported in his quite negative review of this place that he was led to a booth with a seat cushion that had a rather large (8-inch) gash in it.  My guess is that I was sitting in that very same booth, although they taped up the hole at some point since June.  It was still not the most comfortable place to sit, mind you. . .  The food was good tasting, with a distinctive flavor.  Some of the better rice and beans I've had too.  Service did not always strike me as the most sincere, and my drink refill was just banged on the table on one occasion.  Still not bad.  Kind of a '70s or '80s look to the place--some of the decor though, as attractive as it was, seemed caked in dust.  Not perfect, but a sizable and tasty meal.  Price average.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "oWd7wL340Z9JiGf5Wu_bSQ"
  },
  "8LFKAu64AqIxcfvJeDfxaA": {
    "date": "8/26/2017",
    "text": "This is the shittiest Mexican food I've ever had in my whole entire life and I've gotten food poisoning from Taco Bell. I'm so not a picky eater but I spent $30 on cracked empty tiny tacos and a dry almost empty quesadilla with salsa that has literally no flavor. I've never written a bad review on a place in my whole entire life but this is so bad people need to not go here.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eGv7yr5haum7opzcqOZxJQ"
  },
  "K1atc_MVaHAZWoI7Hz5mAg": {
    "date": "8/1/2016",
    "text": "I love the Mexican food here. The salsa is the best the only bummer is you only get one chips and salsa and have to pay for refills, which I have never heard of a restaurant doing. Food is great and tastes very homemade. I've been to their other locations and I would have to say this one is better! I know they are the same owners but it must be the cooks because I had the same dish as 2 other locations and he Mill location was WAY better! This is my go-to Mexican food restaurant and the location I prefer!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LbHkUFKhLgLIraBvWsx7pg"
  },
  "fb7sGxChZyWlCzHxIJ2VEA": {
    "date": "7/14/2017",
    "text": "If you are looking for the worst salsa in Tempe you've come to the right place.   It's too hot and   tasteless and gets the dinner off to a bad start.    Seems they've had a lot of years to get it right  perhaps like Rosita's salsa.    And  rice and beans as extras on a on a \"combo\" plate is somewhat curious and adding to the cost.  But the service was good as was the food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gHuXfh_Cda_rIeZg2OiqHA"
  },
  "Dj8I70rVBKID4dxLfiKqvg": {
    "date": "7/1/2015",
    "text": "I've been within miles of this place for years, never tried it. But the fiance and I were nearby last night and we LOVE to try new Mexican places so we went for an early dinner.  We were seated quickly (yay), but before I even put my butt in the seat, a tiny little kid came running and clinged to our server's leg. It was cute... at first. The whole time we were there (an hr +), there was an entire family of children running around the restaurant, from toddler to school age, about 4-5 of them. Talk about a \"family\" restaurant.   Salsa is a red chili salsa, it's not too bad, has some kick but the flavor is nothing special. It was served with about 7 whole chips on top of chip crumbs. Why, why would you serve something we can barely even dip into the salsa without covering our finger tips??  Fiance ordered a small frozen, strawberry margarita which was pretty tasty.  I thought the guac was ok, the avocado was smooth, like it was made in a blender (ugh) with some kinda chunky stuff in it (white onion, queso blanco?) and it was a little spicy. But we definitely prefer many other guacamoles to this one...especially since they served it with BURNT chips. Who the hell likes burned tortilla chips?  Chip crumbs and burned chips...  I got the taco salad with chicken. The chicken itself was delicious, however, the only thing in the salad is lettuce, tomato, onion & cheese (and I requested No Tomato, which they did but then it was basically chicken and lettuce). What the hell, where are the beans and rice? Even a Taco Bell taco salad has those ingredients.  I personally, would have given this place one more chance but the fiance, he thought it outright sucked (worse than Suzie's, go there for a most horrible experience or if you love super bland, boring food) and was super pissed about the chip crumbs and burned chips because those are the simplest of things to do correctly.  Took forever for the bill to come (pretty sure the lady was dealin with those kids runnin around).  There is no risk taking in the flavor of these dishes. My Mexican home cooking beats this place by far and I'm no professional cook.   If you want a great Mexican food experience, try Poncho's in Phoenix. All of their food is amazing and their house made margaritas are fantastic.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "lfAN8WMaj7YsW53xZ85HxQ"
  },
  "_56ubTtLf2wsCxw_tYw5ig": {
    "date": "3/15/2015",
    "text": "My boyfriend and I were trying to think of a place to eat and I suggested Casa Reynoso as I have driven past it many times. We waited quite a while to be seated (but it was a Friday night so no big deal). The chips and salsa were delicious and dangerous and the supply never was allowed to get low by any passing employee.  We ordered two margaritas - which were huge and okay in flavor. I got a taco (OK), enchilada (good), and a burro (terrible). My boyfriend got a tamale instead of the burro and said it was delicious.  The guacamole was terrible. I've made better ones out of a bag and an avocado.  You have to take your check up to the counter as well.  Basically, not the worst Mexican food, but certainly not the best. We might go back as a matter of convienece.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_cX5QLnhhvqet9k4Q1HB6Q"
  },
  "uRLnfWmItRgmtgVfHoomNw": {
    "date": "3/25/2015",
    "text": "The food at Reynoso is always amazing the problem we have continued running into here is the service. Don't get me wrong the people are awesome and friendly it just takes forever to get anything done. We tried to go here a couple Sundays ago, we got in about 10:30 or 11 there were a few folks in front of us waiting even though the dinning room was empty. No big deal. So we put our name on the list watched the folks in front of us get seated then they seated a party of two that came in about ten minutes after us. We just turned around and left. It's a pattern of just horrible service, Once we waited about 20 minutes after we finished eating to get the check then she went up and paid while we waited for the waitress that dropped of the check to come back with boxes it took another 10 minutes. The always apologies and are super nice about it but it just isn't enough.   So after many years of loving Reynoso we have just decided not to bother it ends up stressing us out, and dinning out should be a relaxing experience.  If we want Mexican on the weekend we just make sure to stop by Rito's now that they have Saturday hours. You have to wait but the food is worth it and it's never a hassle.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SCxMGneZfEvGgW_akxZ7tg"
  },
  "ddPNIjgJjnR5sAPICCC11Q": {
    "date": "9/6/2016",
    "text": "Best, best, best green chile burro I've ever had!  Super sweet owner/family operated.  I can't wait to sample everything on their menu.  This is authentic home cooked comida!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Ah3OcYh80bbozhNQwKD8A"
  },
  "QqpdGZAzwleDwSd9DsyeAw": {
    "date": "3/16/2015",
    "text": "Went here after googling best mexican restaurants in Tempe. We had 6 adults who were looking for a good mexican lunch on Sunday. Once in the restaurant we all were a little concerned about actually staying and eating. The place is old and outdated. The center was being re-painted and all establishments had hanging plastice banners to identify each business.  The entrance has some old outdated video game welcoming you along with an A-frame marketing board leaning against the wall. The tables were old formica topped. My first inclination was this place needed some major TLC. Not being judgemental on the patrons but they mostly seemed to fit in to the whole ambiance. I did enjoy the family pictures.  Having some sort of tablecloths (preferably linen) on the tables would have gone a long ways to classing the place up...that and cleaning up the entrance...remember in business the first impression is the perception of your establishment.   As we finally told our waiter we were still deciding if we were going to eat that we would most likely just have chips and salsa and drinks. He seemed to take it happy go lucky. As we were ready to leave along comes Tony from the kitchen...come to find out it is Tony Reynoso, owner of the restaurant. He somehow got the message we were reluctant to eat at his place. He told the waiter to get us a cheese crisp on him and then told us his whole story and how wonderful the food was. His description of the Bollo Burro made us all stay and try the food. The cheese crisp is wonderful. The difference is the tortilla and they butter one side of it before putting on the cheese.   I rate a good mexican restaurant by 3 things first; the chips (they were the worst part of the whole experience, almost store bought texture and flavor) salsa (this was very good and we also asked for the hotter house version which was even better) and beans (these were the bomb as they were made with lard;the real mexican way). The enchilada style bullo burro was excellent along with the fabulous beans and rice. Everyone had a nice meal and we all vowed to return.  This review just goes to show do not judge all restaurants by their ambiance (even though for me to make this part of my rotating restaurant list it would need to be cleaned up and classed up a bit). Without an astute owner and determined business acumen in Tony we would have left, not enjoyed the great food and not have spent $135 on lunch for 6. Thanks Tony, well done to a passionate restaurant owner!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ElTSSJXkFlfUSdK-x7Vwew"
  },
  "1M18iBwlv6XWgsWv5d-V-A": {
    "date": "4/12/2015",
    "text": "Not bad, but not great, so I'm torn between 2 and 3 stars here. Ordered the vegetarian burro enchilada style. It came filled with what was very obviously packaged salad mix, plus some whole beans. Was that really the most interested vegetarian option they could think of? Enchilada sauce was okay, salsa with the chips was decent, prices were cheap, portions were huge.  They warned the plate was hot when they brought it to the table, and they weren't kidding--I accidentally hit my arm on it and ended up with a nice 3\" long burn. It's been over a week and the red line of the burn is still visible. Be careful!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E1XY_2PaLNcrPc0fTFUPSg"
  },
  "GqJx2l5tezjqpwUCHhzplg": {
    "date": "3/8/2015",
    "text": "They've got some bomb ass chile relleno here!  Everytime I go in I tell myself \"ok, let's try something new this time\" - but always seem to end up with a steaming hot plate of chile relleno.  I don't know what they're doing different here, but this one stands out.  The green chili is bomb too, I'd put that $h!t on my cheerios.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "K6GM4-fMcVPG77lzgpOHeQ"
  },
  "ZuRMc9HskXJ4c2Rh6xN7Ag": {
    "date": "10/23/2014",
    "text": "Was here for a meeting that didn't happen.  Nothing to do with the restaurant.   Decided to stay for lunch.   I have eaten here once before.  The food is mediocre,  which is too bad considering they use family recipes.   Essex the food is bland.  I am sure they could do a lot better if they wanted to.   Also, the portions are a lot smaller than most Mexican restaurants.   They did NOT change for more chips.   Probably would be doing me a favor if they did.   The chips were very good 5. Almost seemed like they were baked instead of fried.  Service was a little slow but very good and friendly.   Would I come back here?   If I wanted Mexican food and I was in the area,  I might.  It would never be a destination,  however.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "be4Y79c85n3Dk_TlssM08Q"
  },
  "bUtlNphgxmBx1MXfybjD4Q": {
    "date": "4/29/2016",
    "text": "This place was great.  The setup is not the best though, and gave a bit of a bad impression to me. The day we went there was a long line once we got inside, and the bulletin sign said please wait to be seated. We had waited quite a while, and didn't know we had to go all the way around the entry to go and sign in. If you had never been there like me, you wouldn't know what to do, the sign is misleading.. The customer service once we were seated was outstanding. The young waiter had a great knowledge of the menu and also had given us a few samples since we had never been there before. He even came over a few times once we tried it and checked up on us, to see how we liked it. The green chili pork burrito was amazing and large. I could have easily split it with my husband and been satisfied. I will be coming here again in the future.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pep10_GhT09Y703K5cboGQ"
  }
}