{
  "uOhmgHEj4M7DCxQk80QMAw": {
    "date": "10/8/2013",
    "text": "Went here for lunch last week. Place is easy to find and actually pretty big on the inside. Staff is nice and I like how they have a outdoor eating area. I've always wanted to try this place and it was alright. I like the soda machine how it is up to date with a lot of options. The menu is pretty small but not too big. I got a salad with fruit and I thought the fruit was on the side, but it was in the salad. Overall I didn't like the salad but ate it since my mom paid for it. I don't eat bread or pasta so there was not a lot of choices for me at all which was disspointing. Probably won't be coming back here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "rPJZ0Bh1Dj-Rw6Yu3iQwVQ"
  },
  "Y2qXI77C0GinatP-444Tzw": {
    "date": "7/24/2012",
    "text": "I JUST had lunch there today and REALLY enjoyed the food...  which says a lot being that they push health consciousness at this spot.    The food was not over seasoned or pretentious.  I had the Chicken kabob entree (which you see in one of the pictures).  It cost about $8.99 and was well worth the money.  It came with a Mediterrranean salad, rice pilaf and slices of pita bread and two chicken kabob skewers.  The meat was grilled perfectly and had a nice, simple taste.   I was a little overwhelmed by the menu, as this was my first visit and was unsure of what I wanted...  If I had that same plate with a little hummus with it, I think I'd probably have done cartwheels right there...  so until they come up with THAT plate...  I will save my acrobatics.    Rest assured though...  (In my Arnold voice) I WILL be back...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j4--__JCXh5Vaal7VISVKg"
  },
  "gcouU7y_YUlCvWXkP1fvYw": {
    "date": "11/16/2013",
    "text": "The chicken kabobs were quite disappointing. The chicken was super dry. However, the sides that came with it was good. We also got the beef kabobs. Those were much much better. The beef was moist and tender. The potatoes were excellent. Also from those two, the hummus and pita was ok. I've had better but it's worth getting. Btw, don't forget the cookie. That's pretty good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2MANvtM2H8w33p6f9SBwJQ"
  },
  "CT8sFvokxtVIbI6PvkgC5g": {
    "date": "7/8/2013",
    "text": "This place is great! Friendly service, and amazing food for a good price. It was my first time in today and I will be back many more times.They have many different gluten free options on the back of the menu, which helped me out a lot. They also make their hummus fresh. It is a must have!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Ubrk0bhmR3UKcz6RCx60Rw"
  },
  "iahhMmWqINXjSbTQTceKiQ": {
    "date": "7/8/2013",
    "text": "It's healthy, it's easy, it's fast, it's cheap. This is a great lunch spot during the week. The staff is extremely friendly, and they will substitute anything and don't get mad when you want to make 100 modifications (sorry...and thanks). Chicken kabobs and white beans are the best thing on the menu in my opinion. And that pop machine is LEGIT.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "ltjyJsQQu_AjiqS6ksxw0A"
  },
  "Af57RJ3Ke1UZxayR9ftemA": {
    "date": "11/2/2012",
    "text": "I stopped in today for lunch and was impressed. I had the spinach wraps with chicken and grilled veggies.  The wraps were super fresh & delicious and the veggies were good, too. I'll definitely be going back to try some of their other items.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VFQ_-O7r1rP39mUN_oY4Mw"
  },
  "raMuio1QhoHmmnw809a9ag": {
    "date": "9/16/2011",
    "text": "So happy they have a location in Old Town now! When my co workers and I try to figure out where to go to lunch, we ALWAYS consider Zoe's.  They are super efficient and the food is really consistent.  I had the steak sandwich last time and talked about it for the next two hours. Would also recommend the chicken roll ups. I've only ever gotten the pasta salad as a side but I'm sure the other sides are delicious too!  I was surprised to learn that it was a chain but don't let that scare you off!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PPgyaeI9Y52VErV5uHTDYQ"
  },
  "MAOUL2Zqh39EwHWYna0T1A": {
    "date": "11/4/2011",
    "text": "Fabulous menu great friendly service and amazing food !!!! Wish they had one of these in Tucson. Thankfully we make it here a few times a year :-) thanks for another amazing meal love the additions. Had the spinach wraps with slaw and hubby had the steak wraps. Oh also a cool trendy drink touchscreen fountain. I know I'm easily amused. Anther cool thing is the awesome art on the walls from the children's hospital.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jkY3LwqdVeHVdwK3DD_ogw",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States. Spinach wraps with slaw. Yum yum",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jkY3LwqdVeHVdwK3DD_ogw/o.jpg"
      }
    ],
    "user_id": "tmQog0zgNTTxYRLBsMvmFw"
  },
  "1qg9_mSu0IbhEkioS-2uRA": {
    "date": "10/13/2014",
    "text": "Great healthy food! Can't get enough if this place. Love the chicken and steak kabobs.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ap5WtuBRUI5ftlzl2Mv9Og"
  },
  "Cgmve7kBmmVg1XpPE1GXTA": {
    "date": "11/1/2011",
    "text": "Update: I have now tried most of the menu and love the \"gruben\", the turkey stack, the chicken orzo soup, the chicken salad, and the salad & hummus plate with chicken - the caramelized onions are so freakin good.  I would stay away from the chicken roll-ups. I will never understand why people put iceberg lettuce in hot things like this....it gets totally wilted and slimy, blech.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "kLNBn9afb_Y0cPifswBSTA",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States. Hummus &amp;amp; salad plate w/ chicken",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kLNBn9afb_Y0cPifswBSTA/o.jpg"
      }
    ],
    "user_id": "JV4mCFFKgf_AurjiAXqq7w"
  },
  "AH349kHV-R25pIo7Txe3LQ": {
    "date": "3/4/2012",
    "text": "Very good, healthy food. Had the spinach roll ups w/ chicken. They were very tasty. Came with a side of hot sauce. The real star was the grilled vegetables as the side order. Great flavor! Carrots, broccoli, onions and mushrooms with a grilled flavor that was amazing.I could of just eaten a bowl of this it was soooo good. Chocolate cake pretty good but you could taste the sugar granules. Wife had soup (chicken orzo) and salad and said it was very good. Cool coke machine here to get your fountain drinks. I had iced tea which was good. Will definitely return as I want to try the chicken kabobs. update: had the chicken kabobs several times now. 2 skewers w/ rice and salad- best meal around for under $10. Zoes is our new fav spot!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o-GAkbTTcHFY3KqVDCE8sA"
  },
  "-3QkCs3CZ8j71vXAL8g1lg": {
    "date": "10/25/2013",
    "text": "Food is excellent. Much better than Pita Jungle, in my opinion. Fair prices too, for good portions.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "aHX4jtJYIdRuJip7sSKSnw"
  },
  "yuWp4_ZqQIv0TJlbYJixAQ": {
    "date": "9/5/2011",
    "text": "One of my favorite quick eats in old town. Great selection spanning many food genres.   Try the cookies after lunch or dinner..  +++ And they have the magic soda fountain!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "TOxBGs3yzAsh5BMp1W8tiw"
  },
  "Gm95v7LtkbTB_nxh9BsjvQ": {
    "date": "10/13/2013",
    "text": "Reasonably priced and fresh ingredients. I got the spinach roll up with side of beans, husband got the steak sandwich, and sister in law got a salad. Everything was delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qjrn5UsK2HBZxx40HYA1iQ"
  },
  "Eiv2D91RyluRYlmsYbl2Cg": {
    "date": "5/19/2013",
    "text": "This is a great quick service Greek restaurant for eating in or taking to go. Good healthy options & quality food. I go here for the chicken or steak kabobs regularly with a side of grilled vegetables. It always tastes good, and makes eating healthy pretty enjoyable. This gets 4 stars out of a possible 4 stars for the type of restaurant they are. I am a regular here, and will continue to be.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-8KyX-3VrqGuHeQWKDJxxg"
  },
  "tWq1dkA1PacBJzw4bi5ZxQ": {
    "date": "3/24/2013",
    "text": "What a great find!  Down for the my first spring training and will definitely go back to this place. David and his crew were on the mark. I had the  HUMMUS & PITA - Excellent TABOULI SALAD - Fantastic w/ STEAK KABOBS",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8h3WbTpxLEaKgoTExZh_9g"
  },
  "VPF8yc2tL8ipmb55Tal6Ng": {
    "date": "12/7/2014",
    "text": "Went here for lunch today at this location for the first time and my husband takes a bite into broken pieces of GLASS in his food!! He ordered the Gruben sandwich and it was in the slaw part. He spit out a chunk of broken glass, dug around on his plate and found more little broken pieces! We told the manager, she apologized then said \"Oh I'm sure you're fine.\" Im glad she was so sure of that! Not much empathy from her. Then said they mix the slaw with their hands so this shouldn't have happened. Uhhh ok?!?! She offered to refund us on the sandwich and not the rest of our food. Us and the other couple we were with did not want to continue eating our obviously so we asked for a refund for all of our food, you would think she would've done that in the first place without us asking. Luckily my husband did not have any cuts or swallow any of it. Not going back! Very very odd response from this manager!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZoaLoMpFL3PnaXes-TMmUg"
  },
  "s-504m3soWBost4KZmkn1g": {
    "date": "7/15/2011",
    "text": "This new lunch spot is going into my regular rotation. I stopped by here with a friend here for lunch and found that they just happened to be handing out coupons for a free lunch. Talk about lucky! We were debating between giving this place a try or going to Olive and Ivy (they have a market with cheaper options for lunch) but the mention of \"free\" made the decision for us. I did check out the prices on the menu, though, and both our meals would have been less than $10 which I try to keep as my upper price limit for a workday lunch.   I got a chicken pita which was very tasty but it kind of fell apart since the pita was so thin. It was a substantial amount of chicken and there were also veggies with a vinaigrette on them which I really enjoyed since I don't like the creamy yogurt sauce that most Greek places use. It came with a pasta salad that I was informed by the menu had no mayo but still appeared to be creamy. A quick taste test assured me that the creaminess was cheese... I am not sure if it was a very mild feta or a soft fresh mozzarella... but either way it was delish! My friend got the spinach roll-ups and they looked fantastic. I will definitely try those next time. They came with a side of salsa to dip them in so that is right up my alley. I did not use the space-age soda machine since it was surrounded by a gaggle of kids in awe of its features and options. Instead I had the hibiscus iced tea and it was lovely.   I like the decor of this place. Clean and simple seating, but with some funky art on the wall to keep it from looking too corporate. Even though it was order at the counter, they also had people roaming around to pick up dirty dishes and offering to refill drinks. Everyone working there seemed friendly and happy so that always helps to make a good experience. Overall the food was nothing mind-blowing... good but not exceptional. But I got very excited about this place just because I need more options nearby for lunch that are healthy, cheap, and fast. I will definitely return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tsm8VraTp5OGyVALtUiCeQ"
  },
  "cwtzNBsD2oQNHwALfAaUwQ": {
    "date": "9/24/2015",
    "text": "Supposed to be open until 9?? I called at  8 40 for a take out and was told they are no longer accepting orders. False advertising",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mHfwu2pMsckH7385nvlKmg"
  },
  "-DaGLCHe_e8p2-1IBq4lXg": {
    "date": "8/15/2015",
    "text": "I've only had one visit to Zoe's so far and it was last Sunday afternoon. For the most part, it seems like a great place. The location is in the middle of a huge shopping location and within walking distance from all the entertainment of Old Town. The theme of the food is Mediterranean, which I love. It wouldn't surprise me that if I pay more visits here, that I would bump my rating up to four stars instead of three, but I have to base my review on my one visit. I bumped my rating down to three because I came here primarily for the shish kabobs. You see, I've been really into shish kabobs lately and I have to say my standards are really high after having some really excellent shish kabobs at another restaurant not too long ago. The steak shish kabobs that I had at Zoe's were really chewy. The flavor was not bad (could be better), but I was really hoping for something tender; the kind that tears up easily with not much effort from my spoon and fork. Although, it left me kind of disappointed, I wouldn't be opposed to going back for something quick to eat. I just won't order the steak shish kabobs.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FPY-JVQi9T1qBVBn5n98RA"
  },
  "25A6SMJweol0U8f99ZPrSg": {
    "date": "8/7/2015",
    "text": "This has been one of my favorite places for quick, healthy, delicious food for years. It's always fresh and quick and I love getting a container of the chicken salad for lunch the next day.  I usually go to the location on 7th Ave but was in a hurry on my way home from work and stopped at this location last week. I got a chicken sandwich and potato salad to go. Upon taking my first bite on my drive home I found a 2 and a half foot long hair attached to the bite in my mouth and the sandwich in my hand. I didn't have time to turn around and ended up only eating the potato salad after throughly searching it for more hair. I'm disgusted that there are people working on their kitchen with long hair and aren't putting it up. I am sad that I can't trust this company anymore because the foods is super delicious but I won't be returning to any of the locations.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "miepq3HUDhPJ3t_q5rc1hA"
  },
  "utALzkJadkIC-Ymc_zgwdA": {
    "date": "3/29/2012",
    "text": "For approximately 5 months... I've decided to go with healthier food choices when cooking at home and when i do go out I don't like eating heavy unless it's a special occasion or cheat food night where we allow ourselves an unhealthy meal or dessert. With Zoe's I feel I'm eating healthy and tasty food when eating out. After eating at Zoe's, I don't feel awful like I just inhaled a fatty meal.  i love the Greek salad and the hummus..yum it's one of my favorites. overall I will be back and might try something different next time. I do wish they had another location that was closer to me? that would be great.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "W9MPolPlUiUEXYfGnYiHEQ"
  },
  "CQ_rWaP5pduBMsNeN5GbPw": {
    "date": "5/11/2012",
    "text": "My office is not too far away from here and a Zoe's employee stopped in to drop off a menu along with some hummus, pita, and a free entree coupon a little bit ago... I really couldn't NOT eat here when a company's so eager to be tried.   My To Go order was accurately taken and ready within the allotted time given. Now if only I could find a parking spot in time. Scottsdale drivers are crazy during lunch. Somehow, I managed to make it into Zoe's in one piece.   The cashier was super friendly and upbeat, which was nice after nearly being run over by some lady with giant Lady Gaga sunglasses and a cell phone superglued to her face. He let me know that my Zoe's cup that I'd gotten from a Yelp event meant I get 99 cent drink refills. Heck yes, hook me up! They have one of those fancy Coke machines that lets you create all sorts of drink flavors, but I'm boring and got a Sprite. Unfortunately, not everyone is as boring as I, so the line can get a little long for a drink as people slowly decide on their half Cherry Vanilla Dr. Peppers with half lemonade.   My egg salad sandwich was good, the pasta salad was tasty, and next time I'm getting something healthier and probably more generally accepted when I say I'm going to a Mediterranian restaurant.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "lOBObjsCtw_eiyN7T_B75w"
  },
  "8wb8dDQmiuycE36iWjOyTw": {
    "date": "8/10/2015",
    "text": "This is the perfect spot to come for lunch... and I do often!!!   I eat here multiple times a week- fast, friendly, consistent and yummy.   The staff is exceptional and always deliver the little details that are important: napkins forks, dressing- etc.  I order to go a lot as I am always in a rush, and I never have to worry about double checking anything.   My favs: hummus trio, chicken salad sandwich and quinoa salad. All delish :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Af9-FL_o3x9uRTmPIEfy9Q"
  },
  "yfDu_Sh-W4Ungzrz6aD44g": {
    "date": "8/24/2016",
    "text": "Ate here tonight and always love it and have a great experience. The food is so healthy and fresh and everything I try is always better than the next. I usually get the Orzo salad (my favorite) but tonight I tried the protein platter and the slaw under the chicken is a great mix. It is a quick in and out lunch or dinner and thats what I always count on! Totally recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dPVtXqko3cqmS-hHSzai0Q"
  },
  "YqoSf4Izcr91aPJ9AxXg9A": {
    "date": "5/11/2012",
    "text": "The last time I went to Dallas I spent 3 days (out of my 4 day trip) lunching at Zoe's. I just couldn't get enough of their spinach roll-ups. When I heard Scottsdale had a few Zoe's with the same delish spinach roll-ups I shouted a yippee!  It turns out they make the spinach roll-ups just as good here in Phoenix. And the hummus app we ordered was pretty tasty as well! They also have this crazy soda machine where you can get a billion (or ok a couple dozen) types of soda out of one faucet. Pretty cool even if I found it to be a bit confusing.  I'm glad the good peeps in Dallas and Phoenix get to enjoy Zoes on a daily basis, but we Chicagoans want in too! Bring the spinach roll-ups to the Windy City please!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "om5ZiponkpRqUNa3pVPiRg"
  },
  "E0QaPmHmff_H-vtDOirTnQ": {
    "date": "9/11/2016",
    "text": "Looked healthy and fresh, but our order came out after two other orders for people after us in line. They also forgot the side pita bread for my salad. Salad was good and fruit was fresh. Altogether, not a bad place but okay service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AsQYtHvEAisTMsRXSJyLYQ"
  },
  "gZoGMiKsQ_R6Dbm0DLcezw": {
    "date": "10/2/2016",
    "text": "Always have a great experience at this location and the kids love it, I love the steak kebabs and chicken soup is the best closest to my mothers that I've ever tasted great happy atmosphere and the staff is on point. We really wish they would open one up more north on Carefree highway.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b-rgUg848MIccxO6-82Rwg"
  },
  "sVSrXYikOJ3DL3OaQAzy1w": {
    "date": "2/1/2014",
    "text": "My boyfriend drove me down to this restaurant on a whim one Sunday afternoon, after I'd mentioned that I was in the mood for some healthy Greek. \"Authentic healthy food? Zoe's? NO.\"   I'll admit I was a little hesitant. And kind of a jerk that day lol. I thought Zoe's was some knockoff wanna-be California \"health-freak\" joints that I'd become too familiar with back home.   Fortunately, I was wrong.   I ordered the spinach wraps with added chicken and he got the chicken kabobs with a side of greek salad, brown rice, and a bit of pita bread. My wraps were delectable, crispy, and soooo filling. I am also a big fan of Zoe's greek dressing, I believe it's made from scratch and I'd totally buy a bottle if they sold em.   Sorry for doubting you, Zoe. I can't wait to come back and try the rest of your menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "UpA11VtMeOjmZ8evDt8r-A"
  },
  "0zy1yGjzv_rl7kA4p9kn1Q": {
    "date": "9/23/2016",
    "text": "Stumbled upon this place after church looking for something for all. Grandson under 4 good healthy section for little guy. Vegetarian daughter did okay except she didn't enjoy her order. The rest of us our Food was good. Person who brought food to table was rude and short. Just threw the food on table for us to sort out. Food was just okay. Would not go out of our way to go there again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V8YBpFKB92uUc_jH6OJMiA"
  },
  "Ul5vgl32hHgBwVsJUqRM3g": {
    "date": "9/22/2016",
    "text": "The best kabobs!!! The chocolate chip cookie is an everyday thing because I work next door at the men's salon. The food is fresh and a good price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vlpw1gkrlAA0WZ8qcsq4Rg"
  },
  "bJPc-GC-x5jglr5DSg6-pA": {
    "date": "1/6/2014",
    "text": "This was the second time that I ate at Zoes Kitchen. The first time I had the Protein plate which consisted of grilled chicken on top of some cabbage and onions I think...not for sure, but it was good. Today I had the Steak kabobs and they were amazing. They came with vegetables and potatoes. Each with their own seasoning and cooked to perfection. I will most likely be coming back very soon to get the same dish.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "d0_kan6sOGoBcu1vRbT6gA",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States. Steak kabobs!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/d0_kan6sOGoBcu1vRbT6gA/o.jpg"
      }
    ],
    "user_id": "otEZtNnPNXvli5RQmO5DLg"
  },
  "i3Faukp1SrYAFPSySR04DQ": {
    "date": "1/7/2014",
    "text": "I recently had a Take-Out order that was incorrect from this location. Everyone knows how heartbreaking it is to get home after a long day, looking forward to chowing down a Greek Chicken Pita, and being sorely disappointed to find your order is not correct.   HOWEVER, when I called Zoe's, rather frustrated, the employee I spoke to (I believe his name was Seth) offered to drop off the correct order off on his way home!  I was completely caught off guard. After such an offer I could no longer be upset. The night was saved!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "Xw2oW5QaD2wZlnMRJBT06w"
  },
  "BMq2BwZsR8Zoagfm2CY7nQ": {
    "date": "11/7/2014",
    "text": "I'm trying to eat clean but love eating out. This can be a struggle. I chose to go to Zoe's because It sounded like Id be less tempted to go all crazy on carbs. My turkey sandwich was delicious and filling as well as their tomato soup. My mother and nephew ordered some pita sandwiches that were stuffed more than full and they loved it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WsAejVneMXU-_yp_W0b_2A"
  },
  "KIkC-pglGmkPp0vW5Q4LEA": {
    "date": "5/19/2014",
    "text": "Seriously delicious!  As someone who is wary of Mediterranean food in general, I felt like I was taking a risk when I decided to come here. Any feelings of apprehension disappeared when I walked in the door.  The atmosphere is fresh, clean, and modern.  There are pictures on the wall drawn by children that put you at ease.  The cashier who took our order was so friendly and polite (even gave us free pita and hummus since it was our first time).  The food was brought out in a timely manner.  I had the Greek chicken marinara over orzo and it was amazing.  My side Greek salad with the Greek dressing was so tasty, and the pita and hummus was very refreshing.  My friend let me taste his fish of the spinach wraps with chicken and it was fresh tasting and yummy - I'd order that next time, myself.  A bite if my friend's dude quinoa salad was light and crisp tasting as well, I'd get that next time for myself.  Excellent good place that puts you at ease and feeds you well.  Can't ask for more!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2BcB-ONnyFd3WFgTDKRVaw"
  },
  "uRYNy0wlpqiaukJQrGthlQ": {
    "date": "11/24/2014",
    "text": "Seth and team are super-heroes.   If you want to be treated with respect and professionalism, it doesn't get much better than Zoe's on Camelback. Insanely delicious, and healthy food.   Love you guys!!! Thanks for being amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GuMrRxMzCce5OXvaVStPZw"
  },
  "sYy2wlGj_zQKOqiO04qHcA": {
    "date": "6/8/2016",
    "text": "Zoes is awesome! Healthy food, great service and great prices. :-)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mAOHeG9gSI_bp-RX0V6Rsg"
  },
  "6DU74FZ9y9fYT-_QqSE0Hw": {
    "date": "10/7/2012",
    "text": "Look what I found! Potatoes... in a salad... that isn't a potato salad.  Zoe's is a lunch spot, a chow spot, a spot between meetings spot. It's a spot to fill your empty tummy spot, and you'll get your fill.   I won't elaborate: I had the classic, the Greek salad, and it didn't disappoint. Here's the menu description: \"Tomato, cucumber, peppers, olives, onions, feta over potato salad\". That's what I ate, and I was super happy all of the goods were OVER the potato salad because the entree gained a kind of textural sophistication when the greens were gone and the carbs were waiting. It's a smart move, hiding the potatoes, it gives the meal some umph and it challenges the taste buds.  The establishment is clean, clean, clean. Come around lunch it can get hectic, so plan to come ahead. I loved the tea options, especially the non-sweetened stuff.   I was also rather impressed by the vittles, the pita and hummus with olive oil. Good stuff. This place earns four honest stars as a lunch break beautician. Nice work, Zoe. I'll be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lYp818T-xh8Ss79To5Azhw"
  },
  "78cOe-JAto-rpdXwrArIaw": {
    "date": "7/26/2016",
    "text": "Everything is ok but a new clerk always assumes what you are ordering unless you tell her otherwise, however she never takes advise patiently.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3a_g0Ep_Gudzx5ncs8F3wg"
  },
  "UctlHbkKzacML6SHNdM2nQ": {
    "date": "11/15/2014",
    "text": "I remember a few years ago when Zoes Kitchen was the first restaurant I had been to that had the futuristic, touch screen soda machine!  I really, really love Zoes Kitchen. You wouldn't think from the name or decor that the food was Mediterranean, but it is and they do it well. There are just a lot of little things that make the atmosphere great, such as the children's artwork on the walls. The staff at this location is very friendly, service is quick, and the food is always tasty. I could swear that they put crack in their marinated slaw...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C1bwG8PIulWxnj1_6OW9cQ"
  },
  "x9Eu6KHainmmkn2tpTtHgQ": {
    "date": "8/4/2018",
    "text": "This is by far the worse experience my husband and I had at Zoes. It started off when we ordered.  I noticed there was a new item on the menu called \"Moroccan Chicken Piadinas\". There was a picture of this item at the register and it looked delicious.  I asked the employee working at the register what was in it and she said \"you can find all the ingredients on the menu\".  I wanted to say \"shouldn't you know this?\",  but of course I didn't . I  walk over, get the menu and see for myself.  I ended up ordering that and my husband ordered the chicken roll ups. We went to sit down and all of the tables were dirty. So my husband picked the least dirtiest table and wiped it down with a napkin.  After about 15 min, our food arrived only mine was not what I ordered. When I told the employee that wasn't what I ordered, she almost argued with me about it and realized I was right. Ok, no big deal. I understand these things happen. After waiting another 15 minutes I finally get what I ordered.  Both my husband and I were pretty disappointed with the amount of chicken in my piadinas and his roll ups. In the pictures it looks like there's a gracious amount of chicken breast and what we actually got were little scraps of chicken. Both our tortillas were not cooked all the way either. This place use to be on point but I'm afraid we will not be returning. Too bad because it was one of our favorite places.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c-KhK1Bxn1uCEA8SWK0wFg"
  },
  "ggPPjQgRM6XKfx5ORtHyAA": {
    "date": "5/9/2016",
    "text": "Zoe's kitchen was our favorite lunch place back in Florida (St.Johns Town Center in Jacksonville). When we moved here and found out there was one close to us we decided to give it a try, unfortunately my experiences back home are better than those here. Many items were taken off menu. I was rudely told to pick something else because my old choice of a club pita was no longer available. So that comment alone was already enough to ruin my experience. When we got our food it was not the portions it used to be, the potato salad side I got was mushed up and all oily substance like the end of the pot of it,  without them giving me another serving of it.  I'm truly disappointed considering it used to be our go to place at home and now I have one so close but with poor service and attention to detail",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hI7LDDh6GIgh9Y_T73hDwA"
  },
  "p6cxqCyAJ13XAKQK9BlEpQ": {
    "date": "6/13/2017",
    "text": "Zoe's is a great place to get a health conscious meal at a reasonable price, also the lemon cookies are great. Everyone working there seems to be chipper except one older lady who seems to be like she really doesn't want to be working there.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TxwDdaYKzjy-x85dlrgN5g"
  },
  "ChtjolUt8V_9TVt2_Tk_FQ": {
    "date": "1/8/2018",
    "text": "Been coming to this place awhile. Always consistent quality. I sent back a chicken skewer once and they took great care of me, other than that always good. I should have reviewed this place before just haven't. It wasn't until I came today that I found a reason. They have a great manager Stephanie that just really made our experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CdVd7cH3WcJdVy2JGWGrKw"
  },
  "8I-jFmvHZEgzMgw_veqDZg": {
    "date": "11/22/2015",
    "text": "Poor service, way to expensive. Would have got more for less at pita jungle. Had like three little trailed of peta and  like 4 veggies. This place sucks. Should have went to peda jungle would have got more for less!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "67Sr6uIzlyY_OWgOSepzAg",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/67Sr6uIzlyY_OWgOSepzAg/o.jpg"
      },
      {
        "img_id": "T_lGo5aUN0TFYQKe2AOnBw",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States. Finished this platter in 4 minutes had 4 tiny squares of bread and 4 veggies!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/T_lGo5aUN0TFYQKe2AOnBw/o.jpg"
      }
    ],
    "user_id": "D6jCAol1z7gL75ury1BKAA"
  },
  "5L4LKEi3C8hJvJpm7XObOA": {
    "date": "8/22/2015",
    "text": "Has the tossed greek chicken salad. I found it to be filling. I personally love feta cheese and this had a lot of it. If you aren't as into feta, you may want to ask for less or consider a different salad.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oA6GEPlI5i677AP8Q5kM9A",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oA6GEPlI5i677AP8Q5kM9A/o.jpg"
      }
    ],
    "user_id": "zHwAyrygwXPtOGr565y7qg"
  },
  "rf1qfeW0GYdj_DMz_y0-LQ": {
    "date": "3/15/2015",
    "text": "Well this place is back in the mix after finally delivering a decent lunch. Using my $20 lunch certificate, we sampled the regular hummus, which came with enough pita and had a good dollop of oil and paprika to make this a good version of this item. The chicken rollups are pretty easy to make (seems to be just chicken slices and feta in a tortilla, but they were good when dipped in the hummus, but the salsa provided was not homemade. Chicken salad sandwich was very average as was the pasta salad side dish. Tables outside were not cleaned and wiped down and they need to figure out how to stop birds from shitting all over the place where people eat. A few tables are easy targets, but also could easily be fixed. At least pay more attention to cleaning the tables, so indoor dining is suggested at this location.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "GKP2ZAm5hR9glj_A72TpGQ",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GKP2ZAm5hR9glj_A72TpGQ/o.jpg"
      }
    ],
    "user_id": "ELcQDlf69kb-ihJfxZyL0A"
  },
  "-BSUSTbXOj5kmpvDfg8VnA": {
    "date": "3/21/2015",
    "text": "I was excited to come here for a salad after a great work out. I ordered an $8 vegetarian greek salad. Now, when I order an $8 salad of any kind, I expect it to be hefty. Especially when it is vegetarian. A salad of that price needs to have lots of feta, cucs, peppers, olives, onions, etc etc.   This salad was mostly lettuce. It had many diced onions, about 4 olives, 3 cucs, 3 halved cherry tomatoes, 1 (count em, ONE) green pepper slice, and some feta. It was served with a side of oil. WHAT?! I paid eight dollars for this sad excuse for a salad.   I was a bit pleasantly surprised to find some potato salad under the bed of lettuce, but how is that even part of a greek salad? So confused.  I won't be back to this or any other Zoe's Kitchen anytime soon...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "yc5D5_zywLDAj4tV9_WZmA"
  },
  "2Q_riMYwFVUBKKnVsTMbmA": {
    "date": "12/22/2015",
    "text": "I love the food here, so I wish I could give a higher rating...but my issue is with the takeout service: I order takeout here all the time - at least twice a month. I usually get either the chicken salad sampler (salad) or the sandwich. Both delicious if they are made correctly. 3 orders ago I picked up a chicken salad sampler - only to find upon getting home it was missing the LETTUCE. It is a SALAD. 2 orders ago, ordered the salad again to find my order was missing the salad dressing (nooooo!). And last order I think was the last straw. I ordered the chicken salad sandwich on a pita, and I came home with about 1/4 the amount of chicken salad necessary to fill the pita- the rest was stuffed with dry lettuce? Great food, lazy takeout service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MhCdd_gkd9GFEcvYYrFM-Q",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MhCdd_gkd9GFEcvYYrFM-Q/o.jpg"
      },
      {
        "img_id": "rZoTHjEh5Smwae4ifp2-pw",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States. Only 1/4 of my pita filled with chicken salad- the rest was stuffed with dry lettuce? Great food, lazy takeout service.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rZoTHjEh5Smwae4ifp2-pw/o.jpg"
      }
    ],
    "user_id": "_AWxJCwM-nlytELL14FeqA"
  },
  "qNHEtu1UGinXdPzAfY2Skg": {
    "date": "4/6/2016",
    "text": "Good but once was enough. I had the quinoa salad with chicken, It was good but just nothing special. It also came out in about 10 seconds which I guess is a good thing, but made me feel like it was slapped together. Not that the salad tasted pre-made, just that everything on the salad was pre-made. I know, just like every other restaurant. I guess Zoe's is just not for me, I felt like it was a poor man's Flower Child for about the same price.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "P1NI5QCqsFskRjucA3FNSg"
  },
  "y8Ixd6DROHT15a_dajlVRw": {
    "date": "9/27/2016",
    "text": "Well I was passing through Scottsdale and decided this place looked pretty good.  I was very happy with service and even more happy with the food.  I had the steak kabob and pita and wow,  tasted so fresh and vibrant.  If I ever happen to be passing through or visiting Scottsdale again I will be stopping by again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E9zbRvVtAchjtlNPRp_IAA"
  },
  "2XVhIaYoh8XNlZfxQS1lVA": {
    "date": "11/27/2012",
    "text": "My friend and I stopped here for lunch. We both ordered the same thing. Hers arrived in a few minutes. It took about 1/2 hour for my food to arrive. The manager explained that they ran out of something and it would take a while to cook it. He told me this after waiting about 25 minutes. He did offer me coupons for free meals. Unfortunately, I'm from out of town so I couldn't use them. I gave them to my friend and I hope she has a better experience next time.  I thought the food was decent. I got chicken skewers and rice. The chicken was cooked well and was flavorful. The rice was surprisingly good.  Bonus points for the Coca-Cola Freestyle machine.  Sadly, the service was so lackluster that I wouldn't return. There's just no need. I'd rather go to a place that served real Mediterranean food as opposed to this Greek-style \"mall\" food.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "EbbOIQ5oAamS9D_B_7cC7w"
  },
  "vMBzX648Rm8_d-BBXu0c_w": {
    "date": "8/15/2015",
    "text": "I had dinner here and no issues, the steak kabobs were yummy and the place was very clean, I even had some wine with dinner. If you've never had this kind of food, this is the perfect place to give it a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9V6BIALTOdOc4oh9OU9jew"
  },
  "ayt8mGIK62fV1W45l9rwlg": {
    "date": "10/7/2012",
    "text": "Umlauts. We need more of them. That adorable but professional little diacritic belongs in more words, if for no other reason than to decorate it and make it more interesting. Glam it up with a glyph, as I like to say.  Oddly, that's kind of how I feel about Zoes. It's quite similar in concept to many other places (a regular old \"e\") but then all of the sudden that little diaraesis shows up and BAM, you've got something a little better. It's an \"e\" and voila!  Sammiches, salads, sides--you've seen this movie before. But there's enough variety and care presented that it's not just another lunch shop. We stopped in with our big group and they had everything ready to go. I got the chicken salad sandwich, and I gotta be honest, it wasn't my fave. In my brainiverse, chick-sal-sans should have some texture and chunk to them. This was quite finely prepared and had more the consistency of a tuna sandwich. Not my cup of tea, but I know others with the exact opposite taste. So just know before you go.  The salads looked really great, and portions on them were pretty large. Two of our dining companions decided not to come, so their lunches were sitting and just asking for me to try them. Greek chicken pita, and I'm back on board. In fact, by the looks of things, I'd say stick with pitas or wraps for that extra umlaut bump. The sandwiches are nice, but served on simple bread and don't quite have the pizazz.  Grab your own beverage from the fountain machine of the future (the bajillion option touch screen kind) and settle down in the bright space for a quick, convenient lunch.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "HXOfPXPMvdXNpQ_l0RRjKw"
  },
  "EcAMFPcWB_qqrXPTndqD3Q": {
    "date": "10/4/2012",
    "text": "Anytime I can eat a lunch that combines pasta, grilled chicken, avocado, and tons of fresh vegetables all in one salad, chances are I'm going to be a fan. I recently had lunch at Zoes and while I wasn't totally blown away, it was pretty darn enjoyable.   The space itself is pretty busy, and because you seat yourself it can be a challenge to find a decent spot (especially if you're with a big group.) After ordering, I was happy to see a few different unsweetened tea options including a few tropical varieties. So good! We got a few bowls of hummus for the table which was standard, but the pita bread was soft and yummy & I loved the olive oil drizzled on top. After filling up a little on that, I ventured into the chicken chop salad and the combo of everything in it was filling and satisfying. It also was giant, which is helpful when you know you won't be eating again for a while. It's packaged so that it's convenient to take with ya if you don't feel like eating the entire thing.  My lunch mates were so-so about their meals but I really don't have any complaints about mine. I'd definitely eat at Zoes if we had one in St. Louis. The employees were friendly, the ingredients were fresh, and we were in and out within an hour. That's what I call a major lunchtime win.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "UlWDGR0QrBbdFsVY6ugocw"
  },
  "VOLNjZOlArZn6K2m8mZJuw": {
    "date": "6/2/2015",
    "text": "I love Zoe's Kitchen but every salad I've ordered at this location has been limp and tastes a little off. Too bad because it's the closest to me!  I will continue eating at the others and hopefully Camelback will freshen up their salads!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Nm-mHpuvIhEryNsA8tnjtg"
  },
  "e_ggH9r8gvW-UL5kxFJGGw": {
    "date": "6/16/2013",
    "text": "This place is fun!  The food is great! They have vegan menu. The service is awesome! The price is average.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tM84r9rP7XTjX4SnRzviMA"
  },
  "SXBWlSAZniHzF2F8V4hgJQ": {
    "date": "6/17/2016",
    "text": "This is very upsetting, the customer service has been terrible the past few weeks. Order food for pick up, and only 1 of 3 orders were correct. Very disappointed in the customer service here, now you have to figure out if you order something and pick it up, you are going to have to double check before you leave. If they keep this up they wont have a busy lunch and then they can most likely get the orders right by then.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o9gU1z8kUSiPbbxBedzHOw"
  },
  "j7-KmvTUg-go7sIjZDigEQ": {
    "date": "8/1/2012",
    "text": "Cute and casual lunch option.  // LOCATION // Just outside the Scottsdale Mall   // SERVICE // You order at the counter, are given a number, and seat yourself. Drinks are self-serve as well at their awesome digital Coca Cola soda dispenser  // FOOD //        + Chicken salad sandwich: Fabulously fresh. It same consistency as tuna salad which kind of throws you off      + Pasta salad: Fresh and refreshing without being overly dressed      + Beef roll ups: Ate these 3 hours later and they were still super tasty. The meat is very tender      + Greek salad dressing: Simple yet delish with olive oil and red wine vinegar. There is a bottle on every table so that you can help yourself",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "U08FBOaRQCk-IAcHPAxzKA"
  },
  "fr9DENj1BpOZ8PREfLSUlQ": {
    "date": "4/6/2016",
    "text": "Used to love this place. Went recently and they vastly downsized all of their portions. I won't be back and I used to eat here at least two or three times a week. It's a shame businesses feel the need to cut corners after they become establish. OHSO did the same thing. Customers are too savvy to put up with this nonsense. I literally felt ripped off by the amount of food served to me for the price I paid. I ordered a hummus trio which was literally three tablespoons of hummus. (One tablespoon per flavor). I also had the quinoa salad and they put about one quarter the amount of quinoa they usually put on and it has zero broccoli in it. Not the mention the bed of lettuce it sat on was a small handful at best. Please rethink visiting this place especially if you are used to the way it used to be. They will skimp on you. Thanks",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nxis-pKOrtvPBYlThQplSw"
  },
  "RRooRcPrHIx8II16YG-4Ew": {
    "date": "4/25/2012",
    "text": "Healthy and inexpensive food in the Waterfront - YEAH!!  THe people that work here are extremely friendly, helpful and customer service friendly too.  They keep it clean and accomodate picky, higher maintenance people like myself  The food is much better quality than the places surrounding it so not sure why its not busier.    I love the Greek salad with chicken. The chicken, the potato salad, grilled veggies, dressing... yum, I salivate just thinking of their salad. And now, they upgraded their pitas to the soft ones.  HEAVEN!!  ITs a toss up between them and Pita Jungle for best greek salad.  Depends on the day so please check them out  My hubby loves the kabob and unlimited refills on drinks. Also, they substitute a nice size side salad in case you dont want the beans or rice.  This is a place that you need to try!  If shopping at fashion square, its worth the small walk to leave the food court and eat at Zoe's",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "IHN_4v2brt3z8j-Rvs7XRw"
  },
  "M-QUdhddaN4vl-Pp43w98w": {
    "date": "10/7/2015",
    "text": "wow this place is amazing!!! They just opened a location near my work and I tried the turkey stack and it was amazing! their fruit side is actually legit with oranges, apples, pineapples and grapes. I will definitely order more from them",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MwPAhztqKIhYOOv2MhstQA"
  },
  "1psVo8M-F5gPfpucdXKZyg": {
    "date": "10/26/2012",
    "text": "Zoes Kitchen gets crazy busy during lunch time, but don't let that scare you from giving this place a shot. The service is fast, friendly, and efficient. From the time we ordered at the counter, filled our drinks up with one of the three fresh brewed tea options (while slowly walking away and starring at this crazy futuristic soda machine), and sat down at a table, we only had to wait about seven or so minutes for our healthy meals to arrive with their delicious aromas.  They do have a Simply 500 menu that lists all their items that fit the criteria of 500 calories or less. It is not listed above the order counter so you'll have to ask to see one. My mother ordered the Spinach Roll-ups that came with a cup of fruit and I went for the Veggie Kabobs. Both of us enjoyed our meals, but we both agreed that we wouldn't drive down just for Zoes, if we are in the area it will be on our minds as an option.  It was neat to see the art projects from the kids at Phoenix Children's Hospital that Zoes displays throughout the restaurant walls. The total for two meals and two small drinks came to $21.64",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "TBLdjYJMIDaM6dB23AenLw"
  },
  "hrfRkFPWO_qQVVlefVXTvA": {
    "date": "3/9/2014",
    "text": "The chicken roll ups were really good.  The restaurant was very clean and was managed by great staff.  The manager was very friendly and seemed to be paying attention to his customers.  I really liked the outdoor seating because it was a great day for lunch outside.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "eMN72_2oeHu9dJ91jpULuA"
  },
  "EaEGy93UmwyGjFqI0ju8mw": {
    "date": "3/23/2014",
    "text": "My husband and I were on a road trip from the Grand Canyon to Scottsdale, and after a long drive we were tired and hungry.  I actually planned on trying a different restaurant on Yelp, but when we got there it didn't look appetizing, so we walked by Zoes and decided to give them a try.  I was initially hesitant because it sort of looked like a Jamba Juice or other chain restaurant (which we normally avoid) but the food looked good and we were really hungry.  We both ordered kabobs I think, my husband had fish, I had vegetable.  There was a wait on the vegetables (they had to roast them or something) and the cashier brought out a hummus on the house while we waited, which I thought was really kind and unexpected, considering it is not an expensive place.  Everything was fresh and healthy and we were pleasantly surprised, especially considering it was only about 20$ total for the two of us.  I worked for years in a nice Mediterranean style restaurant, and thought the food was quite good.  Also, compliments to the staff, who were all very helpful and nice.  Perfect place for a quick and casual meal, and also a healthy one!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "OkwVea70vIZbThyiwMEhow"
  },
  "YJ4b0FYuXCbXhuKyV2Yb0A": {
    "date": "4/25/2012",
    "text": "Wow wow wow!! I can't get enough of Zoe's.  The food here is DIVINE. Completely SUPREME. I love it. My faves: -steak roll ups -chicken roll ups -the slaw -rice pilaf -hummus -they have bomb iced tea.  Plus, you can order and pay for your food online, so if you want to pick it up you literally walk in, are handed your food, and walk out. So easy.  The people who work here are rad too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "pQ8qmUnAZH0hYToenRS57Q"
  },
  "XIvcs3sZB9if1m9FOTfcdQ": {
    "date": "12/29/2014",
    "text": "It's nice to have a healthier lunch option for a counter order style restaurant. Zoe's is bright and cheery, food is very Americanized Greek food. The feta is super bland and tomatoes were not fresh but nice greens, hummus and chicken kabobs.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zUhCdhFqMSRMBxfgwUC4YQ"
  },
  "eAHC0wT5HIpgIQZQ7TmQcQ": {
    "date": "7/9/2014",
    "text": "The foods amazing here and you wouldn't think this was part of a growing chain of locations. Steak kabobs are delicious and the service is top notch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7sRm-rtiiz7EqPJ8GtyF6g"
  },
  "0JqTEbRuXa6cgVID-HCl6g": {
    "date": "7/26/2014",
    "text": "Inexpensive and delicious! I love the Greek chicken pita with a Greek salad-so yummy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VvX_jEsmHwrDjP12nMnk-A"
  },
  "YbDx01d-k5VltsacKYwqug": {
    "date": "12/10/2012",
    "text": "Healthy, tasty and quick. The Trifecta. Hard to find. I didn't even really know what kind of food it was before I went. I guess it's contemporary Mediterranean?  I got the chicken kabobs per the recommendation of the friendly cashier. Chicken was very good, nicely spiced. Comes with rice pilaf and greek salad, both were done well. Overall a healthy, tasty meal and a great alternative to fast food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O8Y1xzL-qoHySb7zfadZ8w"
  },
  "ZBMc5rwno9He9dI14jF1Eg": {
    "date": "2/10/2015",
    "text": "This place is amazing! I have never been disappointed with anything that I have ordered. The customer service is beyond great. Steak kabobs are my favorite. I recommend this place to any and everybody.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IWpwMQ1U17mD5mIakC4flg"
  },
  "wb05eqTh39VIiZZEVGoeRg": {
    "date": "7/20/2016",
    "text": "I don't even want to give it 1 star but that's not an option. Every single time I come into this location my order is given to me wrong. The last 3 times I've gone in they mess it up and the people who work there are extremely un-attentive and have horrible customer service. Safe to say I will never be returning to another Zoe's.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1YJCkHec0mt_74azLG2oAw"
  },
  "2TtGSEeI7Z7YJi9fpTXqIQ": {
    "date": "9/29/2011",
    "text": "After the fabulous CMYE at Zoe's in Phoenix, I was delighted to see another restaurant open up in my neighborhood!  I can't really tell you how great the entire menu is because the only thing I ever order is spinach rolls with chicken and marinated slaw.  While I'm always tempted by other offerings, I also resort to my usual, and I'm never disappointed.  Well a little disappointed when my plate is empty, but not before.  I'm also a big fan of their limeade and never pass that up either.  But the best part of Zoe's is the staff.  Everyone is so incredibly hospitable.  I don't know where they find employees like that, but I'm glad they do!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "Rzf35jKV8e8EJdssrae_AA"
  },
  "sMH6ztpYfAW8fhBtlAm1Lw": {
    "date": "8/18/2015",
    "text": "I called in a lunch order for 32 people today at 10:45 and Danielle and the team at Zoe's Waterfront had it ready to go by noon! The food was top-notch, fresh and delicious. They put each person's order in an individual box, labeled with their name. For a corporate orders, Zoe's nails it! Love their reliability and service. Plus the chicken roll-ups are one of a kind. I've been ordering them since high school.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "woc__5SbcLsg-31a_rWzaQ"
  },
  "KVhC6DCoaau5VRKbsPcVvw": {
    "date": "2/21/2015",
    "text": "Lots of delicious and healthy choices. You can eat healthy and be completely satisfied. Clean, comfortable and reasonably priced.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aDL8w_pL6mVKbTG8qWtlig"
  },
  "AHNq39lDzkONKRx5Tduj9Q": {
    "date": "1/30/2015",
    "text": "This place is amazing! The food is so healthy (at least appears to be) and the menu has so much to it! I have the chicken kabob and it was unreal! The actual kabob came with such yummy stuff on it and then the rice and salad underneath were both amazing as well! Good price for what you get and seems super healthy and quick! The food came out within minutes! The costumer service was also great! Super friendly and helpful with decision! Bring one to San Francisco please!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JIV3rW3k-8NypVXVLRQbMQ"
  },
  "Ry5s-MoT8_UZWjs3YlywAg": {
    "date": "2/17/2014",
    "text": "Very good! I love the chicken kabobs and I think its called greek chicken pita.  The dressing they have on the table is very good  to add. Good price and atmosphere too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xCSd8qF3_NkqoUKqCQ9q6g"
  },
  "6slmCurwSvBDIqFahDqasw": {
    "date": "7/23/2014",
    "text": "The best word I can think of to describe this place is 'meh'. I went here for lunch and I was underwhelmed by the menu. I ended up getting chicken salad with fruit. It was a small scoop of mediocre chicken salad on top of a bed of undressed greens with some grapes and two strawberry slices sprinkled on. When I asked for some dressing they told me there was some on the table. They must have been talking about the oil covered squeeze bottle containing a tasteless vinegarette. Not impressed.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zd0M9UiXSGgye_utGFa8NQ"
  },
  "Ha92XqNL8MQ6bhuOeRlasw": {
    "date": "1/13/2014",
    "text": "they have really fresh tasty food. really great service. I called in a large order to the wrong location, they were able to pull it and recreate it in a few short minutes. again I love their food and great service",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XbsT1YW5uJe9quIdQfCiDg"
  },
  "9dueVC27lppFHe4YL0dNQQ": {
    "date": "9/16/2011",
    "text": "Editing my review. I originally gave Zoe's 3 stars, but on my third visit I ended up having one of the worst dining experiences of my life. I'm typically not a person that will completely write off a restaurant based on one bad experience but I think sometimes it is completely understandable.  I'll start off by saying on all 3 of my Zoe's experiences I ordered the grilled vegetable kebabs. Not bad, but they are not great. And extremely overpriced, to boot. The item is marked \"vegan\", but the salad it comes with is topped with feta cheese, which makes it not vegan. Zoe's needs to take their \"V\" off this item because if it wasn't for the fact that I emailed Zoe's corporate email prior to my first visit, I would have been stuck with an inedible salad. Besides, vegans are smart enough to ask questions about menu items that are not clearly marked vegan. Just don't give them False security by labeling non-vegan food \"vegan\" because then we'll feel we don't need to ask questions.   In short, what happened last experience was I ordered \"grilled vegetable kebabs\" and ended up with a plate of big, stinking, chicken kebabs. A sight not pleasing to most vegans and vegetarians and frankly, quite offensive to ethical vegans and vegetarians. It's not a \"choice\" for me, it's a belief and a lifestyle. This is the equivalent to serving a steak to a Hindu, or a rack of ribs to a Jew.  Anyways, server takes my beans off the plate and takes the plate back to get me my kebabs. Mind you, the chicken kebabs cost more than the vegetable ones but I figured getting my money back would be more hassle than it's worth. 15 minutes pass. My beans go cold as I patiently wait the return of my food and pita for which to eat said beans. In a flurry of apologies and napkins, my server arrives with my plate. By this point I've already decided I'm not coming back here ever again. But the cherry on top is there are little bits of feta cheese in my salad.   Done and done. There are some mistakes that are unforgivable.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mk9ekByCVSifYjfPty8kIw"
  },
  "0ofEI5S6oejvyPc_NgCIKg": {
    "date": "2/11/2017",
    "text": "Yum! Been looking for some healthy Mediterranean food!! Found it ! home made dressing from scratch ... you've got to try it !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9cdGovAeQI5ulK_UpK7QMw",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States. Fabulous healthy Mediterranean delish!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9cdGovAeQI5ulK_UpK7QMw/o.jpg"
      }
    ],
    "user_id": "RcAQWDyYI5VUxovd9RMzhw"
  },
  "f5e5osmBxd1CvokyDx5o2g": {
    "date": "1/21/2018",
    "text": "The worst service and rude servers i ever got access! They had no clue what they were doing or serving. Very rude and not organized, we waited 30mins to get our order and when it finally arrived it was the wrong one and we mentioned that this is not what we ordered the server rolled her eyes to us. Basically those two women working in the front are just the worst thing in Zoes kitchen! Dont ever go to that location you will be treated like shit here!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VgtwOFEHcgDSCCrEz3mJrw"
  },
  "Xe8bjmAz6f4OVT7GyLYg2Q": {
    "date": "6/23/2018",
    "text": "Well this is my first Yelp review and it is not a positive one. My husband, my son and I were excited to try Zoe's for their vegan options. When we got there the service was pretty poor, and they were out of falafel, which was our vegan option. All tables were dirty and there was no where to sit. I can't comment on the food, but the service and cleanliness was terrible.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0NXYONkCgy01_dvEjCYHVg"
  },
  "oCVf2ztOYB0gQZSx16D3lA": {
    "date": "11/22/2015",
    "text": "Excellent meal. The chicken pita was so fresh and tasty. The quinoa salad was filled with fresh vegetables   I was worried that the dressing would be to heavy,  but it was exactly how it was described ...\"light and refreshing\".   As a treat ordered the chocolate cake.  My goodness what a treat. The chocolate cake was light and moist. Will come back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WT_8nXsmZ39gH4stPdGoQg",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States. Chicken pita",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WT_8nXsmZ39gH4stPdGoQg/o.jpg"
      }
    ],
    "user_id": "WWOiE3X0hNC7x2R7Q-xK1g"
  },
  "6_Zn0cl_dqryHR1RTLw9pA": {
    "date": "9/21/2017",
    "text": "I've had Zoes a couple times now and it keeps reinforcing my distaste for them. Doesn't matter what location you're at, the food is overpriced \"hipster\" crap. This time around, I figured I'd give it another shot as their Mediterranean Chicken looked good online. So I put an order of it in with a side of the hummus taster and cauliflower rice. I was less than impressed when I got my food in a cardboard box, wrapped up in tin foil. The chicken was just somewhat edible with an OK flavor. A bit too thick for my taste. I ate one out of the two pieces because the second piece was chewy. The Cauliflower rice was absolutely disgusting, and there was no indication it was going to come cold on the menu. Then I get 4 lousy slices of tiny pita. Okay, I get it was a sampler side, but the pita amount should match the hummus amount. If you're looking here, don't. It's a waste of money that will leave you hungry.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DcRn0EXBfBA0zacRszwUXg",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States. Less than impressive.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DcRn0EXBfBA0zacRszwUXg/o.jpg"
      }
    ],
    "user_id": "oyMYJt5hmXAIg2z8qmDRCA"
  },
  "FTrVQhjjhnnhn3X01VA4Jw": {
    "date": "9/2/2016",
    "text": "This place was delicious and I would've given it 5 stars, except when I was ordering over the phone I felt like there was a communication issue. I usually would've let it slide as a phone issue, but when I got to the restaurant the cashier and I were talking a little and she kept using \"Fuck\" and \"shit\" in her sentences.  It didn't bother me, but it was very unprofessional.   5 stars for the delicious food that made me moan. Minus 1 star for the unprofessional cashier.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fo2tW-frVfgzsOPRG59Yhw"
  },
  "VN9v0jMtnPlUdw89hEfkJg": {
    "date": "10/19/2012",
    "text": "Fresh, fast and affordable are two things that don't often intersect these days, but somehow Zoe's manages to bring it all together under one roof! We had pre-ordered our meals to ensure we had enough time to eat lunch and picked up our food at the counter.   GREEK SALAD: A light and heart healthy alternative to my usual pizzas and heavy plate lunches. Big portion of greens so hopefully this will help to fill up the bigger sized bellies.  HUMMUS : Beyond the salad I highly recommend getting the hummus with pita bread! The hummus has just the right level of lemon flavor which I often find lacking in other mediterranean joints. Bravo Zoe's!  TOMATO SOUP: Whatever you do, DO NOT order the tomato soup. I could taste the straight from the can flavor and this was definitely the low-point of my meal.  The decor at Zoe's is modern casual with open seating. Their soda machine from the future was very perplexing and I'm glad someone else was there to show me how to use it! Great fast casual concept and I do hope it comes to my hometown of Honolulu some day soon!  (Photo machine from the future: <a href=\"http://www.yelp.com/biz_photos/zo%C3%ABs-kitchen-scottsdale-2?select=wldK7GljQwSOopMmhad2_Q#wldK7GljQwSOopMmhad2_Q\">yelp.com/biz_photos/zoes...</a>)  31 Yelps Challenge: #19/31",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 8,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "wldK7GljQwSOopMmhad2_Q",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States. Soda machine from the future... one day it will turn against us and take over the world!!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wldK7GljQwSOopMmhad2_Q/o.jpg"
      }
    ],
    "user_id": "fgwI3rYHOv1ipfVfCSx7pg"
  },
  "-5IN4zZchRVKVDQanlvPyA": {
    "date": "12/3/2014",
    "text": "I usually go to Sauce next door but figured I'd give Zoe's a try.  The restaurant has a nice, modern decor but I thought the music was playing a little too loud.  I ordered the grilled chicken and slaw pita made as a sandwich.  The seasonings on the chicken were very good but the slaw seemed more like shredded lettuce.  My side of potato salad was ok but nothing super exciting.  This seems like a good place to get a healthy meal and I'll come back to try a few more items on the menu.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "S9Jw00eZHVj5_0sOM_C5Rg"
  },
  "B-h3O4RApRoCX31AUjYjHw": {
    "date": "10/12/2016",
    "text": "The live med salad is absolutely the most spicy and interesting salad I've ever had. The delicious contrast of the grain, squash ribbons and spinach is a perfect balance of texture and flavor. It's unlike anything I've had and I can't get enough. I try to convince everyone I know to order it. If they do, they never regret it and it becomes their new favorite too. I love foodie healthy eating!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nHV7j32PeXvtljU3pF3Qmw",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States. Med Salad! Yuuummm!! Delicious and beautiful.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nHV7j32PeXvtljU3pF3Qmw/o.jpg"
      }
    ],
    "user_id": "0A-VzDNO5dQAVVO0vlGIrA"
  },
  "fAWiMPIy3LPsUMLU3ltt-A": {
    "date": "11/10/2018",
    "text": "Wish there was a no star button. On 11/08/2018 I had the WORST restaurant experience in my life. Tall African American woman in the front completely ruined our night. The store ran out of potatoes(understandable. It wasn't the end of the world) but you don't have to be rude about it. We approached the register wanting to take home a couple quarts of potatoes for our diner party and waited for 10 minutes while she texted on her phone before she ever even acknowledged us. And then asks \"what do you need tonight\". She proceeds to tell us we can't have grilled potatoes because the store had ran out and they did not have time to make more. She then tells us if we want them that bad we can go to another Zoes. Never once have I been talked to so disrespectfully. Who even talks to people like that? On top of all of that she was cussing her employees out and yelling at them. And this is not the first time we've had a negative experience with this one woman in particular. And what makes it worse is she never tells us her name. She just refers to herself as the \"shift lead in charge\". This store rarely has guests and it makes sense when you have a loud, disrespectful, potty mouth as a \"shift lead\". Sucks to be Zoes because they just lost us as customers and we will NEVER be returning",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t4SEoMoQeHWnf7r48EtRjg"
  },
  "haqt5uQNlblT2940biDgyw": {
    "date": "3/19/2018",
    "text": "Super dooper meh. Most generic mediterranean food ive ever had. I mean everything was fast and orderly but the food itself lacked flavor or really anything to write home about.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZCmEW2k3_6StPAdZpDNvaw"
  },
  "KqaVdcmgGMINFF9Yi5NlMQ": {
    "date": "8/14/2014",
    "text": "For a quick spot this is a great option. Portions are generous, flavor is great, and the menu has all the Mediterranean favs.   It's not a place I would go out of my way to eat at but if I were out and about running errands, and in need of a good bite to eat I would definitely stop here over almost all other options. It's the chipotle of Mediterranean food. A quick in and out, or easy take out spot. Clean tables, and a friendly staff. The limeade is a must try.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "g7Nfe1nHrHmlTtkBwFr6hg"
  },
  "feKUwEp6eFL1GHkUTtZadw": {
    "date": "9/2/2014",
    "text": "Zoes Kitchen was a quick find for us after shopping at Fashion Square. I really enjoyed their vibrant fresh look. Chairs are bright colored with local children's art work hangs around the joint. I would say it is reasonably priced for its location. The meal for two came out to $22.00 and we left feeling satisfied and refreshed.   My nicely seasoned Chicken Roll Ups were very good, included feta, tomato, and lettuce. Zoes salsa was fresh and had a hint of spice to it, very good flavor for people who don't like too much hot. Fresh fruit as a side was such a delight because it was all my favorite fruit. :-) Pineapple, green apples, grapes, orange chucks, and cantaloupe.  The boyfriend ordered Zoes Club Pita. I will say that this was a very meaty option with good flavor. He added a bit of the homemade dressing from the table to the sandwich and seemed to like it. He mentioned the dressing had a more vinegary taste. Roasted veggies were so good I had to steal some from his plate. Not overcooked and seasoned very well. There were onions, carrots, broccoli, and mushrooms. I wanted to take some of the veggies home to plate with my own food.  Dessert we shared an oatmeal cookie. It was so chewy and had lots of raisins. :-) Next time I will try a chocolate chip cookie.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_KqQ90AXZAOER5dk7B-ruQ",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_KqQ90AXZAOER5dk7B-ruQ/o.jpg"
      },
      {
        "img_id": "PPNYWF-D4NsJM1DKxIvgUA",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States. Chicken Roll Up with Fruit.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PPNYWF-D4NsJM1DKxIvgUA/o.jpg"
      }
    ],
    "user_id": "bu-m8xC4EUNdTLspx37D3w"
  },
  "EWXVSE9Yy868Imq4TJF9GA": {
    "date": "4/14/2016",
    "text": "I had a bad experience in the past but gave it another chance and it was pretty good until yesterday I have been eating here at least 5 times a month and never came across an olive pit in the salad I busted my tooth when I asked an employee to speak to someone I was told everyone was to busy I would have to wait for the rush to be over having to go back to work I left my tooth hurts I won't be back",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8ZmKvIeR9tejApmUY04jKQ",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8ZmKvIeR9tejApmUY04jKQ/o.jpg"
      }
    ],
    "user_id": "UI3bZ_HiOzzuVmfJ2HuBUQ"
  },
  "11nKgehaDbr81DjwwV4lAw": {
    "date": "4/1/2017",
    "text": "I ordered their new spinach and cheese pianida (sp?) and the taste was fine, but when I opened the tortilla, there was barely anything inside! I told the manager and they made me a new one. My daughter ordered a chicken pita but the pita was so dry that it completely fell apart. The chicken was very dry as well. She wouldn't really eat it, but since I already complained about my dish, we didn't send it back.  The topper was when I went into the ladies room, it was so disgusting with one toilet out of order and another had poo literally all over the toilet seat. So gross!!! I should've known better than to eat in there. We will not be back!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "np4WzHYC4sDNPfuugVb2ZQ"
  },
  "7hmWtO4DFULwtq-Kav605w": {
    "date": "3/26/2017",
    "text": "Very average experience here. Walking through the area every restaurant was busy except Zoe's, which should have been a tip off. We missed the clue and stopped here for Sunday lunch.  Mediterranean chicken was a dry small serving of chicken without much marinated flavor and a healthy salad with a side of white beans. Nothing bad or outstanding about it other than the chicken was cooked dry.  My wife has the chicken salad which came with a huge platter of fruit.  Except for the fruit it was underwhelming too.  There are so many better choices here if you can get in.  That's why it's so quiet at Zoe's.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7hy0EechRribZiNgHr-WxQ"
  },
  "GzqSW4MbfnRtyPgKBbN7ZA": {
    "date": "6/11/2017",
    "text": "Not impressed. To say this is a Greek restaurant is a stretch. Greek salad with potato salad?  The food was ok, but not up to what not I would typically call Greek.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "edD7PrKg0jL7r8n-dUuB0w"
  },
  "_Xa5vnlDtiYeM3sH2YSUKg": {
    "date": "4/8/2014",
    "text": "Zoe's is a good sandwich place with a relaxing ambiance (both inside and outside).   My turkey sandwich and \"potato salad\" salad were very good. I use quotes because \"salad\" isn't the way to describe how the potatoes were prepared. The small red potatoes were presented in a small bowl, chopped, with great seasoning added. And unlike most potato salads, there was no mustard or sauce mixed in... which was great!   Added bonus: The staff cleans up your table so you don't have to bus your tray.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "zzaq5Fn1U2Feut3dGxidNg"
  },
  "iseTKxGdzta71lvSBGmVww": {
    "date": "5/12/2017",
    "text": "11am not busy. Had steak stack sandwich and potato salad. The sandwich thinly sliced steak, sliced portobello, mozzarella, caramelized onions, feta spread, tomato, rosemary oil on sour dough. It tasted great. The potato salad was different but tasted great. It had no mayo but instead i think they used olive oil and vinegar and i really liked it. Service was friendly and quick.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JRVZG46DixeBx6VtFEUJzg"
  },
  "KlxlDfl-X9EsHwBsCQAvsQ": {
    "date": "11/11/2015",
    "text": "Everything on the menu is good here. My favorite is the salad and hummus plate and I have grilled chicken added. They also have a good soda selection... Sounds silly but I love diet Dr. Pepper   Generally the staff is awesome, but there is a girl who works there that can be really rude. I have walked in and walked out when she's been there. They forgot my chicken when they brought me my food (which already took longer than normal) and when I realized there was no chicken I walked up to the counter and told her. She looked me up and down and said \"are you sure you didn't eat it already?\". Yes, I'm a little chubby... But who does that?  Other than that it's a great place!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cvf_goc3tARHqQf0YgSnyA"
  },
  "2FXvkyPjFS4lpWHTo88LHw": {
    "date": "4/22/2018",
    "text": "I always get the protein power plate because the caramelized onions are on point . Zoe's is a great spot to get healthy food that is cheap and quickly prepared. They sometimes offer free hummus for your first time there as well. My friends got the falafel and said it was pretty good as well. It was the Cali'flour bowl.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OYA7kdUm5YFI61aRKbR3sw",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OYA7kdUm5YFI61aRKbR3sw/o.jpg"
      },
      {
        "img_id": "ywPXe4sQn-cgJvGiB-PKrQ",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ywPXe4sQn-cgJvGiB-PKrQ/o.jpg"
      },
      {
        "img_id": "dEXoEKOke03Dbql7rr7XDQ",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dEXoEKOke03Dbql7rr7XDQ/o.jpg"
      }
    ],
    "user_id": "ZGpLK0RSXRMn5ubyBvlV8w"
  },
  "gIy9Be3MwtETqk6lxS5ufw": {
    "date": "2/13/2018",
    "text": "The food is great from my experience but like the other negative reviews, the service is terrible and very discombobulated.  How hard is it to make a consumer feel warm and fuzzy? Pretty hard I guess.    The food is good, but you guys need to figure out your service issue.  I've had negative experiences with managers and associates, so I'm now sure what the problem is.  Love your food, especially for catering!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5X7syimE5Z0UPr6WA73qJw"
  },
  "co8oZUHknAHvBVEEBMKCfg": {
    "date": "4/6/2018",
    "text": "Thank you for making my day miserable. It did not start good and thanks to you it did not end well. I took a picture of the sandwich you sent. I don't think it needs any explanation. Thank again. And yes it is sarcasm.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "x46KG4YOc4bp5GBfK41xeA",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States. This a steak stack sandwich. With caramelized onion and mushroom. Or it is supposed to be one. I&amp;#39;m not sure what this is.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/x46KG4YOc4bp5GBfK41xeA/o.jpg"
      }
    ],
    "user_id": "-JO8ReHdLDIeLVP8dvAZaQ"
  },
  "29gQsPZUgxHR9aTJZR__Eg": {
    "date": "6/23/2018",
    "text": "First time here, honestly the good was pretty good. But there was a server ASLEEP in the front booth next to the cash register. Which was very weird and uncomfortable. Also they were completely out of falafel due to a broken freezer... this place needs some help in the service department.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A0v_hRp2LMCbuxuC18k2qQ"
  },
  "UnyMCqcsYxlNQgI5_44Jcw": {
    "date": "10/22/2017",
    "text": "I was disappointed. I've gone to Zoe's all around the valley but the one by Fashion Square Mall  on a Sunday evening they acted like they really didn't care. The pita chips were stale and the lamb meatballs seemed like they had been sitting because they were dry and not hot. I'm not a complainer, but having experienced Zoe\"s on multiple occasions this was disappointing, I will go out of my way to go to another one other than this one",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QYdXzgBM2k6uYxyCefiBgw"
  },
  "KKfG4AuHQPdFcSU7Crw3MA": {
    "date": "10/16/2017",
    "text": "The food is really good here.  My friend had the lamb and rice and it was super flavorful. There was a confusion with my order and I ended up with a Greek salad with pototes.  It was super good though I should have gotten something else too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jhE0HCEgIxBvE3PXbxm4AQ"
  },
  "Dx8s9BhVZOXVxhiP91wfeg": {
    "date": "10/1/2017",
    "text": "My god this is the worst place I have ever been in a long time. Typical chain garbage. Got chicken kabobs, and veggies which were still damn raw, Rice tasted like bagged rice that got re-heated. Gross. Then I got this tomato substance with my kabobs, similar to Delmonte Canned Salsa. WTF??????????? None of the food we ordered was correct. I will say too, the chicken was similar to pressed meat! GROSS!  My wife ordered Cauli Rice but got regular. This place is just stupid and bad! Gross Corporate food. AWFUL!!!!!!! YUK! Basically it was NO BETTER than McDonald's. Really! Stay away.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aB27UBgGJUtDS0L5qzdA0A"
  },
  "ipOgFx8RBV8asX-7HZOmPg": {
    "date": "6/7/2018",
    "text": "Wow! I have been a costumer at this Zoe's kitchen for a while now and I always order to-go when I don't feel like cooking and this past visit that I encountered at Zoe's kitchen was amazing!!! I love the atmosphere when I walk into this place, the greeting is warm and welcome and they never fail to make me smile. I am beyond thankful for the workers at this Zoe's kitchen because I know that I will never be disappointed. So thank you very much  when I walked into this grab my order during my last visit I was greeted by my favorite worker, her smile was very warming and she even paid for my meal, she told me that she sees me in their restaurant a lot and she was feeling grateful so she paid for it. That definitely made my day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CIkdsO5YR4RQek_yB-WwiQ"
  },
  "D0cmgdYa328C8BiTKuzBxw": {
    "date": "12/22/2018",
    "text": "I love this location! The front lady Shar was amazing! Goes above and beyond to make sure my order of correct. She double checks everything to make everything is correct. She makes the location feel welcoming. When I'm eating she walks by to make sure everything is ok and the restaurant is in order.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MyVuFn59rZ1Dmsr3TrrgYg"
  },
  "8Zr3_VeNeXUFnCuJsEjekg": {
    "date": "6/18/2018",
    "text": "The food is really good, I have food allergies with Gluten and Dairy and had some of their pita dips and creams and had stomach irritation, so would stay away from that.  The real annoyance at this location particularly is when I walk in around lunch time anywhere from 12-2 P.M. the place is not busy, but I inevitably end up waiting at least 2 minutes form someone to notice I'm waiting for someone to take my order, employees will walk by and smile but no one will help.  And this has happened numerous times.  The other annoying thing is once I get my order, their either out out of forks or no ice, or lids are low.  I mean I must be coming in after the lunch rush or something because you'd think this would be a rush hour and people would be ready to take orders and have the place stalked.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EVzwhHkWsK7FvFZAjFgidA"
  },
  "iQK8pVjcI12OrfKV2-tpyw": {
    "date": "4/24/2018",
    "text": "The food here is absolutely delicious. You have many choices from bowls that are filled with protein to other traditional Greek dishes.  This service is exemplary and the place has delicious desserts as well",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iR2iL7pWEKu5vp0L5GpqrQ"
  },
  "wAik18M_Q0fhpwHzRdvekA": {
    "date": "5/4/2017",
    "text": "It's hard to pick which was the worst part of my last meal at Zoe's.  I used to eat at Zoe'a anywhere from 1-3 times a week - always the tossed Greek salad.    And almost every week, it arrives (I generally order thru Postmates for lunch) different than the last time.  Sometimes it has pasta salad in it, sometimes potato salad. Sometimes cucumbers, often not.  Sometimes no olives, which is particularly strange for a 'Greek' salad...  But this last week was the proverbial straw that broke the camel's back.  For about the 6th time in the last 6-8 months, the salad arrived without one of the main ingredients - the grilled chicken and onions combo.  This is a tough one to forget, being a main ingredient and all.  But much to my surprise, this wasn't even the worst part of this delivery.  I called the location to let them know they forgot the chicken.  Additionally, I wanted them to know that these screw-ups occur way to often for an item like this.  It would be like ordering a hamburger at McDonalds and getting your order without the meat (and let's not debate whether that is meat or not....)  I asked to speak to the manager on duty.  He gets on the phone, I tell him what has happened, gave him background about how often this has happened - and that if they can't fix the problem, I'm going to have to stop ordering from Zoe's, despite the fact that I really like the food.  But getting the order wrong almost all the time is just frustrating.  The assistant manager offers me a free salad.  This is great, and I'm grateful for that - but what I really want is for them to just make the salad right, and I explain this to the manager.  So here is where it just goes off the rails.  The manager proceeds to tell me I should be more grateful for a free salad, and that he isn't on the actual cook line and can't check that every order is made perfectly.  I was speechless.  It actually took me a second to process what the 'manager' just said - he's not on the line, therefore can't verify or be responsible for the quality of the product of the location - he is in charge of.   It come to think of it, he might have said he was the assistant manager, so maybe that explains it....  Needless to say, Zoe's is not just off my menu, but my department's lunch menu as well.....  Edit - I can't seem to reply to you, Bethany, so while I appreciate your offer, I am going to decline.  I forgot to mention another issue in my review.  Since the assistant manager was less than polite or helpful, I asked to speak to the overall manager.  He said she (I think it was a she) was out and back in tomorrow.  I said it is very important that she call me, given the repeated issues.  I gave him my number, but she never called.  That was really the last straw, and why my company won't be ordering from Zoe's any longer as well.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AeOBrtgTrTq3CjBN1DEUAQ"
  },
  "5PFLWpwD9sq6N9UQeY7H2Q": {
    "date": "6/17/2017",
    "text": "This place is great for a quick healthy meal (don't you feel like you're always looking for that). The only thing better would be a drive thru! I've ordered the salmon kabobs, chicken kabobs, and steak kabobs all at separate times... steak is always the best! Also forget the calories and try the chocolate cake!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cTkwhMLSavNOO_swPKf-ZA"
  },
  "NY6alKT_xaJWCCto146dPw": {
    "date": "3/3/2018",
    "text": "New menu is fantastic, food is always great, but the staff seemed frazzled and couldn't find certain items we wanted to order on the computer. Some tables waited forever for their meals. Kid's option of chicken fingers should not come with a pile of onions on top- that is not kid friendly. Lastly, there was an unbelievably annoying dinging sound coming from a computer near the drink machine that made my daughter ask me \"Would you rather listen to that dinging sound or jump out of a window?\" And we agreed we would rather both jump out of a window.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IKmJzb67sLsaKa8PnCdl1w"
  },
  "XTtULtWpnLVWOipbJ3o-6g": {
    "date": "3/6/2016",
    "text": "This is one of my favorite lunch spots! I think it's really underrated. Their food is consistently delicious and fresh!  I love that they don't use mayonnaise in their sides: potato salad, pasta salad, coleslaw.  I'd recommend the roll-ups. Their chocolate chip cookies are also one of the best I've ever had!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RP9kGzCIMkLEWW1Qy2Q66A",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States. Spinach roll-ups with a Greek side salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RP9kGzCIMkLEWW1Qy2Q66A/o.jpg"
      }
    ],
    "user_id": "Vd84P1O_aui6-BAElpZk6A"
  },
  "07pq6DwWiTLCoPdxAbVmHw": {
    "date": "9/7/2017",
    "text": "First time eating here & wow was it good! Went around lunch time & the food came out in a timely manner & the place wasn't packed at all. Had the steak cabob w Italian sauce & it was sooo tasty! 10/10 would recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1jhHTQRCmOqEcG2RrHoM1w",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1jhHTQRCmOqEcG2RrHoM1w/o.jpg"
      }
    ],
    "user_id": "pWkKtqtkWq9YzeoMYwlUlA"
  },
  "NzRhBZit8EytWdb5vJCUtQ": {
    "date": "6/14/2018",
    "text": "I normally enjoy Zoes Kitchen very much; excellent food quality with prompt and excellent service. With that previous experience in mind, I stopped by this location (Camelback and Fashion Square). I walked in and it was not busy in the least. As I approached the counter three employees just stood there, did not greet me, back turned and completely inattentive but engrossed in conversation. The verbiage was something about 'girl you should have seen...' I waited as I was wondering if they were busy. One finally craned her neck behind her as I asked how long I could park in the spot just outside the door because the sign  said '15 minute parking'. I was debating whether to dine in or order out. Finally, one of them said: 'you're ok, go ahead and order' - she then promptly turned back around and one of the other employees walked away. So there I sat for an additional one or two minutes dumbfounded as no one responded to me. That may not sound like a long time but with no line at all, it is.  Finally, a fourth employee whom I had not previously seen exhaled loudly from a booth behind the front counter: 'damn that was good' as he finished his meal and packed up his plate and walked past. He looked at me, ignored me and as he walked past, I noticed that his  pants were hanging half way down his behind with his underwear and part of his bare ass showing out. This is IN UNIFORM mind you.  At that point, I decided to leave and never return and to mention to anyone I meet to stay away from this place. I will return to Zoes by my house but I will never go to this location again.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uCO7Q00wP4S3zkbNiQySFw"
  },
  "S7gJuGEm5WlgTs31-lomug": {
    "date": "9/18/2015",
    "text": "Zoes is my favorite place to grab a quick & healthy lunch {alone or with a friend!}. They have Wifi which is great if I need to get a little work done during my lunch hour as well. Their menu has a variety of healthy options but for some reason I can't get away from their Quinoa Salad + chicken & caramelized onions. It is literally to die for! I usually devour salads but this one is hard to tackle, the quinoa is very filling, not to mention, they pack on the veggies!! A few goodies in the salad include: {quinoa, lettuce, tomatoes, feta, cucumber, black olives, green onions & broccoli}. The chicken is SO tender and perfectly spiced, along with the caramelized onions that make anything better! Last but certainly not least, I drizzle it with their Zoes Greek Dressing{on the tables} and it is H.E.A.V.E.N. Looking for a healthy lunch spot? This is it! If you get it to-go, make sure to ask for a side of their dressing because it doesn't normally come with it!!   {Fun Fact: I even tried to re-create it at home and it was good, but didn't quite compare!! I can't figure our their perfect chicken secret!}",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hiLNdLphzVFy5TYbBM40-A",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States. Quinoa Salad with Chicken... Seriously heaven! And they have wifi here! Double win.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hiLNdLphzVFy5TYbBM40-A/o.jpg"
      }
    ],
    "user_id": "e6iCOIhtupBCiw-VwBvJ4A"
  },
  "ODa4_C7D6J-EPiQbo9-9jg": {
    "date": "9/20/2015",
    "text": "Light, fresh, reasonably priced Mediterranean fare in a cute atmosphere.   Friendly service (order at the counter, grab a number, and your food will be delivered), tons of seating, and yummy food.  My husband and I both ordered shrimp kebabs, and I substituted veggies for the rice. Everything was fresh and tasty.  They also have the cool giant some machine with a vast selection.  It's right near our gym, so we're sure to be regulars.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "pzM8CoTcFaEFLKPW2wvQ3Q",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States. Generous portion of shrimp kebabs!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pzM8CoTcFaEFLKPW2wvQ3Q/o.jpg"
      }
    ],
    "user_id": "xR4engcg6Vm8xToBgKI5FA"
  },
  "BDrYKmyt0aAJtEHaUpK_MA": {
    "date": "6/25/2017",
    "text": "Many pieces of greens in the salad were dryed out and rotten. Cucumber was frozen. Literally frozen into ice. Staff was friendly, but quality of food and ingredients very poor. Total disappointment.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nrFExgTieFhgXDnw6QRJ0g",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States. Poor quality of salad ingredients",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nrFExgTieFhgXDnw6QRJ0g/o.jpg"
      }
    ],
    "user_id": "6VJRhJLJXDzwJcAWaRquvA"
  },
  "0-fiQmHfWaqwqchxzCQevg": {
    "date": "11/5/2011",
    "text": "First time eating here and all I can say is that I hope they are able to franchise in Georgia soon.  I had the chicken Kabobs, rice and Greek salad.  Food was fresh, tasty and a good value.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XQskSuKW9TzYwmYzY58EFg"
  },
  "m2J4yrn9Su8SCI2lIJRlNQ": {
    "date": "2/7/2012",
    "text": "I've eaten at Zoe's a handful of times and have yet to be disappointed. The food is fresh and delicious, the customer service is great and you can't beat the location. Who doesn't want a lunch break after a long day shopping at Fashion Square? I'm a big fan of the tuna sandwich and tomato soup combo. Yum!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jt4u7qnfrk35buainfOuGA"
  },
  "tTsCvPrZDx02mGVe8qKzkw": {
    "date": "7/12/2014",
    "text": "Food is good, not great. Healthy place to eat but not traditional Greek food. No gyros, basically only chicken and turkey pitas, and the roll-ups are made with tortillas. I was under the impression it was more traditional Greek food. I wouldn't recommend if you want real Greek food. Still a healthy, fast place to eat.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P502bOJ7TEHM8BFkyoKXsQ"
  },
  "1c8Uz9o3258UBOBDAS69SA": {
    "date": "10/27/2011",
    "text": "Tried 3 diff dishes..all were below avg at best.  Too expensive for bland food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MFIHJh0TGOagTyZyYVw8LQ"
  },
  "_a3KTSPnA2h40-8Gg2YXpg": {
    "date": "4/12/2014",
    "text": "I love the steak roll ups with fresh fruit. Everyone is always so nice and place is always clean.  Wish there was one in the east valley!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "68Ewz8mSKRXr3QKDm6vmiA"
  },
  "lgpw7iLzUR8r1jkdbrIvtw": {
    "date": "2/24/2013",
    "text": "Amazing food!  The steak kabobs were the best I have had.   David took care of us and made us feel like family.   I would suggest anyone try Zoe's if you want great food and a friendly atmosphere.  YUM!!!!!!!!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2SKIrOWu6clqzok-jU6qeg"
  },
  "8YwnBJSnZ5mwkvnYLmeAWw": {
    "date": "3/20/2012",
    "text": "Zoe's does it right every time! Clean, GREAT food, and amazing service! All the staff are very friendly and helpful. Lots of food for a great price! Everything is very fresh and the chocolate cake is soooooo good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uvJPu9VkGtS27B8xPdsyqg"
  },
  "I8crdY4BlubXkC90SUKaFw": {
    "date": "9/15/2011",
    "text": "Just had an amazing even at Zoe's Kitchen and was off the charts!!!  Our guest loved the food, the atmosphere and the friendly staff!  Even our the staff at our office eats there twice a week.  The food is fresh and healthy and the price meets the quaility.  Would recommend Zoe's to anyone.  My favorite so far is there Chicken pita pizza. Yum!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0DmudZQXn6ZsVGBhh4etcg"
  },
  "PU6ISdnT9Mto0BZCKLpvKw": {
    "date": "8/1/2011",
    "text": "While on my way to a neighboring establishment I discovered Zoe's Kitchen in Scottsdale. I have always wanted to give their Phx location a try, so this was my chance. I am a vegan and ordered the veggie pizza and salad. I neglected to inquire if these qualified as vegan (My Fault-they did not) and when the salad arrived, I explained my situation and they could not have been nicer about it. They remade the salad sans cheese and recreated the pizza to be vegan and EXTRA good! Wonderful staff, nice atmosphere. reasonable priced and delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VKsKbULN9voKXtb0bGMEEg"
  },
  "T9nL_xzVT2getydohqMBtQ": {
    "date": "8/8/2011",
    "text": "Great food and great service. I have been several times to other locations and this one is as good as the rest. Very clean and a good value.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mhYxlgEe8j-qKD3sePUtbQ"
  },
  "C4OiYQjVa4C6GSnXNLaZKQ": {
    "date": "8/19/2012",
    "text": "Usually come here once or twice a week. Healthy options and still very tasty...will make you feel better about stuffing your face! Chicken kabobs are great, Comes w greek salad, pita, and rice for about $10! The turkey stack w potato salad is always my sandwich choice!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H3hgOl7NcAG8AKuOjVcBqQ"
  },
  "ShXq7Jri1pj0WyxjBnAS-g": {
    "date": "7/12/2011",
    "text": "ok went and ordered the humus which i found bland  and the kids chicken and cheese queseadilla which is probley the best thing i have had",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nGoKau64-PtetuzfcRW3jA"
  },
  "szLKLns3jqv7vr_DVOBBcw": {
    "date": "1/13/2012",
    "text": "Perfect lunch! Stopped here while in town on a biz trip from NYC. Was planning to go somewhere else, but spotted this place and looked at the menu. I got a half an egg salad sandwich on multi-grain and greek salad. Just what I was looking for! Inexpensive, tasty and the egg salad was NOT drowning in mayo. Hallelujah!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J0ypncrv6KU14KERNjSnoQ"
  },
  "zvckKT-bB4W_WGhO4_oOyw": {
    "date": "9/14/2019",
    "text": "All Zoe's Kitchens are wonderful but Waterfront always nails my order and makes me feel like I'm their only customer! I usually get it to go but the dining room is very clean and tables are spaced nicely with decent music. Also, just park in the garage  I recommend steak kabobs, roasted vegetables and grilled potato salad, and chocolate cake!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yzAQIdgX6f9RLvIt4axfFA"
  },
  "7imBw81e0yfxsQL2aNE1vA": {
    "date": "2/11/2019",
    "text": "Whole30 compliant what???  I swear this place is too good to be True!  A reasonably priced meal, healthy, fresh and Whole30 compliant.  I just discovered this restaurant two days ago and have been twice!  I'll certainly be a regular.  It's refreshing when restaurants listen to their customers and offer food compliant with their dietary restrictions.  I can actually eat here with my two small children and not feel guilty they or myself is eating something not good for us, plus it's all very tasty and fresh!    Great job Zoes kitchen.  Will be lifelong regulars.  Great customer service as well.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "E66hElQuuJQR_B06M72IVg",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States. Mediterranean chicken kabob, grilled veggies, grilled potato salad and Italian verde sauce!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/E66hElQuuJQR_B06M72IVg/o.jpg"
      }
    ],
    "user_id": "JtwwBQe6pk5z6Cbf8U98DQ"
  },
  "HaPgHbEPLdI52qD1fMjnfw": {
    "date": "3/12/2019",
    "text": "Went for lunch from work on a weekday as it's pretty close to my work place. Ordered falafel - tasted very flavorful with the taziki dressing. Chocolate cake - spotted this evil guy while paying for my falafel at the counter and I was too tempted to leave it behind. I definitely don't regret the purchase as it was delicious! I'm certainly addicted to it! :p",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "9lA2Wpo6n_S6v7iD_L6bFA",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States. Yaya &amp;#39;s Hand - Made Chocolate Cake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9lA2Wpo6n_S6v7iD_L6bFA/o.jpg"
      }
    ],
    "user_id": "A2UXTirzw8j6ifwZx2klTA"
  },
  "PYq9IVAMmMETzZarzXbzDg": {
    "date": "8/1/2019",
    "text": "Do not waste your money! Less than okay.  Food came out and the lady brought it with her finger in my food and she was the same lady in the cashier... I got the hummus and a chicken gyro. The hummus tasted wired like sourish, I thought for sure I was going to get food poising. (Thank god I did not). It just seemed dirty.The gyro with chicken was just blah, have eaten way better and the salad came without dressing so you had to put the dressing on and the plate just became soggy. I would rather eat at a mom and pap place. Won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "duGTVHPyY5yDU9b_tUwm0Q"
  },
  "dQT63OYKRrSksyZdaiEE7w": {
    "date": "7/28/2018",
    "text": "We first learned of this place when they catered a group event at my company.  I wasn't in the group, but they had leftovers.  I snagged some of them.  They were good!  So it was cool when I spotted this right next to Scottsdale Fashion Center.    They had a chef's special of citrus marinated chicken.  We ended up with two of those, plus the Greek chicken pita, and a chicken salad sandwich.  It was all good.  The marinated chicken was moist, though the flavor was mild.  They included a choice of sauces, and that did help add some zing.  The rice was really good, and the falafel was fine also.  However, the chicken pita was really slow coming out.  Some sort of confusion in the kitchen.  One person thought it had come out already, but it hadn't.  To their credit they comped the pita and it came out about 10 minutes after we complained.  Then we ordered another citrus chicken to go.  And we waited.  And waited.  Due to some sort of mixup in the kitchen it took half an hour to get it.  We were not happy.  But, to their credit, they took customer service seriously and offered us a second one on the house.  I know stuff happens.  Sometimes it's how the business handles it that makes it an issue or not.  In this case they were apologetic, accepted responsibility, and offered us some compensation for the hassles.  Because of this I can go to 4-stars.  Good food, and efforts to address service issues if they occur.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "btMbtUUNdyXKb_6tpdkOsg",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States. Citrus marinated chicken and falafel",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/btMbtUUNdyXKb_6tpdkOsg/o.jpg"
      }
    ],
    "user_id": "YJYFsF4z-C2qODH5HnGXiw"
  },
  "JqKGEftqyW4JSdrjSye3UQ": {
    "date": "10/26/2018",
    "text": "We used Zoes kitchen for catering. have to say it was delicious the catering turned out perfectly and there were no errors in the service or in the quality of the food. Everything that I ordered showed up and was prepared on time if not a little early. This particular location loses three stars for no parking!! There's plenty of parking if I was going to park pay and stay and eat there. BUT I was just picking up catering and there was no 30 minute pick up spot in front of the store for me to grab big boxes and bags. That means I will never catered from this location and I am highly disappointed in the lack of parking.  Store employees were delightful and they help me carry things out and I tried very hard to accommodate the distance I had to park.   Five stars for food. Five stars for employees being great!   I highly recommend the steak roll ups! Also the cabbage slaw!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Mq8Su0PZC8D4EaJrLJOhYw"
  },
  "qDV-nlcxhmNovGgKzPdM0Q": {
    "date": "7/30/2019",
    "text": "Normally love coming here and finally returned from a summer long vacation only to be disappointed by my classic order. The falafel pita was absolutely bland and I have a feeling they fried the falafels even though it says baked on the menu. Wondering if theirs a new chef in the kitchen, unfortunately do not plan on returning and will have to get my falafel fix somewhere else",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JRQ7I60UplwCWuvp8Tej0Q"
  },
  "X49lqYceEif7sJsTjtkW6w": {
    "date": "9/7/2018",
    "text": "Wow!  First time a couple of days ago and service and food amazing.  (Minus they forgot my paid for tzaziki - but brought it quickly!)  Nice and clean place. Service with a smile! Made quickly, great stop for lunch!  Food review (Mine only) 1) chicken skewers with Greek salad, rice and added a pita and tzaziki. - chicken tender and spiced well! - salad perfectly made and love that you can serve yourself dressing! - rice moist and flavorful. - pita warm and delicious. - tzaziki has mostly chunks, so ifs it's not your thing, don't order.  I don't like that but the flavor was a good balance of sweet and sour! - drink cups, purchase and .99 for refills! 2) tastes the red pepper hummus, it had some weird hot sauce on top and the actual hummus didn't taste much like anything - so a pass for me. All in all - definitely coming back here!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xyjluZPvyELGOfhfa4h3xA",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xyjluZPvyELGOfhfa4h3xA/o.jpg"
      },
      {
        "img_id": "5RJKHWIzk4FShgEB8uE0dw",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5RJKHWIzk4FShgEB8uE0dw/o.jpg"
      },
      {
        "img_id": "6aNxfval6GDLdwNKL6yPIw",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States. Chicken pita w/ salad.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6aNxfval6GDLdwNKL6yPIw/o.jpg"
      }
    ],
    "user_id": "JK-7IoZX7ZZN0FZu9JYLSA"
  },
  "CAVEnH_0T68lkjlxxhwMBg": {
    "date": "10/12/2018",
    "text": "My husband and I ordered:  Spinach and Mushroom Piadina.  Lamb and Beef Kafta in a bed of Tzatziki sauce.  Hummus Trio.. Basil, Pesto and Classic.  No complains.  Everything was delicious. Even the the lemonade, you get a large drink for about $3.     Seating outside Clean all around Parking everywhere Good customer service Prompt service Enjoyed eating here",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YcNTjyKeTwfkJYVf4nZniA",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States. This is how good it was",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YcNTjyKeTwfkJYVf4nZniA/o.jpg"
      },
      {
        "img_id": "u05Zo8KLnliezznz93xL4A",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States. Front of establishment",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/u05Zo8KLnliezznz93xL4A/o.jpg"
      },
      {
        "img_id": "t9TgcERf9223b1EerjXmdw",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States. Spinach and Mushroom Piadina.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/t9TgcERf9223b1EerjXmdw/o.jpg"
      }
    ],
    "user_id": "dzhdfLAY0VNq004_qsxzdg"
  },
  "w6QOvPK3Wy1DpzypJG4qnA": {
    "date": "1/21/2019",
    "text": "In town for work and found this place on Yelp. Great customer service and food. Would go back again. The hummus side was amazing with WARM pita bread and fresh cucumbers. Loved it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "OYnkhK0DnxS12isYnrppLg",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OYnkhK0DnxS12isYnrppLg/o.jpg"
      },
      {
        "img_id": "niqEuBY3h_79Tozw8F_Obw",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/niqEuBY3h_79Tozw8F_Obw/o.jpg"
      }
    ],
    "user_id": "J4PJtP7vq8rtqQNiIrutxQ"
  },
  "MJZr20sEsN7_fg3jhux_0w": {
    "date": "4/3/2019",
    "text": "I ordered a Gyro pita for lunch from Foodsby.  I selected that I wanted a side of Tzatziki sauce and was charged 29 cents for it.  I wanted 2 sides, but the app doesn't have the option for more than 1.  I wrote in the comments that I wanted 2, but you only sent 1.  It's too bad that not giving me the extra side of sauce cost you a customer.  I won't order from you ever again.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nA6g1g2twzLaiHSnEXaFAg"
  },
  "IH_QjgH065vOjaJzMRpVYQ": {
    "date": "10/20/2018",
    "text": "I've been to Zoe's Kitchen twice, both times for lunch. I had the Quinoa Salad each time, and it was equally good each time. I get it without the feta cheese since I'm vegan. I believe they have one or two dishes that are vegan, and quite a few that you can make vegan if you take the cheese off or change the dressing. The quality of the food is good and the taste is great! The service was definitely better the first time I went. The second time the people were pretty offhand and seemed like they didn't care. I would definitely come back again for lunch!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bHO6VlisdgFNz56jjEyxwA",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States. Quinoa salad (minus the feta)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bHO6VlisdgFNz56jjEyxwA/o.jpg"
      }
    ],
    "user_id": "ZdRkCXwdGdaOAeLa06lJgA"
  },
  "KjkSyt1zF3XlqWe1DsudCg": {
    "date": "7/13/2019",
    "text": "Well for starters I got a free birthday by a cashier name Chara. Not just a free birthday the kind words she would use while taking our order... she is one of those that you know are sweet when they call you something like sweetheart.... anyway. My family and I had a wonderful experience there. She was kind and helpful. She was very nice to my little baby boy too! I do recommend this place. Chara was also patient as my family and I can be undecided. Overall, if it wasn't for Chara, it could of been an ordinary lunch out. Good wasn't bad either. I want to try the Kabobs next time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lwqTPIBYRMgPKsKF9yTq6w"
  },
  "6b6mz-r5KLgDyy2B-MDuaA": {
    "date": "12/25/2017",
    "text": "For more than a decade Zoes has been one of my favorite (fast food) restaurants to grab a healthy bite. This massive chain litters the South's cities, but is fairly new to the Phoenix area although more seem to open often. It's a large chain known for quality and fresh food, great service and entrees that are largely healthy. In this part of town it's a chore to decide where to eat simply because there's so many options. Zoes is on the more affordable side.    This particular location (I've been to about 75 of their stores nationwide, maybe a few more, actually) excels at providing friendly service in a always clean atmosphere. We choose Zoes for several reasons.  Everything is made fresh, from scratch and on site daily. The food is brought in every morning, prepped and served. Yes, fresh. Every day. Where else can you find that from a fast-food type chain?   The biggest challenge at Zoes is what to order. There's so many tasty items on the menu. Normally, we start with the Hummus Trio (classic, basil pesto and red pepper hummus). Keep in mind, they make this on site. And, there's cool, crisp veggies to dip, too.   As for entrees there's too many good ones to list, but we're partial to the Chicken Roll Ups, Beef and Chicken Kabobs, Tossed Greek Salad, Gruben and new (ish) Power Bowls. To be fair there's nothing on the menu that doesn't reach your table cooked to perfection, well seasoned, fresh and with a friendly smile.  Zoes is ideal for couples, families, young adults and children (even this kid's meal is healthy and impressive). There's something that was made in house for everyone and packed with enough flavor to keep you coming back. It's a fast food chain that doesn't taste like fast food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SAfNyiLVgPZzp_aGpXnfwg"
  },
  "tv094O5scqpRhwza6SIVCA": {
    "date": "2/16/2019",
    "text": "They have a great selection of gluten free and whole30 options!! So pleasantly surprised. Food was delicious too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k-hwv5zItU6JfsYYXB9N_g"
  },
  "QUM363i1r2Wf4NndI8wC6g": {
    "date": "3/24/2017",
    "text": "The server was really nice, good was good and good location. Drinking beer at here in summer is gorgeous. I ordered chicken kebab and my friend ordered beef kebab. Both was really good and flavorful. We went there in Sunday lunch time was not packed. The restaurants next to this place were all packed and we were asks to wait for 1 hour...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "whSpMQdiiG7_7hq-3R2uCw",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States. Hockey kebab",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/whSpMQdiiG7_7hq-3R2uCw/o.jpg"
      }
    ],
    "user_id": "t-xz0UANgS2l_xXYa7J8qw"
  },
  "R_d6jxURlmlX32sWh6afjQ": {
    "date": "2/22/2019",
    "text": "Ordered delivery through Postmates. It's just so good!!!! Ordered for the whole family. Our finicky boys loved their ham and cheese piadinas and pita chips, my wife loved the chicken kabobs and tomato bisque and I just about died when I had the lamb pita. Zoes hits the mark with everything. It all tastes so fresh and so clean-clean.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mk_K33V2XToJBzme4YjHvw"
  },
  "drLUZxLthYvCzJO_Tj0Xjw": {
    "date": "2/18/2019",
    "text": "The food tastes great and makes for a good, healthy meal, and the restaurant has a good vibe. The guys working their tonight - Neko and Miles - were awesome and made our dining experience a lot of fun and were really helpful with everything. My wife and the other couple that we were with (we do group workouts every Monday evening) plan on returning on a weekly basis. 10/10!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n8PDM2CfqEF3MppkMTmaUQ"
  },
  "O36MLLYLXBPmNYcZHLxB1A": {
    "date": "5/15/2018",
    "text": "Just order a salmon power grain bowl and this place literally gave me the 3 small chunks of salmon for a whopping $13. I live walking distance from this place and can honestly say it's been one bad experience after another at this shit show of a place. To top it off when I called back to complain they offered for me to walk back and get the 4th piece that was forgotten. It's unfortunate that this type of place brings down the wonderful waterfront and the best part of this whole situation is there are way better places around so never going back is an easy decision. Be warned if you are contemplating going here just go next door to sauce where customer service is top notch and the food is worth the price. A bunch of clowns running this show. So sad.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "u823sZ3l7yfmk4NJN0JOOA",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/u823sZ3l7yfmk4NJN0JOOA/o.jpg"
      }
    ],
    "user_id": "lP0SjMom8MJQn0F14W1dHA"
  },
  "JVoSMC3-nuxS6yxXpARWRQ": {
    "date": "4/16/2019",
    "text": "Staff @Zoes kitchen was super helpful when my catering order was no where to be found. They were patient and professional while I made several calls to find out what happened, and they made the order very quickly for us. Thank you!! Great customer service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j4iywc8J-q-YRHNjc6WAIw"
  },
  "drPZZZP3A8sLmGDgV04WGQ": {
    "date": "1/27/2013",
    "text": "I visited for the first time 1/22 and I can't wait to go back! They have a small area outside and I took my dog with me. I was offered water for my pup right away. After deciding on steak kabob plate, and using their awesome soda machine, we waited for the food which didn't take long at all. It was seriously like a home cooked meal, I loved it. Even the sides were delicious, everything tasted so fresh. Even though I ate all my food, I had to try their chocolate cake. It was great, not too sweet! Yum",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GEL9s2ED651-USjvEfqFpQ"
  },
  "KqWtX5a7peEwYqPTjR-7TQ": {
    "date": "12/17/2015",
    "text": "I usually love this place, but tonight I am very disappointed. I got the Mediterranean Chicken plate, and after a long day at work, I couldn't wait to get home to eat it. I began to unwrap the foil that they wrap the chicken in (to help keep it warm), which is nice, however when I opened the foil, all I had was 2 tiny pieces of chicken smaller than the pita bread they serve with the dish. I have eaten this same dish, from this location numerous times over the past couple years and have never had a problem. It is a delicious dish, but tonight it was not worth the money I paid for it. I hope this hasn't happened to others here, because it's very disappointing when you order food out, that you think someone checks at the restaurant to make sure everything is correct, including ingredients, sides and portions, and you get something that should've been half the price of what you paid. I guess I'll have to check my food before I leave there now, because whomever was working tonight did not do a good job.  Side note, we also ordered a side of hummus, which we didn't get any pita bread with...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-B6MkcQGNgvNjthnfgR9Jg"
  },
  "Qeb1D9AOMJYzEY9VL9vACg": {
    "date": "3/6/2013",
    "text": "Take out was disappointing.  I had a Pressed Sandwich with Grilled Vegetables.  The Sandwich was just all right and the grilled veggies were a real miss.  The \"Grilled Vegetables\" consist of 3 pieces of Broccoli, Onions and Small Slices of Carrots (if anything else was in this extremely small portion, I could not see or taste it). NO FLAVOR.... I was not impressed at all and think you might be better off trying one of the other Mediterranean places in town.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wrpikUIpdXxK30RWUTfxJg"
  },
  "LE1AikecwHqnfzqZrtbzeg": {
    "date": "12/27/2014",
    "text": "What a great  experience we  had  eating  here!  We  were group of  7 people  found it reasonably  priced   The lady serving  us  was  extremely sweet and  served us very well lifting our  spirits,  rarity  these  days.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "hBTtFKwF8sdOTpGSka7tbw"
  },
  "tVfLL8sJqymS18yxhNL9vw": {
    "date": "7/25/2013",
    "text": "I love this place! they have the best cheese pimento spread ever , Tangy and good. There prices arnt the cheapest ,but the food is always top notch. I like the decor too, you feel like it is a hip place to be and that they care about the materials they chose to build the place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qLiFM003llachyNWtd_viA"
  },
  "FQ3pJ1x_RtV1s4ZkKodjSg": {
    "date": "7/16/2013",
    "text": "Fabulous, fresh, healthy, inviting, clean and the service is amazing!  Love, love, love this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-XoCb6sUMa7NoFayUW0FlA"
  },
  "YsLs0Umw20jMvrZguzHTpA": {
    "date": "7/2/2015",
    "text": "Obviously I'm still going to Zoe's kitchen on a regular basis because they kick ass. Unfortunately Seth is no longer the manager of that location but Lindsay now is and she kicks ass as well. A big thank you to the whole Zoe's staff for always keeping it real with my chicken and spinach roll ups and odd post mates requests. Oh, the brownies are so good!  Zoes stock is also on the up and up!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qg3oL5r6fHWWYLIYP4kPvg"
  },
  "14gCoPdgP95N6Kg8efQOpQ": {
    "date": "8/3/2012",
    "text": "I love how fresh the food is...I wish I didn't check the nutritional count, the sodium content for most of the menu items freaked me out. I guess that's what happens when you eat at chain restaurants.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pTUh580nYtGi5Go0U0iI7w"
  },
  "R3jVuWusKsKxhU4vOIGXLw": {
    "date": "5/19/2014",
    "text": "The food is fantastic, the staff is warm and welcoming, and the ambiance is cozy and fun. What a great place for a leisurely brunch/lunch. I highly recommend the spinach wraps with chicken and a side of quinoa. Feeling brave? Then top off your meal with a chocolate chip cookie .... But you've been warned, this cookie is not for the faint at heart! Provecho!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "kn-BUuWARFpMgp4ghIE22Q"
  },
  "7OOpb3TOIPY5d2NbNzV7cg": {
    "date": "2/26/2013",
    "text": "They have labels for vegan and vegetarian options!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zc5dh0i6c7TEPuhJqzuqOQ"
  },
  "1_CrBOAWCBMoj1dSBEy1cw": {
    "date": "2/4/2013",
    "text": "Good food and fast service. The prices were good too! I love orzo! :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vLixm38Zd-xgAvN1LQJfKQ"
  },
  "dc93THnC7k0xgNpMuetfaw": {
    "date": "1/23/2013",
    "text": "It was ok. I have experienced better places that have the same food. I felt pressured to get certain items, being that it was my first time. What's weird is that they have kebobs but no gyros. Probably would not go back especially with Culinary Dropout and Olive and Ivy right nearby.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fx471oyzcBl2Hu6IIIhJog"
  },
  "JljmnOGdfbIchgiDL8j3uw": {
    "date": "6/18/2014",
    "text": "Great meal and service.  Hubby and I split steak kabobs and hummus. Steak was tender and juicy and flavored just right. Potatoes are to die for!  Hummus was smooth and creamy and perfect.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "j-i6_zboeko9mkR9UIFKMw"
  },
  "qPHRLJJagj4xgIK_fcXwYA": {
    "date": "6/26/2013",
    "text": "Great food, friendly staff, and short wait. I love the fact this is health conscious place of business. The hummus is excellent and the soup was excellent as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MmyXBuicHOgq3Z-VcAymNw"
  },
  "z6q8MpmuXDuSArOtn-eFdA": {
    "date": "8/15/2011",
    "text": "start your lunch/dinner with their yia yia's chocolate sheet cake--it is very good!  i prefer their sandwiches and orzo salad!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 13,
      "cool": 8
    },
    "photos": [],
    "user_id": "9YRFLVFVbHGAJ1weFx5zqw"
  },
  "VuSgPTHJITIfebjwD9MI_Q": {
    "date": "3/9/2012",
    "text": "Great food and great service. This place seems to always have a good size crowd but never over crowded so getting your food is always quick and easy. This is a great place to come pick up a quick meal and a healthy one. Love this place! The Chicken Roll-ups are AMAZING!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2vqLKLVcsKD1AdIDbJcc3A"
  },
  "fC0eDr0a5DAhGJG4JbagMA": {
    "date": "8/9/2011",
    "text": "yum scrum! i am a fan.  i get two chicken skewers and a veggie skewer. seriously so bomb diggity. and the lunch prices are right up my alley at around $8.   the soda fountain is fun too",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "JmhVFueYvJe0CsUddwuajw"
  },
  "LDVWhOqULHqKqgQerwW0vw": {
    "date": "8/10/2011",
    "text": "Normally, I'm not a fan of franchises, but Zoes Kitchen has it down. Impeccable everything, completely healthy and delicious, every damn time! Zoes is a perfect lunch spot, with counter ordering, fast service, light healthy , perfectly appealing food. Service is always friendly and the food is always fresh. They use no mayo in their tuna or their out of this world slaw (something I literally crave)! The prices are quite ideal too! Obviously, i'm stoked on this place! You will be too :)",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "VPr1Y-PNKeApR-dRVnhJIA"
  },
  "6ukaNvEfl94S6j5r7wuYjA": {
    "date": "7/3/2012",
    "text": "It was perfect. My boyfriend and I were in a hurry, wanted something quick, healthy and light and Zoe's delivered. Not literally, we ate in. Service was amazingly quick and friendly. We ordered the Chicken Roll-Ups, which were delicious and wonderfully complimented by their salsa, which the server brought extras of! All in all, great experience, I'd love to go back, but I live in Cincy. Oh well. Rock on Zoe's.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wigRibd-TTXPzmvaD_XGhg"
  },
  "cNj1ghoXYDfqAST-QU4GTA": {
    "date": "10/4/2012",
    "text": "One of my favorite places to go for lunch! The food is great (greek salad, hummus, tzatziki, veggie pita pizza, spinach feta roll ups), the staff is friendly and the wait time on the food is never bad. Decently priced for what you get. Get a reusable Zoes cup for soft drinks, etc. if you plan to go here often!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-sFdV5hTNg8Qx-sbqAB2yg"
  },
  "8l8viP1N3QsPQomkPVx8UA": {
    "date": "1/20/2016",
    "text": "Love this place for a quick bite or take out order that is healthier. Parking can be tricky during tourist season on the street, there is also parking underground and also across street for mall. Staff is always super friendly, and the food is fast and good. They make a great red hot sauce if you ask for it.  Never had a bad meal here. Fun place to people watch if you have the time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uSl8Xx13jwNm9wqxy6QpOg"
  },
  "MDdl7TkfpA2QWTaF4c8o0A": {
    "date": "5/5/2013",
    "text": "Oh Zoe's, how how i love you. Oh how i\"m happy they have one in Scottsdale.  What's not to love there?  The tuna is ridiculous.  So fresh and I have no clue as to what they put in it, but oh my. The hummus?  I'm convinced it's laced with crack because it's so addictive. From salads to wraps/sandwiches, you cannot go wrong.  But what is NOT to be missed are the white beans.  Oh my god, you KNOW they aren't food for you but they taste like heaven.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "cty-VP-wvpUbsa-nPGc1CA"
  },
  "id3PIlap524_Itjv7lYX3Q": {
    "date": "1/21/2013",
    "text": "Who knew tasteless and Mediterranean went together.  I apparently didn't   Instead of the dreamy hummus and usually great kebabs I expected the meal was quite spartan.   I mean you can make food healthy but you don't have to kill every ounce of flavor to get there. The dressing couldn't salvage the flavorless wreck.  My dining companions made quick work of their food but I warrant that more to the 3 hour long Cloud Atlas movie was just endeavored in.  So yeah if you like crudites and happen to be a rabbit come to Zoes!",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "QSWJtxLoVriPLjVyP1Qt3Q"
  },
  "Lq2eUmWH9wXufP4ohcT-zg": {
    "date": "2/15/2016",
    "text": "I actually called to tell them how much I loved their Greek Salad!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BQyXT3-RlrH47xVsHcULzQ"
  },
  "rwyMF0WrLFD3QUrevmgncQ": {
    "date": "2/1/2016",
    "text": "Food is always great. I come here for work at least 1-2 times a week always order chicken kabobs with a Double Greek salad. Can't miss always delicious. The one time they messed up an order Marty the manager made it right the next time. They always go above and beyond to make sure you're happy. Thanks guys!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8DFrzE-oy55PwFQJdnZoYQ"
  },
  "dMNUKlnK-cx-sLHV1kU38Q": {
    "date": "11/29/2012",
    "text": "A quick, fresh, and fairly healthy meal conveniently located in the Waterfront.  Zoes is a big step up from most of the options in Fashion Square's foot court, and you'll get in and out of this quick-service spot much quicker than you would at most of the full-service restaurants.  The prices for the portion size and quality of the food is more than fair.  I had the chicken rollups.  Pretty good.  Two small chicken wraps, cut in half to make four pieces, which are about two to three bites each.  There's also a nice medium salsa for dipping which is the perfect compliment to the dish.  I also had a side of brazed white beans which weren't bad, although whomever prepped it went a bit too heavy on the rosemary.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "3cC726zwgerKNNasnidAww"
  },
  "rSHbM80BveDcvSfoifpH-Q": {
    "date": "1/3/2017",
    "text": "Beautiful food!  Fresh ingredients, delicious soup, gorgeous hummus, yummy chicken skewers.  Best 2:00 pm lunch I have ever had!  Great service w friendly staff.  I will be back for dinner! And when I am in Scottsdale, I'll plan my day around returning!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KgqH8sexG0cawp1puQTBOg"
  },
  "4p4HkbyzPROnHZbzJr1jyw": {
    "date": "11/1/2014",
    "text": "SO DELICIOUS! I suggest the tuna sandwich on sourdough. It was so fresh and flavorful that sometimes I dream about it. This place is very modern and stylish but with a nice twist on Mediterranean food. I can't wait to try more on the menu, this might become my weekly go-to place!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DNVPQ2L7ZxvUD9W8UYD-Jg"
  },
  "DS3dtm6A2P3FQDkd11X7mw": {
    "date": "8/30/2012",
    "text": "Adorable little healthy place! Food is excellent and service was impeccable.  The pita is fresh and grilled, rice pilaf is tasty but not salty.  The chicken kabobs are tender and juicy. Salad dressing comes in a bottle on the table- be sure to shake it before you use it! Must try- fresh homemade limeade. Very tasty and not too sweet! Most fun? Their awesome fountain drink machine- fun and techy. Definitely not your run of the mill fountain machine!  Yummilicious Factor = A-",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "rq3S_5Yg0E8ur0xWyZBczw"
  },
  "4RSgTSYj-Ifsbgetf1hEXw": {
    "date": "5/30/2012",
    "text": "Honestly, my visit there was perfect.  I'm not a foodie, and I've never tried this type of food before. My mom was visiting, and was lured in by the smell of grilled vegetables and spices.  The service was really great, friendly and sincere.   We both had the veggie kabobs with a side of the pasta salad and beans with pita bread.   I was wary about what kind of side beans and bread would make, but it was delicious. Flavorful and really comforting, especially on that pillow-soft bread.  Pasta salad was a really interesting new direction for me with its feta cheese and shell pasta. Not what I was expecting, but surprised in a good way.  The kabobs stole the show, mushrooms being our hands down favorite.   The soda machine is the coolest thing I've seen done involving a drink, topping the previous winner (drinking soda out of a Sippasaurus).   Chocolate chip chunk cookies are huge, soft, chewy, and wonderful. We're going steady now.  I really recommend this place! Thanks for showing me and my mom a great time.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "LhV7Uxe6cvOBU4OBh6PPdg"
  },
  "boavGAesbNYSBztavJouTQ": {
    "date": "7/7/2012",
    "text": "Zoe's is special for not fearing the Americanized taste bud. I don't mean the food is super exotic... I mean that they don't serve deceitful food just because it's popular.  Many a \"healthy\" restaurant is so scared of people complaining about taste that they hide absurd quantities of sugar, fat, and salt in their dishes, just to avoid losing clients that probably shouldn't be there anyway. The rest of us end up with an entree that appears greener and more nutritious, but is actually just brimming with the same problem ingredients as the pasta everyone secretly wanted.  Not at Zoe's. Sure, not every dish is \"healthy\", but the menu is pleasantly accommodating to any diet. They replaced every one of the original sides that came with my kebabs in exchange for a heap of veggies without hesitation. You can pretty much build your own dish, and for people avoiding gluten, dairy, obesity, this, that, and the other... that's pretty cool.   The meat is cooked simply, nothing is drowned in sauce, and they don't skimp on the greenery. Plus, calories and nutrition facts are all available if you're feeling neurotic. Kudos to Zoe's, because even if my veggies would have tasted better soaked in cheese, my stomach thanks you.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "5aPp3PnDs50CfWMapd7yEg"
  },
  "ZNxBFRLuSw304-BCbohpog": {
    "date": "5/7/2015",
    "text": "I love this place and I'm sorry for not rating it sooner!  Everytime I am in here the employees are always smiling, always quick and have yet to mess up my order.  I used to work closer to this location and used to eat here almost once a week, so it was nice getting back in there today and seeing the familiar faces.  It's not often that a restaurant retains the same employees for long periods of time, so they must be doing something correct behind the counter as well!  I will forever enjoy this food and location!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dkn4wGmErFolJHj9em8FTg"
  },
  "B1A2bKS8NcFteju4IOarvQ": {
    "date": "4/2/2012",
    "text": "This past weekend, I squealed in delight to learn about the Simply 500 menu that Zoes recently launched. Well, they didn't actually launch it since the items have always been on their menu, but they've finally made it easy on on the calorie-conscious to figure out what to order while visiting. Sadly the hummus wasn't on the menu (probably because of the pita), but there are several delicious items, including the spinach roll-ups! I uploaded the menu and posted it to the Yelp listing. Take a look! Your waistline will thank you.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "0FOAJauiAYNUEJYR0quSgA",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States. Introducing Zoe&amp;#39;s Simply 500 - a menu featuring all the items under 500 calories!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0FOAJauiAYNUEJYR0quSgA/o.jpg"
      }
    ],
    "user_id": "RBZ_kMjowV0t6_nv2UKaDQ"
  },
  "AS9nFJ6VTFdSxpLi-3XjiA": {
    "date": "9/15/2014",
    "text": "I've eaten probably 36 lunches here in the last year, maybe more. I love Zoe's. It's better than sauce (the chicken at sauce weirds me out) and cheaper! Winning. I love everything I have tried here and everything always tastes fresh. There is a manager whose name escapes my mind but he is there everyday I swear and he is awesome. The service here is impeccable and it's quick and easy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "E3vx1SHmSs0GUCao9gOsWg"
  },
  "ZJlv4Fy5SCPjMnNkCy-IDg": {
    "date": "8/1/2014",
    "text": "Zoe's was very inexpensive and yet provided many delicious as well as healthy options for customers. The staff was very nice and courteous. The food was pretty good and the menu consisted of primarily Greek cuisine but also had other options. The ambiance was also very nice and colorful. Zoe's would make an excellent mid-day lunch or dinner option.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "VjVvYDqN8Z5LtlVp9zDMkg"
  },
  "vM84jvru_HA7WNZh4ltqIg": {
    "date": "4/22/2012",
    "text": "Yum! Zoe's Kitchen is a healthy, inexpensive and casual spot for lunch.   My boyfriend and I split the Chicken Roll-ups and the Steak Roll-ups - both were very tasty and came with dipping sauce and a side. And the homemade chocolate chip cookies were delicious - soft, chewy, and lots of chocolate chips.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "rcTn6KPGYLsG8D8-_4MDNQ"
  },
  "fWkURM_saNa8Xul5s_gSag": {
    "date": "4/3/2015",
    "text": "The quinoa salad was delicious but my husband's chicken kabobs were dry and not flavorful. Our son liked his chicken fingers and Greek salad!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RaXL2tUD0YkPdaXHZFaIMQ"
  },
  "tUq5r43vcfFwLQj3Evk2hg": {
    "date": "8/31/2014",
    "text": "Incredible food. Seasoned very well. Fresh. The hummus is wicked good :). The steak kabob entre is off the hook!!  Also the chicken pita is killer with the SLAW!!  You are crazy if you dont eat here once a week or more!   Service was excellent!!  $$ and worth every penny.!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HrZSReAM_kMkwBVR9IkMIw"
  },
  "QBVjcTXS5MwtapDQ-C4G7g": {
    "date": "8/30/2012",
    "text": "One of the 'newer' options and one of my faves in Scottsdale by the Waterfront to grab a nice, healthy- light lunch! My mother and I both fell in love with this spot. It's casual the menu is pretty open for anyone looking for something healthy and not so heavy on the stomach. I got the Turkey Club with the slaw (which I might add doesn't have mayo) which both were amazing! The guy working that day was so sweet and being that it was our first visit, he gave us a complimentary hummus appetizer- which was delish as well. You can really taste the olive oil that everything is cooked in but it's not overwhelming at all.   If you're in the area, give it a try. Definitely one of my more favorite Fox Restaurant's.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PRDGKuJaTKyABTUGRATJsQ"
  },
  "EYkixUP-v8oPG1NOauvyIg": {
    "date": "9/12/2014",
    "text": "Great food. I come here all the time and always get steak kabobs. The sauce on the kabobs is very good. Lots of healthy menu choices but you still get good potions for the price. Fast and very clean restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ll3pm8fl1Yjuhr_R9PRFfg"
  },
  "eM_Ilz_7g86-LiGCCkvH8w": {
    "date": "1/7/2015",
    "text": "Went for lunch two Saturdays ago. Healthy choices at decent prices. No complaints. Ordered two quinoa salads and sodas. After about 10 minutes the cashier came to us and apologized, but they had run out of ingredients to make the seconds salad. Asked if we wanted to place a different order or wanted to wait an extra 10 minutes. My friend and I were catching up so no issue waiting. She came back a few seconds later with a complimentary serving of hummus and pita bread and apologized again. It wasn't a big deal to us, but the gesture was appreciated. When salad came, it was as delicious as always. Great customer service and hospitality make you forget little things that could be annoying if not managed right.   The restaurant is large, bright and I like the little pieces of kid created artwork that you can buy for a few bucks to support a good cause (I think its Phx Children's Hospital).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i1JdV9sle0SXEQnI-T7s4A"
  },
  "hbihp6ue6IvPIl17YZU09Q": {
    "date": "4/24/2016",
    "text": "Although it's a chain, the food, location and service are all quite good.  I regularly have the veggie kabobs, which comes with a small greek salad and the white beans.  All of them are great, but the beans stand out as especially good.  Pair that with some hummus and pitas and it's a good meal for me and my 3 year old to sit on the patio and enjoy a nice evening.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ra7HvJ421CV_uYJFfgVPbQ"
  },
  "QyRS--4GOsQikNXJoRUv7w": {
    "date": "4/20/2016",
    "text": "Love love love this location! Always fast and friendly with my pick up orders. They've never gotten my order wrong or forgotten anything. One of the top places on my list for lunch when I'm at the waterfront!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DjqpebyqxGXVO9r74Eb9cg"
  },
  "no7VU4jnYKDMvFwb5pXylQ": {
    "date": "7/12/2011",
    "text": "This new Zoes location has been open only a few weeks but it's already become a regular lunch destination in my rotation!  I'm a huge fan of Zoes' Greek Salads, chicken salad, hummus, and fruit salad.  I love their large portions, casual atmosphere, and modest prices.  I also love their \"dinners for four,\" which are perfect if you're bringing dinner over to someone's house, and they are always a hit!  Todd, the manager of this location, is super nice, as is the rest of the staff... oh, and I know it's already been written about in some of the other reviews, but you have to order a drink and use the new Coke machine!  It's incredible how many options there are.  My latest fave drink concoction is my version of an Arnold Palmer: 1/2 unsweet tea, 1/4 raspberry lemonade, and 1/4 regular lemonade.  Delish!  Don't forget to check-in on Yelp for 10% off your order!",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 14,
      "cool": 9
    },
    "photos": [],
    "user_id": "dIIKEfOgo0KqUfGQvGikPg"
  },
  "5b0bDXlvWIzPSbn2xuN2_Q": {
    "date": "9/6/2014",
    "text": "I always come here for lunch and it's fantastic. Great Mediterranean food that is healthy and quick. The service is always great and the food has always been spot on. If you are trying to grab a nice lunch on the go, then eat at Zoe's Kitchen.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xFkTDQUKXx1Juq6I9DVrUQ"
  },
  "7KJolAq69dAClobHri-ypw": {
    "date": "3/8/2016",
    "text": "I absolutely love this place!  I get the steak kabob and it hasn't let me down one time! It has been fantastic everytime at every location I've been too! Also, the pre made chocolate cake you can buy at the counter is delicious.  Not only is this place delicious, but it's healthy too!  Healthier than most places around anyway!  Prices are decent too. Enjoy",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hfBr9kOgp3cAhppZRBaReQ"
  },
  "hMcpWixuWVe4hR2WnCjmJg": {
    "date": "6/26/2011",
    "text": "@ZoesKitchen is a great addition to the Scottsdale Waterfront shopping area!  Now I can have a good meal over here for under $20/plate!    I had the Greek marinara chicken plate.  Marinated, grilled chicken breast on a bed of orzo with a nice marinara sauce.  A good portion of Greek salad on the side.  I also tried my wife's spinach wraps - reminiscent of spanikopita.  Service was outstanding.  The atmosphere is casual and nice.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 9,
      "cool": 5
    },
    "photos": [],
    "user_id": "QuZbJquRtbY9O9JrB9NpxQ"
  },
  "VFDuRpTkQmrsNqdwoocukQ": {
    "date": "4/23/2016",
    "text": "This place was delicious. I got the chicken kabobs and loved the flavor of the chicken and the veggies. The salad was great with their house dressing and I really enjoyed the rice as well. Tasted great and was food I felt good eating. Prices are reasonable also. Will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_K9TJEMvwVTld2Pc8sK9mQ"
  },
  "ga7NE5Hdg713BHAjHjfDbg": {
    "date": "5/9/2016",
    "text": "Where I love to get my grilled (pimento) cheese and tomato soup! Not to mention a killer quinoa salad! I also love that they have the \"chose your own adventure\" coke machine whenI can get an orange & grape Fanta zero or whatever else my hear desires. Also have great luck with takeout for a quiet night in! My only criticism is that their mobile app is lacking, but that is not the fault of the local operators.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bzIyS4PA84L9PB-_wAY_bw"
  },
  "vdKSJXgjxDGSSdcIqRNLDg": {
    "date": "7/3/2016",
    "text": "I am updating becuase of the good customer service I received in response to this review. Zoes obviously cares about their customers. Give them a try. The food is always fresh and delicious.  The food at this Zoes is amazing. Always fresh and delicious. I eat here several times a month on the weekdays for lunch since my work is nearby. The manager (Marty?) is really great, polite and funny with a smile always. She talks to employees with respect, she actually saysplease and thank you! I came here today (Sundat) and I overheard another worker (April or Amy) complaining about everything. She was rude to the customers in front of us and rude to the other kitchen worker. If she doesnt like her job, then she should quit, not expose customers to her bad behavior. I will think twice about coming in if she's working.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "si0bkUsOTcaiNrymrS_eXA"
  },
  "rP1U6m_kXyD46ldubOhH0Q": {
    "date": "10/5/2011",
    "text": "I love food....I had the steak roll ups and some potato salad.  Steak tips had mushrooms and carmelized onions in them and this delicious dipping sauce that I kinda felt like drinking it was so dang good.   The coolest coke machine ever is here (we need some in Text) it is a touch screen coke machine.   I was watching th people in front of us do it first so I didnt feel too stupid taking my turn.  It was way cool...wish I would have gotten a picture.  The area is great, next will have to try a different place in same area!  They also have pictures up around the entire restraunt that were drawn by kids at the Childrens hospital was a very cute touch!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5zsNtgRTHqev7JG8AU6g5w"
  },
  "mOvHdkgNhT7hOuQ3zapl1Q": {
    "date": "3/31/2016",
    "text": "Food here is great and I love the location close to all the night clubs and shopping centers. I ordered the Mediterranean tuna pita sandwich and it came with a side dish.  Not bad for under $10.00. Girl that took my order didn't seem like she wanted to be here and asking for a fork seemed like an inconvenience, but I'll still come back here because their food is the bomb and all with reasonable prices.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WNQslJ0PszTNciOjYoF27Q"
  },
  "yEGwN80ZLRI_STojJgqi5A": {
    "date": "5/28/2016",
    "text": "First I must mention that my spouse and I, we like trying new cuisines & flavours, we go out for food at least once a week for very casual dining.  We decided to go to this restaurant as we wanted to eat some type of Mediterranean cuisine.  The place could have been a bit cleaner and tidy, all the tables were dirty and needed to be wiped down.  The service was absolutely disappointing. The cashier was extremely moody when asked about certain menu items, acted annoyed by the questions.  My wife decided to go with the Steak Stack, the downside is that they barely put any caramelized onions or Rosemary oil on the sandwich.  I went with the Mediterranean Chicken which was dry.  In conclusion the whole experience was not good, and very disappointing.  We had heard such great things and this experience did not live up to it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hhlpb4ZKX9L8l_QLxVNY8g"
  },
  "nxh_BhsuL0XmeYXrSdfhEg": {
    "date": "10/2/2013",
    "text": "Good food. American/Persian/Mediterranean fusion.   If you're looking for a healthy lunch, Zoe's is the place.   I get the chicken/steak kabob substituting rice or potatoes with the Greek side salad.  It's a great lunch every time.   The service is amazing. They forgot a kabob in my take out, and they don't deliver, but they offered to send over extra kabobs just because.   I'm a happy lunch regular.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6LCnITDVdq0-2IoGlMvYZA"
  },
  "YmZywApTJnaYtfVy08ZXXg": {
    "date": "4/30/2013",
    "text": "I go here at least 3 times a week. I usually stick to the Protein Power Plate and the Steak Kabob plate.   Both items are awesome, the service is great, everyone is super friendly!   Seth is a great manager and keeps the place running like a fine oiled machine!   Highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "Aqz1DKxUb7vI3d6C3eDejw"
  },
  "SWEUJKZQb5KIbjNW2XwvnQ": {
    "date": "2/2/2016",
    "text": "Been there a few times .. It used to be better. Food was cold when we got home. We only lived 3 mins away from there. And of course they missed my soup .. Hopefully they will get back again",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g-_TsZNEJ_hls717NuGekw"
  },
  "6NJEYy1Y_x-JXF6KHTUibQ": {
    "date": "1/15/2016",
    "text": "Must try! This place exceeded our expectations. We were visiting old town Scottsdale for just the afternoon and saw on Yelp an overwhelming amount of places to eat w/ good reviews. Our Trolley driver told us the locals never cook, they just eat at Zoes....now we know why! We ordered the Steak Kabobs, trio hummus starter, and Greak Chicken Pitas....all AMAZING! Especially the new pesto hummus. For desert you have to try to chocolate cake, aka 'Crack Cake'. Lol. Marty the GM was so awesome in answering all out questions on dietary requirements and also sharing the company culture. Just wish we had one of these places in South Florida!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EKqz9PX3QQFuCaw__gnNSg"
  },
  "qKq7CXfL0Bde45zyb0RAxA": {
    "date": "2/10/2013",
    "text": "I recently visited Zoe's for my first time, as I was in the area and one of my coworkers constantly raves about it.   My friend and I were greeted by both friendly cashiers and given time to read the menu.  It was an oddly cold day in Arizona so we each opted for a cup of tomato bisque soup. We also both selected the turkey stack sandwich (sliced turkey breast, lettuce, feta spread, tomato, mozzarella and rosemary oil), which comes with your choice of side item. She got fruit and I tried the mayo-less slaw. I was so full from the hearty soup and the slaw that I barely got two bites taken out of my sandwich before I tapped out. :(  Everything I tried was fresh and tasty. I will definitely be back to sample more menu items.   P.S. They have the cool touch screen soda fountain for all you pop drinkers.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "si7trhnlFun_jVlxODWAYw"
  },
  "Nerhv5zzt1eWroZTn_vTlg": {
    "date": "12/30/2011",
    "text": "I love Zoes!  Their coleslaw is to die for, and the housemade hummus is creamy and wonderful!  I've had nothing but delicious food here, and can't say enough about the freshness and flavor of all of the dishes I've tried. Their chicken salad tastes like the yummy chicken salad I've eaten in NYC, and the tuna salad (with mayo version) is wonderful!  So far, Zoes is consistently great food with very nice personnel!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1gHXp1999ZBMXGzzUoogRA",
        "caption": "Photo of Zoes Kitchen - Scottsdale, AZ, United States. Hummis and Greek Salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1gHXp1999ZBMXGzzUoogRA/o.jpg"
      }
    ],
    "user_id": "EfGC2QTeePSn3-NhObhRcg"
  },
  "pb1OVZLVwfzU4C65BpKiQg": {
    "date": "12/31/2015",
    "text": "Clean and appealing interior. I've never been to one before and hope they infiltrate Cali bc lord knows Daphne's needs a run for their money. Had the Gruben and it was great. Good turkey alternative to typical Ruben and probably healthier.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XSlePD4W7GpvoeH39vRICA"
  }
}