{
  "-LTeezu4uSW0VmLY7VBgyw": {
    "date": "4/24/2018",
    "text": "Being from Texas we have plenty of amazing tacos. This place, I love it! Best I've had in Phoenix so far. I plan to work my way thru this menu during my stay. Last night was the Asada burrito. Tonight was the Barbacoa. I have had the  Al Pastor tacos multiple times. No complaints whatsoever. Keep up the good work and thanks.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-b8a7SZKIHxzm7_W2LzwIA"
  },
  "j2y2JhH6wpEQqKlqOXg7DQ": {
    "date": "11/21/2017",
    "text": "Fast and to the point, great carne asada, was not a fan at first however can't go wrong at this place. It's a pretty standard setting however the food is what matters. Just don't forget to pay before you leave.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h1cDUv1das57MHowaKj96Q"
  },
  "_7MefI8J_M7Z_zhfM8qKsw": {
    "date": "7/9/2017",
    "text": "Just passing thru Phoenix and decided to stop in from great reviews and cheap price. There was no place to sit so we took everything to go. So worth it! Everything home made. Cheaper than fast food chains and definitely better!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jefujIUp-X_1vV8rFC82jg"
  },
  "oi4Q7ZFojBl_WnEbGDmi4g": {
    "date": "11/18/2017",
    "text": "A hole in the wall that is well worth the drive. The tacos are great, the caramelos are scrumptious, and the prices are unbeatable. This is always my go-to taco shop.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xj8bs6WyzkRfw8vAE3pXKg"
  },
  "6-WUuFqwc0Vs4xDbg5T2QA": {
    "date": "4/18/2018",
    "text": "I've been on a hunt for good street tacos & with the help of yelp I found great tacos here at Ta'Carbon! Fast service, great tacos, good service, & can't forget the salsa bar with many options to choose from! Best tacos I've had in awhile. This is now my taco spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zz5dvUxublEptng2GvC6sA"
  },
  "Si73_wBeG9izgmDLg8U0hg": {
    "date": "11/5/2017",
    "text": "Authentic Mexican food!! Love their quesadilla with carne asada great customer service and the food is serve within 15 mins! Recommend 100%",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cx0qrytkFtdAv_2utaqIiw"
  },
  "LSg8Mq0R67ktYjuwwYhBXg": {
    "date": "5/25/2017",
    "text": "I'm from Cali and we went just to watch the dodgers play camelback...I asked my comadre what is good out there she said \"ta' carbon\". We went to check it out...........we took the first bite and literally my brother and me looked at each other and he said these are the best tacos I've ever ate aside of my moms food lol! My mom was sitting right next to him! I couldn't agree more to me the asada and the tortillas de harina! They are delicious. Many people rave here about the frijoles. I must admit Sonora has a different way of eating tacos...but hey I'm not criticizing if anything the food is soooo good so flavorful and the tortillas de harina are to die for! The staff is quick friendly and efficient! Muchachos gracias...la sacaron del parque!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NaDPPpHMrH3T82F4CNA69A"
  },
  "B1F38JqgOU-Wlw3pCLi1yA": {
    "date": "10/28/2017",
    "text": "Whatever you do you use cash at this restaurant I went there and use my debit card by the time I got home they put a $52.78 charge on my card for a freaking bus pass on a shuttle bus to Mexico. Whatever you do you  use cash do not give them your card they leave the register and go out of your sight and that's when they do stuff with your card. A bunch of Thieves I would never go there again as long as I live I don't care if their food was laced with gold leaf a bunch of crooks hope they rot in hell. I've been trying to call their restaurant for the past 20 minutes since I saw this charge on my card and of course I can't get through to anybody. I'm going to call the police and have them meet me over there I'm not putting up with this.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rvmt5TqcUhK_r6CG5_I7mQ"
  },
  "d7ckYHcYqZzv1hFN_DU1lQ": {
    "date": "6/7/2014",
    "text": "Simplemente delicioso! with the double tortillas you can make way more tacos!   go if you can! you wont regret it, True to the bone! ... I mean to the meat!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "l4Ag7ZX9HOQIxR3x7P59xw",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/l4Ag7ZX9HOQIxR3x7P59xw/o.jpg"
      }
    ],
    "user_id": "MMHqXAhcOZoLxbOMb26nyQ"
  },
  "4oNchkGc2Eeuuv3Jo-NDxg": {
    "date": "3/18/2017",
    "text": "I wasn't very impressed with this taco place, they have a lot of young kids running this place, I came on a Friday night and they were busy but the tacos and burrito were lacking a lot of flavor.I normally order carne asada and al pastor and the meat didn't taste fresh, I wanted to take it back and complain but I figure this is the last time I come to this location. I've been to the location on  camelback and 59 and it's so much better. I guess I was expecting the same quality since it's the same chain. You're better off going to the one on 59 bc they're so busy that you know you're gonna get better quality food with authentic flavor.... Let me tell you guys, I'm all about good fresh quality food especially when it comes to tacos.... And so far ta carbon on 59 is the best taco place....",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Nh043OM2s3Dsy3lahdgsgg"
  },
  "4TEn5bemRREWEWEFl6IUwQ": {
    "date": "4/22/2017",
    "text": "Very amazing food! This was my first time here and I felt right at home when I bit into my food! Don't worry everything here is good and you won't be disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mmyn1rJZhfBwy5LCyfEf5Q"
  },
  "jtyYZNgtU7eINCZC_KgzPQ": {
    "date": "4/8/2016",
    "text": "This is my favorite place in Phoenix. By far. I drive 20 miles to get there at least once a week.   Asada is tender and flavorful thanks to the mesquite grill and great cooks. Salsa bar is very generous, grilled jalapenos are great. Fantastic prices, too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZXdfI6PWgKiugUs1INUqvw"
  },
  "UEHrPXfOlSZrtSNPIKO93g": {
    "date": "8/14/2017",
    "text": "Best authentic street tacos in Arizona!!! The meat is tasty and is of good quality. The horchata is also very good and tastes fresh. The salsa bar has a wide variety of options which are all great. Definitely would recommend to anybody looking for great tasting authentic tacos! Only downside is that it is quite small with not too many tables.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DoB2VbMQmbtGOW0lGKJMHQ"
  },
  "AUl3iTug1J3cHgXUPKNkxQ": {
    "date": "3/25/2017",
    "text": "Good lord this place is like Christmas in your mouth... authentic and flavor is on point. Go, you will certainly be hooked I am sure!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yBWOkLl6CgwWr2a_RjVdXQ"
  },
  "sjXE3rNWOE_w_bWCAkdAhA": {
    "date": "4/1/2017",
    "text": "This is the Real Deal Mexican very authentic restocking the Salsa every 15 minutes and everything made to order with Super light Tortillas! No matter what you order you can't go wrong!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "56Pr0F2OhnF7nS38l1ezlQ"
  },
  "uJ41qQ2Wdxkxm0myORq6WQ": {
    "date": "12/13/2015",
    "text": "Best tacos I've ever had in the US!!! I'll definitely be coming here again!!  I tried the carne asada, barbacoa, hazz taco, and caramelo all were delicious! Horchata is good too.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "mdsXi_Im1XYNs1p3bKgJ3g"
  },
  "ZWaw6JuEd6jxipLDtpE91Q": {
    "date": "7/9/2016",
    "text": "If you want some legit Amazing Mexican food come here!! This place is DELICIOUS!! My absolute favorite is the Cabeza Tacos, but the Carne Asada tacos, Caramelos, Lorenzas, & Beans are soooo goooood as well!!!  If you are a first timer you should definitely order one of everything I mentioned above!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "T_EuU1BngSLWJRDv6ptUoA",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Getting 3 of everything!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/T_EuU1BngSLWJRDv6ptUoA/o.jpg"
      }
    ],
    "user_id": "uNb-AY-wDGmhB8TOHdKVuw"
  },
  "4C0AZqgTU5IAUWmxEBBD1w": {
    "date": "5/20/2014",
    "text": "Best tacos in town by far!! Can't beat the price either. With two locations in the valley that are always CLEAN and really nice staff you're sure to make this an enjoyable experience.. Highly recommended from carne Assad tacos to Barbacoa.. they have very good tortillas and a salsa bar ...  I love this taco shop",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "QvqvoDVya0I7UjCIwl5MSA",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QvqvoDVya0I7UjCIwl5MSA/o.jpg"
      }
    ],
    "user_id": "OJcc3jOYsnydxfzdj__8kQ"
  },
  "x3fwy5OZH3SpG8vXThwypA": {
    "date": "2/19/2014",
    "text": "Ta'Carbon - Perfect Score! 43rd Ave & Thomas Cost: $2 Service: 5 of 5, Super friendly and nice! Very clean, and inviting.  Presentation: 5 of 5, put on your own toppings, come wrapped.   Taste: 5 of 5, Fantastic! Real charcoal grill taste, smoke and seared in flavor. Great Carne, Tripa, and Cabeza. These guys really focus on doing it right!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "KX-sGpNTLEIsB0QZbIj-5Q",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KX-sGpNTLEIsB0QZbIj-5Q/o.jpg"
      },
      {
        "img_id": "4ujIfYOOshES1VK53kddfQ",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4ujIfYOOshES1VK53kddfQ/o.jpg"
      },
      {
        "img_id": "gEWH8TVtZbF7pETMVgkbVg",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gEWH8TVtZbF7pETMVgkbVg/o.jpg"
      }
    ],
    "user_id": "2tO6J5al09di2-AougMAPg"
  },
  "EER9OWgqsgp1bPTddgXiWg": {
    "date": "8/25/2017",
    "text": "Best carne asada on the westside of Phoenix! Never had a bad meal. I usually stop by for lunch, but went in for dinner one night and there were even what seemed to be high school kids playing as mariachis. They have an awesome salsa bar. My favorite spot. Best in the westside! Bravo! Mucho gusto!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZewHViEtxZ01HC9e6mGjrA"
  },
  "idiKYGAL-D4R-fiVVIUsiA": {
    "date": "7/30/2017",
    "text": "Such a delicious and fresh taco shop! My favorites are the carne asada and pastor tacos. Then they have a condiment and salsa bar. Food is so good. Seating is tight - would be nice to have more outdoor seating or get it to go. Also the people crowd around the salsa bar because it's in the corner, it's so popular they just need more space.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "TeuSFM3shoP-Gdnlwn8jRg",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Pastor tacos",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TeuSFM3shoP-Gdnlwn8jRg/o.jpg"
      },
      {
        "img_id": "VOhlRVSi2bNbe2zUQ1_OEw",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Carne asada tacos",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VOhlRVSi2bNbe2zUQ1_OEw/o.jpg"
      }
    ],
    "user_id": "46aM0kni0GXjS0zx0-zTfA"
  },
  "2HhwE0mg3xoivfTfctYbbA": {
    "date": "6/28/2016",
    "text": "Thank you hubby for reminding me that Ta Carbon was in this city last time we were on a road trip. How can I forget? This time we were closer to this location and had to find a way to get their carne asadas to-go again. We almost didn't make it because we weren't in this city long enough but my brilliant thinking decided to hit here late at night to take out for the next days lunch on the road to the Grand Canyon. Yes I did wonder if it will taste less fresh but when something is made fresh the night before, it stays fresh the next day :)  So in this case wow thanks Ta Carbon again for the most yummy lunch on the road.  Even at late night this place was hopping. We had a funny incident where everyone in front of us plus us thought there was a drive thru here and got all backed up by a parking car so we all had to slowly reverse out n repark lol that took up a bit of time but we went in ordered our carne asada family size meal and extra tortillas and again they gave us all the stuff we need to pack to the brim their amazing salsas, Pico de gallo, fresh salad fixings which they kept restocking. Loved how they just let me pack it all in and then some. Wrapped it all up for me, got our food in 15 minutes and bagged it all to seal it in for the next day. Love this place, fast, efficient, fair in price.   And what do you know. Our hotel heated up the meat and warned our tortillas for us the next day and we ate it on the road. So good still. Fed our family of 7 and had leftovers for dinner. Now that's amazing!   Wish we had one here in town because we'd hit it every weekend ;) definitely will be back. Fresh, fast and consistent. Thank you Ta Carbon!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gMxrrEYT1QZ3ywk2pEcl4w",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. So yum",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gMxrrEYT1QZ3ywk2pEcl4w/o.jpg"
      },
      {
        "img_id": "OdGpRJbY76RQH_Vtyzzccg",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Freshness",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OdGpRJbY76RQH_Vtyzzccg/o.jpg"
      },
      {
        "img_id": "ULFjdPU9CUW9e3j5kYAnhg",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Salsa bar and fixings",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ULFjdPU9CUW9e3j5kYAnhg/o.jpg"
      }
    ],
    "user_id": "u8NEPil3jYHmk52uudWkEQ"
  },
  "SOjxTxpSjogjKUW7QwmSWw": {
    "date": "11/15/2018",
    "text": "Stopped in for the first time to grab lunch. Restaurant is straight forward taco shop and salsa bar. I ordered three tacos, barbacoa, pastor, and cabeza and loaded up on the pickled onion and salsa.  The pastor was okay but not as good as other local taco shops and not anywhere close to my favorite place in Puerto Penasco. The barbacoa and the cabeza however were very good. I am guessing I could probably eat 8-10 of these tacos and will be back to find out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qXn8v1A8rt6sOKuC3BngLg"
  },
  "6Pc8Oj_agQ9uYO3OIi6Zyg": {
    "date": "7/1/2018",
    "text": "Hands down my favorite fast Mexican food. There Barbacoa is SO good. The only thing I wasn't super impressed with is their carne asada but it wasn't even bad it just wasn't my favorite. Their sauces are good too. Their burritos are so filling and there tacos are so good! This was one of my biggest cravings back when I was pregnant!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Nk0nhA0f4AEhK0vJ-7hhYw"
  },
  "UgJ0Hf9mP2HzEoakAdcvlw": {
    "date": "5/13/2017",
    "text": "I'm on vacation I'm originally from Las Vegas,  I was at the Swap meet here in Phoenix and asked one of the vendors what's the best taco place in town and recommended Ta'Carbon, and to tell you the Truth these are Some of the Best Tacos I've had in a while totally recommend this place is bomb had some tacos de cabeza and Lengua definitely the business!. Will be back on our next trip back prices are reasonable you guys definitely need to check it out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "RR6qSywJVQRjyWViWK4CEQ",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RR6qSywJVQRjyWViWK4CEQ/o.jpg"
      },
      {
        "img_id": "WlBVYrcOOrbqJrnKpARFLw",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Was definitely a good choice to eat here!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WlBVYrcOOrbqJrnKpARFLw/o.jpg"
      }
    ],
    "user_id": "aov-k69EWu51TvtLdAIbyA"
  },
  "jRl_Tki7Rj_gFAgoZ3HZaQ": {
    "date": "7/11/2016",
    "text": "Fast and friendly service!!!! It was pretty busy even though they were going to close soon. The tacos are AMAZING! We ordered several different meats, al pastor, carne asada, cabeza, tripa, and carnitas! They were all seasoned to perfection and I loved the fact that none of the meats had the fat that other places leave on there taco meats! The carne asada burrito was also great, and they can put beans in it if you'd like.   The salsa bar is huge and they also have huge grilled jalapenos! YUMMM! I will definitely be back for some more delicious tacos! Can't wait to try out the rest of their menu!!  BRING A LOCATION TO MESA PLEASE!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WO5g8ka2savGC9I5M2nJQA",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Walk up to order!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WO5g8ka2savGC9I5M2nJQA/o.jpg"
      },
      {
        "img_id": "d_mLziffC3W_QocJDzCS5w",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Tacos al pastor! YUMM!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/d_mLziffC3W_QocJDzCS5w/o.jpg"
      }
    ],
    "user_id": "zXBH5QYe1WJCvQdkYBs9JQ"
  },
  "iJpCddbLm1IFdU1vOjGqng": {
    "date": "7/30/2018",
    "text": "Great food the service could be a little friendlier, but overall I love they're tacos",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "TkBqxhPK74x1HNKcWzcStA"
  },
  "qV7s6_Y9HZhXJOXNYiZsMA": {
    "date": "1/23/2017",
    "text": "I don't care if I yelped their original location years before it was cool, this place tastes just as great. You need to hear it again. In addition to a fresh salsa bar with great variety (like limes for days!), and amazing grilled meats (like the best asada in the valley), this one has great, quick service.   Also, the best bean burritos on the planet.   I guess the only thing you can criticize them for is a lack of seafood options, but you've got like a million other places to indulge in questionable ceviche. This place is amazing at what it does, and it shouldn't be a surprise if they open up a third location in the near future.  PS- their staff didn't even judge me when I decided to be basic for once and have tortillas de harina. They're nice!",
    "rating": 5,
    "rated": {
      "funny": 9,
      "useful": 9,
      "cool": 12
    },
    "photos": [],
    "user_id": "YpGt3hdq5adPlEFn9fQ2Zw"
  },
  "xKVzEVp1e7q-RgxD1c_Upg": {
    "date": "6/20/2018",
    "text": "This is quite a distance from where I'm located (East Valley), pero cabron, the travel time is worth it! I've had just about everything from here because I have a condition where I can't stop eating tacos (feel free to name it). Try the mixed tacos/burros, it's pastor and asada medley that is delicious as it is beautiful. Tacos Lorenza's are in a league of their own (\"THERE'S NO CRYING FOR TACOS\"). Also, make sure you don't skip out on a quesadilla...or three...caramelo or gringa, pick your poison. When you're in line to pay, try not merging to the ordering line, easy mistake. Pero si ordenas mas...pues agarrame tres con todo, aqui te lo pago (not really). Great spot, go check it out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6Corr9XfCfnWALVaPhIFBQ"
  },
  "0o3bzPvbCBa7aUfO8dRbMw": {
    "date": "7/24/2018",
    "text": "As others have posted, the food will get you sick the day after, everything is greasy to the point where you have to hold the tacos to one side for at least 30 seconds until the grease comes out, same with burritos, will never come back to this restaurant again, i was very dissapointed in the rude staff as well, its always packed with people, no chairs to accommodate, we had to eat outside in the hot sun, if you find yourself reading this and you are already inside, get something light like salad or just avoid it and go elsewhere, as for me and my family, never again..",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OGLuvWQtiGUWQ3syK00zDg"
  },
  "eXN6mYH8eZBAIQp_JZWYsA": {
    "date": "10/11/2018",
    "text": "One of the best taco places I recommend it I've been there more than once and I definitely will go back",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IURFtLiUcee53IGeyT1C-Q"
  },
  "6WSIaFldjqP3K4Lbiw6-vA": {
    "date": "11/4/2017",
    "text": "What a sorry experience this was. The carne asada was mystery meat I spit half the meat out chewy nasty rubbery crap.  I told the order-taker that this was my first time there I would like to try something good, I like the carne asada he said oh yeah it's really good, not really.  This place was recommended to me by my homeboys, unfortunately I must have gone on a bad day. My espanol is passable but wasn't worth crap, my fault.  Don't go there for the carne asada, try everything else Tijuana Taco Style that might be the better bet.  I don't like leaving negative reviews but my carne asada was a waste of time and space and since I went out of my way to try this place well fuck me.  The taco salsa bar was dirty well not so dirty but there was no more salsa verde, onions, and napkins. The pico de gallo was okay, a lot of jalapeno but then I like spicy and I'm good with that.  But the place was packed so obviously I don't know what I'm talking about.  Since they got a big sign at the door saying no guns allowed, to hell with that, I'll spend my money elsewhere.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "pETq9CTv7OORdnyZJOTfAA"
  },
  "HvrHZXNzf0MIp6hrdHdR3g": {
    "date": "8/31/2018",
    "text": "Always packed when I go. Food is okay. I only go to this location when I have meeting nearby which is like every other month. I wouldn't go out of my way to come here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q_qkzO29sr4sfzDfvnGotA"
  },
  "2zHsfeSMiTpg9Zr1OXZtCQ": {
    "date": "3/3/2018",
    "text": "This is my go to place for mesquite grilled carne asada tacos. They got a salsa bar with all the fixins. If you like tacos, this place will not disappoint you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4eCI13o-J9PiVhqLB0KCuw"
  },
  "KWXuJChb4p_c_MCn49cTJQ": {
    "date": "9/28/2018",
    "text": "One of the few Mexican taco shops on which they have a grill to proclaim \"carne asada\"  This elevated the meat to the next level!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N6hyiWAtth-jstsuhgcB8g"
  },
  "hDV5RaTMSU1Hu9EM04Q_4w": {
    "date": "1/8/2018",
    "text": "Delish... spicy... flavorful... quick. Love the salsa bar. Reasonable prices, great service and tasty authentic Mexican offerings. The alambre didn't disappoint.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1d74OyJ08hibGmOb2dMFzg"
  },
  "JXiQggoCiAlgLYjRfbXBjQ": {
    "date": "9/25/2018",
    "text": "Yo, let me tell you I don't claim to know everything but one thing I do know is in my 20 years of consuming carne Asada trust me when I say these folks at Ta'Carbon know how to make it!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hlhqMKIP95pJKnQAqa-A-w"
  },
  "HkiKcZq6kqBKPY0DYr7t2g": {
    "date": "10/18/2017",
    "text": "Don't go here if you're trying to have some fine dining...but do go here if you want authentic, flavorful carne asada tacos with avocado salsa that's probably going to ruin all other tacos for the rest of your life. I highly recommend the carne asada, al pastor, lengua, vampiro and pretty much anything else they have. And always order the coke in the bottle-because it's the Mexican one and in my opinion tacos without coke in the glass bottle is highly lacking. There's plenty of seating the only thing is Parking can get packed. But well worth the visit for no frills, cheap but delicious tacos.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "QXlKsOkGLC0do8evZcgpIA"
  },
  "xfiZdeQgXQHgLSfC3KHy9Q": {
    "date": "12/2/2017",
    "text": "This is the most authentic Mexican carne asada you can find in Phoenix. Their tortillas, beans and carne are perfect! Even their bean burritos are to die for!! They are always very busy but it's totally understandable. Their customer service is great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "aKtwtq5cKsbugghoHYSTww"
  },
  "76hcikoSBIHJh4Ihh2_JGg": {
    "date": "7/14/2018",
    "text": "Never once been disappointed in the food. Staff is super friendly, very clean and well organized. Favorite taco spot in Phoenix for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A_9oEWyNVRrCLdhgoEB-rg"
  },
  "JhYM3-5arSivCrPMbm3K1Q": {
    "date": "6/10/2019",
    "text": "Love the burrito de carne asada soooo good I love that u pay after that wAy u can enjoy ur food first",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IGKqLv57eZV1-3_KOPXbAw"
  },
  "8AaNI56EGO4Y-l1FQvrSrw": {
    "date": "10/27/2018",
    "text": "Food was more than amazing! Only giving them a 4 star because I believe the environment can use a bit of a face lift. Salsa bar is an open invite so it does give me a bit of the germ phobia as some individual do not practice careful food handling. A facelift and having a salsa bar wish a restaurant attendee serving might be better suited to help remove some of the chaos there. Otherwise this place is fantastic!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ip7kA2PMaVg9Vfcpccaf0Q"
  },
  "LLritU_BaMwfivbmk8qegg": {
    "date": "1/22/2019",
    "text": "Neighbor hood favorite tacos spot !!!!!! Super laid back Mexican tacos shop  they have a variety of meat and u can build your tacos your self with a self serve salsa bar",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T2hn1Y5-UyCEyPPyYpAASg"
  },
  "rF7yBj97gBjgAgJxq6AIRw": {
    "date": "9/17/2016",
    "text": "I had been to the other Carbon a few years back, and thought it was excellent.  I was craving some kind of carne asada today, so I decided to stop by here.   I went with a carne asada plate and told the guy I just wanted the carne asada, no beans/rice/tortillas.  Just under $7.00, I was handed my plate and took it out to the car.  Open it up and it had beans on it.  The beans kind of shifted around and got into the carne asada which was whack.  Flavor of the carne asada was good, but the portion was a bit skimp and also had a couple pieces of gristle in it.  Was it good?  Yeah, it was alright.  Will I be back?  For a plate, no.  For tacos, eventually, yes.  Service was quick and friendly, and they do have a nice salsa bar (salsas, cucumbers, onions etc.).  Once I can eat carbs again, I'm sure I will try them out once again and get some tacos or burritos.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 5,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "kvjasKPhAglaiuAr1LTTew",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Good smokey flavor on the carne asada.  A bit skimp though and some gristle.  Good, but not great.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kvjasKPhAglaiuAr1LTTew/o.jpg"
      }
    ],
    "user_id": "6jz_Yr6_AP2WWLbj9gGDpA"
  },
  "z2RCg0texu_hdvhZxlIMRA": {
    "date": "12/30/2018",
    "text": "We had the family parrillada, the meat is delicious but it comes with tortillas only. Good price for that though. The salad bar is decent yet none of the salsas are spicy. They were all tasty but even the red lacked any kick. There were no toreados available either. Service is slow and very disorganized. It took us a good 35 minutes to get our food, but it was worth the wait, flavors are very authentic and meat and tortillas are delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tt9t8Wwdk4dXEZhtXO4baA"
  },
  "Hs73QCH-zSoN9fxRJFjbpw": {
    "date": "6/3/2019",
    "text": "This place is SO AUTHENTIC, just like tacos de Mexicali. I've never tasted tacos like this in the U.S. So, this place is in the getto, and looks sketchy, they even have their own armed security guard in the parking lot. This place was so packed. The way it works, you order your food at the counter, pick up your food when they call your name, then get back in line, and pay when your done. The food took a while to get to us, so order a lot! The food was hot, when I loved, not warm, but hot, and fresh. The salsa was so authentic, and they had fresh key limes. I am definitely going back here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ARCsM7xqnvXb4B_aZKK9kQ"
  },
  "xkqsuYHtdTWSIXW16JWWfA": {
    "date": "8/13/2018",
    "text": "Just came here off a friend's suggestion. It is always a good sign when it's so busy there's nowhere to park. I got the mix two platter and the food was legit! My platter had barbacoa and carne asada.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kdYDBRIBxhJtULgxr0KkcA",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kdYDBRIBxhJtULgxr0KkcA/o.jpg"
      }
    ],
    "user_id": "gq6H6I13u4ftBHWJMiqNWA"
  },
  "7D4Ub38_WBv4uGqZEdw10w": {
    "date": "10/16/2018",
    "text": "We loved it!  We split a carne asada dinner.  More than enough to eat.  Friendly staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "XBf9x9zorNuMrsQcPjp61A"
  },
  "aauRz03QyiLSCUW6-jzdPQ": {
    "date": "4/18/2018",
    "text": "Meat here is ON POINT  Fast service Good salsa bar - although nothing was very spicy tbh   We had :  Mixto burrito - this ain't that filler shit. You know how most burritos are mostly rice and brand and all that. Not here.   Lengua taco - even my bf liked this. I always like to try lengua at a new place because I love it when done right. My bf will usually try a piece of meat and have me finish. But this time he went in on his half. It was big pieces and tender perfection.  Huevo DE becerro - this was a first. Didn't know what it was. So we asked. Took a risk. And I liked it. My bf couldn't handle the texture. It's balls btw.   Pastor taco - yum. Honestly we inhaled our food so I don't remember this in particular   Barbacoa - yum . Yeah inhaled this too",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kYvJVnqfv_Vhq_Mp4G0LNg"
  },
  "2gohRh6PNhQXGgrbItW_Hw": {
    "date": "1/12/2019",
    "text": "Believe the hype. This is the best carne asada I've had in the valley. We had to wait a good while once we ordered, but the place was absolutely packed and once we got the food it was all well worth it. Super cheap. Incredibly good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1DmeDD-3hRpSNkqTI2PnUA"
  },
  "Q20Siivl053MHVTN-fIinQ": {
    "date": "10/16/2017",
    "text": "Some of the best street tacos in town!  I have not tried other things on the menu, so I am not sure about things, other than the tacos.  Whenever I am in the area, I stop by, because they are that good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9oL005a4d1wI1O5MOW6r-Q"
  },
  "6GdooOzmaGaBSiYR5nH9TQ": {
    "date": "1/18/2019",
    "text": "Tacos are always fresh, the loaded potato is one of the least talked about but I highly recommend it! It makes your mouth water",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WcvNLx9nDISEyI-CLWe8zg"
  },
  "JSfENBNOd9aOnswZlDAWZw": {
    "date": "5/30/2017",
    "text": "Very quick service and delicious inexpensive food. I had the barbacoa plate that came with meat, beans and 6 tortillas.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "EZZJ59KKp2FZD8ox_tgpbA",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Barbacoa plate. Wow delicious  and a lot for your money",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EZZJ59KKp2FZD8ox_tgpbA/o.jpg"
      }
    ],
    "user_id": "AbVdT3VAgGKhaH7XTi8iew"
  },
  "aCwCmwLte7XnmnV56E4L8g": {
    "date": "5/13/2017",
    "text": "This is by far the best Mexican food I've had in phoenix! The beans and carne asada are great! Great customer service!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "NolqM-C3S9pz3GIHTTiW8g",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NolqM-C3S9pz3GIHTTiW8g/o.jpg"
      },
      {
        "img_id": "P_MnGud0hFUL2zmYm1vkGg",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/P_MnGud0hFUL2zmYm1vkGg/o.jpg"
      }
    ],
    "user_id": "dwClwkBwnZYcF2ds0azUig"
  },
  "aRDuZJOQMryYx4tou_UgoA": {
    "date": "2/6/2018",
    "text": "Mother of all authentic Mexican Taco Bars in Phoenix. The Salsa Bar here is wow. Carne asada plate. These guys are serious.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "4mUGZvBcDbWA99SwPi2pvg",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Mother of all authentic Mexican Taco Bars in Phoenix., AZ. The Salsa Bar here is wow. Carne asada plate. These guys are serious.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4mUGZvBcDbWA99SwPi2pvg/o.jpg"
      }
    ],
    "user_id": "fkpZ-zkKXjWs7JK3T-r9Aw"
  },
  "7AX-fS3EbtURhRmqOarh7A": {
    "date": "4/18/2018",
    "text": "Now this is authentic Mexican food with good prices !! Skip good. Amazing prices. Tacos staring @ $1.85 - $2.10   They even has testicle tacos ! xenophobes beware. Not for me since the texture was to soft. I like crispy textures. My Fav was the Mixto meat. Half steak and half Pork meat  The burrito we had was Mixto and was full on meat ! Well marinated and under $5 !!  Great salad bar too ! Lots of pickings and salsa to chose from. Good came out fast.   For 4 tacos, a burrito and a drink we paid around $15 and it filled us up ( me and gf ).  WILL DEF RETURN !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ME_k8d7xY-PsWnsgIYRMtQ"
  },
  "S4kcdx1NpqkQyKBAWTV9qQ": {
    "date": "9/28/2018",
    "text": "Eh they were okay. When we first got there it was chaotic, no place to sit, very unorganized. The way they take orders and pay is weird. We paid sat down, than made another line to pay when we were done. The food was good, but definitely  not something I'd go out of my for. The guys working there are rude and that just killed it for me.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NnkwUsUG7EDD5BtxBy2vew"
  },
  "v7z8gFns69hsaQCcs9-o2A": {
    "date": "12/1/2018",
    "text": "Great quality tacos, if your looking for legit tacos this is the place to go. Haven't had too many places in Phoenix better than this one",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KMNedJKtuG-DqoJFWH3YJQ"
  },
  "ZygmwBklJXoKUhYW51iw2A": {
    "date": "8/19/2018",
    "text": "A friend of mine recommended this place so we gave it a go when tacos were on Saturday's agenda... And boy these guys did not disappoint. It was Saturday lunch rush so it was chaotic to order but food came out quickly and was devoured just as fast. Thier dressing stand has all the fixings for taco bliss and the red salsa is deceptively spicy.  Go here and go often!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YYZA6spy8x5W4sd6Tbqqog"
  },
  "eMIlxuz-KVg2akAFPKacLw": {
    "date": "8/3/2018",
    "text": "Hands down the best tacos in Phoenix! Skip the trendy, overpriced, overrated Mexican restaurants...this place is legit!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6e40QjfOXG3_gwff3mc_fQ"
  },
  "bj2IVUYeOzEfMdHntwl2Lg": {
    "date": "10/9/2017",
    "text": "My favorite place to eat in the world I love it  I've been coming here since it opened  But today I care out to eat  And the staff was very rude they where in a hurry and did everything that an attitude as a faithful customer I would want great service but I'm never coming to this location ever again the one on camelback is 100 Time  better the service is out standing and great atmosphere  But in like on the one on 43rd and Thomas I will never return",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XjAMJB9trj_BaNwfwNSW0w"
  },
  "4g-fhWWaeZCFsojsIj0S-Q": {
    "date": "3/15/2018",
    "text": "THE MEAT....I want to write the asada they serve here  a love song; it deserves novels and sonnets and statues built in its honor. But I will suppose this review will have to suffice. This is the most juicy, flavorful meat I've maybe ever had. And the tacos are dirt cheap. Amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EcvwIbLoYDIcyxgOh3qmpQ"
  },
  "vLuEEl5aNKPUjtWUhYBbbA": {
    "date": "3/30/2017",
    "text": "This place is awesome!   Real Mexican style tacos!  Visiting AZ for MlB spring training and decided to yelp a Good taco place.  This place exceeded my expectations reminds me of my trips to Mexico when i was younger.  You could taste the delicous marinated in the meat.  They chop the meat into tiny pieces and don't use the meat fat to fill your tacos.  I can't stand tacos with a lot of fat.  The place is very affordable .. we ordered 7 asada tacos 1 bean and cheese burrito,  1 quesadilla and 2 large drinks. Total was $22.   We will be back for more every time we are in AZ visiting.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CM_3z3qS1zJXBl_5xjo1xg",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Tacos of Asada !  great place, great service,  delicious food...",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CM_3z3qS1zJXBl_5xjo1xg/o.jpg"
      }
    ],
    "user_id": "_Cs4n8ZpogukIE9SWI8bew"
  },
  "9lptWfkn-7x-ydgqG3M3Iw": {
    "date": "3/1/2017",
    "text": "Yummmm to this restaurant. They have such a variety of tacos to choose from. They have a salsa bar too. Love that! They are really busy though and the tables are dirty from them not cleaning them quickly enough.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "noG6Ly8wqvfrD8zb5vQ36g"
  },
  "BnW7UM0l6y8Z-ykbUUnlow": {
    "date": "11/14/2016",
    "text": "Very bad experience unfortunately. I really wanted this to be my new taco place! First they got my order wrong. Something was missing. Since we determined I had not paid for it since it was forgotten to he written down, I decided to pay for the missing item. The guy who took my card instead accidentally charged me for the original order. Now my bank has froze my account for fraud since the two amounts were the same. To top things off the guy said he would give me the last item free and refund my money.  He only refunded half and did not give me my order..... Never coming back here again.....",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QCvTIAph2TsBGtvCTafOdA"
  },
  "LiORL2Hx3Qj87aZePFSHnQ": {
    "date": "2/25/2017",
    "text": "This place is packed and you know that when we are the only gringos in here that's a good sign!  The condiments bar was great and we liked the pastor tacos a lot; the asada ones were ok and the quesadilla was also very good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G5vpnTThIa7Vbjbu7zWQZA"
  },
  "ZHHOvt91bua-wYTpJ7KBOg": {
    "date": "2/24/2018",
    "text": "Best tacos in the state. I eat here every Thursday. Usually start thinking about them around 6:00 am.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ldz-SChlmdu34Dk0IG8rsg"
  },
  "uC6ElDmCfZifRwKuVwWX8g": {
    "date": "11/26/2017",
    "text": "Love the carne asada tacos here.  One of my favorite spots for getting tacos and you get yummy grilled onions too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "TllTbvyiAJhVnoqviFeOdw"
  },
  "-9EUbc_RsU1_F-oBLvzhcg": {
    "date": "11/8/2017",
    "text": "Really good Mexican food. Felt like I was back home in Cali at a good mexican restaurant. My kids loved it as well. We would be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "K06sjMtuciRqRDE9lF5lYg"
  },
  "EIuVdq2rIoqmOFzwL036cA": {
    "date": "9/25/2017",
    "text": "Tacos asada unbelievable. Tacos barbacoa finger licking good. Pastor and chicken I would say 4stars kind of hard to beat the asada. That smoky flavor is addictive. Aguas de horchata and my personal favorite cebada (barley water).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "PEO0bcANmmljwwNNXIqLBA"
  },
  "UmwKLs0PMWVlHtTjDx50Ow": {
    "date": "7/10/2017",
    "text": "First of all, great tacos!! I love the name, sounds like Ta'Cabron haha!  I will for sure come back, they had the grilled taste but the beer was not as cold... that sucked.  Better than any taco place in the Inland Empire back in California where I'm from.  100% recommended. The place gets packed but your tacos are ready right away.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xqUvGtl4qH_LC-tA5xZ6yQ"
  },
  "K17juyNTLGEdkf52Xv2LTg": {
    "date": "6/20/2018",
    "text": "We searched for a Mexican restaurant and were not disappointed in Ta'Carbon. We weren't expecting a \"fast food\" place but our food was delicious. I had a burrito that was big and very flavorful. A real Mexican treat.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dxnxS0EEw4CYhIZ8fVfr9g"
  },
  "DQLdKm6DlbXN9ReNVc43ZA": {
    "date": "8/29/2017",
    "text": "My wife and I love this spot, everything taste fresh,from the carne asada to al pastor tacos. After our order is placed I step over to salsa a bar, and get all the goods for tacos ( fresh). We sit inside and eat our tacos, and drink our Mexican sodas,the best. Only reason I don't give them five stars is inconsistency, meaning carne asada is not always the same tastiness, which doesn't happen often....but. The other would be they're not always open on time, as matter of fact hours differ from yelp....not open until 12 on Sundays instead of 10. Hopefully this is corrected so the masses won't be kept waiting for the goodness. Warning this spot gets packed quickly, but service is fast.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "bmVz3kV6Yz6-dvfEJUu_rg"
  },
  "1sGvx6itQF0KH92F5Eki2Q": {
    "date": "11/15/2017",
    "text": "Just had the carne aside tacos. They were just okay. Not much flavor in the meat. I did like the salsa bar. When in Phoenix, there are other places I'll head to before this one.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AmL6n9hxjYKgn-jiAiJC2Q"
  },
  "tLAg-aaB1PeSXgnazWQe0w": {
    "date": "1/13/2018",
    "text": "This is what I've been craving since I moved to Phoenix 6 months ago. I'd move in next door if I could.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ewq_lc0rlQATlrFYDZrRCQ"
  },
  "KAdA4jsTVVfr4CzY0AzpFQ": {
    "date": "7/11/2017",
    "text": "Sheesh, bless you Yelp for helping me navigate through bad taco infested waters to find places like this. Maybe my reviews are normally positive which would take away from credibility, but keep in mind I only go to the highest rated places. Hard to get your heart broken that way. Anyway, two thumbs up for this place and it's smoky flavored meat products.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "tdEJleJH1fDXIXzLCoRWvg"
  },
  "44vGF5urssIc_xETmwnS7A": {
    "date": "6/14/2017",
    "text": "I recently went in to place an order for a meeting staff lunch, the manager was rude and acted like he didn't have time for me. I placed a $100 order and he treated me like crap. Good is good but won't go back because of him. He wouldn't give me plates in fact he sold me plates.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z-xC0YJxIBOnhnYln-jL8A"
  },
  "3QzRa-s8sz-qRRJTJjrP3A": {
    "date": "6/15/2018",
    "text": "Best tacos ever !!! I feel like I'm back at home when eating here, los frijoles puercos are the best in town !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O_q6-rfDKNDN7C5HRobJ5w"
  },
  "BdcDu7DBatyH-CYqpFJnjw": {
    "date": "6/25/2017",
    "text": "I've been to plenty of taco shops all over AZ and I have to say hands down these are the best carne asada tacos i have had, period. So much flavor in the meat and the salsa bar compliments the tacos great. Taco de cabeza was also very good but the asada was the best. Horchata was good but a little sweeter than I'm used to. Being the best carne asada tacos you would expect the prices to be high but it was very cheap here. You will not be disappointed, guaranteed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-MNc4IsL_B1laNBg4y0SIA"
  },
  "R7PXaUxY4VydhRVXX8eFKg": {
    "date": "11/5/2014",
    "text": "I fuckin love these tacos. In my opinion the asada & barbacoa are the best. The salsa actually has flavor...good plain avocado sauce.   Very cheap & fast yet food is hot!   I am literally willing to drive 45min from the east valley for them..while flipping off all the gross filibertos on the way here..",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "yqYYDjx2F7vNFNIDSxavMA",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Guacamole sauce &amp;amp; 2 types of salsas.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yqYYDjx2F7vNFNIDSxavMA/o.jpg"
      },
      {
        "img_id": "B9abCDbie1lmm_Uha9Bqjg",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Carne Asada, Barbacoa, &amp;amp; Cabeza tacos.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/B9abCDbie1lmm_Uha9Bqjg/o.jpg"
      }
    ],
    "user_id": "3TMwcMEmfdmqp8mivxXqXQ"
  },
  "ePRxspc9w17Z1H5D08juIg": {
    "date": "3/23/2019",
    "text": "Went in on a Saturday at 8:00pm. It was packed so I figured it was going to be delicious. Unfortunately their ordering system is anything but smooth. We wanted our drinks before our tacos came out and they told me they would get them ready for me. 15 minutes after ordering our tacos came out and I asked them about my drinks again and they said someone would bring them out. I went back to the salsa bar and figured drinks would be out soon. 5 minutes passed and decided to go back a third time and request them. They were 2 horchatas and 1 Jamaica so I guess they never poured them in the cups, ugh!  I had 2 kids impatiently waiting for drinks all this time.   I had 2 al pastor for my kids and 3 cabeza for me. My kids tortillas were super hard and chewy and mine were soggy. The al pastor were good but cabeza were bland overall I would never go back on a busy night. Perhaps during the week but only if I'm nearby. I really wouldn't travel out my way for this place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A7eqW_Uzsi7KXLWD1bJ-dg"
  },
  "0GxANi0HApfQhBoZ7Fbl1Q": {
    "date": "1/18/2019",
    "text": "Best tacos in Phoenix. Where else can you get a 1lb of perfection of carne asada for $21 ?!   Full salsa bar",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dx9oSm_db4apbTIseny3ow"
  },
  "jW2-FYTU_oTDSZ3D1sxYcw": {
    "date": "5/29/2019",
    "text": "The best carne asada we've had at a fast casual place like this. Fresh tortillas, fast service, amazing salsa bar.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DtJV_-c9aYa4_pVEh0D_UQ"
  },
  "UtNvhZrP_UFoSmFGA3-TCQ": {
    "date": "5/12/2019",
    "text": "My favorite taco spot in Phoenix so far. My go to is the carne asada taco or burrito. You pay after you eat, and you will leave satisfied.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KJL7X2qm7ywL1cgapNjRNA"
  },
  "w4unHfKzhctRzG-m3Hffug": {
    "date": "4/22/2019",
    "text": "I was here from out of town visiting my son at GCU. Looked this up on yelp.  Out of this world Tacos.  Best ones were the Taco Hazz.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "gT4uGo3rTvlUubqnfAkOYg"
  },
  "Bw1NZRBUkhsdKSOaToAFGA": {
    "date": "7/19/2019",
    "text": "This place is located on a very busy street and the parking lot is a bit small. The service and environment wasn't that great either, and the whole ordering process was a bit confusing. A lot of regulars telling new comers where to go. BUT the food does make up for that. The carne asada and barbacoa is the shit ! You can smell this place from across the street, it smells so good. They also look like they have a drive thru but they don't, sadness.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-ZtmNrM0Cmf90MWYHcvTLw"
  },
  "bieRrymYD4_-m9m3U4PpEA": {
    "date": "12/8/2018",
    "text": "Great food and customer service. Be sure to get extra veggies and salsa if you order to go.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hlBhGCSkHGzvr1z-tKH2Lg",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hlBhGCSkHGzvr1z-tKH2Lg/o.jpg"
      },
      {
        "img_id": "odvXz4ui5babSJSg0bPFMw",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/odvXz4ui5babSJSg0bPFMw/o.jpg"
      },
      {
        "img_id": "m-ZYnWtsFmexCd1btaXCiQ",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/m-ZYnWtsFmexCd1btaXCiQ/o.jpg"
      }
    ],
    "user_id": "Up-xOMctd2txyOJQx6v5jg"
  },
  "GtW8T2qUjuL5R_A0BBSm3g": {
    "date": "5/9/2019",
    "text": "Authentic. That is the first word that comes to mind. It was definitely tasty, but for me it was not quite worth the trouble. There are other places closer to me that are almost as good and have better parking and better salsa bars. With that said, it is still worth a try just for the experience. Service was fast and the menu is straight forward, but everyone I was with felt intimidated to order because they didn't speak Spanish so I ordered. I didn't get that vibe but my group did so I'm mentioning it so you know what to expect.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jg0VVE8uNLggF2-b4HW13Q"
  },
  "IK1P7MUCC-boLcCj0MSoWw": {
    "date": "5/20/2017",
    "text": "This place gets quite packed on the weekends but food comes out fast and staff is friendly.  Comparable to this restaurant is East Valley's Backyard Tacos (my favorite tacos in the whole valley). Here, the meats are grilled over a fire, tortillas are not home made, salsa bar is loaded with many options, and also a lot of meat options.  I got 6 tacos total. From favorite to least favorite - I got barbacoa, carne asada, hazz (carne asada with green chili and cheese), and al pastor. Tacos are fairly priced and cheaper than most locations at $1.85 for most meat options. The barbacoa is finely shredded, allowing more of the brine to get soaked up and prevents the beef from being dry (one of my favorite barbacoa in the city). Carne asada is good but not the best. The hazz is good. I was not a fan of the al pastor here. I just feel like it's lacking a distinct flavor and texture that is unique to al pastor. I feel like the texture of the al pastor is too damp compared to better ones.  The salsa bar is loaded here and I must admit their salsa is better than Back Yards. However, I do wish this place had pickled onions and grilled onions/jalapenos.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NTTgx02v9-bxnetU1JGJ-w",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NTTgx02v9-bxnetU1JGJ-w/o.jpg"
      },
      {
        "img_id": "PRSvtiQU9QaJ4D-yIzoqTA",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Only serves bottled water and no cup water",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PRSvtiQU9QaJ4D-yIzoqTA/o.jpg"
      }
    ],
    "user_id": "Fv-VfSyxMqm0Kx771KokRQ"
  },
  "SPRFmWe7DqFAxM47KJdTIQ": {
    "date": "8/30/2018",
    "text": "I took my friend Preston there and he says in his own words, \"it's bomb.\" You don't pay until you're full and satisfied!  Meat was cooked perfectly, has a mini salsa bar. Horchata was great! Even with the people who work in the area that come there on lunch, it being very busy, it was only about a 10 or 15 minute wait but trust me the wait is worth it!  Must visit! I know I'll be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BeMrTqigcLyK6LnVj5pugw"
  },
  "RULxd_yDoGsqp6qlkfh6VQ": {
    "date": "1/30/2019",
    "text": "Their beans are so good and I really love their Asada burritos it just has a very authentic flavor to it and I really appreciate the customer service as seriously so awesome if you guys are looking for a good quick bite to eat  definition drop by here they let you pay afterwords to so it's really good and really really amazing local eats",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dSoWAU2JjTaYijNPv7bq-Q"
  },
  "f9aj1O6OrdnN2yx23k2yJg": {
    "date": "2/10/2017",
    "text": "My brother and sister were coming in to town and my step mother asked me if I could try to find a place near my brothers house that would feed 6-8 people for under 200 bucks. After doing some yelp research I came across Ta'Carbon. Not only did we stay under 200, we where under 70 bucks before tip. That included a variety of tacos, burrito's, a cheese crisp for my 2 year old nephew and some beers for the adults.   On top of how cheap this place is, the food was amazing! I felt like I was back in Rocky Point. I use to go there 3 times a year in and right after high school and we lived off street tacos while we were there. These were the exact same as I had, had then. They even had the awesome salsa bar. Every thing made from scratch. Even the same great, fast, service with a smile you would get in Rocky Point. One of the cooks in the kitchen even heard my father talking about how much he loved the hot sauce and he came out and brought him the \"stuff from the back.\" It was FIRE!! And oh my goodness.... those refried beans. SO DANG TASTY!! I've seriously been telling everyone I can about this place and I have been craving it every day since. I found that they have a location a bit closer to me, so I will be paying them a visit soon.",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 8,
      "cool": 10
    },
    "photos": [
      {
        "img_id": "nOzsCh57ZVr3PJDKeoDo_w",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Stacking those plates",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nOzsCh57ZVr3PJDKeoDo_w/o.jpg"
      },
      {
        "img_id": "F-GJk2jCpzMMS50QC7ZB9g",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. The salsa bar. I got so excited when I saw this.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/F-GJk2jCpzMMS50QC7ZB9g/o.jpg"
      },
      {
        "img_id": "9yjBdxdZHgM9HTPugoozGA",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. So much food for so little dinero.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9yjBdxdZHgM9HTPugoozGA/o.jpg"
      }
    ],
    "user_id": "el3TmKFEFzZOcNbCw2FNlQ"
  },
  "EEnGa-98cn1SS4meboQemg": {
    "date": "12/22/2018",
    "text": "Service is terrible, they took over 30 minutes to get us 5 tacos which were not worth the wait. Also, the people at the counter were extremely rude which made matters worse.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "FBiDzVGqqzz058JB6pc_FQ"
  },
  "9nWK82KVBUja03JT484h_A": {
    "date": "12/14/2018",
    "text": "Unfortunately I forgot to take a picture of these treasures before I completely devoured them. Let me just say, these were some of the best tacos I have ever had. We had the carne asada and barbacoa. Both were to die for.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "fm3m9PQ8sYPse86BzycKFA"
  },
  "9Re9cEqZkZX69Y78gsg5Iw": {
    "date": "11/9/2017",
    "text": "Fast service and delicious food. We ordered a meal for 18 people to be done by a certain time and they had everything ready by the time we arrived. Everything was packed up nicely. The only thing they didn't do was label the items not pack any of the veggies or limes i had to do that myself and it was a bit difficult because it was a lot to pack for 18 people. However the food was super delicious and everyone that ate it agreed. The beans weren't as tasty as expected but did the job. We will order from here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "s2UCh4BM6XUVOgT23rxe5Q",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/s2UCh4BM6XUVOgT23rxe5Q/o.jpg"
      },
      {
        "img_id": "VrGxs7kYQA8DEzx5SXAO1Q",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VrGxs7kYQA8DEzx5SXAO1Q/o.jpg"
      },
      {
        "img_id": "gls5wfwADv4fwWwn5YtrMQ",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gls5wfwADv4fwWwn5YtrMQ/o.jpg"
      }
    ],
    "user_id": "Za04ZUz8FQYyG67Mmg50Hw"
  },
  "B018-j0da9gXEG9Ie5DZQw": {
    "date": "3/19/2019",
    "text": "The tacos here are amazing, I wish I was in the area more often because they'd definitely see me more often! The tacos are awesome and they cook up real quick. The salsa bar is amazing as well! I got 5 beef tacos and they were gone in a matter of seconds lol",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OZlWA9q5ZOHFM2kZbrS9Sg"
  },
  "_XBgCMcfQYW0-BvoRQJFYQ": {
    "date": "11/26/2018",
    "text": "Love this place! The Gringas and Caramelos are delicious. Their al pastor is so tasty. They have a salsa bar which they keep full. This is my go to when I want some Mexican street food! I took my grandparents from Mexico City here and they were very impressed with the tacos!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "cUf4weC0uLCZtMynku8U2g"
  },
  "qyVZ6Y8W5DX2qvDdFbFrlg": {
    "date": "5/30/2019",
    "text": "Tacos are delicious! The meat is well seasoned and the open veggie and salsa bar is perfect. Will be returning!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-3ilEC2Zn95K_Pcwp53hDA"
  },
  "8gr7sqFPhoZa7ne4LsbWPQ": {
    "date": "3/7/2019",
    "text": "Bro this place is sooooo good. I always went to Salsitas or Federico's before I even came to Ta'Carbon but this places just hits different. Bomb af, 10/10.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HyPS-NcZ5QGSub0qUCS_Ww"
  },
  "AI7MkPuFw5yWr0bwNl3B9g": {
    "date": "10/23/2017",
    "text": "So it was Tuesday and ofcourse I wanted tacos. Worked out well because I was in the Phoenix area. Low and behold this place not only had great prices, but they have a \"Mexican\" salad bar with veggies and salsas. And they sell beer.  All I want in life it to enjoy my tacos with a beer. Coronitas to be specific.  If you are in the area, this is a must visit. And not just on Tuesdays either.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "DbxBEI5D9d5s8ueHo3-nzA",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. We tried some different tacos. Cabeza, Lengua, Tripas, Pastor and Carne Asada. It was all good! And of course beer!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DbxBEI5D9d5s8ueHo3-nzA/o.jpg"
      }
    ],
    "user_id": "dYRJDUwkWcZJIqBI-Q5rAg"
  },
  "lC_Cco8Kxyt7UmG3VmlWjg": {
    "date": "7/28/2016",
    "text": "Great tacos, great salsas to go along. Many options on the menu, authentic mexico style tacos. Best I've had here in Phoenix.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lY5MoSkE7yyGAtwmzz_-SA"
  },
  "9FNyqu0g6ga7d8o1UsHJlQ": {
    "date": "8/22/2015",
    "text": "Best tacos in Phoenix. The pastor are my favorite. Its kind of in the hood but the place is worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cvkuHxc196rC0WAYvZpMUQ"
  },
  "BR2HugTIIT0dVG-kHiFDKA": {
    "date": "12/30/2014",
    "text": "Excelente tacos and beans their beans are seriously way delicious. Order a big order to go home so you can upgrade your lifestyle a little bit.  Tortillas are super fresh too like you wish your Nana had dozens of these on deck you wish.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hIyZDF_5oc0_Y3m6AsbGgA"
  },
  "Iynb0oqyjG5-QVik_muU7A": {
    "date": "8/7/2015",
    "text": "This was without a doubt the worse restaurant I have ever eaten at. I would highly consider never eating here. Asada was fatty, customer service was terrible and I didn't receive what I ordered. I would of rather ate at Quiktrip down the street and had their hot dogs from weeks old (thats an exaggeration) but save yourself the trip and keep driving.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Hj3GsnpI1jeNefuzxcsZGA"
  },
  "1Qq1pKxLIPAKfGwuVBxfDg": {
    "date": "11/10/2014",
    "text": "The best beef/carne possibly in the US. I've had mutliple joints in Southern California and this was my first time trying one in Arizona. I'm assuming Tex-Mex can't touch this although I'll admit I know nothing about Tex Mex. I consider that a whole different type of food. If this is the best carne in Arizona, this is just as good as it gets.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RqUUNj2hqxCvZskYmkB28g"
  },
  "3kl8tDOx6ed7NaWcP6RX9A": {
    "date": "4/17/2016",
    "text": "Great food, Simple and well done. Like a taquito stand in Mexico except inside a building. Keep up the great food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oppbRCro1h3t8TtjxuwPtw"
  },
  "u-UTNWnXaBiIRxHU7p435w": {
    "date": "4/16/2016",
    "text": "Tacos were good...guy taking orders not so good...was rude and made us feel unwelcome.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L8-vlibrPA_uPBD6Mzdw1A"
  },
  "Goa9XGKZPs6hsHVIBScbCQ": {
    "date": "9/3/2013",
    "text": "The best ensenada style street tacos this side of the border.  Way better carne asada, pastor and carnitas than any place in Phoenix.  Give it a try you will not regret it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fRclDad6qMwgW_l3jtRqig"
  },
  "qfWw3eDCd96LLX73RuHkwg": {
    "date": "1/1/2016",
    "text": "Excellent! Authentic Mexican food. By far the best Mexican food I've ever had (hometown is Philly so maybe that's not saying much). Their plates are huge portions and so delicious. Great service! I could've ate there every day. I will absolutely be back on my next trip to Phoenix.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "StW-R_7nB15-CdYnooI9Aw"
  },
  "hAqdad4VnlT2EAGeqrE4jQ": {
    "date": "5/6/2013",
    "text": "Went there not knowing what to expect!!! Carne Asada tacos, yum with the fixings bar. Orange fanta and I'm a happy camper!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w34SWUnjFpmpQMYOLrs51A"
  },
  "FKK7e9Jx-3Mdh5PU5Kx1Ig": {
    "date": "7/22/2015",
    "text": "I went to this place expecting to eat some of the best tacos but I was extremely disappointed. The carne asada tacos were full of fat so I had to be picking the fat out of them. The salsa's had no flavor. The guacamole was not from fresh avocados, it was probably from some type of avocado mix. Definitely not authentic Mexican food. If you want some real tacos go to Montebello, CA., in the intersection of Olympic and Saybrook.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "99QJ1ziKDaiEDW68b8iNMg"
  },
  "J8pPjCg8qpUGyfALf7P0_w": {
    "date": "4/30/2014",
    "text": "I had been going to this place on 59th. This past weekend I went to the Thomas location. Let me start by saying this great food. KEEP YOUR RECEIPTS I just checked my bank statements and somehow the tip I left for my pick up order had been changed. What kind of business goes that route, I've disputed with my bank since. Sad I loved this place but you'll will not be getting any from me again. If anyone has had the same problem please let me know",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "gcxALE2wWMs6rKbQZISRuw"
  },
  "Gsr8Z_YTngeeVOI-9OZQfA": {
    "date": "2/19/2014",
    "text": "This place is a bit of a drive for me in the East Valley, but it's worth it.  I used to have a go to taco truck  in Phoenix, but one day it just disappeared and we have been looking for comparable tacos ever since. Finally we found Ta'Carbon.  The only thing it is missing is carnitas, but they do the carne asada and al pastor so well that it makes up for it.  It is also immaculately clean and looks recently remodeled.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-tTVsQTMRB3GwurrX67D-w"
  },
  "xhFqYG1iXy_7VSsbxgqWFw": {
    "date": "12/6/2014",
    "text": "The best tacos in town! You want authentic street tacos? Come here. Friendly people and always busy for a reason.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_e6SL8fagh-h7Rzg93uTwQ"
  },
  "27YhUcgXAYNJP6dzyPHZow": {
    "date": "8/10/2015",
    "text": "The carne asada was great... Good flavor, cooked over charcoal... The al pastor also tasted really good... Salsa bar is not bad.. I asked for a side of beans and rice but they don't serve rice... So i ended up with a side of beans only... That was weird... What i didn't know is that my order of beans also comes with tortillas... Not one or two tortillas, but TEN. What the hell am i supposed to do with all these tortillas??? I had a few with my beans but ended dumping the rest... Actually there are a number of weird things going on here... You order your food at the counter, then u get a small rectangular styrofoam plate for the salsa bar (never seen that before... Lil cups for salsa, sure, they had those... But a little square styrofoam plate for cucumbers and carrots... Interesting)... Then when the food is ready, they call your name and place the food on one of those little styrofoam plates right on the counter... They don't use the order number on the receipt or any precise method like that... So if your name is Helen, Ellen might grab your taco... If your name is Eric, Derrick just got your burrito... But assuming you get the food you ordered you wont be disappointed, good flavors... Its all meat for the tacos and burritos... So u end up relying on the salsa bar to add something to your meaty taco/burrito... I didn't mind. Okay, so now I'm done with my food... I guess I'm supposed to throw away my trash (not sure, so I'm just watching the locals to see what they're doing) but they don't give you a tray so i'm stacking all my little styrofoam plates and slowly walking over to the trashcan trying not to drop all these salsa soaked plates on the ground and make a huge mess. I had to make two trips because i had too many of these damn little plates...  Okay so now i'm ready to hit the road... But wait - now i gotta pay. So you got to go up to the counter again tell them your name and the pay the bill... Again if your name is Filbert, you might end up paying for Dilbert's quesadilla (okay, u get the whole name thing now)... But its just kinda weird and inefficient... They also have a drive through window... But they don't use it... The drive through window is boarded up... Overall the food is really good but it could just be organized a little better.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-2fmMRj7YU0q5YGcgTTkYg"
  },
  "36KT011oi4pGTuCdZtNSQg": {
    "date": "8/16/2015",
    "text": "Hands down the best carne asada and tripas in AZ, I do miss the cucumbers they had at one time tho",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "eakmOreX8W6_P8vl9SThvA"
  },
  "wtR6gvGxx8HYtwZLEOMseA": {
    "date": "5/24/2015",
    "text": "I was very disappointed with the carne Asada tacos.No flavor lots of fat in them. My husband usually eats like 10 couldn't even finish 2. Carrots had no flavor. The only good thing where the corn tortillas. I will not be coming back to this place. I'm not sure how it has 4 stars.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VHURZRZmOIKbOzSzvcPb1g"
  },
  "dLyaQTLItxx5Tfckzfj_ig": {
    "date": "12/11/2016",
    "text": "While visiting family in Phoenix stopped there to eat because of the reviews. Delicious! Meat was so flavorful and juicy! Only bad was that we had to wait for a table and the parking lot isn't big so finding a spot was a mission. Other than that, it was definitely worth the wait!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rjCEWygrN47E0gWjyJguRQ"
  },
  "sMy4UPqlpseZ_m9r2Xik3A": {
    "date": "7/8/2015",
    "text": "Soooo I ordered a taco de Barbacoa and a burrito and my taco was ridiculously salty which was sad and then I bit my burrito and realized it came with nothing but meat. If you want beans and cheese its extra. I've never been to a Mexican restaurant where you had to pay extra to eat an actual burrito when you order a freaking burrito. Don't call it a burrito. Call it a super taco cus thats basically what it is. But yeah the carne asada is decent and the place is really clean but I am genuinely upset about their so called burritos. I am writing this review from the Filibertos drive thru where I'm getting a real burrito.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NT_1h3SJxqjzLeNVvMQQOw"
  },
  "tbB3dNlKjqV1nqh0zYEYig": {
    "date": "10/22/2013",
    "text": "This place is awesome. Tacos de huevos de beceros. So rad to see a joint with balls. Literally.   They charge you after despite it being counter service, so you can order more easily.   Will be back next time I'm in the 602.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cLLRM9pho4jBGXditX0DhA"
  },
  "JdqGy12RvLAXdgdfB9iSCg": {
    "date": "10/19/2016",
    "text": "this place is great. you have to try the tripas. get them extra crispy. the carne asada is also very flavorful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oYrNz7ni0tRXMtHBXqRzBg"
  },
  "whd4mF70cQUzz1Dvwsj0uw": {
    "date": "11/28/2014",
    "text": "I recommend the trepitas and the carne asada tacos!!!! Omfg  it's amazing all sides are always fresh and the meat is so good !!!! Ugh it's a must",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "inykWawDZ2K28JFJQt3O6w"
  },
  "u5Pap_6-l2hYxmHUglkEJQ": {
    "date": "9/17/2016",
    "text": "Their carne asada tacos are delicious. They brought me back to when I lived in Mexico. The carne is cooked on a wood grill. No eating here should be a criminal act.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C2KCY91fZ11paMg5li8Tfg"
  },
  "MlsTiXAYX98IHjzTzqtCGA": {
    "date": "9/7/2015",
    "text": "Best carne asada tacos in Phoenix  , place is clean ,  fast and friendly service , they have a salsa bar 7 different salsas",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4bfQjzB851WgsszQ4dsxGQ"
  },
  "W2tQRY9nYPmQj2Aju3eKjQ": {
    "date": "6/11/2015",
    "text": "Best carne asada in town, hands down. Salsa bar is always fresh and well stocked. Restaurant is always clean and service is fast.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tr9OTELy-vmRaFPJLMyUcQ"
  },
  "L_mOEspXH19pJSeun8K8_w": {
    "date": "5/8/2016",
    "text": "Stop reading this and immediately go.  Between my wife and I we had a mix of tacos, burros and quesadilla...caramelo, asada, al pastor, beef tongue and beef cheek. Beans are ridiculous & salsa/veggie bar adds anything else you may need. I said stop reading and go what are you waiting for!!?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cfGbFrKa6gsawRKsYBWFUw"
  },
  "hWt_M2AJb19eyWxo679W4w": {
    "date": "9/12/2016",
    "text": "I had 2 carne Asada tacos \"Haas\" (I think that's what it's called) this place is by far the best in AZ!! I also got a steak quesadilla and that was amazing as well! They have friendly and fast customer services.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AmglorCx4LYg8KBMOriqzw"
  },
  "PaLmjlzm7qAfd3jXsZ_3nw": {
    "date": "3/12/2015",
    "text": "The best tacos in town! It doesn't get any better than this place been coming here for a couple of years never dissapoints !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0AH4QttXPsnoICLyivXYGQ"
  },
  "l-ebCphEzIlD2cHxAoL-pA": {
    "date": "8/5/2014",
    "text": "I just went here for my second time and am still in love with the Carne Adada Tacos. I usually add lettuce, onions and cilantro, avocado sauce, and lemon juice. It makes the Carne Asada taco to die for. I recommend this place to anyone who loves a satisfying Mexican food meal. Will definitely being going back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "iBf7DrIu6e7eq60XV_T9Jw"
  },
  "PSxRfAdO5hAH7pTOJhKRcw": {
    "date": "3/18/2014",
    "text": "Carne Asada is on point! I want some now just thinking about it. I live in Surprise and come all the way here just to eat there food. Tacos & burriots, BOMB! Something so simple done right. Just carne asada. They have other items and stuff but i just come here for the carna asada. Plate thats feeds about 3, $15. Think its a pound of carne asada and like 15 tortillas...Great value.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DIUfbI_-5oUQL635kJkv8g"
  },
  "PjBcSjtDE6fBmuZzPgOq1A": {
    "date": "12/28/2014",
    "text": "Why are there almost 5 stars for this place? I went here last night because of the high rating. I got there about 40 minutes before they closed. The service was fast... But the food was greasy. Greasy quesadilla, Greasy tacos, Greasy loaded potato. Ma'an I'm not coming back, & fear the backlash!!! IYKWIM",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vOdD6pj-ca0ZipQHy8GSKQ"
  },
  "0PqjbAYKZsue6E0pFugG4w": {
    "date": "3/29/2015",
    "text": "I gave this place a shot because I've tried just about every taco shop within the area and wanted something new. I'm so glad I did. Their setup is simple.. Good meats cooked over charcoal grills that give it awesome flavor. They don't serve rice but do have beans and offer a bar full of fresh cut veggies and salsas. I would recommend this place to all my friends. Definitely adding this spot to my daily lunch rotation.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hOn15IGxU5H9iCSA8JtNeA"
  },
  "h8bWiZOWE9yYslPa_uDBFQ": {
    "date": "8/17/2014",
    "text": "Insanely good.   If you like old school authentic Mexican food treat your stomach.   Great tacos.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "6EcLxFzAKV5DcW0ul6wl4g"
  },
  "3ywsUu4LMOtsx4Fdhp5anA": {
    "date": "6/3/2016",
    "text": "The employees were very kind to us (even though we came as a big group of 10+ and it was like 15 minutes until closing time) They were very patient and the food was muy delicioso! Tip: get the platos if you want to eat a lot of tacos- better deal) THANK YOU TA'CARBON, I will definitely come back!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BM1m3iAONLuemKz23wFWEQ"
  },
  "sp93E-YazkjiHk9-8jAwFA": {
    "date": "1/16/2016",
    "text": "The best carne asada in town. I have to give them however 3 stars as their service is extremely disorganized. There is no line to order & if your taking your order to go is best if you just call ahead as on the weekend their waiting times are ridiculous. A bigger locale and more organization would do this business wonders. I will still come to get my carne asada fix but I sure do hope they expand to another (bigger) locale soon!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-5i7xSNuaXWwODXqjEEEYQ"
  },
  "aDah0U4CQCRmjevmM9-rEA": {
    "date": "9/5/2019",
    "text": "Best tacos in town ! Keep it up love everything on menu. Need more locations Tacos de cabeza are delicious beans are bomb.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sJ-Znsq54tmIdl0fSjxuQw"
  },
  "XZRu6tnRb2zvjH6Sk5FqQA": {
    "date": "9/2/2019",
    "text": "Worth the visit. Great place, was busy and the food was great!!! Everything was amazing, sauces, horchata. Price: very affordable. Will return!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lRXj7Q9QM6SELkTT2VJPBQ"
  },
  "Lo04awdzCz9oqb24lUTX2g": {
    "date": "7/27/2019",
    "text": "So delicious!!! Very fast and friendly service even with the lunch rush. Affordable and filling.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9EKJMxbNBplqO2Ml7cbTuA",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Mixto plate and mixto burrito!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9EKJMxbNBplqO2Ml7cbTuA/o.jpg"
      }
    ],
    "user_id": "jnLEyARc5dr_LS_Y6IYYqQ"
  },
  "ENPPZvty9NOaxn7CbgCHzQ": {
    "date": "8/31/2018",
    "text": "A taco shop located in the cut. The stand alone building with a packed parking lot. Into the lunch hour this place was packed. People waiting in line just to place their order. A simple menu of tacos, quesadillas, and burritos. A salsa bar on the side. You order first, they make your food, and you pay after you're done eating. The tacos were great! You have a choice of corn or flour but when I'm eating street tacos I want a great corn tortilla. The asada here was done perfectly well. It was really tasty with a solid chew. I would definitely recommend trying this spot out for good tacos. It was recommended to me by a local to try it out.  Recommendation: Asada tacos",
    "rating": 5,
    "rated": {
      "funny": 6,
      "useful": 14,
      "cool": 14
    },
    "photos": [
      {
        "img_id": "DXPI617bBf5jzMKl7EePkw",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DXPI617bBf5jzMKl7EePkw/o.jpg"
      },
      {
        "img_id": "PH8cOKYk1Wz8iDpGkD27iA",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PH8cOKYk1Wz8iDpGkD27iA/o.jpg"
      },
      {
        "img_id": "mT19Z_GzXe1GxPVw_yg7yQ",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mT19Z_GzXe1GxPVw_yg7yQ/o.jpg"
      }
    ],
    "user_id": "IDVFG1pNSHIHoVuoLuZpcQ"
  },
  "S9ngCSEpziUBDehX7vhkNw": {
    "date": "8/18/2018",
    "text": "Best Carne asada in town. Never disappoints. All the salsas are great tasting and not jus spicy. I add bean and cheese in my burrito for a filling full or half meal. The Cabeza is Chihuahua Ranchito style which is very rare in this town   Update: the \"Hazz\" version of a taco or burrito is number 15# on an essential list (New PHX Times)  for a reason. After the first one I've been here at least three times in a 8 day period. Can't get enough of it. It only has three ingredients yet tastes very complex. Absolute simplicity works here. It will be sometime before I eat anything else here",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "qG0MmHAuteQciXe6LERqTA"
  },
  "v6J4ejiIAJ7RwewXtrjP6g": {
    "date": "7/28/2019",
    "text": "This place is delicious man! The meat is tender and flavorful! I was very pleased with everything I had here on my first visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sDNSNpa97wTqMzlgXlsufw"
  },
  "kmVmPCviesEHMGKQhTSdZg": {
    "date": "10/15/2018",
    "text": "This is the spot for amazing street tacos!  Buy them by the taco or get pounds of meat at a time.  Simple and delicious.  Corn tortilla with meat and then you put on your salsa and onions and lime and such.  Prices are good.  This place is awesome!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_Q-x9uc9p0CqGmKrhVQ_QQ",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_Q-x9uc9p0CqGmKrhVQ_QQ/o.jpg"
      },
      {
        "img_id": "I0yAw_IR5CQWgzteUDnllg",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/I0yAw_IR5CQWgzteUDnllg/o.jpg"
      }
    ],
    "user_id": "GWtgqybuv6uDjdv-kOZAxA"
  },
  "I9wbt5itJlZcXFj46v56CQ": {
    "date": "6/23/2019",
    "text": "Best tacos ever. Especially the taco hazz. Only place that comes close is mucha lucha but it really doesn't get sny more authentic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "wrg-WIPjeVHR_8UAyQ0c3g"
  },
  "CDpOUxwnsdpvW8NWkZAqwg": {
    "date": "4/29/2019",
    "text": "Great place and amazing tacos and priced good! We go all the time ! Very busy at lunch but goes quick !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WkaiKq5WXm8Yifkvx0Witg"
  },
  "h6ATTiSI4rBR3bk1F5bl4Q": {
    "date": "6/30/2019",
    "text": "Went here on a Friday night, line was long, place was packed.. everything moved fast, food was great, I wil most definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oMCtLSX2q3xxQCuy9rRmtA"
  },
  "1VHZIywL6HjcLn1vAMBgcg": {
    "date": "4/17/2019",
    "text": "Honestly the best tacos in town! Every option and side that you need is available. Place gets very busy during lunch rush but well worth the wait. I went this morning at 10am when they opened and they already had 4 people outside waiting !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DT167wzmNq4LlMY_164W1A",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DT167wzmNq4LlMY_164W1A/o.jpg"
      },
      {
        "img_id": "ZIMeHtYsYZ1VZ35-hUQFJQ",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZIMeHtYsYZ1VZ35-hUQFJQ/o.jpg"
      }
    ],
    "user_id": "NkRr4pAJRkOmtOwLHISpSA"
  },
  "6LeY6Do9hRdCeFDi1-oyiQ": {
    "date": "6/27/2018",
    "text": "Delicious tacos and burritos. This place is a must try. Prices are very reasonable. I get the mixto platethay comes with carne asada and Al pastor and includes beans and rice along with tortillas for less than $7. They have different salsas.   They accept cash or cards. The only thing about this place is that it has a tiny parking lot. It's always packed and truly delicious food, it's a must try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qNs71Qs7fOGQ-Mod-8ZL1A"
  },
  "QyGdBpOX8NBCEvzgt3wOzA": {
    "date": "7/4/2019",
    "text": "The tacos were good and their prices weren't bad at all. I can't give them 5 stars because when I went, they ran out of corn tortillas and I'm not partial to flour tortillas with my tacos. I also thought their lengua was kinda bland, but the taco hazz made up for that.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "q5HuRrakOvng_c14XvlZqA",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Tacos with onion &amp;amp; cilantro",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/q5HuRrakOvng_c14XvlZqA/o.jpg"
      },
      {
        "img_id": "x3EzKh_EXiguw00d5z4RqQ",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Bottom plate is lengua, mixto, &amp;amp; hazz. Carne Asada top right, pastor top left.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/x3EzKh_EXiguw00d5z4RqQ/o.jpg"
      }
    ],
    "user_id": "oIcYr0buB1-kfU0n2yLkrQ"
  },
  "W1DULAlvmgbeBW6qb8s9ig": {
    "date": "11/28/2017",
    "text": "This place is LEGIT.  I wanted some real Mexican food and this place delivered. Order at the counter, grab your salsa from the salsa bar and wait for your tastebuds to thank you. I ordered a variety of tacos and sampled my friend's burrito. The tortilla was fresh and ALL of the meats (we ordered 4 different kinds) were delicious. Tripe was clean and flavorful. Agua fescas also didn't disappoint. We went right before the lunch hour and was able to grab a seat.  Hands down one of the best Mexican restaurants I've been to.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "QGYT3S20X7ytkS7FtviAIg",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QGYT3S20X7ytkS7FtviAIg/o.jpg"
      }
    ],
    "user_id": "__LHU2ohslRR7_9uu00rYg"
  },
  "xAv6ql_XAIQ29ir6MmAlRA": {
    "date": "6/30/2019",
    "text": "Best Mexican grill I have had in a long time.  I will be back!!!   This is a hole in the wall place.  Order and pick up your food from the counter.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xdMDbPdqvvduTWWoRQT0ig"
  },
  "rmgXAHa9PaDyAqo8KoBMsw": {
    "date": "6/28/2019",
    "text": "The carne asada is great. Today we didnt have time to dine in so we ordered the 2pnd family dinner, asked for carne asada and husband asked for barbacoa. When we got home we had pork adobaba and pork barbacoa. Whos heard of pork barbacoa! They should just call it pulled pork pozole. I called to let them know about the error they said sorry and thats it. They didnt say come get your carne asada or anything. I cant even eat pork.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NblQXipp8KYBmacCbqXU1w"
  },
  "VUMXNBugQeJqnPZXn6xJuw": {
    "date": "5/27/2019",
    "text": "Service was fast and their servings are a good size. Only thing I wasn't to fond of was their barbacoa meat was a bit salty. The food was still delicious either way!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ujr0MVxtWMki44XIqrWdcg"
  },
  "qxgblpN3eR7ZYdTewyAOjg": {
    "date": "5/11/2019",
    "text": "This place is legit!  It gets crazy busy, but the food still comes out fast.  I live 30 miles away, and would not hesitate to make the drive.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-A1t_EhcMtOHei0MQYLbCA"
  },
  "7rDl-oebtqlV_SHMA6BikQ": {
    "date": "5/21/2019",
    "text": "My dad was craving something like the taco trucks in Mexico so we came here on A Sunday. They open at 12pm on Sundays and we arrived 8 minutes after opening. There was already a line to the door but we ordered and paid in about 5 minutes. We had our food in the next 7. It was pretty fast and the food is quality! So good. It's already very reasonably priced. I think we got 10 tacos and 2 quesadillas between all of us and it was a total of $27.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nCTwun6Wanaofodc7-uHoQ"
  },
  "47354CBd83Horw5dtwz1Lw": {
    "date": "4/16/2019",
    "text": "Pretty dang awesome tacos!  I actually took a family meal to go!  Large horchata is gigantic!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "niKu4se6xtf-ctlm0udr1w"
  },
  "95I8uY4w8e1I_w5T3hLAgg": {
    "date": "10/4/2016",
    "text": "Delicious! Super hopping place. Good choice of Mexican sodas. Tried the asada and Maxx, delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CW75pyezRrgVf6kYBfFrLQ"
  },
  "qR2iZ0ZXMnnayD-zXbAvxA": {
    "date": "7/21/2014",
    "text": "This little place has the best tacos I've had in the area.  The way they cook all of the meats right on the coal fired grill behind the counter, along with the various toppings, makes for a brilliant little place to stop in for lunch.  My only regret about Ta Carbon is there is no location in the east valley!   I have a feeling they'd make a ton of money out here, as there aren't a lot of taco shacks with amazing food.  I just wish I lived closer.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2_wrLAQZOnTlpSFDACcJXA"
  },
  "syWmIztH2nVoqGrCd9xpDw": {
    "date": "10/18/2016",
    "text": "love the concept of serving your own condiments and paying for bulk cooked meat. Definitely in close second to best pastor I've had in Phoenix.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F_g_b3vOcP80Q1hMWdqbxQ"
  },
  "x4PRCCUzYnZDXkY3mSbIjQ": {
    "date": "3/18/2015",
    "text": "This place lives up to the reviews. Tacos-excellent, burritos-excellent, service- top notch AND fast, condiments and sides- fresh and tasty! If you want fresh, authentic, fast and super inexpensive Mexican food, you owe it to yourself and family to give this place a try. I have a feeling after you come the first time you will be back as I will!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TCyLjMDE6W6TcCXNmnXjSQ"
  },
  "QlkqNtwyiDeotjEAZoHPnw": {
    "date": "7/4/2016",
    "text": "If you want real authentic tacos,frijoles puerkos and REAL (not powdered) horchata this is the place to go! The staff here is super fast compared to the flood of orders they get and how busy it gets. They have REALLY good salsas and the tortillas are always warm. The downside is this place is always busy and seating is limited so its best to just take it to go, because it does tend to get loud. Other then that this is by far our favorite place to get take out on the weekends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3T9Nxh6tmOmqhg34TCii6Q"
  },
  "dmHVNl-4K6R6S1gPKtpy_w": {
    "date": "3/19/2016",
    "text": "Delicious but avoid going on the weekends cus your not going to find a seat n are going to have to watch people eat for 30 minutes before you have to almost fight for a seat lol",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lHUcO9h6-riHgus2uJg7jQ"
  },
  "vOvbxRYc9vmRBjx9xIW3fQ": {
    "date": "4/28/2016",
    "text": "Ta'Carbon is a good authentic Carne Asada restaurant! The food is so delicious, and fresh! The only thing I hate is that it is always packed and that the place is so small! I would recommend for anyone to eat here the good is so good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JsCF6G-QyLl2u8ez4NSMGg"
  },
  "5TwPGxh3x-PDw3AGj0I8jw": {
    "date": "7/6/2016",
    "text": "One of the first times I ever had cheek or tounge. Very good carne and even better salsa to go with it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L6MQZxapPbqyEWBD5fRGsg"
  },
  "noSE2n-3cM3bVisMJObFPA": {
    "date": "5/5/2016",
    "text": "Great food and really clean restaurant. It was barely 11am and there was a line. Got the Hazz burrito...really good. They were grilling jalapenos along side the meats. Also, great salsa bar.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A8zxVWjKS6tkW8HBncTTAw"
  },
  "oUNTsd5ayTCYC4Sct5QDIg": {
    "date": "9/1/2016",
    "text": "This place rocks. Food service where great. The place was packed and the people where all happy and good vibe. First time there and it won't be our last. My co worker said it was good and the real deal for Mexican food. The whole meal was less then $25.00 bucks with beers. Best of all was the mariachi band wondering the restaurant. If you want the real deal then this is your place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cj59NyI5ciSR_fS8Jofbjw"
  },
  "MaQDvG_wAw3soEEUNbYgkg": {
    "date": "12/23/2015",
    "text": "You should smell the smoke from their wood-fired grills. Simple and clean flavors with a salsa bar. Super fast and amazing prices.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kWyHuNkVjR9-ZJdNw0hhzw"
  },
  "03dZ_VxncUYwoBXySt0CNQ": {
    "date": "4/11/2016",
    "text": "Absolutely fantastic carne asada tacos. Hubby knows delicious tacos since he is a foodie from mexico and was delighted to find a great taco place in the valley. Recommend getting the parillada/package when having multiple people. It is worth the price!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "di38l2oEd17-uA6Iodr4zw"
  },
  "-_-H3_8ICK_X_ISCSzVv4A": {
    "date": "11/9/2015",
    "text": "Holy guacamole this place is AWESOME AWESOME AWESOME.  Talk about authentic Mexican food.  Perfect flavor, awesome service, restaurant was clean.  They had a great variety of items.  Everything is fresh and made to order.  I can't say enough good things about this place.  I tell EVERYONE about it.  Best in the valley by far.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6uREWrcg14EdD3UXvmPp0g"
  },
  "-NTDMM6OWLwn9ucyQNcs-Q": {
    "date": "5/8/2016",
    "text": "Unbelievably authentic Mexican style grilled meat.  The salsa bar has everything you could want. And I dare you to beat the price",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hVOOLUOWMmrJTVFzbfnA6g"
  },
  "hG9IeqvjLHBiLw3hekmMtQ": {
    "date": "6/29/2014",
    "text": "Delicious. Ordered 1 pound of asada and 1 pound of barbacoa with all the fixins. Great choice. Everything was delicious. Made a great meal for a lot of people for a great price. Highly recommend it. Great customer service. Kinda loud and crowded but soccer was going on. Decided to take it to go! Still highly satisfied with my visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "j3gTWHCgQy5BRZBAephXSQ",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/j3gTWHCgQy5BRZBAephXSQ/o.jpg"
      }
    ],
    "user_id": "N8M8KBiVwRRwY8DsjPVIvg"
  },
  "Sk0o-50qM_CavHjWkHO0jA": {
    "date": "4/21/2016",
    "text": "Good quality meat and decent salsa bar. I enjoyed my meal , but the way they takes orders confused me a bit but it's an easy adjustment. Carne asada, tripas, and pastor were the best. Stay away from the burritos, very dry. But tacos are amazing",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "znIxInvX_pV_6T7NqSNmvQ"
  },
  "WXeAhTlBdNG1NC-UDbEtCg": {
    "date": "12/23/2015",
    "text": "Tacos were amazing.  We loved the salsa bar.  They kept the tacos coming and our tab open.  We just kept going back for more. Thinking Christmas dinner here next year!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "XdL2yMu0ZqF1d-dHZtCrBg"
  },
  "5_lvl3laUvmt74poRXNvKA": {
    "date": "10/19/2015",
    "text": "I had the Carne Asada and port flour tacos.  Great flavor, fair price.  Seating area is no frills, but very clean.   Ill be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xylHgwHAf_T3Gy7YZ65eBw"
  },
  "UhWRqXiK0vzjnNEpYTc_jw": {
    "date": "6/15/2016",
    "text": "GREAT FOOD. If you want good tacos, come here. I have only been here once, but will be returning. Portions are nice, you leave full, and staff is friendly. The only reason this isn't a 5 star is because it was confusing to pay. They write down your order, make it, and then they have to search for your ticket in order to pay. Seems like the honor system, and I hope people don't walk out on them. If you paid up front, or they had a separate area to pay, this would be a 5 star review.  Go for the food. Don't let the paying process deter you.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f_EZ81R0xp6WRQJp8oDb7w"
  },
  "MKS9pF7mb-danW05fGnSKw": {
    "date": "10/30/2014",
    "text": "Hands down the best tacos in town!! The carne asada with flour tortillas are my favorite! Pastor are my second favorite.  If you feel adventurous I also recommend the tripa (crispy beef intestine). Seriously.   The tortillas are what really make the tacos. According to the owner, they import them directly from Mexico twice a week!  Don't forget the salsa bar and make sure to add some lime and green guac sauce with your favorite salsa to your tacos- the runny guac mixed with the lime and salsa will create an explosion of flavor in your mouth.   Paying at the end is a great convenience especially for a larger party or with new guests as you may not know how much you'll like these tacos until you take your first bite and you'll keep asking for more!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YJ3gPWIRrIPYl4wa6TEiOA"
  },
  "7hgI0m0sNBqfKA291hY7Nw": {
    "date": "7/6/2019",
    "text": "FIERO COMPA!  Best taco joint in AZ HANDS DOWN!  Can't compare to anywhere else really in the valley. The line's are long most of the time in the evenings, but it's because the food is bomb (very well worth the wait). They get your order in and out pretty quick and the prices are reasonably cheap for the quality and quantity. Highly recommend the carne asada plato or burrito. Tortillas are bomb too. It's the go-to taco joint you bring your family or friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SYnpK7niMMKfh_WsQJxVLg"
  },
  "m5R5j2_Y85wQ6GjfO9u3vA": {
    "date": "7/5/2019",
    "text": "I thought the tacos were average. Not great but not bad. I live in Los Angeles and I've tasted better tacos here :P   Parking lot is cramped and the ordering is hectic. During busy times seating is hard to find too. I do like the condiment bar but a lady wasn't careful and spilled some hot sauce on my shoe.  The meat was slightly bland tho but at least it wasn't dry.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4bfIulrb_6bw05tX4t7H6Q",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4bfIulrb_6bw05tX4t7H6Q/o.jpg"
      }
    ],
    "user_id": "njWzGIfKbnuPXHUSEwsBsA"
  },
  "rz9ThzR6VOH3Q0wyCjWrSg": {
    "date": "4/13/2019",
    "text": "First off the food is five star!!  I had a Burrito and a asada street taco. The tortillas, meat, and salsa bar were all amazing.  You will not be disappointed with the food.  The line to order and then to pay after you get your food is a little disorganized and odd.  Let's just say my order was to-go and I walked out with my food only to realize that I didn't pay.  I walked back in and had to find the person that took my order and paid him.   A place with such good food needs to make ordering and paying more organized and efficient.  I will definitely be back for the 5 star food!!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "kL3ACXR-h4Zxbbzh2Euu_A",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Salsa Bar.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kL3ACXR-h4Zxbbzh2Euu_A/o.jpg"
      }
    ],
    "user_id": "CL8AnCO4qHzWdiaAQHIRBw"
  },
  "nr6WBvZYLNIxJZmVaht2qQ": {
    "date": "9/15/2019",
    "text": "One of my favorite spots to eat. It never disappoints, the plato de haas is where it's at. Pair it with some of their frijoles and your set. One thing I will say is expect to wait a while for a table, they have become so popular that they don't have many tables to dine in. Still worth the trip.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "aVVyY0bH3HVMD8C0oJ-AJQ"
  },
  "xvTLOZ8e6UWIDmXa1jVf6w": {
    "date": "8/4/2019",
    "text": "Holy shit! Finally!  Fricking amazing tacos in AZ.  Thought it was a lost cause.  Even drove 2 hours to Tucson but there was still something missing.  You would think being so close to Mexico there would be a ton of options.  Well if you find the best, you only need one!!!  This is it!   I splurged and had the lengua, tripa, cabeza and the hazz.  Stick with the hazz.  It's incredible and has fantastic flavor.  They were all great but the hazz was memorable.  The tacos were so delicious, flavorful and juicy.  I will definitely be back!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "OZycA_MSog0ow8x8a52gWQ"
  },
  "VtTndsoygGZ8zmnkgpCCRA": {
    "date": "1/14/2019",
    "text": "I stopped by Ta'Carbon's Camelback location a couple of years ago and remember being quite impressed with the quality of the food, despite the hectic ordering system.  This location, just North of Thomas on 43rd avenue, is just as hectic. There was minimal parking, hardly any seats available, and a ridiculously long wait between ordering and receiving our food. I've always been kind of baffled by Ta'Carbon's \"pay after you eat\" system, which I'm sure people could (and probably do) take advantage of. It's not quite the right type of setup for that type of operation, but people don't seem to care.  Tacos here are simple and straight-forward, but noticeably better in terms of meat quality than what you'd find at similar places. I was quite pleased with both my pastor and asada, as was my girlfriend. She claims that the tacos don't really get anymore \"Mexican\" than they do here.  Prices are very reasonable, which only adds to their popularity. Even my little quesadilla was on-point, proving that that they clearly know what they're doing.  Realistically, because of the hassles, I'd probably never stop by on a regular basis. But when I'm in the mood to stand around for 30 minutes to cheap eating, I see them as one of the better choices available.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TCPLaprJm4FFei2DkW6K6g"
  },
  "S06Pq82HP0iPFUo53YPdjg": {
    "date": "10/5/2018",
    "text": "This place was a tiny gem on my Arizona trip. The tacos were super cheap and seasoned very well. They offered everything except chicken I believe (or just didn't have at the time of my order, which was a bit surprising but I think they are known for their beef and pork so I guess that makes sense. I had a delicious pulled pork taco, the pulled pork was cooked in a flavorful sauce, yum! I also had a chunky pork taco that was even better. There's a condiments bar located on the side of the order counter that has all the toppings that you would want for your tacos, guacamole, spicy salsa, lettuce, and so many other options.   Customer service was good, no one spoke much English so it was a little hard to understand the meat options because the menu was in Spanish and they weren't really able to explain what it was. They tried though which is what I mostly appreciated. Great overall experience.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_UR2DUCJyF8zpD9Apt-eGQ",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_UR2DUCJyF8zpD9Apt-eGQ/o.jpg"
      }
    ],
    "user_id": "9kExd5qetKiPvnKn3P-5ug"
  },
  "Nucz6zat4FP_9ILWKecnjQ": {
    "date": "9/13/2018",
    "text": "Holy moly this taco place is so bomb. If you want some real authentic tacos like they make 'me straight out from Mexico- here is the place. They have all sorts of taco meat- tripa (intestine?), cabeza (cheek?), lengua (tongue) are the 3 that o had but they have also the basic pork and stuff. The flavors are to die for. I don't know how they cook them but there is so much juice and flavors in these.   They give you meat on a tortilla (either flour or corn, up to your choosing) and the you go to the side bar to get your toppings and sauces.   You order, grab your food when they call you, sit down, and enjoy a freaking delicious meal. And then you pay as you make your way out, happy and satisfied with the meal.   Tacos for less than $2 each is DEFINITELY better than the overpriced $3-4 Americanized tacos that you get from the more modern taco restaurants.  This place was pretty popular so finding parking and a table was pretty rough. There were many people waiting in line for a parking spot and some standing around cuz there weren't any spare chairs. However, I think it's worth the wait.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tm-vshxX90Rytr7Xjf0F_w",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Tripa y lengua y cabeza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tm-vshxX90Rytr7Xjf0F_w/o.jpg"
      },
      {
        "img_id": "1Ti5CTuZxUUu90h-Zng__w",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1Ti5CTuZxUUu90h-Zng__w/o.jpg"
      }
    ],
    "user_id": "YXtOsha9NOp4x6W1GP48Mw"
  },
  "Y82at-srpRBizYhaJSge4g": {
    "date": "4/7/2019",
    "text": "I'm on a taco eating spree but exhale negativity and inhale tacos. I've been to both Ta'Carbon locations and they are both equally delicious. But this day after the gym I just kept driving and drove myself to the location on 43rd Ave. Their tacos are legit the barbacoa is so flavorful. I've been a few times at each location and I've never been disappointed. I love that they allow you to dress your own tacos and if you get it to go they give you a container to fill with the toppings and salsa you want. Fantastic tacos at a great price. Highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "AHsv0ZclFiWgcI5PSj3UgQ",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. 1 barbacoa, 1 cabeza and 2 carne asada tacos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AHsv0ZclFiWgcI5PSj3UgQ/o.jpg"
      }
    ],
    "user_id": "LbMJEGRN8679j7ue5Y9RIQ"
  },
  "Nk9vWRCz8LvJYIgz4YdziQ": {
    "date": "8/8/2019",
    "text": "The best place for tacos will always be Mexico but for Phoenix, Arizona this place is one of the few that isn't that far off from the delicious Mexican cuisine offered south of the border. Whether ordering a carne asada burrito or adobada tacos the price and quality go hand in hand. One of the low points of this place however is the water down guacamole.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "hdVEghb5YUGyci5Glv1-sg"
  },
  "TkTxAyprdiWxnzPpNdfsfA": {
    "date": "2/15/2019",
    "text": "The best tacos in town in my opinion. If I could give it a ten star rating I would.  These are huge words if you know me. My nickname is the taco fairy.   The meat is grilling when you walk in. They make everything fresh after you order. They keep your order open to make sure you get enough. Try the carne and the taco haz.   The salsa bar is the best in town as well. If you've not driven over here you need to. It's soooooo goooood.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "i9qCsgl81_CMsnMuc67hqg"
  },
  "Jh7bDnNctVS_UlvYO__eiA": {
    "date": "8/18/2019",
    "text": "This was my first time at Ta'Carbon after hearing great things for a while. I went with a group of 4, and we got the 2 Lbs of Carne Asada that came with 25 tortillas and a couple sides of beans. Our food was amazing, and we were all stuffed after. The salad bars green avocado sauce and house salad was top notch. I can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ddv4NnnO9iOC8lGj07Tp9Q"
  },
  "-K2JBzlq6DkoMKFkzAzaxQ": {
    "date": "8/29/2019",
    "text": "Mexican approved #1 tacos in Az.No other spot comes close.The alambre plate is absolutely hands down bomb!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jwIq09hvW_FXvyzMHEXjkw"
  },
  "NPIthvnihLFzVE_d8brjaw": {
    "date": "7/9/2018",
    "text": "The tacos here are legit. They're slightly bigger than street tacos that I'm used to getting from other places and they're stuffed full of meats - each of the tacos I got probably had double the amount of meat in it than I would think is normal. The salsa bar is stocked full of various salsas and toppings like guacamole, onions, cabbage, etc. and I made plenty of trips back and forth.  Asada tacos are definitely the winner here - slightly smoky and super flavorful. The al pastor tacos were a worthy winner too. We also had the Taco Hazz, barbacoa tacos, and a caramelo. These were good, but next time I come, I'll probably stick to the asada and al pastor.  Ordering was a bit hectic for a first-time visitor like me, but the guys at the counter helped make it as smooth an experience as possible. Prices are super reasonable, we ended up spending $20 for 8 tacos, a caramelo, and a drink. You pay after you're done eating, and they let me know that I could go up to the counter to order more if I wanted more after the first order (which I definitely did). Will be back whenever I'm in the area!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "TE0MZkl4y_FS2gvUiGSj-g",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Various salsas and toppings from the salsa bar",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TE0MZkl4y_FS2gvUiGSj-g/o.jpg"
      },
      {
        "img_id": "UQYY88_hulAHbqiAldD1Fg",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Small caramelo quesadilla",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UQYY88_hulAHbqiAldD1Fg/o.jpg"
      },
      {
        "img_id": "EZDPrXdw-iRhaTCBvAVDZw",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Al Pastor taco on the left, Taco Hazz on the right",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EZDPrXdw-iRhaTCBvAVDZw/o.jpg"
      }
    ],
    "user_id": "BQSOKU4x9gZAdhvklHW0qA"
  },
  "QwfownG5ntJsOyYwxKrOCg": {
    "date": "8/16/2019",
    "text": "Excellent food! However, not worth the long wait, especially if you are on a tight lunch break schedule. There is always a long line and two guys working the counter (one taking orders and one as cashier). They need to revamp or modernize their order taking system and step it up more than two notches.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ohjzjrV1WAWXqiI6mSX8ZQ"
  },
  "qfAJM504oMqq0LvJKXHdIA": {
    "date": "7/8/2019",
    "text": "This is probably the best most authentic taco and burrito place I've ever had. It's so simple and so delicious and the prices can't be beat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8LaKoKpY_H6XaPRYvHk2jQ",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. This is a bean and cheese burrito but I also ask to add carne asada",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8LaKoKpY_H6XaPRYvHk2jQ/o.jpg"
      }
    ],
    "user_id": "qKdBcm0SMS6Z8H81VO0mrQ"
  },
  "bp7Rqj3_Eo3ALJPYT3bpFQ": {
    "date": "7/18/2019",
    "text": "Tacos are a bit small, but are packed and full of flavor! Good prices! Gets busy inside, but no one seems to mind the wait, because really, it's worth the wait. Nice salsa bar too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "P0hDZAhloHDgG6znOsbIGw"
  },
  "9nkAfIBIoVZJufT_9vKKqQ": {
    "date": "7/12/2019",
    "text": "I'm originally from Yuma and we have the best tacos there and I have to say these tacos are the best in the valley. All the other places here suck. I drive from Mesa so it's definitely worth the drive.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "lAVmJKACMUyfBJVErlAczQ"
  },
  "K_nH2uKLwyAcHR-Y1d95ew": {
    "date": "7/24/2019",
    "text": "Food great staff sucks balls !!! 40 min wait for meat that's already cooked when u get there no thanks",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "29OFuo9_v4R4tI-F43p1Zg"
  },
  "_meYA8zCG30SB1UfVxdowA": {
    "date": "8/22/2019",
    "text": "Everything was delicious, had a carne asada burrito and some tacos, cabeza, birria and asada, all bomb",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EnfnCfRtBPMQ0e4zeoz-PQ"
  },
  "xLhIwcWOnMNXvgvZSfk2vw": {
    "date": "8/22/2017",
    "text": "I've heard so much about this place and their food, so finally this weekend I decided to give it a try. OMG delicious food. their tongue tacos are the best. I definitely recommend it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HLapkGN8IKGYdo7xjY4p7g"
  },
  "8N3BVLpdaqGqgn-AK75ZHA": {
    "date": "3/5/2016",
    "text": "Pretty packed... Limited seating but good food! Salsa bar on point! Had barbacoa, lengua, tripas, and taco hazz. Barbacoa was tender and delicious... Lengua also. Tripas were good I like them a little more crunchy opposed to chewy but they were good. Taco hazz it was steak with green chili and cheese... It was good but when I go again I'll probably stick with the barbacoa. The hubs had carne asada and he said it was good! We will be back! Prices are great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jHONHSh8BHkmDARrfcoCGg"
  },
  "7kFbBlWNX3oKln8Rv9vnfQ": {
    "date": "2/28/2018",
    "text": "Asada tacos were excellent.  Went here for lunch today with co-workers and will definitely be returning soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CL1to0bTYFJbPDHvSwrQ2g"
  },
  "3fBFkviqUz0So3-VOv7n9w": {
    "date": "7/20/2016",
    "text": "I have eaten tacos from countless establishments in PHX over the years, I would have to say the meat here is this best I have ever had. Its cooked over over a coal fired or wood fired grill and has a smokey char taste to it which is heavenly. Been here a number of times and have only had the carne asada tacos. First time here came at 9:30 pm on Friday night there was not an open seat in the house. BTW I was the only white person in the whole place of about 40-50 people. Lol.. The place is very clean and welcoming, the salsa bar is very fresh and has a good selection of fresh salsas and veggies. The staff is on point, very professional and friendly. You wont find better Mexican food at the prices here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B58QGMCVK2Ww3L_87xmP7Q"
  },
  "fOZ_vk3YWOu6EQAeGnimVA": {
    "date": "10/2/2016",
    "text": "I've been living in Phoenix for about 5 months now and have tried many different taco places and 'ta Carbon has to be by far the yummiest taco place I've found. They're quick, delicious and have fresh condiments ready for you.  I only had their carne Asada which is my go-to taco choice just in case I don't like them, I can tolerate them. But this place exceeded my expectations. The Asada is yummy, I have no doubt that the other meats are equally as delicious too! So I'm definitely coming back to try the variety of tacos they have here and their burritos!  Definitely recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "evmL751adhxvaD3dCR0B0w"
  },
  "rqfEoST4uOEFrPW52SWZGg": {
    "date": "4/9/2017",
    "text": "Went twice this weekend. Everything was amazing. Everything. Cabeza and lengua are musts. The red salsa with black pepper is totally unique.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MnobIab5V9DrVO1CrkZWgg"
  },
  "0oCibhVKlfj06t7yHSRIdA": {
    "date": "7/15/2015",
    "text": "I had to give them 5 stars, service was good food was amazing I will be recomending this place to everyone and will be comming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "fN8OSx3k4tnpSkfZs97-ZA",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Tacos are really good, recomending this place to.everyone.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fN8OSx3k4tnpSkfZs97-ZA/o.jpg"
      }
    ],
    "user_id": "t679VzK2MBH7zAVBWyI4JQ"
  },
  "i8A1WTgeyJX3r02J3HZWPg": {
    "date": "9/25/2017",
    "text": "My favorite tacos in town, the place is always clean, and the salsa bar is always fresh and organized. Great customer service, and affordable prices. The \"plato de asada\" is one of my favorites, comes with beans on the side and several tortillas to make your own sized tacos. The \"aguas frescas\" are always tasty and served cold, I recommend trying horchata which is (mixed rice and cinnamon).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "82ytNoLCGBFz3uMAiI1Xcg"
  },
  "hVD0VQkYHlB3Nhn8lg_3tQ": {
    "date": "3/6/2017",
    "text": "I love their food real authentic mexican food. The best tacos and beans in phoenix I can eat this stuff all day every day. Hands down beats filabertos and any other place you can think of.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UGrQTPm6Vv8zasMLT9XiPQ"
  },
  "jYXn6-BWfvHejxw7AA3eJg": {
    "date": "12/7/2016",
    "text": "The best carne asada I've ever had. Get the asada plate, it comes with meats, beans and tortillas (flour or corn). It's a great deal and the food is just incredible. Nice salsa bar too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EGnpBNjHQtSiajFCTCB-5A"
  },
  "frDoCSSDClUkZHEMIWc2Kg": {
    "date": "4/8/2017",
    "text": "Carne asada tacos were amazing!! It was my first time going to the place and I always pass it.. definitely going to be stopping more frequently. Staff was friendly as well. My newborn was screaming and I was so embarrassed and everyone made me feel at ease talking about their own child thank you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "576GSrHZPm1OKrrP5oL37A"
  },
  "lvWM6XL4VzOZkE2t5y5TlQ": {
    "date": "6/26/2017",
    "text": "The best carne asada tacos I've had in Arizona, maybe anywhere else too. Place is always packed so you knows it's too notch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VS6_rS4132ujinhZ49rqYw"
  },
  "taZCd9F5Bj54DWEQaHrLdw": {
    "date": "10/18/2016",
    "text": "i went for the Tacos Al Pastor.. was not very impressed. Carne asada was pretty good, cabeza did yhe job but was missing something. late night post drinking spot for sure! didnt quite suffice my taco craving.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tx75sHZ7GceDwCIz4jFqmA"
  },
  "ip9a8t92sjQr5oMWu05TTQ": {
    "date": "7/9/2017",
    "text": "Everything you want in a taqueria.  Awesome grilled meat, good tortillas and fantastic salsas.  Incredible value too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qqDIU3co9AAX3P39-lVviA"
  },
  "eP77AnW5-X4ILkKmrGa4dA": {
    "date": "4/30/2016",
    "text": "Freaking amazing tacos!!! The beef was great, the avocado salsa was amazing and the corn tortillas were super fresh but the absolute best part was the lengua!!!  Let me tell you, this place does it RIGHT. Fall apart tender and bursting with flavor. I'll be back specifically for the lengua. It's worth the trip all the way down the 17 for me!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "XufTeRjGG3wqJUDl4yascw"
  },
  "RHeli7DwPmoVl1hdW133zQ": {
    "date": "5/17/2015",
    "text": "So good.  This place is True to their motto... It truly is one of the best carne asadas around.    asada parillada da perfecto con puro sabor.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "pn46vHs-ZqedRL6jg6bHyQ",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pn46vHs-ZqedRL6jg6bHyQ/o.jpg"
      },
      {
        "img_id": "Ck6-VOY8Rgap7w_KZPTeGQ",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ck6-VOY8Rgap7w_KZPTeGQ/o.jpg"
      }
    ],
    "user_id": "7COG5vIc-auX_29vzQfcTg"
  },
  "kUSj6aE76SkuAO8D2V74-Q": {
    "date": "10/28/2016",
    "text": "Hands down best tacos in town. The carne asada tacos will remind you of Mexico. Give it a shot, you won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lhjlPVEhIygIKLQ9LB-fFg"
  },
  "sREihj0cPUXmypyyA8g3fg": {
    "date": "3/12/2015",
    "text": "Get a double Family pack of Carne Asada, corn tortillas, a big order of beans as much salsa and limes as you need. This meat is grilled over charcoal for super flavor. As good as anywhere in Sonora or Jalisco. Get this to go on a Friday night and you will eat like a King all weekend and be a Family hero. Don't be shy the very friendly staff will help you when you step up to the left side of the counter. Get a take out styrofoam to go carton to put your salsa and vegetables into to take home.  If this food tastes like the homemade carne Asada your friends serve you should not be surprised to find out they really picked up a to go meal from Tacarbon. Open until 10:00 and you can eat on the patio.  I love this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gRIpPVykZcHyZ__yBU00_g"
  },
  "xxpYrpQ-Z6XiZGW7_J742g": {
    "date": "8/27/2016",
    "text": "Great little taco shop.  Excellent carne asada and a great salsa bar.  They also have roasted jalapenos which was a huge bonus for me. Their refried beans were tasty too. Excellent food at a more than reasonable price.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CU4-xoh00QhcRLehpXil7w"
  },
  "SD4EySgk-ebZ2ReA3tinZw": {
    "date": "12/22/2016",
    "text": "This place is legit. I was visiting the Phoenix area and happened upon it by luck. It's the kind of place where people go to experience bold and fresh flavors, particularly the locals, and it was pretty busy the entire time my family and I were there. The Mexican restaurant next door was dead, and this place had a full lot. That says it all for me. I had a medley of tacos---overflowing with meat---and if I didn't have a couple of tired young kids with me, I would have eaten about 15 more and then collapsed in the corner and died a happy man. All the meat was delicious. And none of the sauces were labeled, which made me feel like it was even more legit. They were very fresh and flavorful though. The food was inexpensive: I got 7 tacos, two beers, and sides (to include jalapenos) for $17. Loved it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vlz12h8atOGEVjBt0DTzww"
  },
  "6pEv2x7BGr18cfCCCuhY7w": {
    "date": "2/26/2018",
    "text": "I made a quick stop after the Dodgers spring training game. The food was great, I got 4 tacos and one of them Gringas ( a mixture of meats) . I gave 4 stars because it's small. They have outside seating but since its a popular place, sitting can be difficult. Overall, it was great and I would definitely go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "JCNkoD9qsnQ4OERIiZ9kMA"
  },
  "iSQi7SKyvQhCpSPXHnWmmA": {
    "date": "12/19/2018",
    "text": "Amazing Tacos. Awesome taste, fast service and clean place. Next time I'm in town will eat there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8rPp5L7ogKqqw548okIpcg"
  },
  "UEH4H06dZrJXVniBoM6bXQ": {
    "date": "12/12/2018",
    "text": "One of the best and most authentic taco places here in Phoenix and all of Arizona. They are actually made correct to order and culture unlike a lot of taco places in town. Great prices and great variety. I recommend ordering un plato instead of individual tacos, it comes with 5 tortillas and enough meat to make 4 tacos, plus a side of beans. Been eating there for years. 5/5 from me.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2FivmcMFj5pUXJ2neDwrUQ"
  },
  "UpX45QTJuIsrA3fknyEtOQ": {
    "date": "11/30/2018",
    "text": "Favorite place to get tacos. Everything is so delicious my absolute fav are the tacos de asada with chile hatch and cheese best place ever.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3NZctvu_N7Nx_N5h_CMisQ"
  },
  "T_vCEoMK79ypDmtHQKjFfw": {
    "date": "4/18/2018",
    "text": "Came to Arizona for a week on a business trip and wanted to get some authentic Mexican tacos. I was not disappointed. The meat tasted exactly like tacos from Mexico and they even have that \"watery guacamole\" they also give you the option to eat the tacos on a flour tortilla which is a plus. They were really quick as well. Overall really good service and delicious food  definitely stop by!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oCUPmSNNQF-Ta82oDyUHYQ"
  },
  "cwjf1pql8BCJEoyiPoo85w": {
    "date": "3/5/2018",
    "text": "Legit tacos.  The real thing.  No idea why there arent 1000s of reviews.  They were gobbled down by all.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PiLpGhvXkL3QangdFrc4Ug"
  },
  "_g6n-khaSoyO3tmXIwYF0w": {
    "date": "7/30/2017",
    "text": "Street tacos = happiness  These street tacos equal bliss.  I truly look forward to devouring these tacos.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TfupksZpPyOgD3gqaSlqgg"
  },
  "OUWvwqOUB_0Qn7DJcBvWYw": {
    "date": "8/5/2014",
    "text": "This place is phenomenal!  I had a quite a dilemma while eating here: i was sad because I didn't want my meal to end... But also i wanna eat it as soon as I can because the tacos are so much better hot off the grill...  I got two ASADA (steak) tacos and two PASTOR (marinated pork) tacos. The ASADA was delicious as expected. Tender juicy steak nom nom.... And the marinated pork was full of flavor...but personally I still like the asada bettter. Their salad bar has a good selection of toppings and tasted fresh... The cucumbers with lime and salt! Mmmhmmm... One thing that would be better would be labels for the salsa because I wasn't sure which is hot or mild so I just got the green tomatillo salsa and the avocado sauce.  I found out so interesting that they ask for payment at the end of your meal. I think that it is a great idea to bring in more business. It worked on me because I ended up getting one more taco lol.   Service was really good. It was super fast we received our food less than 10 minutes after ordering.   And I have to mention how they maintain their place. The dining room is very clean AND the restroom is also very clean   Can't wait to try more of the menu items next time.  4.5 stars!!!!!!! But really close to almost five!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "1u1eyj_DMTHMhxUp0e16xA",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Pastor tacos (left) and Asada tacos (right)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1u1eyj_DMTHMhxUp0e16xA/o.jpg"
      }
    ],
    "user_id": "rynOu6cdPg1cJDIHNOeIHA"
  },
  "PUWNBTAmfnjVRCYfvAn3fg": {
    "date": "8/29/2016",
    "text": "Lets be clear, the food was great and \"salad bar\" thing is great.  The cabbage adds a texture element to the street taco that is amazing.  The service was excellent too, they actually let you eat first and that is not the taco shop norm... But when you order in waves, it allows you spend more money.  The only reason I am not giving them 5 Stars is because of the price.  I have never paid more than $0.75 to $115 for s street taco, ever... Okay, sometimes I get o high end places just for their street tacos ruing happy hours... But damn near $2 a piece seemed steep.  My bill was $43 which would not be unusual if I wasn't ordering tortillas with a couple of table spoons of meat on them.  Im familiar with that area and tacos, and seemed a bit steep.  But the food and service is amazing... Price point needs to be adjusted (there was no shortage of people willing to pay that price though).. I could be completely uneducated on origins of the meats... But I doubt it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZuL-Mvr6iXJ7-eMLqxnDjw",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZuL-Mvr6iXJ7-eMLqxnDjw/o.jpg"
      },
      {
        "img_id": "Odqos7rp6ZLPsylcTq5rqQ",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Odqos7rp6ZLPsylcTq5rqQ/o.jpg"
      }
    ],
    "user_id": "Vbm50WElUT2QUYvmQ3QB4Q"
  },
  "LyhDxtHMX5OnHyP7whHMjw": {
    "date": "8/25/2017",
    "text": "Legit. 4.5 stars out of 5   Would go back. Great tacos. I don't like writing a lot when the food is good. Just go. Thumbs up.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JOacTztc8INoMyquiyp6xA"
  },
  "Loc7Zd2Q5fjgmFtQab2ivQ": {
    "date": "3/9/2018",
    "text": "Best taco joint in phx! Carne asada plate with chesse and beans and side of corn tortillas is the best you will not regret it and the salsa bar is an added bonus! Best place to go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_jr3_08dVD_1dP4L7yhttg"
  },
  "CPpzq9-23ihv-kmmVM-S8A": {
    "date": "3/15/2018",
    "text": "I'm not sure how this place isn't 5* I'm from Tucson but I live in the east valley about 30-45 minutes depending on traffic & we will take this drive for tacos. It is the closest thing to Tucson food! We don't eat tacos ever in chandler because we haven't found a really good place there. Now I don't want to! The meat is cooked fresh on the grill, everything is made right in front of you, the beans are amazing, they have cevada!! I am not sure that anyone would want to go anywhere else unless they're going to Tucson. Also the customer service is GREAT!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GIeyaZTKDFXr4W6lfjvODw"
  },
  "HfVZUQGKk9In0JekjTpL_Q": {
    "date": "10/23/2018",
    "text": "Best tacos in town. I've had a lot of tacos but one thing a lot of my friends agree on is that this is the place to go. I wish they were open later !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eVEDMEGkx3SMWTqsRk_zZw"
  },
  "LGuDVGRG2chEJJr7NLtHCQ": {
    "date": "4/15/2017",
    "text": "If you are looking for fast authentic delicious tacos, this is your place! The meat is always great! The beans are a little on the runny side for me. The serve Mexican sodas, waters, and beer! Perfect for a quick lunch, rapid service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6GT6kAIyCT9MA7y1ZN_PUw"
  },
  "Op0pXYhV9E8TZs0gYfcDNA": {
    "date": "2/6/2018",
    "text": "The meat selection is good and is very flavorful. Try them all n you will understand. Lots of salsa n sides to add to this very affordable tacos/burritos. Must come for great mexican food",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "chXQcj2bTk_umjbMNT9bJg"
  },
  "z2Ps4yknowu5w16fIv6g6w": {
    "date": "8/17/2018",
    "text": "This taco place is legit! The salsas were fresh and tasty. The best tacos I've had in Arizona. Will definitely be back here to have some more good eats. They have a nice menu with many items I'm eager to try. Only draw back is the seating, not enough tables to fit all the hungry customers. This place was so <a href=\"/redir?url=http%3A%2F%2Fbomb.com&s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\">bomb.com</a> that even though my fiance was upset with me I still enjoyed my 8 tacos!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xTg70570FLzEz-Cc1eKcYA"
  },
  "LURYXZOE11_3ZGhqD-r7Yg": {
    "date": "12/14/2017",
    "text": "The meat is really good here the only thing i dont like is that the rortillas are really really greasy. Other than that its great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ow_qhJg_0zpv0e8eu2K5ug"
  },
  "ih6CCt44AFGi0PVjQPLVcA": {
    "date": "3/29/2018",
    "text": "Yummy beef tacos!!! 3 to 4 Tacos fills you up. Very clean place. And their horchata is good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YHDVowTMzsJeRYw1ola5LQ"
  },
  "SHH_TtY0pCgN5pnDUf0EJg": {
    "date": "8/18/2018",
    "text": "Consistency is key here. The closest you can get to street tacos in Mexico. The beans taste just like my moms. Be warned though, it gets pretty busy and the parking lot is not so big",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nf9_5MnH0YtkixCu0-VzTg"
  },
  "3YWwBV3o4gp9t-rOajsdSA": {
    "date": "1/7/2018",
    "text": "I really have nothing bad to say about the food, the tacos were really good..carne asada and barbacoa..we also ordered beans and it came with a lot of tortillas. I liked the salsa bar, it's in a small space though and hard to move around the other people. They have no chips or rice, so don't ask, like I did. Staff are efficient even when it's crazy busy, and they aren't comping your meal, you just pay after you eat!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UmUJIInjktpWDl_aB2ZaZw"
  },
  "eVo8_k_3yJ6RfTatNPk9dg": {
    "date": "9/22/2016",
    "text": "Meat on my mind, mind on meat.  While being on the road for work I try to find tasty Mexican spots, and don't always have much luck BUT I am so happy that I came across Ta'Cabron.... Carbon.   My co-worker and I were starving, and we wanted tacos, burritos and more tacos.  Being disappointed from other spots that we had tried we were a bit apprehensive about this place, however we were not disappointed.  Meats tried: Carne asada/Al Pastor- succulent, well seasoned.  Meat so moist made you want more and more. Every bite aroused my taste palates and I was hooked.   Tacos were a decent size, only complain I have is on the burrito.  It is not big enough!!! I suggest you order two if you are really hungry OR order extra meat.  (they remind me of Taco Bell size burritos) and they also do not add rice or beans (I don't even think they sale rice, but  they do have beans, so you can add beans. you just have to tell them.) The meat is so good, that I know alone it taste just great.  They have a great salsa bar in which you can load up on guacamole, and all levels of spicy stuff and cebollitas.  Customer service is good, they are fast and clean and very inexpensive. I wish they had this place in LA.  I will def be back.   XOXO B",
    "rating": 5,
    "rated": {
      "funny": 14,
      "useful": 21,
      "cool": 19
    },
    "photos": [
      {
        "img_id": "gNzoRUiETMTypV3hC3tFgg",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. I love meat!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gNzoRUiETMTypV3hC3tFgg/o.jpg"
      },
      {
        "img_id": "ajUnMnOXDFoslvcdlBjwSQ",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ajUnMnOXDFoslvcdlBjwSQ/o.jpg"
      }
    ],
    "user_id": "7Yu2KI-g0mUwcT-4dBe5gg"
  },
  "kcFKVg_mCgoLBbBVto_Zmg": {
    "date": "12/18/2017",
    "text": "Great food, food comes out pretty quick considering how packed the place was. It's no frills but super affordable and it has a crazy amount of flavor. Watch out for the salsa though, it's crazy spicy but good. It's off the regular path of hip food joints but it's worth the drive if you want some just plain really good Mexican food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3ZFLRsLUiQUEx_XbfB2Nxw",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. I can&amp;#39;t find a bad thing to say about this place",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3ZFLRsLUiQUEx_XbfB2Nxw/o.jpg"
      }
    ],
    "user_id": "LPVSaUBvnSavuv_dgzrRSA"
  },
  "kmpdKqVwrTMNU_YaZ_FZ7A": {
    "date": "4/25/2018",
    "text": "Best carne asada tacos around.  We always get the 2 pounds of carne asada to go.  It comes with tortillas, salsas and all the toppings.  You can also mix the meats.  You can get one pound of carne asada and one pound of the other types of meats.  Can't go wrong here.  Try it out and thank me later.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ix0eAnlwWq8bEL_iLTfd-g"
  },
  "ZPTbcmpE6tyXJbpzvH9Nww": {
    "date": "7/22/2018",
    "text": "Fire! Best carne asada quesadilla I've had in a long time. Overall good bang for the buck . Very delicious",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KuVmrzsmYdue-sAQLTXLDg"
  },
  "XoDUdUu5CM2pPCPSqeL8aQ": {
    "date": "12/9/2017",
    "text": "Best tacos hands down. I can go on and on with this review but ultimately you have to try it for yourself. What are you waiting for? Why are you still reading this? GO! NOW!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7y2mrh1GXegfLWkm0VBMwA",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. MEXICAN COKE IS ALL YOU GET. If you want diet vanilla cherry zero garbage go to taco bell.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7y2mrh1GXegfLWkm0VBMwA/o.jpg"
      }
    ],
    "user_id": "4SM_JIV-ZUk5ZI87dTKEtQ"
  },
  "Ob_1WpANyoIzzxtEWJdBkw": {
    "date": "2/18/2018",
    "text": "Now this place is the ultimate winner, not only is it already on my list of favorite Mexican restaurants in Phoenix here, it also is worthy of being the #1 taco spot on this list! Ta Carbon is a delicious Mexican place, and their tacos are amazing as well! I mean just look at the picture, pictures don't lie! They are so casual and focus completely on the food, that it's really not shocking that their tacos are some of the best in the valley. Plus their name is hilarious if you speak Spanish",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BWflL6Ig_1m9-ffA2sTFNQ",
        "caption": "Photo of Ta'Carbon - Phoenix, AZ, United States. Their carne asada tacos are delicious!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BWflL6Ig_1m9-ffA2sTFNQ/o.jpg"
      }
    ],
    "user_id": "SPWQ5xUauOgIKcyqpjUy8w"
  },
  "vmgRfE9ClzmbsM3ffg_e-Q": {
    "date": "7/16/2018",
    "text": "My 2 year old son was scraping the tortilla with the beans he was so impressed! The food is delicious  The lemonade is so good. Tastes fresh like I could drink that all day. The meat is so tender & juicy. Muy Sabrosos",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6KLtwJa67x0WeiUMLPZumw"
  },
  "MWeBLfCoiiuiqTI8RbS-WQ": {
    "date": "8/14/2018",
    "text": "Great carne asada tacos !! Great burritos and bomb agua de limon !!!!!! Will come again definately!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NVjOGatbK55xxIPxsybWuQ"
  },
  "sQlfJ2-2RQILv0omEuDqeQ": {
    "date": "7/23/2018",
    "text": "New taco spot. Loved the eat now, pay later concept. Guys we're all nice. Salsa bar was stocked. Very authentic feel, good price, Mexican soda, friendly flies and all :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mpDAkGCbAceVypeRNFXa3Q"
  },
  "2g-DCUyD2_ozmzTKHmcAzg": {
    "date": "6/1/2018",
    "text": "I love their quesadillas with carne asada I think that's the only thing I have ever gotten here but it is so delicious (greasy though like really extra greasy)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BW4ePtTuIYKcuqBW9_OjtA"
  },
  "7M_qzgOy1LOHyj4MmwCsbA": {
    "date": "1/18/2019",
    "text": "The tacos are great and simple. Meat is cooked on a indoor pit. The asada and pastor are so flavorful! Mixtas burrito is a no bs (no rice, beans, or veggie filler) pastor and asada burrito of awesomeness. I Like the salsa/condiment bar where you have your choice of toppings. The Hazz tacos are pretty darn good too. They take a corn tortilla as leave it it on the flat top till it starts to harden then they add cheese and asada.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SJKh1HI7saDTiwcUSe0vpw"
  },
  "pqijf2CfmrKqKDJ8Hnx2vw": {
    "date": "5/22/2018",
    "text": "Extremely fast service, fresh sides, and both meat selections are excellent. My favorite on the west side!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "52Xn3mmDXYJxscAqUQ0eCw"
  },
  "Tl2p5RsspYCZseg5sJjsdA": {
    "date": "6/8/2018",
    "text": "Delicious authentic food! We had carneasada tacos and they were perfect! The drive from Mesa to Phx just for the food, was worth it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4-VE_RK5AuTbnWBjQDNvqQ"
  },
  "9lFAPwfZ3saQKmYpvFDGRw": {
    "date": "6/4/2018",
    "text": "I used to love going to this place until I got EXTREMELY sick having lunch there. Can't go back now and it's a shame... I had the chicken and pork tacos...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sahUNH8Bh_Ee1HcXFlxD5g"
  },
  "WEnD4P-HQrw9U6DsYvhSyQ": {
    "date": "7/5/2018",
    "text": "The Best Mexican food ever!!! Love this place! We are coming all the way from Fountain Hills just to eat really fresh Mexican, yummy food here! It taste like a homemade food, specially the beans! We were in more than 50 Mexican restaurants all over the Arizona, Vegas and San Diego, i never eat so much great food like here. It is so simple and great! It's always so crowded, hardly to find place where to park, but it's worth it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tO4xdwD03UzLc2uTTsVSUQ"
  },
  "KyOYjZwh2gnLkWFdWIgh6A": {
    "date": "5/13/2018",
    "text": "Great Authentic Mexican food. Their topping and salsa bar are always fresh and fully stock. The staff is friendly amad helpful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XrosCrvvFisfd8pkBk_wMg"
  },
  "5QLHEioyl1DUyxvmbXPYsQ": {
    "date": "2/17/2018",
    "text": "My favorite tacos in Phoenix. Super simple menu, everything is really good. They also have carne asada by the pound. Great place to go with a group of people.   Only downside is the tiny parking lot.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "WwI7Bjai2mHcut-evgVKhQ"
  },
  "SFzxuFePptYWVxsMupqI-w": {
    "date": "6/26/2018",
    "text": "Off top one of the best street tacos around. Bomb quesadillas to. Never regret going here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5sv8-quY6j15IUQCOUnCcQ"
  },
  "zbi67fd37eNQRwBvYaxv8A": {
    "date": "9/3/2017",
    "text": "Damn, may have found my new favorite local Mexican food spot.  The salsa bar is amazing with tons of options.  The carne asada meat was awesome.  Will definitely come back soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "PpYGMRsOJGmSp6wJ0ZW59w"
  },
  "i6kL4Z3i6wZfnNpbE1VmsA": {
    "date": "6/23/2018",
    "text": "Legit Carne Asada done right! Worth the drive! Salsa choices are delicious too! We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vAVppyydpnekXnDKlT0caw"
  }
}