{
  "L4zB7YZERIf7xKsaPSrnew": {
    "date": "1/12/2018",
    "text": "I had a Very Good Mediterranean salad and it has a very beautiful Ambience outside with the fire place",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3wxe99v1FFvIo_3fKazykQ"
  },
  "Ou8rJyYtnagKbef1Ca_kRg": {
    "date": "2/22/2018",
    "text": "This place is great. We have been here about 5 times.  The food is delicious.  We love the great customer service  and of course our favorite is Jay. He is our go to guy. We will return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FyzktgEefq8F4OsmPljg_Q"
  },
  "YWvFv1eTZ1WeL_3ouX060A": {
    "date": "7/26/2018",
    "text": "LITERALLY THE BEST GREEK RESTAURANT EVER! I've been coming here since it opened and never had a bad experience. Their customer service is outstanding and so is the food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1urAx8MPBjYnq0iekLg6lw"
  },
  "chK-HO2XZSZvYKb5BoG5hw": {
    "date": "12/6/2016",
    "text": "Wow, this place is on point. The food is excellent, the beer is cold, and the fire pit is warm (oh yea they have one!)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FeH_EBDcNINu5evLx55FYA"
  },
  "Ep03MTfPA-B8zvDUb156bw": {
    "date": "10/7/2017",
    "text": "Super happy we stopped by tonight. Got a gyro platter for 12.95 a beer and a glass of wine (total around 20$) . Signed up for awards and the awesome guy that helped us gave us 20% off. On a home game, Saturday night, we got our food before we even grabbed our number. Food was warm and delicious. Definitely coming again for the friendly and quick service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "J65EHC7QMdoR_WmCn0tf1Q"
  },
  "Vq_AHjQxMKdT6TLffCzEeQ": {
    "date": "8/7/2018",
    "text": "This was the best Greek food I've had. I had the chicken souvlaki with a watermelon salad so fresh and delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TDXJMWMjRELKGv2MMlCV7Q"
  },
  "LsuXCs07z8_bXgP8T1iTEg": {
    "date": "8/13/2018",
    "text": "Stopped in for lunch and we both had gyros with french fries. The only complaint was that they needed a bit more sauce. The greek fries were different but we ate them all. Solid food in a convenient location.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cgAhU-Vi4yV2ncQOf5ECZA"
  },
  "6zFOBYTTbdjYsy0nUUEzZA": {
    "date": "10/17/2016",
    "text": "They were supposed to be open at 9 am but only delivery person was there.  A manager finally showed up to say they don't open until 10 am.  So why do they have breakfast items on there menu if they don't open until 10??   And the manager wasn't very polite when I showed him on yelp the time and on Google shows them open already",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GtiUVfth9qmd-U8fC_RdBw"
  },
  "PiXjnWcFrbvzM7oaisjhVA": {
    "date": "6/28/2018",
    "text": "Great food and the patio area is really nice and relaxing! The Greek fries are very good and they have fast service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t_eTBsdZ2UjGYRenSwdzKQ"
  },
  "QOZlt6JIDobRZY_s7DDXDw": {
    "date": "10/27/2016",
    "text": "What a great place! We were visiting and stopped in for dinner.  Try the Chicken Souvlaki (had mine with rice and veggies), Greek Salad and the Greek Fries topped with Feta, Parmesan and delicious lemon dijon dressing. So good! Fun atmosphere and lots of seating inside and covered outside.  We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "b40wjpjmWXzUGDRxezhvPg"
  },
  "9ljeHEvld76of71cECPZMg": {
    "date": "10/5/2016",
    "text": "I'm at Westgate pretty often, as I'm a season ticket holder with the Coyotes.  So the wife (M) and I spend a pretty decent amount of time eating and having cocktails at the numerous bars and restaurants there.  I can't honestly tell you what took us so long to try this place. We just continued to walk by in search of other options. This time, we decided to stop in and give it a shot.   The food here is amazing.   I ordered the Greek omelette. I don't remember what M ordered, mostly because I blocked out the outside world entirely while I enjoyed the Greek omelette.  The place could have been on fire and I would have never known.  And even if I did, I would have taken that omelette with me and finished it. The vegetables were perfect. The gyro meat was perfect.   Will absolutely go back. Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kGGapvfP1SZH2ZOikdSpNA"
  },
  "R5LE41F50twbrJp-NBp54A": {
    "date": "4/26/2015",
    "text": "Wow we'll be back!! Good and service was excellent! I had a lamb kabob plate with rice and veggies. Lamb was delicious ! My husbands gyro was gone in 5 mins !",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "UQMWTbODADJR8AKpw1iSjQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UQMWTbODADJR8AKpw1iSjQ/o.jpg"
      }
    ],
    "user_id": "hW06HIqedUpmkLSqwKe6NA"
  },
  "cfL3zDIEZYZw2M0sgJnCLw": {
    "date": "12/3/2017",
    "text": "Good food and quick service. Gyros were stuffed with meat and veggies. Wrap was tasty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hNEMXpdrE7lfLuL3Ondu8g"
  },
  "NerFSjTKJ12jGljg9HUkng": {
    "date": "10/21/2017",
    "text": "love going here. love the gyro wrap with greek salad. always super fast service",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "i6Ym6SLu2wDE7GUvrIZCew",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/i6Ym6SLu2wDE7GUvrIZCew/o.jpg"
      }
    ],
    "user_id": "GvOy_esPjjSYX7HimjsqfA"
  },
  "nqli87fCDePAuIeHHgP7aw": {
    "date": "5/11/2015",
    "text": "First time trying out this place after a coworker gave the recommendation during lunch. Had my order of gyro wrap with salad to go. Upon my arrival, I was greeted with friendly service and the place had a casual vibe and was kept clean. The food???... Deeeeelicious!! Plus they had military discount! Found my new fave west valley Greek restaurant alongside Dino's!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1fh3CRU4pM59hukC8BD_Qw",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Gyro wrap w/ salad for lunch... $10. Mmmdelish!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1fh3CRU4pM59hukC8BD_Qw/o.jpg"
      }
    ],
    "user_id": "DJ8G-IzmeX_euX6Vp02DQg"
  },
  "2XJlbWWik8uvqFObTuzcCg": {
    "date": "10/2/2017",
    "text": "We went for a late lunch and they were not busy.  We placed our order and waited a long time. About 3O minutes.  The four stars is because once we got our food it was amazing. Took off a star due to the extended wait.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "4fk6H2TdztX78cW2N6I-6w"
  },
  "PZP-Gch8Ti6rDhLoy4HqTA": {
    "date": "6/6/2018",
    "text": "I love this place! The food and gluten free beer is always enjoyable while you watch the different events westgate has right outside for entertainment. Ask for Letty, she's the best!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1hKwMyloiFU9LM2yVFrhcA"
  },
  "gZY5aBIcESIzqD1Ck7aebQ": {
    "date": "4/9/2017",
    "text": "This is a solid option for dining at Westgate. When I worked in the area, I came here for lunch at least once a week for almost two years. Very good, freshly prepared food and very friendly staff. The owner is a great guy who once comped my whole meal because of the wait.   Which brings me to the only real negative about this place, the wait. Most of the time food comes out in a timely matter, but it can get very busy and the kitchen tends to get backed up. I came back today for the first time in months and had no issues at all. However, it was 4:00 pm on a Sunday and relatively slow. If you come here during a game or other big event, you should allow extra time to be served. Other than that, it's a good place and I'd recommend it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QvbCa5Xi558UnP-qy9RcmQ"
  },
  "4kKcaiSI-NbT8nxQ2gMMcw": {
    "date": "7/2/2016",
    "text": "Tried this restaurant about a year ago, nothing to die for, gotta say the bbq lamb was bout the best thing. A Bit pricy for 2 people.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qdCCJp8TmUMuiysLVINEAA",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qdCCJp8TmUMuiysLVINEAA/o.jpg"
      }
    ],
    "user_id": "EaT6ImQr6Tlrg-9StvPeCw"
  },
  "Rn7tgguXjPf24Bf7ht-sKg": {
    "date": "9/11/2017",
    "text": "When we got there I already pre-ordered my food. They took forever to check me out. Than I ordered a Greek salad and I got some salad with strawberries and nuts. It wasn't that bad but i didn't ask for that salad.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "k8bp-Oy_zEwoTDPV9z5XVg"
  },
  "tCCCWgaF-GRi7n7J8unS_w": {
    "date": "3/19/2017",
    "text": "Opa Life Greek Cafe has a fun European atmosphere. Kotosoupa has a delicious lemon taste. Would recommend to try this cafe out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Q_qCnIwNXuLMO5duoH8BSw",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Kotosoupa!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Q_qCnIwNXuLMO5duoH8BSw/o.jpg"
      }
    ],
    "user_id": "J_j93xPGZLRb7iBbH-tUYA"
  },
  "o70Wx--xh7otWxK6d5F5Sg": {
    "date": "8/7/2018",
    "text": "Good food  Received awesome friendly service I had the chicken solvkli   The first time trying this place had the pita and it was really amazing  Really like there side salads.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rM__Tpy70UB980nnE8-Rvw"
  },
  "XwiRmyUXo1RxKR1tAoN1Iw": {
    "date": "7/15/2018",
    "text": "Staff here today didn't even know the flavor that was in there Kombucha.. they really didn't care to find out.. when we finally found out by reading it.. Lois got all mad.. told me to go tell the owner.. very rude staff..",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "oRcu75LDz5EUNzI1nu1PjA"
  },
  "8_uiOiUTHiSojGleNAWriQ": {
    "date": "6/6/2018",
    "text": "Went here once. I honestly did not enjoy my food and I do not plan on going here again. The service was great but the food left a lot to be desired.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "r4VJuxDjw9uViYpwwhQ8ig"
  },
  "VuAErlquuTtm5UZj5ji0JQ": {
    "date": "2/18/2019",
    "text": "Great customer service and the food was very yummy! Had the beet salad with chicken. Perfect and tasty!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8CyZsUSTomD7HhRa29S8JQ"
  },
  "uzv7TqOss6KfZquRWLrw1g": {
    "date": "1/15/2018",
    "text": "Really great place to grab a quick lunch at, with great prices as well.   I got the gyro, my date ordered the falafel. They were both excellent. The service was really fast and friendly. We both definitely left more than full!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9bx1bKjQsnuigJBTXCGcMA",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Soo good, date and I got a gyro and falafel pita, both were delicious! I got the greek fries for $1 up-charge - worth it!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9bx1bKjQsnuigJBTXCGcMA/o.jpg"
      }
    ],
    "user_id": "H-8XAPvVls9PROmECeW_Uw"
  },
  "6UwMfazlCOopurR0FD0tfg": {
    "date": "8/27/2018",
    "text": "Great food always get the chicken souvlaki with rice and Greek frie. Recently found out about this place and have been coming frequently. Also check them out on uber eats!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qWPkeL_o2MYSIPeYCTxIPw",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qWPkeL_o2MYSIPeYCTxIPw/o.jpg"
      }
    ],
    "user_id": "Cv8bBkiW5apSw-8aOobWog"
  },
  "N_cI7d6U08pwv3QA3BWueQ": {
    "date": "7/17/2018",
    "text": "This place is amazing and awesome place to eat, breathe and eat like greek. I love it! I had moussaka platter with rice and veggies.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kb5gcMV-8T7Pt-b7qmFz9Q"
  },
  "1NT3oDX9pPHKm3ee7nk0Ow": {
    "date": "2/2/2019",
    "text": "Love this place.  Went there the night of the Elton John concert every place was packed.  They had a guy telling you we will have a table.  We ordered and he did not disappoint had tables being cleaned as people left.  The food was really good Greek salad I am still craving it.  Do not miss the cheesecake.  Service is excellent and the food is great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OtAvib8MHZWY2u0FN8Lhjg"
  },
  "RTHVX140sI6nXMHi-los6Q": {
    "date": "7/23/2018",
    "text": "Omg! This was one of the best Greek restaurant in Glendale, AZ! I'm so happy we found this place. Totally reminds me of our time in Santorini! Their Moussaka is on point! And you gotta try that Baklava Cheesecake for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iWIlJmeakARiLozgNFsXfg"
  },
  "Ei05BaezVLUFiCWbY67QiA": {
    "date": "9/27/2016",
    "text": "Very surprised by how good the food was here. Not the biggest Greek food fan but my wife was dying to go. After going, I would stop by this joint again and again. We ordered the chicken souvlaki kabob with lemon sauce and the beef souvlaki pita with tzatziki sauce. Both were very moist, the sauces were wonderful and the pita bread was great. The sides were all good. For dessert, we tried the baklava cheesecake and the caramel brownie. I was really excited for the cheesecake and it was just average for me. It had a strong taste of cinnamon and just missed the mark for me. The brownie on the other hand was awesome and had great flavor. Service was good and I liked having the television available to catch glimpses of the Sunday night football game while out with my wife. Do not tell her I was watching. :)",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 7,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "RiHmENQ66CjOy3Vjf5Md-w",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Salted caramel brownie....soooo goooood",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RiHmENQ66CjOy3Vjf5Md-w/o.jpg"
      },
      {
        "img_id": "VmfJs3LeddFxCHQcpwDCew",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Baklava Cheesecake...looked great but cinnamon overpowered the dish",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VmfJs3LeddFxCHQcpwDCew/o.jpg"
      },
      {
        "img_id": "TDwzJ2kDHQ7kXU6aEs18uQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Chicken Souvlaki ...very good",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TDwzJ2kDHQ7kXU6aEs18uQ/o.jpg"
      }
    ],
    "user_id": "5FAD2Yq7DLBQ_-ef1iDA-A"
  },
  "1f7CfmYpWqzHEal3HBoJwg": {
    "date": "8/6/2018",
    "text": "This place is very clean. The staff is very nice and friendly. Their chicken salad is the bomb. If you're looking for a place to have lunch or dinner, I would highly recommend Opa Life.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zzIn-ymZjkihnZ7klX13Iw"
  },
  "AocN97VnhuEvZhB4hZLXEw": {
    "date": "8/4/2018",
    "text": "The food is good. We never have to wait. They have an excellent  outdoor area with fires and a good misting system  to keep you cool while you dine adjacent to the live music onFru/Sat. I believe they have their own live music earlier in the week.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sZnLLAt3fWHOCGw9kuaaIA"
  },
  "aRmqPvrQ7wPcQ9UxzkfkLA": {
    "date": "12/1/2017",
    "text": "My new favorite happy hour spot. Restaurant is open and airy with indoor/outside seating. Great happy hour prices and food and drinks. The Grecian Delight Pizza is phenomenal. We also love the Aegean Club (huge!) w/ the Greek fries. The Shrimp Souvlaki is grilled and has a nice marinade. Great customer service and a friendly staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "a8tzK8ahe2fOm79UCdkJ6g",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Aegean Club w/ Greek Fries minus one bite. Oops!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/a8tzK8ahe2fOm79UCdkJ6g/o.jpg"
      },
      {
        "img_id": "kJhsMRRbamkaLJCbWVwASQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kJhsMRRbamkaLJCbWVwASQ/o.jpg"
      },
      {
        "img_id": "MWGQk7AU4n6OXF9IQocYow",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MWGQk7AU4n6OXF9IQocYow/o.jpg"
      }
    ],
    "user_id": "YvAeTU7CnzpDHurVYjX9Xw"
  },
  "dAH5BoNq6Ea4OTlzYIRt6A": {
    "date": "9/18/2016",
    "text": "Better than I expected.   Positives: I got the chicken souvlaki with salad and veggies and my husband got beef souvlaki gyro with Greek fries. (Sauce on the side).  I have to say I wasn't sure what to expect since I did my best to order healthy. First bite was of the veggies and wow they were good! Needed a tad of salt but cooked perfectly with great flavor. The Greek salad was very yummy as well. My chicken skewers were extremely moist and full of flavor.  I was not jealous of my husbands gyro like I thought I'd be! Although that also was wonderful. The beef was cooked on point and was tender. The bread was really soft and I loved the fries!!!    Next was the dessert.. Brownie and baklava cheesecake. I only took one bite but the brownie was delicious.   Negatives: I was dying to try the baklava cheesecake and I have to say it was a let down. It had too much cinnamon for my liking.  We were not really happy with the wait time for our food.. But once the good arrived we agreed it was worth it. I would go back.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "lr9X5cQ9nLTKAfcXk-fIbA",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lr9X5cQ9nLTKAfcXk-fIbA/o.jpg"
      },
      {
        "img_id": "YlY_9zPmvaTfpKshYeLFJw",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Baklava cheesecake. Let down.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YlY_9zPmvaTfpKshYeLFJw/o.jpg"
      },
      {
        "img_id": "Np1ey5dRF8EaW7CmxwogvQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Brownie. Yumm",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Np1ey5dRF8EaW7CmxwogvQ/o.jpg"
      }
    ],
    "user_id": "7xsmfHhxOxuXcOt9chn1uw"
  },
  "vOwLqe1j1qVWB8qVm9BVqQ": {
    "date": "8/21/2018",
    "text": "This is our first time there and we were pleasantly surprised. The portions were really big and the food quality was very nice. The only downfall I would say is how you order your food. the signs above the register or so high it's kind of hard to see and there's so much to look at. So you're basically got a line behind you trying to hurry up and figure out what you want. It might be better if it was a sit-down restaurant and they brought a menu to you. Just a suggestion. On a side note they did have a menu there at the counter to look through but again they have such a large menu that it took a while to look through and you had people waiting on you.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bFPvsmuhskgqEMwqAONeWA"
  },
  "OoHX0mM49xSbI-9WB7nbjQ": {
    "date": "3/24/2018",
    "text": "Came here with friends for lunch a nice saturday afternoon.  Sat on the patio, and we ordered a gyro wrap plate with salad, chicken and pork kabob plates.  The food was really fresh and good quality.  The meat kabobs were freshly grilled with a good char flavor!  The salads were refreshing and had a good amount dressing, not too heavy.  Appropriate prices and definitely coming back here.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "vmEo7Ci5pw6dADjIygrMmw"
  },
  "ytE-ffoOM7EK7_AaXHq_VA": {
    "date": "5/27/2018",
    "text": "Great place, great portions, I had a gyro with a Greek salad, and the draft Kombucha. Love that they are open early and serve lunch early too as  we aren't big on b fast food and not many places are open for lunch before 11 am. The guy that helped us was awesome and funny. He offered us upsells but it wasnt pushy at all. Will go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "7L3DpvSTpnToIH9Uc3YN-g"
  },
  "GXJhlYT0aYjRDit9QM0H2w": {
    "date": "7/17/2018",
    "text": "My family and I love this place! The food is great, we love the salads and my son said it was the best  ever. The staff is super friendly, hard to find now a days! Oh and the shock top for some reason taste a lot different than at other places, in a good way. Five stars easy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FVMBV5FOgHZAjhwkdkKxIA"
  },
  "lYSEInZRLuEc5O4Ho3Ijmg": {
    "date": "8/9/2018",
    "text": "I love Greek food. Sadly this was a huge disappointment.  Had a the Greek salad with chicken and the lemon chicken soup.  The dressing on the salad was flavorless, nothing Greek about it. The chicken soup also had no flavor and was extremely salty.    To make matters worse there was a HAIR in my soup!!! I was essentially ignored when I brought it to the attention of the service and was not even offered to be reimbursed for it...  Horrible service, less than thrilling food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vGgjfnjDDMGAXQPfotB0pA"
  },
  "50dswLA21uNu1GRGl9I-Pg": {
    "date": "9/15/2017",
    "text": "LOVE THIS PLACE! Opa chicken, salmon are my favorites. Best fries too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-98jJHkLir_t7XOht-763g"
  },
  "A_PLTyVXK4-0R17nMbT3VQ": {
    "date": "5/27/2016",
    "text": "Great place! Open air cafe but not too hot. Food was great, and the balaclava was delicious.  Greek fries cannot be missed l, especially with a gyro. Polite, friendly staff- overall wonderful experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CzqArZ5JBsoGjtCHcrrgaw"
  },
  "TFa9BvnmkXs-EMINfz1TwQ": {
    "date": "6/6/2016",
    "text": "Great restaurant, great food, great service.   I ordered a grill chicken plate with vegetables and  a salad and it was sooo tasty. I think It's the best grill chicken I have ever tried . You should try this place ...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q0_WrqChE0ol4G2GjK7KWw"
  },
  "i6ZoUlUSuaAb8zi6h6JqDg": {
    "date": "5/13/2017",
    "text": "Super tender and tasty chicken kabobs.  The portions are surprisingly large.  I'll definitely come back. Might want to ask for sauce on the side ... they are quite generous.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ROQf5R579rUj_W-cHo8Fzw"
  },
  "lEr12OcnGDr0NjcBnk1fZA": {
    "date": "8/25/2016",
    "text": "Opa deserves 5 stars for the menu choices.  Food is a bit overpriced but delicious.  I have lunched there 4 times and felt I got my dime's worth.  I wish that they include more etnic dishes.  I do have my favorites.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P6CHh-hOghW20rKb8rJjNg"
  },
  "MguZEDg1qcVI6XHeOU5-kQ": {
    "date": "5/5/2017",
    "text": "The food is very good and the price is pretty spot on for Greek food. We had the chicken souvlaki and the lemon sauce was really delicious. The only drawback is they open the doors to the patio and outside and we've had 4 or 5 flies buzzing around us and it's 102 outside. Close the doors and let the cool air stay in guys.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Psm_35dSn9D4xDLrkXSYow"
  },
  "RvIpxqR24D67LaCxPiNrJQ": {
    "date": "1/18/2015",
    "text": "Good food and service! I have had lunch here twice and enjoyed it both times. I can say they are pricey. Up to $20 with a appertizer and a beer for lunch. The portions match the price but to much food for one person. I would eat here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sJ6vPtDsNxNWB_qh-Fh9RQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sJ6vPtDsNxNWB_qh-Fh9RQ/o.jpg"
      }
    ],
    "user_id": "KwWiwxWsT8BFufLuq6rYjg"
  },
  "jgp_2T32k5yq7Uq9FsSf1Q": {
    "date": "12/29/2015",
    "text": "Nope nope nope. Hair in the food, food tasted bad, and we ordered one brand of beer but we were given a totally different kind. Don't get me started on the girl at the register.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lX2A47IyfdIP8JFnF1JQ6A"
  },
  "o99Mm8U1SRtBKqCiW57UwQ": {
    "date": "1/26/2016",
    "text": "My boyfriend and I went here before going to a hockey game. After we ordered our food, we were looking for a place to sit since they were a bit busy. While we were looking for a table one of the waitresses was following us around with our appetizer. We had been looking for a table for all of 30 seconds.The staff was friendly and super fast and the food was friggin delicious (especially the baklava cheesecake). It also serves local beer, including different types of Four Peaks beer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nzUTGxSoAEgmjrZ3SdFE2Q"
  },
  "E81aygWzgNC7rHnA5Wef5Q": {
    "date": "9/6/2015",
    "text": "Im so glad i didn't pay full price!! I went on a groupon that i saw. Was meaning to try this place for a while and what better way to try something new than with a discounted offer....well this place seems to be overhyped, overpriced and overdisappointing. The food in reality is pricey. $9 for a gyro and fries. This is what i went for because its greek food, they cant go wrong with Gyros right? WRONG. There was a ton of lettuce with very little meat. You really couldnt fold it, you wish it was because it had so much meat but instead way too much lettuce. The meat had ABSOLUTELY no flavor. It was bland, completely tasteless. Service was mediocre, all they do is take your order in the counter and bring it to you. The owners (some tall guy and bald guy) never acknowledged anyone, they were more interesting in checking out their waitresses (dudes didnt hide it) and flirting with women patrons. Kind of ackward to see the tall guy in his attempts.   You could tell they spent alot in remaking the place but food dissapoints. Will never be back to this place.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "8WE7H_NvgM7V6IA7Ro3Prg"
  },
  "jTPVtUR1DIAs-KXqQKQoxA": {
    "date": "9/22/2015",
    "text": "Very beautiful place. Clean with a nice view of the garden. The employees seem genuine with good service! The pizza I ordered was fresh and full of flavor! I am definitely coming again and I will bring friends!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "D6rINav6pNRL5L29j3h0Kg"
  },
  "MDvT2WKFu6MuJBOwPZw2Nw": {
    "date": "6/1/2017",
    "text": "This place has some wonderful dishes and salads.  Our first time there was in the evening and everything was perfect.  Great desserts.  However, we have made several attempts to go for lunch, but, everyone we have walked in, we've done a 180 turnabout because it was too warm inside to enjoy a meal.  They had their east garage door wide open which was letting out all of the cooled air from their A/C & letting in warm air in the upper 90's to the low 100's.  What a waste of electricity which gets passed on to their food prices since their operational expenses are a part of their overhead.  They do have outside misting systems which work marginally on hot days & not at all during humid days.  Plus, recent studies on the use of misting systems near food have shown that the mist picks up airborne bacteria which lands on the food may result in illness.  I guess we will have to wait to return for lunch when the weather cools down in the late Fall.  But in the interim, we will only go on cool evenings so we can enjoy the indoor seating to avoid the food-contaminating misting system.  BTW, in some states, misting systems near food service is outlawed due to the number of people who have become ill from their contaminated food by the misting system..",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-sQEEUkAXwou6PxTg5zRTA"
  },
  "EhH2OJaq0Ge2yOUd3NWMFw": {
    "date": "9/18/2015",
    "text": "Waited too long for a weak gyro, light on the meat. On the expensive side as well. Don't waste your time.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "_cCZ5SjX7U9qrfkV8W8uJg"
  },
  "3_2Ue6c7uw9YL72TaH7moQ": {
    "date": "11/15/2015",
    "text": "Eh.. was not that great for us, fairly expensive for what you get. Lady at the register seemed annoyed because we were taking to long to order.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ywnNQwHa6ZKIOPZebXtuRA"
  },
  "c-3vnfJkvJOULSQMGpGYvw": {
    "date": "10/1/2015",
    "text": "Amazing food. Cute waitresses. What more could you ask for? Kabobs and gyros you can't go to wrong...........",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Hq0coXmKXq4gGPMhtiDfVg"
  },
  "ZsKP9R75i16N0wPZae30rg": {
    "date": "10/9/2015",
    "text": "Prompt service. Good food. The gyro pita with the greek salad was excellent.  Fies good. Cold brew coffee very good.  Grilled chicken salad very good!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "bD_bSrbAUM-McTAxd6W5NQ"
  },
  "Nq9vHLFBmAq_oN-rUlQgPw": {
    "date": "7/30/2015",
    "text": "I really want this to be a great place.  I may try it again in the future.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Hl6BshPYUq_stfU4j-R4hA"
  },
  "YqtAHfxRY4VkX0stWLO7XA": {
    "date": "6/22/2017",
    "text": "Our food was excellent but the cashier, who I suspect was the owner, showed us even better hospitality and customer service. Definitely will be eating here again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zZjGDZRaYyRS1yY4VDPMiw"
  },
  "3xHPNY9_33ZknRx8RBOAdA": {
    "date": "7/22/2015",
    "text": "Loved this place! My friend and I were in the hurry to catch a movie and this place was quick and delish. We ordered wine and 2 appetizers. We got the calamari, which as an Italian calamari snob I must say was so scrumptious. We also ordered the Greek meatballs which was perfect to split between two people as we each got 3 pieces. Usually they give odd portions, so I was glad that it was equal servings. Definitely coming back! Great people and super friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "o70RVKQPwf-D9n-5l-nrCg"
  },
  "_8fJT2DKmu30rcAm2uj2mQ": {
    "date": "9/25/2015",
    "text": "Outstanding the chicken plate was great!!! The staff very friendly!!!! Great place to eat!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Us_9Z5pA477AW_aDZVQGkA"
  },
  "MALscm6eR_BazHhMr6qStw": {
    "date": "11/28/2015",
    "text": "The best Greek food I have had in all of Phoenix and the best option to eat at Westgate. The decor, finishes, and ambience is modern and nice. Service was very attentive. Fast casual where you order at the counter, sit down, and they bring the food to you.  Food was on point. We had lamb souvlaki, Greek pita, and baklava. Presentation was beautiful. Food tasted amazing, very fresh ingredients, healthy, and not oily. We ate it all before we could take a picture.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nqXeoarL_9ysj_Lwhc1fqw",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Baklava was the perfect finish to a great meal.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nqXeoarL_9ysj_Lwhc1fqw/o.jpg"
      }
    ],
    "user_id": "NWhRLmB6VrPaJbxnlzjO2g"
  },
  "_9EaOiDFE_Ckmp0a8fQnIA": {
    "date": "10/20/2016",
    "text": "We ordered the florentine pizza and the moussaka. The pizza was fantastic and if definitely order that again. The moussaka itself was not very good. The flavors just weren't there and the texture of the potato inside was strange. The pita bread it came with, the greek fries , and the veggies were all great though.   The place had a nice atmosphere and the servers were all pleasant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lHBTZpw4eV8yUB8nUjv-qA"
  },
  "s2T0dElhjpGw_p3wBazEAA": {
    "date": "11/14/2017",
    "text": "We had Greek chicken souvlaki it was delicious, sat outside and enjoyed looking at the Palm trees. Only disappointment was the music, it was to loud and should have been Greek, not which was playing on the speakers.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ClfR9MnrN5xjQRhOKOnFsg"
  },
  "KRiFmaPXpIBI3h00E3HGpA": {
    "date": "5/19/2016",
    "text": "Great place for food and family.  This restaurant is located in the heart of West gate plaza where you get to shop and let your kids play in the kiddie fountain. ...the Greek food here is real good.  I was pleased with the over all service as well..there's even an outdoor patio with mist sprayers to keep u cool in the summer time. I'll be back for sure",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "WNQslJ0PszTNciOjYoF27Q"
  },
  "M6fPBOo0Lx7YJ2nfKVdSIA": {
    "date": "4/6/2016",
    "text": "Anyone who knows what Greek food should taste like should avoid this place, not good at all. The Gyro reminded me of something one might get at a gas station, you know, next to the 3 day old hot dogs and pump cheese. This is not Gyro meat, it is some kind of \"Gyro\" looking meat but is most certainly not the real deal. Charging what you do for the \"cheap\" food you provide is reason enough for me not to come back or recommend to anyone. Very disappointing.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "7IYpPIWTwFvhOi9azBsgPQ"
  },
  "ELTcYsjX9uEH8xhjyD2gTg": {
    "date": "2/8/2015",
    "text": "Love the decor but the food does not match. This place is the American version of Greek food. I ordered a Greek salad with gyro meat. However the dressing on the salad was Cesar. That is not what goes on a Greek salad. Greek fries? They put a mixture mayonnaise on top. Again, that is not Greek. Everything was under seasoned and just not original. Only giving 2 stars for the for friendliness of their staff.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TztbhfEobT0spfQ08NIxpQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Greek salad with gyro meat",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TztbhfEobT0spfQ08NIxpQ/o.jpg"
      }
    ],
    "user_id": "NsfQ-zi3GC7tnbkxtmZXMw"
  },
  "CpF0v3x9WNisG-8aBGmaeg": {
    "date": "5/30/2017",
    "text": "I expected much better based on the reviews. The wife and I stopped for lunch, and food was barely adequate. 4 dolmades for $10 is a bit high, but if they were good I wouldn't have cared as much. They were dry and mostly tasteless, the grape leaves weren't prepared properly and they were tough and chewy. They were a good size, and the lemon sauce was good, but overall they missed the mark. The gyro meat was scarce, gray and bland, it wasn't anywhere as good as Phoenicia in Tempe or Gilbert. The Greek fries had parmesan cheese and not feta cheese on them. They're supposed to be Greek fries, not Italian fries. I won't be back ---  go to Phoenicia instead.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7DJn67bGNHqOFk-g7ttrFQ"
  },
  "auMxeRGnmfaXa4KFTiILdw": {
    "date": "12/22/2016",
    "text": "I haven't tried but a couple of Greek restaurants so that's the only reason I didn't give a 5 star. Had lunch with the wife and the food was fantastic. I had the gyro pita and it was loaded with meat. The only thing that wasn't great, was too much olive oil was on it. My wife ordered the Opa gyro burger and it was huge! It was so large she had to ask to get it cut in half. I didn't try it myself but it looked good. Half pound burger loaded with gyro meat, she barely finished half. Saved the rest for dinner. I will definitely be returning.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lOZk6G94EoivUQaVoAuPmw"
  },
  "gebTw2uCaq-5_5e4RriEZA": {
    "date": "3/9/2015",
    "text": "My girlfriend and I went here for the first time tonight and were very impressed. We spoke with the owner and he was very friendly and involved with the service. Also, the cashier had great wine recommendations. Overall, the food was fast and fresh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xL4QD-onx6rANX4Gn2STXQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Drinks outside by the fire!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xL4QD-onx6rANX4Gn2STXQ/o.jpg"
      }
    ],
    "user_id": "JwJu2a0-KQ__v18AH81nyA"
  },
  "uKgYilnhEiEPVVkkX3xofA": {
    "date": "12/15/2016",
    "text": "Great greek food and a reasonable price. Ate at the Scottsdale location. Owner was here and very friendly. As server was delevering my food he noticed they didnt have my salad and immediately got it. Staff are friendly and attentive. Would recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "javzIH1HRib1Wwq65t7PTA"
  },
  "u4oq-y9r_6xmsAnW9840kA": {
    "date": "1/27/2016",
    "text": "We came here after an event a few months back.  Their set up was good, service was good. Over all I wasn't blown away by the food, but it was good.  They have no problem with portions!  You get a ton of it.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "C4-DtyZClKlyIi9_9xc5AA"
  },
  "-lMk31wugUwJMINVlxxHDA": {
    "date": "6/12/2016",
    "text": "My husband and I were shopping in the area and decided to try this for lunch. I had the Gyro Burger with a side salad and the food was great!!! Service was good as well. We will definitely eat there again if we are in the area.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bSG2uN6Rz2HEcpCwho306w"
  },
  "I59JJ4_kU3B0evJj-UvjHg": {
    "date": "5/29/2016",
    "text": "The food and service was amazing! Their Baklava Iced Coffee is delicious. The staff were very attentive and friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "vB401v5VVEBlRq5_Yc9A3Q"
  },
  "J44NmorCPGfr25UrywXxKw": {
    "date": "10/22/2016",
    "text": "Fantastic  place. Exceptional Customer service and great food. First time here and already my favorite place in Westgate.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7P1WV_8SytolD4vUA1lkkQ"
  },
  "AHHWHNDzmhEQ15EXJk0CdQ": {
    "date": "7/27/2016",
    "text": "Went here with a friend. She had the gyro and side Greek salad. She said the gyro was delicious! I got the Greek salad with shrimp, the salad and dressing was amazing and gigantic!! I highly recommend it!! The shrimp on my salad were large, quality shrimp however, there was too much seasoning on them. The herbs were almost crusting the shrimp and it was just too strong of a flavor for me. All and all this is a great place to go!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mj0HSya0V3oLEKTDDjnwcA"
  },
  "5xx9f0GDnaIaM82Mbf2oFA": {
    "date": "1/23/2016",
    "text": "This was our first time to this restaraunt. We were greeted nicely. We were trying to read the menu as it was an order your food pay and then they bring the food to your table. They seemed like they were rushing for us to order. Cashier seemed more annoyed and seemed like she wanted to hurry and get our order done. We sat outside which was nice. My dish the falafel was over cooked normally when I have had this dish at other restaraunts there is a sauce I asked the bald headed server who looked at me like I was an idiot and pointed its right there. He was referring to the hummus under the lettuce ok that was a first. Again first time ever at this restaraunt. Should have went to Kabukis. Anyways the food was mediocre personally I would not recommend this place",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-hxL_2phtImtQlDcpVjxUQ"
  },
  "b9zggDyojjBalqSv6e4bKg": {
    "date": "2/20/2016",
    "text": "Food is good, ambiance is nice, but the fast food approach in ordering isn't cool.  Especially on busy nights.  Its 1st come 1st serve on the seats, so i had my wife save the seat while she texted me her order.  If you want a second drink you have to get back in line (unless you are drinking soda, the have a serve yourself soda machine).  I would go back but probably not if they are busy (aka game nights/ weekends).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "s6Kc7vTxKL3pStJE5m_TsQ"
  },
  "33EEJd5NSdunzu3rl7lFhA": {
    "date": "7/16/2017",
    "text": "Love the onset and the food,  always worth wild to go to from work to order lunch.  Thanks for being Awesome!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ouGWpE41vaHmCo0De5mLVA"
  },
  "79kBf9nATgt3VE1TOlLodQ": {
    "date": "6/2/2016",
    "text": "Great service, great value and really fresh and great food!   I will certainly come back and recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wSe_6lPmINzB0Xrj-NsUrQ"
  },
  "PDC74VIj8GukL9jxAk0vjA": {
    "date": "2/20/2017",
    "text": "My husband and I were curious about this place because we usually skip it when we're at the mall. I'm not sure why that is but we decided to give it a try this time. We regret it, unfortunately. Our cashier was amazing. Explaining the menu and allowing my husband and I to tell him our story/experience about a hole in the wall Greek restaurant we went to in San Diego. We ordered a side of fries, a gyro wrap, a plate of pork meat on a skewer with some rice, a cheese cake, and three drinks. Our total came out to around $39 and some change. That's two trips to a cheap Asian buffet, but was expected. When it was time to pay, a small line of two people were behind us. The cook or owner was rushing the cashier to keep us moving. Not the best feeling in the world when I was given two pens to sign my receipt, and both of them did not work. Ended up scratching the receipt real hard instead. Our food took about 10 minutes. Everything was warm, like it was just reheated. The rice we were given was so hard! Like it wasn't cooked. The cheesecake was very basic. I would suggest jack in the box for the same taste and texture, but at a more affordable price (definitely lower than $6 I assure you). The fries were soggy, like they were sitting in the to-go-box for too long. The gyro wrap tasted very clean. Not too flavorful. Kind of like coleslaw, without the American twist.. (is coleslaw American? Idk.) overall, the food was filling, portions were decent, and the presentation looked appealing. The actual taste of the food though (price included)......... I would pass. One star for the kind and patient cashier. Not so much for the cook/owner though. We could definitely pass on him too.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "H5hiJcPyPqFGQ7th2GGo_Q"
  },
  "H9moN1_e9VHr8v-IrrmU1w": {
    "date": "5/5/2018",
    "text": "One of my favorite places in westgate. Good food, lovely outdoor patio seating area. If you like Greek food, you will like opa. Can't go wrong with some hummus and pita.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vkCPYra8q6wcZEfsN81CSQ"
  },
  "7wxGyglTPpF9-tECBNUp0Q": {
    "date": "5/9/2018",
    "text": "We went early to a Jets vs Coyotes game and decided to grab a bite beforehand.  Went in to this little restaurant and their setup is pretty cool on a game day.  They have set menus for game days to keep things moving but it made ordering super easy.  So you go up, order your food and drink, if it's not pop they bring the drinks to you and then the food when it's ready.  I tried their gyro because I hadn't had one in years and it was super tasty.  The meat was tender, the veggies fresh, and their greek fries were incredibly good with loads of feta and cheesy sauce.  I tried a bite of D's lamb souvlaki which was a perfect medium rare and well seasoned - might have to get that one myself next time!  Also had their mediterranean mule with fig vodka which was surprisingly not as sweet as it sounded and really refreshing with the gyro.  Definitely would love to try their regular menu but even a quick meal was delicious here!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ITYoV6CCulYWg3GkuY_rkQ"
  },
  "2O4HpyNpoYM_1i7bl2_Hrg": {
    "date": "3/9/2018",
    "text": "First time here. It was just okay. Nothing earth shattering. Prices were ok, good was ok as well. I think what would make this place rock is if they lowered the prices or increased the portions. Increasing the value would make this place much better. Other than that, this location is at Westgate so is pretty nice sitting on the patio.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "OT0VuG0p5l1NplYjao-5hg"
  },
  "FEbBChBl2gFweG5uXIn4Mg": {
    "date": "12/3/2018",
    "text": "I had the grilled chicken pita with Greek fries. The chicken was very dry. It was very weak on sauce The fries were nice and crispy. I was disappointed in their brand of siracha sauce. I enjoyed the view of the Christmas tree and lights but the food was not what I have grown to love from other Greek restaurants.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jNdQr2TNi_x6XLtOPaKSNw"
  },
  "uYw7ekeF_B4fJ0SLwZMNpg": {
    "date": "6/7/2017",
    "text": "I love Gyros and this place has them and a whole lot more. Should you have a desire for taziki sauce and some lamb, this is the place. Gyros are only the beginning there's salads, meat dishes and more. Don't forget desert, as they have a decent selection to choose from. Opa Life is named appropriately.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "F1qeKn8JqEty6k-bQtxmDQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/F1qeKn8JqEty6k-bQtxmDQ/o.jpg"
      }
    ],
    "user_id": "GG9tAoEC9sMa_DokSkkImA"
  },
  "q8Voacj64AH1up3HzE71xA": {
    "date": "5/4/2019",
    "text": "Every time I come to West Gate I come to Opa Life because they never disappoint. The service is quick and the food comes out almost immediately. I highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "meqetmpi3sIb12KApcbZjw"
  },
  "Sy9o4Bsa-gf0WDEk0g2PaQ": {
    "date": "4/15/2016",
    "text": "One of Westgate's newer dining spots, Opa is a refreshing, fast-casual restaurant for your Greek food needs. It's lovely--absolutely GORGEOUS when the weather is nice, because when they open everything up, it;'s like one giant patio. Great view of the fountains, nice people watching, etc.   The good: Happy Hour is legit. 1/2 priced appetizers rock. The calamari was just OK. The Greek fries, with an unexpected lemon sauce as opposed to tzatziki, were very good. The watermelon salad, with its tomatillos, balsamic, and feta was honestly the best salad I've ever had. These will cost you about $3-4 a pop, and with moderately priced beers, amount to a fantastic light supper I would never turn down.   The meh: While inexpensive, the entrees disappoint. My gyro wasn't so bad it was inedible, but so soggy and bland it's not something I'd expect from a place that's supposed to specialize in it. I found the meat to be mostly unseasoned as well as cooked incorrectly--like they just had it simmering in a broth before putting it in the pita. My sweetheart dining companion was unimpressed with her falafel. The finale was the baklava cheesecake, which at $8 a slice I expected to be out-of-this-world. It was so loaded with cinnamon that despite the honey and shredded phyllo, it didn't taste like baklava at all!   I am open to returning, because at the very least it's a 5/5 HH. I'll just need to try different entrees, and skip dessert. For now, I'll say it gets 3.5 from me, but I can't round up when the main attractions were so disappointing!",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 7,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "0fP-P21FC3jO-rDpAv8d9w",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Watermelon salad OMG",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0fP-P21FC3jO-rDpAv8d9w/o.jpg"
      }
    ],
    "user_id": "YpGt3hdq5adPlEFn9fQ2Zw"
  },
  "LAupNAwTaTqGwYsLT3ZS6Q": {
    "date": "7/15/2018",
    "text": "If you enjoy an ignorant, rude staff then this is the place to go! Also they seem to have a difficult time reading signs. I'll never go back. Also i will make sure to tell everyone I can about this horrible establishment.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Jv7tTiEpkm4vSLzp7Ryb5w"
  },
  "kZkhnbkqSploFZfxoNIUsg": {
    "date": "3/17/2017",
    "text": "All I can say is to plan for extra time if you're gonna eat here.  The best word to describe them is slow.  Due to that, I can hardly remember what the food actually was like.",
    "rating": 2,
    "rated": {
      "funny": 7,
      "useful": 14,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "r-bhp5w42SyNsFFkfkMZtA",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/r-bhp5w42SyNsFFkfkMZtA/o.jpg"
      },
      {
        "img_id": "onhCvLLrTIJ0rp6eJ60NOw",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/onhCvLLrTIJ0rp6eJ60NOw/o.jpg"
      },
      {
        "img_id": "9AEI9kMkpuqcm-HQSgYCVQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9AEI9kMkpuqcm-HQSgYCVQ/o.jpg"
      }
    ],
    "user_id": "eSlOI3GhroEtcbaD_nFXJQ"
  },
  "SClO-DoWI7AnulOxwl14wg": {
    "date": "8/5/2018",
    "text": "With my limited knowledge of Greek food I can honestly say that the flavors and seasonings are on point and delicious.   I've returned twice now because the first time was such a good experience.  Very satisfied customer!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "W9OoW1D-PNh9Wf-_fsUF3A"
  },
  "0dvcfvT-fIgAovuQq_1u8w": {
    "date": "7/20/2018",
    "text": "Ok so hardly ever come down here, even though it's really close by. But we caught a movie tonight and didn't want the travel far so we stuck around  Westgate. So glad we did, and so glad the other restaurants we had thought of trying got low reviews. The Greek salad was great and the pizza was like being back in Napoli. It was a thin crust but really soft and the flavor was perfect!  We had the Margarita pizza, and it was so so very good!  All of it   from us",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "FIOxsy96PmDFAomTReCQ3g"
  },
  "cvAG2dbg31XYVnchet354g": {
    "date": "10/11/2018",
    "text": "Great food and service love the geek fries and the service has always been great very happ",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d2ZTTrDcmhvx49Bqp1tmfg"
  },
  "Lm3w_qii8oTozCT3ecaqpg": {
    "date": "2/12/2018",
    "text": "Good food, very  tender meat. The salad was good and the pork souvalki and gyro were both good. The tiramisu was good too, wasn't Day of fresh, but probably only a day old.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "G5vpnTThIa7Vbjbu7zWQZA"
  },
  "aXJ3P8QT8pLF2Jom-wqzOQ": {
    "date": "3/2/2018",
    "text": "Placed an order this morning to be picked up at 12:20pm. Arrived at 12:35 and had to wait until 12:40 for it to be ready. There were only two-four tables seated when I arrived, so I'm not sure why my salad took THAT long. And then there was MOLD on the feta cheese! My cheese was on the side, not touching any other food, and there was a huge splotch of mold on the cheese in the ramekin.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y-6Mfz-NZ-hEMVxNtjJWBQ"
  },
  "0WCJFX5_jaAjTXi9Bc1B-A": {
    "date": "3/9/2018",
    "text": "So, a little bit of a rough start with the line. It is almost a fast food style start with a line to the cash register and then order and take a number.  After that it then feels like a normal restaurant as the food is actually really good.  I had a Mediterranean style Greek salad with chicken and a side of gyro meat. All was very fresh and very flavorful and the pita slices were very good. I judge Greek on pita and theirs was top notch.  My wife ordered the salmon and asked a great question. Salmon salad or salmon sandwich.  Well, the salad is like 4 dollars more than the sandwich yet it isn't he same size. Get the same and order a side salad yah cheapos. Lol. She did and it totally paid off. Also, Pepsi machine with a flavor blast...... Awesome!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "34KbkSalXNBGYdJBHczK4g"
  },
  "eQEnbTSOoR2HST-tJRq6CQ": {
    "date": "2/21/2018",
    "text": "So yummy! My mom LOVED her meal and kept talking about it for days after. I got the pizza salad and it was really good, but all the toppings fell off when I tried to eat it like a pizza and I was left with a super hard, crunchy crust. I ate it like a salad, then just ate some of the crust after, but it was just too crunchy for me. The workers were nice, but one of them was a little too nice to me and kept interrupting us while we were talking and eating. They also had rap music blaring on the speakers when we were just sitting outside trying to enjoy our meal by the fire they have outside - that kind of ruined the ambience, but other than that, it was delicious!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sEmzSMe6GL_Mu-3dKg3CxA",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sEmzSMe6GL_Mu-3dKg3CxA/o.jpg"
      }
    ],
    "user_id": "ISptqQYoM1o4AEuCZPg7-A"
  },
  "9rmdeBu5J6WFfvgkIn6nIA": {
    "date": "6/3/2017",
    "text": "Went to lunch with a couple friends yesterday. today. Great atmosphere and drear food. I had the gyro in a tomato basil wrap with Greek fries, which I think I prefer over the pita. Didn't feel so heavy. The Greek fries were amazing! My friend had the veggie souvlaki with Greek fries and salad and then we got tiramisu and a chocolate triangle they was filled with chocolate mousse. So, so good! Next time I'm there I'm trying the baklava cheesecake.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "o8bPdl6reQuq_xSTNZsx7A",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Tiramisu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/o8bPdl6reQuq_xSTNZsx7A/o.jpg"
      },
      {
        "img_id": "Jm3uFiZt1WSZnWfNH1Omqg",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Chocolate triangle with chocolate mousse filled inside",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Jm3uFiZt1WSZnWfNH1Omqg/o.jpg"
      },
      {
        "img_id": "AdJA1hfxdo9OwwFV5fRf4A",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Veggie souvlaki with Greek fries and Greek salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AdJA1hfxdo9OwwFV5fRf4A/o.jpg"
      }
    ],
    "user_id": "LbMJEGRN8679j7ue5Y9RIQ"
  },
  "LldmkPpAXn8a7Cbtmz87dQ": {
    "date": "9/21/2018",
    "text": "This Greek food is the best I ever had. No joke the quality of the food is 5 star.The wines are very good..Service was quick ..and the food looked great",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-pjcLZwPZp5gXilGZUCvCQ"
  },
  "TrseDiPuMCuMmkN2Tbp-lg": {
    "date": "4/3/2019",
    "text": "Huge servings, delicious food. The beer on tap was flat, but it was okay. The fries were incredible and the Greek salad was o e of my favorites. Definitely going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n6LG8u8ubUSHQ9XS2HfUuA"
  },
  "6xdw5Tkp4_Olap_tcsgv2w": {
    "date": "3/18/2019",
    "text": "We come here often.  The service, atmosphere and food is all top notch at a great price.  The owner is usually there and ensures you order in a way that gets you the best value.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C8m_IOcxiK74de1isdzCxA"
  },
  "atZfKr3vmhVhZhnbpU8FWQ": {
    "date": "5/2/2015",
    "text": "Great food and a welcoming staff! The staff can make or break your eating experience - this staff was wonderful and we will return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G6QJaIICO0hhenqYjg9ntw"
  },
  "xito4X_f91ZrhdgQnURJsA": {
    "date": "2/29/2016",
    "text": "So my very first experience here was extremely pleasant.  They had amazing customer service and their food tasted great. However, my most recent experience was one out of the pits of hell. I actually work in the area and often went to this place for their chai tea drink being that it's my favorite and they have soy as an option. Now when I went this employee named Alan K must've had the case of the Monday's. Right off the bat he had a horrible attitude and was extremely rude! I asked for a chai latte and asked if they had soy. He told me \"I hope so\" with a rude tone. Well shit I hope you do too and hope you know what you have in stock being that you work there. Once he made it, it tasted nothing like a chai latte. It tasted like an iced coffee so I asked him if he could remake it. Through the whole time he was remaking my drink he kept bickering with me that it's going to taste the same because he's going to make it the same way. I told him that chai tea has more of a cinnamon taste and not a coffee taste and he continued to make these rude facial expressions trying to argue with me. Eventually he remade it and it tasted slightly better than the original drink. That experience alone was just a huge disappointment and frankly the customer service there from their employee Alan was the absolute worst! It's unfortunate since I really liked the place but after that experience I will not be returning.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "lE6LQix66b-SODndCl73zw"
  },
  "iAOC7DJMlVE9Zqe5145ISQ": {
    "date": "4/28/2015",
    "text": "First time here!! Delicious Greek food. I had the Chipotle Humus and Greek Fries. I will definitely come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9g7LyFAnWwE3ArOlafP3nQ"
  },
  "7xAwb6GEv6gBJTMFpzTUSA": {
    "date": "1/10/2015",
    "text": "Beautiful new Greek restraunt at westgate! Its a great atmosphere wonderful happy service and the food made me fall in love with greek food all over again!!!! Definately coming back soon",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "59PRB_pttjrVPkBJ9_TiRA"
  },
  "IvbanoHGZtCVSorX3UTyag": {
    "date": "6/18/2016",
    "text": "Was there for the first time today. Was very pleased with the food and the generous portions. My mother and I split the Greek Gyro pita . It came with a Greek salad and I ordered a side of the vegetables. We ended up having food to take home. Also tried one of their signature ice coffees which was really good. Will have to go back next time and try the Mediterranean Moscow Mule which looks delicious! Will definitely come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rFrBnm_cHvJ7zVp7RzPdFQ"
  },
  "IF97XolIl5uMfxHR3dS7vw": {
    "date": "7/22/2016",
    "text": "Great service and good food.  If you like Greek food this is a great option in Westgate.  The Greek fries are particularly tasty and the Saganaki is as good as you'll  find anywhere in the west valley.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vWeHJv1u7YHnL_ZNqzwdWg"
  },
  "V0KuHmpEispRCK9fhCbg4Q": {
    "date": "9/28/2015",
    "text": "Costomer service was great over the top with appreciation for visit. Will come again a lot of food for the good price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "UhpJ8iDE5WnXYpLIoEU-sA"
  },
  "nBU4g5R6NSX9dt_wfwrsHA": {
    "date": "1/25/2015",
    "text": "Food was actually decent. Never really had authentic Greek food so for me, it was good. HOWEVER, the staff is pretty bad. Not the the whole staff but the majority. Nobody at the front knew the Kids menu. Had to goto the back and ask someone. This all due to their being no kids menu listed on the paper handout menu. So as I waited for my food and looking at the stuff in glass display the girl working the register was gossiping about her co-workers to some dude she was trying to flirt with. Looks at me and gives me the dirtiest look and turns to the guy and says \"I'll tell you in a min\". Looks to me and stares haha. Whatever. Food took forever. Nobody gave us a number placard to put on our table so they didn't know where to take our food. Maybe later on down the road we will try it again. Oh, Dr. Pepper was awful. Probably not their fault though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F5TjhF9WWZs_kpPnfqewgA"
  },
  "GnbWcsVL0gIhJwk0GmfZKg": {
    "date": "6/18/2015",
    "text": "We went here with a Groupon and will be back for sure. The food was great! I really enjoyed the Greek fries...a real treat. The staff was very friendly and attentive. This is a great place to go before a movie for a good reasonably priced meal. I had the gyro with Greek fries which was delicious. The salads looked very good and I for sure will be back to try them.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "7giPWIO4kZE5AGER-NCwXA"
  },
  "YP7WCKDVsj3_JLHYBnzXpw": {
    "date": "2/12/2016",
    "text": "Delicious.  Warm pita, jalapeno/cilantro hummus  and chicken souvlaki with rice and salad.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-BF0VwhzVTVjViqf6d7S5w"
  },
  "3f2A50xmU_llIHK-wE5Y0w": {
    "date": "3/16/2016",
    "text": "Great place to eat at Westgate! I don't know why more people haven't discovered this place, it's one of the less crowded restaurants in the center but has great food and wonderful outdoor seating perfect for people watching. I had the lamb kabob, the meat was tender, flavorful and plentiful. The house Greek salad is also delicious. My dining partner enjoyed the gyro and pita. We shared an amazing baklava. It should be noted this is not a full serve restaurant, you order at the counter, get your own beverages and silverware but they bring the food at to your table.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O1EIved4cM3HNzXcCKq_IA"
  },
  "4GiKFF2Zd8n0z_8v4xEWIQ": {
    "date": "9/4/2015",
    "text": "We stopped by here for a quick healthy bite to eat before heading out to Sedona - Grand Canyon - Las Vegas Labor Day weekend trip. Food was excellent. Customer service was top notch. Owner and staff were very friendly. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aVC_yLjqi42cv_E987oi5g"
  },
  "YtbazfttI3GwlLzpQkUOyw": {
    "date": "2/13/2016",
    "text": "Awesome food, fantastic prices, and great service. Perfectly located in the heart of the action, this place rocks!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HG_xlf4L0tCVbDZY3l1j6A"
  },
  "cmHQtV3XiO3C4y9StWYpkQ": {
    "date": "12/13/2015",
    "text": "Turned me into a Greek food fan now, nevermind that I've always loved baklava. The desserts look insane (big portions), but I ordered a Philly gyro with Greek salad and I devoured it so fast. Soft and delicate pita, and indeed dripping with oil. Yum. Yes, cashier looks miserable and messed up our order number so we got teased with someone's cheesecake order, but no harm done. Lovely service from the buser as we chatted about our visit to Arizona.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UubQxKAibfZ3zMSehGmEqw"
  },
  "PCZBdmHvLPpYGgzwwxSZUA": {
    "date": "7/26/2015",
    "text": "Pretty good selection of standard Greek cuisine and a few local items. Gyro pita isn't a traditional roll but tastes very good. The tzatziki sauce is really good.   Don't know what some people are saying about service, mine was impeccable. FYI place isn't a sit down or fast food place but a hybrid. Order at counter then food is brought out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XNkJXHoK-uoO4ILszWBaYQ"
  },
  "GdXK3RJZuUb2sOaGnryfDw": {
    "date": "12/29/2014",
    "text": "Average Greek food, long wait.  Hopefully they will work the kinks out.  Food took a long time, and they don't seem prepared for crowds from the sporting events.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "GZ7FYQw6jyZFeMEVkolBUw"
  },
  "xmc21pn2XYeFqLi1BGRYPQ": {
    "date": "2/18/2016",
    "text": "Food was very good, but the presentation was awful.  I ordered a veggie wrap and it was on a  sheet of paper sitting on a metal tray.  Needless to say, the paper got all soggy.  It wasn't pleasant scraping paper off my food.  They really need to use plates!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kB4V3uRtAVof60g1EE9GTw"
  },
  "KcQ174U25JK0T2qAd0qGYw": {
    "date": "12/31/2015",
    "text": "We had the Mediterranean pizza and the gyro pita with Greek salad. Both were excellent dishes. The ingredients were fresh and the portions were a good size for the price. The had fast, friendly service and the restaurant has a relaxed atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4H4UFqsRHHFJPjFL_QGokA"
  },
  "vi5rVpkbmI1eHXGjs-Nk_A": {
    "date": "3/16/2015",
    "text": "Absolutely the best Greek cuisine I've had in Arizona in the last 15 years I've lived here!  And I should know because I'm a Greek woman from Chicago who had eaten at the very best there, and I'm a pretty damn good cook myself. The food at Opa Life is the closest I've found to my own cooking and at a reasonable price too. We were there last night and I had the lamb souvlaki with fries, my husband had the gyros salad with fries. My lamb was seasoned, marinated and cooked to perfection and the fries were crisp, hot and delicious.  My husband's gyros was cooked the correct way, on a spit, not fried on a griddle, which is the cheap and lazy way mist restaurants here cook it. We met the owner, Adam, who was a fabulous host. He was genuinely wanting to make sure everyone got great service which is what I would expect, and the wait staff was wonderful too. This was a great experience and I'm looking forward to my next meal there and also visiting some of the other Opa Life locations",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ez7oNeu_QTVuc5MRro7FPg"
  },
  "nfgdJ_c0MkjtkeylYWj28A": {
    "date": "4/13/2018",
    "text": "Terrible service. Had to wait forever for my food and what made it worst people who ordered after me already got their food. Not only that they forgot to add pita bread.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uxa-fm6YFwmV_VG8oZ-aJw"
  },
  "h80L2GEAT6VtIHanPc663Q": {
    "date": "5/14/2017",
    "text": "Decided to give Opa a try on Mother's Day for the first time ever. I went with the Beef Souvlaki Pita with the Skewer sauce and I definitely was not disappointed. The beef was tender and marinade tasty yet not overdone. The sauce was a nice accent and did not overpower the taste of the meat and vegetables. My mom had the Philly pita with chicken and while that is not my thing when I want a pita it was very tasty also. The chicken was cooked well without being dried out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Q2F8v3yHmDZqiNX2He3WJA",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Beef Souvlaki with fries. Awesomely tender beef marinated well.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Q2F8v3yHmDZqiNX2He3WJA/o.jpg"
      }
    ],
    "user_id": "LWbxHHukmwNcHsgxnWljdA"
  },
  "wjGl2Y19mg-s6swzyppn3A": {
    "date": "3/17/2017",
    "text": "Delicious pitas!!  Hubbie had the Philly gyro with mushrooms and peppers. A huge pile of meat is always his favorite. I had the chicken pita and Greek fries. The garlic sauce and Parmesan on the fries were a little overwhelming for me but did taste good. I think next time I'll ask if the can put the garlic and parm sauce on my chicken pita and leave the fries plain. But still oh so good. Hubbie wants to make this his go to place for game days. Plan ahead though. Service was a tad slow but worth it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xbLH70Rfv-Yxgzo4H1OGpA",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xbLH70Rfv-Yxgzo4H1OGpA/o.jpg"
      }
    ],
    "user_id": "Zsee-xZF3s4xRGkeAAP1Eg"
  },
  "rFz_OrZ4B_kH5TxbN5LrMg": {
    "date": "2/21/2017",
    "text": "This place has the best falafel ever! I used to have a favorite gyro place in Avondale but now this is my new go to! The pita is nice and fluffy and their portions are huge. I recommend the greek fries,  not sure what sauce they put on aside from having the sprinkles of feta on top, but it is amazing! Nice and crispy fries all the time and oh, getting to drink with a nice outdoor patio is great too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "yzDibeuu41eAGXHv5ozniw",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Falafel pita with Greek fries. Delicious and super filling!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yzDibeuu41eAGXHv5ozniw/o.jpg"
      }
    ],
    "user_id": "SHFrbqBgnfEdaq8tJuuxbA"
  },
  "jUQQ1J2Y62Qt1phwDDWsFA": {
    "date": "2/11/2018",
    "text": "Let's be honest here, this is not a great gyro. The meat is under seasoned and improperly prepared. The meat should not be a hideous pale color. The pita was fine as was the hummus.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wvO_bKXvCLd8NaDYMNelMg"
  },
  "Tx7IH1i85udph5yKjZwLyw": {
    "date": "10/2/2018",
    "text": "Excellent customer service! Danny went above and beyond helping us! Food was awesome great place, we'll definitely come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wtck3WYeqiIS8A_mftOHBw"
  },
  "9Z8rEqhLDhJvIuIxj4xwwg": {
    "date": "3/31/2018",
    "text": "I have been here many times. Their food is great. The staff is awesome, very friendly and will make suggestions if you are not sure what you want. Their Greek fries are amazing. On the weekends they are sometimes packed but it is to be expected because they are in Westgate, but the longer lines are well worth the wait. I have suggested that a few of my friends should stop in for really good food there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VPSkDoDx54kgwhfdykJMJQ"
  },
  "lSZfVqYfd0NrANQDgY-Ptg": {
    "date": "2/15/2018",
    "text": "I am a total regular at Opa Life - amazing food and an OUTSTANDING patio area, away from traffic noise. Great place for casual business meetings.  We also get Opa life from Uber Eats too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RsTX5m8UBc5HrrdquhTbPg"
  },
  "PQ2pE3iP1TS3PW_KcMItuQ": {
    "date": "8/31/2018",
    "text": "I just can't believe how bad the food was! We came here with high hopes with all the great reviews. My lamb was so over cooked and burnt you couldn't even eat it. The Greek fries and Greek salad had no flavor and were very plain. Pita bread was on the plate with nothing to dip it in like hummus. The meat was on top which caused the salad to wilt and be warm, the pita bread was all soggy. We complained about the food, we were offered to have it remade but declined because it was so bad, a refund should of been given. Highly disappointed with the food, service, as well as the price. Next time we are in the area we will go to yard house.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w4beXzn3Hd4edDff6JoP8g"
  },
  "OqNgeUPOHzv96dodAm1WxQ": {
    "date": "1/2/2017",
    "text": "Was really impressed by the quality of their food. I had a Pita gyro with Greek fries and my wife had the grilled chicken souvlaki. Both dishes were amazing, the chicken was juicy, and the gyro meat was seasoned perfect. Their fries comes with a lemon mustard sauce and were one of the best greek fries I've ever. Although I do not live in west valley, I would come back just to eat here again. Honestly one of the best Greek places in the west valley.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "XEcsxGwyIgeYApWghDfg_g"
  },
  "ONqGfwjHuOFeiLLZYSQNMw": {
    "date": "1/14/2018",
    "text": "Good size portions and clean environment. It can be a challenge to get the food out at the same time with a party over 2. Food is a little pricey and can be hit or miss depending on the day but it is nice to have an alternative to the typical fare at Westgate.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x7uiR4x0ZlK6SIQDz3S9OQ"
  },
  "Tl0_TL-LhWKkvnTWw1c9Uw": {
    "date": "3/15/2018",
    "text": "40 minutes to \"cook\" a salad? \"It will be about twenty minutes\", the guy said. That's okay. They were clearly busy.  Forty minutes later -- still no food, and time for us to leave for the hockey game when, the food arrives!  My pork souvlaki pita had three small nuggets of pork inside. It was less meat than a small hotdog, and with a black, bitter, and hard exterior. I think I cracked a filling. It sure hurt when I bit down. I regret going to this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wlSfqLctqyEK-TaHhEyvXA"
  },
  "sua4Gt29w1jmBTfWDAIHAg": {
    "date": "1/3/2016",
    "text": "Was in town again for the SEA vs AZ game and had to stop by here again. Still amazing food and even better service just like last year. The owner is so down to earth and friendly, you'll even see him cleaning tables when it's busy and I really respect that .Tried their baklava cheesecake this time and it was heaven !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jWSGQwWn1ApgzkyCTGzZHA",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. baklava cheesecake oh my! must try!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jWSGQwWn1ApgzkyCTGzZHA/o.jpg"
      }
    ],
    "user_id": "Oi0G3jFm2jtG2W02dZTdEQ"
  },
  "b93VDiTzRg69Vd-xoDQufQ": {
    "date": "10/17/2015",
    "text": "Let me preface this rating by saying, my husband loved his food.  He ordered the chicken souvlaki meal, with an extra shrimp skewer on the side.  He devoured his lunch, and totally enjoyed everything on his plate.  We started with the roasted garlic hummus, which was also quite tasty.  It was served along with warm pita points, and was a delightful way to start the meal.  Now, for me...I ordered the gyro with a Greek salad side.  I don't like onions on it, so I said no onions.  I had no idea they dumped a whole bunch of shredded lettuce on it, as well.  Oh well, that can be taken off.  Also, the pita is served flat, so when I folded it, the hard corner cracked a bit.  Not too much of an issue, I can deal with that.  However, I cannot deal with the oil that oozed out of the gyro continuously.  I'd take a bite, and it would squirt out all over my hand or shirt or table...lovely.  The gyro itself was meh...bland meat, sorta hard (and cracked) pita, tasteless tzatziki and lots of oil.  The only decent thing on it were the diced tomatoes, they tasted pretty good.  The Greek salad was also quite bland.  At first, I didn't think there was any dressing on it, then I realized...surprise, it was an oily light dressing.  Really, not what I was expecting.  Will I be back, probably not.  I told my hubby, he can go there when I'm not joining him for a meal.  And, by the way, I do love Greek food.  My thing is, when I go to a new Greek restaurant (or one I've never been to), I always get the gyro, since it's how I gauge whether I'm coming back, or not.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "y5Ak9VZeYWjaX52lb1hjXQ"
  },
  "t9vqH88fmPOzxFg9satLkQ": {
    "date": "7/26/2018",
    "text": "Great location and outdoor eating was nice with live music in the square and a mister. The business model is excellent. You bring your order to the counter, get your own beverages, find your own seat and they use metal tray with parchment so not a lot of dishes to wash. The environment is hip and brings a good vibe to the place without them having to do anything but be there. You would think they could get the rest of what they do right.   1. I chose my drink and brought it and my order to the front. The young man asked if we knew what we'd like . I said yes and asked a question about a menu item I did not see in the menu that had been recommended.  I looked up and he was gone however.  He returned and... did the same thing again.  Only this time,he took the beer bottle out of my hbd first and set it behind the register. We were baffled.  So rude and inconsiderate to just walk away both times.  We weren't dallying.  There was a line forming. Finally a girl took our order, rang us up and asked about drinks.  I pointed to my beer and Houdini reappeared and said, \"oh, is that yours, it was just sitting there, I was like who's is that?  (!?  Really !?  Nothing like putting an exclamation point on our perceived invisibility.  He took it from in front of my hand)   2. We sat and received a piece of cheesecake and one entree.  I flagged down a runner, then another to ask if they knew we still had a salad coming.  They brought me a salad, lay it in front of me and I asked if it was the melon salad.  I was told it was Caesar ?!  He took it and ran around the restaurant a few more times with it.  Five minutes later another runner said are you waiting on a salad? And laid down the very same salad in front of me.  I don't know whose it was but it visited several tables b4 u got it.  I told them I was waiting on the melon salad. He beer was gone, my friend had eaten his meal, the cheesecake was melting and covered in flies. Finally, after another 10 minutes went by and the cheesecake was inedible. I received my salad. 3. This was not a good salad. I don't know if they rushed it.  I don't know how many people had touched or become acquainted with it, or if it had originally had some feta or flavor that someone ate.  It was watermelon, tomato and cucumber with fresh ( but not at all flavor-filled) oregano and a sprinkle of feta with a weak balsamic on top.  The predominant flavor was cucumber.  Is that even a flavor? .  It looked pretty though.  It came with a mass of gyro meat.  That was tasty.   All in all, it was a good meal because the environment and the company. It could have bee  Update: adding insult to injury - owner offers to remake the bland salad but says nothing of the way we were ignored and treated as if we didn't matter or exist three times by his first line employee, nor the delivery If food plates rotating between tables before being served to proper customers .  Those are your big issues.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QPScs1-5AQvxHRLKP0DWBQ"
  },
  "BkV_AE7yGBUPbC3EMc6c9A": {
    "date": "3/8/2018",
    "text": "The food is awesome here. We love coming here for the great food,  the friendly staff and the cozy atmosphere.  Kuddos to the awesome workers. Jey, Savanah, Daemon and Alan are all top notch. They give excellent service, and are always genuine. They truly go over the top to take care of you. Did I mention that the food is awesome?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NGvknAc44QPUuBJun7D02w"
  },
  "iabHm196XDUoCdqQhruVRQ": {
    "date": "8/7/2018",
    "text": "Nicole and Luis were very helpful and friendly. They delivered exceptional service and the food was great. We had the cilantro jalepeno hummus and the margarita pizza that was delicious",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fp_2D7wwLXrIyjLGz4Iw0A"
  },
  "F-DYslgE1evTX9lyYZFozA": {
    "date": "7/8/2018",
    "text": "So at like 858pm I say hang on I left my wallet in my car and when I come back at like 9:03 you say sorry we're closed??? Weaksauce",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aOLe2WOrBfcCLlHMWVYA_Q"
  },
  "lmc9PQg3IWP4nSkh6bdDyg": {
    "date": "9/20/2015",
    "text": "Came early before the cardinals game. Whooooo. Go team. Anyways. We wanted some small and healthy. So we saw this place. its new at westgate, why not try it. We sat on the patio. It was so nice out. I ordered the hummus. Ohhh man..the hummus though!!! I got the three hummus appetizer, Tomato garlic, cilantro and spicy. Dipped with cucumbers instead of the pita bread. It was wonderful. My friend ordered a steak gyro with fries on the side, He enjoyed his meal.  The service was wonderful. Great staff.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "xdVIe4jFkRzFzxfLfgksOA",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xdVIe4jFkRzFzxfLfgksOA/o.jpg"
      }
    ],
    "user_id": "D2ljL5ejuqpa4f8fnZ1qjw"
  },
  "njvm4CSinU-oi1-_e36j1w": {
    "date": "2/26/2018",
    "text": "This is our go to restaurant for a quick bite! The staff is very friendly! The Philly gyro pita is amazing.... we get it EVERY time. Today we had the pleasure of meeting Jey. He is very entertaining, he gave off such positive energy. He went out of his way to serve us and made our day. We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9MFmZUw1IoRMN9Iy2Kgn4w"
  },
  "Ch9JPPPHFlNRktFAlngiPA": {
    "date": "8/22/2018",
    "text": "Greek salad was really a \"Greek Salad.\" Two olives, one jalapeno pepper, and a whole bunch of lettuce, with a creamy dressing that more resembles a Caesar dressing. Salad didn't come with a side of pita, as promised, and side of avocado was a couple of thin slices.  A purported Greek restaurant should learn how to make a Greek salad.  Whole bunch of meh.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "se8uYXzX27THddHagNmhKA"
  },
  "w5JI2ervFuVuKQ12nPRK3g": {
    "date": "2/17/2019",
    "text": "The food is great but the people are terrible. You're not going to find better Greek food around here but it's best to go to the one in arrowhead. People working at westgate don't have any basic manners when answering a phone and can't do an order correct to save their lives. I've done food industry before and I gotta wonder why they're always a mess.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-ssB6maBrgh3ct4R-J7p9w"
  },
  "U4i7raaizYuujhKgcUFpcQ": {
    "date": "1/22/2019",
    "text": "Love the place.. normally would order for take out. The chicken salads are pretty expensive but their servings are big... you will always have an extra left overs for the next day. Staff are friendly and service is fast......",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "da2tL047qsj1bmW-PAo7BA"
  },
  "v3AKr-ie7Xy_ebnZOiDCww": {
    "date": "12/28/2018",
    "text": "The service was awful. Its very disorganized. The wings were okay but the  meatballs were delicious. We waited for a gyro plate for 30 minutes while the chef was standing behind the ordering station with nothing to do.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "l7pSbDJLP5xN1vXn3In-nA"
  },
  "6LQOgS-96_hlVk0mvRPNPw": {
    "date": "3/30/2019",
    "text": "Great service especially on a busy concert night. They bused the tables fast and made sure everyone got seats even though the line was out the door. They also reimburse the $10 parking fee and was on the list of restaurants to do this. Great food selection and they serve alcoholic beverages. Would definitely come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a99O1sL9tQkd3HUfBhoYQw"
  },
  "2hBOKUfOQKk_N7ld_1Ksrg": {
    "date": "9/30/2018",
    "text": "Delish fresh and fast.. We had the the ops combo and Greek salad We loved everything..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MbcY0Q09lHCBDtfaxQ0Oww"
  },
  "3Xn9JRDDa23AgBkqsxflug": {
    "date": "7/30/2018",
    "text": "I ordered take out at this restaurant and I'm so happy I did! I ordered the chicken shawarma with vegetables and it was really good/light.It was still enough food to make it into two meals. So thats what I did. I would like to come in and eat one day and check out some other things on the menu. Thanks!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "cOhUlRrdLfrI60x6rcVQDA"
  },
  "Igc1hDt40HQZQP2LbwgFyw": {
    "date": "6/27/2018",
    "text": "Good spot for a gyro! I had the gyro wrap with salad and it was pretty damn good. Nice location nestled is Westgate Entertainment District with some great people watching. Perfect place for lunch and good for a quick dinner if your in a hurry to grab a drink at the many bars in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "X59pYBF0E3lRYi_ZspIaeQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/X59pYBF0E3lRYi_ZspIaeQ/o.jpg"
      }
    ],
    "user_id": "0BDWBFfJZia6itpV__B1bg"
  },
  "FCrY7uMm_PkDGPN5l-24jg": {
    "date": "11/13/2017",
    "text": "We stopped here after the Seahawks game to get a bite to eat and wait out the traffic. Honestly, we arrived here by accident. We just kept walking until we found a place with a line that wasn't ridiculously long.  We are SO GLAD WE DID!!   The service was friendly and engaging and the food was EXCELLENT!! The cilantro hummus with cucumbers subbed for pita bread was fresh and flavorful. And the desserts.... OH MY!!! I ate the entire thing, even when I was full because I could not bare to leave a bite on the table.  I'd love to try more courses!  PLEASE OPEN ONE IN GILBERT!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "EatWJJWAIMtANS5gofkuvQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EatWJJWAIMtANS5gofkuvQ/o.jpg"
      },
      {
        "img_id": "cCfxr_Ca-QWVWjjrGVILZQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cCfxr_Ca-QWVWjjrGVILZQ/o.jpg"
      },
      {
        "img_id": "1EtlnOyWJp-mwPYfv0OrMw",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1EtlnOyWJp-mwPYfv0OrMw/o.jpg"
      }
    ],
    "user_id": "Isf8G6HPbNqEisKDjmUlbw"
  },
  "iJG08CSjzrKlqJgzQHnLhw": {
    "date": "2/2/2018",
    "text": "Nice little Cafe, they have a nice outdoor patio to sit on which was perfect today! No waiters, you order at the counter and they bring the food out to you. They forgot to bring out one of our items but we were full and they gave us a cash refund and apologized so no biggie!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xclE2za5Dp6E5V0IjXpK1Q"
  },
  "DClbyWjL4s8q5qWUZTorrQ": {
    "date": "3/13/2019",
    "text": "Stopped in with our family of seven, for lunch. Everything was phenomenal. The Greek fries are so delicious. And all the wraps we tried we loved. My husband had the Greek salad and enjoyed that as well. We live in Kentucky and wish we this restaurant here!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k2y8yRc2LBz7pFUmi3zy1g"
  },
  "Y7l7gL55avYFpVzclPqZ9A": {
    "date": "3/7/2019",
    "text": "First time eating here and the food was excellent! I had the chicken souvlaki which came with 2 skewers of tender chicken, rice, salad, and pita bread. Pitas were toasted and soft! Kind of upset they don't have one closer! Def will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YFdfkKjzQhjaqa8otIKvtA"
  },
  "ka-Bvd5ek3ncE_Cy_1cajQ": {
    "date": "5/22/2018",
    "text": "This place is super cool. You have the choice of sitting inside or outside. The food was really good quality and really good. The staff were friendly and fun with good personalities and super accommodating. I will definitely be returning. May have found my new favorite place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "sbBVm_iQWIyufYq39Ncnbg",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sbBVm_iQWIyufYq39Ncnbg/o.jpg"
      }
    ],
    "user_id": "kWDdtVEnmvAHzCxSbb75Nw"
  },
  "Y-nB47NiS9rqnKNbYyrTNg": {
    "date": "11/26/2016",
    "text": "I misjudged Opa Life Greek Cafe. The restaurants around Westgate tend to be either really good or simply manage to exist due to foot traffic. On our way to a Coyotes game, my friend suggested Greek for dinner. I knew exactly where he was suggesting. Opa Life has been at Westgate for more than a year and I've walked past it several times. What a mistake!  There was a long line to the door (and it was out the door by the time we ordered) but again, it was game night. Hindsight tells me that those in line were not there by accident. In a word, Opa Life Greek Cafe is outstanding!  Once again, my usual Gyro Plate was selected to compare the cuisine. This is the best gyro meat I've had, period. It's tender and it's seasoned well. For the money, I've never had such a generous portion either. But I didn't have to force myself to eat a single bite because it was so good! My only criticism would be with the amount of bell pepper on my Greek salad, but this is a minor quibble.  Not only are the plates loaded with flavor, but the presentation was really nice for a casual restaurant. Speaking of casual, the atmosphere of Opa Life is perfect. The indoor and outdoor spaces blend together when the doors are opened.  In the future, whether I'm headed to a movie or a hockey game, I'm going to have a tough time walking past Opa Life again. In fact, I'm going to have to seek out their other location in the East Valley. Thanks!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jT29qyjmNHDm0QNvKZZZqQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. My very filling and tasty Patstitsio with rice and veggies",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jT29qyjmNHDm0QNvKZZZqQ/o.jpg"
      },
      {
        "img_id": "Hg6f2sAbEQ7FrrfHrHvTFw",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. My delicious Falafel Pita (it&amp;#39;s under there) and amazing Greek Fries!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Hg6f2sAbEQ7FrrfHrHvTFw/o.jpg"
      },
      {
        "img_id": "5eahry9c0smg-lJX1lXtlQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. My amazingly delicious and generous Gyro Plate",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5eahry9c0smg-lJX1lXtlQ/o.jpg"
      }
    ],
    "user_id": "OZErOKA1RaH2J6flZhU-zA"
  },
  "cSGPOtt03FspS7mDmvvbMA": {
    "date": "8/16/2018",
    "text": "Take it from a Greek from Chicago where there are Greek restaurants everywhere... Awesome Greek food, nice atmosphere & super polite employees! Can't wait to go again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qlWK1_2xZmI4bNnC8hj2oQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Chicken kabobs",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qlWK1_2xZmI4bNnC8hj2oQ/o.jpg"
      },
      {
        "img_id": "8eLfba7LQl1eomLCyKtioQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. 12 ounces of Gyro meat on the platter.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8eLfba7LQl1eomLCyKtioQ/o.jpg"
      }
    ],
    "user_id": "sU-7I1GcI3cE9s6AToKJXg"
  },
  "vdu0oZGV3y3OGy-jlZiJ6g": {
    "date": "4/7/2018",
    "text": "Sigh, Westgate continues to disappoint and no one cares at any of the restaurants that works at any of them.  Came here for a quick bite after a coyote game, bought a beer and chicken pita.   1. Hair in my pita, no one cared 2. Asked for taziki... No one cared 3. Ordered a beer, it didn't come with my order... I asked for my beer from the cashier \"are you sure they didn't bring it?\" Some dude was too busy talking on his cell phone to fill the glass all the way, I got 3/4's of a beer Just don't eat anywhere at Westgate... No one cares about what they serve you",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "7Pepshhi_0_gzMS-LzOQ9w"
  },
  "kIxsiJM-BCJpPTsQBbvNWA": {
    "date": "2/10/2019",
    "text": "I moved here a year ago. This is my favorite place and have spent over 400 dollars here. The service has gone down some with getting orders completely wrong the last few times and messing up on giving me points after my visit. Fixing the listening skills would make it up to five stars for me for sure!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FOnKLAAjEEP6lLD8t3yi_g"
  },
  "sKH6S0seKIpXaOg9qDVYIg": {
    "date": "2/9/2019",
    "text": "Ordered take out from here. Hummus and pita bread was super good. Dolmathes were okay but a little dry. I would eat here again",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tEOHL3i8ELgSP80gulU1hg"
  },
  "jRZYcFhXC-W-a6y082GD1g": {
    "date": "8/18/2016",
    "text": "I gave them 4 stars because their service was excellent!But the food was honestly a disappointment to me. First off, Greek food was suppose to be unique and different but honestly it tastes like any other restaurants to me.  I got their Greek burger and the patty itself tasted so bland. The buns were soggy and the burger itself was really hard to eat... I'm not going to lie... Their lamb though was very delicious and tender. Love the lamb! Took a few bites from my friend balsamic vinaigrette wrap and the chicken was dry, the wrap didn't really have a \"Greek\" taste to it... Just tasted like a wrap where you can get at Safeway or something. Greek fries was alright. It was too saucy....To sum it up, the food was alright. I would definitely come back once a while... This wouldn't be my favorite down to earth place. Will definitely try a different dish next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "m-naW_fb3-5T_3fRnuBHLg",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Greek Burger &amp;amp; Balsamic Vinaigrette Chicken Wrap",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/m-naW_fb3-5T_3fRnuBHLg/o.jpg"
      }
    ],
    "user_id": "5G7dOTrKQrbyFG8fpBnx7g"
  },
  "BDi8RgUt0PTyPb234SeyFw": {
    "date": "3/23/2018",
    "text": "Stopped to eat and feed my cravings for Humus!!! Ordered the trio: original, garlic and SW chipotle. All we excellent except the SW chipotle, for me personally it left a woodsy weird after taste that I couldn't get past. Had the club gyro and that was beyond excellent!!!! Will definitely eat here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1NE0bTXZW00LkuACBANjDw"
  },
  "NoLL7bD6ywvB8fKWHlX3Ew": {
    "date": "8/2/2015",
    "text": "Me and my Family had the pleasure of eating at this restaurant. It was our first time and we all enjoyed the food, Service, and atmosphere.   A very friendly gentleman by the name of Allen came to our table and introduced himself. He went through the menu and let us know what he recommended. I thought that was very nice of him.  Throughout our meal he came cover multiple times and made sure everything was ok and the food was to our liking..  Overall we received great customer service and I recommend the hummus bar with pita chips, Greek fries (delicious),Chicken Caesar wrap was so good, Lamb Souvlaki, Greek salad.... I could go on... You will not be disappointed..  We will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "eYYMmb7y_-B0CoLbwO9Ktw"
  },
  "2N29j0maMQuY9mz4hlr3ig": {
    "date": "5/18/2017",
    "text": "Best hummus of my life!!! Have you ever had food so good that it prompted you to create a Yelp account and comment on it? Oppa Greek life did that for me! I just had their hummus Trio of traditional, roasted garlic, and sun-dried tomato. I also had their California Specialty Pita. All the food was fresh, delicious, and clearly well-made! I Love it here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vWnavbzHZUL2amxEKNY9_Q"
  },
  "pflE9pLPwwx2Yg6DQx-zKw": {
    "date": "7/11/2015",
    "text": "Amazing. The line wasn't long. The place was clean. My food came out in a timely manner and the staff was friendly. I thought the prices was a little expensive but when the food came the portion was huge. Definitely the best salad you can get on the west side in Glendale!! Would returns and recommend others try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "p5nc90UDx5I0RbCXzJCwAA",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Greek Salmon Salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/p5nc90UDx5I0RbCXzJCwAA/o.jpg"
      }
    ],
    "user_id": "LOOhAT20qNcQ1-YmeOju9Q"
  },
  "9-2E1BfxYVnPprJy-ev2pg": {
    "date": "7/31/2015",
    "text": "Decent place at a decent price. Not a lot of options for people who only eat seafood, but what can I say, it's Greek!  Atmosphere was ok, not real cozy or quaint.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PnT4DYsQKyQWEq3MLrC5-Q",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Fire in the rain...in July...in Arizona. #heaven!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PnT4DYsQKyQWEq3MLrC5-Q/o.jpg"
      }
    ],
    "user_id": "kbpHdHxj6gMyORtinJgTSA"
  },
  "If7ZhbV4VRyRLkr8i3H3Xw": {
    "date": "6/11/2015",
    "text": "This establishment has absolutely wonderful food and very friendly staff. I ordered a chicken caesar wrap with a greek salad on the side. Both items were very very delicious and fresh in flavor and ingredients. I would highly recommend this restaurant to anyone in search of delicious Greek food at a reasonable price. I love the new happy hour menu too. What a great spot to stop before the movies or a sporting event. I will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dkdmeOdvXcW1Oq_0c_wuTQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Opa Life!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dkdmeOdvXcW1Oq_0c_wuTQ/o.jpg"
      }
    ],
    "user_id": "FZ9DWbsa-Zz-Cln7ii5aJQ"
  },
  "aFsEJ3rlLFWhfy9Kf0eMQw": {
    "date": "1/27/2017",
    "text": "Worst Greek Restaurant Ive ever been to! How can u screw up a gyro? Well come to Opa Greek Cafe and find out! Who soaks there gyro meat in a vat of broth, this restaurant! Gyro came out soggy and bland... give up Opa Greek  Cafe Greek food ain't your thing!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oIRqXe8YTiqHQ6AoCztaKg"
  },
  "pz0omXLoYc7CvU8po93_qQ": {
    "date": "4/18/2017",
    "text": "Very impressive ! Food was fresh and very good!  Chicken was juicy and well cooked ! The sauce that was on the chicken was different but loved it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mtoWYldGmIH9l7mvIUuzyA"
  },
  "_oinJl4Q6gWsQDqNMjz_vw": {
    "date": "12/12/2016",
    "text": "Very delicious, price is reasonable, fresh ingredients and I highly recommend this place. They also have a location inside arrowhead mall at the food court :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U5y_e9k4u9G3t3uoG9e4Dg"
  },
  "zC99vDHoLe6z9h_vdxN8Gw": {
    "date": "2/21/2015",
    "text": "Location is amazing, it was empty for a while and was waiting for someone to take advantage of it. Decor and setup is great, especially the patio.   Food was decent, I had the Gyro and Greek salad. No complaints on the gyro, you should definitely give it a try. As far as the salad, it was good, but it didn't seem like a \"Greek\" salad, tasted more like a Ceasar with Kalamata olives and feta.   I also had a latte which wasn't too bad.   Baklava is great, by the way.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "r45g57yPyLTnx2tFL-6VuQ"
  },
  "tk259wT5SQbjQE4zbvRJtA": {
    "date": "1/17/2018",
    "text": "This is a fantastic Mediterranean restaurant at the Westgate. Awesome food, fresh and full of flavor: I had the Aegean Club and salad, nice work to the kitchen team. The entire staff was equally impressive, Jey and Damon were very personable and created a welcoming, fun environment for every customer. They also have ample indoor and outdoor patio seating to enjoy the year round AZ weather. Be sure to stop by, you won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3ux2Ney-TsL_SVVrENmn8A"
  },
  "u9RDM8Ik2_FWB5lp_eXqOw": {
    "date": "3/30/2017",
    "text": "Poor service I'm disappointed cause I drove all this way from Scottsdale in traffic to get a decent meal and I'm about to throw my whole order in the trash cause it's not nothing special to rant and rave about do not even waste your time coming here",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vD3j9qoiw7KCf6KCNG2Z9A"
  },
  "nSVd4gHkmO4NCim23DQZ2g": {
    "date": "3/12/2015",
    "text": "Came for lunch with a key client. My client was so offended by the Heavy Metal music playing. She mentioned it to the manager,  they laughed and turned it up. They said it's what they like to listen to.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Oi6TuBu6UE8hqPofrtvdPA"
  },
  "5dRzKrcXilikKMbBCV-4nA": {
    "date": "6/10/2015",
    "text": "The food looks and tastes amazing....so glad there is finally great food close by. Perfect pre movie dinner choice. The staff is friendly and welcoming.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IPTvyYnbQuEJRokt2XMSeg",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IPTvyYnbQuEJRokt2XMSeg/o.jpg"
      }
    ],
    "user_id": "85VvXKa6sL56hi73JfFIHA"
  },
  "ToSn8p7nTRjkaWzAnOltOQ": {
    "date": "7/30/2016",
    "text": "Allan is the best and the service has gotten better since my original review! Thanks so much!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "i0lX_ATjnhoyn_0AahpKyw"
  },
  "2AClmZII8aHLBYNQlTxdnQ": {
    "date": "10/24/2017",
    "text": "This place is so good. I'm back for the second day in a row. I will miss it when I go home. The Greek salad is really fresh and the souvlaki is very flavorful. The portions are gigantic, so order sides if you're not a big eater.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oDX3BCPNAd8NtiwmScMg2w"
  },
  "ymxEqepQBQG0trbjvgJYGg": {
    "date": "12/28/2014",
    "text": "I love greek food and this place definitely satisfied my craving! Everything came out quick and had great flavor. I loved the Merlot too, one of the best I've had. The patio is beautiful and has a beautiful fire pit & nice heaters to keep you warm in the winter. I will definitely give this restaurant more business.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Cq9VSUkrtHRt6_BBQlghBA",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Chicken souvlaki (sp?) REALLY good",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Cq9VSUkrtHRt6_BBQlghBA/o.jpg"
      },
      {
        "img_id": "f4uN1ICDeUS94UsN1ipFHw",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Chicken wrap with greek fries was so good.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/f4uN1ICDeUS94UsN1ipFHw/o.jpg"
      },
      {
        "img_id": "u3pu6Jnyr1i9uyCoz0JqMA",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Chicken wrap with greek fries. So good!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/u3pu6Jnyr1i9uyCoz0JqMA/o.jpg"
      }
    ],
    "user_id": "-szffXRDPunwOj4oJsLP8w"
  },
  "LpS0da7CG6M0tzpZtTR1wQ": {
    "date": "4/18/2015",
    "text": "Very nice place . Had a diner with my husband and mom. Food is very delicious. Big portions. Lots of varieties burgers, pitas wraps, pizzas. Owner is very friendly guy. The only minus was I was to full to try any of tasty looking deserts. Definitely will be back and recommend to all my friends. Big plus nice roomy place to sit outside.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UpIB1uL7x33cMofvDrLphQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Humus trio. Pretty good, little to spicy for my taste",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UpIB1uL7x33cMofvDrLphQ/o.jpg"
      }
    ],
    "user_id": "FeYZmcyGJQAWZVMIL77azQ"
  },
  "3Fa3na6MiZPZGgjhXdiDFA": {
    "date": "10/31/2017",
    "text": "OPA is the only restaurant open at Westgate early. All the other restaurants don't open until 11am. We were in the mood for mimosas and good food! We got just that...I ordered the salmon wrap with my lemon Dijon on the side (I like to identify how much I want on my sandwich) and Greek fries! It was excellent!!!! My mom got the chicken wrap and salad which she loved!!! My sister got the make your own omelet and hash browns. Our stomachs were full with some to take home because their portion sizes are plentiful! If you haven't stopped in there you need to! We will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "85hdryxB5oct0UJwRWnUWw"
  },
  "RJQFXXbOx-pskVA6wCwnvw": {
    "date": "9/29/2016",
    "text": "Delicious food and really pleasant/helpful staff. I am half Greek so my stadards for Greek food are pretty high. I ordered the meatball appetizer (Keftedes) and a side of veggies. I ordered my food to go but shortly after leaving I realized the meatballs were not how my grandmother makes them (in red sauce) so I went back in to ask for sauce. They only had pizza sauce but it was actually really delcious. Makes me want to go back and eat their pizza. Probably seemed like a strange request but the staff was really nice about it and gave me a generous portion which made a world of difference with the meatballs. Really enjoyed them. Very flavorful and juicy. The veggies were really good too (added some sauce on them as well.) I work close by and with not many options in the area its nice to have a place to get good quality food at a decent price. A little over $10 for both things.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WuNd1-hj2C5Ll0_6mHNsqA"
  },
  "d8-NkaBsx6RYO59u_yW5LQ": {
    "date": "10/11/2017",
    "text": "I came to this place before and I thought the gyro was really good. I just ordered on Uber eats the same gyro I got last time and it honestly wasn't the same. There was too much lettuce and not enough onion at all! everything just tasted different than before. I honestly think they rushed to get my order to Uber so that could be it. At the restaurant it was great! Even the salad, as for ordering it to go through Uber eats it's eh",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NfCWhcsbUCnWwAzHNVJ_ew"
  },
  "x4KcaACah3OI6_3_mLePjw": {
    "date": "2/13/2016",
    "text": "Started out trying this place because of a Groupon.  Now this is my go to place.  The greek fries are AWESOME.  The chicken Souvlaki is delicious,  The Greek salad is fresh and delicious.  My daughter loves it too.    For her and I to eat, we average about $25.00 a meal.  Not bad at all!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "KLi21Zq1i_PXB6L-s0uoRg"
  },
  "sqfuatPx81gDKPcdES64Dw": {
    "date": "3/20/2016",
    "text": "Delicious! Everything I had to include the cheese cake was incredible. Greek fries are a must have.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EXGXQxRG6hM-aFyDXZUQOQ"
  },
  "4dLef1_Zi-zVzCyEIWExFQ": {
    "date": "10/31/2016",
    "text": "Horrible service. The people were rude and I waited forever for my food even though the place was empty. And the tables were all sticky.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9aXaAk1gXswS0iicHeK6YQ"
  },
  "ERBHomZIhDR7gHeOpgTXwQ": {
    "date": "10/3/2015",
    "text": "Very uneven experience: their \"fast casual\" style failed me because I ordered lamb souvlaki. It took nearly half an hour to arrive at our table.   Perhaps that's because we had to move from the first table we chose. It sat right under their extremely noisy air conditioner. The service staff largely ignored our concerns about our food delays until we got the owner's attention. Even then they delivered some delicious Greek-style fries that we hadn't ordered, and needed to be reminded twice to bring us the baklavas which we had.   The quality of the lamb was superb, and so was the seasoning. The baklava was loaded with Saigon cinnamon, which I loved but my wife did not. The salad was blandly ordinary, as was most everything else, including my wife's rice and chicken souvlaki. And what kind of a \"Greek\" restaurant doesn't have moussaka or pastitsio on their menu? Their prices are at least 10% higher than they should be. Smaller portion sizes might let them drop them to a more suitable level.   I guess we won't be going back any time soon...",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "JzK0sxZHyc2xP_ZVY-GJ1g"
  },
  "bD4IJLRGecDWwEP-93cNig": {
    "date": "2/26/2018",
    "text": "We had such a great time at lunch. The food was so delicious and the serve was absolutely amazing. Our server Jey was so upbeat and entertaining. He can instantly put you in a good mood! The location is great too. We sat outside near the fire pit and it is so relaxing. I would definitely recommend coming here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TrLbcQLgjJrk0WMzLeL8UQ"
  },
  "bHVUn8ONWARZJ9DpMGpXmQ": {
    "date": "4/30/2017",
    "text": "Great food great service. We all enjoyed it and when it comes to Greek food who knows it better then someone who has lived in Greece many years",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h3ZhiBfhjyO4oIe1Zqxj3A"
  },
  "mVplN7ZWQIqHEo4Uw6fMgg": {
    "date": "8/23/2015",
    "text": "Came early to grab some grub before the T.Swift concert!!  Yardhouse was a 1-1/2 wait!  So the girls decided to walk around and saw this place was buzzing but still had tables.  I ordered the pesto chicken pita with fries...  YUM!!!  And we shared an Opa Life Combo for appetizers:  Spanikopita, Tzatziki, Hummus, Dolmathes & Keftedes.  I have to say, it was GOOD Greek food!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "iDlkZO2iILS8Jwfdy7DP9A"
  },
  "dVqnzVFtevlMAz4nx6h-dQ": {
    "date": "10/20/2015",
    "text": "Oh wow. To preface this, my wife doesn't like eggs, so we never really buy breakfast foods. Lunch/dinner menus need only apply.  Stopped in over the weekend craving Greek. I walked in as they were opening in the morning. I felt awkward asking, and (while I don't think it's protocol) they were accommodating, and cooked up both a Chicken Caesar & Opa Chicken wrap.  My wife enjoyed her side salad, but I just LOVED the Greek fries! We also shared a slice of their pumpkin cheesecake. We shall return, but hopefully after breakfast. :)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "DE2DnU6NeaIAdy2pDrtyuw"
  },
  "5Q6CRe13LzhEsNOLOvyJNA": {
    "date": "8/26/2015",
    "text": "Stopped in here for a lunch meeting with clients. Had never been here before and wasn't sure what to expect. Menu signs when you walk in a little awkward to view unless your 6'4\". Very high and not a lot of room in line to try and see them.   Ordered the gyro wrap and it was good. I did not expect that it wasn't in the normal gyro bread but just a soft tortilla shell. The loaded frys that came with it were amazing. Always get the house frys that will come with feta cheese and a dressing that will make your taste buds jump.  Service was fast and the place was very clean. Would try this location again just to see what else those frys will go good with.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "qUTYpYF7THkVl2LsptqSdQ"
  },
  "pfQF3GhGwu-hPcoPRifE0A": {
    "date": "8/14/2017",
    "text": "Everything is extremely good.....fresh and fantastic! Fast and  friendly staff! Come enjoy. Very good portion sizes. The hummus lacked garlic and lemon and had a fermented flavor. The pita bread is wonderfully soft. The gyro meat was soft and flavorful; very nice. The greens are fresh, cool and crisp. The service was outstanding!! Very Nice!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VKxFNu7GQXCpw2pQeWobnA"
  },
  "DUbKPvfOXioV-EhYC9znig": {
    "date": "3/27/2016",
    "text": "Went there expecting nothing after a dismal experience at Kabuki Japanese Sushi and I can honestly say the food was great if not a little pricey. The owner was there and was pleasant to speak to. Not many places who serve Stella Artois use or even have the official Stella glass,but they do so that was a great bonus.  If you're looking for excellent Greek cuisine and a great selection of beers, look no further.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-hE8tysL4iN_BQ_wSnRBOA"
  },
  "JXUgXrv7j7ddItL-Us7_Yw": {
    "date": "1/6/2018",
    "text": "Superb food! Outstanding service! Incredible atmosphere!! Best place to eat at before heading to the yotes game. We drove five hours from SoCal, and found this gem before going to the game and we were not disappointed. Can not wait to return! Definitely worth the drive. Keep up the great work, Opa Life! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UrOKm1Th2oBuG_gbC-oFjQ"
  },
  "UvNYff3xln4jIf9WEqqk4Q": {
    "date": "2/1/2018",
    "text": "Best Greek food ever!  The pizza is amazing.  Always a good vibe.  Food is so fresh And wait time is short. It's a little on the pricey side but worth every penny. If I could eat here every day I would!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KL-PyVx0y37oDn7fxw4_HA"
  },
  "Bne1IjMEnMnMHY21PV8Xug": {
    "date": "10/31/2016",
    "text": "Microwaving the Gyro meat is totally unacceptable. The meat was dry and tough but did have a nice flavor. What a shame.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8vFdPfwvSrRriEzuRHLQDg"
  },
  "7GbnGBjPJWW2-5w6dRXOiw": {
    "date": "6/5/2017",
    "text": "Food was delicious bit pricey but think it's norm for area. Enjoyed the live Greek music too...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4yCUuJrYtk69bg1jm6sc6A"
  },
  "oAQs5FCKXS0R7Yl_yIpK_g": {
    "date": "9/13/2016",
    "text": "I've had OPA life in arrowhead and I've loved it! I came to the one in Westgate and it was super confusing. The girl who helped us was super rude! I asked her for the menu and she pointed near the door and told me to go get one... And she was just being super mean. She needs to get a new job because clearly she hates this one. The food was good but I hated my experience because of the bad customer service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "6jgEdDFTxUj37MGhWAIHtg"
  },
  "FiusaiSrd5xC5X_TzL53zA": {
    "date": "6/2/2017",
    "text": "Food is fresh, they give you a salad with your Greek wrap and the food is very delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kHbjQLldeVSSSpfZlHoI4A"
  },
  "bOw_SLMrWVVVTycovx9Hkg": {
    "date": "9/10/2015",
    "text": "I just tried this place this past Sunday with a friend and it was pretty awesome. I got a caprice pita. Very yummy. And with that I got Greek fries. OMG. So good. Probably my favorite way to have French fries now. Very friendly service too. Very pleased and happy I went there. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "t1I3LLMuwz1ytLXw88PFPQ"
  },
  "YMqR-NeFgsZR-GBVjc7DKg": {
    "date": "8/3/2016",
    "text": "Came here after Westgate Wednesday and paid $70 for some appetizers and a salad. The food was good, but over priced and overrated.  I would've given more stars except our food came in to-go boxes and a bag. When we approached the counter to ask for plates, they gave us empty to-go boxes and said that since we didn't order a meal, our food had to come in boxes. We looked around and saw plenty of people with appetizers on plates. It would've been ok if it was a mistake. We just wanted some plates to eat with. Then we felt rushed bc the employees kept coming to our table to take our napkins and ask us if we were done. The people were nice and welcoming at first, but some how the sevice just got worse the longer we were there. Don't think we will be coming back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "0-XmOBWLSlkSMtwzcN6Fpg"
  },
  "7Il3eonFXW67-fVsTOxCtA": {
    "date": "4/2/2017",
    "text": "Solid 4 stars. Fresh authentic food, great service. Try Greek salad and pork souvlaki!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CUCM9zWgoDkSVfk1v7zCuQ"
  },
  "uv6vul38_JmCmCJ-l5ybcA": {
    "date": "6/28/2019",
    "text": "I love the food better than Pitta Jungle is more authentic, tasteful and the atmosphere is beautiful especially when you can sit outside.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Dae4gB7flkPKGfmEusysww"
  },
  "lG1f0Snn8gXC-f0xWf9dIA": {
    "date": "7/4/2019",
    "text": "Manager was very rude, almost prevented us from sitting at a table if we didn't have enough people. Furthermore, while having a menu at the table prior, comes over and glares at us as he removes it from the table while we're sitting there. Also, ordered dessert first time through, had to re-go through the line in order to reorder the dessert and wait for it to come to us again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fcLbYqwD0ezDJ5Q654pLrQ"
  },
  "OD1fsCFbA2BcLKgZy1irHg": {
    "date": "3/9/2018",
    "text": "This is the place to go before a Coyotes game at the Gila River arena.  The food here is consistently good and the staff has been always friendly.  For appetizers you can't miss the Greek Fries and Saganaki.  Our go-to meal here is the Chicken Souvlaki, veggies and rice. They obviously get busy before a Coyotes or Cardinals, so their menu is reduced on game days.  The Saganaki isn't available on those days, among other items.  Also, on days they have car shows at the entertainment district, you have a great view from Opa Life. On cooler dessert evenings, it's great to sit outside by their fire-pit and have a beer and a decision dinner.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ohG8VYPw5ywXpsMBKiXmLg",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Chicken Souvlaki, mixed veggies and rice!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ohG8VYPw5ywXpsMBKiXmLg/o.jpg"
      },
      {
        "img_id": "aXNcXxxHCMt1zBPyp7o17A",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aXNcXxxHCMt1zBPyp7o17A/o.jpg"
      }
    ],
    "user_id": "TA5hCCI0YvDwuVmjjk2k1g"
  },
  "F9M6sSjwWn_OWnm8KjzhVg": {
    "date": "1/8/2019",
    "text": "If you are a greek food aficionado with a fetish for feta, you betta avoid this place.  If you're in a bind and can't find a decent purveyor of Mediterranean morsels, this place can satiate your palate with some hummus and a hefty handful of greek fries.   Want a gryo? You're outta luck, as the lamb makes me wanna scram (but most places do, so nothing new here). The chicken souvlaki isn't bad, and I love that baklava.  Overall, I'd order from this place again as it's got a comparable quality for its location.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "uGwWtiN3zScPUqIGwCMYVA"
  },
  "s_d0IdoizGD8jip1g0x-7Q": {
    "date": "7/7/2019",
    "text": "Best Greek food I've had!!!! Coming back today! I love their frys! They taste homemade. Their hummus is to die for and the flavors are ridiculously good! No joke! Can't wait to taste their amazing dishes again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XgEFR3J1t7M4tgVelf-xaA"
  },
  "ovY26xg__2fKiBAkz_b5Bw": {
    "date": "8/8/2019",
    "text": "Food is great and super easy before a game. I had the Greek chicken salad with chicken. Wine selection was good and I really liked the Cabernet I picked.  Hubby had grilled chicken sandwich. Both were very yummy and the fries were crispy and delicious. We topped it off with baklava cheesecake which is amazing. We will most definitely be back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hn9nmoWTFrtXdRfPDvvOxw"
  },
  "NDnfpafkNhvkA3hiwIEdkQ": {
    "date": "11/14/2018",
    "text": "I have been here several times and to their dinosaur themed location by The aquarium/Butterfly World. I have to say this place has pretty good food. Everything I have had has been fresh, well priced, and big portioned. The service is consistently great and friendly and everything is clean. Westgate can get a bit busy so table finding can be challenging on weekends or event days. Their desserts are crazy amazing. If you go get the Baklava Cheesecake which is off the charts good.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "dEk7mXM4npuDPmxrwPcEgQ"
  },
  "qtsuOEOqNx3qxuK7ZIIZZw": {
    "date": "3/9/2019",
    "text": "Love this place. Great food and the staff is great. Jay is so helpful and has a great personality. I will definitely come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "efsOAWIAfo3L974O_mpYsQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Patio. Great place to stay warm.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/efsOAWIAfo3L974O_mpYsQ/o.jpg"
      }
    ],
    "user_id": "96MtAwNoveHZJNH2c2mApw"
  },
  "SQ3TS0xGCg6eoE-Na6E1sw": {
    "date": "11/19/2018",
    "text": "My Favorite Greek Salad that always taste fresh and yummy everytime and the yummy soup to die for.. The Baklava cheese cake is very good my daughter loves it!!! I order to go here alot and my order is always on point...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ArmyQGyjKeaqt8hGU9Ncag"
  },
  "GpedsWMPyGI9CoRo5iDWKA": {
    "date": "6/5/2019",
    "text": "My co workers and I came here for lunch today, this was mine and my nurses first time visit here our other co worker recommended. The customer service was great, we were having a stressful day at work and Allen really helped with his great attitude. The food was delicious, I tried the Opa wings and Greek fries which I would recommend to anyone. The wings were crispy and saucy! Thanks Allen!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "taKoI6_AZ7rX7XEEOq7N7w"
  },
  "GKYV-foBhD3ybRXQOBgSXw": {
    "date": "12/30/2018",
    "text": "Went here with high expectations, ordered gyros and Fries. Fries were well seasoned and warm, however gyros tasted like it had been reheated and was very \"liquidy\" and not the regular char broiled taste.  Definitely did not taste fresh and cut off the spit.   Also today being Sunday, was supposed to be free for children.  Was never told the entrees were free for kids until after I ordered. Overall, below average poor experience.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Y_xeyKVXpEgwuxi-TezjA"
  },
  "WQpAwPqs8AcH8Noj80ewRw": {
    "date": "4/4/2019",
    "text": "Very disappointing meal tonight at Opa My husband and I moved in the neighborhood and we wanted to get to know the restaurants at WestGate because is like 4 minutes from are house, so tonight we choose to have some Greek food so Opa was on the menu. I got the Gyro plater with fries and veggies well it was disappointed the meat was cold and dry and the veggies wore the frozen veggies and had no flavor. My husband chicken from of the grill menu was ok I given them two stars because the baklava cheesecake was the only good think on that dinner that we spend 60$ on it. I don't think I will crave Opa anytime soon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "5GAlOV-WJ1i__XLhT4jUtw"
  },
  "swfLgaqeiXe2MtLJ4JXjSA": {
    "date": "5/22/2019",
    "text": "Great Experience.  Service was prompt. We had our food within 10 minutes.  It was hot and fresh.  We were a party of six for lunch.  The restaurant was open to the outside which was a plus.  The furnishings were in good condition and the place was clean.  We almost did not eat here based on past reviews.  Our group really sampled the menu.  The salmon was cooked perfectly and the Greek Dressing for the salads was amazing.  The soup, hummus, lamb and chicken were delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "57n9GF8FkO-DQcwNx0eufg"
  },
  "nw83C5Mr6Fy0z5Fcb3rUOg": {
    "date": "12/1/2018",
    "text": "I was visiting from California, and my mom took me here to get gyros, Greek fries and cheesecake to go for lunch. The cheesecake was baklava cheesecake which I have never tasted. It was amazing food and I highly recommend it. It was so cute. My mom said her and her boyfriend eat her all the time. They get the baklava cheesecake and a cannoli to go then take it home and save it for a movie night.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wR_RrmBxNXoN8WsEe-cFww"
  },
  "jyge4L6m-JS_KDEu1kUApw": {
    "date": "5/4/2019",
    "text": "The area was so beautiful, the food was so good I got the Philly gyro and salad and it was filling!! Would come here again for sure!! Right outside is a fun kids water area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KYI5Hsafdl1LQfyrS2Gqpg"
  },
  "vnIk0TexarUpiZ3xHG3GFw": {
    "date": "5/8/2018",
    "text": "So I tried this place for the first time. The flavors were pretty good. Had an American flavor to it as to be expected being in America. I had the gyro with Greek fries. Greek fries are a dollar up charge and well worth it. Dressing and cheese on top. My wife had the Greek chicken salad and loved the flavor profile. To wash the pallet down I had a canoli. Not too sweet but just right with the chocolate drizzle and whip. I will be returning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5nfAbjGX_LzUDShAGXuO2Q",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Canoli",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5nfAbjGX_LzUDShAGXuO2Q/o.jpg"
      },
      {
        "img_id": "9VcDbv5AZNFKAZPxrHHGrA",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Greek chicken salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9VcDbv5AZNFKAZPxrHHGrA/o.jpg"
      },
      {
        "img_id": "1v7eAnsC6th6KG7udRvTzw",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Gyro with Greek fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1v7eAnsC6th6KG7udRvTzw/o.jpg"
      }
    ],
    "user_id": "YKPM9UDqKzPpgekWTFezsA"
  },
  "PO4CRegNI41InN8bBbM-SA": {
    "date": "6/3/2019",
    "text": "First time at this restaurant while visiting the Phoenix area for a concert. There was an incredibly long wait time, as there were at many of the other restaurants nearby, due to a very big concert at the Cardinals Stadium (which I completely understood). However, it was very chaotic. The employees did not seem to be coordinating with each other, one said we had I wait to place our orders while the other was ready to seat us but could not do so until our orders were placed. I was so confused. I would imagine they would have a process down for nights like these, especially since they are so close to the Stadium and this is a regular occurrence.  The food was good, Greek Fries are delicious! Though, too pricey for what you receive.  The menu even noted \"special event\" pricing. Sounds to me like they raise the prices when bigger events are in town. Not worth the price to me.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "kfGb4ncwb59_t_yejSUfKQ"
  },
  "QJKubIJQqdgXMP0TrcE9bQ": {
    "date": "4/5/2018",
    "text": "Love,  love this place!  We've been a few times now and have ordered out as well.  I get a craving for gyros once in a while and they make a bomb diggity one!  Staff is always friendly and courteous. Westgate, since opening has had a slew of places that don't last but I'm sure this place will become a staple!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ftycLKBF8GiQzugUwtO4VQ"
  },
  "BC5PEEQE0pwWZEtsURz27A": {
    "date": "7/1/2018",
    "text": "Finally gave OPA a try. This is not as great as I thought it would be. Food looks great and wonderful but lacks flavor. Our meats were completely bland and dry. There is so much lettuce in their gyro and wrap you can make another salad with it. I personally have never had a gyro with lettuce but this is how we got it. The gyro bread was so soaked with olive oil it had fell apart. Had to eat it like a salad anyway. The gyro meat tasted like cheap frozen meatball slices. There was no sign of tzatziki sauce at all in anything. So weird. My wrap was so full of lettuce it wouldn't close. It just looked wrapped for presentation. Chicken was not seasoned or marinated. I did not taste any greek flavors in anything. No need to pop a breath mint here... there was no sign of any good flavors and spices that lingered. So the reason I gave 2 stars was because the fries were good. Will I be back? Negatory. I will stick to my real greek friends that make the real deal.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "HTsrpnC07X_gM7GiR_oekg",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HTsrpnC07X_gM7GiR_oekg/o.jpg"
      },
      {
        "img_id": "fmmxmKTLA03-o9rut7HjMg",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fmmxmKTLA03-o9rut7HjMg/o.jpg"
      },
      {
        "img_id": "2OmY61T7FaVI2x_OYsIMyw",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2OmY61T7FaVI2x_OYsIMyw/o.jpg"
      }
    ],
    "user_id": "IXSTfBSe56Z0RvYg4Cfn2w"
  },
  "5CMSnL8lUS9a0VvcaQuoOg": {
    "date": "3/26/2018",
    "text": "While strolling around Westgate we struggled to decide where to eat and happened upon Opa. What a pleasant surprise that it turned out to be great. They have HUGE beers on draft (I recommend the Hoppy B$**h it was great) and all of the food was great. We ordered the Gyro pita, beef schwarma, and a pepperoni pizza and all were delicious. I would highly recommend stopping by if you are in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VDlh0bzZyBAzCd-YLfN4sw",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Beef Schwarma with rice and Greek salad.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VDlh0bzZyBAzCd-YLfN4sw/o.jpg"
      },
      {
        "img_id": "n6tbTH3C_QBvjfaL1kWLrQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Pepperoni Pizza",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/n6tbTH3C_QBvjfaL1kWLrQ/o.jpg"
      },
      {
        "img_id": "4tx4xPGFvawopWYkI0_EAg",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Gyro Pita with Greek Fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4tx4xPGFvawopWYkI0_EAg/o.jpg"
      }
    ],
    "user_id": "VxXtYDyUNNpwRakVh_6XJA"
  },
  "L964zhi25-5RSLe5ESz8lQ": {
    "date": "5/3/2018",
    "text": "This restaurant is amazing! Great seating area! Enough space for your family and friends and great service leticia was amazing and very attentive with our needs and food",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j6AF9ZfnIm7xwHPmFeytGQ"
  },
  "cLiCXcuRbkigsGD43OoRiw": {
    "date": "6/25/2016",
    "text": "Was on the fence about this place but its a excellent restaurant. Its a little overpriced for what it is.   The Greek food here is delicious and well presented. but don't get the pizza (for the love of GOD don't get this pizzas, their terrible)  everything else I've had here is awesome.  Their salads are prepared just right and the Tzatziki sauce is yummy!!!! especially with pita bread!   The servers and waiters are kind and quick to respond to almost anything.  I think kids eat free on certain days here too.  They have outdoor sitting so you can enjoy the live music in the center of Westgate.   This place is a strong choice for families, couples, and friends.   I would give it 5 stars but they always mess up my to-go orders.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "f77_FtAlN-8H4bUdu3HoVQ"
  },
  "bOehc3xxLHTHzHYF97Tf1w": {
    "date": "6/5/2017",
    "text": "Fast friendly service. Went in on a Friday afternoon for lunch, very affordable, fresh food! Definitely would recommend and will be back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "omYwcPuRlMLxzOyDMsRKTQ"
  },
  "yTs65BL_MoviDQRVvu0Tpg": {
    "date": "10/21/2017",
    "text": "Greek salad is good!  Loved the Gyro and the Greek Fries too.  Ordering was easy and the service was quick!  We will be back again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zm4hFZfNMpAX58OkisuqUA"
  },
  "h6nSCiz2ySBYJQe6gndfVQ": {
    "date": "8/3/2017",
    "text": "One of my favorite spots, kinda surprised I haven't written a review. Now they have a parking spot out front for take out pick up orders. I really enjoy the Greek fries. I've also had the Greek burger. My plan next is too try the tiramusu cheesecake. Staff is great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QRaGo70Z6undi1DyBTuOWw"
  },
  "IyzAhOHeaHFvnbX6T-7zNA": {
    "date": "12/28/2015",
    "text": "Hubbie and I decided to go there because I had a Groupon to try this place.   We love Greek food and we eat it every weekend and this was kind of a dissapointment. First of all the restaurant's set up like a sit down place but it's more like a \"sit wherever you want- we'll bring your food to your table when it's ready\" place.  No problem. Just confusing.  We go to the counter to order our food and apparently they have some kind of points system where you get a latte after like $40 spent there, you get it. Anyway, the customer who was ordering before us wanted to use this point system and he wasn't being given credit for them. He explained to the staff this is the second time he's had issues with this. They apologized in a very lame way and when he left, they proceeded to make fun of him in front of us. Like seriously? So unprofessional!  If you offer something like this for  regular customers you'd think they want customers to come back right?  Red flag for first time customers like us.  The decor of the place's beautiful,  specially outside during a cold night because you can sit by their big firepit or under a patio heater.  The food... Well it was OK. The Greek fries were greasy, so oily and the gyro pita wasn't memorable. They don't fold it and wrap it like you'd expect and there's so much shredded iceberg lettuce on top you can barely taste the meat.  Overall we wouldn't recommend this place and most likely won't be eating there again simply because of what we saw in terms of customer service when making fun of the previous customer and also because their food's not really Greek food.  If you want Greek food you're better off going to Greek Gyro Express by Sams club in Avondale or to Pita Kitchen in W. McDowell across the Costco plaza.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 1
    },
    "photos": [],
    "user_id": "-vhMieXWbQzQ_RM-8zZvcg"
  },
  "ZVYkDaSJtxTTM3G_iK6L4Q": {
    "date": "8/11/2017",
    "text": "We've been here the past few nights and order pick-up! The Greek salad with salmon is my absolute favorite- I can't get enough of it! My fiance also has the Greek salad but with chicken!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qgnPhtd8jpbfwm4qHJZIuA"
  },
  "CB1z7nUKMAfDHtzOJcrdaQ": {
    "date": "1/4/2016",
    "text": "The portions were very large but the food was so so. It was a very crowded crazy with pre game folks trying to get lunch before the football game. Perhaps on a less busy day, the food might be better.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "MdGnY6eLxy82nEZhCc6rnQ"
  },
  "HDow3gJVaM_Emaytb702gg": {
    "date": "6/25/2016",
    "text": "After a long hot day here I wanted something fresh and delish, I found that here. There are a lot of choices for food in this plaza but I am SO glad we decided to give this place a try. I'm really picky and usually find something wrong with something...I had NO complaints about anything. I had the grilled shrimp and lamb plate with Greek salad and rice. Every bite I took was better than the last. I highly recommend this place. The staff was very courteous and accommodating to all of our substitutions, we were checked on and felt very well cared for while we were here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pBCGbUx-BRyv8Rm3oxayYQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Off the grill-shrimp and lamb plate with Greek salad and rice. YUM",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pBCGbUx-BRyv8Rm3oxayYQ/o.jpg"
      }
    ],
    "user_id": "ykKJtLokTJHcFYH3zk6ADw"
  },
  "DA2fxG-9pmd8hvulqFQOkQ": {
    "date": "3/20/2017",
    "text": "Oh my glob.. best food ever. So tasty, affordable,great area & employees. And always clean. They have alcohol & fountain drinks. One of the best restaurants I've ever eaten at. I highly recommend this restaurant. Especially their Greek fries. I love potatoes & cheese. Guess what's on these fries? Fricken cheese & special sauce for special people.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "s0v-ptMGHoRBA1rjbCNvcw"
  },
  "syx3FhYnfcIfpx1Kxdydog": {
    "date": "5/15/2016",
    "text": "We didn't eat there but we stopped in to check it out and the girl at the front was so nice. She explained the menu too me and recommend some of the things she liked. She interacted with my 3 year old daughter while I looked over the menu. We were out for dinner but we are totally gonna come back for lunch one day. It was awesome to have a nice experience with a nice person. It doesn't happen very often! See you soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V94jCAGjnxX2zE2MYzcIug"
  },
  "Zl5-sMjR7vhcIY4B7onz4g": {
    "date": "5/9/2016",
    "text": "Decided to have gyros for lunch and was nearby so we stopped in. The gentleman working the counter was nice and helpful and explained everything to us. Ordered a gyro with fries and some calamari. The calamari didn't taste like anything. It wasn't overcooked or anything there was just no flavor. The fries that came with the gyro were pretty good but the gyro itself was disappointing to say the least. I ended up eating maybe half before tossing it. I have too many other places I love to go for gyros so I doubt I'll be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yGXKMV1omio1I_3qNLdtAA"
  },
  "2qU9puHrVkHrcuLBKLaH6g": {
    "date": "9/29/2016",
    "text": "We are constantly on the lookout for great Greek food, we decided to try Opa one night while strolling Westgate and we were over the top excited to find such great food and service!! We probably ate there 3 times in the following two weeks and wished we had only tried it sooner!!  The Chicken Souvlaki is amazing, the grilled veggies have the best flavor!!  Himm, I think I may be headed there again after this review!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1t94T88zqRhRrZXVkmDnIQ"
  },
  "VGZCySYvzFuPvHr0OP6mew": {
    "date": "3/21/2017",
    "text": "Good food, slow service even on a slow Tuesday night. They were out of mixed veggies and offered grilled veggies. Waited twenty five minutes.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OMlygkcaW6akFe6q7R7OyQ"
  },
  "4gNgZAEu6le6abXWyHMT6A": {
    "date": "3/12/2017",
    "text": "This is the grossest food I've ever had. The only thing authentic about this \"Greek\" place is that they are cheap with ketchup. I don't understand how they have 4 1/2 stars???  This is worse than dog food. Greasy fries. Mac and cheese was watered down cheese sauce. There was blood splatter on our appetizer plate of hummus. None of us finished our food. 40 for 2 gyros plates and a kids Mac and cheese. Not worth it. Sooooo gross. This place violates several health code regulations.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bdDL8CJVHMNLzxN-JSgH4g",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Blood splatter",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bdDL8CJVHMNLzxN-JSgH4g/o.jpg"
      }
    ],
    "user_id": "uUxODYCem5pye4XO-2caSQ"
  },
  "5w0ieQswpJopwei9qUdnVA": {
    "date": "11/8/2015",
    "text": "Greek food is one of my favorites. I love the freshness, the flavors, oh and that yummy soft pita bread! All that being said, I was a little disappointed in this find.  So viewing all the photos, I thought how I wanted to give this new Greek place a try. What really pulled me in was the baklava cheesecake. I've had it once before and it blew me away.   So I ordered take out. Getting a hold of them at first was a bit annoying since the answering machine kept popping up instead of someone who could help me. So then finally somebody answered and proceeded to take my order. The food was ready in 20 minutes which was a relief for all the food I ordered. So the order consisted of the following: Greek salad with chicken, chicken skewers, lamb skewers, the chicken pita, the classic burger with cheese and bacon, the tricolored pasta, and of course the baklava cheesecake.   My Greek salad with chicken was...how would you say...boring. I think salads already sound pretty boring, but if they're made right, they can be insanely delicious! My salad was missing something. Maybe it was the bland Greek dressing to blame, maybe it was the dry grilled chicken, or maybe it was the veggies themselves? Nothing quite tasted what I was expecting. Even the pita bread was a bit dry with tough edges. I tried a little of everyone else's dish and nothing was overwhelmingly delish. So I saved the best for last...the baklava cheesecake. It was ok. It looks really pretty and interesting. But it was just ok.   Overall I'm glad I tried this place out because I can only compare it to the Greek food I have enjoyed in the past and will continue to go there instead.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 5
    },
    "photos": [],
    "user_id": "y9kug1sTnidFKQ6zepFf2A"
  },
  "P4b0lz1rUvNegxGLkYXr6Q": {
    "date": "5/22/2016",
    "text": "Great food, Super casual. Staff is always helpful and friendly. Locally owned. If you get nothing but the Greek fries you won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bl5bZ12GHL7zA5Pi3EKAEw",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Gyro and Greek fries.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bl5bZ12GHL7zA5Pi3EKAEw/o.jpg"
      }
    ],
    "user_id": "UdAbNi2gDZ4giwUviGwI_g"
  },
  "YuCTeT1VYoO3m5Dgxal-iw": {
    "date": "4/25/2016",
    "text": "I have been here many times and every time have been fully satisfied.  Today I was served by Brad and asked him for well done Greek fries and they were perfect! The amount of meat they give you is enough to keep you fed for two meals!!!  The only problem I had was having to pay .50$ for refills...they should include at least one free.  My friend had the Greek salad and added the gyro meat and was only able to get thru one fourth of it before giving up!  Make sure you bring your appetite when you come here you won't be disappointed and you won't leave hungry!  Brad made sure our experience was phenomenal and he succeeded!  Tell Brad Joe sent ya!  Even if u don't,  you will be well taken care of!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qgtRPFqskbohnS80_t9ORQ"
  },
  "JWqz5IEHnnPmhlSjOUZhPA": {
    "date": "6/18/2017",
    "text": "I was impressed.  I had the lamb and chicken skewers w/ rice and calamari and of course a Greek style mule.  This was very fresh and tasty Greek food and the portions were on point!!  Next time I'm going to try the gyros.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-HJVpIqQtTOEmHzJFKotiA"
  },
  "PyvyxRSr9HlNXLuxERZMlg": {
    "date": "1/6/2016",
    "text": "Great food and atmosphere. Wonderful spot at the Westgate center. A must try. Make sure you share your portions and order dessert as everything is delicious. We will be returning",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "zon0p7bSRjZfF2XIXdup2g",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Owner even brought us out a few desserts to try. Quite tasty",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zon0p7bSRjZfF2XIXdup2g/o.jpg"
      },
      {
        "img_id": "SfH84WI-0KUAh0SBl6GVug",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Falafel and Greek fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SfH84WI-0KUAh0SBl6GVug/o.jpg"
      }
    ],
    "user_id": "ens1J5VDo5IhhZbV-wk9QA"
  },
  "WbCrJBJQjY_iuBHdYrjIwA": {
    "date": "7/28/2019",
    "text": "This was my first time. I was expecting a restaurant with waiters taking your order. Instead, it set up was like Panera, where you order the food at the front and the staff brings it to your table.  I ordered the Chicken Souvlaki with rice and greek salad. The greek salad was spectacular. The rice had flavor. The chicken had sauce but was overcooked. It was a bit hard to cut and a dry. I needed at least more sauce to moisten the chicken. Besides the meat, it was refreshing to eat to sides.   The staff was super nice. They were attentive, checked in to see how we were, and were as helpful as they could. A+ on the customer service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sYKkNiNYU2GoAdh4kumYTA",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Chicken Souvlaki",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sYKkNiNYU2GoAdh4kumYTA/o.jpg"
      }
    ],
    "user_id": "pDdNXGfYexPt-MdYEttdeQ"
  },
  "vW2BDOojBKaeCxwOezoP-Q": {
    "date": "9/1/2019",
    "text": "Here for Labor Day and the deal says \"buy one sangria get one for a penny.\"  Lady at the counter chargers us for 2 sangrias. We show her the deal and she says \"Oh we'll fix that.\" Yea right.   I will never come back here because of the rude customer service.   They will probably try to take a dollar out of you anyway they can.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cuTMfBgOqfoveoF_7tzdeg"
  },
  "hBm73-8kUQudOLwny_SXNg": {
    "date": "7/27/2019",
    "text": "Been coming to this location since they opened. I love their gyro and the wife loves the chicken salad, she substitutes the regular chicken for the souvlaki chicken and it's her little slice of heaven. The little man can never decide between the spaghetti and meatball or the pizza, but enjoys both. The patio is awesome when cooler as they have fire places and heaters.  Only gripe i have is on this visit when the wife asked for the chicken skewer instead of the regular chicken the employee did it and then commented to every employee in the area about how weird it was after my wife walked away. Not sure why, but I said to him she had been getting it that way for years and not been an issue and he said he had worked there for awhile and never seen it and he thought it was weird... but if she liked it cool. Call me old fashioned, but shouldn't it not matter how someone orders their food? Like enjoy, cool, maybe I will try it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DJtzMkExF7vhyjv_EPjzaA",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Dessertd",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DJtzMkExF7vhyjv_EPjzaA/o.jpg"
      }
    ],
    "user_id": "cBWnQx7LKXaXONxRwuX6vw"
  },
  "IiwwXqg3KnpJhrGRegBVRg": {
    "date": "9/15/2019",
    "text": "We always have great service, large portions and tasty food. Our favorites are the gyro salad, calamari and balaclava cheesecake.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AOINdnFcpyLkWqXeciRe4A"
  },
  "ugJ8T0MeKer-z7Y1n1bBXA": {
    "date": "12/22/2018",
    "text": "Headed over the Phoenix Coyotes Game.  You can also get your $10 credit for parking on game day.    There's good seating and the food is decent.",
    "rating": 3,
    "rated": {
      "funny": 8,
      "useful": 22,
      "cool": 17
    },
    "photos": [
      {
        "img_id": "sNh4kToqD2XvSshKgMtxyA",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Lamb Soulvaki Platter -$20.88",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sNh4kToqD2XvSshKgMtxyA/o.jpg"
      }
    ],
    "user_id": "61AymMi8D4RTQ2aa1w41ew"
  },
  "sI9MYkVPJ6zXoiNSsklJsA": {
    "date": "12/14/2018",
    "text": "Great marinated grilled chicken skewers! I toyed between giving Opa Life Greek Cafe a 3 or a 4 star review. These generous sized chicken breast pieces are one of the juiciest, most flavorful preparation of chicken breast--ever. Hubby and I agreed that we would come back just to eat the chicken.   My son loved the Greek Fries topped with feta. Caution: Don't take out. Eat these on site.  Finally, the tragedy. I was craving gyros which was why I came to Opa Life in the first place. The meat itself was spot on, but the preparation was totally a flop. They did not thinly slice the meat. I some sliced, some grilled pieces, many were not grilled at all. Many pieces were chunky, clunky thick cubes that looked like it was the end of the spit. Okay, if you want to give me the last pieces, please take the time to thinly slice time and grill them. I usually eat all my food even if it was not that great. I left a third of my protein.  Having said this, I will still go back for the grilled chicken and fries!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 9,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "SZoFzJCp4cCkeDVJB50L5A",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Large clunky pieces of gyro meat",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SZoFzJCp4cCkeDVJB50L5A/o.jpg"
      },
      {
        "img_id": "Rkkp5JgS9XpoUswXrBrgAA",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Amazing marinated grilled chicken with delicious saucing",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Rkkp5JgS9XpoUswXrBrgAA/o.jpg"
      },
      {
        "img_id": "CbzAOsXypKFNw1BEJQYcOw",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Eat your Greek Fries on site!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CbzAOsXypKFNw1BEJQYcOw/o.jpg"
      }
    ],
    "user_id": "9gZ4pQHdK6v8xMLig6EEFA"
  },
  "mqot5YZFQ9RRsQn2Zs0F0Q": {
    "date": "12/11/2018",
    "text": "Highly Recommend  First time visiting Opa Life.  Ordered a Greek Salad, Margarita  Pizza, souvlaki, and hummus. Everything we ordered was very good and the presentation was terrific. The souvlaki was some of the best  I have ever had.   Service was very good. Price was fair. Highly recommend this for lunch.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 14,
      "cool": 16
    },
    "photos": [],
    "user_id": "MMf0LhEk5tGa1LvN7zcDnA"
  },
  "tvqOFOP2hE-pPbybwXBKiA": {
    "date": "8/16/2019",
    "text": "I really had high hopes for this place because the pictures looked so good, ordered the beet salad and the red beets were canned and tasted awful  Ordered 2 different hummus garlic and roasted red pepper and both tasted sour. My husbands gyro was good but nothing spectacular!!       Probably won't come back for a while!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "PIXluTg1hXFbEOKGETpS9w"
  },
  "HzFFORA_Yt3GKZB7C1-nDg": {
    "date": "8/9/2019",
    "text": "Love this place!  3rd time we have come & never disappointed.  Food is wonderful.  Service is good.  They have a groupon special for cash back.  You cant beat it!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "qyfg7QL94oXQLEGxbfXxyw",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Baklava Cheesecake",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qyfg7QL94oXQLEGxbfXxyw/o.jpg"
      },
      {
        "img_id": "M6kD7ae1jrmkg5tGfQpfUw",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Chicken Souvlaki with greek fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/M6kD7ae1jrmkg5tGfQpfUw/o.jpg"
      },
      {
        "img_id": "S0iNxk7SlfRxR50UJQI3AQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Chicken Caesar wrap w/ greek fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/S0iNxk7SlfRxR50UJQI3AQ/o.jpg"
      }
    ],
    "user_id": "5WfazfTVJBRIWJWGCZpE5A"
  },
  "VYfWLxRnT7eLfGvkJtmNKw": {
    "date": "9/15/2019",
    "text": "Husband and I visited Arizona and found this place. Glad we did!  Great food! Great atmosphere! So great,  we went there two nights in a row. Luis is the best.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LMF8dMBbP5xnON5LexPmSQ"
  },
  "9pNaBZBz_vYTiahM4z87BQ": {
    "date": "5/19/2019",
    "text": "This place stinks, at least for takeout purposes. Just move into the area and tried to get take out. Called 5 times, got put on hold, and then disconnected. When I got there I figured it would be busy...nope. Now I am home, they forgot 3 things in our order and somehow the lamb is cold even though we live 5 min away. The kid behind the counter had a black eye, looks like he was fighting good service and lost.   This and two entrees can be yours and more for only $32. Safe to say we won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "nCr7s3KqOoONEocKMtte_A"
  },
  "RoP1iGNhdhh_1QjVjfAzNw": {
    "date": "2/7/2019",
    "text": "Stopped in for a bite before the Jackets played the Coyotes. I was a little worried after some of the reviews, but we were not disappointed! We got there early enough that we had our pick off the full menu. Had the gyro pita and an order of Greek fries... Don't leave without trying the fries...oh my gosh!   Wish we had room for the signature baklava cheesecake, but maybe next time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ERZvvOHAdF0DjzYb3I3uyA",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ERZvvOHAdF0DjzYb3I3uyA/o.jpg"
      }
    ],
    "user_id": "uZelaQtijsPRlh98ccx9WQ"
  },
  "_Ldm8AA6PcRe2G0wQolMqQ": {
    "date": "4/28/2019",
    "text": "I've enjoyed the food here many times.   I find the quality to be above average.   What is missing is customer service.  Every time I've stood waiting to order with several minutes of being ignored.  There is certainly no appreciation for a customer that chooses to dine here from the 1000s of options in Phoenix Metro  Tonight was my final visit.  I stated my order \"Greek salad with gyro meat\" three times.  I was asked if I'd like a pita to which I replied affirmatively along with a drink   What I was served was a pita gyro with a small side salad.  When I stated the order was incorrect the manager was instantly argumentative and defensive.  One of the servers apologized offering that the staff member that took the order was new The defiant manager  told me I was wrong because she heard me.  But she could charge me more to get the salad.   Her cocky attitude was so off putting that I asked for a refund and I'd go elsewhere for dinner.  I waited a few minutes and she returned with a cash refund that was $2 short.   When I asked why she told me she was not going to refund my beverage.   We discussed and she finally refunded the drink.    Arguing with customer is nearly always a bad approach.   When I said I wouldn't be back she sarcastically said \"That's fine.\"  I'll let the owner know what happened.    Dear Owner,  The lack of customer service cost your business   1) Food costs  2) Credit card fees 3) A regular customer  4) This review   Please do train your staff to be customer focused and drop the snotty attitudes.  They have nothing more important to do than take care of customers.    Fellow Yelpers  Take your hard earned money where your business will be appreciated.  Sadly even as good as the food is, it is not worth a bad experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "83MW_YRHVkzW6WmRp78b8g"
  },
  "vbWqtckB6Lxz9ka_60IHRQ": {
    "date": "8/25/2019",
    "text": "This is the second time in a row I have come here and had an employee be rude over a free drink. \"You cant combine special offers\". Um a Sunday kids eat free restuarant promo has nothing to do with my points for a free fountain drink. Which costs what pennies on the dollar. I used to come here all the time. The food has gone downhill, recipies have changed and so has the service. I almost asked for my money back and left. The rudeness I have encountered here is beyond ridiculous.  Go to Pita Kitchen or Pita Jungle or any number of Mediterranean places. Way better service and food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BZ02ahHO9IxEH5-IFH7pdQ"
  },
  "mFKd_JuysdI0lYb9mLDqyA": {
    "date": "7/23/2019",
    "text": "I would normally give this location a 4 star review easily and the one in arrowhead mall a 1 star. The food is not the problem here it is the kinda rude woman taking our order, it felt like we were inconveniencing her to do her job seriously so sad. It was not even busy and luckily I do like the food here and if this was my first visit, I would most likely be reluctant to return.  The pitas are delicious here though thats for sure.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CQ-krPcgs73H0jSJKQldRg"
  },
  "slWxhogNmA9kMSRejN_UAA": {
    "date": "4/10/2018",
    "text": "Good place to come here for brunch.  This place opens one hour earlier than other restaurants nearby and they serve breakfast. Unlike popular breakfast places, no lines, no waits. Nothing is open around them, really ideal place to come for late leisurely breakfast.  We were the first customers to arrive and we were there for a while after we finished our food, just chatted over a cup of coffee. By the time we were ready to leave, other stores and restaurants started opening up.   Food portion is very generous. It got a bit too much after a while.  You order at a counter and they bring you food and drinks. Service was friendly.",
    "rating": 4,
    "rated": {
      "funny": 23,
      "useful": 41,
      "cool": 37
    },
    "photos": [
      {
        "img_id": "TSsdDBKb-Br8sNnyFu7Z6w",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Breakfast",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TSsdDBKb-Br8sNnyFu7Z6w/o.jpg"
      },
      {
        "img_id": "Z07u1LNLbJQUYmJwEPjiuQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Patio has nice fire place for Arizona cold morning",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Z07u1LNLbJQUYmJwEPjiuQ/o.jpg"
      }
    ],
    "user_id": "Gfxb_D1k8tueAoGn4cseoA"
  },
  "scnS90yleYr51YWEDw_yzw": {
    "date": "6/19/2019",
    "text": "Surprisingly good lunch in an area I thought would ha e been commercialized.  Food was great (gyro platter), and owner let me try house cabs til I got the right one.  He consistently checked on us to make sure all was well.  It's hard to find an owner of a restaurant who gives a rip these days.  I'll be back.  T from TX",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SoA-GkRFBayPU9TWgT6nfA"
  },
  "mhHYvqa_mItu-7qwwxN2pQ": {
    "date": "12/27/2018",
    "text": "We came across this restaurant while I were looking for cup of coffees . The setting of this restaurant was very clean,and looked very cozy. You can choose to sit inside or outside is up to you. Since we were new at this place, the waiter recommended the popular dish for us. It turned out very delicious,and it ended up that we enjoyed the tastes very much. Services here were great and enjoyable. One thing that was surprised me was that they wrapped the meat, rice and some herbs with grapes leave. It tastes different and unique, because it brought out the flavors from the grape leave and rices",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RcPFf_98kbpIdedtVv-KbQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RcPFf_98kbpIdedtVv-KbQ/o.jpg"
      },
      {
        "img_id": "J6GQKOzURwpyNNk9fq8zYA",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/J6GQKOzURwpyNNk9fq8zYA/o.jpg"
      },
      {
        "img_id": "40-weLkHSgXsUZdGjGlIEQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/40-weLkHSgXsUZdGjGlIEQ/o.jpg"
      }
    ],
    "user_id": "MZ6QZcB7bTJgJxBRc25GaQ"
  },
  "K4VbpkqVNK03mVHYWfRHiw": {
    "date": "1/11/2019",
    "text": "Great food amazing staff and the coffee is the best I've had in a long time. I love how the staff were so nice. They also give a military discount. Plus you can take some of their special coffee home they will grind it  Second time here amazing",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mx_4wkcE58SVp2tzAXM3XQ"
  },
  "V5dJhguoIQ_SDFlVhn6O4w": {
    "date": "4/2/2019",
    "text": "Chicken Tsoulaki was OK. Beer was warm and hostess chick gave me shit for asking for a cold one. Rice was soggy. Poor excuse for Greek food.  Or, the McDonalds of Greek food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "m29etug8MChCOmBrKWYwpw"
  },
  "uA2mRJg8Eu7zhqZUzq3dGg": {
    "date": "8/22/2017",
    "text": "Wow paid $16 for a gyro salad!!! The gyro was tasty and the portion size was big, but way overpriced for the salad in this atmosphere.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iz6mdVUQA3746ErI6oCNCA"
  },
  "pwdni089NEawY665zdZjKg": {
    "date": "1/5/2015",
    "text": "The hubby and I went on Friday.  We love Greek food so when we found out this place opened we were all for it.    The food was great. HOWEVER, staff might need more training on the menu. When we saw that loukoumades was on option on the menu we jumped right on it.  We were happy we didn't have to wait until the next Greek festival to have some.  When we asked the person taking our order how many were in an order she looked at us and said its just one big round ball.  Umm yea, we then explained to her what they were and she then took a moment to go ask how many were in an order.  I'm so used to biting into a loukoumades and having the honey burst out in all places (so darn good!!), yeah not happening here though :( :(.  We'll just have to wait until the next Greek festival to get our fix.  The rest of the food was fine, nothing out of this world, but it was good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "6hvXN8CakQFv1erYThL0IA"
  },
  "NdnTUVX4OCxRY8s5Qzwd4Q": {
    "date": "11/3/2016",
    "text": "Really enjoyed a business meeting at this place with its open wall design and multiple big screen TV's.  While you do have to order yourself at the counter, a very nice young lady brought our food out to us and even brought us our utensils, napkins, etc. which are available on a self serve basis. I choose an Opaburger which I thought was one or maybe the best burger I have had.  First, it was huge (maybe a little obscene big) a 1/2 lb. burger and then gyro meat on top plus cucumbers and the special yogurt sauce.  The seating was both booth type and chairs but with our Arizona weather in October and the open walls, what a nice setting to either watch a game or people watch. parking was close so not a long jaunt to the cafe. Servers and register people were all very nice, professional and food was delivered in a timely manner. great evening, food and setting.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "L-i-rexLhaENT3jxIXyfJA",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Beef skewer",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/L-i-rexLhaENT3jxIXyfJA/o.jpg"
      },
      {
        "img_id": "EkewG3tzi3miBUZ-xTsCGQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Excellent burger and fries!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EkewG3tzi3miBUZ-xTsCGQ/o.jpg"
      },
      {
        "img_id": "dwzwDJAn9JJA0VjgIwdLzw",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Open wall design makes for great people watching!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dwzwDJAn9JJA0VjgIwdLzw/o.jpg"
      }
    ],
    "user_id": "cGk2Y-7-gokJep-2QVNLAQ"
  },
  "R9KZq_W6vFp34XhUJbGUPg": {
    "date": "5/18/2018",
    "text": "Great server Jey is awesome and personable. Made us feel comfortable and enjoyed the atmosphere and food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k78-v7k6Bx2CuS_OQWyJ7Q"
  },
  "xxJ4HiRtsKfMrR_Lpikm0g": {
    "date": "4/11/2015",
    "text": "Talk about hitting the spot-we went there shortly after arriving in town for vacation and were hungry from traveling in and the time change.  The location is comfortable and is a great lunch spot.  My wife and I enjoyed our meals-she had the chicken souvlaki, I had the lamb souvlaki.  Very fresh ingredients and other than eating too many of my son's Greek fries, was a fairly healthy lunch.    My son's chicken souvlaki pita was ordered without sauce but had sauce on it-not a big deal, just swapped that chicken with my wife's souvlaki chicken.  The Greek fries mentioned above were great-they are the same fries that are served at our favorite Greek quick service restaurant at home, but come with a light olive oil drizzle and crumbled feta, and you know what they say about things served with feta...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "7NCrYl4uH9Nx3jp7HGbOYw"
  },
  "PF3xMDrzqS8qV_nhR3juAQ": {
    "date": "9/5/2017",
    "text": "Unfortunately I didn't get to visit the restaurant itself but I ordered a regular gyro from Uber eats. Omg it was absolutely delicious! You definitely get your money's worth with portion size and quality! I'm going to have to dine in soon. The only complaint that I have isn't even with the restaurant itself, but with Uber eats. The delivery guy was on a bicycle and he spilled the extra sauce they give you and it ripped the bag, and the Togo boxes were on their sides. Maybe next time could Opa life please put the extra sauce in the Togo box instead of the bag? Other than that, wonderful first impression",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "nGB1Tna4oxLCNEogX6m4WA"
  },
  "BEymzZkYGSm6WOLmjSyzyQ": {
    "date": "9/4/2017",
    "text": "Service was great and food was delicious.  Coffee was also delicious. Prices aren't too crazy. Decor is cute.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "nLYM7F3SQILdmNuXJRdzrQ"
  },
  "FsnLhPFv7iK8NTpLazDokg": {
    "date": "12/1/2017",
    "text": "Sitting here on a Friday night with friends having some good food, listening to a great local band (Divided Minds), having a great time, then Hank walked in.  He was walking from table to table and farting then he would yell \"Opa!\" and walk away.  I recommend Opa Life!  I do not recommend Hank.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iHUYpbqQ2FtxnTtZJifFkA"
  },
  "-TmhYar4inWVbx6XC2w7iw": {
    "date": "11/28/2017",
    "text": "Got take out.  Food was ready very quickly. It was hot and delicious. Service was friendly",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HB5trhLKarXUXWCGz-SEyQ"
  },
  "PfTV2LwEp9veqH7_7njivg": {
    "date": "11/20/2017",
    "text": "Once you've had REAL Greek food, you will never eat here again! It's sad to even call this Greek food because of how disgusting it is! I love Greek and will never eat here again!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yHxBtYs1DITl5aId5wyeFQ"
  },
  "EGIao0usu4rCuTlgjxlbYA": {
    "date": "9/2/2016",
    "text": "Located at the Westgate in Glendale AZ next to UofP stadium. Great food and great service. Never disappointed while grabbing lunch here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_uQVVwLJMfY92jmJGjCJqA",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. The Greek fries.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_uQVVwLJMfY92jmJGjCJqA/o.jpg"
      },
      {
        "img_id": "Jvx_VS3GZ_18g_UV9plFsg",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. The Zorba pizza.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Jvx_VS3GZ_18g_UV9plFsg/o.jpg"
      },
      {
        "img_id": "R0OnxJnti6RUlS32I9CiAQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/R0OnxJnti6RUlS32I9CiAQ/o.jpg"
      }
    ],
    "user_id": "sJLqHGHabwYuTd9-oY1b9Q"
  },
  "yrsFm8Qljz-XM-hCLAV0aQ": {
    "date": "5/18/2018",
    "text": "What great service! Jey made the experience great and enjoyable! Definitely coming back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o26HT6-_CX6eg6AhnzFXZQ"
  },
  "0TptrVnEw_sd891VCS68cQ": {
    "date": "11/15/2017",
    "text": "The owner at this place is awesome! Him and the rest of his staff were very welcoming. If you ever walk into this place make sure to order the Grecian Delight Pizza. I honestly think is the best pizza I've had! Along with having a few free coffee samples by the owner, the place looked really nice and clean. I'm definitely going back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jf8wG9dAWhIDtBz_L4IavQ"
  },
  "czqAPXaivPurTI7i5OWMfQ": {
    "date": "5/14/2017",
    "text": "My 28 year old son took my Mom and I here for a little lunch on Mothers Day. Grandma's order was completely wrong. She asked the waitress where the salad & rice were & said they gave her French fries instead.  The poorly trained waitress: responded: \"oh...are you ok with that\"? She got French fries, no rice or salad. Waitress didn't respond: \"let us get that corrected for you right away. Waitress never came back except to bring My order after I had to go to the counter and ask if they forgot my meal.  Nevertheless, my meal came out 10 minutes later. Will NOT be back. Terrible staff training. French fries terrible. Good ice tea and grilled chicken Slovaki was pretty good. What a disappointment for my son wanting to impress his mom & grandma on Mother's Day.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "iowq8AGKiXlQNdU_SPSVFA"
  },
  "uhWaiLzL0fTecuF7DBvwkg": {
    "date": "4/21/2018",
    "text": "Well this wasn't a good night for Opah. Normally the lamb is tasty and tender. Tonight was very, very tough! We were dissatisfied with the quality. We mentioned it to the staff and he said that he will let the kitchen know about the cook time?! I guess. Any way not a good night! I hope the quality isn't being placed on the back burner. Makes it a a questionable spot now!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_ZH8MJA9F5AdZCEn3b78kA"
  },
  "N8n7Be_9VynuJcP8je905g": {
    "date": "2/3/2018",
    "text": "The food was great, except that it was served with human hair in it. My family and I ordered a Greek style pizza, Greek Fries and Hummus and while the flavors and concepts where delicious we collectively found  5 pieces of hair in our dishes. Looked back to the kitchen and to no surprise none of the men were wearing hair nets. Ew.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hKE0dOzCHQeE-XLl1X1OBA"
  },
  "3JbFe68QsvSA1fGQZI52Xw": {
    "date": "7/19/2017",
    "text": "This place is great! Extremely friendly from the second we walked in. Brandon was very attentive. Awesome portion and quality on both kids meals and my entre. I would totally recommend giving this place a try.  We will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "-E1G3lGzySmw5weQXLawgA"
  },
  "wXuAcovncBsGlvFyhi1RNQ": {
    "date": "8/22/2017",
    "text": "Great food! Fresh and reasonably priced. Good comfortable atmosphere and nice people service. Had the Gyro and Greek fries.  Side Greek salad was fresh. Just the right amount of sauce and cheese.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F_WrVn0Vv5U76aiwlxMR3A"
  },
  "OWcw0kD-6Cx4Ea3pdDixSQ": {
    "date": "5/8/2018",
    "text": "The food is good, but the service has a lot to be desired.   We ordered four meals and received three.  My family had finished eating and they were still asking what sides I had ordered with my meal.   So sad to have ruined a nice experience by forgetting one meal.  I had to ask  for a refund of the meal they forgot!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t6d5j2giug5LYCMbzge-5Q"
  },
  "_cskK9w4_NAiSuQ8prhOgQ": {
    "date": "6/19/2017",
    "text": "There are many options for a quick dinner before an event at the arena, but I would definitely go here again. My hubby had pork skewer plate and I went out on a limb and tried the goat. It's easy to screw up goat and get dry meat without flavor, but we were pleasantly surprised. It was \"medium\" just like I ordered, juicy and tender. This would be good goat anywhere! A well-earned 4 stars!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "Vwhs9b2Cs-QbD-cli2YCCA"
  },
  "x5fpisl2-JNK2AQ-URa_8Q": {
    "date": "7/30/2015",
    "text": "Never tried this place before .. Came based on the four star review.  It was wonderful !  My hubby and I shared a Spanakopita appetizer, as well as a main dish.  The spanakopita was some of best I've ever had... We ordered a combo beef and chicken souvlaki, with the Greek fries  and rice as a side.   The chicken was so tender and full of flavor... The beef delicious and flavorful as well... Greek fries... An amazing blend  of flavors.., A real delight to your palate .   We were too full for dessert but will be back again!  OPA!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-SWubQzIa9f0QLPiVBPjig"
  },
  "XZVOwOu9HFt7SU2NS6UkPg": {
    "date": "8/14/2016",
    "text": "If I could rate it a zero I would. Totally unprofessional. Waited for over 40 minutes for our food just to find out that our order ticket someone how got lost and the cooks didn't make our food at all. Everyone else though got their food in a timely manner. I guess our money wasn't green enough. Ended up getting a refund and leaving.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9kh6LldOXyh3n8jluxHFYA"
  },
  "5tdf_asxkShf91-eXYU7ew": {
    "date": "5/17/2015",
    "text": "Always great food! Reasonably priced besides the pricey salads. No sweet potato fries (a staple at the other Greek place we visit) and one of the employees hovered too much while our party was still dining.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RjSryt82lVjSql3Kq4CUVQ"
  },
  "cU-i4neYfSDE-Ks2tHY6bA": {
    "date": "9/11/2016",
    "text": "Amazing service, exquisite food, perfect location. Highly recommended. Baklava cheesecake completely original, and quite delicious. Opa Life Greek Cafe is a must try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "nddQ8aAfwzw3HnvHmQR_xg"
  },
  "nSyVXFfM8-lHyUYOnA8fhA": {
    "date": "6/15/2015",
    "text": "One of my favorite type of restaurants is Greek.  And one of favorite Greek restaurants is Opa Life Greek Cafe.  My lamb souvaki tonight was grilled to perfection on top of sauteed vegtables and salad.  Definitely one of the healthier dining options at Westgate.  The owner of the restaurant, Allan, seems to always be around ensuring quality of the meals and the overall dining experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RLzPeil94Diw6TM9vSCtJQ"
  },
  "2NAgKAP5bL2QQyXnQWNUCw": {
    "date": "4/17/2015",
    "text": "Good food, great service :) we have eaten there twice now and both times were greeted at the door with smiles. They also have some amazing deserts",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "e_z84yfkXJjeTEg7I2iY0A"
  },
  "oKHIkbZiXbIBESexsoJWVA": {
    "date": "2/25/2015",
    "text": "Just ate here for the first time. Was wonderful. Fresh and quality food. Not cookie cutter. A little pricey for lunch, but well worth it.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "o_bSRGXSL-EoWjd3LRgVEQ"
  },
  "04VUF87xUZFr49CCGJBvzQ": {
    "date": "8/30/2015",
    "text": "Shit service bland food and overpriced... Came for breakfast  on sunday with like 6 people in the cafe ordered 2 eggs hashbrowns and an english muffin, took 39mins... F this place",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "L1hp6ofgslaEHTlZdhxIPA",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Bland hashbrowns n more shit food",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/L1hp6ofgslaEHTlZdhxIPA/o.jpg"
      }
    ],
    "user_id": "_OknrO83TR1ymWC9hFREAg"
  },
  "DaS8waWynnn4QNcj5DirzQ": {
    "date": "2/11/2015",
    "text": "Staying at the Renaissance was looking for a quick but good lunch. Very nice establishment. Definitely Americanized Greek food but the food is very high quality and healthy. If you're walking around Westgate and thinking about going to one of the chains, simply because you're familiar with them and dont know where else to go, go to Opa's, you won't be disappointed.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-Q0SqX8DCjK3iwjGDvZ7EQ"
  },
  "FNPxgK9MksMRq0-ijXGX0w": {
    "date": "2/4/2017",
    "text": "My husband and I both ordered the salmon Greek salad and they were delicious! Very good sized as well. Will come back next time we visit Glendale. It was especially nice to sit outside.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dy1Qad_nEE5N3L3Cooq9xA"
  },
  "bxzsI_ZiAYRB86EP0NumxQ": {
    "date": "9/12/2015",
    "text": "I enjoyed lunch here. I had a Gyro with lamb and beef, it had a ton of lettuce and not a whole lot of meat and not enough tziki sauce but it was tasty.  The Greek fries were pretty awesome, crispy shoestring style fries with a lemon, parm and feta type sauce on top.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p6IY2SreqTwKU9v0XpX62A"
  },
  "RnOd68xi22k1UX4_przwjg": {
    "date": "1/3/2016",
    "text": "Great Food, location and fun!  If you love lamb, they know how to prepare it here!  We had some of there combo plates and everything was authentic and delicious!  Can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rVeTmlauWBcDirBio1khyA"
  },
  "q_6JnvUEeA-HG9uLmmewiw": {
    "date": "5/16/2015",
    "text": "We came here on a cold rainy night.  Sat right next to the fire pit.   She ordered a greek chicken salad I go the greek salmon salad.  Both tasted great and the greens and veggies were nice and fresh.  The chicken had a much larger portion than the salmon which is the only reason why I gave this 4 stars.  I will def be back very interested in trying out this place or lunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8ydOPpIJQFvg2sAvEoJ4Yw"
  },
  "GtZjufWD0lHQCPI29O4taQ": {
    "date": "11/7/2015",
    "text": "First off, the food here is always delicious and the Greek fries are amazing.  However, it's a real classless move to have a \"special event\" menu with a 10-20% markup just because a hockey game is occurring. We came in just to order food (not go to a game) as we sometimes do and were a little peeved to see the \"special event\" menu. The kicker was that by the time we were finishing our food and the game traffic had subsided, incoming customers were getting the regular menu. Lame.  If we do come back, we'll be insisting on ordering from the regular menu.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gGfqlFf0jzazcdh0fwX2ig"
  },
  "mZlAiI7moTQaO90hA36q9Q": {
    "date": "2/8/2015",
    "text": "We were so excited to have a new restaurant at Westgate. The decor and setup is very modern and inviting. We also enjoyed the craft beer selection.The food was good, but very overpriced for the actual portions and accoutrements. I ordered the Village salad with Gyro meat, the salad came out to $17,and although somewhat large, underwhelming for that price! My husband got the gyro with a salad, and that too was disappointing, there was hardly any meat in his $10+ gyro. Unless the prices were just higher for an event (Coyotes game same night)...we will not be going back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "izJG1kna9HTWxrG2qFpoKg"
  },
  "D0zx7jHd_hoCGbx4eEePUg": {
    "date": "12/20/2016",
    "text": "Just stopped here for dinner, first timers at this establishment. So, far service is good and food brought outstanding a new place for my family to eat at. Food options are different, always looking for new places for dining.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mWjv1DI39fTr8uC3ebPiqA"
  },
  "po05cKuqLA8QbZ4RByU_iA": {
    "date": "11/3/2017",
    "text": "I liked this place when I didn't have to actually go there. Over the last 3 weeks I've spent about 300 bucks here using UberEATS and enjoyed the food.  Then I won some gift cards through a silent auction at a school fundraiser to Opa Life(figured since I like the place and it's to help fund the school activities, it's a win win for me). Well, there was an issue with the gift cards so I contacted the PTSA to resolve the issue.  The PTSA was great and contacted me back and told me they spoke to the manager at Opa Life named Allan and all I needed to do was go in and talk to Allan and he'd take care of me. As soon as I walked in and asked for Allan he replied \"yeah, what do you need\",  oh so I guess you're Allan, no customer service skills. Not letting that first issue get to me I preceded to tell him that I won these gift cards and was told to come in and see him.  This is the moment he gets irritated and turns his back to me and starts making another customers coffee.  Ok, I can deal with that too, it's getting busy.  Then he tells me \"I don't know what you want\", this is the moment I am in shock at his treatment towards me and tell him I want to order food but I want the gift cards to work.  He then tells me he doesn't have time for this because he's busy.  Well Allan, I wanted to order some food and use the gift cards. It's not like I don't already spend a lot of money there. Then I tell him I spend a lot of money there that is my actual money and he still just keeps telling me \"I don't know what you want, I don't have time for this\".  So, I guess I'm moving on to another restaurant and will never go back there as long as Allan works there. This transaction took place about 30 minutes prior to me writing this review and I've already placed another order through UberEATS to another Greek restaurant so hopefully it's good.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vWDVxaskJ4nyjZEL5bBesQ"
  },
  "eHWeKupbZLKiSmsDdg_Fkw": {
    "date": "12/16/2015",
    "text": "This place is incredible....can't say enough about their gyros, Greek fries, and the staff. It's just an awesome place to go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FTRI5BSYlf-oEXGaXx0hlw"
  },
  "TZx5INsLlv3TeS-Md8t_wA": {
    "date": "3/31/2015",
    "text": "I absolutely love this place! The food is amazing and the servers/owner are great! Greek salad is awesome and so are the steak and chicken kabobs!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IWpwMQ1U17mD5mIakC4flg"
  },
  "8Z452MQknxGwcnRKfnljew": {
    "date": "1/11/2015",
    "text": "Delicious wraps and salads! I've tried the Opa chicken wrap and the chicken souvlaki, both great! Good service as well. We'll definitely continue to go there.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hDmvBoel0lPXGp_p3PT63Q"
  },
  "KH1aSaNS4XkKdN9lk4qXsA": {
    "date": "7/12/2016",
    "text": "I love Greek food and have been wanting to try this place out since it opened.   I finally went yesterday before dinner time. Walking I wasn't sure what to expect. Soon as I walked in I noticed it was a order up front kinda deal then find your own seat.  The sitting area was very clean and well organized. You know first impressions are important for a restaurant. I was kinda lost in the menus placed on the tv screens. A manager came over and handed me a menu to look over which was great, I didn't even think he noticed my friend and I walk in. Within a couple mins after the first manager handed over menus, another manager greeted us which was nice. You always want great interaction and excellent service as soon as you walk in the door.   I order the chicken plate off the grill. It came with you choice of two sides. I ordered the Greek salad and mixed veggies. The chicken was cooked to perfection drizzled with sauce on top and the mixed veggies takes the win over the Greek salad. Next time I go, I will double my veggies, seriously amazing! The price for two chicken plates, two drinks was priced too high for my late lunch wallet. Overall besides our over priced meal it was great customer service from the managers not the girl who was cashiering. She did come around to everyone's table to ask how it was going  & skipped our table and asked the table who literally just walked in the restaurant if they needed anything. Keep in mind they only had 3 tables there and us?!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eQaFOWS3UPSo_wiXN_rEOA",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Off the Grill - Chicken with Greek salad and mixed veggies! Enjoyed it and loved it",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eQaFOWS3UPSo_wiXN_rEOA/o.jpg"
      }
    ],
    "user_id": "sRcV5rWNfJ9wbB2guzEd7w"
  },
  "-HrCifkgSmihBv46jExbfQ": {
    "date": "6/5/2018",
    "text": "Love coming here! Food is fresh and so yummy always! The staff here at Opa life @ Westgate are always welcoming and friendly. Live music on weekends, great for all the family.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rKS7tnWvAx661t1nrY2uow"
  },
  "r04r_KYLjOhSyHeim4qOyA": {
    "date": "4/27/2017",
    "text": "I have eaten at the location at Arrowhead mall a couple of times but this was our first time dining here at Westgate. Upon walking in I was shocked to find that it's a counter serve spot which is cool by me. You order and then choose a table and they bring the food out to you. We chose to sit out on the patio because the weather is still really great and they honestly have such an awesome patio for a more casual spot.   Our service was really great by everyone who helped us. It was a nice quiet Wednesday evening at Westgate for people watching and enjoying the shady patio here at Opa. Now onto the best part, the food. I had the beef slouvaki wrap.  My husband decided to take a chance on something he never had before and ordered their Greek pasta that resembles a lasagna.  We both really enjoyed our food but the best part was the sides!  Their Greek salad and Greek fries are both incredibly delicious. I love Greek food and Opa did not disappoint!  I look forward to being a regular at this spot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "jfYO9Y76N5BmfiCg-cTUXw"
  },
  "k04uA6m2P6l-L9huEx19IA": {
    "date": "5/8/2018",
    "text": "Came here with my daughter before a concert. First time eating at Opa. We had the Greek fries and meat lovers pizza. The entire staff was great, and Jey made sure we had a great experience. Greek fries were awesome, the pizza was delicious except for the chicken which was a little dry. But there were so many other yummy meats on the pizza that it wasn't a big deal.   We'll definitely be back when we're at Westgate.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rbW5pIJJqpt-VevQwoELwA"
  },
  "N3IQsiRQ9Zze9L4I4s4EgA": {
    "date": "9/16/2017",
    "text": "Always a perfect meal out. Food is excellent, staff does a great job and the restaurant is comfortable with both indoor and outdoor seating.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2m8SS8UkILOgLsLYh6jJ7g"
  },
  "2Mijz3uH6ChQrG4B9vEoew": {
    "date": "3/25/2018",
    "text": "I was very surprised at this place. Some of the establishments at Westgate offer premium prices, but less that premium offerings. Not so with Opa Life. I know it is a chain, but sheesh, the food is super tasty. The gyro plate is enormous and super tasty. The Greek fries have a wonderful lemon Dijon sauce that is just fantastic and pairs well with the feta cheese and herbs. This locations is awesome and the patio overlooks a lawn area. Just a well put together and well thought out establishment. Pair their food, with a cold beer and watch the crowds go by. Great way to spend part of an afternoon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xnie3DFtzUUBu9PaESQUpg"
  },
  "b7W055zJ0EyHcWMJCc4UBw": {
    "date": "5/2/2018",
    "text": "My first time here and based on the deliciousness and quality of the food, I will definitely be back. I took my food to-go and would love to go back and dine in with my family because the atmosphere was great. The service was incredible, as well. My food was not ready when I got there and I could tell the staff really cared about my wait time and made me feel appreciated. 5 stars in my book and I eat out 5x/wk and at some very nice establishments...I am a food and resaraunt snob and this place is as good as they get!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a_ZLba9WYWxFpVn4c1lgMA"
  },
  "wSXm_LvjZWhnkh6qOqMt4Q": {
    "date": "4/14/2018",
    "text": "The dolmathes were extremely hard. The balsamic vinegar on the pizza salad is too sweet. All of the glass doors being left open made it feel like you were right next to the smokers because of how strong the cigarette smoke drifted in. One waitress was pleasant. Hopefully they can improve.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rdGDYouBQsn2WKVub4TedA"
  },
  "ocXH4MzdnzJLDdSFLYBsOQ": {
    "date": "3/19/2017",
    "text": "Horrible customer service. Why have a tip jar if you have me grab the menu to order, fill my own drinks, pick up my own food and even pick up the to go boxes myself? Also took about 30-40 minutes just to get the food which wasn't all served at once. The last dish out was the appetizer. Most people \"working\" here are just standing around or taking on their phone outside.   Gave it two stars for the food tasting Bette than average but not much better whilst the service was horrible.   Probably would not return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "GTeCTZPMPiwVCVM1HgcLKQ"
  },
  "wWF3DE9FxPesJmmMj8h-KQ": {
    "date": "9/6/2018",
    "text": "I have to review this amazing restaurant for the simple fact that it is run by a passionate who strives for excellence and is always looking to dial In with their customers. I had the pleasure of being waited on by the owner, who was super cheerful, and really made sure that we were 100% taken care of. the best thing about this restaurant is that you feel like you are being hosted by a family member that wants to make sure you're having a good experience. I can't speak for the rest of the staff because I don't know if the same would happen, but I will say that you do not want to miss their amazing hot dolmades, the delicious beer on tap, or the Fantastic desserts that are quite frankly amazing! it's hard for me to post an actual five stars for any restaurant but when you have a great location, coupled with delicious food, very good service despite the fact that there's really no Waiters, and you have a passionate owner, how can you not give these guys 5 stars? Don't miss your opportunity to check out this great restaurant!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hNPBrqCY_YQrNNzrxrs4rQ"
  },
  "QHwaZFAQpVbTwCMEC2yi2g": {
    "date": "7/7/2017",
    "text": "My friend and I came here for a late lunch one Friday afternoon. We had the fig mules. The owner/manager gave them to us at happy hour price even though it quite wasn't happy hour which was very nice. I ordered the cilantro jalapeno hummus as an appetizer. I think it is the best one I've had. I also ordered the berry feta salad. Whoever made it made my salad beautiful. I almost didn't want to eat it. I did though and it was fresh filled with fresh berries and chunks of feta. Next time I really want to try the baklava cheesecake.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "3D2KdvX-Ppe2cy6zz1WiRA"
  },
  "WirY0Rlm0KcNHO51w-2uXQ": {
    "date": "10/11/2018",
    "text": "The food was fantastic and so were the desserts! My friends asked me to meet them there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vLdSqaqRnVSBKsmoHnvHEQ"
  },
  "1xe0R7OdnpgYzq0jD1mtXQ": {
    "date": "6/23/2016",
    "text": "I have been here a few times now and every time the service is great and the food is really awesome haven't had a bad thing here yet I had the lamb kebab tonight with two sides I chose to salads which is awesome because you don't have to have different sides like most places the lamb kebabs are seasoned very well full flavor the dressing on the Greek salad was okay a little Bland I think now they're baklava cheesecake is Heavenly definitely a place to come when you're at Westgate",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "rqL1TSilJiF1KCbHsJl1HQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Baklava cheesecake",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rqL1TSilJiF1KCbHsJl1HQ/o.jpg"
      },
      {
        "img_id": "9wmwUxj-_zTBqgPLvi5Ajg",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Lamb kebab",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9wmwUxj-_zTBqgPLvi5Ajg/o.jpg"
      }
    ],
    "user_id": "kbfpED-6FURIsNlsAXqc2g"
  },
  "czgs_7KWlIYXlyeyrguCOw": {
    "date": "2/27/2018",
    "text": "This place is really good. I order delivery here thru Uber eats when I'm not in the mood to cook. I usually get the Ceasar wrap or chicken wrap, Both are great. Garlic fries w/cheese are great. The jalapeno hummus is my favorite w/pita. I always recommend this place because it's fresh and healthy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Yvc6pfNdOyhbuHMh1_CiQ"
  },
  "AY9WHbRTg5mWnh78mX3FNg": {
    "date": "1/17/2018",
    "text": "I absolutely love this place. Staff are awesome very friendly, restaurant is very clean and nicely decorated.The food is very fresh and tasty, Greek fries love them,gyro was delicious salad are great. The portions are just right and the desserts are yummy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "S0o5Xh_84zCecMjpQ8R2xg"
  },
  "vx6CbCua0py2VPVvOQ1FTg": {
    "date": "2/13/2017",
    "text": "Wife and I having Coffee and baklava cheesecake. Simply amazing! This place is cozy and has outside dining.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "CNFavZXlCOzRSrbmF7UkjQ"
  },
  "q-Y_IFPw1REXaQenyAXc_A": {
    "date": "4/3/2018",
    "text": "My fav!! Their food is always super fresh and tasty. And the baklava cheesecake is amazing. We go here frequently because the food is good and we enjoy their patio. The rewards plans the have is also very generous. Opa!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U3rVSKEwVHIYMsePG7cUHw"
  },
  "9cJfnMOe9PyFv8HlqMtJ_A": {
    "date": "5/19/2017",
    "text": "This place was really good. i enjoy greek food and now i know when i come to AZ i have a good greek restaurant. It took a while to get my food but it was worth the wait. If you are in a hurry this is not the place to go you need time for your order to cook and time to enjoy this delicious dishes",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "lHDU_NnPeQWHgZOsfMJD7w",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Beef souvlaki and greek fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lHDU_NnPeQWHgZOsfMJD7w/o.jpg"
      },
      {
        "img_id": "72NzQmLsSkuWzy8-JPHH5A",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. This is the first place i have seen advertise uber eats",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/72NzQmLsSkuWzy8-JPHH5A/o.jpg"
      },
      {
        "img_id": "oxfpuJr8TYAt9uYUu-iCdw",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oxfpuJr8TYAt9uYUu-iCdw/o.jpg"
      }
    ],
    "user_id": "IqOnCLiSrX-he7OlOqEDNg"
  },
  "xwAWH1s9K4QS1xXM_7JvLA": {
    "date": "2/28/2017",
    "text": "I have eaten here twice for lunch, and both times the food was delicious.  The first time I had the chicken souvlaki on a skewer with warm pita on the side, rice, and seasoned, grilled veggies.    The second time I had the beef souvlaki as a pita sandwich that was filled with shredded lettuce, finely chopped tomato and cucumber, and  tzatziki sauce.  I chose the salad for my side this time, which was romaine lettuce, cucumbers, bell peppers, olives, and red onion with feta cheese and a Greek dressing.  It had the perfect amount of dressing and was so flavorful.    I don't know what \"souvlaki\" means, but the seasoning and flavor on both the chicken and beef were so good, I want to make it at home so I can have it all the time.  And both times, I liked that the meat was tender, and not dry. Their pitas are also so good- fluffy, tender, and served warm.    The pita sandwich was really full, and it was difficult to eat.  The owner suggested next time I could try the wrap, because it is easier to eat, since everything is more contained. I did notice a lot of people ordered wraps, but I love their pitas, so I don't know that I will want to switch to the wrap. The owner has been there both times I've had lunch and is really friendly, and helpful if you don't know what to order.  My friend, who has gone with me both times, absolutely loves their feta berry salad with the addition of grilled chicken. The salad has greens, berries, and candied walnuts, with feta cheese and strawberry dressing. She said it's her favorite salad and doesn't want to try anything different.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "M-RFhRHQFQgVNxZCD6xTeQ"
  },
  "XSjkXE4qxjPVL-8b4B1U6Q": {
    "date": "10/12/2018",
    "text": "A little comic relief at the register.  The food is fast and mostly guilt free, what more can you ask for!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VBmSJwIYnGTaKfColS7muA"
  },
  "fiK_XEJhEdO7dtPVoqgWMQ": {
    "date": "8/7/2018",
    "text": "I came to visit Arizona on vacation. My family and I love the food. The later we was siting there eating out food. The more and more it got busy. A manger a white guy bold. He ask me if I wanted a box and still had 5 slices of pizza left. I wasn't even done eating. He already put my food in a box. Than came back like 5 mins later asked my mom was she done. She still had a half a salad she was still eating was trying to take her food away. While my brother was waiting in line to get more food he keep wiping my table down. In so many words trying to tell us to leave. My brother was still not even half way thru the line. By the time my brother got his deserts and sat down in eat. He keep watching us like a hawk. We was getting annoyed cause he keep coming back like we was getting rush. It wasn't just us he did it too. It was everybody in a section. It was very disrespectful and rude. I work in the food industry. I don't even do that to my customers. Than the women's bathroom was a mess. One stall didn't have seat covers nor tissue. Trash can was full and spilling all out.  I would go back to this place but never this one again",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G1WbKKxrbEHwMjlAvZkT6w"
  },
  "kzcmU1Bo8gCKfVNyD24kMg": {
    "date": "12/8/2017",
    "text": "I had a healthy meal of chicken with lemon sauce on it and vegetables I brought my mom with me and she really enjoyed it too. The vegetables had cheese on it and chicken was tasty. Great meal",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_k-CBP-k7BCzn-pbOzWuYw",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Chicken soulvaki and perfect veggies with cheese. The rice is amazing too great lunch",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_k-CBP-k7BCzn-pbOzWuYw/o.jpg"
      }
    ],
    "user_id": "ic0I-YnIQi3eNnjfBCBCvw"
  },
  "x-f5AGjKQtGxAFbVUXRXBA": {
    "date": "4/1/2018",
    "text": "We came here after a game and it wasn't busy. Staff was friendly but it took 35 minuets to get a salty chicken salad.  The table next to us got all their orders mixed up and half ate while the others waited.  Management apologized but they should have been more prepared for a Saturday night.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "XfBSqRevwUEQN3tg55E-9A"
  },
  "Wenf0kTWEDs7-3Jc9Gj-dQ": {
    "date": "7/24/2018",
    "text": "I absolutely lovveeee this place.  I've been coming here since they first open years ago and the experience never disappoints. I recommend this restaurant hands down.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iYk4QAF5Q-UezWCkpZTEFQ"
  },
  "ljTYy7sLkCdmjWSzefyKgQ": {
    "date": "7/23/2018",
    "text": "Amazing service and food! We tried the lamb souvlaki with Greek fries and the Grecian pizza-- A must try. I would definitely recommend this place to my friends and come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N3EXM8N-CigP4rD4XGIRzA"
  },
  "A8Ivhd8PFBef5TAGRRH80g": {
    "date": "5/28/2018",
    "text": "My bf and I have been wanting to try this place since we moved here and finally did and definitely was not disappointed! The food was so fresh and flavorful, the grilled chicken was cooked perfectly. Not to mention the customer service was amazing as well. We're looking forward to our next visit!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AcxJfLwzVynTzeF-ddcFNA"
  },
  "pmF5K2PX4M1blfB-vLAXCg": {
    "date": "1/17/2019",
    "text": "i tried to order my byweekly fix of what i consider great greekfood for the valley, nothing like detroit or chicago but still very good, BUT!!! between doordash and opa life they screwed up my order. i always order the same thing and the managers at opa even know me so my order was cancelled and im starving i guess it will be grilled cheeze my trustworthjy standby. i will try again to order opa life in a few days from now i hope everything has been corrected. i really love this place and i hate knockn in it however  i like to tell it like it is. sometimes one bad experience can keep a customer from ever trying it again its not the case at this place the food and service is usually very good",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vt9ifTjKWPHguWN4m2-UPQ"
  },
  "Vtdt3gG-K0-iJfDJ4lIFEQ": {
    "date": "10/15/2017",
    "text": "Absolutely great food and service!! Was shocked how much food there was. Definitely be coming back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "MCmSNPauovq4N6VJ0-YaeA",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MCmSNPauovq4N6VJ0-YaeA/o.jpg"
      },
      {
        "img_id": "duNmtEUrsF6U4ep-LNHfbQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/duNmtEUrsF6U4ep-LNHfbQ/o.jpg"
      }
    ],
    "user_id": "RB87JOcr_sFWq6mSbeEL6w"
  },
  "rwj9eBhydVaJrX1A9YWUDg": {
    "date": "9/29/2018",
    "text": "Come here all the time but tonight....smh. Not busy, ordered a brownie and waited over 20 minutes. When I walked up to the counter everyone was hanging out chatting. I said Ive been waiting over 20 mins for a brownie and the guy acted like he had an attitude and snatched my number. They hadn't even taken the brownie out to warm it up. I told the guy at this point I don't want it and to give me a refund. He told someone to warm it up anyway. I'm sitting on the patio and still haven't eaten it, so irritating!! And the brownie is hard as a rock. So much for warming it up",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "R9otmgP31tQW5HekAtIVHQ"
  },
  "bp3SCtULxbAU6vDhW25pWg": {
    "date": "5/19/2018",
    "text": "This Restaurant is the number 1 go to restaurant we go to with out of tow guests! The food is always flavorful, warm and fresh ! The cappuccino is perfect. Just the right amount of foam, plenty of flavor. Our guests rave about the food and we usually end up there before their flight leaves. I go there often with friends on a regular basis. Best Greek food around. Alan the manager is always friendly and attentive (he makes the best cappuccino and lattes) The rest of the staff is just as nice. I love the open air feel of the restaurant, heaters available for the patio when needed, and misters to keep you comfortable in the summer. A must try desert is the Baklava Cheesecake. It's big so you can share or take it home to enjoy later. If you love souvlaki the chicken is tender and well seasoned. Chicken use to be my favorite. My husband was gracious enough to share a bite of the beef. WOW melt in your mouth tasty beef, my new fave.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "X08I1kHjLtInJtIQqzArWw",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/X08I1kHjLtInJtIQqzArWw/o.jpg"
      },
      {
        "img_id": "LeeE58ANHU7xEQM1QjloJg",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Chicken Caesar Wrap",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LeeE58ANHU7xEQM1QjloJg/o.jpg"
      },
      {
        "img_id": "eAPXzifJqR47fIUwGGOLCQ",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Best cappuccino for a break with your best friend photo by Michelle Anderson",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eAPXzifJqR47fIUwGGOLCQ/o.jpg"
      }
    ],
    "user_id": "jGHFZTiBIYvcM6skzzWaIQ"
  },
  "WhFnCQb1M0DIvHnpoTNvQw": {
    "date": "10/14/2017",
    "text": "Such delicious food for a very reasonable price, especially considering Westgate prices. Everything from the hummus to the burgers and pitas are scrumptious. There was a man who helped us while we were there and he was running around, trying to make sure everyone was enjoying their meal. I think this man was the owner because he was so, so nice and you can tell he took pride in this restaurant. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "noG6Ly8wqvfrD8zb5vQ36g"
  },
  "WH9onokyMydrQKToYPrSbw": {
    "date": "10/1/2017",
    "text": "Best Greek fries I've had in the valley! Great gyros also. The portions are ample and the food is fresh.  If you are a hard core coffe e drinker you have to try the Greek coffee. It's not for coffee wimps though.  You order at the counter them they bring your order to your table. It is not fast food so it may take 10-15 min but your food will be fresh!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "h1o4pHnb__OD5fV64-rtJg"
  },
  "qu8JBnQOABRO3IgZuh_45g": {
    "date": "4/2/2018",
    "text": "The Chicken Souvlaki Kabobs are the best in the valley. Also thier Salmon Salad is top of the line. Jey, Emma, & Luis will give you 1st Class service. Tell them I sent you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "qYglGFIR0TEJkkY9V4jwlA"
  },
  "cOQfHpbAKePXHlvvd5ZNPg": {
    "date": "5/8/2018",
    "text": "Great service, friendly staff, and amazing food. What isn't to love? Jey took excellent care of us, checking in and making sure we were having a good time. We'll be back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qySPr5bK2UhUowFjsKwsag"
  },
  "_Hu5exx9TLD5puGAmW2z-Q": {
    "date": "6/15/2016",
    "text": "Walked in for lunch with a group of six. The staff was very accommodating and they had a great sense of humor. I threatened a bad Yelp review if the owner let anyone else try and pay for the food other than myself, and to my delight he proceeded to yell at all of my friends obnoxiously from behind the register. He had us all rolling -  The food and drinks were great. Staff checked up on us repeatedly and brought us little treats to try from the bar and the bakery. Great experience. Clearly family owned. I don't care for Westgate at all, but I loved this place so now I have a reason to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kUVS6CgW9FdPBmmM_B-tuA",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Desert on the house - this one is a MUST",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kUVS6CgW9FdPBmmM_B-tuA/o.jpg"
      },
      {
        "img_id": "girQM3XpVZhG4ghpJPuGtg",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. The sexiest table in the joint",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/girQM3XpVZhG4ghpJPuGtg/o.jpg"
      }
    ],
    "user_id": "cpReQJuXRCOv0FaKGwsveA"
  },
  "uZDBu29mUWlJkla1-upG_A": {
    "date": "6/16/2018",
    "text": "Dry delicious food... one of my favorite restaurants in westgate... clean and good environment",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pd6XhkMCE4d4hhqwtX_lZg"
  },
  "9zZgF_7iAUixXDuQZa_l-Q": {
    "date": "11/14/2017",
    "text": "I visited on a Saturday night and ordered a souvlaki plate with greek fries and greek side salad. All were absolutely delicious! Well seasoned and fresh tasting. So good that I returned a few days later for lunch and was I disappointed the 2nd time around.  This time I ordered rice instead of fries. Rice was just yellow rice...not the yellow jasmine I expected. My grilled veggies were not slightly charred but they were burnt crisp! I ordered my lunch to-go and the side salad was placed in the same container as my steaming hot/burnt food. In the few minutes drive back to the office I had hot salad which I had to separate from the rice. Somewhere in \"restaurant school\" they have to teach you not to mix cold salad and hot food in same to-go container.  I'm hoping my lunch experience was a fluke.  I'm willing to try one more time before I cross it off.  Great customer service",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bpb7b5BMzq6mUthcDtbldQ"
  },
  "ipy_MDAP4EnzlZ0yNB0eUw": {
    "date": "6/13/2017",
    "text": "The food was good the portions where great, lots of good food is always great!!!!  There are a couple things that make me say I'll never go back  A) no table service, if I want to stand in line I'll go to fast food. Hire a waiter or two!!!  B) noise the noise level was horrible. There is some guy standing in the corner playing some high pitched guitar like instrument through an amp so loud it hurt my ears. Our party sat outside as far away as possible and by the time we where done I was horse from shouting to my friend sitting next to me  C) it was pricey TOO PRICEY considering the noise and lack of service",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "askDKzGw1SLME61pHERf9g"
  },
  "3YC99WrUSrRqr2cNpuPtvw": {
    "date": "12/5/2018",
    "text": "The food is absolutely wonderful I highly recommend the shrimp / beef shish kebab.... very good Greek salad as a side ...staff is very courteous and the baklava is presented very well as a dessert we eat here at least twice a month if not three times.....Luis who works there ...always come by the table to make sure everything is all right ....he ivery personable",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p20HNyY4mPvNUfEDpMLM6Q"
  },
  "4ZTvq_NfHNi8EWIoW4IYnA": {
    "date": "9/5/2017",
    "text": "My husband and I have been looking for a new Greek place since our favorite closed. Was so happy to find this place. I'm usually not a fan of walk up ordering at restaurants - but the feel to this place is unique. The food is delicious. The hummus is great& the Greek fries are so good!  Haven't had something I didn't like. Highly recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CdojJr0572BymRAKD1Iu_A"
  },
  "0ptQaSkgER8Fs9hS2RCvPw": {
    "date": "7/12/2015",
    "text": "Finally a restaurant with delicious healthy options! Where to begin, my first visit to opah I had the watermelon/tomato salad. Not only was it tasty but also filling since it came with a side of gyro meat. My second visit I took my husband. We split the berry salad and Greek burger. The salad is 1 of the best we've ever had and the burger was perfectly cooked. We've been back a third time and it was equally as good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "E-WU8naSdYUksobqXqgXLw"
  },
  "oDQekKKTkOrG-g1KrKgxnQ": {
    "date": "1/31/2016",
    "text": "The staff was very helpful in selecting a meal. The food was great, nice select. It's a long drive for us, but we'll be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8VAQEme7y-cPJdUKtQl7Ig"
  },
  "WxFEtJixEmrdQnULbg3RCg": {
    "date": "1/15/2016",
    "text": "Great food, great service! We had the jalapeno cilantro hummus, a gyro, and a California pita. Everything was really good, including the fries and Greek salad on the side. We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dKYLVJ48zMEN0AeE54rV4Q"
  },
  "mJvDe5p_Y3EyuEHNvma5RQ": {
    "date": "5/12/2017",
    "text": "Absolutely amazing good as usual.  Chicken souvlaki is so tender.  Lots of food to share or take home.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HWdnFPZU0vjbtwamZ8VInA"
  },
  "qKOH7gxMkkvQuSbv9VvZTg": {
    "date": "10/14/2015",
    "text": "Stopped in to see if they had dolmades (stuffed grape leaves). They do and I can say they are the best I have had at any restaurant. Friendly staff and great open environment. I will be back !!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aX5TrJsyopaciHBfecimgQ"
  },
  "DYDwqKGGY8u-0XvVxbZ80g": {
    "date": "4/14/2015",
    "text": "Food was pretty good. Went with a big group. They treated our group pretty well!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "OaPR_4XX0yL0s6GDELmoxA"
  },
  "CyNg7bxIB5zLaB1Xbk7iyQ": {
    "date": "2/4/2016",
    "text": "Hockey and Greek food go well together at Opa Life.  My wife and I stopped by Opa Life when the restaurant we wanted to go to was eerily empty on a Hockey Game night but that's another review.  Good thing for us; Opa Life was a great find.  We apparently arrived right before the surge of Hockey fans.  Opa Life made me think of a Greek version of Pei Wei.  You order at the counter and then servers bring your food after you sit.  The atmosphere is good, but can get a little noisy (hockey fans are a rowdy bunch).  We ordered a Philly Pita/Greek Fries and a Euro Pita with Greek Salad.  And we added a Baklava Cheesecake for dessert.   Our choices were spot on for us.  My Philly Pita had some of the best meat I've ever had and it's mix with cheese and onions was great.  My Greek Fries were also excellent.  The combination of perfect fries with Feta and Parmesan Cheese was way tasty.  My wife's Euro Pita and Greek Salad were just as tasty.  We shared fries and salad and it was heaven.  The only issue we had was that the serving size of both Pita's are really large.  We did manage to come close to finishing but it took time to enjoy each bite.  We will totally split a Pita, Fries and salad the next time we go.  As for dessert; we saw the Baklava Cheesecake in the dessert  case and thought that would be a great finish.  One piece was perfect for splitting.  The flavors of the authentic Baklava come through along with a really good cheesecake.  Fila strips on top added a great crunch along with honey.  We will make sure this is on our list for game day Hockey and Football.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kq3HJh4uQMs9sFuKeCFlug",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. Great tasting Baklava Cheese, notice the Fila strips on top? They added great crunch.  The honey and authentic Baklava flavors come through.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kq3HJh4uQMs9sFuKeCFlug/o.jpg"
      },
      {
        "img_id": "vd4E2qgsW024d-GNR3sGqA",
        "caption": "Photo of Opa Life Greek Cafe - Glendale, AZ, United States. In front; Philly Pita with Greek Fries. Behind; Euro Pita with Greek Salad.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vd4E2qgsW024d-GNR3sGqA/o.jpg"
      }
    ],
    "user_id": "OkEvzX-tf5zQ59qsbr_2bA"
  },
  "55vTcYW7phvCl5tYIEJf8w": {
    "date": "11/7/2015",
    "text": "Excellent Greek Fries. Super good food & customer service was terrific. Loved it. We'll be back for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Oj03RSL5CTP9H2P34WV0OQ"
  },
  "DUrHOVEYPWt2v2wS1_eXJg": {
    "date": "5/1/2015",
    "text": "Our first time here and ordered the oppa life  combo  excellent!!!   Each person's table was full of the lights we want to come back and try.  You order your food at the counter get a number and pick your spot.   the owner  and staff very very friendly and helpful",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "XSWCpaCdS9nCLl4il60_Mg"
  },
  "Z3tIul0fidM9p4S2fMT2hw": {
    "date": "3/1/2017",
    "text": "This place is amazing!! I come atleast a few times a month. Service is amazing food is delicious and their mules are on point.  Whether it's lunch with the girls or swinging by for a drink at night this place is on point.  I love the pitas and the chicken is melt in your mouth. Alan is also our favorite that we see every lunch time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "82nwbfguFO0S8XwlIoLDBA"
  },
  "zoLfv0XrhHyInG53C1DISA": {
    "date": "4/22/2015",
    "text": "Stopped there today with friends. Food was just OK and very expensive. I had a gyro in a pita and it was tasteless. It was served open faced and looked more like a Mexican tostada than a Greek gyro. You should be able to bend the pita bread in order to eat your gyro like a sandwich and this was impossible. Not because there was so much meat on the pita - it was because there was so much lettuce.There are many other restaurants near by that serve tastier Greek food so I would suggest you go somewhere else.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "N3oC8kvDya_N-Rn6ZkNwHw"
  },
  "8mPtUoAivADml9cvpBDXxw": {
    "date": "12/10/2016",
    "text": "The food at this place is phenomenal! The portions are adequate and the meats are perfectly cooked. The pita bread is flavorful and served warm. I went for an early lunch and it wasn't crowded but the service took longer than average, about 20 minutes to get my food. In any case very worth the wait.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bw2uDlm4IF7VpyANknivVQ"
  },
  "xFZ1AsENLuXNoWfomNUIyg": {
    "date": "2/14/2017",
    "text": "I think this place is under new management cause service today was excellent. the manager( I think it was) kept coming to ask if we needed anything he was very nice. we  will definitely be coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bc2UQQIoeQ8703f-pH3DzA"
  },
  "kiJEeapTuSdCMvmP-2Oftw": {
    "date": "1/11/2016",
    "text": "Food was great, though not cheap. But you get what you pay for. Plus the portions are pretty large, so we could have saved. Obey by splitting s couple dishes. We didn't have to wait long. Everything was pretty hot. And fresh. Service behind the counter was excellent, making recommendations and very personable. Follow-up service was very attentive too. We were full when we left with lots of extra pita for the numerous dips we took home with us. Hope this franchise comes to Ohio! Hard to find good Greek.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wFEzck8a-SL0nYQbIGn3ug"
  },
  "MRRIWzoBYSyxpcENCqw8xA": {
    "date": "8/22/2015",
    "text": "We stopped after a movie for dinner. Loved the food. We sat on the patio, GREAT atmosphere. Live music was playing in the courtyard. I highly recommend it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cjjvh2nn0VPgYpwDFdkKpQ"
  },
  "DF6FknlTYJC8G10L8vPjXA": {
    "date": "3/12/2015",
    "text": "Very busy as it was a game night for the coyotes, but we got our food pretty quickly.  Had the gyro, delicious!  Their fries are great too.  The do need more seating.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "GFzrSgXzHU25Q0t9dGgpfQ"
  },
  "slfqxuU-bY0tNcvHFAEeoQ": {
    "date": "2/23/2015",
    "text": "Westgate are sure having a tough time trying to bring in decent restaurants. I went there for the very first time last week and was not impressed. The food was very mediocre and very bland. There were hardly any customers in the restaurant but we had to wait for almost a half an hour for our meal. This place looks like a full-service restaurant but its served fast food style. The entrees  come in metal trays with paper on the bottom. You should never serve rice that has paper underneath as you were eating the rice and the paper was shredding and mixing in to the rice which was awful.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "NuFKjUFgSMLDMoepWZtC0w"
  },
  "b7L4cqq7q1o3Z54mRtaMcw": {
    "date": "3/12/2017",
    "text": "Not impressed with their food . Not authentic at  all. Who the heck puts lettuce in a gyro . I ordered a Mac and cheese for my child and it looked liked puke . How can u get Mac and cheese wrong for gods sake .  The bath room was disgusting please people check the bathrooms once and in awhile and clean them . The dressing for the Greek salad was over powering . Sooo many wrongs with this place and I will never go back .",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qhkZN5TGBOT44D6rNYdfMQ"
  },
  "SR3sNm7cXT5WvCbqUeG1Bw": {
    "date": "3/7/2017",
    "text": "This was ok. We needed to eat quickly before our activity.  I ordered a chicken pita.   Everything was fresh but the chicken was in big chucks. I had to cut with a plastic knife.  Place was busy and business consistent.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ui48uBV3YI-8MGBwT_SSLg"
  },
  "uZtS-klachxf_4lWGM7fGQ": {
    "date": "5/24/2015",
    "text": "This place is fantastic! Excellent Greek food at a very responsible price. I love the patio, you can relax have a great meal and enjoy the bands playing in the common on Saturday nights.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4umShlTioZdAE3QgdqltMA"
  }
}