{
  "Z5T5Rel-KbmOCreu2baxwA": {
    "date": "4/27/2011",
    "text": "Walked over for dinner while staying at the nearby Hampton Inn.  I went here largely on yelp reviews and was not disappointed.  I ended up doing take out, but ordered the penang with chicken (spicy) with rice.  The flavor was right on (almost like being in thailand) and the portion was a good size for the price.  I was also impressed that it was fairly spicy (not ridiculous) but nice and tasty.  The staff was friendly although my interaction was minimal.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "BuC9XytuFDp2HUYLGqBisw"
  },
  "AeW5OqebjOloZ5Kt4mXskA": {
    "date": "1/16/2013",
    "text": "Thai Basil is the best Thai food in Arizona that I have found so far. I have traveled all over the world and there was only one place that I feel is better. If anyone knows of a better Thai restaurant, please let me know and I will try it out. I really love Thai food. My favorite dish here is the Kang Dang, but I ask for extra juice and I put a little sweetner in it and mix it up. It really brings out the coconut flavor in it. Try it and tell me what you think! Also, the salad dressing is wonderful before your meal. I have gone to their locations in Chandler and this location and the food is the exact same and service is great too!",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 5,
      "cool": 6
    },
    "photos": [],
    "user_id": "KmQ_CaPWlNBuaxrwVTZt5A"
  },
  "M57on3gqrs7P0pDg1UtWsQ": {
    "date": "6/26/2013",
    "text": "Consistently good and fresh.  Great for lunch, although it is always crowded (because it is yummy).  Service is pretty fast and they cater to the business lunch crowd with their fast service.  Typically, we arrive and grab a seat inside or out, and someone comes by and drops off a small salad before we have a chance to exhale.  They charge a buck fifty for the brown rice, which I don't care because rice, and they will spice it up or down to your taste.  Signature Thai Basil dish is always a winner.   Tell em Candi sent you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "R1o7fAUOM_CWKBcQY8bbkQ"
  },
  "835Xt1l2NrHnhUZOYQkLmg": {
    "date": "7/30/2014",
    "text": "Some coworkers and I went there for lunch on a Friday. It wasn't super busy. They sat us outside on the patio. When taking our orders, we were rushed and not able to get a drink order in. The signature Thai Basil dish was amazing! However, the service was terrible. We had to walk inside several times to get our server's attention. He rolled his eyes at our simple requests (which would have added more revenue for him) several times and sent another server outside to help us. The attitude from our waiter was too much. Never again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jyn2c2p-tX7kWbUAzCEPfw"
  },
  "V1gVeMhuKHLfl66HkAU71A": {
    "date": "8/18/2011",
    "text": "I go to Thai Basil almost every week and the Panang or Massaman Chicken curries with brown rice are my faves. I like somewhere on the spice level between Medium and Hot, but I cannot do spicier than Medium here. If you are feeling crazy, try Thai Hot on the spice meter. Drink a LOT of water.  This restaurant turns out great food super quickly and you get a satisfying meal for $10.   There are 2 reasons why I can't give Thai Basil 5 stars...  1. You don't get the yummy free salad if you get an order to go And 2. They told me it would cost $1 for a to-go cup of my drink (The Good Egg next door gives you free to go cups filled fresh).  Still, great Thai food and a great group of waiters.  I'll be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "a-x7UEB0pREhblYRP1Cj-g"
  },
  "zftDNGdiNJqMBchlxh__Xw": {
    "date": "1/13/2011",
    "text": "I went during lunch time and luckily we got a table right away. Soon after, the place get really busy. Because the place is located in downtown business area, you'll see most of the customers are non-asian.   The lunch menu is limited to rice dishes, curry, and pad thai noodles. But you can still order from the dinner menu. We end up ordering papaya salad, which I thought was just okay. There wasn't much papaya in the dishes as they also overfill it with salad and tomatoes.  The best I thought was the tom-yum soup, which is sour, spicy, and a taste of sweet. I would recommend the tom-yum soup.  We try their signature dish of Thai Basil, which is a stir fry of your choice of meats and vegetables. The dishes came out really really spicy, which was a surprise to me. I should have tell them to do it mild.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "qrjoN017IOJbcHWmKy7Wag"
  },
  "7kLxIxWbw6sGVECsFm_3Iw": {
    "date": "1/3/2012",
    "text": "If you're looking for a good peanut curry or amazing Pad Thai, this is the place! My boyfriend and I go here all the time and we seriously crave this place like no other. Food is always excellent, good portions, decent prices. Take out or sit in we have always had a great experience. Friendly and fast service! Yum!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RNza1Za4IivWdU9mkr_rGA"
  },
  "PPV5ZqWkAHmp649cQSGj5w": {
    "date": "12/22/2010",
    "text": "When it comes to Thai cuisine, the first dish that immediately provokes my foodie thought is the signature, Pad Thai!  For this particular specialty, Thai Basil should be commended for quality, taste, and consistency.  To elaborate, while some places I have had come out overly mushy, the noodles here are soft and steamy, fresh off the pan, but what really brings this dish out is its sweet, rich, glazey flavor along with a fresh mix of crunchy bean sprouts and green onions.  I like to top it off with my choice of chicken that is cooked tenderly good.  [Entree = Under $10] [Warning: Very filling!]  Pad See-ew is my other go-to dish.  The wide, flat-style, rice noodles are cooked nicely and comes out hot and steamy the way I always like it!  Beef is my usual choice of meat and is cooked nicely holding that beefy flavor.  The big distinction that makes this dish so tasty and addictive is from the pan-fried, eggy flavor. [Entree = Under $10] [Warning: Filling!]  The service here I would describe as kind of robotic, but True Asian-style.  I come in, the waiter sees you, I tell him/her how many guests and then immediately directs you to an open table followed by their most delicious, complimentary starter salad and ice water.  All of that happens in literally 2 seconds (exaggerating).  My typical wait for my order is around 10 minutes.  The menu is not that extensive but it still boast a good variety from many curry-style rice dishes to (of course) pan-fried noodles.  The decor is very clean and contemporary with booth seatings.  Their salad dressing for the complimentary salad is unbelievable.  Its light, nutty, sweet and extremely tasty.  In fact, its soo good, you can buy a bottle of it to take home!  If you work around Downtown, you can take the Light Rail here but would have to take a 3 minute walk.  Also, Starbucks is located right next door to grab a little caffeine fix.  For the quality, consistency, taste, and reasonable pricing for a lunch during the work week, Thai Basil made it to my 5-star club.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "8DGFWco9VeBAxjqsuh1aSw"
  },
  "RdaCwJwaCjs4CUrpSvvJ4Q": {
    "date": "4/6/2011",
    "text": "The food here is great, the location is perfect, the seating arrangement on the other hand is about as comfortable as the DC Metro at rush hour.   I guess it says a lot about the quality of the food when you are willing to get stuffed into the seats like you are about to takeoff on a Southwest flight to Midway and still you choose to give this place 4 stars.    Unlike Southwest, the place gets you to your destination in one piece.  The portions are perfect, the vegetables are not over done and the little egg-roll with every meal is a nice touch. The upside to this place is that it holds top billing for thai style curry in the entire downtown area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "mLN1L_r8ZMrc5qsALwUuPA"
  },
  "tSsUXLRkjT2DQN2vhkxFhA": {
    "date": "1/4/2011",
    "text": "First time visit....I had two things on the menu.  - the chicken satay appetizer - pad thai  the chicken was just ok, but it the peanut sauce had the flavor and consistency of peanut butter heated in oil.  As for the pad thai, i'm not one of those pad thai snobs who went to phuket on vacation and now no Americanized pad thai is good enough for me. having said that, i was not impressed at all with the pad thai here. a big pile of noodles with little or no flavor except a sweetness that had a hint of the sauteed peanut butter from the chicken satay. the chicken was flavorless clumps as were the tofu. despite the bean sprouts, oily peanut clumps, etc, it was devoid of a variety in texture. I usually enjoy the the cool bean sprouts, the crunch of ground peanuts, the way the egg and tofu saturate with flavor, the acid and spice of lime/tamarind/pepper. ALL OF THIS was missing from this meal.  $19 later, very disappointed since this was the highest rated thai restaurant in the area. despite this, will not be going back.  Pad Thai is supposed to be the signature thai dish. I mean, it has thai in the name. if you can't do that right........?",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DwGAHYvjanMW5uu19LNemg"
  },
  "KN3NJiGUCSmHg4nH8hvi0Q": {
    "date": "6/19/2013",
    "text": "This is real Thai Food!  I am literally upset with myself right now for having seen this place for years and never stopping in...  What amazing Thai food and service.  I like spicy food a lot, and I asked them to make is extra spicy.  They did not just add peppers, they actually made it spicier with real ingredient that taste good.  The flavors were all separate and not blended together like many other Thai places I have gone too.  Best i have had!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SO8iSN5fjgUfNk5dUgXOrA"
  },
  "cWTJZxdAgHpASV2ZfPFCXw": {
    "date": "3/29/2011",
    "text": "Nothing too exciting.  The lunch dish came with a quick serving of salad drenched with dressing.  I would have preferred the dressing on the side.  As for the entree, I ordered the thai basil special with chicken.  Nothing really stood out and it was typical.  The vegetables seeemed overcooked because they were a bit too soft.  Otherwise the chicken was just thrown into the dish.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VFXKRVzEMbnsDcYFdwiiuA"
  },
  "SASMX8Pgzpyvsc1UaK9Lpw": {
    "date": "5/27/2013",
    "text": "The yellow chicken curry is absolutely delicious. The staff is friendly and service is quick. I love this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cuX-0-OLJzesWWLWuSAL1Q"
  },
  "kw7k9XNqyi4f6XQief3AWQ": {
    "date": "8/24/2010",
    "text": "Best Pad Thai I've had in Phoenix! And I've tried several since moving here last year.   Cute, smaller Thai place, but the decor is tastefully done. Friendly service and they do a great job of keeping diners in a tight lunch hour on schedule.   The homemade salad dressing is amazing and I love the fact that the little salad is included with any meal. If you live or work near Park Central, I would highly recommend Thai Basil!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "AIHzJz0AvTq0FxCLtBhOZA"
  },
  "5b0_S8OZAIL0k-ZwvZ-U7w": {
    "date": "11/6/2013",
    "text": "F yeah!  This place rules.  Curry is amazing.  Even if you choose a meat they load it with vegetables.  Nice serving size.  The Thai Basil and Ginger are also good menu options.  Yum.  Lunch special is really well priced without compromising quality.  Love them.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vbBKpDheA6liGV0oZYOMrg"
  },
  "lnYxe6uCS30B4rlJffToWw": {
    "date": "7/18/2013",
    "text": "Yelp, I feel a little let down.  Solid 4-star reviews, and I was expecting a really great meal.  Not that Thai Basil is terrible, but there are better options in Phoenix.  The Tom Kha soup was good, and the drunken noodles were good, and the yellow curry were good, but just not *amazing*.  My recommendation for Thai in Phoenix is Yupha's Thai Kitchen instead.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sOGVdjTzOMNMlVs1RWmjcA"
  },
  "xEqrAMklXOAJ5nKQBi3YPQ": {
    "date": "7/31/2013",
    "text": "Had lunch here today with 7 other persons.  I had the signature dish which I ordered with chicken.  I told the waitress that I wanted it mild like a  #1 hotness.  The tossed salad was served first, small, mostly lettuce but tasty.  It was at lunch time which is quite busy due to all the office building nearby.  I ordered before everyone got there since I had to leave early for a previous appointment.  About 10 minutes later the others in my party ordered.  I couldn't believe it when they started bring out plates for the ones who ordered after me.  It couldn't have taken longer to prepare since another person ordered the same a I and got thers before me. The food was good and just the right hint of spice. It is a very, very small restaurant.  There is an outdoor patio for eating when the weather finally cools down in a couple of months. Very reasonable lunch prices.  My bill with tax and tip was under $11.00",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JAs3HUu6w13nOXTp2ofkxA"
  },
  "x5st7IJrIktTQ3ZelEWv1g": {
    "date": "3/30/2013",
    "text": "Horrible! The rice is overcooked, and there is no flavor to their food.  I have tried this place three times-- never again! How can Thai food be so bland?",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7SbuXDelmsxtS3_fEwZfzw"
  },
  "s1gJWexeofucMtN2F8TVXw": {
    "date": "1/18/2011",
    "text": "Yesterday I was craving some Thai and after another restaurant wasn't open we were going to go to we decided to try out Thai Basil.  It is located in the mall off central and is a small little place with decent decor.    Upon walking in we were greated and told to take the open table in the corner.  We were handed menu's and after about 10 min our waiter came to take our orders.  For me it was a bit longer then needed but whatever I was ready to try out the food.  So I ordered the Panang Curry which is one of my favorite Thai dishes and Laura got the Pad Thai everyone said was the best here.  After about another 10 min we got our food her's came out a good couple min before mine which I thought was not professional but ok at least her's was hot and mine was too when they came out.  So I sampled her Pad Thai and it was good but not what I had been reading in reviews as everyone said it was amazing.  My dish was just ok the curry had no spice to it at all.    So overall it was ok Thai food there are plenty other places in town that I feel are better so I probably will head to them when I want more Thai.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ocB1WhramMTkICc5sZ1bUQ"
  },
  "LJ972OGKhf8AkqDOddmrmg": {
    "date": "7/30/2013",
    "text": "Great service, great food.  Why can't I get Thai food this good in Palm Springs?  Fresh, tasty and authentic ingredients.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "49mA3fO2VQOFtwpCij8Rgw"
  },
  "RlpvNTbXFRUGCHU2i_Yb3A": {
    "date": "1/3/2017",
    "text": "This is one of my absolute favorite places to go for lunch and any other time I can get here.  Fast service, great food and low prices you cannot beat for the deliciousness you get!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q6W2mO7PC961njwj4prZpQ"
  },
  "iD86FqS1TxlrxHBJsMbcqw": {
    "date": "8/3/2015",
    "text": "I really love the food of Thai Basil but the service is either great or terrible. The food and some of the servers make it worth the drive, time, and sometimes hassle.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fT-2znDqidFvpeuzblEXVg"
  },
  "a2w6pTakZpK0myVrDZfVeA": {
    "date": "11/4/2016",
    "text": "This is the worst Thai food I have ever eaten. The Tom Yum soup tastes like it has a pound of sugar in it. There's no discernible taste of lemongrass or Kaffir lime leaves. The drunken noodles is plain cooked noodles with vegetables. Drunken noodles should be swimming in a delicious savory sauce, and this was as dry as a bone. There is no sauce on the drunken noodles! What a waste of money. If I didn't live 20 minutes away I would have returned the food for a refund. Avoid this place at all costs.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pb5g9c7loWwhlTd47ukQig"
  },
  "dX4DEp6L1p40V1jsXHiBOQ": {
    "date": "9/2/2016",
    "text": "Besides the place being overly crowded for lunch (which is expected ), I really enjoyed the pad thai with beef. It was super delicious and the waitresses and staff were really nice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "3gO1bLv-EuraOnJuUVl0JQ"
  },
  "pPlCGnf1WGKWVOjU5JDLhg": {
    "date": "2/24/2015",
    "text": "I used to love this place, but I can't get over their roach problems. Health inspections are public record. Honestly, some of their violations just sicken me to the point that I will never eat here again ... and I eat at some sketchy places in Guangzhou, China several times a year. If a girl who eats chicken stored on the sidewalk won't eat your food, damn.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "T8LqkYbwMPZmvXSsUfN8sQ"
  },
  "dz8bEPTaw0PHRsPKqp25YA": {
    "date": "4/2/2015",
    "text": "Very fast service with friendly wait staff, albeit always looking just a little bit stressed out.  Moments after you sit you get a salad with Thai sweet dressing, as well as a menu. Pretty good selection for a small place. Been happy with every dish I've had so far. Fast. Great food. Plentiful portions. My go to spot for lunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "vcfv1rruFN-ZRSgpfAyq1A"
  },
  "dWzoVCgc2CAkTXTHrI5aLA": {
    "date": "9/2/2014",
    "text": "Food was pretty quick and delicious! Mango sticky rice was divine. Although the thai hot wasn't very spicy.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "CHbFD2Td9DKBF16ERYmmFw",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Mango sticky rice!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CHbFD2Td9DKBF16ERYmmFw/o.jpg"
      },
      {
        "img_id": "x66GEU7pXk3B0EaNhpLz3w",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. I think he&amp;#39;s full, that makes two!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/x66GEU7pXk3B0EaNhpLz3w/o.jpg"
      }
    ],
    "user_id": "WKpADdu_0YjbD7Kmd2aEQA"
  },
  "cZwDzEJA9L17eV0KuXAy2w": {
    "date": "3/29/2012",
    "text": "I love ordering their food Thai-Hot (thats the hottest you can get here). If you like you're food spicy, you can't go wrong. Their pre-meal salads; which come with every dine-in meal, has an awesome salad dressing. They also sell their salad dressing for ($5) to take home. I forget how many oz. they said it was. I think its close to 12 or 16, but don't quote me on it. Every meal seems to come with a slice of fresh cut watermellon.  The watermellon is a nice refreshing pre or post meal snack and also light on the added calories; although the rest of the meal may not be.  My favorite dish is their garlic dish; either rice or noodle, ive had it with chicken and tofu before. The tofu is prepared in such a way that it has a crispy outside and a buttery inside. I don't think that I've ever ordered a tofu dish before and thought \"I might order this again some time.\"   Their lunch meals will cost you about $10-$11 after tax + tip, so I don't visit all the time, but they are a great choice if you can't stop thinking about thai food and you're in the midtown area near central ave and thomas.",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 8,
      "cool": 2
    },
    "photos": [],
    "user_id": "8SgjU2fID9VqKQooFt1DIQ"
  },
  "z8fPdL6qfSnaiBJQm4A-sg": {
    "date": "5/10/2014",
    "text": "This is a pearl hidden in Park Central. Sort of charming inside but comfortable. Clean, great service, and the food is so wonderfully prepared.  Hard to find as their sign is behind a tree. Just a couple of doors north of the Starbucks.   Tired of Pei Wei as we are?  Go HERE for better food by far.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "gTlIDNuzemhFTuXQx_3MfQ"
  },
  "o8Nbs5N9a8n96RrspV54Mg": {
    "date": "2/16/2016",
    "text": "I go here for lunch often.  This is a VERY BUSY central downtown location.  If you go early or late, you can usually get a table without a wait.  Small shop - so if you are looking for a place during the busy lunch hour and are at all claustrophobic - avoid it.  The Penang Curry is SO delicious - I get it every time.  Food always comes out quick and hot. Staff are average.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "swiK1vMSjRW8ud46RTHR8g"
  },
  "sUOn6WUbCH3B_YTtQQK-Sg": {
    "date": "10/24/2016",
    "text": "Food wasn't good at all  Not even thai coffee.! Find somewhere else to eat save yourself a disappointment.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1tIVcMbmsJnS7JMmq_xyaA"
  },
  "77K8jyIbVhH2McDF5J9Ybg": {
    "date": "5/16/2014",
    "text": "Another exceptional lunch at Thai Basil!   Pleasant service and a calm, clean atmosphere make this a go-to whenever I find myself in Phoenix.   I always order the same dish and I am never disappointed. The Thai fried rice comes loaded with carrots, cabbage, broccoli, peas and your choice of meat and seafood. You receive a spring roll with your meal, which is closer to lumpia. Delicious! I always find myself ordering an extra side of the sweet and sour that comes with the spring roll because it compliments the rice so well.  Almost forgot to mention the complimentary salad you receive at lunch. Simple salad, but the dressing is to die for! (I also hear you can buy some to take home now!)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "YT-Njvf18gINXK49AOtgBw"
  },
  "LXLcpH_HOPWp7jhCvUK6BQ": {
    "date": "10/17/2016",
    "text": "I came in, ordered food, sat for 20 mins, and the first thing i got was the receipt? Btw the food was really good:)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kszac3OHPpWNENAi91Gurw"
  },
  "mdIvrvQ8uMXDncmLD45jiA": {
    "date": "10/5/2016",
    "text": "The calamari appetizer was probably best calamari I have had anywhere not close to the ocean. Green curry chicken is excellent dish as well. Flavorful and colorful.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gPRqo8Bc1XbK2ELqj5i-3w"
  },
  "xLny5yU4AxR8muJoxQmOxQ": {
    "date": "2/1/2016",
    "text": "First time ever at Thai Basil. This location is SUPER small inside and they were somehow able to accommodate a table of 11 at noon. Service was fast and food was on point. Coworkers have said it can be kind of hit and miss but I was pleasantly surprised. I had the Thai Basil Chicken lunch special, it comes with a salad, rice, and an egg roll for $10.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "PJRDBGVCrgk25IGJbDqlWQ"
  },
  "Qo7MBQqOuSmhFUkyOOJ6_A": {
    "date": "1/13/2014",
    "text": "Another run-of-the mill Americanized Thai restaurant that seems to be the norm around AZ.  Rubbery meats, American broccoli, boring carrots and zucchini. No spice factor, few herbs and fish sauces, no authentic dishes, or dishes done authentically. Where's the roasted duck red curry, larb salads, Asian/Thai vegetables, whole-fried fish, papaya salad with blue crab? Oh, I forgot I'm in Central Phoenix. Geeze, I'm such a food snob. If ya'll think this is good, your mouth will MELT when you get the real stuff.  On the plus side, it's a nice, small restaurant and was very busy at lunch. To-go orders don't get the house salad they serve but you do get a little eggroll wrapped in foil.  My search for  True Phoenician Thai food with bold, complex flavors continues.  Any leads would be greatly appreciated.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "v6SrDjzqb3oS6CbHB0xjPw"
  },
  "4kwWPaTWFtpmj-FTLxHIyA": {
    "date": "3/10/2015",
    "text": "I went here for dinner while staying at a nearby hotel for work. Very good place to eat. I had the seafood pad Thai (medium) and the mango sticky rice and it was very tasty, esp the mango sticky rice!  The seafood dish had good amount of seafood: shrimp, scallops, calamari, and tofu :) the dessert was just perfect! Friendly and attentive staff & nice patio to eat outside too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yLEKZTluDn3S7umGs4HaLQ"
  },
  "Aev5f5WXAIXlFr15-_0d6A": {
    "date": "2/29/2016",
    "text": "I thought I was being a trooper when I decided to try \"mild\" Thai spice on my pad Thai and started crying tears of pain with every bite. Turns out they mixed my order up with my boyfriends, who ordered \"thai hot\" spice on his calamari dish, which I'm allergic too and can't swap with. This was our second trip here, and since the first trip was during a lunch rush and we figured it would be better when it was slower. Sadly, it wasn't. Not going to be returning.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NVcg4OMXwj3fBVwi8QAUww"
  },
  "cw4udxpTKcbM_635dFiQAA": {
    "date": "1/13/2014",
    "text": "I was looking for a Thai place close to me and was pleasantly surprised that Thai Basil is literally within walking distance. I ordered the pad Thai and spring rolls to go. The sauce they give you for your salad is so good (comes with the spring rolls.) I loved everything. The pad Thai could have used a little more sauce but overall this place is fantastic. Won't be my last time here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "FBtrgXJ7kBOBrakUUhoAnA",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Chicken pad Thai and spring rolls. Too yummy.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FBtrgXJ7kBOBrakUUhoAnA/o.jpg"
      }
    ],
    "user_id": "pazeYPyJ2ycDiNDcmamntQ"
  },
  "iEv_2d8nR-SbfLexjAxS3w": {
    "date": "7/14/2014",
    "text": "Came in for lunch with the wife. I'm not one to try something new and we saw it passing by. I was surprised how good the food is (pad Thai with beef). I will return again next time I'm in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2kApE56NRa_qX7BAYoKPKw",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2kApE56NRa_qX7BAYoKPKw/o.jpg"
      },
      {
        "img_id": "owRvC2pnDZXw1TBx7tZWcg",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/owRvC2pnDZXw1TBx7tZWcg/o.jpg"
      }
    ],
    "user_id": "8i1-zGQofkauZAvn45oBJQ"
  },
  "vwtMQ55XO_EX-hTHQ_gu6w": {
    "date": "11/7/2017",
    "text": "Went on a weekday night for dinner.  We ordered the fried calamari for appetizer, the Thai Basil signature dish with beef and the Pad Thai with chicken.  Everything was good.  The Thai Basil signature stood out as very flavorful and would return just to get another bite of that.  The Pad Thai had a very sweet flavor that I didn't care for.  Overall not a bad option to try in the Park Central Mall area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wMfTvDDP7r8mUUdG5wVjKA",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Pa-Ga-Pao Signature Dish",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wMfTvDDP7r8mUUdG5wVjKA/o.jpg"
      },
      {
        "img_id": "CaumxSuhw0UMvIP2n1FJuA",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Pad Thai",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CaumxSuhw0UMvIP2n1FJuA/o.jpg"
      }
    ],
    "user_id": "JeNX6m9YN1WcZomVi7QH7A"
  },
  "AHlWsNeTvCFdGhBcbHp6fw": {
    "date": "9/22/2016",
    "text": "I came here for a quick lunch as it is less then a block away from one of my work locations. I got their signature dish thai basil, and I chose tofu for my protein. The salad was a surprise to me, and I enjoyed it, and as other reviews said the dressing was really good.. The food came out really quick, which is perfect  for a work lunch break. I was looking for healthy and tasty, and this hit the spot. Very light flavors, but flavorful enough. The vegetables tasted fresh with that slight crispness that I like, and the spring roll was a nice addition. Not every restaurant can pull off tofu well, but they definitely did. I think this is a great spot for something light, relatively healthy, and quick.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xx-kKAicpAnsTry1pmJyGA",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Tha Basil dish with tofu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xx-kKAicpAnsTry1pmJyGA/o.jpg"
      }
    ],
    "user_id": "UoSoGxXbIWONtBEch2dYdg"
  },
  "SkrJu02Y2G2Pj-lJiBssxQ": {
    "date": "9/30/2017",
    "text": "The hotel I was staying at had it on its list of recommended restaurant.  When we got there the staff was very friendly. I had the pad Thai with chicken.  A homemade sauce is used to prepare the dish unlike other Thai restaurants that use a pre-made bottled sauce.  Everything was delicious.  The place was clean the prices were fair.  The decor was nice.  I would definitely recommend giving this place a try.  I saw a few other dishes like the curry and the papaya, both looked very delicious.   The Tom yum soup was also very delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jTR_Lp5hSnoQiU3u_wqSjQ"
  },
  "TnlViLXtIFSmD8UdtDTD3A": {
    "date": "4/2/2018",
    "text": "I waited a few days to cool off before I wrote this. I didn't want to be emotional. I was pissed when I was there last Wednesday. I visited around 1:30pm, after the crowds hoping for good service and expecting great food. I ordered the chicken massaman yellow-curry mild. I received theeee largest bowl ever, full of watered-down curry, with less than half cup rice noodles and a few chicken pieces. I'm like WTF!!! $9.98 for fkn WATER! Was provided a cup of ice-water with no straw. Not once did anyone asked me if I wanted anything else. Before I could drink the curry , the check was placed in passing by a server and kept going. So the lesson here is if you want real Authentic Thai food cooked by Mexican-kitchen staff , served by some kind of Asians, with the skimping ass food portions, this is the place for You!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8X_VVWm_WQwFl5ctyBJZ0A"
  },
  "LqbQZEyn58lU8zczXa_5qg": {
    "date": "3/17/2016",
    "text": "What a pleasant surprise this place was!   One of my coworkers was in the mood for Thai after a work function. Though I'm not super familiar with the cuisine (I've maybe had it 2x ever), I'm not a picky eater so I figured I'd give it a shot.  The vegetarian yellow curry dish was ABSOLUTELY amazing. The creaminess of the curry and coconut milk paired with the veggies and rice literally melted in my mouth.   Service was wild fast for lunch time. As soon as our butts hit the chairs, we were served ice cold glasses of water along with menus. A few minutes later, we were served a side salad that came with our meal. Honestly, the salad couldn't be anything much more than bagged iceberg lettuce, but it had the most amazing peanut dressing on it. It wasn't hard to gobble up and I can see why they sell it by the bottle for customers to take home.  About 10-15 minutes later, our entrees were served. Super yummy food and great experience all around. Definitely excited to return!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xEUsXVpbwuM5_nR_rECk0Q"
  },
  "DeGIlbnkcbm6emYzV8DR2A": {
    "date": "8/2/2017",
    "text": "On the low side of mediocre. Not the vibrant, fresh flavors I have come to expect from Thai food. Underwhelmed. Do yourself a favor and go to Sala or Reign of Thai.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cft4NiF2guRW08CZ5iZApQ"
  },
  "cOubPGupo4P2HbDzHfh5tA": {
    "date": "7/14/2017",
    "text": "I visit this place quiet often and I always find the food very tasty, I ordered almost everything from Menu and the food is always good. They have friendly staff and service is very quick. My favorite dish is Crab Fried Rice and since it is lunch special they have it for 2 months, I wish they include this dish in the regular menu.  They recently introduced soup's in their menu, will try it someday.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nk2he6xB2H5AyEotso127Q"
  },
  "vXYC0ZBWRUmLZXr78bB2JQ": {
    "date": "5/2/2017",
    "text": "Love this place. It's fast and convenient for hospital employees as you can order a head of time. Their Thai tea is to die for. Sometimes I go just for the tea!!  Staff is super friendly and always helpful when it comes to trying new things.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iDQceRXYSfg-pG3oKYX4JQ"
  },
  "UFdPHli2SjQiwbVlXFEUPQ": {
    "date": "3/13/2018",
    "text": "Kind of ok. Food doesn't always taste good. Sometimes tastes old. Servers are nice but could be friendlier. Prices are good. I go often because most of the time the food is good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RkJ1xykHTXP9eyFIGs2pJg"
  },
  "8AX_6ATQdko0SOGB6Drpdg": {
    "date": "5/27/2017",
    "text": "I just came here on a whim while in Phoenix for COMICON. Food is alright. They are very quick with the food though and the place is very nice!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sr89NvVHqqmsoILtrZapJQ"
  },
  "PgvhSIXwjrhlAqTo7yoV2w": {
    "date": "10/27/2015",
    "text": "I was not impressed with this place.  However the staff was very nice and i didn't have to wait long for my order. . I ordered the pad thai chicken for lunch.  Price was ok but the meal itself wasn't.  Barely any sauce,  no flavor. Too many bean sprouts too...I'm thinking the deep fried tofu they put in it was to replace having to use more chicken?  Whatever the reason, it didn't make it any better.   I've eaten a lot of thai food and this just didn't do it for me.  May try once more but not positive. Depending on how hungry I am.  Thanks for reading :)",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "m2pp-8JLBQ4-m8eHZCtn5A"
  },
  "O9a7MS-EfrabwIWda6zlYQ": {
    "date": "1/31/2018",
    "text": "Yummy!  Inexpensive!  Filling!  A nice lunch plate. Generous portions. I will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wGViZzuydcFsNLn2gzXhEg"
  },
  "50DjuZx9rcAF4vzAo9DZ5A": {
    "date": "8/17/2017",
    "text": "We had eaten in the restaurant once before but opted to do take out tonight. It was 3.5 stars. Tonight my husband had yellow curry and I had pad see yiu tonight. Boring, no flavor. Mostly dry noodles. So unsatisfying. We won't be going back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QSYcV3qN7cSlu-CoGTp9KQ"
  },
  "oou0NLvTuTrzNMEZPCLg9Q": {
    "date": "1/30/2018",
    "text": "Consistently delicious and quick service every week. I've tried every lunch item and they are all fantastic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dalo9O5jI0qdEL5PTqOaWw"
  },
  "o5HGeNX9hmHE9Cu-dfEIOw": {
    "date": "8/13/2015",
    "text": "This place was a huge disappointment.  I saw the reviews but still came here against my better judgement because I was in a hurry.  I ordered the \"Thai basil\"(supposedly their signature dish) with chicken to go.  It came out really quickly which is probably another reason why it was so bad.    One word that should never be used to describe thai food is bland and this was BLAND.  The sauce was really thin and watery and the dish tasted like very lightly seasoned steamed chicken and vegetables.  On top of that I also ordered it medium spicy so I can only imagine what mild would taste like(boiled??).  The one pro with this dish was that you didn't have to eat much rice with it considering how unflavorful it was so....",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "UXLb_8UO2jrZT9cJ_ILdPA"
  },
  "U_GJ5qapinIn2FXnWxpQhw": {
    "date": "12/18/2013",
    "text": "Came here for lunch during training at Interface, I was feeling sick so I just wanted a soup with tons of vegetables. They were friendly and fast.  I asked for a recommendation and I ended up ordering some sort of bean noodles soup... with lots of vegetables.  The only thing is that like mid lunch I realized the menu said the soup had mushroom and my bowl didn't have any. I got the attention of one of the servers and asked it about that.  He apologized an offered to get me some. I got a small bowl with mushrooms, when I put them in the bowl the soup was kind of cold for raw mushrooms, but my left over the next day were delicious : )  Good place for lunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "z_tqPytGQF_tDw_buHKJcw"
  },
  "J5mo9W__LAo-XSmJJ-4eKQ": {
    "date": "4/3/2017",
    "text": "The spring rolls are full of iceburg lettuce, I would avoid ordering them. The green curry was tasty though. Overall, I was a bit disappointed with or experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D-ORarvteDCaMFL70GTyLg"
  },
  "hcp-8RaHmHg24etN7jAelA": {
    "date": "10/20/2013",
    "text": "Yummy Thai!  Looking for dinner in the area, we would have this place had it not been for Yelp! and the positive reviews.  After locating it next to the Starbucks, we parked and piled in.    Service was fast and polite.  There's a good menu full of options that should cover every palate.  The patio setting on a nice night is not pretty.  But, you're there for the food/service and not the sights, right?  The meal: 1) Apps: Tom yum soup and chicken satay were tasty.  I'm not usually a fan of peanut sauces, but theirs rocked.   2) The salad and dressing also received compliments around the table.  3) Yellow Curry with chicken, Siamese Salad, Beef Thai Basil, and fried rice (for our little girl) all made our group happy.  Flavors are excellent, meats were tender and flavorful, and the portion sizes were perfect.  We'll definitely visit this place, again.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aOAqs5leMNiPSbszvE-_Cw"
  },
  "I5xCSquJUr8mahrSATvbcA": {
    "date": "3/8/2016",
    "text": "Food was so yummy!! I couldn't make up mind mind and it took over 15 looks of the menu to make up my mind. Lots of choices and all reasonably priced. Our table ended up with spring rolls, tea, seafood grill, pineapple fried rice, chicken noodles, chow mien...it was all DELICIOUS!  The service was great too! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3zv3fGYMF33yX4EuD4OVnA"
  },
  "ZzhRwdzY73KYqawIZ24RkA": {
    "date": "2/7/2013",
    "text": "It wasn't remarkably fabulous but the food was good and the place was packed.    I'd return.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "rKxcEeL7ar09x5TumBVhkg"
  },
  "LPCVYRZKf4T8cOYBqUTJSA": {
    "date": "4/10/2015",
    "text": "The service is fast, servers remember you and food always tastes great. Love their green curry chicken lunch special! (It comes with a slice of watermelon... never seen this before at a Thai place, but it's delish!)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lShUymBJ31NwL7og9VBqVg"
  },
  "KfLsoiwGy7P4oDsT3W4ZWw": {
    "date": "5/19/2015",
    "text": "Fast service and good Thai food. Perfect for a quick lunch away from the office. The staff are quick to refill drinks, my water was never empty. Will certainly be eating here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H9g0ztsdJ5dAIk8ea9YSkw"
  },
  "3gv9GA0f-eNDURbWy82W8w": {
    "date": "3/16/2015",
    "text": "Ordered the chicken paht thai to go, delicious! Chicken and noodles with a wonderful taste. I like that they did not use Styrofoam, one of my pet peeves. I'll be back Thai Basil!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OzETGbgcAn8udzCgzUjp0g"
  },
  "nIda_Gy1GAAff1aDT3zLUw": {
    "date": "3/22/2012",
    "text": "Nothing extraordinary here.  Service was good and food came out quickly.  Portion sizes were alright for dinner and the prices aren't all that bad (or great).  Food was alright, not great, not bad.  I had the Thai Basil and wife had a cashew dish.  The hunt for a good Thai restaurant in Phoenix continues.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "UodOBKFEFy4M_lCqw9q2jA"
  },
  "tCGBRl-sCv4o9apuO3KOjw": {
    "date": "7/3/2015",
    "text": "Good service. Ok food. Not much to really say about it. Wouldn't recommend to friends but Thai tea is amazing",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Q4Piq5G4qs_ua5UWKTsVA"
  },
  "fYj8uiIoj3aoqVxFgLMM4g": {
    "date": "7/21/2014",
    "text": "I have been at this Thai Basil more than a couple of times, but today will be the last time. I was seated on the far right table close to the kitchen by the wall. I was enjoying the peanut curry with Thai tea. As I was finishing up my meal, I had a weird feeling and looked at the wall to my right to see a disgusting roach I quickly moved over and looked up to the wall behind me to find 2 other small roaches.... I almost puked! PLEASE if you care for your health DO NOT HEAT HERE.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vLvC_BGa0dw3HWGVhz2YkQ"
  },
  "z683DR5ul5HITJdoybU_0Q": {
    "date": "8/12/2013",
    "text": "The food here is excellent - this is one of my go to restaurants for an inexpensive meal or takeout. The food is very fresh and flavorful. The service is quick and the servers are very friendly.  5 stars for food  5 stars for service 3 stars for ambience",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_clGFYYYU76sEe50ms6PQw"
  },
  "M3Zy5rkoJh_lEJtmUy811w": {
    "date": "7/4/2014",
    "text": "Love this restaurant.  Great curries, lovely salad dressing,  noodle dishes are wonderful.  Great service.  Very friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UF2QmPaLe0HNTCV8uSLmSg"
  },
  "lSmNEah75FOmtNmGuAglpg": {
    "date": "6/17/2014",
    "text": "I got a take out order of Thai basil chicken when I was staying for a night at a hotel nearby.  The food was excellent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "m83Z1G98xpSTbnJ3tgssyg"
  },
  "t5PuenQp9OM0ADfa-hIKpg": {
    "date": "11/9/2011",
    "text": "The food is great...service is pretty fair enough (during the lunch crowd). The only reason why I can't really give this more stars is because...well...I'm originally from Cali and they have amazing Asian food there that just can't compared to what you get here. But this place is great and I would definitely recommend to try their special of of the day (they have been so good thus far). I don't eat salad, but I've heard so much good things about their salad that comes with your meal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vuGhPGaUOulvt_t6B8_iZw",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vuGhPGaUOulvt_t6B8_iZw/o.jpg"
      },
      {
        "img_id": "pC_pjQjYB4gJPJiQHsq9WQ",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pC_pjQjYB4gJPJiQHsq9WQ/o.jpg"
      },
      {
        "img_id": "1p2xYYfCRw1ThyKlfif0kw",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1p2xYYfCRw1ThyKlfif0kw/o.jpg"
      }
    ],
    "user_id": "PaUcJDgJX3pEbCIFX0R5fw"
  },
  "12SB8LT1yBv_oCqi1K68kw": {
    "date": "9/2/2012",
    "text": "I decided on grabbing some Thai food last minute, read reviews and dined at Thai Basil. Very yummy food :) Good customer service! I saw a few people stop in for take out orders while I was there, so I know that's available too. My only dislike was that the Thai iced tea was WAY too sweet; I wasn't able to finish it :( I will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5GDvJL1tZN_jQPD6X7DqOw"
  },
  "LFMViecWisi755fDI3rjSg": {
    "date": "9/21/2015",
    "text": "I ended up with a piece of glass in my good. I'm very lucky it did not break my teeth after chewing down and breaking the piece of glass in half! It has always been a great place to go, but after my experience today, including the wait staff just blowing it off, like it was a common occurrence?!?!??? I'm sorry when there is GLASS in your food, may it be in the rice or the sweet and sour chicken sauce, you SHOULD BE CONCERNED! I will never go back! I've been there soooo many times for lunch! But what the heck?!?!?!? They didn't charge me for my meal, but the people I was with, who obviously stopped eating their lunch, still had to pay.  I'm sad that this happened, but they should at least have acted concerned! I would have taken a photo of the glass to post, but it was taken away VERY quickly!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "TGe1FhKY5OG88U0TGuGhaw"
  },
  "VqL1xadYU9-4qCi4KwybPg": {
    "date": "3/18/2014",
    "text": "I've been here twice for lunch. Lunch special includes salad, egg roll and entree all for around $10. The place gets really crowded around lunchtime, but turnover moves quickly. They are lacking on customer service. I asked for extra napkins twice which never came. It feels like they are rushing you out to make room for the next person. The service doesn't feel personal. Overall, good bang for your buck.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9jA5_7o9V4m6i8ZRb4t6LA"
  },
  "mSdddVEpCusLuhcMX2mLXw": {
    "date": "5/14/2014",
    "text": "Ordered the red curry with chicken. Tasted good until I found a roach in it. I will not ever eat there again. Disgusting.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F81El1KlsyT0UZkUXGOFEg"
  },
  "UZOSVVCXWsXeubgHbAApWA": {
    "date": "1/18/2012",
    "text": "Great food and jam packed at lunch.  Love the dressing they put on their salads.  Ordered the Signature Dish (Chicken Basil) and loved it.  Comes with the salad, white rice, and a mini-egg roll.  Service was excellent and food was prepared very quickly and came out hot.  They have one little oddity:  If one dish is ready before the others, they'll bring it out.  So most often the orders sort of trickle out to the table.  Doesn't bother me but I found it a bit strange.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RNKwQjJ3cKRUnsaTjB7NrQ"
  },
  "8oK8BtI1ju0qCbVcRG_Sjg": {
    "date": "5/3/2011",
    "text": "I really like Thai Basil because every time we come here the food is tasty and the staff is very friendly. It's great for take out or to eat there.   If you go to Thai Basil, you have to try their signature salad dressing. It's so good it's like liquid crack! I was so happy to see that they know sell the salad dressing for take home (it's $5 and you get a good amount).  For dinner, I decided to try something different so I ordered the Spicy Noodles. It was really good with chicken, panfried rice noodles, and a variety of vegetables. You can really tell they use fresh vegetables and good ingredients. While the dish was delicious I would have liked it a little bit more spicy, especially with a name like \"Spicy Noodles.\" I have had all there curries and they are all terrific but the best one is the yellow curry.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "R8XGiSYNv4aTzy1fHUyRyg"
  },
  "m8HqIuYMCSbpQRlfjaT8Zg": {
    "date": "8/20/2012",
    "text": "My usual Thai restaurant stop while traveling for business  Service was good and food came out quickly.  Portion sizes were good for lunch and the prices are on par fo the food.    Food was alright, not great, not bad.  I had my usual Pad Thai Shrimp spicy and ordered an bowl of Tom Kha Gha (coconut soup).  Lunch meal came with a small eggroll and s slice of watermelon.  I liked the soup because they spiced it up.  I was pretty full for lunch and just by-passed the salad and went for the good stuff.  My only gripe was if you go for lunch, good luck with seating.   The inside is packed and tables are close.  We ended up sitting outside, under a fan and next to a mister from the restaurant next door.  That was a life saver, as you Phoenix is brutally hot at noon.  I would go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zsJVi4za8oA_kXwj0fJlvQ"
  },
  "C0U7jV0rEAkCBG0JraInGA": {
    "date": "11/15/2013",
    "text": "I eat Thai 3 or 4 days a week.  I generally spend at least one of those days at Thai Basil.  It's a really great spot for a quick lunch because they are FAST.  There's a good selection of lunch special items.  All the food is fresh, hot, and tasty.  The appetizer salad that they serve has a dressing that makes my life worth living.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ra1B--GCViFqx_ZcIk1UWw"
  },
  "GGIkQNAoVnYyHg3B2m-Yqw": {
    "date": "1/17/2014",
    "text": "The Thai Basil on Central is my favorite midtown Thai restaurant.  Super fast service and friendly staff are just the start. The curry here is amazing, though my husband and I agree they are usually skimp on some of the ingredients like potatoes.  I usually can't get my curry as spicy as I ask for (either I'm becoming desensitized or \"Thai Hot\" doesn't mean hot at all here) but that's really the end of my complaints.  If you want a fast, hot meal that's flavorful, Thai Basil is your joint.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LttyXNRPmSgiwWADfOfedw"
  },
  "OQuDEKWmY-SZzlAv5ARSRw": {
    "date": "8/25/2013",
    "text": "I have driven by this place so many times and always say I am going to stop in...well, we finally did!  The food was quite good, but the service was definitely lacking.  They were more interested in talking to each other instead of serving customers.  The decor was standard and I didn't like that you could see the kitchen...since all they did was talk to each other instead of cook.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "cMEtAiW60I5wE_vLfTxoJQ"
  },
  "A07BW7pODSFf4oCBTGd0OQ": {
    "date": "1/30/2017",
    "text": "My wife is a big fan, and now I am too! She told me about the salad dressing and how yummy it is. I said ok but I'm getting soup because I love soup. We arrived on a Saturday and it was just a wonderful experience from start to finish. We did not even have to order salad, it just came to us right away. And salad dressing is zingy and super tasty!  The WOW! A menu just for soups! Pick your broth, meat, noodle, and it comes in a big bowl as a meal. So many veggies in it. Even cabbage. Love cabbage cooked just right and not thin and witty. Carrots just right too. Soup has to be hot. It was! Love the spice, clear noodles, and believe it or not that soup somehow stayed hot the whole time I was sucking it down. Yeah, I think I highly recommend the soup. Service was good too but it was not busy. And I enjoyed my Thai coffee as well. 5 stars on this Thai-day Saturday!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZDyfDJZbQok_BBTjlI2t_Q",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Clear broth with clear noodles, beef and lots of veggies!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZDyfDJZbQok_BBTjlI2t_Q/o.jpg"
      }
    ],
    "user_id": "uxR4jshIdy8mdAX7pCpSZg"
  },
  "vL4xrWCQMMYiG5vuSdNTNw": {
    "date": "5/23/2018",
    "text": "This place is constantly delicioussss. A coworker introduced me to this place and I can't get enough of it.  I've gone over ten times now for lunch and I have not been disappointed yet. I have tried the Thai basil signature dish with chicken & mild spice. The garlic dish like above chicken & mild spice & the fried rice which I think is the first thing on the menu again with chicken and mild spice. The portions are good and if you eat in they serve a free delicious little peanut sauceD salad free of charge. The inside restaurant is small but well decorated and clean and they have a nice outside eating area as well although I don't think they compensate the heat with misters. The only thing is in my experience if you have a large party be very attentive to your change & make it clear you want separate bill from the start. Splitting the bill seemed to cause them a lot of confusion. Other than that service is great. They're quick and attentive. All in all the food is amazing I'll always come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OCdSrAefrNI5r-eQCU07PQ",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Thai Basil (pad-ga-pao Signature Dish)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OCdSrAefrNI5r-eQCU07PQ/o.jpg"
      },
      {
        "img_id": "P_c7TNERGIBDF7dm5IYkdw",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Thai basil signature plate  covered in sweet &amp;amp; sour.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/P_c7TNERGIBDF7dm5IYkdw/o.jpg"
      }
    ],
    "user_id": "73GDT2JeWokSRC2KloEscg"
  },
  "lkpPmhL6RujYJfJU85CXTA": {
    "date": "5/16/2018",
    "text": "Delicious!! We're visiting the area from L.A. we found it driving around. We're definitely coming back tomorrow. I ordered The spicy noodles. It was delicious . Service is great and fast",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iAmufiB-RMsT4IkcMR3Nhg"
  },
  "ocTwyn_Xn0ecoctt46ygcA": {
    "date": "5/14/2017",
    "text": "This location of Thai basil gets extra cred... why? Because they have build your own curry noodle bowls!!! Oh yes.... this is a giant bowl of whatever curry you want paired with noodles of your choosing and it is fabulous..... also, it is inexpensive (under 10$). I would come here for that alone.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "d_TBs6J3twMy9GChqUEXkg"
  },
  "LPwuEYE2GSMbLjT5o9yugQ": {
    "date": "3/25/2018",
    "text": "I love this place!  First restaurant I visited in Downtown Phoenix and I was blown away with the great service!  Their yellow curry is amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ljuvBNNhI3zhuKel0THk0w"
  },
  "ZuVjNHYei18Q9c0x7lGXPA": {
    "date": "3/9/2018",
    "text": "First time here. Also last.  Place wasn't very busy so you think the wait staff would have been more attentive. I had to get up and ask for chop sticks and my wife's tea. There was no call back to check on how the food was. The food was good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LvvGpkL8XpqyZxR6FVLSUw"
  },
  "UlnjNY4RGXm9CIyhP7qtLw": {
    "date": "9/29/2017",
    "text": "Thai basil, isnt the best thai food ive ever had. Spring roll sauce was too salty. had their noodle boat soup. it was lask of flavor. Then i tried the thai sausage, too salty. Was not able to finish the fiod. had to ask for a to go box, couldnt eat it the next day. Hopefully they will consider cooking their food not too salty.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lleo6dQZDX9rof1xbDeNaQ"
  },
  "N_2aNXivW-R9i6pU9Sl2qA": {
    "date": "9/18/2018",
    "text": "Tried this location for the first time and got take out. Everything we was really great except the pad Thai was missing a bit of flavor. Other than that the crab puffs and potstickers really great!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H-NOY_VLgKV4pV9ZIaO6Hw"
  },
  "hEVc8njLPngS_aQFZhnuMQ": {
    "date": "9/16/2016",
    "text": "Central location in downtown Phoenix. This location is in the strip mall next to Starbucks. Great daily lunch specials that are affordable. This location is great about serving you hot and fresh food. Out of all the Thai Basil's this one is not my favorite. The quality of service and taste of food is not good as the others. The last visit I had earlier this week was during lunch. The restaurant had plenty of tables open as we beat the rush lunch crowd but that did not slow down our server. She was not the friendliest wait staff. She seemed a little frazzled and had no smile. My order did not come our right however, I decided to try my best to enjoy it. My chicken was dry, the sauce was scarce and I do not believe I got the order I asked for. My friends order came out perfect. I asked for extra sauce and the server told me she would have to bring my plate back and they would remake me a new one. I did not want the trouble so I settled. We paid our tab with no thank you for coming in. I honestly think if they stepped the service they could win me over. I am in no rush to return here anytime soon.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "ofxbM2i4e7kRqPIsITk0Og",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ofxbM2i4e7kRqPIsITk0Og/o.jpg"
      }
    ],
    "user_id": "tCbEkK11lnqeaNVkhlurrQ"
  },
  "1xkp2wrV6oeZ6kIvQpWyiw": {
    "date": "12/13/2016",
    "text": "solid thai. not the greatest, not the worst. my main gripe really was i wasn't overwhelmed and flooded w the portion of food.   however, i really enjoyed the super tight seating arrangement during the lunch rush. i felt like a cool new yorker, elbow to elbow with a stranger who was reading a newspaper. maybe i watch too much Mad Men, but this is the stuff that pleases me",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KiwvYxl4NPyxo-hptrjZCQ"
  },
  "GR3gwsweIM6beG3UHwFj3Q": {
    "date": "6/21/2017",
    "text": "This place was packed, we came in to get a to go order. They had us sit down, and brought us \"complimentary\" salads. When we reminded them we were getting to go orders when they came to get our food order and they told us that they had to charge us for the salads they put in front of us after knowing we were getting to go...  they also wouldn't let me get a half order of fried rice and chow mein. I HAD to get 2 full orders.  Won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TFUmDWqXCP5uapMoCkjv1Q"
  },
  "kfOJo6_EFlGnZ7MPt85jUA": {
    "date": "7/11/2016",
    "text": "Average Thai food at exorbitant prices Basic lunch for 3  $30 ordered Thai hot....NOT! Don't waste your money Not going back!",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 18,
      "cool": 8
    },
    "photos": [],
    "user_id": "pDfc2RILCn6ZwZjyUAeD4w"
  },
  "mn3J2nPXWnkZz8n87k7e2A": {
    "date": "1/19/2018",
    "text": "I really liked the service and the food is really great for the price. I come back often because of the exceptional quality. Definitely recommend for anyone not familiar or that wants to take a first dive at Thai food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ETSEb4Uy_wMQH-RukSvL8w"
  },
  "WvbPpr6Z0oortOU585VSpg": {
    "date": "10/16/2017",
    "text": "I just had dinner here and while the food  was brought to my friend and l there right before my eye crawling up the wall a roach. I called the waitress over and showed her it. To my disbelief she grabs the roach with her hands. Needless to say I would not recommend this restraunt to any one. NO BUENO.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nBWA_zlR3pu8URpsPCHJ6Q"
  },
  "VOZXJ1P-Dgbjzfa05hu1Pw": {
    "date": "6/23/2018",
    "text": "This place is pretty good and quick for lunch. After you sit down, you get a salad and then you can order from the menu. I get the Thai basil meal with seafood and it's wonderful with vegetables and rice. I don't think this place is open for dinner.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kbW3MaG0w4Wk1woweRYNWQ"
  },
  "l-OODiao4xlmU7ClGYXnrA": {
    "date": "7/22/2016",
    "text": "No pretense, just polite people in a clean environment serving very flavorful Thai food.  Chicken sweet and sour and beef pad thai. Both artfully presented. Decent quantity for a fair price. Both proteins cooked well. Veggies were crisp. Good mix of spices, nice flavors. Rice was fluffy, soft and tasty. Thai iced tea was great. Thai chai green tea was OK.  Spice level 3 was a hair on the too-mild side for my taste. I can't imagine that level 2 would have any fire to it at all.  Very competent. Will be coming back. Definitely no reason to drive to old downtown Scottsdale for Thai food any longer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "BlSbxxb1vyfFoLGjfHh5dg"
  },
  "LLkPfjUX0YsJT3xNAojeag": {
    "date": "4/30/2015",
    "text": "This restaurant stayed open a few minutes after hours so I could pick up a meal while my wife was hospitalized. I didn't know what to order so they set me up with Thai Basil.   It was excellent and I have come back a second time with wife;) and enjoyed the meal a second time.   Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "HvsMh6qr5OH84v04hZCARQ",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Thai Basil",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HvsMh6qr5OH84v04hZCARQ/o.jpg"
      }
    ],
    "user_id": "vtFOSDlVwIN6N9xbTHNOew"
  },
  "r8W0BBdrvgEJdA_fk3tDBw": {
    "date": "6/14/2016",
    "text": "Went in to order take out last week and got home only to find one of the meals was wrong. It very much took away from the entire experience.  Wrong dish and too spicy to eat.  Since going back was not an option it left one person with no food they could eat.  Disappointing.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ikvxr_lwsyBKmp4SH9FboQ"
  },
  "DUEvJCkJJXqSTFH6oe7o1w": {
    "date": "11/16/2017",
    "text": "I drop in for lunch often and it's always a good experience! Quick, nice service and tasty food at a great price point. Food is always very hot and fresh!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DkhfhJUM-vu8nS3GTmI9dw"
  },
  "-O1ZBvZboVpHwCkfVer-FQ": {
    "date": "1/6/2015",
    "text": "Pad Thai was yummy as always, and it came with salad and a spring roll for lunch. I liked the dressing, wonder what it's made of. Initial service was prompt, and they brought the check out early, but it took them a while to pick up our credit cards. From the map it looks like you can get here from 3rd Ave but the shopping area is right off Central Ave.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "dQlbzhNmpG7EgJ5kZvHpsg",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dQlbzhNmpG7EgJ5kZvHpsg/o.jpg"
      }
    ],
    "user_id": "4cZ3f3i0Slv2W9mLN_VZBw"
  },
  "eEq_rS0_4xWHy3t5ceeVZg": {
    "date": "1/31/2011",
    "text": "Since moving from Seattle a few months ago my family and I have been in search of a new Thai restauRant. The pad Thai was the best we've ever had and the mussamun curry was fabulous. We will definitely be back again!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hMhbiNbbbCluyLH_om3ajg"
  },
  "VH8xxzG3eOfWz841DYoO9g": {
    "date": "6/20/2012",
    "text": "My criteria for three stars is this: Would I go back? Yes. Definitely. Was I impressed with their food? It's standard fare, presented cleanly and efficiently and at a very fair price. The lunch special that includes a small salad, a slice of watermelon and an egg roll is a great deal. I was able to take a coworker who usually sticks his nose up at anything that isn't buffalo wings, pizza or a chain like PeiWei.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tpPX02ht1qOez80Q60EM7g"
  },
  "EJu8GLck9zAMdtIDIvjh9Q": {
    "date": "8/28/2014",
    "text": "Thai Basil on Central is one of the best Thai restaurants I've ever eaten at. I've made this a regular place to go to. Their food is amazing, especially their silver noodles and spring rolls! They have great service, and you can order to-go orders which are prepared quickly and just as good as if you were eating it at the restaurant. They are located in a great area with a lot of parking.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zok7VkWWlW-BgxDyJrhwaA"
  },
  "8BvwZ8h6XbOMdNRHsAw9XQ": {
    "date": "2/16/2012",
    "text": "YUM!  Fantastic food, nice people.  The garlic eggplant and yellow curry are fabulous.  We are vegetarians and I appreciate that we can get so many things made veg. there.  I'm giving 4 stars only because I haven't tried a lot there - but what I have tried has been really really good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_2PWi0HGq1cx3QnLDWRNwg"
  },
  "qdZIcowjPfO8ZVwh6F8bxw": {
    "date": "3/17/2012",
    "text": "Came here to meet some friends for dinner on a trip to Phoenix.  The hot and sour soup here is perhaps one of the best I have had.  the rest of the fare was decent and I would claim is average.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M07rQBIIIAUREN4wh28krQ"
  },
  "YfkFEEiZbffXUSprCKZ_hA": {
    "date": "1/10/2011",
    "text": "This place has awesome food.  If you are looking for flavor, this is it.  it's a bit pricey tho.  Under $10 for a meal for lunch, not what I am willing to pay.  But when I feel like splurging this is it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "bA_0WltreAfajPFUm5rgfg"
  },
  "73XefLApr_M90zuMRC0Gcg": {
    "date": "6/25/2009",
    "text": "Today's trip to Thai Basil made me realize that I was cursed, and now thanks to this place, the curse has been lifted.   I don't know how or why, but somewhere along the road of life, a curse got put on me - no matter how spicy I asked for my Chinese food to be, it would always end up MILD.  I mean, I would say it 3 or 4 times to the person taking my order on the phone. Then i figured maybe if I spoke to the person face to face so they can see the sincerity in my eyes - the very soul of me - that maybe they would make my dish spicy. But no, they didn't. I've done everything short of putting a gun to the person behind the counter's head.   I had just accepted the fact that I would never enjoy spicy Asian cuisine; that I would always have to go home add my own stuff to it. Well no more. Thai Basil has consistently asked me \"How spicy do you want it?\"  Not only that, but they proved that this is not just a rhetorical question. I've given them a specific level, and they do it. They. Do. It.   So the last dish I had was the Spicy Noodles with beef. It was great. The sauce was unique and tasty...not just a generic batch sauce. Of course there is always better to be had, but for a lunch special dish, this was quite satisfying.   I just wanted to updated this review because of Thai Basil's consistency. I've never gotten a 'bad' dish from here...maybe one disappointing dish (smaller portion than I thought it should have been).   4 star stat maintained.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aMN80DrgGyk--Nf2Du9M9Q"
  },
  "ttsNT9UYaJkHDJ2daGmbyQ": {
    "date": "2/12/2014",
    "text": "not the best thai i've ever had, but it got the job done; maybe i ordered the wrong dish. i went for lunch and had the pad see ew, which came with soup and a spring roll.  portions and prices were decent. if i were to visit phoenix again, would i come back? meh.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "536rOzXcqaBU2PAm7hye_g"
  },
  "N-4XCufhPEw3lrqcU4_rdQ": {
    "date": "2/5/2013",
    "text": "If this place is part of the other Thai Basil at 1st and Adams...stay away. Very unsanitary and they do not abide by any health regulations. They do NOT clean their kitchen EVER!!! Don't know how they stay open.. Must be paying someone off. Horrible food poisoning!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NNS4wAFInDpBC4-K0U8DgA"
  },
  "iYdBo4MtJgk6hqpbURFE3w": {
    "date": "6/29/2012",
    "text": "LOVE the Thai Basil w Tofu. Their tofu is so good! I'm very picky about my tofu and Thai Basil gets it right. I've gotten one of the curries once and it was good, but I love the fresh and light Thai Basil dish. We order takeout from here quite often and they're always friendly, fast and never screw up the order! The prices are great too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "jMTeTekgA9pKTZYov6Nq5A"
  },
  "OKt1CsLQo0QPkqgo00FbaA": {
    "date": "8/30/2011",
    "text": "Great place for lunch and the service its promt. The hostessex was very pleseant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lcEnHqz4Nzh9xsKsDvEtbA"
  },
  "cFcV2NWYTbO_wy3-YvGqIQ": {
    "date": "6/24/2013",
    "text": "Fantastic food!  Love the Medium yellow curry chicken!  I can get over the marginal service for addictive good food.  What do you expect from a little mom and pop?  C'mon people get over it!  I love this place!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cOh37ZVl34htpDLEgWY0VA"
  },
  "HTQR-VhHpJWByjCpUjRpmA": {
    "date": "4/10/2008",
    "text": "This is the new Thai Basil location at Park Central Mall.  I am happy to report it is much like its Tempe location in food quality.  I had the Thai Basil and it was just as delicious as the Tempe location.  I went during the lunch rush and had no problems, only prompt service and very yummy Thai food.  The mood of the restaurant is also quite similar to the Tempe spot--with the addition of outdoor seating.  This yelper recommends it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "WBDenhIG-zB271HN9CVAAQ"
  },
  "OdEaOuyA6bI_0cErziGAKg": {
    "date": "3/25/2010",
    "text": "Definitely one of the better Thai options in the Valley.  This place is small and pretty casual - but they do have nice touches like carved wood decor inside.  Got a green papaya salad with grilled prawns and a chicken satay.  The satay was perfect.  The salad was also tasty.  The Thai tea was the ideal accompaniment.  And afterward I could not resist the sticky rice with mango - which was fantastic.  Prices were reasonable, too.  I'll for sure be back.  The location is quite convenient, including a huge parking lot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QEpqV1WAUa37y5d9viA8zQ"
  },
  "fEHc0jrPFwmaQ-DFKsxVsQ": {
    "date": "6/11/2010",
    "text": "I like this place for various reasons: its clean, its location(right on central). I love watching the light rail sitting on the patio. The food is great too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mR0N5-ypFf2lFZn8SJ-cUw"
  },
  "5EvG6UqCTwawPqgdNYfvQA": {
    "date": "4/10/2011",
    "text": "We just moved here and were searching yelp for a new Thai spot. The high reviews this establishment received made us feel confident in our decision to order take out. We were so disappointed! The curry was ok. The Basil chicken, their \"signature\", was so dry we didn't eat it. The pad see ew, which is usually one of our favorites was the best thing we ordered, although even that was lacking a great deal of flavor. We won't return and honestly, we may not trust yelpers as much as we had before. My question is, does Phoenix simply not have very good Thai food and so everyone thinks that this lackluster spot is delicious??",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "UyvTKhmnM-558pUR6NOYyQ"
  },
  "7F8idT_jHgo34zO-tSYRew": {
    "date": "12/9/2009",
    "text": "The best massaman (sp?) curry I've ever had, and I've had a lot. And great pad thai as well. However, as a spice wimp, I asked for my dish as mild as possible, yet tons of red flakes peeked out from the noodles. There are only a few foods I am willing to suffer for, and the yellow curry was one of them, but I just don't get why so many cooks equate \"not spicy\" with \"bland.\" The dishes were plenty tasty by themselves; next time I go I will either have to order it \"bland\" or bring a fire extinguisher.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1clfZ1trIQPZQL83K02HgA"
  },
  "lhbICcugvOjzvKBTsGrsYg": {
    "date": "12/25/2008",
    "text": "Fresh, crisp, nice flavors.  Very clean and prompt.  My one complaint is that it is small and feels a bit aloof.  (So, i prefer take-out.)  But really good food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oZ6MZ3KtTEU0UiioWQjC8Q"
  },
  "BnfGORjNUIyi8AsbNz3hGg": {
    "date": "10/9/2008",
    "text": "This place is soo good!!!  it is soo much better than pei wei and all those other chains. The food is delicous! they ask you how spicy you want it the food is made very quickly and just overall is soo good. the rice is never dry, the veggies are delightful, I would recommend the sweet and sour plate",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FHLykBtx1ETWJyqgcMoJJQ"
  },
  "h4kh5Wl31-tiapTOYC2JHg": {
    "date": "12/20/2011",
    "text": "Great lunch spot.  Quick service and healthy and delicious Thai Food.  I love the Thai Basil chicken.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VSs9kbpR0CZ_vNmGeX79Iw"
  },
  "ywH1jKgem7kePvZFOFQEpg": {
    "date": "4/1/2009",
    "text": "My family and I were just passing through town looking for a decent bite and decided to resort to the Mall we were passing, and boy did we luck out!  The service was prompt, helpful and friendly and the food was delicious and inexpensive.  Even the kids were happy, and we're all pretty spoiled with a great Thai restaurant just down the way (if you're ever in Southern Marin, I recommend Thep Lela!), so we were very grateful to the travel gods that day, I can tell you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BdqCtUemReCncwGMbdbkmA"
  },
  "PyN_bOzj0hAtGrCybU4_Jw": {
    "date": "11/18/2017",
    "text": "Staff was super friendly and that's where the 2 stars come from. As for the food it was ok at best. I ordered the BBQ beef and it was lacking some serious flavor. My wife ordered the coconut soup which had some flavor but didn't really scream coconut. Perhaps another attempt would be in order to try some other plates. Get their early it is rather small although you can set outside.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0i0kq07veTtdbRaOABEGiA"
  },
  "sBhgVFpgdqlPM0myfbrNUg": {
    "date": "12/28/2017",
    "text": "My group cane here before a comedy show downtown.  The food was really good and it was walking distance from bars and the comedy venue.  The food was awesome and  the restaurant was nice for our double date.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "KILeOGIZVVEt_eungIn9JA",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KILeOGIZVVEt_eungIn9JA/o.jpg"
      }
    ],
    "user_id": "fEY2DO2bBHWmOgfEZRtH3A"
  },
  "LfBvPBh-A1iV7YgRwFLJ0A": {
    "date": "4/3/2017",
    "text": "Coconut Soup and Masaman Curry had great flavor, texture, and portion size.  The Pad Thai Chicken was a nice portion but lacked some of that peanut flavor I crave in a good pad Thai noodle.    The Thai tea was very flavorful and colorful.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mj3CCpFOBDDJyBxvDEi8ew",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Arnold Palmer Thai Style",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mj3CCpFOBDDJyBxvDEi8ew/o.jpg"
      },
      {
        "img_id": "uAAKdn73km_5eJG_iGbckw",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Masaman Curry",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uAAKdn73km_5eJG_iGbckw/o.jpg"
      },
      {
        "img_id": "-K4wr283TU7W5qePDU2EVg",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Basil Chicken",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-K4wr283TU7W5qePDU2EVg/o.jpg"
      }
    ],
    "user_id": "qIaaC45wJEpOxemG9yrPug"
  },
  "G80yttddrOXrZuHaZa8rFw": {
    "date": "12/29/2016",
    "text": "The service here is super super fast - like so fast I'm pretty sure they asked me what I wanted to drink before I even sat down. Service like this can be appreciated downtown, so I have no complaints. I think spending 1.5 hours at lunch when you need to get back to work and on the clock can be infuriating - so I really liked how fast we were in and out. I got the Chicken Pad Thai lunch - I ordered it hot but it's not insanely hot. It was cheap too maybe somewhere in the $7.50 range and comes with a free house salad. Also, a free egg roll with the meal.  It's in the same plaza right next to Starbucks and Jimmy Johns. Easy parking and positive experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Q5-cvYMrbWpauc6kYWsbeg",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Chicken Pad Thai lunch (ordered hot)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Q5-cvYMrbWpauc6kYWsbeg/o.jpg"
      }
    ],
    "user_id": "-QnmBC8fkjcJHXAOHuC4gA"
  },
  "2HDhMRVrMqKe74C8WGTZTQ": {
    "date": "12/12/2017",
    "text": "First time at this Thai Basil. Been to four others across the valley.   I arrived at 11:15 on a Tuesday and there were 8 other parties (about 1/5 full). My lunch arrived quickly, within 7 mins but my ginger salad was delivered faster. The traffic picked up as I ate.   The service was mostly efficient but I did feel a bit ignored. I think they view lunch as bang, bang get them out concept.   The meal was fine (standard Pad Thai) but forgettable.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fCWEsW3lhZk2RQ0zPrqvsw"
  },
  "GOJ9CuMBFB5GMokvyrYbew": {
    "date": "4/8/2019",
    "text": "Went here for dinner before a show at Orpheum.  All of us really enjoyed our choices.  Will be back next time at Orpheum again.  The food was a little on the mild side, so bump up your spice level if you like a bit of a kick with your Thai food.  Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-iuUaoQXVoXJZNfEUKsQHw"
  },
  "c_k4HBeYfcJOHVC54Ma8Uw": {
    "date": "1/21/2019",
    "text": "Worst service ever! They don't speak very good English and are very rude. When they make the mistakes, they pretend to act stupid and make up the excuse that their boss isn't there so they won't be able to help.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VuvbewZq-RPPE-e8rqFvSA"
  },
  "z2Yd_nnGipomVFCmHIYmXw": {
    "date": "5/14/2019",
    "text": "Terrible customer service. I will for sure take the extra 10 minute drive to Tom yum if I want Thai food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xnkYKtnchROSrWdXWKXZ6Q"
  },
  "yrOQVUSdt8nlK_vSytnc5g": {
    "date": "3/2/2018",
    "text": "Well. I just found metal in my lunch. I was chewing and thought perhaps it was bone. Nope. Metal. Ordered Thai Basil (pad-ga-pao Signature Dish).",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ZanPxfz7-Q0doXzV7eFAoQ",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Well. I just found metal in my lunch.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZanPxfz7-Q0doXzV7eFAoQ/o.jpg"
      }
    ],
    "user_id": "2mG6C9Ixl92PuKL97cHvHQ"
  },
  "Zx6kkEg-ynxjaS2DSukq1g": {
    "date": "1/25/2018",
    "text": "This was an unexpected find here in Phoenix, a good noodle shop. I really enjoy the rice noodles with chicken or beef both are great. I have not tired the coconut soup but many other customers have been ordering in when I have gone in for take out and rave about it so that will be one on the list to try. They have dine in or take out. The servers are very pleasant and give good recommendations or explanations of the dishes. I would have given them 5 stars but the service can be a little slow but well worth the wait.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "rtndHfUsHe2_QWlKsp_pJQ"
  },
  "s5fCRYHokLb1p96o9QEWrQ": {
    "date": "1/28/2016",
    "text": "Their salad dressing... I would drink it out of the bottle if I could. It's got the heat, the tang, the sweetness, the saltiness... Everything going on but not too busy or confusing in flavor. Juuuust right.  Lunch at Thai basil was a first for me. As soon as you sit down, you get a glass of water and a salad. Even before you order or even ask for it. No choice of soup or salad, just salad. No complaints here but I did find it interesting they just give you a salad without asking.  I got the chicken green curry \"hot\". Someone on Yelp mentioned the spice level isn't as hot as it should be but for me, it was plenty hot :) my whole face was glistening with sweat as I slurped up that yummy curry.   With the lunch special you get a salad, egg roll, your main dish and an orange wedge to finish your meal and a nice little mint with the check. There were not frills but simple Thai food done well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "4efDL5Sbi_rmafTeD-RW9A",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Chicken green curry",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4efDL5Sbi_rmafTeD-RW9A/o.jpg"
      }
    ],
    "user_id": "zTCwJg0hPY_cb3vWY0XMbg"
  },
  "-qD5jUqR_KP7m5RDV1dwIA": {
    "date": "1/29/2018",
    "text": "Fast and have lunch specials. It's clean and busy during lunch hour.. but the food is your typical thai food you will get through a chain.. nothing really stands out but they have your usual pad Thai to eggplant dish with rice..",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c40DTzCb-fHY6vI03PNRLw"
  },
  "YJ6e50Y4gjyejltKSxaxUQ": {
    "date": "4/30/2016",
    "text": "Had such high expectations as its just blocks from our condo In a big plaza with starbucks so plenty of parking. Outdoor patio and inside seats as well.  Got here on a Saturday afternoon at 2 pm. They gave us the lunch special menu. Very good pricing.  Tofu, chicken, beef or pork dishes are $7.95 and shrimp dishes are $9.95.  Salad comes with each order and the dressing is good.  Apparently so good that people want to buy it so it's on their menu as a side for $5?  Other sides included hot sauce and different sauces. No actual sides like Tom yum soup or chicken satay or papaya salad.  I did notice they have those on their dinner menu but we weren't given that menu.  It's nice they have Saturday lunch special till 3pm but I guess I found the menu limited.  Food was Bland so the pepper and hot sauce tray came in handy.  The thai basil signature dish is Rice and sauteed vegetables. Hubby got it with shrimp but didn't enjoy it.  My red curry which I was so excited about was runny and not enough flavor. She didn't ask if we wanted hot, thai hot or medium hot and I forgot to say so I guess we just got regular?  I think this is a swing and a miss.  Might try once more for dinner and get their pad thai and papaya salad. That's how I usually judge a thai restaurant.  The server barely spoke to us...maybe lack of English. Just blah.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jm8NFQLBAi2tYfCVSawlcQ",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Thai basil signature dish $9.95 lunch special",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jm8NFQLBAi2tYfCVSawlcQ/o.jpg"
      },
      {
        "img_id": "9KBRRZFGqtwlS0tCUubwPA",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Red curry lunch special  $7.95",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9KBRRZFGqtwlS0tCUubwPA/o.jpg"
      },
      {
        "img_id": "GUxrjEdvM7tbM6oVu-E2sg",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Best part of the meal. Pepper and hot sauce tray",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GUxrjEdvM7tbM6oVu-E2sg/o.jpg"
      }
    ],
    "user_id": "nyx1upP2fuHrcmAAC9jd5w"
  },
  "tSz9rwvs_zb2wzjS81yDOQ": {
    "date": "6/27/2018",
    "text": "We had a nice meal here last night. we haven't been to this location before but noticed they are going through major remodeling and wanted to help support our community. We were surprised to see how many loyal customers showed up when the entire complex is chaos.  My husband ordered the garlic chicken, it was very mild and maybe could have used a bit more sauce to punch up the flavor. It was full of chicken and had a ton of veggies though, which I love. I had the panang - peanut curry with chicken and it was delish. Again, tons of protein and veggies and wonderful light curry taste. My husband and I also tried the spicy noodles with chicken, which was tied as a favorite with the curry. Great flavor and not too spicy. These dishes were reasonably priced and the portions were good size. I was pleasantly surprised how quickly or food came out and would absolutely come back to explore more of the menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gOYgSEbE-Z7cqGsgGW3LBg"
  },
  "LcgoLVHEXU0a7i8_kJQu0w": {
    "date": "8/10/2018",
    "text": "The Thai basil signature plate with the chicken was really good! Everything was really fresh and the service was fast. I will definitely eat lunch here when I am in the area. There is construction outside of the building because the plaza is being redone but they have an easy walk way to enter the restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mT5mByNZj2bMNUdfW4iTJA"
  },
  "uB80aD87BbQ7fONilZiPEA": {
    "date": "5/3/2018",
    "text": "Ordered seafood curry...1 shrimp and 3 squid pieces. Ordered shrimp pad thai...3 shrimps and some tofu. Crab puffs. Unless you are high and have the munchies, this is not worth 40 bucks.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "exkEzRITdwcJLDhWE2S0Vw"
  },
  "oU1wQy4VK9H7kbFpC0sApQ": {
    "date": "7/11/2018",
    "text": "Disappointed. Whoever was cooking tonight forgot to flavor the pad Thai and pad see ew. Literally no garlic, spice, or sauce on either. We got it delivered through Postmates, guess now I gotta go in person to double check my food before it leaves the building.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "c5jmLGD1S4ynoAnXQD3M7g",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Not sure who was cooking tonight, but they forgot to flavor the food.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/c5jmLGD1S4ynoAnXQD3M7g/o.jpg"
      },
      {
        "img_id": "PRk-xRh8cw0tOwdZMuBl9Q",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Unfortunately the dryest and most flavorless pad see ew I&amp;#39;ve ever had.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PRk-xRh8cw0tOwdZMuBl9Q/o.jpg"
      }
    ],
    "user_id": "AUXTow-0Va6idw5YXzpt2A"
  },
  "-NFgJND2ijNwiQ4VWXyOyw": {
    "date": "6/21/2018",
    "text": "I'm new to the area and have been trying to find a good Thai place....tried so many others and was disappointed.  This place is perfect!  The food is fantastic!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tdS2jvf9LPfE4XS5Kka9sw"
  },
  "MMYJJg8wT2brtU4RVPaaHg": {
    "date": "5/12/2018",
    "text": "Food is hit or miss. Hated the calamari and fried rice dishes. I do like the yellow curry quite a lot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aY9AhmeA9puPTOthGWl5pw"
  },
  "XqUc6L0-RZtLGpbV2RzjJQ": {
    "date": "1/17/2018",
    "text": "Fantastic food. Great environment and pleasant service. Came for lunch and got an amazing yellow curry FOR LESS THAN 10$ Really enjoyed it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eklaJqpLBSezcugxsxYCwg",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eklaJqpLBSezcugxsxYCwg/o.jpg"
      }
    ],
    "user_id": "GBTqMTXfMprMDLO-2UZGVw"
  },
  "D5c23t3fewQlgSVYAo_VIQ": {
    "date": "2/4/2009",
    "text": "Remember the movie Brokedown Palace with Claire Danes and Kate Beckinsale? And all of the Thai people were so mean to them.   Oh. It has nothing to do with this review. I was just asking if you remembered that movie. Anyway, you won't find mean Thai people here. It's definitely a team  effort here and everyone was very helpful and most friendly.   Seating is rather awkward as their isn't any signage indicating what to do, wait or sit. Or order inside. But I was quickly invited to sit wherever. Before I knew it a cold, crisp, simple salad and a menu was place in front of me. Yay! Free salad. The dressing was SO good. I bet Kate Beckinsale and Claire Danes didn't get free salad. Course they were too busy being pistol whipped by the prison guards.   Anyhoo...I ordered the pad thai and it was fantastic. Though I would have loved more tofu. It came with the cutest little spring and a wedge of cold watermelon. YUM! Love watermelon as it so refreshing.   All this for around eight bucks. I bet you Kate Beckinsale and Claire Danes...oh...never mind. Just get your butt to Thai Basil. Where you will be greeted warmly, served efficiently and probably, won't get pistol whipped by a lesbian Thai prison guard.",
    "rating": 4,
    "rated": {
      "funny": 35,
      "useful": 27,
      "cool": 19
    },
    "photos": [],
    "user_id": "UmXzwFM2OkZHWJ5cJZlqkg"
  },
  "7wJVqMNGFKYgLYGrIv9uoA": {
    "date": "4/14/2012",
    "text": "Salad dressing DELICIOUS,!  The rest of the meal and service was just as good, fast, friendly and totally yummy .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "cNVydqewkILshI31yvLNAw"
  },
  "a2uVd3cLW8CBNSKAB-RUJQ": {
    "date": "4/26/2009",
    "text": "You know that song \"Suddenly\" by Billy Ocean? What, you claim you don't remember? You're cool now, but I know you've heard people dedicate it at least 100 times on Casey's American Top 40. But by chance you partied too hard in college and have forgotten an entire decade, here's a reminder: <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DdWaqauMk5ts&s=59dbb19cb7c15c302cc0073f2b0d21ea602921a8f35294b46d4279a68ef46e92\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=dWaq...</a>.   Why am I going through all this trouble for an intro? It's because this Central Avenue location of Thai Basil is the \"Suddenly\" of Phoenix Thai food.   Except it's the Kenny G sax version, so there's no lyrics. Which means there's no \"wake up, suddenly....you're in love\" gush of emotions when it comes to experiencing this establishment. Instead, it's a giant bowl of dentist waiting room lite jazz; too milquetoast even for Blaise Lantana.  For it was this song, \"Suddenly\", that played along as I ate some extremely bland beef Masuman curry a few nights ago. None of the requested heat, and none of the expected rich flavor. All I could think of was the color beige.  I mean, who gets bored with Thai food?   And then, as I ate, a new song. The muzak version of \"Set The Night To Music.\"   Great.  Which, ok, this all could be chalked up to the fact that Thai Basil may have had an off night. Except this is my 5th time eating here, mostly due to the fact that it's the closest Thai place to me (ok, the other joints are barely any further away, but anyway). And each time the food served to me, whether for lunch or for dinner, is equally bland, no matter how I request it and no matter which dish I get - curries, sauteed dishes, noodles, whatever.   Service is a little hard to come by at times, usually because the servers are busy bantering amongst themselves or huddled around a laptop. But they're very friendly and professional when they do come to your table, the place is very clean with additional outdoor seating, and the prices are very reasonable, so there's that.  I just get the feeling that this place is a little lazy when it comes to putting much effort into its food. It's like a paint-by-numbers Thai joint, which would be fine, except there are now what, 4 other Thai restaurants within 3 miles of this location? You've gotta step up your game here.  All in all, I'm usually not one to equate Thai food with Billy Ocean balladeering, but I will make an exception here. The food, like \"Suddenly\", is not bad or horrific. It's just dull and not very exciting.   But hey, chin up Thai Basil. In the grand glass-is-half-full scheme of things, at least you're not \"There'll Be Sad Songs (To Make You Cry)\" played on a Casio keyboard.   Always a silver lining.  2.49 stars.",
    "rating": 2,
    "rated": {
      "funny": 11,
      "useful": 9,
      "cool": 8
    },
    "photos": [],
    "user_id": "AKXqbuifvfvNEpr3Qs51hQ"
  },
  "A0NjcTtBnalNSyXIrIFO1w": {
    "date": "1/4/2010",
    "text": "Found a new location of one of my favorite Thai places, this time right around the corner from the technical training class I was taking to brush up on my Cisco networking.  I had the lunch Spicy Noodles with chicken and it was just as good as anything I've had at the Tempe location. The service was attentive at first but kind of fell off after I got my food.   I will definitely be back for more when I go back for more training!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "SJHdSvL722pSXS8QYeDCsg"
  },
  "ORwTFNZRkvQu9JgXFUoyoQ": {
    "date": "3/18/2008",
    "text": "Actually, more like 3.54576745 stars.  These are the same peeps in Tempe and I'm sure Chandler, and now they're in Downtown Phoenix. Thank goddess, because the pseudo-Asian hole that was in its place before was rank. I was sooo excited to see Thai Basil, with its kicking-my-boring-office-lunches-up-a-notch potential move in. Only ever having been to their Tempe location, I know at least there they had some of the better Thai I've had in AZ.  Luckily, the same applies here. The food was good overall (and their Thai tea is always yum); although my barbeque chicken was a little lackluster, my colleagues had the red curry and Thai basil special and were both impressed.   What wasn't impressive was the service. It seems this downtown location is still getting used to that hustle-and-bustle office lunch crowd (I think it just opened last week). We saw our server twice - once to take the order and the second to bring it - and afterwards, were on our own for extra silverware, water refills, and asking for the check. Which usually can be forgiven if the food's super good - but not so much when I'm on my lunch break and need to get back to the office pronto.  They actually apologized for the service (they really did seem overwhelmed) but could've left us with a better first impression if they'd comped the drinks or given a discount.  Nevertheless, I'll be back to this location, though probably for takeout. If I try them again for a sit-down and the service is improved, I'll add the 4th star. I know you're all waiting with bated breath...",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "QBrTV_dtkwQXLs5zzazLWw"
  },
  "HoGdBCKCm68pN5cYAup6OQ": {
    "date": "8/30/2008",
    "text": "Thai Basil was a good addition to Park Central. this neglected mall is a ghost town at night. I'm sure Thai Basil can do  good business off the assorted Club Central crowd, as either a before or post happy hour eatery. Open till 9pm on Saturday is good for me too.   the Menu is typical Thai fare. the spring rolls i really enjoyed. they have yellow corn stuffed in side. i was quite surprised by it. I'm used to cabbage, clear rice noodles and various carrots, but CORN!! it was freaking delish. the dipping sauce was accompanied by a small salad.  i ordered Red Currey (Medium Spice) it was very flavorful..but..medium?. i didn't notice any heat. not like in a mild. but like a missing heat. next time I'm going hot. and i pray they deliver the goods. i want scorching. tongue tingling action here.  my homegirl got Garlic Vegetable with chicken, (Mild) we both figured go weak on this one cause she's not a hot person. and if it was weak. toss on some chili sauce. so..yea chili sauce was added.  the flavors were on point. garlicky and full of taste. not often do you see green beans in Asian food. i think the playful touches add allot.   like David S.B. noticed in his review. Thai Elephant was much hotter. if these two restaurants are indeed related. i wonder why the flavor variations??  the decor is also quite different. there was only one image on the wall. and it looked like a WW2 Era picture of a family member who was serving in the Thai Liberation army or something. (i just made that up) which is a juxtaposition of most Thai restaurants i have been to which have random Buddhist idols and what-nots. honestly i like the change up.  total on the bill for two entrees and an order of spring rolls was 36.Change which is pretty good.  if Thai Basil and Thai Elephant are related. i think they have little twists that make each place different. i look forward to returning.  there was a party of about 8-9 when we arrived, which at the time we got there. they were the only other people in the restaurant. so i think this place is good for groups...as of now. when this place picks up in popularity..i don't think it would be all that comfortable with a large group..inside. outside will be great. lots of ceiling fans to keep the area cool.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "NMmu4oC-YRqdi0WY9pV78g"
  },
  "t1E7_GSAuSRt6quAxMraCA": {
    "date": "8/26/2011",
    "text": "Place sucks. Right when we went it, we showed out <a href=\"/redir?url=http%3A%2F%2FRestaurant.com&s=0aab4cbd731f3d3b0d1453050d3abc56a8c80bd214e25469c7555b750dca8a51\" target=\"_blank\" rel=\"nofollow\">Restaurant.com</a> gift certificate, and they rejected us because it was a weekend. No where on the gift certificate does it say anything about using it on the weekday. So there service isn't great, it was dead in there... no customers and they still didn't take our gift certificate... bad business to turn customers away especially when there's no one in there. Haven't even got to try the food... darn.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "c6JXNUHtDnWEp779jIRsKg"
  },
  "R8t3kYwRSd_yvnn9hX7TaA": {
    "date": "4/10/2012",
    "text": "I'm not an expert on Thai cuisine by any means, but the Iced Thai Tea is just...well...awesome at this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TnRcGRybKUR5phkN7Es3jQ"
  },
  "miab82p63RY1cmrvLlgucA": {
    "date": "9/10/2014",
    "text": "I wasn't a fan of the Orange Chicken and servers were rude which was surprising for Thai restaurant.  Thai was not authentic at all.  I've had better!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lDZ_MgaOGE1DnBMpmVfkyQ"
  },
  "BDChDEHgwhSdItJaExd-Uw": {
    "date": "5/2/2012",
    "text": "Having moved from Chicago, it's nice to finally find a solid Thai place with good food and a very hip \"Hey-you-guys-wanna-try-a-killer-little-joint-downtown?\" kind of atmosphere. Friendly service and comfortable seating right next to the light rail. The only thing holding me back from that fourth star is the price, which was a couple dollars steep. That keeps me from being a frequent visitor, but not from dropping in every once in a while.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "e45ZJkAh8T-GqjdG65c2YQ"
  },
  "Xkw-r_mo3ReqLydYjStFBg": {
    "date": "9/1/2010",
    "text": "This is my office favorite for lunch.    Lunch here is always speedy, but also very good.  During peak lunch times, my office mates and I can always come here and find a seat.  Within minutes of being seated, we are served a starter salad with a delicious sesame dressing.   I have tried several of the dishes and been pleased with all.  Some of my favorites include the eggplant, spicy vegetable, and the green and red curries.  My only complaint is that the \"spicy\" isn't super spicy.  That being said, spicy carry some heat, and it's enough to please me and keep me coming back.    Oh, and did I mention the price?  Lunch with tax and tip usually runs me about eleven dollars.  Not bad for a hot lunch, salad and egg roll with quick service!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TZn-Q7UFMo3Cp6zx4MGVDg"
  },
  "RZrQy7ULdeqKYERFb1zcPw": {
    "date": "11/21/2008",
    "text": "I almost licked my plate.   Seriously.  When I saw that a Thai restaurant had gone in at Park Central where a greasy, fast-foodish Chinese place had once been, I immediately was turned off. However, when I realized it was Thai Basil, the same Thai Basil in Tempe, I was excited.   Yesterday my friend Lisa and I went to Thai Basil for lunch (with cutesy rugrat Olivia in tow as well!). I ordered my usual favorite - Panang Curry with Beef. Lisa also ordered the Panang but with chicken.  I already mentioned - I almost licked my plate - so clearly you know what I thought of my meal. I liked that they brought us a salad when we sat down, but I didn't think it was super-fabulous.  We sat outside and enjoyed the lovely weather. We were served quickly and catered to as we desired.   Lisa wished her Panang was spicier, but mine was just right.   Can't wait to go back again!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "G7vL7L42Vzr5cDPXeLpXfA"
  },
  "_iqGm0ugXGIvQhpFs5VqXw": {
    "date": "2/26/2011",
    "text": "I don''t give many 5 stars. This place deserves for flavor, service and fair lunch special pricing. Hot, fresh flavor explosion. I love tom-kha and red curry, and this place has delicious examples. I recommend the red curry #29... make it Thai hot for a perfect kick, that's how I like it --- but I heard double Thai hot might be too hot for some people. Service is quick even when busy, and you can be in and out in 30 mins if you chow down! HOW, you may ask, when the food is so piping hot? Well it comes with rice, and you fish out some major chunks and lay them on the rice, blow to cool. You can spoon the sauce when that cools in 20 mins. In and out in UNDER 30 mins, I've done it. I haven't sampled the menu extensively, but I think you'll be happy! Outdoor seating for cooler temps. This is one of the hidden gems for the Phoenix area, I hope you think it's worthy like I do.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F3xsFydNSwKWgLwGMO0NOw"
  },
  "b-O2HwMAnvzSNjU4lWDM3w": {
    "date": "2/1/2012",
    "text": "Why the low ratings? Food was great! I had the Thai basil w/chicken and requested it spicy. It was! No crowds on Saturday for lunch.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hbydi6V5OzDeEwWnb1Fdbg"
  },
  "5_kkJ5HYM03vW-25SY-cNA": {
    "date": "1/6/2012",
    "text": "While I don't deny the food is delicious, in my opinion CUSTOMER SERVICE means a lot. I have had 2 obnoxious customer service issues with this restaurant.  1.  Went there with children (7 year old) who doesn't eat meat or eats too much.  When we asked if they could make plain noodles we were told no by manager/owner, then they changed their mind and took chicken out but still charged $9.00. They would NOT adjust the price for removing the meat, nor would they make a smaller portion.....NOT nice!!!! poor waiter was mortified at the stinginess of his \"boss\".  2. The entrees are substantial and beg to be left overs. They are initially served with about 3/4 c. of rice (not enough for the size of entree) when I requested more rice to take with left overs, she charged me $1.00 for an even smaller portion to take home!!!  These were already $9.00 dishes!  My point is.....why couldn't she just be nice and give me the the damn rice? and Smile for crying out loud. I will not be going back!!!!!! Just RUDE money grubbing!  Thai Elephant from here on out....worth the drive for sweet sweet nice service!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TAfarYxS0GgJ4b_OSyeplQ"
  },
  "SK_popBzZPmT-24JvLp4-A": {
    "date": "5/8/2012",
    "text": "Great food but the waiter didn't ask us about level of spice for our dishes like he did for the other table. Red curry was awesome although lacking any real spicy punch",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cnP6kccUoyHRgvc1sTmM3A"
  },
  "CyhWcetIRN7c2goIPHq-lQ": {
    "date": "4/28/2012",
    "text": "Reliably delicious Thai in Central Phoenix.  The trick is to get your food to go, grab a tea from Starbucks next door and enjoy Starbucks' awesome patio (comfy seats and mature trees and city views, oh my!).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nQ-RWqEa-RCrUxC1HVKoGA"
  },
  "QxmMqMbwcoTwM9iDMQhV7g": {
    "date": "10/17/2011",
    "text": "I ordered the Peanut Panang Chicken.... I rqstd to the waitress that I wanted extra Bell Pepper. When it came, it had -NO- Bell Peppers at all.... i actually didn't realize this until about 5 mins into eating it. could not find our waitress, I waited about 7 mins, finally, I had to get up & search for her. I found another waiter & told him my problem. He took my Dish, but then came back to tell me that they are \"All out of Green Bell Peppers. Would I like Red Bell Peppers\". I said yes, of course.  This whole experience has put a sour taste in my mouth about this place, which is next door to the 'mediocre' Good Egg on Central.   I like Wild Thaiger on Central MUCH better instead!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ia3kezgvnboBaiv13WUuhA"
  },
  "3VE2PPXupU9RAeO9oWIh1Q": {
    "date": "7/19/2012",
    "text": "The Thai Basil Chicken was awesome!!  However, there was a creepy old Asian lady that was crashed out in a booth and she didn't look too healthy:  Not sure what was all about.  Anyway, the table was wobbly, but the food was great & I shall return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "USY00762c-ivrZ7OjN_Jsg"
  },
  "UBJjhXK-39--49xj6iIrSQ": {
    "date": "12/21/2011",
    "text": "This is definitely one of my favorite Thai restaurants. It is not too far from Phoenix College, and they have a great lunch deal. It's about $8 for a delicious house salad, and entree. I always get the delicious yellow curry which is served with rice, an egg roll and a slice of watermelon. The food here is so delicious, I come here at LEAST once a week when I'm in school.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V2t_oLWYP1TPVdNQhk1L3Q"
  },
  "FmGRbNQpv6CAuwiG7qtk1A": {
    "date": "7/23/2019",
    "text": "Get the green curry it's incredibly flavorful. Wow it's the best I've had around this area-hands down and the right amount of spice. The Thai iced tea is perfect and a large portion as well  The spicy noodles are divine  The Thai iced coffee will get you going And the staff are sweethearts   You can even order pick up on postmates and if you're me you can just walk over and grab it. Food is ready within 20 minutes!   Will keep coming back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "gQYTNtOoJfRHZJpmVZMT5w"
  },
  "Z8xh1taeixLk3TruSJVU5Q": {
    "date": "5/3/2019",
    "text": "Started going here for lunch and would get the BBQ chicken. They mess the order up constantly. I ended up paying $11 for chicken and lettuce. Called back and they said they would make it up the next day so I went in and they gave me extra rice to make up for it. Said they wouldn't offer a free meal or do half price. Irritated i agreed on the extra rice. Got back to the office and they forgot to give me the spring roll that is included. Called back and said sorry but didn't offer to do anything.   Needless to say I wont be returning as the order is never complete.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gt6q9Dn8g7ggSX2KPso4lw"
  },
  "6ZD3pxSA6AU-ALJCnKpszg": {
    "date": "9/11/2019",
    "text": "Ordered the duck green curry. The duck was really dry and tasted old. The curry and veggies were ok. The service was terrible. We were left alone from ordering until it bill time by a guy waiter.  Normally Thai is delish everywhere I've been. Only one dish at the table was finished... Won't be returning",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yyjo1KLYixx7NxrvUUAQmg"
  },
  "XaHDWqNNo5yaUvwB0W4gmw": {
    "date": "9/17/2019",
    "text": "I probably get food from here about every week because I absolutely love their food. I would recommend the Tom Kha if you haven't tried it before but honestly you can't go wrong with any option.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fhx6H2zszftx4ulsu0GIeQ"
  },
  "Haz-qZFe7W2b9lGOIDCcqg": {
    "date": "2/15/2019",
    "text": "Just kind of Average  Thai  Basil offers a great variety of entree selections on their menu and the staff is knowledgeable of allergens in their foods. The staff is very friendly and accomdating and the owner usually goes around and talks to all the guests.  On this visit I started my meal with a salad, to be honest I wasnt a fan. I then moved onto went on to Phad-Thai, and chicken fried rice. The meal was okay however the entrees were a  little light on the meat, and the chicken was extremely dry, the meal just wasn't very memorable. Not sure if I will go back any time soon.  To end on a positive note, the wait staff are  prompt and courteous. The restaurant and decor is clean and pleasant.   .",
    "rating": 2,
    "rated": {
      "funny": 5,
      "useful": 12,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "IkmSqBWbNU4UK6NC1FIC0w",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IkmSqBWbNU4UK6NC1FIC0w/o.jpg"
      }
    ],
    "user_id": "MMf0LhEk5tGa1LvN7zcDnA"
  },
  "m_aBzrflkQJ9jmBa3sYTlw": {
    "date": "9/12/2019",
    "text": "Great location and the staff is so kind and friendly. I am in love with their red curry beef- Thai hot and the crab wraps. We spent 3 weeks in Thailand eating the most amazing curries you will ever know. Thai Basil is the only place we have found close to what we had in Thailand. Forever customers :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MQmCqWGKg2hLmlSGYRRh_g"
  },
  "n_O9BPRzDOIsfLcTioZMkg": {
    "date": "8/21/2019",
    "text": "This is a great place for a light quick lunch. The food is hot and fresh and arrives quickly. The garlic chicken is my favorite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EPAP23aB6mI7xYR81ycBWA",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Even the bathroom has a pretty touch.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EPAP23aB6mI7xYR81ycBWA/o.jpg"
      },
      {
        "img_id": "ExXv_-JBVGruxOt8MThwmw",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Menu for lunch",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ExXv_-JBVGruxOt8MThwmw/o.jpg"
      },
      {
        "img_id": "egibbs5ho_xjMWXYkuCaFg",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Busy dining room.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/egibbs5ho_xjMWXYkuCaFg/o.jpg"
      }
    ],
    "user_id": "916Z5Ba4A8YaYKqSZeCY_A"
  },
  "fuT77xf35lwP2X-oo1Ofvg": {
    "date": "5/16/2019",
    "text": "A+. Stopped in for the first time and had lunch. Ate sweet nut curry with shrimp. I ordered it medium spice after talking with our waitress for a slight bite of fire but not to the point of too hot to feel it burn. Perfect and would recommend this dish.  Plan to make it back and add to our list for regular visits.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c2Dbw65DbHvgqvLTeSuXYg"
  },
  "FO3soEI8cQ0MjWC383qhGQ": {
    "date": "10/26/2018",
    "text": "Open during construction!  We went for dinner. The Thai iced tea was big - a little on the sweet side, but still good! I had the Red Curry dish with fried tofu. It was great! I love how it came with assorted vegetables: carrots, bell peppers, green beans, bamboo shoots, and basil! The serving was large enough for left overs tomorrow! I included a photo of my husband's dish top: Yellow Curry stir fried rice with pineapples and fried tofu. It was great too! Service was quick and reasonably priced! I'll be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ct_QaD7KQNcs-ErMOxmIZQ",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ct_QaD7KQNcs-ErMOxmIZQ/o.jpg"
      },
      {
        "img_id": "DtyZ7oiE1fjoEO08VON10Q",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DtyZ7oiE1fjoEO08VON10Q/o.jpg"
      },
      {
        "img_id": "oI3qlyrWjR12fBfa7Y6qqA",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oI3qlyrWjR12fBfa7Y6qqA/o.jpg"
      }
    ],
    "user_id": "0d7pYp0h1DxxgKjs5noE0g"
  },
  "9trNdMh19YA31-WJhwAoIA": {
    "date": "2/10/2018",
    "text": "I ordered the Pad See Ew with chicken but it was pretty plain in comparison to other Thai places in the valley. However, the service was great and the way the inside is decorated is very beautiful!  Also, the Thai Tea comes in an extremely tall glass, I was very surprised by the size. Lastly, prices here are pretty much the same as other Thai places.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NIHXRjI_ajS3Lcta_SyUhA",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. The Pad See Ew",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NIHXRjI_ajS3Lcta_SyUhA/o.jpg"
      },
      {
        "img_id": "2KauSnopIHng47SD6X5SLg",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Inside.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2KauSnopIHng47SD6X5SLg/o.jpg"
      }
    ],
    "user_id": "W4ZuWztx47aiksyYPUMYDw"
  },
  "cuoPEgDJVXDllraZeOMgDQ": {
    "date": "7/2/2019",
    "text": "Ordered lunch for our work from here, dont ignore the bad reviews, they are not lying. So gross! My chicken was the texture of rubber. Every single one of us ended up throwing our food away. Its also very over priced for the amount of food you get.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7UPuLR3fKHCCvkmH9auyRg"
  },
  "tUn_Q7n7nRSqrMg0iGAoSA": {
    "date": "3/31/2018",
    "text": "This place is great for lunch. They have a lot of scent lotion. From make your own noodle soup to the lunch specials on the menu. Their ties he is always really good. I always like the pad thai, make your own noodles Bowl, and grilled pork.  The service is quick and friendly. And there's also an option you can sit outside when the weather permits",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "uxF2oHrNCXDb2C6sScJ8Mw",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Siamese chow mein",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uxF2oHrNCXDb2C6sScJ8Mw/o.jpg"
      },
      {
        "img_id": "Ec_c2WhTGfxvt158qxnteg",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Pad sew with chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ec_c2WhTGfxvt158qxnteg/o.jpg"
      },
      {
        "img_id": "0oTaNBSJn1xs_o4ojHFG6g",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Build your own noodle soup... Silver noodles, clear broth with tofu and chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0oTaNBSJn1xs_o4ojHFG6g/o.jpg"
      }
    ],
    "user_id": "iDlkZO2iILS8Jwfdy7DP9A"
  },
  "_OY6tqBmBHfKACt7oJPV-Q": {
    "date": "5/18/2018",
    "text": "Stopped in on Wednesday for a quick lunch, only had 30 minutes. Ordered my favorite Panang Curry, ordered it \"hot\"...meaning spicy. My order was quickly delivered, a bowl of curry and a mound of rice, looked pretty good. Once the rice was added to the bowl and dish cooled down, I dug in....no chopsticks were given, it was a fork to feed yourself place. The curry was tasty and all the right ingredients were there, however, it was far from spicy enough. My guess is that a downtown place will not make food spicy as some will order but not really want it that way and thus not return. So, I understand. The restaurant was clean, nicely arranged and service was fast and good. I would return, I would just ask if they could add a bit more spice to the dish I ordered.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FJH32jg-8ZKIrZLPfZX_Ww"
  },
  "DBcpZMze9K3w318evFNFQw": {
    "date": "2/27/2019",
    "text": "As noted by others,  the food is not robust with flavor.  Hadn't been here in a few years.  We had Pad Thai and Pad See Eew. The vegetables were cooked just right.  We had shrimp rolls as an appetizer, and they were okay but not WOW. Service was excellent, and our orders did not take long to cook. Will probably go to other Thai restaurants",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "JTegUiKlmLNyTn0AdPSKbA"
  },
  "s06sa4XNwrndloIFgE-Ttw": {
    "date": "5/3/2019",
    "text": "My first coming here, I got the pad Thai noodles after my mom recommended it to me. Wasn't the biggest fan of the chicken or the sauce but the noodles were good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X6GrGpISS3jcWDjnZoqbkg"
  },
  "yGYuc55ZkCcADmkVfT4IUA": {
    "date": "1/6/2019",
    "text": "Thai Basil/Park Central is my neighborhood Thai restaurant for take out. I usually order the same thing to go: Dinner Menu #26 Eggplant (Pad-Ma-Kua) w/ Tofu add-in, medium hot. Love all the fresh veggies: eggplant of course, broccoli, red pepper, onion, carrots & basil + ample portion of steamed rice. I also recommend #18, Tom-Kha Soup, a coconut-based soup with lemon grass & roasted chili (& I get Chicken add-in), a nourishing favorite when I'm sick. Their food is consistently healthy and delicious!  Real quick: I just returned on 1.4.19 and their prices have increased for 2019 by about 10%. My regular dish went from $9.95 + tax to $11.00 + tax. When you order the same thing all the time, you know the exact price, so I WAS surprised when my total was different. I think they might alert customers with a sign of some sort. Regulars especially appreciate knowing about price increases. That's the only reason I'm giving four stars.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "nJbmNlOe515ttlWSD697rg"
  },
  "QJ8U_QgOGq7UPSMc7gjs0w": {
    "date": "4/2/2019",
    "text": "Ordered two orders of chicken pad thai on Postmates and this is probably the worst pad thai I've ever eaten. Mostly tastes like cardboard with just noodles, chicken and tofu. I've been wanting to try this place for a while and am really disappointed. I really wish they included more vegetables (almost none at all) and the noodles had more sauce (they're extremely dry).",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SNDKhIq0KOy2ZUrcw7pszA"
  },
  "xTBpjEZStRxQN90ef4Pd9w": {
    "date": "2/21/2018",
    "text": "We attempted lunch next door at the noodle joint but quickly ended that excitement with a lack of gluten free or veggie options.   Next door we went and MAN, I'm glad we did.   I ordered their signature dish and it was perfectly spiced (4, I like it hot!) and so good. Veggies were fresh and it came with steamed rice, a spring roll and a soup (though menu says I'd get a soup OR salad option and I was only given soup without choice).   I'd definitely come back. All in our party were pleased.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TLdMXf2gt9Am9LOLL_T2FQ"
  },
  "riI6HaSBXpGZqKG3SNkQHg": {
    "date": "11/24/2017",
    "text": "I've enjoyed a few meals at this establishment over the last 2 years. It is easy to find, clean, priced well and fast. The clientele during lunch is predominantly local office workers. The ambiance is nice, they are friendly and the food is good.  I would recommend this establishment to family & friends.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 5
    },
    "photos": [],
    "user_id": "V7B4KTBitlBs9YH_B00-9Q"
  },
  "q9MVt8pvnJca-Wc0rcJF-A": {
    "date": "12/23/2017",
    "text": "My 2nd favorite Thai place. Service is super fast and the salads have a delicious peanut dressing..  I had the bbq chicken and the chicken was grilled with two decent size pieces of chicken rice and bbq dipping sauce.  I also ordered the limeade.  Absolutely the best I've had.  Unexpected happy surprise.  Eager to go back.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "u5LBDFP41woHmD899fLI3Q",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/u5LBDFP41woHmD899fLI3Q/o.jpg"
      },
      {
        "img_id": "YIVjjKvQe5a80ds1J3N7jA",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YIVjjKvQe5a80ds1J3N7jA/o.jpg"
      },
      {
        "img_id": "hKQg3sREKrTB76GX92OxtA",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hKQg3sREKrTB76GX92OxtA/o.jpg"
      }
    ],
    "user_id": "_fGju43E8HBbNbvRwT0JfQ"
  },
  "oKqYk0SMIhbaN4RW7GJPcQ": {
    "date": "12/23/2013",
    "text": "Ive been to the Tempe location, and its great, but this one overcharges, or there menus have the wrong price unless tax in phoenix went up at just this location by like 10%.  I also got WAY WAY WAY overcharged for an appetizer, 5 cold crab puffs, and a bowl of wonton soup came out to $20 for lunch. I am never going back to this location, if I ever go back. They honestly lost a regular customer.  And the salad you get is overdressed and it looks like they do not rinse their veggies.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mQMCByQBV7p-gVe2I94h2A"
  },
  "ArgrZDThBVxP1aqDywxwNQ": {
    "date": "3/5/2014",
    "text": "The food is so so with poor service. This place is dirty. The wonton soup we ordered taste like soup from the can. I had terrible diarrhea when I got home. We don't recommend this place unless you are willing to take the risk of having possible E.coli infection. Our family and friends were disappointed. This is one of the place in our blacklist. :(",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q7ToUI8ID-S9LksxTH67Rg"
  },
  "2SZuk2n8v0XP1juw9ef-AA": {
    "date": "10/9/2013",
    "text": "One of the best chicken panangs (coconut curry) out there.  I actually crave this dish when I don't have it for awhile.  I like to get there early to avoid the crowds.  Seating is a bit tight but if you get there early and it's nice out, the patio dining is really nice.  Also delicious is the pad thai.  My sons like to get it spicy.  I'm sure the rest of their food is wonderful but seriously have not gotten past the two mentioned above.  :D",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yN_v-obrQ3U3ogY0Oz-PvA"
  },
  "zWjGcWPaiY9RQiD_HGl9mw": {
    "date": "11/22/2013",
    "text": "I love this place. Good food, authentic and ethnic, quick, nice atmosphere, courteous staff (family). it's my favorite Thai food. I've been to their other stores in Tempe too and it's the same. My favorite is red curry with chicken, medium. I like the green curry too. Eating there is good and take out works well too. OH, the Thai Iced Tea...sugary but I LOVE it! They have a real nice covered patio that's actually not too bad in the summer as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O4uaf8QLp6TqnymhvRAXCw"
  },
  "jPi9MexfuBYtWIhbc32qBQ": {
    "date": "11/10/2010",
    "text": "Thai restaurants are the only ones who seem like they all have the word Thai in their name. Thai Lana, Thai Elephant, and Thai Basil. Mmmmm I like Thai food. I just said Thai 7 times in the introduction paragraph of this review. Hmmmm  For lunch, this is a bustling place with business people eager to grab a lunch special with soup, egg roll, rice, and main dish. They are well staffed and extremely quick at lunch time. At dinner, it's a quiet place with an eclectic clientele. They do a nice take out business and it shows because the kitchen takes a little while at night.   Our service has been spot on perfect on every visit... rare that I don't find something to bitch about service wise because I'm so ridiculously picky, but these guys are really good. They have a beautiful presentation with every dish that allows for it (some Thai dishes by nature are hideous,) and the decor and restaurant are squeaky clean. So far, I have to say this place is a fantastic choice.   Then we get to the food. Park Central Mall needs a place that serves truly awesome food, cuz their current lineup aint it. Don't get me wrong, Thai Basil's food doesn't weigh you down, isn't full of grease, and is well prepared, but every time I go in there all I can think of is how utterly bland it is. I started asking for extra spicy after a while, but it still comes out bland, and I don't order bland dishes! Garlic Chicken, Pad Thai, Pepper Chicken, etc. All lacking spice or the flavor they should have. Albiet, the food tastes good, just when I go out for Thai, I am looking for some spicy food...  All in all, the lack of spice isn't enough to keep me away... it's just enough to keep from running back. If they would get it right then this would be a great place... I understand your whitey white clientele might not want spicy, but at least offer a choice and take people seriously when they say they want their spicy dish to be spicy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sjWvk3DZapZ-9ULAFtDmYw"
  },
  "6H9KRHQOy2nY-Hy4SN6lDA": {
    "date": "6/30/2011",
    "text": "I chose the pork fried rice from their lunch menu, the pork fried rice was good, but I've had better. The staff were very patient and friendly.   I'll defintely go back here again to try their other dishes.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cTABik0Qu7WrPTElRSYmjA"
  },
  "AGnwpEMkAihVB8-omwvHFQ": {
    "date": "5/31/2015",
    "text": "Packed at lunch. Staff is nice and good is delicious! I always get eggplant garlic and it's full of flavor.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bpcgxKI8h2PPWPRUZ0MS-w"
  },
  "GtRef1IqgcUY88dOTpBFkQ": {
    "date": "6/22/2012",
    "text": "Inexpensive, tasty, fast. The gentle peanut dressing on the pre-meal salad gets you started on a simple, no-frills meal with exactly one option from all of the classic dishes you expect at a Thai restaurant in America: massaman, red, green, yellow, or panang curry; pad thai or chowmein; meat or vegetable rice plates. There's nothing extravagant in spices or food choices, but you can order the spiciness level to you liking.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "bNDCwEUiL75cUpcnUM-njg"
  },
  "XIBM7q85KG8THkAA1pzSwQ": {
    "date": "6/14/2012",
    "text": "There is a reason I ALWAYS come here. The food is always good, the portions are better than any other thai place I've been to. I never pay more than $10. Whoever rates this place less than 4 stars is just being an asshole.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "5ANQiGT0d0RWMJG1LCvNWA"
  },
  "oBTXTDNmsBeTrWlCzMnMag": {
    "date": "4/3/2012",
    "text": "EEEEEEWWW!  Total disappointment! I can't believe this place has any good reviews... what are people thinking?  I guess I'm spoiled with super delicious Thai food in San Diego. hmmm.... I am in town and found this place on google.  I ordered Yellow Curry (because of the positive reviews) and a small cup of Tom Yum soup.....$17 + change total.  Not only was I totally ripped off, my curry was extremely watered down. There was a crap ton of Tofu (which was the one good thing) and only a few pieces of potatoes and carrots.  The soup was watered down as well and prepared completely different then what I am used to.  This place sucks and I will never go back.  Epic FAIL!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "OBcv3qZns_tuMm7aBQvzUw"
  },
  "DjtIJ78njwHw517nXEeK1Q": {
    "date": "8/11/2011",
    "text": "I purchased <a href=\"/redir?url=http%3A%2F%2Frestaurant.com&s=c5fe485af4df376130bee54f875814d79c4d7913e1258123b1206d2bdbf4873b\" target=\"_blank\" rel=\"nofollow\">restaurant.com</a> certificate as well. Though do not hold anything against <a href=\"/redir?url=http%3A%2F%2Frestaurant.com&s=c5fe485af4df376130bee54f875814d79c4d7913e1258123b1206d2bdbf4873b\" target=\"_blank\" rel=\"nofollow\">restaurant.com</a> as we have used them many times before. To help those in the similar situation <a href=\"/redir?url=http%3A%2F%2Frestaurant.com&s=c5fe485af4df376130bee54f875814d79c4d7913e1258123b1206d2bdbf4873b\" target=\"_blank\" rel=\"nofollow\">restaurant.com</a> does offer solutions for when these things happen.   Copied from restaurant.com's site: \"Although rare, restaurants can go out of business or change owners without informing <a href=\"/redir?url=http%3A%2F%2FRestaurant.com&s=0aab4cbd731f3d3b0d1453050d3abc56a8c80bd214e25469c7555b750dca8a51\" target=\"_blank\" rel=\"nofollow\">Restaurant.com</a>. If the restaurant is permanently closed or does not accept your Restaurant Gift Certificate, please contact Customer Service at <a href=\"mailto:info@restaurant.com\">info@restaurant.com</a> (include your Restaurant Gift Certificate number or code) or call us at 1-800-979-8985 Monday through Friday, 8 a.m. to 8 p.m., Central Standard Time and 8 a.m. to 1 p.m. on Saturday. Our Customer Service department will exchange your unused Restaurant Gift Certificate for equivalent credit to <a href=\"/redir?url=http%3A%2F%2FRestaurant.com&s=0aab4cbd731f3d3b0d1453050d3abc56a8c80bd214e25469c7555b750dca8a51\" target=\"_blank\" rel=\"nofollow\">Restaurant.com</a> in the form of a <a href=\"/redir?url=http%3A%2F%2FRestaurant.com&s=0aab4cbd731f3d3b0d1453050d3abc56a8c80bd214e25469c7555b750dca8a51\" target=\"_blank\" rel=\"nofollow\">Restaurant.com</a> Gift Certificate. You can then use your <a href=\"/redir?url=http%3A%2F%2FRestaurant.com&s=0aab4cbd731f3d3b0d1453050d3abc56a8c80bd214e25469c7555b750dca8a51\" target=\"_blank\" rel=\"nofollow\">Restaurant.com</a> Gift Certificate to choose another Restaurant Gift Certificate or Merchant Certificate from <a href=\"/redir?url=http%3A%2F%2FRestaurant.com&s=0aab4cbd731f3d3b0d1453050d3abc56a8c80bd214e25469c7555b750dca8a51\" target=\"_blank\" rel=\"nofollow\">Restaurant.com</a>. \"  Already wrote them and received my credit, will not be trying Thai Basil again better off sticking with Papaya Thai in Tempe!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s8q1bi2--6PtE15WlCYZ8A"
  },
  "_o5meVg9xzSKYCHAt4L7Sw": {
    "date": "1/22/2013",
    "text": "Still awesome. The wonton soup is fantastic when you feel under the weather.  Strong broth with veggies and tasty wontons. :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hrHy0S30UgjPy-dj1J4WNA"
  },
  "avc0WFLI7gSqIn6p75f-aQ": {
    "date": "8/29/2010",
    "text": "Best curry ever! I had the yellow curry and my boyfriend ordered the sweet nut curry. If you are a curry fan you will love this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nq-BQ5RLoHSnEqW-v8a0AQ",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Sweet nut on top, yellow on bottom.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nq-BQ5RLoHSnEqW-v8a0AQ/o.jpg"
      },
      {
        "img_id": "mJdPoBGSSPEOe1NL9_4hqg",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Rice dish!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mJdPoBGSSPEOe1NL9_4hqg/o.jpg"
      }
    ],
    "user_id": "1lU0TtcQqXlHos6Wx1fofg"
  },
  "83YloP0D28vs_lLnk1Lziw": {
    "date": "2/14/2013",
    "text": "The food was tasty and service was good. I didn't have any negative reactions to the food either (like I sometimes get with low quality Chinese food). The problem was that I was hungry like 45 minutes later, and my comrades that ate with me weren't full from their meals alone. The portion sizes are too small for lunch.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "loG8W6cOsNFollQeGYO-Ew"
  },
  "VOJkGICYIunQMX54rG_IDQ": {
    "date": "2/9/2013",
    "text": "This was very delicious food and gracious service.  It was a nice respite in a busy workday to connect with a work girlfriend and eat good food.  I had the ginger chicken with medium spice.  It was super flavorful and done perfectly.  My work friend had a noodle dish that looked amazing.  We were both too busy stuffing our faces to try each other's food.  Good value both to the pocketbook and the waistline.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VXuHnpO4AvZjgfL5KmEEug"
  },
  "J4IChGyNsGRY5ZZvd72mGg": {
    "date": "10/19/2010",
    "text": "Yes, Pad C U twice in a week/???  I'm all up for it!! Usually I eat homemade lunch, but this week has seen my out and about with all sorts of work to do... So, I've been to the Tempe location of this restaurant and it rivaled Touch of Thai at Bell/35th Ave for my favorite Thai place in the Valley, though none have even come close to the places back in Chicago. Solid, solid, solid-you get a small salad as you sit down and I ordered Pad C U and a Thai iced coffee.  The coffee was sweeter than I remembered but the Pad C U was quite good.  More significant 'gravy' than Thai House in Scottsdale and just delicious.  Cheaper too even though they're downtown!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "hsi7zmwZCnxOq675lsEB8A"
  },
  "qok6vrULuIXVesE3gpqm4A": {
    "date": "7/11/2013",
    "text": "This is our favorite restaurant in Phoenix. My wife and I eat here probably once a week. The food is outstanding, reasonably priced and the staff has always been more than friendly. Give it a shot and I'm sure you won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ytFdVrFWlcDt4Ib3drSHVg"
  },
  "HamC1ObfMQsq3Ebhlz76Qw": {
    "date": "7/11/2010",
    "text": "First let me say this, this food was amazing!  Went to dinner with a group of friends from nearby Landmark Education.  I had never been here before but I was looking forward to it.  The restaurant was clean and inviting...  First impressions were definitely a good start.  The server indicated we could sit where we wanted and quickly brought out sparkling clean glasses of water with fresh lime slices in them.  First time I have had lime in my water glass and it was a refreshing change.,  I ordered the Papaya salad.  \"A North Eastern Thai style salad, fresh green papaya tossed with grilled prawns, carrots, tomatoes, peanuts, green beans and spicy lime juice.\"   I have never had green papaya, and was intrigued,.. The order came out within 10 minutes.  Beautiful plump looking prawns sat atop a mound of shredded green papaya.  The salad was garnished with a lovely carrot rose.  The salad was absolutely delicious.  The spicy lime juice was not too spicy, indeed, I hardly noticed any spice at all.  Just a tinge of sweetness made it a perfect accompaniement to the prawns and the green papaya.  The salad was fresh, sweet, and beautifully prepared.  I really enjoyed it.  My dinner partners also enjoyed their meals from Thai Basil, to Pad Thai, everything came out fresh and deliciousliy prepared.  Highly recommend, can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sOqP1_epXTGBV9uQ9Gx8Bw"
  },
  "enR66CNt4MYqEd8aLzxq0g": {
    "date": "3/5/2015",
    "text": "There are times when a place if business is exactly what it appears to be and our meal at Thai Basil was one if them. Pleasant affordable good food with a helpful waiter. It deserves the 3 & 1/2 Yelp stars. A great place for a good quick meal when you are new in town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8bMfjqW7Hbb0GW4Usm0pZQ"
  },
  "2ed7LLAM2Stpm0Devbaa4w": {
    "date": "11/5/2012",
    "text": "Nothing fancy here, but if you work in the area, these people are all business. They will have you in and out in 30 minutes, which is impressive for a sit-down restaurant. You have a salad with a fantastic lime basil house dressing in front of you within 60 seconds. They selection and price are very good, in my opinion. Not the most authentic Thai, but I enjoy it. You can even buy their house salad dressing by the bottle to take home.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u0ad6gr-jlW-uWkCSlVpUw"
  },
  "QlJzz643VGU4BvxdBTUQxg": {
    "date": "7/13/2015",
    "text": "The service here is pretty good, they could give you more attention, but they are very friendly. The food here is great! It is always fresh and exactly how you like it. My father and I come here every month its become a wonderful 'daddy-daughter date\" place of ours. I recommend it to all family and couples.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "KZy1wc5PMpex6v8JjCfkEQ"
  },
  "dRBHOJKQpLSzhdKKoWjfJA": {
    "date": "7/2/2015",
    "text": "Thai Basil continues to impress me just as much as it did a year ago when I was last in town, and now I am also impressed by the staff and Thai Tea. The food is tasty and the servings are more than I can eat, which means leftovers to take home :)   I recently had salmon with my cashew nut dish and was thrilled with the choice. I ate the leftovers cold, and even they were good.  I am hoping to return to Phoenix or Tempe so I can enjoy more food from Thai Basil.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ciuAA-SopfeCgAunkn1ysw"
  },
  "bZ6zY-PcRog_F0Z5zn9RXw": {
    "date": "4/4/2013",
    "text": "Green curry chicken....hope its good....be right back to tell you about it... Well....It was fantastic! We will definitely be coming back. The homemade salad dressing is so good we bought a bottle before we left.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "8sHK8NKpmaW7rK8fHzsYyQ"
  },
  "sS-SlprIJFfOxzXmKrl3UQ": {
    "date": "11/19/2015",
    "text": "Amazing Thai tea. They were very accommodating to me as a vegan. I was able to order Thai tea with coconut milk. I ordered some tofu and veggies dish. Outstanding service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ymVD-rlzzy6_CWK6Ozic_g"
  },
  "ZMNYEOkfGgUI0oCzKlVmLw": {
    "date": "1/13/2013",
    "text": "Went for lunch one day with a co-worker.  It was pretty busy but we were still seated quickly.  You get a salad with your meal, which I did enjoy.  I ordered the pad thai.  It was a little too sweet for my taste.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "QTNMJ8unxkk8XT4Tl4a68g"
  },
  "oTZlT4OF-R2kVnsl9JiEKQ": {
    "date": "3/7/2017",
    "text": "This location is so much better than all of the others - the food is great, the staff works quickly and is very friendly! I would recommend the drunken noodles and the chicken eggplant! I always order for pick up because the restaurant itself is very small.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i9ZSUth4PlTnRDAF8c7wzQ"
  },
  "6Pzp1vkZbkolhNm0ylh-Gg": {
    "date": "12/23/2015",
    "text": "Try their coconut milk soup and pad Thai to start. It's my go-to food to test out new Thai places. It's always spot on! Love coming to get take out and eating in is always nice with friendly service. They aren't joking around with the sign outside about the salad dressing either! It's yummy!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cP3gR8mDZA3Uw5nT6OUglw"
  },
  "J2v7aa85CiLQF6TILafCFA": {
    "date": "3/11/2013",
    "text": "The food is delicious, the service is terrible. The night I came was not that busy, but my table was treated like the table no one wanted to service. We had six guests, a good money making table for them, but I had to approach the server twice to get our drinks in. Once the orders were in, the orders all came out pretty messed up. My noodles were good, delicious, even, but the service turned me off. Especially since the same issues occurred at the Scottsdale location.  Plus, the bills come with just a total, no itemization. The server handed me one, then handed me a larger bill and said she mistakenly gave me the wrong one. How was I to know she gave me the right bill that time?",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "u35VvzM-3kWK-aaF_Vz_-w"
  },
  "IrACISMBBSIh4NaVT3Pb0w": {
    "date": "10/9/2015",
    "text": "This restaurant offers large portions, quick service, and tasty ingredients. The indoor seating area is a little small, but they offer a large outdoor seating area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KxYagwVik2ZyE4BfmFXTMQ"
  },
  "-5L_O8pL8G8Z8F03bxofYw": {
    "date": "12/1/2015",
    "text": "This is by far THE BEST Thai restaurant in Central Phoenix. I have eaten takeout from almost all Phoenix Thai restaurants and Thai Basil is superior in so many ways. The curries are thick, full if flavor, and yummy veggies, and easily serve two people. The thom yum soup is rich in flavor with the authentic fish/shrimp stock taste that can be hard to find. True authentic Thai food and super affordable. It's kind of a he in the wall, so if you're looking for a fancy place, maybe not your first choice. I do take out, and drive extra bc of the AMAZING consistently good food and price!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ISon7pJ4zS1RMk7e9qwJZQ"
  },
  "5FxH-eD83s9d2VuSnjoaSw": {
    "date": "4/15/2011",
    "text": "This spot is the best for lunch.   Drive up and there's plenty of parking. Walk in and seat yourself on inside or on their lovely outdoor patio. Their quick and friendly staff will promptly bring you waters and a small salad with their delicious and tangy signature dressing.   Their dishes use a lot of fresh vegetables and can be ordered as spicy or not spicy if you need. When I'm feeling healthy, I'll order something with tofu and extra veggies. The tofu is soft and creamy, and in some dishes it is lightly fried, yum!  Finish off with a Thai coffee to fight the post-lunch lethargy and I'm ready to head back to the office.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0cuaWgOg2lxwri1NyMiTGw",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Dinner menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0cuaWgOg2lxwri1NyMiTGw/o.jpg"
      },
      {
        "img_id": "O0m88fzSZj2YUArXm_ikUg",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Lunch menu - all lunches are served with a small salad and their house dressing",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/O0m88fzSZj2YUArXm_ikUg/o.jpg"
      }
    ],
    "user_id": "ZrXRSkZPASfFhmF98eQtrg"
  },
  "tcAXNNgrQBbExz8l8KZeiQ": {
    "date": "1/27/2016",
    "text": "I ordered food from here the other day. I was so excited to have my long waited for Chicken Red Curry. Unfortunately, not only was it the wrong size, it was not \"Thai Spicy\" as I requested, and it was missing the red in the sauce- looked like pure white curry. When I called to discuss this with the manager I was put on hold for 14 minutes and then hung up on.  When I called back no one answered. I will never go to this restaurant and I DO NOT recommend it!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PGXPVC5NLoeh5jQbuJhqCQ"
  },
  "2hzElxMd0admHzHlnjCROQ": {
    "date": "1/13/2014",
    "text": "Simple and delicious Thai food. Keep in mind that unless you say otherwise they will make it spicy to their preference.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_jlqa7Rm9EueAfvVrWIJjg"
  },
  "4_CImt2BZVMTBQiL6j_T4A": {
    "date": "9/22/2015",
    "text": "If you love the Tempe location, be advised that the food is different here. The University store is magical and delicious, but the Central location is so-so. Panang tofu is usually my go to, but it's not very good here. I would highly recommend the cashew tofu with a big glass of Thai iced coffee, though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3DjoHkIj9hSMTLLF9oROHA"
  },
  "c6nwJZDWQfIDv5b5tJmGuA": {
    "date": "8/14/2013",
    "text": "This place is fantastic! I always get the Green Curry, just vegetables -HOT! The Red Curry is always great. They both have FRESH large pieces of carrots, mushrooms, etc. SO GOOD! It comes with a side of white rice. Hot or Cold, if you get it to go it will last for dinner and breakfast the next day. Just make sure you don't get the lunch size.  The place is small but plenty of seating, the decor is nice and the service is good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "13sD6TO71SdkB_Xcn275Ug"
  },
  "LOIRG__S3yentBzf6RDYwA": {
    "date": "10/1/2015",
    "text": "Thai Basil never disappoints! We love calling ahead and going to pick up the delicious, mouth watering, authentic Thai food. Soooo good!! Everything my husband and I have tried here is a winner! Our favorites are the Tom Ka Gai soup, the drunken noodles and the signature dish: Thai Basil. Always ready in about 15 min!! Now my stomach is growling just thinking of the food!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7QDUEWkrCcsH6zWUa5gXIw"
  },
  "hcPDsibvNc02VHCYDn_P0w": {
    "date": "4/24/2012",
    "text": "I'm not sure where to start. This was my first experience at any downtown restaurant in Phoenix. Food was good, service seemed to be good and all of a sudden our lunch was ruined. There were four of us and my back was to  the kitchen. One of my coworkers pointed out a roach coming out of the kitchen to the cash register area. As we set and watched we saw at least three roaches. The place was so packed I didn't want to mention it to a waitress or anyone. I was worried it would alert everyone inside the restaurant.   As we left we all became angrier as the day passed by. I tried to call and could not communicate with the woman who answered. After googling the health hazards of roaches I was disgusted and worried that this place would allow this problem to affect their customers. I decided to post in on yelp, against what I would typically do, because I am concerned about the health hazards. I called the county health inspectors and they told me they were already familiar with the problem and were encouraging the restaurant to get it fixed asap. I'm disappointed I don't know more people to warn. The place seemed to be a place that stays packed most of the day.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 11,
      "cool": 1
    },
    "photos": [],
    "user_id": "tnUg3SNuHlmhhvjEaJc1Dw"
  },
  "klj4q4_8qyG1sTyPefurXw": {
    "date": "9/28/2014",
    "text": "The people are really nice abd the food is pretty good, but i think it was to expensive",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "WCjh9VNT9Tvv0JhMXxu-2w"
  },
  "4EyZnu3ziViUkfDM1oeADA": {
    "date": "11/22/2015",
    "text": "I have tried just about all of the Thai food places in town and this one is by far our favorite. The portions are large and the food is really delicious, We typically get the red curry and the panang curry. Really good stuff. We always have left overs.  Only tip, if you want it spicy, make sure you reiterate spicy as they tend to make it mild, even when you say, \"spicy.\" Best is to say \"Thai spicy.\"  I highly recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fd8UxRPT-VnZpB1iubYVMA"
  },
  "iQdTBmj3HOVkCZ9OWO2zhQ": {
    "date": "10/11/2016",
    "text": "Here on business and had a Thai craving so I stopped by Thai basil. The staff on duty was extremely rude and no type of customer service skills at all. To say the least the smell in the restaurant was very unpleasant, it seemed like they had some type of sewage issues in their restroom that was seeping into the restaurant. Didn't see a letter grade in the front window but from the smell and ambience I can only guess it was a C grade. Good luck to anyone patronizing this restaurant.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GyX1K_75YyB6gajNoYpTvA"
  },
  "Z_1khAOXdFLnYaJ1GMLUmA": {
    "date": "4/28/2014",
    "text": "This place is always packed and there's a reason for that, and that is the food.  It's definitely not the ambiance, decor, or surroundings.  I ordered my chicken curry \"Thai Spicy\", which supposedly was the most burning level which I like, and I expected it to burn at both ends, but it was disappointingly mild.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "dq2QflVPpkLsnLhGjREfhA",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Green Chicken Curry",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dq2QflVPpkLsnLhGjREfhA/o.jpg"
      }
    ],
    "user_id": "0tZ7Lk7VZlEjdbLzdYTrzw"
  },
  "tGQgrUWiR3FIVDc9uYhUMw": {
    "date": "8/22/2017",
    "text": "I tried 3 different curries and they all tasted the same. Vegetables in a curry were previously frozen for about a year or so therefore they lack any taste or texture whatsoever. Dinner portions are large enough but if you eat it the next day, there will be a terrible aftertaste of the cheapest oil on Earth. Service is ok but not the friendliest.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3o5CU9VVmOMHG_98xt3zIA"
  },
  "2fhdNZxQsGZ2Osrz0pT-RQ": {
    "date": "4/30/2016",
    "text": "The food was remarkable.  Good service and environment.  We got the coconut soup, peanut sauce steamed veggies and chicken, and pad Thai.  Excellent food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nu5nNKtfcTVDXyMlr-7oyg"
  },
  "VOyNg5lEQ3suEgCBbO2YLw": {
    "date": "4/28/2014",
    "text": "The Hampton Inn front desk person told me to walk toward the back of the hotel, there would be several restaurants. I chose this restaurant and sat outside for the weather was very pleasant. The place was not very busy from the seatings outside but the waitress did not come until 5 minutes later. I ordered the papaya salad and it was not as expected for I have frequent numerous Thai restaurants so I know. There was some papaya lying on a bed of chopped up lettuce with a few peanuts and two shrimps. I guess shrimps are scared here. I missed my dried shrimps on my papaya though. The sauce was fine but not hot as I requested. The portion was alright but I was still hungry and ordered the calamari. The second dish came out pretty quickly and it was good. After the meal, I asked for my bill and again I had to wait.  Overall, this is not a bad Thai restaurant and the food was not bad. I had better! The service was slow.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-USit83FH9jI_hIXYb-xaw"
  },
  "2fFIs94p5FM7Ynj2UiYlcg": {
    "date": "10/15/2013",
    "text": "Oct 16, 2013  Green curry-lunch special with tofu Comes with a small side salad, 1 slice of watermelon, 1 spring roll and hot and sweet sauce for spring roll 4/5  Don't really love the salad dressing though.  Customer service-4/5  Would definitely go again for lunch special.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "L_ddM1XmSWL8TQS_6j7fZg"
  },
  "PfTSaBMt7zyKXaUDAJtHNA": {
    "date": "3/3/2016",
    "text": "I attended training at this shopping complex and found Thai Basil. I ordered the Garlic eggplant and spicy noodles. I ate there the entire week!. For the lunch price, you can't beat yummy salad, plate of good portion good with small eggroll. The staff is friendly, restaurant is clean and they are fast. You can sit down and finish your meal within 30 minutes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ifobaHSMEX2ylus_XU4Kbg"
  },
  "uiABz21nnQL_d6Y2RFiFxA": {
    "date": "7/18/2016",
    "text": "I tried the green curry pork and the curry flavor was spot on.  It had eggplant which was good, and broccoli which is strange for Thai curry.  The dining room is very small and crowded (the servers barely have room to walk), so be prepared to get it to go or to sit outside in the heat.  The lunch portion was very small so if you are very hungry you should ask for the dinner menu.  Price was OK.  Green Curry pork with salad, spring roll, and can of coke was $10.50.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f_Umq-yJM4aISaePD2o1yw"
  },
  "nOcWWymIZXUVz9JDvN9yOg": {
    "date": "7/13/2016",
    "text": "I love Thai food.  I've been going here for years and have traveled extensively through Thailand, so I think I can safely say I know good Thai food.  The Thai food here is excellent and fairly priced.  There's a reason I keep coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9YYtKZBZvQaMlRXqnk1RRQ"
  },
  "cIQr66Nrhiy693EcTDX21g": {
    "date": "7/8/2016",
    "text": "Food flavors are tantalizing! Ambiance is serene. Two thumbs up!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AR2rFgTGcJQ2unqwa3ohZQ"
  },
  "wr1rKsTZWcVw-bH3oR6IpQ": {
    "date": "12/17/2013",
    "text": "I always get my order to go so it's ready in the box, but I found out to get it for here still because you get a delicious salad with it if you are dining in!  I order the beef pad see ew and though it is not the best I have had, it is still good. I hear a lot of people ordered the chicken pad thai, so I will have to give that a try!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "o5NYaP_RA7Eq0juF7tuwgg"
  },
  "thlCql5kj2NHxwpKoqRcKw": {
    "date": "2/20/2014",
    "text": "We stayed at the Hampton Inn nearby and went wandering for lunch.  Stumbled upon this little place and ordered the pad se yu lunch special to go.  It came out pretty fast and was piping hot!  It seemed like your basic standard Americanized Thai food and was pretty good!  The lunch portion was huge!  I was only able to eat half so I saved the other half for another day.    Also, this place was immaculate and the staff was very friendly while we ordered and waited for our order.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ja2NSN7L8N7D-DKL9S9iuw"
  },
  "v2wG4QY-L0vCpYPyprnWPw": {
    "date": "3/24/2016",
    "text": "This is my favorite Thai place in Phoenix! My fiance and I are regulars here and have loved every dish we tried. High quality ingredients, fantastic taste, and the place is never super crowded. We always get really good service too. Seriously, this place is worth many visits. You can't go wrong!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iRQe7CR4t_7a7ZCMnR3J_A"
  },
  "5DdQdhpTeEFVwToz9UybNg": {
    "date": "2/5/2016",
    "text": "Was very excited to try out Thai Basil after all the good reviews we heard from people surrounding our hotel. I had heard that the pad Thai was absolutely delicious. I ordered the chicken pad Thai - *extra spicy! After picking up our two orders and heading back to our rooms we discovered that they had only given us one fork for two separate orders, no big deal. However, then we discovered our pad Thai was missing some of the listed menu ingredients including the peanuts. The sauce was not spicy, but very thick, overly sweet and wayyy too heavily poured over our food. Unfortunately this was not a very great first impression, and we probably will not be back for more. Being flight attendants we love finding hidden gems surrounding the hotels we stay at, for the price and quality of food at Thai Basil - this is unfortunately not one of them.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "USg2m3pUYIDMqPOJt1whrg"
  },
  "18iGH568H40AKKRTYsygkw": {
    "date": "2/15/2016",
    "text": "We were staying at a hotel nearby and were able to walk here before they closed. I had the green curry which was really good. Everything came out really quick and the server was friendly. Loved the decor inside just don't look up. The air vents were pretty disgusting looking. Lots of outdoor seating as well. Overall good experience and convenient to both the Hampton inn and Hilton.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CkYwCp5L0ZXBOjsRCSMtBg"
  },
  "HYmBCVo3u9KKIk0DkTGOwg": {
    "date": "5/8/2017",
    "text": "Not a lot of people know there is a Thai Basil at the Paradise Valley Mall!  It's a great restaurant with wonderful food and super service.  We enjoy going there for lunch, where for $7.99 you get a small soup or salad, an egg roll and a main course.  Best kept secret at PV mall!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PNGZyXI0Ifong17_DIuruA"
  },
  "3ZID9_ubnIhvysI_3KWLfA": {
    "date": "2/6/2014",
    "text": "Came here for dinner. I had their special Basil w chicken and vegetables. It was good but not amazing. We also got the shrimp spring rolls. These were very good. I got my husband the drunken noodles and he did not like it at all. I don't want to judge off of one experience so I'll go back and try different items on the menu. I'm hoping other items will b better because I love Thai food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CVHGjL2hx-EsAvnTHJayYQ"
  },
  "PcoF-qule9og88xtoycycA": {
    "date": "6/30/2013",
    "text": "Yum!  This restaurant is so simple and cute. The pad thai is fresh and delicious, though a little sweet for my personal taste. I suggest asking for a lime on the side to add a little tartness. The red curry is rich and flavorful. The signature Thai Basil dish is also really good - lots of beautiful vegetables and complex flavor.  I highly recommend trying the combination appetizer. The fried sweet potatoes are so crispy and delicious. The spring rolls are a little greasy but really tasty. The fried tofu is very crisp and delicious - goes great with any of the sauces they include with the appetizer. The chicken satay is really moist, and the Thai toast is good, too.  The portions are good and the prices are reasonable. I will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CEoMgtYwcskmU6VOeDAwVw"
  },
  "KKnyCr1zx7Im0xtVMKkC2Q": {
    "date": "11/7/2015",
    "text": "Fast service, good prices, great Thai food!  It's the perfect lunch spot. They have outdoor seating as well. Everything on the menu is good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "edTBmsynNIYbGXv-wtKjgA"
  },
  "Agob2AtfciNk2ptOWxEr9w": {
    "date": "2/24/2013",
    "text": "In the past, I avoided this place because it is located in a strip mall.  So how good can it be?  I should have listened to my mom when she told me not to judge a book by its cover.    I've now been here three times with coworkers and each time the food has been tasty and hot (temperature). The staff are friendly and even though it's a small place, we've never had a problem getting a table.  They use the space well.    The lunch portions are just the right size:  large enough to fill you up, but not so large that you need a nap afterwards.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "_R01htXQGDqEmPdHtBOTVQ"
  },
  "oK0QP3qdhWRS99sNNpAaaA": {
    "date": "12/28/2013",
    "text": "I really liked this place. My entree was very good , and the staff was attentive. I ordered Thai hot , and it was very spicy.  Nice place to go to, if your in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xu6sgBEtf4yKuJe1Tam3pA",
        "caption": "Photo of Thai Basil - Phoenix, AZ, United States. Red curry",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xu6sgBEtf4yKuJe1Tam3pA/o.jpg"
      }
    ],
    "user_id": "PXe-x5SAMzAEn8EOBCVgeA"
  }
}