{
  "c1_oOqLLI1hrK2Ddw_0UXg": {
    "date": "6/30/2015",
    "text": "I was greeted with a friendly smile and surprised at the amount of traffic this place got. I got a Cubano for me and Steak for my wife and a I was quite pleased with the quality of the food and the service I received. I will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "XnR9hL0vHGBsZNgAjX_trw",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Cubano!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XnR9hL0vHGBsZNgAjX_trw/o.jpg"
      },
      {
        "img_id": "fR_HeSZPV73GX-zTujqYCQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fR_HeSZPV73GX-zTujqYCQ/o.jpg"
      },
      {
        "img_id": "e9NBOGzDFQtGitXvC2hcIQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. My wife is gonna so enjoy this!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/e9NBOGzDFQtGitXvC2hcIQ/o.jpg"
      }
    ],
    "user_id": "6TftA_rdK0W5XISklTCHgg"
  },
  "SGJmAPCIB8w6BbtiAubdQg": {
    "date": "4/13/2015",
    "text": "I Grew up in Miami Florida Eating Cuban Food and this Establishment is a BLESSING for us South Florida / East Coast AZ Residents. I thank the food Gods for this place!   There is no bad food here but if your going for a first time i have some great suggestions- load up on the pastries! They are to die for and worth fattening up over - my fav is the Guava and Cream cheese yum.    If your going for lunch /dinner do not miss the classic cubano sandwich  - holy yummy! The pork is just like Miami pork and the pressed bread is amaze-balls! Also the meat pies are a NOT MISS!   They also serve classic cuban Breakfast and cafe con leche (cuban coffee and milk) the eggs are the best in town! And the classic coffee and milk is just a blast from the past from my Miami days!   In All obviously its a must try -  support this small business get out of your normal food box and discover your next Addiction",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "I4uvpuDaUC_kEw-bNuAaZA"
  },
  "XEHDRHn7L5trMptVX4WtIw": {
    "date": "9/21/2016",
    "text": "Surprised my wife who had been bugging for authentic Cuban food. Yeah we use to go to Havanna Cafe,  Porto's and the long trip to Miami. Now I think I've lost her...Great Food...",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GfDRqZ3eBExIieuMYiBtEg"
  },
  "nnT4wal6ejYAPr-bdNGC5Q": {
    "date": "8/19/2015",
    "text": "One of very few Cuban spots in Phoenix. I am a frequent customer here. My friends and I have tried a lot of the menu. Porks and steaks are great. Moros y Cristianos are great too. Having lived in Miami, this is not bad Cuban food considering we are in the desert.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "t2e8bLbRjcXG1H_xam4Ljw"
  },
  "T5FbBSmPTTcdLPvzm-v9kQ": {
    "date": "3/12/2016",
    "text": "I can't believe it took us so long to discover this authentic Cuban Restaurant. It's like we are back in Miami, where I grew up. OUTSTANDING!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "H9Qx6RzS_7uDgKILHS535Q",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/H9Qx6RzS_7uDgKILHS535Q/o.jpg"
      }
    ],
    "user_id": "W100-VXhCFyYwVlAIIyi3g"
  },
  "nKkSa3iho1Lu1YDL5lUUSA": {
    "date": "1/20/2013",
    "text": "It's a shame this great tiny Cuban Place didn't remove the former Mexican Restaurant's sign with the name Bisteces. Also the old Mexican Food Bisteces Sign is still on one side of the shopping center too so if your looking for this place the Bisteces sign might still be up.   This very casual place is very tiny and only has 5 or 6 tables.  We started with the Papa Rellenas (fried mashed potatoes with a tangy seasoned beef center) I didn't know that they would be so large and the size of grapefruits since they were only $3.45 and they gave us two of them. This variation wasn't breaded and seemed lighter than others. The beef inside was very flavorful but not hot with spice.  I had the Pollo de la Plancha that is basically pounded chicken breast seasoned with lime  garlic and onions. The plate didn't look very attractive but the chicken was moist and very flavorful. They gave me an extra generous portion of rice with it and the plate was garnished with a light salad. ($6.99)  My companion had the Ropa Vieja. The beef was very flavorful but not hot with spice.  He found some bay leaves in his Rice and Beans. We've seen at some other Cuban Restaurants that when you find a bay leaf in your Rice and Beans it's like a prize and you get a free drink. I doubt they do that here as I didn't ask but it might be a fun thing to know. ($7.99)  The only thing I didn't like was if you need a restroom you have to walk threw a work area.  Someone from Yelp needs to remove the Mexican food reviews from Bisteces from this place.   I think the food from here will appeal to most people.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "C1d6Kn-0ASpRKvjoMyTZcQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Ropa Vieja",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/C1d6Kn-0ASpRKvjoMyTZcQ/o.jpg"
      },
      {
        "img_id": "HsSHhG9UYHX-NX1_MECdmg",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Pollo De La Plancha  Chicken with Lime Onion &amp;amp; Garlic",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HsSHhG9UYHX-NX1_MECdmg/o.jpg"
      },
      {
        "img_id": "9q49njOPfT5mV9UYoD_aAA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Papa Rellena Fried mashed potato stuffed with seasoned beef",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9q49njOPfT5mV9UYoD_aAA/o.jpg"
      }
    ],
    "user_id": "V-BbqKqO8anwplGRx9Q5aQ"
  },
  "DwQG7WMNwiDak2BcYqliog": {
    "date": "6/10/2016",
    "text": "What a disappointment.  I'm sure this restaurant has good food, it's why we came here. After 20 minutes though we left without even getting near the front of the line. This was avoidable, there was one person both serving and taking orders while another employee just sat there texting on his phone. Don't even think about going anytime after 12 unless you have 2 hours for lunch.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "rHedOfm9JHi60QORxUmtDQ"
  },
  "IcBU8QOOp3zjtRXSqT154Q": {
    "date": "6/10/2016",
    "text": "I was craving this place for almost 2 weeks. Unfortunately the wait time was over 30 minutes just to place your order. I have to give it another try.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "C5TUV85qc_Nb-QnI3YPViA"
  },
  "VCGJ64FiqD4MW4InigDYoQ": {
    "date": "8/7/2015",
    "text": "Fantastic Cuban food at great prices. The exquisite sandwich I had(sandwich de bistec) had great flavor and looked awesome. Note: many of the dishes have a lot of onion so be careful if you don't like onion just like my wife.  My beautiful wife had the classic Cuban sandwich which was really good, however it was huge.  See picture compared to my wife's head.  Got to try this place.  I'm given it 4 stars because my wife said the pastries she tasted had too much egg taste. I thought it was great. Overall and definitely recommend it.   Service was great too and loved the authenticity of the people that work there",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "uPIl6t5iHCHDx1DFzWYlmA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Huge Cuban sandwich looked and tasted delicious. Loved the warm toasty bread!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uPIl6t5iHCHDx1DFzWYlmA/o.jpg"
      }
    ],
    "user_id": "1CM2HlKgNhL38bTMMdYuHw"
  },
  "APiXXsnzdLvd0GXATM3HIw": {
    "date": "11/29/2014",
    "text": "Muy Rica! The food brings back memories of Little Havana from our trip in 2013. The HUGE Cubano is easily enough for 2 people. Syaked on crust bread with of course traditional pork , cheese and taa daw pickle this sandwich is the  real deal.  We were more than please with our food.  Extra bonus is the generous pieces of postres , desserts such as flan , tres gracias cake, eclairs and more. We shared and were satisfied with the rich but not fake tasting flan and tres gracias cake. I look forward to going back.  My one wish is  that they would put in a soda fountain instead of cans but I can deal,  no problema.",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 8,
      "cool": 11
    },
    "photos": [],
    "user_id": "KGsXnYHvYddGaL_jyl0DMQ"
  },
  "hKxqvyE53Hly6m4nglAM1g": {
    "date": "6/14/2015",
    "text": "My Wife & I found this place and came here for dinner. This tasted like little Havana. Although a bit on the small side with only 6 tables, the food was amazing. I highly recommend the Cubano Sandwich. They also have fantastic pastries, that we brought home.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "niIuOHbeh8bAAUNeOeiQHA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Cuban Meat Pies",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/niIuOHbeh8bAAUNeOeiQHA/o.jpg"
      },
      {
        "img_id": "A0paFEqiPhVBWvbknLPUaQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Cubano Sandwich &amp;amp; Chicken Cordon Bleu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/A0paFEqiPhVBWvbknLPUaQ/o.jpg"
      }
    ],
    "user_id": "289XZ50rDG3uEoX263Nnzg"
  },
  "XQA2R6z4R_R56S3mmQWieg": {
    "date": "9/24/2016",
    "text": "This place is amazing! Talk about good food large portions for a good price! I loved the croquetas and papa rellenas!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "dWLdQjvlpNrOREiaO1SWFQ"
  },
  "gp42Ez5IuKmhov3iynS1-Q": {
    "date": "3/19/2015",
    "text": "I came to the restaurant with high expectations based on the reviews given here,  but was a little disappointed. I ordered the bistec encebollado (steak and onions). The steak was too salty for my liking, the accompanying beans and rice mixture was pretty good though. I also had a bite each from my friends' cubano and ropa vieja dish they ordered, but neither of the items really stood out for me. I didn't get to order any of the baked goods, but I did over hear the lady saying they had something that contained guava in it, so perhaps I'll return and try one of those.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "E9xFGwpZMXb4NC5004Bdbg",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Bistec encebollado",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/E9xFGwpZMXb4NC5004Bdbg/o.jpg"
      }
    ],
    "user_id": "Npim4I7cjLhnbgX8qt46jg"
  },
  "OGPgogizu9PnzOeGzBxC-A": {
    "date": "5/17/2016",
    "text": "Best Cuban Sandwich, Papa Rellena Jamon croquet's in the valley and everything from the bakery!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "56Pr0F2OhnF7nS38l1ezlQ"
  },
  "Ked_RF4odI2_C4jP2WN5aQ": {
    "date": "9/15/2014",
    "text": "I once had a friend who I would visit for business reasons several times a week. She lived in a beautiful house atop a mountain overlooking the ocean. She would start my day with a heart-starting cup of Cuban coffee, feed me sugar-laden Cuban pastries and at lunch drop me to my knees with the most incredible Cuban meals.  Maria moved back home to Miami and I visited her several times, including a memorable visit to a local Cuban district that tourists never see, where we wined and dined the night away as if in the golden days of Havana. I have tasted and appreciated REAL Cuban food and I know what it should be. Cuban Foods has brought it to Phoenix!  Today, on the way to pet sit for some friends and being a Sunday a favorite go-to little dive was closed and since I was looking at a bio of Mark Cuban (not a Cuban) I wondered if there were any good Cuban restaurants in Phoenix. What a surprise, there was one only a few blocks away from our friends' house.  We walked in, two guys, early on a Sunday afternoon. Every table was full; it seemed all with local Cuban families. We were approached and greeted by a young man who welcomed us, asked us if it was our first time there, and explained that they are a family restaurant. He mentioned that several times, with a lot of pride. Since the tables were full and we had the opportunity to take our order out and eat it at our friend's house while we pet sat, he was happy to accommodate.  I have been fortunate to have been welcomed at some of the most incredible small mom & pop dives in America by wonderful hosts, many times the owners or family, but I must say this young man ranks at the very top. He was literally glued to us to assure we received the absolute most personal and most welcoming service. After handing us the unbelievably complex menu he stuck close, helping us wade through it, and finally pointing out our best choice for a \"to go\" order, their Cuban Sandwich, and suggesting that it is so large that we could easily share it.  He then patiently explained their drink menu (non-alcoholic) that he proudly let us know was brought in from Miami. After taking care of our orders he noticed that there were not enough chairs for us to sit in while waiting for our take out so he graciously snagged another chair for us. Not that the order took that long to prepare. And GRACIOUS is the key word, this young man was gracious beyond belief.  The Cuban sandwich was, indeed, large. Much too large for one person to usually eat, so splitting it was an excellent idea. From my memories of what Maria used to prepare for me, this was 100% authentic Cuban, not that I had any doubts. The only, um, negative is that in our Styrofoam box in addition to the sandwich halves pierced by a single pimento-stuffed olive each was a handful, and I'm talking about a tiny handful, of limp cold French Fries. The fries were an embarrassment to the high quality of the sandwich. PLEASE, owners of Cuban Foods ... understand right now that the cold soggy fries are a huge negative. Replace them with something else, anything else! Some Cuban rice. Some Cuban beans. A slice of Plantain. Throw the fries in the trash and NEVER serve them again.  I will overlook the horrible choice of fries this one time and rank Cuban Foods as a solid 5, which it earned without question on the strength of the young man's astounding customer service and by virtue of a sandwich that surpassed all expectations. Listen up. Next time I visit I hope and expect never to find French Fries again in your amazing little restaurant! And I hope any restaurant worker in America, employee or family, can learn from this young man's amazing commitment to customer service.  I'm sure even Gordon Ramsey would approve!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 4
    },
    "photos": [],
    "user_id": "Pj9YpaP0T7A_5S_PT8IpNg"
  },
  "2mTThc3fs7uWlQdA4109AA": {
    "date": "7/26/2015",
    "text": "Great food, fast service! Love this place. We originally came here for ropa vieja and ended up ordering a few things of of their menu--- all of which were delicious! FIVE STARS.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "2uUDJwLBTkTD9ZW7HclpQg",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Sandwich Cubano",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2uUDJwLBTkTD9ZW7HclpQg/o.jpg"
      }
    ],
    "user_id": "zqzY0kJgArFxZI_4vQg0AQ"
  },
  "yW21s6GA2KCABcEVi6XpsA": {
    "date": "2/21/2015",
    "text": "Authentic Cuban food. Small local restaurant for intimate group. Lovely home made tasty dishes & friendly server.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4n7lQDju1y03OFQ3Ibh45w"
  },
  "GEu6bt-xFLOqgEm6C9r0yA": {
    "date": "11/4/2015",
    "text": "I'm rating at 3.5 stars, but don't have that option.  I went there never having had Cuban food before.  I had the pork and black bean rice.  As far as food goes, I liked it very much.  If I were to rate just the food, it would be 5 stars.  It was that good.  The service itself was also very good, and the server took good care of us.  No complaints there.    However there were two issues.  The first was not within the restaurant's control, so it was not their fault.  There was a large, noisy family that literally took up half the restaurant, which has a small eating area.  I would say at most it can seat 40 people, if that.  While this trashy, noisy family was not the fault of the restaurant, it sort of put a damper on a first time experience at this place, as well as a first time experiencing Cuban food.   The second issue was the dirty silverware.   The forks were poorly washed and had food particles on them. Since the server had their hands full with the obnoxious family, I didn't want to pile on with the silverware, and I just used a spoon instead, but I didn't like that.    My recommendation is the food is great, and the servers are nice, but just get the food to go.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nR4ycs_4uYAfuJoSKPGHHg"
  },
  "lWDv9VsGuOFfiWa69deJ1w": {
    "date": "5/23/2016",
    "text": "I saw all the good reviews so had to check it out. Big portions, tasty.  -Tostones Rellenos de Jamon y Queso - 5 stars worth. So tasty and crunchy specially when it steaming hot -Sandwich Cubano - 3 star. The sandwich was good, but it was too dry for me. It was  really dry -Ropa Vieja - 5 star. This was really good. I ate the whole plate -Toscinillo del Cieli - 3 star. Decent, the cake was a bit on the soggy side.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ne3ZBzC4O2XQbqGYP0acUg"
  },
  "rp-93SCSYUBvlecdeZ-VTw": {
    "date": "10/2/2012",
    "text": "Man, this is a tough review to write.  The food was great, but the service...ugh...we were there for almost two hours.  It was a full 40 minutes to get appetizers, an hour until we got food.  It was clear they were short-handed that day, but it was Saturday at lunch, the place is small.  How about planning?  Very disorganized service too, forgetting things and getting some wrong.  Everyone was friendly, just short-handed and disorganized.  I'll go again, as it's the only place I've found in the valley closer to me than Ahwatukee that serves honest and authentic Cuban food (being Cuban myself, I've had a sample or two of what it should be).  I'd recommend trying it.  Just plan to spend a lot of time there.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "jzkbhkRdjWPwTIOgRGggIg"
  },
  "0rSz4IID6gn6Xz00dgDIfw": {
    "date": "4/21/2016",
    "text": "Every time I'm in Phoenix I visit this Cuban joint!  Consistent, tasty, and service is A1!  The media noche is delicious love the bread. The stuffed potatoes are heavenly, basically mashed potatoes and tasty ground beef. Maderva is delicious try it!  I got the shake also tasty! Plantains are to die for... And black beans and rice is",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "m4tdbbJ75OCbFLd9jFk5pw",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. This was my meal and it was bae!!!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/m4tdbbJ75OCbFLd9jFk5pw/o.jpg"
      }
    ],
    "user_id": "rdTTOtxoRZrEiZnFhXGMXg"
  },
  "vZJsqRUB5RZrFK0jRGtb0w": {
    "date": "3/17/2018",
    "text": "Great Cuban sandwiches, service was a little slow today, they where busy and maybe short-handed",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PrENpr6R891r46ixi7FOrQ"
  },
  "4GqIhAmsMfe5Uc56cctDJw": {
    "date": "5/1/2018",
    "text": "They have guava and cheese pastries that are just amazing. I had the Cuban coffee and it was good. But I didn't get a chance to try the cafe con leche.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sGzgEwprM8MI-Cnx5ShTdw"
  },
  "IryQL5bT7RTD13pkfLxTmw": {
    "date": "12/24/2017",
    "text": "As a Cuban, I LOVE this place! Have been coming here for YEARS and they just keep getting better. The food here is as AUTHENTIC as my grandma's food and the service is always as nice! When I don't come for lunch/dinner, I take home boxes of pastries for the family, which are always fresh and delicious. Can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "tIiFjLyuGFEuEypOFo3Pew"
  },
  "PURODuJ91KR-t0C8qwM8BA": {
    "date": "7/31/2017",
    "text": "This is my second time here in the past 2-3 years and the restaurant has been remodeled which is nice because there is more room. Ordered take out and portions were small. Red shredded beef was tasty but needed to be drained due to all the oil. The owner has always been nice.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "auHnCSBQKrCl3Pm3ETY5hA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Fried mashed potatoes with ground beef inside.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/auHnCSBQKrCl3Pm3ETY5hA/o.jpg"
      },
      {
        "img_id": "N9IH4u19OfHyCs_SaoO4Rg",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Will definitely pass on the empanadas the next time",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/N9IH4u19OfHyCs_SaoO4Rg/o.jpg"
      },
      {
        "img_id": "ljxf4zU--aZgZY1oYf-vGg",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. You can see all the oil under the rice and shredded beef.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ljxf4zU--aZgZY1oYf-vGg/o.jpg"
      }
    ],
    "user_id": "9SXy2gvJkTAB9_tLQM-4bQ"
  },
  "ymiE13mdPNDOw0GSlu7tuA": {
    "date": "1/5/2016",
    "text": "Let me start by saying that this is the first Cuban restaurant I have ever been too. Honestly I didn't know what to expect, since I never had Cuban food, only seen pictures. ..   For starters we had tostones De camaron, so good . Is garalic Shrimp and they provide enough for two. I will definitely be returning to eat them again.  I was so excited to try their Cuban sandwich.I was very excited because I am fan of the Cuban torta(mexican version) of their sandwich. To find out that there is so much difference from both. The sandwich has pork , ham , cheese, pickles , mayo and mustard. No veggies. I honestly am not used to eating a sandwich without veggies (next time I'll add lettuce and tomato ) and the sandwich is pretty big , especially after stuffing your face with appetizers !    their menu also has a item called Cuban sandwich (Mexican style) I believe they might be referring to the torta. Even tho they have different ingredients; I do not recommend, I also ordered it and is almost the same as the Cuban sandwich, but different bread and with lettuce ,which is not the definition for a Mexican torta.  The service was great , the person working there was so attentive, even tho she was the only one there talking care of 5 tables.   Before you leave I know you will be so stuffed and you are not going to be thinking of food anymore buuuut I recommended you try their bread, just take it home and eat it later. I honestly don't know the names of the bread but none disappointed me. Is so different from what I tend to eat, so I was glad I took some home.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 8,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "QBMAfNmMfR23jeZrq6q7ug",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Cafe cubano . Cute tiny cups. Strong taste",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QBMAfNmMfR23jeZrq6q7ug/o.jpg"
      }
    ],
    "user_id": "iCPiobbDTJSeo7sKcF_qQA"
  },
  "D6GewF_LWRJDKYPURyIqmQ": {
    "date": "7/12/2017",
    "text": "was over here while my husband was looking at a truck. we are parked,  and i look up, see  ' bakery' .  I wanted to go in and so glad we did!! I got some desserts, and man they are delicious!!  the eclairs are not overly sweet, the cakes are gorgeous and yummy!! very clean restaurant, and very nice and friendly staff!!!! they also ask if you need plastic utensils for dessert take out, which I thought was cute!! definitely eating sweets on the way home!! I will recommend to others!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-cqwdXaVlPu1mcBX-CgvYg"
  },
  "VjlWNvlX1LA58UX8HVwywA": {
    "date": "2/17/2018",
    "text": "Authentic and delicious Cuban food! Just like Miami. The Ropa vieja and the tostones were really good. This is the best cuban food in town. The dessert selection is also great and their guava pastries with chesee are really yummy. The ambiance is casual and its grear for a late lunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PgN-rqXVZvx9UT_eAMxtAQ"
  },
  "6GNBbJkqMYhokBmyp6R9jA": {
    "date": "3/15/2017",
    "text": "I never knew people could get into your board and alter your review well that's what happened with with the review I did for this restaurant.  Hmmm I wonder who did that? Don't people know it's easy to track them down? ************************* Below is the tampered review  \"Don't let the looks fool ya.  The food tastes really good, it's authentic, fresh and delicious!  Service and appearance should improve cause these guys get slammed. One important comment to them is they need to put a bathroom I think it's the law.\"",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-PWQGXpggw-BTa3Kc4u4uA"
  },
  "nAEepPKSrbAiymFZ0Usukw": {
    "date": "7/1/2017",
    "text": "They have expanded! 13 tables, smallest one seats 4, largest seats 8. So excited! Hours are Tuesday to Saturday 10am to 9pm, Closed Sunday and Monday",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CWC_uMiJiB8ucji-S5JfEA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Yummy desserts",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CWC_uMiJiB8ucji-S5JfEA/o.jpg"
      },
      {
        "img_id": "6RV336O5vH2DwMVaq_Q88w",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Cuban feel",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6RV336O5vH2DwMVaq_Q88w/o.jpg"
      },
      {
        "img_id": "QOe5Zx3Gf72XNMOv_GWroA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. 13 tables",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QOe5Zx3Gf72XNMOv_GWroA/o.jpg"
      }
    ],
    "user_id": "DO0sYmPRKWE2ElyR_2n0xQ"
  },
  "faygQYxUk8QqToe66b2zRQ": {
    "date": "2/22/2018",
    "text": "Going to give this spot another run,the first run was very good and the size proportion was good enough to share",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yqz7KotmVKCPsFMCgeb7ag"
  },
  "UB_uEzvQ00N2AKoQn45isw": {
    "date": "10/17/2018",
    "text": "Great customer service from Ana and some of the best Cuban food I've had in awhile highly satisfied",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YtPqf4wcloPX8L9cBiqVHQ"
  },
  "Lak0L3fb3HXdlWJrBp6YBQ": {
    "date": "4/23/2017",
    "text": "Over all the best Cuban food you'll find in AZ. My husband and I have looked up and down for a good Cuban restaurant and had been unsuccessful until now. Unfortunately most Cuban restaurants in AZ claim to be Cuban but definitely don't have the right seasonings or probably even the right chiefs. However this little gem is great. My husband had \"the pollo a la Planca with arroz blanco, frijoles and maduros\". I had the \"busted empanizado con morros, ensalada y yuca.\" I was honestly very impressed. We had come to this restaurant a few years ago with my father in law and at the time it was much smaller and the quality of food lacked. We decided to give it another try and it was well worth it! So glad we came back! The food was delicious and the service was good. (Which is more than we expected) so glad we came!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4ZEp-WRsJk6T-Zk-HLWZSw",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. The menu!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4ZEp-WRsJk6T-Zk-HLWZSw/o.jpg"
      },
      {
        "img_id": "cd7Y7D7rl0dB1facuPpeUA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Yuca, ensalda, y Moros!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cd7Y7D7rl0dB1facuPpeUA/o.jpg"
      },
      {
        "img_id": "HV3FIjm7Iq5mss_irm7UuA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Busted empanizado!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HV3FIjm7Iq5mss_irm7UuA/o.jpg"
      }
    ],
    "user_id": "oeZbVotJLllEPl6tuJkMTQ"
  },
  "aVoe9jTc2COwT6g7lnA71g": {
    "date": "12/6/2017",
    "text": "I lived for 30 years in south Florida, and after moving to Phoenix was thrilled to find a Cuban restaurant here. We miss boiled yucca, plantains, lechon asado, and especially cafe con leche.  Sadly, we were disappointed in this restaurant. The cafe con leche was merely instant coffee stirred into hot water, and the meal overall was mediocre. Based on the positive reviews here, we're willing to visit a second time - maybe for lunch, but our dinner here made us miss the wonderful Miami restaurants even more.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "IA8QcSMtCoFN4QKwSXI3Uw"
  },
  "6JBIF9iDjdITfbxhOxRCVw": {
    "date": "3/22/2018",
    "text": "Clean little spot with good food. Had the media noche and the flan. The sandwich was way bigger than I thought it would be and had great flavors. The flan was ok but nothing amazing. The only disappointment was they don't have standard Cuban items like \"cheese rolls\" which I'm used to finding in all the Cuban places in CA. Definitely worth a second visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vTmVUzGXvkJPLoi5rR-0cw",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vTmVUzGXvkJPLoi5rR-0cw/o.jpg"
      },
      {
        "img_id": "UwwbS5Z6Vq3dKmuSNflJ7g",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UwwbS5Z6Vq3dKmuSNflJ7g/o.jpg"
      }
    ],
    "user_id": "8VZqEVrG8xrNGnxV67sUeA"
  },
  "MQi37N7HSuoGoV4K51De9g": {
    "date": "2/4/2017",
    "text": "Cuban sandwich was delicious! Cafecito and desserts were enjoyed by my familia with no complaints.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "0a8nGySEFgRAKekwjCjfVg",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Menu has lots of options. Yum yum!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0a8nGySEFgRAKekwjCjfVg/o.jpg"
      }
    ],
    "user_id": "XOx4qMPPyo_mKhAzQ-uZkw"
  },
  "8sE5m-dY9AW0JwErXXvuOA": {
    "date": "11/22/2017",
    "text": "One of my favorite spots to eat, and I will gladly drive the distance to get my fix! I went last night after not having gone for almost 9 months. Was pleasantly surprised to find they have either remodeled, or moved to the store next to the old one for a larger location, including (yay!) a bathroom, which the old location did not have! New location was larger, more open, clean, and nicely decorated. Our server was very nice and attentive, and service was fast as well. Ordered lechon asado and maduros, and it was enough for dinner, and lunch today. Can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_6Cyjkvy05CTjKtbJZ-3bg"
  },
  "Jv5CdkT5jPUmSwlXxLUspw": {
    "date": "11/29/2015",
    "text": "I'll get right to it, this place gets 5 stars for serving the best Cuban food in the valley and three stars for comfort and service.  I love visiting ethnic places where the crowd is mostly natives. We came on a Sunday for lunch. Six of the six tables were occupied by Hispanics, three of which were Cuban families. As most reviewers note, the place is small, and had only one waitress/hostess/cashier/busgirl taking care of the entire place. We had to wait a bit but she was nice and attentive, but a bit overwhelmed. My three star rating is not because service was poor, they just need to hire one more person.  The food is very authentic. The tostones and platanos maduros were made fresh, the fries yuca was frozen but tasted good. The croquetas were also frozen but good as well. For entrees we had the masas de puerco and the ropa vieja, both authentic and tasty! It reminded me of a corner joint in Miami (except for the frozen products).  To the owners... great job! Consider expanding to achieve a 5 star review.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "u1iUd2mZzpgGPiVWHLgOZg",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Masas de puerco",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/u1iUd2mZzpgGPiVWHLgOZg/o.jpg"
      },
      {
        "img_id": "hmTucEfP6vDEgW2aVVtnPA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Cuban sanguich :-)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hmTucEfP6vDEgW2aVVtnPA/o.jpg"
      },
      {
        "img_id": "rH0jiRhiKN3VuJz6j7excQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Yuca",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rH0jiRhiKN3VuJz6j7excQ/o.jpg"
      }
    ],
    "user_id": "ANLu67XOk8YeHmYV0itUIA"
  },
  "lTtsZzE36Kpb-S5kMo299w": {
    "date": "8/4/2018",
    "text": "I have been missing my dad's cooking and found out about this place. All the positive reviews won me over.  My wife and I tried to have dinner here.  When we entered there were 2 employees working.  They both looked over at us but didn't say anything.  So we assumed that meant we seat ourselves and someone would be with us.  As we tried to fi d a table to sit at we would every table we looked at was dirty.  One of the 2 employees finally came over and cleaned off a table for us. He gave us menus and said someone would be right with us.  We waited and waited.  Both he and the other employee looked directly at us but made no move to help us.  Then a small party came in.  They were helped Immediately. That was my limit.  We got up and walked out never having anyone take our orders.  This was so disappointing.  I don't know if we just caught them on an off night or what but the complete lack of service was ridiculous.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C5KEWRwm22lMJpDuWFCFUQ"
  },
  "l4Y_evuusoIwBxSqQCooww": {
    "date": "11/28/2017",
    "text": "I'm not Cuban. I've never been to Miami so take this review however you like, but the Cuban sandwich here is DELICIOUS. It's huge and has everything a Cuban sandwich is supposed to have, roasted pork, ham, swiss, pickles, yellow mustard, delicious bread. Great job!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "p4fi6kNjxKjF2r2miwKHBg"
  },
  "8XXVj9bjtHfsg7DSskHQSg": {
    "date": "12/13/2015",
    "text": "Wanted to love, but couldn't. I've got a pretty open palate and not that this is what I consider adventurous, I am not afraid to try almost anything. After reading the reviews I HAD to try this. When I'm trying a type of food I have a tendency to try a lot just in case I will never be back. I'm not judging service because I realize there is one super sweet lady working up front, and she was nice. Aside from food, the only thing is this is really small, which is great, but when people come in, I started to feel obligated to hurry and finish so there was space for them. Anyway. Food ordered as followed: papa rellenas- meh. Good, my husband liked more than I did, but seemed to be lacking flavor. I loaded mine with Tapatio, but the meat filling just didn't have much discernable anything. Tostones was next and it seemed mismatched. Vastly improved with tapatio. Also got the cubano sandwich, which was good, the bread was perfect actually, however it had some insanely hard parts that I literally couldn't chew up. Like bone fragments, but they weren't, just crazy hard meat. Flavor wise very good. I think the lady dish we got was the beef bistec, which was dry and flavorless. The onions were the only thing that saved it to keep it edible. Ordered some desserts as well, but not impressed there either. I might have a screwed perception of flan, bit I expected it to be creamier.  Overall nothing was horrible, but nothing was magical.  Super bummed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oH2UysJZZ0RODukF-s3H2A"
  },
  "iwti0cHg25bQqk-Z9eqwsw": {
    "date": "1/6/2016",
    "text": "Croquettes de Jamon were delicious; as was the Cuban coffee.  Small, unassuming restaurant tucked away in a strip mall serving authentic, tasty Cuban food....would stack up with mom and pop places in Miami!  I'm glad I stumbled across this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kcq1yCseSA9XDJ6VlbWfqQ"
  },
  "GBE0khsw9Kq39-REc4_2mA": {
    "date": "9/19/2013",
    "text": "This is one of those little gems waiting to be diacovered, after visiting it a few times this is now my favorite restaurant in phoenix . I am from Puerto Rico and it is hard  to get good  Caribbean food in phoenix, therefore I fell in love with this place after coming here (by way of yelp). The food in Bisteces feels authentic with the right seasoning and preparation. I have tried other places around the area and they are descent but nothing compares to this.I would recommend trying the bistec uruguayo, it is very tasty.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "7sSvutfUklIWTDNvqZ7cnQ"
  },
  "CseRdeweUvPT7jHsFeV71A": {
    "date": "8/15/2011",
    "text": "Best Mexican food I've had in a while. I just wish their tortas were bigger.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NiCuHkRhY1WAScf9-I9ixg",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NiCuHkRhY1WAScf9-I9ixg/o.jpg"
      },
      {
        "img_id": "pf4JHF8wQqjs_gUtg79ExQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pf4JHF8wQqjs_gUtg79ExQ/o.jpg"
      }
    ],
    "user_id": "MyoJe26ygsKhOm9Y1egWuQ"
  },
  "D6r5gXaCVAUUcQYkdRpesQ": {
    "date": "7/10/2014",
    "text": "Everything was great, the only reason I gave it a four stars instead of five stars was some of the food were a little too salty, particularly the pork tamale and bistec urguaueno. My friend, a Miami cuban, had the bistec en cebolla and said it was well seasoned, not salty, and it reminded her of her grandmother's cooking. The blackbeans were awesome and the flan was perfect.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8OUrGUQEiqO4LGIji9awWQ"
  },
  "oTlPIoUQbjS8EiqPNWIQrA": {
    "date": "8/7/2015",
    "text": "Came for lunch on a Yelp recommendation. Had a Cuban sandwich to go and it was amazing! I ate half and was taking a break when my wife came home for lunch and took the rest. Great flavor, temperature, and texture. This restaurant is 20 minutes from home and I will definitely be back for eat-in - and to try the baked goods!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "bpKareI3ekWAta8vwspA3w"
  },
  "4bEJYChMCtszMyLxhDfnWw": {
    "date": "3/17/2015",
    "text": "The Cuban sandwich was very good, and it's a pretty large portion. It can easily be split between two people. The flan was delicious. The consistency of the flan is more porous and firm than some of the most common Mexican types. We also had the guava pastry, which was great. Looking forward to eating here again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "GPsSAGB45yodTwDN9i0GgQ"
  },
  "w549lHaYAX_bVnEa8bR65Q": {
    "date": "10/2/2014",
    "text": "Unpretentious, inexpensive, authentic and a trip to hometown down flavor-town-road  waiting to happen.  Born in Puerto Rico and a traveler by choice, I'm always searching for that special gem hidden amongst all the noise other have to make.  Cuban Foods is by far the best cuban restaurant in the valley.  The menu is simple while including all the treats one expects for an establishment of its kind.  \"El Congri\", \"los tostones\", \"\"el pernil asado\", sandwich \"cubano\", \"la media noche\", \"el flan\", are a few of the delicious item that will entice your taste buds.  All they are missing is the sound of the Caribbean waves breaking against \"El Malecon\", the smell of the ocean in the air and the palms trees, as if dancing, swaying at the rhythm of the sea winds.  Oh yes, the staff can accommodate our spanish challenged brothers and sister without missing a beat.  Do not be afraid and take this free trip to Havana, any time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "lfacfHhZh3vfUYQZ3mFqUw"
  },
  "UV0_SlnY_aOWtiEIvRHrvQ": {
    "date": "1/17/2009",
    "text": "This is the best hole-in-the-wall Mexican establishment I have found in Arizona. With Mexican food I generally believe that there is an inverse relationship between taste and price, Bisteces is an excellent example of this phenomenon. Bisteces serves yummy authentic Mexican food in a cute environment with hand painted walls. I will also say that the bathroom is one of the cleanest public restrooms I have visited. Although probably not worth a long drive, I will definitely return to Bisteces.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "E3D81ydt7-XlDnos3JVjxw",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. An amazing chicken enchilada",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/E3D81ydt7-XlDnos3JVjxw/o.jpg"
      }
    ],
    "user_id": "RxYFAupELc9Jcb7SkKlj5Q"
  },
  "0VhaXpJ6T_-xK8Atn1r9hg": {
    "date": "3/7/2014",
    "text": "I stopped in and had dinner here. I had the bistec empanizado (breaded skirt steak) with black beans and rice it was excellent. My beans and rice were room temp that's why I gave them a 4. But their papa rellena as an appetizer a good portion and had a well balanced flavor. I was too full for deseret \"senorita\" so I took it to go. Overall an awesome experience.  Next time I will try the Ropa Vieja.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lzlBzlRf3R-wiv_dDQub9w"
  },
  "KtZAn2Swsvl8mfiFgVLYsQ": {
    "date": "2/11/2015",
    "text": "Just went to this restaurant and would not recommend it. Not only was the Cuban sandwich the worst I ever had, but the waitress had a terrible attitude.  I am cuban and love exploring Cuban restaurants while traveling.  Never this one again!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bWkyYktjHxafoOBSgP1OTA"
  },
  "vj06CA8nykfSA5UkFTm-XQ": {
    "date": "6/9/2013",
    "text": "Grabbed some take out on a Sunday night. The pollo de la plancha was very flavorful, but a bit dry. Loved the lechon asado. Both entrees had a perfectly dressed, small side salad and also came with rice. We had the papa rellenas, which had a nice thin crust covering smooth mashed potatoes around seasoned ground beef. They were delicious, especially after sprinkling on some tapatio. Can't wait to go back and try some more!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "jDHONANnbKEghvae3oR1gg"
  },
  "mtpc53kPt32uaafe_9UHIQ": {
    "date": "5/2/2012",
    "text": "i think this place closed down and became a cuban restaurant.. i want to write a review for that place..  well, quick review.. it is good =)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "Eg5niduTCVnaIBzGmoLiVQ"
  },
  "zZuGymIZJxki7PbxVhIh2Q": {
    "date": "9/3/2012",
    "text": "This review is for the CUBAN FOODS bakery/restaurant, not the Mexican one formerly at this location. Ana and Manuel, the owners, took the time to introduce themselves and make sure that each of the 10 members in our group got great suggestions and had a very fine and delicious Cuban lunch. Highly recommended (I'm a former reviewer from Chicago). Nice variety, informal but attentive service from staff, everything prepared very well. I wish I lived much closer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XsyjbXjr98xCGlvr5U75uw"
  },
  "0SQFY1rPThh-BGU5Nfp0zQ": {
    "date": "4/11/2009",
    "text": "I went here tonight for dinner (take-out), and it was pretty tasty. The rice is yummy, the beans were good. I got the #7 which was bisteces steak & onions - it was good, but next time I would probably try the chicken enchiladas, because those look awesome.  I also got a super fresh, super delicious horchata. And the man who took my order (I'm pretty sure it's the owner) topped it off. (That's awesome!)  The place was VERY clean, quite a few booths available, had a TV. Anyway, I loved it and I'll be going back again for sure.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "kiRw2kTaYXR-OgDmvlBHqA"
  },
  "khAD9_Y2-5lDdS05NTeWfg": {
    "date": "4/5/2014",
    "text": "This place is definitely authentic Cuban cuisine.  We ordered the Cuban sandwich and tostones (fried green plantains).  The food was delicious!  As another reviewer stated, the bread was a bit crumbly.  I grew up in Florida, so I have had plenty of Cuban sandwiches in my lifetime, so I know that the bread is supposed to be somewhat crumbly, but it was a little over the top.  Also, it was a to go order, and it took about 30 minutes for us to get our food.  Slow, but worth it in my opinion.  Next time we will just call ahead.  My husband made a comment about the cashier/waitress's personality (or lack thereof), but I didn't really notice anything.  She was really busy though, being the only one who was taking orders, cashing out customers, bringing out the food and cleaning the tables.  I would be miserable too, poor girl!  Anyway, the crumbly bread and slow service are what made me take away a star.  However, we will definitely be back.  It's hard to find Caribbean cuisine in the valley, especially as good as this!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "EumOvp_EBdvJ7KkxS0o5Hw"
  },
  "o4GjecV1O3MZ4Ow7CBEJJw": {
    "date": "12/28/2011",
    "text": "Our office is in the same strip mall and we eat there almost daily.  Randy makes excellent food.  The place is always clean.  Muy sabrosa, Senor!  Excelente!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yoq9IxeF6aJZya97ZPbMEw"
  },
  "loT4rOcFH_RaV5x80GSTxA": {
    "date": "2/4/2011",
    "text": "A few bucks more than your fast food Mexican chain restaurants, but well worth the price. Right next to my office and has quickly become a favorite. I get the machaca (shredded) beef burritos or tacos, and it is always so hot I have to wait a few minutes to eat it. A+ Headed there now!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "TzBhLLeWuMZ2U-90RakXuQ"
  },
  "bqvOHlF2Q_Gb914Hawbigw": {
    "date": "9/25/2010",
    "text": "Really great place to get some tacos.  The salsas are good and the chips are fresh when you order them.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OEcbaFhqWLnme9imzLZwPw"
  },
  "GYp2O-TuS4fdPrQIEpUA7g": {
    "date": "10/23/2017",
    "text": "Found this place on accident, since we like to try different places we thought we would try it. Wow, what a great find. Our sandwiches were excellent the deserts, well we ended up taking a to go sample box filled with goodies. We will definitely return to try other things on the menu.  The waiters were attentive and explained things we did not know.  Definitely great home made food plus the smell was very appetizing and pleasing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "KSgbrTGPG02yPi_bbCgD4g"
  },
  "EX1kKNzBZzBoO5Hnm19rUA": {
    "date": "6/5/2018",
    "text": "The food was delicious and authentic. They cook to order and customer service is phenomenal too. Thank you! My friends were right to suggest your restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "G7dPKVgISqj4d4qWXcaVQQ"
  },
  "J_zd-a_qngHlqA3wdFfy_w": {
    "date": "8/8/2017",
    "text": "I ordered pollo empanizado, a (deep fried chicken breast) with the black beans and rice. And I couldn't resist the (Tamal de carne de credo) polenta wrapped pork and rice(deep fried in a ball) recommended!   Most patrons speaking Spanish...I understand \"most\" all very favorable speech about the food.   There is a limited dining space..but the staff seem very efficient and service is quick.  Many orders are called in and picked up...but the dining area is clean and comfortable.   Tables are clean...not mcD version...but actually cleaned!  They don't skimp on flavor and everything tasted very nice.   I am happily impressed, and I'll be back to try \"the amazing bread\" I've read about.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lrJ4Q3mOpVS-120M66UCpA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Cuban pics are pretty nice",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lrJ4Q3mOpVS-120M66UCpA/o.jpg"
      },
      {
        "img_id": "C4-RgcL1MWGMoXEba837UA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. This is why I came...and man are these potato filled with meat, deep fried treats....fabulous!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/C4-RgcL1MWGMoXEba837UA/o.jpg"
      },
      {
        "img_id": "5vpQNztDzi0HewCqJoiRRw",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Fried chicken breast is very excellent! I also loved the black bean rice...very fresh",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5vpQNztDzi0HewCqJoiRRw/o.jpg"
      }
    ],
    "user_id": "ZdedxYb-QGXVu1KfRIWsfw"
  },
  "SqSxufPKbQB4tlDCF7nu_Q": {
    "date": "1/6/2019",
    "text": "Awesome food and great customer service. Will definitely come back when I'm in the neighborhood.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xPihe881WTUKh8StPcGItw"
  },
  "bC7o17WKw14EeIfRmFh2Zg": {
    "date": "5/10/2018",
    "text": "As a Cuban-Jamaican Living in Arizona for more than 20 years I found out about this place in 2015 .My first Visit was very unpleasant due the terrible Customer Service But the Quality of Food was great . During that First Visit I was able to feel the tense Ambiance due the Clothes that I was wearing ALL WHITE .Due my Religious believe a Yoruba Base Indigenous Religion I realized that The Owners and Workers all Cubans wasn't feeling comfortable because they knew that I was Recently initiated into a Babalorisha Omo SHANGO . After a couple of year at The End of 2017 and through out this Year I being Going with My Wife to eat at least three times per Month and I found that the Quality of the Food still the Same , Cuban Pastries are not holding to The standard of the originality of the Cuban Recipe , The Owner and Chef/Owner only greed The people that apparently they Know most of the Good caracter is with the Caucasians . The last three Times that I been at this Restaurant and I Consume MOROS Y CRISTIANOS I feel like I am Food Poison , This Owners Have a Personal Beef With The Owner of Another Cuban Restaurant which is Also a Practicioner of The Afrocuban Religion and Since I am Wearing the attributes of my Religion they can tell that I am openly a Babalorisha . I like to advise to all those that are Practicing a Yoruba or Afrocuban Religion not to GO AND EAT THERE , THIS CUBANS OWNERS DON'T DESERVE OUR MONEY .THE BATHROOMS ALWAYS HAVE THE DOORS OPEN MOST OF THE TIME IS NOT PAPER TOWELS . AND MORE IMPORTANT THEY HATE THERE OWN RACE .",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yimb74ZoZtIqB7Ci8A1VwA"
  },
  "F1MArMmrH1HLKj8M6ztLpA": {
    "date": "1/26/2019",
    "text": "I love this place! Food is great! Wonderful Cuban sandwich! Atmosphere is comfortable and everyone is helpful and friendly! My best find in AZ so far!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0uB3SXTCMS6Ttlf4pHL13A"
  },
  "enTu0IVo_QNTJY1gmituvg": {
    "date": "6/6/2018",
    "text": "Excellent Cuban pastries love the guava and cheese and the plain guava. Good mil hojas too.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pk4-5ZCH6y-1Jp23Ed6HKw"
  },
  "i7TRn27ECArOmEV2LcW8Sw": {
    "date": "3/29/2018",
    "text": "This is authentic, genuine Cuban food. Take it from a native Cuban who has cooked Cuban foods at home for over 30 years.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MIgYDhd22CdA57c2GTpisQ"
  },
  "Ghta6rrIRXH36JzKcF1kEQ": {
    "date": "2/28/2018",
    "text": "Easily the best Cuban sandwich I have ever had. Great portions and great prices. Definitely will be back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "fJzCzO5iquW1qs9b7f2rgg"
  },
  "0S2-39J04DyXYK5bDSAAMg": {
    "date": "5/24/2016",
    "text": "I've been here several times (mostly when house sitting in the area) and would gladly drive all the way from Uptown here for their consistently awesome food.  A now-defunct downtown eatery turned me on to Cubanos, and I've been hooked ever since. Cuban Foods churns out one heck of a sandwich. And croquetas de jamon. And probably anything that comes out of their kitchen.  While I've yet to try any of their baked goods, all the items in the display case look fantastic.  Now I'm kicking myself for not eating here this past weekend.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "pKn_H1nkgrwJS6TuHODsvQ"
  },
  "MHNdg-FEMd5AqmLx4fNCiQ": {
    "date": "3/20/2018",
    "text": "The food was meh!! The service was horrible! There is one lady doing all the serving and she cant do it all by herself!  The restaurant is going to fail because of this. It took forever to get 2 sandwiches during lunch time. Thank god I was off. Place our order and took over ten minutes just to get something to drink. Then she brought the ice for the drink. A few minutes later then she brings a can. Then five minutes later came the drink for the second person. Just scatterbrained!! The relleno de papa was good the sandwich was dry (cubano). Over all meh! Aside from being excited that there is cuban food in the valley....then you come and get disappointed!! We have to do better to make this successful!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eeSqLuo6kzKCv6pDniBFeg"
  },
  "8tGZ-GOpuAHvB6oAUqJ9xQ": {
    "date": "6/30/2018",
    "text": "Cuban sandwich was lit. Super delicious. I would pass on the fries though. The place itself isn't fancy but the food makes up for it. Would go again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1gwlheu9_PXfQL0Xeg3NoA"
  },
  "pwuVRj-2Ucht8jMWCzxOZA": {
    "date": "5/20/2018",
    "text": "I was recently on a work trip with a group of colleagues who all happen to be Latinos. I looked up local Latin restaurants and was delighted to find a Cuban one. The server was attentive and the food just as good. We ordered tostones, plaintain chips, empanadas and yuca to start. All tasted just like home and couldn't wait for our entrees. Some of us ordered a Cuban sandwich or bistec empanizado, bistec encebollado, y pollo. All the meals came with salad and rice. As Latinos we were truly pleased with having food fit for our culture!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cEZ5kIrksizD1ogli3jbdA"
  },
  "-1IRm27y5mR0y1hRwhS6dw": {
    "date": "8/22/2017",
    "text": "Cuban pork and rice/beans for me. One of the tortas for my husband. Split the papas rellenas and fried plantains. Oh my goodness, best find near or new house. The meat is amazing and tender, SO FLAVORFUL! Didn't get to try any pastries because we were too dang full. That's ok though because we plan to come back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "gHFEj6Z6s2wF8qDhsg5gwA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Cuban pork, my new favorite thing!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gHFEj6Z6s2wF8qDhsg5gwA/o.jpg"
      }
    ],
    "user_id": "vDeGy6jDFMRZDCDI_6gAqA"
  },
  "3Z3_zz51r_zUHR60YXl53g": {
    "date": "12/1/2018",
    "text": "Best cuban food I've had in Phoenix. Small place, family owned. Everything I have tried has been very good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LU-ZipR8LTRw5nSiNTNTRA"
  },
  "SIK1FzJr9DzorzT8DaVxkA": {
    "date": "6/10/2017",
    "text": "The staff here is friendly. They keep it nice a clean. You are served with a smiling face and hot food",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "hyRCRksbBCOSrkejsJcbhg",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Sandwich Cubano and media Noche these sandwiches are well worth it 8 bucks you can&amp;#39;t beat it I love this place I recommend it to everyone",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hyRCRksbBCOSrkejsJcbhg/o.jpg"
      },
      {
        "img_id": "B-tBZNZ7mDcvlFryTsFcpQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/B-tBZNZ7mDcvlFryTsFcpQ/o.jpg"
      },
      {
        "img_id": "SxECz6QglERhhDS99l-Wlg",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SxECz6QglERhhDS99l-Wlg/o.jpg"
      }
    ],
    "user_id": "zZMcmEW7AAIC38NPGvylhw"
  },
  "v1Gw6Jcm-EuGOkcLIh0SDA": {
    "date": "4/28/2018",
    "text": "Great service and food was delicious! Highly recommend this hidden gem! If your in the mood for some authentic Cuban food in AZ this is the only place! So enjoy. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GUEgvHrhsQmIOkySUG_5CQ"
  },
  "27nlTQ5gh66KaooCD-MByg": {
    "date": "6/24/2017",
    "text": "This place is legit! The foods is oh so flavorful without being too salty. Portions aren't  over done...but its filling and satisfying. Being from Puerto Rican heritage...this place brings me back to my moms home cooking with a different flare. Will definitely come back and try other things on the menu. We loved the Yucca frita and Tostones Rellenos de Camaron (root veggie stuffed with garlic shrimp). Their mojo is garlicky and to die for. Wish it was closer to home...but well worth the drive to get a mom and pop fix. Needless to say...we looooved it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "WAOyje-0V8naCQVapbTpbQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Ah...mazing!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WAOyje-0V8naCQVapbTpbQ/o.jpg"
      }
    ],
    "user_id": "hXFFTGYXeTF4HLcKEuHiZA"
  },
  "xu8dBCjMmiOXBgIleA4a4w": {
    "date": "6/14/2017",
    "text": "One of my favorite lunch spots.  The beef or pork specials on the lunch menu are both excellent, the Cuban sandwich is also great.  Good with a side of fried sweet plantains!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Oimq1uKoLrZFnuPHD2XKBA"
  },
  "1vaUfibXagGuodGdPzCYgQ": {
    "date": "4/17/2018",
    "text": "If I had to imagine what traditional Cuban food would taste like this is the place. The owners are super friendly and the food is delicious. First time here since the expansion and the place is looking great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9EzuJ5pP2S28Cr3orVKolQ"
  },
  "Ru1XkL3kqnTU4KVCHB7A0Q": {
    "date": "2/19/2014",
    "text": "Que Rico! Brush up on your spanish, because the real Cuban foodies know where to come! This little hole in the wall Cuban restaurant is seriously as authentic as it gets.  I grew up in Puerto Rico, and  I'm telling you, this food is like no other.  Don't try to compare it to the likes of Havana Cafe in Phoenix . This super casual, obscure 5 or 6 table Cuban Cafe and Bakery, is tucked away in a strip mall.     Please believe me, they serve THE best tostones, croquetas de jamon, pan con bistec, ropa vieja, empanada de carne and crazy delicious flan. I'm sure everything else is tasty too, but I get stuck on my faves. This probably doesn't mean a lot to some, but they serve coca cola in tall glass bottles. This is the way the serve it in Mexico, Puerto Rico and Cuba. It just tastes so much better and it goes great with a cubano (cuban sandwich).   There is usually one girl serving the tables, and working the bakery, the owner and one or two other people in the kitchen...so service isn't what you would expect at a 5 star restaurant, but it is what you would expect at a Cuban neighbors or friends house, and that is exactly what you get.  And if you venture into this cafe a few times, the people working there will remember you and you will automatically feel like family.    Prices are great, portions are good and the food is excellent!  Buen Provecho!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "n8NJmwVIrIE31lBGaNXacQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Bakery counter filled with yummy deserts like flan and cakes.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/n8NJmwVIrIE31lBGaNXacQ/o.jpg"
      },
      {
        "img_id": "OLsyr-oPFccHsCIYYArJ_g",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. One of six tables in this small restaurant.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OLsyr-oPFccHsCIYYArJ_g/o.jpg"
      },
      {
        "img_id": "aK9w_PTFUPtTg6nSUjQniQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Coke in glass bottles made in Mexico...delish!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aK9w_PTFUPtTg6nSUjQniQ/o.jpg"
      }
    ],
    "user_id": "U_ru9s0j4MOvHE5WTl0PrQ"
  },
  "cyjY0ffSL_BGXhhKA2eVSw": {
    "date": "12/16/2016",
    "text": "It's a shame that the Phoenix area is underserved with Cuban food. I believe this place is the only Cuban restaurant in the area and they don't disappoint. Having lived in South Florida with many Cuban options this place is just as good as any of those places.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "K2D2-vHJwinGQL9Zb2mQVQ"
  },
  "q9yhx8CFENVswdI56GUNvw": {
    "date": "4/27/2016",
    "text": "Horrible service unless you are spending a lot of money. If you just order a Cuban coffee and one of their tasty pastries, they not only don't smile or say thank you, but they actively snub you. But if you order a full meal, appetizers and the works, then they smile and treat you like their best friends.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eDqH7Gr6Pqo7adfZwfQetg"
  },
  "t1KNz6WUppp8RQmQuy7Ytw": {
    "date": "5/26/2017",
    "text": "Great service and great place to try Cuban food for the first time.   They get their liquor license in June; can't wait to try their mojitos.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rr86lvvrOGsTsy5V7i2h9A"
  },
  "MlGvWiaytfVA_w28P7Tj3g": {
    "date": "6/13/2017",
    "text": "The white rice was flavorful and the black beans were delicious.  The fried chicken was cooked perfectly.  Felt like I was eating a home cooked meal.  Definitely worth another visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dmxfUsxBwsbnGmSvhryyWw"
  },
  "_ObnkNAahDLcXDPbz2wwXg": {
    "date": "8/13/2017",
    "text": "Great food. Wonderful service. Clean restaurant. Legitimately Cuban food, not infusion. Always make the hour trek for this delicious food. Wow, super tasty. Did the full spectrum appetizers,  lunch, desert with Cuban coffee. Now on my favorite list. Clean facility too. I'm impressed. Real Cuban Food in Phoenix, Arizona, Havana style.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7t1O__HdGFlOZ66bC16Zhw"
  },
  "BQN_tq3k1-2_ladvOy8TFA": {
    "date": "10/23/2015",
    "text": "Great place for authentic Cuban food. I've been coming here for a while and it always gets a little better than before. A good fix if your like me and miss food from home.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "qG1eD8seD5Ot5kZjTMfRMw",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qG1eD8seD5Ot5kZjTMfRMw/o.jpg"
      },
      {
        "img_id": "AvCiZDIjmXlNYVzJKAG9wg",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AvCiZDIjmXlNYVzJKAG9wg/o.jpg"
      },
      {
        "img_id": "P5GVMWoPXp3TcHMFeMJ_wQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/P5GVMWoPXp3TcHMFeMJ_wQ/o.jpg"
      }
    ],
    "user_id": "YlfYMCw8bLmPaJD8m7fcSA"
  },
  "LPjdZls56EcjREMoObFiVA": {
    "date": "12/8/2015",
    "text": "Wow! I have never eaten any Cuban food before today. This place has plenty of options at great prices! The staff and atmosphere is extremely welcoming. I had the Pollo Empanizado. Just the right touch of flavor. Chicken wasn't dry. The black rice had that small hint of lemon. The place is small inside and very welcoming.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3hZIdolPwLcsCufYajiplA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. YUM!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3hZIdolPwLcsCufYajiplA/o.jpg"
      }
    ],
    "user_id": "ZQmC2tfLEc6WtTumBAaCag"
  },
  "QZPw9o_QgUDbgYT2vm0p-A": {
    "date": "10/15/2016",
    "text": "Before stopping in, I read the reviews and was a little concerned about the comments regarding the bread in the Cuban sandwiches being dry.  However, please remember, these are not French dips, this is exactly how they are supposed be.  The outside it toasted lightly and is supposed to be a little dry with the mustard moistening it up inside.  The fried plantains were amazing, the mashed potato fried appetizer things were amazing, the black beans, and rice, sandwiches, all were absolutely authentic.  But the best part, yes, the fat man knows, the best part was the flan over cake desert.  Oh my lord, that was a great way to end the meal.  Overall, I'm from Florida where Cuban restaurants are all over the place and this is as good or better than I have ever had.  Great job.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "vIsEJsMbPGOVsSp04cc6EQ"
  },
  "NUrwqnM3YsNA2Y_e2d291A": {
    "date": "1/17/2018",
    "text": "Wait but how can you call yourself a bakery if you don't sell any baked goods?? Felt like an idiot asking for bread at a \"bakery\". I asked for Cuban rolls and they looked at me like I was crazy. Great job deceiving people. You should change the name of your business..",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CEYzrJIhRxsWRloVmrZqNw"
  },
  "7RDcgnkTrjZQo2-alNomOQ": {
    "date": "2/28/2016",
    "text": "I'm from Florida so I'm used to having Cuban sandwiches everywhere but now that I've moved to Phoenix I've been looking for a good Cuban restaurant that would have what I'm looking for. And I've found it!  I've had their media noche and it was delicious! Can't wait to go back for the oxtails.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6Zpg8-U88UC_jrzI4AWq0w",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Media Noche!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6Zpg8-U88UC_jrzI4AWq0w/o.jpg"
      }
    ],
    "user_id": "EEb3k_FXuvQH6drd9klMRg"
  },
  "n_M-2wUm_X3gH6IvL-sr9Q": {
    "date": "6/5/2015",
    "text": "If you're looking for authentic Cuban food, go here!! It's a ways away from my house, but whenever I'm in the area I make sure to always stop for a Media Noche and coffee. It really doesn't get anymore authentic than this place. Family owned. I've only tried their sandwiches. Maybe one day I'll try their other options.",
    "rating": 5,
    "rated": {
      "funny": 6,
      "useful": 18,
      "cool": 13
    },
    "photos": [],
    "user_id": "h6yYukc_lo1W3Tsd_YsaAA"
  },
  "KqHy9TkrUUo8FO2xUH6ZGA": {
    "date": "5/26/2017",
    "text": "We always come to this place for quality authentic Cuban food. I didn't even know if I would like it but the food is amazing and fresh. The staff is always friendly. They recently renovated which looks awesome unfortunately the prices on the menu went up as well. We will still continue to come here! Love it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-CBDg0WYX4jMaafiuDGpag"
  },
  "FSp0YleRgS-lsPjL0u1PXw": {
    "date": "2/13/2018",
    "text": "If I could give this place TEN stars I absolutely would! My very Cuban father loved this place. Having visited Cuba myself I can assure this place is authentic! The bistec empanezado and papas rellenos are worth every penny. I've never left here unsatisfied and they've done a great job of remodeling the place in recent years. Great staff and amazing food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "smvKU-eQzSaExfWMDVsQUA"
  },
  "wruqEWjIcVw2w4tiid8pxA": {
    "date": "4/16/2016",
    "text": "Wow! Ok, first of all the place is really small with only six tables and one was for two people. I only saw three workers the whole time I was there. I made an order to go. It took a while for my order to come up but everything was warm and fresh. The staff was polite and quickly helping everyone. While I was waiting quite a few of the tables were served and all the food looked wonderful.   I got the Cuban sandwich and all I can say is holy cow it was delicious!!! Half of the sandwich completely filled me up. The fries were ok but I didn't care because I was there for the sandwich. Can't wait to try more of the menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2IuCGkrVvL8Oyol3t2-kuA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. 5/22/16 - Hours of Operation",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2IuCGkrVvL8Oyol3t2-kuA/o.jpg"
      }
    ],
    "user_id": "-880JXvb7Klu-3n17xeEKg"
  },
  "5JMGroHcxOCqgU_JYGIhWA": {
    "date": "6/18/2015",
    "text": "I'm  always  in search of good Cuban  restaurants., found this one on yelp.  We came in for lunch,  the place is small inside but luckily  we found a table.   I ordered  the Cuban sandwich with a side of black beans cooked with the rice.  The first thing I noticed was the bread was the right bread for the sandwich. Not just a friendly roll.  I asked and they bake their own bread.  The sandwich  was excellent  and rivaled any you would buy in Miami.  I also ordered  papas  rellena  which is a ball of mashed potatoes stuffed with ground beef then lights breaded and deep fried.  Great flavor. I ordered a guava  pastry to see how they did.  Also excellent.  I was not disappointed.   Looking through  the menu they had all the typical Cuban dishes and the prices were fair.  Average  dinner plate was $9-$10.  Just a note- my buddy ordered the Mexican style Cuban  torta (can't remember  the name of the sandwich) .  I tasted it and it was epic.  Such great  flavor.  It had pork,  onions,  cheese and other things that gave it a little kick but not too spicey. Look for it on the menu,  you will love it.   Hot tip- seating is minimal,  get there before lunch or dinner rush.  I got there about  11:30 and it wasn't  busy.  By 12:30 people  were waiting for tables.   All in all great food,  the owners were Cuban  and know their stuff!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "GzY83FUiete2yC-1tDQ24g"
  },
  "2tN-iHk8SMGl59RMBPnjqg": {
    "date": "3/12/2016",
    "text": "Absolutely Delicious! Food is 100% authentic. Great service. Small restaurant, personalized service. Great menu with a lot of variety and choices of many Cuban dishes. Enjoyed the music while we drank Malta & Jupinia sodas and ate our meals. So thankful to have found this authentic Cuban restaurant in Phoenix!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JW_SD_YO4kcRx3ReHcaa1A",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JW_SD_YO4kcRx3ReHcaa1A/o.jpg"
      },
      {
        "img_id": "_CdGSxRQ14t8T3UjbFfyTA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_CdGSxRQ14t8T3UjbFfyTA/o.jpg"
      }
    ],
    "user_id": "ZD_CZij77V7t2PK4B9jP2w"
  },
  "zfn9o7-cbf6ik9rrzhDfhg": {
    "date": "5/9/2015",
    "text": "I've been looking for a good Cuban sandwich since I moved from Tampa, FL. I've tried a couple different places and nothing compared. Than I came here today. The service was very quick. My food was hot. And the Cuban Sandwich was very tasty. Just like I remember them from Florida. Reminds me of the little Cuban restaurant right outside of MacDill AFB.  The price was great for the size of the sandwich. $7.95 for sandwich and fries and .99 for a 12oz can of soda and a glass of ice. The sandwich was a good size. Half of it is going home for later.  Definately recommend although not good for large parties. Only 6 tables in the restaurant. Seats 23 people inside.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "va58I_mHEbLt-pPqvj8CoQ"
  },
  "Ea8iJDn9PbrM5ybTrtCV1g": {
    "date": "5/12/2017",
    "text": "CUBAN FOODS'S  came in and got some food taste pretty dry and not good sorry won't be back",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XCscctIz67KheVKAX_VzHA"
  },
  "NC1fyi7IzNsKONWLiUVhFA": {
    "date": "9/4/2015",
    "text": "Food I will give 5 stars. Everything was delicious. We had papas rellenas and tostones which were amazing!!!! Bistec encebollado and ropa vieja were great too. To end our Cuban gastronomy experience, a delicious dessert. They were very well priced and delicious.  Now, our server was attentive, but the placed seemed to be short handed so he was literally running everywhere to serve well. Advise, they need to find at least one more person!!!!  In general we were pretty happy and would come back, now make sure you have enough time to eat and wait for the bill lol!!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "wGdStLGqVsMJmKIdeDss8w"
  },
  "6W4Vgu1m80HJbk97CvGzpA": {
    "date": "10/15/2017",
    "text": "Went in for lunch not long after they opened yesterday and the place was pretty much deserted. We were seated immediately and given menus. There is a lot on the menu that looks good and pretty much everything in the small bakery case at the front looks amazing. Ordered the ham croquettes and a cuban sandwich. The croquettes were pretty meh. It tasted like a deep fried wad of dough with little else going for it. The sandwich was really good and enormous. I ended up eating half and tapping out. The fries were a little too fried for me to the point they were almost like potato chips. Also, whatever tap they're getting their water from needs a filter or something. I sipped my water sparingly because the taste is just bad. Ended up tasting a bit of the chocolate eclair and it was as good as it looked. Going through their dessert case would probably be a blast until your pancreas gave out.   Definitely would go back for the sandwich and baked goods.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "yGXKMV1omio1I_3qNLdtAA"
  },
  "PoITnoOYz9TUKX7XJMSXXQ": {
    "date": "4/28/2018",
    "text": "Tried this place for the first time. I ordered the Cubano Sandwich and it was hands down the best Cuban sandwich I've ever had. The portion was huge making this an easily shareable sandwich. The bread they used was crispy and flaky and oh so yummy!! The pork was flavorful and tender. The fact that this was a shareable sandwich was good because that left room for dessert, and their flaky pastries or fluffy cakes would make it a sin to leave without having some. I had a flaky pastry reminiscent of an enormous cream puff with delicious vanilla pudding in it and strawberry sauce and powdered sugar drizzled on top. I will definitely be back!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "MaTnV67WDp7xs-cU_qOcmw",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Cubano Sandwich",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MaTnV67WDp7xs-cU_qOcmw/o.jpg"
      }
    ],
    "user_id": "f4S5ssUjzCuHuCwlu6fL8g"
  },
  "vuHoQ_OXULNuqeRAeSbpjw": {
    "date": "6/6/2018",
    "text": "This is the best Cuban sandwich I have found in town yet . I do wish there was a bit more pork but other then that the bread is perfect . just the right amount of cheese and mustard. Their apps are also amazing. And very decent prices . if this place was a little closer to me I'd be here prob every week",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tew63bFET6JuCtQGmu6UWQ"
  },
  "4gVv31NZ2Df7UA2RiUTUiQ": {
    "date": "6/23/2018",
    "text": "Quaint little hole in the wall restaurant. Food is on point. The Cubano is well seasoned. The pork moist and the sandwich overall is well flavored. Sometimes Cubanos have wayyyy too much mustard so that it glops out. THIS one was perfect. Enough for the flavor without being overpowering. The empanada de carne was lightly fried and not even close to greasy. The meat filling was delicious and the seasoning was great. Definitely want to come back to try other dishes!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MDCNqTfOmpY2sdqcJHYqag",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Empanada de carne",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MDCNqTfOmpY2sdqcJHYqag/o.jpg"
      },
      {
        "img_id": "5hmpp2F5M1BZN3Py3csR-w",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Cubano sandwhich",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5hmpp2F5M1BZN3Py3csR-w/o.jpg"
      },
      {
        "img_id": "YOL8exZx-Iu0-Yg9qEuf2Q",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Decor in the restaurant",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YOL8exZx-Iu0-Yg9qEuf2Q/o.jpg"
      }
    ],
    "user_id": "xDWjJP86iQIOOfatz-tqGg"
  },
  "_IJIB7uD0lLh-F7paRun4w": {
    "date": "2/5/2019",
    "text": "Wonderful food! Incredible deserts!! My 3 sons(under 12) all LOVED their food & begged to go back the next day. Headed back soon.  We ordered the Cuban Sandwich, the Mexican Cuban sandwich, Tostones rellenos con camarones (Plantain cups with shrimp) and Bistec Uruguayo (think Pork Cordon Bleu).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pRvswHzUP3WiVZth9LozUg"
  },
  "qagabZTiqrhVXZCzUhhqlQ": {
    "date": "6/24/2016",
    "text": "Was very excited for some Cuban food. I loved the service. They are very nice there. No bathroom though. So... Hold it in.  I got a Cuban sandwich. Was so excited! But I agree with some others reviews. The bread was so dry. If was like saltines... I almost felt like it was a day old bread.   Overall ok. But I need to go back to try something else and see if it was just the Cuban sandwich. Obviously, it's a great place to get 4.5 stars. Stay tuned....",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 9,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "08HUgepL8Mv25m4c3nkpXA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Cuban",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/08HUgepL8Mv25m4c3nkpXA/o.jpg"
      },
      {
        "img_id": "HCWmjrrKGXL0MamcNMqzsQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Cuban",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HCWmjrrKGXL0MamcNMqzsQ/o.jpg"
      }
    ],
    "user_id": "zTCwJg0hPY_cb3vWY0XMbg"
  },
  "5hr7Wj2KhxD3RfULqQv5CA": {
    "date": "6/6/2016",
    "text": "Maybe I need to give it another try  I needed to grab a quick bite to eat with a few work associates, so we decided to stop in at Cuban Foods and Bakery.  I was looking forward to trying this restraunt after reading so many positive reviews.  So let's start off on a positive note.  The service at Cuban Foods is great.  The staff are friendly and accomdating. I wish the food was better. We all ordered the Cuban sandwiches, as this was our first visit, and we had limited time. However, I wish I would have had the opportunity to branch out and try a few additional menu items.    The sandwich was okay, a little on the dry side, however, it  is large enough for two to share. Each person took half away so we could have ordered other items and shared easily. Maybe I should have ordered something different. The sandwich wasn't bad but it just wasn't very good.  I look forward revisiting Cuban Foods and Bakery again and try other menu items, such as rope vieja or papa rellena.",
    "rating": 2,
    "rated": {
      "funny": 7,
      "useful": 13,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "C7fHNgEOf3A3Nntrn1D29w",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/C7fHNgEOf3A3Nntrn1D29w/o.jpg"
      }
    ],
    "user_id": "MMf0LhEk5tGa1LvN7zcDnA"
  },
  "MYFRTe6HEUrbizq3TaVJQA": {
    "date": "10/30/2018",
    "text": "This diamond I found randomly. Great friendly staff and service. Me and my friend had a bunch of questions.  We both ordered the Cubano. Gargantuan in size but delicious as could be. Pork was incredible.  Had a Cuban soda to wash it down. Nothing negative to say. I'll definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "mr8keYo9LRqRds41EXfZdQ"
  },
  "-Naxxvgm4ms_gc6HGyBt8g": {
    "date": "2/14/2018",
    "text": "Wow.  We have been coming here for a while now, and they never fail to impress!  If you have not been here it is worthy of your Time.  The Cubano sandwich is the best!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Gq1Dc-eyXTh77l_NYhJxxA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Gq1Dc-eyXTh77l_NYhJxxA/o.jpg"
      },
      {
        "img_id": "U0FhTCfPhlVDxoOxEBfnfw",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/U0FhTCfPhlVDxoOxEBfnfw/o.jpg"
      }
    ],
    "user_id": "xZAmw5gihOVO4duMN2Ju6Q"
  },
  "O1SNHMwVbpS05VUOo2KCoQ": {
    "date": "9/15/2018",
    "text": "First time having a Cuban sandwich and it was amazing!!  Simply delicious and it made me want to order another.  Fries are pretty good,  but the ketchup packets are weird,  but the sandwich is why you're there.  Their other plates look amazing too and we'll be back a fourth time to trying something else,  if we can break away from the sandwich.  Weak!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U3UWGtIWYfo4jXj6qLUqTQ"
  },
  "BDIypZIpEfiSw1ZFnxt_Ew": {
    "date": "4/21/2018",
    "text": "Eating Cuban all my life and going here taste really close to homemade , hard to find a Cuban restaurant in AZ and this place is really good .. Definitely have to try this place",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iURq6YK-Cn_eB0tSf5xcfw",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iURq6YK-Cn_eB0tSf5xcfw/o.jpg"
      },
      {
        "img_id": "G5QS4E-gsNdFp8Ta2eomfA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/G5QS4E-gsNdFp8Ta2eomfA/o.jpg"
      },
      {
        "img_id": "Q9CGPMTnTO_NfF-rHCsVTw",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Q9CGPMTnTO_NfF-rHCsVTw/o.jpg"
      }
    ],
    "user_id": "CeVb4ApEJD8dvTokgvr6cA"
  },
  "UdD5N1tqXsBo02TzpkTyPg": {
    "date": "9/23/2018",
    "text": "We have been on the lookout for a Cuban restaurant as our beloved CA Cuban jem Porto's is no longer an option unless we want to drive 6 hours for some croquettes. This place was perfect, and the next best thing. We went Saturday for lunch and were promptly greeted and seated ourselves. They arrived to our table promptly with menus and we received our appetizers in a short time. They timed everything perfectly as we just finished our empanadas and our main dishes arrived.....so DELICIOUS!!! The Cuban sandwich was a generous portion and the tops vieja was more than enough. We both had to take half home because we got too full from the appetizers, so worth it though. The flavors of everything we ate were perfect! We will definitely be going back soon when in the area. It's a mini mission to go there as we live I  Surprise, but I'm sure we'll be back soon!! Thank you for the great service and amazing food!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TJt6TvDxpFXIYvqiHOO5Ow",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Cuban Sandwich",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TJt6TvDxpFXIYvqiHOO5Ow/o.jpg"
      },
      {
        "img_id": "5xYn8G10mYXTEB5RrCf4lA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Ropa vieja",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5xYn8G10mYXTEB5RrCf4lA/o.jpg"
      },
      {
        "img_id": "RK0i5C2bdpwucHhpWvuY5g",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Croquetas de jamon",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RK0i5C2bdpwucHhpWvuY5g/o.jpg"
      }
    ],
    "user_id": "95_XZrgnojEzUeXebadTyA"
  },
  "RcRICUFyMFbDx_d-LzAEaw": {
    "date": "10/30/2018",
    "text": "There aren't many Cuban restaurants in Phoenix so this is always a nice treat for some Cuban food. Staff is very friendly but it can take a bit...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wjZK5uAHY4pGdN6JK8U6OA"
  },
  "rfHh4fpESv1wVwrn5SrYcQ": {
    "date": "8/29/2018",
    "text": "Before stopping in, I read the reviews and was a little concerned about the comments regarding the bread in the Cuban sandwiches being dry.  However, please remember, these are not French dips, this is exactly how they are supposed be.  The outside it toasted lightly and is supposed to be a little dry with the mustard moistening it up inside.  The fried plantains were amazing, the mashed potato fried appetizer things were amazing, the black beans, and rice, sandwiches, all were absolutely authentic.  But the best part, yes, the fat man knows, the best part was the flan over cake desert.  Oh my lord, that was a great way to end the meal.  Overall, I'm from Florida where Cuban restaurants are all over the place and this is as good or better than I have ever had.  Great job.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Raxyghpfm6929KRdPgOYmA"
  },
  "OB61n_MtcjFFVxJl2tj4IQ": {
    "date": "2/25/2017",
    "text": "Super small restaurant tucked into a shopping plaza - but trust me you'll want to pop in to this gem.  The seating area is super small (and there are no restrooms for public use). The tables are set with baskets of napkins and straws, hot sauce and s/p. The service is friendly and fast. This place was packed during our visit but they made sure to check in and attend to everyone.   We ordered the cubano sandwich, bisteak dinner with rice, and empanadas and cheese rolls for appetizers. Holy cow! Everything was super hot, tasty, and came in big portions! Definitely bring your appetites! We like to try new places and we're so happy we found this one! We'll be back again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "yuoT8cPW5ddDU_LdHVyf5Q",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Cheese rolls",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yuoT8cPW5ddDU_LdHVyf5Q/o.jpg"
      },
      {
        "img_id": "7PmRfMbYZmR1AoFoN8pyeg",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Bisteak dinner with rice",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7PmRfMbYZmR1AoFoN8pyeg/o.jpg"
      },
      {
        "img_id": "usowkQTTCL6InssBQAxobg",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Cubano with fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/usowkQTTCL6InssBQAxobg/o.jpg"
      }
    ],
    "user_id": "XaeLIqtoOqzEo4KH56Z2KQ"
  },
  "sp7LVhGpxgh9JMss-0DufA": {
    "date": "10/13/2018",
    "text": "I am from the NYC area where Cuban food is excellent everywhere in the NYC/NJ area. My husband and I ate at this restaurant for the first time a few days ago and the food was the absolute worst I've had. The customer service there was awful, their steak was dry and burnt, their Cuban rice and beans were obviously not fresh and their Cuban Potato was mediocre. My husband had to send his steak back and they argued that the steak is supposed to be like this. After everything was said and done we paid $50 for crappy good. Never again will we eat there.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "60_upR6pyf_EtW_LHs9Xvw"
  },
  "yG1yWvaSTASxXsXvLlFlnQ": {
    "date": "6/11/2018",
    "text": "I went to this restaurant with a group of 20 plus that I was hosting.  Lester and Yoetni, did such an excellent job in serving us as well as taking care of all other customers.  There was more than 20 checks between our group.  The food was outstanding and provided such a great taste of Cuban culture.  The two gents attitude was amazing and I would very much go here again!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "q6W2mO7PC961njwj4prZpQ"
  },
  "xEaCccRUw_RZ9SD7ujR5nw": {
    "date": "9/7/2018",
    "text": "This was such a find! Brought my parents that recently moved here from Puerto Rico after hurricane Maria. You should have seen the the smiles on their faces as they listened to salsa music and enjoyed the beautiful pictures of the Caribbean. And the food! Excellent. Ropa Vieja was insane.  The rice, beans and flan were excellent. And the server was so sweet. Be patient if you're hungry but it's worth the wait. Can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RQYVXRKoh9G-U21tCyDhMw"
  },
  "UryuuR_QLD72vIPE-N586w": {
    "date": "12/17/2017",
    "text": "Came in on a Saturday around 5:30pm, and ordered a media noche and the papa rellenas to-go. Restaurant was empty except for one table. What put us off was that we waited almost 45 minutes for our food. 45 minutes for a sandwich!?   Food: the sandwich was good, could have used more pickles to balance it out. The potato balls were amazing! Service: Despite not being busy, we sat there and waited for 30 minutes before we had to go up to the counter to ask about our food. After saying she would check on the food, no one followed up with us. We sat there for another 10 minutes before a waiter told us we would have to wait another 7-8 minutes. We would have understood if they had forgot -- we get and respect that things happen. But when we asked if there was a problem, all he said was \"nope.\" If you make a mistake, at least be honest.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eYo5MeD9ThipJn1JjW-y2A"
  },
  "NhUiBU_xF82bNR_JuyEgrA": {
    "date": "2/17/2019",
    "text": "Had a medianoche sandwich, yucca, and a flan topped cake and they were excellent. The front house were nice but it was disorganized and chaotic even though it was not busy or crowded.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "thYL8jFZYB5uuEDQNtKxIQ"
  },
  "-4H81behc2p0qTemaq9Lhg": {
    "date": "10/2/2015",
    "text": "If you want happy hour be sure to ask for seating either at the bar or at the high tops.  The decor is pleasing. Presentations of the food are great.  Fried plantains are awesome.  Out of what we had I would recommend a sampler to try and find what you like the most.  I like a little bit of everything first time to target what I like most when trying a new cuisine.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X_TG3NHERaRn-5K0IPg-0w"
  },
  "Kn_dYiAYy61PIgPs_wO5xw": {
    "date": "5/22/2015",
    "text": "This place is awesome! When the food overflows the plate, it is authentic. I ordered the Cuban sandwich which was excellent and we took home 2 bags of crackers and flan home!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JHa6QhwsnQ3tBfoHwz9pJg"
  },
  "Ik6rXPcdHXLyHnJYIMqbLA": {
    "date": "8/9/2014",
    "text": "I cannot explain the pastry here.  The guava pastry is insane.   That with a side of black beans, and varied plantains, I'm in love.  I'm a vegetarian, so there were not many options for me.  I would have loves a veggie type version of the empenadas , but the food was great anyway!  I plan on returning in the morning to see the full selections.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "HnrPqub-xKZIgIN6EJHHBg"
  },
  "3T-0wSE07yTDioI5dUHx5g": {
    "date": "5/8/2015",
    "text": "The sandwiches here are AMAZING.  I've had Cuban sandwich before, but these guys step it up. The prices are pretty low for w what you get, and the quality is great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vailGHtkJcb6O0lETZ8LhQ"
  },
  "5cL0Incm7aWBJWEXRFbRDA": {
    "date": "1/7/2015",
    "text": "Skip the crappy fast food chains and come here to get the Cuban sandwich with fries. It's amazing and worth way more than the 8 bucks it costs. The hubby and I order it with extra pickles because, why not? It's big enough to share but we still order two and have leftovers. Someday I may try something else on the menu but it will be hard to pass up the the Cuban.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "FfIqKf_AvGKaiYShNZBD_Q"
  },
  "t3TMJOpcDEV96C3llTLelw": {
    "date": "12/2/2014",
    "text": "Oh my belly....I'm never going to stop eating pork. Never! The lechon asado (roast pork) is amazing! I even ate the onions and so did my sister! Don't forget the black beans. I couldn't stop eating!! I really need to forget about this restaurant before I become plus size ( not that there's anything wrong with that but my knees will hate me). Back to the pork: you are served more than four ounces but I'm sure you won't mind once your taste buds are introduced to the great flavor. What's that delectable seasoning on it Mr. Chef??? Next time sis and I will sneak into the kitchen to watch the process moo ha ha! Oh yeah-- the guava con leche drink-- get it! I'm glad I don't have to return to Tampa for good Cuban food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wjI1nW7JddrOjyhzrOT8jQ"
  },
  "uoRTueUKOMlL2cXlVgal0A": {
    "date": "2/7/2015",
    "text": "The only real Cuban food I've found outside of my return visits to South Florida. The food is made with love & excellence. Ignore the esthetics and enjoy the food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "COAarFRXKGOuGsCCJl9alw"
  },
  "uUUqpA2YNghnahIFV9nKRw": {
    "date": "1/8/2015",
    "text": "I am no connoisseur of Cuban food, and my only exposure was to a Cubano sandwich at the Miami airport which was pretty sad. After watching the 2013 movie Chef, I had to try it. Now my family and I are fans. It's really reasonable for the price and portion size. It's not a fancy place, it's another family run outfit. Support local business! Can't wait to try more items.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "K6CBIg431-K9WmE8Y_bUbg"
  },
  "NDzbt9UM7ous-v9bJNIthQ": {
    "date": "8/13/2016",
    "text": "real authentic flavorful cuban food. only downside is the crAmped seating area not ideal for dining in because you cant help but to hear everyones conversation.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n1E6MMYzkuXCrf4duRvAyQ"
  },
  "xQKephO2Ln-YcLKIxFfjOg": {
    "date": "7/1/2015",
    "text": "I'm from south Florida . Just moved to Phoenix an found this place! Breakfast was so good!!! Cafe con leche was good too. Guava pastries were soooo good. An we took togo empanadas, flan an more pastries.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L7_--rTgbg9KGzjJ1F-uUQ"
  },
  "_sWIsmKu8G2TrJv6Ey8e3Q": {
    "date": "10/3/2016",
    "text": "Excellent Cuban sandwich. No bathroom so take care of that before you go. Small room so if you go when it is busy you may not get a table but the food is worth the chance. I had the Cuban my girl had the pan con biset. Both were outstanding. If they had a better room and bathrooms this would be a 5 star.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gsEHIr7scVyTLSzhGj_QUg"
  },
  "Qepikc2IWLqtHWDwedRi6A": {
    "date": "9/11/2014",
    "text": "Really fantastic food, and so so cheap. It's very small, and the ambiance isn't much to talk about, however the foods and service make up for it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "Ybx43yXnYP7NatlC2P5glA"
  },
  "jbBimeGUyBopzXsYvQzD1w": {
    "date": "8/9/2015",
    "text": "Abdolutely great food!! Just driving through phoenix and was craving some cuban food. To my surprise i found a place. Very small shop, but excellent food! If any one out there wants to try or is in the mood for some cuban food, dont hesitate to give them a try!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nRZTPniseiCKtbzZT_CzaQ"
  },
  "AYw4DtfuqnF4cqjHjpq4SA": {
    "date": "9/14/2014",
    "text": "I was weary about ordering the pork based on some other reviews. But it was juicy and tender. The seasoned onions were a great addition. Do not pass up the opportunity to try the rice with black beans.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "wC_PXB07nrdQKUtMicNUsg"
  },
  "hR1aDv0Jkg59S0wp-uoldQ": {
    "date": "10/25/2013",
    "text": "The place is not called \"Bisteces\" any longer. It is \"Cuban Foods and Bakery\". Food and service was excellent. Plan to come back soon.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "W1UaYtDJIQzHiDFtB9dIWA"
  },
  "UoZBEgO4uOzgaxbdriVMXQ": {
    "date": "10/27/2013",
    "text": "It would be easy to miss this place as it's tucked away in an unassuming location, but the food and service are more than enough to leave their mark and leave you wanting more. Every time I come I have a great experience and the fare is very kind to the wallet. I love coming here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "ki2iYh6V-ugFJA6Ijep89w"
  },
  "AC3u6yEbT4AbKtRIfpjFBg": {
    "date": "6/1/2016",
    "text": "Great food. The guava pastelitos are the absolute best I've ever had and I've had my share of pastelitos",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P5FMi3FJXy5ciGDigEcfmw"
  },
  "ckv0wJlvle44zfoqtA9JHQ": {
    "date": "1/7/2016",
    "text": "I loved it. I'm cuban and very picky. My husband surprised me and brought me here.  I really was hoping to like the food but I was doubting I would. But to my surprise it was wonderful felt like I was in Miami. We had Lechon Asado with white rice and black delicious beans so good.  Also a media noche sandwich which was also very good and papa rellenas. Left stuffed and with left overs. Thank you Cuban Foods for taking me home with your cooking. See you guys real soon",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "agcEC2gYGCeTJIRehbMhOg"
  },
  "Hy7BU6edEfngJ7rOJlaXeQ": {
    "date": "3/19/2016",
    "text": "The tostones were the only item close to being authentic and tasty in this poor example of a Cuban restaurant. Then they were ruined by a less than average mojo (garlic sauce)   Bistec was all breading and lousy steak. Pastelles were decent but lacked proper amount of filling. Croquettas were inedible , made with something than tasted nothing like ham . Papa rellenas were decent but once again, the filling was on a vacation somewhere. I came in very excited and I left very disappointed. Save your money and time and go to Versailles in Miami   They get it right",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K6AVpEgLTFrf0129eEyAmQ"
  },
  "RUtJOlZoAFekjYlL9LUA5g": {
    "date": "12/16/2014",
    "text": "This Cuban was very disappointed! Lots of negatives, no table settings,no water provided, took 15 min for maltas to be brought and we had to ask for them,the server very young and clueless, the Cuban sandwich a big disappointment,bread hard and flat,drye. No Cuban music playing or coming from the kitchen??? The empanadas dry and chewy.......NVER AGAIN . Do not recommend. Fly to Miami,go to Versailles or Cali to PORTOS",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rNkfYMWW6JII40qt3WDczA"
  },
  "JW177TZJzEm2x8-pvQXAhQ": {
    "date": "10/15/2015",
    "text": "Loved the food! Took our kids in and we feasted on some sandwiches, fried mashed potatoes (with meat filling) and took home some amazing desert. The decor is nothing special but the food makes up for it.  We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xylHgwHAf_T3Gy7YZ65eBw"
  },
  "c0lNqI59poGmFJbiuRsjHw": {
    "date": "4/10/2013",
    "text": "This is a fantastic restaurant located in the strip mall on the Northeast corner of 43rd Ave & Peoria.  The sign out front still reads \"Bisteces\" but there is also a sign featuring Cuba.  If you see either, you're in the right place.  I popped in around 11am and had my pick of any table in the house.  Be warned it is very small.  Drop in around dinner time and you may have to wait.  If so, it will be worth it.  The menu had a lot of options from sandwiches to meals.  After reading over the entire menu I opted for the Cuban sandwich.  I've heard many great things about the Cuban sandwich but had never had the luxury of eating one.  Elected for a side of seasoned rice & black beans as well.  The sandwich has huge.  The grilled bread was stuffed with ham, shredded pork, mustard and pickle.  While stuffed on sandwich and rice I managed to save a little room for a guava tart.  They had a few desert options in the case and this one looked the most enticing to me.  It was a worthy selection and completed the meal perfectly.   Cuban Foods also offers a variety of Cuban soft drinks as well as American restaurant standards.  I walked away with a can of sugared water called Ironbeer.  It had a unique flavor that I cannot describe but the can boasts it includes \"island spice\".  It was not something I would drink on a regular basis but worth checking out for something new.    Cuban Foods Bakery & Restaurant is a great dining option.  It's even worth the drive if a bit of a long haul.  Definitely give this place a shot.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "I8K8inWlqoQ3af_CAER56w"
  },
  "htQQX-zkrj-N--qnnpOOYg": {
    "date": "3/10/2016",
    "text": "I love this place pollo a la plancha delicious ! I think I'll stop by tomorrow again ! Me and my bro love this place The best lemonade I've ever had",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wWfUZ3kJ6ZElj9MbBs6hxw"
  },
  "8NDLxP5Veh4dcSVUYYbnKA": {
    "date": "12/17/2015",
    "text": "Excellent service, good tasting food! Can't go wrong with anything on the menu!  I love how the cashier/ waitress is so welcoming :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FIbOLYje5wUdPCZX1QXQwQ"
  },
  "_AWVu6alHIVqRTmfjHdu7Q": {
    "date": "11/11/2016",
    "text": "I am Cuban and love eating here! All of the food is really delicious and great as take-out. I have never eaten at the restaurant because I am not a fan of the area it is located in. My suggestion if you are getting take-out is to call ahead and order so you don't have to wait.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "olCLopp3qJITWZlmS-ezIQ"
  },
  "L_VAFLrJGPfy5rnV4GJVVw": {
    "date": "2/3/2016",
    "text": "Mmmmmmmm their food is SOOO GOOODDDDD!! We ordered pork tamale, beef croquette, and grilled fish with rice and beans.. Very flavorful and great price and great portion..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EYGHqQ3qcAbrLT_0Q86kOg",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Grilled fish with rice and beans",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EYGHqQ3qcAbrLT_0Q86kOg/o.jpg"
      },
      {
        "img_id": "w4RdntbFZzkK2eL1tJntZQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Beef croquette",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/w4RdntbFZzkK2eL1tJntZQ/o.jpg"
      },
      {
        "img_id": "tAKC38-TbGJqGi-VgpoO9A",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Pork tamale",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tAKC38-TbGJqGi-VgpoO9A/o.jpg"
      }
    ],
    "user_id": "hqIb0pxO5wxxCReQMDNJqQ"
  },
  "3j2p9gA-k-iMsoIUzmfwtA": {
    "date": "12/31/2016",
    "text": "After watching the movie Chef, we were in search of a Cuban sandwich. We ended up here. The Cuban sandwich was pretty authentic as the owners are from Cuba. Pork dishes were really good. Melanie, the server, was delightful! She explained the dishes to us and seemed genuinely excited that we were trying their restaurant for the first time. They make all their breads and desserts in house. We had the flan and a cream-filled pastry with a berry sauce and a cream-filled cannoli-like pastry. All were delicious! Fun restaurant experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hSnazNWlXdmpf0f6LrnooA"
  },
  "KSLbAzGm1xt0wc4ppgtJOg": {
    "date": "9/7/2013",
    "text": "I have been looking for a Cuban Sandwich for a long time. I Googled Cuban Restaurants  I came across this place. I decided to try it. Pulled in the parking lot and thought it was another hole in the wall Mexican joint. Walked in and it is very very small inside. Nicely decorated. The ladies behind the counter and her cook are very nice and polite not to mention very good looking. I finally got to have my Cuban Sandwich. It was fantastic and big. I was only able to eat half of it.   I will definitely be going back there again not cuz of the ladies but cuz of their food. I I would like to explore more into Cuban Food and this is where I will be doing my exploring until I find another Cuban Bakery.  Do stop in and give it a try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZeVsS2IGa_GDe4SBfL7QIg"
  },
  "agpkpfYvnBMOpwCA--ce7Q": {
    "date": "3/6/2015",
    "text": "Omg! 37 minute drive was sooo worth it. As I've complained before, I'm a \"starving for good food ny transplant\" and this is crazy awesome the \"real deal Cuban food\". I ordered one of everything I miss from Leo's mom's cooking and took it home (7 dishes for $81...pretty good). Everything was cooked to order and if your not sure what to order, ask for a recommendation...they are happy to help. I never give 5 stars but I'm about the food and the service-this experience reminded me of eating at your best friend's house- small, intimate, friendly and food you don't get unless mom is in the kitchen. Viva la Cuba.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "cEwgzWHDJDwz-Leggdnxsg"
  },
  "4U3qx8EKZYOYWxJEIV8WWA": {
    "date": "9/28/2015",
    "text": "Super yummy, authentic Cuban food. I got the yucca con mojo and the ropa vieja -- neither disappointed. Also tried a few desserts and those were pretty amazing as well!! In a town where Mexican food reigns king, this place is nice, family-run, and authentic Cuban food! Eat here!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "aoMCtjQglIGz7V3a2m74tA"
  },
  "iI6yA-RRHbemmqcypD4ZTg": {
    "date": "8/7/2015",
    "text": "Friendly, very tasty, Cuban food.  We will definitely be back to try the other dishes.  On this trip we had the \"Ropa Vieja\" and the \"Bistec Uruguayo\". We were not disappointed at all.  No frills location at a strip mall.  With how the food tasted, they will surely need to expand soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "eCmbD3resdgDWSwCfGuxEg"
  },
  "W_IR9oNZSVOeYmBTOJ-vJA": {
    "date": "1/29/2015",
    "text": "My wife and I went here last week. When we pulled up we were kind of tentative given where it's at and how SMALL it is. My wife is a trained chef and we have eaten/lived from the California Wine country to Atlanta GA eating at some of the smallest backwoods hidden places to the biggest best restaurants.  This is one of those prized gems hidden in the weeds!  Looks can be deceiving and in this case that is most certainly True. I ordered the Cuban sandwich and an appetizer of plantain cups with shredded beef in them and my wife had a beef platter. Can't say enough good things about the service,food and pricing. I got the lunch sandwich which is supposed to be smaller but still took half home. I'd hate to see the regular portion!  We will certainly return to try the other dishes soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "51N1Nj5oySy-jhGRb9kLqA"
  },
  "Cu9AtlCAPek0PcGhFmbSTg": {
    "date": "8/29/2015",
    "text": "Cuban Sandwich was great! Just like I've had in Miami. We also ordered flan which was good and some pastries which were fresh and yummy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e7mHdu-UN47BeSJ2PZ1Vjw"
  },
  "inQyg7SNe5uWv9VBIqhRbw": {
    "date": "7/2/2015",
    "text": "So good! I wish we lived closer.  Roast pork with onions, plantains, and black beans and rice.  All were amazing. Huge cuban sandwiches too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "d7vgREDAR_o9OReZBSlO4Q"
  },
  "O1CWC48pfMM7B9XgHKj7YQ": {
    "date": "11/8/2015",
    "text": "Lechon with onions was very good.  Platter came with black beans and rice and a salad. We ordered the beef empanadas to go with the food. We tried the flan as well and we were surprised as to how good it tasted, after all it is a bakery as well. Very friendly atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9MvBt05NmuRrRwVUq6mMyA"
  },
  "WJnNmi2LGRp7Q-_fv20AUg": {
    "date": "3/14/2015",
    "text": "Lil Cuba in Arizona! Traditional Cuban Food! They would have gotten 5 stars but the service was just ok... the black beans and rice had green peppers red peppers and meat chunks and it was delicious. All with a side of plantanos mudro & plantain chips. The Cuban sandwich was huge, we ate the whole thing! AND Cuban Pastries were excellent!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tPAUDKpHpyKclylIC5u4Mg"
  },
  "bH7qMFBUrVQ7NCxqHiRr5A": {
    "date": "1/24/2016",
    "text": "Hole in the wall but Food was delicious. We had the cuban sandwiches and bought some cakes on our way out. Can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lsqo1F9GpL5Ojn7YoYwMkA"
  },
  "oGepzxdygNOT1kJey7mTWA": {
    "date": "12/3/2015",
    "text": "I had watched a movie about a chef that was making Cuban Sandwiches and from that point on I craved one! I went on to the always trustworthy yelp to find a local place that had them which is how I came this restaurant.   Man-oh-man was that a good sandwich! My cousin ordered something else (I don't remember what it was) and she was really happy with it too.   The restaurant is small and isn't the most lavish, but I would much rather have good food than the show of it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nnnrDxsUUOSp2qjjLy2CFA"
  },
  "vYovwC20oibR54PCMVHiRQ": {
    "date": "3/28/2015",
    "text": "Please, for the love of all that is good, do NOT let the strip mall and decor fool you. This place...is literally the 'S' word!! The Cuban sandwich is to die for, and the bistec has a lemony goodness and an authentic WOW that gets me! I almost regret my last year of living, because I've been right down the street and this is my first time here!! Delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "07hfVAMy-YszHEMos_VVWA"
  },
  "_ahKsqAttSObeWO-2SpYiA": {
    "date": "8/15/2015",
    "text": "We have the papas rellenas they were amaze balls! Also had the torta Cubana it was really good & really large portion but a bit dry came with black beans & rice combo which was the best! Had the cake flan dessert, it's was wet sponge cake topped with flan best I've ever had!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C8P0rHMVv0dL7ZQNBFR21A"
  },
  "zok-LGI9Ukx_2s6094amFg": {
    "date": "2/24/2019",
    "text": "Real Cuban restaurant in Phoenix. Authentic Cuban food, and bakery. Get the Stuffed beef balls, Cuban steak, fish, media niche, and the other food entrees, and desserts are all amazing",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gGrn2w4Gg2dpNXBgwlHO8Q",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gGrn2w4Gg2dpNXBgwlHO8Q/o.jpg"
      }
    ],
    "user_id": "v7FPnMzdbl6J7U_8H1BWZA"
  },
  "WXgy69mToeImK9oFWf19Eg": {
    "date": "10/2/2018",
    "text": "When I lived in northwest Phoenix this restaurant was a favorite of mine. I wasn't able to patronize it much when I moved farther away but after a long hiatus I was able to try it again with my friend and fellow yelper John M. I was glad to see that they have expanded the restaurant, so the seating issue from past years has been resolved. We ordered croquetas de jamon which turned out to be a good choice for starters - a crisp exterior covers a tender and tasty mashed potato and ham interior. For my entree, I ordered my old favorite, ropa vieja. The braised shredded beef came with the requisite Cuban rice and a side salad; tasty and very satisfying, although compared to how it used to taste when I frequently ordered this a few years ago, it seems they have toned down the seasoning of the beef a tad. For dessert I had the tocinillo se cielo (literally, heaven's little pig or heaven's bacon), a heavenly concoction of flan layered on top of cake. Prices were good and service was friendly, and fast - I'm glad for that, because during the times I dined here in the past it took quite a while to be served and for the food to arrive; I'm glad all that has changed now.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "FMKd23_ThvjGe_FRZecNZw",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Tocinillo de cielo (literally, &amp;#34;Heaven&amp;#39;s little pig&amp;#34; or &amp;#34;Heaven&amp;#39;s bacon&amp;#34;)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FMKd23_ThvjGe_FRZecNZw/o.jpg"
      },
      {
        "img_id": "0wSg6Xp_brkTaxG8u8hQ7g",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Ropa Vieja",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0wSg6Xp_brkTaxG8u8hQ7g/o.jpg"
      },
      {
        "img_id": "FaJkV1wjbgtp0HoIiVZ8lA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Croquetas de jamon",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FaJkV1wjbgtp0HoIiVZ8lA/o.jpg"
      }
    ],
    "user_id": "24AzZDQKHySwMQR7VQVCAg"
  },
  "mWqa92oZl7a3E_inxwwA-A": {
    "date": "7/17/2018",
    "text": "We love this place!! The staff is always helpful & friendly. We are vegetarian so we get beans & rice, yucca con mojo (soooo amazing! Garlic buttery goodness!), yucca fritas (crispy perfection!), any of the plantains are a great choice as well (from sweet to savory they are so yummy!)  My granddaughter (not a vegetarian) also loves the above & their papas rellenos (balls of mashed potato with a meat center. She tried the tamales for the first time & it was a hit.  Don't even think of going there without getting the flan! Get it to go if you are full (you Definately will be). Hubby & granddaughter veeredfrom the usual flan & trien a cream hirn & a cream puff. They were both delighted!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "k8xn8HchBOifXLvU8y7buQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Cream horn",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/k8xn8HchBOifXLvU8y7buQ/o.jpg"
      },
      {
        "img_id": "85fBJM9Xjv-UBGwJ-vrRmQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Creamiest flan ever!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/85fBJM9Xjv-UBGwJ-vrRmQ/o.jpg"
      },
      {
        "img_id": "XA0ftmcRUeG48yG984naNg",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Cream puff...huge",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XA0ftmcRUeG48yG984naNg/o.jpg"
      }
    ],
    "user_id": "a3UgLZFIuk50kRZD0fAi0Q"
  },
  "nIoa4iEgZEjj5J3IL19eXw": {
    "date": "1/24/2019",
    "text": "My husband was looking for Cuban coffee and we thought we finally found it, but I was just normal espresso. We got Cuban sandwich the portion was big and taste good. When I go to ethnic restaurant I'd like to see something different and I didn't get that, but food was good. Good for 1 time try but don't expect something special.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C1T1RydmCIwbGCUVyGJ1yQ"
  },
  "2Kkz4YFGWL4E-qQQ_kvjTg": {
    "date": "8/29/2017",
    "text": "Grew up on the West Coast, never had Cuban food, but my transplant friends from NY and Miami always went on about how they missed it. FFW to when I moved to DC, we found an excellent Cuban place and our attitude was \"How had we not had this before!\"  Well, now, having moved to AZ, in the back of my head, I thought I had surrendered the opportunity to bite into the flat crust of a pressed Cubano, or get ropa viejo stuck in my teeth, or gaze upon what seems like miles of a perfectly golden, crispy breaded protein. Say it ain't so!  Enter Cuban Foods and Bakery! We had the Bistec Uraguayo and the Bistec Encebollado, with a side of yucca and crispy plantains. The grilled steak and onions perfectly tender with the subtle spice and sweetness of the onions a well-matched compliment, the breaded pork steak with cheese and ham juicy, crunchy, gooey all at once. The Tostones, smashed fried plantains with garlic sauce, crispy like a potato chip, and the yucca flaky like a baked potato. Accompanied by Cristanos y Moros, presumably church-going white rice and mosque-attending black beans (though cooked in pork, not exactly the most devout of Muslim beans) all mixed together in perfect harmony - the world could maybe learn a bit from Cuban side dishes!   The tale of how we were happily reacquainted with an East Coast fave right off hwy 17 in Phoenix, Arizona - shout-out to Cuban Foods and Bakery!",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 21,
      "cool": 20
    },
    "photos": [
      {
        "img_id": "RQF1T0xsNU-HVRf_qzqh2w",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Tostones",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RQF1T0xsNU-HVRf_qzqh2w/o.jpg"
      },
      {
        "img_id": "GY1BkGhsmZTngz__uhfTVw",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Yucca con mojo",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GY1BkGhsmZTngz__uhfTVw/o.jpg"
      },
      {
        "img_id": "zK6o-oHKpTSeJY7AOanwQA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Bistec Uraguayo - pork cutlet, cheese and ham, deep fried, w/ rice and beans",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zK6o-oHKpTSeJY7AOanwQA/o.jpg"
      }
    ],
    "user_id": "oGUrhMb_e2bPBKhdvqHIRQ"
  },
  "rUyeA-1LeM8gfoY8vrclzQ": {
    "date": "9/21/2018",
    "text": "I've been looking for a Cuban sandwich place in Phoenix FOREVER. I came across this randomly on YELP yesterday and the craving got to me.  So, we headed down the way (not really too far from our house). It was about 6pm and the place had just a few people, the crowd growing as we ate and the phone seemingly always ringing with to-go orders. Got my Cuban and the lady got a steak variation of it (can't remember what it was called). She substituted her fries with black beans and rice (which was \"okay\"), I subbed mine with straight black beans (which were delicious), no problem for the waitress or the kitchen.   I ordered a Mexican Coke (which turned out to be the half-liter bottle not the 16oz) and came with a \"rocks glass\" filled with ice. Nice touch. Athena got a lemonade which fascinated her because it is kind of frozen like a slushie but with spherical ice balls that defy description. It's cold - don't freeze your esophagus by trying to suck it down! We also ordered Cuban coffee and the waitress asked if we wanted that before/with/after the meal and we voted after - possibly with something from the bakery case.  After we finished 1/2 of our sandwiches (THEY ARE BIGLY. TREMENDOUS. BELIEVE ME) and sides, another waiter asked if we needed a box and anything else - we got some sort of raspberry gel topped cream puff thing filled with a custard that was apparently delightful (I didn't partake) and he made sure we understood that the coffee was strong and came in tiny cups - hell yes - we get that, bring it on...we may just not sleep tonight!  We're going to finish it up tonight for dinner and then start planning our attack on broadening our horizons and branching out from the sanwich portion of the menu. I'll report back when we do. Oh, and I THINK I spotted a couple of kinds of beer in the fridge, but it's not on the menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "uBZ3u1NuNQzkELznJphJsw"
  },
  "_1WsTRD6JElpOvhS_VFz0Q": {
    "date": "4/26/2019",
    "text": "Best Cuban Food in Phoenix! Authentic and delicious dishes. My hubby's favorite dish is Bistec Empanizado and they do it well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pDOedjeoT5YhjD8ZmkpxNg"
  },
  "Tz9ePD5BNTfMumBVrx52Jg": {
    "date": "10/14/2018",
    "text": "This is the real deal. The food is very authentic and the atmosphere is right what you would expect from Cuban food strip mall. Nice find.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "l5_g5z9eOeXEMhA2x2lIog"
  },
  "1qR5seT0PlGsYRtlYTvfIQ": {
    "date": "11/11/2018",
    "text": "Cuban Foods Bakery and Restaurant was amazing!  We tried some new things, deep fried mashed potato balls with meat, and some standards, Cuban sandwich.  And it's a must on dessert when the place is a bakery as well!  Food was phenomenal with fresh flavors and nice spice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0_qoN_p4YE9lMT4UOlx79Q",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Desserts",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0_qoN_p4YE9lMT4UOlx79Q/o.jpg"
      },
      {
        "img_id": "P7LtNOUaHqrDi6-_v7qW1Q",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/P7LtNOUaHqrDi6-_v7qW1Q/o.jpg"
      },
      {
        "img_id": "LJ99odtAhdn676A8c-2ovQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Fantastic Cuban sandwich.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LJ99odtAhdn676A8c-2ovQ/o.jpg"
      }
    ],
    "user_id": "B8M8jmBBUEMvBbQt4qcXmg"
  },
  "VI4p6OmDapv8Klkhj3Qagw": {
    "date": "12/17/2017",
    "text": "Slow cooking yields a delicious and hearty pork stew. I stopped by this small Cuban eatery and was not disappointed. I was feeling hungry so I ordered a full meal with the pork stew. It was hearty and delicious.   Make room for their pastries. They were baked fresh!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 9,
      "cool": 9
    },
    "photos": [],
    "user_id": "9gZ4pQHdK6v8xMLig6EEFA"
  },
  "Qca_KMtpU9g66DYZyb-M_g": {
    "date": "3/30/2019",
    "text": "Honestly I was thinking the food was gonna be amazing because of the reviews, but the food was mediocre at best. I have had way better Cuban food in cali. Also our waiter forgot to get our drinks and we had to remind him. Definitely would not return.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NiiYDmDV0RIL7urBd30ZHA"
  },
  "IhP2EDVuIN83wAHmQoOdaA": {
    "date": "9/3/2018",
    "text": "Cozy and quaint. Pleasant service and recommendations when learning it was my first time visiting. Will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "40X-NKcORJv4JgJ3bXdJcw",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Flavorful &amp;amp; tasty my cuban friends",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/40X-NKcORJv4JgJ3bXdJcw/o.jpg"
      }
    ],
    "user_id": "P43hfWf5E9eFB4eof2Z2tw"
  },
  "sT8XhzgRSAoPVDnGL7NjJg": {
    "date": "1/12/2019",
    "text": "Friendly staff. The let down for me and my Cuban mother was the food. It did not taste authentic. She did not like any of the sandwiches we ordered mainly because of the type of bread that was used and the fries that come with them were hard.  The croqueta de jamon was not good at all. Definitely do not taste like ham and are more like fried dough. It is brown and mushy inside. My favorite dish was the Papa rellena, however my mother thought they had a strong cumin taste to them. In short, if you are looking for authentic Cuban food to reminisce on your childhood or even a visit from Cuba or Florida, this is not the place for it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "siFdYx9laPeSA4JRIMYdcg"
  },
  "A61WqOEUQnHUEAAYpsuvtg": {
    "date": "12/30/2018",
    "text": "I'm not sure how this restaurant is still in business. It must be because it's the only Cuban bakery/restaurant on the west side. The service is not good and the food is mediocre. They post open bourse, however when you show up they are closed.  This is very disappointing. I hope they get their act together.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ahJgmWKJff7igXpGBozUow"
  },
  "Y_bv626at__U2xX7y8QvXw": {
    "date": "8/9/2018",
    "text": "This is my first visit,  and I will be back! Everyone enjoyed their food,  and needed to go boxes. Great customer service! Great food! At a reasonable price!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ICm-_2nJ9_rdPUH3wm3llQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Busted Empanizado, Delicious!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ICm-_2nJ9_rdPUH3wm3llQ/o.jpg"
      }
    ],
    "user_id": "VlUBEj_rolWOhx5SxHJmgw"
  },
  "Ppjovf82lahVYjydoCJxog": {
    "date": "5/2/2018",
    "text": "Let me preface this by saying I am Cuban-American. While I haven't eaten food from the island itself, I grew up in Miami and had the second best thing for most of my life.  That said, I think the food was good and authentic. Many times people say their restaurant is Cuban, but it's not. THIS ONE is. Their flan is excellent (I don't even eat it that often, but my husband and I loved it).   I will say I find it a bit expensive BUT I also grew up having Cuban food on every corner, so it may just be a supply/demand kind of thing. Either way, whenever we are craving Cuban food, we will make the 30+ minute drive up here to order from them.  And if you've never had Cuban food before, THIS is the place to try it.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "0Zi1IhCQVNxuKeqhG5-G-g"
  },
  "M-qev_AHMKqTiiGq7S3jQQ": {
    "date": "1/24/2018",
    "text": "This place dishes up some amazing Cuban food! It's tucked in the corner of a strip mall/ shopping area. I've tried several of their Cuban sandwiches, all delicious!! I'm looking forward to trying their paella and other dishes. Their pastries are really good, too. Not overly sweet. My only gripe is one time I ordered 2 breakfasts to-go... very small portions and it was $22 total. A little pricey for such skimpy meals. I should add that the breakfasts were more American-style dishes, bacon and eggs and scrambled eggs with ham. Both came with a piece of bread. That been said, I'll continue to try the Cuban food on their menu because they do it right!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZXSNzKI638WQ3x5iKgM-ug"
  },
  "15g3TIGwxi8At8fVY6FZBQ": {
    "date": "9/8/2018",
    "text": "Friendly staff, food is tasty, and definitely leave room for dessert!!   We will be coming back here for sure. Located behind the jack in the box, this place is worth stopping in and grabbing something to eat. The bakery is amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wk4hb8E58n1AQa6ia10Dlg"
  },
  "SPlNHmLP6xnih0S7DYrE5Q": {
    "date": "10/24/2016",
    "text": "Oh man... I am disappointed that this place did not live up to what I had expected.   This place is tiny and it was packed On a Saturday at 2:30 PM. So we got 2 Cuban Sandwiches to-go, as well as some beef stuffed Plantains. The Plantains were way over cooked and had little to no flavor. The beef was pretty good, flavorful, and juicy. The Cuban Sandwich was pretty good. Needed a few more pickles and mustard. It just wasn't as amazing as I had pictured in my head. They were giant. definitely sharing status. The French Fries were... well French Fries.   I do want to give this place one more try. I am hoping they were just having an off day.",
    "rating": 3,
    "rated": {
      "funny": 8,
      "useful": 19,
      "cool": 13
    },
    "photos": [
      {
        "img_id": "v1QkfEPey1_96QOX48ie3g",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. The Cuban Sandwich. Be sure to bring a friend. This bad boy is huge.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/v1QkfEPey1_96QOX48ie3g/o.jpg"
      }
    ],
    "user_id": "el3TmKFEFzZOcNbCw2FNlQ"
  },
  "LtQQY36Cch9XI9BoRCsMZQ": {
    "date": "11/16/2018",
    "text": "This place is FUCKING amazing. Just go there, it's that simple. The sandwiches are  and the staffs super nice.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kxVjmRP3t-Ao9R9FEK8EiQ"
  },
  "xU5yZe9qkXP5SFt72QS8rQ": {
    "date": "4/12/2016",
    "text": "Tried everything.  It was all excellent, like being invited to someone's home where food is made with love.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "eNsAqVPVWDXyQgXEljfjoQ"
  },
  "pxKWCZEWSmGiO3gXqHajPg": {
    "date": "9/2/2017",
    "text": "So this place all I can say is the wait staff is rather shitty! My husband and I waited about 10 minutes to get our order taken  another 10 minutes just to get our drinks. when we got out drinks the cups were dirty. GROSS!!!! Needless to say we got can sodas I don't think they can mess that up. The food was ok but not like before. I would say skip this place and go else where.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IEQsuq8gD_xwgNm7Ysvl9Q"
  },
  "svC7M0xLsi79g_rQPp0lLg": {
    "date": "6/18/2017",
    "text": "The meal I got was awesome.  I got the fried pork dish and a couple of apps.  The Flan was the best flan I ever had.  BTW they do birthday cakes that look crazy good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JNI1GfjJIfel3JQAErBc-Q"
  },
  "ry6e9BSlAPQmzI1QXkaGTA": {
    "date": "12/11/2013",
    "text": "Incredible Flan.. if you know Cuban food it won't be hard to navigate the menu. If you don't.. share a Cuban sandwich with a friend. Watch the other tables to see what others are asking for. Especially the small plates.. when you see one you like, give it a try. After, a good conversation with your friend order a coffee and desert. Maybe, Cafe cubano and Flan. This restaurant is more Homestyle then Taxi stand. it represents everything a Cuban restaurant should. Sharing a good conversation and some good food. Did I mention they have really good Flan? it tastes sweet where it's supposed to and doesn't where it's not... worth a try",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "RooiM5K3FkH6o2HolG1dlQ"
  },
  "It4A_f9dsBQnow6kcyU1UQ": {
    "date": "6/16/2015",
    "text": "Great place. I am cuban 100% and in my search for my favorite food I' ve been in all the cuban restaurants in the phoenix area, and some in san diego. this one is THE ONE here in phoenix. don't let the strip mall to impress you! real Cuban food, super tastie! they have Cuban desserts (wide variety) and the food is excellent! the service is a little different than any other place where you have been bfr but, very similar of what you will get in any cuban restaurant anywhere in the island! lol very very authentic..!!! cuban food in phoenix doesn't get any better than here!! 100% guarantee my fav: tostones (plantains),yuca con mojo(yuca rooth),masitas de puerco (fried pork shops), congri(rice w/beans cooked together) and lechon asado (roasted pork) and tocinillo del cielo for dessert t!!! Please open a location on mill avenue tempe and you guys will triple your profits!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OPXsmQjlBnTyTMOIu8iHBg"
  },
  "ht2tk-5xi0Bz-9QVvRJ1BA": {
    "date": "6/30/2016",
    "text": "The best Cuban food in town with fantastic service! I haven't been disappointed with anything I've ordered yet!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eW_S7yMxZrAJMdglil6PXw"
  },
  "oQUFeSU-2Czz2Mm4Ctuaug": {
    "date": "1/8/2014",
    "text": "If the courses are as good as the desserts they're getting five stars  next time.  The owner was very patient to go over the menu to us who had never tried this particular cuisine.  My wife has the sweet tooth and she loved the tartelets and bought several cakes to go.  Ciel looked particularly intriguing to her.  We have yet to try it along with the Flan.  It's tucked away and we discovered it by chance.  The name had us thinking it was another ranchero market but it's nothing like one.  It is inconspicuously hidden in a little corner with not much space at all.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZEIN6ywCfvBNyf-D3MWcQQ"
  },
  "OEqGfZV5ZXS3jzZ-LuAtBQ": {
    "date": "1/7/2014",
    "text": "What a pleasant surprise this was. A good combination; good service, good price, good food. We had a Cuban restaurant in California we used to go to and get the wonderful sandwiches, deserts, and sides. The Cuban Foods Bakery is like finding it right down the street.   I had the Cuban Sandwich and sides of banana, sweet and salty. I also ordered a sampler of deserts to take home. If you are looking for something a little different for lunch or dinner, try this place. This place is a winner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "CNuQyx25yRFqejNZ_BM20g"
  },
  "d8bYGWdnZyHbON4O3UJIXw": {
    "date": "6/16/2016",
    "text": "Salty, salty, salty!! The food as potential but I would recommend anyone who is watching their health to stay far away. It seems as if they soak the meat in salt, store it in salt, cook it in salt and serve it with salt. It was truly a waste of money.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eFiyZL31V0mEtlgLEf5d0g"
  },
  "gW6j5gfuffoMfQU4frLb7A": {
    "date": "8/23/2013",
    "text": "Very tasty, unassuming little restaurant serving delicious Cuban fare. f you are craving a Cuban sandwich, trust me on the fact that one order will be plenty for two. We also split an order of Carne Rellena, which are essentially two enormous potato balls (minus the hair ah ah!) filled with ground beef...  My friend and I were both stunned at the sight of the gigantic appetizer...We ended up splitting a half as we did not want it to spoil our appetite for the tasty Cubano paninis...  ...Last but not least, make sure you try one of the delightful postres (desserts) and in this case we had flan...All that food for fifteen bucks...so glad we split a Cuban sandwiich as sincerely one order s plentiful for two. Glad to have stumbled upon this place - just really surprised that they were not busier at lunchtime on a Friday.  According to the menu, the restaurant also serves breakfast.  Wishing you much success!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "YfvMjY-G6y86Ov2tS5Txww"
  },
  "wH5472V2PsnC-Uz5cDn5vw": {
    "date": "5/6/2016",
    "text": "I am very happy I made the half hour drive! The Cuban sandwich was HUGE and tasty. The Media Noche was a very nice surprise. I had never tried one and was glad I did. We also enjoyed the rice & beans & fried plantains. The service was quick & friendly. I will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IY1TuTN9JdSyKN1RQ6QNkQ"
  },
  "M-4mXKvYwkGPFyCv440kqw": {
    "date": "7/4/2016",
    "text": "The service was great, the food was awesome and the price just right!!  I felt like I was sitting in a friends kitchen.  Place is small so get there early.  They also have a great selection of dessert.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nl9Pn2f4WBdFXyk69ghKnw",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Batido de mango",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nl9Pn2f4WBdFXyk69ghKnw/o.jpg"
      },
      {
        "img_id": "cqaNEyMCeLKhsG6yCODv_w",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Empanadas",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cqaNEyMCeLKhsG6yCODv_w/o.jpg"
      },
      {
        "img_id": "a9E7GG1bh596YIfxi9speg",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Yuca frita",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/a9E7GG1bh596YIfxi9speg/o.jpg"
      }
    ],
    "user_id": "ngmedcnheNTAYCfngX9VOA"
  },
  "NZ6jYkTFnzNfE1QMsvlpXg": {
    "date": "4/28/2016",
    "text": "The food is delicious and the staff is very friendly. The pescado a la plancha is the best!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wlEmqXSpT-r6E8t431d6Lg"
  },
  "hoXu2gI-ojOH08mg9-1GnQ": {
    "date": "2/2/2016",
    "text": "The best Cuban food in Arizona! Very addicting food and the price is very affordable! A must place to go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MagAoZ5NutB5tHw1wzVHeQ"
  },
  "fMN11Txk2JyZCkT0EjD0PA": {
    "date": "6/7/2017",
    "text": "My husband is Cuban, so finding a Cuban place here in Phoenix was a treat. They have a good menu of all the basic Cuban dishes we love. The pork was perfect and the breaded steak was huge. Nice friendly staff as well. I'm going to try the papa rellenos the next time. As much as I love them, they are just too time consuming to make for parties. If they are great, I'll get ordering a batch for our next party.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VhFVjnzvUHOnHZOdIqBNDQ"
  },
  "lwNpbaRRoZdqi0OTM9_6tA": {
    "date": "2/27/2016",
    "text": "Yum! I found this place by accident and am happy I did. From authentic Cuban sandwiches to desserts and cafecito, it's all here! It's a must-do if you are in Phoenix!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hAsqoLITjV4l_iQF9Q1pRg"
  },
  "pY7FWE-uaNhduMZC_yCVKA": {
    "date": "7/15/2015",
    "text": "Decided to give this place a go after my former Cuban haunt finally closed up their last location, and I had a lingering craving for some plantains.   Executive summary: I'm not sure I understand all the rave reviews for this place, and that's coming from someone that really likes Cuban food and wanted, very badly, to like this place.   When we arrived, the place was empty and the chef and the one (and only) server were basically just waiting for someone to stop in. I was surprised, given the glowing reviews and the fact that it was prime time for dinner, that nobody was there. I had been expecting a wait and was even worried that since it was a small place, we wouldn't be able to dine in.   We got seated right away and got menus pretty quick. Drink orders were not taken for some time, which I found strange considering, again, the place was absolutely deserted. I'm not a demanding customer, quite the opposite, but is it beyond the realm of possibility to get prompt drink service when you are literally the only customers in the establishment? Even after we ordered drinks, they did not come out quickly, which was just... awkward.  In terms of food, we tried a few things, starting with the appetizers. We had the ham croquettes and a side order of plantains. While the plantains were fantastic and every bit as good as I had hoped from my experience at other Cuban restaurants, the croquettes were a bit of a let down. They tasted nothing like ham and, to be honest, I wondered if we'd somehow gotten the wrong thing. In all honesty, the taste reminded me of a black bean fritter, but the receipt confirmed it was in fact the ham croquettes. Not sure what else to say expect I didn't really wouldn't know it was ham unless you told me.  Entrees were a step above the appetizers, which was good. My wife got the pollo ala plancha while I ordered the Cuban sandwich. Both were good, but I don't think either would qualify as great. The sandwich bread was a tad stale on the outside, which made for a very messy experience eating it, not to mention the fact that when your drink runs dry (which it did), it only exacerbates the situation (imagine eating a sandwich covered in saw dust, if you want a visual). The meat, cheese and mustard in the sandwich itself was great, don't get me wrong, and I would definitely eat it again, but not on this bread. It would have been easily twice as good an experience if the bread was a little fresher (or, put another way, less stale). Again, loved the flavors, and the portion size was massive, but bread makes or breaks any sandwich and took away from this one. The sandwich comes with fries, but they were nothing special and I agree with another reviewer, the quality of the fries takes away from the meal. I would suggest swapping them out with something more authentic, or at the very least, getting better fries. My wife's chicken dish was good, well seasoned and delicious, so there were no complaints there. So I guess to sum up, on balance, the entrees were good and I'd almost certainly give them another try.  The last thing I want to mention is the ambiance here. When the place is empty, it has a strange, almost cavernous acoustic echo going on, which is a little odd. It's one of those deals where you almost feel like you have to whisper because you can hear a pin drop and you feel like you're being too loud. If there were more people in there it might be different, but I can only speak for the experience that we had.   At the end of the day, I would probably give this place another try in the future, but with revised expectations, both regarding the food and service. I've no doubt the food is authentic enough for purists, but the little things do matter and they add up and on this visit the sum total was still shy of what I had hoped for. Hopefully subsequent visits will give me a reason to add a few stars. Definitely worth trying if you haven't been, but based on my visit, I don't understand all the hype.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "F-1ClQ8bSEp2T7NSnVYNRA"
  },
  "Gjhy9txmedDpfy1yAk0Gxw": {
    "date": "5/16/2017",
    "text": "Been wanting to try this place for a while. Got the cubano sandwich and sweet plantinos.Excellent. the desserts from the bakery is awsome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g9yLt82uZws-qM2ZSw_l6Q"
  },
  "57U-IRoOv_fXhuQqlrHw8w": {
    "date": "5/14/2013",
    "text": "Muy Bien Cuban Foods Bakery and Restaurant!!!    My daughter had a country project to work on for school and she had to bring in food representing the country.  We went down to Cuban Bakery and met with the owner.  He was sweet enough to provide us with a variety of samples for us to select.   We settled on Pastelitos.   I needed the Pastelitos early on a Tuesday morning.  The owner came into the bakery   extra early that day to bake and prepare.    7:00 that morning he was there with five boxes of fresh made Pastelitos which smelled and looked delicious.   The Pastelitos where a huge hit at the country   fair.  And I can't wait to go back and try a Cuban sandwich.   I appreciate that Cuban Foods and Bakery went above and beyond to help out.    If you have a chance stop by for a bite and support a local restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 5
    },
    "photos": [],
    "user_id": "-d8tk22ca-MpY7htQIw08Q"
  },
  "7Tw1FMwmMIJ1F3ri7HeCMw": {
    "date": "3/8/2016",
    "text": "Best Cuban food I have had in a long time. Great service awsome experience. Will be back for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qWh5RVdwKgqxoPvyuIoXjw"
  },
  "McFA1mnu8lh-6ypNuv3dPg": {
    "date": "8/22/2019",
    "text": "Their Cubano sandwich is my favorite. Everything that my husband and I have tried there is delicious!! Nice family run place and good service. Well worth a try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SbSH2BRvWJiawoxP7sywxQ"
  },
  "UUMEi6hOYXKNDZqJlOVsBg": {
    "date": "3/18/2019",
    "text": "I am in the future trip planning mode, and I need some relevant and current advice from friends that travel constantly.  We opted to meet up one Friday, just so that I could quiz them on travel trips to Europe and Asia, since I don't travel as much as I used to.  Since I was paying (as I always do!), I chose the venue. Cuban was agreed upon, and since we didn't really want to drive to downtown Mesa, we chose to meet up at this particular establishment.  Cuban foods is a full fledged bakery and a restaurant. It's filled with some great and delectable treats. Perhaps, not on par as one would sample in Miami. But, it was passable enough for our culinary taste on this particular afternoon.  I ordered the Lechon Asado. Along with it, I had to have the Flan. My friends ordered the deep fried chicken, and the Cuban Sandwich.  Cubans love their pork, and no meal would be complete without at least some type of roast pork. This lunch hour was no different. The pork was tender, flavorful, and well seasoned. A little on the bland side for my taste, but it was passable enough. The accompanying Arroz Congri (Cuban Black beans and Rice) was quite tasty, and did much to enhance the meal. I wasn't too enamored with the overly greasy onions. Nor were the vegetables all that fresh. All-in-all, the meal was very satisfying and scrumptious.  According to one of my friends, the Cuban Sandwich, which was a combination of ham and cheese, wasn't really that appealing. It was very dry, and the ham tasted as if it was processed.   And my other friend, who just came back from a trip to Cuba, wasn't all that enamored with the Deep Fried Chicken. Although, he did indicate that the skin was quite crispy and spicily flavored. He mentioned didn't taste that fresh.   Of course, my flan was absolutely scrumptious. It was rich, somewhat sweet, and was appropriate layering to give it that caramel flavor.  Although we weren't in any hurry whatsoever, it wound up being a 2 1/2 hour lunch engagement. This was due to the fact that the place was packed, and there was only one server. And as diligent as she was, it was difficult for her to handle all those customers, along with the takeout orders and the bakery customers. Getting our check was a monumental task.  In spite of the hiccups, and my friends' fastidiousness regarding food tastes and quality; I would still recommend this place. Just don't be in any hurry when you dine here, during their busy times.",
    "rating": 3,
    "rated": {
      "funny": 25,
      "useful": 72,
      "cool": 62
    },
    "photos": [
      {
        "img_id": "DhVMkYRI_uDIrnUl1FJ33g",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Deep Fried Chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DhVMkYRI_uDIrnUl1FJ33g/o.jpg"
      },
      {
        "img_id": "F15UhNEkjcvRMJjWXKrYIw",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Lechon Asado",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/F15UhNEkjcvRMJjWXKrYIw/o.jpg"
      },
      {
        "img_id": "yFFz3FGwa5k2bgr1ftJJGg",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Cuban Sandwich",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yFFz3FGwa5k2bgr1ftJJGg/o.jpg"
      }
    ],
    "user_id": "a85qPvr6L63PF0v9Zs8ZAg"
  },
  "7KXOmH4CdqLlioNWttiHqQ": {
    "date": "8/6/2019",
    "text": "Delicious legit Cuban food. Went in on a Tuesday around 3. Ordered empanadas, yucca w mojo, lechon asado with rice. Service was good although I think the waitress was working solo at that time. The place was very clean and the menu had all the Cuban faves. I will go back when in that area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "-6f2Imr7sXjpIknm2yUucQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-6f2Imr7sXjpIknm2yUucQ/o.jpg"
      },
      {
        "img_id": "dL78TdAlAJI9kDH3eGc5GQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dL78TdAlAJI9kDH3eGc5GQ/o.jpg"
      },
      {
        "img_id": "rmy6LBMazGcIBMoJ6vNJRg",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rmy6LBMazGcIBMoJ6vNJRg/o.jpg"
      }
    ],
    "user_id": "0NNpVwcs7XEs-rLAreUN3w"
  },
  "RaCLKNbLUbvPH3cbxGc-fg": {
    "date": "6/13/2019",
    "text": "A friend recommended this place...she is getting a big hug tomorrow! My husband ordered a Cubano and I had the Media Noche!!!!  Amazing sandwiches.  we will be back!  Thank you",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ce6xIY7P5HLbMrzXBSogyg",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ce6xIY7P5HLbMrzXBSogyg/o.jpg"
      },
      {
        "img_id": "AQf6QygQw1HbFx3efQK-Bw",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AQf6QygQw1HbFx3efQK-Bw/o.jpg"
      }
    ],
    "user_id": "rK840JuRDfWsXCj0hmjLXA"
  },
  "0UEA8y1JdlUyXPYAu5f1jg": {
    "date": "8/30/2019",
    "text": "Great Cuban Resturant hidden on the Westside - but don't let that deter you.  This Place is Authentic Cuban!  I'm from NYC, Miami, little Cuba - just need to freshen up the black beans w rice and they've Got it!  Yumm!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZXCbOdLOk7xEOAfGONjLCQ"
  },
  "BxiUzaj4a7MeRvpJnRDU_g": {
    "date": "8/18/2019",
    "text": "Really nice place. Food is good and the service is very good. The portions are huge, my wife and I had Cuban sandwiches and we could have shared one. They have authentic Cuban coffee, which I love... strong and tasty. The restaurant itself is in a strip mall and not much to look at outside, but inside is clean and orderly. The food came out fast and the server was really nice. They also have a cake business, kind of reminds me of family owned joints in Phill,ph, except instead of being Italian, they are Cuban. I have been to Miami a bunch and on a scale of 1-10 on the Cuban sandwich I would give it a 10 for authenticity, but a 7 for flavor. The ham was a little dry. The mustard was not too aromatic, the bread was nice but it could have used some more planchette and butter time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "f1xjJAsFbtQmuIM2qNqJiQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/f1xjJAsFbtQmuIM2qNqJiQ/o.jpg"
      }
    ],
    "user_id": "EWfIrKEQf0QXglVFzjKDYA"
  },
  "Pw9_cV5y7mWKo2XdoNoZGA": {
    "date": "4/14/2019",
    "text": "Yummy food, great portions and delicious Deserts. I had the Cuban sandwich and it was really good.  I would add a bit more Mojo since it was a little dry( I would add it to the side) but it was still really good. They are very generous on feeding you well. The lemonade was my family's favorite. I would definitely enjoy a bit more attention from the waiters/waitresses, we felt a bit bad for bothering for water each time. Out side of that great place to eat with family and friends. I gave it a 4  if they came by once in a while to check on us that would give it a 5. Must come and try. I know we will be back.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "nCVbsGj_QMUKK60G6GmW9w",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nCVbsGj_QMUKK60G6GmW9w/o.jpg"
      },
      {
        "img_id": "60gd-S51iQGTcyX9oULpGQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/60gd-S51iQGTcyX9oULpGQ/o.jpg"
      },
      {
        "img_id": "rl4wFrAFmN6kwN-wVGOzZA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rl4wFrAFmN6kwN-wVGOzZA/o.jpg"
      }
    ],
    "user_id": "7YVcVf8oVKJ_qcs-hTTLHQ"
  },
  "AfwbXBnl4PwC3zs4GxooIQ": {
    "date": "8/17/2019",
    "text": "Delicious Cuban food! I enjoyed the sea bass stuffed with ham & cheese. Deserts looked fabulous.  Took one home for later. Restaurant was immaculate. Will be going back very soon. Totally loved this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "abBuU4cia3uUi9et1boSbQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Sea bass stuffed with ham &amp;amp; cheese.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/abBuU4cia3uUi9et1boSbQ/o.jpg"
      }
    ],
    "user_id": "_WAINmb-2xE6JG4-UgVEVA"
  },
  "m9PSYflQtLTwDf4tuX6s5A": {
    "date": "12/1/2018",
    "text": "Oh man we were so looking forward to trying out this Cuban spot when coming to Arizona since we saw so many great reviews.  So we ordered a couple of different things for appetizers to try them out. An order of papas rellenas, ham croquettes and yuca frita. The papas were ok, they were big but needed a bit more seasoning. The croquettes I was really not a big fan of, not sure what they were made of but they didn't taste like ham. Yuca was ok especially with the garlic sauce that came with it.   We ordered two main dishes to try Ropa Vieja and the Cuban Sandwich. Ok the sandwich is really a good size sandwich but that's about it. It wasn't pressed, the cheese was not melted and there was very little pork inside. The ropa vieja neither my sister or I enjoyed this much, she kept the taste of it all night though lol.  Staff was friendly but I highly doubt we would make a return visit.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TclsdHoQIHegaOIO5idDvA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Cuban Sandwich.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TclsdHoQIHegaOIO5idDvA/o.jpg"
      },
      {
        "img_id": "FVdO6wj8FKCBbNqm8N6dyA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Ropa Vieja.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FVdO6wj8FKCBbNqm8N6dyA/o.jpg"
      },
      {
        "img_id": "c0FKboEIIv4GjIphH7a8xQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Papas Rellenas.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/c0FKboEIIv4GjIphH7a8xQ/o.jpg"
      }
    ],
    "user_id": "tjN2_hjcs0Xkgbqb-IanaQ"
  },
  "w1xhu8qbKkbg-Tt9cnH-7w": {
    "date": "7/14/2019",
    "text": "We went for dinner at 5 pm. I ordered  BISTEC ENCEBOLLADO it was terrible. The steak was a piece of shoe leather. No flavor over cooked  I ask the waiter to prepare it on the rare side. What I got was shoe leather  When I told him the steak was hard like shoe leather he said it's all precooked and heated up. They served with a rice and beans mix again no spice no flavor plus a lettuce tomato salad which was the highlight of the meal. My 2 friends had the fish which was dry but good flavor. We ordered desserts and I ordered Cuban coffee which the waiter never brought until he gave us our checks. He did give me a free coffee but advised me he was giving me 1.99 coffee free well if he had brought the coffee with my dessert he wouldn't have given me anything free.i will try the place again hopefully the food will be better",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dmrJJ2DpWazaNXs2ZRjnlQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. BISTEC ENCEBOLLADO shoe leather",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dmrJJ2DpWazaNXs2ZRjnlQ/o.jpg"
      },
      {
        "img_id": "qndMru5VioCZDKBBhnI9Sw",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. BISTEC ENCEBOLLADO",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qndMru5VioCZDKBBhnI9Sw/o.jpg"
      }
    ],
    "user_id": "MOhvwxhpzo3MJyaevNVSdg"
  },
  "fKuOaqluFJ1ml0kaDDt9bw": {
    "date": "5/11/2019",
    "text": "My favorite Restaurant right now. I love this place. Reminds me of home.  I love the cafe bustelo. Flan and chocolate cake is delicioso",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ena6xEWnhWcOL_GEWowZ4g",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Tostones con camarones",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ena6xEWnhWcOL_GEWowZ4g/o.jpg"
      },
      {
        "img_id": "2q7feXB6anhRznOlcwUsGw",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2q7feXB6anhRznOlcwUsGw/o.jpg"
      }
    ],
    "user_id": "i63FNJpfpp6riFK3Qoj0OA"
  },
  "PvUNTCEXjVrFqFkeMU-tOA": {
    "date": "7/24/2019",
    "text": "This place was very flavorful!! When we walked in there were only a few people we were kindly greeted and sat in a booth. I ordered the tostones con camarones and my husband had the Lechon Asado. So let me start by first the smell of my shrimp dish.... omg this was such a fragrant wonderful garlicky delicious smell. The dish is basically stuffed plantain cups with garlic shrimp but the words do not do this dish justice! Guys if you love garlic and shrimp this is a MUST try! My husband had the Cuban pork dish (I don't eat pork or beef) but my husband said was very flavorful. I enjoyed the black beans and rice while my hubby thought there could be more flavor in them. We also order a Cuban style Espresso was so cute and tiny but packed with rich flavor again key repeated word for this review is flavor. Check this little spot out",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ScjDNXnHW9bRDGS84zgezQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ScjDNXnHW9bRDGS84zgezQ/o.jpg"
      },
      {
        "img_id": "60zXebEAEmHt1YmWaETepQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Tiny strong Espresso yum",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/60zXebEAEmHt1YmWaETepQ/o.jpg"
      }
    ],
    "user_id": "s5xmPm973HXm2O5c_naiYg"
  },
  "s3igtCmIjOsyfRKR9gIalA": {
    "date": "3/6/2019",
    "text": "By far one of the BEST Cuban restaurants i have ever been to that is not in Miami.. The location was nice and clean. the restrooms impecable.. the service was very attentive. we had like 3 different people serving us and the food was awesome...   I had a Bistec Uruguayo which similar to a cordon bleu but with steak instead of chicken, breaded and deep fried...... They serve fresh lemonade which is a huge plus for me... awesome place...If we ever visit Phoenix again, we'll be back!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "3VISSqRDH4cBO6Db5x8iEA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3VISSqRDH4cBO6Db5x8iEA/o.jpg"
      },
      {
        "img_id": "sQjeJco3vS2HFglKEqSjMg",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Bistec Uruguayo, Tostones rellenos y un sandwich de palomita creo que era.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sQjeJco3vS2HFglKEqSjMg/o.jpg"
      },
      {
        "img_id": "R0Yk5krVaNYvwXkg6tTDmA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. My dad taking pictures of the photos on the wall",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/R0Yk5krVaNYvwXkg6tTDmA/o.jpg"
      }
    ],
    "user_id": "LIL2Tn4mdVqBOrUSKnRxag"
  },
  "nnJRmCvnfkOoLjUrOyWzbA": {
    "date": "3/13/2019",
    "text": "Soooo good!  For months I've been meaning to stop here.  I took full advantage of some alone time and ordered up!  Cuban sandwich w rice and tostones.  The food was perfect, except I received fries instead of rice.  Go with the rice! I waited a little while for my food,  but it was well worth the wait.  The Cuban sandwich was large enough to share between two people.  Couldn't stop at just one tostone, one led to two, led to three....  I was glad I stopped in and I  look forward to trying a new dish.  Right... I'll still be getting the Cuban Sandwich next time!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "JsKNSjW9IK8MLLLQHg5FBQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JsKNSjW9IK8MLLLQHg5FBQ/o.jpg"
      },
      {
        "img_id": "Zilt2EqAAyVonvQT8CIWVw",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Zilt2EqAAyVonvQT8CIWVw/o.jpg"
      },
      {
        "img_id": "t-X5Rsac9-YXLRqWWFOaDg",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/t-X5Rsac9-YXLRqWWFOaDg/o.jpg"
      }
    ],
    "user_id": "xiwyJvtfDTJpeavCNEHWCA"
  },
  "YyKMtAktWprGjU7ABDGUBg": {
    "date": "5/29/2019",
    "text": "Another great experience for dinner. Had the bistec encellboado, tostones and a couple of papas rellenas. Hmmmm!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "D1jwIgDNHvCuRB99gcnbIg",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/D1jwIgDNHvCuRB99gcnbIg/o.jpg"
      }
    ],
    "user_id": "bg9bPfthAfCDzmd1-FScRg"
  },
  "bQkxK-YVWlFcdhS0VO2u6A": {
    "date": "11/2/2018",
    "text": "I have been eyeing this place since I moved here. It's close to my house and I've never had Cuban food, but my friends parents from back home would make it and it always looked delicious and smelled so good. It was lunch hour had had maybe 3 tables full. It was clean and the lady who helped us out was very kind. My son and I shared the Cuban sandwich with one tamale. Both were so flavorful and as I'm writing this my mouth is watering. The Tamale was way better then I expected. I can't wait to come back and try more of their food.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "y1vSHaYDMcI_y27YITlBHg",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/y1vSHaYDMcI_y27YITlBHg/o.jpg"
      },
      {
        "img_id": "K-gHbq0Ii-PFZjtKaUtuBQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/K-gHbq0Ii-PFZjtKaUtuBQ/o.jpg"
      },
      {
        "img_id": "kgOzLWAXymgi8tUtTNMsxA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kgOzLWAXymgi8tUtTNMsxA/o.jpg"
      }
    ],
    "user_id": "80U-J9pRef6qNP-UgW4wOg"
  },
  "NIoePksFLMRCamQmHDIhlA": {
    "date": "7/12/2019",
    "text": "Terrific little place. Very hard to miss in between the Ross and the second hand clothing store. I had the ham croquette sandwich and oh my was it huge! It was only six dollars and it was big enough to almost take up the entire plate! Very generous portions for the prices I must say. I wish there had been a bit more ham in my croquettes because I did have a few bites that seemed to be just breading, but other than that it was delicious. The goodies they had up in the front counter looked very nice too. I was too full to even think about dessert but I'll have to stop in again and try some because they have some things not found in most other bakeries around here. That's always a plus. Service is nice too and the space is clean and not too cramped. From what I saw of people coming in to pick up cakes those are really good too.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "KYObsUPFgkOFUxKBUFNOTA"
  },
  "deJkR81m8MJ0PbA9DbPzrA": {
    "date": "7/14/2019",
    "text": "Being from Miami, this quaint little restaurant offers many authentic Cuban foods including my favorite Media Noche sandwich. I can't complain about the taste, the flavors are dead on. The Cuban music playing added much to the ambiance which is appreciated. My only complaint is that they don't use Bustelo.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qByogHVHpB8C9EXxAFiBfQ"
  },
  "fDKOuGbbj8HLSduE9I64iw": {
    "date": "6/29/2019",
    "text": "The food here is amazing, the staff is very respectful and great. The food comes out hot and fresh. I loved this place and I will defiantly go back!!! Thank you to the employees at Cuban foods for giving a great experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H6C9Hhzo0UlBMFFlRpWG4Q"
  },
  "QxH5iCoXawBgn-a4uBGRYA": {
    "date": "7/14/2018",
    "text": "I am Cuban and I am from Miami FL I am very disappointed with this supposedly Cuban bakery. Dont call your place Cuban if you don't know what Cuban food is it's very disrespectful to Cubans. And to top it off the workers werent even Cuban so they had no clue about Cuban food. I ordered a Cuban iron beer and the waitress didnt even know what that was so I just got a Coke Cola instead then I look to the refrigerator and see the Iron Beer there. Then I ordered the pan con bistec my food had no fries in the sandwich like a Cuban pan con bistec should have been and my husband ordered pan con croquetas it was disgusting it didnt even look like croquetas the food tasted like very old oil I didnt eat my food I am 34 weeks pregnant and I was afraid of getting food poisoning. I HIGHLY RECOMMEND NOT TO GO HERE DONT WASTE YOUR MONEY THIS PLACE SHOULD BE SHUT DOWN.....",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jc9KqEvo2Qu9GgxBk3-r_Q",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jc9KqEvo2Qu9GgxBk3-r_Q/o.jpg"
      },
      {
        "img_id": "qP11w9WvAKE-ws8oKYbnXA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qP11w9WvAKE-ws8oKYbnXA/o.jpg"
      },
      {
        "img_id": "UI2kEcgA9SvgArgjA9_gJA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UI2kEcgA9SvgArgjA9_gJA/o.jpg"
      }
    ],
    "user_id": "AJ1WByd-RgNkhMKClB8opA"
  },
  "lAV6CrUikQFCEUDIz6hHnw": {
    "date": "9/22/2016",
    "text": "Great lunch...The reviews are all correct. The Cubano sandwich is as good as everyone says. The crunch of the bread with the zing of the mustard and the pulled pork all mixed together with the cheese, it was very good. The fries where hot and crispy. They have great lunch time specials. Small seating area and no restrooms, but the service was great...Will go back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HF3fFCdkPUW2RSde8YaLUg"
  },
  "Kg4-hRr2UqvWa5wHdQzIZQ": {
    "date": "9/16/2016",
    "text": "We enjoyed everything from the Cubano on fresh original Cuban bread to the papa rellenas. It's a Brother and sister show and their hospitality is inviting. Returning for more :-)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5hbBhSbxcqLwCJMDPb3qow"
  },
  "SM2bwJ0Hetngglm9-a8Ulg": {
    "date": "2/8/2015",
    "text": "All I can say is wow this place is really good for being a hole in the wall joint but of course if we haven't learned by now most hole in the walls are the best now this place is really small but it's still can seat a decent amount of people so I think this place really had a nice atmosphere even though it's kind of plan inside but when you overlook how the inside is as far as being PlanThe food is really worth the wait the sandwich was delicious we also have the Cuban coffee which is surprisingly in a very small little glass but it's a very strong so really worth what you're paying for it all in all it was very inexpensive very authentic and very good. it's a must try if you have not been here before or if you drive past it stop in and give it a try if you like hole in the wall joints because this place is delicious",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "rWxxJ63cjHsWaZuvxEw4kQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. The Cuban coffe it&amp;#39;s so little but really good!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rWxxJ63cjHsWaZuvxEw4kQ/o.jpg"
      },
      {
        "img_id": "c3klOB84I7RSn81mBSmDPg",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Nice and small but not to small",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/c3klOB84I7RSn81mBSmDPg/o.jpg"
      },
      {
        "img_id": "_IKQtWS7pmVrvUBYkE8vYg",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Before my meal with a Mexican coke",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_IKQtWS7pmVrvUBYkE8vYg/o.jpg"
      }
    ],
    "user_id": "Z7tqXFFjWCMcZIMSi2unjQ"
  },
  "Wnhha9_XGiS_U2LNbX96Xg": {
    "date": "8/26/2017",
    "text": "Looking at all these reviews, maybe I came on the wrong day... The food was outright horrible. There was nothing good... everything was super greasy... it was just nasty. Everyone at the table left left food behind... This is by far the worst Cuban restaurant I have ever eaten at. I am of Cuban descent and grew up in Miami. Have lived in DC and Texas as well.  I would not feed the food this establishment served to my dog",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "seapi7qVTNV-HgyhGf1-2A"
  },
  "nfxxOFAuTGpfRnrv2koc2A": {
    "date": "9/6/2015",
    "text": "Wanted to try something different and this place hit the spot! I had the Torta Cubana while my hubby ordered the Torta Media Noche. Both where delicious! We then ordered dessert to go from their baked goods and choose 4 different items. All where amazing! Service was good the server was attentive and gave us great advice on our dessert choices. The resturant looks clean and taken care of. Only bad experience we had was their credit card machine stopped working the moment we where getting ready to leave. Had to wait like 45 minutes while they called the credit machine company. I had ordered extra tortas to go which ended up cold and our fries soggy and our desserts melted by the time I finally got to pay and leave!   Even though I liked their food and feel bad they had problems with their machine, I feel they should have taken something off the bill specially after having to wait so long and getting home with cold food and melted desserts. After $50 spent!!!   Okay, so I might go back but next time I'm taking cash!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gBvDLpwrMdOECOXUaglM-g"
  },
  "gIf5Ftkiro81ASc271twZA": {
    "date": "9/6/2016",
    "text": "Actually found this place by accident, and boy were we happy we did!  Small but comfortable, and we arrived just in time because the place got crowded!  We ordered the Cuban steak sandwiches and a side of platanos.  The sandwiches were huge!  We ate half for lunch and took the other half home for dinner! Affordable, very tasty and fresh food, and served quickly.  We had some of the flan for dessert - fantastic!  Definitely will be coming here again :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3qxFVhDvAATmH4KJ-TSSVw"
  },
  "ctf2M8u6hU7MwnTOZChJ4g": {
    "date": "5/17/2015",
    "text": "My boyfriend and I are eager to try new foods and this restaurant was not too far from his house so we decided to have dinner here. We arrived at the place around 8:00 and I believe they closed at 9:00pm that night on a Friday. When we entered the restaurant we got to choose our own area to eat hence the place isn't big at all, they have about 5-6 table available. Then we ordered, I had their Cuban sandwich. Their Cuban sandwich is huge and includes fries! It was tasty but their bread was a little hard. My boyfriend ordered fish, with rice and salad (I believe) he enjoyed his food and the fish was very tender. Overall, the food taste great but my only complaint is that I felt they were in a hurry to close because they turned their open sign off 15-20 minutes early.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n8sxD3ybFwCHhOo9P3bVhw"
  },
  "MzXayfsXwuqiLvZs7HaJmA": {
    "date": "8/23/2014",
    "text": "OMG pero que ricuraaaaa!!! This place is sooooo good and this is coming from a Cuban!!! We have been longing for a good cortadito (Cuban espresso) since leaving Miami and their pastries are TO DIE FOR!! They have senoritas and all!! We will be back again and again and again!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "8K59ulD9497Q1bHqAeuEGw",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Basically sums it up! Forgot to take a pic of the yuc con mojo",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8K59ulD9497Q1bHqAeuEGw/o.jpg"
      }
    ],
    "user_id": "IqMvsh-oSV7DYCn0vAvCxg"
  },
  "UvlxXIaBSdZMbn4IMSc92g": {
    "date": "12/30/2014",
    "text": "This place is delicious! I had the Cuban Bread Bisteca sandwich. It came with fries. It was very good. The breakfast's look great here. I would go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "dEk7mXM4npuDPmxrwPcEgQ"
  },
  "RUEZWqgnTyA4fXWKHRG4Bw": {
    "date": "8/19/2017",
    "text": "Tried this place for the first time today-we waited too long! First-it smelled heavenly when we walked in. The dining area is really cute and we were immediately greeted. Ordered two sandwiches and a piece of cheesecake to go. Needless to say that everything was really good-really good flavor. we will certainly be back and would like to dine in next time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2kmB5Pbb7LvJ-Mcf6dMGOg"
  },
  "9DDCILGo5pRVxdLgz6Pfcw": {
    "date": "10/21/2016",
    "text": "We had an awesome lunch here; food was so fresh and tasty!! We also bought a few desserts to go and enjoyed them later at night!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zt-pKzaxNWUn5-Qyhaah3Q"
  },
  "yFN93KCsbB6H7JfbQdhcoA": {
    "date": "5/14/2016",
    "text": "Ate there today and it was well worth the trip out of my way too!   Had the Cuban sandwich, the shrimp tostones and a piece of the chocolate cake.  Can't go wrong eating here!  I'm definitely making the trip from Scottsdale to here again to try other items on the menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1N2vD8sOMzU0cAYCavCFlw"
  },
  "WQRYZyiDGUP-rVjMWMG6zw": {
    "date": "6/18/2016",
    "text": "Friendly atmosphere!  The food is delicious!  Authentic Cuban food.  Definitely recommend it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "rcKE7btzhNgvOUOkemOUPg"
  },
  "IgEJwjIn7U939r3FU3pLXA": {
    "date": "8/17/2014",
    "text": "If you really want to taste the real cuban food you have to try this place. Treat is the best, the owners are exceptional, born and raise cubans. Breakfast lunch or dinner always at your service, fast and tasty food!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "GE6TUbTLRzGnt6mzbsfozA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GE6TUbTLRzGnt6mzbsfozA/o.jpg"
      }
    ],
    "user_id": "zCSnOmBpv8le70J6untsVw"
  },
  "whUnGIu-L1qFcEza5-jrfw": {
    "date": "12/18/2014",
    "text": "Amaze-Balls! We've searched the valley for aunthentic Cuban and little is to be found.  The hole in the wall joints tend to be the best and this is no exception.  Totally unassuming  but the food speaks volumes! Cuban Wife was even happy to find a rare dessert - Guayava pastry.  This place surpasses all of the Cuban food benchmarks... Moros - Delicious! Ropa Vieja - Yummy! Croquetas Sandwich - Mmmm. Yuca Frita and Maduro - Stop Ya Killin Me!!!    We wobbled out with happy full bellies :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "lTRnR-B5TUFhs4Jc094_QQ"
  },
  "3XlC3ZYeGNdj6fZ2WmeLlA": {
    "date": "1/15/2015",
    "text": "This is a tiny place in a strip mall, and doesn't look like much from the outside. There are only a small number of tables so during peak hours it's best to get your food to go.   We ordered the Cubano sandwiches, and loved them!  Juicy pork, pickles, cheese, and ham between grilled/squashed bread.  Better than any Cuban sandwich I've had.  We also had an appetizer of mashed potato balls stuffed with meat and seasonings, and then deep fried.  (Can't remember what they're called.)  Interior is a bit grungy/dingy but it's always been clean when we were there.  Staff isn't super friendly, but they are polite and answered any questions we had.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ljsluSlVyMRvHNWbssD-ew"
  },
  "jRXvtuBwRxa9iGdrBfElDw": {
    "date": "11/7/2014",
    "text": "MNy firends and I decided to try this place for lunch. When we walked in it was pretty empty, but we were determined to cuban food for lunch. I ordered the battered fish stuffed with shrimp, beans w/ rice and plantain... It was really good! And the crowd poured in as we ate. Long story short, this little gem is a great find! The staff is friendly, the food is good and restaurant is clean.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4HqWjMaHRKqJLFkazG20xg"
  },
  "H5kOs3U59qZra6BZSRow1Q": {
    "date": "7/25/2017",
    "text": "The sandwich cubano is our favorite! Served with french fries. The bread is housemade and the Best ever",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g1YqqBi7Wat2eTOaUQclOA"
  },
  "VA3SsIlIYa0D62m9GvMd4A": {
    "date": "7/16/2016",
    "text": "Had a Cuban sandwich and some guava pastries here. Sandwich was okay, but the pastries were really great and worth checking out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wgRrH7WAQWycz5v7RRJcYw"
  },
  "eK0hNV8ETg-1yb7oSxGghQ": {
    "date": "2/4/2017",
    "text": "As a Cuban living in Phoenix, it's hard to find authentic Cuban food! Just found this place, food was delicious especially the sandwiches! Definitely coming back and highly recommend for something fast and delicious!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "No6JRFKCDs0kxR9RwH_lZQ"
  },
  "I4fUQHfSbLxWSfHmcgjfhQ": {
    "date": "3/16/2017",
    "text": "I had the Cuban Sandwich. It was pretty good.  After reading the other reviews, I asked for extra mustard and that definitely helped.   I liked the bread and ham of the sandwich, but the pork wasn't for me.  I took the shredded pork off the sandwich and it was excellent.  This may have just been a personal preference.   The service was great and fairly speedy.  Cleanliness was moderate.  No bathrooms.  Overall, it was pretty good. Like other 3-star reviews, I will need to go back and try something else.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q1cz11aM0w9D3p4r6w5o4A"
  },
  "mMhhbF8qitqmGOYlV5y22Q": {
    "date": "10/29/2017",
    "text": "WOW!! Came here the other day with my mom and I was completely amazed on how different it is now then it was before. Last time the seating felt very small and felt more of a place to dine out rather than dine it, but now after the renovations it is a awesome place to dine in. Before I never really explored the menu but now I really want to. This place is great. The food is very good, the service has that amazingly warm family vibe and its all at a great price. Me and my mom got about 5 or 6 dishes to share with drinks and it only cost around $20. The servings were large enough we took food home. This might become a place I go to allot now rather than whenever my mom or sister dragged me along. I'm very pleased with this restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Axdhci7Y9g0Ft2WSA-LluQ"
  },
  "yftSKixtoJhJSq514fVC3w": {
    "date": "9/30/2014",
    "text": "In the search for the perfect Cuban sandwich my travels took me several miles and many lights up across Phoenix to locate this little gem in a strip mall. The staff sure seems to know what they are doing and the clientele  is looking (at least some of them) right out of Havana. The Cuban was the best in a while, with just the right amount of crunch. Could have been a bit meatier, possible a little more zing in the sauce, but all in all a good sandwich and pleasant service. A True pressed Cuban and a couple empanadas and I was off to the races, Next stop Who Knows, As I race across the south west looking, looking , looking for the  perfect Cubano.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "gFcyFQ9ZCJSAeJ9rWMelNA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. From the Parking Lot",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gFcyFQ9ZCJSAeJ9rWMelNA/o.jpg"
      },
      {
        "img_id": "TnER8-oy7HPQNLozb4CKAQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Huge Empenada!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TnER8-oy7HPQNLozb4CKAQ/o.jpg"
      },
      {
        "img_id": "Ur8Q7dIgE6j6QjTkhgrz7w",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. A very Good Cubano",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Ur8Q7dIgE6j6QjTkhgrz7w/o.jpg"
      }
    ],
    "user_id": "3XzhO2aJdvVtYhKOCJsPrg"
  },
  "0ngU40Ik6Fxh1mG7B79oGw": {
    "date": "8/1/2017",
    "text": "Best Cuban sandwich in town and the pastelitos de guayaba are amazing. This place is the real deal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NjIElXA9q2pwcy2NttukZw"
  },
  "mTvwcECfp6UkA26KIygx7A": {
    "date": "8/1/2017",
    "text": "OMG this place is fabulous. I had the ropa veija, so stuffed everyone had something different. I will be back tomorrow if my schedule permits.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vqdlw1AouETw0vDrpu792g"
  },
  "aQWISKLH-ord0rf5P8WgQA": {
    "date": "4/7/2016",
    "text": "Quaint little restaurant and bakery serving Cuban food. My fiancee and I tried it out for dinner. I had the Ropa Viejo and he had the Cubano sandwich. Both were very good. I enjoyed my dinner but the side salad of lettuce and sliced tomatoes just seemed like a garnish. The Cuban sandwich was Huge (check out the pics) We finished off our meal with a treat from the bakery case. Not sure of the name but it was a fresh and tasty pastry filled with vanilla custard and topped with a strawberry glaze. Yum. We will be back.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "-cD9LU0imEO2HBCneuBx-g",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Yummy pastry filled with custard and strawberry glaze.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-cD9LU0imEO2HBCneuBx-g/o.jpg"
      },
      {
        "img_id": "HWBpayEVCK2TNhYBlpwGVw",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. The Cubano sandwich is huge!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HWBpayEVCK2TNhYBlpwGVw/o.jpg"
      }
    ],
    "user_id": "VIzd3JUM0vl4XWupXJj8Nw"
  },
  "WVu67xVjeBBOsfOdlZbShQ": {
    "date": "8/12/2014",
    "text": "You can't get much more authentic than this place!!!! I dare you to try and find a restaurant that brings the flavors of Cuba to Glendale better than this restaurant.  Primero: el cafe Cubano...*check *  Segundo: la ensalada mixta...do not ask where the dressing is. It's already tossed in it and is very refreshing.  Tercero: los moros y cristianos...all fully cooked but a little on the dry side for my taste but the flavor was still there.  Cuarto: el pescado...on point  Quinto: los postres.....aaaaaahhhhh :) :) :)....los postres. Don't ask. Just eat whatever looks good to you and if you can't decide just buy 1 of each para llevar. They are all verrrry good and you will not be disappointed.  Sexto (Yes. That's how you spell it) :p Do not be afraid to use your spanish to order your food. The nice young lady who's running around like a chicken with its head cut off will understand what you want.  I WILL definitely be back. As at any small restaurant everyone is welcome, but repeat customers treated con un poco mas carino.  Buen provecho!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "u9eWo5QBtbRi6EU9i6Blog",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/u9eWo5QBtbRi6EU9i6Blog/o.jpg"
      }
    ],
    "user_id": "VM-pBrNPfZm-5YWcMCVbqw"
  },
  "JTEwot6F9qnvF0VDLLXHqA": {
    "date": "2/10/2016",
    "text": "Astonishing.   The food here is unbelievably good, very authentic, home made and fresh. I've gotten the Papa Rellenas, which are these delicious little mashed potato balls filled with ground meat, the Bistec Uruguayo which is like a Cuban version of Cordon Bleu and the Bistec Encebollado which is a thin pressed steak topped with onion. The sandwiches come with delicious home cooked tasting fries but the plates come with the incredible Cuban style rice and a side salad. I cannot begin to describe just how good the food is here. The folks who own it are Cuban, speaking of which...  The young man and young lady who wait on us every time are so incredibly friendly. They have such good attitudes and are always happy to help you, explain things and are very prompt and punctual. They always make us feel so welcomed and happy to come, we've even had great conversations with them about Cuba.   I'm not sure what more a restaurant could have. Every eatery and dining establishment on this planet could take notes from this place because they've GOT IT DOWN. If there was a 6th star, I would give it to them.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 2
    },
    "photos": [],
    "user_id": "BpbQjQELSc1uePGQcsnJAA"
  },
  "ymQogFr8ax0NNlfhRFLjrg": {
    "date": "3/27/2015",
    "text": "My tummy is singing right now!!!! We tried a little bit of everything. It was all delish. Definitely will be back to try more. Such a little place hidden in a strip mall.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jw5h4ARa06jFMDNIie7C-w",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Chicken cordon bleu yum!!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jw5h4ARa06jFMDNIie7C-w/o.jpg"
      }
    ],
    "user_id": "CnSzFGho_Ofsda3DOg0cIA"
  },
  "ul16h2mPwX0os_43sp1zNw": {
    "date": "1/5/2016",
    "text": "Well, I'm a Cuban guy who grew up in Miami. I am currently living in Northern Nevada and in the process of moving to Phoenix. In Northern Nevada, there is not a lot of diversity. This could be due the proximity to Lake Tahoe, and the abundance of snow during the winter. I miss, miss, miss, Cuban Food and nothing is more frustrating when people don't get it. I vent to friends how I miss the food and how lazy I am not learn how to cook it...and all they say is \"dude, go to pepito's tacoria\" NOOOOO DUDE, IT'S NOT THE SAME. MEXICAN FOOD AND CUBAN FOOD IS DIFFERENT! They don't know better.    I found this place, and I was hesitant. I went to a Cuban Restaurant in San Francisco, it was NOT Cuban food. The west coast had not treated me well in this area. When I arrived to the restaurant, I noticed it was a little hole in the wall near a DJ store and a Metro PCS. I immediately got excited; because, unless your going to Versailles, Cuban food is not fancy.    I ordered the bistec empanizado. I loved it. The portions were large, how it should be, and the steak was good. I was impressed. My girlfriend had the medianoche, and she liked it. She is a Northern Nevada blonde white girl, so I gauged her and asked \"is it Latin America good?\" Latin America being a prominent cuban sandwich place in Miami. She said that it was just as good.    Impressive.   The business looks like it is somewhat new and just now getting clientele. I hope it does well. I love seeing my paisanos succeed. Get that money papo!   But PLEASE, get a bathroom, really? No bathroom...conjone meng   I am typing this on my phone, sorry for any grammar errors...",
    "rating": 5,
    "rated": {
      "funny": 10,
      "useful": 16,
      "cool": 9
    },
    "photos": [],
    "user_id": "gAq1LRj4t5UhWtw4tng6dQ"
  },
  "UYeX3EgUD3gWeAJDLoPyzg": {
    "date": "4/13/2014",
    "text": "Tucked away in the strip mall, this small Cuban bakery has been overlooked and undervalued by many who don't frequent the area or knows very little about the cuisine. Once inside, there are only six small tables. The red tablecloths, glass dessert counter, tiled floors, and bright natural lighting coming through the doors nicely accentuated the decor. Fellow Yelper Kurdy S and I were the only non-Spanish speaking customers during this afternoon. Like many of the nearby restaurants, the atmosphere was fitting as a casual lunch spot.  For appetizer, we shared the Tostones Rellenos de Roja Villeja ($4.49). The plate came with four fried green plantains holding a small scoop of tender shredded beef on top. The plantains had great texture on the outside to add to the soft green banana flavor on the inside. The beef was tender, flavorful, complex, and very nicely seasoned. I can eat these all day long.  We also had a side order of Plantanos Maduro Fritos ($2.49) that came with soft bananas served piping hot, perfectly fried, and sweet. It was nicely glazed, but also unexpectedly oily.   Next, the Cuban Sandwich ($6.95) came with shredded beef, ham, and mustard. The bread had an awesome crunch with an excellent secondary chew. The sandwich was big enough to share and the dish also came with French fries. The way they kept it simple without all the fillers made this one of the best Cuban Sandwiches I've had so far.  Finally, the Filete a la Plancha ($9.99) came with a big serving of grilled sole, black bean rice, and salad. The sole was fresh, moist, tender, and had good flavor but slightly over salted. The black bean rice had great flavor and moisture--much better than the one at Victor's 1959 Cafe. The lightly dressed salad provided a nice change of pace to the sole.  Antithetical to the cuisine's longstanding stereotype of being bland, this place simply rocks. Service however, was friendly but also inattentive, offbeat, and at times awkward. For instance, the food and bill took forever to come, and our water was never refilled even though the restaurant was not busy. Despite the shortcomings, interested diners should still come for the impressive lineup of dishes and great prices. I'd be very interested in coming back to try their other seafood and chicken items followed by their great looking desserts.",
    "rating": 4,
    "rated": {
      "funny": 25,
      "useful": 32,
      "cool": 27
    },
    "photos": [
      {
        "img_id": "eoGHCasoKJuC7jTVuiKxOQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eoGHCasoKJuC7jTVuiKxOQ/o.jpg"
      },
      {
        "img_id": "FYZ6EjWx11nmnZjVkw3yow",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FYZ6EjWx11nmnZjVkw3yow/o.jpg"
      },
      {
        "img_id": "61qq0KczlqiNtBW9NhM7iQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/61qq0KczlqiNtBW9NhM7iQ/o.jpg"
      }
    ],
    "user_id": "0juzbrgcLHqobdK-OZAyiw"
  },
  "AX1392eeklarWqNLbkOKLw": {
    "date": "9/23/2017",
    "text": "Took my boyfriend on a tour of Cuban sandwiches places in Phoenix! This was his favorite. Traditional, delicious Cuban food. We loved it. Such a gem.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IIsNM0E76BkRKMeuo_sL4Q"
  },
  "9BeUlaDI6tq1_wGmsyvudg": {
    "date": "2/17/2017",
    "text": "Great authentic Cuban food. The place is small but has great service. They also have bakery treats to buy. I recommend the Cuban sandwich and la senortia for dessert. They also do catering. We have used them several times for parties.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "aHbgAcqJTAY2TGae_SG0pQ"
  },
  "J0ZOPwwAXRE-TiSfX4EzTQ": {
    "date": "2/16/2017",
    "text": "Great food and the service, while lacking a bit before with the two young girls, is fantastic and has been fantastic now for some time with the young man becoming the main waiter in the restaurant.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "8nLpoP3bmsr5tjeTIgv3Tw"
  },
  "OSwEe8uDhWVIOWITZWyM2A": {
    "date": "6/13/2017",
    "text": "Never had Cuban so can't comment on authenticity.  What i can say is my Cubano sandwich was both humongous and delicious, and the pulled beef dish my wife got was pretty good too.  The cake with flan on top was bomb, and service was grear.  Look forward to going back to try something else.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1iO70fabuVpCYcOXVq1Ejg"
  },
  "0O9vC-VA8yEPz_-wW_p18A": {
    "date": "10/24/2017",
    "text": "Always in search of good Cuban food, we gave the Cuban Foods Bakery a shot. We ordered the Beef Empanadas, Croquetas de Jamon, and a Media Noche'.  The place is clean decorated , the owner was friendly, they could use a bit of background music to add some ambience.   The Media Noche' was spot on delish  and huge. We shared the sandwich and could not finish it.   The cafe con leche and guava pastery was very good, all the pastries in the case look awesome. We will definitely give them a try again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wgE_O0Ek_Yfq_Slg1LMv_g"
  },
  "fO5qexfHJ5r1ImR47zNVWw": {
    "date": "2/4/2016",
    "text": "Authentic Cuban food. Makes me feel like I am in Miami again. If you want Cuban bread get there early in the day, it goes quick. Their Media Noche sandwiches and the Cuban sandwhich is a must to have.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "cKfzz2b6npizs3OCnSY6cA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cKfzz2b6npizs3OCnSY6cA/o.jpg"
      }
    ],
    "user_id": "C1u8tkqX3X7nPB3tjKCqXQ"
  },
  "aStSAWY79AgkwZGTFXvX_g": {
    "date": "7/13/2017",
    "text": "I have been looking for a Cuban restaurant for a while now. I had the empanadas and black beans. The meat in the empanadas was a little too salty for my taste, the beans were good. They are not refried black beans FYI. The place was clean and the staff I interacted with was friendly. I would definitely go back and try other items.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2oh3TW6eiLC-YJoZwTSgPg"
  },
  "opCxt6rwWn_ZgkhY8lk-Ag": {
    "date": "3/20/2014",
    "text": "Cuban Foods catered my sons birthday.  Seriously the most amazing Cuban restaurant in Phoenix, AZ.   They made the birthday cake, tres leches with guava filling, probably the first time we didn't have left over cake.  Can't be compared to Havana Cafe, which in my opinion is overly priced.  Want the real stuff come to this place instead.  You won't be disappointed.   THANK YOU THANK YOU THANK YOU!!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "6hvXN8CakQFv1erYThL0IA"
  },
  "thgHTY84z1Lgg6-if_u-bg": {
    "date": "3/23/2014",
    "text": "I am originally from Miami, and one of the things I miss most is the Cuban food.  I've finally found a restaurant with the authentic flavors I remember so fondly.  This was our first time here, and I know it won't be our last.  We shared the papa relleno appetizer, which was delicious!  I had the ropa vieja with congri and sweet plantains.  Everything was wonderful!!!  My hubby had the Cuban sandwich.  He really liked the sandwich, but said the bread was too hard and crumbly.  I was also a bit disappointed that they had run out of the ham croquetas...one of my all-time favorites.  Other than that, this place makes me so happy!  I can't wait to head back for some more!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "y5Ak9VZeYWjaX52lb1hjXQ"
  },
  "aXj_FpF22lge9AGnSSDOXQ": {
    "date": "5/14/2017",
    "text": "Stopped by because we were in the area. I ordered a Cuban sandwich. Delicioso!! Loved it! next time I'm in the area I'll stop by again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1zYHPDFKFtl1xpxYbzkqPQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Delicious Cuban sandwich.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1zYHPDFKFtl1xpxYbzkqPQ/o.jpg"
      }
    ],
    "user_id": "yVZ2_9CeX1FhAhTHKuv7PA"
  },
  "eDb45fgudPoGQ7wLKdHlHQ": {
    "date": "1/15/2018",
    "text": "The server was very nice and knowledgeable. He recommended a few signature dishes that were delicious. The food and pastries were amazing. I would definitely go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xvOc8iRZvGy7Pax1TqhvFw"
  },
  "gP40qo5lHTI4D0WTjlO34A": {
    "date": "5/7/2017",
    "text": "Great food, atmosphere to relax and enjoy the food coupled with good service. Loved the food and to end with the Cuban espresso coffee. Only if the distance wasn't an issue I would have there everyday",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_tbxzHm0wGuY21zOsN1yPw",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Cuban espresso coffee",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_tbxzHm0wGuY21zOsN1yPw/o.jpg"
      },
      {
        "img_id": "L8k1JapdrlR6s_mDy4W_zw",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/L8k1JapdrlR6s_mDy4W_zw/o.jpg"
      },
      {
        "img_id": "YnySKjDtEuQogOLGktgwcA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YnySKjDtEuQogOLGktgwcA/o.jpg"
      }
    ],
    "user_id": "aq_ZxGHiri48TUXJlpRkCQ"
  },
  "P_P7-AMtmmE4uAf0wBhT3g": {
    "date": "5/27/2017",
    "text": "Food was delicious. Hubby had sandwich that was so full of flavor. I had pork dish, fantastic. Portions are very good size. The service was awesome and friendly. We will come back soon. Was not crowded, but had a steady flow of people coming and going.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Zxw6qLpLSi4futTo7-L3mQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Was Totally awesome!!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Zxw6qLpLSi4futTo7-L3mQ/o.jpg"
      },
      {
        "img_id": "p6vlNe5j7zvHZi4onRnzJQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Delicious!!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/p6vlNe5j7zvHZi4onRnzJQ/o.jpg"
      },
      {
        "img_id": "Oeq8Sc_CMuSXQHOCkXDEDA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Oeq8Sc_CMuSXQHOCkXDEDA/o.jpg"
      }
    ],
    "user_id": "XIsQLB6BaZXJxluMwgRafQ"
  },
  "Rlt9Tx9mkYV2lubZ_hliqQ": {
    "date": "2/8/2018",
    "text": "A review from a very fussy person.   The place is clean. The tables were picked up immediately after patrons leaving even though there are only 2 people here. One waitress, one cook. And they help one another.   Staff is welcoming. The waitress greeted me and took my order quickly and answered all my questions. Service was also speedy. Checked on me several times.   The food is great. I ordered yucca frita, which was fantastic!! I got the Cubano lunch special which included fries and a drink for $9! And the sandwich is a substantial size. I loved it with exception of the bread beating up the roof of my mouth. The roasted pork in the sandwich was soooo delicious!!  Plenty leftover. I also ordered flan with cafe con leche. The flan was delicious but the cafe con leche was just okay for me. I also ordered a couple desserts to go. I'll follow up with those.  Definitely will be back when I'm in the neighborhood. So sad I live all the way in Surprise.   Pay no mind to lesser reviews and come give the place a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0PXQnAiG4pJp7CAzkiozPw"
  },
  "2SXkPCHvpD-5KefHvEhvkQ": {
    "date": "3/3/2017",
    "text": "Came here and was craving a good cuban. Ordered the croquettas and a cuban sandwich which came with fries. The croquettas were pretty bad, they werent really fresh and werent crunchy on the outside which is a dealbreaker for me. The cuban was sub par, the bread was the best part though it was definitely fresh but the taste was lacking.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QXlKsOkGLC0do8evZcgpIA"
  },
  "SDO1g1GZu4Ro95EcYwPhCg": {
    "date": "2/1/2018",
    "text": "Honestly, this place is the best Cuban food in the area considering there is no other options. Unfortunately I just sat there for over half an hour waiting for my meal...... To find out that it never got placed and now their closing in 10 minutes. So in the end I had to watch my friend eat his meal while waiting for my dinner that never came.  Horrible customer service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EAEFq_Eq82zUJI622hL2kQ"
  },
  "h4Lf_VCAYr6k2bnlAFZnbg": {
    "date": "6/24/2017",
    "text": "This is the best Cuban restaurant in all Phoenix. Food is so delicious and the service is excellent. Could not ask for a better Cuban restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9Ec344Gxz4WIrE8c5zb9LA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9Ec344Gxz4WIrE8c5zb9LA/o.jpg"
      },
      {
        "img_id": "dFziwBuFnQj5FEhtsQRPiA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dFziwBuFnQj5FEhtsQRPiA/o.jpg"
      }
    ],
    "user_id": "LRHqEoa2R2P40210ZS3jVw"
  },
  "H3mTPso1EVZeRm3KcBqaDA": {
    "date": "2/1/2018",
    "text": "This place is very good, the only bad thing is the waiter omg he is sooooooo slow and to distracted. Other than that every tastes good",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N9XLVG3MtIiV8ksdtPyewg"
  },
  "nkmuE8Ocx9JzX3I4rXipAQ": {
    "date": "8/6/2015",
    "text": "Like most Americans, I've never been to Cuba in my lifetime.  And until recently I never suspected I would.  But like many Americans I've always had at least a passing curiosity about our neighbors just 90 miles south of the Keys.  Cuban culture (as with many cultures) has been quietly influencing American life in subtle but noticeable ways from music, to the classic car movement, and yes even the culinary arts as well.  Admittedly living here in Arizona means we don't encounter much in the way of Cuban influence, much less Cuban cuisine.  Havana Cafe was widely regarded as the Cuban culinary staple of the valley for many years.  Sadly, Havana Cafe closed its doors earlier this year before I had a chance to take in the experience.  That leaves maybe 3 Cuban restaurants left in the valley that I'm aware of.  And the only one in the city of Phoenix is Cuban Foods Bakery.  I came here for lunch on a Thursday to try and finally get a taste of what so many chefs and food critics were raving about when it came to traditional Cuban cuisine.  In the end, I arrived a novice and left wanting to do the cha-cha.  Located in a strip mall on the northeast corner of Peoria and 43rd Ave, Cuban Foods reminds me a great deal of the setup of the recently defunct Latin American haven Mi Comida.  A simple table and chairs place with a few native emblems on the wall, but little else in the way of aesthetics.  There's Cuban music playing in the background to lighten the mood and the placemats are a bounty of color for the senses.  I got here right at 11am and was their first customer of the day, but the place filled up for lunch shortly thereafter.  I counted 6 tables with 4 chairs at each so room for 24 here max.  There was just one waitress on duty and she was delightfully friendly and helpful.  I knew some of what I was getting for lunch, but she helped me with the rest.  I decided to start with a menu item that enticed me right away.  The Tostones Camarones.  Four green plantains made into little bowls and fried, then stuffed with shrimp covered in garlic sauce.  Wow, wow, wow.  This is an appetizer that eats like a meal as the cups were each packed full of shrimps (at least a dozen in each cup) and the texture of the bowsl were soft on the inside with a nice crunch on the outside that absorbed the juices beautifully.  Still craving more authentic Cuban cuisine, I went with the standard Cubano sandwich (note: they discount the sandwich at lunch and include a free choice of canned soda, of which I chose an orange Fanta).  Roasted pork, ham, pickles, Swiss cheese, and mustard on Cuban bread.  If i had to describe the bread it would almost be like a kaiser roll in panini form.  Unlike most panini sandwiches, the interior of the bread maintains its chewy texture while the outside retains the crunchy notes.  I can see why the Cubano is a staple of most every Cuban establishment.  Fantastic meat flavors densely packed together with the condiments.  And surprisingly it didn't taste as heavy as I expected.  Despite already being full, this is Cuban Foods \"Bakery\" after all and the bakery display case was packed full of tasty looking desserts to try.  I asked the waitress for suggestions and after some back and forth, we settled on a dessert that almost acts as two desserts in one.  A slice of their Tocinillo del Cielo.  While this dish literally translates as \"Bacon from Heaven\", there's no actual bacon in it (though using bacon as a description is always endearing in my book).  There's two layers to this version.  The bottom layer is a moist white sponge cake while the top layer is a flan-like pudding.  A deliciously smooth, creamy and surprisingly light dessert.  Every dish I had was so phenomenal I could basically care less about how crazy full I was.  Total cost for all the food, plus the soda, tax, and tip came to $23.  Great prices for the amount of food you get here.  I'll be back in the near future to dive further into more delicious Cuban cuisine.  Its a shame its so rare to find a Cuban spot here in Phoenix for a cuisine that's so widely respected.  Hopefully as relations thaw between our two countries and there's a more open sharing of cultures and traditions, we'll see an even greater influx of Cuban treasures into Arizona and beyond.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "L-kXLfQ10Y05VyRXNM--Dg",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. The interior from the corner off the restaurant.  Went from this to nearly full within 30 minutes at lunchtime",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/L-kXLfQ10Y05VyRXNM--Dg/o.jpg"
      },
      {
        "img_id": "6PJtIIgrHfat2Y07d9dkqQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Cubano sandwich comes with a free canned soda at lunchtime (Orange Fanta for me)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6PJtIIgrHfat2Y07d9dkqQ/o.jpg"
      },
      {
        "img_id": "FJNotMasdaVfejeIB7Ni-A",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Shrimp Tostones.  Fried plantain cups of awesomeness",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FJNotMasdaVfejeIB7Ni-A/o.jpg"
      }
    ],
    "user_id": "WMMI5Q4Rmm1Rqdu0jOvyhQ"
  },
  "G2Oi-yUjfFgK4IjlkMtq7w": {
    "date": "10/15/2016",
    "text": "Great sandwich. Lots of flavor. Toasty without being all greasy. The plantain bowls with beef are crispy yummy little bites. The tamale was very flavorful but it was cold in the middle. Could have used a little more time in the oven. Really nice people. Popular place. Lots of people stopping by for takeout.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "NjiwjXUunEJ5m5XuY1BftA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Plantain bowls with beef",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NjiwjXUunEJ5m5XuY1BftA/o.jpg"
      },
      {
        "img_id": "eDV3txsSaDquV75mIeXDcA",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Cuban sandwich a tamale and plantain bowls with beef.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eDV3txsSaDquV75mIeXDcA/o.jpg"
      },
      {
        "img_id": "YjkI9LqBjtvqU2nsASoISQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Cuban sandwich",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YjkI9LqBjtvqU2nsASoISQ/o.jpg"
      }
    ],
    "user_id": "WEBwx7z38jvFmH0B4yC-qA"
  },
  "HvBdun8ozDQdqvyo_7Xb2A": {
    "date": "1/27/2018",
    "text": "I'm a born and raised in Miami Cuban and this place has the most authentic Cuban food I've had outside of Miami. The service can be a bit slow but the food can't be beat.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DdjGFW92zNEiqi_reDh4GA"
  },
  "jHIMla6F26LP0AAMzwcXJg": {
    "date": "8/6/2016",
    "text": "This is a cozy place perfect for a nice lunch! There is one server and one cook...take your patience with you but it is worth the wait.   The Cuban sandwich is the best 7 dollars I have spent in a long time...the pulled pork gave that sandwich an amazing flavor. The food was hot and delightful, they also are a bakery and the cheesecake is very good to be honest it's about as good as Cheesecake Factory's!   The authenticity of this place is what I truly loved the Cuban coffee that they freshly brew! With Cuban roots in my family this was a piece of heritage I will revisit.  If you have kids make sure they use the restroom before you go because this place doesn't have a restroom...but one can always walk across the parking lot to Jack in the Box and use the restroom...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "PtatC0CZYQ1VTxoa3loPUA"
  },
  "IFKsbXjdKd0_70Tsaa1bqw": {
    "date": "8/11/2017",
    "text": "Horrible food, horrible service! We found  a hair in the rice!  And the owner would not even discount the dinner after we sent it back.  They are understaffed, and who does work there can't even speak or understand English! If your looking for True Cuban food I would PASS on this dump!!!!!! Dirty too no hand soap in the bathrooms so how are the workers washing there hands after they go to the restroom?!  I wish I could give this a Minus star, doesn't deserve a forth of one!",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "l13dhFSE3rD02ca3MjOn_A"
  },
  "2b2P-hh3a5THzv3KlPC-wQ": {
    "date": "4/22/2018",
    "text": "If you've never tried Cuban food, this is where to start. This place is dynamite. We love the sandwiches, they are all amazing. And the desserts - wow! Tip when you go - skip the fries as the side for your sandwich and get the rice and beans.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EfCzTvQz_jgsihQPHX9aRw"
  },
  "NFpUGWhJ-bQYWZ27nl0WZg": {
    "date": "5/27/2015",
    "text": "Living in Tucson, Cuban food is nonexistent. Any time I'm traveling through Phoenix I try and make a stop at some type of Cuban restaurant. This one has become my favorite. It's located in a strip mall so don't let that discourage you, you will not be disappointed! I usually go for the beef bistec empanizado which comes with moro style black beans and rice. The portion size is huge! Definitely shareable if you're not too hungry. I've also tried the papa rellenas and croquetas de jamon which are delicious! Small little place but the food is awesome!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "EfmhDdJbTwdlneoh0OdArg",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Beef bistec empanizado with croquetas de jamon.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EfmhDdJbTwdlneoh0OdArg/o.jpg"
      }
    ],
    "user_id": "ewUV7K4JHnUj40Aj5YYXAw"
  },
  "mj-HDMEBtyfuhQJlmNs0Xw": {
    "date": "10/3/2017",
    "text": "The food was really good, but the desserts were phenomenal!! I went on Saturday.. Already went back for more dessert... It's only Tuesday.. Pretty much obsessed at this point.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZKr05Nstlq5naHmPJyP6NA"
  },
  "vXfCQQDhXgLf-TjAUVDt_g": {
    "date": "12/28/2017",
    "text": "i had a customized vegetarian sandwich that was good but not great, the fries were alright but the cuban lemonade was bomb!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "egne1wJ4cvDwr6HBip0XvQ",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/egne1wJ4cvDwr6HBip0XvQ/o.jpg"
      }
    ],
    "user_id": "WKLxhES9EfJYnp3-LUDihA"
  },
  "swyfH8YCp9eNE4hQ5a9GRg": {
    "date": "12/27/2017",
    "text": "It was very clean and nice the service was great and the food Porsche dealership and deserve to die for",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bjKODIrqadMqSSHcQUmc9g"
  },
  "_IFfYHKaGPTAdpOMzb__OQ": {
    "date": "3/18/2015",
    "text": "We decided to try this place out based on the great reviews on Yelp. Upon entering, we were greeted immediately as we walked in and were handed menus as we sat. Despite our group of three being the only ones in the restaurant, it was about 10 minutes before the lady came back to take our order. I ordered the Sandwich Cubano, my hubby ordered the Ropa Vieja, and we also ordered the empanadas. It was about 20 minutes after ordering that our food finally came out of the kitchen.   My sandwich was good. The bread was thin and crispy, and the pickles added a good bit of saltiness and crunch, but it was a little on the dry side and probably could have used a little more meat. The Ropa Vieja was very good. The meat was tender and flavorful, and the mole sauce had a nice smoky flavor. The empanadas, which were listed in the Appetizers section of the menu yet were the last plate to come out, were okay. They were a bit dry since it had a lot more breading than meat.   Overall, the food was decent but the service was a bit slow. We came for lunch during work and probably won't again as it took so long. Their pastries, however, looked good in the display case, so maybe we'll come back to try those.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Q108aQkZydbu8SUatPo1Mg",
        "caption": "Photo of Cuban Foods Bakery &amp; Restaurant - Phoenix, AZ, United States. Sandwich Cubano in foreground, Ropa Vieja in background",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Q108aQkZydbu8SUatPo1Mg/o.jpg"
      }
    ],
    "user_id": "4UHF1QZSjG3avCAc5ZGt_Q"
  }
}