{
  "TML4NE3X8nslMNkPV9lXBA": {
    "date": "2/9/2017",
    "text": "Can't say enough great things about this place.  Regular quesadilla is made with homemade corn tortilla. Supreme quesadilla made with flour. Authentic Mexican rice and beans. Carne asada corn tacos on point.  Had a great night with the family!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "mDbNVcGbc551y4CEF0KuMg",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Carne asada tacos on corn tortilla",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mDbNVcGbc551y4CEF0KuMg/o.jpg"
      },
      {
        "img_id": "XE_x3G65k2UwWKSEY3ZP9Q",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Supreme Quesadilla",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XE_x3G65k2UwWKSEY3ZP9Q/o.jpg"
      }
    ],
    "user_id": "HZ0IXNDj0FPt1Dy_gU3t9Q"
  },
  "HYkZ81ifMK4pC63wKpnv4w": {
    "date": "5/23/2018",
    "text": "To the owners of street taco I want to express that Im extremely  disappointed about the cost  and portion size of your cheese quesadillas for a fast food place this should cost $1 I will tell you why and and the extremely rude customer service from your cashier /cook who handled our cash with his cooking gloves. Tonight we stopped by tonight around 11:30 after driving 6 hours from the grand Canyon we odered the cheese quesadillas for $4 we were expecting a large folded flour tortilla the same size as every other taco restaurant because we were starving.  The worker gave us a flour tortilla the same size as a corn tortilla because we had also ordered  corn tortilla tacos. I returned the quesadilla because I wanted more for my money the guy was upset.  After leaving and parking on the side of the building the worker started yelling at me you need to listen get out of here or park somewhere else I told him he doesn't have to be rude. I guess he was upset that we didn't agree with the size and cost of the quesadilla. We shouldn't have to be mistreated just because we feel it was a rip off about the tiny over priced quesadilla. If you change the portion size we will purchase 1 in the  future.  Also your cashier/cook was wearing cooking gloves when taking money. Im bringing this to your attention because this can make people sick and possibly shut your business down. Tell your employee he does not need to  yell at other customers when its not necessary. If you look at the camera you will see all of this. You can also read this review on better business borough website.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "kHXGAlH6h6jY52mn6SSBDA"
  },
  "OmGoP5fSyubRCgp4DYC2Aw": {
    "date": "12/24/2017",
    "text": "Awesome food in an open air environment.   Food hit the spot so we ended up having seconds even though we were filled up.  Worth revisiting.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R_73e8-GQvteUJ4ed3RDPA"
  },
  "c3XmSRn6K9y-ShGY2-lXmA": {
    "date": "1/8/2018",
    "text": "Amazing food and amazing service. The steak and the chicken taco was full of amazing flavor. The toppings offered are just as good. Be careful with the red hot sauce. It will hurt you. Can't wait to go back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6um-NM4GBw_IOA7ycPLT-w"
  },
  "1-65Cb0Ps_ZiHdLMQE0XpQ": {
    "date": "8/24/2018",
    "text": "Food was great and delivered quickly. Very accommodating via the phone as well. Had difficulty via Internet but I called and got it resolved quickly. My rating a 5 star",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lEAh35U-0eU0pdd58QAXzQ"
  },
  "mFd9lZ0P-v64eWSPovhkjQ": {
    "date": "7/5/2018",
    "text": "This place is great!!  Arrived last night and asked our driver where to get some food and he raves about this place .  Said no where else!!  He was right  the tacos were spot on delicious .  One if the best street tacos I had in a while. And the price is right.  Definitely will be back .",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zhxPD6ylAu9Ik1vsYlnhEg"
  },
  "zbr2ZkbZK5q9h8iIvjpuiw": {
    "date": "10/8/2015",
    "text": "Taco, Burrito, What's that in your Speedo?  Oh wait, sorry different gig.  Simply put THIS PLACE IS AWESOME.  24/7 tacos?  I'm in love.  I wasn't looking for a big meal and found this place which isn't much to look at from the outside.   Basically it's a trailer with a sun shade and a few benches.  Very simple menu tacos, burritos, quesadilla, beef or chicken.  I got 4 tacos (2) beef, (2) chicken.  The young lady asked me if cheese and guacamole was OK?  Damn right sister!!!  Anyhoo, they have a fresh salsa area with homemade salsa, and pico all were great accompaniments to my dinner.  Tacos were wonderfully seasoned and well put together.    Excellent food at a great price!!!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "-rlIN1BFK65MyHWt_HhPJg"
  },
  "BuGh6DSL977SJib3Hfs5WQ": {
    "date": "12/2/2017",
    "text": "Do not let the name fool you, this place is absolutely gold! I was staying in a hotel in downtown Phoenix, and decided to have the Supreme quesadilla! Hand, order the steak one, it is absolutely freaking divine! Great service even doing Uber Eats this quesadilla was the bomb! Not sure about all the other stuff, but if the quesadilla is any indication of what the rest of the stuff is, it is going to be super 5 stars!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hNPBrqCY_YQrNNzrxrs4rQ"
  },
  "s7gJ33R4ZbeWD9_5cqTeNQ": {
    "date": "9/14/2016",
    "text": "Delicious, albeit high falutin for a street taco. I'm from LA, so I expected my carne asada to just be beef, onion and cilantro. I ordered two carne asada tacos- one my way, the other standard to Speedy Taco...  Good... GOD! That jazzy up taco was delicious!!! Especially that pink thingy stuff (i'm guessing a pickled onion, but thingy stuff sound more legit to me) and the sauce... AND they're 24 hours?  Lawd, you brought a piece of home to here... 24hr access to good tacos...  I want to take amount to bow my head in prayer to The Great Taco, he who anoints us with gauc and sour cream and supplies a bountiful bouquet of Pico de gallo  y cilantro. I pray to you Great Taco, and to your son Burrito and prophet nacho...  ....Nacho cheese",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "JLByUUPnmBItyImtnZjPKA"
  },
  "x4wORN50YgDPhGXqzHuiyA": {
    "date": "10/8/2016",
    "text": "Ordered through Uber eats and this was delivered to my room.  I got one beef taco and one chicken taco and got the rice and beans  The rice was incredibly soft and flavorful and the beans were amazing  The two tacos were outstanding and the onions that were with them were amazing   Delicious",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "aWHk311cglFKatxFXelRNw"
  },
  "WYx2Rta0GW_5sF9Tjv06_A": {
    "date": "11/10/2017",
    "text": "Tacos were ok, not worth the 2.75 price tag. I can get better tacos for $0.50 at home.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dp4DKgR4tXrBg0gxCKslbw"
  },
  "vQMmpn-ROwx0XNupau1sSA": {
    "date": "7/8/2017",
    "text": "Simple, fast street food for relatively cheap. We eat breakfast here every Saturday, their breakfast burrito is quite satisfying and I love the pickled red onion.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GHZxQd5yJwpL16kmqQs9Lw",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GHZxQd5yJwpL16kmqQs9Lw/o.jpg"
      },
      {
        "img_id": "95uH6mMRXOGvtBxeu0sKjw",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/95uH6mMRXOGvtBxeu0sKjw/o.jpg"
      }
    ],
    "user_id": "-JO8ReHdLDIeLVP8dvAZaQ"
  },
  "MQIfSLM_cTU6ufD3vGTZXA": {
    "date": "6/16/2018",
    "text": "Very greasy and borderline inedible! The rice was very good, but everything else was disgusting! I gave the food to my dog. I won't be returning. It's also in a very bad area with homeless people sleeping in their parking lot. I know that they can't help that.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g9LWd2h93-JQnDxfe0pxVw"
  },
  "r4ul7whoQBiRQC6Mg_MAWw": {
    "date": "11/15/2017",
    "text": "I tried the Chicken Burrito and it was really good. I'm docking it 1 star just because even though the place was empty except for me, it wasn't really pleasant to sit or eat when there is a lot of garbage and dirty tables. I was there on Nov 12th 2017 around 4pm.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "94mF8GhkBM-eDx8OgrLWGA"
  },
  "wVek8apWVEv0UH1Jc7xWvQ": {
    "date": "4/3/2018",
    "text": "Previously this is one of my favorite spots to get some carne asada. The food is still good but it is no longer a Charming place. We had catering from here recently and due to some faulty catering irregularities we were given a gift certificate for certain small amount. Of course the person that handed it to me is not there when I come to use it next time, so I spend 20 minutes waiting on them to validate the gift certificate. This is about four times as long as it took to make the food. So you pull up in a good car in nice clothes from work and you're treated like a suspected scam artist. There were also no pleasantries exchanged they did not thank me for coming and they did not treat my gift certificate as if it were cash. It was basically take your food and get out of here. While they are validating the gift certificate over the phone with the shop management I am left standing at the window. If you're going to issue gift certificates that are that hard to validate you need to find a better way.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fHURTD4tjpsEG0y_JixvXw"
  },
  "BcAE__pebeHv5JprNT8fQQ": {
    "date": "8/12/2018",
    "text": "The food is great and they always make your orders very fast. However, the speed of the orders sometimes, makes them more prone to giving out inaccurate orders. Still a very good spot to eat. I'd recommend eating there, rather than going through the drive through.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qMvVX3lG136Q8CqF8YkpBw"
  },
  "jnAUnt0CufQIs5PfZnbeWw": {
    "date": "11/29/2017",
    "text": "This is my favorite place to get tacos EVER! The salsas they have are great, the tacos are amaaaaazing! They burritos are delicious. I absolutely love this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gxhMgbBjF4H8Xw7ubKlpeA"
  },
  "S9-1b6foKrBSLAyUiTZiuw": {
    "date": "8/12/2016",
    "text": "So, one day at work a couple of weeks ago I was craving street tacos. Ended up finding this place on Yelp, and was very impressed. It is literally a shake on the side of the road, but the food is very authentic and tasty!   I ended up getting two carne asada street tacos and a steak quesadilla. They were out of black beans (bummer), but they gave me an extra side of Spanish Rice. OMG, so good!  If you're looking for awesome tacos, this is your place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "QRpPGyerU9peFj3_VvdhwQ"
  },
  "4UUZCKtKV_lCSiz-ULYQiA": {
    "date": "11/23/2017",
    "text": "I went out of my way to find this place, and I'm glad I did.  The food was very good, the truck owners were very nice, and the value is outstanding.  I will absolutely come here again and definitely recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SinTis0aUVfYauPDS9ajUw"
  },
  "VLP_fKlpJ5zMEV2P0K2Fow": {
    "date": "11/22/2017",
    "text": "Amazing flavors on all their food.  Right across from the swap meet.  Their food is authentic and amazing.  Outdoor dining only.  Dont judge the book by the cover.  It is well worth the stop.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KFgHqDWKLigqOOdQ1o3J0A"
  },
  "9Uu6wdn4PZIqbEUj0Z_nRw": {
    "date": "10/29/2015",
    "text": "Stopped in today for the first time and got a carne asada taco and quesadilla, let me just say that I will definitely be back. Prices are inexpensive and the customer service here was great! Thank you Speedy Street Tacos! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pVkFYi11uujrXp8fENUZGw"
  },
  "3D51HIwZYopOTzG2-R6-2w": {
    "date": "8/31/2015",
    "text": "Highly recommend the Carne Asada tacos.  Best tacos I have ever had.  Skip the chicken tacos (lacking in the great flavor that the steak tacos had).  I plan on returning for at least one more taco while in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B0v3A3zaZoXpUnaHH4hExw"
  },
  "yundiZJwQSjnYK1YueY6Lw": {
    "date": "1/10/2018",
    "text": "\"Not So Speedy Taco\"   This place is mediocre at best. If you're unfamiliar with the area this would seem good. It's mostly toppings and not very much meat.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "BelwbH0s_tZy-3pO7OyXGQ"
  },
  "DZ_yEuKDNoMmI96WquO0Pg": {
    "date": "10/8/2018",
    "text": "Food was okay according to my husband. But the location is so run down and dirty that I couldn't bring myself to eat it. The guy that was preparing the food wiped the sweat from his forehead and then continued. No thank you.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6XmWvXrEzKVqo-vCIe1RKQ"
  },
  "FbYSzvmgC7dMzJHJz8v4Ig": {
    "date": "10/30/2018",
    "text": "The corn taco was soggy and the meat tasted burnt. Not exactly the street tacos I was expecting. I'll have to keep looking for a good place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yo5waa_ZKRRJ2fHvW9ClUw"
  },
  "JmWKUg3cy6Y84hOGDR7SeA": {
    "date": "7/10/2017",
    "text": "Chicken and Beef tacos so yummy!!! I would probably just stick with the carne next time!!! $11 for 4 street tacos.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "9Jpq9Rtg6xx3nisN-FgGFg"
  },
  "diNhhVIM6sVCNk-gLvhsGw": {
    "date": "11/21/2018",
    "text": "Great place with great price.. staff is friendly and tacos were greatttt.. I like this place will definitely come back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a3b-sWFFuq61K1gSxkw8Kw"
  },
  "4Y8-lNexSozSJYPn7ynR5g": {
    "date": "1/26/2018",
    "text": "Cold beans cold rice and cold burrito.  It still took 15 min and I was the only one in line!   All was paddled out of a pre made bowl.  The meat want even but on a grill to warm up!   And I had to ask for my drink.  Pass",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rG0qL4k3R9JnYBxqKoHBXA"
  },
  "UKWIWn6LuNfcw05ZJF65hQ": {
    "date": "3/23/2019",
    "text": "The food does not disappoint! We got home late and this was the perfect place to stop tacos and quesadillas were so favorful. I got the tamarindo bebida.. deliciosa!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7z_3u497MrHaG5eftL5Cjw"
  },
  "iPJSKjqo4n6cqijUuEjx2g": {
    "date": "9/24/2018",
    "text": "May not look great for location but the food is worth the stop.  We did two steak tacos, one chicken taco, and steak supreme quesadilla which were all amazing",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fxZ86VG2FrXyGpGuhv77DQ"
  },
  "Yo6-VJcDnUO1IXiybDgSeQ": {
    "date": "4/14/2019",
    "text": "First and last time!!  Ordered a carne asada burrito, the meat was so chewy.. The place looked so dirty I was legit scared to eat the food.. Just as I expected a few hours later my stomach was so messed up. I'm currently sitting on the toilet writing this review bc I haven't been able to get up..",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n_Di9n3aXAskZzgmLspR5Q"
  },
  "_JCtB2c7dQiWe54j6B8UJQ": {
    "date": "1/14/2018",
    "text": "Used to be my favorite place to get burritos because they tasted so good and were decently large for the price. But lately the burritos have been getting smaller and smaller.  Back when they first opened, the burritos were about the size of a 20oz or 33oz bottle (depending on who worked that day) but lately they've all been ridiculously small, around the size of a 12oz bottle, and just now I got one that was no bigger than an 8oz can of redbull. Yet they have the audacity to change the same price.  I have been going here since the day they opened because I work across the street and on Sundays it is my only option for food. But at this point I'm just going to go hungry because they have really angered me with their shrinking portion sizes.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IS6qnXjMSoaw-34hta0Nyg"
  },
  "x2f9EFOHuNS_VKmtMX8sDQ": {
    "date": "9/2/2018",
    "text": "Steak meat is great. I've been here many times but the red salsa recipe has been changed recently. It's now super hot and the flavor is somewhere between bland and awful. I've been to all their locations. Same gross salsa. The salsa was good before. Why change it? For this reason, you have lost my business.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1YUy1Cl3d0iaBz8N0PEcnQ"
  },
  "-nbj84K1Grhr7O8BJoOXMA": {
    "date": "9/25/2018",
    "text": "Best breakfast burrito I've had hands down I waited an hour for delivery but Gdam it was worth the wait exactly as if it was made at home",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ncQu2YmhUMTcHbTNqNjS4g"
  },
  "Ixk7YYkXPpsPO40aP_2xXw": {
    "date": "7/25/2018",
    "text": "Best tacos in Arizona thus far! No complaints what-so-ever. Good food with a good price",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "er79DWPoou0a2fTc7NIw1g"
  },
  "ykknY9X1CxHqjyuKsMeJeg": {
    "date": "9/6/2018",
    "text": "Been in Arizona visiting a week and tried different food places . Restaurants and fast food but this has been the best at customer service and the best at taste. I'll be back for more .... got the chicken tacos and chicken burritos",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "npI1LSh-988XLGkDytR8Dw",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/npI1LSh-988XLGkDytR8Dw/o.jpg"
      },
      {
        "img_id": "TvCNLfn7f4IKFDIaeINWYg",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TvCNLfn7f4IKFDIaeINWYg/o.jpg"
      }
    ],
    "user_id": "25yk1Hmy5kRpQAFTZtLPAA"
  },
  "GNa8RY8bjmveoF1_ZLOSVA": {
    "date": "6/6/2018",
    "text": "I can not say in words how much I LOVE this place. Breakfast burritos are amazing. Tacos are AMAZING. Green and red salsa- amazing. Absolutely love their rice and beans. I eat here multiple times a week.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gzJvUVgknC96mobK_c4Pdg"
  },
  "9nbMnHxXBPyQO-m-nh2V5w": {
    "date": "12/7/2016",
    "text": "When you're in a rush to head back to the airport, this is the closet taco shop and it's speedy.  Their restaurant name don't lie.  It's definitely a speedy taco spot. You order your food and receive it ten minutes later.  I got a chicken burrito and my fiance ordered a beef burrito.  Their sauce was good which complimented our burrito as well.  The only downfall, at night it looks like a shady taco shaft.  Well then I call this place a hidden gem!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Gdzqo32xFRrHF2-27FW7vg"
  },
  "5WECXJCCIYUAKU7CcC8YZw": {
    "date": "1/3/2018",
    "text": "The menu is simple... quesadillas, tacos, burritos. I like that they stick to what they know instead of trying to be diverse and then things get inconsistent.   They grill the meat outside on a grill and you can really taste that It is fresh. The tacos always come out hot and delicious - it's really consistent. The red & green salsas are both amazing. The one thing I do wish is that they would have chips... but won't stop me from coming back. The price point is great and if you're just looking for some quick, inexpensive tacos, this is your place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zo1-8IQIt75w6jM0pyX5zg"
  },
  "Fv6mxHcwTysyKgo18-ERKg": {
    "date": "7/17/2018",
    "text": "Very salty tacos couldn't even eat them...not impressed even the quesadilla tasted salty ... the only thing good was the salsa ..",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jN9jP0i4x--ezm3OmLuvKQ",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jN9jP0i4x--ezm3OmLuvKQ/o.jpg"
      }
    ],
    "user_id": "dsy17GrgnceQlUUW7KzZCQ"
  },
  "kQPfb9TMO3eLc7iu3l7Fqw": {
    "date": "3/9/2017",
    "text": "We were looking for a quick bite to eat during our lunch break.  I love to try out new spots so we did a quick Google search of nearby tacos and this place came up.  It is very small little cart out front of the animal welfare league.  When you get out of your car you are greeted with the delightful smell of their outdoor grill.  The guy at the window was nice enough but couldn't offer us any recommendations and was a bit put off by our asking.  I settled on 2 carne asada tacos and 1 small carne asada quesadilla. All my food was fantastic the carne asada was perfectly grilled, the Pico was a bit spicy but had a perfect flavor. My coworker got 2 chicken tacos and 2 carne asada and loved all of her food.  The chicken was amazing.   The outdoor seating was clean and on a nice day it was great to sit outside with the smell of the grill  The 4 star is only due to the poor customer service.  The food was on point and we will be back.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1C4uESWVkfQrlCCahuzS-g",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. 2 steak and 2 chicken tacos",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1C4uESWVkfQrlCCahuzS-g/o.jpg"
      },
      {
        "img_id": "ZZK6q0y4-ahiBo_VcOvgYQ",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. 2 tacos and carne asada quesadilla",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZZK6q0y4-ahiBo_VcOvgYQ/o.jpg"
      }
    ],
    "user_id": "NMPALSr1YwTJGLrPfq2Blw"
  },
  "ldE-c274u_sVw1goQoV5Mw": {
    "date": "11/1/2016",
    "text": "I didn't think a cheese quesadilla could be any better until I came here at least. I can't speak for their meat options, but just a plain old cheese quesadilla was delicious! Their hot sauce is no joke either. They give you plenty of sides to go with your orders, and you can always pack more since there's a open salsa bar. My friends got their beef choice and said it was delicious. We talked about coming back to Speedy's the whole trip. Unfortunately, we didn't get a chance to make the second stop. I would highly recommend Speedy's to anyone flying into Phoenix since it's so close to the airport!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "d5rslFmEfrogtBBK7y5Y3g",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Cheese quesadilla",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/d5rslFmEfrogtBBK7y5Y3g/o.jpg"
      }
    ],
    "user_id": "1-2Oed3A3J2lzLnRp12FWw"
  },
  "0K5pdYMPPwBySf9S9E-E2A": {
    "date": "7/5/2016",
    "text": "Awesome tacos in a convenient part of town. I'm always on the go so when I need to pick something up quickly, Speedy's is my go to! Typical Mexican food options but their tacos are my favorite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lHS-KooDk1UgcRA-JvKhOw"
  },
  "nXGKoGMVqEOu7nHB2jCpLw": {
    "date": "3/23/2016",
    "text": "I have no clue why this place has 4 starts!! This place is disgusting. We ordered 5 chicken tacos looked gross, the chicken was old af!!! I swear to you the chicken was at least a week old! Tasted like shit. I tried givin it to my dog but he didn't eat it. Don't disappoint yourself just stay away from this place.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "6gAqVSXRGxja_dDhVgs-Fw"
  },
  "9EvhBSgmLK2g4OjgEHnrEg": {
    "date": "1/28/2017",
    "text": "This little taco joint has provided me with the best and most affordable tacos ever. They taste amazing and are a decent size. Definitely recommend checking this place out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "je5t7RW0UXckjWxlA00UAg"
  },
  "AoDruLMYDAklGyVLUHl1xQ": {
    "date": "4/29/2018",
    "text": "This place is awesome. I loved it at 5:30am on the way to the airport. I got the steak, egg, and cheese burrito and a tall glass bottle Coke. The only negative is that I checked all of the Coke bottles in the cooler and none were cold. They must have been just restocked. But the burrito was amazing. To say it was a steak, egg, and cheese burrito doesn't give it justice. Most burrito restaurants have it mostly egg with a little bit of low quality steak sprinkled with cheese. Not here! The steak had been grilled on BBQ grills with a hint of smoke flavor. This also was a steak burrito with a little egg and cheese on a delicious homemade flour tortilla. I have to admit, although I loved this steak burrito, my stereotype emotional expectations of these type of burrito restaurants, I expected lots of egg and little steak. I think slightly more egg would have been good, but I am a little conflicted because I did love this burrito as it was prepared. I fly in and out of PHX every 10 days or so and I plan to be a regular customer. It really was great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Jcq_VVFrCMVWKp70PkUWA"
  },
  "q41DaqUwT26ae0g0ScAiww": {
    "date": "4/26/2016",
    "text": "I've never had an emotional response from food until I had speedys. This food is so delicious, words can only tickle the surface that is the depth and range of flavor on a menu that is only a few items long. I must start with their home run, the salsa verde. I've been to almost every fast serve Mexican place in Phoenix and Tucson and this place hands down has the best verde salsa ever period. Now put that on a steak breakfast burrito with rice and you'll weep from emotions you didn't know food could evoke. The eggs are so fluffy!!!! How are they so fluffy?!? Throw it on a carne Asada burrito with rice and beans and be taken to a place where everyone smiles and unicorns run free through fields of cotton candy. If you happen to be there when they are grilling their chicken and carne Asada for you to see, sit and enjoy the smells, it makes the experience even better.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "pU8udtjld_ZGCue5bx_Zsw"
  },
  "_oUwgSJieu4yARPBog2-RA": {
    "date": "8/20/2017",
    "text": "We came to order some carne asada tacos late night/early morning before they closed. Food is great, service was fast, prices are decent, and conveniently located.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r1pxrbmSB1Krx3Kx13w-Eg"
  },
  "f2WivlZlm0w8EA45e9EAPQ": {
    "date": "8/18/2016",
    "text": "Used to go here when it was Franks A Lot and it was awesome.  Wasn't expecting much, just stopped by after dropping off stepdaughter at Sky Harbor Airport.  I was wrong for sure.  The chicken quesadilla with rice and beans was terrific!  Seriously, I never finish the rice and beans but they were the first to go from this place.  Also had a steak taco, I normally don't eat the cows, but this was also delicious.  Will return.  The various salsas from the salsa bar is a nice selection but the red and green seem to be very watered down.  If going by you should stop, it is pretty quick...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cvSHQGhCVC98VSnJYnySXg"
  },
  "kIrS2aC5HfnwaBMB_OqtqQ": {
    "date": "4/18/2016",
    "text": "This has all the makings to look like a legit taco place but don't let it fool you. I ordered steak tacos and I didn't get to eating the second taco before I started to feel a sick. I don't believe the meat was cooked enough. Plenty of places in the valley for tacos, no need to check this place out.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cjzjOubh5VPSNHl4O7k5IQ"
  },
  "JyvfFXMmLk0rPCrQvqpkKg": {
    "date": "2/13/2016",
    "text": "I don't know how this place has such high reviews. I was very disappointed. Horchata is very weak and watered down. Tortillas were terrible and nearly raw. Beans were not good. Even the green salsa is watered down. Steak was better than the chicken but no the greatest. Red salsa was a lot better. The tacos had such little guacamole I can't really judge how good it was. The pico de gallo was not good either- a good pico de gallo is well balanced with the ingredients, this pico seemed to only have onions.  Never coming here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "mdsXi_Im1XYNs1p3bKgJ3g"
  },
  "z4Xvg7QM39u8yis9mVKnug": {
    "date": "3/18/2016",
    "text": "finally got the chance to check out this place after my husband told me about it. I can honestly say these were the best tcos I've had in a while! I got 3 steak tacos with rice and beans and loaded it up myself with their self serve salsa bar. Everything tasted fresh and its very cool eating while they grill right in front of you. I will definitely be back here!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wjI7c3wRab1CDFVRW9ZqkQ"
  },
  "3B3Ct-GMb9VKq-XpY9rEaw": {
    "date": "5/14/2016",
    "text": "Stopped here late the other night ... unlike some other Yelpers, I was not aware of any \"hype\", but thought it looked authentic.  My friend and I ordered tacos - beef tongue and carnitas, with sides of refried beans. The beef tongue was amazing!  Moist and flavorful as I've ever had.  I was a little disappointed with the carnitas, they seemed dry and not as spicy as I would have liked.  But the overall experience was good and if ever in that area again, I would certainly consider stopping by!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wTL60iYN2xymN1j-4stpNg"
  },
  "FSW4Awd6zkESUaWUl2GXsA": {
    "date": "4/20/2016",
    "text": "Great place to go if your mashed at two in the morning. lady behind the counters easy on the eyes. Get two chicken tacos and two steak tacos and loaded up with the fixings and you will not be let down! Thank you speedy",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "HNZyncMeh_VGGpsSBXuEFg"
  },
  "oTImoMyjl-TLjRVtlvXEhA": {
    "date": "7/12/2017",
    "text": "Right around the corner from my job so it's convenient. Prices are a little high for a taco stand, but coming on taco Tuesday is worth it. Their Carne asada tacos are good. The meat is inconsistent, sometimes you get fatty pieces and that ruins it, but when you have one that has little to no fat it's worth it",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iYInf4Vzt1jkuvBG-3ovcA"
  },
  "34QExbmLrjKH8FlIOZq2zg": {
    "date": "3/19/2016",
    "text": "Great food ruined by crappy service. I go to speedy tacos at least 1 to 2 times a week. The carne asada tacos are some of the best I've ever had in the valley. The food definitely keeps me coming back. However, the service and overall operation bring this place down. If you do go plan on waiting a long time, having your order messed up, assuming you get your order because they forgot to make it. And definitely don't watch them make your food. Remember it's the crappy little taco stand on the corner and you're going for the great food not experience. Don't be surprised if this place gets closed down soon by the health department.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Im2-uNf6QuDScYK9PiAi6g"
  },
  "5DTCEGRMys0jcJYF5es8AA": {
    "date": "12/12/2015",
    "text": "Ever Time I come here the food is absolutely amazing. The breakfast tacos and chicken quesadillas are on point.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "gHt_cj2_9xhjmsQ0Z2cgnA"
  },
  "PTUEkuNW4Y6LEuxaWsVj0A": {
    "date": "5/18/2016",
    "text": "Read the reviews and tried a couple of the dishes on the menu. The kitchen cleanliness and all the flies certainly were a distraction.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kb0J06eZTazEctOXBa0pPw"
  },
  "ue2SizthIxjT2XLTkF-Zzw": {
    "date": "8/5/2017",
    "text": "This was amazing! We had the steak and chicken taco, my boyfriend liked the chicken better but I enjoyed the steak better, so try both! We also split the egg, cheese, and chicken burrito and it was delicious! I definitely recommend this place! The service was not that great but getting the food was super fast!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZjTw-M7O5Qdn7xl3b6hYwQ"
  },
  "ipKBPTwWNoiXj4KEkuwTQQ": {
    "date": "9/19/2017",
    "text": "Great tacos and amazing burritos. I stick with carne asada by preference, but nonetheless the quality is always amazing. The meat is cooked exceptionally every time and doesn't leave you feeling too full",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mV0LBYKXYQ44Ma3Ft_4Q_Q"
  },
  "rvcgN93Aqnz-Z8fODSQyyQ": {
    "date": "12/9/2015",
    "text": "Save your money, go down the street. I got a quesadilla Pollo, was an oily ball of cheese, burnt tortilla. Guacamole awful, slime. Best thing was bottled Coke. Not worth over $7. to throw away.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qfiSE4SobWryp4CV5AlppA"
  },
  "HmnxBFm25BEO2FWf5JI6Hg": {
    "date": "7/23/2017",
    "text": "No frills outdoor eating on picnic tables BUT the food is great!!  Best day to go is Taco Tuesday for value.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YT5hdU_wZVOWs7zWNj_QfA"
  },
  "KjBi3JfI7HzIZgoKgciZZQ": {
    "date": "8/13/2016",
    "text": "Sooo much yum. The flan is incredible, the pollo taco was amazing - perfectly seasoned, the amount of fresh toppings served on the side was awesome, super tasty - and the carne asada quesadilla was delicious. Plenty of fresh salsas on the side as well. I had an Uber Eats credit I needed to use, I was ravenous and I am so happy to have discovered this wonderful place. Thank you guys for being so awesome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZNMQbC7kvUx0Z77A1syx1g"
  },
  "gEhOKwb2Y8oTMmOkLFtb-A": {
    "date": "8/12/2016",
    "text": "GREAT FOOD AND CUSTOMER SERVICE!!! My go to place for tacos in Phoenix!!!! Not only are they quick but the quality of the food is excellent they have provided the best tacos for quite some time now in my book, it's definitely will recommend to all of my friends for years to come when they visit Phoenix",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LGkUfImmtjfJVM4svCSgDA"
  },
  "g1_rh0XVYiCf0XTXVv4XGg": {
    "date": "10/11/2017",
    "text": "Thought I had found exactly my kind of a place - a small and inexpensive \"authentic\" ethnic restaurant with a diverse clientele (presumably because people from all walks of life appreciate the food). Instead, I was a little disappointed. Service is somewhat slow, you have to dress the tacos yourself in a small window from which they're also serving, and the price is actually kind of high for what you're getting, especially considering the extra nudge to tip (I wish I hadn't). I got two tacos as a combo, which includes rice and beans. Ingredients were high quality but, still, everything was small and sort of carelessly prepared. I had to wait a while for fork with which to eat my rice and beans as the dispensers were empty. Despite my tip, there was little effort to get me what I needed to eat my dinner (ended up with a spoon). Tacos are $2.99. The street vendors near my home in Texas are much cheaper and prepared by people who give a sheit about the customers. There are no restaurants in the area, so I can see why people might end up here, but I'll stick with the junky hotel food next time I'm in the area.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CsoVdCdjpuou0X9xShDFBQ"
  },
  "CuEr0FjuG1fvWJ5c1XuTRg": {
    "date": "8/23/2016",
    "text": "I don't know what happened, but stopped by around 1030pm. Ordered, a steak quesadilla and 2 chicken tacos.   Was not worth $12 bucks, the 2 chicken tacos were filled with more red onions than chicken.   The quesadilla was way to small.  They were always consistent, but this time was terrible.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OuRmjIT8yj8w04XsLX1tlg"
  },
  "4TzCcrdPKXQxeGzP_7YFjA": {
    "date": "12/14/2016",
    "text": "I've been passing this place for about a year before finally giving it a try. Was surprised by how tastey the carne asada burritos are. Have to say that nothing in North Tempe compares, and Speedy rivals Mexican places in the Phoenix area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9oU0agQ2FguUvArFMLZstw"
  },
  "6KkHld1pBjZrhsYAgHZUeA": {
    "date": "8/18/2016",
    "text": "Just excellent food- so fresh!!! Did their steak tacos- soooo yum!!! Cilantro, fresh key limes, pico.............. excellent!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VcMudqxgoENObcBLT3LKHg"
  },
  "h108F6Exga0U8oI4ABECqQ": {
    "date": "12/8/2016",
    "text": "We need more no-nonsense places like this. Good food fast. Great job guys - you are one of my favorite places to grab a bite in the valley.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VjzyE-PXxK71G23SMzxVUA"
  },
  "sJKHgRbbft58lmnOlElfwQ": {
    "date": "8/17/2015",
    "text": "Had the bean and cheese burrito.  Homemade tortilla, maybe canned beans.  $4.99.  Ok.  2nd Visit: A bit better.  Might be making homemade beans by now, but not terribly better than first time.  Husband REALLY enjoyed his foot though.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eQ4JKiHdKVBj4YUeS0S-nA"
  },
  "s-2PbpwHQqskpz8_vN4A4w": {
    "date": "9/1/2016",
    "text": "I ordered a carne asada taco, cheese quesadilla and a Jamaica drink and paid $11.  The taco was just ok. The quesadilla was the same size as the taco, thought it'd be bigger and it was better than the taco. The Jamaica drink didn't taste fresh. It had an old taste, almost fermentish I wondered if it had some alcohol in it. I won't go back ever.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M34OdhhYnxgsPBIJQ70nEA"
  },
  "CAwRE54B6ti_Yjk0VzKNug": {
    "date": "4/18/2017",
    "text": "With about 10 guests total at Speedy, I waited well over a half an hour for a steak quesadilla, with the ticket in front of me ordering a bit more food and waiting even longer. Food was fine, but the experience was terrible. Hopeully it's better than this usually.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VfSkTvwBU2Es4q0hBdMc9g"
  },
  "LcvJxTJ1rP56Ud4xrGECqA": {
    "date": "4/14/2017",
    "text": "It would be very easy to miss this gem on the drive, but don't let the sketch neighborhood distract you from the red and green sign welcoming you in. The tacos are BOMB! If their tortillas aren't handmade, I would be shocked--everything tastes very fresh. I'd be curious to see what it looks like at night when their patio lights are illuminated. Will definitely have to check it out on a Taco Tuesday sometime.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xw7lRKttD9p3tJeAoVMSYw"
  },
  "Ttrml4OS4fUnMrO7CAhq7Q": {
    "date": "12/1/2016",
    "text": "This place legit has the best street tacos in AZ. I get the carne asada with the guac, cheese and pico and they are amazing. I live an hour away and I travel to here for these tacos! I dream about these tacos",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pvwyI8VayeOrTukTrSXuFA"
  },
  "DLY6tFRGi5rE3DKkwaxL7Q": {
    "date": "1/7/2016",
    "text": "With all the places here in Arizona I've been to so far the one thing I can say about speedy street is so authentic it is so delicious Mario and such a good person the people here are awesome I just appreciate truly appreciate coming here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4Df7HSkVQj93-BVilK-8JQ",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4Df7HSkVQj93-BVilK-8JQ/o.jpg"
      }
    ],
    "user_id": "NnenjH-UqbcoubsAnDyMKw"
  },
  "P_nvmMlsFG63uWAgL3_jVA": {
    "date": "11/8/2016",
    "text": "Great late night snack place. Close to the airport, with a drive through which is a bonus. Great tacos. Some outdoor picnic type tables available.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ckLnnIB8ghv240j-T4HSdQ"
  },
  "PoT5qyfRd7wCoWFU1bs4Vg": {
    "date": "6/28/2016",
    "text": "Stopped by this spot shortly after landing at the PHX airport. I highly recommend the steak, egg and cheese tacos! Great food and service. Thanks Kayla!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qbMXvnGKafC88fEp2tgYug",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qbMXvnGKafC88fEp2tgYug/o.jpg"
      }
    ],
    "user_id": "XHkBwtn2ZOJfrH8qlrkRtA"
  },
  "1kzBzEfPAwjdQFxca6VNTw": {
    "date": "11/1/2016",
    "text": "Daytime staff is pretty rude. Was asked to get out of the drive thru when trying to order tacos because they thought I wasn't a customer. Weird. They run a fast joint but plenty of taco stands in az silk manage to provide exceptional customer service. The street tacos are outrageously priced for being street tacos and the burritos are overpriced too.   I highly recommend Tacos Mich. It is way more authentic. You won't find any Hispanic people in line at Speedy.   It's ok for a late night snack. Don't recommend if looking for good Mexican food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "flGyIUchW7WDd_8nCvKMww"
  },
  "xAaBi8z2c-89oY0Mfo0XPA": {
    "date": "12/19/2016",
    "text": "Great street style tacos! I hands down LOVE the carne asada stake tacos with the works, but the chicken is also very tasty. The horchata is the best of the best here with authentic horchata goodness with a floral vanilla type finish SO GOOD! Can't beat the Tuesday taco deals either! You can also add rice and beans which is nice. The beans are a tasty black beans and the rice is not over flavored which is hard to find! Clean and food is made right in front of your eyes and service is alway quick and friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oyVEr55rq1BrXW54lWdzpQ"
  },
  "k6aPFhkhDMP2yHYfCKndRg": {
    "date": "2/7/2017",
    "text": "Bomb.   The tacos are great (both kinds) and they keep them simple with most of the add ons on the side. Also their red salsa is super flavorful and just spicy enough. The burritos are cool but I'm not a huge fan of them. All in all this place hits the spot. The flan is good too but not particularly traditional-- kind of plain.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p66vb97PHqk31aCeDbEtwA"
  },
  "JHqZIzTZbRHWCPGwAKlq8g": {
    "date": "10/30/2016",
    "text": "Bad tasting asada.  Chunks of meat too large, tough, and not caramelized.  Tortillas too large and just greasy.  Four stars for this place says more about the folks around here than the place itself.  I want a refund on my appetite.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IthMAxUFbJTRu6HrbGAi4Q"
  },
  "OEu69Hf2kK3fT-kFsmA1xQ": {
    "date": "9/24/2016",
    "text": "I ordered the chicken quesadilla, which was pretty good, but the refried beans on the side had crusty spots like they had been under a heat lamp too long.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RYpuo_KNOcT3ZDGaN7kuyQ"
  },
  "FaSCajt9ZLQyPFWzXAY4Qg": {
    "date": "1/18/2019",
    "text": "Got door dash excited for our burritos. 1 taco, and 3 burritos for 4 hungry people. How many sauces do they put in the order? 1 red 1 green. Skimping out on salsa is fastest way to deliver a fresh and hot serving of bad experience.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5b6Ewa0eF6bwwgMKF-zikg"
  },
  "XaRrvQPZ4sU-XtQaja_LWQ": {
    "date": "2/8/2019",
    "text": "Was told to go here on a brief visit and it didn't disappoint.  I'll head back next time I'm in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Ye4C9AVEa6NGvfiaw05Zw"
  },
  "1YEhNZTYr6P--miAq5TGtw": {
    "date": "12/18/2018",
    "text": "Terrible. Enough said. I am from Tucson and we do have better street taco stands. I guess I'm a little biased.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SyBQop3HHn_SWFKcgO3cFg"
  },
  "Z-KYaZR87R0p9Hk6oxUYaQ": {
    "date": "1/11/2019",
    "text": "Don't shy away from this place because it looks like a run down trailer building from the outside... the Carne Assad Tacos and Burritos are incredible! Every-time I'm around this place...I crave the flavor!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nn--x4f88W5rmD2u1gnNLw"
  },
  "4rzaCXPf1EXMyPypLOrj1A": {
    "date": "3/29/2018",
    "text": "HUGE fan of Mr. Mesquite and its Speedy Street Tacos here to tell it how it is. After contributing a considerable portion of my meager income to Speedy Street during my frequent visits, I reluctantly submit this stale, neutral review. Despite the outstanding carne asada that has kept me coming back once or twice a week for the last two years, it would be intellectually dishonest to dismiss the tidal wave of less-than-stellar customer service experiences my friends and I have endured. Mind you, if you are simply looking for phenomenal food and do not stress about the nuances of the overall experience as many of Yelp-ers do, kindly skip over this review and enjoy some Speedy! GIVE IT A TRY. It's really as good as a lot of these folks say.   However, if you are someone who considers customer service and consistency of quality to be paramount, you might want to take notice of the follow: It really depends on which personnel are on shift, but there's always a chance that you'll run into a crew that simply does not care about your experience or about Speedy's deteriorating reputation. We forgot your order?? ....let me forget it one more time so you can spend an additional 10 minutes here! We're out of limes??....tough luck, we're busy! You ordered a quesadilla and expect the guac that it is supposed to come with? ....not today, we run 24 hours and don't have that prepped! Want a cup of water?? ....only after I express visible disgust for your request will I get that for you. Your tortilla wasn't sufficiently cooked?? ....well that's how it comes! There was a fly cooked into your meat?? ....sorry about that bro!    However, please understand that these sort of things have occurred only a handful of times throughout my visits, which would easily accrue to over 100. Yet, it simply cannot be understated how unenthusiastic many of the crew members can be about..well..being there. Having been a regular for so long, I've seen so many fellow customers gripe to the Speedy staff about mistakes with their orders or other easily curable issues almost every visit. So, I know that I am not alone with this sentiment.   I report this 3-star review begrudgingly as I have an enduring love for Speedy's food. Nonetheless, the impermissible treatment of loyal, paying customers ought not to be overlooked.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "UM_2WHyZR4DJjp_CbITZFg"
  },
  "zRGqViRoHln-7kPHkvM_7w": {
    "date": "11/27/2017",
    "text": "Pretty darn good for a taco truck style restaurant. We had a <a href=\"/redir?url=http%3A%2F%2Frestaurant.com&s=c5fe485af4df376130bee54f875814d79c4d7913e1258123b1206d2bdbf4873b\" target=\"_blank\" rel=\"nofollow\">restaurant.com</a> coupon so ordered a ton of food. My husband got two chicken and two beef tacos, I ordered a carne asada burrito with a side of spanish rice, and we both got sodas. The carne was very flavorful and plentiful, lots of fresh flavors in the burrito. The rice was okay, maybe just a little too soft for my taste but my husband liked it. He really enjoyed his tacos, mentioned that he preferred the beef. They have a little area you can fill up on limes, cabbage, salsa and other fixings for customization. The food did not exactly come out \"speedy\" but it was hot, fresh, and very tasty. This place is nothing to look at so come prepared to sit on park benches and use plastic utensils. Nothing wrong with that!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gOYgSEbE-Z7cqGsgGW3LBg"
  },
  "1EYyeBubdSb4CD3whsxArA": {
    "date": "4/9/2018",
    "text": "Came here after a night of heavy drinking and my god were these the best street tacos I've ever had . I'm a huge fan of Mexican food . The authentic stuff!!!  I prefer small places like this place better than a sit down Mexican restaurant because it just taste so much better .  My friend got a bean and cheese since she's a vegetarian and I had 2 carne asada tacos and a asada quesadilla . I loved their salsa bar with their fresh toppings and salsa that I smothered my food with.   I will be dreaming about this food tonight !",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "svKDPpDu89QZ-cSaK8cGuA"
  },
  "OUCj9UGy_NKUAVngexay8A": {
    "date": "8/15/2018",
    "text": "If you are near the airport, or just want some good tacos in general, stop by Speedy's! A sort of unassuming spot, but take a chance! I'd like to consider myself a regular and they definitely take care of me!   The carne is good the chicken is good the guac is good and the tortillas muy bueno. I'm a big big fan of the quesadillas - even the \"small\" is very filling! I'm also a big fan of the extras that come with your order - salsa, onions, etc.  Do yourself a favor and stop by!  Good horchata too",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5ou--G3E8zOc38kaGwRZAA",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5ou--G3E8zOc38kaGwRZAA/o.jpg"
      }
    ],
    "user_id": "C61Y3bAzAdOnR0n9f90THw"
  },
  "rUiRC0P6U0t3z1vatcKC6A": {
    "date": "3/23/2018",
    "text": "Disregarded our online order until we arrived, total order time was 45 mins. Didn't apologize for leave just stated \"here's your food\"  Breakfast burrito was bland and meat was over cooked. Never again",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Hst9WupdX1b1IyXdNi_UEQ"
  },
  "wk2EWFMiSsnowFrjOe8v4Q": {
    "date": "10/24/2018",
    "text": "Bad service, rude and unhelpful employees. Spent about 15-20 minutes driving over to the restaurant to pick up a really large order for the Phoenix Children's Hospital.  After I get there, the female employee working acts annoyed to see me, says \"we just got that order and haven't started making it yet\" and I point out the order was confirmed 20 minutes ago and they've had 20 minutes to start making it while I was driving over.  She responds \"it's harder make it than just driving\" like I'm beneath her because I'm a food courier and then she shows me her phone like it would prove they \"just received the order.\"  No surprise, but her own evidence showed that 20 minutes had passed since they received the order.... What they had been doing during those 20 minutes I was driving there, I have no idea. Ignoring the order, apparently.  I called Driver Care to update the ETA, waited patiently, then finally got my order and left. No apology for the wait. Fortunately PCH is nearby so I barely made it to the delivery in time.  This restaurant's carelessness and the bad attitude of its employees wasted about 30+ minutes of my time. I blacklisted them and won't be picking up for them again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5sERHA3dHvKnnpTVhqK3dA"
  },
  "Qqmj0T4DhWl7FNhr3q__jw": {
    "date": "12/17/2018",
    "text": "I love the place because they serve until 2am. The only reason why I did not give them a 5 star it's because of their location- next to a dumpster! I don't mind a very small place or in the middle of nowhere location just not next to a dumpster full of flies. The quality of food is good but Geez! Move to a different place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kMVS2XvqJXn2XFVG1RIOfQ"
  },
  "51WE4P8_pezgvF3WvrKfEw": {
    "date": "3/31/2018",
    "text": "By far some of The Best tacos I've Ever had!  The carne asada is juicy, tender, not gristly and fatty like most taco shops, and cooked to perfection. Their  condiment bar is a huge bonus, both salsas are excellent.  Their tortillas are perfect, their quesadillas amazing! Portions are huge and prices are great. My only complaint: no chips.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6a0xOgp3WDHoU2JfwJRSxQ",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6a0xOgp3WDHoU2JfwJRSxQ/o.jpg"
      }
    ],
    "user_id": "aLd1Nya3F5qq3poVGsJNwQ"
  },
  "Q43KBNfwXW4cCBwzbsSH0A": {
    "date": "7/20/2016",
    "text": "First time I came at midnight. The services fast and enough of parking lot. I was looking forward to try this tacos since I saw so many great reviews about this place.  Once I arrived, I noticed that the open hours was not 24 hours anymore, now they open from 9am till 3am everyday.  The price is around $2.99 for small size soft taco. I ordered steak, breakfast tacos, chicken, and tamarind drink. To me, the seasoning was just right but nothing special. Compared the other place, I found the other places have flavors so much better (plus more size of portion).  I recommended this place for late snack and who like to eat small portion.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "TaHxl5Ifljz4Y4pMAkRGFg",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Breakfast egg, chicken, cheese taco @$2.49/ taco",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TaHxl5Ifljz4Y4pMAkRGFg/o.jpg"
      }
    ],
    "user_id": "tM84r9rP7XTjX4SnRzviMA"
  },
  "UNn4NUz2SFgfM8HfHNxzrg": {
    "date": "7/10/2016",
    "text": "The only thing I like more than Mexican Food, is tacos! My favorite meal growing up was tacos. My favorite meal at most restaurants is tacos. And now we live in a world where everyone wants to put their spin on tacos. But now I realize, I need to end my sentences with a word other than tacos...  Speedy Street Tacos opened about a year ago in my neighborhood. I don't know what occupied this location previously, but I'm glad these guys are here now! Speedy is a walk-up taco stand with a drive-thru and a covered patio for dining. I've enjoyed lunch (and breakfast burritos) here several times before today's visit.  This is a fun place to eat too. It's got character and reminds me of a few mom and pop places I use to enjoy patronizing in Tucson. One of the benefits of eating outdoors, even on a hot day like today, is you get to watch the staff grill the steak and chicken in an area adjacent to the patio. But thank goodness for the occasional breeze!  Today, I enjoyed the carne asada street tacos with guacamole and cheese (gotta have the corn tortillas!). And I made it a combo because this place has delicious refried beans and THE BEST SPANISH RICE I'VE TRIED ANYWHERE! Plus, they sell bottled Coca-Cola which is hecho en Mexico. (Ever wonder why Mexico gets sugar and we get corn syrup?!) I digress... Don't forget to check out their salsa bar either.  I predict Speedy will be around awhile because they do one thing (two if you count the burritos) and they do it well. They have a great location across the street from Gateway Community College. Plus it's off the light rail. So no matter where you live, east or west, hop on the light rail, get off at 38th Street and walk two blocks to the east and get your taco fix on.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "khkkq7H0RxX9G7MR4BDCGw",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Carne Asada burrito with beans and the best rice!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/khkkq7H0RxX9G7MR4BDCGw/o.jpg"
      },
      {
        "img_id": "si2w6u4o_O2UQctNAgmrFA",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Always glad to see this place open!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/si2w6u4o_O2UQctNAgmrFA/o.jpg"
      },
      {
        "img_id": "kJ6i6DDDw-1pVdlEgK18Jg",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Carne Asada street tacos with rice and beans",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kJ6i6DDDw-1pVdlEgK18Jg/o.jpg"
      }
    ],
    "user_id": "OZErOKA1RaH2J6flZhU-zA"
  },
  "lyyc8ikoA0JWPc92WMSQZw": {
    "date": "4/7/2018",
    "text": "I come here late night and I heard the breakfast burritos are the best...but I got the tacos def reccomend the chicken tacos and don't get the meal the rice was def siting and beans....the jalapenos are almost raw not cooked like I'm used to..but they did give a lot of sauces. But yeah don't order steak it's kind of tough to eat. Not the best cut, if they marinated it in meat juices it would be good regardless of what time since they are 24hours. Other than that they're pretty cool",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A6aZrcylBCNG7M2TFOHPGw"
  },
  "X5sNc9fY16gSFPWosBZTIQ": {
    "date": "4/26/2019",
    "text": "We live in California and this is not Mexican food. The beans and rice have NO flavor. The horchata didn't have enough sugar. I asked for raw onion and they didn't have any, what kind of Mexican restaurant doesn't have onion? So disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5rFU9NmOaRQOBodEWx21Yw"
  },
  "BIrMQrB5Hr8sUF-p5wnf4Q": {
    "date": "11/24/2018",
    "text": "Fantastic food at a great price. Fresh and friendly. Conveniently located & love the outdoor vibe for the gorgeous weather we have here in Arizona.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cNoSfPcqS9qwBrdnh0UAnw"
  },
  "Sb2KTzoM2qys0oRcXOFG4Q": {
    "date": "9/21/2018",
    "text": "Tried this place for the reviews and because it was close to my job during lunchtime. Didn't expect it to be so raggedy, but the food was just decent. Not the best I've ever had. Probably won't go again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nFaFzQl--WpQcW4rHYLqMw"
  },
  "h-6fTWq4ptSvuV5ThwBnkQ": {
    "date": "2/26/2019",
    "text": "Worst tacos in town!! Avoid this place!! The food its just bad the meat needs flavor the rice is too salty! The cashier was rude. The place is filthy! There's better places in town.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4mBbFt_kNq6lLdKstBCGBg"
  },
  "kkmyYw0Om7rnZPcFb-EQlQ": {
    "date": "8/25/2017",
    "text": "Oh the joy of street food whether a food truck or a roadside setup.  Speedy Street Tacos is one such place. If you are ever in the proximity of Phoenix Airport, and have some time to kill or have a hankering for good street food, this is an excellent option.  No fancy frills, just delicious Mexican grub.  Waiting in the cell phone lot of the airport I yelped for a place to get a quick bite (the alternative was the airport terminal food). Saw that Speedy was just a 5 minute drive away and decided to make a dash for it.  And I was amply rewarded with great food. Sat outside and chewed down on their tacos. Sweet goodness! Nothing complicated: just lots of flavor tucked inside soft tortillas. Choice of protein mixed in with all sorts of great accompaniments.  So now I know where to go when I am at the airport to pick up and the flight is delayed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5RhE6tDc2xH6ySYGiSjiGQ"
  },
  "BuhMRKEX23uERBeXdgbzMw": {
    "date": "11/27/2015",
    "text": "Great, little spot right next to the AZ Animal Welfare League. The carne asada burrito with everything was delicious. Their selection of salsas were great too. The red has some kick, so be forewarned. Definitely recommended.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cve5LXr_EI5D4c8otQPoEg"
  },
  "TgfKFMZATW9XVFA2ue-Zig": {
    "date": "10/21/2017",
    "text": "terrible terrible restaurant. they make my order incorrect every time and when i call and complain they tell me that it's because the words are too small to read (like is you blind?!?!) and then hang up on me! the service is awful, who hangs up on a customer?!?! they are rude and the food is disgusting. it's not cooked all the way through and when it is it's the completely wrong order. i would not order from here again even if it was the last place on earth!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cVcE9OM8yPHN0nz5-6MpNA"
  },
  "rRL1zva37gUv-utkUm42rw": {
    "date": "8/24/2015",
    "text": "I'm a flight attendant so this place is a godsend being that it is right across the street and they are open 24 hours. It's super clean and tacos are extremely good and for a great price. Don't underestimate this place because of the area. It will be my go to place before I fly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9UcONIfJ-nbQTYGZ61XtEg"
  },
  "JJ-lbBLneH2XAgJhIrqQcw": {
    "date": "11/25/2016",
    "text": "Very good tacos and burritos. Carne asada is excellent, and open late, so great for cravings too. Street tacos are delicious. Everything is freshly made and service is fast, and they have a drive through.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-2pmZr96R-v-Osv0_1FlRA"
  },
  "lG5abWVcD4-ltkjj-knagQ": {
    "date": "8/1/2016",
    "text": "Maybe I ordered on an off night. The chicken in the tacos was roughly chopped chicken cubes around 2 inches on a side. They were grisly and barely edible. The steak was better but still lacking in flavor. The chicken quesadilla tasted like someone spilled seasoned salt into the dish and just kept going. Really had high hopes for this place was extremely disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PntOrrW1zEEgpKHZbh8wmQ"
  },
  "G8uyCPRiADdEtFYdEBnQYw": {
    "date": "10/17/2016",
    "text": "I ordered this through Postmates last night because I had never tried this place before and I was craving Mexican food. When my order showed up to my house and I looked in the bag, I was immediately disappointed. The quesadilla I ordered was TINY and not only was the cheese not melted, but it tasted straight up like mozzarella and ricotta cheese. Every other Mexican food place who has charged almost 4 dollars for a quesadilla at least gives me a decent sized portion. I also got a bean and cheese burrito and when I unwrapped it to eat it, it was cold! Not cold in the sense that maybe it had just been sitting in the Postmates vehicle for awhile and cooled down, but cold in the sense that NONE of the cheese melted at any point so I know that it was never hot to begin with. I had to microwave it just to make it edible. I will never order from here again, unless I feel like being disappointed. The only reason it's getting 2 stars instead of 1 is the fact that the ingredients at least seemed to be fresh, just poorly combined.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4qW_ihfTA5NYdHajoD8k3A"
  },
  "H751VA3muQ_0yhxO1XDHxQ": {
    "date": "10/10/2015",
    "text": "The carne asada tacos are amazing! Being a taco freak, I have eaten them EVERYWHERE I can get them.   I am gluten free (celiac) and they are very careful not to cross contaminate.  Have never gotten sick as they are so careful!  The portions are big, enough in one taco for two tortillas easily.   The green sauce is to die for, not too hot and not sour like some.  We seriously eat here weekly now.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pvqSIw5eO7_EoVieBW-u0g"
  },
  "SVRAmu-uMYQnYRcR7Wz1gg": {
    "date": "9/27/2015",
    "text": "Awesome food! Awesome service! Will definitely be back for more! The carne asada is seasoned perfectly! I had the carne asada on yellow corn tortillas. The tortillas.... OMG!!! Haven't had these type of yellow corn tortillas in a while! Must have! Excellent food! You guys have to try this place. You will not regret it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nqnfYFfbVGgasf-xrMuuJw"
  },
  "_4Q96pF9ldrO9_JS3hNGTw": {
    "date": "7/29/2016",
    "text": "Don't let the small appearance of this place put you off or you will miss out on some of the best street tacos you've ever had!  This place is phenomenal!  You won't regret stopping here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vmD3G9hFbFnPPBhT2-Gpzw"
  },
  "khMFKyJ7HADmF066FJ3FOQ": {
    "date": "11/1/2015",
    "text": "Very good \"one of a kind\" carne asada marinade/seasoning. Just had a carne asada burrito with everything on it and it was the best I've had! Amazing very unique spin of spices.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RIBpUl264gvA2gN34CNzBw"
  },
  "9FoQPippwN0XnIfUzN-fJw": {
    "date": "8/18/2015",
    "text": "Possibly the best taco I've had yet great service as well. I go to school across the street and that's my go to spot for lunch!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LfysRD_rKIIuex37n9hSVQ"
  },
  "UYH3vsiDr2z7sqYsrCUbug": {
    "date": "6/13/2016",
    "text": "My first time here and the food was great! Definitely coming back because it's closer and I'll be recommending to others. Good customer service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EjZLpNSOPLRf6QrOnNXXkQ"
  },
  "1IqE_hf8XjrapKEai8Jfsw": {
    "date": "8/28/2015",
    "text": "Tacos r amazing!!! Customer service is too not enough advertisement though. Been looking for a good taco place for a while only knew of u when my Daughters started school which is so close to gateway. Thank u again it was wonderful!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "028BpQr2xaSU6kB_C_OsHA"
  },
  "25OZyfOC3uNUm5E0IbIcgg": {
    "date": "1/2/2016",
    "text": "So good. This was our 1st time and we will definitely be back. We had everything but a burrito between the family. Next time burritos. Prices are fair. Be prepared to sit outside or eat in the car or get home cuz it's just a small outside joint. I recommend it 100%.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bkqN5WWUGbV5VzYg403Zpw"
  },
  "o4ypLdHFyN88xuLN7_8GRQ": {
    "date": "9/3/2015",
    "text": "Speedy Street Tacos is NOT a must have for me. Their food is mediocre and highly over priced. For lunch (9.3.2015), I ordered a taco and quesadilla, both carne asada. The taco was good however not $3 good. I've had better for less. Quesadilla, OVER PRICED! More so then the taco. $4.99 + tax for a one that's 6-7\" in diameter is ABSURD! Whoever stated the portions at this place were generous is LYING! I can go to just about any Mexican restaurant and order a carna asada quesadilla that's 3x bigger and tastier for the same price, this applies to their been/cheese burritos as well. A friend that joined me for lunch ordered one for $3.99 + tax and it was the same size as a $1 been/cheese from Taco Bell. Again, generous is far from the truth. The burritos from Vaquero's and Filiberto's are much larger and the beans taste freshly made. The beans according to my friend tasted as if they came out of can which I thought was hilarious because somebody also stated this in their review.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "trWfT_LQgf-S3qPbMgKotw"
  },
  "MHsgyamM3yURjOCxMSa5dQ": {
    "date": "4/8/2016",
    "text": "Fresh, very tasty and high-quality food. My family and I loved the tacos, quesadilla and burritos that we ordered.  Very reasonably priced and convenient to a cluster of airport hotels nearby. Friendly service; you can take away, eat outside in front of the restaurant or order for delivery.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0WgkWoYyUx20d-3FpquuXA"
  },
  "zKwoXYJdmunOf6FI04a8Mg": {
    "date": "10/3/2015",
    "text": "This is a hole in the wall, they grill there steak and chicken over mesquite charcoal. I had the carne asada burrito and it was outstanding... Maybe a little too much cabbage, but the flavor was really good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OAzlpeH3UnzGbmWZZbbRnw"
  },
  "VTwu6-hM8eM_qi9LMrqZ_w": {
    "date": "1/15/2016",
    "text": "First time I went, the girl at the window had a challenge getting my order right. I decided to give them another try, and they quickly became a favorite spot of mine. Great tacos!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8H0aFw1gKfS1vnZaaR6EQw"
  },
  "bWkvy_11nRFkpMIGtHJsGg": {
    "date": "11/18/2015",
    "text": "Everything on the menu is excellent. Best street tacos I have ever tasted. Small place,BIG flavor, Fast service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fMce_Gseq6iRTWFcDfa9AQ"
  },
  "psorLkxpl_V-6LK79mNMtg": {
    "date": "11/7/2015",
    "text": "Probably the slowest \"speedy\" tacos ever. If you want to watch frat boys hang out and take an hour to make some tacos, this is the place for you.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TqeddxLdgYQ_FzjaHdGuSg"
  },
  "cvZSFNKXmyOXIUTYzttRXw": {
    "date": "5/21/2018",
    "text": "Had the mix bowl was delicious a little disappointed didn't include inside the rice and beans like says menu",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uhZr6nA8kDkw1Y49gE-ubA"
  },
  "PnWv9oYLb1eZwUiUTDX-cQ": {
    "date": "11/15/2018",
    "text": "Food tasted old and with no flavor! They were also being rude and disrespectful. Don't recommend honestly never going back!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yiJ5OA8r4pZMPbqlDgd2XA"
  },
  "23dsp7qTZWxUglcDYe46wg": {
    "date": "3/6/2018",
    "text": "First time to this place. I ordered 3 tacos de asada (steak). And I wasn't too impressed. I wouldn't pay full price for these tacos. I think the tortilla and steak were good but not great. The problem was the salsas they seem to be water downed same with their guacamole. I did like the options they had with the mini salsa bar. But to pay full price is not worth my time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aIdtOiLjNMFTexCCH7V2vg"
  },
  "RADISLbe01lmFzCcXHwxIQ": {
    "date": "5/11/2018",
    "text": "Food is disgusting and greasy! The beans where so dry . I ordered carne Asada burrito and and I got a fried carne Asada burrito. Feel like he had left overs from the day before and reheated my food. The only  reason I left one star is because I have to, to do this review  sad story.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xjnAp8W1dOJvmaqHeKNONQ",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xjnAp8W1dOJvmaqHeKNONQ/o.jpg"
      }
    ],
    "user_id": "9dnOsDSsy-TAje3xDCDUHw"
  },
  "iVgszDTDzQPTeAjWYkos6g": {
    "date": "5/28/2018",
    "text": "The food is good! There's not a big menu but what they do have is delicious. I come hear once a week is close to my work. The tacos are good size for the price!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qav4mK77jjnUAHs84wbgTg"
  },
  "d2_EAHBaQLm7O5RxT5QOng": {
    "date": "9/9/2018",
    "text": "We got the egg and cheese burrito all tortilla more egg and cheese on a dollar menu at McDonald's",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x_Ql5U1TIpCvTkH0ofS8zw"
  },
  "Nz9-IfdY-0qIw_DOrmGWtA": {
    "date": "2/8/2017",
    "text": "At first glance: shady-looking little stand in the lonely airport-parking part of town.  But it turned out to be one of my favorite taco providers. The are really generous with their portions. My man and I ordered 8 beef tacos thinking they'd be your standard tiny street taco. Two tacos in and we realized we were wrong. Lots of meat!    They are open super-late, have a drive-tru and when you order to-go they hook you up with so much salsa and pickled onions, cabbage and pico.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "d_Jb2E7109FeuvIVB1o6Vg"
  },
  "wWjaX0VvhjBeIme2Qrzp9w": {
    "date": "1/29/2018",
    "text": "These tacos and ridiculously good IF you order them carefully (well for me anyway). I do not like dark chicken meat so I order two corn and two flour chicken tacos with all white meat. Cheese and this amazing avocado sauce are the only additions to the tacos. The onion, pico, cabbage, etc. are in the box on the  side you you can fix them up the way you like! It looks like a little shack on the hood side of the airport but don't be fooled and get you some tacos!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yXgIX_pNm7UCzSpppPv_Jw"
  },
  "db6JdN01SIanJgN7Kvrh0g": {
    "date": "1/15/2016",
    "text": "Preface: I'm from Los Angeles. City of angels, and street taco vendors.  So I hear about this place in Phoenix from a guy  in the bar-stool-next to me types and I take note. Place called \"speedy street tacos\" that's open whenever you're hungry. Right by the airport.   Ok. So I go for it.  I take a look at the menu. It's sparse. But sparse in a good way. Like you know that whatever you order is going to be made of good stuff.  I get a mix of chicken/steak tacos, a steak burrito, and a quesadilla. ... Then I start my timer. How speedy is speedy? 4:16. That's pretty quick for 5 items. So yeah they're fast. But how \"street\" are they?  Do they meet the \"mom and pop place in the East LA barrio\" good?  Or the \"late night taco truck at the closed car wash\" good.  Could be. But with the fresh corn tortillas, tender and flavorful meat, pickled red onion relish and picante salsas, and OMG RED ONION RELISH,  This place toes the line with the speedy service and street-cred of \"little old lady with the taco cart that has the line wrapping around the corner\" good.  Will I be back? Oh yeah. I'm calling this place a red-hot 5 stars worthy to be your first stop in Phoenix right after you grab your bags at the airport.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 7
    },
    "photos": [],
    "user_id": "lYkBz3KpXiBV9n3_t8LM3A"
  },
  "MjCJ9_usasZlUpW9S5DgAw": {
    "date": "10/17/2017",
    "text": "ORIGINAL REVIEW ON FACEBOOK: Work down the street from this place. Perfect spot to go on Friday evening on my lunch break... and then wind down my last work shift of the week before I start my weekend! Great tacos! Taste amazing and they are loaded!  UPDATE Review: I supported you guys in the beginning, but you are a victim of your own success. Customer service has gone downhill, you guys are very busy now, but it seems like you have not added any extra staff to accommodate. I get 30 mins on my lunch break, and I waited 20 mins in line... JUST TO ORDER. Seems like the food delivery services get priority over those who supported you from day 1. No more \"Speedy\" tacos. Change your name to \"Slow As F--- Tacos!\"",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xkbrdpuJncdHlAavukzoqA"
  },
  "aWEaI_kGz6dYtyOS7y2Gjg": {
    "date": "2/22/2018",
    "text": "Great hole in the wall. I went for lunch and it was full of locals. The steak quesadilla was very flavorful although a little greasy. Many people were ordering tacos because of the Tuesday special, and they looked very good. The rice was too salty though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EvBfG7nx61HObDtN_Z83xA"
  },
  "dL_r_TD6U9cSt3czwDF6KA": {
    "date": "2/9/2017",
    "text": "Do you like onions? Sure hope so, they put them on all your items even when you ask for none.  If I chopped up a slim Jim and threw it in a tortilla I would have been more satisfied   I would give zero stars if possible**",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Uj1zGDIwsvis2yBf3IG_JQ"
  },
  "rnQYUD9XTBeC-XYJlK60Wg": {
    "date": "4/3/2018",
    "text": "Oh my gosh. I'm from Nogales, AZ and I've been living in Phoenix for almost 2 years now. I haven't found a genuine mexican place with tacos since I've been here. I LOVE this place. Now I know where to go when I need a taco crave !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NuyMfwYNC9lGvJLHg0fwgw"
  },
  "RVi6vqZoVaYBhrEaibcmUw": {
    "date": "2/8/2018",
    "text": "Complaints: the drive through takes forever sometimes, they need a two window system and the steak is rarely but sometimes way too fatty. Beyond that, Great flavors, good price. Try a steak quesadilla or Chicken burrito I say.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TPTKwPdXyVxqyF3q_kzEpQ"
  },
  "Hx6WaFlgEgimoMmdbHj0mQ": {
    "date": "6/29/2017",
    "text": "They really live up to there name we ordered and sat down and by the time we opened are drinks are large quesadilla and two tacos.   The food was remarkable I loved it and had no complaints at all will definitely return.   On top of all of that there great for a midnight snack because there open till 3am which was perfect for us passing threw at 2am.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AH-m_jP-1UWsPdRB0ikgyg"
  },
  "a5QeilzCV1h9NojXtPSq0A": {
    "date": "2/7/2017",
    "text": "All I can say is.... their carne asada tacos are BOMB! And their service really is speedy! This is definitely going to be my go to taco spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JW4CbtmgT9FdiWjMmdnuwA",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JW4CbtmgT9FdiWjMmdnuwA/o.jpg"
      }
    ],
    "user_id": "d5nVreVCpQdT3qIIQa8UOQ"
  },
  "Vw5zIIfekKmtilpxuH_XTg": {
    "date": "2/23/2018",
    "text": "Everytime I go to the Swap meet across the street I see this place, even at one point smelt the chicken they were grilling. So I decided to give it a try. First thing was cleanliness, I noticed nothing was wiped down, the counter was sticky and black and the trash cans smelt awful like they haven't been washed out. Not a pleasant odor to smell while eating. Next I noticed the food products i.e lettuce, salsa, pico and such didn't have no lids. Which I find weird for an outdoor spot. Also I noticed where they grilled the meat outside there was containers of spices open with no lids on them. Finally, Customer service, The Gentlemen who helped me had no manners whatsoever also had bad hygiene. But the Chicken Tacos are good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O12wPlac0ZjbdqxjwG568A"
  },
  "5_K5Fu9uVPDSBVtGgh3R_g": {
    "date": "10/25/2015",
    "text": "Hands down the best street tacos that I've ever had.   We got pretty much everything on the menu: Steak and egg breakfast taco Carne asada taco Chicken taco Steak burrito  Carne asada quesadilla.....  They are all amazing. The meats are seasoned perfectly, the toppings and cheese are great and their salsas are delicious.   Recommend this place!!!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "kCGPbwXFjYZ02kPO0Hc2Mg",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Breakfast quesadilla (not on the menu) and chicken taco",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kCGPbwXFjYZ02kPO0Hc2Mg/o.jpg"
      },
      {
        "img_id": "_xrl_qFoeoK19HwRuzhNJg",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Carne asada burrito",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_xrl_qFoeoK19HwRuzhNJg/o.jpg"
      },
      {
        "img_id": "qeVcbfG9LvzlMoRvFkLnnQ",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Chicken taco",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qeVcbfG9LvzlMoRvFkLnnQ/o.jpg"
      }
    ],
    "user_id": "uYAeoRqC_QtxqI9Vf_Pqpg"
  },
  "m-CDTO83Q8JxYhq9JP3CAQ": {
    "date": "8/14/2018",
    "text": "This was our first meal in Phoenix straight from the airport and delicious ! Definitely no frills but can't beat the price for the flavor! Especially since it was Taco Tuesday! Thank you!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JXt5SwlSv-7OrKhpT7tU-w"
  },
  "V3bvSxHqBXR_c8KUKCsDZQ": {
    "date": "2/11/2018",
    "text": "Speedy Street Taco Saves the Day after an 8-hour flight delay and a screaming hungry baby",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z95jhO84XKviBjBpGHnz1w"
  },
  "m2k5Aa-fjL2KOOIsMo4FTg": {
    "date": "3/9/2019",
    "text": "Stopped here on our way to the swap meet.. it's dirty, run down hole  in the wall right off a busy street. Tacos are greasy and beans are salty.. will not be back..",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "408N1WQ-WCjfTB-Z6ORN6g"
  },
  "X3WQBl-MqJzOA3zRxgpE3w": {
    "date": "7/26/2019",
    "text": "If you are looking at this place and not sure if you want to go or not because it looks sketchy.. stop and get in your car and go RIGHT NOW.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2MTWkbTzCkt8RorJNXIURw"
  },
  "0qRGS7JPE09TIHyx9X-7iQ": {
    "date": "2/4/2019",
    "text": "I have been here many times, there food is great.  There outdoor seating leaves something to be desired as the tables IMHO aren't cleaned often enough.  That said I wouldn't hesitate to go there, only I tend to take my order to go, especially at lunch time when this place can get very busy.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2wWBCnfF_gynz26BZXfhxg"
  },
  "khNb3SCu1ss204TYQpBv4A": {
    "date": "10/18/2018",
    "text": "This place is amazing and it's 24/7.Their tacos are sooo good.Real street tacos.Only down fall is if you go at night the location can be a bit sketchy so stay aware!!Awesome lil taco food truck though!!PS sorry I started eating my other taco before I took the pic they're just so good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-ph9p6IjwGKUmbUQUWgAog",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-ph9p6IjwGKUmbUQUWgAog/o.jpg"
      }
    ],
    "user_id": "f3s0qvh-yQ__88dYQKALHA"
  },
  "zQsnMynw0YKjGEKM3KFS8A": {
    "date": "4/10/2019",
    "text": "Great late night intro to AZ.  We just flew into Phoenix around 2am and were delighted to find the little spot open.  Simple menu but delicious.  The lady who took our order was super polite and helpful.  It's a hopping little spot even that late.  I had the steak tacos and chicken tacos.  I highly recommend the red hot sauce for the side.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AneTLckHDwIHeh8IfNsYcw"
  },
  "u_e4us7Gi-a9inZNoDrCRA": {
    "date": "2/13/2018",
    "text": "This is close to my work and I had my co-workers bring back some tacos for the Taco Tuesday deal.  I ordered 2 steak and 2 chicken tacos.  My, oh my, they were so tasty.  I especially love the charred grill taste of the soft tortillas and of the 2 meats I ordered, I prefer the chicken.    The veggies and salsas were self-serve and my co-workers did not bring any back.  SAD FACE!!  Now that I know this, I can be prepared for when I go by myself when time allows.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SR9KgvoaxcBsSd4Gds8LnQ"
  },
  "hg-EDr6jhujs7wgQHe3V4g": {
    "date": "1/2/2019",
    "text": "I was craving tacos after work and it's so near the airport!  I was lucky to get there for taco Tuesdays, $1.00 off tacos.  I had the steak tacos which are great!  I finished work at 11pm and Yelp says they're opened until 3am.  I was surprised to see a line for the drive through. They are fast and next thing I knew, the cars were gone. This is my go to after work from now on! I might have taco Tuesday every week from now on!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "cZNlvxmWynyqmvrzT06J_w"
  },
  "S2nw2NcEx_WPnzguBIxQtg": {
    "date": "2/12/2018",
    "text": "Quick and tasty food! Don't let the appearance spook you , have eaten here a few times and the food is solid. Street tacos rice and beans, where can you go wrong? Meat can be a little cartlidge-y for my liking but it comes with the territory.  Will be back to try some of the other items! Friendly staff as well which is a plus! Nice if your in the area looking for a quick bite.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DPJsO89jaPFSjWsTGAe0vw"
  },
  "7SDqfdpFY0pqqRTlTeuzKA": {
    "date": "11/5/2018",
    "text": "OPEN 24/7!!! It's basically a taco truck at a small parking lot with some tables and chairs outside. Don't expect anything fancy out of the place. Don't let that deter you though, I've been there about 5 times and I know I'll keep going back. The tacos are delicious, employees are friendly, they have a drive thru window, and did I say they're open 24/7?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UC2s8XE6ZhRoA2VckWEH_g"
  },
  "qdx4uw_el2DSSDNeks_u5Q": {
    "date": "12/4/2017",
    "text": "So I work at the airport and my parking lot is RIGHT NEXT to this place, I've parked here for 5 years but have never tried this place. To be frank, I've been scared to try it because I'm afraid I might fall in love with it and won't stop going because it's so convenient to go before and after work.. but I gave in and finally stopped by one day after my shift. Oh Boy! was this place amazing!!   Since, I've been here a handful of time and ordered, the chicken street tacos, steak street tacos (both with corn tortilla), and the breakfast burrito (flour tortilla). On the tacos, it very minimal as the name street taco would be.. cheese and a green salsa. SO GOOD!!!!  They cook it as orders are made, it tastes so fresh and they used charcoal to grill the meat so it's soooo delicious!!!   You park and walk up to order or you can go through the drive through. Once you order and pay, you take a seat (out door patio seating) and wait for your food. Every time I've waited only a few minutes. When your food is ready, you go up to the counter to pick it up and you can help yourself to 2 different kind of salsa, green and red (spicy) salsa.   As for drinks, they have glass bottled soda beverages and teas, water, etc. But the glass bottled soda's are, I think, better than per se can or plastic ones.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "R7KN86Bhty6ZJxAeWCbMfg",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/R7KN86Bhty6ZJxAeWCbMfg/o.jpg"
      }
    ],
    "user_id": "FTGsANjQEkuA2Od2PXjHjg"
  },
  "KMefETFhUocAOYyzae9V2w": {
    "date": "11/14/2017",
    "text": "Before my last visit about 2 weeks I've only had Speedy Street Tacos during the late night tip.  Ya know ... after a late night of drinking and you have the craving for tacos.  That's how my previous visits were.  2 weeks ago though I finally set my debit card up on Yelp to take advance of the cash back options from certain places.  Speedy Street Tacos had the cash back option AND the option to order directly from Yelp.  So ... I took advantage!  I ordered a Chicken Quesadilla and Chicken Burrito for $12.50.  Not bad!  The confirmation message said it'll be ready in 15-20 minutes.  Speedy Street Tacos isn't too far from me, about 15 minutes so I left out of my house immediately.    Once I got there, the guy taking my order had no idea I placed an order.  Nothing came through on his end, which I don't understand at all.  I showed him the confirmation from Yelp on my end. He said, give me a few minutes to figure this out. After about 10 minutes or so he yells from the ordering window, \"I see the order, give me 15 minutes to make it\".  I was annoyed honestly because I ordered from Yelp to avoid waiting.  I really, really wanted to just show up and eat!  I'm not sure why the order didn't come through on his end but I didn't have to pay for the food because clearly, the order went through.  I had Yelp and Wells Fargo to prove it.  (Check out the picture I've enclosed to see the order).  Also prior to this visit, I've only have their tacos, nothing else.  I didn't care for the quesadilla or burrito enough to get it again.  If I go to Speedy Street Tacos again I'll stick with tacos only and I won't order through Yelp.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "uaOjHPx4veKvirSLNdxvZg",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uaOjHPx4veKvirSLNdxvZg/o.jpg"
      }
    ],
    "user_id": "9pNcdrQLWWrX0vEGGJlEbg"
  },
  "iuOq8_aX2pTiZcuP3BR1cg": {
    "date": "6/7/2018",
    "text": "Best taco shop around! Definitely a staple in the Phoenix area for those who want a great quality taco anytime! I recommend the flan  but be aware they go fast! Great service and nice staff always happy to serve. Taco Tuesday is a must and any other day it is a great option. Order pick up or stop by and enjoy the great eats!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "p9KSbrI6E7xaVNb6kKy7kQ",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/p9KSbrI6E7xaVNb6kKy7kQ/o.jpg"
      }
    ],
    "user_id": "9rabqTAXUSTikh9DqtxJhg"
  },
  "4zRRyZ2HQ95CF3Pen-lKdQ": {
    "date": "2/28/2019",
    "text": "Great spot for a quick late night carne asada burrito! Staff is friendly and the food is great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rB99PjVzRf6FR0RV0BcT8g"
  },
  "3F3uaS0CUjhHmTBGTFhYLA": {
    "date": "12/30/2018",
    "text": "Great tacos if you're in the mood for fat and zero meat. The salsa is water, the ingredients like pico were old. Everything tasted half assed.   High priced for the quality.   I do not recommend this place to anyone",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "E2ga5HPhFRp2BxwSmdt2lQ"
  },
  "3uKetPhJaeHEoLIj0YerOQ": {
    "date": "5/6/2018",
    "text": "The food was good. That's about it. The service is horrible. I made my order with Grubhub. and my food was taking longer then what was given the expected time. I called the restaurant and the women who answered the phone was extremely rude. First she said i canceled my ordered. or i didn't even order to begin with. when i haven't even explained myself or what order i was talking about. Once i finally told this rude women about my order she gaved off so much attitude that she stated she thru my food to the delivery driver and she hung up.  I was so frustrated and mad but honestly really sad cause i have wasted my lunch time from work cause of this lunch order. i will never order from here again because of this rude women that didn't even care about a customers concern. at the end i got my food. and grubhub apologized.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "YbSlDf7UMLB2J_oQP9E0Dg"
  },
  "P_nvndVuL5uZqe6zoRq_ag": {
    "date": "6/23/2019",
    "text": "Their food is really good to eat expect for their burritos. it wasn't good at all unlike their tacos ARE amazing. that's why im giving them four stars",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UR8QFsIniGbkCibtfhTM3Q"
  },
  "UpP44DvWf8m7PguT_87rPA": {
    "date": "6/6/2018",
    "text": "Ordered some burrito and found a fly halfway through eating it. I really like their food up to this point. It's disgusting to know how filthy their kitchen must be. Be careful next time you eat their food, keep an eye for bugs!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cc9xHwS_OVllei2OZUI9lQ",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Ordered some burrito on uber eats and found a fly halfway through eating it. I love the burrito but the kitchen must be filthy",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cc9xHwS_OVllei2OZUI9lQ/o.jpg"
      }
    ],
    "user_id": "ozBXuHHlsEHxV5wfVvTh7w"
  },
  "9nafZHis-GwcZplNeOGWoA": {
    "date": "1/28/2019",
    "text": "Goooo! I read some of these reviews and didn't really want to head over to this place, but I was hungry and it was the only place open. I'm so glad I did! I don't know how anyone could give this place a bad review... first of all... the people that work here were so nice and awesome. People that said stuff about bad customer service are probably just annoying people that none of us would like anyways -- so don't listen! The food is really good and the outside is a million times better than it looks in these photos.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tp5pOlMg5mV1gdeSCUV5mw"
  },
  "QIgh2aVv9vTRdAKqLsmUtQ": {
    "date": "4/30/2018",
    "text": "Ok Listen. Yes I'm giving them 4 stars because their food is good........when it's correct.   I love this place. My friend and I come about once a week and I order the same thing every time. Chicken and egg burrito. However, about 75% of the time I DO NOT get chicken. I always get carne asada and I don't get it!!!!  But I keep going back, because it's good food.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "b6LaDZOEfRx3ZjMWAW9g5g"
  },
  "Gmuwm30VfrAiHDwtnr5Scw": {
    "date": "10/27/2018",
    "text": "I work at the marquee and have gone here numerous times for the artists   the food has always been supurb, customer service is great speed of getting even large orders is amazing while doing others.  Employees seem to like what they do and are attentive.   Highly recommend this and the Tempe location",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jpKunIpNM4tyv5Xz39Gn-Q"
  },
  "QCZXOgtDrF806wU8vFukrQ": {
    "date": "11/12/2015",
    "text": "Great find - thanks Yelp! The food was delicious and the guy who took my order was really nice. The Carne Asada burrito combo was my menu item of choice for dinner. The burrito was excellent, but the rice and beans were only ok. I did like that there was a guy out front grilling so you know the meat is fresh. Since I was by myself as a female I didn't feel comfortable staying there to eat alone so I took it to go. It probably would've been fine, but there wasn't much else around it that was open.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NVLyeo44H4lHVkjqfQKBXQ",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. A small building in parking lot",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NVLyeo44H4lHVkjqfQKBXQ/o.jpg"
      }
    ],
    "user_id": "mVSgWQfRI6eS5b5MxFwAqA"
  },
  "eCGFYdvHtpwT1q2LpTE19g": {
    "date": "11/17/2015",
    "text": "First off, I owe Rudy some crow eating for his Carindals whipping my Seahawks. :)  Now that is out of the way, I can tell you this spot is awesome. Down in AZ for only 2.5 days for a cousins wedding and we managed to eat here twice!! The steak and chicken are bomb and the prices are reasonable. Very unassuming but don't let that fool you, this place rocks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fZAjDI67B9NT5sa7q6pxfQ"
  },
  "S-XKio9kgIYRXUsA1FxcWg": {
    "date": "8/19/2015",
    "text": "Authentic fresh street tacos for sure. My deal buster for any tacos is if the place will take the time to have homemade tortillas and this place does. At first glance I thought $2.75 for 1 street taco was a bit pricey. I proceeded to order 1 carne asada and 1 pollo. When they came out I was happy to see they were packed. All ingredients were fresh and tasty! I suggest ordering an extra tortilla for each taco because there is enough filling in each taco to make 2 tacos. I am stuffed after just 2. The owner was very friendly and service was quick.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "kIvpexQaK1Bmr6LnE-ju5w",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. I carne asada and 1 pollo",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kIvpexQaK1Bmr6LnE-ju5w/o.jpg"
      }
    ],
    "user_id": "rO_VT8D7vJDxnmdYpfu2uQ"
  },
  "RC2vGeNHH5ZD-4tQmfYZlA": {
    "date": "8/23/2015",
    "text": "Speedy's is my new favorite lunch spot. The carne asada is perfectly seasoned, and the street tacos are huge and dressed with fresh veggies. $3 tacos are perfectly priced when you see the generous portion size.  The night guys are super friendly and welcoming. Way better than any 'Bertos!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "pZBqu9jfYWgr0wLKMDQ7cQ"
  },
  "0relTpCNTXXXlvj1MitmtA": {
    "date": "10/15/2016",
    "text": "This is an awesome place to grab some good tacos, and they are delicious, the staff are friendly and the place looks clean..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "g-KnPxvB8B4xjHSfHPH0tA"
  },
  "-jq1R5tjNVF4bfYC3B5ZYw": {
    "date": "8/21/2015",
    "text": "Is it 4AM? Are you HANGRY! Looking for authentic Street Tacos? Do you want them to be delicious? Don't feel like getting out of the car? Then this is the place!   I ate 3 steak tacos with red sauce. They were fantastic! As good as anything I've had in Mexico, and among the best I've had in Phoenix. The menu is simple. The prices are great. The staff is nice. It's open 24 hours. What's not to love?  They should be offering delivery soon, so that's amazing.   Go eat here!   Now!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "oaaEXgQ3x51cXE3GTXrT1Q"
  },
  "7TGWNgGa-HcNEv7z40kGIQ": {
    "date": "4/24/2017",
    "text": "We were staying by the airport and wanted something to bring back to the room. This place is very good. The carne asada burrito was super tasty. Next time we fly onto Phoenix this will be our first stop.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YVd_H5Qu-fmVbC7CF0Xolg"
  },
  "jdmXFYoYfpi6wPPbziiz5Q": {
    "date": "9/4/2015",
    "text": "I had one Chicken taco and one Carne Asada taco and two Chicken Quesadillas it hit the spot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "c1e1nUYa1fTrGb7Bdf8W6Q",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Chicken taco and Carne Asada taco and two Chicken Quesadillas good stuff.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/c1e1nUYa1fTrGb7Bdf8W6Q/o.jpg"
      }
    ],
    "user_id": "6zAWJ-sdfGYlRdeWMW3LVw"
  },
  "jBVL-Nb-xxjEtQ91hooxjg": {
    "date": "1/3/2017",
    "text": "What happened here? Did they change owners or perhaps the staff for New Year's Day just not the same? Certainly wasn't the same as last years experience and certainly the burrito size shrunk almost in half. Tasty, but not the same as last visit so perhaps the holiday resulted in some short cuts made in the kitchen :-(",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "feqKggw2Ut_Z89L2bjflsQ"
  },
  "aGr2cHGXTSHoFw3VYI7utw": {
    "date": "5/31/2017",
    "text": "This place was so good. we went on Tuesday and got the Taco Tuesday deal. I got two chicken tacos and 1 steak taco and they were really good. I would definitely recommend this place to others.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8TBJiWReorjG3ReWtH3aJA"
  },
  "qEuQP1V9UthhAO_Eqd3w7Q": {
    "date": "5/29/2017",
    "text": "Excellent food! Really gives you that backyard Mexico feel. I will defiantly be back! Food was amazing and staff was amazing",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fPZaNBQFPjwcUC3gi90VJA"
  },
  "qDwZ67YkXgLnzq4IKBoYdw": {
    "date": "5/29/2017",
    "text": "Basic menu but really good tacos. They have a great little salsa bar with pickled onions and cabbage. Tacos and burritos made to order and from the look inside the building it looks very clean which is important to me.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sPRU56FOyY58rnKja-KXGA"
  },
  "ptMtbZNevqu2VJRBayKxMA": {
    "date": "2/8/2017",
    "text": "Delicousness! My husband delivers all the time for speedy street tacos so we thought we would try it out. It was SO GOOD. The food is fresh and the chicken tacos are to die for. We will be back !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "18oqQgGNnxSBtNwOVU-OgQ"
  },
  "zDxDUS5R4skbud0CSJvRiA": {
    "date": "1/27/2017",
    "text": "Amazingly delicious, cheap, and convenient.  Would be a 'go to' staple for a quick meal if I lived in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ds71wn4P3vTSQsQ6rOaIPA"
  },
  "ujXvjJKFWkCl8yW9H7P-yg": {
    "date": "8/18/2015",
    "text": "My first time here today. Let me start off by saying that I love a good carne asada burrito. I've had them at many different spots. Speedy's carne asada burrito was absolutely delicious. Definitely the best yet! I also enjoyed a chicken Taco. Everything was fresh and delicious. The service was also great. Very nice employee's. I highly recommend it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Qd3hGg0JQEeMETlpiV5uw"
  },
  "CAExNnPX-tPBybAQbdL0Fg": {
    "date": "7/9/2016",
    "text": "Excellent tacos. My daughter and I had carne asada tacos which were yummy. My husband had a carne asada burrito and he loved it. Their tortillas are amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "28SA8CuSHHLvPuvAorrANQ"
  },
  "0zoMWPfpfL6uEWLOXpO6ZA": {
    "date": "9/9/2016",
    "text": "Great steak and chicken burritos. Well seasoned. Great staff. Tortillas are handmade and delicious. Try it you won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6aR9L_vw0p_dPbYgnFPHSw",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6aR9L_vw0p_dPbYgnFPHSw/o.jpg"
      }
    ],
    "user_id": "ogD6eh8nZOZlLd7DUhRGoQ"
  },
  "74gZUa3lrnyBR3TPVWz4Bg": {
    "date": "2/27/2017",
    "text": "I have passed this place on the way to the airport, and was curious to try it as I LOVE a great burrito.  I used UberEats to deliver it last night and did not have a good experience.  It was estimated to be a 30 min delivery, and took an hour.  It looked as if the hold up was not Uber, but \"speedy\" tacos themselves since the app stayed on \"preparing your food for most of that hour.\"  When the food arrived the cheese was still in shredded shape and cold on top of the beans, not melted which means the beans were not hot when it was put into the containers.    The beans were decent, and cheese flavor was good, but they were a little too salty.  The steak quesadilla was not edible.  It was burned on one side, and not grilled at all on the other.  It was soaked in grease, so either the cheese was super greasy or the cook just put it on a REALLY greasy grill.  I have a feeling it was the grill.  I'm imagining this cook doesn't take much pride in his work.    The tacos were ok.  The chicken is better than the steak.  The steak has a weird almost powdery consistency to it.  I'm not sure if it was tossed in flour or if that came from something else.  Either way it wasn't tasty, and I didn't eat the steak taco or the steak quesadilla.    They use a pretty good quality flour tortilla, which is key to an AWESOME burrito.  I had a bean and cheese burrito, and since the beans were over salted, the burrito was just ok.  I think this place has potential to do more business especially with delivery services like Uber, Grubhub, etc, but the owner should have a few friends order using all the delivery services to see they food quality they get when it's going to someone anonymous.  There are a lot of great cooks out there, who can cook this sort of uncomplicated food, but they have someone working for them that isn't one of them.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Csuxk4spXdU7QE9FPmC-sg"
  },
  "EC_yAfiNpHYiyumaSYPW8A": {
    "date": "9/3/2015",
    "text": "Great tacos at a fair price. They also have the legit Coca-Cola with real sugar. Salsa is very fresh and very delicious. Drive through is very convenient if you're on a time crunch as I usually am. If you're looking for authentic street tacos no matter the time of day, you found the right place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "N5m5mRpHDOhaIkOLvxyvpg",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. 2 steak tacos, 1 chicken taco with salsa and onions.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/N5m5mRpHDOhaIkOLvxyvpg/o.jpg"
      }
    ],
    "user_id": "uNEVQiD8u9q_SJ_TTzoXxQ"
  },
  "1IDlcZh40Zg7ZUxyb2v3-A": {
    "date": "6/22/2016",
    "text": "I'm not gonna lie we drove by this place for like a month and was a little scared to stop since it's a True off the road taco shop, figured if we ate there, last meal for sure. We finally cracked and got breakfast burritos and they where simple awesome, delicious and perfect...been back 3-4 times for the tacos and regular burritos and very good as well. This place has honestly been a treat and the staff is super nice and friendly as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yit8WjcykRfYge8sEKl_qQ"
  },
  "1tKi1k42ZxkEOK1EWkY7vg": {
    "date": "12/30/2015",
    "text": "This is a must stop taco truck if you enjoy authentic Mexican food. We pre-ordered and paid on Yelp. Food was hot and ready when we arrived. We sat outside in the sun with a wonderful mountain view. I ordered the hibiscus tea and steak burrito. The tea was just sweet enough, the burrito was to die for - and there's a fresh salsa bar.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "I-g80pfvt6EQqtmBuL168Q",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Steak tacos were incredible!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/I-g80pfvt6EQqtmBuL168Q/o.jpg"
      },
      {
        "img_id": "r3oXjXVPvR2gO7M5tXCJAA",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Steak burrito with salsa verde",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/r3oXjXVPvR2gO7M5tXCJAA/o.jpg"
      }
    ],
    "user_id": "LzP-pB5wy1m6UdmKElWVzg"
  },
  "6b64ygKC0iquYNzz4ppuzA": {
    "date": "3/18/2018",
    "text": "Great burritos, tacos, and quesadillas. Really really fast as well. Just wish the portion sizes were a little bigger. Otherwise, fantastic.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aXtFIqGrfL_r3vyrxtjX0Q"
  },
  "mqoiNBRJMFULq2JnuQB0ZQ": {
    "date": "1/25/2018",
    "text": "Ok they had some issues with my yelp order, but they figured it out fast and made my dinner for 3 lightning fast.  Wow! The tortillas are awesome, breakfast burritos and Ben burritos were out of this world awesome.  Salsas were all hot and awesome.  Thank you!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ds_VobIhG_hsNFsZhQ-8Hw"
  },
  "svvEAFFZuyWBf9TeHfallA": {
    "date": "4/13/2017",
    "text": "Not speedy but ok. Steak burrito was decent. The size and quality don't make up for the price. It's the convenience your pay for here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3pP94BaZem36sXyBc1EsUQ"
  },
  "usRbVJGbC2znp0pQbd8TWQ": {
    "date": "4/26/2017",
    "text": "Service and quality has gone WAY down hill.  I've come every couple of months if not more since opening.  The last few times the employees do not even seem to want to be there.  The beans and rice have been salty and bland outside of the salt.  The rice is stale, likely it is old.  Both the chicken and carne asada has been dry.  I used to love this place.  It's time to find a new taco shop.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rWBpiqt8bMaJPlDVSHBA1Q"
  },
  "8Gcrb0WfMWfRvH4UshVAuw": {
    "date": "4/25/2017",
    "text": "I've been here before and I loveeeee the Tuesday deal.. but todayy the tacos tasted like pure onions! Can you guys use a different knife when chopping the cabbage and other stuff. I hate onions so now I feel like puking. Yuckkk!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QDj6guA6UUXBrK6aOxh_8g"
  },
  "1hubjA2cxIW8gOm7HzlUTg": {
    "date": "12/18/2015",
    "text": "Yeah, Baby... Tacos, Burritos...oh, my. Great flavor, fresh stuff. Limited menu, but what they do they do so very well.   Outside table seating, super friendly folks! I had the steak burrito...so good.   Prices are good, value is excellent. Being open 24/7 is a real bonus. I'll be back. A lot b",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "TTsbBiTfAhvbyTtmvHwBYQ"
  },
  "PuiL6AOw53rpfdUuv4UJdg": {
    "date": "4/8/2016",
    "text": "Awesome carne Asada corn tacos!!!  Got to stop by and super nice too.  Simply done with some guac then u put on any fixings like pico de gallo or red onions or picante or salsa verde - it's all good! Sip down some tamarindo (no cervaza bummer) and ur all set",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a0oV0hlLgcTf7x633HCVKQ"
  },
  "SFdCTQcuFUaDDCQ9bWWLHg": {
    "date": "11/22/2015",
    "text": "Went here about 5 am and really enjoyed the service and the food.  I had the steak quesadilla and steak taco with verde salsa.  The only reason I had to give four stars was because I ordered a steak breakfast burrito and my boyfriend wants to take it back... However he is A very finicky eater...so take his opinion like a grain of salt like I do. I would go back though.  ***UPDATE*** They close @ 3 am now :(",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "tsdrtV6SNA2-rEk9GXAkTg"
  },
  "4aEEBQUd7GVpIPmONnnEOg": {
    "date": "2/28/2016",
    "text": "The tacos here are decent. I come back if I'm in the area and just want some street tacos. Only if I'm in the area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "np_PA4ejejVhk4klYvnMDA"
  },
  "OyVg34rfo5nd1kKW-JigIw": {
    "date": "8/21/2017",
    "text": "I really enjoyed the food here. Fast service and great location right by the metro.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rKUXjHnceGqfN29Qp7nSxQ"
  },
  "sgjDp661Nc_bhuLrVTOYUw": {
    "date": "8/19/2017",
    "text": "This place is really good lots of flavor in the meat, good portion and they are speedy. I ordered a carne Asada taco and it was great. The only thing is that it's to pricy. $3 a taco is to much but they are good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZLipTDQVRe8EgEFI0a627A"
  },
  "_JlhYaRA84nJBxsf3onDvw": {
    "date": "6/27/2016",
    "text": "went to lunch here today and we got food for our whole shop 7 guys everyone loved the food  only complaint was the guy who picked up the food forgot one burrito their  but that is his fault not speedy tacos  we could not find a website or a decent photo of the menu so they gave us menu cards for future orders  ill post the photos up with this",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_nByyNdSrXxxcY3tWRDM2w",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_nByyNdSrXxxcY3tWRDM2w/o.jpg"
      },
      {
        "img_id": "v6jAEFtJGE-I2RjOYg9NTg",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/v6jAEFtJGE-I2RjOYg9NTg/o.jpg"
      }
    ],
    "user_id": "ifn1cWyI6v0EC3bn2yhVvA"
  },
  "QAH5kOntzQXrIHrYN1qGxQ": {
    "date": "1/23/2017",
    "text": "Been here a few times, and it's generally good. $9.25 for two tacos, beans and rice today is the reason for the two star deduction!  Carne Asada is generally to my liking as I prefer tacos Al carbon.  Today they were still good but some of the meat was very grissley and unchewable!  Todays meal didn't include a drink, and the refried beans were straight out a can, and the rice is undeniably Uncle Ben's Spanish Rice mix.  Best to go on Tuesday's for Tacos only as they're discounted $1",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Jhl62zVf7JxUDdpS-WjqjA"
  },
  "emvEDQxfcnPhjsRzMMmAtQ": {
    "date": "6/11/2017",
    "text": "Used UBEReats for hotel delivery. Quesadilla was good, not great. Veggies were great and the verde sauce was delicious. Get that full liter Mexican coke for $1.99!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eu9V1EqqyajT-mCCRu9avA"
  },
  "6TbGgzinxSR6uuDzwNe6jQ": {
    "date": "7/28/2017",
    "text": "Carne Asada taco was killer.  Great food and pricing. Ambience is that of a Street taco spot but with nicer tables!  Check them out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Z9NrYoHJwEVoQHKlBEpng"
  },
  "Q5tNbc0szKtCTf73_tZOEA": {
    "date": "7/24/2017",
    "text": "I was in a jam waiting for my food from grub hub for nearly 3 hours, come to find out my order was cancelled, even after my food had been sitting there for 1hr! I appreciate the restaurant making sure I received my food by not only cooking my food once, not twice but 3 times and ensured a courtesy delivery! I will never use grub hub again, but I will now make Speedy Street tacos my number 1 spot!  Greatly appreciated their communication with me although it was not their fault. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QQCrXVZFxfwlW8IN7tsolQ"
  },
  "u8QNKHEbB1bF_WIhRgcZTQ": {
    "date": "4/11/2017",
    "text": "We ordered 2 steak burritos and 1 chicken burrito, plus a chicken taco. Everybody enjoyed their food, and thought the atmosphere was unique. It's outdoor seating only, and an informal atmosphere. Really informal I mean! We liked it enough that we are going back for lunch when we visit the Pueblo Grande Museum nearby.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tRQ_prWuWq2EbiG6QXL4qg"
  },
  "y1mZUS65Hsed8HISBERsug": {
    "date": "2/4/2017",
    "text": "24/7 and made the terrible hotel I was staying at somewhat worth it. Great food, cheap, and always open--what more can you ask for? If you are stranded like I was in Phoenix, then I recommend you checking this place out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HSCSuPpJzVDqknzCGHOvzg"
  },
  "RMW1DS7aiqpPmqu8oFjlAQ": {
    "date": "12/17/2015",
    "text": "-2nd best burritos I've ever had here (nothing to sneeze at though since I've tried a lot of stands, restaurants, and hole-in-the-wall-type taco joints. They're still certainly really really good without a doubt, just the place that's #1 is really really really good and has the advantage of being a full-size restaurant).  -They're open 24 hours.  -Their stand/tent is really nice. It even has TVs so you can watch ESPN or other sports.  -Prices are fair, especially for how good their food is.  -The guys who run it were nice and cool too.  Overall, it is everything you could want in a taco stand and a pretty easy and well deserved 5-stars.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "SvUtoAeyY3cJFKWSRK7Ukg"
  },
  "rE9O_SzttscHk0uibCUUqA": {
    "date": "4/24/2019",
    "text": "Didn't know what to expect as I drove up to this taco shack on the side of the road, but so glad I heeded the recommendation. Their tacos are delicious! When reviewing the menu just know they serve 1 taco per order, but it includes all the fixings (guac, pico, pickles red onions, etc) on your choice of corn or flour tortilla. A must try!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-EjYIHPjjYl3RuIgViNnQg",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-EjYIHPjjYl3RuIgViNnQg/o.jpg"
      }
    ],
    "user_id": "BXTSATl-oBdtnPQHpMeL0g"
  },
  "vl2PEQByLd2Zw10qxCD8Wg": {
    "date": "10/28/2018",
    "text": "Walked a few blocks from our crew hotel to eat here, after we heard about this place from another flight attendant. Very simple place; really almost like just a permanent food truck. Outdoor dining only. Tables not very comfortable, but that's ok. Tacos come on either flour or corn tortillas. Quesadillas are only on flour. Delicious green avocado salsa. Good spicy red salsa too. I liked the quesadilla more than the taco. No beer, just soft drinks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "sKfkhb0NnQ5K9Ricp-KBqA",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sKfkhb0NnQ5K9Ricp-KBqA/o.jpg"
      },
      {
        "img_id": "_ID93fY2CprlFHqACqa32g",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Yes, that&amp;#39;s an animal shelter next door. No mystery meat here!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_ID93fY2CprlFHqACqa32g/o.jpg"
      }
    ],
    "user_id": "qTL_Yu1LYndKGRGwVY9TMA"
  },
  "toTcmjB3d5pT-tZtNsJiqQ": {
    "date": "5/2/2019",
    "text": "This outdoor patio type of Mexican eatery is located at 40th Street and Washington on the northeast corner. For tourists and locals that are staying near the airport it is a great alternative to the overpriced, bland and very expensive hotel food. Large burritos are under $7. great little place easy to miss if you're not looking for it but definitely worth a visit. I hope this review helps those who are hungry for some authentic Mexican food. Thank you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "M2O2eWihi8lYbUTcSg7T1A",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Carne asada",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/M2O2eWihi8lYbUTcSg7T1A/o.jpg"
      }
    ],
    "user_id": "CSold_OPEdt26xg-JDcdAw"
  },
  "eJ807AQDfXCIO4-LOz69iA": {
    "date": "4/4/2019",
    "text": "Tacos were good can't say they're better than back home but for your 24 hour fix and a short walk from the hotel it was worth it. Service is quick, plated nicely. And you can tell crafter with care. I'd go back. Meat was a little bland but tacos are tacos. Loved them also offering a small breakfast menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nfgBPtvomw4549gcc1f6bg"
  },
  "M94Mnk_6kdtPqDg3bP8h9A": {
    "date": "2/11/2019",
    "text": "Going to have to say probably some of the worst tacos I have ever had do not go there... you have been warned.. every bite of my street taco I took had gristle in it The flavor was not good. Place was not clean they have barbecuers out front but the meat is not barbecued. I seriously feel like I could throw up.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9Q-HZRJncMmU634BSzvuhw",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Every bite of meat had gristle in it and it did not have good flavor.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9Q-HZRJncMmU634BSzvuhw/o.jpg"
      }
    ],
    "user_id": "62JJoUPxKxqb6snMJxi2ng"
  },
  "o9a9R5Evra2Qc6yJGKRRWg": {
    "date": "6/30/2019",
    "text": "Raised in so cal specifically SD and LA.. I LOVE this place. It's exactly what I've wanted out here in AZ. The carne asada was bomb.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LgEJ02fXdWslDCO8QS8Ocw"
  },
  "WvUgkX5A_eXVYh3kzY0KXA": {
    "date": "7/3/2019",
    "text": "So found this place on Google was excited to try it but turns out it wasn't that great. The cashier was rude. Food didn't have much taste. My burrito wasn't even wrapped up. The salsa was basically water. The horchata was just water as well had no flavor whatsoever which was so disappointing. Over all not a good experience.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E1usS4MPQ1HbA-Y-YHHKpw"
  },
  "pPA9MLrn2t-wznBuP9nlAQ": {
    "date": "1/28/2018",
    "text": "I was craving for a hearty breakfast, since I'm know I'm going to be having a long day at work today, so I decided to walk over from the Doubletree Hilton hotel, over on 44th St, to this little joint, for grub.  Located over on 40th Street, it's a small free-standing joint.  You order your meal from the window, and the food comes out within minutes!  I ordered myself a steak and egg burrito.  Holy cannoli, it was mighty delicious!  The burrito itself isn't super large, however it took me two settings to finish it.  The eggs and the steak marinate the flavor of the burrito very well, and its taste is absolutely delicious.  They don't have an extensive menu, but I can bet whatever ordered has to be pretty good.  There was a guy outside that was grilling chicken on the open flame--so awesome!    For the price of $7.00, the meal satisfies my needs, and I know I won't go hungry for several hours, at least until 6PM tonight.  I'm glad I found this little joint, and it was defnitely worth the walk from the hotel.  Overall grade: A",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0aJVOEwpT4MP19Pci7_rtg"
  },
  "6npx8RkOvUJqyRAWtOhkUA": {
    "date": "1/22/2019",
    "text": "I come by here for lunch every once in a while and have to admit, it is HIT OR MISS. that being said, the staff is always friendly and courteous and there aren't many good places for Mexican food in the area. I'd say about 85% of the time their food is fantastic and my only real complaint is their Horchata is overly sweet.  Speedy's is definitely worth giving a chance.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "HpBcbDco32rf2I9V6Bm_iA"
  },
  "jh0aD4uqS6J-Z4ip73NeOA": {
    "date": "11/9/2018",
    "text": "Surprisingly tasty for how it looks on the exterior. And True to the name, very speedy for sure. I just wish their dining set up was a little more friendly during the colder months. Maybe hang up some tarps to block the wind, something. And during the summer, perhaps set up a rotating fan or misters? People who wish to dine there and enjoy food right as it comes out, really do not get a pleasurable experience. And take out orders, the corn tortillas are soggy by the time it makes it to its destination.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZzxfIQRL7AssuXzepfjsVA"
  },
  "ERptsTFRJWwJqsvmJHJR7g": {
    "date": "10/25/2018",
    "text": "I often drive by this place in the morning, passing through the haze of Carne Asada smoke charring on their little outdoor grill.  The aroma is awesome.  I finally just had to try it.  With a couple of bucks from cash tips burning a hole in my pocket, I swung in one day around lunchtime.  This little place has had several names and is conveniently located across from the college and catacorner from the world famous dog track swap meet.  It is currently Speedy Street Taco and comes with the savory aroma of that smoke wafting around, I'm not surprised if they do a decent business.  I ordered a Carne Asada burrito from the nice lady at the window.  I grabbed a table on the small outdoor patio, surrounded by working men and women.  You know, the kind of people that wear orange vests and get our streets in working order.  Good people.  Shortly, my number was called and I grabbed my burrito, squirted some green sauce into a cup and headed back to my table.  Sublime.  This is street-taco heaven.  The Carne Asada burrito has a decent amount of smoky-savory beef, and some other stuff jammed in there.  I poured on some of the sort of hot sauce, and scarfed this burrito.  It was awesome.  This is a working-persons meal.  Ambiance is a fenced in covered patio next to the grilling area.  It's basic.  It's delicious. Try it, you'll see.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "hZtc9ARVP0XiVIickBrPpw"
  },
  "pg1UqvqoveB9gX6mqlLwMQ": {
    "date": "6/19/2018",
    "text": "When I arrived in Phoenix last month I was famished, so I jumped on my Yelp app, and I found this place nearby my hotel. So, I walked several miles excited because of the great reviews. I decided on the asada burrito, and continued my walk to take in all that Phoenix has to offer. That will be the last time I walk, at night in the neighborhood, but definitely not the last time I enjoy their tasty food at a very fair price! The service was meh, not very friendly, and that's why I couldn't leave five stars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "e3zQM5VV5r8iVdLci0mK9w",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/e3zQM5VV5r8iVdLci0mK9w/o.jpg"
      }
    ],
    "user_id": "0t9FFPUWHfb5CGHcXBK9ig"
  },
  "cR-53TG851mXI7uxpNVigA": {
    "date": "12/4/2018",
    "text": "Highly recommend, felt like I was right on the border of Mexico with the glass bottled soda and the set up! You can tell the tortillas are homemade the corn and flower! I will for sure be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UFtD2LAStXt11GzysJwJrw"
  },
  "WYehpn8buwBd5mCmqe-ogg": {
    "date": "7/23/2019",
    "text": "Had tacos and a quesadilla there a few days ago. The service was quick and friendly. The quesadilla was small. I'm definitely used to a large tortilla, folded in half. This was 2 smaller ones with cheese in the middle. Tacos (Asada) were good. Plentiful and great taste. Outside seating or to-go orders only.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XMkhqriJP4TIY1-alXkGfA"
  },
  "qq3PlLHVtxWWYKNvVwoSYw": {
    "date": "5/12/2019",
    "text": "Food was amazing!! Tacos came with cabbage, guacamole, pico de gallo, and pickled onions. I  was a bit nervous about the onions but they went perfectly. Service was really quick too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "osM5_kuJ6g7gxWHFHl9aeQ"
  },
  "CzS1mVgQaxxoohXPzNDxrA": {
    "date": "6/27/2019",
    "text": "I was staying at a nearby hotel. I tried Uber eats..for this order. I had the chicken burrito and the taco. Let me say both were perfectly tasty. well prepared. very fresh ingredients and with the burrito the tortilla was lightly I guess warmed / toasted with a bit of crispy to it. Arrived warm and fresh. the refried beans with cheese..excellent. Do not miss this place..Awesome..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uRw19020J_N2ADGm1m7Nsw"
  },
  "eqNbeEp6a_QPIM2oKBzeEw": {
    "date": "3/22/2018",
    "text": "TACO TUESDAY MUST  They have great flavors, juicy carne asada, and excellent prices. Awesome salsa bar with pico and tomatillo sauces plus cabage and limes. Good corn tortillas, not much more you can ask for for this north of the boarder  Probably one of my favorite taco places of all time",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Ez2Y_3TiRoaAFaOgh1IkWQ",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Carne asada tacos with cabbage from the salsa bar",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ez2Y_3TiRoaAFaOgh1IkWQ/o.jpg"
      }
    ],
    "user_id": "p1NpTWVjVnM0515uaEnVDA"
  },
  "QEfAgPqjwPFDRRftDUt-vA": {
    "date": "11/1/2018",
    "text": "Down 85 - 86. 36 seconds left. Stockton dribbles up the court. 29 seconds. Stockton passes to Malone in the low-post. 21 seconds. Jordan flies off his man, blindsides Malone from his back-right for the double-team, swatting the ball from his hands in the process. It sputters to the floor. Malone dives. Misses. Jordan snatches it up. Bulls ball. 19 seconds. Jordan moves it up court. 15 seconds. Left side from the top of the key. Russell locks in to defend Jordan. 13 seconds. Russell approaches, establishes body contact. Jordan leans in, feeling out his defender. 9 seconds. Jordan then darts in towards the top of the key. Russells shuffles to match his opponent's speed. 8 seconds. Jordan stops on a dime. Russell, off-balance, stumbles. The momentum of his body goes one way. His feet go the other. He skids out, stumbles to the floor. 7 seconds. Jordan steps back -- three feet of space between him and the fallen Russell. Jordan gathers, rises, and sinks a jumper. 5 seconds. 87 - 86. Bulls take the championship.  Confident. Bold. At the top of his mastery. Knows what is expected. And then delivers.   Greatness is hard to articulate. There's a mystique to it. That mystique is what separates greatness from the normal. But you know greatness when you see it. Go see Speedy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KiwvYxl4NPyxo-hptrjZCQ"
  },
  "_VtnxlVjxzBw0VOY36jXPA": {
    "date": "4/7/2019",
    "text": "They do not make street tacos. I ordered a burrito de asada.. salsa was good.. Wouldn't go out of my way to eat here but would probably stop by if I was in the area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mtd_BQoij0E6SG-SuzBZUQ"
  },
  "za4MLsg18SUT6WcgjTm_ew": {
    "date": "12/6/2018",
    "text": "Cheap, fast, and absolutely amazing steak tacos. If you're staying around the airport, go here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "u5E1pwWIj3o5KG72RCz3GA",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/u5E1pwWIj3o5KG72RCz3GA/o.jpg"
      }
    ],
    "user_id": "Wv0MvNNrnPezPikfW8Fusw"
  },
  "9pIr4LqCuoDlB8uOBNhuBg": {
    "date": "10/29/2015",
    "text": "Best tacos ever! I got chicken tacos and chicken quesadilla. Green salsa is delicious.  I would recommend this place to everyone for quick, tasty and cheap meal!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FrLvp2cUPr488Ae90QBSdA",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FrLvp2cUPr488Ae90QBSdA/o.jpg"
      }
    ],
    "user_id": "DDLxtLsPjdkDn-DaBjCS3A"
  },
  "wS4T-MWeou369kYK2NQO9Q": {
    "date": "2/5/2017",
    "text": "The pollo and carne asada had really good flavor. The flour tortilla was also very good. I would skip the rice and beans and just get another taco. The salsa however was weird and watery.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "5O5Kz2VyXsgihLqlMgiUEg"
  },
  "rqrJbJ9zu9DTkdJCLpMPww": {
    "date": "6/17/2016",
    "text": "Best Mexican food I have had in Phoenix.  Good service, good taste and cooked well. Ingredients seemed to be of quality and the kitchen looked clean.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SclzjrkOHxMYqhMI77eGuQ",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SclzjrkOHxMYqhMI77eGuQ/o.jpg"
      },
      {
        "img_id": "59OdFCbR2FnGayLOcOp5hQ",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/59OdFCbR2FnGayLOcOp5hQ/o.jpg"
      }
    ],
    "user_id": "Wu-yg4k0EgOeU2xuG6tcyw"
  },
  "_Yh0iy-nAgjbpltgerHtaw": {
    "date": "8/18/2017",
    "text": "Legit tacos and Quesadillas. Horchatas were pretty darn good too. Plus the guy working there seemed like a nice dude.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xe1jRUynk_DEImP5oBqiXg"
  },
  "x_1Q08tgRVDFOjLWIePP4w": {
    "date": "3/17/2016",
    "text": "Was looking for open places near my new apartment and this one popped up. Got some horchata, beans, chicken quesadilla and a steak taco. Everything was pretty good, my only gripe would be that the chicken quesadilla(more like tacos) was pretty oily. Otherwise it's a good place to grab a quick bite.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yGXKMV1omio1I_3qNLdtAA"
  },
  "QP7gBKICozDgFhXvjuh8xg": {
    "date": "9/20/2017",
    "text": "This place is my addiction. I found them on Uber eats but I began to go to their location. Reminds me of Tucson food",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ST3BwIZIwfta8-NnoL-vfg"
  },
  "X4rhzfh0TmQmbPYwhhnN2g": {
    "date": "2/8/2016",
    "text": "Stopped here today before my class, as its conveniently located across the street from Gateway Community College campus, and I have mixed reviews about the place. I opted for the chicken burrito, it was a decent size with a good amount of meat filling, but I thought $7 was a little high for it. I had the green salsa and it was decent but there was no way I was going to use any of the lemons sitting out in the tray. They looked like they'd been sitting there for days, dry and crusty. That's why I'm giving it the rating I am. Instead if cleaning during downtime, the crew was out back smoking, and that left a bad taste in my mouth. Don't know if I'll be back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CYGwTiisXuUqqqmcJF9Bgg",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. I don&amp;#39;t know, but this doesn&amp;#39;t look very fresh to me.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CYGwTiisXuUqqqmcJF9Bgg/o.jpg"
      }
    ],
    "user_id": "O8hhc2bNUceYBoQumcOEdQ"
  },
  "xUynIbfyjXW1kzMK8s8yNw": {
    "date": "9/14/2016",
    "text": "Speedy a was a mile away from my hotel but the front desk lady said it was good so I walked there. The burrito was worth it. I couldn't chose a meat so they made it mixed. Loved the salsa bar, pico, lettuce, limes, pickled onions, it was taco-truck delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SSZUswNTJjBCIoCS5CT8oQ",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Mixed burrito, chicken and carne asada",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SSZUswNTJjBCIoCS5CT8oQ/o.jpg"
      }
    ],
    "user_id": "vePuPzlXiD3Pg50R4RtlNA"
  },
  "Kmo7C0uGMQNlFlzKrxNt8Q": {
    "date": "4/17/2017",
    "text": "What a gem of a taco joint, hidden in plain sight just minutes from the Phoenix airport. \"Speedy\" lives up to its name, as our pollo quesadilla and carne asada tacos were ready within minutes of ordering. Do not be put off by its post-industrial exterior and hard scrabble neighborhood. It is clean and tasty with friendly service.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6I_uAum5YER1jqELzwwhgQ"
  },
  "ip1ZsaCtFynRdU21kIy-kw": {
    "date": "2/5/2016",
    "text": "Normally I love coming here. Work very close by and whenever I don't have time to pack a lunch I just walk over. Very quick, pretty cheap and good quality. Staff is very friendly, and their man Rudy: awesome.   Today was a little different. New lady working there made my burrito and it was way to small for their price of 6.50. Pretty sure she jipped me on some ingredients. Second, she forgot my side of guacamole. The crew there knows I love my side of guac and not getting it was a disappointment. I know she's new so hopefully she gets the hang of it but if she keeps jipping me on my burritos I will not be a happy camper.   Like I said Rudy, he's tight and their girl Jasmine, she's cute.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Tqgl5EOV8vcbDEIcWFWiYA"
  },
  "Jsj2-mCWOBqHOetEJj1KbA": {
    "date": "2/23/2016",
    "text": "This place is awesome! Easy parking. Easy and quick to get your food. Food is quality and tastes great.  You dont feel like you are settling, even late at night.  I have been back several times and would recommend again.  The breakfast tacos are awesome!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "O8sFfwEhHFPEgLjjExjtfQ"
  },
  "z1AU61zGqCUFtwP5_5yVVw": {
    "date": "2/10/2017",
    "text": "Building was somewhat unimpressive. Outdoor seating only with a drive through. I had asada tacos, some pieces of the meat were a little chewy. It is a must visit! We went on lunch time from work and our food was fast and the weather was gorgeous so we enjoyed sitting on the patio. Maybe not somewhere you'd want to go in the summer because it would be too hot. Only complaint is the salsa. It was too watery.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qj-Hw4foEm-km9SRmCaDUQ"
  },
  "SJg92p0FtJpB1xtdKZYkXQ": {
    "date": "7/5/2017",
    "text": "I don't like leaving negative reviews so I'll just say the food is worth 3 stars and the service 1 star. At those prices I won't be going back again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CXO_PJrOgIfyQTpaeg5dkg"
  },
  "WNWzaW8FYsMfJJT6695voQ": {
    "date": "4/1/2018",
    "text": "The food was amazing and the service was phenomenal. I came here on a whim and I will definitely be coming back. The steak was juicy and delicious and the burrito was everything I wanted and more",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ICXBjFCiGKc64FWyJygFDw"
  },
  "uTxK6Bv8CFAYZpsNyeUnOg": {
    "date": "2/7/2018",
    "text": "Passed this restaurant on my way to work. Stopped by with my colleagues and tried them for lunch. Had a steak taco, and a chicken taco combo along with a cheese quesadilla. The food was good, the price was reasonable, the place was busy. Would stop again when I am back in Phoenix.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AsrmYtzJB3M-ko96nbfshg"
  },
  "QRWYeBHTeW0azh4ZFW6u2Q": {
    "date": "1/18/2018",
    "text": "Great tacos. These guys don't pretend to be something they're not. It's just straight tacos. Corn or flour tortilla. They'll put some cheese and a dollop of guac. The rest is your choice at te salsa bar. Make sure to wash it down with a Mexican Coke. Open 24 hours a day! I don't know how they manage that.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6FLHZ0SiDdEPV55vlbkZAw"
  },
  "CSqHvtHYU-6arWuGBXfkvA": {
    "date": "10/6/2017",
    "text": "Really great! Quality is amazing, prepped on site, portion is decent and reasonable in pricing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q4taS0U1go63wER5QFqwRg"
  },
  "ZQJcSmArVzEdLqOS7NG1kQ": {
    "date": "8/3/2017",
    "text": "DO NOT ORDER ON UBER EATS!   Images of food on the app doesn't consist with what they send. I ordered a steak quesadilla that looked like a large flour tortilla folded in half and received a tiny quesadilla for which I paid $5 plus $2 extra dollars for the rice and beans that they FORGOT TO SEND!   I've ordered before and haven't had any problems til today. Not happy with the service. There is much better taco shops than this place. My advice skip going to Speedy Tacos.   The price doesn't match the quality.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i9smOuk8L9m0y9-CMsFgMw"
  },
  "PHT0bh5LcDz8b351sz1Xaw": {
    "date": "3/12/2017",
    "text": "At 1:30am, it beats Filibero's in taste. Pretty delicious. Took one star away because the guy at the counter is a grumpy dude who can't smile and probably needs a full night of sleep. Like me.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aP_DLkcpRcqLdQl6uYoD3g"
  },
  "j9gFbhhJXe6o-llMD53kVg": {
    "date": "6/10/2016",
    "text": "I can honestly say I was not satisfied with this place . I ordered three beef tacos and I expected quality, especially for the price.   The beef was mostly fat and cartilage and tasted very stringy.  The taco had cheese, two kinds of onion, cilantro,  lime and pico de guillo.(it was soggy and all kinds of ethnically confused.)  The green sauce was just lime juice, onions and cilantro and the red sauce was too thick.  The tortilla was falling apart and tasted bland.  My fiance payed Chipotle price for a burrito that was only half the size and just as soggy, bland and confused as the tacos.   If you know what good Mexican food tastes like(I'm from Los Angeles where there's a different mexican restaurant on every corner) do not eat here, you will be thoroughly disappointed. The service was okay but the food was terrible and I only ate one taco if the three i paid for because it was just that bad.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LqiopcpepExsZ7kg3kaG8Q"
  },
  "h92UtSj1OcwZ3oqhMXJtTQ": {
    "date": "8/20/2019",
    "text": "Love this place. For the price and quality, this gotta be one of the top taco places in the valley.   The portion is very generous, and the meat (I only had steak) is very juicy and not dry like other places.   I got two steak taco for taco Tuesday  (2 bucks each!) and one breakfast taco (steak and egg, yes, steak and egg tacos!). You would think they would give a smaller tacos for taco Tuesday, nope. The portion was great, and most of all, the quality is great. Yes they put some fat, but it's not that much, it only brings out the flavors, great balance.   They also have great drink selections.  Plus, it's 24/7!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vKN0zVHezQb-6_YrdApnqw",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Two steak tacos for taco Tuesday and a breakfast taco (steak and egg). Great taste, portion, and quality. What else do you need more? :)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vKN0zVHezQb-6_YrdApnqw/o.jpg"
      }
    ],
    "user_id": "ax2n2xkMpW_jrzEbAFFqsQ"
  },
  "AinTFPlkZtWzuoJT-dQUGg": {
    "date": "9/5/2019",
    "text": "Orders the street carne (beef) asada and pollo (chicken) tacos and they tasted pretty good. Both meats had a great flavor especially the carne. From the cabbage to the pico it was definitely a taco worth stopping at if your having a craving. They do offer to make your tacos a combo for 2.99 adding a helping of beans and rice BUT it was the smallest helping ive ever seen which im sure other reviews with pictures will backup. I would reccomend NOT making your meal a combo for that reason.  All in all definitely a good eat.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dZtLrEgX40lS1dHZc2VlHw"
  },
  "G9e0otorZFYNe6Sw6YAfcA": {
    "date": "8/3/2019",
    "text": "Dirty. Very dirty! Didn't want to touch the counter or the tables. Inside the kitchen it is worse. I came here because the reviews look good and they were open in the middle of the night. I imagine the food is better during the day but they just reheated rubbery beef that was burnt on the outside and cold in the middle....The onions and tomatoes were almos rotten. (NO EXAGGERATION) Did I say rubbery? It was dirty. Oh yeah it was rubbery too!.... I was really bummed because I was hoping for better. They do however have really nice outdoor Granite tables that you can tell they rarely clean. But they would be super nice if they did. Large big screen outside in the patio.   A little better Management and this place would be excellent!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ct8RlxQuSeMUmqK7pNvIlA"
  },
  "53MY_K9iZUm4xqlqS6I3Jg": {
    "date": "7/27/2019",
    "text": "Great tacos super nice people! I think I loved most that the tacos had cabbage on them! The quesadilla was amazing and cheesy! The only part I didn't care for was the corn tortillas... they fell apart before I could eat my tacos : ( so that was disappointing. Flavors were spot on, so good that I actually would order tacos as a salad next time! 3 chicken tacos no tortilla LOL delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bsnTVycdL-KspW4Rfu6idQ",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bsnTVycdL-KspW4Rfu6idQ/o.jpg"
      },
      {
        "img_id": "F1XA-wot4475prXSdxgnNw",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Carne Asada &amp;amp; Pollo taco with a small cheese quesadilla yum $10",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/F1XA-wot4475prXSdxgnNw/o.jpg"
      }
    ],
    "user_id": "RMb_PysGlKhd8KdNDddE0g"
  },
  "mVZc8kOMDoQlcPvCzgpVQQ": {
    "date": "6/18/2019",
    "text": "I always get the combo and two tacos. Real good, nothing crazy about them just good a$$ tacos. I want to come for breakfast and give it a shot. The burritos look good too. They are open late and that's always good... just in a sketch area. Swing by the patio is chill and it's great food",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "E64e5MxEsNxN0XKyX-RDSg",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/E64e5MxEsNxN0XKyX-RDSg/o.jpg"
      }
    ],
    "user_id": "UeJ98sMQWrl5cJJqSeOsNA"
  },
  "k-bbhKITuVY_wk-QgNDuag": {
    "date": "1/9/2019",
    "text": "I hate to re-review but I don't like it here anymore sadly. I have been quite a few times since my last review and the quality seems to have gone down. I ask for everything on my tacos and they usually leave items off and give lower portion sizes. The staff has always been kinda meh. I don't expect red carpet treatment just would like to feel like I am not inconviencing someone because I want to order food. The last time I went I took my boyfriend and I could see the disappointment on his face. Hey at least I payed for the meal.   At nearly $3 a taco it isn't worth it for crap service, left off toppings, and lacking portions. I am now on the search for a new taco place in the area. If anyone has any suggestions please let me know!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "HRK0gy1inEnVIRqGEpeRJw",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Taco Tuesday. 4 Carne Asada Tacos on Corn Tortillas :)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HRK0gy1inEnVIRqGEpeRJw/o.jpg"
      }
    ],
    "user_id": "f-8BKEVPqiqRaNNmhjAU8Q"
  },
  "yuRvIXWpmvl9VWuRtx6y8Q": {
    "date": "6/1/2019",
    "text": "This place is sort of a dive but I don't mean that in a bad way. The kitchen area which I can see from the order window looks pretty clean and organized.   I walked a few long blocks here from my airport hotel as I normally try and avoid overpriced and subpar hotel food. I ordered the chicken burrito ($7) with everything and although it didn't disappoint the sauce had a unique flavor to it almost like a hint of molasses. I wasn't crazy about it but maybe that's because my taste buds were expecting the typical  flavor at Chipotle which I often default to.  The menu itself is fairly simple offering tacos, quesadillas or burritos. Breakfast burritos/tacos  are also an option.  The seating is all outdoors but covered from that scorching Arizona sun.  The service was good and I would rate it 4  1/2 stars because of the sauce in the burrito but that isn't an option so 5 stars it is.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Kb-sjrq7sKFGG7IhKPkjpA",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. The main and only order window.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Kb-sjrq7sKFGG7IhKPkjpA/o.jpg"
      },
      {
        "img_id": "5dzUUzWcfoAigrwtgzLwHg",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. An authentic dive but the food is great.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5dzUUzWcfoAigrwtgzLwHg/o.jpg"
      },
      {
        "img_id": "5KeCZt_1m8iyQXYZV2H79w",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Lot of covered outside seating!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5KeCZt_1m8iyQXYZV2H79w/o.jpg"
      }
    ],
    "user_id": "299MaSy-aUOR44fhd5S0rQ"
  },
  "4KbXYH6D47nie__8N8XR5g": {
    "date": "12/8/2018",
    "text": "Oh man, I completely spaced on this place... I use to hit up but only for the drive thru during the summers. Kiddos were asking for tacos as we were coming from North Phx and we wanted something super casual!!! In comes Speedy Street Tacos.   You can make any thing a combo for $2.99 (rice and beans and both SO DANG good and worth the $3) all total we got 6 tacos, all steak so that was easy!!!  Tacos come with guacamole, cabbage, pico de gallo, onions and you can grab either hot or mild salsa to drop in the cup containers!  Tacos are not small and just right if ask and the steak has some great flavor. Good came out nice and quick. You can peak thru the window to see them prepare. Fanta, Coke's, Gatorade, Arizona Ice tea (can) and other ice teas.   Best compliant came when ordering as they were surprised my kids were asking for extra pico, Guam & cabbage from the get!!! I've trained them well!!!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "3M6ckUhN2wKT0bsRkEewog",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3M6ckUhN2wKT0bsRkEewog/o.jpg"
      },
      {
        "img_id": "-jApnbUFUL4IRK6HzpVb1Q",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-jApnbUFUL4IRK6HzpVb1Q/o.jpg"
      },
      {
        "img_id": "mWbRu3NY40Q6zH-FzQs88A",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Steak Tacos with the rice &amp;amp; beans!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mWbRu3NY40Q6zH-FzQs88A/o.jpg"
      }
    ],
    "user_id": "fwasfCCwbxLjxLNhYLuF3Q"
  },
  "DWgD2GS-LWCWutrGsa48ag": {
    "date": "9/5/2019",
    "text": "Terrible food. This is Arizona and they can't make a good taco. WTF? Do yourself a favor and go somewhere else.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oQiBOyUjGG4JrJ3NO92obw"
  },
  "d5qyURsmpG4C4QUn6jtG8g": {
    "date": "8/13/2019",
    "text": "Good asf. Came with bae to come get our fix of some real street tacos & im not even cappin it was 10/10 . Approved!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JcyQlfsWT8-VgcD80NHebQ",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. 3 carne asada tacos w/ rice &amp;amp; beans",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JcyQlfsWT8-VgcD80NHebQ/o.jpg"
      }
    ],
    "user_id": "40iDEmxIEteKV8Hq8A4TSQ"
  },
  "ihzNi4pEQDSCBgyievgV1w": {
    "date": "4/12/2019",
    "text": "Great quick eat after our evening plane ride that got in around 10pm. I liked the cute outdoor area. There is 1 TV that had Guys Grocery Games playing. I had the chicken burrito and hubs had a steak taco and chicken quesadilla. I liked my burrito, but it was too salty for my preference. Great choice especially since so many options close early!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8jD2te6Km4ztiE2z0iSwvQ",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Chicken Burrito",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8jD2te6Km4ztiE2z0iSwvQ/o.jpg"
      }
    ],
    "user_id": "PeIFSmI0I1ILYjUjjUSZdA"
  },
  "18wAhHqcwA3F3L5_Zi65PQ": {
    "date": "9/4/2019",
    "text": "Good food, decent service. Kind of sketchy but once you get past that they're all right.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wGjuSxpBYHiv5v5ZgpEhfw"
  },
  "WzLREHhN4hB12P3i0-LErw": {
    "date": "8/13/2019",
    "text": "Came thru with bae, on taco Tuesday!! Most def were the best chicken tacos I ever Had with a cold squirt!! NO CAP  . 10/10 recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ga4sj6vcseruq2Tn_oL-ig",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Chicken Taco",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ga4sj6vcseruq2Tn_oL-ig/o.jpg"
      }
    ],
    "user_id": "7COJSe_8mXhHUiezKKPs6g"
  },
  "lXSXE-hDVE1uiKWVDAYpjg": {
    "date": "3/21/2019",
    "text": "While it is not the best ambiance- the tacos are consistent and great.  Where else can you go through the drive thru and order tacos.  They grill their meat and you can taste it in their flavor.  Itis a great place for taco tuesday or late.  They are 24/7",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "A6dxOCwHN79EAneaSn3skw",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/A6dxOCwHN79EAneaSn3skw/o.jpg"
      },
      {
        "img_id": "Owp7EZr_YMEtKdLjx6AQ3g",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. chicken and Carne asada",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Owp7EZr_YMEtKdLjx6AQ3g/o.jpg"
      }
    ],
    "user_id": "vgZqQqe8cj6SBMH0EqDliw"
  },
  "0P3NoGcI4T0_XurSINZvQQ": {
    "date": "6/7/2019",
    "text": "Stopped here for breakfast and went with a normal carne asada burrito.   Hot damn that was good. The carne had that off the grill smokey taste, and the red sauce was just right on the spicy index. Not often do I rate anyone 5 stars. But good food deserves it.   Now onto reading the lesser reviews, hey people....they have a place for you guys....its called Chipotle, just stick with that. Everyone else... if you are in the area and want some tasty 'street tacos'....this is your place.   I'll give it a few and return to update my review on the next order...I dont expect it to say much different.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "jmwWu7IDOiIlEF26oUYTzg"
  },
  "xGSp9mdMHd_OLZdfk6d5Aw": {
    "date": "9/9/2018",
    "text": "This place is the institution when you want really good tacos and burritos or quesadilla you got to come here stop here they're open 24 hours a day now any time of the day or not you come Thru and get quality authentic food that tastes great day Grill it right outside bring it in as it's amazing.  Right here on the corner of 40th Street and Washington probably been here forever who knows but as long as I've been in Arizona last couple of years I've been coming down here and this is the spot can't beat it come on out just Speedy tacos Taqueria a right here right here on the right here on the corner of 40th Street and Washington probably been here forever who knows that as long as I've been in Arizona last couple of years I've been coming down here and this is the spot can't beat it come on try them",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Qy-qyUm_GH_PI4lNFCdS7g",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Qy-qyUm_GH_PI4lNFCdS7g/o.jpg"
      }
    ],
    "user_id": "2nk5FF5OuGO6sLpZMREY5A"
  },
  "ydDcB3igC_TXeZdQXCeeuQ": {
    "date": "7/16/2019",
    "text": "Low key place! Has a patio to eat in it easy to take food out. They also deliver with grub hub. I had two of each taco as they were out of rice when I got there late afternoon. They were fantastic with fresh ingredients. I had the flour toritillas. They have Mexican coke so it's the real sugar in it. Food came up quick despite it being busy. They take credit cards which is also nice for such a small place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8RPWpIAsJle5YYYV52m3TQ",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Tacos",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8RPWpIAsJle5YYYV52m3TQ/o.jpg"
      }
    ],
    "user_id": "uWrTunXiTHYsu0a7b_QWgA"
  },
  "y5Jke8PRo7U8tzFPfBFk-Q": {
    "date": "8/12/2018",
    "text": "Was craving some good street food, headed down to Speedy Street Taco. Not my first time here, but it's been a long while. At 4:00 on a Sunday they weren't busy at all and I got my order quickly. However, I was less than thrilled by it.   My quesadilla had way more cheese than usual, and the chicken was really greasy, which made the tortilla more greasy than crispy. Also given that today seemed slow, the beans were a bit over cooked. The rice was done well. I love any place that serves glass bottle Mexican Coke, it really does taste better!   The service was straight forward, no frills, but that's fine. Maybe next time I will have to try the tacos instead of the quesadillas. Oh, the green salsa was really good though!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "q83RSbW8q4jRQO9AqCJ9yA",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/q83RSbW8q4jRQO9AqCJ9yA/o.jpg"
      }
    ],
    "user_id": "gUzkmYFApMimctd4Wjxh1w"
  },
  "3TOBUrMcXAyyS2zclAse8w": {
    "date": "7/14/2019",
    "text": "Thiseexperience was hust okay. Thats all i can say which is good enoufh for me. The food was okay, the wait was okay, the prices were okay.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PaWPZgCgTOFsaiLU3a_6aA",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PaWPZgCgTOFsaiLU3a_6aA/o.jpg"
      }
    ],
    "user_id": "IfHMiXMYZoiA1bGft98CVA"
  },
  "yyGxdWFYnkYqpsCwVLQYVA": {
    "date": "5/22/2019",
    "text": "Good stuff. It's a drive through or walk up taco shop, open late! There are tables to eat outside, and plenty of parking.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BCmOQU6EQr4gCet9NBcVoA"
  },
  "UguYpq2_QFYdTsIjJn4dxQ": {
    "date": "7/6/2018",
    "text": "Might of been a bad day for them. Chicken Burro w/ Rice was Extremely salty, couldn't taste anything else. I paid $8 for sodium,  disappointed!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F7ZNIno___n9df3zygO60w"
  },
  "kpyi9HsbQoM1-2ccdUzhQQ": {
    "date": "8/31/2017",
    "text": "Incredible carne asada! The carne asada burrito is amazing, but the carne asada quesadilla is a work of art. The quesadilla delivers a brilliant blend of Mexican cheeses and provides a roller coaster of texture paired with their incredible steak!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TT0Yz9V8X6LDv8Er93Y-ew"
  },
  "fsHr89hBy0Nf8S10SRLuqA": {
    "date": "6/26/2018",
    "text": "Best tacos in Phoenix !! Very impressed with the quesadillas and the green sauce was out of this world!! Shout out to Mohammad! I am definitely coming back next time I'm in Phoenix.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W9R7u7kqzsxIBtNyZSuZhg"
  },
  "-NsyKsFA23FgA2gC68od7g": {
    "date": "4/5/2016",
    "text": "God these are by far the best tacos ive had ever!  Came in and the two guys working there were just the best, they helped me choose exactly what i wanted and were just so talkative, the food was even better and with the great tv entertainment and the live grill cooking, the place was just perfect, idk how poeple can right so bad reviews, they dont know what good is but speedys is better then good, it is by far the best!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YADIGMyqKcxxv6FGG3lbqQ",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Great service",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YADIGMyqKcxxv6FGG3lbqQ/o.jpg"
      },
      {
        "img_id": "L3m5DCB3H_X5ErsfcNgkqA",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Fresh grilled",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/L3m5DCB3H_X5ErsfcNgkqA/o.jpg"
      },
      {
        "img_id": "7apuV4zWHvsZeDYLqO-fTw",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Fresh Grilled meat!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7apuV4zWHvsZeDYLqO-fTw/o.jpg"
      }
    ],
    "user_id": "Z2yoR0lRbc2t9R25cVrTxg"
  },
  "fVsq8AfhmtkeMA3w2S_Rpg": {
    "date": "11/25/2017",
    "text": "Great family owned place, fast and friendly service, good food and drinks at a reasonable price. Will be back if I'm in the area again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fKjh8t4dYXcGLzhjpDef-g"
  },
  "UwGcsrwEF0qMb0kTucGAqQ": {
    "date": "12/18/2017",
    "text": "favorite tacos I've had in Phoenix! It's a bit of a drive from where I live but totally worth it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZlTO3Hynx--zfn6jTOFkPA"
  },
  "GVKtq05YJp6-kwbwPlVv_w": {
    "date": "10/14/2016",
    "text": "Speedy and delcuous. Get a ton a food as they are not too expensive. It's hard to drive all the way their just for tocos, so I use the ubereats app to order. They have an easy menue with pictures to know what you'll be getting. Order for a small party and just pretend you made them.  There is a code to get money off your order ($10 or more) : eats-mbdvx",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4NhSD3GoxDewKRiNmY9ZcQ"
  },
  "-ocB_L1BVPnkqAfOvJHnOA": {
    "date": "1/7/2017",
    "text": "Ok tacos, a little bland. But great toppings bar. Place looks rough. But it's clean. Walkable from the hotels",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Z0uNqZm3DDb6OJoFBQxrNA",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. 3 steak taco combo",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Z0uNqZm3DDb6OJoFBQxrNA/o.jpg"
      }
    ],
    "user_id": "s9rPYSAQdxNb_37ui-Q0ew"
  },
  "FA9TVHmMdoNDo4WFc6JrDw": {
    "date": "12/6/2017",
    "text": "Everything I've tried is truly exceptional. The marinated chicken and beef are cooked to perfection. The homemade salsa is delicious, authentic and has a kick.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ozSMpKX8OiArXD2D5cPc_Q"
  },
  "aX8Es-p6RXtO_rJNLZT-ZQ": {
    "date": "12/25/2017",
    "text": "Probably one of the best Mexican foods I've had since I have a memory. Everything is amazing here",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Djdd5A4ESw3MNRdrL-G0Tw"
  },
  "vx_U6ZPcy-WiCixkQSisPA": {
    "date": "5/8/2018",
    "text": "We worked with Carmen on a catering order with only 1 day's notice. She was amazing. Not only was the food great but Carmen's customer service was fantastic. We will use them again along with eating at the location whenever we get a chance. Thanks!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wnP2VTQd_mlAsxsCX5o0nw"
  },
  "jZ7kYf80Ahj3BjqINbszrw": {
    "date": "4/18/2016",
    "text": "Nothing to write home about folks...yes, it's a cute and charming taco stand...yes, it's open late, but so are all the 'BERTOS places in the Metro Phx area. I agree with a fellow Yelper...with all the hype, I was expecting more taco options- EHHHH WRONG! Then I was expecting either a cheaper meal OR a healthier portion than the competitors - EHHHH WRONG, AGAIN!! I'm better off goin to a 'BERTOS place if I'm lookin for cheap, delicious, adequately-sized, late-night/mid day eats. (Value AND size DOES MATTER!).   P.S. It wasn't THAT speedy either, as the name implies",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "2eToXGVa0Fzti8drf3HaoQ"
  },
  "txePIhFxxu8Bv0rxTi9LkA": {
    "date": "5/23/2018",
    "text": "We didn't take this little eatery serious based on what you see and where they are. Yep! We're totally guilty of judging the book by the cover. Finally stopped for a steak and egg breakfast burrito and fell in love! Returned twice since, in the same week. It's worth the trip down.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oRvq6wP_438H4-wIITceKw"
  },
  "1BXgO_ts41Yoiq4lhe8wIQ": {
    "date": "7/29/2016",
    "text": "Actually came here with a friend for a late night dinner. We went out to the bars that night and this was one of the only open options. After 1am they only serve in the drive through. They were nice enough to serve us at the walk up window. They give you a lot of food for your money and its great drunk food. I also like that the tortilla is made fresh too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9d8a4byZlIkCZ-TkmdQ2eg"
  },
  "Hbq5bExCMjRi9gVQHFgKkg": {
    "date": "5/29/2016",
    "text": "I think their food is exceptionally good. Very clean. I ordered through Grubhub and felt the need to post an additional review on Yelp. This is how satisfied I was. Shoutout to Grubhub too. They are on point.  They made the food exactly to my specifications and the food is soooo Good. Like cuisine good..:)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mtsT8yJfRJnbwlpPqCRYkA"
  },
  "W31bRzlkR9lxR4zTZU6FYg": {
    "date": "8/5/2016",
    "text": "Really cool spot, usually pretty clean which is hard to do considering it's all outdoor seating. I love that the grill is in sight, and the smell of mesquite which is undeniable. A very simple menu, makes it easy to be satisfied, otherwise just a little pricy for street tacos.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "G3hzg-6Qaq-3kmZHT5mNfw",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Carne Asada Caramelo (basically a quesadilla)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/G3hzg-6Qaq-3kmZHT5mNfw/o.jpg"
      },
      {
        "img_id": "d_3cVb7Q88XN2huIV0WdVA",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Carne Asada Tacos",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/d_3cVb7Q88XN2huIV0WdVA/o.jpg"
      },
      {
        "img_id": "fJRtAFP6Mg-LMklIkBOFoA",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. The sign, makes then easy to find",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fJRtAFP6Mg-LMklIkBOFoA/o.jpg"
      }
    ],
    "user_id": "pss82aEG-Vph5R0CKJJDLA"
  },
  "He4XM_8EtvElgmLVUPfrpg": {
    "date": "2/17/2016",
    "text": "I find this establishment's lack of quality disturbing.  I work down the street from this place and had been eyeing it for a while; however, a place in the same vicinity, Tacos Sahuaro, is so good, that I kept putting it off...  I wish that I had continued that behavior.  Looking at the pics and reviews, I expected this place to be moderately good.  I understand there is some margin on reviews depending on other's determination of what is quality and not; however, this goes beyond margin into Styrofoam tongues.  When I went here, I was a little dismayed by their choice of protein for their tacos.  Steak(carne asada) and chicken only.  This threw up (that is a pun in relation to what eating here might make you do) a red flag that I should've heeded.  Where's the carnitas, cabeza, lengua, al pastor, and other items you see at most taco shops... this is total gringo fodder.  The guy working the drive through window's customer service was not very pleasant... I almost felt like I was bothering him. The interior looked a little dirty from what I could see, but it's a taco shop so I overlooked it.  I ignored all these instincts  and ordered 2 tacos of each and a carne asada quesadilla.  I took them home and dived into the chicken taco first. It was ok... Kind of sesame oil/soy heavy, which made it taste more like an asian chicken salad than a taco.   I moved onto the carne asada and, the horror, the horror.  I took a few bites and was not impressed by the taste at all, so I looked down and I saw several under-cooked pieces.  Besides the improper food temp, the flavor was not desirable.   Not enough marinade or time, so all that came through was how low grade the beef was, which is what the marination and nice sear is supposed to combat.  The Quesadilla was a complete failure.  Same temperature issue with the carne asada, and the poor flavor mixing with the cheddar-jack sysco cheese forced out a childhood memory of eating a grade school cafeteria cheeseburger... Every bite brought me back to 3rd grade and the worst cheeseburger I have on memory.  I ended up throwing everything away as, if the carne asada was under-cooked, I was not going to test my luck even further on the chicken.  My two cents: If you are going to do 2 proteins only, nail them. Do not, under-cook them, under-season them, over-season them, or fail to make them shine in any other way, as there is no incentive to patronize the establishment.  I have a feeling most of these reviews were done the waking side of a near blackout/2am taco binge as this place is not worthy of 3 stars let alone 4.  You can literally get better carne asada or chicken at a *bertos place.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "avr2wfgKFmx62a5HrhAMrw"
  },
  "wXt_ldzS2yxHo27HtKHkqA": {
    "date": "11/7/2017",
    "text": "Came here while on a hunt for some quick Mexican food . It's decent food . Nothing special about it . The rice taste like instant rice though. The tacos came in a yellow corn tortilla which I have to say was not that bad. Loved that there was parking , tables, a drive through , and they even had a tv . Even if it's speedy they need to make sure they try to reduce the fat in the meat .",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UsiBWmt45QL6wdn2MALmaQ"
  },
  "AVS9r5JHs2ETUCfaOwV4uQ": {
    "date": "4/19/2017",
    "text": "This is by far my favorite street taco joint in east Phoenix. Their meat is of good quality, fresh and grilled just right. You get a lot of bang for your buck, especially on Tuesdays when the tacos are $1.79 (normally $2.75), as the tacos are big (for street tacos) and loaded with meat. The service is fast and friendly, especially Zeus (guy with the ponytail). He takes really good care of the customers and goes above and beyond. I will keep recommending this place to everyone. Thank you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "add_GkKdea8Pg8YQf-IvdA"
  },
  "UenKq18UxgaH_rQUhcd2Dw": {
    "date": "2/21/2018",
    "text": "We received a free taco to try and it was pretty good but when i think of street tacos i think of double shell and a little more meat for $1-$1.50 per taco (I'm from Cali) so 2.75 just wasn't worth it . The staff is super nice tho.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RAIwrV77K5Q-J3geTzHvOA"
  },
  "N-b3MyisoypHUi7nsn4ULw": {
    "date": "5/30/2016",
    "text": "This place was pretty decent. My only complaint is that when I ordered a bean and cheese burrito it was pretty much all bean and a very small amount of cheese. Will try it again sometime though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3xVgGyMh0N3nyzVXzwk0XQ"
  },
  "Cl7Xsl8VuAnLp_1zX0JBVA": {
    "date": "5/20/2016",
    "text": "Honestly the food here is extravagant!!! The stake tacos are just full of flavor and juice. And the meat is so tender. Plus add in the green salsa that I tired and it just made my mouth water. I'll definitely be go back soon to get more!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8w-kCdfIIcg3tlBdvg9vug"
  },
  "sqj0yskVgltzt59-Xjk0lQ": {
    "date": "8/18/2015",
    "text": "Just stopped at the new speedy street tacos! The best street tacos ever!! Love love love",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "gLV4VXc4k_WF9ElByOdE5Q"
  },
  "0jsYi3OCGrU18OVgUtsC9g": {
    "date": "9/2/2015",
    "text": "Amazing! Fresh salsas and handmade tortillas-- you can't go wrong with that. Also, they are open 24 hours and serve their menu all day.  I was on my way to work and stopped through the drive -thru for breakfast tacos. Their menu is simple--tacos, burritos, quesadillas with  a choice of carne asada or pollo/bean and cheese or cheese and eggs. My breakfast taco was filled with carne asada, eggs, cheese, and fresh salsa. The salsa had just the right amount of kick. The service was fast considering how fresh it was, and very friendly. The pricing is reasonable for what you get--especially considering what you pay for other \"fast\" food. Would highly recommend!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "N4RF1x17gZMvpcnhNhhuBw"
  },
  "St0FbLuxHR9UwOB5_gXd_Q": {
    "date": "11/10/2016",
    "text": "In town for just one night staying at Aloft and wondering what we could eat within walking distance. My husband hates Ruby Tuesday, so that was out despite it being practically next door. I found this place on Google maps and, since it was less than a mile away and had good reviews, we figured it was worth a walk to try it out. When we got there, we were surprised at how tiny the place was. They were also playing loud, vulgar music, so that was also a big turnoff. I asked the person at the window (I say person, because I never quite figured out from the looks/voice if it were a guy or a girl) if the meat were seasoned, and he/she said it was. I ordered a chicken and a carne asada taco combo, and my husband got a carne asada quesadilla combo. Well, the person lied. The meat had no detectable seasoning. We loaded it with pico de gallo, and that covered up the bland meat. Both meats were kind of gross, but I guess the carne asada was worse, because it's tough and chewy with random fat throughout. The rice and the beans both had pretty good flavor, although the amount they gave you was pretty miniscule and amounted to 3 or 4 bites. If I skipped the meat entirely and just had vegetarian tacos, it would be an improvement, I suppose. My husband opened his quesadilla to show me, and there was so little cheese that I didn't see why it still qualified as a quesadilla. We probably wouldn't go back unless it were the only option, because the good pico, rice, and beans don't compensate for the low-quality meats.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cUz9iPWNfcZr_kvcv4TahQ"
  },
  "tt9hRw3AqM647kJmUKSMNw": {
    "date": "1/14/2016",
    "text": "I've been on the search for great tacos and these exceeded my expectations. I had the chicken tacos and my boyfriend had the carne asada burrito. Both of us agreed that they were the best we've had since living in Arizona. Can't get enough of this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "69GmgZXNaByNZdPwQm5HeQ"
  },
  "IRl6ioHhfxfxdITEdbxr2A": {
    "date": "9/2/2016",
    "text": "Just had Uber Eats deliver Speedy to us.  Absolutely the best chicken breakfast burrito I've ever had.  Highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VTsMd9DnCQY3WLmJ8Jf5Cw"
  },
  "oke5uFomJ1VasP5GsZdrdQ": {
    "date": "2/19/2016",
    "text": "Yummy!!! My hubby said \"these are the best tacos I've ever had!\" And he ate his plain with just flour tortilla, steak and cheese!  I enjoyed mine one chicken and one steak with all the extras and WOW!  So, if you like it plain or fancy you will like it!  :) I wish they were closer to my house!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0TXSeVgUHp9YumTyggigJA"
  },
  "dX7vOGYW_tdtFtEAdjU6LA": {
    "date": "12/31/2015",
    "text": "I got the carne asada burrito with extra cheese and it was delicious.  I would have gave them five stars, but I requested sour cream to be in my burrito and when I started eating it there was none.  Maybe they don't have sour cream, but they never mentioned it when I picked up my order.  I will definitely be going back. Ordering and paying for it on Yelp was so convenient.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YS8v_0JW8CviKXmPJDB-1Q"
  },
  "gtk5oKmQZtlu3V2tRdBTeQ": {
    "date": "2/7/2017",
    "text": "We ate carne asada tacos on corn tortillas. They were fantastic. We came for taco Tuesday, and knowing it was taco Tuesday, the place was hopping with lots of pick up and delivery drivers... the food was good. Service was great as it seems eat here guests take precedent. Coke is served in glass bottles. Dining is open patio.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LZr4gz4IM87K19eQizxHaw"
  },
  "9v6YdVUF3F29hw46fHSXCA": {
    "date": "9/15/2015",
    "text": "From the reviews I read I was expecting larger portions of good quality Mexican food.  The tacos were just as small as any other place.  The quesadilla was very small as well.  The carne asada was gristly.  The service however was good and the people working were friendly.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yEqIGaN4w1O_l0nMwe1wLQ"
  },
  "DU4ovQn9d-tb9AvAP_Z8rg": {
    "date": "3/25/2016",
    "text": "Amazing tacos! Feeds a hungry nursing student quite nicely! :) Right next to Gateway Community College and the airport on the corner of 40th/Washington. They're open late-3AM! They have delivery through Grubhub and Seamless too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZbYGabnHtBOU39eJFvYt1w"
  },
  "m-7H6KVvsIpgYjZuW_wBsA": {
    "date": "10/8/2015",
    "text": "Went there with a co-worker since its only a stone throw away from work. We both ordered the carne asada burrito. It was huge but somehow I devoured the entire thing. It was really flavorful and juicy! I literally had meat juice dripping  right out of it. Think of the Carl's Jr. commercial but instead its a burrito :).  I think next time I'm going with the street tacos so I can try both pork and beef.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Npim4I7cjLhnbgX8qt46jg"
  },
  "2bwNe0tsDOtOxmrzW4UIeg": {
    "date": "8/14/2016",
    "text": "Tacos are super yummy here. .love it cuz it open late! It is a little overpriced. Not at all expensive, but overpriced for street tacos. None the less very tasty and I will be back",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XVwNF87wfOb7cnp7564C7w"
  },
  "E35GdGpFXF_I7V0sYB_mxQ": {
    "date": "8/27/2015",
    "text": "Had a chicken and a Carne Asada taco. Both delicious. The Carne Asada had great flavor. The only downside was a found a few fatty pieces that weren't edible but they don't skimp on the meat or the toppings. A good street Taco.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "KMM9BrAprDGWXUGljFNy6w"
  },
  "5gw7OmMG_5uUzgGbk9rRfA": {
    "date": "3/5/2016",
    "text": "LOVE this place. Customer service is amazing and they're food is just as good. Definitely our new favorite taco place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-aEEnEvFeGDJrDA8yJCJSA"
  },
  "2Ar1jeZZuJ0qFWk42gY0Kg": {
    "date": "11/11/2015",
    "text": "Great food and they are quick. Just wish the Carne asada quesadilla was bigger, but it sure is delicious!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QbGkSOcvAoRtfykUN_tqpQ"
  },
  "fo_uHm6VHMeA-UtT48qE1g": {
    "date": "2/17/2016",
    "text": "Wow ,best tacos I ever ate ,everything fresh,  I can tell because I'm not hungry 20 min later. Most definitely try this place 100%. And they got a salsa bar I could load my taco Hefty",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xfqwKQx-2FpiZrtam3uOgA"
  },
  "F1TwaPXTidhr4LdhWq6amQ": {
    "date": "11/7/2015",
    "text": "Really sweet employees , I love the food here , if you can't handle hot foods like me I usually ask for it on the side. Their salsa aren't made for the weak lol they're open 24 hours and got a drive thru!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sw-4ntQ_kWZp45YgYJrckw"
  },
  "D0S3RaELyZm3aCIuvZfNmg": {
    "date": "1/29/2016",
    "text": "Place was expensive and no way to eat outside with the bee problem they had! Left the place very unsatisfied.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0_i8GRSetllNlVNbSPfs3g"
  },
  "i0bphFtK3W08QEfVOn0v4A": {
    "date": "10/27/2017",
    "text": "Phenomenal steak and egg breakfast burrito.  The very best of street food.  I would eat breakfast here every day if I could.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UM-7PKO_wC6GHscj_xX1MQ",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Steak grilled outdoors over wood.  Fantastic flavor.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UM-7PKO_wC6GHscj_xX1MQ/o.jpg"
      }
    ],
    "user_id": "5C-QaDaZr3FUmANi5Inbqg"
  },
  "q7Z4Sj139ihiqPV041YeDw": {
    "date": "10/23/2017",
    "text": "Dive taco stand near the airport in a run down parking lot.  There are some tables, an awning, and a TV.   Fresh carne asada and pollo tacos and quesadillas.  The food was hot and fresh.  There is a salsa bar with pickled onions, cabbage, and green and red salsas.  The tortillas were good.  The meat was also good and the guac was tasty.  The salsa bar was a bit stale and the salsas were kind of weak.  The price was high for the fare.  6 bucks for a quesadilla and $2.75 for a street taco is too high in my book.  If I was hungry and in the area I would probably come back but it's not a high recommend by any means.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DPitNu466172os6m0Yri1Q"
  },
  "uVszjcsMi-92KJExOismNA": {
    "date": "1/15/2018",
    "text": "Super fast prep.  Easy parking.  Accepts credit cards.  Open 24 hours!   Friendly, exceptional service.    I ordered the carne asada burrito.  It was really tasty.  There was a little gristle but for the price, friendly service and convenience - it was all good.  I would go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WOSCzu64CxuoplAyjZYxXQ"
  },
  "f3OOS4Duxcl3XpaILQHb0g": {
    "date": "1/7/2019",
    "text": "This place gives me life. It's just the best. I could eat 5 bean burritos and 20 tacos in a sitting. And the salsa....oh the salsa...I wanna guzzle it and swish it around in my mouth.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LBIG8n1CqQ2rWEJVlzz6pg"
  },
  "c66hkRXyXmWBEl6ztjiVfw": {
    "date": "12/31/2018",
    "text": "Breakfast burritos and tacos served all day! Lunch and dinner all day as well. Small and very straightforward menu. Prices are great and the size of the steak burrito I ordered was a good size. Steak chunks are decent as well. Docked one star because the cleanliness of the location looks questionable. While the steak was seasoned just right, the chicken was on the salty side.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4OTYGy_Ro4z4SgAporkEQg"
  },
  "oES9Q8gbH5i5-B34S8m5Kw": {
    "date": "11/7/2018",
    "text": "The beans are trash! They were dried out and looked like they came out of a can. Also, the carne Asada can use more seasoning/marinating.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9qT7f5EZBa6vfrcokCMf1Q"
  },
  "hUUW3GUqgcJKf_m8_9Oqow": {
    "date": "5/9/2018",
    "text": "Okay so if you're looking for something fancy, hell, or even halfway pleasant to the eye... this is not your place. However, if you want some good ass street tacos, it is! I had one chicken, one steak, and a bite of the burrito. Everything fresh and full of flavor. Tortillas tasted homemade and their salsas, whew! Their salsas were extremely fresh (watch out. The red ones hella spicy).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NsZRSnKl5yEg2t4hPHLvAQ"
  },
  "RVyfQj4Bw9y8Xf4fKUexcg": {
    "date": "7/27/2016",
    "text": "Everything is amazing here! I love the seasoned chicken tacos and the cheese quesadilla. The two salsas they have taste so good. I like the red one a little more than the green sauce. Also love the pickled onions and pico to top the tacos with. There's a creamy guac sauce they put in the tacos and comes on the side with the quesadilla that's also good.   They are on door dash and grub hub and delivery is really fast. The first time I tried them, I liked them so much, I went back the next day. This place hits the spot and highly recommend you try them if you are by the Phoenix airport area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iK_6pf-8NRd_UO2WMhnyoQ"
  },
  "emYT_S_HEQaGpp7lL6Ek7g": {
    "date": "11/26/2017",
    "text": "Small businesses wiit h Big customer relationships Friendly and delicious 100% recommendation",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ha3dDnEfROT1iF5ovBjoyw"
  },
  "WqI3wd7swfUpqmRaYWsNfA": {
    "date": "3/20/2018",
    "text": "100% authentic....so good and the guys that run this taco stand are nice and friendly.  Open 24/7 come rain or shine ...they will always be serving.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EXSjts57nLLtBEEppmH0Fg"
  },
  "d0Tpm77MmmH5hqein2xUIg": {
    "date": "10/20/2018",
    "text": "the best tacos i have ever had.   also had the steak quesadilla.    amazing!   everything is cooked fresh to order.  fresh toppings.   homemade tortillas.   my only complaint is their guacamole.    it's thin and watery!   will return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "G2ieWpUHyTuZJIMMfCN0dA",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. 4 beef tacos.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/G2ieWpUHyTuZJIMMfCN0dA/o.jpg"
      }
    ],
    "user_id": "08_7LCrkhmzBQBSFaQqaTQ"
  },
  "01IgThp3kSZlVhTQn9SoTw": {
    "date": "4/18/2018",
    "text": "Wow, this place is becoming a must stop, after picking up my car near the airport. Spectacular tacos.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UBzj3NRs13izZZlGGWzdZQ"
  },
  "2-wL9X0v8MsRP3F_E3d9Fw": {
    "date": "10/14/2017",
    "text": "The best Mexican rice ever! The best steak burrito! So tender and juicy on a perfect tortilla!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GlLjNvMSExgnFOzjNchT5A",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GlLjNvMSExgnFOzjNchT5A/o.jpg"
      }
    ],
    "user_id": "j8E-qsMvyPfPfT9KjHGbeQ"
  },
  "7LihfuJfmh-ZvW3LXAgdBg": {
    "date": "3/17/2018",
    "text": "Decent food but probably wouldn't recommend to anyone unless they're looking for a ghetto spot that takes EBT their tacos are decent but everything needs salt",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tXkzVp2ZCFftRijPpm1p1w"
  },
  "i8fixmLdIF3qot-XIeWv7g": {
    "date": "1/7/2018",
    "text": "I really think this place should get 2 1/2 stars but I couldn't figure out how to do it. The reason I didn't give this place 1 star is because they do not hide what they are. At any rate, here's how our experience went: we show up and it looks exactly like what we expected, no surprise there. There are 4 or 5 people in front of us and after they pick up their food they start To go back to the window. Once we get our food, it's all wrong!  So go back to the window and they quickly make my correct order. I have to say they're consistent!  100% of everyone on front of us had their order made wrong. Then the guy behind us had the same happen. I ordered a breakfast steak burrito and my wife and son a couple of tacos. Not the best quality but for a place in his part of town that prides itself in being open 24hrs a day if you're ever on your way home from a night of partying his place could be a score. Eat at your own risk!  Also, they don't do a very good job on making the place look clean and tidy. Lastly, make sure you bring a fly swatter because you will be battling swarms of flies.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "4JY62Fy0uTU95eDp0wAVrg",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4JY62Fy0uTU95eDp0wAVrg/o.jpg"
      },
      {
        "img_id": "--FKC-QN5hQ84aH9rKeGcA",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/--FKC-QN5hQ84aH9rKeGcA/o.jpg"
      }
    ],
    "user_id": "_VTkMoIa11C9IA4zlYbsOA"
  },
  "ieFteorPaFGYcwojvVecGw": {
    "date": "11/5/2018",
    "text": "De-freaking-licious!!! Multiple people recommended this place so I told myself - \"Self, let's go see what the hype is all about.\" Let me tell you - this place did not disappoint. Pleeeaasssseee believe the hype. You will thank me later.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-cW72RAiaOiAOk4fUBrm1w"
  },
  "4UFLRIXhH9l4y0ZujOwwXw": {
    "date": "8/5/2017",
    "text": "1. Do not order online  2. The tortilla was burnt as hell  3. The meat was very greasy & LETTUCE in my burrito?! Where's the rice?!  I wouldn't recommend eating here again",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "izRp7Vf4f9nwXhWyBW0vrQ"
  },
  "pKOXU6x9Rvb7mS1msRcaSA": {
    "date": "4/29/2017",
    "text": "I'm making this quick and straight to the point...  1. Don't place an online order. Your food won't be ready when you arrive.   2. The service is shitty. I stood at the window for about 3 minutes without being acknowledged by anyone even though there were two living human beings that I made eye contact with.  Keep in mind,  I was there to pick up my order I placed on Yelp because I was on a time restricted lunch break. I had to sit and wait for them to make my food when it SHOULD'VE ALREADY BEEN DONE!!!!!!!!!!!!!!!!  3. I ordered the steak tacos. They were ok but the meat was greasy and like others mentioned the portions are small. I ordered salsa ON the tacos,guess what? NO SALSA so my tacos were DRY as Death Valley. How do you make a dry taco?   4. Oh yea, the pico isn't that great either....  Pass on this place and go somewhere else.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "tBFnZ_pqnDS7pqZAhcUL5Q"
  },
  "jW3e5CElzClVlR912V-bgw": {
    "date": "11/24/2018",
    "text": "Average. .. if the guacamole hadn't been so thin that it poured like water and the horchata hadn't tasted like perfume. Weird but True. The asada meat itself was tasty  but the sides  provided cabbage instead of lettuce and about 8 shredded pieces of cheese. So confused by the 4 star reviews? !",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LlpO-saGjjnhBie3ONKBUQ"
  },
  "YlyiNuFmUnUAO_u6-oBzlA": {
    "date": "4/21/2016",
    "text": "Overall, my experience with Speedy has been great. I am sad that I will no longer be able to stop in for my regular breakfast tacos, since they have changed their hours. I used to stop in right before work, but now they open too late. :(  I usually order carne asada tacos or quesadilla. I ordered a chicken breakfast taco once, the chicken looked to be under cooked. When I returned it and asked for a beef taco instead, they were very apologetic and made sure to get me another taco asap. This is the reason, for the 4 stars instead 5. Raw chicken is usually a deal breaker for me, but I had been there so many times before and had great tacos, that I didn't feel it would be fair to bash them for this one mistake. None of us are perfect, right?   Their jamaica is usually really good. :D",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZOiP5sY4ZT3ZkzegekAiBA",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Taco Tuesday",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZOiP5sY4ZT3ZkzegekAiBA/o.jpg"
      },
      {
        "img_id": "oNBMV_BTb_tdhNSDT0zTVw",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. They now have the option for combos.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oNBMV_BTb_tdhNSDT0zTVw/o.jpg"
      }
    ],
    "user_id": "YDW9pzW5XLb4yyBmba2cfw"
  },
  "CLWECVIrRI62O3R08Acs_A": {
    "date": "7/27/2018",
    "text": "another experience of not bringing salsa ... food is good which is why I keep ordering it but I already know the same excuse will be giving ... oh we are too busy and we forget ..so unfortunate the level of excuses for lazines.    Update ... no salsa .. despite requesting it.  1/2 Star hopefully the owners start to read these .. food is good",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1KMF5EpaBeUl2cYg3GT1tQ"
  },
  "NJEREMLv2t-O52ZGie2SmQ": {
    "date": "3/15/2017",
    "text": "I stopped by for food to ensure no hangover the next day. I got a carne asada burrito and she got a chicken quesadilla.  The meat in the burrito was very good, but the rest of the burrito was just unmelted shredded cheese and a cabbage mix. Kind of eh so I ended up just opening it up and eating the meat with a little tortilla and salsa. The quesadillas were apparently amazing, but I didn't get a chance to try.   The service was pretty OK, given the time of day, and the food came out quickly. Not sure I'd come by at noon on a weekday, but for a midnight mexican food run, it's A-OK.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wrx5QHonkd1yxH9qt788QQ"
  },
  "W4av8RC9Ew4Ftrh9kFWdbg": {
    "date": "11/6/2016",
    "text": "It's a tiny hole-in-the-wall place across the street from Gateway Community College. They have the basics: tacos, burritos, horchatas, sodas and a couple more items. It's relatively inexpensive.   For my first visit, I decided to satisfy my cravings for tacos with one steak taco and one chicken taco on flour tortillas. My order was about $6. Seating is all outdoor with shade and there were a few others eating as well around 1 pm. It took about 5 minutes to get my order. They also have a salsa bar with sauces and fresh salsa. I devoured the tacos in about 10 minutes, thoroughly enjoying each bite. The meat was tender,  juicy, and perfectly seasoned while the rest of the fillings were fresh. The spicy sauce that they had complemented the meat really well. In addition, my friend ordered a steak burrito and thought it was delicious! The staff is friendly and very courteous as well. In short, it's a great place to have Mexican street style tacos that are delicious and worth every penny.   I look forward to visiting again in the near future!  If you are in the area but don't want to drive to get tacos, UberEats and Postmates deliver from this eatery!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Ed6g4-j8-_vudganuYx5fg",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Chicken and Steak Tacos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ed6g4-j8-_vudganuYx5fg/o.jpg"
      }
    ],
    "user_id": "Yuyy16nuHylNKZn9I9Vx-Q"
  },
  "OZGV5VxvTIwal0ibzKK_Jg": {
    "date": "8/14/2018",
    "text": "You can never go wrong with late night Tacos.  this spot was great & it's 24/7. If you're ever in Phoenix, be sure to stop by.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j1Bjl92LUgUb65EtpSe8og"
  },
  "AWLYlVUvyQDGIkSvZ6V2vg": {
    "date": "2/25/2017",
    "text": "I was hoping for more from this place thinking it's street food it must be great but nope. The service, or order taking process was not so welcoming. The food is ok, nothing i would crave though. Had a chicken burrito but the chicken lacks something, it needs more flavor, it just tasted charred.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sqMNY8nvk_CHp6eNeDV2BQ",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sqMNY8nvk_CHp6eNeDV2BQ/o.jpg"
      }
    ],
    "user_id": "PUC-wLobZ99sX0agdLIS8g"
  },
  "IpKsyFD0Up_2b8O1tw00Lw": {
    "date": "2/9/2018",
    "text": "Great street tacos and burritos. I will definitely be coming again next time in Phoenix. We love to try different styles of tacos and burritos during our travels and I have to say this reaches at the top for us.  Keep it up, Speedy Street Tacos!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tCMQuVNbLdhcpZYFQtXF6A",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Carne Asada Taco",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tCMQuVNbLdhcpZYFQtXF6A/o.jpg"
      }
    ],
    "user_id": "Tq5syjZAUWSbToTeE8qD-w"
  },
  "vNAYhIADhLKBF8DZNl8IIA": {
    "date": "9/24/2017",
    "text": "After a long walk along the waterfront we decided we wanted some quick yummy eats. This place hit the spot! There was a good amount of meat in the tacos. The quesadilla was filled with cheese and the service was friendly. It was better than I anticipated. We both left quite full!  I wouldn't crave it, but wouldn't hesitate to come here if I was in the area.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Sh1W9mzZW7LQx0doeR9CoA",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Yummy&amp;#39;",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Sh1W9mzZW7LQx0doeR9CoA/o.jpg"
      },
      {
        "img_id": "op4tKZ9coZAHr2iKjVKyag",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/op4tKZ9coZAHr2iKjVKyag/o.jpg"
      },
      {
        "img_id": "sdGERaH21jEB1OJnu7_nOw",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Tall and regular sized tables with lights",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sdGERaH21jEB1OJnu7_nOw/o.jpg"
      }
    ],
    "user_id": "Isf8G6HPbNqEisKDjmUlbw"
  },
  "d_lK6SelN1fDwftb33VW-Q": {
    "date": "9/20/2016",
    "text": "FANTASTIC!!! I've been craving good street tacos. Just like the ones I used to get from a cart in Rocky Point or Nogales. I am so happy I found this place. I ordered a few carne asada tacos and steak quesadillas to go and brought them home for din din. My hubby was licking his fingers when he was done and said \"they make the good koolaid\"..hence meaning, this is the greatest street taco of all time. The carne asada was cooked to perfection. The guacamole and salsas where a perfect addition.  This place made our roster in take out food. Although we do not live close to this location, it is definitely worth the drive.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "vnWKs2dgqDuR_yNI5qJG5g"
  },
  "wNO7UV5U0Vdy0rvf39VqXg": {
    "date": "6/7/2018",
    "text": "Such awesome taco. Could use some chips up in here. I'll give them 6 stars when they do. Yes.... I know that's not a thing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vyEROlQ-AGZpjmAHq3l7fA"
  },
  "C0vNzfm69aulUbHXPzIv6g": {
    "date": "10/31/2017",
    "text": "Easy to find.  Friendly service.  Prices are mediocre.  I didn't like the carne asada tacos that much.  My daughter liked them and the chicken.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bhJ6ivAuSpgXP4JiKWjSZQ"
  },
  "sxsJSsEmdrSVzeLDlWDoLw": {
    "date": "7/15/2018",
    "text": "I have few food rules, one of them is I won't eat human or dog. Pulling into the lot I thought I would be breaking that rule, since speedy toco shares a parking lot with an animal shelter. Over all the tocos did taste good , plus it was close to the airport, I will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BXT_mjAYwmLPkgG4kWhfpg"
  },
  "vhIggjJpjDthbFZWNSp3Hg": {
    "date": "6/3/2018",
    "text": "This was straight taqueria food. Simple, good, fast!  The drinks are HUGE. After a long flight it was a perfect dinner. Just the right amount of grease and fresh pico. We had steak egg and cheese breakfast burrito, chicken taco, steak taco, and a bean burrito with Horchata and Jamaica to wash it all down. Would definitely come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tl38mAZsvOzmSNWXH5q5EA"
  },
  "azLcLycDRWp-EpMAPL_-2w": {
    "date": "6/20/2018",
    "text": "Just simple delicious street tacos and burritos. Open 24 hrs",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-p7aIFzCw8YCXZIthkLYlw"
  },
  "ZaocfkqWazCp0SWjAa2Pdw": {
    "date": "9/28/2017",
    "text": "So glad I found this gem late last night. Carne and pollo tacos were bomb! The cheese in the Quesadilla was amazing and just melted in your mouth. Salsa, Guac and sides paired well with everything.   The only bad thing... is I live 45 minutes away! Will be returning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "X3PS_riUlXMPO2qBFEVjDg"
  },
  "dP2kLdvYTa_G9lZ6W6vvjA": {
    "date": "4/24/2018",
    "text": "I really love their carne asada tacos, but I'm sorry the overall experience constitutes 3 stars. Yes the tacos are delicious but the place its self lowers their overall star rating. I usually do \"drive thru\" but it is the opposite of speedy and quite slow. At times I've spent almost 10 minutes waiting for my food. A major problem is that you place your order at the window and wait at the same window. They don't have a speaker for ordering like most drive thrus so everyone who is behind waiting haven't placed their order yet. This causes a major problem that is counter productive. On my visit today (taco Tuesday, which are priced at $1.75) I decided to \"dine in\" and making a few observations of their actual brick and mortar, some of their cleanliness practices are questionable. Last but not least parking is terrible, you end up parking next to them at the animal shelter but there are numerous signs stating the spots are strictly for animal patrons. Oh, well? If they are able to improve of these issues their overall star rating should go up.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "loOoIBFpGbkx8WaIpQndiA"
  },
  "CWtlsPJx2rEBrOZDnmLliw": {
    "date": "5/22/2018",
    "text": "Ordered speedy street tacos through uber eats and was super disappointed. I ordered chicken quesadillas and it wasn't good. everything tasted burnt or over cooked. I wouldn't recommend this to anyone.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Zd4dd9H5YWtm9GSYW7AFA"
  },
  "mxe7fX8fYI8KQGMbXJgA-Q": {
    "date": "8/12/2018",
    "text": "Best Mexican food in Phoenix that I've had so far and it's right by my new place.  I had steak and it had great flavor. Can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o4ZLXcKb6rNb23bkfVNc3w"
  },
  "g5GwmDgFhCjRYydGc0xF3Q": {
    "date": "5/12/2018",
    "text": "Wow, this has to be one of the best recommendations I've received in a long time! I like Mexican food and spice which will wake up the taste buds. Good flavor and ingredients are key! Speedy Street Taco has food which hits all!  Bought a couple for myself and one for my wife, a \"selective\" eater. We both enjoyed them very much. I liked my chicken corn taco better than the beef flour taco while she liked the beef, leaving the tortilla. Definitely add the salsa, lime, cabbage to your tacos.   I'm going back today! And maybe every day I'm here! Definitely do not miss this. If you're hungry after picking up your rental car this is the place to drive to. And hungry before the flight- stop here first!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dwnWEcgLZiMMrA1N5iyG9w"
  },
  "umcZBHVN0QObuLj4P4zsYQ": {
    "date": "7/28/2017",
    "text": "Chicken and beef grilled has good flavors but the service and portion was Not the greatest. Each tacos is $2.75 they don't put lots of meat. I ordered 2 tacos and made it a Combo. The beans tasted like they were out of can and rice didn't have any flavor. They both looked like they served half spoon of each into the plate. Beans and rice are Cheap!! why charge $2.99 a side overpriced for that quality. The beef burritos were a reasonable size and portion for the price $6.50 each. They gave us two small salsa for +$20 of food we had to ask for more! I would probably go back for a burrito but that about it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mwL_lQxOSwDK9godwob7VQ",
        "caption": "Photo of Speedy Street Taco - Phoenix, AZ, United States. Top: beef burrito combo with beans and rice   bottom: 2 tacos with beans and rice   beans and rice had no flavor",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mwL_lQxOSwDK9godwob7VQ/o.jpg"
      }
    ],
    "user_id": "c6Ia--JUuWEK4nhu5NuPrA"
  },
  "-vbpw1F_iAPr9jBq_ZP3IQ": {
    "date": "7/19/2018",
    "text": "Fairly good lowest grade meet used. Taco Tuesday value best offer. Love the red salsa very spicy. I wish topping bar was better protected from blowing dust also maybe a sneeze guard.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i7V5VdTsyPsEh5t2I_YKOg"
  },
  "aQ3bMY9kjQMgmc13bnsfdg": {
    "date": "7/23/2016",
    "text": "Amazing tacos. One of the best I have had and thanks Yelp for not letting me down.   Please try there tacos on cord tortilla. Absolutely loved them.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oiXRYCcBD1Wkwo88RXI6Ug"
  },
  "69bReHcR-7jhEbRBObNhCg": {
    "date": "3/28/2016",
    "text": "Pretty good and convenient location near airport.  Red onions were a pleasant difference.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TQ42P2aYySg7PMJi37okaA"
  },
  "tKITdDdvAdrv-Z9gpunmkg": {
    "date": "10/4/2016",
    "text": "Slowest order in my entire life.   I will never order from this pace ever again. took over two hours to get six tacos. You are a terrible restaurant and I'll let everyone I know. kick rocks and I hope people figure it out sooner than later",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g2BBY-ogFta7ryiPWWBx-g"
  },
  "O2dqlaV3v2tPBf_4SK_r7Q": {
    "date": "8/23/2017",
    "text": "Worst Mexican food I have ever had. Got super excited when I saw that they deliver through uber eats but was beyond disappointed when my food showed up.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SeGID_4__xMt_Phaa5pgwA"
  },
  "w4rLfOVxNI0Fun8ftmZg7w": {
    "date": "12/13/2015",
    "text": "The secret of this place, low on ambiance, location being sketch and all is that this is a legit carne asada place with mesquite grilled meats. It is seriously tasty. There's only one or two other places in the area I've tried so far that serve up a legit carne asada. For $10 and change you get a big carne asada burrito with crunchy fresh veggies and a big jamaica drink. Love it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kzaWUwXdTSPOBKK7qtFZpQ"
  },
  "iSB-4BSz_gqsx-G5Ge3inA": {
    "date": "8/16/2017",
    "text": "A little pricey and the location is sketchy, but the food has always been excellent.  I prefer going not in the summer time so we can sit outside and eat.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VZXu0mChswR7ApEx0KDqkQ"
  },
  "K_YUA2PauJUsr0phJu4ZFA": {
    "date": "6/25/2017",
    "text": "Awful. Nothing like what is advertised here. Steak was painfully chewy, the corn tortillas were stiff as cardboard, and their service was unfriendly. The tacos look like they were made by my 3 year old son. Not only was the food bad, but my stomach felt like it dropped through the floor moments after the very few bites that I actually took. My stomach hurt for hours after. If you like your insides the way they are and you appreciate good food, save yourself, I would strongly recommend another restaurant.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c5sCPZLMaeUwCPGTAZgelw"
  },
  "NfkXylLuj4XZebl6EGU1Kw": {
    "date": "5/7/2016",
    "text": "Excellent food.  Kind of off the beaten path.  You can get there by taking light rail and walking about 9 min.  It's all worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OgdRuiUToh2wz-moMnukhA"
  },
  "UqbAcku0n35JGPQUnAYFcA": {
    "date": "12/7/2015",
    "text": "I was looking for a better breakfast burrito and I found it. I had the steak & egg burrito w/ pico and it was awesome. The chief was really kind because he gave me extra salsa and guacamole, which was super fresh.  I bought the refried beans and they tasted home made. The egg was real and the service was excellent. Don't hesitate, its a small business with huge potential.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JHa6QhwsnQ3tBfoHwz9pJg"
  },
  "CJEZs8dH-tFbtbkjdzoTug": {
    "date": "4/29/2016",
    "text": "I had the carne asada burrito and chicken taco. Simply delightful :) This is one of the best street taco restaurants in the valley",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V7wGQxdSWgi5Q48ZgARaEw"
  },
  "RfuwKRi_bIHE4mYMGadNdA": {
    "date": "9/9/2016",
    "text": "It's a shame because Speedy's tacos before May 2016 was slightly expensive for what you got. You got a decent amount of food, but it was really good so I forgave it and still went there for lunch. However, I went there today for a steak quesadilla combo, and the portions were measly, easily half of what they were before. Now I don't need a lot of food but for the price that they charge, the portions seemed a bit ridiculous even though the food was still delicious. It's not worth it for me now so I guess I'll just have to find another Taco Shop. :/",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FxQygAfAuzlHutDbLGOVsw"
  },
  "bq64jAE9zP2-Jy2oNELidg": {
    "date": "3/22/2016",
    "text": "Their tacos are amazing. Pickled red onions are the bomb. The flour tortilla is where its at. Go here. You wont be disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xjGEhrGsyh2hpmuwaQfCsA"
  },
  "thgmKu-mx1r5m2IBm47ELg": {
    "date": "2/6/2016",
    "text": "Reasonable place. Terrible steak though. Open 24/7 which is very nice. Beans from a can. A little overpriced. But tasty food overall. Would go back for sure, just avoid the boot leather, I mean, steak.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m8vzTbQJRIO7D7RW9G0M1g"
  },
  "ngVg1gWrw5POPltIRAxywg": {
    "date": "4/13/2017",
    "text": "Flavor not so good an alittle expensive  compare to other taco shop.. salsa super bland.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "watD3uhudU3nzEaVbO0bog"
  },
  "C4Aqk7WzyruOBUD1azoIeA": {
    "date": "12/18/2015",
    "text": "These street tacos are the BOMB!!!  I had a chicken and a steak, they were very tasty! The burritos and quesadillas are BIG and delicious!  The owners were super nice, AND, they are on GrubHub so they deliver.  If you are in the area or on the way to the airport, ya gotta stop by!!!  We are no longer hangry",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "FIOxsy96PmDFAomTReCQ3g"
  },
  "BbgKMCx9XailxKfXynYsKg": {
    "date": "11/16/2015",
    "text": "Limited menu but fantastic taste. Got a winner here and Very good price. Two tacos filled me up and at 2.75 per?  What a deal",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rrF5fz8t2nEkgu5gGYFP1Q"
  },
  "nBRpUS6nPE0YCG25Qv8QcA": {
    "date": "3/28/2017",
    "text": "Hands down the best tacos I've ever had! The meat is fresh and the service is great! I come here at least twice a week! You can't go wrong with their burritos too. This is a hidden gem in Phoenix. Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hZtPkL1EUSEbw4L0qGKUGg"
  },
  "JMcgXDphq3CL4y88M_d2zQ": {
    "date": "9/23/2015",
    "text": "I came here late night to eat tacos, I order three tacos, im starving by the way...I eat the first taco and notice that the meat is cold! Not warm or hot but cold...the gentleman in charge ask me \"how's the food\"?  I informed him of the problem, he goes and looks at his grill station recognizes that something is in fact not keeping the meat hot or warm and he didn't do anything to make it right he continued to prep & completely ignored me ?? Hello!!! You have a customer who just spent 13.00 for 3 COLD tacos and a  Horchata (that didn't taste like Horchata) :/  (my stomach hurts already) I don't care about the money but he should have quickly got me 2-3 hot tacos and made the situation right",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "RK6EXieJAlkS1DKogX9y7A"
  },
  "ujRSlCAhUkzux3Y1fpDoDg": {
    "date": "9/30/2015",
    "text": "Decent tacos and salsa bar. I had 1 chicken and 1 steak taco. There were some non edible pieces of steak in my taco, the chicken was much more tender. Its nice that its open 24 hours. I'll try a chicken burrito or quesadilla on my next visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "OzETGbgcAn8udzCgzUjp0g"
  },
  "bUZGh7AeBQaHC1SxG8EDVQ": {
    "date": "10/2/2015",
    "text": "Finally gave it a try for the first time since Frank's closed shop. Got a steak taco on corn tortilla with the free guacamole and cheese. Delicious!!! The meat is grilled and tastes great. I'll be back again. Open 24-7 365",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4d13xAX2jp2EbGF8I9eZZw"
  }
}