{
  "V_UGdKQ5VvyuCCMAHsWXrg": {
    "date": "6/7/2015",
    "text": "This is a good taco place if you're craving some street tacos. Casual, good service and vibe. Got the carne asada and baja taco. They are smaller portions than other places but they are just $3 each so $6 total for lunch or dinner is a great deal for me! The carne was good but the baja was a bit too greasy. The horchata was warm even when ice was added and bland tasting so I probably will pass on that next time. Some ratings stated that there is a good assortment of salsa.  When I went, they had just 3 choices: Hot, med and mild (guacamole?).  When I think of a good assortment, I'm comparing it to La Santisima which has 10+ choices at their salsa bar!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AON8xsIhrYTACJ3cXIww4w"
  },
  "xipIxeDHVv_GnSFKM5QsOQ": {
    "date": "12/27/2016",
    "text": "I've been on a fish taco kick lately and have been combing the city for the best ones. Unfortunately I was not very impressed with their fish tacos, very plain.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XMM7bk9XyrX6xjwdC_q0BA"
  },
  "lj9Hv8zTDfyAv1PnQaGqAA": {
    "date": "1/30/2015",
    "text": "We tried this place because of Howard Seftel's (AZ Republic 12/31/14) assertion regarding the Crispy Baja fish taco that this place \"nails this beauty\". What a disappointment! I couldn't disagree more. Rubio's on a bad day beats  Mucho Macho hands down for quality and by far for quantity. We also tried Pastor and Brisket tacos. Pastor tasted good. Brisket was not bad but not remarkable. Portion sizes are very small for the price.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kBjESL7tPB1wnvO_APgbFw"
  },
  "2aL1dRRot-hU-U8jus1szw": {
    "date": "9/21/2015",
    "text": "I was told to try this place after going to Tacos Atoyac. I was very impressed. The tacos are great and nice way to try different items on the menu. The carne asada is the best one! Nice and flavorful meat to go with pico de gallo, cheese, and great corn tortilla. Although I haven't tried most things, I was not totally impressed with the Joe's Crunchy tacos. Go for more of the traditional ones instead. Also free chips when dining in and great salsas! If you're in central Phoenix make it a point to go here!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0NPfPTYJAElePFsShAMeGQ"
  },
  "cYRMnmuzBFqixGazbbYEqw": {
    "date": "9/16/2014",
    "text": "Dan has done it again with his new partner Aaron Miller.  Only have tried 2 items but the 50/50 taco was so flavorful.  Really looking forward to trying out the other items on the menu.  Congrats Dan!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "v0im4lPXzS5-aWcArFf_zQ"
  },
  "xlz7_uWfwRR9Lb2f2pliug": {
    "date": "9/13/2015",
    "text": "This place is definitely worth the drive from anywhere in the valley. Super Totts are amazing and they have 10 different types of tasty tacos!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "W5itNh-lhyeXNyyv7FyZFw",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. The Super Totts are AMAZING here!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/W5itNh-lhyeXNyyv7FyZFw/o.jpg"
      }
    ],
    "user_id": "EFsTTU8N9fVh1YFqRsqolw"
  },
  "Q_4EnElJoD3BeMx3VMKNzg": {
    "date": "9/19/2014",
    "text": "I loved the turkey mole taco.  Basically it is gourmet street tacos.  At $3 per taco I would of preferred it wrapped better and 2 tortillas opposed to one for the taco. Yanquis right up the street $1 per taco gives me 2 & it's not falling apart when I pick up to eat it.  Also when I bring my $1 taco home it's not all over the box (see pix).  My wait was long I got there about 7:15 & it was packed.  I asked how long they had been open & the cashier said May.  I hadn't noticed the switch till recently but when I talked to one of the owners he mentioned they did their grand opening last week.  I got my 3 tacos at 8pm do the math (wow) which cost me $10 for what you see in the pix.  They where out of peppers at the condiment bar & running low on green salsa.  I asked owner who was running around cleaning everything  & he replied with they where out plus it was almost closing time (remember I got there at 7:15pm); next question what time do you close 9pm .  Overall tacos where good but make sure u place & tie up items before you leave.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KqjyGrUqliea5Y7Ogrwlgw",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KqjyGrUqliea5Y7Ogrwlgw/o.jpg"
      },
      {
        "img_id": "PgB52JCyvPISTR4wH7ezAw",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PgB52JCyvPISTR4wH7ezAw/o.jpg"
      },
      {
        "img_id": "jxTW3e-vFUhcOHMetHUQHw",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. Turkey mole, shrimp, &amp;amp; mahi tacos.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jxTW3e-vFUhcOHMetHUQHw/o.jpg"
      }
    ],
    "user_id": "05UFX1jotTnvuJV1_x9MhQ"
  },
  "O0JC6udtiI784_6ENi7Gqw": {
    "date": "10/13/2016",
    "text": "Friends have always recommended this place to me. It's far from where I live,  but didn't realize it's closer to where I work. So me and am office buddy went by today. I tried Joe's Crispy beef tacos and the Carne asada street taco. The street taco was not the best,  but I have to completely rave about the crispy tacos! Amazing! I will definitely be back and recommend to my friends.  Just wish they served beer. Great food and cool staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3MQ926gOgO7ENshB_yC0mQ"
  },
  "ZusycJO8NCMBS9krUNU9fg": {
    "date": "3/16/2015",
    "text": "Shrimp taco was good. Fish tasted like it was frozen fish sticks with sauce. Very expensive tacos. Each one is 2.95 and small. No combo meals. We got 6 tacos 2 drinks and chips for 30. I feel like I got raped with no  kiss goodbye.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M4fA7KFxo-Rd8uwED0_-kQ"
  },
  "oZklYiRvNiKXdE1AXcTIRA": {
    "date": "6/15/2015",
    "text": "This place is bomb! Super fresh high quality ingredients. Quick. Best fish taco/burrito I've ever had. Great salsas, beans and orange bang-Yes please! Dan, Matt, Stephen be throwin those fish tacos DOWN!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UfUFjbwLpYCeJrWUWdMYVA"
  },
  "3CBgaPnK45IUzzwj7nc-Gw": {
    "date": "9/25/2014",
    "text": "I don't know how it was possible to make a fish taco better than Dan's original joint, but he did it. I doubt I will ever have anything else here...so don't expect a review on anything but the fish tacos...but all I have to say is go here. Get the fish tacos. That's all that needs to be said. Good people. Amazing food. This is the kind of place all you locals need to spread the word about. Wow.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ul_vosQ1PnocSEMRV7awMQ"
  },
  "fJ6PPfAv2Nyd_5NpW9RfOQ": {
    "date": "9/26/2014",
    "text": "Great tacos! Had the shrimp, fish, 50/50, brisket, and pollo. All were awesome! Too many to choose from, will be back to finish the menu soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0AHjM_6tDx4W9aTudtCVug"
  },
  "TNFwqdOpdiiIYZ0aXICD4w": {
    "date": "9/25/2014",
    "text": "Great to see Danny back up and running! It's everything I'd except with a few culinary surprises that were great additions! Simple, fresh and absolutely tasty Mexican food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eLrJdEYwxzJgddnqawDQ1g"
  },
  "nw-LxD1SWaXcho0xBEtB2A": {
    "date": "9/6/2016",
    "text": "Love this place!  I had the 50/50 burro, no pic I at it to fast!! Everything is fresh and prices are great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NPxzHA2tHPB6mMkgOVpZdQ"
  },
  "D64sFZSphQN6LauB9dXqlA": {
    "date": "10/5/2014",
    "text": "The staff is very friendly.  The tacos are extremely small, and over priced.  About one dollar per bite.  The owners previous restaurant served the same product for less than half the price.  Food quality is  very average.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xsVGBlDuJmc9SSagSafNpg"
  },
  "AS0HpIb0Bv9sEpCYc7x1aA": {
    "date": "5/14/2016",
    "text": "Not a bad place, but not a place I'm dying to get back to either. The atmosphere isn't anything to impress - it's a takeout place that you can sit down at too.  Not a big deal, I tend to have a fondness for places that prioritize food over furniture. I had the Carne Asada burrito, which was decent, but not special. Meat was under seasoned and chewier than I'd like, but not grisly. I find it a bit odd that you have to pay extra for rice and cheese, but they are very generous with the meat - one could argue it balances out. Overall portion is sensible and satisfying, not excessive.  The salsa bar is fair, with a great creamy avocado sauce. The hot red sauce tastes like it has alcohol in it, or had fermented - a very unwelcomed surprise.  The mild red had a similar issue, though less pronounced, and seemed to have a hint of a marinara sauce to it. I sampled each red sauce once and stuck to the green sauce. I'm wasn't familiar with the owner's following or previous restaurants, until reading some reviews for this place, but this experience didn't seem to warrant that reputation.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x5YLeYHBSzCUnD6-FDJjrw"
  },
  "hbtKTgbLV-VNzvxiVyMuHQ": {
    "date": "7/10/2015",
    "text": "Just ate there for first time after wanting to try it for months. I ordered the Carne asada burrito. The steak was cut into huge chunks which made it difficult to bite into. It was also chewy and bland. The only thing I like was the green salsa.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wqwsuNYYNgT5v8s_wU2rdw"
  },
  "CFESrIjHbx_hqv5KDWvPyA": {
    "date": "4/21/2015",
    "text": "Dan is the man!! Not very good mexican food optiond here in Phoenix,  but this is by far the best!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4WbaUQUhqt1XtxyAJMb_lA"
  },
  "eafXVSExWiGdSbds6YqpAA": {
    "date": "3/17/2015",
    "text": "It's hard to mess up street tacos, but trust me it happens, but luckily not here! I got chicken and fish tacos, they were both delicious!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lxv9nI7ZfNX0p3jkqdJdIA"
  },
  "Iy4pbgKftS4pIls4LBtdxw": {
    "date": "11/27/2014",
    "text": "Great tacos. I had 2 fish and a side of chips and salsa. They are street taco sized but filling nonetheless. Super friendly folks at the counter. I'd go again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-pkmwtEgU2l0gRBRaVXI6Q"
  },
  "5hUtfoMijXaVkoxHnd1Vjg": {
    "date": "4/20/2015",
    "text": "This place is awesome!  I read a few reviews and checked it out last week.  I have the brisket burrito which was tasty and an interesting take on a burrito.  I then came back and got the Al pastor burrito and it was so gooood.  It has great flavor, it's moist with Papaya in it.  I got chips and salsa too which is tasty.  This place is perfect for Lunch to get in and out.  Everything you expect out of a hip little taco joint.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5X7syimE5Z0UPr6WA73qJw"
  },
  "gv8oWbUnYQkgrAibfCHijA": {
    "date": "1/14/2017",
    "text": "De-lish! Great atmosphere. Awesome music! And friendly staff. Pork belly,  lengua, shrimp, and fish tacos. Tasty salsas. #muchomachotaco #streettacos",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XGqUpBd1nSvk9oeMu3DxSw"
  },
  "xdGDeMcJqmqM-hPF7yjKqA": {
    "date": "1/22/2015",
    "text": "Well, it's not bad by any means, but the food didn't really have a hook to it.  I got the fried fish, 50/50, and carne asada tacos.  The fish was nice and hot but the overall taste didn't really jump out at me.  The 50/50 had good chorizo, same problem with the taste not being really special.  The asada is good, but....you get the picture.  When I try a new taco place I want to have that moment where you really find something you like in your first bite, something that stands out.  Everything else is done the way I like it.  Salsa bar with regular and spicy (not much flavor, tho) and an avocado cream sauce that is excellent.  You can ask for habenero sauce which they keep in the fridge.  Really easy to find, easy parking, fast prep, really friendly staff, free soda refills.  One of these days I'll probably head back in again and give it another shot.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ap0-JqUsibRaVSlTf_HqnA"
  },
  "oT8jrsPbInsNjBqIr9B3TQ": {
    "date": "8/7/2015",
    "text": "Been to Dan's new place about 4 or 5 times and we probably will stop there. I keep waiting for some reason to love this place but it isn't there. Our last meal consisted of a decent fish burrito, 2 tacos my wife stopped eating and a bag of uncooked tortilla chips. No joke. The bag was 1/2 full of raw, uncooked chips.  Furthermore the salsa, which is pretty decent, had to be filled up by the customer at the salsa bar.   There are a ton of quick Mexican style restaurants in Phoenix and several nearby. Good thing Dan's old place is nearby, we will probably just make the drive there from now on.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "h07r0HQv4OuUnmxyuofGyg"
  },
  "aswFpC3DxSeIHcu0Crbzcw": {
    "date": "8/13/2015",
    "text": "Just had a great trip to Phx and got to knock a lot of places off the ol' bookmark list.  Mucho Macho is kinda dive-y and not super Mexican-y. As Taric says, \"it's got a real stoner, SoCal vibe.\" We came in on a Thursday at lunch time, and had to wait in line to order. The restaurant is tiny and packed. It probably has room to seat about 12, but they've packed in tables and chairs for 20. Seriously, when people are sitting all around you, the chairs are back to back. There's no way to get out (or to the soda machine) unless people scoot their chairs to the side for you. Between the 5 of us we tried a variety of tacos, the hot dog, and the kids plate. I think the best deal is the 4 crispy tacos for $4. The kids plate is pretty awesome with meat, beans, rice, and a tortilla for $3, too. While service is friendly and pretty quick, they gave me chicken tacos instead of al pastor, forgot the tortillas for the kids plate, and forgot to leave the chiles off my daughter's hot dog (which made it way too spicy for her).  Overall, I would go back if somebody requested it, but I'd rather hit up Otro Cafe if in the area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YIMeEHUYm69m-Mqf-NjPHw"
  },
  "d9z8wu-95wNxqTcUAZOdiA": {
    "date": "4/20/2015",
    "text": "Very cool, low key, gourmet taco place. Fast service and they have awesome churros. Fun small salsa bar is perfect for the small space. Everything is super tasty. I love the 50/50, pastor, and shrimp taco personally.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EomzMtIgl4rfhrt-JsxHGg",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. Vegetable and hummus taco with trio of salsa from the salsa bar.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EomzMtIgl4rfhrt-JsxHGg/o.jpg"
      }
    ],
    "user_id": "oyiGCl5mt5KAwNh0fyquhQ"
  },
  "tI9lwKDiB4HPcf_ozK6xwQ": {
    "date": "12/19/2014",
    "text": "What can I say... I LOVE tacos! And these definitely do not disappoint. The tacos are huge! I mean MUCHO MACHO huge! I ordered 6 thinking they were small basic tacos and I was wrong. They are packed with flavor and each one has its own flair. I really liked the Pastor (sweet and flavorful with green papaya) they even have sriracha here too! The 50/50 was perfect, great combo of flavors with the pico and queso fresco. A great ( and clean ) place by another local owner! Wish I had more room to try dessert, I also had a fresh batch of Horchata topped with pecans (sooo good and refreshing) . Dan and his staff are super friendly and want to make sure you enjoy your dining experience. If you are in the downtown/uptown area this is def a great taco spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Lnru83BmOcIruRrCfufHeg",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. Freshly made horchata  Dan went back to make some more, that was so awesome!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Lnru83BmOcIruRrCfufHeg/o.jpg"
      },
      {
        "img_id": "oJEZN3PARDAkVTsHIu99VA",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. Mucho Macho tacos! They are huge!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oJEZN3PARDAkVTsHIu99VA/o.jpg"
      },
      {
        "img_id": "hYNTUnM3k0xL4Qm-SBO1JA",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. Brisket, pastor, Baja tacos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hYNTUnM3k0xL4Qm-SBO1JA/o.jpg"
      }
    ],
    "user_id": "H0r5UfPsofy7PXmVEplRpA"
  },
  "zqsw6tBGvEHG6p3h02fE9w": {
    "date": "11/19/2015",
    "text": "Came by recommendation of a friend and I am far from disappointed. This taco shop has done something right! Usually with Horchata it can be too sweet or too cinnamony (if that's a verb?) but the Horchata is perfect. Chips are crispy, litely salted to perfection, and the chorizo in my breakfast burrito was just right! Definitely recommend getting the breakfast burrito! So far my favorite one I've found locally :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KYEZlhdZNgr0FCwjblqIjg",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KYEZlhdZNgr0FCwjblqIjg/o.jpg"
      }
    ],
    "user_id": "bM6YVHCq9xsQT8wb3PfxEg"
  },
  "WQ02abcNXifzVukVr2EvdQ": {
    "date": "1/16/2015",
    "text": "50/50 taco, different but yes! The chorizo wasn't overpowering like I thought it would.  Bacon taco, first bite the bacon was a bit over cooked. But the next bites were explosion of flavor in my mouth! The sauce!!  Steak taco, again first bite it was chewy. It also needed some help with the delicious green salsa.  Horchata, you gotta!! Sweet yum in your mouth.  The random karaoke from Dan was fun, lovin' the reggae. The price is a bit high than I'm used to, but well worth it!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "13sD6TO71SdkB_Xcn275Ug"
  },
  "NHFgimJLDczwj0rmdrDVxA": {
    "date": "2/12/2017",
    "text": "I went here with a couple friends and my 2 kids during lunch and had great food. My kids are picky eaters and they both loved the carne asada taco and fish tacos. I had a great experience and wanted to bring my husband back when we did not have the kids with us. I looked on their website for hours and said it was open EVERY DAY from 11am-9pm.  When we arrived today (Sunday) at 1:00, they were closed. Very disappointing because the sign on the front of the building even says it is open every day. I will go back because the food and service were great, but the hours and days they are open should be changed because we drove over 30 minutes just to go there.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yw_80RuAEnj3vHBgvZFlRw"
  },
  "2k_RDNuXsYnAMSPStM5aCg": {
    "date": "8/30/2016",
    "text": "The shrimp tacos are what made me round this 3.5 to a 4. The other types of tacos were okay, nothing too amazing. But the shrimp tacos definitely blew me out of the water. Would recommend only if your in the mood for shrimp tacos.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zNzeCh4mZPZsdGU1uV3z7w"
  },
  "Uqdkdn9ml-VlRCGX9ocjog": {
    "date": "12/22/2016",
    "text": "Mucho Macho is right by my work and I'm honestly so thankful because it's quickly becoming my favorite! Their Macho burrito is my absolute favorite and the peeps who work there are really chill. If you are in the mood for some bomb food then this is your place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DniKFM4zqnYlqve7t13DGw"
  },
  "gpzcgxkKbVvv9XYIxzVdZQ": {
    "date": "9/16/2014",
    "text": "If you ate at Tacos Atoyac before it closed in March, you have met Dan Maldonado. If you have eaten at the new version of Atoyac since it reopened, you may have wondered, \"What happened to Dan?\" Mucho Macho Taco is Dan's new venture.  Of course I was excited to try the new place. I didn't really know what to expect. One thing you should not expect is another Atoyac. You will notice right off the bat that this is a fast casual place, not a hole-in-the-wall. MMT is in a nicer neighborhood, in a nicer building, next door to a French grocery. It is not Oaxacan cuisine like Atoyac. It's not the same food or the same ambiance. I think the only thing the two places have in common is Dan and the horchata.  MMT is, much more so than Atoyac, a taco joint. Here, instead of simple, traditional street tacos with one or two ingredients, you have a whole slew (maybe 15) of taco options with more elaborate, less traditional flavor profiles. Brisket tacos with clementines and grilled onions. Bacon tacos with pico de gallo and cream (yes, bacon tacos. It's as delicious as it sounds). Vegetarian tacos, 50/50 (chorizo/beef) tacos, chicken tacos, asado, grilled fish, Baja fried fish, shrimp... These are tacos that pay homage to traditional street tacos, but are modern and creative.  This is what a fast casual taco restaurant should be. There are certain aspects of Atoyac that I miss - its fish tacos and non-taco offerings - but if you're specifically looking for awesome tacos, Mucho Macho is far superior.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 2
    },
    "photos": [],
    "user_id": "xwXw5HW3Y6Gr37V0KxX8sA"
  },
  "EGh08rlgH028A27oBXmiXA": {
    "date": "10/11/2016",
    "text": "How many days in a row am I allowed to eat at Mucho Macho? Jeez, they are good. Try to horchata and thank me later. I'm kind of glad this isn't within walking distance or I would be here everyday!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4fVpNDKn7mYEPr4zJPBAmQ"
  },
  "u8310x_5sM2kLlgmpYD0Rg": {
    "date": "10/14/2014",
    "text": "When Tacos Atoyac announced their closure back in March of 2014, I thought it was some sick twisted April Fools joke. April 2nd came and went, still no news. However Tacos Atoyac reopened (under a new and hardly pronounceable name) but it wasn't quite the same without Dan.   Fast Forward and Dan has returned, this time bringing fresh and adventurous tastes along with some old favorites.   I was happily greeted by the bearded man himself as I walked in, and gave the menu a quick run through. Dan knew my usual, now called the 50/50 (Carne Asada combined with Chorizo), and assured me that not only did it come in a taco but also in a burrito. My mouth was already watering. So I promptly ordered a 50/50 burrito along with a Bacon taco (yeah...bacon...meat candy) and a Brisket taco. Chips were then handed to me while I waited for my feast, I walked over to the salsa bar and grabbed some dark red salsa, which had an amazing smokiness to it, and the avocado creama which is light and fresh.   When the food came, it looked great and the portions were bigger than Dan's previous restaurant. I first took a bite into the Bacon taco...and then immediately devoured it. I could probably eat a dozen of them in one sitting. The brisket taco was next. The meat was tender and flavorful, the sliced oranges and cilantro really tied it all together. The 50/50 was the highlight of the meal. Both the Carne and Chorizo were far beyond flavorful, I compared eating this burrito to that of a spiritual experience.   Hands down Mucho Macho blows Tacos Whatever out of the water. This is my new \"got to\" and is the home of the best tacos in Phoenix. Get down here!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "jRe3TlrGIGlxR1dHfr0gKg"
  },
  "PbpnvD43HgaaJFmnPolNYQ": {
    "date": "1/29/2017",
    "text": "My whole life I never liked salsa until I came here. Fast service, great food, good prices. They've got it all.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3lCVh0fzQ9oO7Ntct487aw"
  },
  "b2N9eCwJwaE_bqQTpmXN_g": {
    "date": "9/26/2014",
    "text": "When The Arizona Republic recently reported on a new taco shop opening up, I was inclined to read more. After dedicating so much real estate to copy and full-color pictures, not to mention a glowing review, I figured this would be one place I'd have to try. Since I live in the East Valley and work in Downtown Phoenix, I figured the best time to go would be during my lunch hour.  Travel time to the small shop just past Camelback ate up most of my time, so I got my order to go. Not knowing when I'd be back here, I thought I'd try everything that appealed to me. The review mentioned the Fish Tacos. Those sounded good, but I wanted to try a Torta, so I got 'The Surfer' which is their Fish Taco-inspired sandwich. I say 'inspired' because the ingredients aren't quite the same during transition. Like my relentless quest for the ultimate Chicken Fried Steak, I'm always on the lookout for the 'best' Sonoran Hot Dog, but this wasn't Sonoran. Oh well, close enough. To polish off my meal, I went with the Sopapillas. The Republic had a photo that made them look SO good, drizzled in condensed milk, chocolate and sprinkled with Pecans, it's almost suitable for framing.  The result? The hot dog was good, not great. It was on an everyday hot dog bun, not some steamed warm bread that you could find at other places. Simply put, I've had better hot dogs served by an old lady with a cart and a picnic table in a parking lot.  The Torta was good. The contents were tasty and fresh. The bread was less Torta bread and more Ciabatta. Those of you who've had authentic Mexican Tortas know the difference between a Torta and a sandwich. Need I say more?  That brings us to the Sopapillas. Remember, I got these to go, so I didn't have time to inspect before leaving. First off, no pecans. Secondly, they were a tad overcooked. Thirdly, well, let's just say 'smothered' isn't the adjective I'd use to describe them in relation to the sauce.   The reigning champion of the best dessert in Phoenix has to stay with the Churros of the Barrio Cafe in Phoenix.  So that's it. Some may not like my review. Some may disagree with me solely on the basis that I went to a taco place and didn't have a taco. Whatever. Will I go back? Yeah, probably ... if I'm ever in the neighborhood. It sure beats a '----berto's' any day.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "rsvYIk-Kvxg9BjAQEYKDug"
  },
  "-ZWx-IzLlKOMesKPix9JpA": {
    "date": "10/11/2014",
    "text": "Cool little build-out and decor. Tried 6 different tacos, chips & salsa (no drinks) which came out to $23. Tacos were good but not great and really small. Literally 3 regular bites.   We were very excited to try this spot out as we'd been to his old place and this one is walking distance to our house. However, considering the price I just can't justify making it a regular stop of refer to a friend. Arrived excited, left wanting more and to pay less... :(",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8e5MOKPRBQNpholmiSMGoA",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8e5MOKPRBQNpholmiSMGoA/o.jpg"
      },
      {
        "img_id": "gnIKnjcyoxNthVpS7i0s_Q",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gnIKnjcyoxNthVpS7i0s_Q/o.jpg"
      }
    ],
    "user_id": "SFZUSNPRkYLFgQXubZOzig"
  },
  "37D_QGssnb-roEbCh5Le4A": {
    "date": "12/9/2014",
    "text": "Thrilled with Maldonado's new restaurant.   What we had: The horchata: the pecans always make it just right  The brisket, crispy fish, 50/50, the pastor and the shrimp. Pastor was the star of the bunch with the papaya slaw on top. Crispy fish was perfect and not salty like Tacos Estilo de Oaxaca.   What I loved: Maldonado remembers us from Tacos Atoyac days. He offered us the habanero salsa. I asked him at a distance, sort of whispering so as not to offend other patrons, \"do you need balls for this?\" as I made a gesture to illustrate my question. And he merrily responded, with the same gesture, \"yeah, really big!\"  He was right. A drop was an atomic bomb to my mouth.   The food is good and cheap, the staff is personal and friendly, what is seriously not to love? I will drive 4-45 minutes for this place!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fdElcNLGXA4jUVTqwkgioQ"
  },
  "JFJdicvJl4ZryIqCKoFFnA": {
    "date": "8/18/2016",
    "text": "Carne asada had a lot of grizzle, the meat was extremely salty, my taco fell apart after the first bite... They should double up on the tortillas for the tacos! It's not all that!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JkmveDlFNOOX5WhC9lkfag"
  },
  "ew2qVEHmmWSqZuYQZCTu3A": {
    "date": "6/23/2016",
    "text": "Grilled fish taco and grilled vegetable hummus is delish! I came here for lunch because of the yelp reviews. I wasn't dissapointed. Great spot to come and have tacos and chips and salsa.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "X2efltJnbmlMmYphNFB66A",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. Great tacos!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/X2efltJnbmlMmYphNFB66A/o.jpg"
      }
    ],
    "user_id": "fonOhzRT7HM3wo591I1y7A"
  },
  "NPAnbxLYMVwjIf4l0tBhPA": {
    "date": "9/22/2014",
    "text": "Great service, great food. Forgot to add cheese to our burritos and they went above and beyond to fix it for us.   We will be back to try the tacos next time. Atmosphere is appropriate for Mexican on the fly, definitely a casual place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1x0s5YIBL01wk_HOpQ9Dew",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. What&amp;#39;s left afterwards.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1x0s5YIBL01wk_HOpQ9Dew/o.jpg"
      }
    ],
    "user_id": "jkM_jFcUL_nxMlRwFZpVnw"
  },
  "M3unzHdh_ok4eZ22jpkPjQ": {
    "date": "1/13/2016",
    "text": "Yummy. The street tacos are delicious and they are not skimpy with them. Good price point. Friendly people working there. Solid place for a meal. I am pretty sure this will become a regular lunch spot for me.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "TUwexsShPlf1VA2Yy2YAPA"
  },
  "Ka5O1qxO2PT5jUqfVKgL-A": {
    "date": "1/16/2016",
    "text": "Saw this place via Instagram from a local AZ foodie critic and had to give it a try as I was only around the corner at the time. Definitely not disappointed with the food and service! And on top of that, one of the owners went above and beyond to ensure my good friend and I slipped slowly into an enjoyable food coma with a taste of the amazing tots with cheese, pico, and chorizo!  Definitely will be back to try out other menu items! Definitely take the recommendations of the employees!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "DsFV2YX8FmIsq6OAAqvnvQ"
  },
  "sCZ6mPZcXO4JWeUjuXIdig": {
    "date": "2/24/2017",
    "text": "One item on their menu ALONE earned my 5 star rating, the Joe's Crispies! They are to die for. My boyfriend and I have been coming here a lot lately and those braised beef beauties are all we order. He has gotten other things that are very good as well, but it's very hard to pass up the Crispies. Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HnpF3_97GiIRDVYF6l1uhQ"
  },
  "1XO8s53VW-HqxLiLn-JtZQ": {
    "date": "4/22/2017",
    "text": "This place is out of everything, food was cold and meat was cooked in chorizo grease it seemed. And to top it off they want 2.50 for chips and salsa...... Never again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QOdJHvwe0yJ_sPDKvugzWg"
  },
  "N7hLoAZh-z_DT0ujtmsBCA": {
    "date": "6/10/2015",
    "text": "This pains me to leave a 2 star review. I was so excited Dan had opened up a new spot and once we heard about it, we placed it on the top of the list for the next time we were in the area.   We stopped in on a Saturday afternoon after the Melrose neighborhood street fair. The parking lot was full but it looked as though everyone was at the french place next door. Upon entering we were promptly greeted with a very friendly and easy going lady. After scanning the menu I ordered a carne asada burrito and the Mr ordered the shrimp tacos. We sat down and she brought us chips and mentioned the salsa bar. I don't recall if the salsa was good so I won't comment on it. There were maybe 3 or 4 different ones to chose from. The atmosphere was clean, and it had some great local art on the walls. It was dead for a Saturday I thought but ok by me.  Our food came and it wasn't very exciting looking. My burrito was packed with watery bland pico and flavorless mushy carne. The bottom of my tortilla was so soggy I needed to use a fork to eat it. I had to douse it with lime juice and salsa to make it only slightly edible. Mr's shrimp tacos were bland as well. Maybe it was on off day but we were so disappointed. :( I think we'll wait a while before we come back. I do want to give MMT another shot but it won't be for a while.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZaUSKKKcD6SopY299FGdiA"
  },
  "mTupofjSoI0tNV_pJh5Ccw": {
    "date": "2/3/2017",
    "text": "Place is amazing...have probably tried just about everything on the menu and never disappointed. I eat here so often I'm probably putting one of the owners kids through college.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h5mLyZhq21YTKvqN-09lSA"
  },
  "9RreOzztwjR7-qakhVZLGA": {
    "date": "11/1/2015",
    "text": "A haiku for mucho taco:  Authentic not quite  How you spell relief now My stomach gassy",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M4X35bdRmWJIV4FPx7-xfQ"
  },
  "mXox5ifRwqPkYBgM3ntdFg": {
    "date": "12/10/2015",
    "text": "This place was good!!! Love the vegetarian option and good rice and beans. Only 4 stars because it was a little dirty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8q9aUHOTuQ7Cm8PuaCjbWw",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8q9aUHOTuQ7Cm8PuaCjbWw/o.jpg"
      }
    ],
    "user_id": "WFN-sUvDzJz9Ip5lxEBJSA"
  },
  "eKQQdE7PPE3i-jko_Zpg7A": {
    "date": "7/10/2015",
    "text": "After passing this place twice a day every day and reading an article on a fish taco battle I decided to stop.  My first impression was that it was another hipster dive in the neighborhood and I'd say I was fairly accurate. Staff not very friendly or helpful, not exactly the cleanest place as some of the tables were still dirty while the staff talked amongst themselves in the kitchen.  The fish tacos were not that great so I don't know where the competition was, but I've had much better in other shops in the valley.  The prices were decent for what it was so I don't have a complaint there, the chips and salsas were decent, but over all i was not really impressed for ll the hype.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sOCuf-jZo43DUzWTDKiR9w"
  },
  "vHnBo6nAQM4GYt8yKa3uww": {
    "date": "2/23/2017",
    "text": "Excellent food, friendly staff, and loads of salsa's that are tasty! First time ever being here and I'm more than willing to come back. Their servings are perfectly sized and are filling.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VAYoLb50nvRbhSh2Ms2oxQ"
  },
  "MExVBy6gxe0huMuq94p9Sw": {
    "date": "8/24/2016",
    "text": "All I can say is, meh. The food was okay. The atmosphere okay. But what got me is that I paid $2.95 for chips and salsa and they basically just took stale chips from a bag and put a handful in a basket, not sure how that was worth the price.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GZcF8l35dRTKIi6ero5erA"
  },
  "pRPuT903wfonkRCwDTBbRQ": {
    "date": "11/8/2016",
    "text": "Best fish taco's in Phoenix.  Period.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eaJ-mhvPNX8q0aYf1-1-0Q"
  },
  "K2c0X8veh_-CvLzuuONpjQ": {
    "date": "12/23/2017",
    "text": "These guys helped me cater a small party and the food was incredible! The pricing was super reasonable and the owner even made sure the food was hot and fresh at the exact time I picked it up. I highly suggest them for catering!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tfv4AyoeNtihJ98Qc-VhGQ"
  },
  "5GiDsbNSStoHerMKvs2drg": {
    "date": "3/12/2015",
    "text": "I stopped there by accident since it was passed my lunch time and I was hungry driving around.  The place is appealing since it's a low key hole in the wall. The employees were friendly and in general in seems like a cool joint.  I ordered 2 steak tacos and 1 pibil pork. Horchata to drink.  The horchata was no bueno. Too sweet and it tastes like almond. I mean, it's half decent if they call it something else but if you've tried horchata this would disappoint you.   The tacos were bland. Period. The tortilla was cold. Nothing close to the real thing.  The salsas were tasty though.  Parking is also an issue.  Cheers",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "LnnYSUlw_MVdtoYUt4oZ5g"
  },
  "z2Jh3yRVBtQOIkyhizbsbA": {
    "date": "5/12/2015",
    "text": "Well deserved 4 stars.  This place is great.  $3 Tacos with a good variety, Classic Rock playing over the speakers, and fast service. I'm sold and will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "du0vOcloMRRqDn58fvDUAg",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. 3 Tacos!  50/50 chrizo and steak Taco, Skirt Steak, and Crisp Baja Fish.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/du0vOcloMRRqDn58fvDUAg/o.jpg"
      }
    ],
    "user_id": "ZL0AEkN6n5_WY1t-N9qNTA"
  },
  "BJ7EeMt_quWAJ5kyd8t5vA": {
    "date": "1/18/2017",
    "text": "My husband and I visit Dan and his crew at Mucho Macho Taco at least once a week. I love the al Pastor burrito and hubs loves the carne asada burrito with a carne asada taco on the side. Salsas are delicious! Chips fresh. I have tried the braised beef, delish, Green Chili Pork, (my other fav). Every single thing I have tried here has been delicious. Dan and his crew cook up the goods!!!! I am a little hesitant to say just how good it is, for purely selfish reasons. I don't want to have to wait in too long of a line to get our fix. Although, Dan and his crew deserve the all the success they have worked so hard for! ox",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yPRpxtAk1dhw0BCLfZnexg"
  },
  "-Ie3bLk55kRLLhSxrBXZSA": {
    "date": "3/22/2015",
    "text": "Have come here a few times and the food is great, the salsa is great (especially the green) but more then all of that, the service is great! Most of the time you go, Maldonado is there and talks with random customers often. It really has a neighborhood type feel when you are there and talking with the various staff members.   In fact, today is a late Sunday night and I was dreaming of a mucho macho burrito but looked at the clock and realized they closed in 25 mins. I jumped in the truck and was there in about 2 mins. I could tell they were wrapping up for the night and I didn't want to be the guy who places a last min order, but before I could even ask if they were done for the night, the guy behind the grill walked over to me and asked me what sounded good tonight! I mentioned a carne asada burrito with tots and his eyes lit up, to which he responded \"I live to make that burrito!\" He throws the tort on the grill and asks me \"do you want it a little special?\" I was intrigued and absolutely obliged. He handed me a cup and said \"go to the salsa bar and give me a few scoops of the green.\" I watch as he constructs what could only be described as a chipotle sized burrito and he even threw in some extra rice that they had! He artfully layered together tortilla, tots, meat, green salsa, queso, and rice.....talk about legit!   I haven't even bit into this amazing burrito yet, but was genuinely impressed with this gentleman behind the grill tonight! I was kind of expecting the staff to be short with me due to the late night order so close to closing, instead I was treated to a pleasant conversation and deluxe carne asada burrito with tots! Top notch!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pqy1NZCo68m8bjs8DVnlZA",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. Carne asada burrito with tots and rice! It&amp;#39;s HUGE",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pqy1NZCo68m8bjs8DVnlZA/o.jpg"
      }
    ],
    "user_id": "dGQri6Z0cZeRE1jTad4TuA"
  },
  "UBH0d2u6hL-K2Ousih8QrA": {
    "date": "1/17/2017",
    "text": "We went for the first time tonight for dinner and had such a great experience. First of all, the manager Antonio was so helpful walking us through the menu and pointing out his favorites. We ended up getting the Rosarito Dog, Crispy Fish Taco, Carne Asada Taco and Braised Beef Taco. The Rosarita Dog was like a Sonoran hot dog on steroids, so delicious and filling! And all 3 tacos were really good, my favorite was the carne asada, such good flavor (a little salty but that's my style). We will definitely be back for more!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xy8i-SLbtbEyTXEmRTvIzA"
  },
  "H_mac8gwS9hfvBQWhJIxjg": {
    "date": "12/30/2015",
    "text": "Solid place.  The crispy beef tacos are great as well as the breakfast burrito.  Get the horchata too.  The staff is very friendly and the service is pretty fast.  Love this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nWNLWRyTW5KQn7GRZO6AaQ"
  },
  "LomrJq9bfZ5iWcRRkrsCJA": {
    "date": "5/2/2016",
    "text": "This food is the bomb! Highly recommend if you like Mexican food with a mix of white, the tacos are a good size to fill you up. Try the Rosarita Hot Dog!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cJp61Rq_I5A3kHpYfe41dg"
  },
  "i7iq-LOkk9-0VBmDvpPvkA": {
    "date": "4/20/2016",
    "text": "This is one of my favorite taco places. The carne asada are to die for. The environment is quiet and the staff is friendly too. I would highly recommend..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sxdfLLTihwWYl_NrGiZVrw"
  },
  "Nf15yQsMJ_dBBbW6nHt5_Q": {
    "date": "12/11/2016",
    "text": "we live pretty close so i stop in here a couple of times a week. it's always solid: friendly staff, a healthy amount of food, and worth the price. everything is always tasty, though i have a soft spot for the crispy fish tacos/burros/anything. the horchata is pretty bomb as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tyUrab1kICpQUROZ1bhQoQ"
  },
  "trrd5Gxd8gK7-d0FkBtaTQ": {
    "date": "5/26/2015",
    "text": "The place is a small hole in the wall. There was no customers on a Sunday at 6.00pm.they have a limited menu . We tried their breakfast burro . It came with hash browns which made for an interesting combination . We liked their fish and shrimp tacos . The place is simple and was fast",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4ZkQwaOoLT2eJWux9fE1Jw"
  },
  "J7J8HAY7X1dLfZgv67OtYg": {
    "date": "3/17/2017",
    "text": "Very, very good! Had three different tacos, fish, Carna Asada and beef. All three we're good. But the fish taco was amazing hands-down one of the best fish tacos I've ever had. My husband ordered a chicken burrito which was big enough for two meals. Huge. From the chips to the salsa everything was great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QzbT32VEWlEXE7OyY1yBxA"
  },
  "V7o1m3XtTDNRmt47ghkA3A": {
    "date": "1/22/2016",
    "text": "Delicious! Love the fresh grilled peppers and onions. I had the crispy tacos, excellent!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A7Z_J8yyEcnVOqt4PstdcQ"
  },
  "EobGfuqA22McUxN_5ArhfA": {
    "date": "11/25/2014",
    "text": "The only thing authentic about this Mexican food is that I had to run to the bathroom  after I got home.  My wife also got a tummy ache and hers lasted into the next day.  I eat out a lot and I eat a lot of Mexican food so don't dismiss my gripes as coming from some ignorant gringo.    The tacos are a bit pricey for being so godamned small.  Yes I understand that street tacos are small, but maybe Dan could have his food assemblers (not cooks) stuff a little more meat and fish in there and a lot less cabbage.  I ordered a pastor taco, a fish taco, a shrimp taco and a bacon taco.  I ended up with four cabbage tacos with some scraps of meat.  The tacos were room temperature and none of my senses gave me any indication that there was any cooking going on in that kitchen.  It was like the food was cooked offsite, delivered to Mucho Macho and then warmed up and kept in warming trays.  It drives me nuts when Yelpers get things so terribly wrong.  The food looked nothing like the photos I have seen and certainly it did not live up to the impossible expectations that one might have from reading the reviews on Yelp.  This is Phoenix Arizona, we are a mere hundred or so miles from Mexico.  Mexicans are pouring into our state every hour of every day and they bring their culture, chefs, tastes and appetites with them.  In this city there is no end to the excellent, mediocre and lousy Mexican restaurants.  The sad fact is that even Q'Doba, Rubios and Chipotle all have Mucho macho beat by a mile, not that I eat at any of them or recommend any of them.  Eribertos, Filibertos, Ralibertos and all of the other Bertos's also have Mucho Macho beat by an even greater margin. If I am going to eat Mexican food under fluorescent lighting, it better be delicious and the price point better be good, and this is where Mucho Macho fails.    I don't want to go on too much longer, but the rule that has never failed me as far as Mexican food goes is to take a look at who is eating there.  Are there blue collar hispanics eating there and enjoying themselves?  If not, then move on.  Lastly, my order and my wife's order were all mixed up when it was delivered to the table.  The food assembler had the nerve to stand there impersonating a waiter hovering his finger mere millimeters from my food trying to identify what was under all those mounds of cabbage.  I couldn't tell and i don't think he could tell either.  I ended up eating one of my wife's tacos before I realized that they grouped the tacos together by type, not by how we ordered them.  So there I was pulling out the remaining tacos spilling cabbage all over the place.  I don't know man, you yelpers that love this place have to be paid shills.  I dropped over $24 for about thirty cents worth of corn tortillas, $2 worth of cabbage a couple of fish sticks and bacon crumbles.  In all fairness, the pastor was OK, not great, still just room temperature but passable.  I'm sure Dan is a charming or charismatic guy, and maybe I was there on an off night, but my food flat out sucked.",
    "rating": 1,
    "rated": {
      "funny": 5,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "kQK5S89fvIcCQk2P3I6tLA"
  },
  "x-Fdg_qYCi7oEkiXzKgOfQ": {
    "date": "7/24/2015",
    "text": "A co-worker and I drove by and said we have to try it, some of the best tacos and burritos are found at places similar to this, so we did and it did not disappoint. First off the Rosarito Hot Dog my co-worker ordered looked great and he said it was amazing (he ended up getting another after the first) I ordered the carne burro and a pastor taco....delicious!!!! The carne on the burro was fresh and tender, and the pico and crumbled cheese made for a simple delicious burro. The people giving somewhat lower reviews are entitled to their opinion but I personally would have to strongly disagree. Keep up the good work!! We will be going back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "kdgMFj62bn7RAH_30XK3HQ"
  },
  "yjZWaornhOrYVVa0_H28_Q": {
    "date": "12/16/2014",
    "text": "Mucho Macho Taco - so the Macho comes from using 5\" tortillas instead of 3\" for their street tacos. Personally I think they should have spent more time making food with Mucho flavor instead of worrying about tortilla sizes. Mucho lacking here at Mucho Macho Taco. I went for lunch and after looking at the menu went with the brisket burrito, with green chillies, carmelized  onions and oranges.... Uh no oranges please. The green chillies were not New Mexico Hatch green chillies but instead food distributor canned green chillies. Carmelized onions, diced and slightly cooked does not equal carmelized. While the brisket was decent I am quite doubtful it was slow cooked out back for 10 hours- most likely off the Shamrock or Sysco truck as well.  While there is a salsa bar at Mucho Macho I did not care for any of the salsa options. The \"hot\" salsa which kind of looks like roasted salsa is nothing more than red pepper flakes and oil. Funny, I never use oil when making salsa. The mild was simply blended canned tomatoes and lacked flavor, the green which I am guessing was supposed to be an avocado whipped salsa had decent texture but also lacked flavor. There was no pico salsa available - WTH??  So in closing, the location is clean, simple decor, and the guys are nice but I will not be going back here at anytime as it significantly falls short of hundreds of other Mexican restaurants in the valley.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "JikUtIO_yWvAb5fWlJbeeQ"
  },
  "X_OSMgRyEk7s6rD3rze30Q": {
    "date": "2/23/2017",
    "text": "The food here is delicious! It's priced fairly reasonable but overall it's great place for tacos!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lfuPpy1tpMJl2HNCB1Hrjg"
  },
  "buBcI9nyB62O28XWq8FkrA": {
    "date": "6/17/2016",
    "text": "Welp, I used to think you couldn't ruin tacos, and then I ate at Mucho Macho Taco. We had the pastor, the carne asada, the Joe's Crispy, and the grilled vegetable and hummus, and a side of refried beans. I have never tasted tacos so bland and flavorless in my life! No seasoning, no heat, no nothing! Even the textures were off-putting. I thought \"well, I guess I'll drown these in salsa to give them some taste,\" but no, even the salsa lacked flavor. The \"hot\" salsa basically tasted like tobasco sauce. The only flavor gleaned from the beads was from the cheese on top. The orange Bang was the only bright spot. Hard pass.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YS_clV06FfBpNoWFHCZ_7g"
  },
  "vSwNzu_xZrmXP5JTh0SqJw": {
    "date": "9/21/2014",
    "text": "This was the second stop on the taco tour with Jon and Amy H. I had been waiting (patiently) for this place to open after the closing of Atoyac and was so excited to try the new place. We arrived around 8 and didn't have to wait in line, so I was happy about that. The husband and I split the brisket, bacon, and fish tacos and an order of sopapillas. The tacos here are more expensive than other taco places... to the point that they really need to be great to be worth it (each taco is at least 3$... that can get steep if you want a whole meal).  As we waited for our food, Dan so nicely offered us some chips on the house... very nice. Unfortunately, the food just wasn't very good. The brisket was bland.... I would not order it again and wouldn't suggest others do either. The meat was tender, but nothing special at all. The bacon taco was also nothing awesome.... it was like bacon overload and no other flavors. I didn't love it either. The sopapillas were maybe the biggest disappointment... they were way overly cinnamon -ed and probably would have tasted better if they were just plain. The redeeming thing? The fish taco. This may even be better than the one at Atoyac. It was super delicious, with very light flaky fish and flavorful sauce. I would come back just for that. This place will probably be better after they have some time to work the kinks out, and I will most likely try it again, but the first taste left something to be desired.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "d_TBs6J3twMy9GChqUEXkg"
  },
  "WtHbkHsdhx54WA0G-KjkZg": {
    "date": "11/6/2015",
    "text": "Excellent small but over stuffed tacos and free chips. Great prices. This is a hole in the wall with friendly staff and choice of sauces. I had the carne asada and fish. Both were great. Fish a little spicy. I will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A50HUIuFNH0S0T1o8iL1Gw"
  },
  "2ktorIaQz6Ti3wfaah22SQ": {
    "date": "6/1/2015",
    "text": "I am constantly looking for good street taco options everywhere I go.  I decided to try this place out since I was in the area.  Just average.  Meat portions on the street tacos were very good, but the carne asada steak seemed to be lacking flavor.  The pollo asado had some flavor and wasn't bad, but then again, it wasn't great.  The salsas are as thin as water.  Service  was great though!    I usually like these \"hole-in-the-wall\", iPad-register, mellow-rock/reggae type restaurants, but I won't be coming back to this one.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4p5bT_6WPCXD9qcwxVw7Bw"
  },
  "tDPE4-MdygiU9iB9uYsgzA": {
    "date": "9/26/2014",
    "text": "I wanted to love this place so much. It's around the corner from my place and was super excited to hear of its opening. Went in today right at 5. It was hard to miss all of the employees in the restaurant,  and equally hard to miss how messy the salsa bar and drink station were. Surely one of the employees could wipe the counters?  The best thing I ordered was a side of beans. Beans. My turkey mole taco was ok. But the pastor taco had no flavor. Both tacos needed salt. I'm so sad that the food wasn't better. Not sure if I will try again.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "xCjUvGukJEXkhaIbY3C5lQ"
  },
  "frRqrd8fKuyPpsbvgaDqeA": {
    "date": "10/18/2014",
    "text": "What a nice addition to the neighborhood, located right next to the French Grocery, Mucho Macho is the product of one of the founders of the now-defunct Tacos Atoyac. I stopped in for some takeout and got a carne asada burrito, the chicken quesadilla, chips and salsa, and an horchata. Everything was very fresh and tasty, and at a reasonable price (around $20 total). Will definitely be coming back here, especially for take out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "O8Y1xzL-qoHySb7zfadZ8w"
  },
  "LxoP-cnAzQK7U7IBbLYCWg": {
    "date": "9/26/2014",
    "text": "Bomb fish tacos. But Disappointed overall. The torta and hot dog underperformed. The hot dog is not Sonoran. And I was disappointed that the fine schreiners meat was deep fryed.  And that wasn't a torta. It was a sand which. If you don't know the difference educate yourself. The location is horrible. Small and claustrophobic. The prices seemed a tad high for a taco shack. Maybe it was cause it was so busy. Stick with the tacos. But on the bright side they have orange bang.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "-pI4t7Fur98uXhBfCb-nPQ"
  },
  "whJ5aegShWqsqaqa36o4zA": {
    "date": "9/20/2015",
    "text": "The \"surfer\" fish tortas is my favorite. Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CsZcidAZTvWB5h5vFp5IJA"
  },
  "f_RKIBKlMkfGbLzAPf-5eg": {
    "date": "12/14/2014",
    "text": "I regularly get my dry cleaning done next-door and occasionally stop in at French Grocery for a snack, but I had never gotten around to stopping into Mucho Macho Taco until yesterday when I needed something to turn my day around after a botched attempt at holiday shopping. This was a fantastic choice - I picked up two of the 50/50 tacos to go (carne asada and chorizo, plus queso fresco and pico), and I spent the rest of the day telling anyone who would listen how great they were. The staff is very friendly too, and the service was really quick for my take-out order. Parking at this shopping center can be a little challenging, but I bet you could park pointing towards the street at the shopping center on the other side of Missouri and be fine with a 2-minute walk (most of that would be waiting on the traffic light). I had previously been bemoaning the absence of a certain Texas-based taco chain here in Phoenix, and what I've now realized is that fantastic tacos are already here and waiting on me to discover/enjoy them!  :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fQZSAyOPBjIFed7RscuDFg",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. Takeout order of two 50/50 tacos...they filled this clamshell container with deliciousness! :)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fQZSAyOPBjIFed7RscuDFg/o.jpg"
      },
      {
        "img_id": "Lj2vIe2h_ZLrenoUBX_H3g",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Lj2vIe2h_ZLrenoUBX_H3g/o.jpg"
      }
    ],
    "user_id": "7kDlqgv7gnS2Bo00v5EzeQ"
  },
  "VZ1-pFBvC8qn48wr_W0SGA": {
    "date": "11/24/2017",
    "text": "Excellent tacos, burritos and CustomerService!  We had a great quick lunch for 4 and it surpassed our expectations.   Authentic Mexican street cuisine!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "alWd6fAA0GBbazsYS8yyLQ"
  },
  "0qfUzsfOqfZr_nAClWsRUQ": {
    "date": "11/15/2017",
    "text": "Mucho Macho is the place! One of my favorite places to get away for a quick lunch. Amy is always awesome at the register and the food is always delicious. The crispy fish and veggie tacos are my favorite! Make sure to check it out. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wufdBOVO6o3X3OXisuzjSg"
  },
  "s0iHMUEksqOWjnXeQ8qP1A": {
    "date": "10/19/2014",
    "text": "I'm a big fan of Gourmet Tacos and this place has both a swell selection and some really tasty options. They even have Burritos and many other Mexican favorites.  Been to Dan's older location before it closed and today came in here to check out his new tacos. This is always a great way to try out the fillings and definitely gave me the excuse to go Taco Crazy.  Just order at the counter and get some Frees Chips. They have a cool Salsa Bar with a nice assortment choices. You can even request their Spicy Habanero Salsa that they had stashed away on my last visit.  Ordered the 50/50, the Pastor, Braised Brisket, Crispy Fish and the Grilled Mahi. They were all very delicious and I could have easily eaten several more. Really loved how tender the meats were and how they combined and layered the flavors.  The tacos are pretty small and about a buck a bite. So order several of them to get filled up. Would like to see a tortilla that does not fall apart like mine did. Maybe a little more time on the griddle to crisp it up?  Can't wait to come back and try out some of their other items on the menu. This place is rather small inside and it can get very busy during the lunch rush. Saw several people getting their orders to go and they were happy to dash out in a hurry.  Located right next to the French market with a parking lot that can be a bit of a challenge. Ended up in the north lot by the cleaners and turned my front wheels so they couldn't tow me away. SIMPLEMENTE DELICIOSO!  4.25 STARS",
    "rating": 4,
    "rated": {
      "funny": 11,
      "useful": 14,
      "cool": 14
    },
    "photos": [
      {
        "img_id": "QqYUzJQSwqT1HB70h9xjew",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. The BIG D?",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QqYUzJQSwqT1HB70h9xjew/o.jpg"
      },
      {
        "img_id": "G2DtjXLKhuffeGttQKgwMw",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. Crispy Fish, Grilled Mahi and a Brisket Taco.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/G2DtjXLKhuffeGttQKgwMw/o.jpg"
      },
      {
        "img_id": "ztLI9L407Iin5oJXsoenZA",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. 50/50 and a Pastor Taco.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ztLI9L407Iin5oJXsoenZA/o.jpg"
      }
    ],
    "user_id": "oUst55rUuv2nKEQ0FgJ5GQ"
  },
  "-WeFaD9-rcRRQtMpOqBXxA": {
    "date": "10/6/2014",
    "text": "Mucho Macho Taco is a small fast casual Taco Shop. You place your order at the counter and they run your food to you. You come here for tacos as I didn't notice them offer side dishes of rice or beans. The ceiling is decorated with bags hanging like flags with interesting graphics. Some of the bags are from Beans but many are from Medical Marijuana. ????  We shared a variety of tacos and ALL OF THEM WERE ABSOLUTELY DELICIOUS! But the day I was here they had a really bad batch of tortillas. I was only here once and I don't know if their tacos always fall apart or not. All five tacos that we tried ALL FELL APART and we had to eat them with forks.  The Grilled Maui Maui Taco had a delicious wood fired taste to it. It was so good they should turn it into some kind of dinner platter. The fried fish taco was tasty and the brisket was prepared well and had supreme orange segments in it that was interesting and different. The chicken had a similar fired taste like the grilled Maui Maui. My husband liked the 50/50 best.  Pricing is very reasonable I think you can get three delicious tacos for around ten dollars and bottles of water are only one dollar. Parking might be difficult because this is a small stripmall with only so many parking spots.  Great tasting Tacos but I have reservations about the soggy falling apart tortillas I received so I don't feel they are worthy of four stars to me. I think someone on Medical Marijuana made the tortillas.",
    "rating": 3,
    "rated": {
      "funny": 6,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "UJg4Q_F-Ynbfy5Ek1nk48Q",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. Soggy falling apart tortilla",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UJg4Q_F-Ynbfy5Ek1nk48Q/o.jpg"
      },
      {
        "img_id": "Zl-NOGtKkJGrF8cAhRxZ7Q",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. Grilled Maui Maui, Fried Fish, and Brisket",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Zl-NOGtKkJGrF8cAhRxZ7Q/o.jpg"
      },
      {
        "img_id": "79w44wfSSbNK0bW_jdjQ-A",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. Chicken Asada Taco and 50/50 Taco",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/79w44wfSSbNK0bW_jdjQ-A/o.jpg"
      }
    ],
    "user_id": "V-BbqKqO8anwplGRx9Q5aQ"
  },
  "2CDdtiRvKrK7rGQSkZ9rTA": {
    "date": "6/20/2015",
    "text": "I go here as a splurge for lunch, when I work in downtown. It's totally worth it! Fresh, locally sourced, and quality. This hole-in-the-wall used to be the Two Hippies Pizza shop, then it was something else, then it turned into Macho Taco. The parking lot is small, so be prepared to circle the neighborhood if they are busy.   Awesome customer service & super quick.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9olcaB4ZoYLSxZJD2_Tskw",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. Skirt Steak Burrito- so good!!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9olcaB4ZoYLSxZJD2_Tskw/o.jpg"
      }
    ],
    "user_id": "3ksIE0ySpHJxvgDz0_K_Zg"
  },
  "OhK4zEqz1C4tFDxXOqpTbQ": {
    "date": "9/19/2014",
    "text": "My husband and I found Tacos Atoyac and were big fans. A big part of it was Dan. He remembered us, and he makes the meal and experience. When he left Tacos Atoyac, it wasn't the same for us. Then we heard about Mucho Macho Taco.   Walking in, Dan remembered us right off the bat. The food was amazing, and just like the name suggests, it's mucho macho! They did not skimp on the meat, using good quality meats packed with amazing spices.   My husband got the carne asada burritos, and bacon taco (yes, BACON!), while I had the roasted turkey mole taco, braised brisket taco, and 50/50 taco. They were amazing, filled with huge chunks of meat! The horchatas were sweet and refreshing.   This place is much closer to our house, and we can ride our bikes to it! Apparently, if we ride our bikes we get a free drink! We will definitely be back to devour more of these amazing mucho macho tacos!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "REhA8p7aKwarYDzPGkn3tw",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. Roasted turkey mole taco and braised brisket taco. So good!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/REhA8p7aKwarYDzPGkn3tw/o.jpg"
      },
      {
        "img_id": "6O_q-HFelmTSD9Cq6VO1mg",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. 50/50 taco. Chorizo and crane asada with fresh pico.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6O_q-HFelmTSD9Cq6VO1mg/o.jpg"
      }
    ],
    "user_id": "3QIzMPabH1tMzvsibx4q3g"
  },
  "0PJyXhD1JA4_psBMWUz7tA": {
    "date": "9/25/2014",
    "text": "My three tacos were solid!  After reading all the great reviews, I decided to stop by here after work the other night with the intention of getting tacos for that night's supper and a burrito to reheat for lunch the following day. In theory, it was a great decision.  Each of the three tacos I'd selected were awesome. I started with the crispy fish because I wanted to end my meal with the absolute best. Well, I could have eaten three of those fish tacos and been a very happy guy. The fish and shredded toppings worked perfectly together. Next up was the bacon taco. Yes, ladies and gents, they have a taco stuffed with BACON. I'll admit, after I heard they sold bacon tacos this place shot up to #1 on my must-try places. And it didn't disappoint. Simple, yet elegant, with just the right proportion of bacon to tortilla. We shared a sublime moment, that taco and I. But I must admit, the turkey mole taco took the other two tacos down like a kick between the legs. Figuratively. Combining crispy roasted turkey, bacon and pecans with their sweet mole was insanely delightful! It put the other two to shame, sort of. It was that good. So: Dinner was a smash!  The following day, I heated up the bean and cheese burrito in the toaster oven at work. While it was a good B&C burrito, I think I'll have to eat one fresh to truly know if it's really good or not. But it filled my belly, and I'll be returning to MMT when my next Mexican craving hits. Which should be soon. And I'll know that this food is meant to be eaten fresh, like all the ingredients already are.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "pKn_H1nkgrwJS6TuHODsvQ"
  },
  "orSLAcdWxUKbMOSLA18pEQ": {
    "date": "10/13/2014",
    "text": "This place sucks. The tacos were too good. The staff were too friendly. The salsas were too fresh.   Try the brisket. The baja was on point so was the 50/50.   Cause tacos that's why.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "p4gBLZCS8IemWUzB9nY8RQ",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. Sopapillas!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/p4gBLZCS8IemWUzB9nY8RQ/o.jpg"
      }
    ],
    "user_id": "WZvH5_cOcfXKrt81agtdFg"
  },
  "Y9OMZRfHY1e4XliZUZ5Dfg": {
    "date": "12/31/2014",
    "text": "Taco are the new fad of Cen Pho, I can name a burrito full of new tacos places with out thinking too hard. The same is True with Macho Mach taco as the rest. Two tacos are a bit small for a meal but at roughly $3 each a third would make it a bit pricey.  Out meal included a few chips however I do not think this was standard, if it were and unlimited it may make up for the lack smaller main course.  The Fish burrito was decent a bit heavy on the cheese, despite other great reviews of the burrito it was nothing special.   The grilled veggie burrito is one truly unique item here as it even has humus in it.    I did appreciate the salsa bar however more chips to enjoy it with were lacking.  Overall decent place but don't go out of your way to get here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gScmsSCqBeFPp6q9yG5nmw"
  },
  "7Ct0MnHwJR5U_rXZ9ABYcg": {
    "date": "6/6/2017",
    "text": "I could eat their crispy fish tacos hands down anytime. I usually just go here for those. Sometimes I'll get Joe's crispy, which are delicious but occasionally very salt (it's hit or miss). Fish tacos are all I need though. I also like the feel and the people.   I hope they update their hours of operation sign out front. You might want to call and check if they are open first.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RKjNz9W0XVcZ_PMJQC2Trg"
  },
  "ZC1aEPBKzvZQ6gNJD5ICiA": {
    "date": "5/5/2018",
    "text": "This place is awesome. People who work here are really friendly, and the tacos are amaaaaaazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P6K-B0xL7WTTLyhcDdIK5w"
  },
  "GdEk54-HDqAuuOqGmotKWw": {
    "date": "4/5/2017",
    "text": "The mahi tacos are extraordinary! And if you eat in you get free chips and salsas.  The help is friendly and helpful.  All in all, a terrific lunch!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "i-Cw0DBaiHUvGWMrVimsJw"
  },
  "dWTL71eTD5kJkzdmxwb0iQ": {
    "date": "3/9/2016",
    "text": "This is one of my favorite taco shops.  The food is delicious and it's a very comfortable environment.  The inside is clean but usually quiet, so it's easy to get some tasty food and sit back to enjoy.  And that food is delicious!  The gourmet tacos are all wonderful.  I also really like the burrito with the tater tots inside.  They add a nice, salty crunch to the mix.  It's also a great place to bring my toddler -- they have a great kids meal option.  I keep coming back because the staff is friendly, the food comes out quick and is delicious, and the prices are competitive.  It's a great place to go for a quick meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hcGy2iaB6MeklE-F0oNKtg"
  },
  "ijlNEJHp8lFj2plkKrmNDA": {
    "date": "10/14/2017",
    "text": "VERY VERY good.. we had carne asada tacos and Leguna very tasty .. 5 tacos and FREE chips and salsa. $17.00 Great lunch spot! Will be back. That hot smoky salsa is the BOMB!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qTNSkHXBkYOYzuzT3wYGQg"
  },
  "wjlKp_bsShYjFxY4ji551w": {
    "date": "4/8/2017",
    "text": "Searching for best crispy tacos in Phoenix, we found them. Really great food, very friendly staff. Can't wait to eat there again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CjbhxSHTOF-i-n1gIiySpg"
  },
  "-rrmZAwAKclykOSLrClC_Q": {
    "date": "12/16/2017",
    "text": "The inconsistencies from the reviews made me curious. I decided to give them a try. Came in by myself to order at 8pm (they close at 9pm) and the 2 employees glared at me as if I just ruined their night. It had looked like they weren't expecting anyone for the rest of the night and already had everything cleaned and put away. I asked for a chimichanga and the cook mutters something to the cashier. She asks him for clarification and he says he can try to make it but it probably won't hold together. Cashier looks to me and says he's new and doesn't know how to make one properly and gives me a phony \"sorry\". At this point I just want to yell at the guy for not telling me himself since he was only 3 feet behind the cashier in the empty setting. He was obviously an entitled lazy employee and the cashier had a disgusting tone. I maintained composure and politely just ordered a simple carne asada burrito. Burrito was ready at a reasonable time but it was one of the most pathetic burritos I've had in a long time. Maybe it was just a shift with bad employees but I'm not willing to give them another shot. With mediocre places I just decide not to come back but this place is an exception. Just terrible people working there.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bW8ELw0MfFbYT0vwDwGjWg"
  },
  "4AaoC-Ko5GTj4XW97gCx9g": {
    "date": "9/20/2014",
    "text": "Love Dan & his tacos. So happy to see him Again after closing Atoyac. Two words. Fish taco. Ahhh delicious and filling! Just opened up 5 days ago but he should be steadily busy with his following. They are open 7 days a week till 9 PM. Go support a great spot.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OPcTCwEQOS7CB1_mHIDfVg",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. Variety of tacos",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OPcTCwEQOS7CB1_mHIDfVg/o.jpg"
      }
    ],
    "user_id": "771OWzbzelsEeSlx8QsfsQ"
  },
  "kHoJcDGFhvML_4ueOlqukg": {
    "date": "7/8/2017",
    "text": "I love this place....when they try.  Occasionally, we will get a meal that was phoned in.  Sometimes it is obvious that the cook throws the food together.  We've had chicken burrito where we couldn't find any chicken and the order got all mixed up.  This kind of stuff happens every once in a while.  Otherwise, this is one of the best taco shops in the valley. The 50/50 burrito is my favorite.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iUu4J5hCSZn2C4_UYa2HNg"
  },
  "GCLyAaBxlKwbfGgf-txBZQ": {
    "date": "3/5/2018",
    "text": "Stopped by this basic looking little place during a busy time after Melrose Street Festival.  The staff were so energetic, friendly, courteous, and polite--it was like a breath of fresh air.  Bravo to whomever does the hiring and training.  Thanks to the staff for enjoying your jobs.  My burrito was awesome, great value for the money.  I even took about half home.  Strongly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b4a9xvX1LtwcZx6a5SiFVw"
  },
  "79ZJxx3AzXMxCfQ8_m5oUQ": {
    "date": "6/25/2016",
    "text": "Amazing food! The tacos were the best street tacos I have ever had! I had the carne asada, shrimp and crispy fish tacos! The cashier was very friendly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "F2h2YsaLPUfPvsnFYHmkbA",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. Carne, shrimp and crispy fish tacos",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/F2h2YsaLPUfPvsnFYHmkbA/o.jpg"
      }
    ],
    "user_id": "JwHGAta7sEXXeyBnhqjvBQ"
  },
  "cTA94aXEZ6GlS6oD0VMh7A": {
    "date": "11/1/2018",
    "text": "First time I went here I had 2 fish tacos, 2 braised beef tacos and horchata with pecans. My mini me had a bean burrito with tater tots. Loved our food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A9sPshItBDSTK6kmpA-CSg"
  },
  "kXl4hBD0CSJiqJkr7BOv9Q": {
    "date": "8/6/2016",
    "text": "I only ever order 2 things. Fish tacos and carne asada tater tots. I've tried other tacos, the fish tacos are still the best.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7j-CRT0QYjTl_mHzLL_udQ"
  },
  "8dfVvDWdu1pNHfwcpr7IhQ": {
    "date": "3/23/2016",
    "text": "BOMB!  We stop at Mucho Macho Taco everytime we get into Phoenix.  Great little spot we stumbled on last year while roaming 7th Ave.  Braised brisket...way to go.  Tacos, burritos, and loaded tots.  Phenomenal.  See you next time we're in town!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tOeh_NY1Af9LFyPp-wtHmg",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. Tots loaded with chorizo!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tOeh_NY1Af9LFyPp-wtHmg/o.jpg"
      }
    ],
    "user_id": "hSUgs37OCwU0QZVVjSB0gw"
  },
  "02OCxyC9JP-9vxKqvFzaAQ": {
    "date": "4/30/2018",
    "text": "Best shrimp burrito I've ever had!!! Third time I've been here and the service is always great and it's always clean. If you're lookin for a great lunch or dinner spot, I highly recommend!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GWkpGHdUtXo5H7qLsts-xg"
  },
  "Ou0G6LVo1d34V0H5Ffy_gQ": {
    "date": "4/5/2018",
    "text": "I was on my way to boring old Subway when I saw this place on the corner next to a French grocery. I decided to give it a try. Walking in, the place is very clean and modern. Punk rock music playing but not loud and obtrusive. The guy at the counter recommended the carne asada burrito if I was really hungry. He gave me chips while I waited and the salsas were fresh and delicious. The burrito came out really fast and was incredible. Definitely check this place out. If you have driven by and wondered if you should eat there then wonder no more. Great food, great prices, clean restaurant, friendly and helpful staff. A+",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rxVZ5FNiGw8MKjU38LR5OQ"
  },
  "OKNgOEnbv6USGV1Hm7snZQ": {
    "date": "1/24/2016",
    "text": "I'm a big fan of the fish tacos, and the owner/chef of Mucho Macho Taco. I used to live on 19th and Glendale and frequent Tacos Atoyac, which was the original restaurant he owned before expanding to Mucho Macho Taco. What you need to know is that if you're going to eat here, you MUST ORDER the FISH TACOS. Otherwise, you will walk away not knowing the full potential of the owner and restaurant. There's something captivating about the orange sauce, breaded fish, and taco flavors all in one that has made my boyfriend and I regulars over the years. I've tried every other type of taco on their menu, and the fish ones are definitely the best by far. Other bonus, BYOB is allowed, and we walked over to the French grocery next door to bring in a six pack. Fish tacos + BYOB = a yummy Taco Tuesday indeed!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "xx8Yovu1MFWKClgh1yXimQ",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. BYOB, fish tacos, and carne asada tacos on deck for Taco Tuesday!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xx8Yovu1MFWKClgh1yXimQ/o.jpg"
      }
    ],
    "user_id": "4ECIXWllFTxtJaj1cKOZWw"
  },
  "68KYV29Qd27oA_IxC-A5jQ": {
    "date": "6/18/2016",
    "text": "I will start out with there tacos are AMAZING. Absolutely on point. The gentleman behind the counter taking orders was polite.   Then...dun...dun...dun...I have quite the interesting thing happen- as I'm eating I come across toothpicks in my taco. (See picture). I was chewing and spit one of them out. Thought ok that is unfortunate; but along came two more. I'm curious if this is regular practice for the tacos I ordered? (Which was found in Joe's crispy). The paster and Carne asada was unharmed.   Overall solid 4. Would have rated it a 5 without the incident happening. I give it a 4.5/5.  Cheers!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TIzg8sv4JwMulKP-F7YGug",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. Toothpicks found in Joe&amp;#39;s Crispy tacos.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TIzg8sv4JwMulKP-F7YGug/o.jpg"
      }
    ],
    "user_id": "BeMrTqigcLyK6LnVj5pugw"
  },
  "cN_j8919J3RoJbu4jHxfHQ": {
    "date": "2/3/2018",
    "text": "Great tacos! Atmosphere is relaxed. Employees are fantastic and helpful. The green sauce at the serve yourself salsa bar is amazing!! I want to drink it. Try one of the bowls or ask about the specials.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8fNq6lSW-yEDm4LHQWRcEA"
  },
  "MBrzgxGrgbgeb5U4B8CqBw": {
    "date": "5/25/2017",
    "text": "The food is great - when they actually have it in stock and get the order right.    They've not had lengua, ever, and they've given us tacos instead of burritos on two occasions.    Carne asada and veggie options are delish.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9aNUNnCiSi5-Eox5YlGpWQ"
  },
  "9WDZiJxu62yn4tPIiOsM7A": {
    "date": "3/6/2017",
    "text": "Burrito so fat makes your jaw cramp up just trying take a bite. Overall food was good, nice little joint, great music you can vibe to, great customer service. Only one problem. The salsa is subpar so I had to a hard time getting through the breakfast burrito but the burrito was still good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oQOWgZBWtPE4nIxg1dSy7w"
  },
  "KTs6bNs_zvLGSoMeoh_G9w": {
    "date": "1/28/2017",
    "text": "So good! The fish burrito is my favorite. Tortas and all other food are quite tasty. Salsa is hot. Horchata is refreshing. A couple Of times the carne asada has been a little rubbery but I don't order that much. So glad we have a local and affordable place like this in my hood!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "J2TsIYthmYvzcmri0w0ytg"
  },
  "3Jgyg31whuoJ6w3JawGneA": {
    "date": "1/13/2018",
    "text": "Last time I had chorizo this crisp and fresh was when I was living in Mexico. Haven't yet found an establishment that comes close to their chorizo!!! Their tortas and burritos are also excellent! I definitely recommend their shrimp burrito if you're feeling like a salad but still want the satisfaction of not getting hungry in the next hour. Their eggs and chorizo breakfast burrito also hits the spot, even if it's past noon",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cYOHJYf6aq62ulLzGl-vcg"
  },
  "nk6kAqRj5eCCvRUkfYWyiA": {
    "date": "8/17/2016",
    "text": "I really like this place.   The attitude is positive and playful, the food is good (had fish tacos) and decently priced, and everything was very clean.   The atmosphere may be a little dark for some, but the cool artwork and unique decorations are enough to make it worth a visit!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "d3yKEKy8RcDm_iNvbo6D0A",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/d3yKEKy8RcDm_iNvbo6D0A/o.jpg"
      }
    ],
    "user_id": "1Dlifyv45859A05f9vtAzg"
  },
  "jf-7Rlh4ZbDOmbcBnOZIgg": {
    "date": "8/29/2015",
    "text": "I'm excited to say that I have finally made it to MMT.  After all these years hearing Yelpers discuss the original Taco shop and then the 2 that followed after Tacos Atoyac closed.  I was excited when I was driving past looking for a place to eat in CenPHo.  I'm not sure what's all the hype?  I tried 4 of the tacos.  Of the 4, considering my affinity for bacon, I figured I would love the bacon taco the most.  I mean... what can't be good about a bacon taco?  Well... if you overcook the bacon, that could ruin it.  Unfortunately, the bacon taco was a no-go for me.  the other tacos were not even memorable.  I was sad that I didn't leave this place with the same warm fuzzy feeling of my Yelp buddies.  I may go back and give them another shot, but it will be awhile.  This place is worth a try. There are plenty of Taco Shops to check out around town that I have not been to yet.",
    "rating": 3,
    "rated": {
      "funny": 10,
      "useful": 9,
      "cool": 7
    },
    "photos": [],
    "user_id": "DHQWSHz6b7Jsy-A04m1cIA"
  },
  "2QsUEht8M9vFkJc8JfDvGw": {
    "date": "12/11/2016",
    "text": "This was a surprising and delightful find...and I'm lucky that it's so close to home.  They have a nice little salsa bar with some interesting house-made selections. I recommend trying all of them.  The night I stopped in, they had a Cuban pork taco that the server recommended.  I also had a chicken taco.  Both were great.  Well-seasoned and topped with just the right amount of stuff.    My dining companion ordered a shredded beef, carne asada and chicken taco trio and all three were really terrific, he said.    I was looking for a nice, nearby taco shop but calling it a taco shop is a disservice as they offer burritos, tortas and more.  It's small and cozy so there may be a wait on a busy night, but your tastebuds will thank you for waiting.    On a return trip, I discovered something I'd overlooked.  Bacon taco. Mind blown.  Wow.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FX7BjzTJAuCAul1eXyRWqw"
  },
  "U25BL3njHTR5IDVt_sYhNA": {
    "date": "8/9/2015",
    "text": "Mucho Macho Sucko.   This trendy taco shop doesn't try too hard to feel authentic, nor does it insult your intelligence by pretending to be trendy and upscale while charging 2x what anyone with a triple-digit IQ would pay for a taco. It's got a real stoner, SoCal vibe to it, as though it were partially modeled after Wahoo's.   I will be straightforward and join the other 20 or so negative reviews that indicate this place has a major seasoning issue. For real, the carne asada here is some of the most flavorless I've had anywhere, ever. I decided on the \"macho burrito\", what I assume to be their signature item. It had asada, tater tots, green chili, and...mayonnaise. Texture was definitely interesting, but literally the only source of flavor was the chili, which was severely lacking. Let's save the mayo for seafood tacos next time. :-/   As for the shrimp tacos, they were well-dressed with some refreshing toppings, but the shrimp tasted as though there was zero effort put into them. Like...you could at least cook this with some pepper, please.   On the bright side, the horchata was great! 5/5, would drink again.   What troubles me most is how the owner has such a cult following. Despite jeopardizing one of the most critically acclaimed lunch spots on Yelp, absolutely failing to fill the shoes of Gallo Blanco and, when left to his own devices, squanders his alleged talent on tired themes suited for tourist beaches, he is somehow the most well-known purveyor of Mexican food in Phoenix.  It's not fair.   That being said, I won't totally disregard returning to this place, as they've got some unique items. Ideally, I'd love to have flavorful Mexican and American favorites in the same place. Unfortunately, Mucho Macho messed up some of the fundamentals, and I'm not so sure it should have come as a surprise.",
    "rating": 2,
    "rated": {
      "funny": 12,
      "useful": 14,
      "cool": 9
    },
    "photos": [],
    "user_id": "YpGt3hdq5adPlEFn9fQ2Zw"
  },
  "ehy3nimbWaxVBJ03LJ_X2g": {
    "date": "9/28/2015",
    "text": "Well. This place. So good!! I'm used to going over to the taco stand at Charlie's but this place has stole my business. The avocado sauce is heaven the carne Assad is perfect and the tots. Oh the tots!!!  All the kids who are under two LOVED it!! See pics!  I WILLLL BE BACK",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "y1_4yqqip3nI1LM6mH8aSQ",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. Kid approved",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/y1_4yqqip3nI1LM6mH8aSQ/o.jpg"
      }
    ],
    "user_id": "r-zv27LD22VZhROrvXWrUw"
  },
  "-a2oQZ3omKkMQe-jUNU3wQ": {
    "date": "12/3/2017",
    "text": "Super salty overly seasoned meat! Taste like a salt spill accident. The tortilla tasted like rubber although it was my first time there and i had tried three different burritos i dont think i will be going back i might opt for the other two competing Mexican restaurants across the street if i want something a little bit more authentic. Even for cuisine Mexican food this place just had terrible tasting food overall.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vXAzxDbAFvTi0oBDhevklw"
  },
  "iETye2xbAO3tsPo_ezBsNg": {
    "date": "9/11/2017",
    "text": "The crispy fish burro is always a solid choice. Joe's crispy tacos are tasty but they are generally sold out by dinner time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "li1rAQPPq-PiKc9dx8epuQ"
  },
  "MRiLd84kMB80bCVWAUHJfw": {
    "date": "6/24/2016",
    "text": "I wanted to give it a chance. Yelp told me it was great. Yelp steered me wrong. Oh so wrong. Have you people no taste buds? No dignity? No shame?  Let's start with the sour-faced cashier who evidently has never eaten Mexican food. I asked her if the chicken taco was like pollo asado, and she said \"um, yeah.\" Evidently she lives in a world where pollo asado means shredded, stewed chicken. ...Huh?  We got a total of five different kinds of tacos, and before we tried each one, we thought \"this has got to be better than the last one\". Nope. Several of the tacos weren't even hot. Overall, this place was one of the worst restaurant experiences I've had in recent memory.  Did I mention one of the salsas at the salsa bar seemed, uh, shall we say... \"carbonated\"? Yes, that means it was going bad. Not that it was that good to begin with.   The chips were edible and seasoned. That's the one positive thing I can say.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "qfAYSKmynkcO0TOcbT0jgA"
  },
  "7i3W_uS9-0ormTdcb9mn9g": {
    "date": "8/19/2015",
    "text": "yes its a little on the expensive side but you pay for what you get  and its really good quality  great flavours nice place  will go again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xPDvlTBKfXMmA__Dh82WmQ"
  },
  "NLYnVsQlQPAyhqLJhUJRZw": {
    "date": "11/10/2014",
    "text": "great concept, location, cool dudes, solid cuisine. only regret was seemingly high salt content, but I will return nonetheless!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yJH888Py0bBYY1K9Kuq5Eg"
  },
  "2dTNN-utkta15quYR1Zl2g": {
    "date": "7/19/2015",
    "text": "The green chili pork burro was great! The pollo taco was so so. Free chips with your order and very friendly staff.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-zrmj04P3qn5w5vZ4HSz3g"
  },
  "3sqX1jdAVI2CXFZ_5IkY_g": {
    "date": "4/21/2015",
    "text": "I tried 4 different tacos. This place is way over priced for street tacos at 2.95 per taco. I had 4 tacos and a drink and it was over $15. For a place that is supposed to this good there sure wasn't much of a crowd except for the group of 10 that I was with. The Mahi Mahi as of this moment is making me sick, not sure what kind of fish it was. I will not go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BekIYetL3sO4Ons-Tfs0wQ"
  },
  "dWMc6vLSHO-6at4KDr1kig": {
    "date": "11/30/2014",
    "text": "I've driven by this place quite a few times while on 7th ave and decided to give it a try today after my hike. I ordered the 'Surfer' torta and my friend had the steak and shrimp tacos. I have to say that everything was delicious.  The torta was definitely tasty. And the service was just as good. I've found a new taco spot and I'll definitely be hitting it up again soon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y73okETkcnwWpg5CoUq5gA"
  },
  "q7YsrPtiJZa56RQwQjnAEA": {
    "date": "11/7/2014",
    "text": "A friend of mine turned me on to Tacos Atoyac...and one day we forgot it was closed on Mondays, so we went here to the Tacos Atoyac Alumni joint...its every bit as good if not better.  If you want a fish taco like no other...this would be the place to go.  Not kidding.  This is a small place.  Mucho Macho tacos uses the freshest ingredients skillfully and delivers big flavors.  Check out the special salsa in the refrigerator below the salsa bar...totally worth it.  Its almost like the secret stash.  Don't miss this place but get there early, its an old, Circle K location that features 3 tenants and it isn't 'long' on parking spaces.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I-K_S3dRxoOabk7bUgcsEg"
  },
  "MKExlwYstcW6iN1RpkIUMw": {
    "date": "9/21/2014",
    "text": "Went there last night.  Had been to Tacos Atoyac and were thrilled Dan was opening a restaurant near our house. My husband and I took our young adult son and his friend. We ordered tacos (carne asada, brisket, and bacon) and three burritos.  Everything was excellent.   The chips and salsa was delicious. The girl at the cash register was extremely pleasant and helpful.  A great experience and we'll definitely be back soon! Support a  neighborhood location!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bB0a8RXRScRJxWkW-_knZA"
  },
  "PptdAUz4hfh1cOxQ70X6Sg": {
    "date": "9/19/2014",
    "text": "Had the Brisket, Crispy Fish, and Bacon Tacos....ALL GOOD!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pJCdSt6unhBpCkNm3ZhfbQ"
  },
  "1KU4jd2Nn8db559KxBciOg": {
    "date": "4/23/2019",
    "text": "Every time I eat here they never disappoint! From the fish torta to that tacos and the burros! Best horchata around hands down! Lengua is amazing and the el pastor! Don't sleep on this place!!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vPvlg7PKry8ISMDrwprtXQ"
  },
  "T1na_8B6EtzmJjGVWgU7xg": {
    "date": "3/25/2019",
    "text": "Long time customers, in our opinion these are the best fish tacos in the Valley. Prices are very reasonable and their salsa is great.   That being said, my family (2 young children) have been witness to three or four openly hostile arguments involving the owner, the heavily tattooed employee, and two younger employees over the last year. I find this behavior in front of paying customers to be highly inappropriate and will cause me to think again before coming back. Also, employees should not be cussing openly in front of customers, especially children.  REVISION: The owner politely responded that the problem was corrected.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nA_3L99urFK8fuA3tjfj0Q"
  },
  "YxwcAeERaP2nb5S81whJvQ": {
    "date": "8/20/2019",
    "text": "Let me start by saying I was SUPPPPPER excited about finally getting their tacos. But to my surprise I was beyond unsatisfied with the quality of the food the beef tasted like what I would believe dog food to taste like. HORRIBLE",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7nnZ8fgRMdINcR18gxV46Q"
  },
  "8hLTZc2ghJ8swCvx7C6uiw": {
    "date": "10/17/2018",
    "text": "The place has a really cool vibe and the woman who took my order was really nice. I ordered the carne asada and shrimp tacos. They were good. Not the best tacos I ever had...I think they're just missing that little bit of \"oomph\" that I look for in food. The shrimp taco was better than the carne, which has really good flavor. I'd prefer the meat seared more and have a slight crust on it. Those are just my own personal preferences though.   I'll most likely go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oN5PPA70MS0Iol-dqjVgOA",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oN5PPA70MS0Iol-dqjVgOA/o.jpg"
      }
    ],
    "user_id": "PugcLBECym5uaoK-n549Lw"
  },
  "UcJhrepizMk0H9UPelni3w": {
    "date": "3/12/2019",
    "text": "I was so excited to try this place and all I can say is wow. Wow as in the most awful tacos I have LITERALLY ever had. The carne asada honestly looks and tastes like dog food. The corn tortillas were so hard and stale I had to yank them from my teeth in order the take a bite. Not kidding! The chips they serve look and taste like chips you would buy in a grocery store. The rice they serve looks and tastes like microwaveable rice that comes in those packets. I cannot fathom how anyone would come here. Save your time and money! This place gives Arizona Mexican food a bad name!   PS also don't bring your children here. Tonight they were playing rock music with profanity with F bombs.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_v0FNPAytigcCjBMA6JOIQ"
  },
  "vWrGAvOgkoIp5JWXL0It5w": {
    "date": "4/13/2019",
    "text": "This is my favorite taco spot to stop on my way home from work. They have such a variety and everything is made from scratch. Everyone is friendly also. Whether you want to eat in or take out, I highly recommend this neighborhood gem!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NNNK8yXNSSLktqKjTax9jQ"
  },
  "deBh0FWSaz2Qej0O5QxSBA": {
    "date": "7/20/2018",
    "text": "Not the worst but not good, either. The place was hot and super humid inside and the tacos (carne and fish) were nothing to write home about. Someone mentioned shrimp in another review so I may try that sometime. Or I'll more likely just go up the street to Otro where  everything is damn delicious and they use their air conditioning. Yep I like that plan better.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "9mISZLpu049t8lcOdjBANw"
  },
  "EdxLegouWrqRQ5ogOSfHxA": {
    "date": "12/29/2018",
    "text": "Love this place! Food is great and the guys who run it are super sweet! Highly recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7xEweVcHQfniZzuYEWKSTg"
  },
  "aeToJsLRXNf3l-bQ2R7paw": {
    "date": "4/9/2019",
    "text": "I went to mucho macho taco today knowing already what I was going to order: a carne Asada burrito with beans. What I didn't know, was that this wasn't a typical fast food Mexican restaurant. This place was very clean ( tables, floors, kitchen, everything!) I quickly placed my order and also bought a large cup of horchata. I'm going to break these items down one at a time. The burrito had excellent flavor. The tortilla was soft and thin. The way they should be on a burrito.  And the horchata was home made. Perfect sweetness. The viscosity was right on. I don't often write reviews, but this place deserved one. FIVE STARS*****",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wQji5EBeXHko7nRbEDmXXg"
  },
  "iVxeBRpsmE-PHFR4jLq5Yw": {
    "date": "1/2/2019",
    "text": "The tacos is what got me here but the Macho Burro kept me coming back every time! Amazing meat with a ton of flavor. You won't go wrong with anything you order. Best part is the salsa on hand. One is a nice mild red salsa but then there is an incredibly spicy salsa that is phenomenal. It's honestly so spicy, I mix the two together some days. I just wish they could be open earlier so I could come in for that breakfast burrito.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0PRcXdM6hwnCL_2YeeyAbA"
  },
  "Zi7RsFsNsrI8axj4K-BvKw": {
    "date": "9/9/2017",
    "text": "I thought mucho macho taco was mucho good not great. I ordered the Saturday special (chicken burrito with red sauce). The lady behind the counter with blue hair was very helpful and helped me choose. The burrito was decent size, not gigantic. The red sauce was pretty good. There are a ton of great Mexican restaurants in Phx. I'd come back to this one.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "A9wKMDel7KQIv3JbQkwTpQ",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. Mucho macho",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/A9wKMDel7KQIv3JbQkwTpQ/o.jpg"
      }
    ],
    "user_id": "ssY5madTrd_ZAiV8av9kug"
  },
  "UztyQZxvAzwj4fQdqMl1Og": {
    "date": "3/1/2017",
    "text": "Another example of a great taco shop for a great price especially for the area I had to lengua and a carne asada tacos both are great the lingua was actually really good hi when the best I've had in awhile but like their salsa not a whole lot different ones but the two I tried were excellent very friendly people but most importantly they have delicious churros which I love will be back very soon try some other things",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GfFK0_dfU0xS2UPspJqJtg",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GfFK0_dfU0xS2UPspJqJtg/o.jpg"
      }
    ],
    "user_id": "kbfpED-6FURIsNlsAXqc2g"
  },
  "9Mf6X4qABcQijCXf_xxeTA": {
    "date": "9/28/2018",
    "text": "Braised beef is delicious. Unfortunately they are always out (literally, last 3 times I've been there). I don't even waste my gas anymore.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XPIXQ2QdZcGo_Fql72SFcQ"
  },
  "JtLztFspemN0WohCrdVdRA": {
    "date": "3/22/2019",
    "text": "Not really sure what was in my taco?  Was that supposed to be carne asada?  The only reason I gave two stars is because the fish taco was edible. That was the only decent taco out of five different flavors. I would not recommend this place. Sorry guys.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1c61nzahhhj0cXDPHxrqXg"
  },
  "YmMG9XmYE7cpvyab98sLCg": {
    "date": "10/2/2018",
    "text": "The quality is going downhill. I stopped today for lunch.  I was worried I would chip a tooth on the rice. Dried out. Obviously not fresh, I would bet it was made a day or two days before and reheated.   Also the fish on my tacos didn't seem freshly fried. I used to love the food here, but today is was pretty bad. It will be a while before I think about eating here again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HnZ9SrrAMsq43A6N6UTXbw"
  },
  "ACRDIST0j7ZR11WpD1kcbw": {
    "date": "11/16/2017",
    "text": "I can't eat here anymore because no flour tortillas.  Dan!! Help me out.   It's some of the best tacos in town a  Edit:  owner reached out and we are back to Happy flour Tacos.  Thanks for looking in to this.   I have been craving fish tacos.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Vw41rZ96QMwxqOEh1tQhg"
  },
  "3XMRMPGDia5Ag5WOAX5fFw": {
    "date": "8/5/2018",
    "text": "I flipping love this tiny place. Try the braised beef burrito with tator tots. I'm a tortilla snob and they have AMAZING tortillas and all three salsas are fresh and great tasting.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "beq-C03VuWmcTWY6L1vi1g"
  },
  "9ic9KVK7NwRrKE6TngLA6g": {
    "date": "8/30/2018",
    "text": "Absolutely some of the best Tacos in Phoenix! The green Chile pork tacos were flavorful and juicy. Chile pork cheese quesadilla was equally great. The homemade Horchata was delicious and the added pecans in the drink were a nice touch! A must visit!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "L8iww8YMVAKFrpZOAkPBgg"
  },
  "Qvd28pARmtwO9e1Urt0auQ": {
    "date": "7/14/2016",
    "text": "So lett me start by saying I love this place I come here all the time.  Today I forgot my card but had a roll of quarters. I told him this and apologize in advance. They told me to save my change that this meal was on them. The owner and his employees are genuinely kind people. Always make you feel at home with their upbeat and positive vibes.   You have to try the fish/torta can you say                       AMAZING seriously it's mouth watering!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "nGUlH7_UjQ0hPnQvfuXLrw",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. Their special the green pork chili taco with a side of being and their green peppers  and sauteed onions.   Soooooo good !!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nGUlH7_UjQ0hPnQvfuXLrw/o.jpg"
      }
    ],
    "user_id": "EgUGBGTJUvFJgHyFwgpD1w"
  },
  "VKB1aWZT1vN019jYXOSlcw": {
    "date": "6/15/2018",
    "text": "Love this place .joes taco  r very Delicious even the fish sandwich...mucho macho taco gets a 5 Star from me",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "elBvZXQ1ykC83gqp0zNpNQ"
  },
  "ABaPYsaS1ce38C6OBl3BfQ": {
    "date": "12/21/2014",
    "text": "Tried this place out. Decor is basic. Service really good. Super friendly. Food? Like how the tacos are a bit unique. Oranges in my brisket taco? That caught me off guard. But loved it! Grilled fish taco or fried? We tried them both and vote for fried with an outstanding sauce. Bacon tacos? Yes please! (Did not know about that but will get it next time.) Bean and cheese burrito? My daughter's comfort food, however not a fan of Mucho's beans. She will not be back. But i will! Mucho more tacos in my future!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uxR4jshIdy8mdAX7pCpSZg"
  },
  "ZBpXmn-Xhf5WygSEJHcjeg": {
    "date": "7/7/2016",
    "text": "I found the restaurant surprisingly slow for food that was so dang delicious!!!! The flavors and textures of the tacos are awesome really enjoyed my lunch",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9imdYz1fW1ZT3KLvpH_6Qg"
  },
  "7zkdSDDEELJrpS_gB7H6Hg": {
    "date": "4/14/2015",
    "text": "Still the best!!!!!!   The food here is SO much better than any comparable venues and blows away the chain restaurants.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3b5bcBoql9s_Qe9sEStCtQ"
  },
  "9iPIhoyHkDOWeY9ZisdsGw": {
    "date": "8/20/2016",
    "text": "Solid joint. Great light food. Very happy with the whole place from service to flavors. A+++",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MqOwl3rXmcc-7S3_2t85-g"
  },
  "1_e5FEvT6r-Q4leT7r3b3A": {
    "date": "10/4/2014",
    "text": "Baja Fish Taco. Try it. Love it. Crave it nightly. Also try their veggie tacos. They have this awesome green guacamole salsa that you should put on everything.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vJUiGfrqJIx5F7IuL9VGOg"
  },
  "_OWH4oegxXhs7QPDiicVWw": {
    "date": "9/29/2014",
    "text": "Um YES!! We tried quite a few different items-- chicken, shrimp, mahi mahi, and bacon tacos. Of those the mahi was the best. We also got the veggie burrito which was surprisingly the highlight of the meal. Absolutely amazing. The only thing that I recommend improving is the corn tortilla which fell apart. Mucho Macho Taco is a great addition to the neighborhood!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WX_p9rycXGoW7dIxsiQVBw"
  },
  "cqr6b8ed-d_d23PVWwdkhQ": {
    "date": "9/22/2014",
    "text": "Well worth 4 stars -- 5 star food. 3 star prices & speed. I loved Tacos Atoyac so I was really looking forward to this.  The Good - tacos & burritos were outstanding, brisket with caramelized onions & clementine, al pastor and turkey mole were all amazing. Kudos for having wonderful spicy pickled carrots at the salsa bar. YUM!  The Not So Good - At about $3 per street taco (2-3x the price of Tacos Atoyac) it's a bit overpriced. Won't stop me from returning, though. Also a bit slow (20 minutes or so between ordering & receiving), but I'll assume they're still working out the opening kinks.  Looking forward to going back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "irxpUjwKmVx4jDdPKk_mdQ"
  },
  "V7s9uHLEQgBJIUBBr9sA5Q": {
    "date": "3/17/2016",
    "text": "Great tacos at great prices! Definitely have to try the fish taco, but go ahead and order one of every kind. You know you want to.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s7qRpzKianC6cxq1nJWeaA"
  },
  "V0raOS4wlnZKw5ekLC7o_Q": {
    "date": "1/7/2015",
    "text": "Cute hole in the wall. The best kind of place. Great tacos (had the grilled fish, yum!). And nice staff, Sam was the sweetest!  Also The French Grocery is next door so you can stop and grab some bread for dinner. It's a two-fer! ;)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IlkWnEEf14AiI01JVZphUQ"
  },
  "-Pt-sPu_QNIVUwV_ofiFxQ": {
    "date": "10/22/2014",
    "text": "I've been here twice so far, and in that time I have consumed their bean and cheese burrito, their grilled veggie burrito, their brisket burrito, and the fish tacos.  I'm a fatty, deal with it.  All food items were super tasty, and their salsas were great as well, cool people, and a cozy interior, hard to beat.  So far, the grilled veggie burrito is my favorite, definitely nom worthy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kdrczttgzVkltxSizjKOyQ"
  },
  "RPv_m_bgySOze47UzHrYdw": {
    "date": "12/29/2014",
    "text": "I really loved this tiny little taco shop. The salsa was among the best and freshest I have ever had! I enjoyed their fish tacos and the price was a huge surprise. The tacos were full of fresh delicious ingredients and you could add additional items at the salsa bar. Come here hungry, BYOB and you will leave with change in your pocket. They have a briskly take out business too. I only wish they had a location in North Phoenix, I should buy a franchise....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8OAhtX8BHOxa2XFdgV-SdQ"
  },
  "BfnZLkP4TNQwhAxf5H899w": {
    "date": "12/4/2014",
    "text": "Food was great.  50/50 taco very flavorful.  Aaron thanks for Chatin' it up with us.  Sweet little neighborhood gem!  Always support the local businessman/woman when we can!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B-KETUgxMu4gy-22p2ldIw"
  },
  "k0hIyWlQbzy1CkdvV4I26g": {
    "date": "6/8/2015",
    "text": "Went for lunch here last week with a bunch of coworkers.  It's a small sitting area - but fine for just a few people. Service was actually pretty quick.  The boasting of a 5 inch tortilla is funny.  But in reality, it's just more tortilla.  I didn't notice any more filling than a regular street taco.  The fish taco was pretty good.  But the Taco with the Bacon in it - GROSS GROSS GROSS.  There is so much grease pouring out of the side of the taco that it soaked through the tortilla and actually ruined the taco sitting next to it.  It's so much grease that it completely ruined my meal.  I think had it been cooked more, and drained - it could have been better.  Also, when we left there the smell on our clothing was so disgusting.  We were actually going up and down the hall spraying febreeze all over.  Not just a regular restaurant smell - but that smell like all you wanted to do was get out of your clothes and take a shower.  My recommendation?  Order take out and just the simple tacos.  They don't have a great handle on the more elaborate ones.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "X8GzHpCI-EGWkiIadHOx3g"
  },
  "-BrydcWobwHYNRqM0fMB_g": {
    "date": "1/16/2015",
    "text": "Grilled vegetable and hummus burrito is delicious.  Really a unique burrito you won't find anywhere else.  The vegetables are perfectly grilled with a delicate smoky flavor and has a bit of cabbage inside which gives it a great tang.   Can't wait to come back.  A new, instant favorite.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "LkJSvJy7KaxVBPpWBFJe6g"
  },
  "DDhh0b8_qfYc3IwXze8agQ": {
    "date": "9/25/2014",
    "text": "I don't understand the draw of this place. The atmosphere is fun and staff are great, but the food just isn't that outstanding. I had three tacos: carne asada (meat was tough), shrimp (tastes like algae), and I can't even remember the third which is a bad sign. Also, the prices are such that you're paying at least $1 per bite. I much prefer Phoenix Burrito House which is a better value and has tastier food! OK, I will say the sopapillas here are delicious. I'll give them that.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "zT8hlgWTI-fKG-TDL5qBZA"
  },
  "kRcHU1g2Q-3LxflXGKSW7w": {
    "date": "6/6/2015",
    "text": "Amazing food and service, lovely place to eat. Had the Carne Asada burrito which was fantastic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oz87x3iaEi17QgAqMCm1SQ"
  },
  "RD63JG2Q39Gge_sXs5ugyA": {
    "date": "10/10/2014",
    "text": "Most amazing Horchata ever.  Plus, the pastor and braised brisket tacos are amazingly unique like none other.  I highly recommend this new, hip, reasonably priced taco joint.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kKylBSlZC6NgEJNjizy1pA"
  },
  "i6mo5eFhKaLggj2MViAUCg": {
    "date": "6/12/2015",
    "text": "This is my favorite taco place in the valley!  The chefs are amazing!! I had the corizo and braised brisket tacos. Delicious!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "McvZfPBMz7QYXq_JVCgpgg"
  },
  "MM-Pvrgzatw_0xwefUMw1w": {
    "date": "11/12/2014",
    "text": "Even though the name of this restaurant has mucho in their name, there is nothing mucho about their tacos. The lady who was cashiering told me they were \"a little bit bigger than street tacos\" which was a lie. They charge $2.95 PER TACO when they should be charging $1.95 because of the quality and size. Not worth it. We got the Baja fish which was pretty decent and had a little heat (which I guess made up for their very mild salsa bar AKA not one salsa was hot period) and the Pollo Asado which was just ok. Their pico de gallo brought in the most flavor with the chicken being bland. We also got a carne asada burrito and split that and the 2 tacos (because we didn't want to pay another $2.95 for another \"not a street taco\" taco). The meat on the burrito was overcooked and the cook did not cut it apart meaning as I was chewing and swallowing it, pieces would still be stuck in the part that I was still chewing and I would gag. Personally, I say take your money to Joyride Taco House. Their tacos are twice the size for around the same price and their food is 1,000 times better than this place could ever hope to be.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-CkQLJu09vfonLj50PfPYQ"
  },
  "VCguYhzS1AWs_hXz0Ms8iQ": {
    "date": "9/24/2015",
    "text": "The only problem with this place is they don't deliver so i could eat it everyday",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9wpXSA6KJN2P6VqhdaxjsA"
  },
  "EGEy7gCQkFxPwrdigdaHHA": {
    "date": "10/19/2016",
    "text": "Place is not worth going to, super salty food, we couldn't even finish it  definitely disappointed",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aOgkrq1LWdYfR7RFTTYdGw"
  },
  "uQxYEQUVBJlLQySIPVP8jw": {
    "date": "11/11/2016",
    "text": "BYOB and tacos!!!! Two of my favorite things in one place.. Best fish tacos in Phoenix!! So if your looking to try something new I def suggest going.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lhmPAOBVuA4-tjEj2PMSsA"
  },
  "xtVkWideDO0lOZMFGS6nHg": {
    "date": "10/4/2014",
    "text": "It's dangerous living near by... Love the friendly staff, they make you laugh. The comfortable atmosphere.  And most of all the creative & well prepared tacos!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MpAc9FN51W-GZLFD6Rj05A"
  },
  "-WC8T5jxY4XA44zaWxySAA": {
    "date": "11/3/2014",
    "text": "I give the Machos a 5-star because they make simple, good tacos.  Salsa bar is great, especially the hot sauce and the carrots.  Place is clean and friendly. Maybe grill or light fry the tortillas so they don't crumble, but this only happened to 1 of 3 tacos, so what do I know! Also, make you register offer tip options. We like you that mucho! Boom!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MMa3dTVfsiEh1PGfBtNLIw"
  },
  "AMwwXMMShdZBs_SwNWdn1w": {
    "date": "12/24/2014",
    "text": "Absolutely thrilled!!  I litterally work like a 3 minute walk from here and me and a coworker had been dying to try this but always seemed to be extremely busy especially on Fridays, I mean its a tiny parking lot space so it already has no room.  Fast forward to this part Monday. we finally decide to go. BEST DECISION EVER.  I had 2 tacos, 1 shrimp and 1 bacon (YES BACON!!) and a large horchata. my co worker had a carne asada torta and an horchata aswell.. we had a sopapillas for desert. everything was delicious!! 5 Stars!  meat was perfect. THE SALSA OH MY! the best. Make sure to ask for chips to go with your salsa. you wont regret it!  Customer Serivce also gets a 5 stars.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yw3kqLJ6LSK5VIJ-MfpCfA"
  },
  "j4raqR9HcpoE5d_4PYz2xg": {
    "date": "11/2/2014",
    "text": "Excellent food and reasonably priced! Had the flank steak and chicken tacos - loved it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zll3LTwpmtnVV0ilH37ENQ"
  },
  "DBzLRevQPuTkk-XlIc_5Ww": {
    "date": "4/18/2015",
    "text": "My father and I stopped in for a quick dinner and we were very satisfied with this place. Complementary chips and salsa if you dine in is a nice touch and you have your choice of three salsas, all of which are great. I had a braised brisket taco with green chiles and the pastor taco, both were delicious. My dad had the steak carne asada burrito, the meat was tender and flavorful and the burrito didn't fall apart.   I will definitely be coming back to try the rest of the menu, definitely recommend!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XgRIiJ8T9GjR4Rwi8BcuCQ"
  },
  "0Hz4NEU08JE10mzQHtcoow": {
    "date": "4/20/2016",
    "text": "Great place to walk when at work. Just up the street. Good food and great service. It's small but fast. Good for take out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UdAbNi2gDZ4giwUviGwI_g"
  },
  "wFB7c2BPuAmNHAaZvIjn4g": {
    "date": "11/20/2015",
    "text": "We really wanted to like this place since it's walking distance from our house. We tried it several times to be fair and ordered a variety of items.  Every time the food was strangely seasoned or oddly combined and boring. The tortilla on our burrito was hard and stale. We won't be going back again. Disappointing.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "1c93M7TpTMYuNUwVYkli2A"
  },
  "R-GIF5ljePCWbgc0mGrVSg": {
    "date": "9/22/2014",
    "text": "Had the skirt steak and 50/50 tacos.  Very tasty.  The horchata (sp?) drink with nuts was delicious. I especially liked the very hot habanero based green salsa.  Plus it's only 5 min from home.  Definitely will come again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4FL8uDkvk_2wQs-CEAorkA",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. Hot hot hot",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4FL8uDkvk_2wQs-CEAorkA/o.jpg"
      }
    ],
    "user_id": "CJqgUQeWhdgbDyLAFy7xvQ"
  },
  "enheggIVPyBWDNx_3IxXtQ": {
    "date": "9/17/2014",
    "text": "The sopapillas were awesome! I tried their fish, shrimp, and pollo asado tacos, as well. The fish taco was ok. The chicken taco was a little dry and tough. But the shrimp taco hit the spot. Great cream sauce with a bit of a kick, too! It's local. It's tasty. It's decently priced. You should check it out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9YR6IHVVPI_OYkStLxosxg",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. Sopapillas",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9YR6IHVVPI_OYkStLxosxg/o.jpg"
      },
      {
        "img_id": "vlmg0sgoR-QqPWure6D8iA",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vlmg0sgoR-QqPWure6D8iA/o.jpg"
      },
      {
        "img_id": "eZUb_q2w-wVurBXE34x4UA",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. The Menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eZUb_q2w-wVurBXE34x4UA/o.jpg"
      }
    ],
    "user_id": "3x_SEZwh1pYshafgS4SCcA"
  },
  "FLk-Pz2jqGA1cMv5LsT90A": {
    "date": "11/12/2014",
    "text": "Where Gourmet meets Taco but tastes amazing!!!! Chef Dan has really outdone himself this time. The combinations are unique and tasty. Can't get enough of this place. Wish there was one in the west valley. Go for the shrimp or brisket...my favorite!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4Y_-QLunQUauYYkLNtYTCQ",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. Variety is the way to go!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4Y_-QLunQUauYYkLNtYTCQ/o.jpg"
      }
    ],
    "user_id": "8TWwytfESQd6eJlSpP6YFg"
  },
  "ZKEhENKPOs5AVzRxJmljzQ": {
    "date": "7/26/2016",
    "text": "Had the Macho burro which was exactly what I've been craving for months now!! My wife had a Rosarito dog which she inhaled and crispy and fish tacos!! She's a chef and actually loved every bite!! Awesome simple menu and service was great as well!! Thank you guys for satisfying our cravings!! We will definitely be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lDoOk7yJQHgQVf29pNiSXw"
  },
  "cVBJKYLNdfWym-c87WeiyA": {
    "date": "11/18/2014",
    "text": "Pretty good food! Had the \"surfer\" Fish torta it was pretty dang good. Definitely check out for yourself.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f8rgPn9xC1VwAz-5IPKwBQ"
  },
  "8BKeOKFvAQ2JqpJTye7_3A": {
    "date": "4/9/2016",
    "text": "Everything is great. I have been here several times and have tried to get something new each time. Fish tacos, and braised beef are probably my favorite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bTfmOnkbllOSOtv7B1hjJg"
  },
  "WpeYiIfKxStyuv6qcO7D4w": {
    "date": "6/30/2017",
    "text": "I have been to a large number of Mom & Pop taco shops through out the valley, and enjoy their food greatly.  This is a Yuppy taco shop, tiny tacos that leave you hungry.  If you like tiny Yuppy tacos this is the place for you.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wiQPV7nhHPt42KyT-cghqw"
  },
  "zvvrthQfHpAabjH0tccI5g": {
    "date": "2/13/2016",
    "text": "I really like this place and need to go back. It is not your ordinary street taco. The portions were huge and the prices were cheap. That's the kind of restaurant I love. The al pastor taco was delicious. I thought I would need three tacos like normal but filled up in two. The staff was friendly and patient when we were looking at the menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gKccjX4MhqW7hNHmmXWhxg"
  },
  "kqi_QDXdHu2fhd3SaKrNcg": {
    "date": "10/24/2015",
    "text": "The fish taco and fish torta were delicious! The sauce was just right - not too spicy!  Every ingredient was really fresh and the bread for the torta was yummy!  The inside was very clean. We will definitely be back when we're in this part of town! Perfect lunch spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cjXaLGmkk6ZWhJG6Y4BjbA"
  },
  "8HWx1rTdlH4FiVWtsbMYtA": {
    "date": "12/20/2015",
    "text": "Awesome food. Had the fish tacos and Joe's crispy tacos. Not much for ambiance but you won't notice once you start eating.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "0IGpZVUasT3fubxFSWPGcA"
  },
  "Fmf64t3KScyZBu4iO1n2rA": {
    "date": "3/8/2016",
    "text": "First time in here. Easily the best Lengua taco I've ever had in Arizona.  Fish tacos both grilled and crispy were fantastic.  However,  the braised beef while flavorful,  was quite chewy. Seems like a better cut of meat would have been better. All in all, I will definitely be back. Great Job Guys!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cg70HVffdw9_irgIadzPXg"
  },
  "J2BRI2eFJfJZQfO-DUkU5Q": {
    "date": "6/11/2015",
    "text": "I wish I was more into the food scene because the illustrious Dan (of so many other reviews) was in the kitchen the evening we visited and I could have been all hot shot with Jenny and been like, \"oh yeah, that's Dan back there.\" But I'm not so that's that.   Now the food at Mucho Macho Taco is good. We had 50/50 tacos and brisket tacos that were both on par. The red salsa was decent but the green salsa ('verde' as it is often known) was creamy and excellent flavored. The star of the show, however, was the chicken quesadilla. Not too greasy and full of cheese -- dip that baby in that salsa and stuff your face.   Glad we finally tried MMT -- will definitely be back to try out more of the menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5NDk-q5mv8PIDvz83HwMVg"
  },
  "v-HjEXImFvA6VgH-LUbQxw": {
    "date": "2/2/2015",
    "text": "Meh.  Nice people, marginal tacos.  I visited this restaurant during the Super Bowl.  Kudos for being open.  The salsa was bland by Phoenix standards and the tacos, while perfectly edible, were simply not as good as what you can find elsewhere.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qs6kDS4X9KykSgkjKnu7jw"
  },
  "X69sGG51dS41eR5cOpy-Iw": {
    "date": "5/23/2015",
    "text": "The green salsa was to die for! I could drink it. The tacos were good, but small. We had the braised brisket, pastor, crispy fish, and shrimp. The crispy fish was really good and fresh and probably my favorite. The horchata was the best I've ever had! Check this place out! Hopefully Mucho Macho Taco is here to stay.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "njbzzoW5Ex8K9siqF4eVYg"
  },
  "h9uDqgeIbu-GrpyVvI5rQQ": {
    "date": "12/13/2014",
    "text": "So glad to find the previous partner of Tacos Atoyac here.   I'm not so sure about the macho part, but this place is mucho excellent. Tacos for meat eaters and vegetarians (Veggie + Hummus Taco - yes please). The bean burrito rocks and the horchata is excellent. They even have cheesy tater-tots - a serious WIN in my book. If you are in central phoenix or north-central, check this place out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YNsdkm5VdyijkjMCecs8VA"
  },
  "YN9X3YEZyyVt_YA6rj1W-w": {
    "date": "9/29/2014",
    "text": "How I love me some street tacos! And Mucho Macho Tacos sure does have them! We came here for lunch on a Friday afternoon after hearing that it had recently opened. I've been to Tacos Atoyac before so I was excited about this place opening seeing Atoyac closed.   Mucho Macho is definitely a lot cleaner than Atoyac. It also seams to have more tables inside but there isn't a patio like the old location. I can see when It gets busy finding room might be tough but lucky for us we were able to find seating right away.   We ordered a few different tacos and a carne quesadilla. I'm a huge fan of street tacos and all of there were really good. We ordered the crispy fish tacos, pastor, and carne. I loved the pastor taco so much! Next time I think I'll just order a bunch of them! Carne was. A close second and I did enjoy the fish but I'd probably stick to pastor and carne next time. I enjoyed the quesadilla but my wife actually thought the meat was a little tough.   Overall I had a great experience. For 4 tacos and a quesadilla total was right around $15 for the both of us. We had a lot of food and paired with chips and great salas you really couldn't beat the prices.  I'll forsure be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "nWh05uXTfV-L7s3iZon4Fg"
  },
  "Zob0zRz2o2kuAs1VOnwiZg": {
    "date": "6/17/2016",
    "text": "This place is mediocre at best. The food was very bland. Salsa tasted like spaghetti sauce. Carne Asada had little, if any seasoning. Avocado salsa was boring too, no real flavor. I had heard this place was good but I cannot say I will be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zaY_2idt1iaa_T__5VMgVw"
  },
  "bBNmFyrTwze6B6My5jMz8A": {
    "date": "11/14/2016",
    "text": "Best fish tacos, especially with the chipotle sauce. Also the bean and cheese burro is mondo size for the price. Horchata is creamy and very delicious. The staff was very nice, I saw them go out of their way to help customers, and they all look like they could bite through a pipe wrench.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rWi2O0CZWnwa6eiQxngzRA"
  },
  "0-szdqcoQp24bU4E9454iA": {
    "date": "5/31/2015",
    "text": "Fish torta is amazing!!!!  My new found love!  I wasn't crazy about that pastor burrito and they exchanged it for something else.  Very cool!  Definitely will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DlpHZP1h3tLpp-SJOeZidw",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. Fish burrito here is never a disappointment!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DlpHZP1h3tLpp-SJOeZidw/o.jpg"
      },
      {
        "img_id": "iJ4pykPy1w_xqJ-qwJ_39w",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. Fish torta &amp;amp; chopped salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iJ4pykPy1w_xqJ-qwJ_39w/o.jpg"
      }
    ],
    "user_id": "cZNlvxmWynyqmvrzT06J_w"
  },
  "s1bScIdiC8ugWticGj-sAQ": {
    "date": "10/12/2014",
    "text": "As a huge fan of Dan Maldonado's Tacos Atoyac, I was very excited to see him open a new shop. So today I tried Mucho Macho Taco and came away very disappointed.   Parking is definitely an issue here. If you're not lucky enough to snag one of the few spots then you can park across the street at Sylvia's as their lot is semi-empty (for good reason).  I tried the bacon, braised brisket, and crispy fish tacos and a side of super tots. Why haven't I had a bacon taco before?!?!? It was wonderful with thick crispy and chewy chunks of bacon. The brisket taco was good but runny. The fish taco was a huge disappointment. I'm not sure if it's the same farm-raised basa that Dan used at Atoyac, but the fish in my taco was overcooked, small, and flavorless. And it had shredded yellow cheese on it? I love cheese but not on my fish taco please.  I also got a side of the super tots. Who doesn't love tater tots? These were very greasy and had a little shredded cheese and maybe a tablespoon of pico on the top. Will not order those again.  I will definitely go back to try other things. I like that they have a self-serve soda fountain, salsa bar, and you actually get chips now. Big pluses.   I sincerely want my next rating to be 5 stars. Dan is such a nice guy. I hope my experience today will be the exception and not the rule.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YGXh8s5c28YOzTuB4nZi9Q"
  },
  "ZeQliyjZ4WAk5nnO4cnYrg": {
    "date": "9/17/2016",
    "text": "Great place. Simple menu, but I find that's the hallmark of really good food. Husband had the al pastor torta and I had the green chili pork burrito. Both were superb.   Also appreciate the helpful staff who assisted me in navigating food allergy needs.   Will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z2bxNM3ZRcEYsDyoLMc4lQ"
  },
  "L0d9tDC2nhAkRuczRPw-Jw": {
    "date": "11/1/2014",
    "text": "Go for the green sauce.  No trip is complete without horchata.  Not too sure if Dan does \"off the menu\" items yet.  I shall find out next trip.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_lZ1FKJsPwWlyQlrqHY8Ow",
        "caption": "Photo of Mucho Macho Taco - Phoenix, AZ, United States. The crispy baja fish burrito is all that.  The horchata is damn tasty.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_lZ1FKJsPwWlyQlrqHY8Ow/o.jpg"
      }
    ],
    "user_id": "Rmk04a0wt0NIfHijwRyE-Q"
  },
  "N3iRvO4K9QY2A58lH3PaKw": {
    "date": "12/8/2016",
    "text": "By far the BEST TACO SHOP in town, food is always fresh always authentic not to mention they always have a different special from arroz con leche to hot Cheetos corn on the cob. The tacos are awesome, the burritos are HUGE, just a really good place to eat. The staff is great very friendly and always ready to take your order!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-t3XWw1dMmOvJppWapEtlQ"
  },
  "Tjom32H2zy5hewX5A10vHA": {
    "date": "10/15/2016",
    "text": "We were looking for some where new and this place popped out of no where. I am very happy we stopped. I had the crispy fish burrito. I am absolutely full and loved every bite in getting there. I recommend this place not just for the food but the staff is awesome too. They helped my daughter get salsa when she couldn't reach the dipper. They joked with us when were ordering.  Couldn't ask for a better place to spend our lunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p6VKL5skLFpbmNEds3ee5g"
  },
  "3AnqlDbVnLIg9hoeZIPGEg": {
    "date": "10/15/2016",
    "text": "Super good food, I don't usually get carne asada because it's over cooked. But this one was amazingly good! A must try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YF2LvzE2mJD7mekoKMj59w"
  },
  "NakQcndbZmBuel9llRkipA": {
    "date": "9/25/2014",
    "text": "I've visited mucho macho tacos 2 days in a row now and I'm pleased to report that it's great.  The menu isn't as authentic feeling (whatever that means) as perhaps some other restaurants but it looks and feels fresh. Definitely a step up from what you may have experienced before.  It's brightly decorated and the service was quick and friendly.  The crispy baja fish taco/burrito is excellent, as expected. The papaya slaw that came on the pastor taco was unexpected but really good! The grilled mahi wasn't as good as I hoped but the shrimp tacos were unbelievable. A new favorite for sure!  They have a \"bang\" tap!!  The only criticism is that the space is a bit small and it's already a popular place so seating is at a premium. However if you love or work close you can easily get a take out and find your own spot to eat.  Oh also the Dodgers suck but not everyone's perfect.  I'm happy there's another great taco place in the valley and I'll be a regular.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WbMK70OMDvvVSSNUhIk9lg"
  },
  "LdHBqMHODjqc8zZFj-hatA": {
    "date": "7/20/2016",
    "text": "Delicious! I had the braised beef and fried fish tacos. They were so good! The service was so friendly and they showed us the ropes very clearly since it was our first time. They even had free chips and three kinds of salsa.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8gEpRwxEv_uQovXhpKQLww"
  },
  "z-NVwaT1bWZjXwfOTOL0Gg": {
    "date": "11/14/2016",
    "text": "Really amazing food! I stopped in on my way home from shopping this evening and the guys that work there were so nice. I was unsure what to get and they really helped explain the menu, they even let me try a little bit of the meat that I was interested in. I had a bowl, and got a side of the grilled onions and chilres and it was delicious. I also ordered the horchata which was fantastic! the prices were reasonable too. I will be back for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2_jgFSykN-8KDDWqgm-HnQ"
  },
  "3-UNdvmSsen9q8PtdDNtrQ": {
    "date": "10/29/2016",
    "text": "Great tortas and hot dogs.  Everything is super fresh and the employees are always friendly.  They make the best horchata too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9ywyE0VV_ovqVKoWEiuf4w"
  },
  "yoyCbUcCfiyvbNiUsk7Pkg": {
    "date": "7/31/2016",
    "text": "Place is good for quick bite for lunch , the horchata is amazing good job, I like it when they do horchata from scratch I don't like that fountain horchata , i like this place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2GzMhEqIDmH0A0TA9VDh1Q"
  },
  "HweQMcJldHoKpf7mzeH5Tg": {
    "date": "10/21/2016",
    "text": "Great food and great service!! I recommend the rosario hot dog and the breakfast burrito. It is by far the best breakfast burrito in town!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "69lQZBWGkepFs4LQV0lGRQ"
  }
}