{
  "YVGjTHAXsY57eM6sF3OwXQ": {
    "date": "3/27/2016",
    "text": "I have it delivered often. My boyfriend and I enjoy eating here. Great portions always hot being delivered.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "f1RgdX-gatdgvg0LlzuHbw"
  },
  "ABh4HEYy8weeYY7m-QmLWA": {
    "date": "7/14/2016",
    "text": "Fantastic food, great service and wonderful people. We really enjoyed it. I had Moo Goo Gai Pan and Teriyaki Chicken.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WvCJp4C_5bnij-Wl6Xi87w"
  },
  "3OuGEdmm7sT3ioFoMBsPhQ": {
    "date": "8/23/2014",
    "text": "Late night dinner decision, food was pretty good! Nice atmosphere and clean. Empty due to how late so you could hear the conversations the bar tenders were having and that would be my only complaint. I hate going to a business and hearing the staff complain or talk raunchy while at work when I'm trying to enjoy my meal. Decent pricing and sizing! Sesame chicken had great flavor! You should check them out if in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-pXjFihZcoCxOCyaAJTLJA",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. House fried rice",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-pXjFihZcoCxOCyaAJTLJA/o.jpg"
      },
      {
        "img_id": "YW8B0FyXV4kbnmxDoHkNWA",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. Sesame chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YW8B0FyXV4kbnmxDoHkNWA/o.jpg"
      }
    ],
    "user_id": "6Jg21t6TMKf6_pIlCD03tA"
  },
  "Xwf-GW40yxj8-222k_sFDA": {
    "date": "2/26/2017",
    "text": "Ordered delivery. Said would take 45 minutes. After 90 minutes called and they said food was in route. 40 minutes later still no food. Food may have been good but delivery was awful. I will never eat or order from them again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "be-4QpDddaxfMlDuRMzvpA"
  },
  "JXNDAbYC0XgXS3PggdrrrA": {
    "date": "1/27/2016",
    "text": "I've been to autumn court a few times, and officially hooked! Their happy hour specials are an incredible/easy deal to take advantage of, they have a nice clean restaurant with a fine ambiance. Their soundtrack is really nice, and they have a nice/fun waitstaff! Arvand is a fantastic bartender, and I would definitely recommend coming in!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jliSEtGVqgrzG58wyCv59w"
  },
  "zJXo5RupHAUbF-PuUft1ng": {
    "date": "5/23/2014",
    "text": "Had the Mongolian steak and some house Low-Mein. Everything is very bland and tasteless. Other than the color of the meat, it's hard to tell what you're eating and afterwards, well, let's just say it didn't sit very well. Won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yGXKMV1omio1I_3qNLdtAA"
  },
  "yDklcTJRtaVVGaZpM9SC5A": {
    "date": "5/29/2016",
    "text": "Ordered delivery via Yelp. Arrived fast (thanks Yelp and whatever that courier service was). The food was plentiful and very delicious. Not the best in the world but definitely better than average. Will probably order again some month.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aP_DLkcpRcqLdQl6uYoD3g"
  },
  "71_IHO_AjGWFOyNdfooTBw": {
    "date": "8/4/2017",
    "text": "Food was horrible! Ordered ToGo, Crab Puffs were very very salty, cream cheese is supposed to be sweet, also couldn't find or taste any crab. Sesame chicken was poor, fried with sauce on the side in a container and boy did the sauce make me wanna gag. Will never order food from here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G7rVabllwOvsOJOReCtKEA"
  },
  "BRTYuOLnAreHuyjtfU4rRQ": {
    "date": "12/10/2007",
    "text": "Sushi at a Chinese restaurant?  I wasn't brave enough to try it, but I was impressed that there was a decent sized sushi menu offered to me...   I ordered 'carry-out' a couple of times from Autumn Court and had decent meals, so tonight I decided to get the full experience and eat in the restaurant.  The hostess (who turned out to be my waitress as well) was attentive.  Not the friendliest, but she was fine.  I guess I would've liked to see her smile, but aside from that, service was perfectly attentive.  Several other people checked on me as well (I assume the GM or owner).  I went with the egg flower soup to start and the mixed vegetable with tofu dish.  The soup was kind of bland.  I thought about sending it back, but I added a little soy sauce and kept my mouth shut... The entree was delicious... the tofu was golden brown and the perfect texture and the veggies were crisp and delicious.    I will order carry-out and even return to dine-in at Autumn Court again... maybe next time I'll even get a smile!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "uVx0tEq9XVYgT72bU3RNtA",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. logo taken from www.autumncourt.com",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uVx0tEq9XVYgT72bU3RNtA/o.jpg"
      },
      {
        "img_id": "-hFLkQ8M85fDVdZ9WWKTqw",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. image taken from www.autumncourt.com",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-hFLkQ8M85fDVdZ9WWKTqw/o.jpg"
      }
    ],
    "user_id": "dIIKEfOgo0KqUfGQvGikPg"
  },
  "kjUs3Oan2rtupLzYhwNxHw": {
    "date": "7/18/2017",
    "text": "Having lived in the Valley when Autumn Court was on Central Avenue, I was extremely excited to finally get the chance to eat there for a brunch with family. I was so disappointed in my experience! First of all there was no one to seat up when we walked in. My step-dad finally had to go an knock on the kitchen door so someone could come out for us. Then after being seated, we waited for about 10 minutes until a busser passed by and we asked him to take our drink order. After he took our order, another man came over and asked for our drink order. When we told him the busser had taken our order, he get sort of angry and walked away. Then, neither of them returned with our drinks! Finally a 3rd person came out with our drinks and took our order. After another wait, we needed our drinks refilled; we saw the busser and flagged him down since he was on his smartphone. He came over to us, and after finding out what we needed, he said, \"I'll get the guy for you.\" Meaning...? Then he sent the 2nd server out to us for the drink reorder, who then sent the busser out to take our drink order! It was a hot mess! We finally got our food, which to be honest wasn't bad, just not worth the wait. We will not be returning anytime soon, but I will be willing to give it another try sometime.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P-Dhs-L7cGYOSvEHIsaxcg"
  },
  "FTU7eY5ns5ZsrgsTUib7Ew": {
    "date": "5/29/2016",
    "text": "This place is a great lunch option during a busy workday. We go here often and are able to get in and out in less than 30 minutes with 5 people. Their lunch menu is extensive and affordable and everything I've tried so far has been delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zTcEaWYZ09DMrhM8ujMzNQ"
  },
  "JWqcXX5uNO_orP5DzPmMqQ": {
    "date": "1/14/2015",
    "text": "I have been here many many many times. I live down the street and have never had any issues other than a few people having fun and the bar and yelling at times. Other than that great service and food it to be had here.   Edit:Last time I went the food was sub par and no longer Vegan friendly.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E5EcMcy0_a4aCOFOUxVjBQ"
  },
  "L50fpHL03ZeVUMMSG9tKCg": {
    "date": "11/12/2015",
    "text": "I have had delivery multiple times and it has always been fast and hot. The food is good, love the option to upgrade to fried rice without having to order a whole other item. Their hot and sour soup is delicious (and can be spicy!) and they have the best fortune cookies , I know that sounds lame but really their's are really funny!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "FWNRhPrCGbccoiDdK-YGDg"
  },
  "8k5C1rSpm-o2vaHsaUlA1w": {
    "date": "6/20/2012",
    "text": "While our waiter was a doll, thats the only good comment I have for this place.  I ordered an egg roll, potstickers, and crab puffs from their happy hour menu. Super cheap, and it showed in the quality of the food. The egg roll was burnt on the outside and soggy on the inside, ew. The potstickers were basically balls of sausage in a pasta pocket, and the crab puffs....didnt have any crab in them, real or imitation. It was just a wonton and cream cheese. My friend (who's a vegatarian and has never had a crab puff) told me \"Yeah theres no meat in them, isnt that great! The only reason crab is in the title is cuz theyre shaped like crabs.\" Oh poor misguided girl...  I wouldnt recommend this place to anyone.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vPOkQJKahhR13LQ2ElSFGg"
  },
  "t3YaKWJCoMWGJ1v4ARiwWw": {
    "date": "6/22/2013",
    "text": "I've been passing this place for years and that was a big mistake.  I went in with my mom and sister for lunch. It was empty, so that was kind of unassuring. But once we sat down our server came up to us and was very nice! He explained the spicyness of the dishes and let us know we could taper it down.   We were able to order off the lunch menu. The sesame chicken was great. My sister got the sweet and sour chicken which was excellent. Mom got the tofu. She liked it too. The portions were huge! I didn't expect to get that much food. The prices? Very reasonable! $7.50 for lunch? Can't beat that.   The place was very clean and the service was great.   I will definitely come back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "PufQ0bMCOGdgyAnfnCdMxg"
  },
  "dEOk22DKrCYhVXG8d2atWA": {
    "date": "5/3/2017",
    "text": "The food was amazing! Ray was awesome and really nice. The spicy orange chicken hits all tastebuds. I really recommend come here for old Chinese food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3hbwblEUiZcF-sUW7cg9fw"
  },
  "NRPN4hNzx4OtIUjROmW0QQ": {
    "date": "5/1/2017",
    "text": "Sad but True, in Arizona for a biz trip, ordered through UberEATS orange chicken. Nobody's thought they could messed up ORANGE CHICKENS. The rice is unruly.. TBH Panda Express is a million times better.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Jt1QvFqLmvTbN1icjMsmw"
  },
  "fjFHpBTXg_7ETv1FeKWeKQ": {
    "date": "10/20/2013",
    "text": "I've eaten here off and on for about 10 years but haven't been in a long while till today (it's been several years actually). I love their lemon chicken because the sauce has the perfect sweet and tart taste and they used to use actual chicken breasts to fry the chicken and then top it with the sauce and you knew exactly what you were getting. I went today and was super sad to see that they now use the pre-cut and breaded chicken pieces that have more breading than chicken. the sizzling rice soup was good and veggies in there were fresh but the soup was a little on the salty side. We also ordered the peppered beef, Szechwan string beans, and honey walnut shrimp. I love salty food and all, but they seriously went overboard with the salt in every dish and it was hard to finish our food. The server took out cups away for water refills rather than bringing a pitcher and refilling it at the table, so I'm sure I got my friends cup and someone else got mine. the atmosphere is nice, it's dark and more romantic date night feel but I probably won't be coming back. here are pics of our food but it was really dark so the pics didn't come out too great.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "M-TqB4YCNERcKdzUhPIbcQ",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. lemon chicken. delicious sauce but they went from using whole chicken breasts to these over-battered chicken pieces :(",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/M-TqB4YCNERcKdzUhPIbcQ/o.jpg"
      },
      {
        "img_id": "tXK_Lj8sJFUn0wy5-tkD2g",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. peppered beef. yummy but again really salty",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tXK_Lj8sJFUn0wy5-tkD2g/o.jpg"
      },
      {
        "img_id": "5XkTvyi9fD7bbfz4aP_vag",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. Szechwan string beans with minced beef I think it was? yummy but super salty",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5XkTvyi9fD7bbfz4aP_vag/o.jpg"
      }
    ],
    "user_id": "0ibm06KpYdnGL8Ga55w5RQ"
  },
  "vs939c2tfp1gRrtVBYA7dg": {
    "date": "12/26/2015",
    "text": "2  hour wait and then canceled my order. Go to little Shanghai down the street. Real service there.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Uw14azQQRD38gZ4ylXDKrQ"
  },
  "0rWjPX2q2mhmeKPGCMmniw": {
    "date": "4/13/2013",
    "text": "This place would have got a solid 5 stars, except for two reasons:  1.) I placed an order with Katie for a group lunch at work. I specifically ordered the G combo, which comes with plenty of appetizers, lo mein, and teriyaki chicken served over fried rice. When the delivery guy dropped it off, it was Kung Pao chicken... filled with hot peppers and peanuts. All I kept thinking: half of the staff are allergic to peanuts, and the other half can't eat anything past a bell pepper.   2.) Katie wasn't pleasant and I found myself not wanting to give business to a company who has a snob answering their phone.  Nevertheless, the flavors and authenticity of the food was fantastic. The delivery guy was very apologetic for the mishap and said the owner would be contacting me on Monday. If they correct and/or apologize for the mistake, our company will definitely order from them again.",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 7,
      "cool": 4
    },
    "photos": [],
    "user_id": "ZbeknMQQmKosOCRhu9utHg"
  },
  "fbdf9FTx1RhdViQaNvqOyQ": {
    "date": "1/9/2018",
    "text": "Ordered delivery. Beef chow fun; beef and noodles were mushy and overcooked, dish was a quarter white onions. Ribs appetizer; way too sweet and overcooked and chewy. Mushroom beef; not a single mushroom, half white and green onion. That's three out of three. Crossed off my Chinese food list.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Yx-hGOItB8WQgIrmEFujuQ"
  },
  "b1V9H1_Wdzn_VSK0ItX82Q": {
    "date": "5/22/2018",
    "text": "I am editing my review because I am impressed with Autumn Court's customer service. I wrote my original review not expecting a response, and I believe that service is a huge part of what deserves a good rating.   I ordered lunch for myself and 6 other employees through Bitesquad for a lunch meeting. Two of the orders came in not as we expected, as they were both Chow Mein dishes but arrived with no Chow Mein noodles. After hearing from Autumn Court, one of the orders was made correctly by the restaurant but was ordered incorrectly due to our misunderstanding of the menu. The other order was incorrect but seems to be an honest mistake from the restaurant and things like this happen to even the most attentive establishments.  The members who received what they were expecting loved their food. We definitely recommend the crab puffs as they were crispy, seasoned well, and gone within seconds. The pot stickers were large and meaty. The member who ordered the Dan Dan noodles said they were delicious and had great texture, and even the noodle-less Spicy Beef Chow Mein dish had amazing flavor. Another honorable mention was that the order was made and delivered perfectly on time even though there were 7 of us (shoutout to both the restaurant and Bitesquad)  I will have to give this place another chance. Please note that I did NOT receive free items to update my review, and I updated it because I genuinely feel as though my first rating was unfair.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p9jN_YXvuf2OYT3BaCLD0w"
  },
  "VmmSY-0AfGvhS8gQNMc78g": {
    "date": "2/15/2018",
    "text": "This is a great restaurant. The food is amazing. Tried a couple different appetizers and they were all sooo good. All the entrees we tried as well came out in a timely manner and were scrumptious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7hfrXNTTKT54jllVkWDN6A"
  },
  "fFakUsSWUAYFojU_nqthAA": {
    "date": "3/23/2018",
    "text": "Why can't they get the orders right??  I've ordered a few times from them and the food is fine. Nothing special. My issue is they can't get the order correct. How hard is it to get fried rice?! The last two times ordered they don't include it in delivery via Grubhub. The first time they missed it so I called the restaurant and the manager told me he doesn't check Grubhub orders and I should use another service. WHAT!? mistakenly I tried them again through Grubhub and same issue. I called and the restaurant staff said they can't give a refund. So I called Grubhub and got a refund. This is the last time!  This isn't a big problem to solve-get your orders correct!!!! I'll find somewhere else to order from",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mrfP_r2Nr8Mbsy6R5mbY2Q"
  },
  "DLZ4nJuPfO33g-DWyIdBFg": {
    "date": "4/23/2018",
    "text": "Finally, after all these years living in this area tried Autumn Court for dinner. The waitress was excellent. She took our order and got our drinks quickly.  She checked back periodically and refilled our drinks without having to be asked. The appetizer we selected was pot stickers, nice and crispy, yum. For our entrees we had sweet and sour chicken and beef broccoli. The food was really good, nice flavors and good portions but I heard the young guys on the staff say FUCK, SHIT and DAMN probably over 20 times each during our hour eating dinner.   The young men should realize diners may not care for all the curse words. I say my fair share of curse words but there is an appropriate time and place.  I'll probably do take out next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f4XaTJGGtRMdTcbuSB13jw"
  },
  "fFGSQJznsX8artZch7zKyA": {
    "date": "2/18/2018",
    "text": "This has always been my go-to Chinese takeout! The last time I ordered vegetable low mein, it had too many what I like to call \"fillers\" with big chunks of onion and cabbage when really, I want my noodles! Then again it is veggie based! That's why I order low mein because I love the noodles! There was barely any the last time I ordered. Of the two meat dishes we ordered, again, barely any meat. The beef and broccoli was mostly broccoli which is great but where's the beef?! I hate it when there's loads of onions, lettuce, bean sprouts (aka: filler) and not enough meat or noodles or what you truly want when you order. Autumn Court has always been my go-to for takeout Chinese because I find it healthier and not as greasy as some others, however, they need to provide more of the base of the meal. Still my favorite in Phx",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z4lGGEMGi1R4yf4f_OoTNA"
  },
  "8Z_AJEWr_UdSaNJLhKm_Ag": {
    "date": "6/13/2016",
    "text": "High quality food, no mystery meat here!  Super quick service too...I go for lunch very often and I always half my food in 10 minutes or less....less time than it takes to write this Yelp review.  Great lunch specials, very affordable prices, very cool location, nice bar, and they even have some pretty fancy music.  Some days it sounds like I walked into a spa and I'm waiting to get my massage and some days it sounds like I'm in a chinese club.  I'm not complaining, it's just kind of amusing.  But back to the food!  Love the fried rice and egg drop soup and their kung pao chicken is the best I've found in the Phoenix area.  You can't go wrong with this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CeJrUVRF6_pVf0I4rfNn4w",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. Best Kung pao chicken I&amp;#39;ve found in Phoenix!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CeJrUVRF6_pVf0I4rfNn4w/o.jpg"
      },
      {
        "img_id": "yJIRauaNu8U-oZvzk2PYhA",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. Pretty good egg drop soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yJIRauaNu8U-oZvzk2PYhA/o.jpg"
      }
    ],
    "user_id": "Oxy3zIHPvzwTLrT6ith6xw"
  },
  "tztGHGIFV2GveowAFsPxtQ": {
    "date": "7/26/2017",
    "text": "Some of the best Chinese around. I have tried all of there lunch specials and none disappoint. The Cashew Chicken and Ground Eggplant lunch specials are the best I have ever had and don't forget the Wonton soup, it's awesome.   Service is quick and done with a smile.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GvQGa5IXCC7kbryaR5WURg"
  },
  "kb2L8UfGYvFGA4__ZeH3lQ": {
    "date": "12/31/2017",
    "text": "I would consider it average chinese takeout. I ordered the General Tso's chicken and the crab rangoon and it was more than enough food- I definitely have leftovers. I'd order again if craving Chinese. Otherwise, I wouldn't go out of my way for it again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IlI8DOtiapdFGpAtIRr1oQ"
  },
  "fyVdhak19dlGH8qTIetgSg": {
    "date": "11/23/2017",
    "text": "Went away for Thanksgiving and all the places serving thanksgiving were $70+. Not being big turkey fans we broke tradition and came here. Best Chinese we had in years!!  Great food, fresh and superb service. Very glad we came here instead of turkey any day!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "voBdq1KPlmh2Mn0IRVnwLA"
  },
  "vGxKalMrK4UdYMxj5cbIsg": {
    "date": "8/19/2018",
    "text": "I had been on a hunt in Arizona ever since I moved here for a good Chinese restaurant. Well, I can say, I FINALLY found it! The food is absolutely hands down some of the best Chinese food I've had anywhere! A must go, and go back again, and again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Auh5vEi2f1R3qW7uvbi7Dw"
  },
  "C0NmeyC0fhbL3iglay7M2w": {
    "date": "2/23/2018",
    "text": "Excellent customer service every single time! Great ambiance! Great prices! The best in the Arcadia area!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NqveckHw7BG36d72ZcTxoQ"
  },
  "sLDbWdIYdCOzCUoUsLFujw": {
    "date": "3/15/2018",
    "text": "Amazing customer service and their food is amazing! There's never a wait time when you go in for a quick bite to eat for lunch and the vegetarian/vegan options are endless! Great restaurant in the heart of Arcadia!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yFOfJJKsX54cgwC41KFB6g"
  },
  "TDlfruRku5-WD8GtLLGOrQ": {
    "date": "12/25/2017",
    "text": "First time here and wanted authentic Chinese food which looks promising and they have us a coupon for our food taking longer! Very thoughtful, appreciate the kindness. The family restaurant is awesome and love the culture.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "LKF6rnO6e7636FEcqjVryA"
  },
  "_VOKC-Xst7VKaijs4f6tDw": {
    "date": "1/15/2017",
    "text": "This is difficult to give a rating to!  Delivery was sooner than what I expected!  Good!  My first bite into the scallops dish that I ordered had that sharp, metallic flavor that scallops can sometimes have, which was an immediate turnoff and a little scary....but I kept eating it.  The sharp taste was only in the first one.  Also, I guess i should remember that scallops are somewhat 'porous\" and will absorb flavors and colors from dishes in which they are combined so my scallops adopted a somewhat brownish cast.....tasted fine; looked funny.  The Mongolian Beef was delicious.  I love the beef used in Chinese food, and theirs was perhaps the best I've ever tasted in the Valley, and certainly the most tender.  The eggrolls are good sized and tasty....I hate it when egg rolls are so small they might be mistaken for someone's finger!  These were closer to what I was used to back home.  So, difficult to rate because some was good and some, not so much.  That first scallop just about put me off my meal!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "PwNanrk2sIOiAyYSRj-kYA"
  },
  "-OKHFyPwmJdPbku7BNH93g": {
    "date": "1/16/2018",
    "text": "Shout out to JJ who handled customer service as a professional. I may have been disappointed by my last encounter with Autumn Court, but today more than makes up for it. If you are looking for great Chinese food, look no further.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mj_cHNixBgkALBV6PhhHKQ"
  },
  "_VnDIds2fZT4z50J104adQ": {
    "date": "8/22/2018",
    "text": "Terrible delivery service and poor customer service. I would consider it theft. Basically kept the money, including a tip, for a large order for food never received. Food was ordered for delivery to a friends home. Paid for and tip included. Door was continually checked and no one was ever heard at the door. No call from Autumn Court to say they were there, or to say they had not been heard at the door. Called to inquire on delivery and my friend was told they were not heard at the door. Asked to please re deliver the food ( she is not that far from the establishment) and they refused and also said there would be no refund of her money. I find this to be horrible. I also do not see why they did not call HER to say they were there.  If they refuse to refund the money and admit they should have called to say the door not being answered I find it suspicious. Attempting to contact manager and owner as well as go thru credit card company for refund.  Must give a star due to yelps rules. They don't deserve it!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h1YyKedduAYs2Ks1KoU5rg"
  },
  "YMZEjM62wgbjT4xkAidFMg": {
    "date": "1/26/2018",
    "text": "terrific place, everything is fresh. So far I only dined at the restaurant, intend to try their take out soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k_Q1JoI1SpLSXz4D8Csr_w"
  },
  "K-UniAaACx6YhQUEFPgz1g": {
    "date": "3/17/2017",
    "text": "This place is so disgusting my dog wouldn't even eat it. $38 for 3 entree takeout? No wonder why the place is dead on Friday night. Sweet & sour shrimp in separate bowls? Cold White rice stuck together in a huge cube? Cmon. I'm tempted to drive back and get a refund. I mean, who even runs this place and checks the food?? DM me.  Never going back...never.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5phtJLYyWMYJP0LN8gkOnA"
  },
  "59gpsSEvhIWyQ8H8aEVELA": {
    "date": "2/15/2018",
    "text": "Great Aisan food and daily happy hour specials on drinks and bites! Cool bartender too. Local Fave!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CeLsYrU59hxsobrRAr7fgg",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. Lychee Martini, Crab Puffs and Long Island Iced Tea. All Happy Hour specials!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CeLsYrU59hxsobrRAr7fgg/o.jpg"
      }
    ],
    "user_id": "bCqLOo2ihAAjo2dgMTuNGQ"
  },
  "QBc_q4-iOaSo8VpChPeRQA": {
    "date": "11/21/2010",
    "text": "Absolutely terrible service. Ordered take out, showed up at the time they told us it would be ready. Sat at the bar for 20 minutes without a server or bartender asking us if we wanted a drink or talking to us at all. Over an hour after our food was supposed to be ready, the guy, supposedly the owner, comes up and hands us the bill. It was very overpriced. He didn't apologize and didn't explain why it took almost TWO HOURS to make 4 people's take out Chinese food.  The food was also terrible quality. On a scale of 1-10, 10 being the best, I'd give it a three at most. I had beef chop suey that had very little flavor, and my brothers both had chicken chow mein that had almost no noodles in them.  The staff was inconsiderate and there was no excuse for their tardiness, as there was maybe 5 other patrons in the restaurant.  There are many other good Chinese/Asian restaurants in the area, and needless to say, I will not be coming here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vncHI0PdoiXnrE74BQM_BQ"
  },
  "r3PzPwES2oshFWIM41uUsw": {
    "date": "1/23/2012",
    "text": "I absolutely LOVE Autumn Court, it is my go-to chinese take-out/delivery restaurant. Not just because it is only a block or two away from my home, but because it is the best. The food is delicious and pretty inexpensive, the portions are also very generous. We are addicted to he general Tso's chicken, and for $20 for two orders of it along with two containers of rice, it's enough to feed two and have enough leftover for another meal. Two of my other favorites are the honey crisp chicken and the orange peel chicken. The service is usually very fast for pickup it's usually ready in 15-20 mins and delivery no more than 30 mins(unless you order delivery on a sat/sun night then it can be an hour and a half  to two hours wait). Another bonus of getting takeout/delivery from here is that the entrees come in these reusable, microwavable containers, I order from here so often that I never have to buy tupperware lol.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "V2t_oLWYP1TPVdNQhk1L3Q"
  },
  "NpPvMhwHCRGc3QElprjfGg": {
    "date": "6/19/2013",
    "text": "I wanted to try a new Chinese place, and where I live there aren't many options that deliver.  I went with the Orange Peel Chicken and Crab Puffs.  $18 and change for the order.  The chicken tasted as though it were microwaved and was very soggy.  The crab puffs had absolutely no crab or even the flavor of it.  I ate the food and became very sick within 20 minutes of finishing.  Thank goodness I was working from home this day.  I will not be ordering from this place ever again.  Too bad...I was really hoping to find a good Chinese delivery place in the 85250 area.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PzgPxU8GMFxL9GUE98Bx_A"
  },
  "Jm0b9UVJcceTYT486Y-ymg": {
    "date": "7/28/2013",
    "text": "I love this restaurant. The food and service was great. The place was clean and relaxing. I had their house fried rice, kung pao beef, orange peel chicken, beef and green beans and loved everything. The sushi was excellent too. I would highly recommend this restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RY6pbFLZdqoffNGz0_hoZA"
  },
  "NjQuJmo-tMsf1GWROo_Bbg": {
    "date": "7/11/2012",
    "text": "My wife and I ordered take-out from here for dinner while we were in town over the weekend. We ordered the general tso's chicken, kung pao chicken, and two orders of chicken lo mein. The food was awful. The wontons were just fried wonton wrapers with absolutely nothing inside of them. The chicken is tough and rubery. The lo mein had no flavor, and everything labled \"spicy\" had absolutely no spice. To be honest I would have enjoyed eating frozen chinese food rather than wasting the money on this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9PWnpTnt7CF2XvOTTXMq-Q"
  },
  "fsPlYrFrCweJ2ItiYVkXzw": {
    "date": "11/8/2009",
    "text": "So, this place delivers soup...and soup is good when your sick, and the portions are large, I also went ahead and got my regular crab puffs and orange chicken. Simply delicious a definite improvement since the last time I ordered. The chicken still could of been a little more juicy but for the most part I would say this place has improved on the quality of food since the last time I ate there. The crab puffs were fat filled with cream cheese the crab still seemed to be lacking a bit, but definitely better then before. The service was as good as it could of been for delivery. I would say more like 3.5 stars. But I am feeling frisky today so I am going to give it 4 stars.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "DMHPVjHKaUStUBMPH2TjNA"
  },
  "F7dzCxhTol1czwC3_7x3BA": {
    "date": "1/24/2012",
    "text": "Definitely have had better! I ate here at the behest of some friends who told me Autumn Court has the advantage over Desert Jade down the street. Now, Desert Jade is like a second family room to me as I've been eating there since I was a wee one so it's hard to make a case for anything but their delicious food. I tried the Hong Kong Chow Mein with shrimp - generous portion of shrimp served over pretty lackluster chow mein noodles. The tea was weak. The potstickers were  actually quite good. Overall though, Autumn Court doesn't have the same powerful flavors (and lovely memories) as Desert Jade.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "uZV0neUr5NefvU4o3NZBPw"
  },
  "ldyAjoPplWhWaXGQsSWjdA": {
    "date": "4/10/2009",
    "text": "Really tasty food.  Very good service.  This place is an asset to the neighborhood.  I'm just mad at myself for not going earlier.  Very reasonable prices.  I'm looking forward to trying more items from the menu here.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "YIJ45O13upuQactfu6U7-w"
  },
  "X1vAX8M9_2imfjCoHT2HfA": {
    "date": "1/21/2010",
    "text": "I LOVE Autumn Court...The food..the atmosphere...the location...the service!  I seldom go to other asian restaurants, but when I do, I compare them to Autumn Court.  This one is still my favorite.  I don't like greasy, saucy chinese food at all so when this restaurant moved to my neighborhood I was so delighted by the fresh and nicely presented food and the prices are very fair here.  It's nice and dim in there at night, with cute little accents here and there..not your usual garish accesssories.  The owner/manager is always there and very very nice and attentive. They do take out, but if you do it, CALL your order in.  If you just SHOW UP and order take out, then you will be waiting and waiting--not because they are slow, because they are the most popular asian restaurant around and their food is awesome!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "sXyo5KlIrOE0OMHhL9mKVg"
  },
  "OJ8SxuH0MOsAW43QQnsUJg": {
    "date": "10/16/2006",
    "text": "This has become one of my favorite chinese spots. Unlike the post before, my favorite dish here happens to be the eggplant. I also think the lo mein and the orange beef are quite tasty. The service can leave a bit to be desired sometimes, but I, and everyone I have brought there have rarely been dissapointed by the food.  As for the ambience, for a small restaurant in Phoenix to actually being located in a free standing building and not in a stripmall is already a huge plus. I have seen this space go through several different incarnations and they seem to have done pretty good with what they had without breaking the bank...definitley not swank, but decor is not why you come here.  Now if you want REALLY bad service,  go to my absolute favorite Thai joint in the same shopping center, Thai Lahnai. Then you can really get mistreated! (but the traditional fare is perfect!)",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "z9xFVXRJozxdteoIY8yBtA"
  },
  "OFLhM0DCj23ADIuFpcVy1g": {
    "date": "4/26/2009",
    "text": "I've only been once for lunch, but thought it was pretty good Chinese for Phoenix.  The service was also excellent on my visit and I didn't have to wait for a table or wait a long time to be served (as someone else did).",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "XW5CqPe2kKuxGM2gYxQmug"
  },
  "iyEjqtZMu7A3xZaXgGl92Q": {
    "date": "4/10/2010",
    "text": "first of all yeah it is a bit pricey 42 bucks for two people but hey we can eat   we had  walnut shirmp- omg fuckin fab soooooo gooood huge shirmp great sauce nice walnuts fresh broccoli pepper steak- one word goooooood crab puffs- very good perfectly cooked fried rice- gooood sizzling rice soup - wow thats all i can say  and i wish i could give them another star for super fast delivery and awesome containers the food comes in i have never seen that before you can actually resuse these   very goood i will come back",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ctJgtv8BxvphYHXmLyGdiA"
  },
  "sJEyW8saa7YNWkHzrWotcg": {
    "date": "2/17/2009",
    "text": "The Wor Wonton Soup comes in a big container and has a flavorful broth, crisp veggies, lots of wontons and meat.  It is great with chili sauce in it.  I've heard the Peking Duck is great, but have yet to try it.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Fh97GNspTl_BgDdM6eMDUw"
  },
  "QGlyeASkeMl0k4IM8rriWg": {
    "date": "11/29/2010",
    "text": "I went there for the first time tonight with a friend. The food was delicious and the service was great. I will definitely return here again. Also the prices are reasonable.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Sb5ZNDTdDMfFuen7Yv08w"
  },
  "fvdD0t87BWs1iUXmylL_7Q": {
    "date": "6/23/2009",
    "text": "It's not bad.  I mean we do eat there when we just want a quick grab that is near home.  But I havent really gotten anything that I have fallen in love with, and I think that it is a bit pricey for what the food is.  But the staff is really nice.  And food is really quick.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2zOXdbLjhFkcXSqpyhYBnQ"
  },
  "-B2xWo2kvdB5VOyhiv8OlA": {
    "date": "9/26/2014",
    "text": "I absolutely love this restaurant when the owners aren't around.  I've been ordering from them for YEARS! The gentlemen that delivers my food has always been gracious and polite.  In fact, every time I've dealt with the staff it's been pleasant.  HOWEVER, every single time I've called during lunch hours and the owners are present, I'm given a hard time.  Today when I called for a delivery order, I heard the lady (owner) in the background yelling at the kid that took my order while I was on hold.  My order was $2 short of the minimum delivery amount.  The kid was told to tell me my location is too far away.  \"Tell them to just come pick it up!\" she yelled at him, all the while I'm on the phone listening to her scream at him.  This has happened before and quite honestly, the owner should learn some manners and personal awareness.  The poor kid nervously apologized to me as I decided to cancel my order.  Thanks anyway!!! The owner should understand that this city is flooded with Chinese restaurants and be grateful she has such a great staff.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "smXo_V2LmQJlTgv_KXs3aw"
  },
  "f5Z4iTcRVtZUBpOd28XsCg": {
    "date": "8/19/2011",
    "text": "I had food delivered. The man on the phone was nice, but barley understood me. The food was bland. sauce was runny. Lots of food, but not worth the money.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8IDLUb6auOC4JQ72ZsEShg"
  },
  "maYGJ6jXc6x-0mMohJUu0w": {
    "date": "7/27/2011",
    "text": "Not really memorable but, good dependable Chinese food. I like the space too.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hbe6i_ApQyyseIL74teSTA"
  },
  "5oI-h9e70hl4Dymsbs_IEQ": {
    "date": "3/26/2010",
    "text": "So after yesterday's horrendous Chinese food fiasco at Chop & Wok, my Chinese food craving still had not been sated. One of my *insert social networking site here* buddies suggested I try this place. He swears by it. So I got home, ready to sit down to a bowl of my spicy vegetable stew, when I get a wild hare (hair??).... Whatever. I get the urge for Chinese food. So I call these guys up for some delivery (I had just put on my pj's and fuzzy slippers...that's the international code for 'Tyger will NOT be leaving the building'.) Anyway, I ordered the Singapore Noodles and crab puffs. The delivery guy showed up about 20 minutes later. Alright Autumn Court, you are on my good side, and you now have my full attention. I open up the paper bag holding my nummy morsels. And the heavens opened up, a golden light poured out, angels sang halleluia, I think I may have gotten chills...inside that brown paper sack, the staff of Autumn Court had individually wrapped every single spillable item securely in plastic wrap. I was so happy I could've humped his leg, right then and there. The food was fresh and well prepared, the shrimp was large and in charge, not much seasoning on it as it's a delicately flavored dish, but still very tasty. The crab rangoon...um...crab puffs were yummy and crispy, not bloated or soggy (see review of Chop & Wok) I will definitely order from Autumn Court again! Yay! Hooray for delicious Chinese delivery in my 'hood!!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "mzHRaYLoV-lwX79HghP6lw"
  },
  "W4sbhfyz34EQPn3ayZsZsQ": {
    "date": "6/20/2008",
    "text": "This place is now in my 'hood after my recent move to East Phoenix and I kept meaning to try it out but just didn't get around to it until I spotted my Yelp friends' high recommendations, and of course they were right - this place rocks. The Lemon Pepper Shrimp was so delicious (and yes, they have brown rice). We also ordered the hot n sour soup, which - vegetarians beware - is generously filled with not just tofu, but shrimp and pork as well. Not a pork eater myself, I'll have to take my cohort's word for it that it was equally delicious. Meals were reasonably priced, especially the chef's specials. Service was fine - quite attentive, actually. Atmosphere was interesting - nothing to rave about, but we happened to be there as the sun was setting, and the place seemed to take on a bit of a cooler vibe the darker it got. Enough so that we took our time finishing up our Sake Bombers and just hung out for a while. Oh yeah, we'll be back.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "6I1KT1SCGbAaTzTIMqF_eQ"
  },
  "P6jooD2ahD67mfjye57OFQ": {
    "date": "7/8/2008",
    "text": "Love this place. The owner is very friendly and food is good. Be sure to check out their happy hour sushi menu 'cause it's inexpensive!  The crunchy roll is my favorite.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "nXMMoDzXRByQiWH9cf-FAQ"
  },
  "86WGp-Y_cfnW_2Oxb82Cbg": {
    "date": "8/3/2011",
    "text": "the sushi is not worth it. it just tastes old and crusty.  the americanized chinese version of sweet and sour and kung pao are worth trying here!",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "9YRFLVFVbHGAJ1weFx5zqw"
  },
  "zFjJD3gA8rYGRfV0166ciw": {
    "date": "11/18/2008",
    "text": "I'm not a very adventurous person when it comes to food.  I will never surprise you and get something different when going to a familiar haunt.  So when the hubby suggested Autumn Court I was a little reluctant.    We venture out and are seated right away.  I immediately notice the cologne on the gentleman seating us.  Turns out he will also be our waiter.  J ordered the sizzling rice soup, we shared an order of BBQ pork and potstickers and I ordered the brocolli beef.  BBQ pork was done perfectly it is/was AMAZING.  J loved his soup.  It was filled with chicken and shrimp and tons of veggies.  He loaded it up with chili paste and a dash or two of soy sauce and I didn't hear a peep out of him for a good ten minutes while he enjoyed.    It's good.  Real good.  My beef was good.  I love veggies and the brocolli was perfect.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "omo7iYLYh_V9xVCc8Ic9JQ"
  },
  "F9mYsWg3h6-rhCIy9KI7Fg": {
    "date": "12/4/2014",
    "text": "We ordered over $40 of food on Thanksgiving and were very disappointed in numerous ways. The food took over an hour and a half to arrive. No big deal, they were busy. But, our food was not only cold and the soda watered down because the ice had melted but we received no serving ware and even after reheating, the food did not taste good. We called and were told that we would have a credit for our next order. We felt that was fair. Today we called to order food and guess what? No record of the issue. The woman that we spoke to asked numerous questions (not unexpected) but instead of simply replacing the order, she said she had to make some calls. Strike three. My wife and I have both worked in the restaurant business for many years and understand that there are people that complain for no reason. But, after all the information and explanation my wife went through over the phone, to be told \"sorry, can't help you\" was too much. I hope this review not only helps other diners decide whether or not to patronize this restaurant but also helps the restaurant understand the value of being given a second chance and blowing it. UPDATE. We have received a call back from the restaurant and they are working to make this issue good. Although it should not have been this difficult, kudos to them for following up. Update #2: Wow. I am updating this as I eat. We called today and our order was replaced. My expectations were not very high. We were actually delivered the wrong order. The reaction of the manager who answered when we called to tell them was very empathetic and apologetic. Our food was here within five minutes. The food, is delicious!! Obviously freshly steamed vegetables, moist, tasty rice, fresh beef and chicken. Even with the \"of all times\" delivery mistake, we are very happy with the resolution to the issue. I am changing my rating to reflect the effort put in to make us happy customers.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uxX3hsYS83DNvmKw7OXADA"
  },
  "UbWKd2wMZtiKitAha3HRSA": {
    "date": "9/13/2014",
    "text": "I can't say I agree that the food is good. This was the first time we tried this place. The cost versus the quality doesn't match up. Can't say I'll ever order from here again. And the people on the phone seemed confused at best. I was on hold for 3 minutes and never told how long my food would take. Very disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bkqN5WWUGbV5VzYg403Zpw"
  },
  "riZwmyeJlQ2dIepIuVnDcg": {
    "date": "6/30/2014",
    "text": "Beautiful restaurant, superior waitstaff, fair price and VERY nicely prepared curry, rolls and H/S soup. they are conservative with salt so a dash of soy puts it together for my taste. Actually a nice way to serve Chinese! A new favorite for me!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_vfdwM1x4xKb9D-wzyDNPw"
  },
  "TqqWLqhbFogKewccG2MJLw": {
    "date": "4/16/2009",
    "text": "I got take out from here tonight and it was good. Not amazing, but good enough for what it was. $20 fed three of us with leftovers. Their white rice was a bit sticky, but the friend rice was num-num.  Is it sad that I was most impressed with their to-go boxes? They're made of sturdy tupperware quality plastic and you can microwave them and re-use them.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "XiqziC8skzXUSc0UdNNdAA"
  },
  "QGIYqKK_zqBR5jXpSNswrw": {
    "date": "8/14/2011",
    "text": "The best sweet and sour soup ever!  Food is delicious and favorable.  Delivery is pretty good, nice people.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "e9-a2Cg1iz8tKTD5zPgA3g"
  },
  "PC4R0s1BmyO6kQ3dJ0pdQA": {
    "date": "6/2/2012",
    "text": "I have never gotten take out from this place and have eaten in only a few times. The food is nothing special but it's not bad either. The service is good, so friendly and they kept checking in on us to make sure everything was ok and see if we needed anything. It's not my first choice I will be honest (however, one of my favorite Chinese places is down the street so to be fair they have some pretty steep competition in the neighborhood) but it is pretty good none-the-less.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UlSNealkwU8pieWYixlp4g"
  },
  "iuioHmPuPWak-rzR-VIBnw": {
    "date": "1/6/2012",
    "text": "\"Sizzling rice soup is the only thing that sizzles\"  Went here for lunch with my wife and mother-in-law because we were in the mood for Chinese food.  Although it was our first time, it may be our last time as well.  I ordered the Kung Pao chicken which as filled with thick sauce which did blend the chicken and vegetable together, but more like made everything taste the same.  My wife had the eggplant chicken which I think tasted the same as the Kung Pao chicken as well.  Should have called it Kung Pao eggplant chicken.  The dinning room is similar to that of a lodge converted to restaurant.  I did order the sizzling rice soup which was good, but there wasn't enough soup as the rice soaked it all up.  Price was a little high for portion sizes I thought.  Although the owner was very nice and cordial that is the reason I gave this 2 stars.  There is very little authenticity to the restaurant as the ROA is a dismal 10%, ratio of authenticity is #of ethnic patrons/#total patrons.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EzOF8RLzbcsA9EwMYlUfsg"
  },
  "yF920saWvpc09gVw8o_WPQ": {
    "date": "9/18/2010",
    "text": "I love this place. This is actually a chinese sushi bar and not japanese. They have chinese food, but they also have sushi.  The owner is very friendly and food is good. Be sure to check out their happy hour sushi menu 'cause it's inexpensive! The crunchy roll is my favorite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q-TwGd8CLt673rwmMIksOA"
  },
  "a3BjE-9QMKguDbl_230xCw": {
    "date": "12/21/2011",
    "text": "This place is just A-OK!  I have been there twice, the first time I had the sushi, which was not bad if you are in a pinch for sushi and the second time I had their lunch special which was pretty good.  The portion for lunch looks small but is surprisingly enough when you are finished eating.  The service can get a little better but other than that it gets 3 stars in my book!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-eBkx1Hl2A40GZAaZvXR1Q"
  },
  "Ij0SYB7MOioaobRn9OwvUg": {
    "date": "12/12/2010",
    "text": "Never, never, never going here again...  Hearing complaining about tips is a HUGE turn off in my book. Upon entering Autumn Court the server/bartender was complaining to a man sitting at the bar that the last customers that she served did not leave her a tip. (To be honest, I would have considered stiffing her too after these comments.) She then had the audacity to ask the customer if she should go out and ask them for one! This is all while we were waiting to be seated. The customer said \"I wouldn't\" and she made a dash for the side door heading to the parking lot. The customer turned to us and said he had never seen anything like that before. Wait...there's more. We turned around and left to find a different place to eat and I made a call to the manager to let him know what had happened. He listened, but offered no resolution and took my information to pass to the owner. Five minutes later my cell phone starts ringing and it is the server (seriously!?) we called about asking why we thought it was not right that she did that and told me that she had the RIGHT to tips because she was not paid hourly. I briefly spoke to her about the rudeness of speaking to customers about other customers and all she could say was that she would not get fired over this. Babe, if were my restaurant you would have totally have been gone for this. Tomorrow I'll try and contact the owner direct because we are never going there again and my phone number should not have been passed out like that. Time to find another neighborhood Chinese restaurant.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "OXi3OX-z8fAklsVasX4iFA"
  },
  "0KcpMsh4QRHNNrxxzhGGfw": {
    "date": "9/5/2011",
    "text": "Went for lunch. Hardly anyone in the place. Service was fine and food was \"ok\". Not that I needed more but i thought portions were a little small. Had lunch specials but not a lot too choose from. My quest continues.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y5KeNIFmsEYqbjworiuuaw"
  },
  "YhCYugPrhEFereQkPr3wsw": {
    "date": "1/20/2011",
    "text": "I love this place!  I live down the street, so it's very convenient, but I would stop by even if it wasn't so close.  The owner is always so friendly and makes us feel very welcome.  The food is probably my favorite Chinese food in the Valley.  I typically don't like Chinese food, as it always seems to be fried chicken suspended in some kind of bizarre gelatin concoction (P.F. Chang's, Pei Wei, Panda Express, etc.), but this place has fresh vegetables, good meat, and excellent spices.  Ask for your dish SPICY, and make sure to get the egg rolls!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "z1ET6lJtsg56aawUdQdusg"
  },
  "kmwNG5LZSHFmveg6wYYdrw": {
    "date": "5/25/2011",
    "text": "UUGH!! What a dissapointment!!  The manager/waiter/owner/whatever was sooooo nice and the interior felt right somehow.  then the hot and sour soup came out and it was filled with goodies.  Yum!  So everything went straight downhill from there. I ordered the chicken and shrimp Kung Pao extra hot and spicy.   I got almost no spice or heat at ALL. Then the sauce had an odd ,almost lumpy texture.  The shrimp were beautifully cooked and plump (all three of them) but you could tell that they had been added to some leftover, reheated chicken Kung Pao with the worlds smallest shreds of chicken. Even the vegetables were teeny tiny shreds.   I am NOT KIDDING when I say that the peanuts were bigger.  The brown rice I asked for was delicious.  The Lo Mein was the worst  I have ever tasted.  Gluey, cold, old, bland, spiceless and frankly, gross. I never, ever, EVER leave food on my plate, but this just wasn't worth eating much of it. My companion ordered the Moo Goo Gai Pan.  Oh, YUCK! Enough said.  Two stars for the man at the door and the hot and sour soup and maybe one of those ginger vodka martinis if I ever go back and get one. Oh, and some crazy person said get the egg rolls?  It was BURNT. No thanks.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "F0Oco8PiWbkM3INpbIh1Pw"
  },
  "FA8vaDA4uksfDUO1rxkp0A": {
    "date": "8/23/2013",
    "text": "Greatest Chinese food in the State. I'm Chinese. Don't question my authority. Bar, good service, great food, what more do you want?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1rC_8DfF8Hy0ycsdHBsH1g"
  },
  "9vDv3eOQ86B33yueNzXRxg": {
    "date": "8/22/2010",
    "text": "I've eaten here a few times and this is definitely the best Chinese food in Phoenix - - I always get the lemon chicken and I am never disappointed. It's a bit pricey for Chinese food but the portions are generous. The only down side is that this place is not very kid-friendly - they don't have a kids menu which I found to be disappointing. They also serve sushi here and their potstickers and egg rolls are delicious.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "_--dEbY0r67cKwNOtqAaWA"
  },
  "B54-kg3jDfK0PVcJLEyzLQ": {
    "date": "12/25/2008",
    "text": "So, going on Christmas, always a risk. There was a wait and 2 parties in front of my group left. There we people waiting for their pick up order for over 20 minutes. But when we asked how long it would be until we got sat and would have our food we were told 15 minutes. He was True to his word on that.    The food was good. The egg rolls were awesome. We didn't really have a waiter tending to us, but that was ok. the bus person got us more water when we asked. I would probably go here again if I was in the area, but I would just as soon have the Panda.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rWW1RvAENOu_GetMQNCttg"
  },
  "R6qmn9La1LVT5ZfnznuRPw": {
    "date": "3/4/2010",
    "text": "I visit Autumn Court at least once every other week, usually on Fridays. The happy hour is great and my husband loves the Pad Thai! Service is wonderful and our favorite bartender is one that we can call a friend! This is one place everyone has to try at least once.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "VnUl1997sciKOj4nUE37Zg"
  },
  "H71s2M8eIkkUybhrSy632g": {
    "date": "6/26/2018",
    "text": "First one star review in awhile.  Got takeout last night and service was good but all three dishes were inedible due to oversalting. It was as if they mistook salt for sugar or something.  The mapo tofu was the worst followed by the sauce on the braised eggplant.  The Mongolian beef was the best off at just plain salty.  I usually like food saltier but this was horrific.  We threw it out.  One and done for me.  Stay away!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y7NaaCb4AkNjpdHVLuPCaQ"
  },
  "IoWbq1hmdjPZM3CZQkbyHw": {
    "date": "11/26/2017",
    "text": "Ordered food through Grub Hub that was not delivered with an excuse of \"we had a False delivery message sent\" and Autumn Court's only response is \"call Grub Hub\".",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "1VPMoN_N6WFRa4sdO1gpfQ"
  },
  "DLyu2GYoIN2IkFN0Kgo0rA": {
    "date": "12/18/2017",
    "text": "Should have read the reviews about delivery. DO NOT ORDER DELIVERY HERE!  I got home on a sunday evening a little bit hangry and SPECIFICALLY ordered from this place because it was 8:50 and they didnt close until 10 (I'm not the kinda guy to order from a place 10 minutes before they close. They give me a delivery time of 9:47.  I wait and wait and wait. Finally at 10:06 i get a notification that the food is marked as \"delivered.\"  wut.  tried reaching out to the restaurant but no one answered.    So yeah. I can't speak to the food, but the delivery service non existent in my eyes.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rc8vqPj3UJ-lw8nvoYTLNg"
  },
  "_Tz0EUU5zGNK3_QOjcZ8rQ": {
    "date": "7/19/2018",
    "text": "I had dinner at Autumn Court Chinese Restaurant during my last visit to Phoenix. Their food is just delicious! If you get lucky and meet the owners of the restaurant, they are so welcoming. The vibe of the place is also really nice. You can't miss the walnut shrimps. I would come back to this restaurant everytime I visit Phoenix.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bQP1ZEf96ZCM0e3LOJA0Lg"
  },
  "WHIKEx_8faIEAryuMjHAxw": {
    "date": "1/27/2018",
    "text": "What I enjoyed about Autumn court was the vegetarian options. The atmosphere is very cool and clean (I like the design/layout). The staff was very nice and timely.   I have had great experience and have decided to bring my whole family here soon. Give it a try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9tstCnYfZ7XbdwpakAKLag"
  },
  "jKMEgTs3bHjkYUuPWTkH4w": {
    "date": "7/19/2018",
    "text": "I was really craving Chinese food found these guys online, I was not disappointed. Everyone was so friendly, sit at the bar if you can, Carla the bartender was so welcoming. They have a fantastic beer list too, I am definitely coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AkaYuEllkz_zMXWmAbVy3Q"
  },
  "MWwcB_ON6SLbGDyN5oPZog": {
    "date": "7/18/2018",
    "text": "Came here for a mead pairing event and was not disappointed. I liked the vibe inside - chill and casual. I tried the crab puffs, barbecue pork, and spicy house lo mein. All of it was really good, but I especially liked the pork. It's exactly the kind of food you want when you think of classic Chinese food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kWs-0RRGVMVo6dU50a4xDg"
  },
  "2SHg9x75hL6YWtlgUBhlqQ": {
    "date": "7/30/2018",
    "text": "I've seen Autumn Court on UberEats in the past but hadn't had a chance to go there until recently. I was there for the Superstition Meadery pairing event where I was able to sample select meads paired with 3 different courses.   From the outside, I assumed they'd be like an old mom-and-pop Chinese restaurant. It's a nondescript standalone building with simple Chinese red lanterns hanging near the entrance. But on entering, I saw it's a pretty cozy location with a large bar in the center. It's far nicer than most local Chinese restaurants with wood/stone decor, wood floors, and well-lit, and decorated with care.   In terms of food, options include standard Chinese restaurant items (Chow Mein, Egg Rolls, etc.) and Sushi as well. Despite this, the quality is high, a good quantity, and dishes include a good amount of their prize ingredients (House Special Lo Mein does not skimp on the shrimp). I did not get to try their sushi unfortunately.   Their bar is stocked with a fine selection of craft beers, and even meads. Delish!   Service was very quick and efficient. Upon entering a waiter immediately greeted me and seated me. They were attentive, and quick to fulfill drinks/take orders.   The drive is about 20-25 minutes depending on traffic from where I live in South Tempe. But the quality of the food and variety of great drinks makes me interested in coming back for more. The owner's son also noted that they have other tasting events in the future for Japanese sake, and different kinds of East Asian beers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qMmXXUqanrZSa67uPA6vNg"
  },
  "5cjuOmZKtkctjRpEPGfbVg": {
    "date": "7/29/2018",
    "text": "1st time trying and I got walnut shrimp with fried rice. It was amazing my new favorite place !!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y1S9ZNu__ckkZdjyUViWlg"
  },
  "S_qYlBTAkE3dyzksicH1GA": {
    "date": "2/10/2019",
    "text": "We've had good experiences with Autumn Court in the past. However, today we got put on hold for over 40 minutes to place an order and the only way we got through was calling on a different phone to tell them we had been on hold for so long. Once they finally answered they told us to call Uber eats instead. Looks like we will need to find a new Chinese restaurant with better customer service",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dtWNN9ucIkBijFxBjh2q2w"
  },
  "JkQbQqxUSIUArqGyTY3KFQ": {
    "date": "1/1/2019",
    "text": "If your looking for quality Chinese food I would go somewhere else. The spicy mustard was the best thing we ordered. Hard to screw that up. Also the sweet and sour sauce was decent.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EwJ_xTZS9ztNz6QZr-Tj9Q"
  },
  "3NgBWy1xvC4GvjUrH1nT2A": {
    "date": "7/22/2018",
    "text": "I enjoyed pretty much everything I tried here, but the lemon pepper shrimp dish was my favorite! The taste was spot on and the staff were kind and lovely people. The atmosphere was really calm, which stood out to me. I like that peaceful feeling to balance out a rush-rush-rush day. I haven't tried their take out service, but I am usually a sit down kind of person anyway.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-c7dQQ8n2dnQg1W4rAaj-A"
  },
  "y3J_wR0rQEEeheI1bZtBVg": {
    "date": "7/20/2018",
    "text": "Autumn Court has always been a great place, but over the past year they've gotten so much better!!  New menu items, new specials and their delivery game is on point!  The food is great and the price is even better!  Their appetizers are my absolute favorite. Every time I eat here every employee treats our table quickly and with a smile.  By far my favorite Asian food restaurant in the valley.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZU47ZxOHRPLR0-aYUm_-3w"
  },
  "p2KVW77WtmAqYu-gyH0u_A": {
    "date": "7/13/2018",
    "text": "We love that it's Family owned-employees are very clean & friendly and the food is ALWAYS AWESOME!!!  We have several favorite dishes here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oVYJKn6mrvFhug9dbFjfpg"
  },
  "u9UYfuO1T-KlMzDMwxJ47w": {
    "date": "11/26/2018",
    "text": "Haven't been for a long time & ordered something to go as not many places where open on a holiday. First off, the place was in horrible condition & sur- prised how it passes any health inspections. 2nd the food was average at best. Finally someone took the liberty to add a large tip on a to go item which my credit card quickly reversed. Needless to say, I won't be going back...ps I got a craving for good Chinese & went to China Chili which I would totally recommend; always clean & 50% less than above!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3lUEQb9TIxOeAUtvgh7p8w"
  },
  "hA2vlnALEiP8OJtPSe2Qew": {
    "date": "9/7/2017",
    "text": "I have been going to this restaurant since before their old one in Central Phoenix burned down... This is my go to comfort food for Phoenix.  The restaurant is comfy, service is quick, all food is so yummy and to date I haven't tried anything I disliked.  Their drink specials are quite phenomenal and that check-in special makes my heart happy.  On those days when I am binge watching my favorite tv show... the delivery comes fast and the food is always hot.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ONkvEOAKc5thWgR4cPDxMQ"
  },
  "wKi6hiR2nSwtgEl6ArqV_g": {
    "date": "11/16/2016",
    "text": "I hate leaving this place a two star review because the food is so delicious. Unfortunately the service was the worst I've ever experienced. Before I dive into that I will say take out is a 5 star review. If you like your Chinese food New York Style loaded in sauce, this is your place.  The entire service start to finish only kept getting worse. We had 4 different people not sure which one was our waiter. I ordered a mixed drink of the menu and the guy had no clue what I was ordering and said he never heard of it. I had to explain and show him the menu. The forgot to bring rice three times after asking a new person brought it out. They forgot a entree and all of our egg rolls. In our party of 6 all the food came out separate.   I requested a drink refill twice and had to go to bar to order a drink and pay separately. It was horrible.   The bartender is great and if I go back to dine in I will definitely be sitting at the bar.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jf9K79I609BV_mKxqMiEXQ",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. Lettuce wraps!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jf9K79I609BV_mKxqMiEXQ/o.jpg"
      },
      {
        "img_id": "NGxRc3yHY7wQpmd2d4DhWQ",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. Sesame chicken.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NGxRc3yHY7wQpmd2d4DhWQ/o.jpg"
      }
    ],
    "user_id": "GAfzhCuexgDRcrZQNfQT8A"
  },
  "cQIrP7A-7N-p3Kinej5awg": {
    "date": "10/19/2017",
    "text": "Great and reasonably priced Chinese in the valley. I've ate here several times and the service has always been top notch and food always fresh! I've had several dishes here the latest being cashew chicken and everything was cooked perfect with flavor.   Their bar and bartenders are friendly and not scared to mix you a good drink (try the scorpion) and offer full service. The staff came by often to check the table and make sure everything was okay.   Great place to eat, if you get a chance stop in.   They also have good lunch specials!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sOCuf-jZo43DUzWTDKiR9w"
  },
  "7quFB01xmYDDHbAbtM0L1Q": {
    "date": "5/5/2018",
    "text": "Ordered delivery.  Arrived on time and order was complete, and hot. The kong pow chicken was well wrapped to prevent spilling. The fried rice was moist and had a mild flavor. The crab wontons were a tad bland the egg roll was average but good. The vegetable tempura was terrible, all the brockley was burnt, the zucchini and eggplant was soggy, the green beans were the only eatable part, but the batter was flavorless, save a oily taste typical of expenses fryer greese that had not been changed in a while. The kong pow was spicy and decent - but had a very different flavor, more like a Thai chili sauce than kong pow. -- overall average, just do not order fried stuff.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4nFAqlAy0rdMSmAKALHzJA"
  },
  "zWqQHBFk5NdRA8xsS8ZLVg": {
    "date": "4/3/2018",
    "text": "Hey there last month the food was okay nothing great but nothing bad either.  It's a decent place to stop and have lunch.  I saw a lot of people around the bar drinking too so it seems kind of a hangout for others",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NpgQUpPyaPiKqu8mlJFW1A"
  },
  "VD1KqEHb-wbjSaGAwCDnKw": {
    "date": "8/18/2015",
    "text": "I hate leaving negative reviews and I'm all for family businesses but I feel it's necessary.    Starting with drinks I asked for water with lemon and I received 1/4 of a lemon wedge that consisted of 80% peel and very little actual citrus. I hate it when restaurants try to save a few pennies by being cheap and skimping on the smaller details.   My hot and sour soup was watered down consisting of two strings of vegetables and cube of tofu and was rather vinegary.   Ordered sweet and sour chicken and the orange chicken and crunch rolls. I favored the sweet and sour chicken over the Orange. The food was not the best but pretty good.  About fifteen minutes into our meal I see a cockroach making its way across the table next to my 1yr old daughter's plate. I freak out immediately and pick up my daughter and get up from the table. I was immediately done and ready to leave.  Food was good but i don't think I could find it in me to make another trip back",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "raPxmM7fd-q40f1bZ_8_2w"
  },
  "En1FgK4KEvm-NLVdvg6XVA": {
    "date": "1/23/2017",
    "text": "I ordered three egg rolls and the sweet and sour chicken with fried rice. I could barely eat one because it was so doughey, unflavored and had hardly any filling. The sweet and sour chicken isn't bad, but I'd much rather have ordered from pho Tempe.... and their ratings are worse! However, their food is much better.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QrsZFTbIS8bRQcX-v2UHBQ",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. Sweet and sour chicken with fried rice",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QrsZFTbIS8bRQcX-v2UHBQ/o.jpg"
      },
      {
        "img_id": "8yBfxoHMJIBIV8m-lx2EOQ",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. Egg rolls to go on my own plate",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8yBfxoHMJIBIV8m-lx2EOQ/o.jpg"
      }
    ],
    "user_id": "itbNfkDBCbRyXw5fvMABjw"
  },
  "fzPbUnIFHU-UR916NZjS8g": {
    "date": "11/24/2015",
    "text": "Terrible. Go to King Wongs up the street much better service and food. Not as nice on the inside but food is edible. Told the long haired bartender I wasn't happy with the food and he said 'sorry to Hear that' and didn't even try to remedy the situation. Autumn Court, #notevenonce",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3mNKO7UoH1zGSoa9uhEz2w"
  },
  "y8rDwIjj9hpDHvRlr22Lfg": {
    "date": "4/16/2017",
    "text": "I've ordered delivery through Uber Eats from here in the past and it was perfect. They offer a lot of food for the price and everything tasted great. I ordered recently however and didn't end up with the fried wonton that I ordered (which is $5 by the way). So I called and all I wanted to know was whether they forgot to put it in my bag or if uber lost it somehow. The guy who answered asked me if I was calling him a liar and then hung up on me. It was the rudest phone call ever. I called back and asked if the manager was around and the same guy answered and said \"no the manager isn't around why do you think I'd be able to talk to you like this?\" I honestly was in shock. I sent a simple message to UberEATS and was refunded the money within hours but I will never ever order from this place ever again. The food isn't worth the disrespectful \"service\" that I received.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TiGuWj_zBTHj0dBHqMVZHA"
  },
  "D1zp_hklrhvLBLr4TXKXZQ": {
    "date": "4/9/2017",
    "text": "My boyfriend and I ordered takeout from this restaurant and were really disappointed. When calling to order our food, the guy on the phone didn't give us the total (no big deal we figured it couldn't be that much since we were looking at the prices on the website). After picking up the food we went home to eat. We found the chicken in containers with the sauce on the side (weird) but we were still willing to give it a chance. The chicken was dry and cold. The fried rice was also cold and tasted like it came out of a frozen bag. My boyfriend got sushi which was OK but still not great. The food is definitely not worth it for the price ($38 for 2 people). Not going to be coming back anytime soon.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nbxmFQTDqtD-PhGeo_-ivQ"
  },
  "2ZBYBGgtchpEYQBadbzGew": {
    "date": "1/23/2017",
    "text": "We got delivery and the food was great and the delivery was on schedule.  For a \"Netflix and chill\" kind of night this is a great spot to get food from.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5RBbHdiF1ZFNAtshfxyUlA"
  },
  "kcBXGx_WEAMVTAbYTSczfQ": {
    "date": "10/25/2015",
    "text": "I consider this the best Chinese food restaurant in town. Great fresh food and the service is always great. Definitely recommend you try it for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HQJWz7YcVg2Ac4i1u8RKZg"
  },
  "7FFSaQQJPocJBn6Z9mYgOw": {
    "date": "2/11/2015",
    "text": "I have learned to ignore the good reviews here and focus on the negatives.  Good restaurants don't have significant criticism, the poor reviews usually have to do with something other than the quality and flavor of the food.   This is a review of a bad restaurant.  How this restaurant could get good reviews for their food is beyond me.  It is flavorless and exceedingly sweet, like a cup of sugar on each dish sweet.  Even the hot and sour soup is sugary sweet.      The egg rolls are the worst kind, thick wrappers  that turn flabby and tough the minute they start to cool, and filled with flavorless cabbage.   Straight to the trash for these inedible little nasties.     The sesame chicken is a plate full of soggy stringy chicken bits served with the sugar/soy sauce on the side.  I suppose the gratuitous presence of 6 or 7 sesame seeds floating on that dark oily surface of the sauce gives the dish its name.  They should more appropriately call it Soggy Sugar Chicken.  Sugar Chicken, meet the trash can.  A similar sauce topped the Beef with Snow Peas.  I suspect that they use the same sauce on many dishes.    The beef might have been good had it not been aswim in that sugary bland concoction.   The snow peas were irrelevant to the dish, having been cooked into near oblivion.    The brown rice on the side is fine.  That I will eat.  I haven't worked up the nerve to try the wonton soup, and perhaps I never will.   At some point you have to know when to cut your losses.  My food was delivered through GrubHub.   It took 20 minutes longer than the longest end of the time frame they gave me.  So of course, the food was cold.     Another live and learn moment, I'm especially working on learning how to like being hungry, since I blew my food budget for two days on that food.  Yuck",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "biCxuaqKGm_ZYrR20r8cIw"
  },
  "Ud_0X-rd3mTJB-gmZvju_g": {
    "date": "10/24/2016",
    "text": "Decided to try this place cause it is right down the road. We ordered the dinner combos pepper steak and kung pow chicken. It includes soup, an egg roll or crab puffs, an entree and white rice. My husband wanted fried rice and it was $3.00 extra. We both got the eggflower soup. It was disgusting. Not a fan of any soup at a Chinese restaurant except for wonton soup, which they didn't have. The waitress asked how it was and I said I didn't like it could i try the other option, hot and sour soup. This was by far worse, and maybe I'm biased cause I don't care for egg soup anything, but is this actually exceptible for consumption,  yuck! So the lady comes back and asks how is it? I told her it was bad and I couldn't eat it. She reluctantly took it away and said I take it off. She returned to our table with the egg roll and crab puffs and said she would give us each an egg roll since we didn't like the soup. That was fine and I appreciated her gesture. The crab puffs and egg rolls were over fried and tasted pretty bad, with mostly soggy cabbage on the inside. The food finally arrives and the portions are very nice size.   The food was ok, but not wonderful. My chicken dish had hardly any chicken and mostly veggies. The pepper steak was a little over cooked, but the flavor was good. The place was dead except for a few at the bar and one other table. We sat around waiting for our check for about 15 mins though. Not very good service. There is another place right down the road I enjoyed much better!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "6m4fxCiTDcxcosod8hEeKQ",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. Kung pow chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6m4fxCiTDcxcosod8hEeKQ/o.jpg"
      },
      {
        "img_id": "GQHE-IijLsPYv1YnbWI0LA",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. Pepper steak and fried rice",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GQHE-IijLsPYv1YnbWI0LA/o.jpg"
      },
      {
        "img_id": "m51VWuymYMJVktLhK00HFA",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. Crab puffs",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/m51VWuymYMJVktLhK00HFA/o.jpg"
      }
    ],
    "user_id": "I9IqqJYtRsamLZ8S_yewCA"
  },
  "3dO5XCWpYcziFE7DOzZl0Q": {
    "date": "11/7/2016",
    "text": "Make sure they repeat your order when placing a pickup order, had to come back twice because of the mistakes in taking the order. The owner fixed it without a question.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vuN9EKK6abFvCQfek9rUtg"
  },
  "7dKCTvPM0AYzOCoTe5PowQ": {
    "date": "12/12/2014",
    "text": "I don't really like to give a negative review after just one experience, I usually chalk that up to an off day or bad luck. But after two bad experiences in one week, well, here we are. I like the food at autmn court and have had a few good experiences with both take out and dine in but the service here has slipped exponentially.   The first order we placed this week was over the phone to pick up, but the person on the phone took our address and our card information, and hung up quickly - we weren't sure if they were coming to deliver it or if we were still picking it up. After 25 minutes and no food, we drove to autmn court (literally, a half a mile from our house) to see if our food was there. It wasn't - turns out the driver was on their way. We waited fifteen minutes and the deliverer still hasn't arrived, so we called just to make sure there wasn't a miscommunication. Shortly after, we got a call from the driver, who was lost. My husband navigated her to our house and we finally got our food.   The second order we placed was placed in person, we left to grab a few items from the grocery and came back about 20 minutes later (they told us it would be 15 minutes so I figured we'd be all good). We waited another 10 minutes before our food was ready and took it home. Well, silly me didn't check my food to make sure it was correct before we left, and turns out, it wasn't. I promptly turned around and went back to fix the order.   I told the bartender I had the wrong order. He said, \"oh! Your food is over there.\" Oh, thank you. I grabbed my bag and checked it. I had to ask if there had been a change in management, or if they had been having issues lately, and the only thing he said was that they had new people on the phones (my order was placed in person), but that he \"had been there for twelve years.\" Oh, good for you, friend. He didn't offer to rectify the issue or apologize.   Then I got home and my order was still wrong. Soup has a funny way of looking the same in dark lighting.   I think they probably still have good dine in service, and the patrons at the bar looked happy, but I won't be ordering out from here again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "4zYIcJNAaiYHZkRPcGb_tA"
  },
  "D09NcB68fj2e2H9oLHi3Yw": {
    "date": "10/4/2015",
    "text": "Happy hr all day Sunday great food love the bartenders. Try Todd fry rice. Mai tai and sushi.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OTBmzKGIdzeHph9RAF8VuQ",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. At the bar with a Mai Tai",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OTBmzKGIdzeHph9RAF8VuQ/o.jpg"
      }
    ],
    "user_id": "Nhu3FDXbJ-xMtJWGxJBBMg"
  },
  "5QgJfZ02omqwBjwkSohKvA": {
    "date": "7/19/2017",
    "text": "Came in for Lunch, was greeted right away! Sat that the bar. Great local beer selection. Ordered the sweet and sour chicken and was not disappointed. Service was great. I would highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zYVvFWmCn9UWx3jtkw_lOA"
  },
  "MJNoG5iUq82uaQrZL6F4Fw": {
    "date": "9/15/2017",
    "text": "my favorite chinese place. ordered delivery. it got here super fast and was fresh. weird fried wontons, but in a good way. the paper chicken is also very good. I got the sesame chicken as my entree. I appreciate how they package the chicken separately from the sauce so it doesn't get soggy in transport. huge portion sizes. great taste. definitely worth the price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8hQiSB2KUKSlM-nT1ZpucQ"
  },
  "SB9vu6F_DsxUvcgk2cn-qQ": {
    "date": "7/26/2015",
    "text": "Went in today for lunch with my mom and sister. We each had the lunch special which is about $7.50 each. The portions are decent sized and taste freshly made. We had the chicken noodle soup which tastes really good! Will definitely be back again. The man at the bar helped us and he was very friendly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zXBH5QYe1WJCvQdkYBs9JQ"
  },
  "yH9N_uK9vZSrsUakubZS1Q": {
    "date": "2/18/2015",
    "text": "The food here is very good! While some of the waiters do need a little practice, the Chinese couple that runs this store are awesome. My boyfriend and I love coming here.  Also, it is vegetarian friendly. Big plus!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aVrU8knKR3oZ9v9K8IjFbA"
  },
  "xO7zbIWFnG6Ixam8OqpcOw": {
    "date": "9/2/2014",
    "text": "Hit or miss at best.  Last night when I called a male answered the phone and was anything but willing to take my order.  They have delivered to my area several times before but not last night, all sorts of creative excuses came up.    THE RUDE EMPLOYEE FROM LAST NIGHT SHOULD BE FIRED!    Not sure WHO the manager is, but if your employees are making business decisions for you, thats not the kind of place I am going to engage with any further.  Guess what, you just lost a customer who was ordering weekly and giving a generous tip to your driver each time.    My recommendation to everyone, STAY AWAY!!!",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "fg02VrIIUztN0gW6SRQzSg"
  },
  "uZNRC8yPjho9x5XEchgf6g": {
    "date": "11/28/2014",
    "text": "The food has always been good here and the prices are very reasonable but the service has always been awkward.  Kind of hard to describe but it seems like no one who works here has ever worked as a server.  Friendly and always nice we have never had a bad experience, just awkward.    There is the older Asian gentleman who I believe is a manger or owner who appears to be little more than a nuisance to the servers and the guest.  Once we where told that during their happy hour, we would have to go to the bar ourselves and order drinks since happy hour was just in the bar.  Mind you, the place surrounds an open bar which was about 10 feet from our booth.  I will continue to go there since the food is great for the price but don't expect much from their staff and you will be fine.  Again not rude and very friendly just weird and awkward.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hbpANpkT_FTmh5IIkjqwzw"
  },
  "9C1KDZ8JxjmWPhIwTfrUmA": {
    "date": "12/25/2015",
    "text": "Ordered food at 7:00PM. Called at 8:00PM and they said they were backed up and it would be two hours from time of order. Ok, fine I can understand that. At 8:40PM I got a text from GrubHub that my order had been cancelled. When I called, the person I spoke with was unapologetic and couldn't explain why my order had been cancelled an hour and forty minutes after it had been placed and after I had previously called. Very frustrating. Will not ever go back.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "_Ao4dC9RofkrT7n8qG9VXA"
  },
  "nJ7QpJ-a95rkJpSOxPKeyQ": {
    "date": "6/20/2017",
    "text": "Ordered the sweet & sour pork. Nothing special but I sure did get bad food poisoning from it. If you want basic \"Chinese\" food just go to Panda Express. Even though the servers didn't refill waters, they were nice. That's the only good thing I can say about this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bM80C-bm4Jos5xES70VaeA"
  },
  "CWHYxNb-6ua2eFLj5MfhGA": {
    "date": "1/1/2019",
    "text": "First, our order was about 30 minutes late. The egg rolls were so undercooked we couldn't eat them. The egg roll dipping sauce tasted like pure vinegar. I'm not sure anyone tasted that before they served it. The fried rice was not fried at all. It looked like white rice mixed with frozen veggies. Potstickers were super oily which was a bummer because the filling was good. General Tangs sauce was decent, but the chicken was not crispy as advertised. Our search for good Chinese in Arcadia continues...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "smk8r8ttnRO-J73EQMqDfA"
  },
  "_iAgg3XhVGT_hAmxlGtgPg": {
    "date": "3/9/2018",
    "text": "So to start with, I did order delivery and it went off without a hitch. So let's get to the good stuff. The food.  I ordered the crispy aromatic duck, with fried rice, egg roll, and egg drop soup. To be honest, I wasn't expecting much because I haven't found much in the way of good Chinese food in Phoenix so far. But I was pleasantly surprised by this!  The food is wonderful, truly. Everything was so flavorful, there wasn't need for salt or pepper. My favorite is probably the soup and I think next time I'll order more of it. The fried rice is delicious and not overdone which is even better. The egg roll is lovely and extra crispy. The duck was the best, I've never had better. So rich, I was sad when I was full!   I can't recommend this place enough. I'll be ordering from this restaurant for my Chinese food cravings from now on.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0giWEy85J7AQC2PVlZTi6Q"
  },
  "ZF_9C8mbHKf3rz6f3SwxXg": {
    "date": "11/26/2018",
    "text": "This is my go-to lunch spot. I'm there about once a week and they automatically know my order! Every time I go Joanna is amazing and so sweet and the food comes out hot and fresh no matter what. I'm super picky when it comes to Chinese and the hot and sour soup here is the best I've ever had!! Must try spot if you want good, fresh authentic Chinese!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2sPM-_ZaiVy7211kVbJBdw"
  },
  "dxrDavhZ52aOFzELyUrnBQ": {
    "date": "2/27/2018",
    "text": "Pros:  I was looking for a central Phoenix Chinese place that was open late (check).  The staff were very friendly, both on the phone and in person.  My meal was ready fast.  Cons:  The potstickers were so-so, two of them were burned on the bottom.  The walnut shrimp had very little sauce on it (which was OK, it wasn't great) and only included three pieces of broccoli.  The texture of the shrimp was a little mealy, like they'd previously been frozen.  I ended up not eating most of this dish.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gdb2nhLy40R0e_I9B0CadQ"
  },
  "o-goSQLU7XZIC3YQyUbBAw": {
    "date": "9/17/2017",
    "text": "The house fried rice and happy hour drink specials are a favorite!   The king pao is yummy!    This is a local,casual spot.  I would not recommend it for a business meeting or first date.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mXur7eGUjlSNiGAfqi-1tg"
  },
  "Pdc4-kS0pf7vSKGI7BbuNA": {
    "date": "8/13/2018",
    "text": "Great service and delicious food. I really enjoyed their orange chicken. The best is their peking duck - crispy skin and delicious meat! They also have a grest selection of Asian beers! I recommend this place to anyone with a craving for Chinese :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "uGwOkMmkoBBQX-Dghs-aiw"
  },
  "SW_RFpPf3sEegXE5IUmF_Q": {
    "date": "8/9/2017",
    "text": "I wasn't expecting too much from reading the reviews but I tried to stay objective! We came for a friends birthday and there isn't that much room for larger parties, so four of us had to sit in a booth isolated from the rest of the party (awkwarrrrd)   I just think that the portions are average and the food is really expensive. It wasn't anything that was exceptional so I was kind of surprised that a plate of shrimp was $15. I was a little bit let down. Will I give this place another chance? Maybe; it just depends on if I'm on that side of town but most likely not. There are plenty of other Chinese restaurants that serve quality food for less than this place.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SZfAaDDmGIBDwkmtqqye8Q"
  },
  "0Z5_GJxRvMRxFhgCJzb0_w": {
    "date": "12/16/2017",
    "text": "I come here and the food is always on point. The staff can be a little shaky at times but the food is awesome. I usually get the shrimp fried rice with the hot and sour soup and mix them. I also had the king pao chicken and it's really good. Good atmosphere and good prices.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "UeJ98sMQWrl5cJJqSeOsNA"
  },
  "HrtVLHAM3fIU1uqhvUBT-Q": {
    "date": "9/29/2018",
    "text": "This is my absolute favorite Chinese restaurant in the valley, or maybe anywhere! The food is so good and fresh, and the portion sizes are great! If you're dining in, the restaurant is cute and charming, and we have always had great service. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KssGsI8yj2ldjKhmOJkmkA"
  },
  "7lA1Jyx68LciMvGcihmIQw": {
    "date": "2/21/2018",
    "text": "My sister ordered food from here last night. She let me have some and it was so amazingly good a fresh I went back for a second plate! I love how the sauce was separate from the chicken to keep it fresh and crispy when we got it. The noodle in the chow menu were also surprisingly fresh too. The texture of them was amazing! It wasn't too soft like it was overcooked or sitting in sauce for too long.and it wasn't to hard like it was undercooked. I really don't understand how they kept delivery noodles with sauce so fresh. I almost wonder if they make the noodles from scratch? I was so impressed yesterday that today I thought I'd yep the restraunt and see what other good food they have. I was shocked when I saw the rating was so low! I have had worse food on Yelp that had more stars then this place it just doesn't seem fair. The $ rating also seems to be off it should be $ not $$.  My tip for this place is don't judge by the raiting  or buy the $$. Both are wrong. I recommend the sesame chicken and veggie low main.(my iPad won't let me spell this right)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "enwgbKbYQTysWCMfFY1HrQ"
  },
  "XQYI7HJA1RWtX4KBo0JPbg": {
    "date": "4/15/2019",
    "text": "I've ordered a couple times from here--take out both times, so there might be something to not eating things fresh from the wok, but the sesame chicken was bone dry. The flavor was mediocre, but because of how dry it was, I think I threw away half the order. Also tried some fried rice. There was simply no flavor to it. I had to add a lot of soy sauce to give it any flavor or moisture as it was also (you guessed it) dry. I'd heard good things about this place from Chinese colleagues. But one misstep is okay--two in a row is a pattern. Avoid this place. This has me heading back to Panda. Not authentic, but at least it's consistent and has flavor.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6WyOzr6ABHFk7ZD2HT5UIA"
  },
  "6nwnA48ajc-6kZfrZH2zKQ": {
    "date": "2/20/2018",
    "text": "Autumn Court personally reached out via Yelp after my review and apologized for the mishap. JJ then personally called me and apologized and made sure Autumn Court took care of us. Thanks to him we enjoyed a meal on the house and we're so glad this restaurant did everything in their power to our win trust back. Autumn Court has always been our favorite and I'm glad to stay they still are especially after the great service we received. Thanks again!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BjrD-rYxcJh3Fmga1R-2Ag"
  },
  "Uv5Eq87Q1blX8PKPjeUG1w": {
    "date": "7/2/2017",
    "text": "Here's the deal- I really like some of the food at Autumn Court. Their Szechuan eggplant with ground chicken is out of this world! So flavorful with just enough spice. mmmm.  The husband also likes their orange chicken. The thing is, their prices are a bit high if you don't go for lunch....remedy? Just go for lunch. They even offer lunch specials on the weekend until 4pm and the items are mostly under 10$. The portions are large enough for two meals (for me anyway). The lunch also comes with an eggroll and white rice. If you want soup, it's around 1$ more depending on which soup you get. Their hot and sour is ok and I like their wonton (it has bok choy in it, which is kinda different and tasty).   So why only 3 stars? The main reason is the service. The service here is just sad. It's usually suuuuuper slow as they often have too few employees working (especially around lunch time). We've had some waiters that have been nice, and one waiter who was less nice. Also, I saw one of their waiters carrying water glasses with his thumbs on the inside of the glass (you know, so his thumbs were in the waters.....yuck). This won't stop me from coming back to Autumn Court, but it does lessen the appeal of the restaurant. Also, we had their potstickers once and they were very odd and not so good.....they were super dense sausages inside of the noodle..... unlike any potsticker I've ever had. Can't recommend that. Lastly, they have an odd happy hour here....it's all sushi, which I found strange given that the restaurant is generally a Chinese food place.   Overall, I would recommend Autumn Court. The good definitely outweighs the bad.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "d_TBs6J3twMy9GChqUEXkg"
  },
  "KZdNOP9Mrij5wE9NWtqjYg": {
    "date": "4/10/2019",
    "text": "I wasn't entirely pleased with what I got. The sushi seemed really small and all-around low-quality for having paid over $10 for a single roll. I thought the honey chicken would actually be sweet because it had \"honey\" in the name, but it turned out to be really sour and off-putting. It wasn't gross, I just wasn't prepared for what I got. The small portions were way overpriced. I'm really disappointed because I pick up deliveries from this place all the time, so I was really excited to try it. Now that I know what it's like, I more than likely won't be going back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rYk7PCdtFXterfE2LB3oSQ"
  },
  "l9h11lvKMrBpfUrxJM2CgQ": {
    "date": "7/21/2018",
    "text": "Delicious Chinese / Asian food - among the best in Phoenix. I especially like the sushi and the good vibes. The owners and staff are welcoming and they keep the doors open even on Christmas! I always come here when I'm in town. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZsV4G9QqrP2zxMUD4eKxgg"
  },
  "N9EE7P-kNF0-qPxQ815BHg": {
    "date": "4/19/2018",
    "text": "Ordered takeout tonight & was really disappointed. I ordered the honey crisp chicken with shrimp & low mein. They charged me 4 extra dollars for ONE piece of shrimp. & it had a starchy texture at that.  The low mein was decent, nothing too crazy.  The crab puffs were okay too, but the sauce they came with was a bit bitter, so I'm not sure why that was?  It took about 45 minutes for the food to arrive to my house, so it wasn't too crazy of a wait.  My main complaint is that I paid $30, for chicken that tasted like it had been frozen for bit, ONE piece of shrimp & ok flavored noodles.  Disappointed, I really was excited to try this place",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XtsZw_mI2H3Haufgh8iazA"
  },
  "lGwN3BJsCLqZPhmVFtreGQ": {
    "date": "7/8/2018",
    "text": "Ordered from here for the first time today & had it delivered through GrubHub. We got egg rolls, honey walnut shrimp, lemon chicken, and orange chicken. I also paid $3 extra on top of each meal to substitute the white rice for fried rice. When it got here, the egg rolls were missing, and I received only one side of fried rice, the other two were the white rice I didn't want. The walnut shrimp and fried rice were good. The chicken was bland and not flavorful after adding the sauce provided.   Updating my review because of how the manager reached out to us to see if there was anything he could do to improve our experience. Really great customer service, I wasn't expecting a reply so fast or at all really. These stars are for the manager I spoke with, (not sure of his name) thank you for your effort in trying to make things right.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Pvqz1G4YDrj34-3-b1Asg"
  },
  "fNAMvaQYXOOMyb-ol5h9Rw": {
    "date": "1/24/2018",
    "text": "I was skeptical because of some recent reviews, but they mostly seemed to be around the topic of their delivery service and that's not what we were planning. We ordered a large order of wonton soup, crab puffs & an order of spicy orange chicken. It was all really delicious. The only reason for less than 5 stars is because it's not a (what I would consider) \"normal\" wonton soup & had lots of bok choy-the flavor was still amazing, but I would have asked for it without it if it had been listed on the menu.  Also, I liked the chicken, but the sauce was still a little too sweet for my taste...especially for being spicy orange chicken.  The crab puffs were amazing & the service was fast! I feel every home needs a go to easy Chinese restaurant & if the good food & service continues, this will be ours!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "97gJqJ9JzvMyXHB8xfigqQ"
  },
  "s8uOpStbvJmocHqc5UM9pA": {
    "date": "11/23/2016",
    "text": "Average at best:  service & food. I tried multiple times and dined in main dining area not at the bar.   I use to go to their original location before this location & it was much better then.  I wish this location could've worked out since I now work within walking distance to it but sadly I have to pick another and travel further.   Apparently their happy hour & sushi has received rave reviews but I can't bare to try it if they can't do a simple Kung Pao dish when it is a Chinese/Asian restaurant. I did try their 'tempura' shrimp & vegetables but it was overly thick in breading & not very tasty. I did ask for other recommendations from the server that could be spicier & less sweet; but alas, all main entrees were too sweet that I've tried.    Again, these are my personal tastebuds & I may be a little more particular since I'm half-Asian. And some diners prefer sweeter entrees & if you do then this is the place for you.",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 8,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "fdbYjd7CDe-HdQGvINlBYQ",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. Tempura shrimp &amp;amp; vegetables, Kung Pao",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fdbYjd7CDe-HdQGvINlBYQ/o.jpg"
      }
    ],
    "user_id": "zFp22UYxTFPmyFDjkSy7FQ"
  },
  "ZrvxZ0MCmT3RLODKei66Mw": {
    "date": "6/17/2018",
    "text": "I love this restaurant and I love their customer service.  I ordered takeout and I ordered it through one of their vendors.  The vendor came late with my food but the owner called me to make sure that I got my food.  He even followed up with me the next day. He was so friendly and so professional and the food was delicious. If you are going to order takeout I would definitely do it here but please go through the website instead of eat 24. Yummy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_IlFzsAbNjH1HgP3d_-tsw"
  },
  "dkG0HygZeaSPDp9-29UnTw": {
    "date": "7/16/2015",
    "text": "Grossest Chinese food I've ever had. I ordered the PuPu Platter last night and all the appetizers were overcooked. (The egg rolls were almost burnt). I also ordered teriyaki chicken. It looked like no teriyaki chicken I've ever seen. The chicken wasn't pre-marinated and had a sauce the consistency of water that stank. I couldn't eat it. Hugely disappointed and wast of $30 (including delivery fee, tax, tip, etc).",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tUxef6BCnk-of6OGnAcRyA"
  },
  "aSbO9fGvgA1Oowu6aMLudw": {
    "date": "5/22/2015",
    "text": "I liked the ambiance of this place, which is obviously a neighborhood go-to place for many for inexpensive Chinese food. It had the feel like I stepped back into the late 1990s, and even the music they were playing was mostly from that period.  The problem is that the food we had was simply unremarkable at best.  Our chicken dish was deep fried way too hard, covered unceremoniously with some kind of canned sour sauce. Our black mushroom dish was similarly unattractive, tasting like it was made from canned/frozen vegetables and served to us swimming in a thin luke-warm gravy.  This is another good example of a restaurant that isn't really bad so much as it's just not good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gdILbvH1TqfZdF7QjE2L5w"
  },
  "t6cQHiLO0cb_C2KuL97dxg": {
    "date": "8/25/2012",
    "text": "Needed some soup last night due to cold picked up in lovely Phoenix. Ordered the chicken noodle soup and while the broth and noodles was good and the broccoli in the soup was an unusual touch, the white meat chicken that was floating was unappetizing, slimy and of poor quality. Also tried the szucheun chicken with string beans and I ordered it non-spicy. It did come out non-spicy, but also was non-tasting. It was just loaded with a sticky brown sauce that had no taste at all. The string beans were fresh though and the owner was a nice guy. They also had a live band playing on Friday night which I guess is unusual for a Chinese joint. It was just a cover band, but still a nice touch.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ELcQDlf69kb-ihJfxZyL0A"
  },
  "nK9rXaD5Dxlx62mVSO7hhA": {
    "date": "7/3/2012",
    "text": "Tried the scallops with black bean sauce; very good with the green peppers; would probably ask for onions to be added.  Also, tried sweet & sour chicken; very good homemade sauce.  Also, had the Egg Foo Yung, which was very good as usual.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "w34SWUnjFpmpQMYOLrs51A"
  },
  "fO-n7BktuHQNhig62labNw": {
    "date": "4/26/2012",
    "text": "To quote my boyfriend, we like this place because \"they're solid.\" Every time we order here, the food is great and fresh. I always get their sweet and sour chicken and I am never disappointed. Instead of chicken chunks coated in batter, this place uses a chicken breast with batter that I would describe to be a thin tempura like batter. There is no excess batter or fat chunks to deal with it. The service is fast and we see the same waiter every time we eat here. This is the my go to place for Chinese food.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ilh0uB5fvctsqNkYt--gMA"
  },
  "5nf-lVq4suuMjwmsDz8O5A": {
    "date": "3/9/2012",
    "text": "Good service. They need a better happy hour menu though, maybe add a few more rolls to it. It's just kind of blah... If there were more options I'd go out of my way for it and come here more often because I live close by but it's really just lacking a few things. I'd rather take a little drive up the road where I have a bigger selection of happy hour items",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "h-IVmf7AvK-rJzAQx5gyHw"
  },
  "bhY6IfjlrZYwN9k-EAkQgQ": {
    "date": "3/2/2012",
    "text": "Best Chinese food I've had in years! I ordered the Hong Kong Chow Mein with beef and it was so wonderful I finished the entire bowl. I must add that the iced tea is also exceptional! I will definitly return.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "yrGeqP30031VoESFq2axrQ"
  },
  "TPjGTj8HZMYkzoo9qhzsSw": {
    "date": "12/31/2010",
    "text": "We decided to pay homage to the faux Jewish tradition of \"Chinese food on Christmas\" and ate here... on Christmas.  We ended up getting the Kung Pao equivalent of coal in our stocking.  I really wanted to like Autumn Court.  A lot.  It's in my neighborhood and not a chain and gets glowing reviews from many-a-Yelper.  Didn't happen.  The owner is a very nice guy but apparently some of his staff had skipped town to Tucson (or something).  I empathize but that ain't our problem.  So he was running around, food came out very slow (our soup never came), the check came out even slower and I'd consider it all pretty average fare.  (Nothing like the turbo speed of China Chili)  It was forgettable Chinese at best.  The restaurant's ambience is nice on the inside with a bar & TVs.  It is bright and clean and welcoming.   I will give this place another shot but the people who have called this \"the best Chinese restaurant in Phoenix\" went to an Autumn Court in another time, place and/or dimension.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JOy1vWSnjQOJWcuI8dxZrg"
  },
  "45xWluOYtlFsXsRXJfOtIg": {
    "date": "8/13/2013",
    "text": "This was the worst Chinese food I have ever had.  Went there for lunch and a friend had the sesame chicken and I had the orange chicken.  Not sure what previous reviewer was talking about with large portions or quality.  Received 10 very small pieces of breaded chicken with a horrible sauce a scoop of white rice and soy sauced pan fried noodles.  There was no one in the restaurant and we now know why.   I Would never eat there again or recommend it to anyone.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Rff1LcVNGkxoGvS198HUg"
  },
  "sOu2tM4c5u3MFfceKwVCCw": {
    "date": "5/8/2014",
    "text": "My Daughter ordered take out a couple of times from Autumn Court when we were visiting. I was very impressed with the Egg Foo Yung. The house fried rice was very good as well. Good eats!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BwgeLZksZcnzsy2t1iIoQw"
  },
  "V1OWxaFQUYq7fnONnbz9jA": {
    "date": "6/13/2008",
    "text": "Some of the best Chinese food I have had in Phoenix. Very fresh colorful presentation, great tea, great service, nice atmosphere. The menu is extensive with plenty of meals under $10.  We arrived around 7pm and were promptly seated. I tried the Kung Pao Chicken which was very good (could have been a little hotter) and \"my partner in crime\" chose the orange chicken - she raved about it.   The egg drop soup was excellent, the crab puffs sublime, and the fortune cookies crap (aren't they always).",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 3
    },
    "photos": [],
    "user_id": "PeLGa5vUR8_mcsn-fn42Jg"
  },
  "xt9jh50x2UCtfmQqNOPanw": {
    "date": "1/26/2010",
    "text": "So the yelpers who gave this place one star don't know what their  talking about. I just strayed from this place and ate at this god awful Sui Wok place and Boy will I never do that again.   Now I am from New York and having said that I will say that I have dined in some of the best places in china town and eaten some of the best hangover food in Brooklyn and when it comes to Chinese  this is as good as it gets in Phoenix.  The Hot and Sour soup is awesome. It has all the bells and whistles of the proper mushrooms and spices. The food is cheap and the portions are huge. Now OK yes the Orange chicken isn't going to be like PANDA EXPRESS because that's completely different but come on its spicy and good and not dry and you can really tell they are actually making everything instead of heating everything up from some plastic ready made food bag.  It was voted the best Chinese in the Phoenix New Times for a reason because it is the best in Phoenix. My only qualm is that some of the dishes are served as a chicken cutlet style instead of individual deep fried pieces.  Once again Phoenix the fact that some crappy place like Sui Wok is getting better reviews that this little gem makes me doubt your citizens even more!  Hooray for Autumn Court I love you!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "uta6-xEeeJBsGcul6stBtA"
  },
  "vtyaVW8E0K4F3oJTCa0KHw": {
    "date": "6/8/2008",
    "text": "Been here a few times and I always enjoy the food.  I think of this place as having good ,but not exciting or overly spectacular, food.  Service has always been spot on for me.  The dinner choices are pretty standard, but I've only have a few of the most common ones, Orange Chicken, fried rices, a few other stir fry's etc.  So the sushi thing. I've never had anything but the rolls here. They're big, more than one bite for each piece, and come with about 8 pieces each.   I like them. I know that a Crunchy roll or a Spider roll may not be True sushi but I don't care I still like them. Damn good I tell ya.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "HtCPdVujYJAZF4FKr-C9Lg"
  },
  "NzDHnssB5mpVpZlVsETuWw": {
    "date": "1/17/2015",
    "text": "The man who took my food order was genuinely nice ans when he delivered my food I was even more impressed. Fast delivery great customer service excellent food. I will be a regular because of my experience",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AV3hjUfNzVdktmBgBYjt9g"
  },
  "hoU2JtyEZrg_Gp_orEP6zw": {
    "date": "9/20/2009",
    "text": "Finally, a place that serves great Hot and Sour Soup.    For some reason, hot and sour soup always sounds good when I'm hungover.  With that said, I didn't feel like driving, so I was so glad to find a fairly high rated Chinese place that delivered.  I think you get a decent amount of food here, but it is a little pricey.  I've gotten the veggie lo-mein, kung-pao chicken, and shrimp with veggies on the three occasions that I've gotten delivery.  Pretty solid, but I will keep going back for the hot and sour soup.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "oVohybumtEwNI_fL60r0uA"
  },
  "FfCzfbom6SBoLnX_qP4qSw": {
    "date": "4/24/2007",
    "text": "Omer, I'm sorry you had a bad experience at Autumn Court, I go about once every two weeks, and in the ten or more times I have gone I only experienced bad service once. I completely agree on the decor, Autumn Court relocated from their original location and the place they moved into looks a bit \"Bill Johnson's\"  The reason I return is the food. I generally navigate to the Dan-Dan noodles, for lunch the servings are a good price, with plenty of quality and quantity. I tried the Sushi once and came away unimpressed.  In summary, not a bad lunchtime Chinese place",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "XrBvB0d_QuuCf8nHeytW4w"
  },
  "eXo_t-HZiNLNSEGHt1Vckw": {
    "date": "9/26/2012",
    "text": "Yuck!  Yet another proof point in my ever strengthening argument that this town lacks good Chinese food.  But, they deliver, and in my neighborhood that counts for something.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HCVvUpb7aU61pC7vYrZQaw"
  },
  "HXiXsTYAooH6Gu_CsgKRuw": {
    "date": "8/23/2010",
    "text": "We took the kids and met some friends at Autumn Court for dinner... the food and service was great, the prices were ok but I was disappointed that they didn't have a kids menu.      They have a large menu and I wanted something new and ordered the curry chicken which turned out not pleasing ... next time I'll just stick to the traditional Chinese dishes.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "foDSVja3cCgCoLDzilpyTw"
  },
  "86lrZK2UOAnD6oTN-KIDvQ": {
    "date": "10/12/2009",
    "text": "I'm disappointed to see so many Yelpers give this place any more than one star. I would take Panda Express any day over this joint.  I ordered to-go from their lunch menu: sweet and sour chicken with vegetable lo mein and rice ($8).  It took nearly 30 minutes for it to arrive so now I'm rushing back to my office to chow it down. It's a good thing I didn't have to rush because the food was so bland I didn't even bother finishing it.   I should have known it was going to be gross when my server pulled the lo mein out of a giant rice steamer. The noodles were not seasoned (btw- where were the vegetables in my vegetable lo mein?!) and way over cook. Maybe it was because the noodles have been sitting in the rice steamer all day!  The sweet and sour chicken was pretty much non-seasoned, chicken nuggets swimming in sweet and sour sauce. There were some chunks of green peppers too but I couldn't get over the canned sweet and sour sauce that was infiltrating into my rice pile.  The best part of the meal were the fortune cookies. Mine said-- Next time, drive a bit east and you will find Pei Wei... or maybe that Chicago Hamburger Company across the street will do too!  Don't waste your money folks. Judging from the 4 people eating there during rush lunch hour, this place will be closed soon.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "9KIGNO7qJ6366VBAzO0Npw"
  },
  "tlKmzAEm3Dh6Tv73B5WPHQ": {
    "date": "10/10/2011",
    "text": "This place is not very good.  I like their sesame chicken about 30% of the time - very inconsistent!  Everything else I've tried are ok or nasty..  My coworker found a bit of a bug in the plastic wrapping they used to wrap the container.  Would not eat there..",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "niKu4se6xtf-ctlm0udr1w"
  },
  "5TE5HzBVktZZY-7bbl4J8A": {
    "date": "1/8/2013",
    "text": "I ordered some takeout Mongolian Beef and fried rice the other night, and it was ridiculously delicious. I haven't had the easiest time finding high-quality Chinese food in the Phoenix area, but it looks like I found my new favorite place! The decor is cute and quaint too which is always a plus.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Sumi5Vt1njZTaYlA8wGSA"
  },
  "JfHRyxjdHZrhdzD-_2AKMA": {
    "date": "6/27/2013",
    "text": "Terrible, terrible, terrible.  I ordered delivery.  Chow mein and I threw the whole thing away. I will never, ever eat there again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XJTO9x78TgWE94cmXqNduA"
  },
  "44-c1TGrRf4wVpO2jSn6hw": {
    "date": "2/15/2011",
    "text": "I must be missing something when it says that it's the best in Phoenix.  I ordered the sweet and sour chicken dinner, and really wasn't all that impressed.  It started with egg drop soup, which is just egg drop soup - you can't really do anything unique there. Next was the egg roll, the same egg roll I've had at a dozen other Chinese places, so no surprise there.  The chicken was disappointing - there was technically chicken on the plate, and some of it was fried, but there really wasn't any flavor on the plate at all. The meat was bland, the pineapples, tomatoes, onions, and peppers didn't seem quite right, and the sweet and sour sauce itself didn't have any panache.  It's not terribly expensive, but I still can definitely do better for a few bucks less.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "XHOyuaYEhETRu6r9Bzbvvw"
  },
  "pyPIKb_s16R3EDMdpc6Vog": {
    "date": "3/3/2013",
    "text": "This is an awesome place for Happy Hour and delicious Chinese food.  The owner is incredibly kind, the service is great, and the value is great.  If you like Chinese food, this is a definite place to try.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "vupnMb60HSaTZrMPYsNsiw"
  },
  "IGV8Lp69MpqgMo4DAN9DjQ": {
    "date": "11/16/2012",
    "text": "I came here for lunch, and I was incredibly impressed with the service, ambience and tastiness of the food. It's a simple but airy and friendly place, with little touches of China all over. Our server was so sweet and attentive, and didn't even up charge my friend for fried rice. I ordered the Sweet and Sour chicken lunch combination, which was super tasty with just the right amount of flavor. I will definitely be back again, and I think I just found my new favorite Chinese place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "hQR57zY768uaPS3r300U0g"
  },
  "sH3NQW-G0atHtYcPZAKrYA": {
    "date": "1/12/2013",
    "text": "I'm honestly surprised that this place has 3 1/2 stars... My boyfriend and I ordered take out from here tonight & we got the potstickers app. They were actually pretty good but the sauce that came w/ them came in a teeny little container, which was a little odd for dipping but whatevz. We each got an entree too... he got General Tao's Chicken and I decided on the Orange Peel Beef -- both with an order of fried rice. I tried his chicken and honestly it was just okay, quality was pretty equivalent to Panda Express, my beef was alright as well but I'd never eat it again. But what was REALLY disappointing was the fried rice.... It was like they made it in a dirty pan. It was literally foul and tasted burnt somehow. We both couldn't stomach it so I actually stopped eating to make some jasmine rice that I had in my pantry. We're definitely not coming back!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "iwnfN3KVMXvChlR8BatO0g"
  },
  "vsAeM8UNLNrri39Ee-WwgQ": {
    "date": "1/3/2011",
    "text": "Prices are reasonable.  Food is fresh and service is always good.   Its the best Asian Fusion restaurant in the area.  John",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "xPBPnIGipm1Bfhs7XQiXqw"
  },
  "04aYd3mJBjdzLm8ezS8Kcg": {
    "date": "4/27/2015",
    "text": "This food is so amazing, we go in or order take out at least 2 times a week, the bar usually has the best service, but that's only because they are not staffed right for dinning in guests, but the atmosphere is very relaxing and quiet, the music playing in the background is just perfect, it's dim during the evening and sunny and beautiful during the day in the inside. We love, love going there, and it is truley Fabulous!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3o634LKT99uTZpNpp89Aqw"
  },
  "23m2Yjin7klJ8H9CjyzrCQ": {
    "date": "10/17/2012",
    "text": "I started going here a couple of weeks ago, and this is going to be one of my favorite places.  They will make the SINGAPORE NOODLES nice and spicy for you ($9.50)------fantastic!  They have sushi specials from 4 to 7pm too so I need try that.....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "unl3agQcToliCIKC056-aw"
  },
  "2La9SebwCNLXV2uV_6NtVg": {
    "date": "10/18/2013",
    "text": "I still enjoy going here from time to time but the food quality has gone down significantly. So much that I had to bring a to oh order back because the food wasn't even cooked!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gHt_cj2_9xhjmsQ0Z2cgnA"
  },
  "OjgOJNNL9fuk-ZSbePg8Yg": {
    "date": "8/14/2013",
    "text": "Only got take out from here. I will have to try dining in. The food was delicious and ready fast. We ordered lemon chicken, beef fried rice, and egg rolls. All of it was delicious and reasonably priced. Portions were big too so leftovers for lunch!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PIEScoetUJCZrhcLp1YDrA"
  },
  "aVeOae0Bw7_NJTV4adhMdw": {
    "date": "7/19/2012",
    "text": "I love this place. My sister and I come in often, my favorite thing to get here is the hot n sour soup and the spider roll. The egg foo young is really yummy too. We always have the owner (or so I think he is the owner) as our server and he is SO adorable and sweet and gives great service!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "OffkElRfW-yZ1tIoiHVOAw"
  },
  "Dht8v7bsfr6i8CWFmxyBnQ": {
    "date": "12/16/2015",
    "text": "I was looking for a new lunch spot so tried this place out. Below average service, below average food and they charge $2.50 for hot tea. Do yourself a favor and go a few blocks down the street to Desert Jade.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9L596o5HXnNj0rxYwjAnRA"
  },
  "wDbdd3wux5Ym8PE0QDcB6Q": {
    "date": "9/24/2010",
    "text": "I'm not a \"Chinese Food\" enthusiast by any stretch.  I would almost always prefer any other asian cuisine over Chinese.  That said, I AM a potsticker fan.  And let me tell you, a good potsticker is hard to find around here.  Autumn Court has the best potstickers in the city -- by far.  So far, in fact, it's hard to believe no one has said anything about it.  I go here specifically for them.  They are not to be missed.  Other than that, I've had the fried rice, which is excellent as well (for fried rice).  My eating companion always orders the sushi, and claims it's great.  I've also tried some random dishes here and there, all about what you'd expect -- neither mind-blowing nor inedible.  I personally like the service here.  The owners and servers are humble, and helpful and, you know, nice enough.  The ambiance is above-par for a place like this in this price range.  And here is a tip for all the parents squawking about the lack of a children's menu:  order paper-wrapped chicken appetizer and a side of rice.  It's the closest thing to a kid's teriyaki chicken.  Works for me.  But seriously.  Try the potstickers.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "8elBVjFmrOxfIHePjhddfA"
  },
  "-ovq9W_LGM1VOjFUaF8jow": {
    "date": "10/15/2012",
    "text": "Food is great and employees there were very nice and considerate. This is the only local asian restaurant that I order take out from.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "X0S8RA_UrdO4oLJohTz54w"
  },
  "OFr-v6T82tuTugwkL5Mnow": {
    "date": "4/23/2012",
    "text": "This is probably my favorite old school Chinese restaurant in the Valley.  The quality of the food is always consistent and the service very friendly.  My favorite is their kung pao veggies.  They include a nice selection of veggies in the dish and the sauce is nice and spicy.  I have also enjoyed their pepper beef and orange chicken.  I know someone who always gets their egg foo young and loves it.  The vegetable spring rolls are also very good and so is their egg drop soup.  The atmosphere is nice and quiet, making it a great place to sit and dine, either in a group or alone.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 3
    },
    "photos": [],
    "user_id": "8Bdt9ApiagB_Mf38FntL5g"
  },
  "ypRJQBGvWPvHqx5tQoMOKA": {
    "date": "10/16/2011",
    "text": "Worst.food.ever..uck Our usual place is closed on Sundays, so we decided on Autumn Court for delivery.  Haven't reviewed on Yelp for awhile and this food made me have to log on for sure!  We had to reheat the chicken and beef  dish on the stove and even then... it just sucked:(  Literally, the food tasted like frozen Chinese food that has been inside a freezer for too long, then flash cooked.  Save your self time and well earned cash! I warned you..:)",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FgY5a_J_FnXn19UlKQH7sQ"
  },
  "J_Lir_ZeacjePq5rlNej0w": {
    "date": "9/12/2010",
    "text": "Ugh. In a word, gross. Don't waste your money or your time. We got takeout here and had the sechuan beef, chicken low mein, egg rolls, and the sizzling soup. Pretty much none of it was edible. In fact, we threw it out after a few bites. Super greasy, and not a lot of flavor and frankly, I'm a bit shocked by the positive reviews here.   I don't want to sound like a jerk, but I will never eat here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "l_7FtKIGjqYXagtDjVdN7g"
  },
  "5l28G2ZPqVnysbWfOU3LiQ": {
    "date": "8/24/2013",
    "text": "Really nice little place I've seen so many times but have never been to. I was surprised how \"western\" it was on the inside. I always passed it off as another chinese restaurant. The lo mein was alright. There were mostly locals on a Friday night. They all seemed very friendly and accepting of newbies at the bar with them. Will most likely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KOL1wQK-_KmOTlblJ93HIA"
  },
  "W9AUqvPrq6IV2sNbfhxLpg": {
    "date": "12/30/2013",
    "text": "If you are from Chicago or New York, and you want Beef Egg Foo Yung done the right way, look no further! I was so homesick, I used to order Beef Egg Foo Yung from Autumn Court, almost everyday!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8symUYl7nIhs9EQaDlIYnQ"
  },
  "NrRgHLgUTuiArwGLe7kMbw": {
    "date": "12/6/2018",
    "text": "This place is delicious! This is the 2nd time that I am getting the chicken noodle soup.  First time I ordered this was because I had a cold. Pairs good with the hot sauce sides that they offer.  I was craving chicken lo mein so I was here last month also. I would like to one day try their happy hour drink specials. Always great customer service.  Very friendly. I totally recomend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "r5DizJ7T6mNmIAcQb-l6wg",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/r5DizJ7T6mNmIAcQb-l6wg/o.jpg"
      }
    ],
    "user_id": "dAx2Qm1bBsmA4bajbHSc0A"
  },
  "VMZtfsJE6hry0GBvKYOZJg": {
    "date": "2/28/2019",
    "text": "Place is amazing!!!! The food is really good and the portions are big! We placed a large order over the phone and they were very nice and friendly. When we picked up the food, the food was sealed very well and organized by name! Definitely our new spot for large orders! The place is very clean inside and the decor is nice! Thank you!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LkBALlXQJ6h7n4NzVeoANA"
  },
  "ne6eC-J5lBTZJyWOLJhDJA": {
    "date": "4/20/2019",
    "text": "Six of us had dinner at Autumn Court yesterday. Each one of us had something different and felt that it was excellent. I had some crunchy rolls and they were excellent. Great place to eat. The server  did a fine job also. Will eat there again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sN585sbdWKLXdDVuhnxkUg"
  },
  "YW272r8lWXiTWM63SjgZxQ": {
    "date": "12/28/2018",
    "text": "Cockroaches. As other people have stated this place has a cockroach infestation. Didn't even get our drink order in before a cockroach ran across the table. Got up and ran out and will never be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "6fx7odb__489DsmYljY60w"
  },
  "CiiQJEbcwBbMGSNQ3qaZBg": {
    "date": "7/19/2018",
    "text": "My favorite season is Autumn and it's always seasonal and delicious at the Autumn Court. Forget about summer when you're dining here. The Pot Stickers are yummilicious and paired with one of Shay's (the kindest bartender), amazeballz Mai Tai's will make you \"Fall\" in love with this exotic delight on the fringe of Arcadia.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "6_4CO38zIyR0jpxiTyGKdg",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. Mai Tai, Oh my!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6_4CO38zIyR0jpxiTyGKdg/o.jpg"
      },
      {
        "img_id": "BhjZ8552Jo5jctSB2H7e1A",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. Perfect texture, watch out for the hot mustard.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BhjZ8552Jo5jctSB2H7e1A/o.jpg"
      }
    ],
    "user_id": "4GMTQSSXOlk3CejH1RG8aQ"
  },
  "UDvo4CD0WrxWhLJw3NmRpg": {
    "date": "3/5/2019",
    "text": "I feel like if you're in the mood for some greasy Chinese because you are hungover, you're better off going to Panda Express. There is a such thing as TOO greasy, and this takes the winner for that.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "65QmLJ798u9e5_D1In3dvQ"
  },
  "BvE5xVEdUiZv2XfNxSrKeA": {
    "date": "7/21/2018",
    "text": "Oddest and most wonderful place in all of the Land!  80's hair band music in the background, and fun decor...It must be a brilliant place for takeout, because 99% of people walking in were picking up take out. Our server Patrick, was beyond fantastic!  He really added to this experience and we sure hope that he is there on every visit, although, I must say that all the servers were pleasant. The food was the best Chinese we have ever ever ever had in Phoenix!  This chef is beyond words...absolutely delish...I can not believe it took us so long to try.  We happened to hit happy hour, so drinks and appetizers were also fantastic and cheap cheap!  BONUS!! Our new Saturday night hang out...Soo happy!  Oh, and one last thing...it was clear that several of the people dining were local regulars...it was fun to watch the interaction between staff (owner/manager)...super genuine!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uspkn3zK3sPgKtV2V5W9zA"
  },
  "O3zT011664x10_6RVcgxSw": {
    "date": "6/24/2019",
    "text": "I ordered the Sweet and Sour Chicken, Egg Drop Soup, and Crab Puffs and delivered by Foodsby.  100% the worst Chinese food I've ever had...dry, tasteless, and expensive.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RO4t_4PvzMTP0NWmC3QkUQ"
  },
  "fTg8Gl46UYUx_KywrGa6XQ": {
    "date": "7/23/2018",
    "text": "This place knocks it out of the park in all facets, and has been doing it for many years now!  It's nice to have a long time fantastic asian cuisine restaurant within relative close proximity of where you live!  This place really exudes excellence across the board!  The service is outstanding as is the food.  The iced tea is even special.  I highly recommend the combo chow mein and The Kung Pao two.  Much Love and Respect here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Irut-iLJkEyqeiz3EGCceg",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. The Kung Pao two is money!  Large Shrimp, quality chicken, flavor city...",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Irut-iLJkEyqeiz3EGCceg/o.jpg"
      }
    ],
    "user_id": "Jhl62zVf7JxUDdpS-WjqjA"
  },
  "B_ecBA9k3l2gyCtTGBaD9w": {
    "date": "9/16/2018",
    "text": "OMG!! Just sat down for lunch. Our first time here and as soon as we received our drinks two cockroaches were on the windowsill looking at me. I slapped the windowsill and more came out.  Of course we left and the poor waiter was trying to make excuses for the owner. Bottom line close your restaurant and fumigate and clean your restaurant!!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "OiFSNiSwSqz4gDUUeAs7Jw"
  },
  "t8JTcGI3UJpMLOVyuPUOrA": {
    "date": "11/16/2018",
    "text": "What a delight to find a Chinese food restaurant that has such great amazing food. Placed an order through GrubHub tonight, the order was right on time,  food is always fantastic! I will definitely continue go there and also order Wr  love their food and GrubHub is always awesome!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ycw5fch8e50-ONVxhhd4Yg"
  },
  "5pJiTcThGRAR-DwsH9KRpw": {
    "date": "2/4/2019",
    "text": "The worst Chinese restaurant in the entire city of phoenix..Greasy and practically no vegetable s in Lo Mein. Wouldn't spend money there again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ySgmgIfTm6tUqKRHdK3j9Q"
  },
  "GUkHbgzX6laxb8a7rAm-ZA": {
    "date": "11/27/2018",
    "text": "Wide variety of Chinese food in menu. The food is always super hot and made to order. The stir fry rice is delicious full of flavor.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c6Ia--JUuWEK4nhu5NuPrA"
  },
  "H_FtlA-SWWJpXreLiCGsPg": {
    "date": "4/2/2019",
    "text": "This place has great food. I mean really good food. The bartenders very friendly and remember your face and appreciate the business. I go here anytime I have the chance when I am in the hood.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "pIqpRRnuDZS7Hr20tNDsZA"
  },
  "ucCpuauE2Wal-wwuXVyn2A": {
    "date": "5/13/2019",
    "text": "I first found Autumn Court looking for the best pot stickers in the Valley. And while they are undoubtably so, (along with the beef broccoli) Chef Koji has become the reason I will continue to return again and again. With 11 yrs. of family restaurant experience and a desire to get back to his sushi Chef roots, as guest chef, he has managed to make HH a thing at Autumn Court on Indian School. Show up from 4-7 pm., sit at the bar and let Chef Koji take you on a culinary sushi/sashimi adventure you won't soon forget. At the top of the order, the Spicy Tuna & Spider Rolls.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OAp91teWQHaT97iWXJNAPg"
  },
  "zEl-lSe-jgYU3ZT6JYS9AQ": {
    "date": "12/18/2018",
    "text": "I've given this place two chances and there's always a problem. The first time there was a hair in my food and luckily I got a refund through Grubhub for the meal. Now the second time instead of getting my main course which was Kung Pao Chicken, I got a side of rice and a side of noodles instead. This is really upsetting and the business needs to start paying attention on what they send out the door.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "icC2PqjLI-_hvlvR_v_DBg"
  },
  "P4L5XWrYOXoK7rT_tf0FaQ": {
    "date": "7/13/2018",
    "text": "Delivery is very, very quick and over-the-phone orders are simple. The menu items are priced decently and the food is good. We have not eaten in-store but have only gotten delivery. No complaints from us! The food and delivery service is well worth the money.   P.S. Kung Pao Tofu is the way to go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6ldwU52Gd26O9Vc4GEpjEQ"
  },
  "nyDBxLvHb9trl7rVHj94fA": {
    "date": "1/6/2019",
    "text": "If I could give a negative star I would.  Did an Uber eats order. The restaurant forgot our rice which was a $3 up charge for each order of rice.  The chicken for the orange chicken and sesame chicken was disgusting, so dry and did not have any flavor.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DkPrhpM8FFJYnV6Eyf5vww"
  },
  "zVc_UFNVJv6Km4cGPr_C-w": {
    "date": "10/18/2018",
    "text": "Ok, so let me start off by saying that I'm not a super duper fancy eater. If i am it's generally not by choice. That being said, this place is great if you are looking for some Chinese food to be delivered to your home when you don't feel like putting my pants on or really just showering before going out into the world. Also, the serving sizes really are generous. It'll take me about 3 meals after the initial \"sitting on my couch, eating it out of the container because I'm not fancy\" meal before it's completed. And that's veggie friend rice, spring rolls, and some sort of entree! I love never being let down by my Chinese food.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y21CPVlwAtBZABaZTpprYw"
  },
  "35fRZld2dk0jI74geyY-YQ": {
    "date": "7/10/2017",
    "text": "Do not eat here folks !I  don't even know where to start the pork sweet and sour was the consistency of dry chicken giblets and no sauce was even  received !! the only thing  we could eat was the chow mein and  i believe it made us sick ..granite I have never had food poisoning before. The egg roll tasted like the Sahara desert . I am sickened to think we could have ate anything after looking at how filthy the place is thanks yelp24 you would think they would watch out for us !",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "akbxfrrPAGYkTA3tFIAuZA",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. The Sahara desert roll ..ecoli anyone?",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/akbxfrrPAGYkTA3tFIAuZA/o.jpg"
      },
      {
        "img_id": "6-UCWmwE-DS5BALKLgOl7w",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. Lettuce wraps that should be wrapped themselves..in a tomb!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6-UCWmwE-DS5BALKLgOl7w/o.jpg"
      },
      {
        "img_id": "U_cDHuJ-5ycWxeUhjk7dtA",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. Dry sweet and sour with no sauce",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/U_cDHuJ-5ycWxeUhjk7dtA/o.jpg"
      }
    ],
    "user_id": "DuZbJ8kKE5jYJ5y1O4VgTQ"
  },
  "yIPN0Bv8yoSGxZl-ZNopHA": {
    "date": "7/23/2016",
    "text": "Ordered delivery. Was quoted 30-45 min. Driver showed up an hour 20 with someone else's cold order bummerrrrr.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jtuc901n9SqtaPqoWcUK4Q"
  },
  "bGVHHRbM7NQ4CWhxAFGghA": {
    "date": "12/25/2015",
    "text": "90 minute wait and they lost my family's order. No excuse. No apologies. Wouldn't give our money back. No stars",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "8m3wc3eyMNfIDcb8A2tEZA"
  },
  "XDBbs8wy_KfZulK3cTmA3Q": {
    "date": "3/14/2015",
    "text": "I have been coming to Autumn Court for 4 years now and I have to tell you this is the best Chinese food around. Yes the service is shaky and the place needs a revamp but it is delicious every time and the SOUP!! All of them are so good you have to try them!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A3akUQZKtQgDADStFYmrgw"
  },
  "YFqnujOXfPJ4EtrVszn10A": {
    "date": "10/20/2014",
    "text": "I placed an order online. I would suggest calling instead. It took an hour and a half from start to finish, because they weren't aware that it had been placed. Food was ok.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vr4ZY4tFSerRbMGkHmoKmQ"
  },
  "1DLfrEiVscLHT1yJsrD1ZQ": {
    "date": "9/3/2006",
    "text": "Ugh. For a restaurant to have won accolades as \"Best Chinese Restaurant\" from the Phoenix New Times, I expected way more from this place than what it offered.   You walk in and you feel you're more in a sports bar/English pub than a Chinese restaurant. The hostess seats you and then you're not served for 10 minutes. Eventually a server comes by and takes your order. I got the hot & sour soup and the eggplant w/chicken. I then proceeded to wait for 15 minutes before the soup arrived. The waitress was a little frenzied when she brought the soup and then disappeared again before I could ask her for some hot sauce.  I flagged down a busser for it instead, and he seemed pretty annoyed that I asked him to do something beyond wiping off tabletops. The soup was decent but it wasn't nearly the best that I've had.  I then waited another 15 minutes before got my entree. The eggplant tasted alright, but the ground chicken it was mixed with was downright disgusting. Smelled and tasted completely rotten. After four spoonfuls I decided I couldn't eat it anymore. But my waitress was nowhere to be found. I then spotted her from across the way and gave the \"I'd like my check\" hand signal. I then waited for 15 more minutes. I didn't see my waitress anywhere. I walked up to the hostess and ask for my check. She gave me my bill and asked if I want to pack the food for home, to which I declined.   I pay and leave the place, and see that my waitress is hanging out at the bus stop. Apparently her shift was over and she was going home, but I was left sitting there at the booth with a plate of smelly ground chicken and a mood of anger something large.  I'm really hoping this isn't the \"best Chinese restaurant in Phoenix\" because the service sucked donkey balls and the food was nowhere near good enough to make up for it. If there aren't any excellent Chinese restaurants in Phoenix, then I'm going to forlorn. Very forlorn. And that's not a good thing.",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "AKXqbuifvfvNEpr3Qs51hQ"
  },
  "ySl7P2Q3NktzGYK8DF20rg": {
    "date": "11/9/2014",
    "text": "Went in for a few drinks and apps and all the sushi rolls and crab puffs were awesome. Arvand, the Bartender, was very suggestive and very knowledgeable about all the food and drinks... Kudos!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "36IBilE2U_VZxMcZHOqXag"
  },
  "kcp2wElrN1a8ED9PCG3uew": {
    "date": "8/19/2014",
    "text": "SOOOOO GOOD! I've been looking for a good Chinese place down here and so far every delivery place I've tried has been mediocre until now! We got the sweet and sour chicken, Kung pao veggie dish, and fried/white rice. All delicious and the delivery man was really nice too! (Took a little over an hour though) 100% recommend!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8kdAdOlXIkHVfQEJwH_Cpw"
  },
  "jJY3Tjfluy4CZ-vfQFfQ5g": {
    "date": "6/23/2014",
    "text": "Haven't dined here in way over a year until last night. Had a fabulous experience sitting at the bar.  Didn't catch the servers name but he was awesome! Had a bunch of sushi rolls on happy hour and shrimp with lobster sauce as an entree. Was very pleased. Definitely great Arcadia Chinese restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "771OWzbzelsEeSlx8QsfsQ"
  },
  "TV8E_LaFlPMRp1d1nlme4g": {
    "date": "9/14/2014",
    "text": "Pretty standard American Chinese food, not anything special, but still good. The online ordering system is nice though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iT_yvSGVNZxsgMQkxqRbcw"
  },
  "FWIcgM3EJM6UGcQJ1PEewQ": {
    "date": "10/16/2015",
    "text": "this was the worst excuse or chinese food i have ever tasted i meen you flat out ripped me off the pupu for 2 was a total joke the beef sticks that came with it i wouldnt feed my dog i meen how could u even send that out and feel right about it never again yuck!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "EFzPw0bNIRHmFPX8DsU74A"
  },
  "2De9uR7ol9WcesysT7vGnw": {
    "date": "6/27/2011",
    "text": "The atmosphere in this place is very relaxing and the owner is so nice and attentive. Sushi and chinese are available. Great, quiet date place with friendly bartenders and there are always drink specials it seems.   I find this a great date place b/c of the dark-sh, quiet atmosphere.  The food is okay, not the best chinese I've had which disappoints me because everything else about this place rocks, but the food isn't as fresh as it could be.  I will definitely go again because it is close to my house though and because the owner is so amazing.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "swZF2dFS_rW49tnpQ0G1yg"
  },
  "bsInFZPvppDcsIhGxKsm8g": {
    "date": "9/21/2014",
    "text": "My first real review: WORST DELIVERY EVER!!!! 2 hours later and the kid picking up the phone at the restaurant when I called to check on my order TWICE all he can say was its in its way and they're really busy... Well keep up the crappy delivery times and you'll have lots of free time on your hands soon enough!  Not mention food was cold and not worth it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w3sj4eUV1L3r9mzKY75X3g"
  },
  "GaPUJSC7aYl5hWACQSmceQ": {
    "date": "12/23/2013",
    "text": "The food here is disappointing. The lo mein was too salty and the honey walnut shrimp sauce was lacking in both quality and quantity. I give them 2 stars though, because they deliver... it takes an hour though. Not great.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ixM-whMTyq1V0etbXs05Ug"
  },
  "WAzzvGTBgr4kvE6HWWD44Q": {
    "date": "5/30/2014",
    "text": "Every time we call this place.. they have to decide if they want to deliver? And thus now, \"your food sucks\". Is there a Negative star rating? Dwarf star rating scale perhaps? Something where due to it's sucking so bad, it's choking on it's own gravitational weight and collapses in on it's self in a fantastically mediocre fashion?",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cKuoBZBUaPnW-tGzqaFXyA"
  },
  "DPp-lkr6K4NwK0BEOOV22w": {
    "date": "7/4/2014",
    "text": "This is by far the best Chinese Food I have EVER had! The food is spectacular, I go there all the time! I usually get the Tangerine Chicken, the Hong Kong style chowmein, potstickers, egg rolls, and lettuce wraps! All these are amazing and this is a fantastic restaurant! I also get delivery and it is very fast (the food is still hot and delicious!)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i4zlrngUfDASv0bwrB8pjQ"
  },
  "qIn5iyfFPNtvP70bPliDOg": {
    "date": "9/21/2014",
    "text": "The outside looked a little scary, but the food was very good. I think the owner waited on us and was very nice. The fried rice was top notch. We had the chicken and cashews and veggie delight. We did not go for happy hour.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FKnqgMlccqGWxpSWsaqbWQ"
  },
  "34-DjaXk19p8lmOCH9sWhw": {
    "date": "9/24/2013",
    "text": "Here's the deal - I am reviewing on happy hour only; unfortunately, I've never eaten here another time, my wife just isn't a chinese food fan ever...  But for happy hour, I'm often here just for the happy hour bar menu.  They have a crunchy roll that is the best sushi roll you will ever touch your tongue to.  Pile on some dumplings and edamame, and you have one of the best dinner deals in town.  Anytime I can find somebody to hit Autumn Court between 3-7pm, I'm there.  And I could eat that crunchy roll 7 days a week.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ATWeY_nJicHHQm8R0f97LQ"
  },
  "Kif11a5m7XLRwg_zUffQSQ": {
    "date": "10/27/2014",
    "text": "Went here because I had been to its old location on central before the fire and was really impressed. I think it was a buffet on central but cant swear to it. Anyways, thought I'd give them a try on their new indian school location. Ordered the lunch specials on take out which are typically $5-$7. This place was $7.50 and dollar more for shrimp but figured no worry, it's great quality and maybe they will give bigger portions. I call them up to place the takeout order and I tell them I want fried rice. They say that will be $1 extra. Right then I should have hung up and said have a good day but I said ok just give me white then. I get there and they have the food ready and the man who takes my card and gives me my food is very nice. However the portions were way too small and the food only average. I should have gone to another restaurant, probably could have paid less and got just as much if not more. And certainly wouldnt have had to have paid extra for fried rice.  I am sorry but dont see myself coming back anytime soon.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dEuu1ezjdlEBM1P-h4q55g"
  },
  "Oxu-if_kKBdmlL3VeAzfOw": {
    "date": "10/21/2014",
    "text": "This is my absolute favorite Chinese food! The staff and owners and always extremely nice and helpful! The food is served extremely hot and super fast. I usually order takeout and within 10 minutes my food is ready and waiting. The ingredients are quality and no weird rubbery meat here. I haven't had anything at Autumn Court I haven't liked. My favorite is the cashew chicken which I order with brown sauce instead of white. I wish there were more cashews but I haven't ever asked for extra....next time!! Thank you AC!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UanNiw5XtNB9CrBCf0fyBg"
  },
  "eNXMmPqx19JtFj8KiHiQaw": {
    "date": "12/24/2012",
    "text": "Awesome! I love the Pepper Steak and crab puffs!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "gAQoIozkkrp0Sdh6WtC4hg"
  },
  "PEPPPxy7E5fvdUTWoBdDMA": {
    "date": "4/8/2019",
    "text": "Add an addition to my favorites list.  I have dined at various Chinese restaurants throughout the Valley and have a couple of restaurants that I would consider my favorites, and now I can add Autumn Court Chinese Restraunt to my list of favorites.  Autumn Court is clean, comfortable, and the staff are friendly and accomdating. I liked that the tables are covered in white tablecloths with cloth napkins; it gives the restaurant an elegant feel.  On this visit we had pork egg foo young, egg rolls, egg drop soup, and chicken chow mein. Everything was delicious. The eggrolls were my favorite, not greasy, crisp, with a great flavor. In fact, all our food was flavorful, fresh and very tasty and the pork egg foo young was some of the best I've had as was the chicken chow mein.  Prices are reasonable, staff is attentive, and the food is delicious.  Autumn Court has made it to my favorites list.",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 15,
      "cool": 12
    },
    "photos": [
      {
        "img_id": "MA4psGlnsGueyPbnBbHeyw",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MA4psGlnsGueyPbnBbHeyw/o.jpg"
      }
    ],
    "user_id": "MMf0LhEk5tGa1LvN7zcDnA"
  },
  "MHId1GaCoedxU8-nj6lE0w": {
    "date": "7/17/2019",
    "text": "This is worst food I have ever ate at. Even crab puffs were over cooked.  We took them and did moris code with them.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "R98PRihv1AkSXAxJUgM2SQ"
  },
  "6eXjinAgw6Yu5wqmKC8jug": {
    "date": "5/16/2019",
    "text": "A few red flags are being raised as I sit here and wait for my DoorDash pickup order I placed about an hour ago... The health inspector is here doing what the owner assured me was just a \"routine\" check.  The inspector is over here checking the temperature of the sushi and the cleanliness of the sushi knives. A few words are exchanged regarding the temperature and they don't sound good. The inspector asks the owner for some sort of paperwork/documents. Inspector tells him the documents the owner gave him are about to expire. The owner is over here giving the inspector so much attitude about the documents he's been asked to produce (and can't). Meanwhile, I ordered a simple soup (again, about an hour ago) and I keep being told that my soup isn't ready yet because of the inspection being done (huh?). Honestly, what do the cooks have to do with the inspector being here and walking around with the owner? Can the cooks not do their job while he's here? Why does it take an hour to make soup? At this point I'm wondering if this soup is worth all the trouble and the 15 minute drive here and will I be getting sick from said soup?????  I'll let you guys know...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "lb-rSA1R2e_jUu3VY0UhQw"
  },
  "DV1r6o-YbEFk4szrVe9Ydw": {
    "date": "9/17/2019",
    "text": "Both the spicy orange chicken and lemon chicken were tasty.  I liked that the lemon chicken used small pieces of breaded chicken, rather then the large plank you usually see it it with.  For takeout they package everything separately, so nothing gets soggy- which was great and so rarely done elsewhere.  The egg roll was rather large and was nothing special - I would probably skip it next time.  We also tried the egg drop soup, which I did not care for...but the hot and sour soup was good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nHlra8gD50md-hNHl-c1pQ"
  },
  "Lq2P2pUwi3EGCjzMAxu5hw": {
    "date": "9/14/2019",
    "text": "This place smelled of old oil.  Greeter was the bat keep and was rude from the beginning.  Threw the menu to me, upside down.   When I asked his problem he began a rant.  I left.  I recommend you never enter this tired restaurant",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "747diQ0ICta5-O78L9Q0BQ"
  },
  "VzKzmnqER_IiL_sKqfunrw": {
    "date": "2/7/2019",
    "text": "I ordered take away from here a month ago. The good things were that it was ready quickly and I was able to order online.  The bad things were the food. I got beef lo mein, which was flavorless and the beef had a weird texture. I got spring rolls which tasted decent but were practically dripping grease. The wonton soup wasn't great either.  There was a lot of food, which I guess is a plus. But when I reheated it it was somehow even worse than the first time, and after a few bites I threw it out uneaten.  Won't be going back, and the search for a good Chinese place in Phoenix continues",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "fxaqvXW0RJE2pSAclZtPBw"
  },
  "iD9MhWJirUc_y-ID3MGDrQ": {
    "date": "4/7/2019",
    "text": "Damnit!  This is an update to my review 9 months ago!  In the 9 months since my wonderful review, this establishment has went wayyy down hill! Last night we went to catch a bite after a long day of work.. Lisa was our server.  lisa also  was our server on her first day at Autumn Court as well.  It's too much to type to get into the details, but for the second time as having Lisa as our server, she was sad!  This time was because the owner was cruel to her..shame on you owner if this was legit!  Saturday is my Friday and my husband and I like to catch s bite to eat before settling in.. owner of autumn court, get it together!  Employees shouldn't be that sad! So much for a romantic night out! Tonight we went for dinner and to catch happy hour!  Started out unwrapping 6 napkin fold d silverware to which not one sanitary to any degree! Carla was great!  She was running the entire show! When we brought the filthy silverware to her attention, she was clearly embarrassed.   Swept it under the rug.. no acknowledgement!  We ordered a few happy hour appetizers and a pork noodle soup (just got out of hospital and on broth diet) the soup was so incredibly spicy we could not eat it!  When brought to Carla's attention, she said that it was her fault, she rang the order in wrong. Soup was comped!  We love this place and particular our usual server Patrick!  The service issue we could always look past!  Especially when it is so friendly!  The sanitation issue is a no go for us!!  We are so sad!  We love the cocktails and atmosphere, but not willing to negotiate health and safety!  So sorry you all couldn't get it together!!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SZoKWWFtZ4uHauUpwSdTjA",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. This was a spoon wrapped in a napkin given to us!  Went through 6 more before we found a semi clean one",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SZoKWWFtZ4uHauUpwSdTjA/o.jpg"
      },
      {
        "img_id": "qjJJyb0bcj-dnMibtJ2iBg",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. What was supposed to be s chicken noodle soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qjJJyb0bcj-dnMibtJ2iBg/o.jpg"
      },
      {
        "img_id": "8Ggcd2YRAIN75pkvkOXdOA",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. Dirty spoon",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8Ggcd2YRAIN75pkvkOXdOA/o.jpg"
      }
    ],
    "user_id": "k7pW-6uBKdrPXsDOeKUnLQ"
  },
  "fAfClolA6cVeTernWnv7Fw": {
    "date": "9/9/2019",
    "text": "Joe is a great server and the food was amazing! Definitely coming back here for the happy hour sometime in the near future. Rarely do I go to an Asian restaurant and have good food and good service but I found both here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FNFAO6A6rYr3VYfcAPKaWQ"
  },
  "X0K80iyVGqh6j4LDDc2tFQ": {
    "date": "8/3/2019",
    "text": "I've been in Phoenix for 7.5 years and up until today hadn't found a single Chinese food takeout restaurant that I would consider good. The deliciousness drought ended today! Autumn Court was great! First of all, no peas! I'm not sure why Phoenix Area Chinese restaurants put peas in everything but it's a mistake. I got the house special egg foo young and it's the best I've had since I left the east coast. And they offered brown rice substitute which was clutch!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VJUlTfeZP6ZDToSBq01WKA"
  },
  "X1agNTok4zoAelewx6314w": {
    "date": "7/22/2019",
    "text": "After reading the other reviews (too late) all I'm going to say is save your time and money and read the reviews.  Not everyone can be wrong. Outside should tell you something. Needs paint and make over. Sent part of order back, couldn't chew it. Enough said.  Prices are nothing special. Soup bland and only warm, not hot. Food just worthy of two stars. Should have known better when only two other tables had guests on what should have been a busy night last week.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GzSloQiYTwshQBicjXJq2g"
  },
  "FiUZOay6Ob7RUF54PCCFwA": {
    "date": "7/21/2019",
    "text": "Food was amazing . Had a huge mess up because of Grubhub.  But the manager working was amazing  apologized for the mess up even though it was all grubhub and remade my food for free. Customer service is amazing . He even put up with my complaining about the confusion.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MxPTiHnpmoIWelUZ0D-ogA"
  },
  "LxOsPWaY3CsISVpooaqQlg": {
    "date": "7/18/2019",
    "text": "I love this place Arizona meets China and what the Ramones on the speakers i hear! The lunch specials are amazing !!!! Orange Chicken please! Say what sushi and booze look out! Amazing!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iOhtIYHZJ1p4p0AKYZhBKw"
  },
  "TldCTaDbI0oakd3UeYQLdw": {
    "date": "5/31/2019",
    "text": "I placed an order via Uber Eats. The order was for a 110.00. The driver delivered 2 of the items.  Which was about 20.00 worth. When I called them about all the missing  items, their response was we are very sorry give is your number and we will call you back tommorrow.  This was a very poor customer service.  I will not order from them again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iTpyFlYCFebZLaIONCY8NA"
  },
  "ZtSFhosb54Z7PQoIUaFQVg": {
    "date": "8/23/2019",
    "text": "We googled Chinese restaurant in Phoenix because we were driving a ways to take our  friends to a nice dinner in phoenix. After reading lots of reviews we chose Autumn Court Chinese and we're really glad we did. From the moment we arrived to the time we left we were treated like family. The service was excellent and we shared 4 delicious meals. One usually has a favorite when ordering more than one kind but we agreed they were all equally sumptuous in taste and presentation.We will definitely go the 20+ miles again to eat there, a real jewel.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n5OP59QJvYdaraM6mT-TVQ"
  },
  "yL0zMYhru2MSb_H85cXJsg": {
    "date": "12/11/2018",
    "text": "Arcadia's top most authentic Chinese food restaurant!!   The portions are also huge! I have been coming here for years and the taste of the food never changes the location is very accessible too.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "tTTdTon8iUL8g3eIRjp9Rg"
  },
  "imZCn19ZYFqLk7-peYNCIw": {
    "date": "11/5/2018",
    "text": "I'm going to be nice and give three stars, yet I feel two would be more honest based on expectations. The food was okay, but not what we expected.   If you have lived in the Valley for decades like we have, you likely remember the awesomeness of China Doll. Unfortunately, it went out of business primarily because they did not stay True to their original recipes and made changes that apparently were not popular.  Autumn Court had some affiliation with China Doll and offers some of the menu items of China Doll. It used to be spot on exactly the same as China Doll!! So used to LOVE Autumn Court's make of China Doll!!  Well, our last time at Autumn Court ordering off the China Doll menu was NOT the same!!! The food was completely different, although similar. The shrimp was not tempura, the rib did not have the same flavor plus it was tough, the chicken chow mein was all chicken with onions and no celery and very few veggies. It was extra for soup and extra for fried rice, which equated to close to $15.00 for lunch. Had it been True to China Doll, it would have been worth the price. But it was not.  If you don't have expectations to get what you have known for decades, this Chinese place is good. We were just disappointed. Change is not always good. So bummed.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "cp0zNS_4chviJdhrSbEdqA"
  },
  "bwfzEKTnAHLckm3qzhotfg": {
    "date": "6/14/2019",
    "text": "I was excited to try them again after 5 years, I ordered to pick up - sad day  my chicken was cold and taste like it had been made 2-3 hours ago , the crab puffs same thing cold and old , my noodles were hot!! I won't ever go here again. Disappointed",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SbTM9lLLG08-g1Wtas8cAw"
  },
  "yOwRloh7lpsbW-DPRwgZdA": {
    "date": "5/23/2018",
    "text": "So.. I have to say service here is just great. I was very upset that for the 2nd time I got home and my order was not correct. We come here often and this being the 2nd time takeout mistake and about 3rd time. And all I ask is for no mushrooms or meat. So it's a simple request. So I called. They transferred me to the manager and he said what should it be we will make it again and bring it to you. Wow service. Although he should have got it right the first time and being this happens all the time here I lowered the review to 4 stars. But not because the food isn't good its just they need to make sure they listen and double check. I'm happy in the end but wish it was right to start because that would make them flawless",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OGAhhgZX0ksbDaG2ERA0YQ",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OGAhhgZX0ksbDaG2ERA0YQ/o.jpg"
      },
      {
        "img_id": "rz5SSHdzqhtGtu_uVS7JGQ",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rz5SSHdzqhtGtu_uVS7JGQ/o.jpg"
      },
      {
        "img_id": "Qzj69ALAYltXmYlBNR3kAQ",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. Dinner... again",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Qzj69ALAYltXmYlBNR3kAQ/o.jpg"
      }
    ],
    "user_id": "pzi4djSM9H25WyaP86zvGA"
  },
  "MHXeNdNs0XNPGe96GeK_IA": {
    "date": "3/10/2019",
    "text": "What can I Say about Autumn Court other than what an amazing place to eat!! The food so good! We are addicted to this place! The service is amazing, the servers treat you like family! Yesterday we tried the Sushi Rolls for the first time, they have a sushi menu now! Also, they have happy hour everyday! You heard that right; happy hour daily from 3-7pm!! Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "3icGdYOk0d3M7Dk_EJIGOA"
  },
  "pYxI83A7CP-ky7aH0GGw6w": {
    "date": "3/19/2019",
    "text": "Great food, portions are HUGE and service is excellent. Happy Hour specials that looked pretty good and now have a sushi chief. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "MBBzQuIyJq_ZNAnjW61azQ"
  },
  "NBM4vhzdzgHKiE4rX3IGyg": {
    "date": "12/19/2016",
    "text": "If you are looking for great Chinese food go no further! Restaurant is always clean and smells amazing when you walk in! King our server (I think he is also the owner) always greats us with the sweetest and most sincere gestures making sure we are happy and taken care of! I always start with The hot tea, it is so refreshing! This time I got the spicy orange chicken dinner and oh my goodness like the best Chinese food I have ever had! The portions are huge! The dinner is also served with a big thing of white rice, egg flower soup, and your choice of egg roll or crab puffs all for like 12$! The soup is outstanding, the rice is perfectly cooked, and the crab puffs are so delicious but addictive ( you have been warned). My boyfriend got the sesame chicken dinner which was also super yummy ( even though I do not like sesame) and his brothers general tang chicken was hands down tasty goodness! You will not leave hungry or upset if you eat here! Yeah serves can be slow at times but you should just sit back and enjoy the wonderful food offered here! Also the serves is always friendly which can not be said about many places any more! You should definitely give here a try I guarantee it will be some of the best Chinese you have ever had!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oyVEr55rq1BrXW54lWdzpQ"
  },
  "U2T-F5RhjpkxJgVWeRqsQw": {
    "date": "11/22/2015",
    "text": "We had a great experience at Autumn Court. The food was delicious, fast, and plentiful. I had the sweet n sour shrimp and my husband had the honey chicken.  I would skip the lettuce wraps though. Service was great.  We'll be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jO48xv99j-4BaGUp1BA0_w"
  },
  "bJMfrBXkut5FZd00x7R8eA": {
    "date": "3/30/2013",
    "text": "I'm a regular at Autumn Court for several reasons.  They already know me when I walk in and seat us right away.  The service is always friendly, the food is always good and the drinks are delicious, must try the Tom Collins here, yummy!  For food try the shrimp with sizzling vegetables, three treasures, mongolian beef and the low mein, you will not be disappointed. Their happy hour menu has many good deals as well.  Another awesome thing is that it's a nice place to come and relax when you don't want to be in a loud crazy spot, you just want a nice relaxing meal.  It's very laid back and has a wonderful staff.  Highly recommend it.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "fQB5PgyZf9KUH-ESs4rf_Q"
  },
  "jn2XfkqZ_2OoubfuXIshiw": {
    "date": "1/2/2013",
    "text": "You walk in and wonder if you are in the right place.... Kind of shabby looking.    But the food does not disappoint.  Full bar and decent sushi, lots of Chinese restaurant dishes.  Try the duck!    Service was excellent - See you again, AC!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "JQSmDI_49npRM8mq07vrmQ"
  },
  "SuFVMs5-9jyqUfBlT5hjuQ": {
    "date": "2/24/2017",
    "text": "We always hope the next time it'll be better.   Sadly there's just not enough Chinese restaurants to choose from that offers delivery.   Tonight's disappointments included scallops with ginger and scallions, maybe 5 or 6 small brown rubbery metallic items in a nasty flavored sauce.  Shrimp and veggies, poorly cleaned frozen shrimp in a bland sauce with very little veggies.  BBQ pork was a hit and a miss with the sauce, all pieces were ridiculously chewy.   House lo mein might of been the highlight next to the white rice but both were cold.  Anyone know of better options or better restaurants that deliver decent Chinese food in the arcadia area?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "InI_wAeYyLrTmOpLsfwTlw"
  },
  "tgiHj8O57vrKcqT-ZUGtyg": {
    "date": "3/21/2015",
    "text": "Everything here is good.  The hot and sour soup and sesame chicken are my two favorites.  The delivery is always fast and food is hot.  Really nice staff as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZMuCGHU3rQomAmtaqA1R7g"
  },
  "G-qxiogZ54OovWLwwEzUng": {
    "date": "2/15/2015",
    "text": "Terriable Terriable who ever left a good review to this please basically doesn't know how to eat I pacifically told them \" well done extra dark \" on the pork fried rice it was mushy and no pork in the rice ! Beef low main was so mushy and not dark gross ! The egg rolls was soft not crunchy I'm from New York and Florida and wo hop in New York now that's Chinese food and Christine lees at gulf stream in Florida that's good Chinese food this was Terriable !",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lA5QMenwaOmqgwpu2KXJ7g"
  },
  "wg_25PwZQIHSTMkxBrnXQQ": {
    "date": "8/25/2012",
    "text": "They love us there!  I go with my son Justin's cute girlfriend and I could very well pass for her older sister ~ Needless to say, we get a bunch of attention from these already attentive waiters, busmen, and hosts.    The egg rolls are scrumptious; well done on the outside and soft and fresh on the inside with orange sauce.  The Dan Dan Noodles were yummy with minced chicken and a nice texture.  The lemon chicken was an 8, thick sauce and fried nice.    The Cupcake Chardonnay was yummy; sipable, not chugable.  They actually had a great band there, every Saturday night!  The music had me dancing in my seat.  Songs like \"Summertime\", \"The Girl From Nepamima\" ( what is the correct spelling please!), etc ....  They aim to please and for a neighborhood restaurant, they get an 8!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "COF3FhGUWVm-XxHkI80ciA"
  },
  "-KwkF72NPBNUA33_vTUPvQ": {
    "date": "5/12/2015",
    "text": "The food just didn't have any flavor.  And now my stomach hurts.  The guy that took my order was lovely, the delivery guy (possibly same guy) was very sweet.  It's just that the food has no flavor.  Also the apps were burned.  I mean I'm definitely not hungry now, but I could have accomplished that for less than $45 (three people ordering entrees and two starters).  I won't be ordering from there again.  I heard good things about this place, but I'm just becoming more convinced good Chinese food in Phoenix (or Arizona) doesn't exist.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uz_3Xbr5p1MD9Xn8UhLMQg"
  },
  "Ozp3b_wKbHcgmzQMgI7tNA": {
    "date": "4/11/2015",
    "text": "Always pretty solid Chinese food. It's better when eaten in versus take out. The main dishes are usually really good. The sushi is okay. Atmosphere at the bar is great though. I can see why so many people sit at the bar and have dinner.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sEyyJfPayDvacYa89rDF9w"
  },
  "kQe-1jo-oubVJBd2QIrmMQ": {
    "date": "12/29/2012",
    "text": "Pretty good Chinese food - like what I'm used to from the East Coast (NYC).  The wonton soup was very flavorful with fresh bits of green onion and celery.  The Singapore noodles were flavorful with several large shrimp and tender pieces of port.  And the kung pow chicken had a nice flavor with some whole black beans in the sauce.  Everything was tasty, not greasy/oily, nor too salty.  Atmosphere and service were fine.  I'd definitely go back on my next trip to Scottsdale.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ov93rsRILewNnf3E2TmiIQ"
  },
  "h1mPtEx1Js_O8lTa4qz8Rg": {
    "date": "7/25/2015",
    "text": "Not the best Chinese food I've ever had, yet not the worst either.  I ordered food for delivery after viewing their menu online.  Their website is not very sophisticated, and difficult to navigate.  I was unable to find their phone number on their website so I had to google them to get a phone number in order to call in my order.  The gentleman who took my order was very helpful and polite.  The food arrived in a timely matter, and was still hot.  I will definitely be giving them another try.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JbOoUl6o7GKCAuiXWVwYvA"
  },
  "Lcj5FQMTuF2CupYpOZwTLA": {
    "date": "6/17/2013",
    "text": "Ordered take out this evening.  The delivery was quick and all the food was there...the crabpuffs were soggy and had zero crab in it.  They did not seem to be cooked to order and maybe had been sitting?  A couple of the meals were luke warm which made the coating on them taste doughy.  With the multiple meals ordered there should have been more than 3 fortune cookies.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ikvxr_lwsyBKmp4SH9FboQ"
  },
  "W4PJpo5JW6s4GerlWqXWhg": {
    "date": "8/30/2014",
    "text": "Just called and placed a delivery order and was told it's to late for delivery. Okay thinking to myself I asked \"what time do you deliver till\" the man said \"9:15\" . I looked at the time and it was 9:00. I said this to him and his response was \"it's just too late we are busy and hungup\". What horrible service. He could have said I'm so sorry we are unable to at the moment instead of saying it's too late and hanging up.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "NeQQZlLTFPFiVipl9TzUWQ"
  },
  "bBpfJxrxHykS12DvPyjVUg": {
    "date": "8/25/2012",
    "text": "Disclaimer: AC is within walking distance of my place, so I probably am a bit biased.  Summary: A nice, comfortable little restaurant with an underrated happy hour and friendly (though sometimes hard to understand) service.  I come here mostly for the sushi - not because it's outstanding but rather since Zen 32 closed shop it's the only game in the immediate neighborhood and, though very limited (we're talking 10 options) it's not horrible.  Solid happy hour - discounts on the sushi and other items like pot stickers, crab puffs & edamame.  Good deals on sake bombers and beer which they now offer 2-3 kinds on tap.  The main dishes are tasty and ample.  It does a pretty good takeout business.  Friendly bartenders and waitstaff, ample parking.  If you're looking for the 'in' crowd you won't find it here - you're better off making your way elsewhere.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "bVMOrLZdGfOm4xxL-oZNWQ"
  },
  "cfxNRjXllCvmXfMYuX35VQ": {
    "date": "8/15/2014",
    "text": "So I was scanning the reviews for this restaurant and starting laughing when I realized one of them was from my sister Irene V.  I'm happy to say that her experience matched up with what I met up with tonight.   When I called my order was taken quickly and they happily accepted my request to substitute the 2 steamed white rice orders that came with entrees with an order of egg fried rice. I split things with Japanese and Chinese items for variety1.  Spiny tuna roll was very good with a nice presentation...there is nothing worse than seeing a sloppy put together roll.  The crunchy roll had some good flavor and texture.  The tuna sashimi was a very generous portion to the point that I decided to cut each slice in half because they were so big.   I stopped by to pick things up 30 minutes later and was promptly greeted by a woman upon walking in the door.  I'm pretty sure she stands by the window when she sees headlights and is waiting for you to walk in the front door.  The bartender had my order ready and even hooked me up with some extra hot mustard and duck sauce upon request.  After getting home I realized that they had already given me more than enough originally, but the extra was a nice touch.  No scowls upon hearing me as for more, but instead a smile and \"no problem\".   After getting home and unpacking things I was a little confused...the food was all there but there was a bonus item.  Tortillas.  WTF?  Conversation going on in my head:  \"Are these tortillas?\" -yes \"I didn't realize tortillas were a Chinese food\" -they aren't you dumb ass \"Oh.  But why are they in our food\" -because this is Arizona you idiot. (no judgement because I have Ally McBeal type conversations with myself)",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "EVdbMUMz3Sj7_SCt-SeOJg"
  },
  "N-ja8rJ2j-cB_ycVwHEbyg": {
    "date": "9/20/2015",
    "text": "All of the food is delicious. From The curry to the sushi. The prices are right. Sometimes the service is a bit slow when it's gets really busy. King is such an over achiever!!!! Arminio the delivery driver is always on top of things!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-vNo22uuS0FfNkqPIljezQ"
  },
  "uT7wA_sCN_bUikGBwFmxFQ": {
    "date": "10/31/2015",
    "text": "Stopped in for dinner Halloween night, the place was empty except for one other table. However the food was delish. The shrimp fried rice was excellent.  My girl had chicken lo mein and stated that was very good also. This was our first visit but it wont be the last.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qZVX7JOBWdipHN9oMSAtIg"
  },
  "CZ8KvBbb02FQ2s0hfjn3NQ": {
    "date": "9/2/2015",
    "text": "The sweet and sour chicken was deliciously crispy on the outside and tender on the inside. The crab puffs were really good too. Would love to go again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i6O2EEfjF2vTrRPXJr-4RQ"
  },
  "9GsRjkAuG3zCZJ4osxvtbw": {
    "date": "12/16/2014",
    "text": "I love this place. My boyfriend and I are from back east and have been on a search for good Chinese on this side of town since we moved here. The search is over. Finally, a Chinese place where the food isn't loaded with sugar and fillers. We have ordered pot stickers, the BBQ sliced pork appetizer, general Chicken, beef with vegetables, king pow chicken, Peking duck and so on. We're starting think everything may be good on the menu. There's no doubt about it, this is the best Chinese in the city of Phoenix. Not to mention the staff is friendly and work efficiently. Oh and for you cranky yelpers complaining about the prices and \"small portions,\" you're delusional. I'm sorry. That was rude, but maybe you would be happier at the all-you-can-eat MSG factory down the road. It's only $5.99.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sWVgwXZEnnFL2j9XSsrrlA"
  },
  "pwmcpRe1aHLAv024HjzRfw": {
    "date": "1/6/2017",
    "text": "First time eating at this place and it was so delicious. The chicken fried rice, the chicken snow peas and the egg rolls were perfect! I will definitely recommend it to friends and family. Someone said the service was bad? Idk who said that (maybe someone with there nose in the air) but we were greeted where we first entered and took our order. Will definitely be back thank you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mKzxydl3PJp4yW-WLSPmyw",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. Delicious",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mKzxydl3PJp4yW-WLSPmyw/o.jpg"
      }
    ],
    "user_id": "LyXo7gfAs8IYmb9aC1FSzQ"
  },
  "crp6CoNFu5SWBxx03VGhOg": {
    "date": "7/2/2017",
    "text": "This place is clean and the food is good enough. That being said the atmosphere of the employees yelling at each other in the back room and the service is horrible. The potstickers taste like jimmy dean breakfast sausage wrapped in wontons and cooked to a crispy cracker like finish. No need to try this again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wNGH2d0TetzB_hfJmdNCPg"
  },
  "5z-SqUelqQF5m_BbCX0URw": {
    "date": "7/2/2017",
    "text": "Everything tastes old and reheated. Chewy rice, egg rolls that tasted like the same ones I was served in the cafeteria in junior high. Chow mein was bland and sweet and sour chicken tasted like the kind you buy in the frozen section. Will not be ordering there again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-ACJ_NF4EnFc0XhkxnSkeA"
  },
  "oQNgRvoR3BhR1oOGwik5ZQ": {
    "date": "6/15/2017",
    "text": "Don't eat here ever I got horrible food poisoning.  I ordered the general tsos chicken witch was taste less and dry and the Kung pao chicken and shrimp they forgot the shrimp and was afull stay away",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UI3bZ_HiOzzuVmfJ2HuBUQ"
  },
  "gWnmSLgvXVUTqf5aGBirhA": {
    "date": "11/11/2017",
    "text": "Just moved to Phoenix and was looking for a good Teriyaki place, this was close by so I figured I'd give it a shot. The inside of the establishment looks nice although it has a kind of \"Applebee's meets Asian\" vibe. The food was unfortunately was mediocre at best: my teriyaki chicken was a bit boring with no real flavor on the chicken and a lackluster sauce. The rice was hard and flavorless (it was white rice so I wasn't expecting much, but still) and the broccoli was fairly tasteless. The fried wontons were a bit bland but did have a very nice crunch. The biggest disappointment was that I asked for a lemonade and got some gross tasting water with the slightest hint of citrus. I thought that maybe I had been misheard and maybe he had just given me some lemon water, but lo and behold I got charged the full 2.50 for it. Overall, it wasn't the worst, but it definitely wasn't special.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xbhFpl7tKoVLXY_pYeKGGw"
  },
  "bq-vll0wDXtc9NKvoTuuLw": {
    "date": "7/23/2017",
    "text": "What type of established business doesn't answer their business line during business hours. I called twice to place an order for delivery and they don't answer. Well that means they lost business, sad customer service.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f2khae8dcsyeX4YE9TWnLQ"
  },
  "hshbmTvkDPYXizfVyIBLHw": {
    "date": "9/25/2017",
    "text": "Possibly the single worst Chinese restaurant I've experienced and there have been a lot. I would tell my friends not to go near this place and my enemies to make a bee-line for Autumn Court. The food was very bland to say the least which is far from typical for a Chinese restaurant.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4I_nPMShlbBqMXD1wEuPSg"
  },
  "LTdrT22-6PKHj9SXGzBkrw": {
    "date": "10/8/2017",
    "text": "Looked like a great menu I ordered online for delivery they charged me $50, then an hour and a 1/2 later I called them to find out where my order was and they said they cancelledit.  they had no delivery people.  I asked why they didn't call me and tell me they cancelled it. They didn't have a delivery person. I say I should  get my money back?",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hbA9o-7ApLqeYMmY7yJTvQ"
  },
  "1mPRx2uIDPyet8s-BGwwAg": {
    "date": "7/15/2016",
    "text": "Chinese food that delivers, it's hot when it arrives, tastes authentic and is reasonably prices.   Yup.   I'm a regular orderer!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Uq55JZpQabttBHvJFYFsg"
  },
  "1gzt1yw6GwiRw3cz7-fSDQ": {
    "date": "5/21/2017",
    "text": "Friendly staff,  we even got to talk to the owner.   I ordered beef chow fun & my husband ordered beef with sizzling vegetables. Both dishes were very good.  I think the most important part was the service,  without great service forget it.   We will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hwFi27N7MTPH5MbUv-vRyw"
  },
  "wxbPenQdzs7Taoz8POMhng": {
    "date": "12/8/2013",
    "text": "Yummy-licious! I miss Chinese food from New York. This is *very* close and a super cute place. My friend and I made a long lunch here and thoroughly enjoyed it.   Walking in we were immediately greeted like old friends and directed to a booth. I ordered a green ice tea, which, hold your pants, I've never ordered in my entire life. Scandal. Yes. It was incredibly refreshing. And served in, quite possibly, one of the biggest glasses ever. (They refilled this later, but honestly, there was no need.)  They offer a great lunch special (11am-4pm). Your meal comes with an egg roll OR wok fried lo-mein, white fried rice + an egg roll. For $7.50 I went with the Kung Pao Chicken and Shrimp. I \"upgraded\" to brown rice for a $1. My friend added an upgrade for $1 of egg drop soup (which she raved about).  We both cleaned our plates. There was nothing left. Nada. If you look at my photo there was a generous serving of food provided. That stuff was goood!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "YJFsUEMUBUGbuCx0VGCMmQ",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. Mai Tai!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YJFsUEMUBUGbuCx0VGCMmQ/o.jpg"
      },
      {
        "img_id": "pjZl9pjPht-99Tgz_LVCzg",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pjZl9pjPht-99Tgz_LVCzg/o.jpg"
      },
      {
        "img_id": "DU72Sjh2MW-rPl-Z2UlScw",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DU72Sjh2MW-rPl-Z2UlScw/o.jpg"
      }
    ],
    "user_id": "EJ7ZhRHsMWj8du77LX34gw"
  },
  "IX5ViGzLQ6mf-HdiTzzy8w": {
    "date": "3/12/2018",
    "text": "Amazing place! Great service and they have some of the best food! Love the big bowl of hot and sour soup. The portions are huge! Great prices. Couldn't be happier with this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tQV3RRjLIB5-0tz2XoOmnQ"
  },
  "znE_fVsOj4rJGYiZmAWk5w": {
    "date": "3/8/2018",
    "text": "My girlfriend and I were excited to try this place, we got the house style chow Mein with an order or fried rice and an order of spicy orange chicken. I work late so I got it to go. It took a few minutes for somebody to notice I was there but finally the bartender noticed and got somebody to get my order. Once the staff brought out my food they were nice. They wrapped up everything well and I liked that they put the sauce for the orange chicken on the side. Once we ate we thought the chow Mein was decent and the fried rice was good. The only major gripe that I have is about the spicy orange chicken. I really wouldn't even call it chicken. It just seemed like tiny pieces of breading fried. Idk about you guys but when I order orange chicken anywhere else it comes as nice full pieces. I had to throw away over half of it because we weren't going to eating breading. Very disappointed in this order and I doubt that we will be coming back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uC_8Ga0iHa3670M041WBoA"
  },
  "fbMh-n8nG3kc3diz62-IiA": {
    "date": "2/27/2017",
    "text": "I should have known not to dine here when I waited 10 minutes for someone to greet me and in that time saw two customers give up on waiting for the takeout food they had ordered. For some reason, I went through with being seated. The waitress had to turn on the lights by my table as if they were desperately trying to save money. The table was dirty and she took forever to come back just with water and menus, so I left. Don't bother trying this place!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z-E1IyC9VqQ4K_erAyqj4g"
  },
  "rpfWYN3jfli_EE52gfzDCQ": {
    "date": "2/24/2017",
    "text": "We just ordered the honey chicken. Only to get it cold. And when I said something about it , they actually put it in the microwave. And brought it back to me. And my plate had food on it from the person before me. I WILL NOT BE BACK AGAIN!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BYWbo5q-tWC9hSD8Pt-PKA"
  },
  "zwWsUjX_3OwJE2ROyTmexA": {
    "date": "7/7/2016",
    "text": "Our family loves Autumn Court,excellent customer service provided by Manager Joann and all her wonderful staff!  Off course the appetizers and entrees are really delicious and very well prepared! This restaurant deserves the best ratings possible!  The Chicken and Beef Fried Rices are mouthwatering!  Joann is very attentive,kind,sweet and really warm hearted! She treats all customers with the utmost respect and service!  My family and I feel at home here and highly recommend this super restaurant!  Sincerely Leo and Family from Ahwatukee!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sLlM_ihm6KOus4HXVYS3tA"
  },
  "f8rkbZZWqVhec73U6ZvQ_Q": {
    "date": "6/25/2017",
    "text": "The food was terrible my rice was burnt for the rice soup asked for extra chicken i didnt get it the staff was rude waited like 20 minutes for a plate of food by the time everyone else finished eating i started oh heres an idea turn the ac on will not recommend this place to anyone",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OIQw-8qxaXvbKI8kYct9Dg"
  },
  "TSiVXQr-SveVQaorV4bPKg": {
    "date": "11/18/2013",
    "text": "J and I were in the mood for Chinese Saturday night.  We decide to get takeout from Autumn Court.    J calls in the order.  I ordered the Lemon Chicken (a chef specialty apparently) and J ordered the Pepper Steak.  J also gets an order of pot stickers and we get a couple egg rolls. He's told that it will be ready in 10 minutes.  Talk about fast.  Maybe too fast?    I get there and the restaurant is completely empty.  For 7:30 on a Saturday night, that raises a reddish flag for me.  I get our food, pay - it comes to $31, and head on home.  When I get home we strip off the 2 ft of saran wrap off our dinner boxes and dig in.  My lemon chicken was super soggy.  Like it had been cooked and them steamed (maybe because it wasn't vented in the take out container?)  J's pepper steak was chewy and the sauteed vegetables (peppers and onions) were mushy.  As if they had been (to quote J) stewed.    We could have gotten better quality Chinese at Panda.  At least we would have known it was freshly made.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "b34yOQoUDev_l6BzDBMpUQ"
  },
  "HVMJFN6ewoJkjcQsVwQtVQ": {
    "date": "6/12/2014",
    "text": "I've used them twice this week for lunch meetings, and both times it's been excellent! We got a LOT of food for what we paid, delivery has been on time, they've made sure we have any needed serving utensils, and they've called both days in the afternoon to follow up to make sure everything went well.  I will use them again and recommend them highly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "djNKJasm37fVWgIE1E17fg"
  },
  "bi_TBKUgVDLcYhn64kqQDQ": {
    "date": "6/17/2017",
    "text": "After calling 2 other places asking if they deliver to my address finally found this place that said yes.  Was told it would be 30 mins until delivery.  After 25 mins got a call back saying I was too far outside the coverage area and they couldn't deliver.  The only option they gave me was $3 credit for the delivery charge other wise I still had to pay.  25 minute drive later I finally got food, which was mediocre at best.  Sesame chicken wasn't even mixed, just a cup of sauce and fried chicken pieces.  Needless to say, won't ever order from there again!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KIXK4uMqrXzheY91dSvzEA"
  },
  "gdUJ0h4eiHitbde7Rtx3cA": {
    "date": "2/10/2018",
    "text": "The food was great! They were super generous with their servings. Food came out timely and the server was very prompt and accommodating to our large group! I would definitely recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vK19PKwObtaMsHnF1ArN5g"
  },
  "pM79Z2aCr6mByvIpEzpKFA": {
    "date": "7/19/2018",
    "text": "<a href=\"/redir?url=http%3A%2F%2FBomb.com&s=716853a54974befb18bd2a2079d876386c9ebd876290947c699fc1e3eaccf129\" target=\"_blank\" rel=\"nofollow\">Bomb.com</a>! Love the food and drinks here. Girlfriend and I come here and always get fried rice, chicken lo mein, and orange chicken. Neat environment and good vibe. Can't beat the friendly family oriented service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UmtAtMTR4dEFLHEUreQGxA"
  },
  "k34JYdebjpgsYIyuxABUSA": {
    "date": "7/19/2018",
    "text": "Love this place!! Great crab puffs and their sesame chicken and fried rice is my favorite!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5nqHW63ZNmQhKZhwm1Ctmg"
  },
  "gEnV0NCYt7NyPM0C7D1hgw": {
    "date": "10/22/2017",
    "text": "The food here is tasty and affordable. I disagree with the reviews that say dinner is a little spendy roughly $13.50 for some kind of meat, white rice, soup, and an eggroll or crabpuff. AND it's enough for two meals. The lunch specials seem like awesome deals and we'll be back for those sooner rather than later! There's a lot to try on the menu.   The food is good. It's what I expected. I had the spicy orange chicken. The flavor was spot on. My only two suggestions would be crispier chicken & more sauce. However, that may be a personal preference so I am going to just ask for it next time. My boyfriend had broccoli beef and loved it. Haven't tried our egg rolls yet as they're in the fridge as leftovers ;)   I'm confused on the reviews that say the service isn't good here. I didn't experience that at all. My boyfriend and I were here on Friday night for a late dinner (9 PM) and we did not feel like burdens AT ALL. The owner even came and had a quick chat with us about the area and Phoenix weather. The servers were friendly and answered all of our questions. I'm not sure what you could ask for?!  P.S. They take your food from you to box it up. They also gave fresh rice with each takeout container with hot mustard, spicy chili sauce, and sweet & sour in containers. I have a True appreciation for this!!!! We will be back! They deserve more than a 3 star review.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-j2chivlY1ky_txq3PAA2g"
  },
  "8R-V03NEkQuu9tSHRRh3dA": {
    "date": "2/4/2018",
    "text": "We visited Autumn Court to celebrate my wife's birthday,  with two other couples. They were not very busy and we were seated immediately. I ordered Schezwan Pork and my wife ordered Lemon Chicken, with fried rice. The vegetables in my  pork dish were quite overdone and soft, almost mushy. My wife's Lemon Chicken was very flavorful and enjoyable (yes, she gave me a nice sample). We shared the fried rice and it was very good. Oh, I also had egg drop soup which was more broth than egg drop. I wouldn't recommend the soup. Even though the Lemon Chicken was good, I probably wouldn't go back to Autumn Court.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "30-tX6IFLrlD0nUi_hLWEg"
  },
  "BjDVWgtoMWtMzGWMiPSsmg": {
    "date": "8/17/2018",
    "text": "This one star review is due to the owner, Raymond. I was having dinner last weekend and there was another group having dinner and the lady at the table was yelling out gay slurs and when Raymond came in he did absolutely nothing. The staff was handling it, and another customer actually confronted the lady. He should have removed them from this restaurant as this shouldn't be tolerated. This is unacceptable behavior that he allowed to go on in his restaurant. #hatecrime. I won't be back to this restaurant!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0ZvidFl9nw0l1v8yEUh98Q"
  },
  "d-b6Bp3s8h13o55BaZjXCQ": {
    "date": "11/6/2017",
    "text": "After reading the other reviews I'm completely confused with the negative comments. This place is amazing. We always order take out from here and the food couldn't be tastier! Never had a bad experience and will continue eating at this little gem!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "D1Fo0RBraja_asp0FARACA"
  },
  "EWAFd4NxS5RghfUCLCUavg": {
    "date": "1/20/2018",
    "text": "Seeing a sign saying voted best in Phoenix next to a huge A health rating sounds like a good bet right? No. So I ordered the spicy orange chicken and my friend ordered the \"crispy\" honey chicken. With your dish you get chicken. Oh, and a bowl of steamed rice, it was mostly chicken. The crispy honey chicken wasn't crispy. I'd really rather have smaller portions in exchange for some veggies. Nothing really had a flavor worth savoring. And as far as the A rating goes, how clean is a restaurant where everyone's shoes stick to the ground? Great potential but definitely not worth the time or money. We actually left without paying and with less than half out food eaten due to such poor quality and execution. Oh, and after reading this to my friend before posting, he clarified to me that the health rating is a year old. WHY IS IT STILL UP?!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EvmrJGXrG0MC6wTAXry8Fg"
  },
  "kHcunzDtjNNRLGKT1-A0pw": {
    "date": "11/25/2017",
    "text": "I have been going to this place for over 4 years, always great food and prompt service.  Carli was amazing last night and we got the Orange Chicken and the Duck with brown rice.  Can't wait to go back and have more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B2MrLSCs6e5Uxdk-1_sEcg"
  },
  "PEU_xDeLXRJgaCS71ymoMQ": {
    "date": "7/24/2018",
    "text": "The walnuts were wonderful the shrimp was large but the breading was off not crispy enough for the walnut shrimp the lo mein also had no cabbage.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cJu1F3zJAKUO3FvLWEpDzA"
  },
  "MXlwE6MmJXbm9dcRaWZB4A": {
    "date": "1/5/2018",
    "text": "These guys are consistently good. This is not fine dining folks. This edible, delicious delivery with an in-house pleasant bar-tender slash to go order taker with a drink if you're so inclined.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ftTu-zHEzdSVJ20IAblb-Q"
  },
  "_6VcN8FnXjPHSebNJIqr3w": {
    "date": "1/27/2013",
    "text": "Positive: The food! We had soup, chow fun, and the Peking duck. The chow fun was exactly like at home. The Peking duck  was served exactly how my sister liked (lean, less fat). Also, great service. My sister and I felt incredibly homesick after eating here.   Negative: I wish the Peking duck was served on a bao instead of in the wrappers; however, my sister informs me that the wrappers are more traditional.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "k8q9sTzSvGBanJliz8_jyg",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. Peking duck. My sister loved that it wasn&amp;#39;t fatty at all.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/k8q9sTzSvGBanJliz8_jyg/o.jpg"
      },
      {
        "img_id": "gGRcilmYQyxAMv3EnucvkQ",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. Honk Kong style beef chow fun. Just like back home! I&amp;#39;m so happy.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gGRcilmYQyxAMv3EnucvkQ/o.jpg"
      }
    ],
    "user_id": "9hBGfpru1ytlpHrUpzCi2w"
  },
  "we4DZaf8X7p11raE7y17Lw": {
    "date": "6/7/2018",
    "text": "This place is trash. Garbage. Not only the food but the service. I had servers walk by me and ignore as I waited for pick up and the food was horrendous. Get new cooks and staff. Asap. Bad for business.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KwYxmt5BNYQgAe1xmM6XrQ"
  },
  "8nz9jwq8BmG5zb4wurLeRw": {
    "date": "3/25/2017",
    "text": "General Tso chicken is DELICIOUS!! Cashew chicken is pretty good, the veggies in it are fresh for sure! No complaints here!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lrOzvYYOJqmbNM8du7DHIA",
        "caption": "Photo of Autumn Court Chinese Restaurant - Phoenix, AZ, United States. General Tso chicken cashew chicken egg fried rice and egg drop soup ordered for delivery!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lrOzvYYOJqmbNM8du7DHIA/o.jpg"
      }
    ],
    "user_id": "2gN1boUZaISy-f-ZLpaTwQ"
  },
  "m2gbx1qHHs_D2e4Y1lETaw": {
    "date": "10/29/2016",
    "text": "This restaurant has the feel and atmosphere of a nice family restaurant. Service is outstanding and our server was very attentive. I ordered the szechuan chicken and my friend got chicken broccoli. The means were decent, flavorful and appetizing. The portion on the szechuan chicken was smaller than the chicken broccoli. Other than that we enjoyed our meals and had a good time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SGobMWMf7xwbOYHL6WMXyw"
  },
  "sXivkBCUPXdJqPjjx6y8UA": {
    "date": "7/19/2016",
    "text": "Came here for happy hour with my Moms and was taken back by how great everything was!  Food was great and fresh! Ordered a spicy tuna roll that was actually a bit spicy unlike other places (I dig the heat!) Also had an order of potstickers that seem to filled with a homemade sausage that had a great bite to it! Excellent flavor and completely different than most other places. Lastly, we shared an order of Wor Wonton soup that was filled to the brim of the bowl with everything you'd expect!  Arvand, the bartender/server has a personality and customer service as unique as his name!  He was clear and concise with helping me choose some happy hour options as I had not dined here before. He also presented us with many options as to sauces and sides..he REALLY knows how treat customers!   With so many great options around Autumn Court, it was an easy explanation as to why I had never been inside before, but after today I will DEFINITELY be back and tell my friends!  Thanks Arvand and Autumn Court!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "cY-Vq-6yB6TlGlh6VkUBZg"
  },
  "6bWdpRoAi_oUdjIotNzb1A": {
    "date": "10/27/2017",
    "text": "Our family and I have been coming to this delicious restaurant for over 15 years and it's our absolute favorite Chinese Restaurant. The service is pleasant and welcoming. The menu has great dishes and taste amazing! Some of our recommendations are the Bean Curb Soup, Szechuan Eggplant and Dan Dan Noodles! Raymond the owner is loving and treats the customers with a great deal of respect. This is a must try-hands down!! Super Yummy!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dwL3libOPRRyLajp7bFJ3w"
  },
  "HmAzcHOEZ_PQdK4KhjYFNQ": {
    "date": "5/12/2017",
    "text": "We hadn't been to Autumn Court since they moved locations from Central Avenue, so obviously a long time ago!  We decided to stop in for dinner last night and had a good experience.  Friendly staff, nice atmosphere and tasty food.  Just for checking in we received a free fried wonton appetizer - nice!  I ordered the beef with string beans and really enjoyed it...so yummy, but quite salty.  The portion was so big that I was unable to eat it all, so brought it home for lunch some day this weekend.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "cMEtAiW60I5wE_vLfTxoJQ"
  },
  "wjwa87OWQid3VX2cSBeHAQ": {
    "date": "5/29/2018",
    "text": "One of the best Chinese restaurants I have been to in Phoenix. I have gone here twice now and it hasn't disappointed. The teriyaki chicken with broccoli was good even when I took it to go, and the spicy orange chicken while not very spicy, was still prepared very well. The upgrade for fried rice is definitely worth it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sbJVMxofxw9pvPK_XH25mg"
  },
  "KwKWfQECqZlFv65_E72dzg": {
    "date": "9/18/2017",
    "text": "Nice service and ambiance, but the food just isn't very good (soups being the exception.) We had lunch there, I had the eggplant with chicken, the only flavor was \"salt\" - no spice, no flavors like ginger, garlic etc. Just lots and lots of soy sauce. The eggroll was kind of cold and greasy. The iced tea tasted a bit funky (like the container needed a good scrubbing.) The hot & sour soup was quite good.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U5c0OxHv_RkF-zvuOF6dOg"
  },
  "TIFGU5J7VqAb_vevx_-pjA": {
    "date": "12/25/2009",
    "text": "I love, love, love the House Fried Rice here.  They do not skimp on the nice size shrimp, the biggest I've seen in fried rice anywhere around here.  A healthy portion of chicken, beef and pork as well in the rice. The House Fried Rice is like $10...they raised the priced a couple of years ago.  If they raise the price any more I will have to go find some good competition.  Another favorite of mine was the Hot Sizzling Rice soup...very good.  The soup portion is huge! When they brought out that big kettle of a server bowl I was like wow! I've never done delivery as I live extremely close.  I love the atmosphere inside.  It's a great date place. It's a lot smaller than there original location downtown...However I'm not complaining because it's around the corner from me now! YAY!  I wouldn't bring small children.  The place is small and any screaming kids would definitely be heard throughout.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "rPrBGjBeB99ExxKp-HkB4w"
  }
}