{
  "AxpRsjjbtzeGvUh60heeCQ": {
    "date": "12/13/2014",
    "text": "Two out of the last three times the quality was very poor....burro with very little meat and enchiladas with very little cheese...and they skimped on the beans and rice too......called to complain to management and received comps for next visit but really disappointed in recent visits.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WnEsmKIXVP4mEUudlESpxg"
  },
  "8Ye_tiuLn98pYtgtim2FxA": {
    "date": "6/26/2013",
    "text": "Only ate here once.  The service was nothing to write home about.  The food is very lackluster--tastes like they buy all of their ingredients in the \"Mexican\" section at Restaurant Depot and throw them together to fool the gringos (whom, I might add, appear to be the ones here on Yelp who gush the most about the food).  Not \"authentically Mexican\" and not all that delicious.  Not the worst I've ever had . . . but don't go there believing the hype--you might be just as disappointed as we were.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "qSJdtutqvDrZQSXcHXyBwQ"
  },
  "8QmVIPGf9uCECz8FJPRLig": {
    "date": "6/1/2016",
    "text": "The food is good, but...They need to do something with the drive thru situation!  I have spoken to the manager before and no one seems to care.  If someone's food is not finished when they pull up to the drive thru window, ask them to go to the end and keep doing that if the food is not done.  Seriously!  We have been in the drive thru right now for 25 minutes waiting because someone probably just called in their food and then sat at the window while it was being cooked.  Have some professionalism!  A lot of my friends have already stopped coming for this reason.  Business will start to show the frustration of customers!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SVnekZsf2kPWf-8lZFbOFA"
  },
  "MGCaT1sqZFf1EwMk68dsMw": {
    "date": "9/28/2014",
    "text": "My mom is obsessed with this place, I think mostly because of the huge bags of tortilla chips that she eats for days but anywho the only thing I ever order from here is the chicken or cheese red sauce enchiladas with rice and beans. I do looooove it and sometimes if I'm in the mood for their meat quesadilla/cheese crisp. Other than that I don't really like anything else. Their little containers of red salsa is eh and the large container of chunky red salsa is so gross! I don't know why my mom orders that too all the time but it's flavorless and it just has the wrong ingredients for red salsa. I gave it a 4 star because I love my same exact meal every single time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I9Mu63_OC1020h30fOQ7dQ"
  },
  "B4KrRaZtp2waoSnoX27HJQ": {
    "date": "12/27/2013",
    "text": "We have been regulars at the Tempe and Chandler Mall Someburros for years.  A family owned restaurant with old family recipes.  You order at the registers then they bring you the food, so it isn't fancy but, it is delicious. The prices are super reasonable and the usually have a daily special.  My kids love the bean burros or chicken taquitos.  I love everything from the big burros, pollo fundido (like the sauce on the side), tacos, tostadas.  My favorite are the refried beans. I am not a big fan of the rice but my kids like it.  At our annual Cookie Exchange with my Tia's we serve the mini-burro platter (red, green and bean).  My family is Mexican-American and they eat the eat them up.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_KwXu_HeUkjDxo08LB5BOA"
  },
  "6w19QWuj3lFkL1rL8K3duw": {
    "date": "9/16/2014",
    "text": "Great fast serve Mexican.  All made fresh.  Love the El Diablo breakfast burrito and their beef tacos.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dx7PE_lXqKMXnr7Ra7ctTQ"
  },
  "FA9Zo7ymQt2ktfXugT0Dng": {
    "date": "5/10/2011",
    "text": "I have been to Someburros a few times now... and I have to say I am not too impressed with this place on this trip I ordered the Crudo Burro - (Tender machaca beef combined with a spicy, light green tomatillo sauce with beans. The beans had no flavor really I covered them with salsa the burro had way to much extra tortilla but the meat in side was really good could have gave me a pile of that on my plate would have been a better meal... So I am not sure if I will go out of my way to revisit this spot.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9mBk0DtOMo8Q5iVLIIU-yw",
        "caption": "Photo of Someburros - Tempe, AZ, United States. Crudo Burro",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9mBk0DtOMo8Q5iVLIIU-yw/o.jpg"
      },
      {
        "img_id": "yaRiK_hH82E4pUlzD8ebqg",
        "caption": "Photo of Someburros - Tempe, AZ, United States. Free chips with every meal.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yaRiK_hH82E4pUlzD8ebqg/o.jpg"
      }
    ],
    "user_id": "PNx1x8x3wjTIjrjhaNiVAQ"
  },
  "spO1tGykN7suuKXE8I5mBg": {
    "date": "1/21/2015",
    "text": "Food is amazing and authentic! The margaritas are worth using a gift card. The customer service finishes the deal! Great f-ing place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BHC4aak2vDva3rNARsTvIQ"
  },
  "q1y-HcNxT-170o4csM2itA": {
    "date": "3/17/2008",
    "text": "Amazingly good Mexican food for the price. The atmosphere is cafe style with a comfortable feel - much nicer than most of the taco shops around town.   The salsa they give you with the complimentary chips is amazing! The taco and tostada were perfect, the rice and beans dead on.  A great lunch destination in south Tempe.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "PeLGa5vUR8_mcsn-fn42Jg"
  },
  "4KVo7rJ0indVgnFp0C8Rww": {
    "date": "8/23/2014",
    "text": "Saw the article about the \"magical\" burrito and decided to finally try this place.  It seems a tad pricey for what seems to be a taco shop, but the employees were friendly and I am guessing by the amount of time it took to receive my order that they are all made to order.  The main issue that I had was I had also gotten 2 chorizo, egg, potato  burritos and added cheese, can't really recall any potatoes, but there sure were A LOT of egg shells in my burrito.  The Fundido burrito was pretty good, better with their hot sauce, and the chicken chimi with red sauce was good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AqNZpf9MxHwOVxckwQe-2A"
  },
  "98ZspzcWwfY20LL47Bpnuw": {
    "date": "5/3/2016",
    "text": "Ordered 2 shredded beef and 2 chicken tacos on line.  The price on line says $2 a taco but the receipt I got shows $2.65 per taco.  Called to let them know and they said it might not be working on line.  Offered a gift card if I came back in but I was already home.  Anyway, buyer beware, check your on line total before you pay and at the store.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "47EfPcPiA3i29Mf-1qF5EQ"
  },
  "nn1Q4eknCDMjTdP-6PbMwA": {
    "date": "4/14/2016",
    "text": "They always forget to put in my order when I call for carryout. I'd think twice about this particular franchise. The one in Chandler is a lot more professional.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sFWJowbm-s1y4ueRFgwgJQ"
  },
  "35MNtC9UL0w8EhP9oLP3jQ": {
    "date": "8/2/2014",
    "text": "Tried this place for the first time the other night. Ordered to go and was really surprised when I got to the restaurant and the line was just about to the door. I ordered a bean tostada, rice & beans and the vegetable salsa and guacamole. The bean tostada was not impressive at all. Very plain. But, everything else delicious. I loved the salsa. I will definitely try something they're more known for next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2FW674BBeqC5HIibRHLR1g"
  },
  "dPssuQT0a9dSkXWkCOxboA": {
    "date": "7/29/2012",
    "text": "The food is not bad, it wasn't the greatest.. I went to a different location years ago and thought it was really good, so came to this one and the food is not the greatest, but not bad either.    The place was pretty clean so that was a bonus.  I just didn't like the attitude of the girl who took the order... but what can you expect from teenagers, really?  Probably won't be back in anytime soon but will always give something a second chance.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AsILb2vtauGB-13pEvYHpQ"
  },
  "CybNGERhwKbfpEWVBldj-g": {
    "date": "12/31/2011",
    "text": "The chips and salsa are great in that they're free but the taste really isn't great, so I rarely eat them...  But I do SO love the Pollo Fundido! Chicken is tender inside...ample jalapeno sour cream and a little bit of cheddar--YUM.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gYjP8zOIJaXh9MrhqqzwRg"
  },
  "SPsBYH8j1gYWXOyRbG-Lkg": {
    "date": "8/14/2014",
    "text": "Best bean burro in town for me, love it with guacamole.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iu4dH0Njv4SLqinixOibRg"
  },
  "RVKJfh9IV4nBv2mfMDpo2Q": {
    "date": "2/14/2014",
    "text": "Familia.. it's all there.  I've been enjoying this place since I landed in az back in the day.  This was always worth a few miles walk. This is the middle range between filberto's and a fancy Mexican restaurant.  I come here, and can only think of family, and of a friend place to have tacos, and salsa.  ditch the taco bell, del taco, chipotle chains and hit this Arizona classic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xK3LfgHZuV8-Ps4Qkr4Hvw"
  },
  "m6OnE68hLhg7eraqY9Gz0g": {
    "date": "6/17/2013",
    "text": "Meh. It was really nothing special. I should know better than to stray from America's Taco Shop.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NFsYoZj1A1d5m5q0n7gFrA"
  },
  "oiCMVO7ss5BCwnVjKyswkg": {
    "date": "1/4/2016",
    "text": "Consistently one of the Best Mexican food restaurants in Arizona!!! Tacos are great!! Pollo Fundido is top notch!!! Love the Hot Sauce!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "isVlOM0tO9bI9wc70yKbNQ"
  },
  "oS0nOuLz8zy-OBxbGTQoiA": {
    "date": "5/13/2013",
    "text": "I am a big fan of Someburros, I have been coming here for a long time and I am sure that some of how I feel about this place is that it holds good memories for me. They are always friendly here, it is casual, and you can just sit and talk and eat chips.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vKU-uYCza9gpvCNuCGbWZg"
  },
  "SmMYhVg3F6Q7BYXWyAQeAg": {
    "date": "11/1/2013",
    "text": "Got a taco salad today for lunch and it was pretty good up until I had seen how much water was in the bottom. I attached a picture of how watered down my taco salad was. It ruined it for me. The only thing that was really good was the top of the taco shell.   I'm glad they wash the lettuce but I guess they don't bother with trying to get as much water out of it as possible before putting it in your food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3-cJv2McqpN3l3r3VY4W2Q",
        "caption": "Photo of Someburros - Tempe, AZ, United States. My taco salad with tons of water at the bottom. Gross",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3-cJv2McqpN3l3r3VY4W2Q/o.jpg"
      }
    ],
    "user_id": "u5-4faaS0_nBx87lagWHow"
  },
  "Zb21qhmNr9HVouYXvsv9ug": {
    "date": "7/26/2017",
    "text": "I love the food from Someburros, but every single time I order online or over the phone, something is missing or wrong with my order. These people are in such a hurry that they don't take the time to review the order upon taking it or placing it in the bag. So frustrated.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qTRB6zIjbt8Jwnx9hW9Kfw"
  },
  "EKc1-e23Ah-LrzkqRCZGbw": {
    "date": "11/29/2016",
    "text": "The food here is decent- albeit a bland for my taste when it comes to Mexican cuisine. It's a good place to stop by if you're in the neighborhood and are hungry, but I wouldn't go out of my way. I've lived in Tempe since 2000, and I've been to this location several times over the years. I was there last weekend, and my food was alright; but as I stood waiting to place my order, I watched through the window into the kitchen as one of the cooks picked up food off the grill and snacked on it as she cooked. For some reason this really grossed me out... the hand to mouth while she was in a cooking environment was just seemed inappropriate. My husband and I were meeting friends there, so I sucked it up and ordered to avoid being a drama queen... but I probably won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TzfCd4D3e3hr-858wlv2ww"
  },
  "RO2I1mftQn1dCe6r3e_VSA": {
    "date": "1/30/2017",
    "text": "I love Someburros. The chicken burrito is so tender and moist. We also ordered a open face cheese crisp with green chilis. Yum! U have yet to find anything bad there. This was their original location but...... there are many , many  more. Give them a try you won't regret it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "62G8kBc2MfDNP-ReecQhZA"
  },
  "8ilJ8U7Fn-QqWM0eVX-L3A": {
    "date": "5/4/2017",
    "text": "Very rude staff on drive through. Today they had a bean and cheese burrito for 2.50. I requested no cheese and they told me I had to pay FULL price! Prior to this they had messed up on three of my orders all on separate occasions. They don't give you chips to go but if you request some they will give you a small bag for free!! But be prepared for attitude when you do ask. I've given this place several chances and have overlooked the staffs rudeness, but today telling me I had to pay full price to omit the cheese was ridiculous and I will no longer go to this location!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RdvsxNyEdBYSJgE6C0P3FQ"
  },
  "_LzB0RzdLkrZLjIocHNJUQ": {
    "date": "1/30/2016",
    "text": "Love the food (and that you can get breakfast all day), the drive through for call ahead orders, and the margaritas.  I agree with the previous review about the ballsy birds. Don't feed them if you don't want them to join you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6nXUIU2XBvp62xrTQ4X8Ew"
  },
  "fywciXSTf_dq3RBHCxNf0g": {
    "date": "6/17/2015",
    "text": "Anytime I travel out of AZ for work, my husband knows to have a Three Way burro ordered and ready to be picked up on our way back home from the airport.  It is my comfort food, for sure.  My company also uses them for catering and their platters are pretty awesome if you're looking for that sort of thing.  They always send plenty of chips and salsa too.  We've never had an issue with them failing to arrive on time or failing to provide what was ordered.  This location is great and accessible right off Mill Ave and Baseline.  I have only dined in a couple of times, the rest of my experiences have been with phone/web orders and the pick up window.    Ordering online is SO easy!  I love it when I don't have to call a place and deal with background noise when placing my order.    The restaurant is clean and all the staff have been very friendly.  The drive through staff is amazing.  They always double check the order to make sure you're getting what you ordered and are sure to include extra hot sauce.  I LOVE their chips and hot sauce.  Another reviewer said it is ketchup based.  WHAT?  No.  Honey.  Just no.  The salsa is your usual watery pico de gallo type salsa, whereas the hot sauce is all ground chilis, tomato and garlic yumminess.  I will eat it until my tongue is trying to escape the inferno of my mouth and my nose is running.  It's that good.    My favorites are the Three Way Burro enchilada style with green sauce, or Three Way Chimichanga, if I feel like blowing my calorie allowance for the next three days.  I've also had the Rod Burro which was good, the pollo fundido, and their tacos.  Tacos are pretty basic, nothing special, standard tacos.  Get the shredded beef, they are tasty if they are hot.  Their rice and beans are also good, but it is hard to mess that up.    Give them a try, for the price, the ease, and the convenience, your money is better spent here than at Fili-Bs, Taco Bell, or any of the other Berto's chains.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FtAV7wSo0rWGaQ9YQTH7Jg"
  },
  "0o7fNMdsaiYOHZjUqsOt9A": {
    "date": "1/11/2017",
    "text": "One of my favorite places to get a burrito. It's not the most amazing burrito but it definitely is on my cravings list of places to eat. The staff is extremely friendly and the food is always good and quick. It is definitely better than the majority of fast food Mexican spots. I always go for the red sauce.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DNeFU7A7s0cbAIsisyuEVQ"
  },
  "LdiZ5vdF7m0bSLf4fAAJLQ": {
    "date": "1/15/2017",
    "text": "I ordered a side of pinto beans , got it to go, went home, opened bag to find refried beans. Receipt says \" pinto beans\" Ridiculous. Learn English.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xFibhJKlTdJ2h1qZ61ZIYQ"
  },
  "T0PH6v0zKSl4ZBWTopElxQ": {
    "date": "10/10/2013",
    "text": "Decided to take a break from Chipotle and check out this local chain. We got a few different burritos and tacos. I'm a sucker for good Mexican and this was pretty darn good. I mean it's semi-fast foodesque, but not so much as Filiberto's.   I've only had my meals to go, so I can't comment on the dining experience, but the staff has been helpful and I like it when they include lots of sauces! Arrriba!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_9WKSGfBn193Wl3vd7kt1A"
  },
  "Pkwtws85NVh4XRF_zEZhHQ": {
    "date": "3/2/2017",
    "text": "Cheap and tasty food. Watch out for the salsa it packs a punch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0yFjo5jaEtXaGNlfhG4uvQ"
  },
  "3EKopjWZVm2I0LZKbGcCRw": {
    "date": "1/24/2016",
    "text": "We had lunch here this afternoon! Many options! I ordered breakfast, my husband had a chicken burrito specialty and my daughter had the ninos bean burrito combo. We all enjoyed our lunch. The restaurant was clean and the meals were served quickly!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IJC57oohiFzfdkfyXP1AUA",
        "caption": "Photo of Someburros - Tempe, AZ, United States. La Sonrisa. 2 cheeses enchiladas with red sauce topped with a fried egg.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IJC57oohiFzfdkfyXP1AUA/o.jpg"
      }
    ],
    "user_id": "S24tykAZ_IfV4blhGt5dmQ"
  },
  "CuYfhEHfoL40BP13kV4e2Q": {
    "date": "11/8/2015",
    "text": "Breakfast was a little bland, service was good, probably won't return for seconds anytime soon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZCbuxxdg0F6a5g6YybxXTA",
        "caption": "Photo of Someburros - Tempe, AZ, United States. Breakfast",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZCbuxxdg0F6a5g6YybxXTA/o.jpg"
      }
    ],
    "user_id": "dWu61bxjG3vrlhAd8LDa1g"
  },
  "BE0uF4G2NAdFRmb8yDG4kQ": {
    "date": "7/24/2016",
    "text": "I am Mexican, and went here on a Sunday thinking it was going to be great. To be honest the food was not good at all. The salsa had no flavor and they only have red salsa. No salsa options, and the food has no kind of seasoning at all. I think a salsa stand would be good here.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AevCMwDd0j62vetpDymZrA"
  },
  "SqYco_DF5nm7FSp7JN3cqw": {
    "date": "7/10/2015",
    "text": "Went in for some lunch and got a deep fried chicken burrito with cheese. It was pretty good, as were the complimentary chips and salsa. For the time of day they had a pretty steady flow of business but they were fast with the food. I'll probably check them out again and maybe try something different.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yGXKMV1omio1I_3qNLdtAA"
  },
  "DMhpWWa2jZf2JoaZNeKDqQ": {
    "date": "10/2/2016",
    "text": "This has been my go-to Mexican restaurant for a while now. Great customer service! Everything I've tried has been good. Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gkd3V0X8friUlSH1xioMlA"
  },
  "GsDC4GMMwErp8oZSEub0IA": {
    "date": "12/29/2016",
    "text": "Love their food. We eat here way to often. Very authentic food. Atmosphere is great. Staff very friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g1y8xTIthVUHadCwIBn57w"
  },
  "SPGk_5t69JGRbsWT6dm7Yg": {
    "date": "9/18/2014",
    "text": "Idk what these poor reviews are about. I love the staff and the food is on point. They are always gracious, even at 9am when I show up. I grew up eating nothing but Mexican food. The borracho burro is a must try if you like green chili.  I come here almost every Thursday. Definitely a good weekly treat. Also, the place looks fantastic since the remodel.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "mfdb2wCYv7yiu0fyzFKMBg"
  },
  "P4V2jUKl7iIwL-HCsaLjyA": {
    "date": "8/29/2015",
    "text": "This place is consistent, friendly and clean.  Love the food, music is authentic, just wish they served a mild salsa for chips.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M7DMa0CIYW2yFtqJcgOOLw"
  },
  "Rpov-85Tnw_nPLLkR6foVQ": {
    "date": "5/12/2015",
    "text": "This is the place I go for Mexican food in the south tempe area, the prices are good and the place is clean! Love the enchiladas and burritos. Recommend the tea!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OgR807T8aPmCOumFDTVsMw"
  },
  "rJV2yEzT1y_ibsy8jUMkvQ": {
    "date": "7/7/2009",
    "text": "My husband likes them, I don't.  He likes the bean burritos with cheese and sour cream, but at around five bucks each and nothing exciting, I would definitely go elsewhere.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DyejokcqogJkUo3AD5iJsQ"
  },
  "HZ1hjmm92h9GFUw8-883wQ": {
    "date": "2/14/2010",
    "text": "Wanted to try a new mexican fast food place in south Tempe and regret the choice.  Subtly rude service, and the food was worse.  Ordered the cheese-crisp (quesadilla) and it was soggy, torn, and looked repulsing.  Not to mention it was lacking cheese.  Also ordered a chicken chimichanga.  Can't say I was shorted on the chicken, that's all it was.  About a pound of white (and some dark) meat chicken packed in clumps into the tortilla.  Again, couldn't find the cheese.  Maybe they ran out.   Needless to say, had just a few bites and the rest went to the dogs.  I wish Los Taquitos would have been open at this hour!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VIfu9Kd4f-5bVLHciXbo_g"
  },
  "SVpB1EmNJStgZHNJ_pW9ng": {
    "date": "1/28/2010",
    "text": "This place has amazing chicken flautas. I love, love, love them. The rice is especialy flavorful. It's nice that you can sit down in a casual environment but they still bring the food to you...the serve complimentary chips and hot sauce, but their \"veggie\" salsa--really just regular salsa is delicious instead but you have to pay for it. The guacamole is just okay...it's pretty much just the mashed avacado with nothing else in it. Very reasonably priced. If I could make one suggestion it would be to include all white meat or at least offer it as an option. The meat in the pollo fundido is kind of iffy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rLWOo_yqYlnLYOZi_4Ck9A"
  },
  "rxFJOpdOyYe1L93ByglcbQ": {
    "date": "4/12/2011",
    "text": "Decent mexican food.  It is pretty good when you need a change from Chipotle.  Good deals, good food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "21-Jx9uKXPChF04aOd-z5Q"
  },
  "Cq7bHpgnEMjbtO8fCiQCAg": {
    "date": "3/7/2011",
    "text": "What make Some Burros is their hot sauce. What usually makes my friends and I crave Some Burros is their hot sauce. As with all Mexican restaurants, their hot sauces usually vary and some are different. I don't know how well I can explain their sauce other than it's red, it comes with your food, it has lots of pepper seeds, and it's just the right amount of hot. We go through a TON of it. I don't understand why they have a bean burrito, plain, you have to add cheese...but when you add the cheese...yummers. Their tortillas are nice and soft but thick and strong at the same time. When I ate meat, I discovered their Shredded Chicken and bean burrito. Holy cow! Most juicy and tender chicken ever...so delicious with beans and of course I added cheese. It seems like a crime to even put sauce on this particular burrito it's so good. The rice here is good. I usually don't eat crunchy tacos because of the oil and shell but they don't serve them soft here...and let me tell you...their shredded beef taco is yummer-ee-no! Enchiladas good, quesadilla good, chips and hot sauce, yeah yo. Overall, standard Taco shop prices, consistent food, good quality, hot sauce it great, and plus one for having a pick-up window for phone orders.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-T_cG-7YFFvD3Cdu3v4ZYA"
  },
  "ZLt6ZV952qqmX6LrmY1ifw": {
    "date": "5/19/2009",
    "text": "I think I've been to all five locations. Love the tacos, but my favorite is the Pollo Fundido. The chips to start are great and did you know if you put the salsa bottle down to fast it'll shoot salsa straight up in the air? Try it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CT_e_R8o2NV05X7uMi_aIA"
  },
  "qbVbfH6llT94EdNsNKODsA": {
    "date": "10/25/2007",
    "text": "Bean Tostada. Side of rice, small Diet. This was my mantra for years at lunch time - I  used to go for lunch almost every day, and still go frequently. My whole family loves it. The beans and rice are killer - so fresh and homeade - I am hungry thinking of them. The chips can be not as good if they aren't hot, but normally are really good and salsa often has a slight kick that is perfect. We have tried it all - tacos - the shredded beef is SO good...tostadas, taquito's, burritos, enchiladas...etc...never have i had a bad meal here. Its also fast, and inexpensive. What's not to like?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "6bFS-F0rjzDsmJuFJDJ0kg"
  },
  "TCsjZTZeH3eriYLyWyONfw": {
    "date": "4/18/2008",
    "text": "cheesy, but great greasy mexican food. this place has my favorite hot salsa in the valley. love their veggie burritios and chips! super affordable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "bvUNFMTB28rDlG_Qx3HLDQ"
  },
  "uu1HvqKSrmOz58liBoQyjw": {
    "date": "2/26/2009",
    "text": "This place rules, my favorite fast mexican place. I get the veggie burro, it is bomb. Avacodo, beans, salsa and cheese. Salsa is good... Overall, great place to grab some good, quick grub.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "FRTed_TjXG-ocDy-638tGQ"
  },
  "p1bRJsp1Z80ebTJ7734r4Q": {
    "date": "4/9/2007",
    "text": "Someburros has this dish called \"Pollo Fundido\" which is basically a deep-fried chicken burro slathered in their \"spicy cream cheese\" mixture.  It's so bad (for you), and sooooooooooooooooooooo good. I recommend ordering it with refried beans on the side instead of the standard rice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "l5Fba-9TGiK9q0KqlaNUIQ"
  },
  "Ges0NFlRfOHyqlDxGWk9vA": {
    "date": "1/11/2010",
    "text": "had the bean burro. can't really mess up beans, but their hot sauce is too tomato-ey and not spicy enough.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rto4xWr5gXA2IbrfyAn-Xg"
  },
  "JIvwaWqUv-FR96fsiBiHMw": {
    "date": "2/17/2009",
    "text": "You have to love the shredded beef tacos and the pollo fundido.  This place has one of the best shredded beef tacos in town and the hot sauce is a perfect compliment to the tacos.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AvDvVFrHFBUia36pqmuOJA"
  },
  "IDqwtR8Xxm7aZXzc-g9UTw": {
    "date": "9/24/2009",
    "text": "Pollo Fundido! That's all I'm gonna say! That and wear stretchy pants!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s7CVf23voE7uH0tvz6GLQw"
  },
  "yFCKFa4ogIwcz16MyK4LcA": {
    "date": "3/29/2013",
    "text": "Wow, it's really been 7 years since I first reviewed Someburros! I'm still a big fan of the rod burro, but it's such a big meal that I usually only get it if I'm starving or sharing it with someone. Some of my current favorites are the cheese crisps with guacamole or with green chile, the veggie burro, the chicken and bean burro, and the tacos are still quite good. The salsa is still nicely hot and spicy, and the addition of carne asada, fish, and breakfast adds to their menu variety. While I appreciate that they're branching out with new foods, the fish tacos that I tried when they first introduced them to the menu were really not very appealing. They were overcooked, bland, and super oily. Hopefully they've perfected their recipe since then!  The outdoors seating is nice when the weather is not too hot, and they don't mind if you bring your dog with you to sit outside.   Sure it's not gourmet dining. But when you're hungry, craving a fast, filling meal for a reasonable price, Someburros is a good choice!",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 5,
      "cool": 5
    },
    "photos": [],
    "user_id": "DK57YibC5ShBmqQl97CKog"
  },
  "-HDL-k_6dDGMKpBXAUKTow": {
    "date": "12/10/2017",
    "text": "Last time I eat here! Food is so-so, and the service was rude. I have a small service dog that is carried in a pouch and was told to leave. Not a dog friendly place. Too many other good restaurants that want the business.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iOqEYlY2AkzgIqnGF1cjAg"
  },
  "xWwu-v9GkW2w4jJ9doXHuA": {
    "date": "8/4/2017",
    "text": "We just love this place the Pollo Fundido is the best!  The chips are always fresh and the kids love it too!  Their Salsa is ok it's the only complaint we have.  Always fast hot and great portions!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dt7GtX8WzgDAOA9c3-TV7Q"
  },
  "w-l4T3TaCUWEcsF4xfFYlg": {
    "date": "5/9/2018",
    "text": "Too many flies inside the restaurant to be able to enjoy our meal. Rice was great. The cashier at the counter was rushing us but there was no one else in line.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TMjkWCerZIcnFIeay5SWcg"
  },
  "G_9mAm5MXMNMEXtalvndeQ": {
    "date": "11/19/2016",
    "text": "The food is good but the staff sure doesn't listen! I told the kid at the register my order 3 times and they still got it wrong! I ordered my burrito enchilada style and got a plain burrito no sauce. How many time do I have to order before it's right.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "P6A0HzGCATWjQAkeODBETw",
        "caption": "Photo of Someburros - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/P6A0HzGCATWjQAkeODBETw/o.jpg"
      }
    ],
    "user_id": "Nu7n15mj7IR-vKpni8a3bA"
  },
  "-JN353nEalHDs3UOjVsbLA": {
    "date": "10/7/2017",
    "text": "Another place that is delish! I absolutely love the employees. I know Amy and she is such a doll, which is why I like to support this place. The chicken  tacos are on point and I love the enchilada sauce. Pretty sure my friend just ate an entire bottle of the salsa, while I prefer to dip because of the heat it carries!  Dog friendly patio is nice as well!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "brXxMktI7oz2ZelX7o3qpA"
  },
  "jJLhExB-TNswafqhxDR1Sg": {
    "date": "3/1/2016",
    "text": "I was there today and tried the pollo fundido that has gotten such good reviews.  And it was bad.  Really, really bad.  Too salty, not enough sauce and already limp and wet by the time I got it, and I ordered it there!!    $10 and I feel like I just ordered a salt lick.  And also, what is up with the \"salsa\"?  I think they are stealing packets from taco bell.  Will I be back?  Hell no.  That food was just nasty.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VB2loWbY1kSglVpMki90oA"
  },
  "eBZvsF_MS1Vt3biD_MlCtg": {
    "date": "9/24/2017",
    "text": "Terrible customer service in the drive through pick up. Woman was very rude and it doesn't take 10 minutes to get salsa that is already packaged and a bag of chips.... especially when the store is empty. Good thing the food is good",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OgEjaoVl4-KyqqQlvw9Q1Q"
  },
  "6rJ8Fn8gs2UP4-VdIZO9XQ": {
    "date": "5/6/2016",
    "text": "My family and I love this place for the food, but the service is indeed a little awkward but the employees are trying to do as good a job as they can.  Would be eating there right now if I could.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PbrFqVdsg_-N6-MnqvgNYw"
  },
  "sxOtE5z5RPJjJpCfBskx7g": {
    "date": "1/17/2016",
    "text": "I stopped in here for the first time today and the two stars is simply because the chicken burro was good and good sized. The tortilla was good too.   The customer service sucked. Gracie took my order and basically just stood there and looked at me instead of being friendly or helping me out. I ordered my food and then after some silence she mumbled at me that it doesn't come with anything in the burrito. Okay. That's fine. But she didn't go out of her way to tell me my options or anything of the sort. She mumbled my total at me, tossed the soda cup over onto my tray, and walked away.   I filled up my soda and stood there waiting for my food because it's an extremely nice day outside and inside was a little cold for my taste. I stood waiting for my burrito while the 4 or 5 girls working there stood there talking to eachother about clubbing. My burrito was ready and sitting on the food warmer (when I'm the only customer, I would think it would be easy to take care of the only order if there are 6 employees). One that was on her way out because she was off was kind enough to respond to my request to hand me my food. The other employees heard me tell her that I didn't see any point in waiting for my food while they stood there talking.   The birds outside are ballsy and will even fly onto your table while you're eating. Fairly alarming but also entertaining to watch.   Food: decent Customer service: beyond horrible  Birds: ruthless",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-uXJHWmuuyc8XBSzKLjv_A"
  },
  "1u55Crdjy3JZoxJ9Jn5GJQ": {
    "date": "12/8/2011",
    "text": "Its been over a year since I have had someburros and man I had forgotten how much I really like their red chile sauce, it's the perfect blend of spices and heat!  We had a retirement party at work and Someburros catered the event, there was green chile & red chile mini burros, taquitos and even black bean burros for our veggie lovin friends at work.   It was a great little spread, plenty of chips and hot sauce, sour cream & even guacamole.    Good job Someburros! It was perfect for the party!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 8,
      "cool": 7
    },
    "photos": [],
    "user_id": "bpgbVPJcG-wQ4cNBcPPIxw"
  },
  "JlLJWtQ_ZSXtG1YxdAnKHw": {
    "date": "5/2/2016",
    "text": "Very good food, I've had mini chimis in chicken and bean, Both are great! The tortillas are amazing, and the chorizo burrito is very yummy. My fiancee had the Carne Asada burrito and a beef tamale. The burrito was very good but he wont get another tamale there, the masa to filling ratio is very heavy on the masa and light on the beef (also beef filling has olives in it)  Some of the staff is lacking in service but overall I will definitely make this a regular food stop, probably mostly by phone orders and pickup. The web ordering is not quite there yet when adding an item to your order it has a space for special notes but does not allow you to type anything into it.  Location pluses: The last time I was there I saw that you can get free food (up to 10$) for your birthday. They have 2$ taco Tuesdays, and a drive through is available for called-in and online orders.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sUQz70Nv65DVfUqDonZGcQ"
  },
  "PkY7N-I8iHiYqXNKIS8P5Q": {
    "date": "4/3/2017",
    "text": "I love their veggie burro. Their salsa is amazing as is ttheir guacamole. Everything here is always fresh!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QLAJZCXS1CEjBOl9aEQENA"
  },
  "KhVPOalQdRKvbL4r5zigSw": {
    "date": "12/14/2015",
    "text": "It's the hot sauce.  I never drown any food in a sauce, juice, gravy, or condiment but I will drink Someburro's hot sauce all by itself. 1995 may have been the first time I visited here and the hot sauce has always been mild-medium in heat but packs a ton of chili-ness flavor and seasonings. So everything on the menu is just a delivery source. Some better than others.  The tacos are fried in what I call an 'upgraded' preformed shell. Much better than anything store bought and from any typical Mexican Fast Food joint. The tasty, well-seasoned shredded beef is fried along with the shell and there isn't an overwhelming amount of lettuce and tomato. There could be more cheese however. The somewhat-bland chicken version comes almost minced like the crab meat in a sushi roll.  The burros are above medium sized (although I haven't had the Pollo Fundido, those are big) and aren't double-folded. The red chili has very tender beef cubes and lots of flavor but almost mild in heat. The shredded beef is very good just as they are in the tacos. The carne asada burro has beans and potato in it - not my favorite version.  There's free drink refills and complimentary chips that are somewhere between really good restaurant-style chips and store bought. The outside seating is great when it's cooler out otherwise the concrete chairs can be used to re-heat your food. Don't feed the birds. The drive-thru is for call-in orders only. Seating inside is a little cramped. Tell the friendly folks at the front counter if you're in a group - they'll keep all of the orders in one number and bring it all out at once.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "H0or19jTnvDTtl3l9oKE6Q"
  },
  "JjdNV3Rx35YFXnyaz0vRtw": {
    "date": "6/26/2017",
    "text": "Their salsa is the highlight.  All in all good if you're in a pinch and definitely better than average.  Fresh ingredients.  There are better options in Tempe, but closer to campus not by this location.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YditFo3KuOYdjOFC1b_tLw"
  },
  "pQ5UaKGNbSqGQYHzlPHcHw": {
    "date": "8/5/2017",
    "text": "We get pick orders from here at least once a week and the food is always consistently good. The staff is friendly and if there is ever a mistake we call and the situation is rectified. Great example of a customers first attitude and a quality product!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ssu1HvFTdYGqM1nflpZRWw"
  },
  "vfxzlGel9buyskKC4oxfAg": {
    "date": "12/10/2014",
    "text": "Good quality fast food Mexican lunch for a reasonable price. It's consistent and it's clean. I like that they have gone green with real plates, silverware and glasses. Free chips and salsa when you dine in. The salsa is actually hot sauce and I like it.  I had the No. 1 combo which is a taco, cheese enchilada, rice and beans. It's served very hot, meaning right out of the kitchen   It's not a fancy restaurant, but it's 10 notches above a Taco Bell.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ox9oRW5d7TdJVPrAxZARGw",
        "caption": "Photo of Someburros - Tempe, AZ, United States. No. 1 combo which is a taco, cheese enchiladas, rice and beans.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ox9oRW5d7TdJVPrAxZARGw/o.jpg"
      }
    ],
    "user_id": "141lhbCGhduUaFs17MAnww"
  },
  "Hsh97JUzgd8TOqVy4pgkcg": {
    "date": "10/30/2016",
    "text": "My burrito (buracho-- green chili and cheese) was pretty good, if a bit small for the price ($7.45).  I would get it again.  The cheese crisp (a quesadilla any place else) with green chilies was also pretty good.  I would get that again as well.  I'll be skipping the tacos, though.  We tried the shredded beef, the carne asada, and the ground beef with potato ($2.50 avg. Per taco) -- none of which were any good.  The tortillas were soggy with grease, the meats were unseasoned and tasteless.  Well, except the carne asada.  It tasted like a chopped up charcoal briquette.  Ew.  There are many other places around doing better (and cheaper) tacos.  I would advise sticking with the burritos or the quesadillas here, you'll be happier.  Again, I must warn you against getting the tacos! It's that important.  If you insist, it is on your own head.  I tried to tell you!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "UV4PZQSad81lOg3Az6B7cw"
  },
  "8qh1yQlYjZok-qtrVJ9Rhg": {
    "date": "8/22/2017",
    "text": "Always amazing from the staff to the food, I've been coming here with my family for years and I'm not planning to stop. If you want seriously good authentic Mexican food at a great price come here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v-FB4e8X56S17FqidsqVnQ"
  },
  "FeFjaj4jCmFytgquDIcExQ": {
    "date": "10/15/2014",
    "text": "Super fast friendly service.   Great hot sauce.  The bean burrito is REALLY good. It's almost like dessert.   The fish tacos are pretty good too.  What else do you need?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ek9_ouSauPM3YhFKBfomUw",
        "caption": "Photo of Someburros - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ek9_ouSauPM3YhFKBfomUw/o.jpg"
      }
    ],
    "user_id": "U-EDeheH32QMarWHP3JUUg"
  },
  "9e3fJAklzRJT7-OQ7P07HA": {
    "date": "3/6/2014",
    "text": "The one fantastico thing I can say about Someburros is, the hot sauce is wonderful. Otherwise, they aren't very good at getting orders right, and if you try to order something custom, they will immediately become annoyed with you and rude.  My child, like most kids, will only eat very plain items.  I've been going there for some time and have been trying to customize simple orders for her...For example, mini chimis with no toppings, but they still can't ever get it right.  I finally tried to eat there at the restaurant with a family member, and they couldn't even make her the right item she ordered.  So when she told the server that it wasn't what she ordered, the server actually talked her back into taking the item he brought out.  The couple sitting directly next to our table had the exact same problem...ordered one thing, got another.  Adios Someburros!",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "IT-k_IxdLvOMLaL2Dg4iVg"
  },
  "z9MLF2vvN5CNpFaIqFAiMA": {
    "date": "12/22/2012",
    "text": "Horchaita was good as well as the free chips. Fish tacos were decent but it's still fast food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vZ8V8asW6eV7wjdMoVrang"
  },
  "ONTdyO1C2_u267E1w3kPHg": {
    "date": "3/17/2014",
    "text": "If i could rate the food and service separate, the food would be 4 1/2 stars and the service 1 star. When we moved to the area, I was so excited to be fairly close to a someburros cause I love the food. The first time we visited, the girl at the register barely acknowledged our presence, let alone looked up at us, as we ordered. When we pointed it out to the manager on duty he apologized, and we were treated better.  However, the young lady was upset and glared at us our entire meal. In the end we wrote it off as a one time, bad day.  The second time we came, they got my order wrong and when I had the nerve to ask for it to be corrected, I was greeted with annoyance.  Once again I pointed this out to the manager on duty and he apologized profusely.  This time we walked away with a gift card.  The next time we came in, I of course used the gift card and the manager recognized me. I can assume that is why that visit went off without a hitch.   However, this time proved to be the breaking point. My birthday was a week ago. I tell you this because I got an email from them today regarding their new birthday special. Since my birthday was a week ago I assumed it was one of the regular emails were they were offering me a free entree because it was my birthday and it was just late. However, as we learned from the  rude manager on duty, we read it wrong, and it was only an informational email,  and therefore we would not be getting any discount. At no point, did the manager apologize for the misunderstanding or try to hide her irritation that I did misunderstand.  Customer service is a huge part of my eating out experience.  It's why i don't eat at fast food restaurants often.   As I told the manger, there are plenty of  places to get good Mexican food  around there, so we won't be going to Someburros again anytime soon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "F9JhxIEP4Vot7VzkxhqrgA"
  },
  "w6qMU8QpsxSOGvm5G8rX2g": {
    "date": "10/17/2014",
    "text": "Soooooo good! Love this place for fast and cheap but yummy Mexican food. My favorite is the carne asada tacos but my boyfriend never gets anything but the pollo fundido.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zm_SDYVjjWIUd_Ih2xupFw"
  },
  "7G2n4JH2Rejzf_W5XY7eVg": {
    "date": "7/10/2016",
    "text": "I honestly had no idea what to expect before walking into this place.  I imagined just another Filiberto's-type place.  My friend insisted that the food here is good, so I agreed to come along.  The restaurant is clean, cheery and bright inside.  Menus are in an easy to read format, posted up high on the wall so you can see them.  Even though this is a casual seat-yourself kinda place, the restaurant staff is constantly buzzing about, cleaning and bringing food.  Nobody was sitting around looking lazy or staring at their cellphones.  The girl who rang me up could've used a personality...she acted like she was trying to hide her annoyance that she had to take yet another order.  The rest of the staff was friendly and helpful though.  The food is 1000%.  We had burritos, chimichangas and cheese crisps.  I LOVED it.  I was disappointed that they were out of margaritas, but I'm fine!  Based on atmosphere, cleanliness and food alone, I'll be back....TOMORROW!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fs5a4W-UEgtPgb6pvdz4UA"
  },
  "IlVObRbITIGFZBNiPWuJbA": {
    "date": "3/15/2014",
    "text": "Waited for 20 for an average breakfast burrito. Average at best. Definitely nothing special about this place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_4EXNRQG4wTZPCF2Jatw3Q"
  },
  "QV4ler9InbNE-8KsEfU5jg": {
    "date": "1/19/2013",
    "text": "Someburros is one of those places that gives me pause. I've had poor food here before, but it seems to be specific items (their chicken), as other items are quite good.  This is definitely a gringo place. Everything starts bland, but you get a very nice hot sauce to put on whatever you like. They make a perfect quesadilla, but they call it a folded cheese crisp. (This is a nitpick, sure, but a cheese crisp should, I don't know, be crispy.)  Every meal comes with chips which are tasty. Their enchiladas can be greasy, but I'm not sure if that is a complaint or a good thing. I enjoy their ground beef and potato tacos, but again they are hella-bland. Keep the hot sauce handy. The beans and rice in the combo platters are solid winners.  The North Scottsdale location uses ceramic plates and honest to god metal cutlery, but this Tempe (Mill) location uses foam plates and plastic cutlery. In my mind, this says a lot for the location. Neither method of serving/eating food impacts the flavor, just the atmosphere. I imagine the Tempe location may save a little money on washing dishes/cutlery as a result.  In the end, Someburros is good if you want Mexican food, at a good price and are in the area. I would go only a little out of my way to eat there.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OaN8UG7flab58O525eRsgQ"
  },
  "0WhNJcpYMejTouBqlXEZ9A": {
    "date": "4/27/2015",
    "text": "Pretty decent place with a wide variety of food.  We had the nachos and I was pretty disappointed with them.  It's just beans with sprinkled cheese on tortilla rounds. The enchiladas however,  were super awesome and delicious.  On point.  Other than that I'd say just nibble on the free chps and salsa because the salsa tastes ketchup based,  but it is hot!  Also,  I enjoy the pricing because you get what you pay for in quantity and it's pretty cheap!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PzjCsCXxqd5aEWaFYz8gJQ"
  },
  "tA1gBHFBCqiZKPv6n21hJA": {
    "date": "9/3/2015",
    "text": "I tried this place twice and wont go go back. I specifically ordered a gren corn tamale and got a red pork one instead which didnt taste very good. When I picked up my food today the enchilada and beans looked like they had been sitting out all day long vs the rice and beans that were made fresh the day before. Very inconsistant and not good at all.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nTARoZvVwdmCjuEUn26dPg"
  },
  "2cAUihjcnvZAL_1XjQGuZg": {
    "date": "5/5/2014",
    "text": "I was looking for some good Mexican food and found someburros on yelp so my family went there for dinner. The food was good, but my fiancee and daughter end up getting possibly food positioning. They were up all night and the next day in the bathroom.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PfDNMteaP9h5U__ipdlDvA"
  },
  "eqEMjU3PyzU0UTP89V6ETA": {
    "date": "1/9/2015",
    "text": "Great little spot around the corner from our house. No frills, nothing fancy, but cheap and a good spot when you don't want to make dinner. I've had their burros, tacos, and flautas, all great. No complaints here!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X_Almk9cQAUVvOyOlI5kGw"
  },
  "kRLwCgRFWXYmX2uK1sInhA": {
    "date": "10/30/2012",
    "text": "The pollo fundido always seems to be the special when I go in. Always great. Lunch time is crazy so be prepaired but what great restraunt isnt.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ivl0fFfLdywN7IrOOoJMGA"
  },
  "k9Oi0NqEkHGxB3dUhIZeQQ": {
    "date": "3/1/2015",
    "text": "I've been a loyal customer for over 4 years at this location but had a horrible experience during my last visit. I was told that I would halve to pay for the complimentary chips that I had been getting free every single time I have gone before. I was also charged an additional 50 cents for extra lettuce GARNISH, but when I got my order, there was LESS garnish than normal. Of all things, the manager was the one to take my order and deliver my food! She was not accommodating and did not make any effort to better the situation which was very disappointing. She should do a better job of catering to the customer, making sure they leave happy instead of nickel and diming the customer on 100% complimentery items. Definitely will try to avoid Jennifer next time I am in. The other employees are always really great and helpful!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5hwL5HA3PGlZJ7LHcrrMyg"
  },
  "EFInGNVFFlQZNPLcDbdyzQ": {
    "date": "1/15/2015",
    "text": "Love the service and food here! Not as ethnic or authentic as Polibertos but one can never go wrong with their burritos or horchatas! A great place to frequent for lunch or dinner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zGXc3JEHWNrRXoQO61o2JQ"
  },
  "9EFWofJ0MIXNTgN9BoRmmg": {
    "date": "7/10/2013",
    "text": "So I ordered the carne asada burrito. It was almost entirely beans and rice. Maybe 10% carne asada. But I only noticed from the texture. Sure didn't taste it. From there I would say the burrito was ok, for a rice and bean. The best redeeming quality of my food was the hot sauce. Best I've had yet in AZ. But still only so so compared to what I am used to getting.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "97inj4vRltjx8qzboyg0Vg"
  },
  "LR5blHqPxZj6MdsdgBQkGg": {
    "date": "4/27/2012",
    "text": "Someburros may be my favorite Mexican place in Tempe. The enchilada I had was very good and the refried beans excellent. The shredded chicken and shredded beef in tacos were very good as well. My reason for really, really recommending Someburros is the honesty of the staff. After finishing our lunch and trying to manage busing the table and assisting my 91-year-old mother I left my New 32 gig iPad on our table. After realizing my mistake fifteen minutes later and returning to the restaurant a staff person smilingly assured me he had it. So I had a very tasty lunch and my faith in the kindness and honesty in people restored at the same time. Thank You Someburros! You are a great organization.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ugBsJsh-TWbwqQSmx-N0Ag"
  },
  "YvE46puB14Obd4jUgj-zrg": {
    "date": "4/15/2015",
    "text": "All the dishes I've ever tried here are very good. The only negative thing I have to say about this place is their horchata. Do not but it. I don't know what it is about it, but it's disgusting. Order a soda, and you're good to go.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I1ZwTMK2dlDEa49Hjck-Iw"
  },
  "bv_06nWYIrguN0PSn2zF7Q": {
    "date": "2/15/2015",
    "text": "Fantastic food and service. The carne street tacos are delicious. The service was friendly and personal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j1-fTYWz03im_d9tHb_rDw"
  },
  "PK-lf79pZGybaxTbDoEZvQ": {
    "date": "1/15/2014",
    "text": "Counter people need to know what they are serving. Three different people were clueless when I popped the \"white chicken \" question. Finally, they said it was white meat, but a chicken burrito at this place only contains chicken in a tortilla for 4 bucks. Nothing else is inside - that is not a burrito in my mind. I ended up with the egg, onion and potato breakfast burro, which was small, but pretty good. Everything was well cooked and it wasn't as huge as some other places breakfast burros. The hot sauce was watery and had no taste, but the mild was better with more flavor and still a small bite. Chips are not included to-go. This is some sort of americanized mexican food despite what they tell you on website. Might be back for breakfast again, which is great that is served all day.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ELcQDlf69kb-ihJfxZyL0A"
  },
  "MYr6jx-h6jgb6iYb1Q264A": {
    "date": "12/13/2014",
    "text": "Fantastic food!  Cool atmosphere. Seems to be pretty popular. Small place. Great selection. Sauces are fantastic!  Might be some of the best food I have ever had!  Would go here again in a heartbeat!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WXOTfr_Uf39JWXv4T-yqpw"
  },
  "BecuYZ8DBWnMTkRxUwjpIA": {
    "date": "7/1/2018",
    "text": "This is by far my favorite Someburros! The salsa is way better than the others around the valley. Also, I found the burritos like the bean and cheese and vegetarian to be much fresher and made with better quality. The restaurant is clean and really cute. Definitely a quick, delicious bite to eat!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XpfHohBCMBH3gQwtdQWQcQ"
  },
  "AFGMYLjOuEGkjMb_-kcnjQ": {
    "date": "8/3/2016",
    "text": "Quick, authentic Mexican food. I come to Someburros once in a while. Maybe not so unexpectedly, I always have, well, \"some burros.\" (apologies, I had to!) But, seriously, I don't think I have had any entree except the burros. I think I have had EVERY burro on the menu, though, and I have enjoyed them all.   The Pollo Fundido is rich and good if you like a little spicy -- I like to augment that one with the hot sauce that you get with the chips, which also helps cut the richness of the cream cheese. The Crudo (machaca and green sauce) is my go-to burro, but I wanted to mix things up and had the Borracho (green chili beef+covered in green sauce) this time since I wanted something smothered in green sauce.   If you like a lot going on, the Rod Burro has it all: green + red + beans + chorizo inside, then topped with more red and green... and melted cheese. I usually have to mentally prepare for something complicated like that.   The horchata is pretty good here , but there are no refills. From what I have seen around town, that is pretty standard, but good to know if it is your first time here.  It is a no-frills place, but the food is consistently authentic and served hot and pretty fast. You get chips and hot sauce to snack on while you wait, so it doesn't usually seem to take that long.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "QkNuVpkhV_wTApylrKOMDg"
  },
  "ggHZxB75867TmX0ubU1yIQ": {
    "date": "9/16/2016",
    "text": "Omg... TexMex.  I've always heard that word and never really understood it but, this must be it.  We went here the other night, after driving by it for a long time, and wow, were we disappointed.  We ordered three different things and not one of them would I reorder.  The Pollo Fundido was the best of the three but not at all comparable to a Filiberto's Chicken Chimichanga. haha    I guess we like our Mexican food from solid taquerias and this is more of a 2nd date kinda joint. The decor makes non-adventurous food people feel safe and... adventurous. I'm struggling to give it 2-stars... but will do so because of the laid back atmosphere and Orange Fanta in a bottle.   Won't see ya there.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xceJT1G2Yhel3W2lRxRTDA"
  },
  "_ugafZtSsVSm3DjWs6z1HQ": {
    "date": "4/18/2018",
    "text": "There are lots of Mexican restaurants in the area but Someburros rises as one of the best in Tempe. Food is good, staff is pleasant and the restaurant is a nice environment.   Highly recommend: Pollo Fundido with a Margarita, outstanding Sonoran style Mexican food for a good price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ggGJcgpqIp8_yab3y_9QAA"
  },
  "O3ArJ1QCLE9VKEyR1Rf2ZA": {
    "date": "6/18/2018",
    "text": "The food was excellent for the price! The staff was friendly, answering questions while we were in line. I accidentally left my purse there and they held it behind the counter for me until I could come and get it. Will definitely be back for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pkgcj62pXEQ25ErBe1oUXg"
  },
  "JMWrwXh3PvbA6RYT5Q86QQ": {
    "date": "12/13/2017",
    "text": "We always love the food!  Tacos = delicious Tostada = delicious Rod burro = magic Pretty quick service to...esspecially with how busy they are.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pzgB2O_XjnrjhUUPopr3dg"
  },
  "dH-8AYwYqKi_SFFbU412qA": {
    "date": "6/1/2018",
    "text": "If only I could give less, first they gave me the wrong order. Then came by actual order of chicken chimichanga possibly the worst thing I have eaten, the meat smelt funny ,the sause was bad, lost my appetite for the night, left all of it and left. I hate to waste food, and money too on the top.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3NQOl2qU2B4AdpGuvnoGEg"
  },
  "EXI9GLKTZRyYovjAw7L69g": {
    "date": "5/30/2018",
    "text": "We have been going there for many years. They are consistent with a great staff. Buros are of course great but be sure to check out the Mexican pizza especially with chicken or beef. Take out is great but be sure to call ahead to order. Every time we have done this our order is waiting when we get there. They use good ingredients and we have never been disappointed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ACCJI8-OHqsCtkXMB38Bvg"
  },
  "KrKDh2EbVJ5DRAzYqx424A": {
    "date": "11/15/2017",
    "text": "Foods okay.. service is really crappy though.:) Especially from the younger teen employees. Always have an attitude and roll their eyes after customers walk away. Just rude. Their job can't be that hard but oh well.  Edit- 2 min into food and already 3 short brown hairs in my food :( gross",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VXDWvpxomhEBeKZS2C5pjA"
  },
  "HxrYFoqK5wF-IGj03HkHIQ": {
    "date": "1/30/2018",
    "text": "Since I'm pretty much disabled I really appreciate drive thru's more than just \"convenience sake\", so there ONE salsa per item truly sucks. My only option is to buy an 8 oz salsa and that doesn't include chips. If I were able bodied... I could go inside and get my salsa free... WTH.  Guess what?? I went to my other favorite Mexican place just because of the principle. I had to struggle to get in, but it was still to go and I got PLENTY of salsa without the charge.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "67_gMW3miqK6EpENj_SlDA"
  },
  "I88YrHjE8qI7nVOBa7M73Q": {
    "date": "7/17/2016",
    "text": "Holy Frijoles! This place is TASTY! We were exploring the area (aka playing Pokemon Go) and stumbled across this little restaurant in the back (which is also a Pokemon gym f.y.i). We ordered a bean and cheese chimichanga with green sauce and two shredded beef tacos. The service was courteous, they never mentioned that they were closing in 20 minutes, they just were sweet and smiling.   We got our order within 5 minutes and not only was the presentation appetizing but the smell was intoxicating. We stuffed our Pokemon trainer faces and from the first bite to the last, it was magical. I was just so sad that we don't have one closer to home. :-(   Prices are just right. I paid 6ish bucks for my chimi and 5ish for tacos. When they were closing, they never made us feel like we should leave. The server even came up to us and told us \"Can I get you guys anything else? Take your time and don't rush.\"  I LOVE this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aDYVumwzYia2qI5thZcLuw",
        "caption": "Photo of Someburros - Tempe, AZ, United States. Cinnamon crispies!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aDYVumwzYia2qI5thZcLuw/o.jpg"
      }
    ],
    "user_id": "Y-jnqLk05gHJ2ZJIzmoHOg"
  },
  "OS8MVO_R260BqKrhbhYaGw": {
    "date": "2/17/2016",
    "text": "I had the Machaca Chimichanga ($7.85). It was a good sized portion with a crispy deep fried tortilla and tender tasty shredded beef inside. The green sauce was mild and the sour cream and shredded lettuce was scant and not enough to have some with the entire chimi.   The meal comes with complementary chips. It is a small paper container filled with what looks and tastes like store bought chips that have been slightly warmed. They also provide a ketchup dispenser filled with what tastes like Taco Bell hot sauce. I assumed that this was \"salsa\" for the chips. Not a fan of the sauce, so just used the chips for scooping up some of the shredded beef that had fallen out of the chimi.  Service is more fast food than sit-down. You go to the counter to order and pay. You round up your own silverware, straws, napkins, and so forth. The meal is brought to your table once it is ready. There are tables and chairs. The restaurant is clean and the staff seems friendly. Parking is plentiful and close to the door.  Above average for fast food (definitely much better than a Taco Bell), but not quite to the level of a sit down Sonoran Mexican restaurant.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "l-B4axUNxQ9FVVxeQm8t2A"
  },
  "7CgMJwAcX6CFdn-LYU1wTw": {
    "date": "3/22/2018",
    "text": "I placed an online order and had a pickup time of 6:26pm. I arrived at 6:27 and was told by the kid in the drive through it was not ready and to circle around. After waiting 20 extra minutes due to the line I received my order which was cold out of the box. I called to speak to a manager and the only option I was given was to come back for them to remake it. I decided to just eat it cold only to find what looks like a piece of a plastic toy inside the enchilada I ordered.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bC7whL6Aaat5LOxHNU410g",
        "caption": "Photo of Someburros - Tempe, AZ, United States. Some weird plastic arrow inside of my food",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bC7whL6Aaat5LOxHNU410g/o.jpg"
      }
    ],
    "user_id": "X3f6SBX2tEnPRo6khJrsOQ"
  },
  "QqOujrfzLUngb4WDvWTVZg": {
    "date": "9/7/2018",
    "text": "Don't order in the morning, when you see them getting ready for a catering order. I ordered a breakfast burrito only to be put on the back burner. Waited 15 ask for my money back and didn't even get an apology. Thank you too Someburros on Fry road chandler.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d2xTu-g6L1i3EFWTCcf0fA"
  },
  "e-QemEC0sAkkPfP0QAQ_hw": {
    "date": "2/7/2016",
    "text": "Ordered our food with a very annoyed girl that rolled her eyes as we tried to order and wasn't in the slightest bit helpful. I most certainly get better service at any Taco Bell in the Valley. Paid 16 bucks for two SMALL burros with no chips, no drinks, no sides, nothing.   Our to-go food took forever. At least 4 tables that came in after us got their food and started eating before we left. When our order was ready a girl came up and basically mic dropped our food onto the counter and yelled our name then walked away. I grabbed the food and wanted to ask about chips but despite the 7 girls \"working\" the front counter no one acknowledged me till I felt awkward and just left.   What a mess. I don't even know if the food tastes bad or I'm just too annoyed to enjoy it.   + 1 star because my girlfriend says \"I am equally annoyed but the deliciousness is diffusing the situation.\"   Won't be back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "O328QGwVCGRXPINVkC95ig",
        "caption": "Photo of Someburros - Tempe, AZ, United States. Small ass burros. No sides. No chips. $16 for this...",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/O328QGwVCGRXPINVkC95ig/o.jpg"
      }
    ],
    "user_id": "X-gg0fyCMxOocOn6Rk8w8w"
  },
  "6Hco8NEibVJlUJ0KxmFN8g": {
    "date": "11/7/2017",
    "text": "I have been coming to Someburros for years now, but I have never come to this location and I must say I was disgusted with my whole experience when I ordered my food tonight.  First off, I ordered my food online, and I showed up 10 minutes early just so they could tell me that they never saw my order. They asked me to wait in the parking lot so they could bring my food out to me when it was finished. 35 minutes later, the lady I spoke to brought my food out and handed me a 15$ gift card wrapped in an envelope and said \"this is for waiting, have a good night.\"  I was angry but I was hungry so I let it go. I got home with the food to eat with my family and started to pull out the food from the bag. Not only did they forget to put in a part of my order, but the food was disgusting, soggy, and cold. Again, I let it go as I figured they were busy for taco Tuesday night. While we were eating, my mom yelled \"ow!\" And pulled out a full toothpick that was laying sideways inside her taco. My dad called the manager right away and she was short, rude and didn't offer any type of solution, but insisted that everything they had done wrong was alright because she \"gave me a gift card for waiting\".  I was uterly disgusted with the food and the horrible customer service and I will be telling everyone I know to stay away from this location. Horrible experience.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zQyVNBZpzYZRuO-6HVkd3Q"
  },
  "lLzr2GASsX6Vup5_ObMkbA": {
    "date": "2/15/2016",
    "text": "The reason I am giving this place 4 stars is well I found absolutely nothing wrong with this place. The tables,floors,counter, kitchen area all clean.  They have indoor and outdoor seating with a drive up window for phone and online orders. They had Mexican music playing in the background. If you were eating there they give you chips and salsa for the table and bring you your meal. The salsa was good and the breakfast burrito I had was great! All in all good place to get a burrito or Mexican meal. I will be going back.  The reason for the 4 stars also I only had one thing. It's hard to mess up a burrito. But I will be updating when I try something else.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LP9_pEcY-ofbVGIhK9UUDw"
  },
  "rJ6gDx7sa7Toa1at3vfmkQ": {
    "date": "12/26/2017",
    "text": "Food is average. Salsa is fresh and tasty. Over priced for what you get. This specific location also had a lot of teenagers working there who have poor customer service skills and attitudes.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O3UkozhL8VDarcPQIw7blg"
  },
  "UyvP6IECxhWEvBR8s00zAQ": {
    "date": "7/20/2018",
    "text": "I would love to give them a zero star. The drive thru is a joke. I can go inside and get all the chips and sauce I want, however, in the  drive thru I'm limited to a hand full of mini sauces and no chips. I'm always told they cannot give out the inside cups of sauce or chips. I can order $30 of food and get home to find 5 mini sauces even though I ask for the larger size. Unless you're willing to pay for chips and sauce which are free inside avoid the take out",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sOOzSHhqTeBn8M8VEEoLIg"
  },
  "QQgFZhl94AJ6NbRhRUKS1A": {
    "date": "3/29/2017",
    "text": "The place is really nice and clean. There is not many people at around 4pm on a Wednesday and it's happy hour! I got an order of nachos that were different from what I expected, but surprisingly good. If you don't want to fill yourself of chips, this is a great vegetarian option. I will definitely come back here to try other things.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gAhj0VXbWZGDzCH2cVyOSQ",
        "caption": "Photo of Someburros - Tempe, AZ, United States. Nachos!!! Differently tasty",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gAhj0VXbWZGDzCH2cVyOSQ/o.jpg"
      }
    ],
    "user_id": "AxbgbCnTdPOY50xDwmXUsw"
  },
  "jv63dauPLPJHmdV-QCeZng": {
    "date": "7/31/2015",
    "text": "great prices, some of my favorite beans in town and i'm a bean snob!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IWVOlQRQhfS_xs3auz-4cA"
  },
  "v4lB_PoNu-q8sSHiNyswaw": {
    "date": "11/24/2012",
    "text": "I live close to this place and I love burritos, so I thought this place could be a Wonderful match. Instead, I'm a more die hard qdoba guy than ever. These burritos were sub par, the prices were a bit much, and service was poor. I am a big supporter of local businesses but I won't support mediocrity. I'll pay more for quality, not to stick it to the man.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HUmGdbxGylbYhhtFcx5b9w"
  },
  "WHBekMOU0yZXbpARPZZumw": {
    "date": "1/9/2010",
    "text": "I had high hopes as a Coloradan in Arizona after I read all the other reviews on Yelp. My husband and I ordered the tamale, taco combo plate with green chili. It was the blandest food I've ever eaten, and it was swimming in cheese. There was no flavor at all in anything on the plate. Even Chipotle is better.  My husband had avoided this place because its name is so stupid. Well, now we know the food is on the same level. We went because they offer a drive-through window if you call ahead. I think that's the best thing I can say about it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cd3Rbq_7KDZapmhMKrxQKQ"
  },
  "PSOaGivjcB9zOLDWO4YfaQ": {
    "date": "4/12/2013",
    "text": "The horchaitas are the best ive tasted... So far.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MZn9xERw5OPJlx9VslNnRg"
  },
  "t0UDpyyc9otvf0twelBEtA": {
    "date": "4/16/2012",
    "text": "The staff is friendly and will give you a smile.  The store is clean.   The plaza is very nice and a good place to shop for all kinds of things.  That said, the food is typical of a chain style and reflects my 3 rating.   I'm sure many people will enjoy the food.  I just prefer a Pollo Asado Burrito from one of the local \"mom & pop\" shops.   Overall, it's OK.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vvUd-ZDuZ7WjjWrqzxcjVA"
  },
  "pTjeE2bWjF0qfhCQ7Fbqkw": {
    "date": "5/4/2010",
    "text": "OK i have try-ed this place 5 times now and every time it was bland, no taste. but i think that's the way it goes in AZ, people that grew up here have no taste they just eat where and whatever is there and like it lol Cervantes on mill/southern is fresher and taste better!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oKWVVqPWVzq5s6nS4O8sEA"
  },
  "-DqhB5EF1n5Py5RWmpSc3w": {
    "date": "9/6/2008",
    "text": "Pretty pedestrian Mexican food. The tacos and taquitas are fried and greasy, but I like them anyway. Also, the restaurant is bright and busy at lunchtimes, and the staff seem friendly. However, the other reviewers are right ~ the salsa is boring. There are better Mexican food restaurants, but Someburros! is a good place to get a quick lunch bite.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "wQ7nlVwAKuEit9EOdU4QFg"
  },
  "uQeC34jJ7_fpeuGlBK0YhA": {
    "date": "3/13/2007",
    "text": "Someburros has a damn fine veggie burrito that I highly recommend.  I used to always get their tacos too, but I would ask them to put black beans in them instead of meat.  Don't knock it 'til you try it.  The restaurant is small, but their prices are reasonable and their portions are very generous.  I used to come here all the time for lunch in college with my roommate when we worked as telemarketers (one of the most horrible jobs on earth). But it helped to pay the rent, despite how much we hated it. And the thought of having a late lunch at Someburros (and maybe a margarita using our fake ID's) was the only thing that got us through our day.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "sYQyXDjGaJj7wfaqz5u8KQ"
  },
  "jIGLi0kjc95fazd9eNWVFQ": {
    "date": "2/26/2013",
    "text": "My husband and I have been looking for good Mexican restaurants since we moved here last year. We have gotten food from here a few times now. There are pros and cons. They have a drive thru which we have used every time to get our food which is nice and convenient. I have only ever had their cheese enchiladas which I do like. My husband likes their taquitos. Their rice is also good. What I don't like about this place is that they charge you for tortilla chips AND they charge you a separate price for salsa (hot sauce)(for to-go orders at least). Perhaps it is because we have only done to-go orders, but the chips have always been cold and in need of a lot of salt, and that is saying a lot for me because I am not a fan of salty food.  I would recommend giving them a try, but if you taking it to go, buy your own bag of chips.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jILkBArE26zWD2FRKqw55g"
  },
  "wOGAjo_hlT57ZShMO4OPag": {
    "date": "3/11/2007",
    "text": "pretty darn tasty messican food, and almost fast enough to be called fast food. but this aint' no filiberto's. this place is packed at lunchtime every day of the week. the tamales are delicious - that's my measure of good mexican food i think... anyone can produce a good bean and chees burrtio, but if you can kill it on a tamale, you know what the eff you're doing!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "HhVNG_1NOEyxfxudd6TSCg"
  },
  "rsxZb2LL5n497UhmnZ9gbA": {
    "date": "3/17/2010",
    "text": "Great food, fast service. If it's not spicy enough just order it spicier next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "GPssix1_y8A6UEk4v2fRmQ"
  },
  "ZgUqXQRNQ745RoJ03IQhUQ": {
    "date": "5/13/2009",
    "text": "I'm out in the field alot for my job....so you can guess that if I am anywhere near a Someburros I will stop for the Vegi burrito.  Fresh avocado, pinto beans, onions (which I really can't eat, but will), fresh pico....wrapped in a fresh tortilla with salsa is oh so yummy!  So anytime I think, oh goodness, I've got to drive to Tempe or Gilbert, I think, hey I can stop at Someburros for my Vegi burro...it suddenly brings a smile to my face :-)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "oPGtIbIhoAzhiYajFyg15A"
  },
  "XuvUVAB15zrHhGDYRbm7Wg": {
    "date": "12/6/2009",
    "text": "It tasted like every other mexican food joint. Nothing special. The guy at this location had an attitude because I couldn't figure out what I want. Turns out, all of it tastes kinda bland. The rice and beans were bland, the burros were ok. Once again, nothin special.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ougu4S5ortMKCVYWLl49rw"
  },
  "_x5k0Tko7TyTKCaajHx9Zg": {
    "date": "12/12/2009",
    "text": "Run of the mill place.  More authentic than Chipotle and Chevy's.  It is similar to Filibertos.  The food is on the bland side and a little pricey for what you get.  I am still not use to the Arizona style of Mexican food where part of the ingredients of a burrito (burros) are served outside of it as a garnish on the plate!  It is nearly impossible to insert it in afterwards, espcially if you get a wet burrito.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "7Mt-DvvF8nofWHSfZZcKSA"
  },
  "F4bzzPugO0PwC2ikUvME4Q": {
    "date": "11/27/2009",
    "text": "When you move away from the town you grew up in, you inevitably have a favorite food that you can't find in your new city.   I miss the hell out of Someburro's shredded beef chimichangas.  Fried crispy shell, slightly spicy red sauce, juicy shredded beef, and cool sour cream is my perfect meal.  I don't need any beans or rice to take up space in my stomach; I need all the stomach room I can find because the chimichanga is huge.    I was recently back in AZ and the first place I went to eat was the Someburro's that is down the street from where I grew up.   I was instantly put into a state of bliss with my first bite; it was just as good as I had built it up in my head.   Sure I was stuffed after I was done, but I had to finish it since I only get one every couple of years. Thank you Someburro's for being consistently good all of these years!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CUcdY6AbNj0JpKzWdcHMUA"
  },
  "1o3P12uulV5G4BtaMU3VKw": {
    "date": "2/4/2010",
    "text": "Pretty good! I had one of their special burros with a spicy beef and it looked small but it was very filling. One downer is they didn't have any agua fresca. Not sure if this is always the case or they ran out. I would definitely like to go back and to try other dishes.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dhXVfF13DsDfn4OZptuCKA"
  },
  "7fXqHxq7RuZZvm1AwKCEzw": {
    "date": "6/16/2009",
    "text": "They have killer shredded beef burritos. Also the chips and sauce are delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zl-Mx1Plvn9EiYNG0fHYjQ"
  },
  "0tDD7Q2A_ip-HKIZXbYrhQ": {
    "date": "9/11/2012",
    "text": "The food is tasty and very reasonably priced!  The service is almost always good and fast, and the outdoor patio is nice when the weather cooperates.  Everything we've gotten there is good, but I'm partial to the beef and bean burro- it's on the way out from the Kiwanis Rec Center and nothing is better after a hard workout!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rPsGGR2E1aRXon6MYIfUEA"
  },
  "7uxOf4RelzRhWLjCX7i2RQ": {
    "date": "2/14/2010",
    "text": "This is the standard in Mexican food. It's take out and it's not too fancy, but it certainly gets the job done. My parents went to ASU and lived within a stone's throw Someburros and I have 'grown up' on its food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PmWFKsyAPWIrxaTz4Dl0Wg"
  },
  "QxvSFs2aHwqi5cYkn8Rlcg": {
    "date": "1/6/2012",
    "text": "Someburros ROCKS!  I love their chips and salsa - it's more of a hot sauce.  The best thing on the menu if you are eating in is the nachos - they are not standard nachos but they are delicious!  For take out, I like a bean and cheese burrito!  Delicious!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uz19v1n7cPvrptuoUbm77A"
  },
  "qrnlnTz3NiOY3Ctw92sr0A": {
    "date": "1/23/2009",
    "text": "Being a native Phoenician, I have a junkie like addiction to mexican food.  I find Someburros to be quite satisfying.  It is not a _bertos clone, so don't go expecting carne asada like you're used to.  It has a more authentic menu, that isn't all that authentic, but more so than _bertos.  The Pollo Fundido is indeed delectable and decadent.  The three way burro is scrumptious and may I suggest a cheese crisp with green chiles, which is my personal fav.    It's a bit more pricey than _bertos, but well worth it.  Call in your order and they have a pick up window.  You can't beat convenience.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "avr2wfgKFmx62a5HrhAMrw"
  },
  "Gk-1OBvP95i7p6caFJMrqQ": {
    "date": "9/24/2008",
    "text": "Decent stop for a quick lunch.  The food is pretty much just your ordinary run of the mill quick-stop Mexican food.   Not meaning that it is bad food, because it's good.  But it's nothing special.  I really like the chips.  I dip them in the beans because as some other reviewers stated, the salsa is boring.    But if you're looking for a decent quick Mexican lunch, stop on in this place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BqUm1rHPSxlCWr-3HhNQyw"
  },
  "aE8Girm71QL-jEMtnbMUWg": {
    "date": "8/12/2014",
    "text": "I have been coming here since I was a little kid. Everything I have ever tried was great. Would highly recommend trying it out. Great hot sauce although don't eat a whole bottle because you will pay for it later !",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cGF9j9qaXbw2P1CV3rtaNQ"
  },
  "Rlq73KsQz5OyGKXq1HrLSg": {
    "date": "8/21/2008",
    "text": "I have been eating here since my jobless just moved out here from CA and don't want to go to college just yet days.  The quality of the food has remained consistent throughout the years.  I have had everything on the menu at least twice.  The chips are always fresh, the salsa is spicy but not to bad, the burritos are great (even the red sauce ones, and I don't like red sauce), the staff is always polite.  They open at 10:30 AM, so, its a little difficult to say its \"breakfast\" food, but yeah, I guess I could eat this for breakfast.  They do have a \"drive up\" window - but its for phone orders only!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Wn1UHPW4LEp4Q1m7LmrCNQ"
  },
  "lXQGvpKRvDRQesYnKsU5sg": {
    "date": "1/9/2009",
    "text": "Yes, Julia T's review may be boring.  But, it didn't stop me from heading over to someburros.  Good thing!  She was spot on!    Nothing more I can say above what J said... Take a look at her review!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oZ6MZ3KtTEU0UiioWQjC8Q"
  },
  "6PbLei-MlFvE7pN2ZGUOsw": {
    "date": "1/27/2012",
    "text": "Their claim to fame seems to be the pollo fundido.  To that I say, I've had better.  While inexpensive, the fundido was a little salty and could have used more flavor, but all and all, not a waste of time. :). Salsa and chips are free for eat ins, and the salsa is yummy.  As for the best pollo fundido, I recommend Julio G's in Scottsdale and PV.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LFlnWG7slezc66bj-pmRhg"
  },
  "EU4FLLZdCsNdB89qnymPTQ": {
    "date": "3/10/2011",
    "text": "I love the pollo fundido and baraccho burrito. Super no frills, yummy Mexican food. Decent prices. Clean and quick, lots of choices. Go for 5 dollar fundido Wednesdays!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Hylg642xNVl1NXIRw7LMow"
  },
  "nH1ige_dnoA2c3OdNzG3jg": {
    "date": "1/5/2012",
    "text": "I like Someburros.  It's nothing fancy but they have good mexican food and quick service.  The red sauce is tasty.  I would't really travel out of my way to get here, but if I  I am near by I head in.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rhE4gLtM0gb3XLwSz6HPCw"
  },
  "P2X_-ZBQU96VHyj1sEgYgA": {
    "date": "11/15/2007",
    "text": "I expected more due to the glowing reviews here on Yelp I got the Pollo Fundido It wasn't bad, but certainly wasn't the best Pollo Fundido ever.  I thought the salsa was good, but a little too thin.  I would have liked to have a chunkier option as well.  The ambiance was flourescent and a bit cheesy.  I dunno, I just thought that I'd really be wowed by the food, and I'm a bit disappointed.  Oh well :(",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "OPN-dDUBkH7uH-G8nOnskg"
  },
  "kliQ6aukW63PL4wUpbW_MA": {
    "date": "8/21/2009",
    "text": "Two words: Pollo Fundido.  Wear your fat jeans or sweats and go eat one.  Then go home and take a shower, unless you like to smell of grease..  Love this place.  Never disappoints. .   If the line is long, call the take out line and order while you wait.  Your food will probably be ready by the time you get to the counter..",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "b8LFVfj8Gu3FWJB38b-EDQ"
  },
  "UWsP_sEFds6XSqe_ntJCQA": {
    "date": "11/9/2010",
    "text": "Okay, so, my best of friends lived next door to this place for a couple years and would always tell me that Someburros was just \"Okay\" at best. On the weekend before they move away, I come to visit and they finally take me here. I feel like my friends were holding out on me, Someburros is delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "DolVDfogPwZyiwMXRQ0gQw"
  },
  "IKV4g4lo58FOtXKqnXzY2w": {
    "date": "5/22/2011",
    "text": "Not only does the veggie burro rock my world, but the chips and salsa make my life complete. I easily eat here 1-2 times a week (as embarrassing as it is). It's the perfect place for lunch with the outdoor seating so you don't get that food smell on your clothes for the rest of the afternoon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1g9ZG4x82MoFgs87B1nrlw"
  },
  "e4BqRRBtoNs5e4q2qKrNqQ": {
    "date": "3/13/2012",
    "text": "Best Mexican food ever!! Been going here for 15+ years and still love it! Green sauce on everything is my favorite. Delicious, great quality chicken! Recently discovered the quesadilla with green chile strips in it and OMG- amazing! Great dine in experience or super convenient take out with a drive thru window. Now serving breakfast too- go for the senor jorge or verde scramble...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "evltzdSgtigtxNrXmffgOg"
  },
  "9OscSHvOaUvSic3-Pir_uw": {
    "date": "9/11/2009",
    "text": "This is another place on my regular lunch rotation.  I have been eating at Someburros for years frequenting the locations in Gilbert and by Chandler Mall as well as this location in Tempe.  This is deli style.  You go to the counter and order, they give you a number, and then bring the food to your table.  The restaurant is always clean and well staffed.  This location, though, is a little smaller than the Gilbert or Chandler Mall restaurants.  The food at Someburros is on par with any good Mexican restaurant in the Valley, but it is fast and inexpensive.   Most adult meals with drink will cost about $8.  Kids cost 1/2 that.    I usually get one of the burritos.  Lately the Crudo Burro is my favorite.  It is shredded beef with SPICY tomatillo sauce.  Do not order this unless you can handle spicy food.  I also like the Rod Burro and the Poncho Villa.  I really like the rice, as well.    Someburros also has large party platters.  A number of times we have purchased party platters for a gathering at our house.  Our guests always devour the food and rave about it.  It is a relatively inexpensive way to cater a party.  Someburros is a great place for lunch and a relatively inexpensive way to feed the family.  If you have not tried it, definitely check it out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J9SB47g9nJEoJjiiP_6EUw"
  },
  "blFEq5yGTjejWsuMlEUSHQ": {
    "date": "10/10/2010",
    "text": "We frequent Someburros quite often.  We always order El Pollo Fundido everytime we got because we know it's going to taste good everytime we come in.  I've ordered other things on the menu and always go back to Pollo Fundido.  They make the food super quick even when they are really busy!  It's always clean in the dining area and the bathrooms too.  Everytime someone visits from out of town i take them there and they like it a lot.   We've gone to their other locations and it's always consistent as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "gMa9OBYrcKTBh1YB1RRBxw"
  },
  "_IzhkhXuZ1_AUegntgq5mA": {
    "date": "12/2/2012",
    "text": "I've been going to Someburros over 20 years. It's standard \"Americanized\" Sonoran Mexican food, but it's tasty and quick. Their salsa is ok - not spicy enough for my taste, but it's much better than anything I get in Las Vegas. At least there's a little bit of heat. It's definitely a step up from Taco Bell, but that's about it. Their carne asada street taco's are probably the best thing on the menu.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WN8JmvMhHwBB3Q95UCuSsw"
  },
  "KoLqk_j4f6tyZOqFdvbuAg": {
    "date": "7/16/2011",
    "text": "Perfect place to have a quick bite to eat if you're in the mood for Mexican food, and the chimichangas are delicious!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d_Heu1PS5Vi6D_RcvUcbkg"
  },
  "yq7ZERaZjW4agKPszDQDSQ": {
    "date": "4/28/2011",
    "text": "If I'm in Tempe and I want a mean bean and cheese burro, this is the place I'm going to go.  To me, there is no better place to get one.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QmEweah-zerbBtKATnhf3Q"
  },
  "N8jeeh_vUz7H2L5wjpmQcQ": {
    "date": "5/24/2010",
    "text": "I get to eat at their Chandler location whenever I'm in town visiting friends. It's a nice change of pace from the Mexican food you find in California. The open face cheesecrisp is a great one to share and the taquitos and guacamole are my favorite. The atmosphere is nice and it's always clean. This is a great place if you're looking for a quick and delicious lunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Lu0wtdya_tw33SjiZG9NTQ"
  },
  "JnTLAwCL38C9NCPy367kkA": {
    "date": "9/19/2011",
    "text": "Well I am amazed that this place can be called \"Great Mexican Food\". Where does the \"Great Mexican Food\" term come from? I have been to a couple of locations thinking that the food might get better at a different location, well let me tell you my experience was not any better at any of their locations. I have never had such bland Mexican food until I have been to this place.   The sour cream has to be the fake watered down version that you get at a rehab or prison. Not that I have been t prison but I can assure you that this is the cheap version of sour cream.  Let's talk about their hot sauce or salsa; on wait they have no salsa its tomato sauce with no flavor or kick to it. Once again water is cheap and this must be watered down as well because this is pitiful sauce. It tastes like something that comes out of a box that's been regenerated over and over again.   The chips, are you serious? I know chips are a freebie but why serve chips that's been sitting for days or weeks. Nasty  Should we talk about their beef / chicken? Let's keep this short or to the point, its Institutional food and it has no flavor to it.   Well I gave it a try several times and at several locations and I must say this is a big disappointment and I will stick to my other favorites and not spend another hard earned dollar in this cheap establishment.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NxPQ10w-1H0CrOy0LCwOxw"
  },
  "sidxLDGM9H13DlxBa_0pPw": {
    "date": "8/31/2018",
    "text": "I stopped in to this location to pick up dinner for the family. It was clean, if not a little crammed--most of the tables were full and there was no clear path from the door to the counter to order. There was only one person ahead of me ordering and she was taking a long time. A second cashier came out to move the line along. I ordered two enchiladas style burros for me and my partner and a taco for our child. The order came out quickly--within five minutes. Unfortunately I didn't check the order until I got home--no taco. There was a very disappointed child and an unhappy mommy who had to whip up a quick meal. The two burros were both good, but the mistake on the order kind of killed the convenience of grabbing take out.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "sC1zh2QPFcvTBXYnLAtX8w"
  },
  "UkxzITa5S0nOoYpJg2pr8w": {
    "date": "3/29/2019",
    "text": "Been to this location a handful of times and never had any problems. Good quality Mexican food. As other reviewers have said, it's technically a chain but the flavor is home-cooked inspired and gets close enough to it for me that is satisfies my cravings when I'm not feeling adventurous enough to travel an extra 20 minutes to try out another mom & pop place.   Inside seating might get a little packed during the hot season, but the outdoor seating is great this time of year.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "m0ZDdxbydJ59ZvABcPUxXQ"
  },
  "TVDGs5Sx6N_5KP4Eua64GQ": {
    "date": "1/15/2018",
    "text": "Someburros is a Mexican restaurant with a clever name that has been a local staple in Tempe for over a decade.  I wasn't too impressed with the food. I ordered the carne asada burro which was more refried beans than meat wrapped in a cold tortilla. A modest serving of chips is complimentary but they seemed stale and bland. They came with a squeeze bottle of salsa but no container in which to dispense so you have to squirt directly onto your chip.  I was disappointed that sour cream wasn't complimentary. Even more disappointing is that it costs $1.50 which is kind of ridiculous. Prices otherwise are on the low end. An enchilada plate and burro totalled under $18.  I will say the cheese crisp was simple and tasty. They also serve frozen margaritas.",
    "rating": 2,
    "rated": {
      "funny": 26,
      "useful": 55,
      "cool": 45
    },
    "photos": [],
    "user_id": "1F5wbSbtUBzxS8IsM7fWsA"
  },
  "1YBP09Lhyf1Ko4y9jso-PA": {
    "date": "1/29/2019",
    "text": "Another solid Someburros location. Had the chicken fundido burrito. It was good but could have used some other flavors or textures because it seemed just a touch dry. Came as a daily special with just rice but could have used beans.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "S1NQi8H3qo4eEyfwcILXfQ"
  },
  "AVywuX060rJh_sNVKbl_nw": {
    "date": "8/29/2018",
    "text": "It's been several years since I'd stop by SomeBurros and I am glad to say that the food is still tpo quality. My wife had the tostada verde and she really really liked it. I chose the pollo fundido which has chicken  wrapped in a tortilla deep fried and topped with a green cheese sauce topped with green onions. The only thing that seems a real drawback is they should offer a fly swatter with each order. Unfortunately that seems to be a problem in a lot of the restaurants in these Phoenix area. It is so hot outside and with doors opening and closing the flies are looking for a cool place to go just like all of us.  The quality of the food more than makes up for having to shoo away a few flies.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xb49y6JmxS39lJR-_tRkaw"
  },
  "5umnmndzQdJGMzSvX9R7NA": {
    "date": "6/8/2018",
    "text": "I hate to do this. I remember coming here 25 years ago and loving the green burrito so it's kind of cool that it's still around at the same location. Yesterday I had the special tostada and cheese enchilada. It tasted good. One thing I noticed was the salsa wasn't very cold but I ate a ton of it anyway because our food took a long time.   The problem is that I have been running to the bathroom continuously for the last 24 hours. I don't feel poisoned just a lot of trips to the toilet. If the owners read this I ask that they review the sanitation policies at their restaurant and see if it can be improved.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VBOssqaoARq2scC11fFUfA"
  },
  "EFFQK7BBhOpcWTPn3Jg87w": {
    "date": "4/30/2019",
    "text": "Today I ordered the pollo fundido and there was a hair INSIDE the chimichanga. A long brown hair wrapped around the chicken. So sad cuz I love this place but I fear I am traumatized and won't be able to return. I was so grossed out I just left my food and walked out. Probably should have asked for a refund but who has the energy for that?",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "skerF0EghPUtjMmaFOFCGg"
  },
  "XEfI-cKdvwaWz54W1wd_lA": {
    "date": "9/28/2018",
    "text": "I'm from Albuquerque NM.  The food was barely like Mexican food and the salsa was more tomato sauce then salsa. 4 stars because it was clean and the service was friendly and prompt.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dfnvmjV2FpjTLV5rSI5R-g"
  },
  "HuARdMIZ-x3uDFa5lMQJ9Q": {
    "date": "4/22/2018",
    "text": "Pretty average Mexican food. Nothing special. It'll do in a pinch or if you're friends from out of town can't handle anything too authentic. Hot sauce is really good though.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JtGDyszcmdFCGB-_jsC49Q",
        "caption": "Photo of Someburros - Tempe, AZ, United States. Extreme chip close up",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JtGDyszcmdFCGB-_jsC49Q/o.jpg"
      }
    ],
    "user_id": "PGOHKWt3_oLuFLvx_0M70A"
  },
  "licqAYrkSMJQ9wMx22nqPA": {
    "date": "3/28/2018",
    "text": "Had catering at the office from this restaurant, I called in to check if lard is used in the bean, but was very disappointed to know that they use lard in almost all their dishes, even the rice I was told it had lard. Many people today try to stay away from lard for either health or religious reasons ( Muslims, Jews, Hindus etc..) therefore I highly suggest that they make it clear on their menu what items have lard so people would know. Thank You",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DeQ-EMGhs9rlcxM1Shz6rg"
  },
  "BN4Gr0wlAlMqR_Wye8j5wg": {
    "date": "2/25/2018",
    "text": "This place is like an fancier type taco bell. You go to the counter to order and pay for your food then they bring it out to your table. You do get chips and salsa. My enchilada was pretty good. Portions were smaller then your typical mexican restaurant. My boyfriend order nachos which was a big joke and he said his tacos were extremely greasy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EuT63Swio8bnyniXOue7fA",
        "caption": "Photo of Someburros - Tempe, AZ, United States. Shredded beef enchiladas",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EuT63Swio8bnyniXOue7fA/o.jpg"
      },
      {
        "img_id": "rQ73ttaeUqafhZdvNi6a3g",
        "caption": "Photo of Someburros - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rQ73ttaeUqafhZdvNi6a3g/o.jpg"
      },
      {
        "img_id": "N2RA68_WguKbDzvCuXS6Ow",
        "caption": "Photo of Someburros - Tempe, AZ, United States. So called nachos",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/N2RA68_WguKbDzvCuXS6Ow/o.jpg"
      }
    ],
    "user_id": "9SXy2gvJkTAB9_tLQM-4bQ"
  },
  "qPsrN6vk7zimx3Co-qLxpg": {
    "date": "3/1/2019",
    "text": "I was very disappointed with service food was brought out without sliver wear...asked for water that was forgot as well food was cold.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dig-tBKiRSfjtWKoo-gnuA"
  },
  "qEn2BH4XhRKGBKteVWX0Kw": {
    "date": "2/22/2019",
    "text": "Good food and the service is great all the people working have always been very kinda!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "PCO7PZcH_wGL87r50ZDTzQ"
  },
  "YzMqevHTJW3UKEYCPmpKcQ": {
    "date": "2/27/2017",
    "text": "As soon as you walk in you see the colorful beauty of Mexican art. It's clean, organized, and lively. The choice of music is perfect. They played rock en espanol and other popular Spanish music. It is refreshing to hear this. It was also refreshing to see that the staff is bilingual, friendly and acts with a sense of urgency.  I ordered albondigas. It came with flour tortilla. Absolutely Delish! I would like to try s spicy version of albondigas. The tortilla was in point. Warm with perfect consistency.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "uGUXS0Cb5R_3NGhO8mB6ag",
        "caption": "Photo of Someburros - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uGUXS0Cb5R_3NGhO8mB6ag/o.jpg"
      }
    ],
    "user_id": "PcR68dE54zhcZwgMeBiG1A"
  },
  "TBcnRFobOgqpMW3GRB8Rfw": {
    "date": "11/29/2018",
    "text": "Horrible! I'm walking out with a refund because my chicken tacos were like patties inside. And the manager tried to make an excuse and I let her know this isn't my first SomeBurros rodeo. The Gilbert and the San Tan locations are the best. Stay away from Tempe!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sQGCzAKvfriVVVNVsLUCpQ"
  },
  "v9slauxsTB2FA3WmxThTag": {
    "date": "1/13/2017",
    "text": "I ordered some lunch online and went to pick them up. Service was ok -- since I didn't eat in I cannot say much about it.  I order shredded chicken, shredded beef, and a taco-enchilada combo. They fried the taco which was really different. Their meat was okay, not too bad but their enchilada is probably the worst I've tasted. I probably won't come back though.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kK-NklR8rOBsdBXL4oJLZg"
  },
  "OalSm5x7rboR0SOKypManQ": {
    "date": "8/4/2018",
    "text": "Great taco Tuesday, and $2 tacos. Good food, and great service! Thank you for making me bean tacos!! Yum!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BTArsODyfpXqFxxXgJULsA"
  },
  "HwUKv93qBhLjLXkSUzmysw": {
    "date": "8/19/2018",
    "text": "Love this place me and my family go every Sunday morning I get the same thing lmao el Diablo scrambler my kids always get a Lil ninos 2 rolled tacos on a split plate they're very friendly here food is always hot and they never complain it's amazing",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UKtR3c1n8Yx_4__Zaj-q-A"
  },
  "vl3oSTFd0MN3CrsmTSHPoQ": {
    "date": "12/23/2018",
    "text": "So we still think that someburros could use some friendly employees. However, we have never been unhappy with their food after this first visit. My husband LOVES their hot sauce and frequently goes in just to pick up a container.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eYrAvVk-jsInxcsqdSKdhw"
  },
  "yHNPJtry8ccPlhdNkygQCg": {
    "date": "7/25/2018",
    "text": "I'm not sure why it took me so long to try this place since I've lived nearby for 7 years and love Mexican food. So glad we tried it, it was delicious. Only negative were the chips and salsa...the chips were stale, they fixed it pronto and got us a fresh batch",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LNNy7-P3Oy3kvic3PIfpXw"
  },
  "Y0ROc1Ye4rJRzwOdo3kfqQ": {
    "date": "9/12/2010",
    "text": "Not a  fan. Filabertos is definately a whole lot better and has better prices.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "co64BGDz5U4i-VOwhJgn5Q"
  },
  "cISKYm1qa2qJRKtDaQtxnA": {
    "date": "4/29/2012",
    "text": "While some people swear by this place I cannot.  The food is decent clean New Mexican fare that is very average.  The restaurant itself is clean and is considered sit down fast food.  The price point is just right with meals between $5-$10 and free chips and salsa (Chipotle should note this!)  3.5 out of 5 stars for fair priced clean quasi Mexican cuisine.   I will stick to Polliberto's for Mexican food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ofznDNjZ6tdINXfWF3vTA"
  },
  "kyyppgoXj8Ft41Zaf1lnaw": {
    "date": "8/17/2008",
    "text": "I've always had good food here. Great burritos, cheese crisps, and churros! I wish I had a cheese crisp and a churro right now.  Excellent basic Mexican fast food. Not great for a date, but great to fill you up with yummy any day of the week.  This is officially my most boring review ever. I am too tired to be witty or interesting, but don't let that keep you from grubbing on this deliciousness.  Buenos noches.....",
    "rating": 4,
    "rated": {
      "funny": 8,
      "useful": 9,
      "cool": 6
    },
    "photos": [],
    "user_id": "iL_CR-WQnveqrff9LecqAQ"
  },
  "TDHyrj-vZ1eWqSckh27Muw": {
    "date": "11/3/2009",
    "text": "I ate at Somburros for dinner around 8:30 or 9:00pm.  The place was not too busy.  It was clean and brightly lit.  I was greeted by a nice young lady behind the counter who too my order.  I had the #1 combo a chicken taco, cheese enchilada, with rice and beans.  With a medium soda the check came to just under $9.  A small tray of tasty chips was included.  Not cheap.    Mexican food in Tempe has to be great just to stay in business.  There is so much competition.  So my two stars would probably be three in another town, like French Lick Indiana.  It's a real town without many Mexican food places.     The taco was just ok.  A little on the small side.  The corn tortilla was fried in old oil which gave it a burnt stale taste.  The chicken was tasty, and the lettuce was crisp.  There was a little cheese in there too.  It tasted cheesy.   The enchilada  sauce had a burnt taste and was dark brown.  I'm not an enchilada expert but I've had better.  This cheese enchilada was flat and I could not taste any onions.   The rice and beans were average.    On the bright side the food was hot.    I didn't find Someburros to be a very good value.  I have had much better tacos and  enchiladas at full service restaurants for less money.   I'm going to keep looking for some great tacos.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "pKvIao5r1bB5TJYspKWwKg"
  },
  "OhmBgEoV-BsUvWsVsGXEbw": {
    "date": "1/26/2015",
    "text": "Great food, great prices. Always a good place to eat with friends and/or family. Have not had anything that I did not like. The horchata is really really good. Great serves and happy workers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yphXU-z5-JfMu18xJZQhXQ"
  },
  "7T-uD9mNC7G6gaiOFH-6dA": {
    "date": "3/18/2013",
    "text": "Went here with my family. Was not impressed so much. Place was not that busy but still took forever. Even saw our waitress talking with some guy at the counter while we had to wait. Food was ok but had better as far as Mexican goes. Won;t be back any time soon. Sorry.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gwGk1MC8J6EFP_RH-TodxQ"
  },
  "DbhfCgQKKLSUI4JT65mlqw": {
    "date": "5/7/2008",
    "text": "The Mill and Baseline location is excellent. Service is fast and friendly, prices are reasonable and portions generous.  Their veggie burro is excellent with big fresh chunks of avacodo, mm hmm. Their chips and salsa are also better than most casual taco shops. You can order ahead and pick up at the take out windows.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "sTcYq6goD1Fa2WS9MSkSvQ"
  },
  "WM01lj5c-1IFRr3lZa6Ybg": {
    "date": "12/24/2007",
    "text": "I LOVE burritos.  I LOVE tacos.  I LOVE mexican food in general.  However, I do not LOVE this place.  Why? 1.  Greasy. 2.  Kind of tasteless 3.  Nothing really great on the menu 4.  The salsa is bland  People I used to work with absolutely loved this place....I don't see why.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "KLletoFqkYWR8upBwhifnQ"
  },
  "8S8n6W0nVk2Zk5tGOtbsoA": {
    "date": "7/31/2007",
    "text": "Fantastic veggie burittos, wonderful cheese quesadillas and great salsa and chips.  We ate there regularly when we lived in Tempe and we make it a point to stop by every time we head back.  The drive through window is a nice plus!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "EHg98-8QvhwVEGAl5tpXwg"
  },
  "PCNTva12ncHA_BUnJwjQjw": {
    "date": "5/3/2008",
    "text": "I promise you.  I.  promise.  you.  These are the best burritos (note: calling a 'burrito' a 'burro' is dumb and only prevalent in PHX) in town.  They are bigger than a baby's arm and have very moist chicken throughout.  The 'Crudo burro' with rice and beans plate is CRIMINALLY INSANE.  Their salsa comes in a squeeze bottle, which i love because of the regulatory physics behind squirting delicious red salsa onto a burrito bite-by-bite.  They also have churros, which is ALWAYS a plus for me because I'm crazy about them for dessert.  Prices are slightly steeper than your typical neighborhood Mexican joint and they DO have a drive-thru, which you must call ahead for, then pick up at the window.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "XXmkUvLoe6XMhHZON_9kog",
        "caption": "Photo of Someburros - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XXmkUvLoe6XMhHZON_9kog/o.jpg"
      }
    ],
    "user_id": "kc-rnN-ndnFTdHG4TfIgeQ"
  },
  "msOAyrVDL264piVUJonduA": {
    "date": "6/19/2014",
    "text": "We've been eating here since 1992. It isn't the same since Renee (the manager) moved to the Scottsdale location. The food is still good, but we used to feel welcomed when we went in...everyone knew our name and our family. Now we go and we are just another paying customer.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4RMYjhLUqMzwqjWjcrpiew"
  },
  "XF65N1U7qmNxxfRoam9R0A": {
    "date": "8/9/2008",
    "text": "Ok, I've been to Someburro's a thousand times, and I like it...I really do... However...the problem that 990 out of those thousand times I've had the Pollo Fundido, simply one of the best fast guilty pleasures that you can experience.  However, after eating it, I feel like I've just dug another inch closer to the grave...or shaved another couple of days off of my life.  As I age...I'm trying to eat healthier, so here I am at Someburro's trying to find something healthy that doesn't give me visions of the grim reaper, and that gives me the near orgasmic feeling that I have when down the Pollo Fundido.    So far, I haven't found anything else on the menu that fits the bill.  I've tried the veggie burro which is probably the healthiest thing on the menu, and it's....eh....ok.  The avocado in it is great, and I haven't seen them put less than fresh avocado slices in it.  I once tried the taco salad, which was WAY less than satisfying, and actually kind of gross.  I mean, you take some actually healthy stuff and surround it in a bowl of fried whatever...  I'm also not big into shredded beef or the machaca.  The chicken quality is ok, but has a good portion of dark meat in it.  It's good because it's marinated so heavily, though I'd imagine that the marinade does not add to the health quotient.  On the bright side, this place is decent for kids.  There are inexpensive options for little ones. We get the quesadilla's for the boys, who pretty much just pick over the quesadilla waiting for the go-ahead from mom to dive into the Churros.  By the way, the Churros are no bueno, in my opinion.  The kids like 'em cause they are doused in sugar, but they aren't doughy...they are crunchy crispy and fried...fried...fried.  I feel pangs of guilt as if I'm poisoning my children when they eat those.  Some of you reading this are probably thinking...if he's trying to be healthy, perhaps he shouldn't be going to Someburro's in the first place....and you're probably right.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "2jZjQZOgCHeW03qcgBcHQg"
  },
  "A_TN6eswQy5V42j5md4uEg": {
    "date": "11/23/2009",
    "text": "Ok, but not as good as San Tan Marketplace one. I had the \"poncho villa\" and it's basically a red chili burro. Was a little to bitter for me, but wife loved it.  Next time I'll stick with tacos & enchiladas.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "dCrjq9mJPZDII30OSNe26Q",
        "caption": "Photo of Someburros - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dCrjq9mJPZDII30OSNe26Q/o.jpg"
      },
      {
        "img_id": "8O9yZfp7dD7g8_2tzCjqqQ",
        "caption": "Photo of Someburros - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8O9yZfp7dD7g8_2tzCjqqQ/o.jpg"
      }
    ],
    "user_id": "14UnRoEiLipkKZyQTmTfWw"
  },
  "S9amGRE5w7VqovZdPH7KkQ": {
    "date": "2/27/2008",
    "text": "Someburro's kicks ass.  It's a nice middle ground between the standard *Berto's and the more sit-down experience.  Pollo Fundido and Borracho Burritos are awesome.  Service is quick. Beaners are bean-y.  There's nothing spectacular about this place, just really good, solid food served hot and quick.  Dig it.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "2es7AT3Q7tg1KGkUXXDTyg"
  },
  "yr0A3Y8JUW_44B-n9u_fQA": {
    "date": "8/10/2009",
    "text": "Got info on the tortillas, they are full of lard and trans fat. So for anyone concerned with living with a healthy heart, please be warned.  Still love the salsa! :)",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "I6HwhbPDUCHN0zKFZPsrBQ"
  },
  "BmBZ3fWI1SgMVHA2Z8F3sQ": {
    "date": "11/30/2011",
    "text": "I like to go through the drive thru, but i have eaten inside before as well. If you are inside they give you lots of chips, on the to go orders ,no. I got the green chili bean and cheese burro with rice and beans.  It is ok ,not the best. But it is very  cheap.       It is a quick meal when you are on the go.    I would rather have spicy and tasty, however i am sure i will go there again at some point.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DzyBToexbfik0zt7ppky-Q"
  },
  "ifyQpiKDprnlfEr36F8EiQ": {
    "date": "7/22/2012",
    "text": "Solid 4 star American/Mexican food.  The take out drive through is super convenient on those busy nights.  My favorites are the rod burro and the borracho burro.    The tacos are good too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FGkq_yMe53te4_o2f6JVpg"
  },
  "qVzZbPqves_GFToxM_ReuA": {
    "date": "7/29/2007",
    "text": "Bean burrito, extra cheese.  Side of rice.  I have dined at Someburros for a huge chunk of my life (15 years?), and only once have I ordered anything different than that which is listed.  They're exceptionally generous with the cheese when ordered like this and the beans have tasted exactly the same (good) throughout the years.  There's a consistency at Someburros that is to be admired, for sure.  I am especially fond of this location on Baseline and Mill in Tempe.  Being a hop, skip, and a jump away from Kiwanis Park, there is little better than a breezy Sunday playing basketball and later venturing a block down the road for some great American Mexican food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "0mdh1mokAAZSMibcAaXUEg"
  },
  "m8ylzyGDcp8kfI97BkAQnQ": {
    "date": "8/26/2008",
    "text": "Good burritos.  Bad salsa.  How can you mess up salsa?  Chips is a course unto itself and you don't have any good salsa?  Shame.  For shame!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z1Ce1N6F7vw9pKnsv8MtRA"
  },
  "LhTkF3BqF-F5tq3IfFXPxg": {
    "date": "1/28/2012",
    "text": "I used to eat at this restaurant a lot. I mean, at least 2-3 times a week back when I was in my early twenties. I eventually moved to Chandler and occasionally frequented the one by the Chandler mall as well as a few other locations, but this one has always been my favorite.  For one, it is rarely crowded. It's at the very end of a strip mall that's mostly vacant and is not visible from the street. Most of it's business probably comes from long time customers and the Kiwanis Park neighborhood that it's situated in. Actually, it's hard to think of another reason why this is better than the other Someburros locations. Their quality and restaurant/menu format is pretty much consistent regardless of which location you visit. For me, I guess I just have a lot of memories here.  Well, after taking a break from the Someburros franchise entirely for the last couple years, I found myself at this restaurant once again a few weeks ago, now that I am back living in the 85283. I have to say, not one thing has changed. It's just as good as it was back then.  The chips and salsa are awesome and always complimentary. If you are getting takeout, you won't automatically get this unless you ask for it while you wait for your order(no, they won't package it up for you \"to go\" free of charge). Some people on here complain about the salsa. It's not the typical salsa you get in a sit down Mexican place, it's more like the kind you get at one of those places if you request their hotter sauce. It's not full of diced tomatoes, cilantro, diced onions, etc. It's a thinner sauce, but very delicious and spicy. It's really good, and when I was in last, a paid a few dollars extra to take a big container of it home with me.  The only entree I've ever had from here was the Pollo Fundido. Until I discovered Nando's out in Mesa, this was the best version of the Pollo Fundido/Rico dish I had tasted. To be fair, though, Nandos is an actual sit down/be served restaurant and Someburros is more of a hybrid fast food place. And no, Lisa S, Julios does not have the best Pollo Fundido, in fact, I would argue Someburros is just as good, if not better.  So, that's all I have to say about Someburros. Give it a chance, you probably won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YbwNEjrzt0ye-kFRnTKAQQ"
  },
  "Se1ZUd0O-Q_KwVO0H-UHqg": {
    "date": "8/19/2019",
    "text": "Tell me why the hot sauce is something else? Like I was about to put the container into my purse, if I had a purse so I could use as I please, wherever I went.   Anyhow, had the lunch special of the day, enchiladas with rice and beans. Plus horchata. Was good. That's what I wanted to say, it was good. 5/5 would eat again. And again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nhEgcVLZgqTyiBBvsSIVTg",
        "caption": "Photo of Someburros - Tempe, AZ, United States. Enchiladas with horchata",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nhEgcVLZgqTyiBBvsSIVTg/o.jpg"
      }
    ],
    "user_id": "MpxyyJU3ks_HSPAKJadVkw"
  },
  "UKYjxvXhJ0Bygxp_VN-D0g": {
    "date": "7/11/2019",
    "text": "Love this place! Fresh and authentic! The horchata is always fresh and light with just the right amount of cinnamon. We enjoy that chips always come before the food, too!   This go round I ordered the diablo scramble and about halfway through I realized they forgot the chorizo! I However, when I went up To the counter they were apologetic and made me a fresh order to take home with me. Great place with awesome staff!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PD-YRBnSBJ_-KWMDRzvqhA",
        "caption": "Photo of Someburros - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PD-YRBnSBJ_-KWMDRzvqhA/o.jpg"
      }
    ],
    "user_id": "CTO2xjmEJb2-YAnUgeAAPQ"
  },
  "wIIj1A_5ug60EvEBgkpx1Q": {
    "date": "7/6/2019",
    "text": "I've been coming to Someburros for over a decade. The food is delicious, service is always on point. I've had dozens of things on the menu over the years and never had anything bad.   Whatever you order, cover it in red enchilada sauce!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2-kjdWn-5W6pN_HY9Z8XjQ"
  },
  "9q_S4NanCOuMCaYofyKakQ": {
    "date": "8/10/2019",
    "text": "A generic Mexican restaurant. Good entrees and sides but nothing special. The best thing about someburros is their tortillas. They are pretty dang good. The Pollo Fundido is what I would recommend.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sCyyxkPmxbEPkyPY1LvvGQ"
  },
  "BM5RJxttYIXa01rFwgrSXg": {
    "date": "3/28/2019",
    "text": "Whenever I'm home, this is my to go to place!! The food is always fresh and hot and my order is always right! This time I ordered the Rod Burro...my go to is usually the Pollo Fundido, but I wanted a taste of everything! The Rod Burro is a combination of chorizo, green Chili, and red chili! It was delicious! When you order for dine in they give you chips and salsa! There's also daily specials and weekly events or specials. The food is a bit expensive, but it's worth the price based on the taste!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FmHfFxJN8C-UyzhrZj0Seg",
        "caption": "Photo of Someburros - Tempe, AZ, United States. Dining in",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FmHfFxJN8C-UyzhrZj0Seg/o.jpg"
      },
      {
        "img_id": "bwkkyDOy4rABiD4r1Zh2Pw",
        "caption": "Photo of Someburros - Tempe, AZ, United States. Menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bwkkyDOy4rABiD4r1Zh2Pw/o.jpg"
      },
      {
        "img_id": "joMRw3nMsc5nuYeTn_yRcQ",
        "caption": "Photo of Someburros - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/joMRw3nMsc5nuYeTn_yRcQ/o.jpg"
      }
    ],
    "user_id": "TBXS-f5wkvSolgiEHgJhiQ"
  },
  "Sb16H9zoIfR8Sf0Sqtezow": {
    "date": "6/13/2019",
    "text": "This time I came back with my father and sister.  I can not remember what they got.  I remember I got the green chili again.  That stuff is super good.  If you are in the area I recommend you try this place.  I will be back for some green chili.  I tried a sample of their red chili but prefer the green.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tFSnxUGaNa2pwb4zClBu_Q"
  },
  "qGb-If__KKfDZU5GTvwQwA": {
    "date": "6/7/2019",
    "text": "Easily our favorite place for Tasty Mexican food!  And the Tempe location is our go to spot.  Excellent customer service, fair prices and consistently great tasting food.  Love everything on the menu, have never had a bad experience, well except for about 18-20 years ago they would occasionally mess up my take out order .  Highly recommend Someburros!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4JVy0xbt4L4uHR9GGCA-7A"
  },
  "gJKAgNuNITFJBN-7yAcXhQ": {
    "date": "7/18/2019",
    "text": "Took my family to Arizona Grand Resort for a two night getaway. I can splurge but I'm still looking to save some money wherever I go. Feeding a family of 6 at the resort is not where I'm gonna save. So I looked up some Mexican breakfast locations nearby and found Someburros on Yelp. Had good reviews but you never know. So I decided to try it based on all the good reviews. I fed the whole family for about $40. Got burritos for everyone and everyone was full. Less than two miles from the resort, food was yes. I gave it 5 stars because family liked it and so did my wallet.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VvQDfJvUbcRQJwqFNSQgHQ"
  },
  "oD7_DoYGgt2NB0blmSH0sQ": {
    "date": "5/2/2019",
    "text": "Traditional \"sit down style\" Mexican food served quickly without wait staff service.  I love coming here for lunch.  Great food, in and out in less than 30 minutes.  Service is hit or miss but that's an easy trade off for the speed of the service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NSmQC_0Gb-BjJvGR0TO2mw",
        "caption": "Photo of Someburros - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NSmQC_0Gb-BjJvGR0TO2mw/o.jpg"
      }
    ],
    "user_id": "LkCTppbp0zlgSVigrwMK7g"
  },
  "O6WasScJz4bmrqHp7xufQg": {
    "date": "4/12/2019",
    "text": "Chimichanga's were very dry and the outside fell apart with every bite. Not only that, the shredded chicken was also dry..had to have a glass of water with every bite. I don't remember them being this dry, probably won't order these again. Other than that, the rice was ehh-okay..very sticky. However, the guacamole was delicious and the restaurant was pretty clean. Customer service over the counter was decent as well. I'll come back but probably only for a breakfast burrito.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YvV9mn0BjbNgZ3qOn0Yv-Q"
  },
  "QlnqnKqnbchSgxKkDmFtOQ": {
    "date": "3/4/2018",
    "text": "We've eaten at Someburros in Flagstaff. Why, you may ask?  Because on the way into Flagstaff, there's this really big billboard sign that reminds you that mexican food awaits you as you pull into town.  We weren't impressed with the offering there. Therefore, I am not sure why we even ventured to try their location in Tempe.   We wound up in this area because we were visiting Kiwanis Park for some Pokemon hunting. And after the hours long travail throughout the park, we were famished enough to settle for the nearest sustenance station.  It was a Sunday afternoon, and the place was packed. The parking is dreadful as there aren't a lot of spaces right by the restaurant. Therefore, you have to park all the way around the corner.  When you go inside, you'll notice that there aren't a lot of tables, either. If there are, the bussers haven't actually put the food away. If you want a seat, then you'll have to clean it yourself.  The food is just slightly a step up from Taco Bell, and that isn't saying much. Our Burrito had pieces of meat that were undercooked, to the point that it tasted raw. The lettuce was questionable in its freshness. And the cheese didn't taste quite right.  Our taco had the same strange meat consistency. And the after taste of the lard that they used left a really bad aftertaste in our mouths.  The only saving grace was the freshly made tortilla chips. They were really fresh and light. And the salsa was also freshly made.   All in all, the main courses were dreadful, and the appetizers were more than passable. Hence, the two star rating, that assures us that we will not be coming back.",
    "rating": 2,
    "rated": {
      "funny": 14,
      "useful": 21,
      "cool": 18
    },
    "photos": [],
    "user_id": "a85qPvr6L63PF0v9Zs8ZAg"
  },
  "r4Ak_NiJ4E3cTXK-UNxGpg": {
    "date": "6/18/2019",
    "text": "As many times as I've been here, I've never received the service I recently received. I ordered two combos, people were getting their food before me that came after me. When they finally called me to get my food both combos were wrong and the response is got was \"we are busy.\" I made them remake one of the combos and just left the other as is because I didn't want to wait any longer. I get home and realize they charged me for a combo but did not give me rice. When I called the manager could only keep saying I'm sorry, until I told her sorry was not going to cut it anymore and asked for my money back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mTdtkU9lgOGY-oVu0Ygxcg"
  },
  "f6Yza2clfYDTKVmHuQ16PA": {
    "date": "7/22/2019",
    "text": "The food is always delicious and the service is always great. Very clean place and love that it has a drive through for phone orders and pick up, very convenient.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "_3nrvNpFOZoObgy6hWKYEA"
  },
  "JBZCYIotwQ3Z2TpJKMgu7w": {
    "date": "7/25/2019",
    "text": "Someburros really phoned it in today. Our ordeal at the restaurant was comprised of one fiasco after another. My salad was missing items, and the lettuce was soaking wet. When I asked for a side of hot sauce the man behind the counter handed me an empty cup and stared at me blankly. He was practically catatonic. Our to-go burrito order took 20 minutes to be made and we had to remind them of the order, because they forgot to make the ticket. There was no explanation or  apology for the delay. The restaurant was dirty. The staff was literally twiddling their thumbs or running around frantically. One team member decided to slowly mop during the lunch rush when he obviously could have been helping his team in a more productive way. The staff didn't know what they were doing, and it was painful to watch. This location is in need of training and management. If you'd like to have your order made correctly and in a timely manor you should not eat here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VEFjGmlwa-cqdQqRgrGD_Q"
  },
  "3lruhET_B2iM9IeCYxFKGQ": {
    "date": "4/30/2019",
    "text": "I found this little place on yelp.  The food was very good.  They even had outside seating on the patio, so I was able to take my dogs out of the car.  I would definitely recommend this place.  It is a good little Mexican restaurant if you are in the Tempe area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y0or-PDPQly8iVaVT4yXIA"
  },
  "xpF-eTMS75apFnkkzG_F3Q": {
    "date": "11/6/2018",
    "text": "Someburros is a great place to eat Mexican food. Although its considered \"chain\" food, their food has legitimate home cooked flavor. Their employees go above and beyond to provide great service. I love they actually play Mexican music and not Caribbean music like other large chain restaurants. My favorite dishes are the egg/bacon breakfast burrito and the shredded chicken with bean burrito. Their salsa is just right, not too mild or spicy.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MTGmu5QtTwpisTOE9aWwmQ",
        "caption": "Photo of Someburros - Tempe, AZ, United States. Great art",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MTGmu5QtTwpisTOE9aWwmQ/o.jpg"
      }
    ],
    "user_id": "81l-UIM8RCp8EjV3JQMI_A"
  },
  "Ggjb-qwqeoQmHaPzMR9axQ": {
    "date": "6/2/2019",
    "text": "I've been going to Someburros since I was high school student at Corona.  Class of 1998!  The  Pollo Fundido is awesome.   I love the shredded beef tacos.   Taco Tuesday is a must when they are $2 each.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uKj9lajOMq7P6dnkaz0o9g"
  },
  "FL3IzrEn1g3grTP6Px4gMQ": {
    "date": "4/14/2019",
    "text": "Their food tastes really good, very quick services and prices are very reasonable. I rated it 4/5 because in the past, some of their staff seemed disgruntled and kinda rude. Their staff has been friendly and attentive at all my visits this year.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6ITjzpf-gQqiYXBtvHpvCA"
  },
  "ZD2X4UCCLp25zD7_qqpJcg": {
    "date": "12/13/2018",
    "text": "Only problem I have with this place is they NEVER answer the phone. It rings and rings forever, not even going to voicemail. This has happened to me every time I've called. After about 5 tries of calling and no answer I just ordered online.  While I was in the drive thru waiting for my food, the phone was going off for 10 minutes straight and no one answered the phone. The employee was right in front of the phone too, drinking her drink. I'm just confused as to why they have a phone and don't answer it???",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XBCCb32CnQRs-uDAb8txpw"
  },
  "-_FXtVmm9QZDtbLTQ2GNLQ": {
    "date": "2/11/2018",
    "text": "Great place to grab some Mexican food that's well priced, good portions and full of hungry customers.  Owners are Arizonan locals which always make things better.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 13,
      "cool": 13
    },
    "photos": [
      {
        "img_id": "wyowmYYo5NS0hiJe_7JoRw",
        "caption": "Photo of Someburros - Tempe, AZ, United States. Taco Tuesday $2/each.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wyowmYYo5NS0hiJe_7JoRw/o.jpg"
      }
    ],
    "user_id": "61AymMi8D4RTQ2aa1w41ew"
  },
  "8vLOAqKyKgyXncNxaBboGw": {
    "date": "5/26/2011",
    "text": "Not all burritos are created equal, but Someburritos is just \"plain\" nasty.   I thought the idea behind the burrito was more than just meet in a tortilla, which makes this a literally PLAIN burrito. if i wanted a large taco, i would have ordered a large taco. the taste was bland at best, their hot sauce is more of a tomato sauce than anything else.    I probably should have read some reviews before ordering. Everything including salsa costs extra... I literally walked out without eating. Service was what you would expect from a burrito joint, nothing stellar.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KLwBnADqR1VTLuSaHzafzw"
  },
  "8jNvpIedmTbmRd2D7F8zsg": {
    "date": "7/15/2014",
    "text": "So delicious and much better than even some more pricey places. The quality is outstanding, easy order & pickup, and consistently great food every time! This place is always busy for good reason!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5NdTk4VT72atQtLgwWYRmg"
  },
  "q_tcQGhgrSjtXpDLtde5BA": {
    "date": "2/18/2011",
    "text": "I really like their shredded beef tacos and machaca.  Although, I keep forgetting to tell them \"No papas en mi Machaca por favor!  Reasonably priced and each location I have visited (3 so far) has been doing great business!  I am a fan.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1COjdu-49JipdkSIoHXUHg"
  },
  "FmjyC_Y--z5S--TySIT3VQ": {
    "date": "10/8/2012",
    "text": "It had been years since I'd been to this location, and I will not be going back! Called in the order to be a quick pick up, ended up waiting at the window for 15 minutes for the staff trying to figure out how to split the check on two debit cards! Was treated very rudely by staff member Michelle & \"manager\" Sara, and upon getting home, the food was made incorrectly! Veggie burrito was just a bean and cheese. Thanks for the memories Someburros but your rude staff and inability to get the food right means it will be another 10 years before I give you my business!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "eyYYDq0kijGFZ4E3QdI5Iw"
  },
  "VHp3QxiV7_WK-5-JwJYGxw": {
    "date": "12/16/2010",
    "text": "Someburros food is quite flavorless, to the extent it doesn't seem possible. The pollo fundido simply tasted like a bland fried tortilla with chicken that had the right texture, but no taste to speak of.  It is really a miracle that they could made such boring mexican fare. Even the hot sauce, which had the right color and a tad bit of heat, lacked evidence of taste that it may have come from chili pepper.  The one redeeming feature of this place is the staff was very pleasant. But the food certainly is not worth the visit.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "uoePvyVTUSR7ens_U15Mig"
  },
  "llQzZ_vk8zofXsgMX1p02w": {
    "date": "8/12/2010",
    "text": "Um, thanks yelpers for the LIES!   So i woke up from a nap today and me and the little child growing inside of me NEEDED a burrito. I told the bf to get on yelp and Someburros showed up with tons of reviews and a good amount of stars.  We arrive at Someburros and I see a good number of people inside so I'm thinking there's hope.. I've finally found a good mexican place in Arizona! But HAH! was I wrong.... let me break it down for you:  -I ask the girl if she has what I've been craving.. a big carne asada burrito. You know, the kind you can get at all other normal mexican restaurants? She says \"oh we don't have carne asada here, we only have shredded beef and ground beef\". (UH wtf?)  -we order a shredded beef burrito with some kind of sauce, then we ask what comes in it.. the girl says \"just meat and sauce\". We ask if we can put anything else in it and she says no. We look at the menu and all of their burritos have basically nothing in them!  - We realize that their burritos are basically giant soft taquitos, so we order this deep fried chicken burrito thing that's on sale on Wednesdays because it looked like it had the most ingredients in it.   -The chicken thing comes out, and for being \"on sale\" for 5 dollars, it was pretty small for the price.  I left full, but unhappy. It's definitely better than that nasty Filibertos, but at least Filibertos has carne asada!! If anyone knows of a good place to get a burrito, PLEASE send me a message.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "YG7wJFUzrNdGtvYzS9SeqA"
  },
  "V74rynfIh8nNLheF7sibHw": {
    "date": "2/17/2015",
    "text": "After a disappointing visit to another popular fast food mexican joint this week, my expectations were a bit low. I ordered the chorizo burrito with jalapenos cheese, potatoes and sour cream and man it was so good! Will definitely try again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YWcwLJNntceY1VijEHRWJA"
  },
  "8R9vhly7JFbw7GGBje_VIA": {
    "date": "9/10/2015",
    "text": "Tonight I ordered from sombreros to go. The Tempe location my check number was 182 I ordered a beef chimi with green sauce a beef taco beef enchilada  no garnish and rice along with a large drink. When my order came to go I checked it thank God because they gave me fries instead of rice. They gave me the rice when I hit someone's attention .When I got home my taco nor my enchilada had any cheese on it . I just had sauce on the enchilada and maybe two pieces of shredded cheese of . all I saw was the corn tortilla and sauce on my enchilada. My taco with meat and lettuce. My enchilada was tasteless with just a tortilla and the meat and sauce. The tasted bland. I never had an enchilada I didn't like. And I didn't like this. For sure!I really like someburros however this doesn't give me faith TO order takeout again. I've been a loyal customer of the Tempe location since it opened in 1986. Quality control needs to be taken care of. And the back and be forgiving to the front and give it to the customer. Improve your process to make sure that everything is taken care of it I'll food has what it needs on it and in it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kHBHAeNp1uL8uQuOQ5Lz1A"
  },
  "jYe5_gxPyouNmBPU09dJew": {
    "date": "10/7/2013",
    "text": "Love this place! Their beef taquitos are my fav and my husband loves their breakfast burrito (eggs, bacon, cheese, potatoes). I would highly recommend this place. The pick up window is also a nice option if you don't feel like waiting.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KovT6k5cONbg3_7Am7Nt1g"
  },
  "3rgLRXGVF63Sb2iosnymRA": {
    "date": "8/10/2010",
    "text": "As a midwestern transplant I have come to appreciate the greatness of having a good taco shop in the neighborhood. I live close to Someburros so it is my go-to place when I need a taco quick.  I've been going to Someburros for quite a while and never had anything that I didn't like. Their tacos are solid, tostadas are good, rice and beans are good - really everything on the menu is worth eating.  But this past weekend I tried a menu item I had not tried before - the beef and potato taco. It's midwest meets southwest and my Minnesota tastebuds were jumping for joy with the first bite. I know it sounds weird to have potatoes in a taco but seriously this thing is awesome. Ground beef with a little bit of taco seasoning, bits of potato, cheese and lettuce stuffed into a hard shell taco - yum!!  This discovery may be dangerous considering the proximity to my house.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "A2JGzkvNjckSmps_4FbKWw"
  },
  "9wgQNvngMFGoci8ay2TZAQ": {
    "date": "8/15/2013",
    "text": "I ordered a cheese enchilada combo to-go. It took about 25 minutes. They were not particularly busy, maybe 10-15% capacity. Several people were seated and served while I waited. No priority for to-go orders. That being said, this is a tempe staple that has solid Mexican food. I just wish they put a little more focus to their service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p0-6hqtqLJ6Q95wEv7UKgQ"
  },
  "9bx3llmQSxjQ6JJ_dpKJnw": {
    "date": "9/18/2015",
    "text": "Wow, they could not have disappointed me more if they had tried! The woman at the cashier's stand was unfriendly, the food took almost 10 minutes to come out even though it was a VEGGIE burrito so it didn't have any meat. No one bothered to apologize that we stood there waiting patiently while others got their food (including 2 cars in the drive thru.) Then they marked our orders wrong so when my spouse and I went our separate ways with our to go order we got the wrong burritos and couldn't switch. I was late going back to work, spent money on something I didn't even order, and was treated poorly. I'm sure not all experiences are like this based on so many good reviews (which is what made me choose this place in the first place!), but it was disappointing and I won't be going back even though it's near my home, and I was considering using it more often since it's so convenient. Guess not.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mqVJbdVr9Mr8AZWFr8oO0A"
  },
  "nWA2MwAYD2fvLdgugbIsag": {
    "date": "10/25/2015",
    "text": "1st trip there a few months ago I was very disappointed.  Food was cold, order was wrong and while leaving I just had a feeling I got jobed and the crew had messed up.  Tried it again today because recommendations were so good.  I must say, service was very good, food was fantastic and the order was correct this time..hah..very reasonable prices and food is cooked fresh.  I/we will be going back again for sure.  I must say there tacos are a bit on the skimpy side but very tasty.  The pollo fundido is fantastic.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3cgznhfLNlz9tOqd66AKxg"
  },
  "3YBaph7ZtX8wlIP_cm1Yhw": {
    "date": "4/26/2010",
    "text": "Gross.  I love Mexican and New Mexican cuisine, but this is just the most bland, arterie-clogging mess.  I've been here three times, and each time has been as bad as the last.  Sadly, they're very close to Solo Cafe, so I've made the poor choice to eat there after a day of studying on occasion.  I always regret it.  No flavor, lots of styrofoam packaging and plastic utensils, microwaved cheese, and no spice to it.  Save your money.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "vqMnEIdScGip-n9jhKpscg"
  },
  "VE-tMjN0nSbnbkHGCrQL5g": {
    "date": "5/7/2010",
    "text": "For a \"fast food\" place to get good Mexican food, this place takes the cake.  It is a hybrid between a Filberto's and a sit down Mexican food restaurant..  The prices are right in the middle and you get chips and salsa. The salsa is more a straight sauce, rather then tomato chunks, etc.. however, it is still very very good with their chips. They actually sell their salsa as well.  All of their food tastes great, with the same quality (if not better) then sit down restaurants.  Give this place a try, you won't regret it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "h0jMVxkvuaT-pWTi3OaLJg"
  },
  "VafGOMHoSZbHmWieJ1lZ1Q": {
    "date": "6/4/2012",
    "text": "Some Burros is pretty darn good. I usually keep it simple with a carne asada or machaca burro. My friend and I ventured outside of the usual burrito/enchillada and tried to Mexican Pizza. It was pretty friggen bomb. AND it's cheap too! I would recommend ordering ahead because it takes a while and the guy servers can be a little creepy. Other than that this place is pretty good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "pL4NhW3rTokFr-CQh3Lzgg"
  },
  "0LE-ZgPyAj45BLVU6ahN5g": {
    "date": "2/15/2013",
    "text": "I would come here again for sure! I had an enchilada and a taco and both were really good. I went here based on other peoples reviews and I was very happy. Awesome horchata as well ! :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ibp_fmEvAVs2W2A7brlZ1A"
  },
  "PPsvYN7L0vZRiiSUMfJzPQ": {
    "date": "8/31/2010",
    "text": "TWO BIG THUMBS DOWN! I do not know if it is just me but arizona does not have good mexican food. Someburros should not even be classified as mexican food to be honest. maybe its because i'm from California, and we got all the good mexicans. a burrito here consist of beef or chicken wrapped in a tortilla! with nothing else! no way hombre! and they don't even have carne asada, its ground beef. luckily i was there on the right evening where they had a chimichanga for $5 that came with a little more than just meet. and the only reason i ate it was because i was starving and then it was still only \"ok\".  recommendation- keep driving till you see taco bell",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sLZIHUWOBAHbazMW2KK7BQ"
  },
  "_k5WgIsBNVaHlyKuq8NunA": {
    "date": "1/9/2010",
    "text": "Oh ACK someone elses totally incorrect assessment of the situation prompted me to write a second review as a retort.   This place is totally dis-similar from Filbertos.   PERIOD.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DM-2TF5IfabxTv30eCYI6Q"
  },
  "PH1pAhC_uYe4ntjIUgtEGg": {
    "date": "5/5/2010",
    "text": "Overall this place isn't so bad for a quick mexican food place. It's not like eating at a restaurant or anything like that. The food portions are pretty great and sold at a fair price. I really liked their salsa and I felt it was nice and flavorful. I'd say this place is a small step up from Filbertos.  The staff here, however, were really rude. They seemed to want to rush everyone around.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rp4ctJtEe8_TnG81B7VKPQ"
  },
  "IVOILoNoJ9T6cwnPBR9dlw": {
    "date": "11/30/2015",
    "text": "The Pollo Fundido is AMAZING!! I get it every time I eat there!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pOf3YKLamJQUzXRK2TRf9A"
  },
  "dRz_ltKOCcRqyzNycLrcSg": {
    "date": "9/12/2015",
    "text": "Came here on a recommendation to try a red burro. I ordered the red burro and I ordered a machaca as well. The red burro was very good and fresh! The machaca was one is the best I have had. They serve breakfast all day here and the food is not too pricey. I was impressed with the food here and will try carne asada tacos the next time. The location was very busy and they have a drive thru as well. Parking is limited here.  I like this place and will be back again. I highly recommend this place and to try a red burro! You definitely will not be disappointed!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "05N0X8nEHfoSn7t21MyPsg"
  },
  "-JHslQRPO78y2-yXlLGNKQ": {
    "date": "8/19/2013",
    "text": "I went here for the first time yesterday with the boyfriend. He grew up going here and loves it.   Its a cute little restaurant and PACKED. The staff is very nice and everything is quick and clean. I forget the name of what I got but it was chicken with cream cheese melted over top. It was huge and delicious and we also got a cheese crisp with guac, which you cant really go wrong with that.  I also had a horchada which was yummy and the perfect dessert.   I'd definitely go here again since they have the more mild Mexican for me and it makes the boyfriend happy. Make sure to text the little thing they have on the flyer since you get a little freeby perk!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ij7OcAO5FpoNKxS1RzNoWw"
  },
  "OJQQVoY1wyDKZadO8RgB0A": {
    "date": "2/12/2016",
    "text": "I give the FOOD here 5 stars......They have EXCELLENT red chile burros, excellent beans,  the salsa is a little too hot, i wish they had  a mild one (like Macayos) The service is ok, i don't see them winning any congeniality contests  in near future, but hey.....the FOOD rocks.  Sometimes when it is good, you have to  lower your customer service expectations. This place is one of my guilty pleasures........I never get tired of it. If they put their employees through Quik Trip employee training it would be ABSOLUTELY PERFECT  as opposed to being just PERFECT. Some of the girls that work there are drop dead gorgeous and the guy that manages, the tall Hispanic guy......LORD, it is worth going JUST to see that big Hunk of a man.  SO the customer service is ahhhahhh....but the food and view make up for it in a BIG way.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5TT8H6SB7dTre1cx5U11EQ"
  },
  "ZBQ2QIItRrMHIxzJXv0h_g": {
    "date": "11/6/2013",
    "text": "I got the Mexican Pizza because Abby D. said it was good, it tasted like freezer burn. I would give 1 star buuuuuut they give away free samples of their party burros and taquitos, and those were good!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Eg5niduTCVnaIBzGmoLiVQ"
  },
  "kUIWF2wss1pn0-W6fh9ADQ": {
    "date": "2/23/2015",
    "text": "This place was delicious! The veggie burrito was amazing. I am only giving three stars because they charged me $1.62 for the smallest cup of guacamole I have ever seen in my life. $1.62!!!! And I came here to eat with the last of my money till payday. Other Mexican good places charge way less for way more guac. We paid for 3 full meals, it would have been nice to have a courtesy cup of guac. And the lady that took my order didn't seem to know how to smile. Other than that the food was good.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fhimVdplsOhjUmhabCBidQ"
  },
  "_w_DHe9C8TDNLWU7pimPxw": {
    "date": "10/19/2010",
    "text": "I have been going to this spot since I was a kid. It is almost \"comfort\" food for me!  I have always had great service, and the food has been very good, too. It is great for a \"fast food\" type place. Great for groups, and not too pricey. I definitely suggest this place to anyone. Everyone that I have recommended Someburros to, has loved it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "LUxPj9ntwYDs6Ii9vPSZWg"
  },
  "-mZuC8xfwGwzU4dK6yyTaA": {
    "date": "8/6/2012",
    "text": "Honestly, not that exciting. I heard a lot of hype about it from ASU friends of mine but I wasn't impressed. It was just your run of the mill Mexican food. And I didn't like that you ordered at the counter and got your chips in a paper gravy boat. The whole concept of the resturant would flow so much easier if it was set up like a regular sit down Mexican resturant. But appreantly it makes wonderful hangover food. I dunno.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jk30FjOKfjGDI7dWKRHO5A"
  },
  "5EG_dQzWugRVRsOfj05Zyw": {
    "date": "3/15/2015",
    "text": "Been coming here for many years.  Great red chile and green chile and outstanding fish tacos. I have one complaint. When I come inside to dine, I receive complimentary chips and hot sauce. But, when I go through the drive through,  chips cost extra. Why??? The answer they gave me was that getting free chips is my reward for \"joining them inside for a meal\". So, I am punished because I didn't eat inside? Ridiculous. Chips and salsa is pretty standard at all Mexican food restaurants in the Valley.  Don't nickel and dime someone because the took their food to go. Still a paying customer. Please fix this policy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AwpqssE05DqRA05K1hKYFA"
  },
  "TspUqaHOsPH2Ve-sD1UF8A": {
    "date": "11/1/2015",
    "text": "Fantastic food, loved it, as a self proclaimed taco snob from San Diego, I have tried tacos from Mazatlan, Baja, along our border on both sides. This was a real treat from the beans to the tacos, from the fresh chips to the colorado sauce. A great family restaurant for nearly thirty years. Good job to the family and their crews. Wish they were closer to Anthem up north. Mucho gusto",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I6sNxWMinBnJVJm2-wxxIw"
  },
  "itdXR0DDoEQOAevji3IKYw": {
    "date": "9/30/2015",
    "text": "I love this place! Even if the staff is rude and ugly. The food is bomb. If they stopped hiring greasy teenage girls with zits this place would be a 5 star all day.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hq0coXmKXq4gGPMhtiDfVg"
  },
  "qoRZfGswgcQCtGJ9anz_rw": {
    "date": "8/6/2015",
    "text": "Seems like a really popular neighborhood place.  I'm not a big fan of this style of Mexican food.  Chopped iceberg lettuce on or with everything is not very appealing to me because it doesn't have much flavor, and the heat from the dish makes it wilt. Okay for a quick and easy lunch though.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7fWi-UCkl6lsS5PnyIMVVQ"
  },
  "f_8B0YDMfeCJU4EdgEzFDQ": {
    "date": "1/3/2015",
    "text": "Went here for lunch today. The staff was friendly and retaurant was clean. I made a food order to go for co-workers. I ordered the Pancho Villa. Presentation looked good. It tasted decent. My friend also ordered the Pancho Villa and we both commented on how the there was layers of the tortilla. Its like they use extra large tortillas and quadruple wrap them to give a little girth. So if you peel the layers away its really not that big. Every thing tasted ok but didnt blow me away. With Mexican restaurants being a dime a dozen I probally won't be back. Sorry.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YPUB79cTwbq2ROE4a3dUIQ"
  },
  "w5QBy4uv9vPs4Vqf0tqImA": {
    "date": "7/17/2015",
    "text": "Not great... Taco salad was not pleasing and the steak tacos were small and not satisfying. I guess maybe we were supposed to order a burrito or something. Still searching for good Mexican in tempe. We won't be back here that's for sure.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k2CUPhVS8gGqHReqtj8r4w"
  },
  "koFGDz7r5w9F0CaAU2QyNA": {
    "date": "5/11/2012",
    "text": "Oh Someburros...you are better in my memory than in real life...but Oh what memories.... When I was in high school and lived in AZ my best friends and I would get Someburros all the time...it was where the entire universe was discussed and unfolded. Sometimes we would just get chips and salsa to go, but being there was better. Recently, I had Someburros on a trip to Phoenix, and was able to introduce my husband and baby to the joy that is Someburros. Not much has changed. I still love their salsa, which is really an amazing hot sauce. See...as soon as I get back to MN I dream about it! Things I love include the cheese enchiladas, the chicken burrito, and more recently, the chicken burrito with jalepeno cream cheese. But really, it's all good. And cheap. And a thousand times better for your memory and well-being than Taco Bell.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "vd2sS6GwiujV-6_Q-zSpsw"
  },
  "bz0rsj0Nu6JM8IpPK84GIg": {
    "date": "8/9/2014",
    "text": "Best green chili on the market. I want to be buried alive in Someburro's green chili.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wo8oLHs4wSytXRftot80Ig"
  },
  "jhlwh9sbWy6pbhhFQZFZlQ": {
    "date": "10/6/2013",
    "text": "This place is great! The service was really fast..!  My girlfriend and I got our breakfast burritos just minutes after ordering.  The Diablo breakfast burrito is one of the best I've ever had!! Staff was real cool.. Nice and tidy looking place.. Am definitely hittin this place up again soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "d9FFA5Mmx341Nu9YWv-yMQ",
        "caption": "Photo of Someburros - Tempe, AZ, United States. Chorizo &amp;amp; Egg! Daaaaamn!!!  ;D",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/d9FFA5Mmx341Nu9YWv-yMQ/o.jpg"
      },
      {
        "img_id": "zQuAx6FsqkTOVCBV_IttvQ",
        "caption": "Photo of Someburros - Tempe, AZ, United States. This guy&amp;#39;s the baddest!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zQuAx6FsqkTOVCBV_IttvQ/o.jpg"
      }
    ],
    "user_id": "ZyJR6l-WwtcV8IxmA0ejNw"
  },
  "Hd8-uAV3wquYxV1HJ086BQ": {
    "date": "10/8/2014",
    "text": "Someburros is Amazing if you are ever in a hurry and want fast but delicious and authentic Mexican food then look no further! The pollo fundido is huge and delicious the carne asada very authentic and the chorrizo is my personal favorite you can get it in almost anything!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uY6XRTlzaDFVexFQquLp-w"
  },
  "m9ZtjOf3xO4PJ1G-ppOK5A": {
    "date": "4/21/2015",
    "text": "Pretty solid little lunch spot! Reasonable prices meant I could totally pig out, so I got the albondigas soup and chicken enchiladas and really enjoyed both. They even have Mexican coke which is worth a star in and of itself! Pretty darn busy at about noon though - seating can be a bit tight.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rJOb7tYaJfqBbS4Pb4q30Q"
  },
  "s43f0TUeG48FiMy7pVaT4w": {
    "date": "9/26/2015",
    "text": "I love Someburros!!  I'm obsessed with their bean & cheese burrito... Their tomatillo sauce... And the crudo burro!  Yummm!  Get extra hot sauce!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4hOABZ7foceBDw_2sUCc-w"
  },
  "1AWiT40zUPmZvilednOwSQ": {
    "date": "9/22/2016",
    "text": "Excellent!  All locations are good.  Great kids meal and comes with a churro!  Cinnamon chips are really good as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7WvI2-SzZv8iuwJ6nRDVDg"
  },
  "Y0s-cG8VQRgm6sNPKEt1Bw": {
    "date": "10/3/2017",
    "text": "Came here for Taco Tuesday and their tacos are way too greasy and nasty. It was my first time and there was a hair in one of my tacos, I couldn't eat it. I was so disgusted.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vGDII1284LVonpfLUN6nTA"
  },
  "wTRfoOp11KryfmxMvofYNg": {
    "date": "10/4/2015",
    "text": "Felibertos more older and classy brother. The food is simple and fresh. Best part was the salsa.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BGBa69Er-GlNH9kmaHRNJg",
        "caption": "Photo of Someburros - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BGBa69Er-GlNH9kmaHRNJg/o.jpg"
      }
    ],
    "user_id": "WeDGAbKbrw02yRAxwmuI9Q"
  },
  "hnS8IV5lhSKR6xPOkZqWaA": {
    "date": "5/18/2016",
    "text": "I've been coming here since Basically my whole life. I always loved their beans and would usually get a bean burrito growing up. I had since moved it of state and came back to visit and we decided to make a stop for some Mexican food. I got the carne Asada burrito, it came with pico de avocado and beans and rice. It was super delicious. the burrito itself is about a medium size, it was very filling and I couldn't even finish it. The beans were just how I remember them haha. I got an horchata for a drink and it was the best, other places it's either watered down or extremely cinnamon-y and too sweet. This was just right!!! I definitely recommend this family owned business and would obviously come again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1FpuNNOdB_TYw7J2Zll1RQ"
  },
  "qPcImxkH1f8qhKLjBbi1uA": {
    "date": "5/15/2016",
    "text": "While the food is pretty good and there's a big selection on the menu, it's hard to justify the cost when you've got a slew of other awesome Mexican places nearby for much less. The people were super friendly though and there's online ordering available, which makes this a better option despite cost at times.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pWpxxDWmZZhY4K-lQ2gnOg"
  },
  "Uy6ZQCNvG73bzM6Aw489JA": {
    "date": "7/5/2016",
    "text": "Good little Mexican fast food restaurant to get food you thought to-go window in a hurry period or always a nice place to stop and get a taco and a margarita",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Le7jZvROPnY5-OkoJU5qhg"
  },
  "OrSJVVd3xq_PdG9RjH9rMg": {
    "date": "6/10/2017",
    "text": "One of my favourite Mexican lunch spots. Good food at a nice price. The Machaca beef burrito keeps me coming back for more. Warning they're kinda busy at lunch on Saturday , but the staff is well trained and handle things like the pro's they are. Plus you get a free meal on your birthday",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xXMTrfUViqcl8pBhEeplgQ"
  },
  "ftzDeIHbfcP3qbFAte6_tQ": {
    "date": "7/5/2013",
    "text": "Oh Pollo Fundido where have you been all of my life. I have never actually eaten here until recently. My company always gets party trays from here for our holiday open house and they are always very good and very popular with the guests and employees. One day last month a coworker says we should go to this place for lunch. They are having a special on their Pollo Fundido. What is that? Oh it is really good. You should try it. Ok. Let's go. Hope it is good. We get there at lunch time and the place is hopping. Pretty busy. Get up to the counter after a little bit of a wait and say the secret password to get the deal. Food comes out just a few minuets after the order is placed and it is back to the office to eat. First bite: WOW THIS IS REALLY GOOD! Mmmmmmm. How did I not know about this. My coworker tells me that Someburros Pollo Fundido is good but another place makes it better. Better than this? I don't know if I could handle that because this is really good. I have had it a few times now and it is still just as good as the first time. I don't know if I will ever get to try anything else on the menu because the Pollo Fundido is so good. Maybe one day. Why are you still sitting there reading this? Get over there now and order one. Do it. Right now. But it is after lunch. So go anyway. It can be a second lunch or an early dinner. But they are closed. So sit outside of the door and wait for them to open. Just get over there and try one now. Right now. Go. Pollo Fundido!!!!!!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "gzk3lmWV90wZ9I_rg3ZaAg",
        "caption": "Photo of Someburros - Tempe, AZ, United States. Pollo Fundido. Never had it before but it was great.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gzk3lmWV90wZ9I_rg3ZaAg/o.jpg"
      }
    ],
    "user_id": "vq6bB7vxk1lzOgqcv5hlmA"
  },
  "Nldky8RsZ8egBFoPao5DpQ": {
    "date": "5/22/2016",
    "text": "I had tacos here and the meat was really dry. The beans are good but I wouldn't recommend this place. They had good service it's just the food that wasn't that tasty.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2g9qRQJj6Vxgiiyq_96WLw"
  },
  "usqnZH6Wma65nGW3j7VnKw": {
    "date": "2/15/2016",
    "text": "Great local place that has a flavorful, solid menu, and an attentive staff. I go here once a week and get either a chorizo cheese crisp, beef enchiladas, or a chimichanga. They're always busy and they're the best casual Mexican food in the Valley.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CCuB98X_LjCts0Fno3xTJA"
  },
  "hHPUs9fkgOc0cAUd73IdMg": {
    "date": "3/20/2014",
    "text": "This place used to be so much better. I would come in from DC and my whole family would go here and get copious amounts of tacos. They are decent but with so much competition you need to stand out to survive.   The beef tacos were ok but lacked serious flavor. The breakfast burrito was uninspired and was kind of soggy. The green chile salsa was very bland as well.   The portions are large and the normal salsa is quite tasty but overall there is better Mex to be had.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vxxEifmvWBDEbtyu3Flmfg"
  },
  "ANhlPwmynenxWor3bnAmBA": {
    "date": "4/12/2017",
    "text": "I would probably come here every day if I could. I love the variety of options. The rice and beans are so good that I usually end up getting an order of them to-go after I finish eating. I love that you get chips while you wait even though it is not a sit-down-and-order restaurant although I'd like some spicier sauce. The environment is very welcoming and... frozen margaritas. You know you want one.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "njjE7SQn4TcxNZ-2Sfhofw"
  },
  "BYMPOx4QwIlzQiIUrPDw-g": {
    "date": "7/27/2013",
    "text": "We have been eating here for over 20 years.  This is a order at the counter kind of place and the food is quite good.  The veggie burro is a favorite for several in our family, and of course the cinnamon crispies disappear off the table very quickly.  The wait staff is always friendly, and the whole place has a family atmosphere, and people who eat here are just friendly.  Mary Sanchez helps with the tables and cleans up and always makes you smile she is so enthusiastic.   I see others complaining in these reviews that it is a gringo place, but the cooks are not, most of the wait staff are not and and most times at least half of the customers are not.  We have  several Mexican food places we like, and Mexican food is a little like love, it's in the eye of the beholder.  This is just good family food, nothing fancy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "QSs-xIOqz2KDeu0MhKcumQ"
  },
  "4sKNlU0Rs0mrYyrgXdbIVA": {
    "date": "6/29/2015",
    "text": "Is it under new management?  We were there yesterday, we walked in, the place was a mess!  The lady cleaning the table I'm sure didn't know what she was doing. There was a young family looking for a table, there wasn't a clean one to be found. They asked 3 times, yes 3 times could we have are table cleaned.  The lady ignored them. Needless to say I was very disappointed. We had to do a take out because there's just no place to eat. Even the food was disappointing.  Enough said, we wouldn't be returning.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ByBco1DJbD1DEt__wREa-Q"
  },
  "IQ5TF9KbZMY0lp2h-VSAVQ": {
    "date": "10/3/2014",
    "text": "I love Someburros, although I have to admit I always order the same thing (combo #1.) The chips and salsa are fantastic. If you like it hot order the salsa verde sometime.   Combo #1 includes: cheese enchilada, taco (choice of chicken or shredded beef), and beans. I like to smother the whole plate in Someburros red salsa and then dig in! Everything tastes fresh and comforting.   The restaurant on Baseline and Mill is my favorite, but it's small and can get crowded. The place is always neat, clean and friendly. It's not a fast food joint, nor is it fancy dining--somewhere in between.  One last note: you probably won't see it on the menu but they do serve bottled beer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GNjvUxJ7gD4otSCg30aeVw"
  },
  "xiW3-SkKe0wuhR-FNQk-AA": {
    "date": "9/26/2015",
    "text": "In town for a few days and excited to eat at my childhood favorite spot. Unfortunately I was extremely disappointed. After ordering online and picking up according to the schedule they set, my food was cold, the meat was overcooked and I could barely swallow it. Additionally I got all the way home and realized there was no hot sauce in the bag. How am I supposed to eat tough taco meat without hot sauce? My boyfriend liked his salad though good thing it was supposed to be cold.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EUjPzDN7HhqpsFGbfcSfJg"
  },
  "Rj3ZCPWA316Bo5rFAqznXw": {
    "date": "11/5/2012",
    "text": "If any restaurant were to rate a 0, it would be Someburros.  Between slow service and not being able to make a custom order, the white girls that run and manage this restaurant need to take a lesson from some Hispanic folk who run a home-owned operation.  On arriving at the Someburros location in Tempe, 4:00 PM on Sunday afternoon, I observed about 1/3 of the tables had someone sitting there...all eating or waiting.  There was one person at the counter schmoozing with one of the order chickies...not placing an order, just speaking to her in a quietly nasty nasal voice.  The other chickie was bouncing between the drive-thru and the phone, while first girl flirted obliviously...  I stood at the register for 2 minutes before chickie who was flirting realized I was ready to order.  She meandered over and asked what I wanted, for here or to go.  Being on the guacamole burrito quest, I let her know I wanted to order a custom burrito, specifically that contained guacamole, bacon, cheese, sour cream and raw onion. 4:04 PM I have a receipt for the order.  Chickie created a 'burro' that was a Bacon&Egg Burro (3.85) with no potatoes, no egg, add  guacamole (1.35), add Sour Cream (.96) and onion (.15) for a total after tax of $6.89.  Chickie asked me if I wanted salsa and marked my receipt.    I moved back to a position in proximity to the delivery station.  Orders older than mine moved out through the line.  Several large orders made their way out and folks received them to carry home.  4:16, I am called...I picked up my order and headed out to pick up the Valley Metro Limo.  Once at home, I opened up the burrito I received based on my order.  This was a 10\" tortilla with cheese, sour cream and raw onion.  The meat I received had no visual resemblance to bacon.  It is a most unusual preparation of meat.  There is gristle in addition to fat and chunks that are bigger, have different consistency and remind me strikingly of ham.  There are pieces that feel and taste similar to bacon...just hard to know what it is I am eating.  Most glaringly absent: guacamole.  I picked up my receipt and called the restaruant.  Michelle answered and asked immediately if she could put me on hold.  I asked how long she expected it to be and only heard a click in reply.  2 minutes later, Michelle picked up again and asked if I could hold.  I asked if I had to and she replied \"Yes\" before making the phone click again by putting me on hold.  2 minutes later, Michelle picked up again and told me to \"Please hold\" and pushed the button before I could reply.    When Michelle picked up for the 4th time, I cut her off before she could say \"Please Hold\" again by asking if the manager was available.  She said she was, laid the phone down (without putting me on hold) and went to get the manager.   Next, white girl Sara picked up the phone and asked how she could help me.  I shared that I was in about 30 minutes prior and ordered a custom burrito.  She said she remembered, and called me by name.  I told her the burrito had no guacamole and she asked me if I could return to the restaurant so she could give me the guacamole.    I advised I was riding the bus and the next round would not be available for over an hour.  She told me to hold onto the receipt, write her name on it, and next time I was by, she would give me a portion of guacamole.  I asked if the restaurant was busy and she replied that it was steady.  \"Is it reasonable, then, for me to have waited 6 minutes and been put on hold 3 times?\" Sara said that the girl running the phones may have been a bit overwhelmed and that it would not happen again.  I am certain it will not happen again as I highly doubt I will waste my time returning to a hispanic restaurant run by white girls.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 8,
      "cool": 3
    },
    "photos": [],
    "user_id": "6ywZ6BHXvdas8o-omBli8g"
  },
  "sysJpeMgdNH2NaXN_knh5Q": {
    "date": "1/13/2017",
    "text": "The customer service here is horrific. I placed an order for a party platter that was shown on the online menu to come with several sides. When I picked up the order and asked for the items included on the menu I was told the platter did not come with those sides. I explained the menu shows those items are included and when I called to place my order no one advised me the menu had changed. I was rudely told the menu was incorrect and I would not be receiving my sides. I later called to speak with the General Manager to discuss my customer service concerns and they would not speak with me. They had the day manger tell me the menu is wrong but if I wanted to drive back they would give me my sides. This was an hour after I had picked up my order.  No apology for their error or service.  I will not be going back to this establishment.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FcG-bGhzW7_MkGx6DizdJA"
  },
  "OB4cUGGzQ6b8q82EJMj51A": {
    "date": "11/30/2013",
    "text": "Since I work right around the corner from this Tempe restaurant, this is a go to place for weekday lunch. But you better get there early, because the small restaurant fills up fast. Good, fresh and tasty Mexican food. I usually get the chicken/avocado salad and then add a lot of the red chili sauce. You have your choice of dressing too, and I go with the jalapeno ranch.  They have a drive through for take out, but you have to call ahead.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HL-cdf_goIdOhH0uAOD-5Q"
  },
  "5Fm9Yb-XfjvxjEhfErDiLQ": {
    "date": "5/21/2015",
    "text": "My boyfriend and I stopped by after hearing a lot of hype. We were let down. Very bland taste. Honestly, I would rather run through a Filibertos.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_cX5QLnhhvqet9k4Q1HB6Q"
  }
}