{
  "k1P5QeUiBDvh2Yfl2f4Dgw": {
    "date": "4/9/2012",
    "text": "I checked out this place from a billboard I saw on the freeway. I'm a sucker for chicken strips, so had to check them out. When you walk in, it's a great industrial/ modern feel. They have pop culture posters & signs hanging everywhere. The menu is pretty simple, chix strips, slaw, fries and garlic toast, the options range in the amt of chix strips you want. I went with what they call The Box, I chose the lemonade, it looked fresh and was delicious. I enjoyed the chix strips, they were not greasy and actually had a good amount of chicken. The fries were the ole fashioned Ore Ida kind from when I was a kid. The slaw was ok and the garlic toast was great. The dipping sauce was average, I thought it was lacking a kick. All in all I would frequent Raisin Cane's again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dFLJSmWhGPsOh7AqnzF_yw"
  },
  "cNu0eQzSmHXCvMh3O8kx7Q": {
    "date": "1/15/2012",
    "text": "My first trip here, very clean and I love the aluminum chairs! The food was hot and fresh and I love their special sauce too. TOAST!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "1dmI94EJKK16kEagQUftAA",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1dmI94EJKK16kEagQUftAA/o.jpg"
      }
    ],
    "user_id": "T7dYjXf7I9sR5P9U9xtd6w"
  },
  "V4YFrsAkkJz51HOpCCc4uw": {
    "date": "9/10/2014",
    "text": "LOVE RAISING CANES!!! So delicious and your order is made fresh so it takes just a tiny bit but definitely worth the wait. You can also sub out the coleslaw for another piece of toast or more sauce! Also join their \"Caniac Club\" for free food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OW0PZxoGFGSOthAmN_cSUg"
  },
  "HzazkeEmeAJECb-wev8ayg": {
    "date": "9/28/2013",
    "text": "I'm not sure what to say about Raising Cain's.  They seem to have an identity crisis.  Is the restaurant Cain's (in big letters) or Raising Cain's (with the word \"raising\" in ultra-small letters?).  Why use the word \"raising\" if it really isn't important as a part of the name?  Yes I know it was somebody's dog's name.  Memo:  nobody gets that.  I accidentally found a location tonight (the one I'm reviewing) after seeing a billboard sign.  Kudos, your advertising dollars were well spent, I guess, by placing a billboard right over the store I probably would have seen anyway.  I never heard of them so I thought it might be a good alternative to KFC, as I had a major chicken urge.  Turns out that it looked a LOT like stereotypical fast food restaurants.  And it turned out is is.  With one exception.  While most fast food places have a very diverse menu with one or two featured favorites, Cain's does not.  Their menu, in fact, is downright weird.  The girl who greeted our bewildered looks simplified it ... \"we got chicken, chicken and nothing but chicken\".  Yeah, but only in one form.  What they call \"fingers\".  Can you order a box of 2 or 4 or 6 or 8 fingers with a side of slaw or fries?  Nope.  You get your \"choice\" of one of 4 packages that they're selected for you that have a mandatory drink and an extremely limited choice of peripheral items.  We wanted to take about 6 -8 pieces of chicken home with a side of enough slaw to comfortably feed 2.  Nope, can't do it.  The best we could do is buy that many extra sides of chicken \"fingers\" at over a buck each and a pound of slaw (way too much) and total price way too expensive.  Turns out the girl at the counter was creative.  We could substitute the hell out of any of the pre-determined combos, but we would only end up saving about 80 cents by doing so.  At that point nothing looked good.  But it was late, we were hungry and it looked like an entire high school's sports team had just arrived so we each chose the box with 3 chicken \"fingers\", subbed slaw for fries, deleted the drink and accepted the so-called Texas Toast.  Got it home and opened the box.  First impression was it was hard to believe how tiny everything was (except the toast, which was huge and probably there to delude you into thinking you had a filling meal.  The \"fingers\" were just that.  The only thing that kept them under any consideration was that they seemed to be made from real chicken meat rather than the ground up chicken paste some of the other fast food places are known for serving.  But the \"fingers\" themselves were dry, very bland and had too much breading.  Adding to the tiny \"fingers\" was a slaw container about the size of a shot glass.  Really?  Cabbage cost you so much you can't serve enough to have your customers get a real taste of it?  The \"toast\" was, well, a fat slice of bread, mushy and pretty tasteless.  And the final thing, a small tub of dipping sauce, tasted great but I prefer my chicken to taste good enough that it doesn't need dipping.  Bottom line:  as you were folks, nothing to see here.  They don't even serve real chicken parts like wings and breasts and legs.  Dull.  Boring.  Not worth going back.  Oh and my rating?  It started as 3 and dropped to 2 mostly because I got a nasty tummy ache right after eating.  Not saying anything for sure about what caused it but that is only the second time I ever had a negative food reaction ever in any Phoenix-area restaurant.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Pj9YpaP0T7A_5S_PT8IpNg"
  },
  "4TOMcJTXeEMxCcVlyOfE4Q": {
    "date": "8/30/2014",
    "text": "Our food was taking a while and Vanessa came out and have us a meal voucher and apologized. Super nice and professional. Thanks Vanessa!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UoFxbcINqAnyzmQVF6V8vA"
  },
  "elyYQsiXj5sjj4RqESTbmg": {
    "date": "2/29/2012",
    "text": "I went to Raising Canes for lunch.  Canes took over an old Burger King and spruced it up such it didn't look like an old Burger King.  That's a heck of a lot better than your basic 'berto's makeover.    The menu is limited; chicken strips, fries, coleslaw and Texas toast.   I had the 4-strip chicken box.  The chicken strips were freshly cooked and better than average, although I wish they had a bit more spice in the marinade or the breading.  The fries were crinkle cut, and were delivered warm and crispy.  The coleslaw was ... meh.  The Cane dipping sauce did enhance the taste of the chicken strips.  Overall the food was as good as what I would expect at a Church's or a KFC.  What was better the the competition was the look and cleanliness of the restaurant.  That is what I see as reason to go to Canes.  The table did not have the greasy fell you can have at other deep fry palaces.  I'll likely be back, but not for the food.  I'll be back for the item of the meal I have not discussed; the soda fountain ice.  The ice is finely crushed, almost to a slushy texture, which makes it great for sipping and chewing.  So rare to find top notch crushed ice these days, you know.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OUtjpGVqOa9jRLrHxnOvig"
  },
  "RHqUIV1sqe8AHKkIISlW5A": {
    "date": "2/7/2012",
    "text": "Lunch order to go.   I had the cainiac meal.  It came with 6 pieces of chicken strips, a cole slaw, piece of Texas toast, crinkle cut fries and a drink for about 10 bucks.  The chicken strips were lightly battered with a thin tasty coating.  The chicken tasted like real meat.  The meat itself could have been juicier.  The strips were crisp and weren't greasy at all.  The fries were boring.  Reminded me of elementary cafeteria fries.  I'm not a fan of cole slaw but this one looked more homemade than the kind they serve at other fast food places.    They also included a couple of sauces.  Tasted like thousand islands dressing with a bit of a kick.  Went well on the chicken and fries.  A big portion but also a bit pricey.  One thing I will say is the chicken platters dont make much sense.  It's better to order seperate meals and pay an extra buck for fries and a drink.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "DPitNu466172os6m0Yri1Q"
  },
  "U2MHQNkbXP_1qbGrkDk1Xg": {
    "date": "1/18/2012",
    "text": "Maybe it's the 10 year old boy still in me but I LOVE chicken fingers! The thought of a restaurant dedicated solely to chicken fingers lead me to believe they MUST have perfected the art of amazing chicken fingers?  So I thought.  Went to the counter and was really surprised how small the menu is- it's tenders and a few sides, that's it!! Order the 3-tender basket which includes fries and some toast or bread. Asked for ranch STOP we only have our Cane Sauce. BUT I want ranch I exclaimed! We only have our Cane Sauce. and so on... Got my drink, by the time my drink was filled the guy from the counter was behind me with my basket in hand before I could even find a seat.   Fingers - so the chicken fingers themselves were breaded, moist and tender, not greasy at all, however I felt they could be a little more crisp... They were much smaller than the ones in the picture at the store and web site.  Fries - I don't normally eat fries. Don't get me wrong I like fries, I just avoid the carbs so If they were really good I would have eaten them. These were SOGGY, old-school crinkle cut fries!! The place sells chicken fingers and fries. WHY NOT MAKE AMAZING HOMEMADE FRIES? Why not do what the belgians do - cut 'em fresh, fry 'em TWICE (two different temperatures) and make them amazing? These were SOGGY. I would rather eat fries from Wendy's or even McDonalds.  Decore - Very nicely laid out, modern looking store. They spent some money on the place, it's evident.   BOTTOM LINE: If you are going to be a specialty store, you had better ROCK the few menu items you make. It'l be interesting if you are around in a few years.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NKzLGod9KhAItpe73lI6OQ"
  },
  "Pe7G8P9pKcvVt-3_sCxhlw": {
    "date": "5/24/2015",
    "text": "I really don't understand what the big deal is about this place. Chicken fingers? It's basically glorified truck stop food. As if fried chicken and fries aren't bad enough, you can also get some buttered white bread with your order- guaranteed to put you asleep in the afternoon if you go for lunch. Don't get the iced tea- 10 cups of sugar per gallon is probably their mixing ratio. Barf!!!!",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "pW97pzsgfKQURzFz8k3Meg"
  },
  "iq5UXJH15NFurNRdKQin2g": {
    "date": "6/23/2014",
    "text": "Had lunch here Saturday and was up all night with food poisoning. Thought I was going to die. Will not be eating here again the rest of my life. Can I guarantee that I got if from here no. But 8 hours after lunch I was dancing around the bathroom. Worst pain I have had in years. Just check to make sure your chicken in done that all I have to say.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MhpHwvRHUqfxTfE-nqZOaQ"
  },
  "qjnjAaRYQecikxrIkQuigA": {
    "date": "1/9/2012",
    "text": "I was very disappointed in Cane's. I went there expecting something better then KFC. After looking at there web page I thought it looked like a pretty awesome place to try. I went threw the drive thru and place my order - the box combo- and some unsweetened tea. When I got to the window I was greeted by a semi-nervous teen. She reminded me over and over that it was made fresh and that's why it would take a minute.   After repeating how fresh it was I was really excited to sink my teeth into a crispy chicken finger. What I received was 4 soggy pieces of chicken a random piece of bread (not really toasted, and if it was suppose to taste more the just bread it didn't) and crinkle fries that I could have made myself in the oven at home. The chicken's breading was so soggy from being deep fried it came right off the chicken. The only thing that really tasted great was the coleslaw.   I was very disappointed. I would recommend KFC or even the Pool Hall (Silver Q Billiards and Hookah Lounge)  at 67ave and Cactus before I would tell someone to go to Raising Cane's.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6ai3vG2vlcQXTINdbO5H3w"
  },
  "Zwpmc-Bv-ivdAJHnq_hh0Q": {
    "date": "11/24/2014",
    "text": "Great service great chicken, my go to spot always going when am.craving good chicken freshly made . :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WlZKmSX0sKpYPEEVuYIR9w"
  },
  "JvoSS8SRNBSa2mNZ6ForBg": {
    "date": "9/13/2013",
    "text": "First time here and we were greeted by the very friendly staff! We got our food quickly even though it was busy. Amazing chicken, toast, fries, coleslaw and of course their special dipping sauce. I felt like I got a large amount of food for what I paid, but the quality didn't suffer whatsoever. The food is just awesome!!! Can't wait to come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "O-YfP9p0q1mI6OoRf8EPag",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. Digging into our Box meals :)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/O-YfP9p0q1mI6OoRf8EPag/o.jpg"
      }
    ],
    "user_id": "VSGUxensvGVPWW6s2GiMjg"
  },
  "0ABoh1uGsksSPnrehCYsrg": {
    "date": "7/28/2014",
    "text": "Came here for the first time yesterday and it was delicious! Chicken was juicy and tender. I like how the menu options are small and not too overwhelming. We went thru the drive thru and they didn't offer us any sauce or anything but if they had hot sauce it would have been perfect. The cane sauce was okay nothing special. We will be coming here again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AYuyDMqarvXxCvwd8Sp-Tg"
  },
  "QBZxMlDsZEjBG4xOR3vReg": {
    "date": "10/21/2014",
    "text": "My family and I love Raising Canes. Get The Box Combo and Sweet tea mixed with Lemonade. BEST CHICKEN AND TEXAS TOAST EVER!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KwEyLBv2FOs-COrJnVpIaA"
  },
  "t5-okESP12sJnOYBStWyRQ": {
    "date": "4/3/2013",
    "text": "I am a bit of a chicke finger connoisseur. In my humble opinion this is the best chicken finger specific joint in the country. Chicken is fresh, breading isn't too substantial, sauces are homemade and fresh, garlic bread is great compliment,  and the krinkle cut fries are excellent. If i have one complaint it is they don't have BBQ sauce. Luckily the sauces they do have are outstanding. Any city my wife and I visit that has a Cane's it is a requirement that we visit!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "sKhAluWN6hsCiPjVmISQdA"
  },
  "1zIcf_xwtub69Y-pfhT_-Q": {
    "date": "1/9/2012",
    "text": "This place came very highly recommended from several people.  My husband works in the area and was anxiously awaiting it's grand opening.  He found out the history of the place and the owner, and so we decided it was a place we'd go.  We finally made it there yesterday.  The place was clean and the people were friendly.    The menu is small, but I like that.  Too many options overwhelm me.  Hubby and I both ordered the meal that came with 4 chicken strips, fries, toast and coleslaw.  Our kids got the kids meal.    We paid nearly $28. This is more than I had expected, and more than I'd care to pay in the future.  For fast food, this is outrageous.    The chicken was good.  Not too flavorful, but the breading was perfect, not too much.  The fries were soggy and under done.  I could do better at home in my home fryer.  The toast was, well, toast.  Nothing special there.  And the coleslaw was same as store bought, I'd had better.  The \"famed\" Cane Sauce was ok.  It didn't blow my mind and it wasn't gross.  Ketchup was available, which was good since my kids thought the Cane sauce was \"weird\".  Ranch would have been more their taste.  We may go back if there is a location that pops up closer to where we live, and if we were kid-less for the meal.  It's too expensive otherwise.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iQtw19gqUjDMynCqgvHPvQ"
  },
  "Y7oqdDOnfUzfGVScu4axPg": {
    "date": "12/18/2012",
    "text": "Tried this place for the first time tonight, and was impressed with absolutely everything. Well-lit building in a decent location in the Arcadia area. I drove here from the Garfield neighborhood and it was well worth it. Juicy chicken and awesome cafeteria throwback crinkle fries, along with one of the best slices of toast I've ever had. All three of these foods were still crispy when I got home, which almost never happens with fast food. I wish I had gotten the girl's name who took care of me. She was cute as a button- very enthusiastic and happy to answer my questions. I'll be back here soon!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "3QCT9NlijUkpOXcv1pvMGQ"
  },
  "TQmlO3TA9-uLiD1_aub9hA": {
    "date": "2/9/2014",
    "text": "I was surprised by this place.  When I first seen it, I was thinking it was just another fast food joint. When I had gone in side. I was like, \"whit is this, it just have chicken fingers? What gives.\" Then I ordered and, Wow.\" The food was great. And I can see why specialising in one foid type, really makes a difference. Service was good, inside was clean and well decorated.  Though the price is a bit high.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NRjnSUPtxJwk1qOj38j98w"
  },
  "nKFjXC9bpCczuF_6-vZAjA": {
    "date": "2/3/2014",
    "text": "Love, love, love! Great food and good people working there. I do have a suggestion for them though. My dad loves your chicken but instead of just fries, coleslaw, and texas toast, he'd like to see more of a variety of sides. He'd also like to see different pieces of chicken and not just chicken fingers. I am happy with it the way it is, but you should probably increase the menu for others.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ryFFfT_i0pOWkTwi8IWQ4Q"
  },
  "0XtoavDEGMj2xZVrChocaA": {
    "date": "1/9/2018",
    "text": "My review is based on the lack of attentiveness from staff. I have been coming here on and off since opened. Food is decent. I will give them credit for doing one thing and one thing well. Every time I come here I always order unsweet iced tea. Every time they give me sweet tea. It really bothers me that they can't follow a simple order. Now every time I take a sip to make sure it's not sweet tea and time and time again it's sweet tea. I called the manager the second to last time I was there and this occurred and her response to me was, \"as a diabetic I understand that it is important to get the order right and you can't have the sugar\". First off, who the heck said I was diabetic????? Why is management assuming that someone is diabetic because they order unsweet iced tea???? Maybe the three or four people working the drive thru window should spend more time reviewing an order to make sure it's accurate instead of joking around and not really working. Just a thought.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TuKpqmS5HVKPwkhSZxEZWg"
  },
  "k5sxcuXmVXnEiamoj-QGHw": {
    "date": "1/4/2017",
    "text": "I was charged for a caniac combo and when I got home. I only had four pieces of chicken and cane sauce spilt everywhere with cold fries.I understand they were busy but that's not what I paid for very Disappointing",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ow2tbzBi7AB15mvAoaHJgA"
  },
  "pBQ4bvizWVZsVz3Ells6WQ": {
    "date": "8/8/2014",
    "text": "First time at Canes for lunch today. They had 80s music blaring. With the linoleum floor, it was loud. The cashiers were very engaged in their work and did a good job.   Ordered for a crowd so I got the 25 piece tailgater with some fries and toast. It came with sauce.   Order arrived in 8 minutes which tells me it was not made fresh. Too bad.   The chicken was hot but lacked the crispness I was hoping for. I think most of it was cooked before I arrived. The fries were very limp. Not very appetizing. Most of them went uneaten.   Not impressed by Cane's but my coworkers keep raving about it so I'll give it another try someday. It just won't be a go-to.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fCWEsW3lhZk2RQ0zPrqvsw"
  },
  "5IjL0V4aStdUfA6hSa8GSA": {
    "date": "1/7/2018",
    "text": "I've been to different locations and all consistently great. I always go there for lunch so good. Great service at all locations food always fresh and hot.,.love toast and sauce. A must try beats all chicken places.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-JljcshgxOfOIVYqgbMPMg"
  },
  "RqeMeTK3FnFUfTbp-BnI5g": {
    "date": "4/17/2017",
    "text": "The young staff is friendly, energetic, and very polite. Each time I've been here, someone's always working lobby making sure everything is cleaned up. You'll be surprised that they don't offer traditional sauces such as bbq and honey mustard, but their in-house sauce is delicious and compliments the chicken well. Great place if you're just wanting a simple chicken strip and french fries bite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UgjxC1VZnMLDz2Mqt8nstQ"
  },
  "02lm_QJ_EspHzXYJx-H82g": {
    "date": "10/25/2016",
    "text": "I love raising canes. It is an amazing drunken food discovery.   It's even better sober.  Their chicken is so juicy and delicious.  Everything they have is so good.   The lemonade is BOMB.   Louisiana hot sauce, great choice.   Texas toast... Yes  Try toasting it again the next morning if you have leftovers, it's amazing.   The crinkle fries are always cooked to perfection.   The canes sauce is amazing.  I love it here.  You can even become a member for free and get free canes.   The service is always great too, the workers are really friendly.   I've never had a bad experience here ever! The food and service is always consistent! No complaints here. Keep up the good work you chicken magicians!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GlF9DNwCv0QV4QHR3q9mSw"
  },
  "rkJfupaqdSfmeQvVBgyeqw": {
    "date": "9/10/2016",
    "text": "Slowest Canes on the planet!!!! It's worth it to drive to a different location....you'll save time!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "mUE0kJRkH-rz6zuCnXcH8A"
  },
  "mcIGFTIGoyRxmIIMBmRhJw": {
    "date": "3/24/2017",
    "text": "Love this location  Absolutely love the customer service which is amazing.The manager is very nice and always welcoming! The food is top quality and the best in the business! Toast,secret sauce, and freshly squeezed lemonade is heavenly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ysKvq1z3-svFchdBbhSqeA"
  },
  "uYWwArCLFCAHPKqst375Gw": {
    "date": "3/8/2017",
    "text": "This is my favorite chicken joint. The portion sizes are big, the chicken juicy, the sauce is adds just the right amount of flavor, and they give you a nice big piece of toast.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jVOFjRkifwdl8Wi0htAkhw"
  },
  "-pI9JKZTd5fx0Rk_nJO64g": {
    "date": "1/19/2016",
    "text": "The drive thru line was out to the street.  Went inside to find no line.  The lady working the front counter was so cheerful and helpful.  I did not want combo meals but it turned out with her help combos worked out and saved me on price.  The chicken fingers are incredible.  Love this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yqEJm03zWaW8Gms2vYvk1w",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yqEJm03zWaW8Gms2vYvk1w/o.jpg"
      }
    ],
    "user_id": "Y88SvJr2hJ8jV7gQKgz9fg"
  },
  "7GTIFwFz4Dyj6w4rhb4JYg": {
    "date": "10/22/2016",
    "text": "I feel like I could eat here everyday, but alas once a week is fine. I love their chicken so much haha it's definitely worth your time, taste and money. Their sweet tea is good but I personally have to water it down. Come on in!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "P2CLSypzuTK6AI-pBi429w"
  },
  "0mgme1BrR6EhijQ2qbh3Xg": {
    "date": "11/16/2017",
    "text": "Yesterday was my first visit to Raising Cane's. I was there to commemorate my grandfather on his birthday. He always chose chicken strips when he took us out to lunch. It wasn't the usual drive through experience where they take your money and close the window in your face. The gal at the drive through took the time to connect with me and actually cared about what I was up to. The manager heard that I had never tried their chicken or special sauce and brought me a fresh chicken strip while I waited the couple minutes for my order. The chicken strips were juicy on the inside and light and flaky on the outside. No excess grease, not even on the to-go box. Thank you for brightening my day!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uv8tNgqr6d1m6UOxo6mJ6Q"
  },
  "DLHk3esofOTOtuPLhHWZcw": {
    "date": "12/18/2013",
    "text": "This place confuses me to review.  What do I comment on?  They've got Chicken Tenders, Fries, Texas Toast, and that's about it?  Here's what I did like about the place.  Staff - Very friendly, outgoing, not your stereotypical fast food types. Decor - They did a nice job of capturing the local community within the store. Cleanliness - Overall good and they were actively working to keep it that way.  Nice to see.  I can't give it more than 3 stars though because the food to me was just average.  I much prefer Chick Fil A for their chicken and their fries are definitely much better.  Service there is always an A+.  So overall, good not great.  Would I go back, yes if there wasn't a CFA nearby.  Otherwise, no.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WdZXKWoC9OC72kkvHZhUgA"
  },
  "WL89VUvj3UGxnOlNxYT2pg": {
    "date": "1/8/2017",
    "text": "I mean, what can I say, this is every child's dream restaurant and now as an adult, I get to enjoy it whenever I want.  I know we all remember going through that phase where we ordered chicken fingers and french fries at every single restaurant, regardless the time of day. Well I'm guessing the people who created Cane's all lived through that phase and didn't want to get out of it.  The menu is simple... how many chicken fingers will satisfy your craving? I'm always good with 3 crispy and juicy chicken fingers, hot and crispy crinkle-cut french fries, soft and buttery Texas Toast, and half sweet-half unsweet iced tea with crushed ice.   But wait, there's more!!! Their dipping sauce is to die for. You know when your mom used to mix together ketchup and mayonnaise and call it a new sauce? Well Canes basically did that, put sprinkled in a whole bunch of black pepper and magic and BOOM! The perfect sauce to complement their perfect chicken fingers.  But hey, don't take my word... try it yourself!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mgHtMc2Os4VH_yIqDQi35A"
  },
  "DYD5WF-T01y4PsgSw_unkA": {
    "date": "6/1/2013",
    "text": "Yummy chicken fingers, great sauce and friendly service!  I really like this chain that has only recently entered the Valley. The restaurants are nice and clean, decorated in fun style with movie posters and other pop culture memorabilia on the wall. Each restaurant also seems to support its local high school sports teams and many of the workers likely come from those schools.  Service has been very friendly, you order and they bring the food to your table. Going through the drive-through is very quick as well.  As for the food, they keep the menu simple: chicken fingers, fries, and Texas toast. The breading on the chicken fingers is tasty and I really love the special dipping sauce they provide - not sure how to describe the flavor except that its really good.  Overall, Raising Cane's is a great addition to the Valley's fast food scene.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "KTK_ws8lu_TWfR7DtDWjMA"
  },
  "zB2obweXjVykTrp-4dvUww": {
    "date": "6/16/2016",
    "text": "Simple and delicious. The chicken strips are fresh and cooked perfectly. The Texas Toast is great, and so is the dipping sauce. I would definitely go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "1bqgLT7SCG3hkKcnE1e9IA"
  },
  "nMO0tLZ1BzYx9pe6XEy9jQ": {
    "date": "7/22/2015",
    "text": "Food was not bad, but the place was dirty  Napkins on the floor, drink station messes with soda on the counter. Floors were sticky. Tables were extremely dirty, the booth deaths had food on them.  I do not recommend going inside to sit and eat, you will just be disgusted.   We had our food to go.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RgF_ndkPEMEDKsABIwiXRQ"
  },
  "taaFLpEfwNFyLaOQFD5fzA": {
    "date": "5/16/2015",
    "text": "My wife and I LOVE this place!  The chicken is not as good as other 'chicken only' restaurants but the sauce is amazing, we always get extra.  The large 'box' meal is enough for the two of us to share, we always order extra toast instead of coleslaw because the toast is great as well. The entire team at this restaurant acts like they are paid 50k a year, the service is wonderful and they are always friendly and seem happy to be there taking care of customers.   A tip is you can order the meal without the drink and they subtract the price of the drink, we drive through and eat at home most times so this is a nice way to save a little money.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PlPGfQ0obCVitdchlRQbew"
  },
  "HMnQFDK71e13ShwbWSQSUw": {
    "date": "12/19/2015",
    "text": "The food here is delicious! It reminds me of Zaxby's, which we have back in my home state of NC. In fact, it is virtually identical, but that is not a bad thing. The chicken is awesome and the sides (fries, cole slaw, and toasted bread) are good too. It's also not a bad price. We got 5 meals for about $36. I will definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "h2ZRHjBj9K7W5jx1dowi-A",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. Delicious!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/h2ZRHjBj9K7W5jx1dowi-A/o.jpg"
      }
    ],
    "user_id": "daWTgkX5K2d4s8xjk6yFCA"
  },
  "OZ-yZ1toza8Gb5JF4-tY5Q": {
    "date": "8/13/2016",
    "text": "Awful! Just straight awful. I'm not a health nut but serving 3 different starches in 1 meal is just crazy. The bread, fries and batter on the chicken strips is way too much. Not to mention the batter on the chicken strips is terrible. No flavor and it just all felt like too much. Never again.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s14sXQe5ElyXIIRQH-rzTw"
  },
  "PEHd4EhZS8khOgvo-fxfQg": {
    "date": "3/14/2014",
    "text": "I LOVE this place and can't get enough of it! From their chicken strips to their Texas Toast, to their amazing coleslaw, it's ALL good! Only drawback is it's a little more expensive price-wise for my liking but hey, it's an indulgence, or a treat, when I have it. Love their food, the ambience, and the friendly staff. Once when they forgot something to put my order they just moved me on back through the line so I could get my remaining parts to my order and get me off and running.   If you're looking for a new chicken place, give Raising Cane's a shot.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "nS2nbq8XEzUkhvhhEDm1ZQ",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. Road sign",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nS2nbq8XEzUkhvhhEDm1ZQ/o.jpg"
      },
      {
        "img_id": "JGKilae648a4y8DkEPRLWQ",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. Drive up window",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JGKilae648a4y8DkEPRLWQ/o.jpg"
      },
      {
        "img_id": "Mpx3r0KdIPwo-z6kUam_cg",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. Menu board",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Mpx3r0KdIPwo-z6kUam_cg/o.jpg"
      }
    ],
    "user_id": "FqNJxZ3zkcF-o-QUXz4yeg"
  },
  "TpEnAnT70quHEDdcRWmtPg": {
    "date": "5/20/2017",
    "text": "The location is convenient but how the hell are you suppsed to turn into this place coming from the east side....let alone leave the establishment?!?! Being so close to an intersection means the traffic heading east is backed up AT LEAST to this entrance (if not further). Aside from getting here, the food seems fresh and fairly fast when you use the drive-thru. Inside it can be a bit of a stand still.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E0KoeSFSDCzSf18V5X3I4w"
  },
  "Te3s1ZE7SQinIj-yBOGRNw": {
    "date": "7/16/2018",
    "text": "Love this place but this last time waited 20 minutes for my food and got both wrong will not be returning to this address",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8eMDqHoMWeA-bIhnQ7ah2w"
  },
  "D79BarcEVj_e2Og94oz9uw": {
    "date": "6/23/2018",
    "text": "Amazing the food is great and always fresh and tasty i recommend the 3 peace meal you will love it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9WQ0y-79CGZKL3Hy3pi3mQ"
  },
  "2xXWpxFAq4cVApU-jPHgow": {
    "date": "7/17/2017",
    "text": "Chicken fingers was good crinkle fries a bit on the thin and dry side. Could use a bit more of a selection of sauces.. like ranch or barbecue sauce.  Great service",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "j5D1LB_rJLuCbJQ90Z_U6w"
  },
  "PMnle3Z7b-v9H4O1VSUY2Q": {
    "date": "10/28/2017",
    "text": "Normally I love this place, the sauce for the chicken is dynamite. However, after a long day we stopped by Raising Cane's for dinner. We went home only to realize that half our food didn't make it in the bag. Unfortunately only my kids are Cane's that night and the adults had cereal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mj_cHNixBgkALBV6PhhHKQ"
  },
  "Sp39_V4MB36xijWW3V8ppA": {
    "date": "5/2/2016",
    "text": "It's fast food, but I find this is actually my tied for number #1 chicken strip shack.  Also love, love, love the Cains sauce, they should be selling this at the grocery store.  Food quality is consistent, and hot, and the fries are the good crinkle cut ones like I had when I was a kid.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "_fGju43E8HBbNbvRwT0JfQ"
  },
  "N2kBhDPwOrvWCeGr35i6fg": {
    "date": "2/8/2015",
    "text": "I really like this place, mostly for the simple menu. They do chicken fingers and lemonade!  But, really, if you do just one thing, ya better be doing it well, and they do. The staff must like it, too, which explains why they are all so happy and were so eager to serve me...no long meetings and staying up late learning all the menu items!  Got the top item on the menu, which is my advice for going in virgin style and not knowing what's good, but then again, they only do chicken fingers! Mine disappeared before I knew it, and the traditional sauce had just the right spicy undertones with a smooth finish.  Drive thru looks like it runs pretty quickly, so now that I know what to order, chicken fingers and lemonade, I'll be driving thru when I'm in a hurry...nice job, dog!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "-CeqjIQnrfRZZuxFE2IgbA",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. Graffetti",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-CeqjIQnrfRZZuxFE2IgbA/o.jpg"
      }
    ],
    "user_id": "q6WC_ded0F01iIPkwYUijg"
  },
  "7FSH-Q7ei7t6sD-V_TgOgQ": {
    "date": "9/10/2017",
    "text": "Although it always seems to be run by teenagers the food is always what matters and RC doesn't disappoint. Love their side bread, their dipping sauce and perfectly cooked chicken. This place does get a little loud and rowdy not to mention the crew seems to forget to clean out the trash or at least clean up the drink area but I usually keep to myself and dig in when visiting.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H_xC0fepAS5BufkfCN2NNQ"
  },
  "de_4bW_CQHbM078H-OuH8g": {
    "date": "10/19/2017",
    "text": "Canes on east Thomas is always awesome.  Food is fresh and Canes has the best chicken tenders period!!!   Also Coke Zero is mixed perfectly with tons of fizz and super cold.   The drive through is always fast, order always right and the gals at the window super nice.  If you like chicken fingers this is the best.   Good sauce too.   Awesome toast.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MPJuMnTcR01LVJ88vMZU8A"
  },
  "GOoA2mWP1QCcszIRbJGAQQ": {
    "date": "9/10/2014",
    "text": "Raising Cane's is delicious and I always end up coming here a couple times whenever I am in town on business.  They are the only show in town now that my favorite - Rock N' Roll fingers has closed.  Their chicken strips are big and fried perfectly golden brown as are their fries.  Their signature dipping sauce is smooth and peppery and I always have to order an extra to go with my chicken and fries.  It is more or less exactly the same sauce they serve at Zaxby's chicken.  Fun decor and fast with your order.  If you love chicken strips, I recommend this place highly!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "4uJXindoZlYPawRRJp4LZQ"
  },
  "6oC1XUcN2K2ogNdmkbAVLA": {
    "date": "9/20/2017",
    "text": "Today was my first time to try Raising Cane's. The chicken was very dry. You would think that a place that does nothing but chicken fingers would have moist, juicy chicken. The sauce was flavorful but too sweet for me. The Texas toast was just thick white bread with grill fry - tasteless. I threw it away. The fry's were ok - standard crinkle fries cooked right. I usually give a place a second try but I don't think I will be going there again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1c93M7TpTMYuNUwVYkli2A"
  },
  "vntuOFGw9WGhvSMgAYjgpQ": {
    "date": "4/7/2016",
    "text": "So after 2 years of telling by mom how good this chicken finger place is, when she got here she said I can't wait to try it. She lives in Florida so she doesn't come out here much.  According to her words, \"you're right this place is so good. The chicken is fresh and it not heavily breaded, which I like.\"  Btw the lemonade is delicious too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "pMF-NXnnBtF2QHtm43v85w"
  },
  "15kcLu6ed_1jEErrG4VZaQ": {
    "date": "2/27/2016",
    "text": "Crap location with bad management and front line service.. Came in on 2/27/15.. Managers were there in the lobby for a meeting with NO customers.. I waited 20 minuets to get my meal while the teenagers in the back laughed and managers stood around and talked about nothing. If you want to go a fast food restaurant without the fast.... This is your place",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Mc8s5DL1Lu2QoHpeTNQAXw",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. Management actively not caring",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Mc8s5DL1Lu2QoHpeTNQAXw/o.jpg"
      }
    ],
    "user_id": "cjzjOubh5VPSNHl4O7k5IQ"
  },
  "J9CXNjnY25MZg7xAyogTgg": {
    "date": "9/16/2017",
    "text": "This is my favorite restaurant, fries and chicken are always nice and crispy. They are never flimsy. The sauce is awesome as well as the home made sweet tea.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5nOrAvBMxFGoivOB5MrYJg"
  },
  "denJRDIrY-ryZbXXmLIeUg": {
    "date": "3/1/2016",
    "text": "I previously posted a glowing review of this place after a couple of good experiences, but after several consecutive visits experiencing *horrendous* drive thru wait times, I'm updating this to one star. There is no excuse for how slow the service is here. I look at the other customers in line and they're all shaking their heads in disbelief of the wait times.   From the time I pull into the lot until I'm pulling back out onto Thomas Ave has averaged about 15 minutes over the past several visits. That's ridiculous for fast food.  \"We're busy\" is NOT an excuse. They're are only 2 chicken items on the menu! I get the impression that every order is made-to-order. I can't think of any other reason why the wait time is the same as a sit-down restaurant.   I get the appeal of freshly cooked food. I do. But during lunch and dinner times it's idiotic to cook each order as it comes in. Again, this place only have two items.   ADVICE TO MANAGEMENT: Look at historical sales data. It can't be that hard to forecast sales. You only serve two kinds of chicken! Just keep cooking the fingers until the lines thin out. Worst case scenario is that you're throwing out a handful of unused fingers. The upside is that you're moving twice as many (if not more) customers through your lines with equally fresh food, and not having people see the drive thru line from Thomas Ave and say to themselves \"f this!\"   For those reading this wanting chicken nearby, there's a Pollo Loco and other places that serve chicken within a block of so of this place. Don't wait in line for ~15 minutes here. It's not worth it.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "h8XLUIPAzy0xiWrSieUMIA"
  },
  "eKBVtAfKW7Y6TM6dJARI1A": {
    "date": "8/31/2017",
    "text": "Awesome customer service! The manager on duty, an older gentlemen, was super nice and friendly!! :) We came in a little late close to closing, but he didn't rush us or anything. We felt very welcomed! definitely coming back regularly!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h-uEHlloB7JdQtlpwgc2Xg"
  },
  "ENeA49oEaWjQ3RJ0eqef8Q": {
    "date": "8/7/2016",
    "text": "Cashier on aug 8 at 1:40 with glasses gave me good customer service but she seemed very shy... Maria knows how to cook them chicken fingers real good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R4jR9v4lOxh2ANT7npQMsw"
  },
  "acbWv5H5PceoWsdCgUz5zQ": {
    "date": "5/9/2017",
    "text": "We definitely need Raising Cane's in California. Love it! I look forward to visiting whenever in Phoenix or Louisiana. I'd trade in KFC anyday to have a CA Raising Kane's :-)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UjjlmqOgpyowAiOIcOaTfA"
  },
  "SorT24sx7HN-jHt-AbTaSQ": {
    "date": "11/25/2017",
    "text": "Don't get me wrong, I love canes the food is delicious. Its mainly the customer service, I ordered the box combo with an extra toast aside instead of coleslaw and i also ordered the sandwich combo with canes sauce and toast aside. While ordering the girl is taking our order through the drive thru and while my bf is telling her the order you can hear male voice yelling on the background at the same time as the girl is taking our order. She repeats what we wanted, everything seemed to be ok, that guy on background did bother me because my bf had to repeat himself. I was already iffy once I heard the guy, anyways we go to the first window to pay and the girl at the window also repeats the order and I tell my boyfriend she didn't mention the toast or canes sauce on my order. So he tells her and she says that will be 1$ extra, she already had run my card too! So there goes another transaction. And I'm thinking fine, I'll get my toast and sauce.. ok.. we get home to find no toast for me, just one sauce and my bf did get his extra toast. I'm pretty upset, I didn't check the food at that moment because we let them know at the window and it was paid for already, I trusted them. My sandwich combo also always has canes sauce on the buns, well guess what. It didn't have any at all! The chicken fingers seemed to be dry due to that. For future reference the workers should pay more attention to what people are ordering.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "H5iyLilUgZGDf17Uf_BBCQ"
  },
  "IQQvGoDzuke2_y4Pfu88UA": {
    "date": "6/8/2015",
    "text": "You would think \"oh it's just chicken fingers\" but Cains is different so big and juicy. After visit there I probably will not go anywhere else when I'm in the mood for a fast hot chicken finger... I like the fact they keep the place very clean. Bathroom looked and SMELLED great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zw17POvq4lFh7hRPvQ016w"
  },
  "dlMxB-efgtT9SouWAYgCtQ": {
    "date": "2/13/2015",
    "text": "Here's the deal:  The other reviews that talk about the chicken being pretty much \"Ok\" are on target.  It isn't 'bad' chicken, it's pretty good....it just doesn't \"wow\" you like you'd think it would at a place that pretty much just does this ONE thing.  Chick Filet chicken strips are superior in my opinion, as are Popeyes.  The reason?  Flavor and seasoning.  The strips at Canes are just 'there'.  Not really a lot of flavor.  So why 5 stars you ask?  Three reasons:  1.  The Toast and sauce are amazing.  Like, I mean, another planet-type amazing.  The fries and cole slaw are pretty good, tasty but about average, like the chicken.  But the Texas Toast is the perfect texture, a golden brown toasted buttery slice of body-convulsing heaven.  The Canes Sauce and honey mustard are also both awesome.  So, so good.  2.  The cleanliness of the place.  It's clear that Cane's places a high priority on cleanliness and things looking fresh and clean.  the color scheme is also nice, the entire layout is simple yet fresh and modern.  You actually feel good and calm while you're in there.  It's hard to explain.  Just walk into one and you'll see what I mean.  3.  I saved the best for last.  The CUSTOMER SERVICE is out of this world.  I've been at different times, through drive thru, walk in, and every person has been the same:  bright, friendly, energetic, and seemed genuinely happy to see me and serve me.  Think about it:  we all have bad days.  Days when we're worrying about personal stuff, finances, days when we're sick or don't feel good.  Even in the service industry.  People are people.  We're all human.  But everyone here, down to the cooks and people cleaning the lobby, are fantastic and make you feel like a super star.  This can only mean two things:  a.)  customer service is heavily emphasized by management here, and, more importantly  b.)  these people actually enjoy their job and being there.  That is rare and a great thing.  Final Analysis:  The chicken is 'meh'.  Not bad, decent enough.  Maybe a smidgen above average.  The reason you go here is for the bread, sauces, and the way you are treated and feel.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "xBUX7fX2IK7zcTKH8p4CUQ"
  },
  "A-mvcmY2fHCf38HzajuJbg": {
    "date": "7/5/2015",
    "text": "I can't even begin to explain how tasty the food is here. The cane sauce is too good to be True.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H4-vxusdtYXXlw1xVNoH9w"
  },
  "2ENtqXDNdoco_mBdpBHTZg": {
    "date": "4/23/2012",
    "text": "Not in the running as far as being the best chicken fanger in town.    Fairly decent serving sizes, but when you specialize in Fangers, your Fangers better be AWESOME !!  These can be \"very good\" when fresh out of the fryer, but they are not AWESOME !!  Coleslaw was completely pedestrian and bland.  (Rock-n-Roll Fingers in Tempe does a far better job at making and selling the kind of chicken fangers that Raising Cane's oughta strive for.)  I'm giving these guys one extra star because AWESOME fangers are hard to find in the fast food realm, and these are above average for sure.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "jfGevhcYLxY13Fa3drpzoA"
  },
  "mYCfjoB1vL7CiyXh2ZQFwg": {
    "date": "9/24/2015",
    "text": "I have been going here since they opened. Very good food, sometimes I hit it for lunch. Dinner hours -I bring the family and we have a little party. Chicken is so tender and I never had a dry finger.The employees are happy and they greet everyone. Love it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yQxoLI0rVCQszsIZxN_uUg"
  },
  "Y976GZByC9yVM7C9REw5mA": {
    "date": "5/7/2012",
    "text": "Plain Jane Cane's!  I don't think I've ever had such a bland, uninteresting meal. The simple menu could do with something to compliment the otherwise good (not excellent) chicken strips. The signature sauce is simply gross. Yes I have mixed ketchup, mustard and mayo as well, but trying to dress it up with a sort of Mrs. Dash type seasoning, completely failed. Really? A couple of other dipping sauces are going to eat up the profits? The Texas toast was a nice addition, but there ain't a place on planet earth that doesn't at least serve a 3-cent honey packet. Maybe the goal is to be as boring and middle-of-the road as possible. Having said that, the staff was great!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "iz74DbLRK0GnsgpU_a8Qiw"
  },
  "lTGQkzDVu0KVdoIc1aCuUg": {
    "date": "3/31/2015",
    "text": "This is one of my Wife's favorite fast food places. I always forgot about it, but every time we go I say \"dang this is good stuff.\" The Chicken fingers are very substantial and really should be called Chicken forearms. Our family (wife+baby), usually orders The Caniac Club with extra Texas Toast and share it. The 6 giant chicken fingers, fries, Cole slaw, and toast is plenty enough food for us. The signature dipping sauce is very tasty too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Q6IMr3hkYuKV02VrhXWLA"
  },
  "Dqz5NINPcH5OwBMZF_xeuw": {
    "date": "5/25/2014",
    "text": "The chicken was alright but not a good value,  the pieces should be called nuggets not tenders because they were so VERY small, the price is just too high. You can keep that ranch paprica, Lawry's sauce of yours a secret....I hate it...I would rather have anything else maybe bring some hot sauce or food from somewhere else,  before you stop me I would pies the question I gave to McD's years ago,  you can let me eat what I want while buying your food for my family or we can all eat dome where else! McD's never told me I couldn't bring other food in again and I was a frequent customer, I just didn't eat their food!.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "HNqXNnPIs_YUwaWPhneJMg"
  },
  "TWMrBHyulHs6qE4n49Nxfg": {
    "date": "3/21/2012",
    "text": "Chicken fingers are such a basic concept, but the type of breading makes all the difference.  The fingers here are plump and juicy and the breading is actually light and crunchy, while I wouldn't call them my favorite chicken finger I have ever eaten, I would say they are my favorite fast food chicken finger.  They are much better than KFC or Jack in the Box, and there is something about the simplicity of the menu that I really like.  I love that they have crinkle fries, which in my opinion or the best fry you can get and the Cane's sauce is addictive!  It is cool, creamy with a punch of flavor, and I dip chicken and fries in it equally.  When I get \"The Box\" I always sub an extra sauce for the coleslaw, which I could care less about but it isn't bad.  The Texas toast is a somewhat odd addition, but no carb lover should turn their nose up at it!  Probably my most favorite thing at Raising Cane's is the lemonade...it is the BEST lemonade I have ever had, much better than Chic-Fil-A's which I sometimes think is sour.  Sometimes chicken strips just sound good, and Raising Cane's satisfies, so give it a try!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "NFgvM7LMx5Ocsxr7J2_sVA"
  },
  "GbK8IXcV7Q1yyWbuxcN7ZQ": {
    "date": "2/7/2012",
    "text": "I just moved here from Las Vegas and though Phoenix basically has everything anyone could ever want, they didn't have Rasing Canes and I ate at my location back in Vegas every week for like three months before I moved preping myself to be without it. Well go figure they open a location just three miles from my new apartment the month I move to Phoenix! I feel so warm and fuzzy inside!  I love this place because the chicken is always super fresh, the fries pair perfectly with it and the big texas toast with \"The Box\" is just right. The caniac sause goes with everything on the plate and I usually need extra! I'm not sure why people ar bitchin so much about this place though, it's basically the In N' Out for chicken, they serve one thing and they do it well. I can never get enough of this place and I highly recomend it to anyone! They always have the best, most fun and friendly service and I just love the pellet ice, I sware it makes the drink taste so much better.   Try it for yourself  Phoenix, but try it with an open mind. Go inside, play along with the servers, enjoy the local flare hanging on the walls and read about the namesake dog Cane one and two. I love this place and I hope you can see why too!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "5RLxzxLIY3ZXUUksr_dtXA"
  },
  "EjhUhngFF7G-I5Oq33reuQ": {
    "date": "2/6/2012",
    "text": "Not bad, the decor of the place is great; it looks clean, new and contemporary... I didn't really understand why there's a disco ball in the lobby but what the hell.  It's one of the best fast food chicken fingers intown, the meat was very tender. Fries are good, sause was great, cole slaw was good; however, it's been 30 minutes since my meal and my body feels like it's overdosing on cholesterol...   I'll be back if I don't suddenly die right now.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "foDSVja3cCgCoLDzilpyTw"
  },
  "OD-MfbGcE95Sl3VbV6kjPg": {
    "date": "2/29/2012",
    "text": "I just recently moved to Arizona and was ecstatic when I found out that Raising Canes had just recently opened up here! I used to live in Louisiana where this place originated and I would eat there probably 3 times a week, I am addicted to it. I read some of the other reviews complaining about how there is no variety and in my opinion that is what makes this place so great. I love chicken tenders, and they make the best. If I want to eat chicken tenders I'm going to Cane's. I find that because they only make chicken fingers they actually make a better quality more consistent meal (don't forget that we are still talking about a fast food restaurant). The lemonade is my favorite amongst any other food chain and I can't get enough of their Texas toast and signature sauce.    If you don't want chicken fingers don't go to Raising Cane's, if you are in the mood for some awesome Chicken fingers and lemonade then this is your place.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "wwEitNQyotDAy6NJ10vc8A"
  },
  "d0bowNPDEByzt-bo-b-Ulw": {
    "date": "1/4/2015",
    "text": "5 stars for Fast Food is different than dining establishments.  5 stars for awesome Chicken fingers.  The caniac is what I always get.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FmikGD1_zt04EcFFZr-ctQ"
  },
  "gCK58q3An-aE6Hze3T5XQg": {
    "date": "8/18/2012",
    "text": "This is for the new store in Tempe.  we have been eating at the Phx. store but very happy new the store in Tempe is open.  One of the employees in Nevada told us about the new store opening and it was great to see her her in TEMPE TRAINING THE NEW STAFF.   NATALIE from Vegas is just great.  The service is excellent and the food is consistent from store to store and very happy with that.  Management and staff at all locations come by on a regular basics and check if everything is ok or do we need anything.  Great Service for a fast food operation.  Keep up the good work, great food... Caniac Club Member 6000405536375759",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "s4ePdLF917uvfrxY9Fs4Ww"
  },
  "qGyFh99u9kPPyElG2wD4-g": {
    "date": "1/9/2012",
    "text": "I would describe Raising Cane's as the chicken version of In-N-Out because they only sell one thing and that's chicken strips.  The restaurant is decorated with Movie memorabilia. It's kind of odd considering it has nothing to do with the food but I liked it. The employees genuinely seem happy to be there and are extremely helpful.  My boyfriend and I both ordered the chicken finger sandwich with fries and a drink. The fries were great and I enjoyed my chicken sandwich. I don't know how to describe the taste of their house sauce but I like it a lot. I used it on my fries and my sandwich.   I had a good experience here. I think they need to jazz up the menu with more sauces and offer additional side items. I'll be back when I have a random craving for tasty chicken fingers!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "maK3UBQczh33NuDjBYeHrA"
  },
  "AlTnQh3yyIAALBgqbTLm2w": {
    "date": "1/10/2012",
    "text": "On the one hand, I don't think this place deserves the 2.5 star rating it currently holds but on the other, I can understand the disappointment..  We got the Box combo which is like 4 tenders, Texas toast, cole slaw, fries and drink.  I welcome this new kind of fast food restaurant in my neighborhood!  Its nice that you can get this kind of combo vs the traditional burger, fry, drink thing.  The prices are a tiny bit hefty - its just shy of Chipotle prices, I got this combo for roughly the price of a burrito.    That said, the tenders were pretty good!  Not overly breaded, fried right and not too greasy.  Not a huge fan of the Cane sauce - its not terrible but very negligible.  However, I do believe if you run a restaurant selling pretty much nothing but chicken tenders, you HAVE to offer more of a variety of sauces.  McDonald's offers 2 things - nuggets and tenders which comprise of what, 10% of the menu?  And they have like 10 sauces!  Anyway, more sauce options please!  The toast and the fries were slightly less done than I prefer.  The coleslaw was ok - not too exciting.  The service was GREAT, staff are pretty friendly - of course there were only 4 customers..  The atmosphere is fun and modern - random posters and pictures on the walls.  All in all, I'd like to see more sauces and a deeper fryer bath but I probably will get some more.  :)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "niKu4se6xtf-ctlm0udr1w"
  },
  "awt5jxgWesuyqKPYP87l1g": {
    "date": "8/26/2014",
    "text": "I freak'n love this place! So tasty and I get their honey mustard sauce ... I go to this at least 3 times a month",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "zqR0UmHkut-deOAV3QNQtQ"
  },
  "LS3BtPxQrOyqRg7wDv6vyw": {
    "date": "1/12/2012",
    "text": "2.5 stars  The short: Open and clean setup with friendly staff, but it's basically just-ok carby kid food.  The long: On the south side of Thomas, just west of 44th St., turning left into the lot can be a bear during peak traffic, but it's otherwise fairly accessible for people driving in from the west or walking up, like I did. The inside is wide open and clean with plenty of chairs and tables that were just a little too cluttered around the restaurant floor plan. Otherwise, it doesn't stick out much from other fast food joints. I went during the middle of a somewhat busy lunch period, and who seemed to be the head cashier loudly greeted just about everyone who walked in the front door on the other side of the restaurant. My cashier was friendly and quick, though he seemed a tiny bit frazzled by the small rush.   I ordered The Box combo and a lemonade to go and headed back to my office a short 5-minute walk away. I hoped the freshly squeeze lemonade would be awesome, even if they did charge only about a dime more than fountain drinks for a regular. Although I could taste the lemon, the drink was so sweet, it may as well have been from a mix or carton. The Box comes with a small container of sweet coleslaw dressed in a lot of mayo, a slab of soft-in-the-inside, perfectly browned-on-the-outside toast, somewhat slightly crisp, thin crinkle cut fries, a container of Cane sauce (which tastes like burger sauce), and, of course, four chicken strips. Unless you're me and you get only three chicken strips . . . or two smallish chicken strips and one big chicken strip that maybe they counted as two, but really, halfway through the meal, you're so carbed-out full that you don't miss anything aside from the extra dollar you paid for that extra chicken strip. The strips were fine. It was real chicken, and True to advertising, it was fresh. Sort of crispy, but not as crispy as I'd hoped, or even expected. Tender and moist enough to not be bad. But not special. All of it was pretty one-note. I can't even tell you what part of the meal I liked best . . . maybe the toast. Coincidentally, every time I took a bite of that toast, I'd think, \"This is the most random slice of toast ever. What's it even doing here?\"   So, it's fine if you're like me and want to try every new eatery that opens near my home or office and appreciate the novelty of places like this, but personally, I won't be making a return visit.  Edit: I almost threw my drink cup away before I noticed the giveaway pull tab on it--I won a free slice os Texas toast! How do you like them apples? =)",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2rDvvLD8uo1vnii4nfZbqA",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. Winner winner Texas toast? My drink cup pull tab giveaway prize!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2rDvvLD8uo1vnii4nfZbqA/o.jpg"
      },
      {
        "img_id": "S1sKQyU1Cy1jRGri9kR1Ow",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. The Box, minus one chicken strip.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/S1sKQyU1Cy1jRGri9kR1Ow/o.jpg"
      },
      {
        "img_id": "Re6mU1dGPzvhjBEdOm-UJg",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. The Box (and Napkin). From Cane&amp;#39;s. In case you didn&amp;#39;t notice . . .",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Re6mU1dGPzvhjBEdOm-UJg/o.jpg"
      }
    ],
    "user_id": "PhrYE1S_prUdf9KHi4basw"
  },
  "wDK0qwuJNg53_rRBUVFZjQ": {
    "date": "10/29/2013",
    "text": "I have heard many positive things about this place so I finally had to go try it. I went with a coworker. I got the three finger combo. It came with three tenders, fries, Texas toast, and a drink. For the price, this is a great deal! The chicken and fries weren't greasy! That's really important. This location is sort of difficult to get to. There's plenty of seating and the girl that helped us was new, but very friendly. If I'm ever in the area again, I will be coming back.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "xVdchFi3vgmPYxkiXYHmZw"
  },
  "s9Po9M_TxcjinjbxBTVAtA": {
    "date": "1/29/2014",
    "text": "Great chicken fingers! Love the sauce, bread, and fries. The lemonade is really good too. I think this place is way better than chick fil a! Plus it's open late if you get those late night cravings!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "SAC-pa_Fj7XDe6rbwH85Sg"
  },
  "c4_4EM_np8pOhcdAbyl2Gw": {
    "date": "4/23/2018",
    "text": "Such horrible customer service at this location! I typically go to the one by campus . (ASU), but since relocating to this area, it makes more sense for me to come to this location. It never appears to fail, staff at the second window are always so RUDE! I get it, you hate your job. No one told you to stick around though. I'm going to start commutig back to the campus one, the quality of customer service is so much better!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q4taS0U1go63wER5QFqwRg"
  },
  "7H2G-edDF0BEf8gcc8qwfQ": {
    "date": "11/19/2018",
    "text": "massive price increases just happened.  boycott all raising canes.  20% price increase needs to be smacked back!  Caniac Combo went from $9.90 to $11.59.  rip off!!!!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ye02v0bzzodLuIji9-tRTg"
  },
  "SvpbwQnynvO4VglF48UmsQ": {
    "date": "10/16/2017",
    "text": "It was the Sunday after a 'fun' event on Saturday night {if you catch my drift} and my husband and I were in major need of some comfort food. He was craving chicken fingers and so it was the perfect opportunity to try Raising Cane's! I love that they have a SUPER simple menu - chicken fingers, fries, coleslaw, Texas toast, and yep, that is about it! I can't forget the freshly squeezed lemonade and sweet tea, of course! Clearly I had never been there before because I asked for ranch to go with my order which is totally against the Raining Cane's philosophy! They don't even have ranch. But they DO have a delicious 'special sauce' that was pretty dang dreamy and definitely a good substitute for ranch! I actually really like that they don't offer ranch. {which is crazy for a ranch lover like me to say} It is a great way to separate themselves from the pack. As for the chicken tenders themselves, they were delicious! Perfectly crispy, not too oily, and all white meat. Yes, please! I hadn't planned on eating my Texas toast but took one bite and couldn't stop! It was salted and buttered to perfection.   Anywho, i'm sure we'll be back again after another 'fun' Saturday night! ;) Thank you for curing us, Raising Cane's!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 15,
      "cool": 9
    },
    "photos": [],
    "user_id": "e6iCOIhtupBCiw-VwBvJ4A"
  },
  "dpNlniqSp2xCDx9oGU1CEQ": {
    "date": "12/29/2017",
    "text": "Buttery, crispy, juicy chicken tenderness! I don't eat fast food like ever so let it be known that This was my first time eating at a FF place in YEARS. Raising Canes has the BEST fried chicken tenders I have ever had and is in a different league than the competition. You absolutely cannot go wrong with the Caniac Combo and EXTRA CANES SAUCE OWRNRNGHDYR. Yeah sorry but the sauce is that good. Even the customer service I've experienced from Canes seemed stellar compared to any other fast food place I've been. Kudos Canes, I'll see you soon boo",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZTu0dbYOGkg4aI0vG7HOvQ"
  },
  "HJqLqBIiZhUst2mVxP1naw": {
    "date": "7/15/2018",
    "text": "Not really sure why, this place is so crowded. Only five selections that includes the kids meal. The chicken had no flavor, My three pieces of Texas toast were blan no butter and the sauce was okay. It had to grow on me by my fourth bite it was do able. I ate my food because, I was hungry and because I didn't want to waste my food. Would, I return absolutely NOT :(",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LqU99zFTGxAqsNZwkj69gQ"
  },
  "-Z0CNDLR675fgIF2K2AAuQ": {
    "date": "12/3/2016",
    "text": "My guilty pleasure,  The four piece meal (the \"box\") is a ton of food, I do recommend ordering an extra cane's sauce as it only comes with one.  The employees are friendly, only reason it's four stars instead of five is because the drive-thru line can take a really long time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vcnZWGtWel5WG3kQKdAS5A"
  },
  "3Kdjwm4rYFnUCLQgh4s7Bw": {
    "date": "9/11/2017",
    "text": "I heard of this place after I talked to a friend of mine that just loved the food here. I'll be honest with you, chicken fingers and fries were not a type of food I particularly loved until I tried this. I live relatively close and I go there once a week now on average.   The food is delicious, the staff has always been friendly (eating in or drive through), and the prices are super reasonable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "D3kWmT98x5kHR41kOU8-Dw"
  },
  "NNN2cXRs5xYNWJe3zuiz3Q": {
    "date": "6/16/2018",
    "text": "I absolutely love this place! I tried it for the first time and I immediately told my boyfriend this is my new fave spot! The service has always been fast and friendly the times we have been in the drive thru.  Canes sauce is something special, canes chicken is sooooo good either way. Overall I'm happy with this location and I'll be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "57vYSvYNRRtkKkJ7tUo8FA"
  },
  "JGxXxmmj79w2S-KQ-pFzug": {
    "date": "6/28/2017",
    "text": "Cane's is overrated.  There I said it. To me, it seems like every time I mention Cane's, people are like \"Oh my god, I love Cane's!\" Yet every time I go there, I leave feeling \"meh\".  Well here's the truth, it's not that good. Cane's is a great example of an eating establishment that should be getting 4 or even 5 stars but gets downgraded because of its pretentious attitude, overpriced menu and poor-quality side dishes.  Let's start with the positives. The chicken fingers (which are all they really serve) are excellent. Some of the best chicken fingers I've ever had actually. The Texas Toast (gotta capitalize the \"T\" in Texas!) is nice as well. Also, the restaurant is very neat and tidy.  Now, time for me to rant and complain...  The value here isn't really great, and you can get better deals at other fast food restaurants. The only real reason to even consider Cane's is if you really want decent-quality chicken fingers and you don't mind overpaying for them.  The sides leave a lot to be desired. Yeah, the TEXAS Toast (which should be called the Rhode Island toast because it's tinier than your last bar pickup's package) is good, but the cole slaw is bland and boring and the fries are very below average.  The soda machine is a letdown. Yeah, I went there. I swear that is the flattest Sprite I've ever had out of a soda fountain.  But most importantly, Cane's is PRETENTIOUS. They think they're hot coffee because the line wraps around the establishment. But don't be fooled - you will just be waiting longer for disappointment. But everything about this place screams pretentiousness.   Is that why you charge $10 for 6 chicken fingers and low-quality sides?  Is that why you charge extra for essential sauces like honey mustard, while giving away ketchup like you're doing us a freaking favor? Ketchup is for children Cane's, and I'm a big man with a teddy bear!  Is that why you make me show you my ID when I use my credit card? I'm buying freaking chicken fingers, not an alcoholic beverage! Seriously, how distrustful can you be???  And the icing on the cake, is that why you treat your precious little Cane's Sauce like gold? Guess what, the Cane's Sauce ISN'T EVEN THAT GOOD!!!  Look, I want to like Cane's. Their chicken fingers are great. But it's just little nuisance after little nuisance with Cane's. At some point, it's time to stand up to these little nuisances and give the restaurant the rating it really deserves.  3 stars.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sR4Oph0x47dyjVaBm12y7A"
  },
  "eqF8NJ8AEbO_sp_9ElI0Mw": {
    "date": "5/3/2017",
    "text": "Listen, there is crack in the batter. My dinner plans for the last three days have consisted of Cane's delicious fried chicken and I ain't even mad. Honestly this is probably the best fried chicken I have EVER HAD in Phoenix and if you don't think so too, you're wrong and I hate you. My boyfriend has been raving on and on and on about Cane's and I thought he was exaggerating... Oh ho ho ho boy was I wrong.   Menu options are basically just a tenders meals in different quantities and a chicken sandwich. Honestly this is great because Cane's is not trying to be something it's not. A meal consists of fried chicken- finger style (duh), three sides (typically toast, fries and slaw) with a side of savory Cane's sauce. The real way to do it: sub that slaw for another piece of toast and add an extra Cane's sauce (that stuff is so good). Staff is super attentive and friendly, usually this place is packed (I stopped by the drive thru and they had a full house on Monday, of all days).",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "o_47GBbRtL6gQ_T7pTNNgA"
  },
  "9znHrDGQNNp9G0uv6Xc7-Q": {
    "date": "5/21/2018",
    "text": "We ordered a sandwich and it didn't come with lettuce like on the picture so I asked where it was and got a snotty response \"we don't serve lettuce.\" I asked why and was told it's \"health code violation\" as if nowhere else serves LETTUCE? I let it go. We had a question and my friend tried to get the attention of a girl at the counter who wasn't doing anything and she responded \"can't you see I'm busy\"  It was really rude and we weren't being rude at all... her name is Jackie... Not to mention my meal was missing my extra sauces and bread, and I had to ask for it even though I had already paid. Not a good experience",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cKioYbJWw2gSGl6hNQ00hQ"
  },
  "cE7L0c_NLHaRR_Cgvfk0iw": {
    "date": "11/9/2018",
    "text": "They missed my order up for the second time forgot my toast when I said add extra toast ...there's to many kids in there I get they need a first job any everything but freaking do it right god!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yom0sgmFy2SSYeVezVTwcQ"
  },
  "3V0VCNACZaWqs4J5uw9gww": {
    "date": "11/5/2018",
    "text": "Best customer service at a 'fast food restaurant'. Order through drive through was misplaced, came around to the front. Handled quickly and correctly. Will forever come back when I'm craving chicken all because of the respect and care this store gave to me.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EwFbQ6HZGv9s2h-yiGf_jw"
  },
  "ubPBZzdbZwvXsdsk9_z_ag": {
    "date": "7/27/2017",
    "text": "One of the better fast food options. There is an obvious focus on customer service/interaction  and to the quality of the food they serve. The dining area is always clean and the drink counter isn't a sticky war-zone. I can dig this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xlSnjFjbh_zxqZi7aKc34w"
  },
  "jcvvnYW0fzlqDLHKJiK7VA": {
    "date": "6/21/2017",
    "text": "After a hard morning, we needed a Canes fix. It was my kiddos first time here, and they loved it! Everything came out piping hot and delicious  Truly a great experience,  and the \"Random Act of Caneness\" that happened when the manager bought our lunch made it that much better! Awesome lesson for my kiddos to be a part of, as well  Thank you!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "TgkgezTKqMulhLz8kDNQkw",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TgkgezTKqMulhLz8kDNQkw/o.jpg"
      }
    ],
    "user_id": "OFOGFkU5Sx78vguA_0M5Kg"
  },
  "Ahg-XIGTeKQ25AxRiVM8Cw": {
    "date": "9/21/2017",
    "text": "Best fast food fried chicken and fries you will find. The big box that comes with 4 tenders is enough to feed 2 people and the food is amazing. The chicken is nice and crispy on the outside but moist on the inside, always cooked to perfection. Standard crinkle cut fries, but the toast is the best part. A thick slice of buttered toast that goes great with their special dipping sauce. Every time I've gone I've had to order and pay for extra sauce because of how good it is with the food.   A great place to hangout with friends and the staff are very kind.   Will be going again",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vJDX8FZLh_HLH7W9e94HUg"
  },
  "qo745qpZXj87ojP8t7DtzA": {
    "date": "6/15/2017",
    "text": "Raising Cane's has a simple menu, but what they do they do well-fried chicken fingers, crinkle cut fries, iced tea, lemonade, and their delicious canes sauce.  The chicken fingers are great to order in a large quantity for football games or other gatherings. You can call ahead to place your order and then pick it up through the drive-through which is super convenient.  Extra Cane sauce is $0.29 each, but it's worth it if you like extra sauce with your chicken strips or french fries.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "121ruQUFk6Bl2V1wBwa31A"
  },
  "MHE5aXytlCaaRn7w4OipKg": {
    "date": "5/11/2014",
    "text": "Chicken Fingers Don't Get Any Better Then This.   If you are a Chicken Finger  lover, like my nephew I encourage you to give Raising Canes a try. These Fried Chicken Fingers take a back seat to no one. Raising Canes boneless Chicken Strips and dipping sauce are hard to beat.   Raising Canes never-frozen chicken tenderloins are fryed-to-order and accompanied by the best dipping sauce known to man.  The meat stays juicy, none of the dryness problems that plague lesser variations of fried chicken strips. The Chicken Strip combo box is served with crinkle cut fries, Texas toast, and a side of coleslaw.  You have to try the fresh squeezed lemonade, it's the best.  Raising Canes has quick service and friendly staff, so if your in the mood for chicken fingers, head on over.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "U1YjnlKDv2gm9KsnW8jNRQ",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/U1YjnlKDv2gm9KsnW8jNRQ/o.jpg"
      },
      {
        "img_id": "oEhHRigQJHaF8P5SupIDUA",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oEhHRigQJHaF8P5SupIDUA/o.jpg"
      },
      {
        "img_id": "176GPe_-tBNK3mD8Y92X8Q",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/176GPe_-tBNK3mD8Y92X8Q/o.jpg"
      }
    ],
    "user_id": "MMf0LhEk5tGa1LvN7zcDnA"
  },
  "pD5akicP7vTLDrAjdvlvJA": {
    "date": "9/12/2017",
    "text": "My first time trying raising cane's and I wasn't disappointed.  We ordered the big box which had four strips of chicken, fries, coleslaw, and Texas toast.   We had sweet tea as our beverage.  The chicken was moist and tasty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OYVUj56pl5V_oFI5bJo36w",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. Big box combi",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OYVUj56pl5V_oFI5bJo36w/o.jpg"
      }
    ],
    "user_id": "IrOEB-QN2_ouDHYeeAZJow"
  },
  "iP48tOc_uAFGjojbRywO4w": {
    "date": "3/10/2016",
    "text": "First place I went to with my friends when I arrived in Scottsdale for Spring Training. They had both previously been here and living in CA I'm pretty ignorant to chicken wings, but I know good food when I try it. I ended up coming here around 2:00pm and it wasn't crowded at all. The girl that took my order was very nice as was the lady who dropped my food off. I ordered there four wings combo with texas toast, French fries and lemonade. The sauce used to dip it in was delicious (not even sure what it was made of). The chicken was tender and fresh, but most importantly hot and delicious! The lemonade was great and actually wasn't too sweet. The French fries were nice and crispy and combined with the chicken worked out very well. The store itself is very clean and well maintained as well. If I ever return to Scottsdale I'll definitely drop by again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "nU4anB-o97lG_e7Xg-Usxg",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. Lemonade with meal was delicious",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nU4anB-o97lG_e7Xg-Usxg/o.jpg"
      },
      {
        "img_id": "XcXOEuspP_bxlOXHd-fZsg",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. Four chicken strips, French fries and Texas toast!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XcXOEuspP_bxlOXHd-fZsg/o.jpg"
      },
      {
        "img_id": "s5HAHfMFFDyrddIVBHK6AQ",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. Canes!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/s5HAHfMFFDyrddIVBHK6AQ/o.jpg"
      }
    ],
    "user_id": "Po_t9dva5H9ibmr1xnNlbg"
  },
  "9Af5cwCi0XZ5aB52Pv_zTA": {
    "date": "11/2/2015",
    "text": "a few months ago my son and I ate at the casa grande location and we both got very sick. hadn't had anything to eat prior to going to here. called the mgr. chris and told him, I even wrote to corporate and have not yet heard a thing back from them. wasent even offered my money back, just told me hope you get well. I hope this does not happen to anyone else.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7iYYUo-v8DVrTE0ZQTsQFQ"
  },
  "2Xb-mpNgRIbX6EUpkD6f8Q": {
    "date": "6/10/2013",
    "text": "Delicious!  My son is addicted to the chicken and Texas toast.  The service is always very pleasant and the food is always fresh and hot.  Very rarely have I had much of a wait in the drive thru line.  Definitely a crowd pleaser with the high school students in the area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2mTtT5OCKQB69Uf2KKDYVQ"
  },
  "9oijL_JdvkNpMxnp_VQccg": {
    "date": "7/4/2012",
    "text": "Uninspiring. Good location though, right down the street from the game stop where I took my son before coming here and surprise surprise half the people I saw at the game stop were here which allowed me to further cement my point. See, if all you do is eat crap and play video games all day you will end up like all the fat losers in this place. Menu was extremely limited. Better like canes sauce or ketchup because those are your choices. The Cole slaw was sloppy and smelled and tasted like it was made with elmers glue. The chicken was freshly cooked though....",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "koTyfPcHf-y_GvLG7TdVRw"
  },
  "A7RlHcE90Dzh0KeMP2h2mw": {
    "date": "5/7/2012",
    "text": "Bland Bland Chicken!! You would think if they specialize in chicken that it would be good, if not great. Not even close. The chicken had absolutely no flavor. The only thing that was good was the sweet tea & even that I've had better when I make it at home. If you have taste buds; DON'T EVEN BOTHER!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "B11HSmA5eAdXAi6qNQOqQA"
  },
  "4yFaYWdM2QC9IuowSUBqUA": {
    "date": "3/14/2013",
    "text": "I visited for the first time today.  The customer service was great.  The gal that took my order (I can't remember her name although she offered it) was very helpful explaining the menu.  The food was yummie and the service quick.  I like it!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MwpwvavRk-ZCIgogWrHlgg"
  },
  "Om7ADLP5zqbo5JRes4_6LA": {
    "date": "8/27/2012",
    "text": "Everything was super simple. Chicken is very lightly breaded and seasoned, not at all greasy and made fresh there, not frozen and from a box.  The toast is super good, the fries, although they are crinkle cut are crispy, and the sauce is interesting. I will be returning for sure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bq5aMchc9YDGf1aiCoUCEA"
  },
  "DRVFRJUc2QT0PKKsOm67iQ": {
    "date": "2/1/2012",
    "text": "If a fast food joint has only four items on the menu then those items should be exemplary food items in every way.  Cane's fails to reach even basic standards of interesting food.  Chicken fingers, french fries, Cole slaw and Texas toast are all that's available.  Like Cane's competitors, one meal variant is to order chicken fingers on a bun, but unlike competitors there is no option for a salad with chopped chicken on the menu.  The most complimentary adjective that can be used to describe the food offered at Cane's is bland.    The primary offering, around which all meals are based and the business is built, are chicken fingers.  While the fingers are fresh and hot, that's about all that can be said for them.  They meet the criteria to qualify as chicken fingers but Cane's does nothing to make them interesting or appealing.  The fingers are a bit undersized, and quite a bit smaller than those that can be found at similar chains elsewhere.  The breading is crisp and not too greasy, but bland, flavorless and without any spices at all.  These are the first chicken fingers that I felt that I had to salt to enjoy.  They are served with \"Cane's sauce,\" which is so prized that they charge extra if a customer wants more than one small dipping cup's worth.  Sadly, the sauce tastes like a poor attempt to copy the dipping sauce from Zaxby's, and Cane's only avoids a recipe trademark lawsuit by making the sauce with more oil and corn syrup and less spice.    Despite the nearby billboard's claim that Cane's fries are fresh, the fries that I ate looked, felt and tasted like they came from a bag.  Unlike most chicken finger places which sprinkle a seasoning blend over their fries, the fries at Cane's were served without any seasoning, not even salt.  While crisp and not overly oily, the fries were as bland and uninteresting as the chicken.    Much like the chicken and fries, the Texas toast is offered up after performing the least amount of effort for a food item to qualify as Texas toast.  It is a thick slice of white bread that has been briefly toasted (not grilled) and then spread with something that is close enough to butter to be acceptable.  It has none of the charm of True Texas toast and lacks the crisp, grilled exterior and herb butter blends that makes Texas toast a favorite menu item in so many places.  Instead of tossing this chunk of bland carbohydrates on top of a plate already piled of bland carbohydrates, I'd recommend asking to swap the toast for the coleslaw.    It's not that the coleslaw is anything spectacular, once again Cane's does the bare minimum for the foodstuff to qualify as the listed menu item, but after eating a bunch of bland fries and chicken the coleslaw will seem exciting.  The 'slaw is little more than chopped cabbage and carrots (I couldn't taste any onion) tossed with some dressing, salt and pepper; but since everything else was served without any spices at all, the salt and pepper livens up an otherwise tasteless meal.    Overall, Cane's seems like little more than a knock-off version of the much better chicken strip joints of the south, most notably Zaxby's, right down to the movie posters and old signs on the walls.  The food is bland, uninteresting and overpriced.  Ten dollars is far too much to pay for undersized, bland chicken fingers, frozen fries and tasteless toast.  If you're in the area and want some chicken there are better options just up the road where you can get far more flavor and many more choices for much less money.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MUmclqmJqbnp-0n4RSFSrQ"
  },
  "YQz3lfnE-KCYnKJeJd8bIg": {
    "date": "9/6/2018",
    "text": "I came through the drive thru on 8.30.2018 - i ordered the craniac meal.  I drove all the way home t(40minuted) only to open the container and see the worst strips in my life.   I called and spoke to Sean about my order and advised that took a photo as well. He stated to come in an get replacement.    I am here today 9.6.18 and another manager was on site.  He looked at me said well Sean is not here but I'll do it.    I'm like ooooohkay.    The customer service was not so great today.    More thank likely i won't be returning to this location.    The food was fresh today and i did have all the FULL pieces.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MZNW0Lzd--l6fP3PoELhhA",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MZNW0Lzd--l6fP3PoELhhA/o.jpg"
      }
    ],
    "user_id": "MYP_YU8ssj9Rp1_tyqH1hA"
  },
  "vNmKBmnLxVC6o2PrJeLVLg": {
    "date": "12/2/2018",
    "text": "I went to Cain's for the first time tonight. Overall my feeling is much ado about nothing. Lots of hype but little delivery.   Pros: Tender fresh chicken fingers, reasonably tasty Texas toast, good, fast service with polite employees.   Cons: flavorless chicken, it could have used some spices or minimally offered a spicy version. The to-go containers are inappropriate. I live less than a mile from the restaurant. By the time I got home the styrofoam container turned what should have been crispy fingers into mushy, flour coated chicken.   Don't get me wrong, their fingers are better than most but have no discernible flavor. Change the to-go packaging and add some spices.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BZUTEvF3xzsSAD6LAhFbDA"
  },
  "muBgQWgr6RLpzcAEWDqdTg": {
    "date": "3/2/2019",
    "text": "My second time at Raising Cane's and let me tell you....the meat was as tender and juicy as the first time I tried it. The wait was worth it for sure. The cole slaw is delicious, but that bread is fire. Order a second slice of bread!!! I know what I'm telling you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yDB5dD_ep1nIsbDhucCQTA"
  },
  "wzeZ0ZMW9pc3d5pdgNDuCA": {
    "date": "1/7/2019",
    "text": "When I was going to school in Flagstaff, my trips to Raising Cane's were fairly frequent but since I've moved to Phoenix, they have dropped off the radar for me. However, I was recently craving some chicken tenders and I immediately started to crave some Cane's. I'm so glad that I gave into that craving and made the trip here! I had forgotten how good their secret Cane's Sauce is and how satisfying Texas Toast is as a side. This is fast food, so my expectations and standards aren't very high, but Raising Cane's really hit the spot in a time of need. This probably won't be a place I will visit frequently but Raising Cane's is definitely back on my radar!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GCGiOKHumMP98k80psP3fw"
  },
  "L-Qq1MapwDMrMzQssh27vg": {
    "date": "12/29/2018",
    "text": "Shared a Caniac meal with my two kiddos. It's plenty of food for 3 people. The strips seemed a bit smaller than I remember and they were...soggy. It's been a while since I've eaten at Canes but it seems to me they have changed things a bit - not for the better. The toast was good and the sauce is always a winner. Not something I'd eat on the daily but when the kids want chicken fingers and you don't feel like cooking...Canes it is!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oTuv4lZt8M6MWu2BI-t9Qw"
  },
  "trWjFH4Aq4SpQ687wWmdKQ": {
    "date": "12/21/2018",
    "text": "Sometimes the drive thru can be extremely slow, and they still don't have bbq sauce for their chicken fingers, but they're still good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ed32KG1u1G7L2YsFQpAc4Q"
  },
  "80JktDbPeQnRsleGhQrfQg": {
    "date": "8/10/2017",
    "text": "I love me some Raising Cane's, no matter what state I am in.  Came to this particular location on a Saturday night in the middle of the summer. There was no line and hardly any people inside. It was really weird as all the other locations I've ever been to the line goes out the door and you have to be like a hawk to find a table. It really didn't matter to me, the food was delish as always and the service was good.  The parking situation is not to shabby at this location as there is parking on three sides of the restaurant building itself. There were a ton of cars in the drive-thru so getting down was def a better idea.   No complaints from this happy camper! Thanks Raising Cane's for being so amazing.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "knoQSph_vnj9SiugRB1BpA"
  },
  "xAzmuuS7B8hnCYezcfwIVw": {
    "date": "12/10/2018",
    "text": "Tender chicken not slimy like KFC. Fries were crispy and perfect. Loved everything about the place especially the sauce for chicken! Nothing out there like it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VjVW7OS7J-QKcKaeOCydYg"
  },
  "fEvQk_ZkTnfEqnisUXOMXg": {
    "date": "12/14/2018",
    "text": "I love Canes always fresh hot and delicious!!! And please Never go to the competitor that we don't speak of that's not open on Sunday and is the devil! Canes is the besttt",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uNb-AY-wDGmhB8TOHdKVuw"
  },
  "vZcWflJ1juR1YOeaOYbS9g": {
    "date": "4/25/2019",
    "text": "The first time I had Raising Cane's was about 4 years ago and I haven't made it down this way in a long time. It's my first time back in Arizona and my heart was set on getting lunch here. I swear it tastes just as amazing today as it did 4 years ago. I'm so sad that I don't have one closer than 9 hours from me! Raising Cane's needs to come to California. The food tastes great, the prices are great, and the sauce is great. What's not to love?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3-pKvB_ubG4R5OQwn5ZTTw"
  },
  "HiIcOno0PoiECn0fjv6ogA": {
    "date": "11/7/2018",
    "text": "You can't get better chicken fingers, fries, slaw and bread than this place.  The service is always quick and friendly.  The value for the dollar is great and the food is of exceptional quality and consistent in taste.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7C2GDfn6HID4tk5po-r-Ow"
  },
  "Zrg-Wx_U6YHtYNg6tRMNcA": {
    "date": "1/24/2018",
    "text": "The chicken was crunchy and very juicy! The food came out within 5 min or less. He staff was very friendly and welcoming. The restaurant was clean and all the tables were wiped down properly. Overrall a good experience and will be visiting this location again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z182-MFrmQG0BxfK77u2Bw"
  },
  "-K7hQo2jHJZ4vL6NLXpp6A": {
    "date": "3/17/2018",
    "text": "Visiting Phoenix so my son and I decided to try a new place.  My son thought it was bland and, while it's not a tasty as KFC, the chicken is moist, Texas toast tasty and the fried are decent.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VMB2Q7zGzuoi1RDTa8xuWw"
  },
  "vhOUYXxBs6RU5uh-rrsu2A": {
    "date": "11/4/2018",
    "text": "I used to frequent this canes very often because I love canes and it's closest to where I live however, I will no longer return to this raising canes. For some reason a caniac combo to them is 4 pieces. I believe the menu states 6 pieces... this has happened on more than 3 occasions and causes a pain when you get home and it's 2 pieces short and you have to drive back for 2 pieces.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V2a4PrtKuUAVaYIMg3Y-IQ"
  },
  "4g3B_Z3fi6O912rHj3CNCw": {
    "date": "1/31/2019",
    "text": "OMG!!! Their sauce, amazing!! Their chicken is so juicy and delicious. I'm so happy I tried them. I'll definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qA7xdJJQ4M8PP7OK9woM9g"
  },
  "Fc-5SLSFXO5ZgnR8TlT3bA": {
    "date": "3/4/2018",
    "text": "When it comes to chicken fingers, nobody does it better. Their lemonade is also fantastic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YzGQCUxpiN607wYX06x3BA"
  },
  "4CuBlPnr-QIU-UrMr4arog": {
    "date": "3/4/2018",
    "text": "I thought I had this place figured out but...two Caniac Combos is still too much food for 3 people.  We stopped in here and ordered two combos for ~$20 only to leave with leftovers.  If you like Chik fil-A you'll like this place.  Good taste, great service, and even better value for your dollar.  Stop in and you won't be disappointed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KEF5A094wOUdBG7SsS7qKg"
  },
  "oL1438V7wmConFDE01Z0fA": {
    "date": "10/25/2018",
    "text": "1st time probably the last time we go here. We are older and that could have alot to do with it but the music is loud to the point it's hard to conversate across a booth. We both had the Caniac Combo and the chicken fingers are good and hot but we both found nothing extremely exciting about them or the menu in general...We both found the sauce that comes with it to be on the bland side reminding us of mayo, ketchup, pepper with some sort of Tang to it, we both would have rather of had a decent BBQ or Ranch dressing instead...but they only have ketchup. Their Cole slaw was ok flavored and the Fry's were limp and soggy. The entire menu is very limited and you only have a few choices...We both had the sweet tea to drink and really found the tea to be the best part of the meal....over all I really think this restaurant is geared towards a younger crowd of 20-40.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ypDybiqJ9ieTWp21O_MgOA"
  },
  "A40ZepzHwjK7GU130X87mg": {
    "date": "11/28/2017",
    "text": "I'm not sure how or why this place is such a hit ... even with me!  The chicken tenders are good - with sauce.  I can't eat them without some sort of sauce or ketchup because they just don't taste like much.  It's like they don't season the batter at all.  There's more seasoning (just salt) on the fries than on the chicken tenders.  I don't visit Raising Cane's often because I think the food is so bland.  Occasionally though, the kid in me fiends for chicken tenders.  When I have that craving I normally satisfy it with Raising Cane's.  That is until I tried Church's Chicken the other night.  Now I'm hooked! Going forward I'm taking my chicken tender cravings there.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "9pNcdrQLWWrX0vEGGJlEbg"
  },
  "CH49YPUFCAFcLG67Hkyk6w": {
    "date": "4/2/2017",
    "text": "My first visit was opening week, and yes I realize that was years ago.  My buddy loves this place and wanted to treat me to lunch. It was a solid choice and my buddy's reward card got him a generous discount on todays visit.  The parking lot and lobby were packed but at the counter service was cool and efficient. and a look through the expo window I noticed that carried through to the kitchen.  I wiped our table down but the lobby attendant was present and busy.   Then there it was a friendly server calling our name (both Jim's). the 5 piece combo with slaw strips, texas toast and fries were delivered fast and hot. The slaw was Ice cold. No choice on sauce but the house sauce was great, kinda ranchy but different. The chicken was perfect and the best strips I have had in a very very long time!  the menu is tight and that might be why they are so efficient, you cant complain about that.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XnKUcmayZd-N43fR2n-0Ew"
  },
  "gEVeBrjwCZna-Q5rZk0FZg": {
    "date": "11/30/2012",
    "text": "Great fast food, chicken was fresh and all white meat, zero fat with a great breeding. Fries were adequate, and toast was awesome!  I hardly eat fast food but when I do this is on the list.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zdzu2Gvci6rNwpS0qBmV7Q"
  },
  "QeQGTQjZuZMMnVCCpbc3kQ": {
    "date": "10/7/2014",
    "text": "I usually get great service when I go here. It's been one of the things I've been impressed with because unlike most places they didn't seem to hire bratty teenagers, but that's exactly what I got last night. I pulled up, ordered and the girl at the window repeated everything back to me. When I pulled up to the window, another employee was screaming and playing around. I'm all for having fun, but not at the expense of service. The girl at the window was obviously distracted and handed me only one item I had ordered. When I told her I had ordered another meal, she got snotty with me. She gave me my other order, which still was missing my 4 extra canes sauces. When I again told her that I needed the sauces, she was incredibly rude, asked me to see my receipt and made a big deal about how she hadn't charged me for it even though she had repeated my order back to me at the speaker and definitely included the 4 sauces. She didn't end up charging me, but the whole thing was just ridiculous. I'm extremely disappointed with this whole experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C5CHGx_c1kQkA7kT5xaPaQ"
  },
  "4MNLCahGp1gKrPb5ukrHXg": {
    "date": "3/28/2012",
    "text": "Surprised so many are quick to discount a place that you can get a full meal for $6. Yes your chicken wasn't handed to you by a hipster in a barn that was upgraded with modern lighting and a DJ playing, but for what you pay for, Canes is awesome. If you want fried chicken fingers these have to be some of the best.   To clarify for some of the others, a burger king used to be here and they welcomingly bulldozed down that atrocity to burgers to the ground. And they do have modern lighting, and a disco ball for some reason, if that is what you're into.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "C3Ii5KQGFFtiyoJy_Wf0Tw"
  },
  "qtEqd5sE8Y3QsBMLsDgB0g": {
    "date": "3/9/2012",
    "text": "Oh YUM.  Fantastic chicken strip shop!  Honey Mustard dressing is delish, Texas Toast is delish too!  The lemonade is wonderful!  Cane sauce just eh, fries are nothing new, cole slaw is bleh.  Who comes here for fries or cole slaw anyway, it's about the CHICKEN!  These strips surpass anything I've had before, they are wonderful.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tEZLN3gP0jwfP2ugFyuuMQ"
  },
  "zR6rZi6m0n1RPSQQm3UBtA": {
    "date": "5/2/2012",
    "text": "Everything about this place is goood!! The food is perfect, not greasy. The spicey dipping sauce is flavorful & goes great with the chicken fingers & the fries... Plus the service was speedy, and the place is shiny and new! Loved it :-)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BhHlOW07KiwKS--EYL3Gog"
  },
  "cuWso8DKZrKO0CF1EmRhXw": {
    "date": "8/17/2012",
    "text": "I am not usually a fan of fast food, but I will give Raising Cane's a pretty solid score.  It is very clean inside and very attentative service.  A very limited menu offering but solid food.  The chicken is moist and succulent and the fries are the typical frozen fries.  You do have to wait a few minutes for your food though.  They are cooking it a la minute (to order).  I am pleased with these guys so I will go back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ef-NDzuYpy9Y_ntbk6GUfQ"
  },
  "HmKOIyt4b7ZRBoL8fzCVhA": {
    "date": "9/27/2012",
    "text": "Ok if you are a little kid and like chicken nuggets. Nothing I would EVER return for. Blan",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xxt45JQQaWWV2P7Q5IJj_g"
  },
  "U9ZAzXIpsl4w9henyaZf4w": {
    "date": "1/12/2013",
    "text": "Again another hometown (LA) food that has come to the valley and we stop in whenever we get into town.  The chicken is great, the fries are crinkle cut and I love the bread on top!  But the best part is the \"Sauce\"!  The restaurant is clean, the food is good and I love the sauce!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j7sbpb8YATglhFjx15ch_w"
  },
  "MqgAxExXIkNNImPMu8cl3A": {
    "date": "6/28/2012",
    "text": "I had been told how amazing the food was, so I think I was slightly disappointed. However, it WAS good, just not life changing...but the thing that set this place apart was the service! I felt like I was in a sit-down restaurant. The cashier was very nice and personable, came to check on us, and it was extremely clean and well-decorated. It did not feel like a fast food joint.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AxGkIppvau9rMKXRzhtq0A"
  },
  "9JHwzJPERpwGAJhy5-M-YQ": {
    "date": "9/6/2013",
    "text": "good food but my cashier was not very smart when it came to math she tried to charge me an extra .30  and for some strange reason the place had a smell of fried catfish",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "fSvFRzmqSiYz5nR2XOGuug"
  },
  "BYOTOMGb_mjNQ20OrH5WpQ": {
    "date": "8/18/2012",
    "text": "The food was fresh, the place was clean, a great place for lunch or a snack.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PxDKVBipTwYFaNBkvv9xbg"
  },
  "f07U8jw2ICwlLY0CsugujQ": {
    "date": "8/8/2014",
    "text": "The food here isn't necessarily bad, it's just bland and lacking taste. The staff is friendly, and the restaurant is VERY clean. All and all, I wouldn't object to returning here to eat in the future, but I don't think I'll be craving it anytime soon.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CdrSCcV4JaCsyQcCv1VXgQ"
  },
  "zbGoyGfVopi65l87dPA0LA": {
    "date": "9/19/2012",
    "text": "Hot chix!!!! Living in the south for a quater of a century I must admit, I was a little bumed leaving some of that style food behind. Moving back home to the west is awesome and then....wooHoo! Bonus Big Score! Raisin Canes....A bit of the deep south, right'cheer N da desert!!!! If you've never eaten southern fried yard bird, check'EM out! The sauce is Bombdigity!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-XKgTbTxCtZldcDCXIdZ9g"
  },
  "SxCHl0N-fnG1RnJVFYY7Vw": {
    "date": "8/23/2012",
    "text": "bland and overpriced.  For a place that specializes in strips, you'd think they would be better than KFC.....they are not.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lsRiKlzA8JbhNOTDhycXlQ"
  },
  "mVlezWZV6SkvTcQPvjXsnQ": {
    "date": "9/29/2013",
    "text": "I have an addiction to chicken fingers. I eat them at every chance I get. So my husband searched online and found Raising Cane's. To our great interest, we learned about this location.  On a vacation last week to Sedona, AZ, we stopped here -- twice. First on the way to Sedona from the airport and again on the way home.  The chicken was superb -- nice breading and not overly heavy so the emphasis was really on the chicken. I just got fingers. My hubby got a box meal with fries, Texas Toast and sauce, all of which was excellent, too. And quite filling! There was no need for more food after our initial order, unless it was to take it with us..  But what really stood out for me, was the staff. The young woman who took our order, Falicia, was as friendly as could be and highly competent, going out of her way to help us with directions to the Desert Botanical Garden, where we were headed after our meal.  Now, consider how many customers she served in the week we spent in Sedona. When we returned yesterday, she was there again and when she saw us, the first thing she said was, \"How was the garden?\" For real? We're THAT important that you remember helping us? Clearly, Raising Cane's -- or this location, anyway -- puts a premium on customer service. I have a zero-tolerance policy for poor customer service, so you can imagine how THRILLED and impressed I was. It felt like this young woman was an old friend and what a warm feeling.  Her colleague at the counter, Liz, was also adorable and delightful, joking around with us, while getting our order EXACTLY right.  And while we were eating, the manager came around to each table stopping to talk with patrons to ensure that everything was copacetic. I just can't say enough good things about the service at this facility.  Delicious food and outstanding service. A five-star rating on Yelp is a designation of, \"As good as it gets\" and this Raising Cane's restaurant richly deserves the designation. It's 1200+ miles away, but I look forward to returning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "z1pYdmBSFrMtNxNSQUka6g"
  },
  "ODZvFsmbXX6Fx6EItRu6VA": {
    "date": "12/11/2012",
    "text": "Excellent.  The chicken fingers are the best i have had, anywhere.  Lightly battered, crispy, hot, delicious.  The staff is warm and inviting, and they came around to check on us mid-meal. Nowhere else fast-casual do you feel so welcome.  Delicious, clean, lovely.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j8dbsRPAEjbQVOyesU65_Q"
  },
  "rC89qJ_yENoMh210y8cYkw": {
    "date": "9/28/2012",
    "text": "I give this place 5 stars all the way!!. We were out in Arizona this past summer and my boyfriend told me about this place and we got food there and I was blown away. It was incredible I love their bread, and the chicken. I kinda wish they have this place in San Diego.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o1A3NtPmvMyi1sqob5H7AA"
  },
  "IdPBbj1Abeovm9tS2hswPQ": {
    "date": "1/31/2012",
    "text": "My family and I went here last night because my daughter wanted \"chicky\" and we were driving down Thomas so decided to give it a try.  Definetly NOT a place we will be dying to come back to.  They don't have any options other than how many pieces you want.  There are no flavor options for the chicken, they just come in plain flavor.  The texas toast they served wasn't very toasty at all and the fries were cold and un-seasoned.  Service was fast & friendly - 1 star.  The chicken tasted pretty darn good - another star.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CAF213A2WWWXTJMjieSS0g"
  },
  "E93yyyW1Znb0U6ZC4B-7bg": {
    "date": "1/18/2012",
    "text": "First visit to a Raising Canes..Mixed review here.  On the good side--chicken was fresh, juicy, hot, and flavorful. Fries were fresh from the fryer..  On the not so good side--Fries were the \"old school\" crinkle cut, processed fries you used to get 20+ years ago..Texas toast served with the meal was lightly toasted on one side only, and was not the least bit warm. Sauce served with fingers was a very \"different\" flavor than the norm.. The cashier described it as a mix of ranch and honey mustard.. I didnt get any sweet or mustard out of it. More like a chilipowder ranch??? I would prefer a country gravy, a real honey mustard, or sweet and sour and/or bbq.  But the worst part, IMHO, was the little cup of coleslaw.. Totally devoid of flavor. It was like they mixed cabbage with watery mayonnaise.   My \"box combo\" was 4 smallish fingers, some fries, the little cup of coleslaw,and a small soda..It was $7.00 with tax. I would've been ok with the price if the slaw had been decent, the toast had been toasted and warm, and if they had better/more choices for sauce. But at this price, I was disappointed with what I got.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KnqLjBIIhe_Orqs6XFZ-NA"
  },
  "-H-p0K2UYJ2MuucFATPWlQ": {
    "date": "5/23/2012",
    "text": "I recently made a review on this location and had to change the star rating because they do have a kids meal and a great one at that, thanx so much!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JoLOaOYLXTSyMWpbDER-Og"
  },
  "rlwSnOCEcnF53RbFf8DPHA": {
    "date": "6/13/2019",
    "text": "This was a last minute decision to come here and I was extremely impressed! For a chicken finger place!         I couldn't believe how clean it was and lots of open dining areas. As I was getting an unsweetened tea, they were cleaning. Super friendly staff.      So my first time here, amazing chicken and the sauce is divine I used all the sauce they gave me:) Although I couldn't finish even half of the fries (ok), saved the coleslaw for later. Huge portions, so next time a smaller order would be more practical. Overall, tasty food!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "N0JDRMc9GiFInyfB61iN_g",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. The box combo is more than enough!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/N0JDRMc9GiFInyfB61iN_g/o.jpg"
      },
      {
        "img_id": "w8fjMvg2OPqNA458w9tr8w",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/w8fjMvg2OPqNA458w9tr8w/o.jpg"
      },
      {
        "img_id": "yHvIR1u-ov3jKHXFcOsWjg",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yHvIR1u-ov3jKHXFcOsWjg/o.jpg"
      }
    ],
    "user_id": "5l9NSEbIqvKcyvApsmj4tg"
  },
  "L-7BzaDbbSj-AvH6HpdypA": {
    "date": "2/7/2019",
    "text": "Seriously guys, Raising Cane's Peel the Love promotion has me stopping at every location trying to find game pieces (come to me my precious)!   As always, I went with the Box combo and opted for extra toast instead of coleslaw. Today, the fries were perfectly salted and the toast was soft and buttery. The chicken strips were juicy and pair well with the Louisiana hot sauce.   I'm still on the hunt for the elusive 'S' so I'll definitely be back in the very near future.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5_u4z7PB_j5kOGh7JA5G6Q",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. Raising Cane&amp;#39;s box combo with extra toast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5_u4z7PB_j5kOGh7JA5G6Q/o.jpg"
      },
      {
        "img_id": "DVra7Vj4h2bpjWegPi7uvw",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. Raising Cane&amp;#39;s drive thru menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DVra7Vj4h2bpjWegPi7uvw/o.jpg"
      },
      {
        "img_id": "Q1uQwFQ1iJVmfcHFM6QJSw",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. Raising Cane&amp;#39;s chicken fingers",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Q1uQwFQ1iJVmfcHFM6QJSw/o.jpg"
      }
    ],
    "user_id": "oensjIvPthozpxdZV3T4Sg"
  },
  "hmB4jtoUYlqcHpOyJmrnLw": {
    "date": "7/5/2019",
    "text": "Canes is one of my fav places. This is a decent location but the parking fills up pretty quick on the busy days. They get the food out pretty quickly here. It's a classic canes spot! Keep being awesome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Zum2ynbC6R_yhLys1iotHA",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. Caniac",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Zum2ynbC6R_yhLys1iotHA/o.jpg"
      }
    ],
    "user_id": "lqClGhIoBJyBvORkhd7VcQ"
  },
  "hSAxkl46bEQHSPdO2M3orQ": {
    "date": "8/20/2019",
    "text": "Everything there BUT the chicken is 5 stars. Not to say the chicken is bad it just lacks the kick or flavor I was hoping for. Maybe it's the thickness of the strips, not personally a fan of thick juicy strips. Not gonna hate though Cane's is bomb",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Wprw-FR5g1yTLWL4Clbvg"
  },
  "ZEtLren47rZdWCou_MtdAw": {
    "date": "12/3/2018",
    "text": "So you know, this isn't my first rodeo with Raising Canes (more like my 50th)... I love the sauce and the strips and the Texas toast, but the service this last visit had to be my least memorable experience... one word to describe... 'BOOOO' (I don't think it's a word but that's how I felt)   I've never been a fan of the way they take your name when ordering (they never get mine right) so when your food is ready they shout it out for everyone to hear... yeah, I get it, but not a fan... same thing with them filling my cup with ice at the counter... especially when I say it 2 times when ordering (no ice please).   Tables & floors weren't clean, staff was slow and my order was quickly handed over to another table after waiting almost 10 mins.   I asked the guy as he mumbled a name apparently when he walked out with my order. I started to figure it out while he was talking to another table and they were confused. He walked away like whatever so asked him what name... he couldn't pronounce... really... I think was ticked me off was that he made it seem like it was my fault... after our brief exchange, he came out 1 min later with my order burning hot & overcooked fries and undercooked toast! I had to wait for 15 -20 mins from the time I arrived until I actually could enjoy my meal.  Hoping my next experience is better!!",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "fwasfCCwbxLjxLNhYLuF3Q"
  },
  "DFE1lEdEEc6cEZtteB0XTg": {
    "date": "12/14/2018",
    "text": "Its okay. Anyone who gives this five stars is delusional. Salty, we both got sick last time we went, probably the salad. Its fried strips with salty sugary sauces. The bread is greasy. Whatever, I guess. Yes, better than Burger King, but not a prize. I have had this several times, not once, and still waiting for the magic. Not a hater, though. Will probably get it again at some point.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fmyQCIe3AkyVRVCP3buTCg",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. Greatness",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fmyQCIe3AkyVRVCP3buTCg/o.jpg"
      },
      {
        "img_id": "GEc7eG2s1f9BqjomnTmvgA",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. Magic",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GEc7eG2s1f9BqjomnTmvgA/o.jpg"
      },
      {
        "img_id": "0eHrW_GN5S2zbqTNsZzE6A",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. Dip it all in the sauce",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0eHrW_GN5S2zbqTNsZzE6A/o.jpg"
      }
    ],
    "user_id": "djP46l4v0TQTqhLa-ZB1xw"
  },
  "bUr9_-NgN_dSfhrGDmKrcw": {
    "date": "7/23/2019",
    "text": "Always great food. Everything is delicious. Do your carb cravings a favor and sub extra toast for the slaw!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tMTjFQWIZp9P21oUEyaXxg"
  },
  "vSQQyyDV28Oi5PS1zIMPWQ": {
    "date": "11/18/2018",
    "text": "Fried Chicken. You can get it at grocery stores, KFC, or make it yourself. What you can't get though at all those places.... That dang sauce. You can only get that at Raising Canes.  While the chicken here is good, I've noticed the average strip size has shrunk over the last few months. And the breading can sometimes not be done enough.   The fries. I always ask for crispy fries cause the regular fry time just isn't long enough in my opinion. That usually means I have to pull out front to wait a few minutes.   Now, the sauce. If I could recreate this stuff at home myself, I would. If I could buy it in a pint size, I would. Maybe one day will see the sauce for sale in grocery stores like we used to see Bill Johnson's BBQ sauce.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b34yOQoUDev_l6BzDBMpUQ"
  },
  "F8e3L-uwYU33UuFwQMcuIA": {
    "date": "7/31/2019",
    "text": "Went there for drive thru. Ordered 5 meals. One was a sandwich. When we got the food back work the sandwich had a long hair buried in it. I tried to call the restaurant numerous times. Finally I got someone to answer. I asked to speak to a manager. I told her the chicken actually had three pieces of hair. She asked if I had the receipt. I told her probably still in the work truck but I had a photo of the chicken. She wasn't interested in the photos. She said if I took the receipt back with her name written on it they would give me a another sandwich. Really? That's their resolution?  The more I thought about it the worse that response seems. $40 wasted food.  On another note the fries are terrible. Like something out of a bag from your oven. Dry and flavorless. Don't see the big hype.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZJ5OQYL1N5ey-SE7XnJHfw"
  },
  "iv9LrJctfVMox9HmAJ7i-A": {
    "date": "7/22/2019",
    "text": "They always get our order right, everything is cooked to perfection, and always a timely manner! They always put enough sauce on the sandwich when at other places I've noticed they don't add enough sauce! Staff is always friendly and helpful",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NflRXqMalpM0KKAhg-o7xw"
  },
  "neC_MskWYSfJ11lp8lvMiA": {
    "date": "5/7/2019",
    "text": "Omg raising Cane's is sooooo good. I used to live walking distance from this location on Thomas but moved to Northern CA and now the closest Cane's is in Reno,NV. I don't mind driving 2 hours for some canes!! Yummmm. But every time I fly into Phx I'm here visiting. Canes please come to the Sacramento area! I'd have to say the chicken pieces have gotten a lil smaller or is it just me?? I thought they used to be a bit bigger.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_mAJ90QmLGb2w7ozjcraQA",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_mAJ90QmLGb2w7ozjcraQA/o.jpg"
      }
    ],
    "user_id": "6Soee7_NxZm3h0TeAzbP2Q"
  },
  "lM0hGlYQm4yKoRbVgjvoSQ": {
    "date": "7/31/2018",
    "text": "I have been here several times before and this is still my favorite chicken place over the other chain places. Chicken is always fresh and crisp and OMG the dipping sauce is amazing. The lemonade is out of this world good!!! Service is fast and friendly for as busy as they get for lunch they really move to get everyone served.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "uWOaeevjHJd2fGmhYaCIVg",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uWOaeevjHJd2fGmhYaCIVg/o.jpg"
      }
    ],
    "user_id": "XmvKKMAkSwyhB9F_C1Ze-Q"
  },
  "3yjLm3hjl0wNIiae3diIDw": {
    "date": "8/30/2019",
    "text": "First time visiting raising Cane's, and it will be the last time as well. First of all, for a place that only serves chicken fingers I was quite surprised that they only have two dipping sauces to choose from and one of them is not ranch. They have a honey mustard and their canes sauce. The girl assured me the cane sauce was delicious and very popular so we got that one. I liked it OK but my wife did not care for it. She went asked if she could exchange it for a honey mustard and they said it would be an additional charge. I was quite shocked about that. When it was their recommendation and she wanted to exchange it for a different one and they wanted to charge extra. As we left I spoke to the manager to let her know what was going on and all she did was shrugged her shoulders and tell me she does not set the prices. Horrible customer service and the food was nothing spectacular. And are you kidding me, only two sauces to choose from when all you do is chicken fingers?",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6pt6KUL2uvpcmMu-jY1hFw"
  },
  "vCeYFl21ONhpvpHjMy7zDw": {
    "date": "2/13/2019",
    "text": "The line for drive-through is ALWAYS lit, but they manage to move it quickly. The food is quality and that sauce is fire! I will continue to make this an item for the dreaded question: \"What do you want to eat?\"",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qxZeQrakVi3aF6JuRvcJCQ"
  },
  "n0nUWhfvgYjdyb8-xgXfNw": {
    "date": "6/6/2019",
    "text": "Where there is a Cane's, it's a must go to for me! We don't have Cane's in Utah, and so when I travel I always check to see if there is a Cane's. And every time I go, it never disappoint me at all! I always get the 3 or 4 chicken tenders combo. It comes with toast and coleslaw and it's so bomb! The canes sauce is to die for! I'll always come again when I get a chance!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cgciqeqcEyIkTvKuUDUTEg"
  },
  "Uj7mL6SBZJVH6JwZiuDA5A": {
    "date": "12/22/2018",
    "text": "Was what I expected from this place in regards to service. However, the food is tasty and their sauce is amazing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x8hGFrxdyt7EUZgd45NbnQ"
  },
  "Ail1rsSzjpBaE-UeBcKo1Q": {
    "date": "4/22/2019",
    "text": "So I went to Canes today right? And me being a good dude I decided to get lunch for my friend Dalia, (you all don't know her). And my babe (you all don't know her either), well we have a love hate relationship, I'll be like Babe, and she'll be like My name is Rosita, \"Babe\" and she'll be like \"Get the F*** out of my room, what are you doing here\" or \"Shut up Pepe\" (they call me Pepe)\". Or she'll be like \"What's up P***** boy\" like I said love hate. So I ate with my friend Dalia,(Super cool by the way and looking for a potential baby daddy, msg me for more info) but Rosita said she was already getting off of work, so I didn't bring her any lunch. Oh but the food right? My bad I was rambling.....it was good.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8wV4tZ3q52TdNFoz5ibIVQ"
  },
  "IpJuumLGFGyOpRc6NjzJ0A": {
    "date": "2/18/2019",
    "text": "Love the chicken, bread, and sweet tea!  Clean fast and friendly service! The chicken is so tender and juicy...mmm yummy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CooIKvcP21h_GI8zdwHMcg",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CooIKvcP21h_GI8zdwHMcg/o.jpg"
      },
      {
        "img_id": "-NyFoufWXIpQQ3QscnPqWw",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-NyFoufWXIpQQ3QscnPqWw/o.jpg"
      },
      {
        "img_id": "uj_gZ1xJxTnJRsbLEiwKeg",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uj_gZ1xJxTnJRsbLEiwKeg/o.jpg"
      }
    ],
    "user_id": "NU9zgGV58vlN_dkIJo7Z7w"
  },
  "zZVuBQ0E4x8WQqjAv5nnLg": {
    "date": "1/5/2019",
    "text": "This is one of my favorite chicken fast food restaurant, the drive thru line is usually long however they are fast with their orders.  I went with my daughter and for some reason my credit card wasn't going thru, the cashier was nice enough to give us the meals at free of charge because she said they were having tech problems with their credit system. This was very nice and considerate on their behalf because not a lot of fast food restaurants would do this. Despite that I told her to hold off the order because I was just going to the bank to get cash. They seem to care about customers because I hear nothing but good reviews about this location. This is the main reason why I keep coming.   Their Cole slaw is delicious along with the toast . And they have the best Arnold Palmer drink. Thanks Rasing Cane managers and crew :) keep up the great work",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4B16Wu0lONBP8TcM6RaBNg"
  },
  "5kxKtR52HpNpYjutChfUow": {
    "date": "3/30/2017",
    "text": "I absolutely love everything about this place! The food is so good. The Texas Toast, the coleslaw, and the chicken fingers are to die for. Oh and you can't leave out the awesomeness of the lemonade they serve.   The Thomas Rd location is always busy but the service is fast and correct the first time. Ample seating for large groups or families is also a plus. And the customer service is awesome! One of my favorite places to eat!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "vgQSSITpMcyy3iizoXaGtA",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. The Canaic Combo",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vgQSSITpMcyy3iizoXaGtA/o.jpg"
      }
    ],
    "user_id": "1ueutKtIYlc6FDxb1IbqdQ"
  },
  "GaY2XHd2S_ctJxJEGYI4lw": {
    "date": "11/21/2012",
    "text": "For a fast food place, this is 5 stars.  Excellent chicken fingers - juicy with a think breading.  Their Texas Toast is delicious too. Fries are average - but i am a sucker for a crinkle fry.   Service is always friendly and my order is right every time - which isn't always the case for fast food.  If you want delicious fast food this place is great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "kA3fr-tBE55ubyBoV4mULg"
  },
  "O5IkpZ0pYTq5G5JaR8YX5w": {
    "date": "7/8/2012",
    "text": "Nothing crazy out of the ordinary here. You get some chicken strips that taste like any other chicken strip you can get anywhere (not worse nor better). The fries are crinkle fries, kind of like the ones you get at del taco (i like del taco's better actually). I liked the cajun dipping sauce that came with them it was almost like a cajun ranch, the bread was also really good. As first timers we asked the clerk about what she would recommend and she was amazingly nice. She was patient and helpful in our decision, she also had a big smile on the whole time. Just because I wasn't wowed by this establishment (i like chik-fil-a better), I probably won't be returning but if it's the only thing around I wouldn't discourage it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "pL4NhW3rTokFr-CQh3Lzgg"
  },
  "cgXx9VeVguCbrl9WlkveuA": {
    "date": "10/15/2013",
    "text": "Everyone is very nice in Raising Cane's. Taste is really average, nothing even close to famous chicken finger.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OiNzs7h3zDsp8oksv8H7oA"
  },
  "UK6wCeov-woP_WTF8VpGTw": {
    "date": "4/3/2015",
    "text": "I just moved down the street so its always a plus when I have A cane's right down the street!! The only thing was that the wait in the drive through was extra long.  Always have to get extra cane's sauce!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Fr4FFf5mJ1ImHwLfBu5iA"
  },
  "TnB0PKE00er4ot0u9DX3GA": {
    "date": "5/7/2012",
    "text": "I really enjoy Cane's and since leaving Dallas have longed for it on many a day! Also, they have great crinkle cut fries, which more establishments should offer. Check it out, but go in knowing its just a chicken strip place, albeit an awesome one, but still just chicken strips.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "anHzk1C0oQRtfuDj74p2RQ"
  },
  "BLrVEivaJFVEZ6IkKbLmVw": {
    "date": "11/14/2015",
    "text": "This place is awesome, decent prices and good food. Order came out way faster than expect but was hot and fresh, very obviously not taken from under a heat lamp. Go for extra toast over coleslaw!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X1JsgqRrSAPQkprwN-CX1Q"
  },
  "uXXQ2_ML4vwgEOo7h7L8tg": {
    "date": "1/15/2014",
    "text": "I've always passed by this fast food restuarant everytime i went for fueling or heading out to walmart or frys. after seeing their commercials, i've decided to give them a try; and i have to say, their chicken fingers are delicious. Always fresh, crispy and tender. The Chicken Box combo was right-on. It had fresh chicken fingers, freshly toasted buttered bread, cole slaw and fries. This is my second time coming here in a week but i will try to limit my visits to once/month (i'll try :( .... )",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ayb5ALg4oe9Fyeczzi40YA"
  },
  "XTDzZWBvunzfVyO40oikeA": {
    "date": "6/10/2012",
    "text": "Very glad Cane's made their way to Arizona...it was one thing I missed about living in Las Vegas! It's not close to home, but always worth the drive for fresh, hot and delicious food and great service. The staff is friendly, the restaurant is clean and it is cheap comfort food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "1J1wECaKO1sw8_iMKyDjKA"
  },
  "TbnidtJpghAUpNDv9krRGQ": {
    "date": "7/24/2012",
    "text": "The people at the register were friendly, now onto my review.  I thought I would try this place since it is one of the new places to eat around work. I ordered \"The BOX\" and got it to go. I was surprised just how long it took to get my food despite there being maybe 5 or 6 people sitting down at the tables and nobody else in line. I asked if they had other dipping sauces since special sauces are always disappointing, and they don't have any. Seriously? Not even BBQ? You specialize in chicken fingers and don't have BBQ? Ok fine, I'll try your sauce. It was terrible, I ate an entire finger using it hoping that it would get better, it didn't. I had to go find some hot sauce here at work since the chicken itself was so bland.  Chicken - Not bad texture wise, but bland.  Sauce - Terrible. Get more sauces, the one you tout as the best doesn't have the ability to stand on its own. Asking others in the office its either a love it/hate it verdict, which essentially means those who hate it won't be repeat customers.  Fries - Did you get these from Fry's across the street? Crinkle cut bland fries, yeah that sounds like store bought.  Texas Toast - Great  Coleslaw - Never been a fan, so no review here.  Apparently this place stays in business by those who actually like the sauce since everything else they serve is underwhelming.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "IV_KHTOARdxX18QH36fsxA"
  },
  "QazAgBqv3cW47PlkFemK6w": {
    "date": "8/27/2012",
    "text": "The Cane's sauce is awesome!  The chicken fingers are really great but why did they simply stop there?  Improve the french fries!!!  Make them different!  They are really b-o-r-i-n-g (unless you dip them in the Cane's sauce then they are less b-o-r-i-n-g).  I'm not a fan of the Texas toast.  It makes for too much food even when you only order a 3 finger meal.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LKfsu6hRdMhosIBs7CJXTw"
  },
  "9_b_m5QQXaVcir3Jd0E-rg": {
    "date": "8/28/2012",
    "text": "Went back and chicken was better...still a little room for improvement but I did bump it up to 4 stars",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ycYaA6wmFE30T4ba14N0Tw"
  },
  "zqNhzDMnDSFeqxwEsaTuyA": {
    "date": "8/3/2014",
    "text": "As far as fast food chicken goes, Raising Canes takes the cake. There chicken is juicy, succulent and finger lickin' good. Paired with their secret Canes sauce, coleslaw, crinkle cut fries, and a slice of garlic bread, you'll never leave hungry!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "fe3Bsxa6a8CTV4A4w_mi3A"
  },
  "MvEyMRgYDD6WNq6mzhKaQA": {
    "date": "5/31/2012",
    "text": "The chicken fingers are good and juicy but they're not the best I've ever tasted. I wasn't that impressed by the dipping sauce or the fries, but I loved the Texas toast.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ag4KXilKH4Yl9o9QqLOzOQ"
  },
  "mcchAs_eddwvSeLPQdWUTQ": {
    "date": "5/28/2013",
    "text": "I took my first trip to Raising Cane's on Memorial Day! First the the young lady Kendall provided excellent customer service from a polite introduction to great service for all my needs. Second the quality of the food was great and was visibly hot and fresh. Overall I give my experience a 10/10 and recommend Raising Cane's not only for the great food but great service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GhcdlOHQN_5AVPIavyuMGw"
  },
  "tk_-6jt8vaq-CY_RBHajOg": {
    "date": "4/1/2013",
    "text": "I love this place. It reminds me of Zaxby's from the South. Simple good food, dipped in tasty sauce.   I always like getting the Big Box meal so I can have the coleslaw, but I find the coleslaw tastes too salty for my liking. It's the one thing that makes me a little sad, but it won't stop me from enjoying everything else.  Service today was great, every single employee seemed to have great customer service skills, which was refreshing for a fast food joint.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F8lSLoGRNf3HDAZESji1EA"
  },
  "1lN3ChBin6o3TITg9_PEqQ": {
    "date": "9/7/2014",
    "text": "Went to Raising Canes today. First I have to say the place was clean and the staff was nice. I had  the Box which consisted of 4 chicken fingers, fries, coleslaw ,toast and drink. The chicken was hot and not too greasy and seemed pretty fresh, but bland bland and more bland !! The sauce was okay but no real spice or flavor, need more choices in sauces, fries soggy not fresh, frozen and not cooked well, coleslaw out of a box not fresh. In my opinion it was very expensive for the quality of food. Won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8381cDXbQs5LDMwQo2DIcA"
  },
  "ahncWRsr37YpGkXKbfwuZw": {
    "date": "12/1/2012",
    "text": "For specializing in chicken I felt it was lacking in flavor... There is no seasoning. Chicken was all white meat and very fresh but just like food you could make at home. They don't carry ranch for the chicken/fries only their famous canes sauce or honey mustard neither of which I like the taste of.. Reason for 3 stars was excellent customer service and very clean and well kept inside. ps my b-friend did like the canes sauce tho. Prob won't return... no real reason to.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ob6ToKjLna3WOZtrI_m0nw"
  },
  "dxOn1K6lN152dl8aFGLQoA": {
    "date": "12/22/2011",
    "text": "I like chicken fingers and have been watching this place go up. The place is brand new. There was plenty of parking. The service was efficient and friendly. But there is more to lunch than looks.  The 3 finger combo is just under $6.00 so even light eaters should bring a fat wallet. I was hungry and went for the 6 finger \"Caniac Combo\" for $8.30. My 11 year old son and I don't spend as much in a sit down restaurant as we did on today's fast food  lunch. There was plenty of food, unfortunately there is significantly more bad fries than average chicken. The chicken fingers are at best average and the sauce did not impress. Fortunately we had some Tobasco buffalo sauce to kick it up a notch. The fries are Ore-Ida without the crispy golden-brown outside or steamy inside.  The combo professes to include Texas Toast - mine did not. I took the time to call and let them know. They did not apologize, just asked me to hold. No longer friendly or efficient :(  Eventually they came back on the line and let my son (I had to get back to work) know they would take care of it next time. Neither of us knows what that means and we not likely to find out.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "rVW-2pEGSKHKHw8RZLrZuQ"
  },
  "Tc8ndaBprBIMUxuuEdItxw": {
    "date": "5/27/2012",
    "text": "Not bad, but not great.  Just standard chicken strips.  The service, however, was the best service I have had a a fast food establishment.  The staff was wonderful.  I would choose Cane's over another establishment because of the staff.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "swJnPNmTS_aTpnZ5i_QEbA"
  },
  "9XNLBlUTj-Scvb6fqp0l5w": {
    "date": "5/25/2012",
    "text": "It was okay. I compare it to a place back home called Zaxby's. The girl suggested that I order the box so that i could taste all that they had. The tenders were normal tenders, the secret sauce helped them out. The coleslaw was not good. The fries were gross. The best part of the meal was the toast and lemonade.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vLBGrT1CY_eXkcO7fNzcwg"
  },
  "W2b3zCNWUpHR-BShnmcJPg": {
    "date": "4/30/2014",
    "text": "Not much to talk about....great place....good food.....im not much into canes.....but the wifey loves it....nuff said.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ULutykT6i_LsP6w9RaLdfg",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. Sign",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ULutykT6i_LsP6w9RaLdfg/o.jpg"
      },
      {
        "img_id": "QsgxUBgt8FZnYNbKJvWLmw",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. Caniac Combo #2",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QsgxUBgt8FZnYNbKJvWLmw/o.jpg"
      },
      {
        "img_id": "QRozpJKzeF2yw-KDE9c8WA",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. Wifeys Caniac Combo n sweet tea.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QRozpJKzeF2yw-KDE9c8WA/o.jpg"
      }
    ],
    "user_id": "Kzp3q208Jl5eyQYVKg0W0A"
  },
  "HGNMmvm0_14-CDzeX1LGJQ": {
    "date": "5/15/2017",
    "text": "I absolutely love Canes. A must try. Get extra Cane sauce I usually get 10. So I can have some to put on my food the next couple days. Goes great with steak!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zv4sVa2EfPYFqte9oeJbOg"
  },
  "Rob3YuBt7whJtssAEh1CDg": {
    "date": "10/20/2013",
    "text": "The customer service is top notch especially for a fast food joint.  I ordered the 3 piece chicken finger meal and it was good. The chicken is fried but greasy at all, on the inside the chicken is very moist and and tender not dry and overcooled like most chicken finger/ tenders.   The only downside the breading could use a little bit flavoring.  Overall the food was high quality and not to expensive, I would go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "U33XCz-8HyXwZ6v5I3HFng"
  },
  "ko_gjq6dTEmi0YsDUDohdA": {
    "date": "12/31/2014",
    "text": "So, after hearing a lot of really good things about Raising Cain's I decided to swing by for lunch today.  Unfortunately, I was pretty disappointed.   I'll go through piece by piece.  -The bread was pretty awful.  It was soggy and had a weird flavor to it.   -The fries were average at best.  Not terrible but nothing special either. -Cain's sauce is BLEH.  I tried their honey mustard as well and it wasn't very good, either. -The chicken was the only thing that was actually good.  The breading was very plain but the chicken itself was tasty and, as others have mentioned, actually tastes like real chicken. -There was a lot of food for the price, so that was good, too.  Overall it wasn't very good.  I won't be a repeat customer.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IjNe-6lsA82DFdnCuP44Mg"
  },
  "pphY3exVyVmeenQ2_AX-Mg": {
    "date": "9/23/2015",
    "text": "I love this place staff is friendly though sometimes it is annoying when you get asked hows your food five times but other then that I love the food it's awesome",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "M_dvBcxlLY9r0VifKBsOcg"
  },
  "_AdyJVe9ZfW8HAluxL3jsg": {
    "date": "8/23/2015",
    "text": "The chicken is very bland tasting and they serve it at 1000 degrees. The fries are frozen crinkle fries, the coleslaw is mediocre and their house made lemonade is way too sweet. The best thing I had was the $0.59 side of bread.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RGwsJFX8cLIngZM-0sUnog"
  },
  "UYrORkt0OLRLvImcSj0XSw": {
    "date": "8/10/2016",
    "text": "One of the best places I've been told in AZ. I've been here for almost a year and I can't believe I haven't been to this place! The food is excellent! The sauce is even better! 5 star for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EN0bs9E-toGTyXqSwEJllQ"
  },
  "3LS9eoQHmgt7Avzofm_h9g": {
    "date": "1/29/2014",
    "text": "Great tasting chicken and the southern bread is wonderful. Canes sauce is a must must must.  Don't see any dessert on the menu,  only downer .. But open until midnight ! Great for late night cravings .. Great value for the amount of food per meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nQtzqKs_6RWJOSJe2tfpkg"
  },
  "T5fAftdCpI8crZ9I9YYU9w": {
    "date": "12/6/2017",
    "text": "Food is always great, nothing wrong with that. This is the first time I had an extremely uncomfortable experience at the drive thru. The person \"Anastacia\" or whatever he called himself was very inappropriate with his comments & flirtation. The other employees made it even more uncomfortable with their loud laughing in the background. They just wanted to fuck with people last night. That person either needs to be professional or stop working the drive thru, period. I can't imagine the others uncomfortable/awkward experiences others must have had with this employee. Its all a big joke to the staff too. He probably always continues to make inappropriate comments to the customer as they drive away. Not professional at all. This is the only Canes (on Thomas) I've felt so uncomfortable at. I've been to many Canes & been served by males, females, people of both gay & straight orientation, of all races & I've never once was made to feel so Damn uncomfortable until Dec. 5th around closing time. Every Canes I go to I love. After last night, I don't want to go back to this location. Weird energy being put out there...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6aBWPI_P11nvuWrb9IJY5g"
  },
  "IcrAboL0egtRROXs5C0CTQ": {
    "date": "2/19/2016",
    "text": "Couldn't get my order right. Crinkle cut fries and a toast... Woman at the drive window was not friendly and didn't check to assure orders were correct.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_kPslP8mmmCHDFCMYCazvg"
  },
  "SbbedJW1MUrx4Fs20a270g": {
    "date": "8/3/2013",
    "text": "Good chicken. I love their sauce!  Fast and friednly service too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "PufQ0bMCOGdgyAnfnCdMxg"
  },
  "z0NZ9879R_x1klHed9ERDQ": {
    "date": "1/3/2015",
    "text": "This is the best sauce for chicken ever!  i wish they would sell it by the gallon!  Always polite staff, restaurant is always clean.  Did I mention that the sauce is the best ever?  Chicken is super tender!  Only thing that could make it better is if they delivered to my lazy A$$!  I heart you!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TWT_qVvaLdTljFKDW-XARQ"
  },
  "fr6DzkqcyQ4RKSgVSuX84w": {
    "date": "7/20/2012",
    "text": "\"Lowering Cane's expectations\" should be the name.  They have just set the bar low on food quality and taste.  No seasoning at all in the breading of the chicken fingers and the fries seem like they came straight from your grocer's freezer.  Must not have thought much of their dog if this is their tribute to him.  Just drove away disappointed.  Want my junk food to taste good if I'm going to splurge with this type of caloric intake.  Only positive was stellar Drive-Thru service and the place seemed pretty clean.  Don't waste your time.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "ucj0RT3ZsWHFXQssLq-wmQ"
  },
  "nhrCTRX9PqskwZbliZ0-kg": {
    "date": "4/5/2014",
    "text": "I've eaten here twice and both times I've been pleasantly surprised by how *good* it is. I'm not normally a fan of fast food, but their chicken tastes and looks like real chicken, as opposed to some other fast food restaurants. The chicken strips, fries, and Texas toast are all very yummy.   Their staff is also very friendly and fun. The last time we drove through, one of the staff members was changing the trash bag in a trash can in our sight. She waved at us with a big smile on her face and did a funny little dance, which brought a smile to my face!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WBLo_j89rT8SnQczEJOynA"
  },
  "TjttQTH6besUrwNpw9BoXg": {
    "date": "1/16/2015",
    "text": "Everything about my experience was pretty average. Got my order to go through the drive through. Staff was friendly and efficient. I don't like coleslaw so the previous Yelper's suggestion to sub toast for the slaw was a good one. The chicken strips were average, I didn't really like the fries (soggy and crinkle cut...a bad combination), but the dipping sauces were pretty good. I would probably return, but wouldn't go out of my way to do so.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QesDcfDUyN8rF_GWvWWNqg"
  },
  "a1PzoynHFsdPD-yqwZf5Rg": {
    "date": "1/3/2013",
    "text": "fresh chicken and the dipping sauce is awesome. sounds funny but they have the best ice for drinks",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QckpEGRRps6V2hixpoN73A",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. Caniac Meal",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QckpEGRRps6V2hixpoN73A/o.jpg"
      }
    ],
    "user_id": "SRK_sUnvRmMwfexoL_DLQA"
  },
  "ILiyKJPY7SUQhsEE4HRpmw": {
    "date": "12/17/2016",
    "text": "I usually come and get chicken about once or twice a week and in the beginning when I stated going I was the happiest guest but now I'm not! Last few time I have gone in (drive-thru) and I ask for my meal to be Xtra Crispy Crispy and it's not I don't like soggy chicken please make the orders correctly please and thank you",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xqXmdp0cOugMa3HB6yyF7Q"
  },
  "BBmA1jgUZtsJtUJP-EA-0g": {
    "date": "6/7/2012",
    "text": "Food is good, I am from the southern east coast and was looking for food I am used to having back home. I thought this would be like Zaxby's and I was right it sure is similar.   Only downfall to here is that they only offer the Canes Sauce, which is a Cajun based sauce and I am not big on Cajun, they should add some more sauces and then it would be perfect!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 3
    },
    "photos": [],
    "user_id": "zHsctw6wWpz-SoO0Tr03tg"
  },
  "ozzN5-7d7C4IEuvbK_WETw": {
    "date": "2/9/2015",
    "text": "I love raising canes the food is absolutely amazing. But this location sucks definitely the worst location in the valley. One day I ordered a chicken sandwich three extra chicken tenders and I like everything crispy, first of all the girl asked me six times if I want it crispy. Then it only took 23 minutes for me to get my food. If I wasn't in such a rush I would've snapped and asked to talk to the manager but I didn't have time. I know I want to my food extra crispy, but 23 minutes that's a bit excessive. Either no it's the most convenient location to my work and house I will still drive the extra 5 miles to go eat somewhere else.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "u35CZpDRC3Vj5qc6dOLJJg"
  },
  "OPXhwGcQlrFXULTDCwajPg": {
    "date": "6/16/2012",
    "text": "I never wanted to find myself on Thomas Rd. saying \"I'd like 3 fingers\", but that's how my night at Cane's began.... Over all, I can say my 3 finger experience wasn't as fulfilling as I'd hoped.  For being a place that \"specializes\" in chicken, I wasn't impressed. The special sauce was alright. They give you a piece of toast with your meal. Overall it just seemed greasy - not my style. I'd rather go get some chicken from Safeway.",
    "rating": 2,
    "rated": {
      "funny": 5,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "ira4RzqjC9shmZTJEk8ZAQ"
  },
  "FRqRJqye2l1v5bR50gL9nA": {
    "date": "12/17/2015",
    "text": "Best chicken tenders I've ever had and I love me some chicken tenders. A little pricey but chicken tenders aren't exactly cheap. You get your money's worth here. Good tenders with good sauce with good tea. The fries are okay the bread is good and the sla needs some adjustments in my opinion. But if you like tenders this is the place",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "I2QpDR1j0eQpNoJtRmNvxQ",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. To go",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/I2QpDR1j0eQpNoJtRmNvxQ/o.jpg"
      }
    ],
    "user_id": "KVnj1Rauw4XTzEP1Mx5YwQ"
  },
  "r8dcLqpw6lNGa5K-putnKg": {
    "date": "11/26/2016",
    "text": "Okay, so I normally LOVE Raising Cane's, and I normally love this chain. But last night, kind of ruined my opinion about it.  I never thought that I would ever write a negative review of this business, because I normally am always pleased with it. But the chicken fingers were bland, and the French fries  didn't really taste that good. My experience wasn't all that, but judging on my pat experiences, I couldn't give it one or two stars. But, sadly disappointed .",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a6NpQkqBFWms_Kvji2hxUQ"
  },
  "ar30OedqM-iruGGNkfQoQQ": {
    "date": "3/24/2016",
    "text": "I've done my research, had my awful experience and found that I am unfortunately not the first customer nor the last to experience in an incredibly awful wait time. This is fast food, and there is no, NO excuse for a 25 minute wait time in the DRIVE-THRU. Before I could even say anything, the employee said \"sorry for the wait! had to wait for fresh food\". If your fast food restaurant takes nearly half an hour to make fresh food for your customers, than I'll just go to a sit down place instead.The food is good, but not worth waiting that long for.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jliSEtGVqgrzG58wyCv59w"
  },
  "NeK01rS1gBX746Uc280IxQ": {
    "date": "10/12/2017",
    "text": "OMG! I wasn't happy with this joint at all.. I ordered my food and my daughters food we see one of the staff member who u front refilling the lemon aide behind the counter. The counter person took a lid to scrap of the foam off the top of the drink. She used a plastic soda top bare handed with no gloves. She scraped the foam off the scraped the lid inside of the garbage can then placed the same lid back into the lemon aide and repeated this procedure until she got enough foam off and place the cover back on lemon aide. She decided to play with foam with her co-work and throw some foam on the co-worker up front. The were chasing each other laughing and screaming. Another co-worker came from the back w/ no gloves pushing a full big trash can emptying the garbage from the front counter. A customer came in and she stopped and started attending to the customer up front... No washing of the hands or sanitizer nothing. I couldn't eat my food we ended up throwing away.. This is the second time observed no washing of hand's , touching emptying garbage and no gloves... I have reported the to the health board to come and observed...Raising cane is going to kill people due to their in sanitary practices...I will not go back until I see and up to date grade on this restaurant.....",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6lyXOQbaLPpKZgT76s3MQw"
  },
  "OpKx2VVxtGbyYIK61NJ5ww": {
    "date": "10/19/2012",
    "text": "very good chicken for a fast food place. juicy meat in the chicken fingers and it tastes awesome dipped in the Cane's dipping sauce. I like that you get big pieces of actual chicken. I did not like the coleslaw, but I'm not a fan of coleslaw in general. the sweet tea is great - not TOO sweet like at most places. the worst thing about my meal was the fries. they serve the crinkly cut fries like you used to get with your cafeteria meal in elementary school. no flavor at all to the fries.   I'd definitely eat here again, but if given the choice between here and Chick-fil-a, I'd rather eat at Chick-fil-a because they use more flavor in the breading on their chicken and their waffle-cut fries are MUCH bettter than the fries here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q6Dcxo3_lNCzkqK7J3FL7A"
  },
  "Pe-c9p07zknJb-nl95Z10A": {
    "date": "2/9/2015",
    "text": "The menu is extremely limited- chicken, toast and fries. I ordered the chicken strips deal through the drive thru and was very disappointed. The chicken was ok but the fries and toast were soggy as if they had been sitting out for quite some time. When I got to the window I asked for ranch, but they only serve their Cane's sauce? Why limit my options even more... Overall, I would not recommend this place to anyone.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-tQ3UVVdNBZBR_HOVFROzw"
  },
  "i-dmsCwsWtLxH4dm6V2QGQ": {
    "date": "6/28/2015",
    "text": "tl;dr: Consistency!!!! This is why CANES is amazing. I have tried 4 locations, and always find myself back here. This Phoenix store constantly delivers fresh and hot orders! The staff are jovial and it is not as busy as the ASU Canes.  Credibility: 100+ visits in my 5 years of living in the valley. My obsession with Canes started since they opened their Tempe store.   Less is More: The menu is obviously limited and this is beautiful. We don't need a clutter of choices and Canes makes life easier for us. Only question you should be asking is, \"do I want coleslaw or an extra piece of toast\" (standard comes with the slaw)  My standard order: The box, sub the slaw for toast, then inhale this order and regret not having more sauce.   Mostly Irrelevant fun fact: If you do the drive through route you will be graced by an awesome customized greeting!  PS: I still order chicken strips off the kids menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "63dS1FhFIDZ52dxl2U17QA"
  },
  "yYEEaoXguHrevDP0-kPBGQ": {
    "date": "10/11/2016",
    "text": "They need more then chicken and biscuits on the menu. It's good tho just gets old fast ya no. Make it more variety.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yzak7NrnM0IgsVVjQzSXlQ"
  },
  "TQNBF9b5HoCZ2CrjfYZcBQ": {
    "date": "9/16/2017",
    "text": "I dont get the obsession with this place. Its my 3rd time at 3 different location. The chicken is meh. Not bad not great kind of flavorless. The french fries remind me of Ore Rida fries I can make at home. Im not much of a Texas Toast fan but theirs is good but not worth the wait. The price is fair but I have had better.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JgB4foVCCsua8sVV5XlTvA"
  },
  "ZMX96xJ7uWibuOwF01YuZQ": {
    "date": "7/16/2014",
    "text": "I had a late night craving for chicken and searched for a restaurant.  This was my first time at this diner. Both the parking lot and restaurant's interior were very clean.  I didn't check out the bathrooms. I was disappointed that this place only sells chicken fingers, very few sides and NO desserts.  .  what few choices were left, were also pricey.  I ordered the sandwich for my daughter and 3 chicken finger combo for myself.  While the chicken tasted like \"real\" chicken, it lacked the seasoning I'm used to and had more breading than meat for me.  The cole slaw was kinda off, but the fries were on da money.    Nevertheless, I won't be eating here again, as I was looking for chicken pieces not tenders.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rQSs8LNP-A4F_OggJieTdw"
  },
  "1woFvA6QO2DF4N24nZgmqw": {
    "date": "2/21/2012",
    "text": "I liked this place so much I went two days in a row... :)  The staff was definitely friendly both visits. Saturday morning it was a little slower, but that just meant that I got extra attention from the staff.   The chicken was outstanding! And loved the Texas Toast that came with my order.   Welcome addition to our neighborhood. (I'm pretty sure my hubby goes through their Drive-Thru often.)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kcdPHrlbudyIiLnhTRxPwA",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. Disco ball&amp;#39;s in the house!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kcdPHrlbudyIiLnhTRxPwA/o.jpg"
      }
    ],
    "user_id": "igll2PdsMvQHzJhzttrx1A"
  },
  "YO8EV7qm7L5iSYqRx0T5iQ": {
    "date": "1/13/2015",
    "text": "It's tough to give a fast food chain 4 stars but this is by far my favorite. I just call it \"crack\"cause it addicting. I love the crispy outside of the chicken. The meat is definitely high quality. The sauce is perfect and the Side bread is incredibly tasty and incredibly unhealthy. Crinkle cut fries are perfect.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ADLy4M4lxkZrpOYipC0oEQ",
        "caption": "Photo of Raising Cane's - Phoenix, AZ, United States. 3 finger combo",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ADLy4M4lxkZrpOYipC0oEQ/o.jpg"
      }
    ],
    "user_id": "Z8VyYmW7ILy969V_5Ge5ew"
  },
  "UFYOJodM5oEvD3skY2kU3A": {
    "date": "11/24/2014",
    "text": "If you hate coleslaw.. you can sub it for an extra piece of toast. What what!!  Love this place and it is great for the days where you want to make easy decisions. Because there is literalyl 3 things on the menu. It is awesome!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y-aeqCKNf7RQvVBZw6oCkQ"
  },
  "cXUr09yeb-wDu2JtFePhXw": {
    "date": "8/18/2016",
    "text": "Fast service, very clean establishment, and great food. The 4 piece chicken basket was more than enough food for one person. You get chicken strips( super tasty), coleslaw, texas toast and a pile of fries. You can tell the food is made to order, it's hot and fresh. The dipping sauce is to die for. I even used it for my fries. Loved the sweet tea! Price was pretty decent too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I9IqqJYtRsamLZ8S_yewCA"
  },
  "ojViagSO-APDUds_x_ZS2Q": {
    "date": "8/8/2016",
    "text": "Canes is always good because of the sauce, but this particular establishment has consistently served cold french fries and lukewarm chicken fingers.  I may have even gotten food poisoning from this place (had pei wei on same day so it's hard to tell you).  Live next to ASU, but looks like I'll be eating at the other franchises.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pMSoGe-D4iiyeXeUstULxA"
  },
  "k8G8fOgwUYIVCFfDetLOLA": {
    "date": "7/18/2016",
    "text": "The food is really good good chicken but sometimes the leamade is too sweet. It's one of the best places. You should try it #1 chicken. It's really good. Coleslaw is sometimes hot. It's ok.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sw6pICh8uiYEHE2FXKUH8w"
  },
  "v0Z-nyf4gxoog2RYAI50gw": {
    "date": "4/29/2014",
    "text": "Very tasty place for a quick lunch that's hot and fresh.  They really only serve one main entree; chicken fingers.  They do that really well though.  They are tender, juicy, and the coating is light and crunchy.  The drive-through is efficient even when there's a long line.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jzkbhkRdjWPwTIOgRGggIg"
  },
  "R5rxvlGjyKsSFu6az7YPlw": {
    "date": "7/5/2014",
    "text": "Love this place! They have the most flavorful and juicy tenders anywhere!   They are also a very charitable organization and that is something I respect!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OIVny4cXC6IevrYkw5EmPw"
  },
  "F1UXXgHVnnTct5-ft2MPew": {
    "date": "7/5/2014",
    "text": "Returned to Canes for a quick lunch. Their menu is limited so if you don't want chicken tenders take your business elsewhere.  Their tenders are scrumptious and juicy. Their fries and Texas toast crisp. Their sweet tea is also so delicious. The place is clean and the staff always friendly. Being further away from canes is one of the main disadvantages of my recent move. Love this place!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8wgT6-ixwqmkX8EJWu8PBQ"
  },
  "8ZoD32SndrJE-GDGZYd_jA": {
    "date": "6/22/2016",
    "text": "I'm upgrading my review to 4 stars.  I continue to eat here once or twice a week and the problem I outlined below hasn't repeated.  They provide fine service.  My previous review from 2/8 was for 5 stars, but I'm upgrading it to 2 stars.  I've been eating at this Raising Cane's about twice a week.  What I've noticed is that serving portions can vary greatly.  On one day the 3 chicken strips on my sandwich can be huge and the next day (like yesterday), the 3 chicken strips are minuscule.  The quantity of french fries can also vary significantly with the quantity being a very large amount of 1/3 of that amount.  And on Monday, they got me to sign up for the Caniac's Club with a card to be swiped each visit.  Then I go to their webpage to register and discover that there are no rewards based on number of visits.  It's just a scam to get my email address so they can send me advertisements.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0R4juIjFh3TFiWDCanGY9w"
  }
}