{
  "OKKSOWW6LJngI4ZMM8IuIg": {
    "date": "9/30/2017",
    "text": "Rehab is great. If you love burgers and don't mind taking an adventurous approach to your cuisine, then this is the place for you. From traditional burgers to burgers with two maple donuts as buns, this place has it all. Expect lots of options here, a fun environment, and a busy dining rooms, since it's on Mill Ave. There is a pretty generous happy hour with both drinks and food on the menu, so start your night out right and stop in at Rehab for a good dinner before a night of drinking!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UDEEnVEvJo19ikMgqxrfZg",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UDEEnVEvJo19ikMgqxrfZg/o.jpg"
      }
    ],
    "user_id": "6pVUFARmV4JDxM_l4X5xcQ"
  },
  "wEvE_RCpjCLD6_cKNkE8lg": {
    "date": "4/30/2017",
    "text": "So much food! Service was great food was great! No wait for a table! Try Mike Tai! Won't disappoint.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ERRCMJPFOq-Hnd9hthHAMQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. What chili cheese fries?",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ERRCMJPFOq-Hnd9hthHAMQ/o.jpg"
      },
      {
        "img_id": "5Kv8bU2erQsCt1b2M_cEsA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Shrooms anyone?",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5Kv8bU2erQsCt1b2M_cEsA/o.jpg"
      },
      {
        "img_id": "3GgY0_UklstkseZ2ZsPDGA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Yummm",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3GgY0_UklstkseZ2ZsPDGA/o.jpg"
      }
    ],
    "user_id": "5Ua8cbAtg5wVDi5wtNsP8A"
  },
  "FYdyZcOlOoJXpNpjRF5mXw": {
    "date": "9/25/2017",
    "text": "Holy Cow this place is Phenomenal! Great Food, Service, Drinks, Atmosphere, Music...Great place to watch Football on a Monday Night! Definitely would recommend to anyone!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HkWflUKLGbN8hkY_XUFDVw",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Holy Cow this place is Phenomenal!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HkWflUKLGbN8hkY_XUFDVw/o.jpg"
      },
      {
        "img_id": "Y-H-QaxvtBXKjQSn_xOLIw",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Holy Cow this place is Phenomenal!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Y-H-QaxvtBXKjQSn_xOLIw/o.jpg"
      }
    ],
    "user_id": "2zMYkSwy4ruXp2mRvh69Mw"
  },
  "TwVuh4ng3nmzFkMHCnedZQ": {
    "date": "3/22/2018",
    "text": "Came here on a Thursday at noon and the 3 of us were seated right away. 2 of us shared the PBJ and bacon burger with sweet potato tater tots!! It was soooo good. We all shared the pot brownie for dessert, also very good. I definitely recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AeDms5gp8VAoB9YsaS_uow"
  },
  "TCC2O8nTKeG_qC3RAM8PYw": {
    "date": "3/30/2017",
    "text": "This is one of my favorite places to grab lunch!   My boyfriend and I always start out with a basket of fries (half regular, half sweet potato). It's great because it comes with sauces - I think you get to choose three - and the fries are always so crispy and delicious. Sometimes we come JUST for the fries.   If you're feeling adventurous, try the mac n'cheese burger. It's cheesy and messy and might give you a heart attack on your way home (they don't call it Rehab for nothing), but it's soooo good.  Another thing I love is their Gluten Free buns - they don't crumble or fall apart while you're eating your burger, which can be hard to find.   The burgers are really rich in flavor, so I tend to split one with friends. It's usually really busy, but if there's a wait, it's worth your time! Parking isn't the best, but there's a lot nearby that you can park in and just walk over.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "abDVSuOm3n3UrH-jtV3oNA"
  },
  "UC1txexC9lPQ1UNqfzkCLg": {
    "date": "5/12/2018",
    "text": "I've come to this location over a dozen times. It truthfully depends on where you sit I've noticed on how well or how terrible your service is. I've had one gentleman that is amazing every time I've gotten him. Every other waiter has been ok to horrible. The food however? Amazing. This is my second worst experience I've had at this location. Today I came in, after waiting over 10 minutes for someone to ask for our order, we asked a random waitress & inquired about the weekend special burger. The waitress had no idea there was even a special burger today. The worst part was when she asked who our original waiter was, she didn't know, turns around & simply blurts out \"what do you want?\" I'm not a waiter or waitress but the tone of voice which this was said in, atrocious to say the least. I drive all the way from Laveen to come eat here the times I do. This may very well be my last. Even with the food being as amazing as it is.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "z_8myaZ99Pi36I4JaXvHyA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/z_8myaZ99Pi36I4JaXvHyA/o.jpg"
      }
    ],
    "user_id": "qB-r_iEYEn0EIWpasYQEIA"
  },
  "rYYw-3Fee81EnR68Rg434w": {
    "date": "10/20/2017",
    "text": "This place rocked my palate. This I had the Philly burger. It was one of the best burgers I've tasted in my entire life. I don't like sweet potatoes but I saw every table in the entire restaurant had them so I went for the sweet potato tots. Epic. Highly recommended.  Eat here at least once.  I will definitely be back for more!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CvHqucNTeqPfLWVY2uw2YA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Philly burger",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CvHqucNTeqPfLWVY2uw2YA/o.jpg"
      }
    ],
    "user_id": "g_BnvYIR-mOhCsKS_vXGZw"
  },
  "YqXsSRooor2e8j4lPdIk9g": {
    "date": "6/11/2017",
    "text": "The food and drinks are exceptional. The chicken wings medium hotness were perfectly prepared and delicious. We ordered 5 different burgers all outstanding the French fries are addicting, the beef is fresh and was cooked as ordered.  If visiting the Phoenix area this is the place not to miss",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hqcx_DXaNv8iwSIkWKnZaw",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hqcx_DXaNv8iwSIkWKnZaw/o.jpg"
      }
    ],
    "user_id": "nE9k_lp5SBjjq6sJsVMmOA"
  },
  "0tcM613xk9hoL9-F2ZHdSg": {
    "date": "2/12/2018",
    "text": "NOT your average burger joint... Great burgers when you want something different!  ALSO... impressed that management called the police when a Ferrari was blocking the handicap spots!!!!  LOVE IT!!! THANK YOU!!!  FYI--- Peanut Butter / Bacon / Cheeseburger... Just DO IT and thank me later!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bqu43n3pcNW0scbPMmCDyQ"
  },
  "W_WNYcmRSTiSjlFZFKjCew": {
    "date": "9/9/2018",
    "text": "Great service and ambiance set the tone when walking in. We had incredible service from, Jet!! In conversation, we explained to him we had heard so much about this establishment and really did not want to be dissapointed because it was hyped up so much. He took that as a challenge to make us understand and appreciate the hype! Jet guided us with great recommendations, told us what sauces to pair with the frys or tater tots and burgers, brought an extra sauce out for us to try and they were all great. We ordered the jalapeno popper burger, pulled pork sandwhich and Nelson con verde pollo, appetizer.....it was all delicious! The hamburger buns make such a difference on a good burger or even pulled pork sandwhich, this place is spot on! Glad we tried it and we will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "665fOt6tQ3N1PppLEFkRhw"
  },
  "Ay0-zOx6KDb1grz1GULVYA": {
    "date": "9/9/2018",
    "text": "Was not impressed. My burger was burnt to a crisp: and I normally would have sent it back but I had already waited close to a half hour (and I was dining alone). It really is a shame because I love the concept. I was looking forward to coming back and trying other things on the menu and the service was great.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9i8CXe9JL_Ad8oat85XJFw"
  },
  "nkf0PvruKD3LR_zG0Xd7Nw": {
    "date": "3/11/2018",
    "text": "I don't know how this place isn't rated higher! The burgers are amazing and the staff is always friendly. The sweet potato tater tots are my favorite things on the menu. Its a causal place with good burgers and the first place I take people from out of town to. The burgers are really big! I usually can't finish the smaller one!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7iRENe7SRoQ4PJ6wvseM4w"
  },
  "kC8d2NDrMpTEMLSFmvYz3Q": {
    "date": "7/22/2017",
    "text": "Good vibes all around at Rehab! I loved the atmosphere of the beach bar, decorations were spot on. The service was ok. Our waitress was decent - she kept the drinks full and always asked how we were doing when she walked by. She seemed a tad stressed, but rightfully so as she was also helping a table of around 20 people. I was craving mac and cheese, and decided to go for it on the mac and cheese burger. DELICIOUS! The fries, burger - everything! Definitely planning to come back and experience the food again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "w3b8h9v7Vehk_txkXEv5XA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Mac and cheese burger in a pretzel bun, served with skin on fries ! I got the chipotle ranch to dip them in - scrumptious!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/w3b8h9v7Vehk_txkXEv5XA/o.jpg"
      }
    ],
    "user_id": "3BZEHUxa1TRR2nx6nGVrrA"
  },
  "7e2yn2WXNZzIg8HUiizO7Q": {
    "date": "4/27/2017",
    "text": "Stopped in to check the place out. We ordered a dozen wings with the golden sauce and a couple of burgers. Our waitress couldn't have been nicer! I don't know what subdivision of heaven that golden sauce came from, but holy crap it was good! The wings were perfectly cooked, not too dry. We were jet lagged and groggy so we ended up boxing up the food to take back with us. The burgers are huge! We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aP9yWltgFwaztwiIozLtTQ"
  },
  "8JMcek3mBrgaqVwkwVHwhA": {
    "date": "2/25/2018",
    "text": "This place is amazing! Awesome food for reasonable prices! Staff was very friendly, we will definitely be back!   Very unique burger choices, their sweat potato tots are the best! This restaurant does not disappoint.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aE77T56rreeq138E5_6FAQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/aE77T56rreeq138E5_6FAQ/o.jpg"
      },
      {
        "img_id": "RqjpnznCYxNP3WX0ObMc7w",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RqjpnznCYxNP3WX0ObMc7w/o.jpg"
      },
      {
        "img_id": "GAFv1EZELHxhy-TlbQrPtw",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GAFv1EZELHxhy-TlbQrPtw/o.jpg"
      }
    ],
    "user_id": "k4i7400ZtQQB9VoOSAJK6g"
  },
  "bgonKGjOl7mfXx_-EtCQ5Q": {
    "date": "2/24/2018",
    "text": "Love the vibe and the staff is really friendly and seem to love their job. The burger was awesome. I had the poblano burger and hubby had the blue burger and both were perfectly cooked. Ian was our bartender and we will definitely go back to enjoy his  jokes and attentive service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lDWjzdekJdxrXxmGi33Exw"
  },
  "REsTVD8Gbr_nP-iieWMgig": {
    "date": "2/18/2018",
    "text": "While the service was fine, the mushroom Swiss burger was completely overcooked and under seasoned. They also initially gave me the wrong order but as much as I tried to overlook it, the burger was just bland, dry, and grey.  I wanted to like this place but the food was just terrible. I can only stomach a few bites before I called it quits.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8BG53i1RRElz4ESVccfpiQ"
  },
  "O1TSsFuwnqS2FNZ1NA3x4g": {
    "date": "4/12/2017",
    "text": "We decided to go to the tempe location because the last time we went to Scottsdale the wait was very long. We went on a Saturday night and it wasn't that busy, we didn't have to wait at all. I gave it 4 stars because our waitress was rude. The chili frito pie is so delicious. Im not really a burger person but the burgers were good but could of use more seasoning. Nice atmosphere and very busy area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VXuiWE8KVis1simqGwwaow",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VXuiWE8KVis1simqGwwaow/o.jpg"
      },
      {
        "img_id": "q3lxJ7xKZv9R7K8SVt_ZYQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Chilli cheese frito",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/q3lxJ7xKZv9R7K8SVt_ZYQ/o.jpg"
      },
      {
        "img_id": "6Bi2U-ahHV4QYP57KjfPYw",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Chili cheese fritos",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6Bi2U-ahHV4QYP57KjfPYw/o.jpg"
      }
    ],
    "user_id": "9SXy2gvJkTAB9_tLQM-4bQ"
  },
  "HbqJWoZJgdBmtBdZMmGQ1w": {
    "date": "2/8/2017",
    "text": "Went here at noon on Wednesday with a party of 9 people. I ordered hangover burger 10 oz, pretzel bun, with onion ring  The good -server is friendly -onion ring is very good  -hangover burger is pretty good even though the food not so warm on my first bite -restroom has real towel  The bad -food took literally an hour to come out even though place not so packed -ordered medium rare, came out medium",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FzLQIkP-hC3ijcafQp-OHA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FzLQIkP-hC3ijcafQp-OHA/o.jpg"
      }
    ],
    "user_id": "25x2k-mkRHMn9RYdksMC2A"
  },
  "j91BkQJwxQjnv7A0-pPIJQ": {
    "date": "1/16/2018",
    "text": "Super fun atmosphere! We chose inside dining and had a group of six. We ordered a couple of appetizers - onion rings and the chicken verde dip (don't remember exactly what it was called) and both were good. Everyone had burgers and all were great. Portion sizes are BIG. We went at happy hour so had drinks as well. It's a college town and it's a bar so it was loud. We didn't find it an issue and enjoyed our meal and company.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FIIfIeFTCUwEBHLNEJT9_g"
  },
  "aN_Fa3B1Ls-z5Aw6D9JT4A": {
    "date": "12/3/2017",
    "text": "Burgers Galore!  Very large portions and jumbo burgers.  I purchased my 1st ever PB&J burger here, and it was delicious. If you like a more traditional burger you might not like how sweet the peanut butter is. Burger was juicy and bacon was thick. The Arts festival was going on, so walking 2 mins off Mill Ave was easy.  The Beach theme is cool, and staff Friendly.   Definitely worth a visit.  $13 for the larger 10pz Burger Option. Came with sweet potato tots, and large H2O.   Cheers",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hjdAzxZXJahjLKdNQ-w67A",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Philly Steak Salad. Large and fresh.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hjdAzxZXJahjLKdNQ-w67A/o.jpg"
      },
      {
        "img_id": "GJQF5ptafKlxNclhv1VnMQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GJQF5ptafKlxNclhv1VnMQ/o.jpg"
      },
      {
        "img_id": "T-9mDtXlMDOfeaDQQqCrJg",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Lots of sweet potato tots. Very good.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/T-9mDtXlMDOfeaDQQqCrJg/o.jpg"
      }
    ],
    "user_id": "LRJxhNI0rJabWo9r9Y27XA"
  },
  "4zvmUEVTsGWY82qjzndr6g": {
    "date": "10/4/2017",
    "text": "Rehab burger is my favourite burger joint in the Valley. My first visit was at the Scottsdale location and I was so excited to see signs for this place opening. I waited and waited... but still no burgers. Finally, months after they started construction, they were open!!! I was thrilled. I had high expectations and they've been met with every visit.  First the Food: Every burger provides mouthfuls of flavour and happiness. My favourite is the PB+J+Sriracha burger. It's messy, but it is AMAZING. I could eat this everyday. But... I probably shouldn't. Right? Also high on my least: the mac and cheese burger, the Hawaiian burger, and the poppers burger. All so good.   There are two sizes. If you're into sharing, get the bigger burger and split it. It'll be more than enough food.   Pretzel buns are the way to go. Dense and chewy, and oh so delicious.   Also, sweet potato tots? Just say yes. Unless you like normal potatoes. They're good too.  Service: they're dressed in Hawaiian shirts. These guys are chill.   Come and get a burger, you won't regret it.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "3wGKzmEhXswRZikVVUO5fg"
  },
  "rj9C8lj8C8MaA2JFXoq9QA": {
    "date": "2/17/2019",
    "text": "This is probably the worst place I've been to. They don't have ingredients to make what they have on their menu. The servers aren't friendly. The food takes forever to come out. I don't recommend and will not be coming here again. Over priced for what they deliver.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RNsfcvpY3nn9Xv3YNm1dMQ"
  },
  "N1R4T3nlmF64QzBJUdkwNg": {
    "date": "11/19/2017",
    "text": "Awesome place for burgers in Tempe!  I've been to the Rehab burger in Scottsdale, and this one in Tempe does not disappoint as well! In fact, it's a lot more spacious than the original.  We ordered a couple of burgers and I also got the signature spicy Mac n cheese! Everything was phenomenal!!!! The service was great!  If there is one thing I urge you to try it's the spicy Mac and cheese. The flavor of it is amazing, and it's actually not that spicy! I would highly recommend going here again!   Tips: 1) get the sweet potato tater tots, they're the best!  2) parking here is scarce since it's on Mill, you may need to find a spot anywhere and just walk here 3) get the spicy Mac n cheese, it's sooo good! If you get the \"rehab\" size, it's definitely easily shared with 5-6 people",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Q_4q3rxsu939T46VWJaKCg",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Q_4q3rxsu939T46VWJaKCg/o.jpg"
      },
      {
        "img_id": "QH0SBXubny-l9OYy4tjWLQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QH0SBXubny-l9OYy4tjWLQ/o.jpg"
      },
      {
        "img_id": "DP4kWqtDSa3zKnCNiY0_qw",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DP4kWqtDSa3zKnCNiY0_qw/o.jpg"
      }
    ],
    "user_id": "t1HdYXIzIuooNDXC09iiBA"
  },
  "pH8Yn5H4bVtNddop-FiAmQ": {
    "date": "10/28/2017",
    "text": "Good atmosphere. Excellent food. Good service. Thanks waitress Cassidy!! Definitely would suggest to a friend or even a stranger!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lWWCSHnt6fW0UENl3mnFgA"
  },
  "rECOo6LLwYUirfeaDTPuJQ": {
    "date": "3/25/2018",
    "text": "I'm really disappointed because I've heard this place be hyped up so many times. I'm sure a good experience can be had here, but we did not have one.   We got to the restaurant around 8 on a weekday, a little close to closing for me, but it wasn't busy & they took us. We sat & it took about 5ish minutes for someone to come over & take our drink order which is pretty average for me. We took until our server brought the drinks back to order because we were a little indecisive. After we ordered (Know Poblano Burger & Veggie Noogie), the wait began. In total wait time, we sat for close to 55 minutes waiting on our food. The average wait time is usually 23 minutes (and my fiance being in the business knows places usually push for that). About 40 minutes in, we asked how much longer the food would be (let me say in a really nice tone) and the server just told us when it's ready. I really wanted to leave & just go to Whataburger, but I was trying not to be a jerk. Our drinks didn't get refilled until we had our food on the table. The food wasn't the worst, but I wasn't impressed. The wait time had already created a lackluster experience. The fries were cold on both of our plates, the eggplant on my sandwich was so tough I just ended up removing it, but his burger was fine.   I don't think I would ever return as a sit down customer, maybe takeout, but that's pretty out of the way for us, so I don't see us driving out there to come home with cold food (especially since we could've gotten cold food there).",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fsyVPNDN20YLq4d62BD78Q"
  },
  "gxhhLvkgT9JdEF27_7sUeQ": {
    "date": "2/2/2019",
    "text": "Let me tell you, I have been to Rehab Burger Therapy multiple times now and I have yet to be disappointed. Everything tastes so fresh and delicious and everyone is so friendly and down to earth. We have been served by Madelyn today and she was very friendly and an amazing server. A few days ago, I was served my Keara and she was also very friendly and amazing. Overall, you can tell everything is fresh and the servers are awesome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZkIwEIVHmNPg6YEtJQJ3fg"
  },
  "SmqUK6wv1cRwaB_7-JQ5wQ": {
    "date": "12/22/2018",
    "text": "Horrible service, we come here in my husbands birthday, we wait for one hour, we decided to take the food to go because we have other plans, we pay for 2 hamburgers and appetizers 40 dlls + tip and in top of that are food was just trash, canned mushrooms in my hamburgers are you f#%* and frozen fries. DONT EVER GO THERE.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ScImrX1vh8FjNG-7lmA_IQ"
  },
  "qAg25EGlkjI0cufaAlSsbg": {
    "date": "7/25/2018",
    "text": "Finally got to experience this establishment. My bf loved his hangover burger. I ordered the spicy Mac and cheese with chicken and it was just ok. It was dry and not that spicy.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MifbA9edmUQKKZm-4T5SmQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. The spicy Mac and cheese was dry and not that spicy. I prefer Mac and cheese much more cheesier.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MifbA9edmUQKKZm-4T5SmQ/o.jpg"
      }
    ],
    "user_id": "qdzw0ECC-cpPZMrI6yrQUg"
  },
  "f4ILWL7mm2Wl8biJDefR6g": {
    "date": "8/16/2017",
    "text": "I was craving a burger--a REAL burger--and Rehab was everything I wanted and more. It is truly rare to have one's expectations met so well!  Every menu item looks great, but I needed something spicy, so I went with the Know Poblano burger, with manchego cheese, actual, actually grilled poblano peppers, and sauteed onions. Because this wasn't enough spice for me, and I felt brave, I went with the beef chorizo patty.   It was everything I wanted and more.  The chorizo itself was surprisingly lean without being dry. It was basically a burger loaded--LOADED with spice. Like, it only burned my tongue a little bit, but the whole thing was so full of seasoning that the steam would make my eyes water every time I lifted it to take a bite. That's not a complaint, that's freaking amazing. On the side were *perfect* fries seasoned with garlic salt, as well as some sriracha aioli.   I washed it down with a large margarita, which was discounted thanks to Thursday's all-day happy hour. It was definitely not weak, and for sure not too sweet. Spectacular, just like everything else.   If you're not into (red) meat, there are legit fish tacos (I tried a bite! They're good enough!), as well as veggie burgers.   So there. You have no excuses to avoid this amazing, amazing restaurant. Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 7,
      "cool": 6
    },
    "photos": [],
    "user_id": "YpGt3hdq5adPlEFn9fQ2Zw"
  },
  "jlh19OtC2akBC1_zNWXfdQ": {
    "date": "4/19/2018",
    "text": "Rehab Burger Therapy is fun.  The atmosphere is very bright and friendly and you feel good as soon as you walk in.  The service is quick as well.  The food is great.  I had the hangover burger and it was fantastic.  The food is in no short supply either, as I was unable to finish my meal.  Prices are appropriate for what you get.  It's not a steal, but it's not overpriced either.  Overall, very happy with my experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_-Qler8ebFL040wQAIUGPA"
  },
  "Hfdrd1utAZBPvV6hnDA6Cg": {
    "date": "4/6/2019",
    "text": "Burger was great! My family really enjoyed the meal on our last day of vacation. Drinks were great too! I had the strawberry margarita. The waitress was also really nice!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AoHBce7RSwikLyFdX2ybww"
  },
  "yoEpL6zGO4rJXu5IMtC_KA": {
    "date": "11/4/2018",
    "text": "My boyfriend and I dined here for lunch after several friends recommended the place to us, so we had very high expectations. The menu was very extensive and nearly overwhelming, and our waitress had come by twice to take our order but I wasn't ready yet, so I felt a bit rushed and quickly chose the PB&J and bacon burger.  However upon biting into the burger, I realized there was something very important I had missed in the item description - the burger has quite a significant amount of sriracha sauce on it. I have no tolerance for spicy food whatsoever, so after that one bite I asked if I could get another one and the waitress happily obliged. Now, I fully understand that was my fault for not reading the full description before ordering, and while I think it's rather silly to put sriracha on a burger with peanut butter and jelly to begin with and makes a rather terrible combination, still my bad.  So the waitress brought out a new burger minus the sriracha and it was good, my boyfriend enjoyed his burger, and all was well.... until we got the bill. They'd charged us for TWO of the PB&J burgers, which was each about $11. Also keep in mind the waitress took the first burger as soon as I reordered, so it's not even like we got to keep it - we had to pay an extra $11 for one bite of a burger I couldn't eat. If we'd known we'd be charged for both, which the waitress neglected to inform us of, then we would've kept the first one and my boyfriend would've had it later or something since he's fine with spicy food. Anyone who has worked in a restaurant before knows that if a customer dislikes a meal and needs it fixed or redone, the decent thing to do is to take the first one off their bill. I've had years of experience in customer service, both as an employee and a customer, and this is a very basic practice. But if Rehab Burger Therapy is going to be that money-hungry then we won't be coming back, and many of our friends who initially recommended this place were appalled as well and have also been scared off.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VDxRKHYRLGHqN78L3N5CbA"
  },
  "tiKaIB6ZcVUvWni2GcZeaw": {
    "date": "5/4/2018",
    "text": "Great food. The chicken wings were good. Loved the hangover burger with a fired egg, bacon, and a hatch chile. The sweet potato tots were good as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6OJq1a92tEMlXQgKd4d19g",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. The hangover burger was great. The chicken wings was good too. Love the sweet potato tots. Would totally come back when I&amp;#39;m in town.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6OJq1a92tEMlXQgKd4d19g/o.jpg"
      }
    ],
    "user_id": "KFu-on2axg71jHdvbTJTjQ"
  },
  "y8g1wcDwNjEYXA2DBtNkxg": {
    "date": "7/28/2017",
    "text": "Great burger, I had the Philly Cheesesteak burger. The 5 oz is PLENTY! My buddy had the PB & J burger and the sweet potato tater-tots! He said next time he would go with regular fries because the jelly and the sweet tots were too sweet",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eEaeKO0WPAGFsSH9UIKg3g",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eEaeKO0WPAGFsSH9UIKg3g/o.jpg"
      },
      {
        "img_id": "D4roI0vgOau8q6dOtjBBTQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/D4roI0vgOau8q6dOtjBBTQ/o.jpg"
      },
      {
        "img_id": "q9L-XAPrvlJDlM7uanXi_A",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/q9L-XAPrvlJDlM7uanXi_A/o.jpg"
      }
    ],
    "user_id": "Y7TkmCUargQBQtuFfh8koA"
  },
  "VCaKKGu85AwKNyFHD8gI7A": {
    "date": "3/17/2018",
    "text": "Hair in my fries...and the burger was just okay. I've been here a few times and enjoyed it but now I think I'm going to pass. Not a fan.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4I4KA-ft8RgALk1Y5XIquQ"
  },
  "sh7KDAUmcjkOm7zgQxhcGg": {
    "date": "10/7/2018",
    "text": "This is the first time I have ever been to this location but I will not be back. There are so many choices in the area that it won't be hard to find something better.  The food was okay. We got the green chili chicken dip and wings. The dip was salty but the wings were a good size. My 2 stars comes from my server Madelyn. My boyfriend and I got our dip first and then our wings a few minutes later. Within about five minutes of us getting our order Madelyn dropped off our check and said she'd take it when we were ready. We had barely touched our food and my boyfriend had only drank 3/4 of his beer. He had planned on getting another beer but Madelyn made it clear she was done taking care of us. If she had told me that it was the end of her shift and she wanted to go home I would have respected that and tabbed out. Instead she made us feel awkward about not finishing our meals and paying her faster. I've worked in the service industry for 20 years and it's been a long time since I've felt this unappreciated as a guest.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hnA40rrnkMlrbffLc2-_Eg"
  },
  "MiweF2p6W4cCkmrEO-fmRQ": {
    "date": "3/28/2019",
    "text": "Best burgers in town in my opinion! I've had it a few times now and am never disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WMGH-dhD8626mHro4HY0jw"
  },
  "sljHYR5fqTEH8AP6Q9SE_w": {
    "date": "4/4/2019",
    "text": "Not impressed.  The burgers were terrible pretty sure they were Costco patties.  Is everyone drunk when they eat here?  The service was terrible and we sent burgers back once but second round was bad also.  The meat did not taste fresh.  I so wanted to love thr pb&j but big fail.  I think the one in Scottsdale is different owner.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_RW6nwvdgMVPJZGkJHR9AA"
  },
  "tkZhv_2IbWPdlBUZ09LAbA": {
    "date": "12/12/2018",
    "text": "Very fine food. I've had several different burgers off the menu including the Spicy Mac-and-cheese burger, peanut butter and jelly burger, and the jalapeno popper burger. All are very good. And servers have always been excellent and very nice. Only reason I'm giving 4 stars instead of five is as follows: very limited draft beer selection, I like to go through the week when it's slower as it is in dead center of a college town and can be crazy on the weekend. So even being slow during the week the service can be somewhat slow at times. Through it all, very fine place to eat.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RSaWUgF6FhlYkB47G6xmsA"
  },
  "5dN6rszkvisb8S4_zjjJXw": {
    "date": "6/17/2017",
    "text": "Great burgers, sides, and staff. Went here for lunch with my family today and we will be going back for sure. This is a family friendly restaurant with reasonably priced foods. I had the PBJ and bacon burger and it tasted exactly how I imagined. A+",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2tAr715owvX0GM3yLhjd6A"
  },
  "CvNTEcm-DE3PJZOuWWotbw": {
    "date": "4/7/2017",
    "text": "My family loved this place!  Cade was an excellent waiter, and we had a great time.  The dessert was fabulous, and the burgers were awesome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "32WkkqcgSWEL3xftgQnq3g"
  },
  "wGmAiwhUSYeqQZLowtsfiQ": {
    "date": "5/24/2017",
    "text": "Fantastic burgers and service. The wait is usually a little long but for great food that's understandable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Is0fYlmNEhvQOVi0Do-xw"
  },
  "ru13eSo03logPvB1DlJQEQ": {
    "date": "8/2/2017",
    "text": "I stumbled upon this place through yelp and I'm glad I did. Great service, the bartender recommended the PBJ&Bacon burger on pretzel bun, amazing! Definitely coming back next time I'm in town!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Bsj44Z5QGYXUgRsO5fGcw"
  },
  "PP29vy7AmKhoF7FWk-34iw": {
    "date": "6/8/2017",
    "text": "A good burger but not great. Lousy lemonade didn't care for the fries. Colleague sent her burger it was way over cooked. They did offer to replace it it and took off the bill but not a place I'd visit agains.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GbPXnuMsGzWVgzeVit4RJg"
  },
  "li_OvC_tkNKP-Bjy_kd8_A": {
    "date": "3/22/2017",
    "text": "One of the best burgers I've ever had!  Being very partial to the burgers, I sometimes forget all of the many other options available to order. They have appetizers, 7 different Salads for entrees, wings, Pastas (The Mac & Cheese is AMAZING!) and then...2 1/2 pages of delicious hamburgers!!  They have 2 sizes of hamburgers.  The \"Rehab\" is 10 oz of ground beef and the \"Relapse\" burger is 5 oz of ground beef - the absolute perfect size for ladies. My faves...\"Mushroom and Swiss burger\" and the \"Spicy Mac and Cheese burger\".  They also have a Veggie burger, Turkey burger, and multiple sandwiches.  The restaurant itself is a very laid back vibe. There is seating inside and outside and these beautiful Spring nights make sitting outside an even better experience. Wait staff are very friendly and seem to appear when you need them, yet don't hover at your table. All in all...GO! Go eat one of the best burgers in town. You'll be glad you did!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l7TdwCsoR0llG_kkcbGbvw"
  },
  "iix1e6ChzTMAQjuVGfNImA": {
    "date": "3/20/2017",
    "text": "Just ate at the Tempe location for the first time. The food was killer, the ambience was chill, and the service was top notch.  Our server Dominic was excellent...his recommendations were on point and he was super attentive.  We brought our 2 year old daughter, and although they didn't have a kid's menu, Dominic suggested several menu items that would be appropriate for a toddler. The portions are huge...some people in our party ordered the 10oz burger when the 5oz burger would have sufficed. Other than being too full, we have no complaints.  We will most definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ltVz2zo6TxXiGsTI99fkAQ"
  },
  "uB850n5xV8SugPGw7MgJKQ": {
    "date": "3/14/2017",
    "text": "Nice place in Tempe just off the beaten path of mill ave. Burgers are good and staff is friendly. Walked in 15 min before kitchen closed and still got great service and a fast turn around on my order. Not a lot of the college crowd so you can actually hear yourself think",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xXMTrfUViqcl8pBhEeplgQ"
  },
  "LGBxyKZ3XXu6PcncKbOSHg": {
    "date": "2/28/2017",
    "text": "Hi had a terrible experience dining at this location.  We ordered bloody mary's and the spicy one was not spicy, the horseradish one contained little if any horseradish, the mixer was watered down and the pour was light.  When we ordered a double for round two the waitress spilt most of the booze on the floor.  The chili cheese fries....  huge portion of not delicious.  Canned cheese product, kidney beans, and marinara sauce.  We nibbled on these for 30 minutes waiting on our burgers while they severed the rest of the restaurant.  By the time our main course arrived, we were so unhappy they comped our meal and we left.  My hamburger was raw.  I did not eat it, but I shudder to think what would have happened to me if I did.  Beware the coleslaw.  We took one bite and decided there was something sketchy about it.  We had been looking forward to trying this place for months and it was the worst dining experience of my life.  We only went here because the wait in Scottsdale was an hour plus.  There's a reason.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MF3qtTzz2IMS7PFX0ovrRQ"
  },
  "cmjzK-Ns0WfNkjLODlC7FQ": {
    "date": "2/11/2017",
    "text": "Heavy burgers.  Not the best if you want something healthyish.  Probably 800 calories per burger",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l86odRaUXzvaDFvO6WH7jQ"
  },
  "unZVrTzRsTCtXUahnipsXg": {
    "date": "1/23/2017",
    "text": "I've been to the one in Scottsdale and had a pretty good experience, so decided to try this location as it's closer. Burgers and sides are great! Service was pretty awful. I think our server was new as he kept forgetting things and the tables around us seemed to be thinking the same thing. Besides the sub-par service, I was really looking forward to trying the pot brownie dessert and it looks and sounds delicious. It was very disappointing. The brownie tasted like something you'd buy frozen and microwave :/ I wouldn't say that I will never go here again, but don't see myself going out of my way. Definitely worth a visit for some good burgers if you've never been!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jj-MkNlBeTgug5MS8JIIWg"
  },
  "lkIZqsbEdRtuFl8M78SO5Q": {
    "date": "3/16/2017",
    "text": "Had lunch on Wednesday- not crowded at all. Service was very slow..25 minutes for food to arrive. I had the Tony Montana, it tasted good but was very dry. Sweet potato tots are excellent",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iJascb-jH-QNU02eWKiNFA"
  },
  "o0s6h3DXXQU8bkRZfmE6kQ": {
    "date": "2/23/2017",
    "text": "I've been to the location in Scottsdale and finally made it out to the Tempe location off Mill Ave. This is absolutely my all time favorite burger place. From the fries and sweet po\"TOT\"oes to the BLT's and AMAZING burgers, great beer selection, plus the extremely friendly staff at both locations...this place is the #1 burger spot. I still cannot believe my favorite burger that I now always order is the PB&J Bacon burger...yes, I thought it would have been gross...now I can't NOT order it! Try it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3oBurnPMXOuaSy6-RYHAZQ"
  },
  "ygleLheCnY5dwr32vFDgMg": {
    "date": "2/5/2017",
    "text": "I am so excited about this location. I had an out of town guest come to town and I knew I wanted to have him try a Rehab burger. I was worried about driving to Scottsdale on a Saturday night, and having it be packed with a long wait. I was pleasantly surprised when I learned there was a location only a few blocks away from where we were! I called to ask what the wait looked like and was told they were busy- but there were a few spots at the bar open. Kassie at the bar was so kind on the phone, and since we were on our way, and two blocks away, she said she would hold a couple spots for us. I was shocked, that was so thoughtful of her, and it made me feel taken care of, and welcome before I ever stepped through the doors. This location exceeded my already high expectations, and it didn't disappoint in any way. The PBJ burger is my all time favorite and can't be missed. Amazing food! Perfection in the burgers all the way. The staff and vibe are so welcoming, and the customer service was simply awesome. Ian was our server and even brought us a small side of his favorite sauce to try for dipping the yummy sweet potato tots.***!! It's the little things that make the biggest impact. Special thanks to Kim, Ian, and Kassie- You made our dinner date perfect! We will be back- I'll be dreaming of pretzel buns, tots, and PB until we do:)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YEdZZkqK5RrC0yxDxtbsLg"
  },
  "WOCxJo4OTLUYznbJh8eHEA": {
    "date": "3/14/2017",
    "text": "The food here is absolutely amazing! The pb&j burger is phenomenal! You can never go wrong the with sweet potato totes and any of the amazing dipping sauces. Definitely recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XXdU5CF19vWEBXKc8E_SDA"
  },
  "cVUN0czqpj5S8mIQ9lxvyQ": {
    "date": "3/22/2017",
    "text": "We went to the Tempe location recently on a Friday night at 6-7 pm. We were excited to try this place. I love burgers!! The place is fun looking.  After being seated and given menus our waitress asked is what we wanted to drink. When I asked what was in a tropical named drink she said \"I don't know , probably tropically things like,pineapple or coconut\". Now I think the menu should break down signature drinks but it does not, but the waitress should know. Now I know it was a new location and she's likely new, so I would have had no issue w her saying, sorry I am new, I'm not a 100%sure what's in it, so let me ask the bartender (now this would have been VERY simple  as we were at a table RIGHT next to the bar) she completely blew us off and did not even attempt to figure out what the drink was made of. I assume restaurants mAke a good profit off of the alcohol. We did not order any due to this. Next, I order a burger on brioche.... sorry they were out and only had pretzel or wheat . This seemed quite odd to me as this was early Friday night and I assume brioche is pretty popular. I didn't end up ordering a burger due to that. I know it sounds picky but I would think a burger restaurant would have that and it was what I wanted. The prices were good but service was not. Sadly I left hungry and disappointed. Maybe we will try again later.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "tRe-F5Tp97XlJZ_6GAsBEA"
  },
  "vq4bcacK7OAffRa7HmkTtw": {
    "date": "1/28/2018",
    "text": "This was a great experience.  The beer was excellent the menu and burgers were great.   Service was fantastic.   Try the mac and cheese burger. It is great",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W8mNAsKmnB26UQhj7mEzSw"
  },
  "MIjcLwapuHbTKAyR0hYKYg": {
    "date": "6/24/2017",
    "text": "This place was overall great with very reasonably prices considering the portions. This was honestly one of the best burgers I've ever had with some amazing fries on the side. The fries do not cost extra like some places and the place itself is nice. Very friendly staff and we were seated within seconds. I would definitely recommend to anyone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-KlzHy0wxb5luxnr8uTu3A"
  },
  "k0sQxgA76xNI4aITC2Z4FA": {
    "date": "3/21/2017",
    "text": "Thanks Mike A for being A1 can't wait to come back for some exotica!!!request for Mike A!!! GO CUBS GO!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LrQP8ZH1gNVSQ02e9afo4g"
  },
  "DIPadT8S8eH8kAAkXHpHpw": {
    "date": "5/20/2017",
    "text": "I really enjoyed the food is amazing and the people are better. I can't wait to return the next time I'm in Scottsdale.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gHNKVWaCUWJzxwNPfqXmyQ"
  },
  "Z4K4BUvOHZQQHnGV1m5mtg": {
    "date": "12/3/2017",
    "text": "Had the Hangover burger with frys and it was fantastic!  The burger was huge and cooked to perfection, loaded with bacon and delicious.  The frys are very good as well. Highly recommend this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WdltSM9kdDgne1uOgBfzCQ"
  },
  "ut7sPoB5YdY8FkM49OW5TQ": {
    "date": "2/24/2017",
    "text": "Been here a few times now since it opened. Best burgers in Tempe, so many good ones to choose from!    Great atmosphere, very attentive staff & nice patio. Cheap drinks for happy hour plus all day thursday. Always looking forward to returning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g1GLyeBJG-wMmpXY92zE3A"
  },
  "PfI1RYCNp64-KgCf6qIvOg": {
    "date": "4/8/2017",
    "text": "Great food BBQ pork burger was the bomb. Only probably was the server. Saira was more worried about the bar guys and making sure other tables were happy rather then checking on us. I guess because we look young she thought we wouldn't tip but I always tip at least 10$ not this time! Good great! Service 0!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c8UN68QsROI_WG3EI73bmA"
  },
  "8P0Tu1-bxonfDHLt5YceTQ": {
    "date": "3/30/2017",
    "text": "Great service and food, highly recommended.  Located in scottsdale.  Has large portions good burgers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0zFes5UdUHPpwLpmZwAG9Q"
  },
  "X6U1c0qt5S3w5UtIoiJtAg": {
    "date": "3/28/2017",
    "text": "Just had a great lunch. Bacon cheeseburger added a onion ring and 3 Coronas. My wife had a BBQ burger and a Bloody Mary. Everything tasted great. Service was spot on and a friendly staff. The atmosphere was a fun tropical vibe and very clean.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vEi-DcctmhoHa1ghwBzT_A"
  },
  "L7AY9BSXYl6rUU9EgJyXcw": {
    "date": "5/4/2017",
    "text": "Good people good is good. I take my family here although My sister could use less burger and more  Rehab.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oma46CxiW7W2I6fHuk6xXw"
  },
  "lpkzgxJ8eQQbDjCeZmwvFg": {
    "date": "2/25/2017",
    "text": "Best burgers I the city absolutely love this place the new location is much bigger than the one o.k. Scottsdale which is nicebut both locations are AMAZING",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p_Q2XmJ71XCXSCYdSgmpog"
  },
  "-u_LHcOKdJAVeYs1WKa-pA": {
    "date": "2/21/2017",
    "text": "Probably 2 1/2 stars.  Given all the 4-5 star reviews it is likely a bunch of college student reviews.  The burgers look great in the pictures.  They are just OK.  We had a Hatch chili burger, bacon bleu with pretzel bun and a chicken sandwich.  They were cooked as ordered but the beef, toppings nor bread had any great flavor to speak of.  Not bad, just not good. Service was timely and polite and friendly .  The atmosphere - specifically the menu design is very chain restaurant-like (hokey).  Looks like a good place to have a couple beers.   The bigger issue was the staff dress.  The hostess was awful.  She was wearing an ill-fitting tank top and tights.  There was another waitress who was wearing a sleeveless t-shirt.  But she also had something tying the shirt back in such a way that her back was showing off a large tattoo but also ridiculous side-boob.  Trashy in general but disgusting as a food server.  Not sure if everyone got cold suddenly or the manager made them cover up as these two had jackets on when we left.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GWQyffGIUriWJ_gHtKGzOw"
  },
  "1kb0S-I4xtjLqaHGv5ixeg": {
    "date": "9/18/2017",
    "text": "First time here, and my mind was blown, outstanding, I have never seen a burger menu with such different combinations",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lG02rSgvJa_zqsLgZMgSGQ"
  },
  "ROUfeeBe3mBEiXMHFa-JpQ": {
    "date": "2/13/2017",
    "text": "I was in Phoenix on vacation and came across this place online. The atmosphere was cool. The bacon cheeseburger was good, buffalo wings were average. My issues were that it took almost 45 minutes for my burger and my server seemed to be more interested in socializing with other patrons that he knew. Another server ended giving me a to-go box and taking care of the check. Overall I's say my experience was average.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cxk1Sb85jisdKGJ6a0A_Jw"
  },
  "Kxcz_yut-HxN1siF4YwIaQ": {
    "date": "1/29/2017",
    "text": "Had the Jalapeno Popper burger on the pretzel bun with the sweet potato tots. Overall tasty. The peppers didn't bring much heat and the guac was a bit heavy on the burger. But would definitely recommend and eat again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RMNy6jenOEJih3n7KdnEtQ"
  },
  "o7kNuB9NKxfsbtx3ZH2t8w": {
    "date": "1/21/2017",
    "text": "If I could give zero stars I would. Service was awful. We were seated right away and our drink orders were taken. The server forgot half of the two of our drinks and never brought the other one until our food was there. They forgot to put in our food order. We waited 20 minutes for them to ask us what we ordered because he forgot. They then brought us the wrong food from a table next to ours that arrived after we ordered. By the time they were done eating and paid we almost got our food. Five more minutes went by and we got chard burgers. We had also ordered ranches with our meal and asked again when he brought it. We finally got that 3/4 of the way through eating. I wanted to like this place since I've heard such good things but it was an awful all around experience.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6eRJXIGYU0NkWMz2EVfZKw"
  },
  "hr_70IM0LrOgTFsYd8YoDQ": {
    "date": "9/5/2017",
    "text": "Expensive but good on the overall. Environment, seating, some crazy people were there but yet it's a college area, we had fun.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o0tBxZbe8i8ykoz_gVJssA"
  },
  "7G_PYb4zzPnYNyDy8CDx9g": {
    "date": "7/2/2017",
    "text": "Had lunch here and the food was great!  The only reason for the four stars was the location and parking.  We had a heck of a time finding it and God was no help.  We persevered and it was worth it.  Even the $5 to park in the garage.  Burger was deliciously messy and the fries were scrummy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "buMGu1Hs7GtJW7EgSS29kQ"
  },
  "na6y4AXZKF9Nx2H-lJL2gQ": {
    "date": "7/1/2017",
    "text": "Great burgers great prices and wouldn't mind com by here again next weekend highly recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i8RYfQDTKtMu4pTOWoqI8w"
  },
  "i98HHsVpsb5CIwggo8XsHA": {
    "date": "4/28/2017",
    "text": "The food is usually good here but should not take a whole hour for a burger. When I mentioned how long it took the server pretty much ignored the comment as she kept walking away. The restaurant was pretty empty which added to the frustration. Luckily lots of other choices in the area",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uLmRNT2One144CamBjeMSg"
  },
  "UDL0A6dK4rriN8UhHwJxaw": {
    "date": "6/11/2017",
    "text": "I think I may need to go to Rehab after eating this burger!  Just kidding.  I like the way they have a Hawaiian theme going on in here.  Guess everyone would like to rehab in Hawaii!  When I arrived, the host asked how many were in my party, I told him 9.  He said he's never seated a party that large before.  Hmmm.  Ok.  So, after discussing it with another person, they arranged to seat us just past the bar.  It worked out great!  They do have patio seating which might have been a better option, but I don't like any amount of warm weather, so I chose to be seated indoors.  The place was fairly easy to find, but it is located almost right next to the border of the ASU Campus. There's a parking garage on 6th Street (not free) if you can't find street parking.    To dive into this place, figuring out what you want may be a feat in itself!  They offer so many types of burgers, some sound super crazy!  Don't worry, if you don't want a burger, they do offer salads, wings, pastas, and other sandwiches.  The Rehab size is a 10oz burger and the Relapse size is a 5 oz burger.  The cost difference is only $2.00, so it's worth it to get the Rehab size.  The burgers are just overloaded with so much stuff, it is almost easier to deconstruct it while eating it!  It's like getting an extra side!  I got a Hatch Burger (Relapse) with Ghost Pepper Jack Cheese.  They will make substitutions for you, or at least they did for me.  It was a very good burger because it was just like a cheeseburger with a chili, not over the top with toppings!  Everyone else seemed to enjoy their burgers, too!  You can change up or request extra sauces.  The Wasabi Mayo was killer!  Went extremely well with the Sweet PoTOTers!  Mmmmm!!  Here's a short funny... my Dad usually eats small items that are soft to chew.  He decided that a Tuna Salad Sammy would be harmless.  It was the tallest sandwich that was served!  Yes, it was soft, but he had to eat it with a fork to manage it better!    Being right off the ASU Campus, there is a bar in here, too.  I didn't take a look to see what all they offered, but I'm sure you can get something to suit you.  They do take a little while to get your food to you, but it wasn't a terribly long wait.  We kept busy talking and visiting with each other.  This would be a great place to come to if you are in the area!",
    "rating": 4,
    "rated": {
      "funny": 16,
      "useful": 19,
      "cool": 18
    },
    "photos": [
      {
        "img_id": "MK5l2GL-hvOW1Mxoi4SMhw",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Calamari",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MK5l2GL-hvOW1Mxoi4SMhw/o.jpg"
      },
      {
        "img_id": "aLlfThwT6pgK9K7hCiIkPw",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Bar Area",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aLlfThwT6pgK9K7hCiIkPw/o.jpg"
      },
      {
        "img_id": "vOKlqypWJCQ9A39rshJDtQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Piñata hanging from the bike",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vOKlqypWJCQ9A39rshJDtQ/o.jpg"
      }
    ],
    "user_id": "s_FAHFKUl4YqNofYZC1NYg"
  },
  "2XWhOr6deEVYGiG9hI3_VA": {
    "date": "4/23/2019",
    "text": "Pb&J burger is life changing and the sweet potato tots. They've never let me down on anything here. Do yourself a favor and just go once, you'll be hooked.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JMZSaJ4givdFSRe9m08mYQ"
  },
  "V74B-G5XOG1mdgs-3o0ECg": {
    "date": "3/22/2019",
    "text": "We dug this place on our first outing. The zoo was packed and I was starved anyway. Slight detour to try Rehab. Food was good, including their gluten free bun. There is some moderately vulgar decor/apparel choices (dick jokes on staff shirts: oy). Service was good, but maybe a little overwhelmed by the size of the crowd. Would definitely go back, but maybe not after my kids can read?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x9M8IlAVBYv74t8C_7SnVQ"
  },
  "A1at2HLzMLIcJ9fM-pd_Mw": {
    "date": "2/24/2018",
    "text": "On our way to Dodgers spring training we decided to stop at this popular spot, it was a great choice indeed! Menu options with fun names: gourmet burgers (10oz or 5oz)/sandwiches/pasta/salads and dessert. We tried the P&J burger/Meatloaf burger/Philly cheese burger/Tony Montana sandwich.  The burgers are HUGE & come with regular fries or sweet potato tots. Tip: skip fries & go for tots....YUMMM YUM! The sandwich is a black forrest ham with pulled pork on overly toasted bread (sigh), but still pretty good. We left very stuffed & satisfied. I'd like to go back & try other items, overall food is pretty good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PozWcapzpE4wWdYU4CPcPQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PozWcapzpE4wWdYU4CPcPQ/o.jpg"
      },
      {
        "img_id": "6EILvZEZOFAIcT5trrIQaw",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6EILvZEZOFAIcT5trrIQaw/o.jpg"
      },
      {
        "img_id": "IGcgc30XL9UzMXUtT_XVBQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IGcgc30XL9UzMXUtT_XVBQ/o.jpg"
      }
    ],
    "user_id": "P7FQI0Q8LPK3Ntts4fYJ3Q"
  },
  "S6xFBLFb9O1H1afBtsnFlQ": {
    "date": "8/21/2018",
    "text": "I got the mac and cheese burger (non spicy) and it was absolutely delicious! The fries had a seasoning on them that was a bit spicy so I would prefer just plain.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fZXeQQ6jFc1IvglYNhKYlg",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fZXeQQ6jFc1IvglYNhKYlg/o.jpg"
      }
    ],
    "user_id": "l1uNgrf9qVRW40hzAJCZcA"
  },
  "NHn7ipT-eu8omoUSOuXMUw": {
    "date": "8/13/2018",
    "text": "This joint was very good. The staff was very nice. About 25 of us bikers came in and they took very good care of us in a timely manner. The food was delicious. The sweet potato tater tots were amazing. I had the jalapeno popper burger and it was delicious. I heard nothing but praise from everyone else about their food. I would highly recommend stopping in if you can.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "j6GfDGUh2kTypcmuSJM9Bg",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Jalapeno pepper burger",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/j6GfDGUh2kTypcmuSJM9Bg/o.jpg"
      }
    ],
    "user_id": "KLZkSQVWsREbjvkLKYN-dQ"
  },
  "iHXLIzHgLPfRCaJcfo9yWA": {
    "date": "2/26/2019",
    "text": "Got to be one of my favorite places to eat in AZ. Uniquely crafted burgers for both simple and adventurous palates. I always get an order of their wings and the only sauce you should get on them is Medium/Gold mixed. TRUST ME. the waitress recommended this little secret to me on my first visit and it's had me addicted ever since. The sweet potato tots are an added favorite. The only thing I haven't cared for after trying was their calamari. It was just plain and rubbery compared to other calamari I've tried. Overall, you definitely won't be disappointed. Ill miss this restaurant for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a31JQpaxqHFB7E-QMaUEnQ"
  },
  "DCC6StPrfHiAYRX_X26elg": {
    "date": "1/11/2018",
    "text": "I'm genuinely excited that one of my favorite Burger joints came to Mill!  I love Rehab Burger,  and especially their green chile version as well as peanut butter and jelly.  Don't let the location daunt you. It's hidden- but worth the hunt.  Please give Rehab the love it deserves!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "eKqnE-38y3aVzgECIzQksg"
  },
  "BmW1YN0ilnmDF959UE2HXQ": {
    "date": "7/15/2018",
    "text": "My hotel was 2 blocks away. I ordered a burger from here and by the time I made it back to my hotel, my buns were soggy. I wasn't able to eat my burger. It was saturated in \"juice\". I also didn't care for the service. I stood at the bar for several minutes before someone assisted me after giving eye contact.   I will not go back. Burger wasn't worth it.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vrej0IMEY61PR7cp5xo-7g"
  },
  "KQXGd8ZhGfm-s-m2CezquQ": {
    "date": "4/4/2019",
    "text": "Great food- good service - our entire party was very satisfied! Try the PBJ & Bacon burger! That's what I had and it was delicious",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PfOzCK3FLyq8BSCotsiEnw"
  },
  "J3k_DdsQkTtUA7WO1i6BnQ": {
    "date": "4/2/2019",
    "text": "Food is amazing! Margaritas are amazing! Only problem is that it's hard to find if you don't know where you're going. When you find it, it's well worth it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7-1NmCsO2qmpZCI02Xszfw"
  },
  "1F3vMgjMKr5RopXq8ZuQ3g": {
    "date": "5/27/2017",
    "text": "This is a great burger place! Dont get overwhelmed with the many burger/sandwich options-just give in to the idea of multiple future visits!  The jalapeno popper burger was ok (i wish the popper had more jalapeno-less breading), but the Hangover and the ChiliCheese burger was a big hit with my family.  Our server Cassidy was fantastic, had great food suggestions, AND makes an AMAZING caramel shake. The restaurant had pretty clever sayings on their employee shirts, which we will look into buying when they restock... i guess we are just gonna HAVE TO go back,  *sigh*",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_Dx0dzkiEn5NiLthX-EVpg",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. The Jalapeno popper burger, check out that cream cheese!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_Dx0dzkiEn5NiLthX-EVpg/o.jpg"
      }
    ],
    "user_id": "PYzQkqlpv7ncEcolDWLGDw"
  },
  "7sczkPH8kdsCqOtZW5Cjpg": {
    "date": "7/12/2018",
    "text": "Nice spot!! Great environment, music and service! Plenty of options to choose from with all the burger combos. They have a great choice of aoilis to choose from. My personal favorite was the wasabi mayo! Yum....",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sqkbFblMImmIUWFBXHt5CQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sqkbFblMImmIUWFBXHt5CQ/o.jpg"
      },
      {
        "img_id": "Y1LofeCANQWy7rDgHY8KUw",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Y1LofeCANQWy7rDgHY8KUw/o.jpg"
      }
    ],
    "user_id": "wdiv0Aw82K1Ic-VzXjYj9A"
  },
  "jVCLBnErku0EEip3eLoB6A": {
    "date": "1/21/2017",
    "text": "If they tried to make me go to Rehab Burger I might say Yes Yes Yes! I actually tried to go to the Scottsdale location a few months back but the wait to get a table was so long that we decided to eat somewhere else. We were in the area and saw that the Tempe location had just opened so we figured we should check it out!  The location is a bit hidden, right next to the Brickyard garage exit off of 6th Street. There is outdoor and indoor seating and in the winter they have heaters out if you do decide to eat on the patio. It was fairly busy when we came here on Saturday in the afternoon but we were able to get a seat with no wait.   The menu has an extensive selection of burgers and drinks. They have a daily happy hour from 11-6 which includes discounted drinks. Every burger can be made into a 5 oz relapse size or 10 oz rehab size, and there are multiple protein options, such as beef, turkey, and veggie patty. Feeling in a spicy mood, I opted for the ghost burger, labeled as such due to the inclusion of ghost pepper cheese. I tried some of the chili cheeseburger as well.  Since it was pretty busy it took some time for our orders to get out to our table. Service was good though as we were waiting and drinks were refilled as needed. The plates were impressive looking. The execution though left something to be desired. Our burgers were supposed to be medium rare but came out more like medium to medium well. The burger itself had a dense tough texture, not very juicy, and didn't have a lot of flavor in it aside from a faint taste of char from the grill. I did enjoy the guacamole but the cheese wasn't fully melted in the center of the burger and had a slight grainy texture. The ghost pepper in it was actually not too spicy. I'd say it was about the spiciness of a jalapeno. The pretzel bun was decent but I didn't really enjoy it with my particular burger.   The chili cheeseburger was admirably smothered in a large amount of chili. The taste itself was OK, nothing spectacular, and I had the same problem with the beef patty being too densely brick-like in texture and lacking in flavor.  The fries were light and crisp, dusted with some seasoned salt and very plentiful.  Since it was so busy they seemed a bit rushed for us to finish and get our table cleared. Everyone here though was friendly and attentive.  I'll give them another try; maybe another type of burger will taste better.",
    "rating": 3,
    "rated": {
      "funny": 16,
      "useful": 28,
      "cool": 23
    },
    "photos": [
      {
        "img_id": "hcxOrV_4JKcXoM-R6WRDrg",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Chili cheeseburger on pretzel bun, rehab size (10 oz)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hcxOrV_4JKcXoM-R6WRDrg/o.jpg"
      },
      {
        "img_id": "o_j7G3LJDFYlZAaRszdjsA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Ghost burger close up",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/o_j7G3LJDFYlZAaRszdjsA/o.jpg"
      },
      {
        "img_id": "OMLJK2Xfttc9PlrmRSr1PA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Ghost burger on pretzel bun, relapse size (5 oz) with fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OMLJK2Xfttc9PlrmRSr1PA/o.jpg"
      }
    ],
    "user_id": "DK57YibC5ShBmqQl97CKog"
  },
  "3ef2tu4hw6BHRJFctBEK7w": {
    "date": "3/6/2019",
    "text": "I come here every time I'm in Phoenix for business. PBJ & Bacon burger is outstanding and my favorite burger ever. Great atmosphere and service. I love this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iYsPcCiyY8rSDlOt7RrVOg"
  },
  "Jck0knyJ2fhrcOIgBfhxXw": {
    "date": "1/11/2019",
    "text": "Burgers are delish only 3 stars not much of a drink selection customer service is good prompt and attentive it's in downtown so super close I would definitively go back when I don't feel like drinking hehe",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gZgMB-ugyd0omqKQF-A5mA"
  },
  "mH_F7zsvMTMyq_BrX9XJOA": {
    "date": "4/23/2018",
    "text": "This is one of the best burger places I've been. Every time we are in Scottsdale we come here for burgers.  Believe it or not the peanut butter and jelly with bacon burger is to die for. It is the best tasting burger. I make it at home too but it's not the same as Rehab burger. Highly recommend trying it you will not be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "lcrCOkFEdqzvkLXhg_STlQ"
  },
  "_tn7n_SWOjWCRG61NPaVNw": {
    "date": "5/14/2018",
    "text": "Absolutely horrible. From start to finish, virtually everything was a disaster.   When we first arrived, we we're promptly seated and given our menus. Our waiter came over a few minutes later to take our drink orders. Upon receiving my drink, I noticed that the glass I was given was dirty. I informed the waiter took it back to get me another one. At this time my wife had ordered a beer as well. I received my beer fairly quickly, but she did not receive hers. We had then reminded him of this, he said he would get on this.   We then went to ordering. We ordered a quesadilla for an appetizer, two hamburgers with veggie Patty's, and an order of their spicy Mac & Cheese without the bacon. After putting in our order, we reminded the waiter AGAIN that my wife hadn't received her beer.   The quesadilla had came, and my wife still hadn't received her beer. We did not have an silverware or napkins, so we also asked for these. Finally, my wife's beer had arrived. She ordered a pint of Blue Moon, which usually comes garnished with an orange slices, but there was not one on it. This isn't the most important thing, but was disappointing.   Our burgers and side of Mac and Cheese came maybe 5 minutes after getting the appetizer. This sounds like fast service, but we were expecting to have more time to enjoy the rest of the appetizer before our burgers came. So now our burgers had to get cold while we finished our quesadilla. I instantly noticed the Mac and Cheese had bacon in it, so we had to send it back. We also noticed that the buns we order on our burgers we're on the wrong burger. At this time we still hadn't received napkins or silverware.   The waiter finally came back with the Mac and Cheese, and silverware!   After taking one bite of the Mac and Cheese, we had realized that it was unedible. We had asked the waiter if they microwave their Mac and Cheese, he informed us that they don't, but it really tasted like they did. As far as the burgers go, they did not taste at all what we we're hoping for. For $15 a burger, these we're a HUGE disappointment.   Overall, I do not think we will ever be back. We would try another location, since they have multiple in the valley, but at this point I would just have to say to AVOID.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ky9i9muM9iHkQ_3LSnwnA"
  },
  "l5K1NGvz-J3EUbVs9_zHRw": {
    "date": "10/6/2017",
    "text": "Really great burgers. Fresh buns. Great service. I prefer this location over Scottsdale. I had the hatch Chile burger. You have to get it. Sitting on the patio was the best.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "jWVr0SyTNiw3oWRpYNiglQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Build your own version",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jWVr0SyTNiw3oWRpYNiglQ/o.jpg"
      },
      {
        "img_id": "MYKo9rAUTHsZlhR839ieFw",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Sweet potato tots with fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MYKo9rAUTHsZlhR839ieFw/o.jpg"
      }
    ],
    "user_id": "VvLhL1THnDwNNWlP4ydv8g"
  },
  "BOYoOYwqOVV_bX6c1wdAAg": {
    "date": "11/17/2017",
    "text": "I'd been wanting to come here for a while. Sadly, I was watching my diet so I did not get a burger, but next time for sure. I did however get the recommended tacos and was pleasantly surprised. You get three and can choose all three meat options. So of course I got them all. My favorite was the beer battered fish. It was definitely beer battered. Everyone I came with got a burger and was elated. So good job Rehab!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rNFzvNAKUHQNvdPGYM5Ffw",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Everyone enjoyed their burger!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rNFzvNAKUHQNvdPGYM5Ffw/o.jpg"
      },
      {
        "img_id": "8hzlpGw-GmtkdXmzInU2tA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. All three meats tacos. Beer battered was the best.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8hzlpGw-GmtkdXmzInU2tA/o.jpg"
      }
    ],
    "user_id": "dYRJDUwkWcZJIqBI-Q5rAg"
  },
  "TeNgF6Q0jd_UshLu0fj43w": {
    "date": "8/8/2017",
    "text": "I have been to the Scottsdale location and I wanted to try out this location. First off great location. They are located off of Mill Ave and there is parking super close. The staff was awesome. The general manager greeted me at the door and she also made her rounds checking in on her guests. My hamburger was super good. I had the Tractor Pulled Pork. The BBQ sauce was delicious and the meat was so tender. I would get again. I had corn on the cob as a side and it was amazing. They added some seasoning on it and I loved it. I would eat it just as an appetizer it was that good. I enjoyed my food and will for sure come back for some more. I can't wait to go back to Rehab.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 6
    },
    "photos": [],
    "user_id": "reEOGQvjBwEX9wWGgWBZbA"
  },
  "npH_tVA2Eb2lAvsE2uc7sQ": {
    "date": "5/12/2018",
    "text": "The food is great. Their service on the other hand is horrendous. When I come it seems the employees do not know what is going on. They need to work on their structure to ensure each customer is attended accordingly. This will be my last time coming here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dPClntfkSBitL6ewfGrFqw"
  },
  "6cFbMau-hmP298KB1WZbjg": {
    "date": "11/9/2017",
    "text": "Came in for the first time today. Oh my god. I had a salad. A Ceasar salad. And it solved all of my problems. The coronarita took me back to heaven where I met the gods of all things beautiful. And the gods brought peanut butter a jelly bacon burger and I said ohmygod god thank you this is so freaking good. I think that the peanut butter and jelly burger could stop somebody from committing suicide. I think it could turn Ganondorf from demon to saint. I think I might come here for dinner for the rest of my life. I'm so passionate about this place now idek.  Screw engineering. I want a degree in rehab burger therapy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E8H1vt0e6AnWpagjP0kEcg"
  },
  "uuEa5Vq_VJpg9en0YXeXmQ": {
    "date": "8/12/2017",
    "text": "This place is great! Compared to their Old Town location, this one feels bigger and more open. The vibe is pretty relaxed which is nice. I've yet to have a burger that I didn't like from Rehab. I also highly recommend their fries. So much flavor!  Definitely a place I will come back to.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "QRpPGyerU9peFj3_VvdhwQ"
  },
  "jwKjDfclSDDFzbBwz0KJ6g": {
    "date": "9/20/2017",
    "text": "Gotten take out order twice now, and both times service has been speedy, complete and kind. Last time the bartender gave us extra sauces to go because he thought that we would like them. My wife and I love this place and are looking forward to our next take out! Go for the hangover burger with sweet potato tots + the gluten free buns are AMAZING!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VpAg0zhKbBI9zBCCdCKgqA"
  },
  "8yoHbriDJyY6zSK0LefQVQ": {
    "date": "4/28/2018",
    "text": "Great selection of burgers, even build  your own, I had bacon and blue which was mixed in with the patty, son had poblano burger, it was very spicy, he had to take out the spicy onions, fries were excellent and offered with ranch and ketchup, just wish they had better beer selection",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9SqssM73EChIhqxh58JgPg"
  },
  "THazBZIqV8pB4p2mD8zEQg": {
    "date": "4/27/2018",
    "text": "They have a lot of burger options but I wouldn't say any are outstanding. I ordered a burger medium well and it wasn't cooked. As a burger place they should know how to cook a burger properly to how it is ordered. They eventually corrected the order and gave it for free. The service was good but overall experience disappointing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dJd7j0xuJaT8GBTum0ujnQ"
  },
  "soKKXFbcf63coLqR8Vk5Ow": {
    "date": "9/14/2017",
    "text": "Dig your toes in the sand and sink your teeth into one of Americas best burgers. Not big on TV's, beers are cheap, and service is always on point. Relax and Rehab",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XnKUcmayZd-N43fR2n-0Ew"
  },
  "YSRLunvPipo2FlvVfYAcVQ": {
    "date": "2/4/2017",
    "text": "Bought lunch for my employees here last week to try it out for the first time we all loved it.  Had the spicy Mac and cheese burger for lunch and was so full only had half.  Ate the rest for dinner that night.  So amazing.   Will be back!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LPga6tY7Fh73zhfdorZ_xA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Came back in today and had a bomb Cuban sandwich. &amp;#34;Tony Montana&amp;#34;. It is as trump would say. &amp;#34;hUUGH&amp;#34;. So good",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LPga6tY7Fh73zhfdorZ_xA/o.jpg"
      },
      {
        "img_id": "7SB40raIXFAkUVjGNZ3JHQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7SB40raIXFAkUVjGNZ3JHQ/o.jpg"
      },
      {
        "img_id": "FPILNM23tYdNgBZxp0wtlw",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FPILNM23tYdNgBZxp0wtlw/o.jpg"
      }
    ],
    "user_id": "ifn1cWyI6v0EC3bn2yhVvA"
  },
  "Gjh0spyAzEMxlQiEsS6L0g": {
    "date": "9/23/2018",
    "text": "Been here several times including the one in Scottsdale, this is the first bad meal I've ever had at this restaurant.   They ask what you want to burger cooked to i.e. medium rare but all three of our burgers tonight were over cooked. they also seem kind of dry and the pretzel bun was too big and dry.  The sweet potato tater tots tasted like they were overcooked as well as the meat in the burger.  We got the Hawaiian burger, the pork store, and my wife and I split their awesome (usually) peanut butter and jelly burger.  I always take my out of town guests to the restaurant to show off what Arizona is all about, but tonight the food was just not good, I did not want to complain to the waitress because the service was good as usual but the burgers just did not taste good.  The burger was actually not cooked like it normally was at this restaurant, not sure if they have new cooks in the back or what but just did not taste right.  Moved the review down to a one star due to owner/location not reaching out on behalf of my review.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nabZzezZdUrTipN2wAPCJg"
  },
  "IOTDSu9cCpOvBDqIPijE2Q": {
    "date": "7/6/2017",
    "text": "Very laid back place. Fits with the area.  Burgers are the thing here. They don't disappoint. Also, I am a fan of pretzel buns, which they have here.  They are huge and two of us in our group split one. Servers are friendly and good atmosphere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "FndPbo-G6XQzdpjmpjXotg"
  },
  "rgnQOYsenMej7GRgajCMdQ": {
    "date": "7/3/2017",
    "text": "This place was super fun. The burger was larger than my face but I still enjoyed it. They have an outdoor patio which looked lovely but I ate inside. They have a great variety of condiments, an essential for a great dining experience in my opinion. Our server was so nice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "LktM6BhTBjJRT5L-ZBqfNw"
  },
  "LOTMAdg5KhVVcBrtM1FxzA": {
    "date": "12/8/2017",
    "text": "BEST BURGERS EVER.  When I first went here, they had mentioned a PB&J Bacon burger.. Instantly as most would think, I thought \"Gross.\" But one of the waiters were saying it is their best seller, so I thought fine, it cant be THAT bad right? SO GLAD I took that chance, it was easily one of the best burgers I have ever had. I recommend Rehab Burger to everyone!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lamo_1GfasQliraoHZH0JQ"
  },
  "-8L2NK94kXGmCB1l9KioKg": {
    "date": "7/10/2017",
    "text": "My favorite burger place!  I have tried almost every burger and I swear each one is better than the last!  They posted a photo of their meatloaf with mashed potatoes the other day and I cannot stop thinking about how delicious it looks and how I need to get it!  My favorite is to get their sweet potato tots and pineapple dipping sauce! I could probably drink all of their sauces they are so good!  They have the best staff between both of their locations and always play the best music!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nh3O6QzW2WbOgPo8NIFoYQ"
  },
  "SELXcgsPZ2yzzdAspgi25w": {
    "date": "4/4/2018",
    "text": "Legit, legit, legit! Could be one of the BEST burger spots I have ever eaten at. Ate there twice on our recent trip. Went Ghost Burger the 1st night! Money, can't go wrong. Then went PB&J burger 2nd visit. Before you say \"huh PB&J\"? It's a MUST try. The flavors mix together to provide an outstanding burger!! Modelo's were on happy hour from open to close too! $1.50 a beer, can't beat it! If You haven't been, go! You won't be disappointed",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qOwNEOmGQqrDdkSAn-kmLw"
  },
  "HunDIs3SuQNlIcfGa4UC7A": {
    "date": "4/2/2018",
    "text": "Great selection of burgers. Mac and cheese or fries are amazing. Huge portions so should probably order accordingly",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OAmRHR8cigJvlCRaqYKfkw"
  },
  "ROvfiYmGOs36xUdqJZlXwA": {
    "date": "5/1/2017",
    "text": "Came here during the Tempe Arts Festival and lucky for us because they are not right on Mill Ave. we got a patio seat for 4 right away.  I am always looking for a great HH place for my work group as I work down the way and was excited to try the Rehab.  The burgers were excellent/delicious/juicy/pretzel bread bun/awesome!!!  The service was over the top compared to the previous establishment just a few doors down.  We tried the green chili burger and it was delicious.  I was very impress with everything and the price for a 1/2 pound burger is around 10 bucks, which you can split with someone easily, it's more than enough.  Very happy with everything and I will be back.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "zwpP3Lt8USKS91Ds52G8UA"
  },
  "4tSumXNRxQxM_jeYmWAgRg": {
    "date": "10/17/2017",
    "text": "I came here on Saturday 10/14/17. When Asu played Washington. The place was well packed and the atmosphere was upbeat and alive. I ordered some wings which were cooked amazingly and well seasoned. I was a little disappointed about the margaritas and how it did not come blended. My boy friend ordered a burger and did not even eat all of it because it came to us this raw. The only reason I would be back is for the wings and fries.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "E3SUbE0AKpVbVnQPb2B1Dw",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/E3SUbE0AKpVbVnQPb2B1Dw/o.jpg"
      }
    ],
    "user_id": "nz-XNfF4NRcSJqtLwMc7Ig"
  },
  "cwvUg6qtao5WBUpxs6VVUw": {
    "date": "4/13/2017",
    "text": "OMG. I have never had better chili than what was on the Chili Cheeseburger at Rehab!! It was amazing!! Everything was great including the service. Our server helped us out with what to order from what kind of sauce to what kind of fries we should get!! He was such a great help.   I had the Chili Cheeseburger with the Sweet Potato fries. I also got the Chipotle Ranch sauce and the Pesto Aoli. So good!!   We also had the Bacon Blue Cheeseburger which was fantastic as well!! And the regular fries were delish too!! I would highly recommend this place. I loved it!!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "XT2h7DfJ3V9VpYga1U-aRQ"
  },
  "noNXJnowx84gxFc4JBBa6A": {
    "date": "5/9/2018",
    "text": "Pretzel bun wasn't worth the risk. I had never had one and decided to try it but I now regret it. I got the jalapeno popper burger but it wasn't that good and I thought it had too much peppery spices on it. It wasn't too spicy, but overpowering taste.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "da_z_ezyRyTWY3NY8kSDIw"
  },
  "-amZfXOXVQegtDBn-VYNzA": {
    "date": "5/25/2019",
    "text": "I've been there a couple of times, but last time May 10. We entered and sat down.  It was 10:15 p.m. the person who came to assist us told us that they were going to close in 15min when the Friday nights are supposed to close until 11:00 p.m. the truth bothered me that in a few words they told me it was too late",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QxSH6ke5At-5sIttEpaTDA"
  },
  "8dyf5QnUORzLbJimCGwt_g": {
    "date": "5/1/2018",
    "text": "I was in town to see Jerry Seinfeld and wanted to try a few places for lunch. Christina J suggested this spot to me so I said I would try it out. The weather was so nice that I was able to eat outside in this college town. The food was very good. The burger was moist and the onion rings were crispy. The price point is terrific and if I'm in the area again I will surly stop in again. The staff is very friendly as are the folks that eat here.        All said and done if you are in the area and want a quick but good bite to eat this is a place you must eat at. No disappointments had.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 9,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "TaIjTCaRMJOgNe-dnIPXlw",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. PB AND J bacon burger",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TaIjTCaRMJOgNe-dnIPXlw/o.jpg"
      }
    ],
    "user_id": "QN469v3yJmq_TpcllgiZvg"
  },
  "qND5Pvu-U5WumjFDFWGqCA": {
    "date": "12/18/2017",
    "text": "A Tiki Lounge meets burger joint! What a cool concept! Rehab was pretty quiet when were were there for an early dinner. The TVs had a mix of aquarium scenes and people are awesome videos playing.  I had the mushroom swiss burger and the fries. The seasoning blend they use on the fries is killer. Add some of the Aioli sauce and you have a wild flavor combo. The burger was cooked perfectly and the buns are so fresh and tasty.  For the gluten free crowd they have several options. You can do a lettuce wrap or they have a gluten free bun too.   My biggest regret is filling up on the burger and fries. I would love to go back and try the pot brownies. I bet they are worth the pain of over eating.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VKETJO9lFVjdRszL_BR5Sw",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Mushroom Swiss Burger",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VKETJO9lFVjdRszL_BR5Sw/o.jpg"
      },
      {
        "img_id": "NFNjGTjb7DKWt8BO99AbAw",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Lettuce wrap burger.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NFNjGTjb7DKWt8BO99AbAw/o.jpg"
      }
    ],
    "user_id": "P2ZK_uDduvKbKgmNuyZQ4w"
  },
  "HmJK82cz2062WRUNMNI-Lw": {
    "date": "11/14/2018",
    "text": "I stopped by after school and fell in love. As a student, the prices were high. However, they were definitely fair for what was given. The burgers were absolutely huge and really delicious, the fries were good, and the service was phenomenal. Our waiter was so friendly that I almost want to go back to Rehab, not for the food, but for our new old waiter friend.   Additionally, the burgers were adventurous as they didn't just have simple burgers but creative ones as well. There were burgers with mac and cheese, chile, etc...   HONESTLY, the food is good and you get a lot. Just come and eat here and be wowed by the taste and the service.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-inp099-1gsJF3KPaS-mbg"
  },
  "aMP2F17JoArzTMGEi1vRTw": {
    "date": "2/18/2019",
    "text": "First time and it was wonderful! I got the spicy mac and cheese and my boyfriend got the PB&J. We split them and it was awesome!  Mac and cheese was definitely my favorite.  Sweeeeet potatoe tots were good and the onion rings were fire! You only get 4 - 5 since they are huge but they are delicious.... can't wait to go back ands try something new!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hi4ULzg2PFn8WGKkD9GKdA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Ghost burger!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hi4ULzg2PFn8WGKkD9GKdA/o.jpg"
      },
      {
        "img_id": "OyVULyUxA5eN-jDjyjOo6A",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Shrimp tacos",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OyVULyUxA5eN-jDjyjOo6A/o.jpg"
      },
      {
        "img_id": "BZ8m17ABKvuxr3Bx1KlGrA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. PB&amp;amp;J with onion rings",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BZ8m17ABKvuxr3Bx1KlGrA/o.jpg"
      }
    ],
    "user_id": "-xGR0OJfPCLGzBrsSXhgjg"
  },
  "Kq8Wl46Cnk9ZMC5uAQ8TDA": {
    "date": "6/4/2019",
    "text": "Ate lunch here with my son last Saturday. The server identified herself as being the niece of either the chef or owner. Server had a bad attitude. My 15 year old son ordered the Chili Burger medium rare. The server questioned him as if he was an idiot and didn't know what medium rare was. I ordered the Mac and Cheese Burger - medium rare. The restaurant was empty except for one other table and a handful of people at the bar. Food took 20+ minutes to come out. Both burgers were so well done that I would call them hockey pucks - gross.  The only decent thing about our meal was the sweet potato tots.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KYZ-YgNycNAvMJpsl_QUPA"
  },
  "Q8dYAXxtyFGED_Lfk2VcMg": {
    "date": "4/11/2019",
    "text": "Enjoy a burger during our stay in Arizona! Make sure to try their sweet potato tots !",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ijKp0uVbd6bZtY7d7xtaOA"
  },
  "TT8RIDsbBYnD1W65mU9mOg": {
    "date": "5/31/2019",
    "text": "This place delivers the flavor for sure you have to cone try it. Loved the Philly fries sobyum",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "06cOdTilL7bywnDBHxToZw"
  },
  "7R8SjiN8fezopad2BcOSGg": {
    "date": "7/22/2018",
    "text": "The burgers here are great especially for those with an appetite. The philly cheese steak burger is exactly what it sounds like with a burger covered by Philly cheese steak. The mac and cheese burger is good for kids. They also have a great PB&J burger and ghost pepper burger with quite a kick. They also have veggie burgers which can be substituted for any regular burger.  The location is good on the ASU campus and parking around on the nearby streets. Not sure how crowded it gets during the school year but on the weekends it busy but not a long wait. We have been there 3-4 times in the last 2 months and it has always been a great meal. We will continue to frequent this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "i-MtGwo1UClDSMip3QPJBg",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Mac&amp;amp;Cheese burger",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/i-MtGwo1UClDSMip3QPJBg/o.jpg"
      },
      {
        "img_id": "8UNPGEPm95tYVN2pxFh7VQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Philly cheese steak burger with slaw",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8UNPGEPm95tYVN2pxFh7VQ/o.jpg"
      },
      {
        "img_id": "5iE7MsaLCmI5pTHFPXhqDQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5iE7MsaLCmI5pTHFPXhqDQ/o.jpg"
      }
    ],
    "user_id": "BuoeBRpUhNZud9LPycrMWw"
  },
  "AIJI0wime2IqdvMbgwnEjQ": {
    "date": "11/11/2017",
    "text": "This is a really nice place for chilling and eat, my friend and like it so much.  Environment: it's pretty chill in here, I decide to sit outside for my meal, the lights and high tables are cute.   Appetizer: I ordered the onion ring. I would say the onion ring here is a must have if you come over, I haven't seem this huge of onion ring in my life, super satisfied!  Burger: I order the spicy Mac&cheese burger, side with sweet potato. Mac&cheese has crunchy bacon on top, the burger portion was so huge, 5 oz is definitely good for 2 people. Sweet potato is so good with their homemade special sauce.  Service: my waiter was so friendly, he come to check on us like three times, he gave advices on the choices. I left my cigarettes on my table, he ran and gave it back to me. Love him!   I'll recommend this place to all of my friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IXr5gy8RKc_3btCDlXwpLg",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Spicy Mac&amp;amp;cheese burger with sweet potatoes! Unique and taste good!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IXr5gy8RKc_3btCDlXwpLg/o.jpg"
      },
      {
        "img_id": "4fKPNwok3aZs0rw8PcJdqA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Huge Onion Rings!!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4fKPNwok3aZs0rw8PcJdqA/o.jpg"
      }
    ],
    "user_id": "R494UCWNG5FSg_yhndq1hw"
  },
  "SLRIM7co1oU1u3uYWUg56A": {
    "date": "4/3/2019",
    "text": "I was in the mood for a hamburger and I dragged my husband to this joint this past weekend.  The festival was going on, so we had a bit of a walk to the restaurant, which was not a big deal, and it helped to increase our hunger.  We were pleasantly surprised by this place.  The decor is fun.  The service was super friendly.  Got sat just as we walked in, and even though the place was hoppin', our meal was served quite fast.  We both order the BYOB (build your own burger).  Mine was piled high and cooked to perfection (i always ask for medium).  The right amount of the toppings I picked, and the sauces added to the flavor, of course.  Did not order any special drinks or desserts.  The burgers were so big that it was enough for our meal.  For a restaurant near the college, it was not bad (as far as rowdiness).  It might become our favorite place for a hamburger from now on. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n74x46MBXWoWct2ZydxKwg"
  },
  "fPnJ8dUNmqVKXTDQJMQG9g": {
    "date": "8/19/2017",
    "text": "Located off Mill Avenue this burger joint brings in a fun crowd .. outside patio seating has the much needed misters or plenty of indoor seating ..   We were invited to a private taco party and I am so happy we made it .. our group shared fish, chicken & pork tacos (only the fish tacos are on the menu), huge guacamole, salsa & pico de gallo.. we ate family style ..   The battered cod fish tacos were my favorite .. served with cabbage & a sprinkle of cotija cheese, tomato, cilantro and salsa.. squeeze of lime .. yum  Summer drink specials were very good.. the strawberry crush with jack Daniels was my fav..  Servers took excellent care of our group.. looking forward to our next visit... thanks again for allowing us to celebrate at your spot!!",
    "rating": 5,
    "rated": {
      "funny": 14,
      "useful": 31,
      "cool": 28
    },
    "photos": [
      {
        "img_id": "lW-6p8CcfGbLGHBJwooDTw",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Taco tray.. special party food .. not on the menu.. battered fish, chicken &amp;amp; pork tacos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lW-6p8CcfGbLGHBJwooDTw/o.jpg"
      },
      {
        "img_id": "BMbkLRqMFdMY994f2eBKrA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Strawberry crush from the Summer Specials menu.. very good",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BMbkLRqMFdMY994f2eBKrA/o.jpg"
      },
      {
        "img_id": "4pccf_SoEXcllVVHHdF_KQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Battered fish &amp;amp; chicken tacos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4pccf_SoEXcllVVHHdF_KQ/o.jpg"
      }
    ],
    "user_id": "BpJygDyhzDf7Pw1Is_5zSA"
  },
  "I1Y0QqM8OPvUso9oG8Pktg": {
    "date": "3/25/2018",
    "text": "Finally went to this place after many people told me to check it out.  We left thinking about all the people we plan to bring back. There are all the wild and crazy burger options that fit the needs of everyone. The most popular burger is the PBJ burger and my husband had it-- was good he said! I tried the veggie burger with the onion rings and BBQ sauce topper. I liked it! The veggie burger is a fried panko bread crumb and black bean patty. It was a bit hard to judge the flavor since it was doused in BBQ sauce (which is how I like it), but I do wish it weren't fried.   Tip for kids: They don't have a kid's menu, but you can order half orders of PBJ or grilled cheese (what we ordered, and also mac'n'cheese and other items I can't remember). They are HUGE portions and I would've been full on the half order of grilled cheese or PBJ! The even come with fries and were only like $3.25 each.   I changed my mind and upgraded my fries to Jamaican corn at the last minute because I saw it come out on another person's plate (was DELISH, btw) and they brought me that WITH the fries at no additional charge. Super kind of them considering I was the one who made the mistake in ordering late.  The portions are huge, the food is pretty good and the prices are super reasonable considering that burger is very likely to serve as two meals for you!  Can't wait to head back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TLdMXf2gt9Am9LOLL_T2FQ"
  },
  "XrEgInW3CaUt58S7P69y0Q": {
    "date": "10/30/2018",
    "text": "I feel terrible writing this review as I have long been a fan of rehab. I dine often at the Scottsdale location and order delivery through grub hub often. Generally there are no issues. Tonight was another story.   I ordered a bacon bleu cheese burger through grub hub, and upon arrival, I noticed that between the buns there was only a patty. Nothing more. Upon contacting grub hub, they spoke to the restaurant and were advised that the bacon and bleu cheese was inside the burger.  Ok cool. The description was wrong on grub hub. It didn't say anything about it being stuffed. But I'm cool with that. Bacon and bleu cheese stuffed burgers are some of my favorite burgers to make.  I look at the patty again, and still don't think it looks right. I work with meat on a daily basis, and I have made a lot of burgers (stuffed and not) during my time. I proceed to open the burger and examine it. Not a shred of bacon or bleu cheese. I'm very familiar with rehab's regular pattys and this was one of them.   I contacted grub hub again, and they reached out to the restaurant. They came back to tell me that the manager would not issue a refund for the burger I was incredibly unhappy with. I explained to them that neither of the components that make up the bacon bleu burger were included, but that say that there was nothing they could do as the manager would not allow a refund.  I work for one of the highest rated restaurants on Yelp, and we would never treat a guest like that. Even if they were clearly wrong. I'm not trying to scam them for a free burger. I love rehab and love supporting local business, but tonight I feel like the customer service ball was dropped.  Just finished eating the burger after I added some ingredients at home. Didn't taste any bacon or bleu cheese at all.  I don't see myself repeating my business there again soon.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "onYPcCY0Wxgl3PeoJjM1EQ"
  },
  "QY9kHNBweBmxI3z8U9q-YA": {
    "date": "4/14/2018",
    "text": "This place is is the best! I had a veggie portobello mushroom burger, vegan style (I'm not vegan, but try to eat more plants). My server brought out 4 vegan sauces, but I found I didn't need to add sauce, as the mushroom had a nice marinade. The burger was packed with fresh veggies. It was served with a side of sweet potato tots. The portion was so huge, that I'd recommend sharing dinner so you can share a milkshake for dessert. Mmm.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MLdB4dEk3EjWBj_o2xJ4GA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MLdB4dEk3EjWBj_o2xJ4GA/o.jpg"
      }
    ],
    "user_id": "BCmOQU6EQr4gCet9NBcVoA"
  },
  "Q4xjIilPc1fRR7WPgFo1KA": {
    "date": "7/24/2019",
    "text": "Food was good and filling. Staff definitely on top of things. Wasn't super busy for dinner, so staff was more \"laid back\" (in a good way - like casual with the customers).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "inpnEU257nJso27OeEjyKA"
  },
  "FtHruQMzd4bU-vD2kGLxzQ": {
    "date": "9/22/2018",
    "text": "The food was great! Service was awesome! Jessica was our server and she was amazing!!! We came at 8:30 pm on a Saturday and got in no problem. My friend had the Mac n cheese burger, i had the peanut butter and jelly burger and my husband had the jalepenio popper burger. All were great! Definitely eat them again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZVeqThcZX7yZen3Cuqa-Mg",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Peanut butter and jelly burger",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZVeqThcZX7yZen3Cuqa-Mg/o.jpg"
      },
      {
        "img_id": "Tb0u6wCGPmeeNnkumsXWcQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Tb0u6wCGPmeeNnkumsXWcQ/o.jpg"
      }
    ],
    "user_id": "sLnyYZruG09NqZ5PqjWyfw"
  },
  "IZxQJMfTmm1gMnymbfUxPQ": {
    "date": "2/18/2019",
    "text": "For a burger joint I wasnt blown away.  The concepts the come up with are amazing but the final result not so great. We ordered a jalapeno popper, my burger was over cooked so that sucked but the whole thing just fell apart. I think the avocado is unnecessary and doesnt do anything for the burger.  My husband got the mac and cheese burger , it was just okay.  The best part of the meal was the sweet potato fries .. they were very good.  The staff was very friendly and the vibe was good .",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kIRy6lihZo-YvDQ6P2SVLA"
  },
  "6__LDVF4hMOXe3X4slJ3Kw": {
    "date": "10/11/2018",
    "text": "The bartender was my waiter and was super nice and friendly! We had great service. Happy Hour was pretty great I got a modelo for 1.50 and the 10-ounce burger with the pineapple bbq sauce and onion rings with regular fries. Btw, they have great ranch! My burger was good and the fries were seasoned and delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fGh0MTtU467Q28lwE6O8ww",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fGh0MTtU467Q28lwE6O8ww/o.jpg"
      }
    ],
    "user_id": "mjnOn8vK2YHbWGHNrCN0cw"
  },
  "_qMVKOpEiOpGGnT2F9c2-Q": {
    "date": "3/30/2019",
    "text": "If you are looking for a great burger place, this isn't it.  I was so disappointed I forgot to take pictures.  We had just come from the festival we were hot, tired, hungry and thirsty , which might explain my over ordering. He had a blue moon (very good) , I had a Rona-Rita ( didn't care for the margarita portion at all) I ordered chips and salsa for us. In all fairness who in their right mind would order a margarita and chips and salsa at a burger place! Neither of us liked them. He got mushroom Swiss  burger ( (gave it a \"meh\")with fries, we both liked the fries. I ordered just a burger and did not care for it at all, ) meat was blah and bun tasted old).had onion rings with my burger, most people would probably like but they were way to thick to suit us.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W6kG_86_KTp1ezFr8ZTJ2w"
  },
  "04CrREgvpgeSdvhZv23Z_Q": {
    "date": "9/17/2017",
    "text": "Great ambience & really cool & fun burger selection.If you wanna feel like your by the beach in Az this is the place for you! Good service great burgers!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vyvddt7uKADNcx27xDtFUw"
  },
  "mC-GH8ObmBGowgiu78Pf7g": {
    "date": "5/29/2017",
    "text": "Best burger in a long while. Great job with Hatch Green Chili even for those from New Mexico. Also great Sweet Potato tots, never had such before, unique.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Gkupn2wtLU69i5grY5XlQ"
  },
  "7lOTlJhr9W57ui0wrcffQw": {
    "date": "2/11/2018",
    "text": "Nice place, really laid back feel, reminds me of cali which im sure was the intended vibe. we'd go back one day. Friendly waiters, good food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2TuZSreaIxroiXMbCiH4HA"
  },
  "SccNdlWyKmVpNKkgDrebSA": {
    "date": "3/19/2017",
    "text": "This is a great, casual place for some filling food. I really appreciated that they had a delicious vegetarian burger--a panko crusted bean patty. It was one of the best veggie burgers I've ever had. I wasn't a fan of the sweet potato tots. They were kind of bland. Wish I'd gotten the fries. The service was wonderful--very fast and friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wVKVTvBzGZSJFQaMOZVaXQ"
  },
  "VObxXDAKA2oON8_ES6t1qw": {
    "date": "3/23/2017",
    "text": "I was not enthused! I was invited to come here for a friends birthday and was not very satisfied. The service was bad and the food was just there. I wouldn't recommend coming to this burger joint as there are many others that are more tasty.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ys2oMUI-jmuAz1Swb5t76A"
  },
  "c5KUjymfCdRTja7pPGE_CA": {
    "date": "9/25/2017",
    "text": "Wow! This place is soooo delicious. Great prices for the amount of food you get. It's a fun atmosphere, never too crowded!! I had the tuna salad on the wheat roll with cheese... so yummy! My fiance gets the peanut butter and jelly and bacon burger with siracha sauce!!! I've only had a bite but oh my gosh!!! Everyone needs to stop in and go to Rehab... lol! Best thing since slice bread! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t9wYvLdfEEu-sk3Ud2XwSA"
  },
  "qaFxht76As1HV-GOG15y3A": {
    "date": "2/28/2018",
    "text": "Good service. Nice beer selection. For a place that \"specializes\" in burgers, the burger was just ok (but cooked to perfection).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ej8PmqYiK3xMODEX-1m97g"
  },
  "7FgZIdThZ-T6361hWUOgZw": {
    "date": "12/23/2017",
    "text": "Really good burgers , like the kind when you take the first bite and say,\" Whoa- this is tasty!\" The service is also very peppy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xno-h9vnhy1ohWlO0pYlYA"
  },
  "lpp_Zf5eCdlTzc_brKZnnw": {
    "date": "6/6/2017",
    "text": "Place is a joke and their portion's are hit and miss. You never get what you pay for it's more along the lines of if the cook staff are being lazy that day not giving the correct amount of food to everyone and the servers not caring enough to send back to the kitchen before giving it to the customer.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dJH4KZ7HqnUMd6ls3gccgA"
  },
  "TgOOfcS1BmbAnDVFYIqniQ": {
    "date": "5/31/2017",
    "text": "Special burger experience. Once you are there definitely a recommendation. Try the ghost burger - hot but the guacamole made it perfect.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EiRDFl7iCjB6H0L8v-GrAA"
  },
  "GR639uq-SAX0ZS45JmBfkg": {
    "date": "9/7/2017",
    "text": "Great, fun burger creations! Staff is extremely friendly and our waiter acted as if he knew us for years! You'll get treated like home here! Burgers are ginormous and for a great price! I will definitely come here again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OGvFgib5KaEYBhwm00-eFg"
  },
  "R-YtgLDJBqthitexFwzLeQ": {
    "date": "2/15/2018",
    "text": "If you want a killer burger, this is the place to go. I've never written a restaurant review, but this one is worth taking the time. The sweet potato tots are crispy on the outside and melt in your mouth on the inside. The BBQ burger was insanely good. I can't  wait to go back and try another burger.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YMsDx_Us2QpkurEYd36cIA"
  },
  "Sn6RgvPbL_9mdmZ0_aN8gw": {
    "date": "7/29/2017",
    "text": "I must've come during a group happy hour, at 7pm on a Friday, the crowd was LOUD but quieted down as the group dissipated. I had the Coco Nutty to drink (it's amazing btw, makes you feel like your on a beach) and felt compelled to get the Hawaiian Burger. Burger was great, but the fries were FANTASTIC. They have this chili-lime seasoning that makes the fries so addicting. Needless to say, my plate and glass were completely empty when I left feeling very full and satisfied. Definitely coming here when I need a burger fix.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UnOdXD_y1WMhhqm5TvD-sQ"
  },
  "CZQixPiAooiaqcs7JwnBYA": {
    "date": "3/19/2017",
    "text": "Decent burgers and adequate service. The burgers were ginormous so prepare to come with an appetite. Seems like a cool concept adding new flavors and making the burgers unique. I'm not a big burger fan but if you like burgers and are in the area, check this place out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lu-hE67pHcz-zlBjEZyJLQ"
  },
  "Mf3E8FxbmB7mIuO0uHl2Ig": {
    "date": "1/5/2018",
    "text": "The burgers here are a1 and the hot wings are just as delicious! My first time in I decided to sit at the bar. David was my bartender and he's the only reason I go back!!! Takes excellent care of you and will recommend his favorite meals. Cool atmosphere and amazing food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-CAN2uTg2aSnUVaaMvIZkw"
  },
  "pDopyW5TNQ0IpPPATamFzw": {
    "date": "5/7/2017",
    "text": "Horrible experience a few weeks ago with bad and slow service and them throwing a fit because my aunt wanted a different bun. Will NEVER be back to this location. The one in downtown Scottsdale is much better!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2KVkcCHRlubSCaPoBl1MGw"
  },
  "jZizZ7bj0Cc11cEPm64gcg": {
    "date": "7/13/2017",
    "text": "This place is awesome! The chicken sandwich and burger was delicious. We really liked the vibe and how we were treated. Best place I've been to recently! The only thing I thought they should have is a kids menu but that's it really. I mean the sandwiches were big enough to share with my nephew but overall, great place, awesome workers and location.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "frouSvLnuUQSH6eknMyUIA"
  },
  "J55BorPDHu-PxYIy6mmjXw": {
    "date": "3/4/2017",
    "text": "This place is amazing Just as good as the Scottsdale location. The bacon and Bleu is the best burger I've ever had. It's so smoky and just....wonderful. I haven't tried their pb&j and Sriracha one yet but everyone raves about it. The owners are awesome and the waitstaff is always so friendly.  Great laid back atmosphere and decent prices too",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O_TS3Mhr9vIUQKGI-sAkxg"
  },
  "ot3YEv6L4KgBGNoBqTgYJw": {
    "date": "7/8/2017",
    "text": "Very quick, respectful service. Tasty food, Liked the atmosphere. No complaints! Ian was great! I recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dJXPuYgyzwOiYZcQfUP8kQ"
  },
  "38-EKhLcE2LqXwNWz2W3Aw": {
    "date": "4/27/2017",
    "text": "If you're looking for a chill spot, this is it. Super friendly staff. They talk to you like you are one of their friends! Great food! I personally suggest the pulled pork with the pineapple teriyaki aioli. Or just some fries with that as a sauce to dip it in. They also have a really good happy hour (11am-6 or 11am-Close in Thursday's). One of the top places to be at on Mill Ave for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IgYlBNMJcaZcYiefiYN_Xw"
  },
  "On5c1PQAi0_KYqDoYiv5gQ": {
    "date": "1/29/2017",
    "text": "Awesome place to chill and have delicious burgers and food!!!  Burgers are so big you can share them!  This place never disappoints!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "27iJOiJ65r2eCCbWiVE1VA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Best onion rings ever!!!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/27iJOiJ65r2eCCbWiVE1VA/o.jpg"
      },
      {
        "img_id": "x1v12UGZedjS2uVBa55j_A",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. MacNarly burger!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/x1v12UGZedjS2uVBa55j_A/o.jpg"
      },
      {
        "img_id": "nqwZeZwT5B84Y9CfpejfAA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nqwZeZwT5B84Y9CfpejfAA/o.jpg"
      }
    ],
    "user_id": "psu7rdVsoE0PLfiRMNi6dA"
  },
  "AQsstgoAbj1rW4YHN3IBiA": {
    "date": "8/19/2017",
    "text": "Awesome staff, great fish tacos and guac! Fun atmosphere for small or large groups. This place is a hidden gem on Mill Ave. part of the fun Mill Ave scene but not part of the super young college crowd.  If you like burgers, tacos, and beers this is the spot for you!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "f6acxsqN8KWG-3ituBeyIg",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Loads and loads of tacos!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/f6acxsqN8KWG-3ituBeyIg/o.jpg"
      }
    ],
    "user_id": "K3bJiRAVYiEUzxOFSpqV9Q"
  },
  "OlVOtxcCrX6NZwOlnHIUsg": {
    "date": "2/11/2018",
    "text": "Food is ok. My first time was excellent. This time it was dry. They give out catsup in tiny dishes so couldn't choke most of the meal down. Service is sloooooooooooow. We came on a Sunday close to 145. It was almost 3 by the time our food came out. No apologies no explaining. Just a bunch of workers looking and dancing and messing around. Too bad food is good but dealing with the place is not worth the wait.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QSfk1gGGcW-d2K5d0HWS1w"
  },
  "dc9YsIYn1LUyYzR_T1E6Jg": {
    "date": "8/10/2017",
    "text": "Just get the PB and J burger.  It sounds crazy but it's probably one of the best burgers I've ever had.  Love it.  Pasta is okay.  I would just stick to the burgers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GbMeEI5j8v5dAp6PvLRvJA"
  },
  "sjyJKhCh3tKjUuFRaEctsA": {
    "date": "5/11/2017",
    "text": "Just had the porkster with sweet potatoe fries. The burger was cooked perfectly. Pork and BBQ said we as good but not great. Friend had the Hangover. Said it was fantastic. The egg and green chile were cooked perfectly. Service was great. Sides came out wrong and they gave us an extra side. No questions asked.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "34KbkSalXNBGYdJBHczK4g"
  },
  "iXFEf6O6eM9p9LwXXyF6_g": {
    "date": "9/28/2018",
    "text": "i love this place!!  their burgers are to die for and you HAVE to try their sweet potato tater tots!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w1HtaKmvA1qKH3Mz_XnBhg"
  },
  "SaqlIo5WjRiznjowtBLrIw": {
    "date": "9/28/2017",
    "text": "First time here and won't be the last. Amazing! They were out of onion rings though :( so definitely will be back to try those!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "O-VAhssIWkpyPhept0habg",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/O-VAhssIWkpyPhept0habg/o.jpg"
      },
      {
        "img_id": "Di86QGrAQ4b7nevtr_TBXQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Di86QGrAQ4b7nevtr_TBXQ/o.jpg"
      }
    ],
    "user_id": "bgSEyP2uosLxO8g3Ulx4aw"
  },
  "-poqtvRfPfNc1GEYc-vmDQ": {
    "date": "3/2/2017",
    "text": "It's not often the BF and I find a place to eat we both enjoy. I'm vegetarian and gluten free while he's a Bacon, Bacon, Bacon, Beef, Potatoes and any other kind of red meat sorta guy. Anyhow, this place is perfect for us! He ordered the PB&J Bacon Burger (which he absolutely loved) and I ordered the Veggie Nuggie with a gluten free bun (very filling and delicious). We both enjoyed our meals and are planning another trip back before we leave the area. There are many great menu options for both of us to choose from, the service was great and the atmosphere was relaxed and welcoming. I highly recommend Rehab!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "NsEOp8dIxRQMcw3DgvHz6g"
  },
  "rclnAaMQ0vfpDaBtQV5tYQ": {
    "date": "8/5/2017",
    "text": "The pb and j burger is definitely something to try! I added a fried egg on mine and it was truly a glorious mess, maybe not too suitable for a first date unless you want your partner to know you can get down and dirty. The sweet potato tots and chili cheese fries were lit! It was happy hour so the Mai tais were flowing and were also delicious and strong. My boyfriend got the large bistro burger and plain fries and said that the taste after a while got boring, because it was so big. I just had one bite and it was pretty tasty! Our server was super helpful and nice! I definitely recommend coming, especially during happy hour, if your ready to go to town on delicious food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YLEsGZAbr2uF3eqrQioMdA"
  },
  "MryzqR_lCXfOVZrGvuoSpg": {
    "date": "3/16/2018",
    "text": "Salty...every thing. I was not impressed.  Service could have been better but was not badd.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pspOnGFjgc2ZG8uuuG-xig"
  },
  "tL7NWHiEbriKpTKAyD5G6g": {
    "date": "6/1/2017",
    "text": "Indoor and outdoor seating. We sat outside on the patio which has misters, a nice touch on a warm evening. I ordered the relapse size Backyard BBQ burger with french fries. It was great. For this being the \"smaller\" sized burger.. it was definitely still a decent size!! I was hungry coming in and ate half. Our waitress was super nice and helpful. The only thing that kept me from a five star review was I asked for added bacon on my burger and did not get it.. I would have said something to the waitress but didn't happen see her again until we were finished eating.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rGUV4Z2hx1ga2XvEhR0AHQ"
  },
  "C-5TJlGxxF5s2cgaxur25A": {
    "date": "6/26/2017",
    "text": "Seriously good food!! The French fries are okay, but the burger was stacked high, juicy, well cooked to how you ask, and delicious! Truly a gormet burger joint. The ideas and amounts of burgers are amazing! A little hard to locate at first, but once you find this gold mine, it'll be worth the time and money.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YriXy7Whz8eCXIcXSlEC4Q"
  },
  "it0BF5cJCtAerQmkeI67NQ": {
    "date": "3/3/2017",
    "text": "This was our first time here and it was very good. The place is clean, and mellow. A nice spot to hang out on a patio. Our server Mike was outstanding. We couldn't ask more from him. He was friendly, helpful, informative and suggestive. He got everything right and was always prompt. The food was very good also. We had the tractor pulled pork, and the big beefstro burger. I highly recommend the big beefstro burger!! And the Vidalia onion rings!! Can't wait to come back.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "JkZhkcLnJS6-9vxTUKTcIQ"
  },
  "8Tsz1p_T1gwVdR_YkQqB5w": {
    "date": "4/13/2018",
    "text": "Great burger and great service!  We had 4 people that ordered a different burger and they were all cooked perfectly to order and tasted great!  Staff was fun and kudos to Aurturo for the awesome blue cheese sauce!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ba1cwF3Yhh_Cw8weSCkASQ"
  },
  "vz8Klwaiju-UPLh_TbtT3w": {
    "date": "3/4/2018",
    "text": "hostile staff when trying to place a pickup order for Postmates. It's not my fault you can't comply with the Postmates system",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gv_h73ayK9-hC3D6g_1SOw"
  },
  "6rV7G7m5CpIYTXSOTwIS9Q": {
    "date": "6/18/2017",
    "text": "OMG this place is amazing and the staff was fantastic.  I asked what they recommended and they gave me the top 3 most popular burgers.  I had the bacon, peanut butter and jelly which I was nervous about but it was the BEST.   You might as well skip the fries because the small burger will leave you so full you can barely walk out of there.   One of the best burgers I've ever eaten.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t4CvQq3j4rPBXtkSclYjtQ"
  },
  "iwSn-YGs00TzYpi86f1PEA": {
    "date": "3/12/2017",
    "text": "Came here on a Saturday and it was pretty dead at about 10.. the location is great and the food was decent. The portion sizes were huge and we weren't able to take any home since we were checking out the rest of the bars in the area. All in all, it was cheap and portion sizes were huge.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s_xQjhMPxOgmmV1K9wFswA"
  },
  "JQQ8yZ8MYzaLmVkEGd9cGA": {
    "date": "1/17/2018",
    "text": "Bacon PB & J burger on a pretzel bun was amazing! Wow. Their fries are delicious as well. Reasonably priced, too for the quality of food you're getting.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hQ4E5Do650x1OypMDZer4Q"
  },
  "XfpHnuna155vWmVn5YEHOw": {
    "date": "2/8/2017",
    "text": "Visited the Tempe location today with my boyfriend for the first time and was very impressed. This location was much more spacious. The food was great as always, I actually think they did a better job preparing our food than they did at the Scottsdale location. Our quesadilla was less greasy and more flavorful than the one we ordered last time we went to the Scottsdale location. Our waiter Brandon was awesome. He was very efficient, and courteous. Probably one of the best servers we have had. Both locations are great, but I was very impressed with the new location and the service we were provided with.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6h2Ab7yxDGLQI-AluHWasQ"
  },
  "fOPrYrh32fw-DRk7LpFvcA": {
    "date": "2/28/2017",
    "text": "Worst burger I have ever had. Asked for my burger medium, it was so burnt i tried to eat it but felt sick, and had ZERO flavor! after half of the burger it was so bad I let my friend take it for her dogs.  So food wise I would say a 0 but we did had good service (even though a little pushy) which made me give this places 3.. pretty disappointed cuz I was so excited to try a new place!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z-gEWtEXFeiBqfY-E0uEVQ"
  },
  "jV9SevtkCtPJn0nqzg4SyA": {
    "date": "1/5/2019",
    "text": "Good vibes + ginormous and innovative burgers + friendly service equals a winner.    With a large number of burger creations (and they also have other items), it was hard to decide on what burgers to get. We settled on the Bigger Beefstro Burger and the BYOB (build your own burger). Tip: unless you're really hungry or have a big appetite, the single patty \"relapse\" size is plenty filling.  Short verdict: the hype about how good the burgers are accurate.  The fries are average.  I thought the sweet potato taters were better than the fries with a crispy coating covering the soft interior.  The many positive reviews left by other Yelpers are spot on.  Oh, you gotta just love the name of the place",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JeT6Wm4eX-MBsbrLDhApBw",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Even the BYOB basic burger is huge",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JeT6Wm4eX-MBsbrLDhApBw/o.jpg"
      },
      {
        "img_id": "WhLu4eAif9vOFEPx7AVciQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Yes, &amp;#34;it does fit&amp;#34;",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WhLu4eAif9vOFEPx7AVciQ/o.jpg"
      }
    ],
    "user_id": "e-I4P_38hHLs3x-PsfzTYQ"
  },
  "mWkKK79S_XnRTByjFXJunA": {
    "date": "8/18/2019",
    "text": "Worst run place I have ever visited.  Waited too long to get seated and they only took drink order.  People were rude about us asking about time. It was not even packed and they said they were busy. Left $ for drink and left. Wish I could rate 0 stars",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vqc0qz9OLmwQ4wvEnbWYxQ"
  },
  "r3rZGR_y2draMJNVyXPytA": {
    "date": "12/23/2018",
    "text": "Ehhhhhh... I have been mulling over this review for a while, but here it is... I don't get it!! The burgers aren't that good. Yes, they have a lot of stuff on the burgers, but it doesn't make them better. The service was friendly. The atmosphere was comfortable and relaxed. I enjoyed hanging out but I just didn't love the food. I might go again and maybe try a basic burger so I can actually tell what it tastes like. I would recommend for a decent place to hang out and have a beer",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "g4klLH00SDKZgIz_447mgg",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/g4klLH00SDKZgIz_447mgg/o.jpg"
      }
    ],
    "user_id": "OIgSMLPKe1PDtP5I-1FrWA"
  },
  "5wKpq-WFkQeTvOrXEWtcXQ": {
    "date": "11/8/2018",
    "text": "Spending a couple of days in Tempe AZ with my Honey for a conference and stoked to be without the kids and with time to catch up on Yelp!  I have family in the area that loves this burger joint and was super excited to give it a whirl. It has a casual vibe similar to Islands (one of my all time fave burger spots).  We happened to come in during happy hour and imbibed on a couple of cocktails. I had the Margatini ($8) which is made with a shot of Patron, fresh lime juice and a splash of love. Not sure what the splash of love was- I'm guessing bubbly water?   My fella got the Mike Tai ($7) which is a classic mai tai. Happy hour prices on these particular cocktails are $2 off.   We both had a hard time choosing a burger since the menu is pretty extensive. I settled on the Hangover Burger which you can order in a 10 oz. patty (Rehab size) or the 5 oz. patty (Relapse size). You can also substitute any Rehab burger with a turkey burger, grilled chicken breast, a beef chorizo patty or veggie burger at no extra charge.   I ended choosing the Relapse Hangover Burger ($13.75) which comes with a fried egg, bacon, Colby jack cheese, and hatch green chili. The burger was really tasty, but in hindsight I played it pretty safe and wish I had been a bit more adventurous since there are some really interesting burgers on the menu!   My husband ordered the Relapse Hawaiian burger. ($10.75) It came with a patty topped with Black Forest ham, Swiss cheese, grilled pineapple and a side of Teriyaki aioli. He didn't really care for this one and misread the side of aioli thinking it came drizzled with teriyaki sauce. I would've made the same mistake based on the name of the burger alone. I had a few bites of this one and it was just okay, he had half my burger and liked mine better.   Overall, it was a good burger place to try. I'm  tempted to give it another shot before we leave. May have to talk my fella into it first!   FYI The Relapse size burger patty isn't as photo-worthy as the Rehab size keep that in mind when ordering. Lol ;)",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "8qszmgOjcayELvtVyU8Zyg",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. The 5 oz. Relapse Hawaiian Burger- topped w/Black Forest ham, Swiss cheese, grilled pineapple and side of teriyaki aioli. ($10.75)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8qszmgOjcayELvtVyU8Zyg/o.jpg"
      },
      {
        "img_id": "KWAyF2HOQW8ZsPMQ5FPAZA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. The 5 oz. Relapse Hangover Burger- fried egg, Colby jack cheese bacon and hatch green chili ($13.75)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KWAyF2HOQW8ZsPMQ5FPAZA/o.jpg"
      }
    ],
    "user_id": "37hir1FDTComfG2D_qSx1Q"
  },
  "9N5K5jPF03vI6rb1ayTZaQ": {
    "date": "11/9/2018",
    "text": "Was in the area recently on business and all I can say is please bring Rehab Burger Therapy to California!!  I went for dinner with a colleague and we looked over the menu choices and were quite surprised at first. Peanut butter Jelly and Mac and cheese burger were some of the choices! We were stumped between the two and which one to go with so we each got the opposite and spilt it in half! The saying ,\" Oh so wrong, but oh so right!\" absolutely applied to these burgers! All the different flavors somehow just went well with each other! The peanut butter was a melty consistency against the meat with just enough jelly. The macaroni my personal favorite was actually really good macaroni alone, and amazing inside the burger! If you're in the area and wanting a really good burger with a twist definitely give them a try!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "w3VUFDNOAJ5hytq3XXeWyQ"
  },
  "F20PMeBNbnLv1GgIYXf1tw": {
    "date": "5/21/2019",
    "text": "I really like this place! A lot of food and good service! I took my mother here and we got Spicy Mac and Cheese Burger and the Patty Melt. Both with French fries and sweet potato tater tots.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "drd7YX2d7U4cAnv38_1U6g",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/drd7YX2d7U4cAnv38_1U6g/o.jpg"
      }
    ],
    "user_id": "is1dmHox8Uww67-ZmjK-QQ"
  },
  "XQd7oz2m_oi4q9pwCUjt-Q": {
    "date": "11/16/2018",
    "text": "Every time we go to the movies we hit this place up! They have a huge selection of burgers and let me tell you the Phillicheese burger is A-Mazing!! Hubs gets the Ghost Pepper burger and we love the fries. There is something here for everyone even pastas. Salads, chili soup, grilled cheese. You can even create your own burger.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "3UdAMFiijgC8-GElC6jDaw",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Philly cheeseburger Relapse!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3UdAMFiijgC8-GElC6jDaw/o.jpg"
      }
    ],
    "user_id": "LP9_pEcY-ofbVGIhK9UUDw"
  },
  "oGfBFoNIfszQmev9oJH_Hg": {
    "date": "7/18/2019",
    "text": "Very cool theme to the restaurant and lots of unique menu items. Waitstaff is super friendly as well. Tried both the hawaiian and mac n cheese burger and they were delicious. Maybe this is a weird thing to include, but Rehab also has some of the best sauce options I've seen at any restaurant IMO.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5QlGkhk9VmldaGRfTxaVzA"
  },
  "xeH8W5DmmLQPuMgTQZKyCQ": {
    "date": "10/26/2018",
    "text": "So I love Rehab in Scottsdale and this one doesn't disappoint. I always get stuck on which burger to order and since I've had a PB&J burger at a different restaurant, I decided to get a different burger but my coworker got the Rehab PB&J burger. I think I was lunging for his food more than mine. While all the burgers here are good, when in doubt...ALWAYS get the PB&J burger on a pretzel bun.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PNzbj1UNjIRYiYwpIXzNXA"
  },
  "67ip_hQPoMs72TIN0gvnWA": {
    "date": "3/12/2018",
    "text": "I'm so glad I gave Rehab Burger another try after my less-than-stellar experience on my 24th birthday.   This time, I came during peak dinner time on a Friday, and I went again on a Saturday for their special maple bacon donut burger! Both times we were served without a hitch. We had great customer service and I was really REALLY happy with my food. Their sweet potato tots are so good and I love that you can order TONS of sauce.  I am meticulously checking their social media to see if there are any fun special burgers coming up, because I don't want to miss out! They usually have a special or unique burger that's only available on Saturday/Sunday. (I learned the hard way that they don't serve the special burger on Fridays... hence the reason I went 2x in one weekend, lol!)  The only thing I noticed going two days in a row is that their rare/medium rare cooking is a little inconsistent. On Friday, the medium rare was already a little bloody. But on Saturday, the medium rare was different. Just something my boyfriend noticed. (I got rare both times and had no complaints.)  I also wish they validated parking!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "zEs4E4al3AkXTwCKqUEgGQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. PB&amp;amp;J burger with sweet potato tots.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zEs4E4al3AkXTwCKqUEgGQ/o.jpg"
      },
      {
        "img_id": "hywVrqX9F6EfOPDD0yri3w",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Maple bacon donut burger.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hywVrqX9F6EfOPDD0yri3w/o.jpg"
      },
      {
        "img_id": "xUtbLLFwPkoNufMslkobdg",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Maple bacon donut burger, only for that weekend!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xUtbLLFwPkoNufMslkobdg/o.jpg"
      }
    ],
    "user_id": "MVyxYSpOP5RI6DnsJQox9Q"
  },
  "0y1Xs4zvytUzJXAWSmEM3A": {
    "date": "4/3/2018",
    "text": "Recommended by a friend and this place did not disappoint. I got the fish sandwich and it was delicious!! It was a huge portion and I got it with their sweet potato fries. It also came with a few sauces for dipping. My husband got the rehab burger and he liked it. He said it was a good version of a burger and very filling.   My only negative was the lemonade. It had a real funky aftertaste. Maybe it was the plastic cup it came in but not sure..  We came early on a Tuesday afternoon and was seated right away but it fills up quick. When we left, there was a huge crowd out the door. We sat at the outdoor patio and it was a nice lunch. I would definitely recommend if you are in the Old Town Scottsdale Area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "w8-riB6dCrOkMQh8DpqbUw",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Rehab burger and fish sandwich with sweet potato tots",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/w8-riB6dCrOkMQh8DpqbUw/o.jpg"
      }
    ],
    "user_id": "r3XSDhsMHCwtpQE8REHwow"
  },
  "ardxtPsS1VeF4lmCVAueyQ": {
    "date": "9/21/2018",
    "text": "Came here for their awesome lunch specials and delicious drinks after our wedding ceremony with friends and were not disappointed!! Everything was delicious and tasty and the service was great. Solid go to from now on when we are craving some burgers!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "U4a2HeYAMZuErNdst76bQg",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Don&amp;#39;t remember what it was just know it was delicious and didn&amp;#39;t last long!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/U4a2HeYAMZuErNdst76bQg/o.jpg"
      },
      {
        "img_id": "dXr5kIVEXetjR6tAS-osIg",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dXr5kIVEXetjR6tAS-osIg/o.jpg"
      }
    ],
    "user_id": "s7T98v83WmWQSdjOayx8bA"
  },
  "6AwqToQDucc_PNGoJosKqg": {
    "date": "3/13/2019",
    "text": "My family stopped in for lunch while touring ASU. Friendly service and great food. Had onion rings fried with a beautiful crunchy batter. Super great Cobb and wedge salads. Huge portions and a great happy hour. Burgers looked great coming out of kitchen.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TxlHegUslb50WTDDGFXSmw",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TxlHegUslb50WTDDGFXSmw/o.jpg"
      }
    ],
    "user_id": "D4Omollo_Z-UVVfOmuHieg"
  },
  "IAl1sQ6mK2IOb0gMLPp4Qw": {
    "date": "1/17/2018",
    "text": "This restaurant is located on a busy corner on Mill.  It's a rowdy area with lots of foot traffic and I would not recommend that you get here by driving.  I'm sure there's a parking lot nearby somewhere but I didn't spot it.  Booths are short and comfortably seat 4.  I ordered the mushroom and Swiss burger done medium with a side of sweet potato tots.  The burger comes with your choice of traditional brioche, wheat, or pretzel bun; all are excellent choices.  The waitress recommended the Chipotle aioli instead of Ketchup and I'm glad she did; it was a novel and delicious flavor pairing.   Overall a delicious burger and large portions.  I had a bite of their fettucine alfredo which comes with buttered toast, but I would recommend against it.  If you're going to come here, then you should definitely get a burger!",
    "rating": 4,
    "rated": {
      "funny": 33,
      "useful": 61,
      "cool": 55
    },
    "photos": [
      {
        "img_id": "3yFXY_F4O__6o7wrmEcSJQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Mushroom and swiss",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3yFXY_F4O__6o7wrmEcSJQ/o.jpg"
      },
      {
        "img_id": "uL2zQ36TZlVqY9A-SKhY_g",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Mushroom and swiss with a ridiculously generous portion of sweet potaTOTs",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uL2zQ36TZlVqY9A-SKhY_g/o.jpg"
      },
      {
        "img_id": "YCvWRSAfXEN3gR6yDE7s1A",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Fettucine alfredo with chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YCvWRSAfXEN3gR6yDE7s1A/o.jpg"
      }
    ],
    "user_id": "1F5wbSbtUBzxS8IsM7fWsA"
  },
  "FeVzXlK-veh4GvEG3hygiw": {
    "date": "3/24/2019",
    "text": "Went today for the 1st time Burgers were good but we specifically asked to not have the Burger Burnt for my girlfriend Hers came out burnt to a crisp They were really good hence the 4 star review They replaced her Burger and also comped her Burger Nice Touch French Fries and Sweet Potato fries could have been hotter the Burgers are really good If you don't like them burnt ask them to flat iron them",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z8mUU24sGkrlJ00F8oSl1Q"
  },
  "UHHYny3s08hyU73B_sSihA": {
    "date": "2/12/2018",
    "text": "First time at this location, been to the location in Old Scottsdale.  Ordered the Hangover which consists of fried egg, bacon, colby jack cheese and hatch green chili and we ordered it on a pretzel bun.  Very much enjoyed every bite and was cooked as ordered medium.  We decided to eat here before the ASU Basketball Game against UCLA, maybe it was our fault, but I expected to eat here an hour and go to the game, instead the service was extremely slow and took 1.5 hours and we were late to the game and missed over half of the beginning of the first half of the game.  I don't like bashing a restaurant for service, but this was extremely slow.  Burger and fries were very good and would come back again, maybe just need to communicate our plans to be prompt.  I will give really 3.5 Stars, so a 4 star, definitely not a 5 star",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IDLiboTvKrL9JIzFtISDCA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Hangover Burger",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IDLiboTvKrL9JIzFtISDCA/o.jpg"
      },
      {
        "img_id": "xlfqUofFCaBAu41wVPgZJA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Hangover Burger",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xlfqUofFCaBAu41wVPgZJA/o.jpg"
      },
      {
        "img_id": "6HVxaxbyBFCHN11YR3S-Nw",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Green Chili",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6HVxaxbyBFCHN11YR3S-Nw/o.jpg"
      }
    ],
    "user_id": "SRK_sUnvRmMwfexoL_DLQA"
  },
  "NVgMu75_ZsLv_zBwQf0Fgw": {
    "date": "1/31/2019",
    "text": "Went here for a beer while waiting on my daughter and photographer, who were doing her senior photos on the ASU campus and downtown Tempe.  Great selection of beers to choose from, despite being out of the first two options I selected.  After the photoshoot was done, we went in to grab a couple burgers to go and have another beer.  Service was pleasant but slow and not very attentive.  Burgers were great!  Had the Ghost Burger - two portion sizes for burgers available which is pretty cool.  The Ghost burger definitely packs some heat!  Nice bonus, the parking garage is right next door.  Nice, chill vibe.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Be0bxxLVkmoHt_YxEjBGmA"
  },
  "t-8zDsSt9igyIuJg5OkJnQ": {
    "date": "2/10/2018",
    "text": "I was stoked to check out Rehab--I'd heard really great things about it from a handful of people, it's close to my house, and they offer happy hour every day for those jabronies who work M-F, 9-5 (don't worry, I'm definitely one of these jabronies). But the experience as a whole was pretty underwhelming.   So to begin with, Rehab is on a pretty busy corner of Mill. Totally fine, and not at all a complain, just something to note if you're planning on driving. The restaurant itself is pretty spacious, with a huge bar, plenty of inside tables, and a sizable patio--bonus points for tons of TVs so you can shout at your favorite sports team from wherever you're seated.   We came here late afternoon on a Saturday, so it wasn't very busy at all. In fact, there seemed to be equal number of patrons and employees in the building. We were immediately seated and our drink orders taken pretty quickly; all standard stuff. But then our waiter didn't come back to take our food orders for probably another 15 minutes. Would've been fine and understandable if they were busy, but they definitely were not at all. After placing our food order, it didn't come out for another 40 minutes. What? It's a couple o' burgers. Again, would've made sense if they were slammed, but we were one of a dozen tables in there. Our server was very nice, but overall we were pretty disappointed by the lack of attention... And we are not typically people who want a whole ton of chattin' with our servers.   As for the burgers themselves, they were fine. I had the Mac Gnarly, a pretty simple burger in comparison to the rest of the menu, but I was feelin' it. I got the relapse (smaller) size because I am a small human, and it was still a ton of food for me. And super messy, but I can't hold my lack of grace against Rehab. It was a perfectly fine burger, just nothing particularly special. I feel like if I'm ever going to pay $10+ for a burger, I'm expecting it to knock my socks off. It was just fine. And a little bit closer to well done than my request for medium doneness, but that's not a huge deal. The fella had the Know Poblano on a gluten free bun. He had a pretty similar summation of it: perfectly fine, but not mind-blowing. He did, however, say it was one of the better gluten free buns he's ever had.   I will say that I really enjoyed the fries. Seasoned, but not too salty, and very crispy but still with a good amount of potato in there, they were very tasty. Pro tip: dip 'em in dat chipotle mayo. The sweet poTOToes were also tasty, and I don't generally care for them.   Overall, we were just expecting more from Rehab. Maybe we just happened upon an off day for them, but it's hard not to be a little bummed to pay a little more than standard for a burger that's a little lacking. At this price point, I'll be sticking to Cold Beer and Cheeseburgers.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "IqoPX2xo4_WdU3VMLKW2Lw"
  },
  "yT9yjnaNW2fCya4N33IQ7w": {
    "date": "1/14/2018",
    "text": "I don't think I've ever been addicted to a burger joint before. I've never categorized myself as a \"burger person\". This place has converted me! I've decided one of my life goals is to try every burger on the menu.   So far my favorite is the PB&J bacon burger--it sounds insane, but it's just insanely good! The Mac and Cheese burger is bomb too! I love the pretzel bun. Sweet potato tots with their special sweet sauce is heaven. The fries are delicious too, so either choice is a win. You can eat lighter and choose healthy subs like a salad for your side, and a smaller patty with a whole wheat bun.  Last time I was there, I wasn't sure what I wanted to drink before heading out to a comedy show with friends. I just knew it was cold outside, I was getting sick, and I needed a boost of energy. The bartender custom made my drink: coffee, peppermint liqueur, whiskey, and whipped cream. It was one of the best Winter drinks I've ever had! Every server I've encountered here seems to enjoy working here, they are helpful figuring out what to order and always friendly.   The bathroom offers fresh hand towels, perfect for freshening up after a hike at nearby ASU mountain. Reggae/rock music for an awesome island vibe. A full bar, outdoor seating, and tucked away from the noisy nightlife of Mill Ave, but close enough too all the action that DT Tempe has to offer.   I'm hooked! You just have to try it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "G3g5OdmKI3kWTZCnLXJ0Nw"
  },
  "Y1iOfjtC53eusqXJ9ELT1g": {
    "date": "5/22/2019",
    "text": "Best burgers and all around food you can get in Tempe. Pastas, salads, the best wings and so much more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "DiNAK9kTa8Xzh9UgL0bbRQ"
  },
  "2Z0M035u-qbg-l9tkzou-Q": {
    "date": "9/27/2017",
    "text": "The best burger I have ever eaten, the next time I'm in Phoenix I will definitely stop there again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "cIp08J_Tph9hVWZsej-rBg"
  },
  "LGOAjfxVJdqus6YDjpzpew": {
    "date": "6/13/2017",
    "text": "I just can't tell you how much we love this place!  We tell everyone about it and they always thank us for the recommendation.   If you don't get the PB&J burger, you'll be sorry.  Seriously.  Sounds weird but it's just that dang good!  The staff is fun and friendly. It's an absolute must visit place for us every year during our spring training trip.  Sometimes we go two days in a row. ;)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6IrP0U-r1ebCZZ2H69_gZg"
  },
  "i8L7oBz6k-ErfVzActj36w": {
    "date": "6/15/2018",
    "text": "Rehab Burger Therapy was delicious. I got the Swiss mushroom burger, the burger was well seasoned and cooked a perfect medium. The restaurant was clean and had a California vibe. Overall this place was delicious and I would definitely come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QZnj6lb8Sn_MuKiXujzUTg"
  },
  "nmto1bsg-8kRdhO5OXKG9w": {
    "date": "10/23/2017",
    "text": "I love this place and have visited several times now. But tonight I ordered a burger and onion rings to go.  Everything tasted great as usual.  My issues were that if you order onion rings you expect more than 3 onion rings. Also, I ordered chipotle aioli and my order was dry with no aioli at all. Very disappointing experience",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "greJy-QLDo9J1Yppv4mfOg"
  },
  "7lTwrREen_VbdJntoAt3dg": {
    "date": "7/29/2017",
    "text": "Amazing food. First time there I had the ghost burger (rehab edition) with fries and it was amazing. Very bold flavors and fresh ingredients. It's very Island like with island music so if you don't like that kind of music it may kinda throw you off. Other than that very good food. Thank you for serving delicious food!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "_IgKo_slTXFtpuSaJDTwiA"
  },
  "2u4dZ0F_KXXkoVCx_hEFHw": {
    "date": "9/7/2017",
    "text": "Everything tasted delicious. Staff went out of their way to accommodate us. Cook sent out some avocado and pineapple for our baby. Female bartender was a sweetheart. Waiter was awesome. We will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oI2S0IIqWEYzOfarR851Ww"
  },
  "vql1zVj2xoPV8jEEL-oDig": {
    "date": "5/1/2017",
    "text": "I loved  this place. It was amazing the food was fabulous and Michelle is the best   First time there will most definitely be back the bloody Mary was wonderful",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2EoQVKfPbYgLOl0aiUoNdw",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2EoQVKfPbYgLOl0aiUoNdw/o.jpg"
      }
    ],
    "user_id": "0s1ASG8g3CsptuDhDdU65w"
  },
  "w_us3FGKb19roWYbNQ0gKA": {
    "date": "11/22/2017",
    "text": "Great burgers, service and vibe...  We both received perfectly charred medium-rare burgers with crispy onion rings.  Keep up the good work, Rehab.  We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hutFptdtH0qMNDg9yQ5rZg"
  },
  "krZZFwN-MpPVc3boffwUyw": {
    "date": "2/10/2017",
    "text": "I was worried a bit when they opened this location hat it wouldn't live up to the reputation and. Quality of the old town Scottsdale location but I must admit I was very wrong. As a matter of fact I thought this location was better! I was with a group of three and we arrived at around 12pm for lunch and got seated right away. Service was prompt and our waiter suggested and brought out multiple dipping sauces for our fries and sweet potato tots, DELICIOUS!! I recommend getting a burger your first trip, more specifically the rehab size!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LhrTF1rOJJpT0H_FqxNdCg",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Yaaaas",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LhrTF1rOJJpT0H_FqxNdCg/o.jpg"
      }
    ],
    "user_id": "KlVesLfnIKzXG3-NRcmvqQ"
  },
  "e2huuocZ4a6s3z3ue92s8A": {
    "date": "12/23/2017",
    "text": "This is the best burger I've ever had. I had the porkster burger and a Mexican beer. The beer was cold. And the burger was fabulous. Highly recommend. Enjoy. Also, my step father had a salad. It was also amazing. Highly recommend. Enjoy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tBl_V5UgI7ae0BO14CYG8g"
  },
  "hEVdbYhjsQ_1zNA62li-HA": {
    "date": "6/17/2018",
    "text": "The jalapeno popper burger is off the hook. Also, try the Jamaican corn.....so delish!!!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CwpI5MlK4UDVxv6rYrcmOg"
  },
  "dg4zBbnprIgK89Q3QVsVWA": {
    "date": "12/16/2017",
    "text": "Awesome location in the heart of Mill Ave. This Rehab Burger location is more spacious than the Scottsdale location. The outside patio is very inviting and perfect for enjoying the mild Arizona winter. The staff and food are just as great as in Scottsdale. Been to Tempe Rehab Burger twice with no waiting.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nN8epUZ0fiCNDAPatXeAAw"
  },
  "3-mHI86EZ_NNoBS7jJnxGA": {
    "date": "5/28/2017",
    "text": "I was not impress.  My daughter asked for fries and corn with her cheeseburger and the waitress even repeat the order and forgot her fries.  I ordered the hatch burger with sweet potatoes tots and when I went to the restroom these other table had more tater tots than I did.  I was pissed off.  I had like 9 pieces and I didn't say anything.  Then my daughter went to the restroom and noticed the same thing and told me mom how come you only got little bit of tater tots and the other table theirs are over flowing with sweet potato tots.  .  I didn't say anything because I don't have time to get upset over tater tots.",
    "rating": 1,
    "rated": {
      "funny": 31,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gfXcH1UcoY4SuJyHbU9nVg"
  },
  "E0h0gJZ7x7BtGHLoDIivog": {
    "date": "6/14/2018",
    "text": "I was visiting Tempe from Georgia and, at a hotel employee's suggestion, walked to Rehab Burger in 109-degree heat. Worth it. Great menu options. I opted for a salad that had generous amounts of chicken, avocado, and pecans, all items that other restaurants tend to be stingy with. The salad was great, the grilled chicken was flavored well, and the bartender who took my to-go order was personable. Great experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MDSmEp2cZCx7W0OJjbczxA"
  },
  "rPIckfyQ6jW-2c1KeTMYeA": {
    "date": "1/13/2017",
    "text": "It's finally open! I'm doing the first Yelp review! Great food! I got the porkster burger and it did not disappoint! The burgers a little pricey, but great quality. Totally worth it! Lots of fun libations too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BdjIGrYsk0C7NknjPvdd7A",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Porkster burger! WONDERFUL!!!!!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BdjIGrYsk0C7NknjPvdd7A/o.jpg"
      }
    ],
    "user_id": "rByJjJ1rr2yysxGPpdyTLg"
  },
  "YuoKyySAneM16VJAoEv8XA": {
    "date": "3/19/2017",
    "text": "I have been looking in to this place for quite some time and finally got the opportunity to go it was by far the best burger I had in a long time from start to finish we felt very welcomed our  server Robyn took very good care of us and was very friendly to my son everything was served in a timely manner we actually got to enjoy our food and we where not ruched to leave like other places some of the burgers brought out where OUT OF THIS WORLD lol I'm definitely going back and I am recommending this place to all my fault and friends",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Q7baEgtkMAorCOG_FJT9iA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Q7baEgtkMAorCOG_FJT9iA/o.jpg"
      }
    ],
    "user_id": "hxLA6WmhpKJRIqpVj6DliA"
  },
  "_HqUMQPhkUOO1m4E9lLOzA": {
    "date": "7/21/2017",
    "text": "This is my new favorite burger place. I had the PBJ and Bacon Burger and it was absolutely the best burger I had in such a long time. The fries were really good as well. We went during happy hour so we had a mimosa for $5 (regular $7) and that was pretty decent as well. The service was nice, not too loud, and just an overall really great experience. Can't wait to go again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "7k_sLvmhHsILAGKexENQpw"
  },
  "RMcuZjDLDUWjtYdkBsEUkg": {
    "date": "6/7/2017",
    "text": "Love the overflowing tater tots. My fave by far. Sometimes I use the big Baba Booey soup spoon to just scoop up about 6-7 per bite-nothing beats mouthful after mouthful of tater tots. I pretend I'm eating a giant bowl of oatmeal, only it's tater tots.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TLOCdZDEQkbSqIdn3Zm5pw"
  },
  "0CcCeGU37AZ4wqo9s7l1sA": {
    "date": "4/22/2018",
    "text": "In town for a long weekend with ma' boys for spring training.  Dodger game was sold out so we wound up going to the Giants game which is a few blocks from Old Town Scottsdale.  Snuck out of the game in the top of the 8th because all the starters we're out.  Wandered those few blocks back into town and stumbled into Burger Rehab Therapy.  Got a table just in time as the \"after game rush\" was a few minutes behind us.  The place was buzzing.  Staff was pleasant, fun and attentive.  Reasonably priced drinks were ordered, served quickly, and tasted wonderful.  Second round was ordered immediately and again served in a flash.  For me, music can add or subtract from a dining experience. For this encounter it was a big plus.  Good classic rock & roll, the Stones, U2, the Eagles, and for good measure they threw in some Beach Boys.  The only thing missing was Stairway to Heaven and Free Bird. The place was filling up fast with the \"tardy goers\" but I didn't notice any change in the pace at which our troop was being taken care of.  We reviewed the menu and discussed the many choices with each other as well as the servers.  They were happy to outline the choices in detail and include the \"extras\" locals (not us) usually enjoy.  This was a big help in deciding.  Among the squad we wound up going all burger.  No shrubs or calamari for these cavemen.  Again the service was stellar.  Quick and on point. Burgers were cooked as ordered.  The man-boys had the Porkster, the Hangover and the B.Y.O.B. We had onion rings, skin-on fries, sweet potato tater tots and Jamaican Corn.  I went way off the radar and had the PB& J Bacon Burger on Brioche.  Oh my word! It was sloppy. It was sweet. Couple that with bacon, cheese and a well cooked beef patty and it was hands down the craziest and one of the best burgers I have had in a long time.  It was a sticky, sweet, savory, tasty, mess of a burger. I felt I needed to take a shower afterwards because that peanut butter was everywhere.  Even found a little behind my ear the next day at the Angels game.  I wholeheartedly recommend this place to anyone that wants to relax, enjoy a good meal, enjoy some music and make new friends.  Can't wait for spring training 2019.  Save a taco, eat a burger!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g4gPyU2cz6V4XmSVYnpCxA"
  },
  "Bqqf8y0POiGcBtKmEO_Eug": {
    "date": "6/24/2017",
    "text": "Oh my gosh! Burgers are giant! And so was the club sandwich I had. The fries were awesome, love fries with the skin on. Just wasn't crazy about the sitting. Wish they had more booths. But the long table counter type doesn't create much eating enjoyment because kinda impersonal. The prices were very good  considering the amount of food you get. I would come back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "HNoNWxUcb4_9dfG0P5UyZw"
  },
  "iQt9_-CjEf-XWNFMRrEQqg": {
    "date": "7/11/2019",
    "text": "***Update 2019.7.11*** It's been a while since I've been here because I live farther away but I convinced my co-workers to try it out. I had the spicy Mac& cheese burger again and it was just as great I'd as I remember it being.   Also, our waitress (the one with short dark hair and a pretty smile) was great.  *****************  I've been trying to get over to this place since I moved to Arizona 2 years ago.  Starting off I think the beach bar was fun and not over the top with the surf boards and Tiki bar decor. I noticed a very reasonably sized bar right when we walked in which is very convenient if you just want drinks and a little food.  The place was packed and we only had to wait a bit because all the low tables were in use and we had someone in a wheelchair with us. It wasn't too long of a wait and the food would have made a longer wait worth it.  I'm a beer snob so the selection was pedestrian at best but their specialty drinks and hard liquor selection makes up for the lack of high end beers (I didn't show up for the booze though).  We ordered the pig wings appetizer which were melt in your mouth good. We ate the appetizer so fast that the timing for the main entree seemed long but was, in reality, reasonable.   I ordered the spicy mac n cheese 10oz burger and fries with the pretzel bun. My first thought when the plate arrived was that the food pics I've seen match the grandeur with which I was presented. Also, my burger was cooked medium which may be too much. Next time medium rare (and I usually like meat well done). I also think that the 5oz option is more sensible unless you are 20 years old and really hungry. The fries with the chipotle ranch were cooked well and complimented the whole meal ( I didn't have that \"I loved the burger hate the fries experience I was expecting\"). There was even a huge tasty dill pickle spear served on the side.  The next burger on my list will be the PB&J with Sriracha.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PVYFPAc5doMO1m4Lh5xHOQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Mac n cheese burger",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PVYFPAc5doMO1m4Lh5xHOQ/o.jpg"
      }
    ],
    "user_id": "tDO7sFFz004X2oH_gU9adw"
  },
  "2ZHH77AMyKlDPYTVNLCv-w": {
    "date": "7/20/2019",
    "text": "Sadly, this location doesn't seem to be as good as the Scottsdale location.   I ran in just to make a take-out order and I wasn't all that as impressed w/my experience. The place was empty, but the employees seemed to be annoyed w/my presence and the bartender didn't even ask me if I wanted a drink while I waited for my burger.  My food wasn't terrible, but my order was wrong (the burger was missing the BBQ sauce).  Overall, it wasn't a pleasant and experience. If I decide to return to a Rehab Burger, it won't be to this location.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZyvxeVvH2w3vBLeBcfNVkA"
  },
  "42uhGoneVc1mCYdr9h77jA": {
    "date": "4/28/2019",
    "text": "Had a great experience. I order the BYOB (build your own burger) and sweet potato tots. I originally ordered the burger on a wheat bun. When it arrived the bun was super old and hard. I asked the nice server to replace with a regular buns. She immediately obliged. The regular bun is brioche and it came out quickly. Once the bun was switched out, my meal was superb!!!! The burger was great and the sweet potato tots were AWESOME!!!  Please give this place a try!!!!! It was the best meal I've had since here.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "xN3HhNRCBNS3LetNie3tYg",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Burger and sweet potato tots",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xN3HhNRCBNS3LetNie3tYg/o.jpg"
      },
      {
        "img_id": "rXBbeN8bh3KK01XzZymr_A",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rXBbeN8bh3KK01XzZymr_A/o.jpg"
      }
    ],
    "user_id": "S5XqS0qM1TMc24L6qUDJnA"
  },
  "3yhjDI9jzdKmsfGq8itQ1w": {
    "date": "8/22/2019",
    "text": "Mac veggie Burger looked delicious until I tried was so gross worst veggie patty Iv ever had don't try!! If your looking for a vegetarian option it's Not worth the money!!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kCqg7Ldpj5JWwEScqF7Tcg",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Had the spicy Mac and cheese and substituted the patty for a veggie patty with half fries and half sweet potatoes",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kCqg7Ldpj5JWwEScqF7Tcg/o.jpg"
      }
    ],
    "user_id": "xcjZGhw6tSqVkXv5GkiO3Q"
  },
  "7ciY8RQNdokFyCz-Q_ikZQ": {
    "date": "6/9/2019",
    "text": "I was excited to try their Hatch burger since I love me some Hatch chilis. Alex, the bartender, was super friendly and attentive. It's clear that all the staff here care a lot about their customers' well-being. I got the Hatch burger with a turkey burger since I don't eat beef. The burger was super juicy and flavorful. I was impressed as most turkey burgers at burger places don't seem to have much of a personal touch to them. I however wished there was a bit more heat, as I didn't find the chili wrapping the burger or the chipotle aioli very spicy. Luckily, they had lots of other hot sauces available.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "dV8dmH_difjiHnruuqSXnQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Going to rehab!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dV8dmH_difjiHnruuqSXnQ/o.jpg"
      },
      {
        "img_id": "s888UiM5t-kRHKpGbT2dkg",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Hatch chili burger with a turkey patty",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/s888UiM5t-kRHKpGbT2dkg/o.jpg"
      }
    ],
    "user_id": "e7MEzEQMjqNPZfYthZKhwg"
  },
  "1z3N_tVuZKaZddRCsCIwIA": {
    "date": "8/2/2019",
    "text": "These burgers are TO DIE FOR!!! I'm always excited to visit PHX specifically for this reason. The burgers are so unique and taste like non other. Service is usually pretty good, and location is perfect. If you're looking for massive amounts of flavor in your burger, try the PB &J burger. This baby is bomb!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bXBFMlpACKPDQpkzBf9Jbg"
  },
  "jXx3JZzIcuNsYQinoMwXYQ": {
    "date": "1/7/2019",
    "text": "I've had this place bookmarked for a really long time & was craving a burger one night. So my girl and I decided to stop into here.   We started off with the philly chz fries (half order). & oh my goodness, they were freakin fireeee. I could have just gotten this as my meal & would have been completely satisfied haha.   I decided to order the spicy mac n chz burger, rehab size. And my girl got the Hawaiian burger, same size. These burgers were so much better than what I expected them to be. And they're so huge! When our food got to the table, I thought to myself that I should of just ordered the relapse size because the rehab was so much bigger that I thought it would be. Both burgers were really good. Cooked to order. Great flavor as well.  Their fries on the other hand are just bomb in general. They out some type of seasoning on them that make them so delicious. We were trying to figure out what kinda seasoning it was but it definitely was something different from anything we've ever tried before. It had a tangy lime salt taste to them but they were really good.   Service was great. Parking can be a pain though!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "jC4FoSSgi3ItbKdveM5V1A",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Spicy Mac &amp;amp; Chz Burger. Rehab sz",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jC4FoSSgi3ItbKdveM5V1A/o.jpg"
      },
      {
        "img_id": "s8EniIXq4v-FcYS9e7xwTA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Philly Chz Fries!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/s8EniIXq4v-FcYS9e7xwTA/o.jpg"
      }
    ],
    "user_id": "uhYUuzBbz1q_uPeTj4-I2g"
  },
  "y6pHvt_lLHCuuQ5N0h_Uhg": {
    "date": "7/26/2019",
    "text": "We expected a lot more from this place. There's a lot of exciting looking burgers on the menu but when ours came out they kind of fell flat on flavor. The tots were meh. The service was good and prompt but the overall experience just left us unimpressed. Fine spot to try out but considering there are so many options there, probably somewhere we won't go back to.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_UAMIqlyoAil2TsrBWZdlA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. 10 oz. Rehab Spicy Mac-N-Cheese Burger 5 oz. Relapse Backyard BBQ Burger",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_UAMIqlyoAil2TsrBWZdlA/o.jpg"
      }
    ],
    "user_id": "BAoV5DfXCSFyDkgEjChjIw"
  },
  "8r-n9Kwt4HywyKftf3idkg": {
    "date": "8/11/2019",
    "text": "This place had clean tables, a nice staff, food was good, not great and their burgers are definitely not $10 burgers as they charge. Two people cost us over $40! They are $6 burgers at most. Never going back there again solely because their prices aren't justified. I can eat much better, less greasy, higher quality food for $45.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kPR1Ap-zmjueZC1xxKRFog"
  },
  "Ef235TWYQqKfCHWK8ONcZw": {
    "date": "4/25/2019",
    "text": "Mmmmmm - delicious burgers and pretty cool ambiance. We had the jalapeno popper burger and my guy had the Hawaiian burger. We enjoyed both along with chips & salsa.  The wait was a little too long and I noticed my burger was a little cold but server was friendly and attentive so we didn't mind.   The outside seating was great too! We live in Seattle so we totally enjoyed the opportunity to hang outside while we ate our yummy burgers.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SFcM3BxEAiDurI8zR90K_A",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SFcM3BxEAiDurI8zR90K_A/o.jpg"
      }
    ],
    "user_id": "DDWa-EMyUiwdXGt8nJ117Q"
  },
  "qRwxTmFA7Rywopiiiqk6og": {
    "date": "3/10/2019",
    "text": "Every time I have come here I have left very satisfied with my meal, my drinks and the customer service. Rehab is right in downtown Tempe where it gets a little crazy in the evening's with the college nearby and it's a party scene in this area most nights. Parking can be hard to find, or you can pay for parking in the garage that's within walking distance. The food is amazing. The burger with mac n cheese is a bit of a mess to eat but such a great gluttony menu item. I tried a few other burgers/sandwiches and the chicken wings are really good here too. There's a full bar and several beers on tap. The decor makes you feel like your near the beach. Overall this is a must try..",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 13,
      "cool": 11
    },
    "photos": [
      {
        "img_id": "_unFQNDMau_9odcpNWHTMw",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_unFQNDMau_9odcpNWHTMw/o.jpg"
      },
      {
        "img_id": "gEvBoUQvhYq6aky00sBlTQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Spicy mac-n-cheese burger, yummmm..",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gEvBoUQvhYq6aky00sBlTQ/o.jpg"
      },
      {
        "img_id": "WLwbBET6bkPp5b-vH7wA-g",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WLwbBET6bkPp5b-vH7wA-g/o.jpg"
      }
    ],
    "user_id": "HvYc0jpkjloM15zUD0obow"
  },
  "HmfOVhMFlwyGsi7Y1qqHRA": {
    "date": "9/18/2018",
    "text": "How does that Amy Winehouse song go? Tried to make me go, but I said no no no?   My four colleagues and I stopped in for a lunch break, at the special request of one particular burger-loving guy who seriously needs therapy. Interior decor was funky, the menu looked great, and we were excited to get down to ordering and devouring.   We made quick decisions of a grilled cheese with pepper jack and side salad with chipotle ranch (me), spicy chicken wings with fries, Philly cheeseburger, and jalapeno popper burger with tots. That's where our high ended and the downer kicked in.   Sadly, we waited and waited and waited for about 25 minutes for our food to arrive. This was weird because there were only like 4 tables with patrons at that point, and a couple people sitting at the bar. By the time our food arrived, we need to run out the door in order not to be late for a meeting (which we still were, darn it). As the food was delivered, we immediately boxed up our plates to go, and then still had to wait for the check.   When I finally got to eat my GC, I was disappointed by the ratio of bread (way too thick) to cheese (way too little just melted in the middle). The salad was fine. My meat-loving colleague was pleased with his enormous cheesesteak burger, spilling out the sides of the bun. My other colleagues were disappointed not to be able to eat their meals hot and fresh, rather from the to-go container on the run and cooled.  Our server was nice and I don't blame her for the ridiculously long wait (not sure what was going on back in the kitchen). But also, she never came back to give us any status updates. It really would've been nice to know the timeframe rather than sitting there feeling forgotten and frustrated. We could have ordered a beer or an appetizer to pass the time and satiate our hunger. Alas, nada.   I had higher hopes, but this rehab 1-step program worked and I won't be back.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ruygzXzxsvd0tLCctj-OMw",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Jalapeño popper burger with tots.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ruygzXzxsvd0tLCctj-OMw/o.jpg"
      },
      {
        "img_id": "0KRNnfqJCyjw9poXnImLcg",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Sombrero piñata hanging from a tandem bike hanging from the ceiling? Sure, why not.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0KRNnfqJCyjw9poXnImLcg/o.jpg"
      },
      {
        "img_id": "D8QziOAwCuSOFy1Kt4XE9g",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Bar.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/D8QziOAwCuSOFy1Kt4XE9g/o.jpg"
      }
    ],
    "user_id": "ES9iOw3bysnt7kd_kzUMXg"
  },
  "njYOWVxBiVtfoPYx_IDjTA": {
    "date": "7/6/2019",
    "text": "I work in the area and walked by here a few times and every time it always smells so delicious. I decided to stop in and try it. Man am I glad I did the burger was cooked to perfection. I will definitely make this place a regular lunch time grab for me. 10 out of 10 would recommend you to try this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "V5g98qPnj4tI-4cEqgi69g",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Delicious",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/V5g98qPnj4tI-4cEqgi69g/o.jpg"
      }
    ],
    "user_id": "no2OuNib8ebr_IX96oGJww"
  },
  "G5q7mxOGavgHDrFR8IERoQ": {
    "date": "8/11/2019",
    "text": "This was the most mediocre burger I've ever had. No flavor at all. To start, I asked my waiter for a few straws and he took them out of the wrapper and put his hands all over it and then put them in our drinks. Out of three of us, no one enjoyed our meal. Not to mention one of us got like double the fries, sucks bc that was the only good thing on my plate. Also the parking situation is terrible. It's $6 and if you forget your ticket you're screwed. My other dining partner had to get a new ticket and paid $12 for parking. More than the burger even was and it wasn't worth it. If you want a decent burger for a third less of the price, go to Chuckbox down the road. Free parking and a muchhhhh better burger.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0dogs4lw-qhpV527fBpOTQ"
  },
  "H0vDIZ-SK5dCl7mL4M9CNA": {
    "date": "8/21/2018",
    "text": "Holy hamburger! These burgers are great! We have been to the Scottsdale location in the past and were having a staycation weekend nearby this location so we decided to drop in for dinner. There was no wait when we arrived although it was early (around 4pm). We were seated immediately and our drink order was taken quickly.  Everything we had was delicious. One of the burgers we ordered was massive! Only my husband was able to finish all his dinner the rest of us had leftovers. Everyone left full and happy. If you are in the area you should drop in for a bite to eat!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v4fT6mIxgjho_CLR2wiXvg"
  },
  "13kMsaPbzMd7-HT3LELNtw": {
    "date": "7/4/2019",
    "text": "Rehab Burger Therapy has some of the best sweet potato tater tots I have ever tasted and they are included with an entree purchase. Additionally, they have a huge selection of burgers on the menu. I had the 10oz Mac Gnarly burger which is their take on a Big Mac. The restaurant was pretty busy on a Saturday night even while school was out in the summer. I would go again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KXfflYFI9l9524Nj2WAPRQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. 10oz Mac Gnarly Burger with Sweet Potato Tots",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KXfflYFI9l9524Nj2WAPRQ/o.jpg"
      }
    ],
    "user_id": "SDLYNpiUsOHvQn7SxBn8Ew"
  },
  "J2YKL5kd7suxlbAJ3qUCkA": {
    "date": "8/25/2019",
    "text": "I heard that this was the place to go for one of the best burgers in town. The burgers was pretty good but it would have been better if it was hot when it came out. You could tell that everything sat before it was brought out. The server even mentioned it when I had to ask him to bring out my child's grilled cheese sandwich. That definitely sat in the window for awhile. It was very clear that everything was being done when it was convenient for the server. Not when he had time but when he wanted to do it. It's too bad. The food was pretty good but with bad service it doesn't matter.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E4Te6T-SC8PpUz0a4xh6rg"
  },
  "CI-ysbHdFwHNK9JbWEi7sw": {
    "date": "7/8/2018",
    "text": "Finally, after over a year of searching! We found our burger spot. I ordered a hatch green chile burger. Although the chile was mild, it had a spice to the taste which is more than any other chile served here in Phoenix.   Brad who is more adventurous ordered the spicy mac and cheese burger. WOW. The burger came out with a hefty serving of mac and cheese on top of the burger. Of course it had to have a pretzel bun. I tasted the mac and cheese and decided it was quite good.   The burger is a mix of several types of ground meats. Whatever the mix is, it works! I ordered my burger well done, since you can never be too careful with beef. Next time I will go with medium. This burger is that good. No need for worries. The meat is high quality. The fries that came with my burger were good. Skin on. Brad ordered onion rings. WOW WOW WOW! The onion is HUGE! The batter is light. You definitely need a fork and knife to eat these! They were the best we have tried in a long time.   For parking we parked in the garage on 6th/Mill. Short walk to Rehab.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "3EGB5SLSZjWkC0ZNQhYrEw",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3EGB5SLSZjWkC0ZNQhYrEw/o.jpg"
      },
      {
        "img_id": "xJqDmK49yAB71Yj84LXo0w",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Rehab at night",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xJqDmK49yAB71Yj84LXo0w/o.jpg"
      },
      {
        "img_id": "pNn_9KYiuQP8_u6RF1RnoQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pNn_9KYiuQP8_u6RF1RnoQ/o.jpg"
      }
    ],
    "user_id": "S33IUieqzZpVDZMwEvHQNw"
  },
  "dxu6uQ7DLLHSf3TolRDyfA": {
    "date": "8/24/2019",
    "text": "The waitress keara is the best waitress I have ever had. She is extremely well composed and friendly. I'm shocked she wasn't a manager!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jDdrbR53k5-wn0oofNUy1A"
  },
  "l0ihST1ms1W0QorDZWMing": {
    "date": "3/9/2019",
    "text": "Burgers and hotdogs no so fabulous., the service and wings was good. I don't want to write more",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RbXM1f9jzVh_QuSS6tv2Mw",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RbXM1f9jzVh_QuSS6tv2Mw/o.jpg"
      }
    ],
    "user_id": "npXFgXYefv5sC_qMmCEYJg"
  },
  "x7ZL6WLl0AJx5Eu-1VlJqg": {
    "date": "1/15/2018",
    "text": "Started out with the onion rings with various sauces  delicious! I was in heaven with the ghost cheese burger and the spicy Mac and cheese, it had fried red onions and some amazing sauce. Yum! Bring your appetite the burgers are Colossal.There was a 25 minute wait but me,my man, and our son ate every last morsel! Highly recommended",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rWbelwRG6DNYRxq82BEXow"
  },
  "N_hR9CkKVADAy1GkzGjNCg": {
    "date": "5/27/2017",
    "text": "Although this location is closer to home, I still prefer the Scottsdale location. Staff is more friendly there. Our waitress seemed pissy. Food and beer was worth the attitude.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "A1ZdDL8oYdYjN5iVX5IXVg",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. The Bar",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/A1ZdDL8oYdYjN5iVX5IXVg/o.jpg"
      },
      {
        "img_id": "d9_khrtypn-4QPFNyrPl3Q",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. The Spicy Mac and Cheese Burger and sweet potato tots",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/d9_khrtypn-4QPFNyrPl3Q/o.jpg"
      },
      {
        "img_id": "9Pe-Pwd6nQeDEvPoyNuJQQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. McNarly Burger!!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9Pe-Pwd6nQeDEvPoyNuJQQ/o.jpg"
      }
    ],
    "user_id": "0z2RFjZSB-INYF_Evh2iyg"
  },
  "wqKJvKwOrtvBTntfyPsl5A": {
    "date": "7/9/2018",
    "text": "Food was super good! The sweet potato tots are amazing. The atmosphere is really fun as well. When I was there, the restaurant was pretty empty. Only about 2-3 other tables. Yet the food still took forever and service was slow! Overall rally good food but service isn't great.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_QQ6l3CcGxdzz9R6m2ZauQ"
  },
  "UzI9jS-PxSQLQeNT2ZPxUw": {
    "date": "2/2/2018",
    "text": "This is my new favorite burger joint.  The BBQ burger was outstanding.  The 10 oz rehab patty was more than enough for 2 people.  The service was great as well.  Try this place, your going to love it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O7J5NsojIF2_hKw414QSxA"
  },
  "N2IO8e6qCVnCibMX7efeFg": {
    "date": "3/10/2018",
    "text": "Horrible service today. Love the burgers but service was terrible and left with no food. Had the Aloha festival this weekend and thought I would get a burger instead of standing in long lines at the festival with my son. I sat down and ordered a burger right away. Server brought waters and never saw her again. Asked the hostess after 25min if the food was going to be longer and she said she would see. Another 10 minutes go by and still no one comes by or checks on us again. Ended up leaving after 35-40minutes. I could understand if it was busy but there were only two other tables with people at them in the front and only couple people outside. Don't think I'll go back again after being disappointed by the service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1zul4Mw6DpwYlreXf214pQ"
  },
  "MgwsU0-z2102p0uf6gpuyg": {
    "date": "3/3/2017",
    "text": "The bacon cheeseburger was very good except the bacon. Even though it had good flavor, it was closer to beef jerky than bacon. My friends swiss mushroom burger was killer. Other buddy's gargonzola bacon burger wasn't. The cheese and the bacon were suppose to be in the beef paddy but we never saw either. We got a side of onion rings and they were very tasty but they had more hard breading than I like. I prefer a thinner more delicate  breading.  The fries were top notch; nothing to complain about.  Over all, if you are in the mood for a great big burger and fries, you can't go wrong with Rehab.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZKa9nvN1aSz4ihBR2PG7-A"
  },
  "HBMdgLbg0r93wIjysX-dTQ": {
    "date": "7/26/2018",
    "text": "I called ahead to make sure they were open today because last time we got there and they were closed on Mondays. We only had about an hour for 2 of the 6 of us. We got seated right away and got some iced tea and Diet Coke right away but it took at least 10 minutes to get some waters after I flagged the waitress down for the other 4 that met up with us. The server sat us at the big table for 6 but the last 4 people took a couple MInutes to find the place after having a little trouble with the underground parking garage and street meter. Not very convenient for those driving in. We paid 6 dollars for the underground parking and there is no validation. The parking garage must be owned by the city or privately. The food was pretty good but I've had better. The music was loud. It was hard to hear each other. The decor was very cute. The prices were decent for the prime location in downtown Tempe. It's a good thing our son asked for his salad in a to go container because it didn't come out until he had to leave. Service was slow, especially for July when ASU isn't even in session. Seemed like at least 20 to 30 minutes after we ordered that we got our food. We tried it but i don't think we will be back. Nice people though",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q9YEF68PvrXCCJ-jkAxabA"
  },
  "RoVl03bjgWNbfkMwpr6X0g": {
    "date": "3/3/2018",
    "text": "Great service, great menu, great quality. In town for few days. Took a shot from Yelp! suggestions. Highly recommend. Only thing - if I had to find one....I got a choice between a 5 ounce and a 10 ounce burger. I chose the ten because the five was just too small for a guy my size. Whoa nelly, that was a hunk of meat. Probably more than I needed. But boy, I left there well fed and happy. Also, my wife got the black bean burger. Said it was about the best she's ever had.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7AEafVgRMcJFAE-trCarUA"
  },
  "KLhlNvETL_Tbzy_ym_GPfA": {
    "date": "3/9/2017",
    "text": "The Rehab \"Hangover\" burger is awesome. Cool spot and super friendly staff! You won't be disappointed whatsoever.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bhgeLsRaL9kVhUSM886NaA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bhgeLsRaL9kVhUSM886NaA/o.jpg"
      }
    ],
    "user_id": "0o5-TajLtrM_OVbO5g5xxQ"
  },
  "hOurD_9vJencsB0nkVBUGw": {
    "date": "3/25/2018",
    "text": "Pretty good burger! The meat was really tender. Of course I asked for it rare but it tasted delicious and wasn't rubbery like some red meat tends to be. Delicious sauces they add to the burger and pretty good fries. They're very salty which I love!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yknSTB5VSuv-H4NxmteoeQ"
  },
  "9lsA3ssRk53fAQcTCH2EAg": {
    "date": "2/23/2018",
    "text": "The food was alright. We ordered chips and salsa they never came. The waitress took it off the bill. I had the pulled pork, the bun was soggy and there was no taste of pineapple in any of the sauces. There was too much meat on the sandwich when it came but that's just personal preference.  The sweet potatoes tots were disgusting, and soggy. Perhaps they were undercooked. The place was crowded and very noisy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8VQvojbdLHldxxVHTflL_A"
  },
  "AvP_USQJA2ksj9mzW8uaCg": {
    "date": "10/12/2017",
    "text": "For a quick snack before going to the Tour de Fat, my son and I stopped here.  We didn't get any burgers, though all of the ones and the rest of the food I saw looked very good. I'll probably go back to try one. Instead we had a couple of beers and the Calamari app. Being strips I was hoping for some thick cut, lightly bread, tender morsels. Instead we got thin short pieces, heavily breaded and very over cooked. Include a Marinara sauce that is so thick it's takes a spoon to dig it out of the bowl, and you've got meal frustration galore. We ended up asking for some Ranch and Blue Cheese dressing instead which help a great deal. Though to be very honest, a spicy thinner sauce, like a Thai Chili or even a good Salsa would have been much better. The server was great though she took her time getting to us and checking on us as we ate. If you go, try a Burger. They looked like the best option for something satisfying.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mE1s4m1_vaVPY-pMu7gHvw"
  },
  "vq7bJbO_1jcj83BmZQ409w": {
    "date": "10/7/2017",
    "text": "Ate here after 3 months of hardcore dieting and I couldn't have made a better choice to expand my waistline. Ended up with the pulled-pork burger but was really debating the mac & cheese situation. Had to eat my food with a fork and I was all delicate and soft and small after 3 months of salads but I managed to put that delicious wreck down into my gut. So amazing.   Boyfriend go their weekend special, the Elvis. It sounded really awful, being topped with a Hershey Bar, Reeces Cup, and like peanut butter &  jelly... but it was stinkin' great. Holy fricken cow.   Drinks are waaay expensive (weeak Coronaritas) but honestly you wonder why you even got a drink as soon as they put the food down... no room for beer!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nfAxLjPlZq2VkhKqE2m9yA"
  },
  "NrYKTWs066YBM8qu8LfIOg": {
    "date": "2/7/2018",
    "text": "Ok, if you are looking for something healthy here just don't. That being said , one of the best burgers I've ever had!  I got the Porkster and it was insane. BBQ on top of the patty, inside a delicious pretzel bun with sweet potato tots on the side. Pretty sure my life expectancy dropped 5 years after eating it but I would do it again tomorrow. Every bite of everything I ate was heavenly.  Definitely give it a try! I didn't give it a 5 because nobody is perfect but it's very close for what it is!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l69MvYVDR_Is85uhj6CjQQ"
  },
  "ICk8a2PDMVguaflHGHPJ0Q": {
    "date": "2/7/2018",
    "text": "Will continue to come to RBT for as long as they stay around. Great portions and great quality burgers and sides. Great place to eat at, anytime of the day!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hpe1IkuaHkTK2LmtsqEiYg"
  },
  "J47Yo_NdBGxIc3ApMl0-AA": {
    "date": "4/14/2018",
    "text": "I have been saving this place for a special occasion. Well 18 pounds lost, and I am so happy I left this for my celebratory meal! We ordered the green Chile appetizer and it is a must! A tad spicy but full of flavor! I ordered the Spicy Chili Mac & Cheese burger and although it was still amazing... the Mac and cheese lacked flavor and not really spicy. But, the burger patty being perfectly cooked and seasoned made up for it. Their Coron-Rita is strong but super good! Overall a great place, nice and attentive staff. I'll definitely be back to try their infamous PB&J burger!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "rMCgPf-3BOZpRmbO1Ns_Pw"
  },
  "ppMhe8quEeT7TkI4Wywvrw": {
    "date": "2/27/2017",
    "text": "Super satisfying gourmet, fresh burgers. The ambience is relaxing. Service is great. The food tastes like its from scratch. Prices are reasonable.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5MQWz1sPGZckGZH50PpWWA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Spicy Mac-N-Cheese Burger.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5MQWz1sPGZckGZH50PpWWA/o.jpg"
      },
      {
        "img_id": "Ohn1t_H7PtL9qiWzpnnsCQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Corona-rita which is a mix of Margarita and Corona. Interestingly enough, the bottle also reads Coronita.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ohn1t_H7PtL9qiWzpnnsCQ/o.jpg"
      }
    ],
    "user_id": "BcLWOUIV2XsrEgpIWcMO_A"
  },
  "uP6y_KBQ3v7l6Zk1SC_cfQ": {
    "date": "9/25/2017",
    "text": "Super bomb but wanted one of these awesome burgers after 9pm! Gotta stay open later, you're on mill!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dciKXrcalJg5HnkKb8W-BQ"
  },
  "X3bx4r3XYh_gc4S2c5W0wA": {
    "date": "2/17/2018",
    "text": "They all know me at the bar. Save today no one has ever rubbed me the wrong way.  The pb&j burger is amazing. I always come back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mbKTJBBBwJxSKGadzSpqNg"
  },
  "f2JcB2KKdriNt2U-tcMP0A": {
    "date": "10/17/2017",
    "text": "The table was too tall for us tiny gals but the burger.. wow! Yum. PB&J won my heart. The decor had a very relaxing and casual atmosphere, kinda sporty. The staff was very friendly, and prompt. It was a very clean place, and it felt good having some water (like 10 glasses) of it on a hot day while waiting for my coke, and my wifes beer. The selection of burgers was nice and large, and while we shared the PB&J, others jumped out at us too. We will definiately be back now that we live in the area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3ZPQRbdphoIDATMtJE6rlQ"
  },
  "D-o7gzXBtMQDKErs4E97dA": {
    "date": "3/17/2019",
    "text": "Sat down with my family of four ( only three of us ordered) on a very empty Sunday afternoon. Took an hour and fifteen minutes for us to get our three burgers, and they were room temperature by the time we received them. Little to no service sitting outside, and very high pricing of around $15/person for average quality food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fajt0daRr88AAfMsvJxnAw"
  },
  "Nc4t-46mdI0DFGNjQGP4BA": {
    "date": "7/20/2018",
    "text": "The size of the burgers and variety is incredible even the dipping sauces but the flavor even with all of that said just wasn't worth paying for it's price. Still just for it's sheer unique characteristics of the kinds of food I'd recommend people to at least come once.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yHhd6bH60slyet1_wmCKVQ"
  },
  "3vul7w-mgMnGo73hPCoGBQ": {
    "date": "2/18/2019",
    "text": "They were out of everything which was pretty sad. One type of cheese one type of bun Only spicy bacon. We sat outside and service was HORRIBLE. Also both drinks i got served we're bad seemed as if they need to change their soda. One of the managers still worked hard to try and fix what our server wasn't doing. Waiting about 10 minutes before our drinks were taken then only saw our server again once. Also my food came out incorrect and after I said something they said it is because they were out of regular bacon..... Wish they would of told me before the fact",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DzIAINyc_ACMB-oZv_zj_Q"
  },
  "jWq01kmRs6K7E_boE87yzw": {
    "date": "6/29/2018",
    "text": "Good burgers, but super greasy! The French fries were alright but nothing too great. Good customer service though",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hdb2Tuo2wuDfzkY9oQ2jIQ"
  },
  "lZU5npWZkPS9z6yxcqsGKA": {
    "date": "12/5/2017",
    "text": "Rehab Burger is one of my favorite burger places in the valley. The food is delicious, the staff is friendly, and the environment is inviting. I have been to the Scottsdale location as well and everything is the same. The only reason why i did not give this a 5 Star is because I requested to have no jalapenos and green chilies on my Mac N Cheese burger, and the waiter gave my another customers Mac N Cheese hamburger with the green chilies still in it. To be honest it was not that big of a deal and the place was not busy at all.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aIO_QbCfH28yoNZGtpfV5g"
  },
  "-TDP391N-VOLAUjTVmY_8g": {
    "date": "1/16/2017",
    "text": "We are a huge fan of the Scottsdale location, so decided to foray into Sun Devil territory to check out the new location.  It's bigger, but louder.  We are used to loud, but it wasn't that crowded yet and had to repeat ourselves a lot.   Same amazing menu.  My favorites include their Pig Wings, and Hawaiian Burger. We love their sweet potato tots. A nice feature is selecting your dipping sauces. We like their pineapple teriyaki aoli.  Patrick's favorite menu item is the PB&J burger.   We love the option of two sizes of burgers and salads. Relapse vs Rehab.   On a whim we tried a different burger. It was our first time ordering the Pablano burger.  It had spicy onions on it, which were a little overwhelming.  But otherwise very tasty.   The service was great.  Good teamwork. I love that they want your food to come out the way you want it and sincerely check on your satisfaction.    We will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TsuSXVUYLbXtMXzZyOXgUg"
  },
  "GyilE_S8gOtZIKwsc88JsA": {
    "date": "11/22/2017",
    "text": "I find myself coming back to this restaurant as it is a great place to go for lunch (and study). I had the relapse B.Y.O.B with lettuce and onions and it was one of the most delicious and juiciest burgers that I have had. The seasoning was tasty and the burger was cooked to perfection. The fries were also amazing - thick, crispy on the outside and soft on the inside.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sxAqe5Ae24sc-ZvJgPKuCg"
  },
  "lGeDG-MJuOgcEU7RcDsATw": {
    "date": "6/8/2018",
    "text": "I just ordered a delivery, the driver is on time and the burgers taste good. The problem is they dont know how to follow simple instructions, i said separate the veggies and cut the burger in half. But its not what i received. Also the fries are too soggy.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QeNcMIYxITuq7NumuF7W4w"
  },
  "mJnAYhBUrKqOaYOpB2twKQ": {
    "date": "4/23/2018",
    "text": "I love the crazy burgers you can get here.  We asked the waiter for recommendations and he said that as crazy as it sounds the PB&J bacon burger is a top seller.  I went for it and it was good.  I would like to try it again.  The burgers are very large and filling and the service is good.  I have tried 3 other weird burgers here and they have all been great.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "fRclDad6qMwgW_l3jtRqig"
  },
  "3cIIus7zgbwYm2YVy735cw": {
    "date": "3/1/2018",
    "text": "I travel for work and always try to hit local places. Took the recommendation of the waiter to try the PB&J burger with bacon and sriracha. It was amazing. An odd combination of flavors that work. Place has a cool laid back vibe and lots TV's. I highly recommend it if you are in the area. A great find for this business traveler!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "X1VmaoUfajTIWegqK5XvcA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/X1VmaoUfajTIWegqK5XvcA/o.jpg"
      },
      {
        "img_id": "iMPHT7iH2M6swRgG_eACsQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iMPHT7iH2M6swRgG_eACsQ/o.jpg"
      }
    ],
    "user_id": "njWdc2G4ft4ZLhUUYheW0w"
  },
  "JqxVcF3YqNJ1ME682wCuCA": {
    "date": "2/28/2019",
    "text": "I like that you have a choice in size of burger. There is a wide variety of burger options. I had to try the PBJ Bacon burger. It did not disappoint! Portion sizes are plentiful and waitstaff is very friendly as well as good at offering suggestions.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YRL-LreUXoqRnw44FdpRiQ"
  },
  "U9IJDycKmsi1hlham5J_Ow": {
    "date": "8/26/2018",
    "text": "Thoroughly enjoy Rehab. Have previously been to Scottsdale location but this was first time to Mill Ave location. Our waitress was amazing. The moment she heard my wife suffered from Celiac disease she knew right what my wife cpuld amd couldn't eat. Very attentive, very helpful, had an opinion and shared it. Her follow up was great. Burgers and sweet poTOToes were delicious and cooked well. Flavors were on point and meat was cooked to order. Will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9k0uAduR4EeZoN5jrHebFA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Date night at Rehab Burger!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9k0uAduR4EeZoN5jrHebFA/o.jpg"
      }
    ],
    "user_id": "J7eqV4xIvJuuiqApLKJ1rg"
  },
  "qID7uCuZjkQP2-KnVOI0jA": {
    "date": "8/25/2018",
    "text": "Came in on a random afternoon and their burgers surprised me. Never thought a PB&J burger would taste so good!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X69l6XQrSA-NDp01JLHpMg"
  },
  "1sCh-izTBV-1mDR-I24FKg": {
    "date": "11/3/2017",
    "text": "I've been to the Scottsdale location but this was our first time to Tempe Rehab. It was Thursday all day Happy Hour so we enjoyed a couple of Four Peaks drafts for a decent price. My wife's Hatch Burger (she got the relapse size - 5 oz) was outstanding. The chile on top was grilled, with a bit of smoky flavor. I opted for the Hawaiian burger (rehab size - 10 oz). It was huge with a large grilled pineapple slice on top.   I had ordered it well done and, unfortunately, it came out still very red throughout. If it had been close I would have normally accepted it but I had to send it back. The waitress apologized and quickly took the burger back. I kept the plate of fries so I would have something to nibble on while I was waiting. A couple of minutes later, the manager came out and apologized about the mixup. She offered me a side salad or something while I waited. Because I had the fries I declined. She also said, \"of course, when you get your burger back this will be on me.\" The manager also came around a few minutes later to refill our water glasses. A few minutes later the waitress came by to say the burger would only be another couple of minutes. When it arrived it was cooked perfectly.   I'm going into a lot of detail about this because this is how you want to be treated when things don't go right. I did not expect to be comp'ed for the burger but it was a really nice touch. BTW, the burger was delicious, especially with the pineapple teriyaki aioli.  I'm not a gourmet and so as long as the food tastes good, the thing that matters most to me is the service. This one was top notch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ANuObAQNJTWIOfABJ1HAlA"
  },
  "TZHTK2hD15fajcaEmvFowA": {
    "date": "6/19/2018",
    "text": "Loved the jalepeno popper burger with no bun!  Huge portions of everything.  Our server Madeline was friendly and helpful.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zr4AfuC0gGxOQ0_Y144nTA"
  },
  "uJVO0CbVMphJaqGE5jdTcg": {
    "date": "2/7/2019",
    "text": "If you want a great burger and fries with an awesome environment, then look no further!  RBT is the place to gather, drink, and visit with friends and family.  The food at Rehab Burger Therapy is one of the best I've ever had and the atmosphere ties everything together--highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ls5ZEgkjBWhNsQYvc3Auzw"
  },
  "5JjGwQAGprhAANt1iH6Sew": {
    "date": "7/9/2017",
    "text": "We were looking for somewhere new to try so we came to Rehab Burger Therapy last night. It was Saturday about 7. We were welcomed and got seated right away. It took about 10 minutes for anyone to come over to our table to ask about drinks or anything. We ordered a chili burger, build your own burger and a hot dog. The chili was very plain with lots of tomatoes. I'd have to say this is the first restaurant where my kids didn't devour the French fries. They have an odd seasoning salt of them.  The food was okay. I thought the prices were reasonable. The service could have been better. Our server was super nice. Overall super slow. We may try again, not sure. Definitely worth at least trying once.   The easiest way to find is to access 6th street off of Mill Ave.  They are next to the parking garage.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YytWmgjl4_Emn77oX6PHMQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. BYOB with just lettuce.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YytWmgjl4_Emn77oX6PHMQ/o.jpg"
      },
      {
        "img_id": "_RkQLDJNyR3puhOc7yQeCA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Hot dog meal",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_RkQLDJNyR3puhOc7yQeCA/o.jpg"
      },
      {
        "img_id": "DM4V0nchuap4BdLECM_VfQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Chili cheese burger",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DM4V0nchuap4BdLECM_VfQ/o.jpg"
      }
    ],
    "user_id": "sNzn-y6tvnbJadQKxEDOzA"
  },
  "Id_xoMDnNKiCALp1AMRLLg": {
    "date": "12/23/2018",
    "text": "Eh, ok burgers... Not sure I would go out of my way for this place. Lots of options for toppings but just an okay patty...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eBcgSL9sCutgUwrnxB_3nQ"
  },
  "029NBIuXbFYa6z17izmwfw": {
    "date": "10/14/2017",
    "text": "This is one of my favorite burger places in Tempe! Their sweet potatoes tots are so tasty and you get your money's worth with the HUGE portions. Their drink list is also delicious, and I would recommend the Mai Tai!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZzWLzcZIg2rBjfqMrnOAUA"
  },
  "hPfuX0x-CsnpFCqMPuygNw": {
    "date": "6/15/2018",
    "text": "I arrived on Thursday night it was not busy which surprised me.  They have happy hour all night on Thursdays.  I ordered a spicy Mac burger and it was huge and very good!   You have a variety of sides and dipping sauces.  I chose the sweet potato tots and could not pick a sauce so the bartender brought me his four favorite.  They were all good!   The staff was very friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uqycOrzgEPkpOpL4UZp1CA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uqycOrzgEPkpOpL4UZp1CA/o.jpg"
      },
      {
        "img_id": "0oaSLgU372OnEskWIcSlsQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0oaSLgU372OnEskWIcSlsQ/o.jpg"
      }
    ],
    "user_id": "QWClVZjTDIkxB4VIcHumnA"
  },
  "KuQQNr449dbXW5S5BaVSXg": {
    "date": "7/23/2017",
    "text": "Swell place indeed!  Awesome staff and holy gamoley! Crazy burgers! Our party had a little bit of everything. .. Sweet potatoe tots with ALL the dipping sauces  Onion rings Macaroni and cheese Macaroni and cheese burger Mushroom and swiss Hangover burger Jalapeno popper burger.   Summer Shandy on draft as well :)   All quite splendid!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IyqXYPquHFq1njfBQdHvQQ",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IyqXYPquHFq1njfBQdHvQQ/o.jpg"
      },
      {
        "img_id": "lupcpOcD_egeaio34oTJKA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lupcpOcD_egeaio34oTJKA/o.jpg"
      }
    ],
    "user_id": "RfyoP064Hw4Is11Jhm3foQ"
  },
  "Mu85e0yODHRJZA3WFY6ABA": {
    "date": "1/1/2018",
    "text": "The burger here did not disappoint. Hubby and I were in the area and have wanted to visit this restaurant for awhile now so we were pretty excited. The restaurant was not very busy to our surprise. We decided to share the ghost burger with fries. The plate was definitely enough for two because the burger itself was pretty big. Our server was also pretty friendly. Very happy we tried it. I definitely recommend if you are in the area.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 7
    },
    "photos": [],
    "user_id": "pwQ8E-hbDUJe3qtKt_IBBg"
  },
  "JlunisMkbizShILbGsJ0oA": {
    "date": "9/10/2017",
    "text": "I have a love hate relationship with Rehab. First time I went I thought it was the best of the best and then it wasn't. I have been chasing that experience ever since. Today I had the special Meatloaf Mash and it was the bomb! It needs a permanent place on the menu.   The 10oz burgers (or larger) are infinitely better tasting in my opinion. They are more flavorful and more moist. I order medium rare and the 5oz always seems dry. I almost quit going, but you know...chasing that first date fun is a hard thing and I couldn't give up. And of course the 10oz are too damn big for an average human, hence my love hate relationship. However, due to this issue we have discovered a few other treats they have to offer and highly recommend both the tuna and the club.   Oh and the sweet potato fries with teriyaki pineapple sauce means you don't even need to order dessert.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WblQfQV3VyzTfhKDmDwdPA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Meatloaf Mash",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WblQfQV3VyzTfhKDmDwdPA/o.jpg"
      }
    ],
    "user_id": "jlVEA7VXEjq8vctAjZFyGg"
  },
  "f4M_-zqwYAi8-lKlc-ijJQ": {
    "date": "8/29/2017",
    "text": "Burgers are creative and big! Came with a large group and the service was great. Really enjoyed the music they played and overall it was a nice restaurant.   I can't say that I'd come back just because the burgers didn't have great flavor. I got to try at least 4 off the menu as well and in this case, bigger isn't always better.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BUAUTlcgcNVoMxgOj9dGEA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Mac and cheese burger",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BUAUTlcgcNVoMxgOj9dGEA/o.jpg"
      }
    ],
    "user_id": "3-urYQ6uYM1nk1sviHXaJA"
  },
  "f4M57k2X22YJME9rauSVAA": {
    "date": "2/11/2018",
    "text": "Came here for a brunch/dinner spot that had a happy meal menu.  This place is large, has an outdoor and indoor seating area.  Servers were nice and attentive, spending time answering our questions.   They took care of our needs with haste. We ordered sweet potato fries, regular fries, and onion rings as well as a margatini.  potatoe fries I didn't care for.  The sauce didn't make it any better as well, which is disappointing.  The fries and onion rings were good, nice and crunchy but not oily at all.  The sauces were good especially when mixed with the hot sauces they had there.  Then we ordered a to go ghost pepper burger which was really spicy.  Didn't care for that too much. The margarita was strong and hit the spot most definitely. Overall the vibe was nice.  Cool little hangout for th3 college kids there.  Service was excellent.  Food made it a 4 out 5 star rather than a 5 starbut overall it was q nice experience",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U3pUjfYNZZjmpjVE1tKboA"
  },
  "HKHkzKL53dbp-P76v1Chmg": {
    "date": "7/21/2017",
    "text": "I love coming to this place. They always have reggae playing which I enjoy. The servings of food will never disappoint. I think your getting a huge bang for your buck as the quality is there, huge serving, and happy during the day makes it even better.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Cnh6D4kYBDeEZjVM1GPr-g",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Cnh6D4kYBDeEZjVM1GPr-g/o.jpg"
      },
      {
        "img_id": "pXD4ch7BDR52c-6U10CLjA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pXD4ch7BDR52c-6U10CLjA/o.jpg"
      }
    ],
    "user_id": "zeuDoUZUFHcsMGPAaJhVpg"
  },
  "nGrqv-zPTDrUH0l_7pB4Fg": {
    "date": "5/27/2017",
    "text": "Overall had a pretty good experience here. The service we had was awesome. We came in on a Thursday night around 6 or 6:30 so it was pretty relaxed and wasn't all that slammed aside from a company party sitting at the middle table.   I had a Burger with a hatch chili on it and it was pretty good. One thing you always fear in burger shops in if they are going to cook your burger properly but mine was cooked perfect and so was the persons who came with me. The fries were good as well. Again no complaints.   I know you are probably thinking, well you didn't complain about anything so why not 5 stars? Well the food was good. But it didn't wow me or anything. The food was good for the price and the service was great. Not the best burger I have ever had and definitely not the worst.   The only caveat here is that if you are interested in just grabbing some food here it can be a bit of a pain because it is on Mill basically which means parking is extremely limited and you will more than likely have to pay to park to get here.   Again, overall good quality place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bqZ4gpGRgZHRfaqII1w04g"
  },
  "bGNH6YRn31Rw4ZxjYfKhGA": {
    "date": "12/2/2018",
    "text": "My mom and I stopped by here for lunch while we were wondering around the Tempe Arts Festival. I've been to the Scottsdale location a couple of times, so I had high hopes that it would be pretty good. And we weren't let down! My mom ordered the Philly cheese steak burger and I got the mushroom and swiss burger. We both chose fries over the sweet potato tots. Both burgers were cooked to order and perfect! Service was friendly and they kept up on our drink refills too. This place has a very hawaiian vibe. It feels happy and beachy, I like it! Reminds me of San Diego, which I love. They have some really interesting burgers to choose from like the Mac&Cheese burger, the PBJ & Bacon burger or the Tracker Pulled Pork burger. Don't worry, they still have traditional burgers too or you can build your own. So, if you're on Mill Ave and really need a good burger fix, this place would be a great choice!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "v8QnvfWXCf4651Bxg2vvIw"
  },
  "NVGad-VtylM0M0hesTGDOA": {
    "date": "6/22/2018",
    "text": "Came in at 11:15 am on a Friday. Started out NOT busy. Within 20 mins., it became quite busy and much noisier. Acoustics contribute to this. I'd say they have a good tasty worthy burger. There are options to satisfy the most finicky burger patron connoisseurs! Served on a very fresh lightly toasted bun. I opted for the regular nicely cut fries. Also, freshly made. You can have the REHAB 10 ozs.! Or, half that size, 5 ozs. (a RELAPSE). They didn't disappoint and the staff is friendly. The young waitress didn't seem all that familiar with their menu, but she was quite pleasant and apologetic for this. Table service was above average. Go when it's not peak hours for better service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "zehSpIWyGSwTtO90kvyreg",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zehSpIWyGSwTtO90kvyreg/o.jpg"
      },
      {
        "img_id": "OA4WSS31qyroQtzlT5OIcA",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OA4WSS31qyroQtzlT5OIcA/o.jpg"
      }
    ],
    "user_id": "SlN9cDutTWUFeWv6sSJGPA"
  },
  "GgKTSqSTavmkd__lpCp_Ug": {
    "date": "4/30/2018",
    "text": "Oh.....my......god. The PB&J Burger was the best burger I've ever had in my life, I think. Peanut butter, Jelly, Siracha, and Bacon on a pretzel bun with a delicious, perfectly cooked patty. I think this place will be a regular stop when I'm in the Tempe area.  Not to mention, the service was good, and the vibe was relaxed and fun, reggae music playing loud enough to be fun, but not so loud to make conversation hard. We sat on the shaded patio and it was just great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yIF8vHMhcxfVgGdBtIcv1w"
  },
  "zUkK23jZUJHuzSuaH1rLmw": {
    "date": "3/9/2017",
    "text": "Finally got to this location yesterday.  Had to pay a meter to park out front.  Put in an hour but it took longer than that for lunch and dessert.  Had a smaller burger with blue cheese, avocado and a fried egg.  The egg should have been skipped.  I am an egg snob and this was neither a quality egg nor was it prepared well.  The rest including the tots and the dipping sauces was delicious.  For dessert we had the pot brownie with Reeses cup, peanut butter, marshmallow, ice cream and chocolate syrup.   So good the way you burn your mouth on some bites while cooling it with the ice cream at the same time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "bhJ6ivAuSpgXP4JiKWjSZQ"
  },
  "4i1pEXcPqdhbBOUCWYJLrA": {
    "date": "6/4/2018",
    "text": "So of course I had to have a PB & J  burger and am I glad I did! So good so much interesting fun in every bite. Something they leave out of the title is that there is a small bit of sriracha mixed in and as crazy as all this sounds (peanut butter, jelly, sriracha, burger) it is SO GOOD. If you know anything about food experimentation, the oddest combinations make some good tastes. Cheese and chocolate, bacon and syrup, cottage cheese and chili cheese fritos. The PB & J Burger is up there with it! But this iconic burger is not the only thing to come here for, all their unique burger choices sound amazing. I literally had to ask the waitress to come back two different times because I was so undecided on what to get! They all look so good and so do the appetizers ( be warned though. The burgers are huge and filling so only order apps and burgers if you're really hungry or eat a lot usually). The only reason I didn't give them 5 stars was the decor is dated and just screams \"Islands Burger knock off\" and the tables around ours were pretty filthy and set for people to sit down.   Also, REHAB BURGER EXEC CHEFS: please make a 4-6-8 Slider plate that can serve almost as a taster so we don't have to decide on one of your delicious burgers but can try a multitude for different kinds (great for sharing too) so when I come back I won't have to gamble on a burger I may not like. Just a golden idea I'll pass along for free",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "bzX-LxPoAgqL_7RJYrgGQA"
  },
  "xSFiiFf1LtWCcf16QRG4hA": {
    "date": "10/20/2018",
    "text": "Great burger place and fried were good!  Place was clean, service was a little slow for 2 PM in afternoon.  Would definitely go back next time I'm in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Y0Xz2ZvVCMgg0FkHgFLbw"
  },
  "9zfTEDAuDGgmZsVpXOTb-g": {
    "date": "2/1/2017",
    "text": "Can you please roll me out to my car because my food baby is killing me!!! This location in Tempe is just as awesome as the location in Scottsdale. Great food (as always) and wonderful friendly staff. It is located right behind Casa, right off Mill. I think it is a great addition to Mil Ave. The inside feels a bit bigger than the Scottsdale location and they have an awesome outside covered patio. They kept the same menu and decor as their other location, which is perfect because if something isn't broke, don't fix it! Rehab, you guys are my #1 burger place! Keep it up! :)  PS if this is your first time here, get the smaller burger, because the larger ones ARE HUGE! I recommend the Jalapeno Popper burger or The Hangover burger. Their fries are scrumptious AND if you have a Gluten allergy ask for the Gluten free bun, it actually taste great!!!",
    "rating": 5,
    "rated": {
      "funny": 11,
      "useful": 23,
      "cool": 17
    },
    "photos": [],
    "user_id": "7SN81BGKQSWcH-y1oh1k5Q"
  },
  "Ii94JX7HBTTTRTof4acQ_w": {
    "date": "10/13/2018",
    "text": "Awesome food, the burger w meat shaved on time was huge. My husband could only get through half.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rvZ-xXkw5F4CpCS1W22gyQ"
  },
  "7SXrPCLj2_75MJU3zTf6dQ": {
    "date": "7/24/2018",
    "text": "Absolutely one of my favorite burger places! My buddy had the Macaroni and Cheese burger and I had the Jalapeno Popper Burger.  We both loved the toppings and the burgers themselves were great.  The Jamaican corn was very delicious with a nice smokey grilled flavor and a flavorful spice.  The sweet potato tots are amazing!  I loved everything I ate here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OSvNAcs1OVlk3uM_VWGz6Q"
  },
  "2eCCFo_13ItsTdpxmFRYGA": {
    "date": "11/15/2017",
    "text": "So this is the second time I had gone to the Tempe location. We even had the same waitress, anyhow we had a great experience. My burger was cooked perfectly; med rare and I was astonished, since my last experience was not cooked to how I ordered. These guys especially our server made an incredible effort to make our experience great. Thanks guys and we will be back for sure",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Y0OR9E496PfQLPmtPDmWAw",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Burger with pulled pork. Wow!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Y0OR9E496PfQLPmtPDmWAw/o.jpg"
      },
      {
        "img_id": "WoxRhyJJeUMePcldeFRpUg",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Bail bonds even eat at rehab",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WoxRhyJJeUMePcldeFRpUg/o.jpg"
      }
    ],
    "user_id": "uYrFDueYA2dTPrmfbylPug"
  },
  "10ngTPZI2QCzaZ7Ydc9RRQ": {
    "date": "10/9/2018",
    "text": "I had the chili cheese 10 ounce burger with skin-on fries and a coke, Tues afternoon Oct. 9. The chili cheese was nearly tasteless. I ordered the burger cooked at medium and it was beyond well-done and totally dry. Same thing with fries. Nothing wrong with the coke.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c5ybqRBHDfjq5TyEhajzPA"
  },
  "cnkxQHgWpa92Ln2xEzYkYg": {
    "date": "2/6/2018",
    "text": "This place has such a chill vibe!! Always greeted warmly and gave great service. Burgers are giant of course, and plated very pretty - awesome photo op! Tasty tasty too!! Been several times and always can only eat half.. so if you can agree on a burger with someone, best to go splitskies. If you follow then on Facebook, you get the inside intel on the special weekend burger creation they always have- stay tuned, there's some pretty cool stuff! Both fries and sweet potato tater tots are fantastic, you won't go wrong with either! Keep up the great work, Rehab!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jaWVqU9JaH2zdCBkZM_fww",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Weekend special - a donut burger!! Bacon on the maple glazed donut, egg, ham slice, more bacon, wow, THAT was interesting!! Only ate half!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jaWVqU9JaH2zdCBkZM_fww/o.jpg"
      },
      {
        "img_id": "NiA6jScwzrhJQDvl0BAGPg",
        "caption": "Photo of Rehab Burger Therapy - Tempe, AZ, United States. Mac and cheese burger!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NiA6jScwzrhJQDvl0BAGPg/o.jpg"
      }
    ],
    "user_id": "lv-mflnXGnNfZnyIRfUACA"
  },
  "cKDcLNRPx8V_Z4f7W3y_2g": {
    "date": "7/15/2018",
    "text": "Great atmosphere and excellent service.  There are so many burger variations to choose. So, I will keep coming back. Each one is a unique burger experience. Can't wait until my next visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x0cUd_ZVCFkEPSBwjifVVA"
  }
}