{
  "9rxeMggKr9g7KYB0xQK98Q": {
    "date": "8/12/2013",
    "text": "Did pick up today for CPK! Used my dough rewards, had a problem, but the manager and waitress were AWESOME in getting the problem solved!! Took the pizza, salad and spinach dip home, I ordered my pizza to be thin crust, and sadly it was not correct! It all still tasted great, and I will return again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ddsuzL8Lre8qZpPrvAKs4A"
  },
  "ZwWAofSGQyZLpIDRulhjvw": {
    "date": "8/3/2011",
    "text": "This one was hard for me to rate.  Usually, I throw a 5 star rating whenever I hear the name \"California Pizza Kitchen\", but last night made me dock that rating.  It has been a few months since I last enjoyed a meal at the ol' CPK.  This is easily my favorite pizza joint in the valley.  They have a wide selection of pizzas to fit every palate.  If you're not in the mood for pizza, don't fret!  They have plenty of Pastas, Salads, Sandwiches, and more to make everybody happy.  Another real treat for me is their cocktail menu.  They serve some very fresh drinks that are a step above the norm.  Last night, I had their Plum Martini, which was delicious.  I could not even taste the alcohol... It literally tasted like I was drinking directly from a plum.  Delicious!  My meal of choice is their Barbecue Chicken Pizza.  It used to be just another pizza on the menu, but right now, they seem to really be focusing on that one, so it does not feel as special.  If you are looking at their menu, they Bold it, highlight it in red, add a remark about it being \"Their Classic Pizza\", and so on and so forth... Let's not go over the top, guys.  It's a great pizza, but give the right amount of credit, and don't blow it out of proportion.  The desserts here are also fantastic.  Yesterday, I sampled their Strawberry Shortcake, which is a plate of fresh strawberries, whipped cream, and a piping hot biscuit served on a cool plate.  Exquisite.  After reading all this, you may be asking yourself:  Why is the rating only Three Stars?  Here's why.  This place is expensive.  All of their food items are marked up at least 25% higher than what it should be.  The Barbecue Chicken Pizza would be great if it were, say, $10.  Here, it's $13.  The Plum Martini?  $8.50.  The Strawberry Shortcake?  $7.00.  This meal ran me $30, and that's without the tip.  I do not agree that the prices should be so high.    The food?  Fantastic.  The price?  It's way too high.  Overall Score?  3 stars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fzloiRjnlAZX4Qo1u_X-Iw"
  },
  "7yj0wufOrFdAiLb-_E3n4g": {
    "date": "11/22/2012",
    "text": "My boyfriend and i went there for our one year anniv. it wasnt that romantic but it was lovely. i adored that place. The food is amazing i love their apple crumble with icecream. Theyre pizzas are really good. I love pizza and i have had ALOt of pizza but by far the pizza at this place is really good. Hopefully i might work there. They have something for everyone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "mmk-ork8B5ULUZ6uhkZVFQ"
  },
  "WAtbYYc5r824LX5G0ED3Bw": {
    "date": "7/29/2016",
    "text": "Wow what a terrible experience!  I had a group of 14 people that i took to this CPK for dinner.  It took forever for them to take our order.  Once i placed the order i asked them if they could bring out some bread, oil and butter.  They said they were out of bread.  Its a pizza place,  how do you run out of bread?  Anyways,  they did did bring out  few pieces out. Unfortunately not enough for the whole table.  Then the manager brings out some chips and guacamole on a dish because they didn't have the bread.  There were literally 9 chips on the plate.  I joked with the manager that we would all get one chip,  and she just walked away.    Finally when we got the pizzas,  they were all cold.  We had a hard time chewing on the dough because it was so cold.  I don't think this location is able to handle groups.  Maybe a few people at a time would be ok.  The funny thing is we went late and the place was pretty empty.  They were not busy at all.  I wont be coming to this CPK again. Ill try spinatos next time",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XznZNKXfIfTsGpaintoasA"
  },
  "JeI2AwESZXxNcVobgDud2Q": {
    "date": "6/13/2011",
    "text": "I've enjoyed CPK for a long time, it's quick, easy, and reliably tasty.    My issue with this location though is always the same, service.  Food is great, but service is terrible.  This time we were seated near the computers where orders are entered.  We spent most of our meal listening to chit chat about the fact that one of servers was married.  This went on for almost the entire meal, and since we were in for a late lunch there wasn't a lot of other tables around so I can't imagine that they didn't notice that we were there.  If you want to chat how about not seating one of the few tables right there.  Also we had to wait about 10 minutes to be seated, that's not a huge issue except for the fact that 3 servers walked by each saying that the hostess was around somewhere.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9VLv4NZCIpX2JBTfAV-vSA"
  },
  "T_55CEvwD69rA33oXAZ9cQ": {
    "date": "6/26/2012",
    "text": "The last two times I've been to CPK (two different locations) I split the BBQ Hawaiian pizza (with no onion, of course) with whoever I was with, and both times it was super delicious.  The more recent time, I had a Mango Mojito which was dangerously good.  The service is average, nothing to note either way.  This is one of those restaurants you can pretty well expect what you're going to get; it doesn't change my life, but it's satisfying and yummy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iN7T3vQoC3v_MPs2TzH5Zw"
  },
  "LXfeDJfNKE0Dy7xuauLvXQ": {
    "date": "5/7/2008",
    "text": "Don't get me wrong, I love pizza.   But...  I hate it when pizza sits in your gut like a cinder block. Even worse, when it makes you swell up to the size of Shamu - or at least makes you feel that way.   If I have to eat here again, I'm going with something simple, like a salad.  6/10/08 UPDATE: I did go back for lunch. I had a 10% off \"surprise\" coupon, so what the hell? My friend and I split the chicken rosemary sandwich, which came with a choice of soup, salad or slaw. Too bad they didn't have fresh fruit as an option!  It was very tasty, especially since we asked for goat cheese. We opted to get the mustard on the side, though it turned out to be very tasty. Not a bad choice for lunch for $6. The service was better this time, too.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "KeuwC8E1238SP6xyKpBM6w"
  },
  "7hBHyqtel-qWTkPZRLKa2Q": {
    "date": "1/12/2014",
    "text": "Good food, but very expensive.  They don't take reservations, but they do accept what they are calling, \"call ahead\".  That sounds a lot like the \"reservation\".  Weird.  Overall services were always good every time I go there.  Make sure you sign-up for their program for free food throughout your visits.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LfKyD_XaTnfKoKujRZ1Wug"
  },
  "c_iJFCubEGwSZ2IgmozXYw": {
    "date": "4/11/2010",
    "text": "I used to love CPK when I was a kid, I would always go to the mall with my family and eat there. I guess now that I have gotten older and seen more places CPK has lost its appeal. It's kind of expensive for what you get, average food and ehh service. I ordered online and selected a time for pick up. I got there 5-10 min after the pickup time and waited around for someone to ring up my food. I'm like \"I'll be outside with my dog so come out and get me\" The manager comes out and is like.. oh Im sorry we just put your order in the oven, here are some coupons for free apetizers. But I have to order $15 worth before I get the free appetizer.   Anyways, I went there because I had a giftcard but from now on I think I'll ask for Subway giftcards instead.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "th-hgkqPYre0h4O7Yf1h1w"
  },
  "YWtk4b7nyw1qywXZx4fcyw": {
    "date": "12/20/2012",
    "text": "I ate here with my sis n her hubby bubba, it was good, i have not ate at one of these places for a long time, i skipped over pizza section of the menu and had the jambalaya, not sure how to spell it, but it was good, could of been spicier, i prefer mine with rice instead of pasta, either way it was yummy to scarf down like i hadnt eaten for a week, also had some appetizer items, asparagus n arugula salad, light n yum, n some guac n chips, also fresh and tasty and some egg rolls of some sort also on the app menu, they were too effin good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IP0v2gKXz2_ethPgTuEdug"
  },
  "o3rCFNRrI7QP0-vJnKkfYw": {
    "date": "8/8/2007",
    "text": "CPK is one of the first of many restaurants to open at Tempe Marketplace. While the restaurant is one of my favorites, the new location didn't quite blow me away during a lunch time visit with some coworkers this afternoon. Our server looked like he was 10 and took forever to bring our drinks. My peach lemonade (CPK is known for their mouthwatering flavored lemonades) had just a dash of peach syrup so you could barely taste the peach. And there was something off about the mac 'n' cheese, which I usually love. The cheese seemed to be extra runny today. While this dish, which isn't on the menu, is one of my favorites, it didn't delight at the new CPK. The highlight? The tasty key lime pie. Yum!!!   I imagine the restaurant will get better in time. It's the first week it's opened so I'm taking this into account and will return again in a few weeks to see if it's up to par.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "UMBw5PrPlZqfyvUlKeYJvg"
  },
  "sUDJmCMnV0KHMuYdQCIgkQ": {
    "date": "10/20/2011",
    "text": "Meh, indeed. The food at CPK is typically good enough... not really good, but good enough, The interior is cold and makes me kind of tired,,, it's just too boring and safe. Even the bar area just seems weird, like a hotel bar with worn out businessmen. Plus they make you beg for bread, CPK is a big chain, could giving out silly small portions of bread really be bankrupting them so much that they make you ask for some? Throw in the expensive for what you get price tag and I throw in two boring stars. Meh.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "OTRxfMCtfrbUemIigxCaOg"
  },
  "Y9kQ9ye5v0Milquyzai6Nw": {
    "date": "11/17/2009",
    "text": "NOT a good lunch place if you're on a time schedule took us over an hour to get through our meal. Took longer than it should to get drinks, took longer than it should to get our orders taken, took longer than it should for our food, then took even longer to get our check, once the waiter picked up our check he then went and flirted with the girls at the bar while we waited for our credit card slip so we could sign and get out of there!  The pizza was just okay ... I wasn't blown away ... I've been to this cpk twice once at dinner and once at lunch and it's never busy so you would think it's a good place for a quick meal but be warned people take there time in this place.   Oh and the pizza is never hot when it gets to the table ... not sure why",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_KPyYweOw4Q3GAcoCXU7Ug"
  },
  "ixWXuRA3fy5ZbCTnJ-JQ6Q": {
    "date": "2/9/2012",
    "text": "I just don't get all the hype about CPK? What the heck am I missing.... The food is average, service nearly below average, prices above average. I gave this place yet another try with a co-worker during lunch time and regretted it as soon as I was sat outside on a cold over casted afternoon and the dang heat lamps weren't on!!! We would've waited but the hostess gave us an estimated wait time of 20 minutes and the place wasn't even at full capacity... Excuse me? Eventually, they turned on the heat lamps. We split the Works Pizza and an order of some sort of Bacon Avacado Egg Rolls; both were just average with no pop or bang. Even the sauces that were served with the egg rolls fell flat. There were leftovers and I'm usually a pizza garbage can so that alone says something. Will I come back, yes... but not on my dime!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RB3_GtWgvQYTLu3bxY2-VA"
  },
  "2aJxPc6hB3xX42qALuVUxA": {
    "date": "3/21/2010",
    "text": "Love the Chinese Chicken Salad and Dumplings!! Been dining at CPK chains since I was introduced to it in the 90s at the Beverly Center CPK. I've always had good service so no complaints here.   A full bar which stocks the Malibu for those rare occasions where I actually drink at CPK!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gIl0TtlJ5uIoHc_cYhgJGA"
  },
  "uq9NEYsqmSx8yZ2YsaZcqw": {
    "date": "6/1/2008",
    "text": "Originally the plan was to have dinner at Maria Maria with the family. The wait for a table on a Saturday evening was too long, besides my three year old was starving and demanded mac & cheese, so we decided to move on.  Strolling through Tempe Marketplace we found ourselves in front of California Pizza Kitchen, looking through the glass of the door we could see that there was no wait, and that is exactly what we needed. Walking in the door we promptly got greeted by a very friendly hostess and we got seated immediately  with  crayons ready for my little one.  Here is what we ordered:  Thai Crunch Salad, Carne Asada Pizza and Curly Mac n' Cheese.   Generally I am not a fan of big franchise concepts but I have to say that the quality of the food was excellent considering it comes out of  a \"system kitchen\".   At first I was not so sure about Carne Asada on a Pizza but it was surprisingly good. National favorites of two soccer-crazy countries, that had to go together. The Thai Crunch Salad was quite good as well and probably for the first time I noticed that all the ingredients mentioned on a menu item were actually in the dish. But perhaps that is just the way CPK designs an writes their menu.  My little boy also approved the mac and cheese.  On a side note we ordered one Maragrita (Cuervo gold tequila, not blended) and it was done well, but then how hard is it to screw up a Margarita?  Over all we were very satisfied with our dinner at CKP, we got to sit down on a Saturday evening without waiting, the food came out quickly and the young waiter was very friendly.   If I could rate this California Pizza Kitchen with 3.5 stars then I really would. The only thing I was not so fond of is that the check arrived at the table too quickly. I can appreciate the intention of speedy service, and that is good,  but please let me finish my dinner before you bring the check....or am I too old fashioned?",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yOaOXoL2tk7pQGUJvW8rUg"
  },
  "CN2gmkKTT9QlOQ9eTxU3IQ": {
    "date": "12/4/2012",
    "text": "Love this place, it's never a long wait and they have the best fried mac n cheese out there!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U8cPiVtNPlYWLnauxVQt-Q"
  },
  "mvS33orcT_C91cQ8nQfgzg": {
    "date": "1/5/2010",
    "text": "I've eaten at this location about 3 times and picked up about 2 times.  Each time I eat the food I swear that it isn't anything special and that I won't go there again.  Anyway,  I was there last night and decided to give it a good ole' YELPing.    CPK is a typical chain where you know what is on the menu and the quality and price of the food you are going to get.  I have had a bunch of their pizzas and salads and they are all are pretty much the same no matter which location you go.  I am not a super huge fan of putting non-typical toppings on pizza, but I guess that is what CPK is there for.  I do like the crust though..  I am a fan of a few of their salads because I am trying to be a bit healthier but after reviewing the nutritional information of most of their salads I realize I am doing more harm than good.  Last night I had the CPK Cobb and it was just ok.  Another salad I enjoy is the BBQ chicken one.  The service is always very good and quick most of the time if they are not too busy.  If you are in the area and want a decent salad and/or \"California\" style pizza, then CPK is a good bet.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8959F5stCzJWI_I7dgxurg"
  },
  "VcjzD4bgQdW8_UTZt9uQMg": {
    "date": "8/3/2014",
    "text": "Staff was friendly and I was happy to see some healthy options.  I like this place for occasions when you have a group of friends with various dietary requirements because they have a good selection.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X23fTKNky83eqR1ut8oFQA"
  },
  "bAI_QhKj0g4XoGTfu976Ng": {
    "date": "2/3/2010",
    "text": "I come here often for lunches.  This location is always clean, they always get me in without a wait, and servers have been friendly.    I LOVE the Miso Salad with shrimp and crab...just order the half...it's plenty!   I'm gonna keep on coming back  for yummy lunches!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l9GRPdg2wUAZJWgyezgR3w"
  },
  "JDusqkG9u4giCI9dQDGxWg": {
    "date": "12/17/2015",
    "text": "Not my number one pick place to get a bite, but I do appreciate the serious attitude they have towards their variety of pizza. Over the years, I feel like they've lost their novelty. Nowadays, they're more like a class act above, do I dare say, Pizza Hut.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cLWOGjT-cqJFa0U7WnlyDA",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Wild Mushroom! Tastes just like it says.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cLWOGjT-cqJFa0U7WnlyDA/o.jpg"
      }
    ],
    "user_id": "Rnwsdjuac1Grtp14GVPWxg"
  },
  "uay7XV0no_uKantCBJrzHA": {
    "date": "6/1/2017",
    "text": "Waited at the hostess stand for 10 minutes with no acknowledgement.  Once we got a table we waited 20 minutes with no acknowledgement, I had to go to the hosted stand and ask for service.  Seriously?!?",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V-ztNsmkr37RfKly97e19w"
  },
  "9fMQb48vcNTxBGh2OZX9CA": {
    "date": "7/3/2017",
    "text": "Our waiter (Justin) was amazing. It was the best service ive ever had at a restaurant, seriously he deserves a raise. Our hostess was also super nice, I dont remember her name. The food was also amazing, keep it up.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gzkZnLveWI93Pi6c0pZtgA"
  },
  "CRvyotahytLluTIrGIce_A": {
    "date": "5/21/2017",
    "text": "Didn't stay long enough to even eat the food . Walked in no hostess no waiter out front. Waited 5 min . Not very busy . Some workers looked at us and walked away . So now we're headed to thirsty lion . Would not recommend this spot .",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rH9rcF4XNyBFQfC_4xCJaQ"
  },
  "22nNDT3uCQbT-pNWTXatIw": {
    "date": "3/11/2016",
    "text": "California Pizza Kitchen is California Pizza Kitchen. It's good. Really good. That's not why they get five stars.   The manager at this place is super nice, friendly, and makes conversation with the patrons in a way that makes you feel at home. The place is super clean and the waitstaff is generally good.   Would recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "euGWNOWykR9fLSdsnX_jtQ"
  },
  "qzKq9MdssJGwyOsHNWIWfw": {
    "date": "4/7/2017",
    "text": "Came here after a movie. They have their menu posted outside the restaurant which is great if you're trying to make up your mind where you want to eat in the area. Outdoor seating is available if you want to enjoy the live music, and inside has a nice mellow ambience with TVs for entertainment. The portobello mushroom pizza was delicious as a non-meat option. Our waitress was fun and the manager was incredibly nice. She encouraged our feedback on the food and was very open to our opinions.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UgjxC1VZnMLDz2Mqt8nstQ"
  },
  "qw2E46zLQleSA0Qk2u_5Ow": {
    "date": "1/4/2012",
    "text": "The only CPK I've been to is at this location. I went here at least 3 times already and all 3 was different experiences. The wait is never long, except one time we 'made' a reservation for 8 even though they don't take reservation, they wrote us down and made sure we got a table quicker when we came back [:  The food is is always delicious. I know people love their pizzas, but I always get the salad too. The roasted vegetable salad is amazing [: We always come in big groups so each of us we get a different pizza to share. So far none have disappointed us. I mean how can you go wrong. Just pick whatever pizza you are craving for and expect it to come out delicious.  The only thing I would not recommend is the pasta, and I guess its our fault cause why go to a pizza place and order pasta.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "whbbjhv30M2Hhl3-fZDIhA",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Hawaiian Pizza",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/whbbjhv30M2Hhl3-fZDIhA/o.jpg"
      },
      {
        "img_id": "Hdq4oz7Y1JywLnguI_fHSA",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Fish Tacos",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Hdq4oz7Y1JywLnguI_fHSA/o.jpg"
      },
      {
        "img_id": "ImqPA9d8VftOaNFLO5Q0YQ",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Jumbalya",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ImqPA9d8VftOaNFLO5Q0YQ/o.jpg"
      }
    ],
    "user_id": "YDYArKOwV5x_ILkp59-UQA"
  },
  "T4u31ET2HUf9JWCcSwR-FQ": {
    "date": "10/3/2013",
    "text": "Four things to know about California Pizza Kitchen:  1.  The food is delicious.  I used to call this place \"California Pizza Sh*ttin\" around the year 1999 when I tried the food back then.  I didn't like the taste 14 years ago, but I think their grub is pretty awesome now.  Tasty margherita pizza.  My wife, who had never been to a CPK before, was also very impressed not only with her pizza but also her salad.  My daughter really enjoyed her pasta.  2.  The service is fantastic.  Our waitress was very friendly, helpful, and present--and that's exactly what we needed along with great food at the end of a stressful day.  3.  It ain't cheap.  You don't go here for a bargain.  It won't break your bank, but this is upscale pizza, and a deluxe meal for your family of three could approach $70.  4.  It's LOUD.  Between the music, and people shouting to be heard over the music, this place is updecible and well as upscale.  It's like a warzone soundwise.  Be warned.  Great dinner.  The coupon and gift card we had helped a lot with the bill.  Yes, definitely recommended.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oWd7wL340Z9JiGf5Wu_bSQ"
  },
  "2uJBAhKueKVLp6kGjOABWQ": {
    "date": "2/24/2015",
    "text": "When we think about pizza we think about calories. But this place actually have a healthy pizza with thin breat. I visit this place with a friend of mine and he is always watching his figure and had this pizza. This place is super yummy. Great service also, they also offer some tasty wines. Cheers",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "I-Wgs2R7aKTZwxT295kcNg",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/I-Wgs2R7aKTZwxT295kcNg/o.jpg"
      },
      {
        "img_id": "k2fy5tqchFbIHXuWEjPjzg",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/k2fy5tqchFbIHXuWEjPjzg/o.jpg"
      },
      {
        "img_id": "0CMFSzkcspstwbvmm3CW-w",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0CMFSzkcspstwbvmm3CW-w/o.jpg"
      }
    ],
    "user_id": "DhGELuYBYjnoXnPHF9na1Q"
  },
  "Abtw9livDHZM0jywh02FMw": {
    "date": "4/3/2017",
    "text": "I don't know if they thought I was a celebrity or something, but the service was so good it was almost embarrassing. I had two separate hostesses escort me to my table, free appetizers offered, drinks refilled almost instantly, and a waitress standing nearby practically waiting for me to lift my hand and order another dish. As for the food, it was about what you expect from a California pizza kitchen franchise, which may be absurd level of service all the more odd.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Ve3MVQjSuDcxfjYI531Jw"
  },
  "FzbMDOxKxgB0WSyyIxl5XQ": {
    "date": "3/5/2017",
    "text": "Food is always great however service needs improvement. Waited for 15 minutes for someone to take my order. I was about to go to the kitchen myself to tell them what I want. Price is reasonable and chicken garlic alfredo fettuccine is well recommended.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6hG9q-bzfVBG3-XTZrlgYw"
  },
  "jZA9M8plFtIceg5OuIJwSg": {
    "date": "7/18/2013",
    "text": "I was checking in here and noticed the low rating they seemed to be getting and said to my husband 3 stars are they joking?  Have they tasted this food?  They cant be serious I mean have you had the BBQ chicken salad?  Have you tried the habenero pizza?    Those two items just keep us coming back but heres where things start to change and stars start to disappear.  Since Summer hit we can no longer sit outside and enjoy the patio its just too hot so we are forced inside.  The music is so incredibly loud and not just on one visit but the last 5 or 6 visits for that awesome salad we almost wanted to shoot ourselves in the head.    You couldnt have a decent conversation.  We couldnt hear each other.  We asked them to turn it down they did slightly then asked if it was ok and I said honestly no its still not ok its horrible.  They didnt turn it down any more like they should of but thankfully another song came on that wasnt as blaring.  Next few visits we noticed the music is off the charts insanely loud but we didnt want to draw more attention to ourselves we figured lets just get our salad and get the heck outta here.    The next thing that really starts to bother me is their cumbersome approach to a frequent diners card.  You sign up for the pizza dough ap and then they are supposed to load your points sometimes they load them and other times you dont get that lucky.  You have to be a pain in the butt asking about your points if they got it right etc. just not fun and tends to be embarrassing.    They have a new promo get double points til end of July or something but we never get double so they go ask management and management pushes it off on call corporate there is a number on front of pizza dough but there is only a number for them and when you call they blow you off again.    They probably would have retained that 4 star rating I initially gave if they only turn down the music and train all their employees on how pizza dough works oh and the curbside service sucks too wow do they not do a very good job of communicating.  Last two calls went horribly wrong I felt like I was on Candid Camera and these people needed me to help them do their job it was like an Abbot and Costello movie.    I call and say oh I didnt know you delivered it curbside the response is oh yes we do so I check to see if my salad is ready and she says when you pick it up and I say didnt you say you had curbside?  She says oh you want curbside?  (Its 120 degrees outside)  Yes I would like curbside.  She seemed flustered (had her on speaker) husband says screw this I will go in and pick it up.  I have called in orders twice and the communication was so bad both times we HAD to go in and pick it up rather than have them make good on their curbside service.  I guess that was maybe a very interesting way that they have come up with to get out of the 120 degree weather.  It worked!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "l-NKtKrjNgRcxnib826wcw",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/l-NKtKrjNgRcxnib826wcw/o.jpg"
      }
    ],
    "user_id": "cQRyu8xRKfTCG5AwbS1lxg"
  },
  "0-by63AVqJqkdbYJVrpwbQ": {
    "date": "8/8/2016",
    "text": "Probably some of the best service I've had in a while.  Our waiter was very friendly and attentive.  Even the manager came over when she found out it was our first time there.  She was very gracious and welcoming and offered us a coupon for our next visit.  As for the food it was very good.  Great portions; I personally tend to eat a lot and one of their regular pies was just the right size for me.  I didn't leave hungry and I also wasn't over stuff.  Regarding taste, I'm not really sure if there is such a thing as California style pizza and whether or not this was it, but nevertheless, the pizza was very good.  I had the BBQ one and I would get it again.  I only wish they had a white pizza, that was kind of a letdown, but again the BBQ was very good.  We also had a slice of their key lime pie which they are famous for, which was very creamy and just the right amount of tangy.  Can't wait to try some of their other pies.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SlX-r5b_vxe0zrsKZg5UFQ"
  },
  "pSV-h1ZZiLiyA3_o897XZw": {
    "date": "12/19/2016",
    "text": "California Pizza Kitchen - Tempe Marketplace doesn't disappoint. The same high quality food and service that's found at most of their locations. Would recommend to anyone looking for lunch or dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aQYAN5vwPH-sZjoR6wbGYg"
  },
  "2_yZ4Y4pnE68Jp--uV3tbg": {
    "date": "10/6/2015",
    "text": "Hand tossed pepperoni pizza was outstanding as was the service. Both the server and the manager approached our table and offered Free dessert for the long wait. Perhaps I didn't notice the wait as I was enjoying nice glass of Francis Ford Coppola wine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "i7Map-sc0O-KvhSdR0grCQ",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Hand tossed pepperoni pizza crust was baked to perfection",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/i7Map-sc0O-KvhSdR0grCQ/o.jpg"
      },
      {
        "img_id": "jIbV5GiSDC3tCYD_eGAccg",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Delicious, not overly sweet. Butter cake topped with ice cream and whipped cream on the sides",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jIbV5GiSDC3tCYD_eGAccg/o.jpg"
      },
      {
        "img_id": "CNqawph9QnJvCgM1DlgpNw",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CNqawph9QnJvCgM1DlgpNw/o.jpg"
      }
    ],
    "user_id": "kCIKNFd2pHX_Rg-6kaeWzw"
  },
  "7Ed5NG22b2Oa1Vf187JYjA": {
    "date": "7/31/2016",
    "text": "Believe it or not, this was our first time at a CPK. We ordered the sage flatbread, summer salad and BBQ Chicken Pizza. Everything was very, perfectly OK. The flatbread was probably our favorite. The salad had so much potential but you can tell the strawberries had been sitting around in liquid for awhile. They were pale and mushy. Mmmmm....and for just over $10 it was a total waste of $. We picked off the strawberries and ate a $10 romaine & feta salad with 4 balls of watermelon on it. The BBQ pizza was perfectly OK - I liked the abundance of cilantro, hubby wished it had more zip from BBQ sauce. The flatbread was killer. Crisp, chewy, savory. Oh - normally I order a club soda and receive it at no charge (it is literally just carbonated water...) but here I was charge $2+. I feel like we paid for a meal that should have been really good and received a meal that was incredibly \"meh\".",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NGuMR5J-N3TJ-d2XOfOhag"
  },
  "MvYy0LCCiX_Mz9N7uD4kOQ": {
    "date": "12/11/2016",
    "text": "Really nice place to have dinner after shopping, great management they treated us really well thank you Paul for making our experience pleasant!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MwTPkXEyHBAU5t5PyX_6cw"
  },
  "tDLxc0XVpKWEw1wTXEwxZw": {
    "date": "8/2/2016",
    "text": "I just had dinner here with my honey & had a great time. We ordered The Works pizza without mushrooms. (Cause I hate them). And we tried the small plates Asparagus & Arugula salad. Everything was delicious. Service was fantastic too. We'd definitely come back. And drinks were delicious too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fwhJDSKofhyZDGrkbsjtkA"
  },
  "n3TI3P_jizP0TmH7wRacIA": {
    "date": "11/3/2016",
    "text": "My family and I came in a few nights ago very late. Even though we were the only table left in the restaurant, our server was still very attentive to us. The food, as always was delicious, overall it was a great experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wt6JJ0N-VxTj1pkEaCTebw"
  },
  "izivfLUZnk0xvY5uSEkRzg": {
    "date": "9/4/2015",
    "text": "CPK is one of my go-to restaurants.  Everything I've had there is excellent, my favorites are the chopped italian salad, the avocado egg rolls and the five cheese & tomato pizza.  Lunch yesterday was so good, I had the BBQ chicken salad with avocado and the Dakota smashed pea & barley soup.  The soup is really filling, I had just a cup and had to wait a couple of hours before I could eat my salad!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ho1YtHZgHu4rwg93bgTRRQ",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. BBQ Chicken Salad (shown w/out the chicken)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Ho1YtHZgHu4rwg93bgTRRQ/o.jpg"
      },
      {
        "img_id": "olh_kgFKYDRKuA0oXucs6g",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Dakota Smashed Pea &amp;amp; Barley Soup (yum!!)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/olh_kgFKYDRKuA0oXucs6g/o.jpg"
      }
    ],
    "user_id": "umrKfIaXuDqRp9bc7PmnGg"
  },
  "_hOE9WULiOUkUHgIPHggyQ": {
    "date": "5/16/2017",
    "text": "Well, the visit didn't start out well, but It turned around. My mom and I came at lunch because of the gluten free pizza. They have a lunch duo combo with your choice of 7in pizza and a soup or salad. Of course they only have one size of gluten free pizza, 10 inch, and refused to let my mom have the lunch duo.  Also, the water had something floating in it and the appetizer plates were dirty. My mom liked the way that the waiter handled the dirty plate situation.  Good point: the seasonal Sam Adams CPK has on draft right now is very tasty. Light on the palate and great for any meal. Throughout the rest of the meal went well, the pizzas were perfectly cooked, and the service was nice.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ox-d8zYC3cmjSlfnJsrpRQ"
  },
  "mnWIMn70Tr0ci_pztMpCgQ": {
    "date": "2/11/2013",
    "text": "Planned an Unhappy Valentine's Day for my single friends and I this past weekend, we got together for lunch and a movie, we all picked Tempe Market Place as the central meeting place for us, and the restaurant of choice was California Pizza Kitchen, and I haven't been to CPK in well over 8 years, so I thought this was a perfect choice!   We arrived and were seated pretty fast, it was around 12:30ish on a Saturday afternoon. Our server was Faith, and she was good at making sure our table was taken care of!  Now about 8 years ago I found my favorite pizza, the BBQ Chicken Pizza, it changed the way I thought of pizza, no longer did I think that pizza had to have a tomato base sauce, and to this day, I still love my bbq chicken pizza to be bbq sauce, cheese, chicken, red onions & cilantro, but I noticed on the menu right under the original bbq chicken, they had an Hawaiian BBQ Chicken it's just like the original, but with fresh pineapples added to it. OMG I love the combo of chicken and pineapples, so that's what I ordered, and let me tell you, it was perfectly delicious!    I also saw they had a small dish that was White Corn Guacamole, that had sweet white corn, diced avocado, black beans, jicama, bell peppers, cilantro & serrano peppers with white & blue corn tortilla chips. Omg this small dish was perfect to share and tasted so dang good, I think I am going to have to try to make it at home.  I'll try not to let 8 years slip by before I come back to CPK next time.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "8d1YtcgYYG8I32e2I161Jw",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8d1YtcgYYG8I32e2I161Jw/o.jpg"
      },
      {
        "img_id": "FRH577sOWIj6e0rYWITJWg",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Hawaiian Bbq Chicken Pizza",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FRH577sOWIj6e0rYWITJWg/o.jpg"
      }
    ],
    "user_id": "bpgbVPJcG-wQ4cNBcPPIxw"
  },
  "1wsSEqMbbQrJRgUz5dylpw": {
    "date": "1/19/2015",
    "text": "Lots of flavor in each dish Plates are all around $15 each   I tried the carnitas, cilantro, and onion pizza it comes with a side of habanero HOT sauce!! very tasty and spicy   Shrimp seafood pasta has lots of flavor too  and spice.  If your looking to have an Adult drink try the  CITRUS ADOBO MARGARITA is a great choice !!  its has chile powder in the drink Perfect !!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "kdlGD99W9VEk7WwZeQsXcw",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Carnitas Pizza with habanero sauce on the side  (SPICY) \r\n\r\nShrimp Pasta dish",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kdlGD99W9VEk7WwZeQsXcw/o.jpg"
      },
      {
        "img_id": "1b0eQG9bbjZwl-EahaUxsg",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Adobo Citrus margarita !! Chile powder in the drink delicious \r\nI believe they are around $8-10 each",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1b0eQG9bbjZwl-EahaUxsg/o.jpg"
      }
    ],
    "user_id": "c6Ia--JUuWEK4nhu5NuPrA"
  },
  "OHuFqjhmjW-hawM9vnbGXg": {
    "date": "11/22/2017",
    "text": "Ordered online and came in to pick up food tonight! Online ordering was great, but could've used a button for sides. we came in and could tell it was busy but all the employees we dealt with were so nice and did their best to help us even though the kitchen was busy. eva went above and beyond to be friendly to us and do everything she could to give us a great togo experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5fPTDswNXBw3tVdcjsfEmA"
  },
  "I4NlmrpjxXgkF_5AEE_I8Q": {
    "date": "11/18/2017",
    "text": "Try the avocado egg rolls. It's filling. Everything we ordered was great: dumplings, quinoa and arugula salad with meat as entree, and cucumber non-alcoholic drink. Atmosphere is serene and wonderful wait staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eoMYPOHKEWHlnWic4JYUKA"
  },
  "QczFhtE0ZbteBkwoZiYv3Q": {
    "date": "8/3/2016",
    "text": "When you go to Tempe Marketplace, you don't really have a lot of options to pick when it comes to food places. This place has good pizza. However, this place prides it's self on pizza. I think it's average pizza. I've had worse and I've had better. That's why I'd give this place 3 stars. Average pizza. The server was great, so, I guess I'll bump this up to 5 stars instead of the three.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P3twsMtaxi1rEufBjhA7Kw"
  },
  "GVC17k9qhlMXAbqrIfrqxg": {
    "date": "6/28/2015",
    "text": "Pretty good!  My boyfriend and I went here before we saw Jurassic World because I had a coupon for $10 off $40. I ordered the guacamole corn small plate (2 of them to be exact because they're awesome!) and my boyfriend ordered the baked potato soup. For dinner I got the kung pao spaghetti (my fave) and he got a cobb salad. The food was really good and the service was perfect. Our waiter was attentive and our food came out in a reasonable amount of time.   I recommend joining their rewards club because they send out coupons pretty regularly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JVM2ebglqYyxyCB0hlr5sw"
  },
  "TOOmmoWwuGcIC0OAZYXItg": {
    "date": "10/27/2015",
    "text": "Ordered the launch duo ( pizza and soup) among other combinations. California viggie pizza and market soup . Great deal for around 10 bucks. Added the tiramisu afterward, didn't like it so much.  Tempe marketplace location is good, huge seating plus the patio seats. Staff is good and welcoming. The two issues are that the distance between the door and the reception desk is too close and the restrooms can't serve a busy day in that restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Kp9g8NZEUDleL_nNES7NBA",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Meh",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Kp9g8NZEUDleL_nNES7NBA/o.jpg"
      }
    ],
    "user_id": "HANesK_6zzL-spsxBjWyEg"
  },
  "dRM2ZSi3LHxzI0BRaHxG6g": {
    "date": "5/17/2015",
    "text": "We had a good experience today at this CPK location.  Warm greeting when we arrived and promptly seated.  Our waitress was friendly and got all of our orders right (a plus in my book).  The kids butter pasta didn't seem to have any butter on it and refilling drinks was a bit slow but otherwise a nice experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z3nwYQzDUimoUl8LNDIxjQ"
  },
  "myxP2zFX0FUZqiHW6sk7dQ": {
    "date": "5/22/2016",
    "text": "I only give this a one star because I'm not able to give zero.   The hostess was completely oblivious to customers standing and waiting to be seated.   Our waitress changed twice and a the manager had to bring us our food because our waitress was no where to be found. The second waitress returned after our meal was offer to ask if everything was okay. She also brought a refill to our drinks when the meal was over.   We sat there for 30 minutes while waiting for her to bring our check.   Not only was was the food average, but definitely over priced and horrible service. I may never return to any CPK again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MidLqSvu1pfjtPdtjpcrdQ"
  },
  "sv8i3C64YJKqXlCqb-BiAw": {
    "date": "4/3/2016",
    "text": "This was the first time I have ate at this place. We were supposed to watch the live band at the marketplace but that area very easily reaches capacity.  I went in not expecting much to be honest judging from the bland decor and the fact it was very busy. It seemed like just a chain with no MAGIC. Somewhere I would fill my face with carbs and move on to the gig.  There was a 40 minute wait so I opted to be served at the bar straight away. From here on my expectations were exceeded as we had extremely fast and polite service even with the restaurant being as busy as a blue arse fly.  I got the thin, crispy crust pear and blue cheese pizza which made me giggle with absolute delight as though fairies entered the restaurant and sprinkled the inside of my mouth with delicious magic dust... magic dust which actually just tasted of good pizza. The crust was very well done and made a pleasent change from the carb heavy American deep pan.  Then it happened... the Quesadilla starter came out with a sauce that anyone who likes sriracha NEEDS to try. It's ranch... with... wait for it.... SRIRACHA! A mystical Asian/American spell was cast on my taste buds and I promise I will forever cast sriracha on to my ranch for the time I remain a wizard.  What was initially expected to be a bland and drab pizza chain experience turned in to a night of fairies, magic and sriracha in my ranch.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "6Y06BnvX2m20CnFOB2AAQA"
  },
  "PugeysjQtxN3zcsG12xzVg": {
    "date": "8/30/2014",
    "text": "For Christmas, my boyfriend and I received movie tickets and a gift card to CPK for a fun movie date night. We decided to make the plan happen one night and were excited to get out, as we hadn't been to the movies in a long time.   We decided to sit at the bar at CPK because we were watching the World Cup. The bar area is probably not the most popular spot in the whole restaurant, because it only sits like 10 patrons, but we took a chance. Our bartender was a little strange. He mentioned that he doesn't drink repeatedly and it made ordering drinks a little awkward. At one point, we ordered a lemon drop shot and we asked if he could make them. He said they had a martini and he could just pour it into two glasses. Sure. Ok. Fine. I guess that works. It turns out he made each one of us a martini in a rocks glass and charged us for two martinis. This is not what we asked for. And next time, we'll just ask for a table so the bartender who doesn't drink won't make us feel weird about ordering drinks.  I believe our meal was good, I just can't get over the lemon drop shot/martini confusion. I don't mind if someone who works as a bartender doesn't drink, but they should know how to make drinks, which is their job. Part of what you're paying for when you go out is the experience and it kind of ruins it when the situation gets weird.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_9WKSGfBn193Wl3vd7kt1A"
  },
  "HKk6sPk5OOV-dG1XbGGzzA": {
    "date": "10/18/2017",
    "text": "One employee, named Taryn, was super helpful and kind! She provided incredible customer service, despite being out of pizza and pesto cream pasta due to high demand.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4IxDOCZHXqtrn5Cx8YJg3Q"
  },
  "SJl76CtikaFz8hBOGEt7bA": {
    "date": "9/19/2017",
    "text": "Recommend coming later at night during the week and not during busy hours, great service tonight, food came quick and tasted great! Prefer this location over the Chandler one because their servers are respectable and professional here. Will be back again soon",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "beE85_tLWb4BRP7R7ldQ0Q"
  },
  "Ca-DlySk95H0PNOPNP5hcA": {
    "date": "4/6/2014",
    "text": "When dining with picky eaters and vegetarians, CPK always seems to be the safest place to go.  I frequent this specific CPK a few times a year due to birthdays and mini-reunions and it's always the same:  Super busy, hot food, alcohol-infused drinks, and a good time.  While the place is usually packed and wait time on a Saturday night varies between 30-45mins, service is usually decent and the tables and utensils are always clean.  A short wait isn't so bad in the company of great friends.  Food is pretty standard affair.  In the end, you're really just paying for the name and a standard pizza with fresh ingredients.  My usual go-to's are the Thai Chicken hand tossed, Tostada thin crust, and the Garlic cream Fettuccine.  Yum.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "zFYs8gSUYDvXkb6O7YkRkw"
  },
  "ppbUuIrCYuSOrltBx7u5IA": {
    "date": "5/1/2014",
    "text": "To be honest I wasn't too impressed with this place. I had not so high expectations because it wasn't too crowded and it looked like mediocre food, but I had heard the pizza was good. I got some avocado and chips starer and it as all right, but so expensive for how much food I received! I also got the pear pizza? can't remember the name... But it has a huge mound of salad on the top of it that wasn't even centered on the pizza. Granted it was pretty tasty, but it just looked awkward and was awkward to eat.   The worst part about the visit was that it was FREEZING in the booth we were sitting at . I know people in Arizona can go crazy with the AC, but this was just like I was caught in a wind tunnel. The service was great, but I was just so uncomfortable and wanted to get the heck out of there.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Z89DOrpPFQF-IMXkZj7WAA",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Pear and Gorgonzola? Thin crust pizza (can&amp;#39;t remember the name)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Z89DOrpPFQF-IMXkZj7WAA/o.jpg"
      }
    ],
    "user_id": "q8pYnjIwWbgIK_H0A2Txbw"
  },
  "iX8lAdoP1tkUO7FQX6hUrw": {
    "date": "6/18/2017",
    "text": "Our first time at this location n must say I was very impressed with the customer service. The manager came over n introduced herself n brought over a free appetizer very nice. My sever was Daniel n he was above and beyond great, recommend the watermelon martini must say it was delicious with this great kind of customer service I would always make time to stop in when I'm in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lz3KNsxaREi6nFq_n1kTAg"
  },
  "fMlS4GrFYnLFMkSBfrv_DQ": {
    "date": "2/9/2016",
    "text": "Probably the 1st and only time I dine at a CPK. Unpleasant experience overall. Only giving a 2 star for the fact that the waitress was courteous and frequently checked on us. Met with a friend for dinner there as we had something planned close by.   Food was terribly bland to put it nicely, ordered a white corn guac app, when it came out we were disappointed at the portion size first of all and we salted it about 5 times and couldn't get it to taste like anything, even with the small portion we could not get ourselves to finish it... according to my friend the spinach artichoke dip taste and quality has dropped noticeably again like the guac very tasteless, we asked the waitress how it was prepared and after checking with the kitchen, were told it is pre-packaged. Then the pasta for the jambalaya fettuccine was under-cooked.   When the waitress came to check on us and we expressed our disdain, she mentioned such to the manager. Quite to our dismay, instead of apologizing for the poor quality of the food or at least be understanding, the haughty manager ignored our concerns and continued to disregard what we had to say by telling us we were the only ones he's ever heard complain about the food, he even lied and told us that they make the spinach artichoke dip there fresh everyday! Will never visit that CPK again, if any, and discourage others to do so as well. Manager needs to learn some table-side manners when dealing with customers!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xtuEtqccIuXnU2Rle8otLg"
  },
  "ezUD3EfuNok0rqkQe7teCg": {
    "date": "2/2/2014",
    "text": "I really like the strawberry lemonade here!  And our server was very friendly, although not that attentive.  The food left a lot to be desired.  I ordered the Cajun jambalaya fettucini that came with shrimp, crawfish (I think? there were tiny bits of something white that might have been crawfish... and I mean TINY pieces), and sausage.  It would've tasted better if it had not been absolutely overloaded with Cajun seasoning.  I know the dish has \"Cajun\" in the title, but that doesn't mean that every square inch has to have a teaspoon of Cajun seasoning sprinkled on it!  Overall it made the dish way too salty and one note.  I didn't get the creamy, buttery, fettucini sauce I was hoping for.  My dining companion got the Chicken Tequila Fettucini.  I tried a bite and it was decent, though I didn't taste tequila - just lemon.  Plus the entree wasn't enough food for him and he was still hungry afterwards.  For $14 you'd think they'd give you a bit more food.... especially since this isn't super high quality food...",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q6Dcxo3_lNCzkqK7J3FL7A"
  },
  "8VYjYKS3W9F_eyw7oqAFhg": {
    "date": "4/12/2017",
    "text": "Excellent place!!!  My first time here I'm visiting from California. The food was fresh and tasted great! Service was perfect! You won't be disappointed. I can't say enough good things about eating here. Try it out you'll be happy you did!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0_hR8Ms3uQL9r69diU2m1Q"
  },
  "-7GA7BxWNFuiT56wUZLWdQ": {
    "date": "8/17/2013",
    "text": "Very slow service on a Saturday afternoon with only 1/2 the restaurant full.  Two of us ordered our pizzas before another friend came. The third person came at least 15min after we ordered and had to wait for our waiter to put his order in.  After about 30min from our initial order, the manager came over and said our order was \"getting sorted out\"--which was the first we'd heard of an issue. Our pizzas finally all came out together, still with no apology or even acknowledgement from our waiter that there had been some kind of issue.  We left Tempe Marketplace after finishing and while at another store, I realized that I didn't have my Visa from CPK. I realized that the waiter never gave it back. So I had to take our entire party back to Tempe Marketplace, park, and walk back on a 110 degree day.   When I got there, I told the woman at the front desk that the waiter hadn't returned my card. She told me to get out my ID and someone would be with me. Then she turned and did a walk through the restaurant, filling water, collecting plates, etc without telling anyone that we were waiting. Eventually, the manager came out and just handed back my card, with no apology for the waiter keeping the card to begin with.   I should have known better than to go to a chain restaurant and I have been reminded again why I don't. Don't waste your time with terrible service.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LQC_djumWD5qkoInU8Od6w"
  },
  "vydR9GYRhpbS22I7XWg15g": {
    "date": "3/15/2013",
    "text": "Why do people go here and spend money? This place is overpriced and the food is awful. Plain awful. On my visit, there was 2 people other than our party in the restaurant and it took about 3 minutes to be seated and about 25 minutes to receive our food.  It was absurd.  The food came out lukewarm, at best. The food was bland and super salty and just...gross. I wouldn't ever go here again. just awful.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "TAUwQExTxDnpPwqhouhJcA"
  },
  "_M5q1eogtySHZmfPufo0fg": {
    "date": "1/16/2013",
    "text": "I used to come here on a regular basis and I was very disappointed when they removed the focaccia bread from their appetizer menu.  I still come here on occasion and noticed they added a Mediterranean Focaccio under small plates, so that makes up for the removal of the appetizer version. I really enjoy the garlic cream fettuccine. And the atmosphere is always very nice. The servers are always so nice and attentive.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "TBWfDU-vrqGjz2M49MNaTQ"
  },
  "xoiajn72cOTTNyUSa5V2hQ": {
    "date": "2/1/2014",
    "text": "Went for a girls night out. We all got different pizzas and shared. They were delicious. The service was great. We had the Margherita pizza The Works and the California Club. They were all good. The thin crust as well as the regular crust was very good. Good crust can make or break a pizza for me. Our favorite was the California Club. Also had the Salted Caramel Pudding.  Delish.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_rAIwf0Cp8zgTCwjd_9mEg",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_rAIwf0Cp8zgTCwjd_9mEg/o.jpg"
      },
      {
        "img_id": "lDGwky4I6D4Kebtu-trALA",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lDGwky4I6D4Kebtu-trALA/o.jpg"
      },
      {
        "img_id": "cNXoKX3AeB1XLiVxts1p-w",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cNXoKX3AeB1XLiVxts1p-w/o.jpg"
      }
    ],
    "user_id": "HYG0ar5bCJOdkznV7MaI4Q"
  },
  "dA_dWAjgrt6tRoAVTyVc-g": {
    "date": "12/17/2013",
    "text": "I love this CPK. Their servers are always amazingly friendly, knowledgeable about menu options, and usually pretty funny. Their menu is extensive... something for everyone. My favorite is the Moroccan Spiced Chicken Salad and all of their pizzas are pretty good. Their seasonal soups are always fantastic too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RRhJUH7p5TKs66ufVXHkzw"
  },
  "mhwuCqwyI04BkX8bWsDw9A": {
    "date": "3/30/2011",
    "text": "I used to love me some CPK. A decent pizza selection, an eclectic menu including greek, american bbq, asian, italian ... it's all over the place in a good way. I used to live by the Cobb (no egg) and pepperoni pizza. Delish! And they make a killer cosmo.  But the more I went and tried other menu items, the more I asked myself ... why do I come here? I never really like anything new that I try, and if I do, it's so basic (like a wedge salad) that I find are hard to screw up.   But, the service is usually great, and they do half glasses of wine for ~$3, which is great for someone that is wine-curious like me.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uAcWvAT1JaqRlxF3bfIwPA"
  },
  "80JJsIOA_S7LytlRmKeZMw": {
    "date": "2/20/2013",
    "text": "Good visit! Friendly staff and consistently good pizza. Very clean restaurant--even the bathroom was spotless which was nice. Our server forgot about us after she dropped off our pizzas but it was still a nice visit. Try the beet and goat cheese salad. This one was pretty yum! And the California Veggie pizza ROCKED!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "gVmUR8rqUFdbSeZbsg6z_w"
  },
  "FzBaQfiUTgePxwel-sixhw": {
    "date": "3/18/2013",
    "text": "Stopped in here on a Wednesday night around 7 and the patio was full, but had no problem being seated in the restaurant. The service is very good, and the food is good...but oh so pricey for pizza and salads. They have a pretty good wine selection, but again, pretty pricey for basically a pizza place. I think the location helps bring in the diners (Tempe Marketplace) but there are other good pizza joints in town!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HL-cdf_goIdOhH0uAOD-5Q"
  },
  "5psb2SmaaKV-IGSILMG6iw": {
    "date": "12/5/2016",
    "text": "for it being our first time we were treated with a free app. which was really good. the spinach dip was just like safeways but the 3 cheese pizza was pretty tasty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gn5FkWJUQxTTrbZ0xs7R6w"
  },
  "DCDPezP5QftNTfg_FjxZwg": {
    "date": "8/23/2013",
    "text": "I had the Mongolian spiced Chopped Salad... It was the best salad I have ever had. Beware that the place is small and if you have a large group eating you will wait a long time to sit down (we waited an hour). I would for sure go back to this location. Our server was great as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ioKQ2j6gmVPktcCHzSIWtQ"
  },
  "cnDYTWRT5EzkgaeZrzthQQ": {
    "date": "7/17/2011",
    "text": "So..    This place is pretty good.  Knew about the place for ever, finally got around to checking it out a few times.  Had Jumbilya one night and pizza and pompodorp ravioli the other time. Both were good.. not exceptional.  Prices not too high. Service was good both times.  Not my favorite, but no complaints.  Sorry if this is a bit of a bland review, but that covers the place. It is good but just not great.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mrEoKZsYtSgMJsIuLr_oTg"
  },
  "KL8Mgt5qzDqC8nFN4yH2fA": {
    "date": "11/20/2010",
    "text": "You can't go wrong with pizza...if you do you probably shouldn't own a pizzeria or become an employee of any pizza establishment anytime soon.  I love my pizzas...hot out of the oven or straight out the frig.  Yeah I love cold pizza - yum!  CPK keeps it consistent and they're always out and about trying to come up with new ideas for pizza -- Bacon, BBQ & Ham -- please another large to go :)  Always packed, but spacious enough where it's not too crowded; I definitely appreciate the formula of CPK.  Plus, who doesn't know what you're talking about now when you say CPK....okay I'm starting to just shoot off my mouth - in any case - enjoy!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kjeX2RXvW7RhBbD2QLd5jA"
  },
  "GX-e_ewiBfe4nJ7AXYZuZQ": {
    "date": "6/15/2011",
    "text": "While I really do like the food here, the service at this location has been  touch and go. I teetered between a 3 and 4, but they get a four because despite some odd encounters with the wait staff, I'll still suggested it as a dinner spot fairly often.   I could take or leave the pizza, but I have yet to have a bad salad there. My favorite is the thai noodle one- the dressing is amazing!   Their small appetizers can even be enough for a meal, especially if you're in for lunch. I had the sweet corn raviolis and an order of the chips and guac, and I could barely finish it all. Very delicious!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0qHOB3OdcgOI1_V7oSle2g"
  },
  "4UZEhMeWwQJxEiPVDAB6XA": {
    "date": "2/1/2014",
    "text": "Located at the Tempe Marketplace, this is one of my favorites. I have been going there for a few years now, for a total of may be 20 times. Even though they have tons of good stuffs, I could never get tired of the Kung Pao Spaghetti (I always have it with shrimp).  It's like the up-graded version of the chinese-restaurant kung pao, over spaghetti instead of over rice...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kUvgqnVEphFGxvhdeIYsMg"
  },
  "S3CQUJlyS1rdjsmGs8yhCQ": {
    "date": "4/24/2014",
    "text": "I love the California Pizza Kitchen. Everytime I go there its consistently good the service is friendly. The chicken piccata is to die for, also the BBQ chicken salad is top notch. Not super expensive but delicious, treat yourself.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ix5LbXfJOgP6CabvsuFrlw"
  },
  "OjXDMFAvsIcwQ7MWQkO6Mg": {
    "date": "2/10/2013",
    "text": "Avocado egg rolls WIN! Pizza is ok.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QOpFT-OMTEP_yvFXxxkX3Q"
  },
  "mArbbhnOADGP5HHpkSep_A": {
    "date": "8/16/2012",
    "text": "I'm very disappointed in my latest CPK trip. I had the asparagus and arugula salad, pesto cream penne with chicken, and a diet pepsi. This came to $22.13, but my card was charged for $31.42. Okay these things happen. The manager said he adjusted the charge but it's not showing adjusted today. The pasta was lacking in flavor and the $3 upcharge for what looked like less than an ounce of chicken was absolutely not worth it. The salad was good, the service was prompt, but the value and quality of the food? Huge letdown.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "r_AMHUIn6XhXcit90Axb7A"
  },
  "XOCEPXqOX_JokZuI43T5hA": {
    "date": "6/27/2011",
    "text": "This was our first time at CPK. I was craving a thin crust pesto pizza. They lured us in with fried mac & cheese. The pizza was good and larger than I expected for a personal pizza, yet still not proportional to the price IMHO.  Fried mac & cheese: 5/5 Pesto chicken thin crust: 4/5 Five cheese and tomato: 5/5  Service: 4/5 Clean: 5/5",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OaN8UG7flab58O525eRsgQ"
  },
  "dtXJvrEzKFkaN2wq7NDnJw": {
    "date": "9/9/2015",
    "text": "We ordered from here a few days ago and we're excited about everything we received!!  We had Caramelized Peach Salad, the Sicilian Pizza, and the Chicken Tequila Pasta.  The greens on the salad were fresh with quality ingredients and we were fighting over who would get to finish the pasta.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GNBvqVILYR-xVQW6ND81qA"
  },
  "Q5AyNlcM8vlO8tGc_VL9CQ": {
    "date": "7/16/2012",
    "text": "Try the wedge salad with a pizza, just the right size for two.  If you're visiting on a weekend, try the patio (with misters) and listen to the music on a nearby stage.  ENJOY!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "otPtvKlobKh4l82e8n6xqA"
  },
  "CVht087ygeb_b2kTHvLVLw": {
    "date": "12/1/2017",
    "text": "First of all, curbside pick up is a life saver!!! For those of you that are familiar with Tempe marketplace.... parking is a nightmare. Curbside pick up is essential. The food was amazing! I got tomato bisque and an Italian chop salad. They also give you bread with every order! So yummy",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "k3ZvrnsN2_3p5r0IcBykhg",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/k3ZvrnsN2_3p5r0IcBykhg/o.jpg"
      }
    ],
    "user_id": "q4Q0o08UukwlvEidKISDnA"
  },
  "51Ik-KJGSCm8g-JaeThUDQ": {
    "date": "5/3/2018",
    "text": "Service is always top notch. This is where i go to meet all my girls since we all live all over the valley. Salads are huge even for a half order. Birds fly in all the time so that's weird. Just dont want them landing on my food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KBIrswzj5xc8_X4eAlcqVw"
  },
  "Gfqpa0JO3pXgAx1ftyl8yw": {
    "date": "10/2/2017",
    "text": "I came with my 7 year old God-daughter on Saturday about 2pm.  The restaurant was slammed but they found a nice spot for us.  I really appreciated the free wi-fi so that she could play around when she got bored.  I had the GF crust with the Sicilian toppings.  The waitress was super knowledgeable about what is certified and what isn't.  Very accommodating and ensured I really understood what I ordered (Celiac wise).  The manager was very friendly when he came to check.  The Gluten Free crust was some of the best in town.  It actually had a nice crisp on it!!  My God-daughter ate the entire kids pizza!  She loved it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "R_rut3B0zXO-X0_tnDQHwQ",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/R_rut3B0zXO-X0_tnDQHwQ/o.jpg"
      }
    ],
    "user_id": "zQFK8MK1oNUkJ7_2ixGbRw"
  },
  "tl17NEvbmtVbBpGAe-LWtg": {
    "date": "12/27/2014",
    "text": "I had signed up for the Pizza Dough rewards program to get a free starter. That was nice since it was my first visit.  Both the hostess and our server were pleasant and never left us hanging so they got an extra star there.  The food, however, was bland.  The mushroom pizza I ordered was served with white truffle oil, but sadly even the strong, aromatics truffle oil could not save the pizza underneath it.  My brother ordered the fish tacos.  This sadly was nothing to write home about either.  Our friend told us some of the other food was better.  However, my brother and I ordered items that we would normally love on other menus.  That said, we probably won't be returning to CPK.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "vp1PTuAc7Rh94-HWBBBlPA",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vp1PTuAc7Rh94-HWBBBlPA/o.jpg"
      },
      {
        "img_id": "nqsWbyf25cI9U7lDMcEhMA",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Mushroom pizza",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nqsWbyf25cI9U7lDMcEhMA/o.jpg"
      }
    ],
    "user_id": "nyFqLcDf5d8AHk3uvoZHnQ"
  },
  "tVwPWia-CQPkZD5EuqYnUA": {
    "date": "4/14/2018",
    "text": "The service and food is amazing here. We were a party of 3 traveling from out of town and were so pleasantly surprised by the wonderful manager  named Al Rogoway.  He welcomed us like friends and  both he and our server Mikayla  made sure that our meal was perfect, absolutely delicious! Coming from New York,I consider myself to be a pizza snob and the pizza here was wonderful. Sadly enough we are in town only for another two days and must say that I am sure we will have to return for another meal or two before our departure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R5enkXbYtNoVSOIwGFUbhA"
  },
  "EJYpHjF6b07Iqp-1JxFltg": {
    "date": "3/20/2016",
    "text": "We always stop  here when we're out shopping and need to get food for our 2 year old - they have great kids meals!   It's always consistent, quick, friendly service and their food is really good! I hadn't been in years prior to our recent visits and was pleasantly surprised.   They have more than pizza and their drink selection is nice! We really appreciated Brittany's professional service and great attitude on our last visit.   Definitely our go-to when shopping at Tempe Marketplace.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "SsYHb0uyECshxjzUJ8ynag"
  },
  "6T1YcRVKBevm-YCHrvahuQ": {
    "date": "3/15/2018",
    "text": "I had never been here so my hunny said it's a must for the BBQ chicken chop salad!! Yes it's damn good! The service was great and the manager running this location was amazing! He sent us over his favorite appetizer as he heard I had never been there! I will be back for sure!! Thx CPK",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ncyY6J4cwfY4mrcHh81BLw"
  },
  "lKzfUTNmRJWsYX3qzwh3cw": {
    "date": "5/19/2018",
    "text": "It was our first visit here and we had a small issue with our food. However, the manager came to our table right away, fixed the issue and gave us some delicious dessert. Great customer service! Will definitely be back. Especially for the crispy mac and cheese bites.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H1mI70hM-vKPStQe2N2w_w"
  },
  "Alvf69sB5BwRXQX-xVOrdw": {
    "date": "2/24/2018",
    "text": "Old and run down version of most CPKs. The waitresses are slow, incompetent and seem to busy to attend to customers simple needs, like forks, knives and napkins. Food quality is on par with most CPK chains if you get it warm! This Arizona branch of CPK has a lot to be desired. Felt like I'm sitting at McDonalds. I'm trying to like this place , but this place is seriously bad..",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fVJp0vs8wd-NGf0FmdKnyQ"
  },
  "N1Ozet3ZACYOJzfsRY4fyQ": {
    "date": "10/27/2017",
    "text": "We had an excellent meal and professional server on our visit. My club sandwich was one of the best I have had in recent memory.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DmhQti115WDTZGTNgSZGUQ"
  },
  "teuiiZwu4uOeMVBTdzFEmw": {
    "date": "1/29/2016",
    "text": "They completely remodeled this place since my last visit 4-5 years ago.  Much nicer.  The waiter was good, but it took a while for food to be served.  I was with a big group, so understandable.  My wife and I shared the Pear and Gorgonzola pizza.  Our daughter had a sausage pizza.  I wasn't a huge fan of either.  The free bread you get is ok.  I wasn't blown away by food but it was a nice evening.  No one in my group had anything negative to say.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "S1kkm-OMFEemqZ1KAsatKw"
  },
  "6iOmlrIfCgWDdrOL_hB9XQ": {
    "date": "4/5/2018",
    "text": "I had only been here once but it was years ago, I decided to take my mom here for lunch cause she's never been. The manager Al found out it was her first time and gave us a free appetizer and made sure we had the best experience possible. Not only was his customer service amazing but so was the food! I will definitely be coming here more often.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qpOU3De6Y591fyv1b3laAw"
  },
  "VJONssjv2pHY9f9dHyoz-g": {
    "date": "4/1/2018",
    "text": "We were sat quickly, hostess was cheerful and friendly. Food was served quickly and was good. Overall good experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "64vgEYyoTcZ8c6OHQVdrXw"
  },
  "IZb48USS6JhYmIyVgEW0bg": {
    "date": "4/28/2016",
    "text": "It's  6 45 I have a toddler. We were seated.  I had enough time for her to decide what to eat,  scribble till boredom, and Skype my mother.  Not a server in sight  in a less than half full resturant. Gave it till 7 and walked out. Unreal.  Update,  was called immediately and spoke with manager. Will see if next experience is better.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y_4UdLKpt9nsojhndcE45g"
  },
  "DBPv5RC00lcIcMplOsgXyA": {
    "date": "4/17/2016",
    "text": "This is your typical Calf Pizza. Interior is larger than it looks from the exterior. We arrived after lunch so the place was slow. Our server was quick to greet us and took our order. The menu is extensive with choices and everything always looks so good. Today I went with the mushroom spinach flat bread. It arrived quickly and it was crisp but moist. Next time we visit Tempe Market Place we will return!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vJzbhrrp2hJY8srL_Up1qg",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Spinach mushroom flat bread... YUMM!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vJzbhrrp2hJY8srL_Up1qg/o.jpg"
      }
    ],
    "user_id": "eknhlNLKAHlMUBT05rnfBw"
  },
  "1KpCso3sY7NOF3_LMxiQCA": {
    "date": "2/11/2018",
    "text": "Was so glad they accommodated our group of FIFTY people last minute!! We were celebrating a birthday and Jessie and Royce were the best servers, making sure everyone got what they needed and serving the cake! The food was amazing and I would definitely come here again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ksWcXkdlryKeeNULTVOYcA"
  },
  "mu7YSMmRtNyhvU_pU3iknA": {
    "date": "3/26/2016",
    "text": "Me and my friend came here for our first time on a Tuesday night around 9pm. It was empty so we got sat immediately. SHAWEEEEEEET!  Our servers name was Steven. He was awesome. He attended to all of our needs quickly and gave suggestions on what to get on the menu. He checked on us regularly to make sure we were okay.  The food was AWESOME. All of it! We got bread with an oil basil garlic dip, the tequila pasta, tortilla soup, and the arugula and quinoa salad. All of it was GOOD! It all tasted fresh and the flavor was vibrant. I was very pleased with my visit!   I would definitely come here again. I'd like to try more :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3OfNW7Uzi3Rtm7WlHXpK3A",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Tortilla soup",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3OfNW7Uzi3Rtm7WlHXpK3A/o.jpg"
      },
      {
        "img_id": "gphQxy1FgEyG4KFty0pPyw",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Arugula and quinoa salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gphQxy1FgEyG4KFty0pPyw/o.jpg"
      }
    ],
    "user_id": "BEgwL_ce-Hs7AIHq2ljk3A"
  },
  "Z9YwyzwTSx6oCAq3Nyj5zg": {
    "date": "12/18/2017",
    "text": "After an evening playing games at Dave and Buster's, we were hungry. This was the closest place around. We were promptly seated and we ordered our drinks and meals. I ordered their ribeye steak which was topped with a delicious herb butter. It was slightly under medium rare, but I didn't mind. It was excellent as well as the herbed potatoes that accompanied it. My wife ordered a salad that was great, and the kids finished off a Hawaiian pizza. Everyone was very satisfied. The service was excellent. We will return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m_19or1lFzLsQrWbAZ6oaw"
  },
  "ebHAoaZJk-mRQ-8ZsmrdQg": {
    "date": "12/11/2016",
    "text": "Great food. Wonderful service and No mistakes where made.  every time I go I'm dined Very well and treated very respectfully",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NX-kJpedLaPNqUJLrmQ7RA"
  },
  "M2l--_-nmllZUQ4zTSkFHw": {
    "date": "8/7/2017",
    "text": "Went on a Sunday evening about 7:30 with my son for a little dinner.  The restaurant was relatively quiet (customers, not noise level!)  Very noisy considering the sparse number of diners.  A five minute wait got us a table and a nice young server who was pleasant and initially attentive.  Our drinks came quickly.  We ordered an appetizer (Szechwan Chicken Dumplings) and their Sicilian regular crust Pizza.  Our server asked if we wanted our appetizer before he served the pizza and we said we did and thanked him for his suggestion.  About 15 minutes later a young lady brings our pizza and places it on the table.  When I told her we were expecting an appetizer, she offered to take the pizza back.  We were hungry and didn't care for the possibility of reheated pizza so we told her we would just keep it.  About 5 minutes later our second server returned with our appetizer which we discovered to just be tepid, probably sitting under the heat lamp for awhile.  Six small dumplings with little flavor to them.  The pizza was a bit dry, could have used more sauce and more cheese despite a fair amount of freshly grated parmesan cheese she grated directly on our pizza.  I would give it a 2.5 and the dumplings a 2 at best.  Our original server returned with our bill, my water was never refilled.  I doubt I will ever try them again.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "LXEgiSBjBpWaT4oX2kUo_w"
  },
  "zPISsV1a0QRktuzyXm0B7g": {
    "date": "7/28/2018",
    "text": "Okay, I havent been to CPK in years but only went because my kiddo got a coupon. David, our server was really good with the kiddo. He was patient, smiled and on top of everything ensured our drink got refills when needed. Eva, manager was super informative about lunch specials during work week, as well as how to gain points. Good customer service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R1RDHafKh9T426DijeRixA"
  },
  "qIVwcIsXZwE3RosLcm7BSg": {
    "date": "3/25/2019",
    "text": "We were greeted by a polite and attentive host. She made all efforts to get us situated in the exact spot we wanted. That was awesome! We weren't anticipating much, as we went in on a Sunday night. We reviewed the new menu, and the only differences we could see were increased rates. That's fine, we would bite the bullet. The classic barbecue chicken pizza was fine, and we ate it. Was it spectacular? No. Would a Domino's pizza have sufficed in the same way, absolutely and for much less. The pizza alone was $17. Our waiter was nice, but clearly was having a rough night. I'm sure he's a great waiter, but the dynamics in our contact were: painful. Overall reducing our quality of experience. Mediocre food, at a higher than tasteful price, mixed with a rough customer service experience; we will not be returning to this location.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4WP0L6_EHdqFI_62m1MGHA"
  },
  "qBabG42hAd_x8x6deBBU-Q": {
    "date": "1/4/2019",
    "text": "I would give zero stars if it were an option for this  occasion's visit.   My family and I arrived at the restaurant at 4:55 PM for an early dinner.   There were a few other groups there already who seemed to be at various stages of their dinners.   After being seated immediately with menus,  we sat unattended until 5:10 when we decided to just get up and leave due to lack of service.  There looked to be approximately a dozen employees milling around, apparently none of whom felt the need to inquire if we were being helped or not.   I have a strong feeling that we will not be back to this location.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7Fms0TKFUi1kNGNMGcTULw"
  },
  "QSqW9srqMqvhqRAb8MR3WQ": {
    "date": "10/29/2018",
    "text": "Ordered a Cobb salad and it came with hair. Staff was chatting the whole time while I tried to get their attention. Manager came over and apologized and lacked empathy.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "GVwD4M0u0ejcQKX04wVrIg"
  },
  "VKjGREFcuhvxFOmnWNiklA": {
    "date": "1/22/2019",
    "text": "First time we dine here today. The mango sparkling water is fantastic. The food taste, size and portion is definitely not worth dining here. We got the shrimp scampi and California Cobb salad.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tx4-FBmzZflLAssQhiGRgQ"
  },
  "YzNb5z3M8lbdLytSJOB4sg": {
    "date": "5/14/2019",
    "text": "Eva the manager was amazing. She was respectful, professional, and she was kind. I enjoyed talking to her and she helped me with every question I asked. I definitely will be ordering or going to this CPK again because of her.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tqE8EnZ6-agcOulfV9stIg"
  },
  "RJOjl5kC0IxBoGikCBtCCg": {
    "date": "4/3/2018",
    "text": "Was very fast and efficient service never had a empty glass of tea. This place was very clean and had nice view from the patio",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "65JreNnPCY79x-nI2GXYaA"
  },
  "I5aPF91lkHbnZhCVZKavRA": {
    "date": "6/10/2018",
    "text": "Yesterday was awesome their sheriffs department was in house for the jr deputy program and I got me some swagger. I also placed a Togo order for a key lime pie and a club soda. The bar staff is amazing they answered my questions about Moscow mule cups and Ally in Togo was fabulous and fast. Thanks for the CPI rewards too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wyCdIVwJFgaTsnDixL9Bww",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wyCdIVwJFgaTsnDixL9Bww/o.jpg"
      }
    ],
    "user_id": "aGwONlR86ERk450Gp6Ih5A"
  },
  "-Y72QvzEATaesuZhCKyN-A": {
    "date": "8/25/2018",
    "text": "Me and our little boy went to the California Pizza Kitchen for a late Friday night dinner. It was around 9pm when we arrived. We waited about 10 minutes for a table, when the hostess said the patio had open tables if we wanted to sit out there. We said yes. After waiting about 10 more minutes for service, I finally flagged down a server and asked for some drinks. We got the drinks and continued to wait for our server to come over. In the meantime there were 2 toddlers running back and forth on the patio, SCREAMING. A high pitched squeal that stops everyone in their tracks it was so shrill. After about 20 minutes of waiting for a server and having my eardrums pierced with the screaming toddlers, we got up and went inside. I asked for a seat in the dining room. We were seated but still didn't get a server. I had to get up and go to the bar for a drink refill. While we were waiting we noticed a bunch of dead bugs on the top of our booth. That's when I decided that it was time to leave. We'd spent almost an hour in this establishment and was not served by anyone. The bugs were just the last straw. I was so irritated because by this time it was after 10pm and I had a hungry little boy that I needed to feed ASAP. So we went to Red Robin. But It's a shame because I can remember when California Pizza Kitchen was the place to be. It was clean and classy.  Now it's run down and has slow/terrible service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QG2gK-eWNT0V_k7ggvKGXA",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Dead bugs on the back/top of our booth at California Pizza Kitchen.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QG2gK-eWNT0V_k7ggvKGXA/o.jpg"
      },
      {
        "img_id": "pJaQRl15ChaxCSqAWiTvwQ",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Dead bugs on the back/top of our booth at California Pizza Kitchen.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pJaQRl15ChaxCSqAWiTvwQ/o.jpg"
      }
    ],
    "user_id": "0HM15jYYW-uQI-t6CYi2Bw"
  },
  "rPrarku2_G-N33AkIpSjVQ": {
    "date": "7/21/2017",
    "text": "Came here for my best friends birthday lunch. There was a total of 7 of us.   Our service was HORRIBLE!!!!   Everyone of us but one ordered pizza! (1 large pizza, 2 kids pizzas, and two lunch size pizzas) How long does it take to make pizza???   Before that; we were given drinks (water, lemonade, tea) it took 40 mins before someone came by and asked how we were doing. No water refills, no sugar for the tea was offered so my best friends sister had to wait that long just to enjoy her beverage!   Andrew was our server. He never came by to check on us. The kids ran out of soda, we needed water refills that took a long time to come. When the food was ordered he rushed me. He never updated us on  how long our food would be after we've been waiting for 30+ mins. After we received our food, it took even longer for him to come check on us. Water refills again, our table didn't have silverware or plates or napkins. I wanted some pepper flakes for my pizza etc.   The pizza was good. I had that with the tortilla soup for the lunch combo. The soup was undesired after first try. I didn't even touch it.   The worst part about this visit was that we even told our server it was for a birthday. After they took all of our plates we were left there aimlessly waiting for at-least another 20-30 mins. The kids were getting impatient. By the time everyone started to get up to go ask for the check, Andrew came with ice cream. Set it on the table and honestly that's what we had to wait for? This place has the worst customer service and worst birthday experience anyone could ever imagine. Never again!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bnn_DmLZEi9n0E4OMuRXbA"
  },
  "KmRRrvamKSSkNS5csq6E8w": {
    "date": "11/1/2018",
    "text": "Great place quick lunch! Good food, good service... Nice atmosphere and ambience. Seated right away even during lunch rush hour.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NLmkGUIcex7VPIx2IRTS-g"
  },
  "GJ9gmEVSkPeKktnMpM_3Ow": {
    "date": "2/9/2018",
    "text": "Hands down my favorite go to Pizza spot! NEED I say more! The place is always full of smiling guest and staff! The Ambience and atmosphere although is joyful. I've been here a few times and i can't say I ever seen an out of order or dirty establishment. If you go the this location you won't receive bad customer service or cold food. I'd recommend this place to anyone check out the pics. Mouthwatering!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "f28uqjQkkMfkNssf8ounag"
  },
  "Vb10t2w2Xyl3EVZRLeaXqQ": {
    "date": "7/13/2018",
    "text": "Vegetarians ALERT !!! DONOT trust them. This happened to me twice now. I ordered a Thai crunch salad and requested the server to REMOVE Chicken as I am vegetarian. When I had the salad I found out that it had chicken. RUINED my Friday date night.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GwlfzNZlEZh8Vd7bVQs6CA"
  },
  "o6-Twg6gaxkv5tqGIpkCMw": {
    "date": "3/11/2018",
    "text": "We are fans of CPK and I have been to this location for lunch and had a satisfactory experience.   Tonight, however, my wife and I were returning from a concert in Mesa so we came here for dinner about 5:30p. Almost NOTHING was satisfactory about this visit.  We asked to be seated at tables on the outside patio. We had to wait almost 10 minutes despite the fact that there were many empty tables out there. Apparently they are understaffed and either didn't have someone to bus the tables or didn't have staff to serve us.  We were finally seated, and the place was filthy. There were rings on the table from glasses from the prior customer. There was litter and food on the ground.  Regarding seating, if they are looking for quick turns, they purchased exactly the right chairs for the patio. Unless your hips/butt are less than about 12\" wide, two hard iron bars press into your buttocks. I managed to turn the chair diagonally so my skinny @ss would not be gouged by the chair frame.  We placed our order with a waitress who didn't seem to know what she was doing. But she did take our order. She never did return with sugar and sweeteners we asked for to accompany the iced tea my wife ordered; I ended up snagging our own from an unoccupied table.   My wife ordered us one of our favorites - the avocado club egg rolls. They took a VERY long time to come out, and tasted as if they had been made before lunch and left under a heat lamp all day - certainly not fresh.  When the food finally arrived, we still didn't have silverware or napkins, so the food was put down and we had to wait and look at the food while someone rounded up the tableware.  Finally, my wife's \"Two in a Bowl\" soup came. It tasted off. And it was warm, but not piping hot, so by the time it was half finished it was room temperature.  I ordered a thin crust pepperoni pizza. It was NOT HOT. The pizza itself was tasteless, although the pepperoni was spicy. And the thin crust, instead of being crispy, was chewy.  We definitely won't be returning to this CPK. We just hope this place was not representative of the level of service and quality of food at the location closer to our home.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hhiV9hEaJGoNkmVqDh-Oqw"
  },
  "XSbmtIHw84Ab-Sxxf-FPYw": {
    "date": "12/3/2017",
    "text": "water was terrible - tasted like it had bleach in it. bread was really good and was brought butter instead of oil when asked. the salad with roasted vegetables was amazingly good. pizza was pretty good and added extra toppings for no added cost. very friendly staff.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bhJ6ivAuSpgXP4JiKWjSZQ"
  },
  "GS_lPpaoU242lJnVB-hj2A": {
    "date": "11/10/2016",
    "text": "Not bad for a pizza chain! We actually order take out from this location and I have yet to come in and eat inside.  We love their Jamaican Jerk Chicken Pizza. The flavors are sweet yet spicy with plenty of flavor. My hubby loves the thin crust. This time we also ordered the Mac-n-Cheese bites as an appetizer and enjoyed the yummy gooey cheesy flavor. This place has definitely made our roster as our take out place.  Thank you CPK!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "vnWKs2dgqDuR_yNI5qJG5g"
  },
  "_i8pwy2njB8SI1McbsINIg": {
    "date": "10/17/2017",
    "text": "Yelp Review California Pizza Kitchen 2000 E Rio Salado Pakwy Tempe, Arizona 85281  California Pizza Kitchen deserves solid 5 stars. The service I received was amazing for my Friday night with my friends. The Chicken fettucini was amazingly paired up with the amazing Raspberry Lemonade   We arrived around 6:30 pm and the restaurant was relatively packed from a Friday night. We were seated immediately. The server was really polite and very interactive with the menu. I got a Chicken Fettucini with a Raspberry lemonade for my drink. The fettucini was amazing. It was really creamy, cheesy and full of flavor. The chicken breast was perfectly cooked and full of juice. The meat was tender and full of flavor. The quality was top notched and I was not regretting getting the Chicken Fettucini. I ended my night with a Belgian Chocolate Souffle cake and let me tell you that beat all the desert I had had in my life. It was a warm chocolate cake served with Hagen Das vanilla ice cream on top, with the side of sweet whipped cream. The cake was amazing. I split it in half and there came the deliciously melted chocolate lava dripping out and it was delicious.  The service was really great. Our drinks were filled up by the time we almost finished them. The server always stopped by to see if we needed anything or how good the food was. The restaurant atmosphere was amazing because the lights were dimly lit, thus giving a very relaxing atmosphere in a very crowded restaurant. The food took almost 15 mintues to get ready which is pretty reasonable for four complex dishes. They also gave us French bread served free-of-charge.  The price was absolutely fair for the quality of the amazing food. My total cost was about 25 dollars, tips not included. The Chicken Fettucini cost about 13 dollars.   Overall, I was very happy with my experience with California Pizza Kitchen. The food, service, and the atmosphere were amazing and I will definitely return again.  (word  count - 343) Manuth Pung, Thank you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Oq9rfH7obc7Lti_EI51hg"
  },
  "5fquiIoQe-Y86bsdTY6srQ": {
    "date": "2/26/2017",
    "text": "1st time coming here, family brought me here. I've been skeptical of this place, therefore never trying it.  Well I was wrong,  this place is nice & clean, service was on it's game; our waiter was super patient & sweet & wait time was a bit long I don't mind waiting for my food but some may not have the patience. Nonetheless food was amazing!   I ordered the garlic cream fettuccine $12.99 With shrimp +$5 it was delicious, the plate portion was enough not to big not to small. All in all I had a wonderful experience, definitely be  recommending this joint to everyone & will definitely be coming back!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zrMozNkab-IOIuK3hURjwA",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Yum",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zrMozNkab-IOIuK3hURjwA/o.jpg"
      },
      {
        "img_id": "NKmhmwJvkRvP3ohlKzZu7g",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. delicious, delightful &amp;amp; scrumptious",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NKmhmwJvkRvP3ohlKzZu7g/o.jpg"
      }
    ],
    "user_id": "t8rpzHy4DA4hBYB86U0kvw"
  },
  "nbldasW2xkQag519H9vXew": {
    "date": "11/30/2015",
    "text": "Stopped in for dinner before heading to ASU Gammage Theatre. Why do restaurants always want to put us at table near the bathrooms or kitchen??  We ordered their Wild Mushroom pizza and Fish Tacos. The pizza was filled with mushrooms, just the way I like it, but one problem...it was COLD. On the other hand, the Fish Tacos were delicious. Could have used a bit more panko to give it that nice crunch.  Server was okay.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "So7e-YkeGZWpd7xAQ0OuAA",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Wild Mushroom Pizza",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/So7e-YkeGZWpd7xAQ0OuAA/o.jpg"
      },
      {
        "img_id": "dvQ9CIU6VhZruocq6VfALA",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Fish tacos",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dvQ9CIU6VhZruocq6VfALA/o.jpg"
      }
    ],
    "user_id": "vwi68eg4bmJHMSYq3jP2OQ"
  },
  "ICZc1XjobnsJ5AqhsOBCYg": {
    "date": "5/3/2018",
    "text": "Skimpy toppings, dry and pizza so small for 2 to share. Not impressed, and don't recommend. Used grub hub who did deliver quickly!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xSIfV4fkaHoxbRIJ_dk3Cw"
  },
  "6rtVMDRug963D0YF3o4rRQ": {
    "date": "7/4/2019",
    "text": "Amazing gluten-free pizza! We wanted to get a quick bite before the movies and were able to order at the bar. They use thin, cauliflower crust as an alternative for their pizzas. However, only select pizzas can be made with it: the BBQ chicken, pepperoni, mushroom-pepperoni-sausage, Margherita, and traditional cheese pizzas. The reason they have a select number is because they can make sure these ingredients don't get cross-contaminated.   The staff was very friendly and accommodating (you'll definitely feel safe ordering here if you have celiacs)! They were very quick with our order too. The cauliflower crust was amazing, it wasn't dry at all. It tasted almost like a cracker. The sweet tomato sauce and savory cheese really paired well with it. They also only serve it in one size, but it's big enough to share with two people. I thought the quality of the pizza was amazing and the substitute crust didn't take away from the flavor.   Thanks to their quick service, we were able to make it to our movie! I was very impressed with their gluten-free selections and hope in the future they are able to add more pizza options (and possibly a gluten-free pasta?) I'll definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "SuWinB0958iN_6kSuunahg",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Margherita cauliflower pizza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SuWinB0958iN_6kSuunahg/o.jpg"
      }
    ],
    "user_id": "Nl8P1NUtuVct0HD0Njk3MA"
  },
  "MsPAAeJoBATaetfqaCAeMg": {
    "date": "8/25/2019",
    "text": "To be honest, the food is not worth the price. My pizza (The Works) was $17 and it tasted no different than an $8 supreme pizza from Little Cesar's. I tried my friend's pepperoni pizza and it was much too greasy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hrrZ1IKLsGKNjIk-_5nRrg",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. The Works- nothing special here. It tastes just like a supreme pizza from Little Cesar&amp;#39;s",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hrrZ1IKLsGKNjIk-_5nRrg/o.jpg"
      },
      {
        "img_id": "hHJ2a6xwDtNbC_ULsQCh_g",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Garlic Cream Fettuccine- kind of a small portion",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hHJ2a6xwDtNbC_ULsQCh_g/o.jpg"
      }
    ],
    "user_id": "ppe_9TpKKoYqiVirWr92Pg"
  },
  "96629y_7ZLA64YvUIpa0hA": {
    "date": "8/29/2019",
    "text": "Food is always great. But Xavier's service was beyond exceptional. He truly made our dinner for six very, very pleasant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kRB26BQdSjy9gYKJCro3uw"
  },
  "2rNW7Sl-JFQoSWjev5hTjw": {
    "date": "5/17/2019",
    "text": "Fun place to eat in small or big groups.  Lots of different choices for lunch or dinner.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 11,
      "cool": 13
    },
    "photos": [],
    "user_id": "61AymMi8D4RTQ2aa1w41ew"
  },
  "_iJpBdA0CZuO-zylc8sejg": {
    "date": "7/19/2019",
    "text": "I popped in for a quick solo lunch and everything was excellent from start to finish. I waited at the door a few minutes to be seated, although they were not very busy and looked over the menu. The manager rushed over as soon as he saw me and apologized for my wait, which was completely fine. He was very peppy and super nice, went over the menu choices and said the server would be over. She came shortly and took my order which was the lunch combo Mushroom& Spinach Pizza and soup. I had the pea soup (yes I know odd combo) but their pea soup is delicious! The food came out quickly, was great, service was flawless, no complaints!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "v9nj-MAXsmvh7ouUA0TaPA",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Mushroom &amp;amp; Spinach Pizza with Pea soup",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/v9nj-MAXsmvh7ouUA0TaPA/o.jpg"
      }
    ],
    "user_id": "l7KsPVFdtK8MKACvCAtNeg"
  },
  "VeHGmmaxufnNxME8ZtXWAQ": {
    "date": "10/24/2018",
    "text": "I had a great experience here. I came in prior to the dinner rush and needed to be done in about 30 minutes. I was immediately seated at the bar and taken care of by the lovely bartender. She was very attentive and took concern of my need for a prompt meal.   The decor is very modern and trendy. Also typical of what you would expect from CPK.  I ordered the steamed potstickers and a thai salad. The potstickers were delivered very quickly and tasted fantastic. They were full of robust flavor and had a spicy sauce accented by fresh herbs. The salad was also very flavorful and provided a very satisfying portion.   To drink, I ordered the hot tea which was offered with honey and lemon. There were multiple varieties of tea to choose from.   Overall a very good experience at this chain.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IUApl0HnbjvGOVm5SX-MYw",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Quick dinner",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IUApl0HnbjvGOVm5SX-MYw/o.jpg"
      }
    ],
    "user_id": "jAYTXRs9KiSmut2lCDYR0Q"
  },
  "2m7fJXborBr7gCFQsGIPiw": {
    "date": "1/15/2019",
    "text": "I came here during my break on a Saturday. I enjoyed the environment. The restaurant wasn't too loud and the service was steady. The place is clean with nice customer service. The I decided to eat the bar. They were pretty fast. I ordered a special drink, sandwich and salad combo and dessert. I waited no longer than 10 minutes. I got the crispy sandwich and it was pretty good with Cesar salad. Their combo lunch meal was about $10.95 which isn't bad. They are known for their pizza which I will come back for next time.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 14,
      "cool": 10
    },
    "photos": [
      {
        "img_id": "q4Fy1D5eTA5g3LjD5S3heg",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Yummy chocolate cake with ice cream",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/q4Fy1D5eTA5g3LjD5S3heg/o.jpg"
      },
      {
        "img_id": "QBTcPBlPG_chbYO2TK5R8Q",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Crispy chicken sandwich and Cesar salad combo -$10.95",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QBTcPBlPG_chbYO2TK5R8Q/o.jpg"
      }
    ],
    "user_id": "-ns4OcYy2LLIfSGBZQDZAw"
  },
  "Habu2aPc0V2j0SzVXSDwww": {
    "date": "6/22/2019",
    "text": "First time eating at California Pizza Kitchen and it was sooo amazing!!!!  The service is great and definitely recommend the buffalo cauliflower bites!!! Love!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ikPRJmveXXwnechasUSXyw"
  },
  "2_kUBySeCrPNcu6iMwPzZA": {
    "date": "7/12/2019",
    "text": "The waitstaff and the manager were absolutely amazing!!! I brought a friend who has never eaten before and she was completely in love with the food! So so good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FzC3q4VS1UoM418Q75RMYA"
  },
  "DXUFQmhfIju3WAV1KlKAzw": {
    "date": "7/14/2019",
    "text": "I won't lie, when my family suggested CPK for lunch I didn't even realize this chain was still around. We came to the Tempe Marketplace location and we all had an AMAZING experience. The service was very good and the food was even better. My vegan sister made a build-your-own pizza with red sauce and veggies and then it came out with cheese added. The server apologized and then the manager even came over and apologized and offered to give her a vegan soup for free while she waited for her new pizza. I will absolutely be returning to this location",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SbtBHvFnJ5z_GT1N2Qp12g"
  },
  "pw34vJs5-oVLa9uIr-cquQ": {
    "date": "5/4/2019",
    "text": "The only place my picky granddaughter will eat. She loves the macaroni and cheese. Large serving and a good price. Great service too.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CjnEYAfQ0B-K6qzhyAN6mw"
  },
  "9zpMHpr4jBnAPdLydq_r4Q": {
    "date": "7/6/2019",
    "text": "The most awful service I've had in a long time. We came in on a Friday night around 7pm. We were expecting a wait but got sat right away. There were maybe 7 tables occupied in the main dining room and there were three servers tending to tables just in our section. Took forever for drinks and bread to come out. Our food came out in a  decent time. What really made us upset was how long we waited after the meal for our checks and to go pizzas. They are running a special for $5 take and bake pizzas with the purchase of an entree so we each got a pizza to take home (4 togo pizzas total). We placed our to go order when we were wrapping up our meal. Our server brought us our checks (we had two) and they were all split inaccurately when we went over how we wanted our check split multiple times. There were 4 adults and 2 children in our party, it wasn't complicated. Our server then came back once when he was dropping our checks for the second time and said \"oh your pizzas are still not out? They are probably sitting in the back I will go grab them.\" 20 minutes later he checks on us again and brings us the pizzas. From start to finish it was 35-40 minutes since placing the to go order. We were there for a total of 2 hours. I just don't understand when the dining room is not even a  quarter full and you are fully staffed, why did it take so long? There were servers sitting at the bar just hanging out the entire time we were there? What started as a birthday celebration had us all leaving annoyed and irritated by the end of the night. Definitely not returning.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jOA6eja744qMJKbDyunH3Q"
  },
  "VVS6lzlnu4Ai6kWq5Se9jw": {
    "date": "9/3/2018",
    "text": "This CPK is awesome. Even though they did not get to me right as I sat down our server Michelle gave us great service. Her name was hard to pronounce but Michelle was the closest to it. We had the Thai crunch salad, the tostada on regular pizza crust, and the power bowl.   I am definitely going to go back there!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CoyWQmIm_FbQkzIOGvr-yQ"
  },
  "wdPq01apDEsAt431PV5A7A": {
    "date": "12/23/2017",
    "text": "I've been to this location once before and I remember having a pretty good time with friends, and being delightfully surprised at how good the food was.  This time, s/o and I decided to get takeout. The online ordering system wasn't working (and wasn't telling us why it wasn't working), so we called in the order. We got a call 7 minutes later (which we missed, unfortunately until 20 minutes later) saying that they didn't have any of s/o's dish, so he had to switch.  We get to the location 15 minutes later (as told to), and went to the takeout window, where we stood around for another 15 minutes before someone in the kitchen spotted us and got a server to talk to us. While we waited, I noticed that my pasta was just sitting out on the counter. I'm not positive they have a hot holding space, but I'm assuming they do, and I was a little disappointed my food wasn't  kept hot. S/o and I ended up getting the same thing (Kung Pao-his with spaghetti, mine with fettucine) and although mine was still good, it wasn't as good as his  the Cobb salad was bombbbb though (and I loved the beets!)  I did love the little touch of having the seasoned oil in a to go container to go with the bread though :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9-BadCvdSaC9_0PM4UrJQw",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Kung Pao Fettucine with shrimp",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9-BadCvdSaC9_0PM4UrJQw/o.jpg"
      }
    ],
    "user_id": "IgDW1-6pNqp_TKWSaYccGg"
  },
  "00RVFDcqG3V7xOCh9AeeWA": {
    "date": "6/20/2018",
    "text": "CPK is a nice option for when everyone else is busy at Tempe Marketplace. They have great sangria. There are always a ton of options on the menu, whether it's pasta or pizza, or some lighter fare. However, every time I come here, the service is pretty inattentive. The servers usually forget to bring water or forget our boxes, or we are left waiting after asking for a refill.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dF57LKLv4sfsN8hyh4fgnA",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dF57LKLv4sfsN8hyh4fgnA/o.jpg"
      }
    ],
    "user_id": "4a5v6DGcEk5xSSlfyj5rgw"
  },
  "djmwDP3sMXO2AmV1SB0aOQ": {
    "date": "11/21/2018",
    "text": "Not a single vegan dessert!  Pizza and bread are vegan friendly.   This place has a stroller ban. They say it's for fire hazard but no laws have been passed about it. It's really because of employees getting hurt on strollers and suing the company. Figures.   The manager is really nice. I wanted to not like him but he's so pleasant.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SJ2Vwjnn772f0bBJrLtTJA"
  },
  "YYhX7vdXYyak5KzmbwD37Q": {
    "date": "7/6/2019",
    "text": "I won't be coming back to this location. Last night, myself and five others (one was a toddler) came to this location and received some pretty bad service.  First, the restaurant was not busy at all, plenty of empty tables, and we saw our server maybe once every ten minutes. At first it took a while to get our drinks but our food came out within decent time. We then ordered the take and bake pizza's being told they would be out very quickly because all they had to do was prepare the pizza and put it in a box for us to take home and we would bake it later. Then we waited quite a while for our checks to come, when they arrived our checks were very wrong, we had to wait again for our checks to be corrected. Again, the store was not busy so our long waits were not excusable. Then, once we got our checks, our take and bakes were still not ready. Our server came back and forth multiple times avoiding eye contact knowing we had been waiting 30 minutes just for the take and bakes. Overall, we were there for two hours with very slow service. Will not be returning to this location.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "akfbIywBabbQAjRHMFBscg"
  },
  "GPEzWlTU57DQvaC3VNYzYQ": {
    "date": "8/23/2017",
    "text": "First time here and it won't be the last!! The service was great! Our waitress Tova was very helpful and welcoming :)  The side salad is so big and yummy! They have many dressing to choose from. Tova gave us great recommendations. The Champagne vinaigrette and cilantro peanut are delicious!  The thin crust spinach and artichoke pizza is a must! The portions were just right and I didn't leave with a gut bomb!! I recommend this place to anyone!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gDBqI98-IS5h56CqId3OaQ",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Side salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gDBqI98-IS5h56CqId3OaQ/o.jpg"
      },
      {
        "img_id": "4aQfRP2YQqFjZ_ByuOdosA",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Spinach artichoke pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4aQfRP2YQqFjZ_ByuOdosA/o.jpg"
      }
    ],
    "user_id": "rhZb4MbRweF0qVYUoKv_AQ"
  },
  "1eq_5ioiXmNuX3BCSS_VWw": {
    "date": "7/11/2018",
    "text": "I love the food at California Pizza Kitchen, and I have eaten at several locations. Unfortunately, this location is not the best. The last couple times I have popped in while shopping to grab something to eat, I have turned around and walked out. This most recent time it was for the following reasons; the hostess took me a dirty table and when I asked if she could have it wiped down, she rolled her eyes and said \"I'll do it in a minute.\" While I was standing there waiting for her to come back, I noticed how dirty the entire floor was around the restaurant as I was watching 2 waitresses chase a bird (literally, a bird) around the dinning room. The manager came out and seemed frustrated that the girls were chasing the bird without opening the door first...  I'm sure that is plenty of an explanation above, however when the hostess came back (5 minutes later) she did 1 quick swipe with a rag on one side of the booth and said \"you'll want to sit on the other side, this will be wet.\" ... the other side had food crumbs all over it and the crease was caked with food.   I literally just walked out, and went to a restaurant across the hallway of the mall. I will not be returning to this location, and unfortunately it has left a bad taste in my mouth when it comes to California Pizza Kitchen in general.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WW90IoM0QAPb5fx84kAQPQ"
  },
  "ddr31-u4BS8Jof2BxopjMA": {
    "date": "5/29/2018",
    "text": "Came in for a quick appetizer so I can't really review their main courses. Their street corn was really really but the fried Mac n cheese was too greasy and just wasn't good. Waitress was nice",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Ycg_h9iYqjfnGMgPANMI_w",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Mexican corn and Max &amp;amp; cheese",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ycg_h9iYqjfnGMgPANMI_w/o.jpg"
      }
    ],
    "user_id": "0cEESn4urCGTI5D1IyfWmA"
  },
  "tZg9KAqqazjkKml8Q1XqBg": {
    "date": "1/9/2012",
    "text": "I had an amazing server and the food was delicious.  I think this restaurant is a bit over priced for dough and lettuce though.  I had the \"small plates\" which are amazing but the portions are very tiny and you can't really share them with others, as I did with my 3 children lol.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2x9zwFThF_L4iEyaUgmsjg"
  },
  "Xdtvi8_yZRWE2wd-cJSh9w": {
    "date": "12/6/2009",
    "text": "I entered the CPK world late in life, and I'm sad about it because, apparently, I've been missing out.  CPK is great!  Contrary to what I thought, it's not just a place for pizza.  Although the place can suit all sorts of tastebuds, I would recommend going JUST for the pizza.  I went this evening for the second time in two weeks and ordered the BBQ chicken chopped salad.  It maybe could've used a little more dressing, but it was still good, so I can't complain too much.  When I went last week, I ordered one pizza from the MANY great options available, and I have to say, there is a reason it is called the California PIZZA Kitchen and not the California SALAD or PASTA Kitchen.  So 'Yay!  I'm a fan.' of the PIZZA here.  The other stuff....meh.    The servers are always pleasant here, and I never wait a long time for the food to come out.  Prices are what you would expect for a chain restaurant.  Parking isn't usually a problem unless there's an event going on at Tempe Marketplace.  The up-side to eating at this particular location is that you can browse the shopping area before you stop in or after you're done eating.  Be forewarned: If you are ever asked if you want avocado with your salad, and you say yes, you WILL be charged extra.  Look out for this sneak attack.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "77sBf7U2Heve6AI4Gd0qyg"
  },
  "ebUmh5Yn_mTD_gsasnbaPw": {
    "date": "11/12/2011",
    "text": "It's a standard chain, but I'm a CPK faithful. I like the food; it combines Italian American faves and tries to do something different with it. The Kung Pao spaghetti is legit, so good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3cTzOtjLdqBncMR7b38jng"
  },
  "KSgICAn3Msqp8Ejvtlz0NA": {
    "date": "2/18/2011",
    "text": "CPK is a pretty standard place that you can go for for a good experience. I got a gift card for Christmas and treated one of my friends to dinner. They now have a small plates option which seems to be catching on, and my friend and I shared the quesadilla which was pretty good. I mixed it up that night and got the chipotle chicken pizza, while my friend had the hawaiian bbq pizza. I surprisingly enjoyed my pizza and my friend seemed to enjoy his as well. The service was good and while I don't usually come here often, it's always on my radar.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wJgtf18VKKZq9A6ZQUybQw"
  },
  "b0Kh1RYZJBV8OQic8DD65A": {
    "date": "2/16/2014",
    "text": "Same like any other CPK you can find. Great service when I came here in November.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N-wK1EpQs-TReteAH-WB9Q"
  },
  "oxKhS3RHrOY2sW8e-cFu-A": {
    "date": "7/5/2011",
    "text": "I don't usually like writing reviews for big national chains but I had to write a nice review about this place after our experience.  I've been to CPK's many times and never had a pizza I didn't like.  This time I ordered the chicken pesto and LOVED it.  I also love pizza places that offer whole wheat and thin crust.  The crust was awesome and the pizza was probably my favorite out of all the pizzas I've had there. One of our pizzas got burnt so our pizzas were taking forever and I needed to get back to work.  The waitress came over an apologized several times.  When she came with the pizzas she told us that the pizzas were on the house because they took so long.  This was not expected as most places in my scottsdale area would just say \"Sorry, deal with it.\"  The perks of going to a big chain I guess?  The manager also came over and apologized.  This was very generous of them.  I love you even more CPK, even if you are a chain.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nNiYVfIj1YZDINpqCQRY5A"
  },
  "vPtjS_WRU71kQluz154PLg": {
    "date": "7/25/2010",
    "text": "My wife and I and her friend went to CPK Friday night around 7:00 PM, we got a table right away and after getting our beverages ordered our food which took not less than an hour to get to our table. About 5 minutes into our meal the waitress comes by and asks if we want to see a desert menu WHA?? you take an hour to serve us and now you want us to hurry up and order desert! is somebody's shift ending soon? we said we'd hold off on the menu so what does she do? she brings it anyway! We skipped desert and left less than our usual 20% tip.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OMIhjjRR1uyc2sNWAxPJCg"
  },
  "oCLcSelWpKF_WJwZRKGUzA": {
    "date": "1/31/2010",
    "text": "I'm a big fan of CPK. The food is decently priced and super yummy. Today me and a friend went to this location. We got there around 1:15 and asked to sit outside. It took about 15 minutes to be greeted. We ordered our drinks and waited another 10 minutes. Finally a manager came over and took our drink order AGAIN and took our food order. She brought us our drinks and 5 minutes later our \"waitress\" brought us drinks. The food was good as always but I ran out of iced tea quick. No one ever filled it and a whole bunch of servers/managers walked by. I almost got up and filled it myself. It was just a hot mess and I don't know if I'd even return after that.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "06gL9VaAyAl6WoYVu_nPuA"
  },
  "LdZ0_by3K06-hUwQ10_yxg": {
    "date": "10/20/2011",
    "text": "Okay so I love this place, like, a lot. My husband, on the other hand, hates it. The only time we come here is when he is taking me out to celebrate me or when he just wants to love me well. The food is why I come here. The white pizza and Hawaiian pizza are to die for. The pizzas here are probably my favorite pizzas of all time. The food (even salads and pastas) is easily five star worthy. The reason I give it a four is because it is a chain restaurant. I have become a little snobby when it comes to eating out, and I just wish I could be served the same food in perhaps a different atmosphere. Now, the restaurant is nice and everything, but it is lacking a certain unique and inviting ambiance. I guess I'm just too hipster and cool for this place nowadays. The service is always pretty good here. They used to give out bread before the food came out, but now it is only upon request. I would highly recommend giving this place a try if you are the rare 1% in the Phoenix area who hasn't.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eGJMZmD_OGGKs29dNCsqsQ"
  },
  "IlHmpWf4OpTYYDE-gxT4ug": {
    "date": "1/19/2008",
    "text": "Another chain restaurant opens its doors among a sea of unoriginal yet conveniently located establishments comprising \"The District\" at the Tempe Marketplace.  Like many other all-ages locales, this place was frequented by many high school-aged kids on a recent Friday night.  As I approached the restaurant I noticed couples and groups sitting outside on a dark and unheated patio.  I then went inside and joined more people waiting in a drafty and seemingly unheated entranceway.  After waiting about 30 minutes - which seemed to correspond with the time I was quoted - my friend and I were seated at a blustery table near the door.  Brr - my light jacket was no match for the draft, so we asked the first person who approached the table whether we could possibly move somewhere further from the door.  In spite of several visible open tables, she made a face and said those tables were going to be taken by larger parties, and we would have to check with the hostess.  The hostess pleasantly moved us to a table much further from the doorway but somehow the draft still wafted over there even though this table was close to the open kitchen (weird).  Still, it was definitely an improvement, and this time I kept my mouth shut.    The waiter approached the table quickly enough and took our drink orders (water for me and lemonade for my friend).  He swiftly brought the drinks and the bread (which not especially fresh, warm, or flavorful, but who really needs bread as a prequel to pizza anyway?).  After sipping our drinks and helping ourselves to a slice of the aforementioned bread simply because it was there, my companion and I sat and talked and waited about 20 minutes for the pizza and salad to arrive (in CPK's defense, my friend was the one who not so brilliantly suggested bringing the two items at the same time, as opposed to having the salad first).  The waiter remarked, \"Finally, right?\" while delivering the food, and when we responded \"Yeah...\" he replied, \"Hey, it's not my fault!\"  If even the waiter is commenting on how long it took, shouldn't there be some offer of a free dessert, or at least an explanation of what the hell was going on back there?  But we didn't dwell on that -- we were too busy shoveling Chinese Chicken Salad and the trademark Barbeque Chicken Pizza - with honey wheat dough, of course - onto our plates.  The food was good - consistent with other CPK experiences, which after all is the goal when visiting a tried and True chain restaurant.  The waiter presented the bill while asking if we wanted dessert as an afterthought.  To his credit, he remembered to get our salad dressing on the side, refilled our drinks before they were totally empty, and timed my friend's to go order of mac n' cheese just right.    The draftiness, the bad table assignment, and the rather long wait time for the food probably would not make this a very smooth choice for a date, in my opinion, but it did the job for me and an old friend enjoying a rare low-key evening.  All in all, this was about what I had expected and would consider going back the next time I'm at Tempe Marketplace for a movie with a friend.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "Rs-HbyVraRCP2X4ey1t-IQ"
  },
  "5uHPqNIQ2c9XfeXS_-NTbw": {
    "date": "1/5/2008",
    "text": "i've never really understood the California Pizza Kitchen love. it's good, but i'm never blown away by the food and want to go back. I only go when someone else wants to go. I've had a few different pizzas and they always seem a little \"off\" to me... my current standard is the Santa Fe chicken, and every time I get I can't help but wonder.. -why- caramelized onions? why not just regular onions, that would probably taste better with guac and sour cream?   Maybe my taste just isn't refined enough, or something.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l5Fba-9TGiK9q0KqlaNUIQ"
  },
  "pdCNyioDQOGMn7oiyHvwSw": {
    "date": "6/20/2008",
    "text": "Today was my first visa to a California Pizza Kitchen.  I was very pleased with the service and the food quality.  I would not recommend the strawberry lemonade to someone looking to avoid a sugary drink; it tasted like soda without carbonation.  However, the pizzas were shared among my colleagues; we got the margherita.  We also opted for the Mediterranean salad.  The salad had lots of onions, which grossed me out, but the hummus was delightful, so that made up for it.  Also, our waitress was very attentive and friendly.  During the busy lunch hour with a moderate sized group, I was very impressed by the service!  I would come back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UihwIwmqO9TUfDHRXg8G2g"
  },
  "y5ONznL0oUKwEB5URXHe2w": {
    "date": "4/20/2009",
    "text": "Like the previous reviewer - i found the pizza to be good tasting and it came with a gigantic salad for the lunch special.   However the service stinks.   We waited a while getting in because there wasn't a hostess at the desk.  She sat us in a nearly empty restaurant (we were there around 11:30am).  She said, \"Bread will be right out.\"   or at least thats what we thought she said.  It turns out she must have said \"Brett will be right out.\" as that was the name of our waiter.  It also turns out (because we asked) that they have a policy of only bringing out bread if you ask for it.  This seems like a stupid policy, if they want to cut costs by not just automatically bringing it out, they could just offer it and the people who don't want it could say no.  Or just take it off of their service all together.  Having some sort of secret handshake to get it just seems odd.  Maybe if we had asked for the free beer, that would have worked... who knows?",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "L20e_VoJzUvhn2OrjBuX0w"
  },
  "6oOUw5cLFfl4qr1oS1CcCw": {
    "date": "4/30/2014",
    "text": "Great staff good service, the employes are very nice and polite, the food is great, and very nice atmosphere, try the chicken millines it's the best it town!!! I love spending time at the cpk  and I also like the curb side service!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SXGeF4-D92nM48DNVQbXWw"
  },
  "WcRXW4YrhwTMf6vWGreBHQ": {
    "date": "5/4/2011",
    "text": "Went to CPK again tonight. It had been awhile since my last visit in late 2010. The place looked the same, had more or less the same menu, and thought it would be business as usual.   We started off with some of their \"small cravings\" ... a little menu showcasing new smaller sides to share or enjoy before a meal. The Korean Beef Tacos looked interesting so we gave them a shot. Lets just say the only thing we were craving was our four dollars back after ordering them. Sure, cover anything in enough sauce it will taste okay. However, after eating a lot of tacos the past two weeks (been on the road traveling through CA), my money would have been better spent at Filli-anything or even Del Taco.   The main course was average, but it felt very commercially produced. No real flavor or excitement, just food.   Sorry CPK, but I won't be back anytime soon as my money is better spent elsewhere - especially with all the options available at Tempe Marketplace.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6KOVv8SBprzoiSp3LBfuUw",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6KOVv8SBprzoiSp3LBfuUw/o.jpg"
      }
    ],
    "user_id": "WV2t7NS3LfeHyHGakcqL2Q"
  },
  "5cyEIkBpBgjNd4QiVZt5Pg": {
    "date": "7/29/2011",
    "text": "I'm a little sad that CPK has gotten mediocre. I have been going to CPK for at least 20 yrs back home in LA, I used to go to the Beverly Center and ordered the same thing that I do now.  . wow!  little disappointed. I don't mind paying for good food but when the quality keeps going down then I mind. I have always been a fan of the BLT pizza on honey wheat crust.  But what happened?  the crust used to be fluffy.  Now they pound it out like crackerbread.  I'm not a fan of thin crust pizza and it seems like that's what it is now.  it's disappointing.  The Korean steak tacos here taste like rubber.  As far as sandwhiches go, I like the chicken ceasar and vegetable on onion foccaia bread.  Salads:  the bbq chopped chicken salad, original chop salad, and the thai salad.   I love the corn tortilla soup.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KDy_d2_7A89KSCZ4Vx6rTQ"
  },
  "RBj3N8bkSUXSYDg1-WRc2Q": {
    "date": "5/15/2015",
    "text": "We visited CPK with a group of 8. First off, the service was great! Our waitress kept our drinks refilled and kindly accommodated our needs. As far of the food goes, no one at our table really had anything to write home about was the butter cake on the dessert menu with ice cream. Since I am trying to watch the calories, I had the shrimp scampi zucchini. It was good...definately something different which is nice when you are dieting. I also had a side salad that my husband a and I split. The ranch dressing for my salad had an odd taste to it. The salad came with the dressing already included. The amount was just enough for me, but my husband needed more. My husband had the chicken tequila fettuccini. It had good flavor and is a good selection if you don't want pizza. Overall the food wasn't terrible, but it wasn't amazing either.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aQfMmtosELODaSlGd2qVHQ"
  },
  "hcVKZFPaXonXp_jgUdmXog": {
    "date": "5/9/2014",
    "text": "Wish I could give this place zero stars for value.... I had been given a gift card to CPK and finally used it. I would NEVER go there and pay for the way over-priced food and quality that at best is fair. I ordered 2 pizzas ( mush, pep, sausage and the Hawaiian and for he prices they are a ripoff. $30.00 for two just under 10 inch pizzas ? AGAIN RIPPOFF... Considering you could go to Papa Johns and get 3 pizzas of better quality and huge in size they should be ashamed to take your money... NEVER AGAIN and you fools that give 5 stars to this ripoff must have stock or own the company....",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mCjv8Z42PDpx-AWW8HUqxQ"
  },
  "2H_mnzPVsplYVoLISrgyUw": {
    "date": "5/27/2012",
    "text": "#1 KUNG PAO SPAGHETTI  #2 tequila fettuccine THINGS TO ORDER AT CPK!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "dPY7bBf9hY94Fr-XXuzcCA"
  },
  "m2sFvsy6ghyz1vQIMTcbYw": {
    "date": "3/27/2015",
    "text": "I got the tostada thin crust. It was nothing special. Ordered a beer and it came the same time as the pizza. Don't order the Mac and cheese bites, there are only 4 and craft does it better",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cjzjOubh5VPSNHl4O7k5IQ"
  },
  "8RxhwUDjSNtcJLQizOM_mg": {
    "date": "5/23/2015",
    "text": "The restaurant is hidden was hard to find in the shopping mall I spend 15 min trying to find it ... The food was good , but nothing good for kids to eat. The really bad part was the whole time we was there we had to fight off Mosquitos , we had to eat quick cause they where everywhere we could not enjoy our food!!! So if ur goin to go just make sure u have ur bug spray.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wdNZ4tLM2MntWLyf-uk5gQ"
  },
  "Nx98Vw6UQx0AOP1YiHi80w": {
    "date": "10/19/2009",
    "text": "For as much as I love Pizza, California Pizza Kitchen somehow misses the mark with me.  It just lacks that \"something\" that makes me want to keep coming back as a chain.  When date guy and I arrived, we were warmly greeted by the staff and we requested a booth.  It was Sunday night, and it was a rather quiet low key evening, so the restaurant was not exceptionally busy.  For whatever reason, we were seated in a HUGE booth that was meant for 6 people.  There were several other open booths that were meant for a normal party of 2.  Why were we sat at the booth of 6? No idea.  go figure.  Anyways, We had a foccacia appetizer and it was amazing!  Loved it!  Best thing ever!  But, Patrick's mojito wasn't quite up to par, so we asked the server and she fixed it.  I guess there was hardly any mint in it and it tasted weird.  (I hardly drink, but I will take his word for it.)  Anyways, I got the Santa Fe Chicken Pizza and it was fine. I don't remember what Patrick got, but he was happy with his food as well.  We passed on dessert and stuck around for a bit.  I really liked our server, as she was professional and handled herself wonderfully, but service was kind of slow. I don't know if they were short staffed, but at one point I was dying of thirst and out of pop, so I walked to the bar to get a new drink, and was told that one would be out in a second.  It was, but I think the poor girl was overwhelmed.  Anyways, I would return to eat here, no problem. Not a bad experience.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 4
    },
    "photos": [],
    "user_id": "qibGLHABNReGeJr2w4_8yQ"
  },
  "bC8oxCtEb6BGZFLCx-ycHA": {
    "date": "9/11/2016",
    "text": "The staff was. literally out standing!   My waiter was fantastic and catered to my son's requests and made our day.  The matre'd was super with every one in the dinning room.   He made several rounds and found a table that had a problem, and immediately got it corrected and delivered the dish himself.  He then comped the desert for the table.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JfCCgm-RmI9yhhCLalFfmQ"
  },
  "lvcwLKzn4cWlN4HRhDyxKg": {
    "date": "8/1/2015",
    "text": "I'm giving it two stars only because for the most part the staff was friendly. Major issue was the food was cold when it got to the table, asked them to take it back to warm it up...about 5 mins later they bring it back and its still cold!! Had them take it back again (waited another 5 mins) and when it comes back its luke warm but not actually warm/hot like a fresh dish should be. I was with a group of people and by round two they were almost done with their meals so I just dealt with it and ate it as is...well, actually I didn't even completely eat my meal because I wasn't happy with it. I thought for sure the waitress would offer a discount for the issues but nope! Nothing.Never going back here!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cjtUchCzUspqYdU_F3WC8Q"
  },
  "-OqF2Chy0Hv7C-0gdYFJxg": {
    "date": "2/25/2012",
    "text": "I remember going to CPK years ago (in NY) and enjoying it.  But I must say I was really disappointed.  We ordered a Roasted Artichoke & Spinach Pizza, but it was just ok.  Maybe I'm just comparing it to Picazzo's AMAZING Puttanesca, but this was a fail.   It wasn't nasty, it just wasn't all that...  And we were starving so it should have been delicious.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "giJKPZbmZofGMS3f4vl5mg"
  },
  "QQFwAvofvqlcO9enIMO4KA": {
    "date": "8/25/2017",
    "text": "So we had an interesting experience. It went from average to bad to good to average. Really up and down. I think we might've had a new server. There were 3 of us and they gave us one drink menu so we were sharing it. We placed it on the center of the table and While we were looking at it, the server just came and dropped a plate of bread right in the middle of the table on the menu we were looking at. Just drops it and walks a way. We all looked up at each other. While we were waiting for our drinks (a long time) a manager brought us an appetizer welcoming us as first timers. Still waiting for drinks. Then our food came, still waiting for drinks. Finally our drinks came, then another manager came by and offered to discount our food, we were thankful. One of the drinks was an odd one, the CPK signature drink so my friend sent it back. And ordered wine instead. Our server never came back around to ask us for more drinks or how was everything. Management did. However we managed to get another round of drinks in when he came over to leave the check which he had to reprint because he never came back to see if we wanted another round. Lol. So this is why I think the server was new. Good job to management for the follow-up and TIP: your server needs to be more aware of what's going on at each table. And pay attention to the order, example: server didn't remember who ordered what drink, drops the appetizers directly in front of each one of us without notice or excusing his reach. WE had to start moving plates around pushing water glasses to the side to make room in the middle for pizza and appetizers instead of dropping them under our noses. He was very detached. But I will say management was very attentive, apologetic and turned it around to make it a positive experience. Management 5  Server 3",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n8na-aNpHw5ZiI0W1W54pA"
  },
  "k9rqDmyLb9a5nx8JIQdCow": {
    "date": "9/8/2014",
    "text": "Came here on a Monday night with some friends. The ambience is quite nice and the we were seated quickly. We weren't really hungry so we opted for splitting a pepperoni and Hawaiian pizza. Each pizza was around $11-$12 which was a little steep but we figured they would be big. We each had 3 slices which was enough to fill us up but the pizza itself is below average. The flavor of both pizzas was abysmal and I honestly think little Caesars tastes better. I also have it two stars because I mean $11 for a tiny pizza? GO TO LITTLE CAESARS. Definitely not worth it. I would not recommend CPK when there are plenty of other good restaurants near here.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0ibkznjKzGlySB12WIn82w"
  },
  "5awxnGAOdaQR2X7lFnpQ3w": {
    "date": "3/19/2015",
    "text": "We ate there, service was slow.  Bar service was even slower.  The server was friendly and apologetic for the slow bar service.  The food was good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ddrNw1DJJo3CTH_wHkXMhg"
  },
  "_YWRxPSi31rHEp27WuXo2g": {
    "date": "3/16/2015",
    "text": "I'm not big fan of Pastas, but they do the best Chicken Tequila Fettuccine that I'v ever have, and I love the Spinach Artichoke Dip.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UymdMXXfph4pNEn5kJxaUQ",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Belgian Chocolate Soufflé Cake. Words won&amp;#39;t be enough to describe it :)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UymdMXXfph4pNEn5kJxaUQ/o.jpg"
      },
      {
        "img_id": "gGL4LrrBSRnyeN8Yv9UJRA",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. Tiramisu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gGL4LrrBSRnyeN8Yv9UJRA/o.jpg"
      }
    ],
    "user_id": "G58Bt4eboqpaBNaYE9g6bA"
  },
  "1IVB_2zTc0z3TkRv3C-6Dg": {
    "date": "2/29/2016",
    "text": "It took 15 minutes to get us drinks, then order was wrong (missed an appetizer) then we were thrown the bill to our faces and asked if we were ready with the check a minute later. Wow",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hSYQAsy-2ht_O4xWH98oDQ"
  },
  "wiqWDycrkI_ts62E7_05gA": {
    "date": "9/5/2011",
    "text": "Another chain that gives you exactly what you expect, and comes through.  There's way better and unique pizza than California Pizza Kitchen, but you always know you're going to get something that you'll enjoy at any of their locations (especially since they're all the exact same).  Although it does possess that out of box and thrown in the oven chain feel.  The girlfriend and I split a half salad and pizza for lunch.  The wild mushroom pizza was pretty good.  Not greasy and the variety of mushrooms on top were pretty flavorful.  We had it on honey wheat whole grain crust, which complemented the pizza pretty well.  I wish more places would use a wheat crust.  We also split the thai crunch salad.  Really good. The Thai peanut dressing is fantastic.  Avocado was accidentally put in it (which they offer with an up charge).  It didn't cost us anything since it was a mistake, but I wouldn't recommend paying for it.  Not too much is thrown in, and it tastes out of place in an asian salad.  It cost a little more than $30 to split the half salad and pizza.  Not too pricey, although most other pizza places will give you a bigger portion for that price.  But still, a good and fair lunch.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "3cC726zwgerKNNasnidAww"
  },
  "RLNjd5xoZ4AjPd7T455TmQ": {
    "date": "6/9/2013",
    "text": "Very delicious pizza, extremely friendly service. I ordered the Carnitas Habanero Pizza and every bite was delicious. Our server, Logan,  was very friendly and helpful - he helped make our experience awesome. I will definitely be back here.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "dx6IhkOv5K-W6xbPk2_M5g"
  },
  "d-2X_KIJnA3iS8Uv3RS2EA": {
    "date": "8/12/2013",
    "text": "Got the BBQ chicken salad, spinach dip, and the works pizza with my boyfriend. Everything tasted amazing! The only downfall was that we asked for the pizza on thin crust and they gave us original crust. It tasted delicious so I can't complain. The staff is hit or miss... But the guy manager is super nice and very helpful! Will definitely be coming back.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "f5QZUOU7UaC58qVMGIIIfw"
  },
  "LRUyXFcmmFvs91gyaxyCQg": {
    "date": "7/17/2014",
    "text": "My husband has been on a CPK kick lately.  I think we went 4 times in just a few weeks.  And I was ready to up my rating to four stars believing they had resolved their service issues, but it was not to be.  Our last visit we experienced the worst service we have ever had in a restaurant.  My husband finished his drink before our appetizers came (they were busy, so the food was slow), but the server dumped the salads off so quickly, we weren't able to ask for a refill or ask for bread.  The kitchen brought our pizza, and we never saw our server again, nor that drink refill.  Well, we did see him, numerous times, but each time, he breezed past us, refusing eye contact.  I had to flag the manager down myself to open our game token thingies.  Not easy because he was actually the server for the patio.  He was very apologetic and offered to comp our meals, but I declined.  Our meal was good, I just wanted to let him know his server was AWFUL.    So my 3-star rating remains because the food is always great, but service is just too unreliable.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rzf35jKV8e8EJdssrae_AA"
  },
  "qGneEKmjeK8tnS7wN9ybPQ": {
    "date": "9/13/2017",
    "text": "Food was good, pretty run of the mill. You know what your getting at a chain, but the host was the best part about my visit today. I'm sorry I didn't grab his name but from the second I walked in his was warm and friendly. Showed me the new items on the menu and made the extra effort later on to bring by a special treat since it had been so long since my last visit. Customer service is an art form!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MBDHc7VgJ9Kf952s8nVjtQ"
  },
  "waOoF8IEdNJMid2gzyhApw": {
    "date": "4/26/2014",
    "text": "They don't have enough choices on the menu, and the ones they do are over priced. I'm not a fan of paying $10+ for an ultra thin pizza with hardly any toppings. I've gotten the potato soup here before, it was good but not enough to keep me coming back. Service was not friendly.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-9WVpTW5LAEo9y6PbW0-cw"
  },
  "UgzBRkr5Ihj7hz8LqjF89A": {
    "date": "8/23/2014",
    "text": "Had a small bites wedge salad. I thought that it was not going to fill me up but I was pleasantly surprised.  :) I'll be coming back later!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3lVLT3IbXB8s1KAgR9NpDg"
  },
  "PVYbghuxA4etYA_0Zx7QJQ": {
    "date": "8/19/2017",
    "text": "Like usual the food was absolutely delicious. And not to mention the service from Justin was even better. He was super friendly and he was always on top of everything. He is awesome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mQgjLWAgI1HA8-N6LiBz_g"
  },
  "pAcJyBfbiw3JgAlknEIFWQ": {
    "date": "8/5/2014",
    "text": "Been here a couple times and always have had great service. The most recent time I have been here it was just for desert. I had the tiramisu which was yummy. was moist and had great flavor to it, and they even brought a bowl of whipped cream out free of charge... and the whipped cream is so good; they make it in the store. I'll be back :D",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wqcO86hX2t2X9MsDIsIwnQ"
  },
  "PjdHTRegsWJ5P10qDHkmSA": {
    "date": "5/9/2016",
    "text": "Service is great, staff are friendly, came in for the Carmalized Peach Salad and found it is no longer on their menu. So disappointed. I was forced to switch to their Waldorf Salad, pretty good but not as tasty as the Carmalized Peach Salad.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X4QlY1a1rIfGc-c0FSO6eg"
  },
  "tpMSSXvN6X0jIpDUZ50mIw": {
    "date": "1/4/2014",
    "text": "I am usually not one to complain about waits and time... But this particular visit was very slow The hostess was so helpful and nice  She noticed that we needed beverages so she just came and took care of us  The CPK itself is busy but not swamped I am writing this as a continue to wait for my food I'm also out of coke at the moment  We just noticed that we weren't offered bread or anything   There are so many servers just walking around but I don't see any of them carrying food or drinks...  I'm about to order a drink... Because the bartender seems to be ON IT...   Foods here  But we need silverware   Justine has come to our rescue, she isn't our server but she somehow managed to take care of us   Finished the meal, was good   Just waiting to get out of here now  Stay tuned...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6HM3Hm3gP0MJ8XN7IkRcRg"
  },
  "r_fwNFK-2eKpAxXmR349uA": {
    "date": "5/30/2016",
    "text": "Fresh food and great service. Jay was our server and he was on top of it. He did a great job making us feel welcome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KZVwKdezQB_xRcWPM9m5jg"
  },
  "6ejyJTGISvPPjU9OPfXGMg": {
    "date": "7/3/2016",
    "text": "I go here all the time, mainly because I love the chicken picatta. My only complain about this place(and actually all the locations) it's soo dirty and dusty. I've mentioned it many times but still always the same... So today I decided to try something new...horrible. They have a seasonal garlic chicken with roasted veggies in the menu right now. It was probably the worst thing I've ever ordered. The flavor was good. But the chicken had the skin on still...and It was gross. Under cooked and chewy. So I took it off...along with the flavor. The worst part was the whole dish comes in a bowl with inches of oil in it. Food just soaking in it. Not a great way to serve anything. Hopefully they can make changes with this dish because it could be good. It was not edible.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HuKukQEkrrNfdH6iGP6Lnw"
  },
  "fTxIl7pvlCD2pZwEgtcuQw": {
    "date": "4/30/2017",
    "text": "They have gluten free pizza and bottomless iced tea and lemonade. Made for a relaxing Sunday afternoon out on the patio. Best of all was our server. She was delightful- excellent, friendly service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "apNy48UYoND34gETF-3mGg"
  },
  "_9D8AC6eSZ5h69G0mnfF0Q": {
    "date": "10/31/2011",
    "text": "I LOVE CPK.   They've added new items to the menu. The only bad side is their lunch prices are the same as dinner prices which is a bit disappointing.   Average entree is $13-14. Add a drink & an appetizer .. you end up spending over $40 easily between 2 people.  This location accepts 20% ASU discounts for Dine-In/Take-Out!!  Plenty of parking since its shared with other business in the Tempe Marketplace but can be more difficult to find a close spot on the weekends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yV4dun0_ALnZ6LQIsrCu_Q"
  },
  "O1lDwrHVJ0fZrdrb3lZR6g": {
    "date": "5/15/2016",
    "text": "My two and a half year old wanted pizza for dinner so CPK was our dinner choice. It was delicious, we got the Thai chicken tortilla spring rolls for an appetizer and that could have just been our dinner, they were SOOOO good. I couldn't stop eating them! My husband got the jambalaya which he loved, and my pepperoni sausage mushroom pizza was one of the best I've ever had. Our food arrived hot and did not disappoint. Our server Bailey was very informative, recommended specific items, checked on us regularly and tended to us wonderfully. She recommended the SanTan grapefruit shandy beer, which we took her up on that recommendation, and it was top notch  this was my first experience at a CPK and based on this one, I will return and hope each visit is as good as this one.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "768vpyCVVNuEgobz4GfToQ"
  },
  "krMcD1DuXpxJj-EeAUIWtA": {
    "date": "2/3/2016",
    "text": "I typically love cpk and I hate to write bad reviews but solely because of THE DICK MANAGER at this location I highly advise avoiding this location all together. A real disgrace to the California pizza kitchen brand. I only say this because I am a type one diabetic and in order to maintain healthy glucose levels i need smaller portions that are controlled so that I can properly administer my insulin. I was denied the service I needed and The manner that it was delivered in was extremely and incredibly disrespectful.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CcsFz7OHmIj2zxb2ilmmNw"
  },
  "8T-Li7Gg1m0gQ05z36-Jiw": {
    "date": "6/1/2014",
    "text": "I do like CPK, but the stopped serving my favorite pizza, BLT. How is this possible? The have bacon & lettuce & tomatoes in this restaurant, how can they not make it?! I'm SO disappointed!!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zdwlWnfwYM3AOiQ8YIkMFA",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. 5 cheese &amp;amp; tomatoes",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zdwlWnfwYM3AOiQ8YIkMFA/o.jpg"
      }
    ],
    "user_id": "TVsyxo2d_uuziwUAbi3Ibw"
  },
  "hq99vG45XrIv9TUoidtHzw": {
    "date": "4/25/2014",
    "text": "I've been here several times now and one thing that never changes is how slow the service is. Every time, it's taken the server a long time to come to the table in the first place. On the other hand, the servers have been very friendly. I tried the mushroom spinach flatbread and it was very bland. For an entree, I had the ravioli, which was very good. However, if I hadn't ordered the appetizer, I would have left hungry. The ravioli needs to be a bigger serving. I've had different pizzas on other visits. My favorite is still the bbq chicken. Overall the atmosphere is very comfortable, however this time I wish I had sat farther away from the bar. The music being pumped out was too loud, to the point of distortion.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fx0Dv4UgYLrvxRGGtMP-Cw"
  },
  "Yr8zKAn4zjkK0QNavAHX2w": {
    "date": "4/9/2013",
    "text": "After a very long hot day at the art and wine festival on Mill Avenue, the GF and I decided to try a new joint (built up a pretty good appetite). Once again yelp came to the rescue. After reading many reviews about this place I was very hesitant to dine here. Seeing that we were already at the location and didn't feel like going anywhere else, we decided to get our food fix here. (Boy did I pay for that decision!).  The restaurant itself is awesome, had the right lighting, the background music was loud enough to hear but low enough to hear each other talk, and it's an open bar.   After being seated, we were greeted by a very rude waitress (Britni) who took our drink order. Five or so minutes later she came back with our waters and took our order. We ordered the California club pizza and also a peach tea. Fifteen minutes rolls by and no sign of our waitress, our glasses of water were empty, haven't got the peach tea yet (starting to get annoyed). The food runner brought out our \"eye candy\" pizza, Man - O - Man it looked delicious. Keep in mind we still haven't got the peach tea yet, with our waitress nowhere to be found I waved down another waitress, who kindly stopped and asked if we needed anything.  Ask her if she could get us a side of ranch and our peach tea we ordered 20 or so minutes ago. She apologized and said she'll be right out with it. Soon after she had left \"OUR\" waitress (Britni) shows up and ask if we needed anything. In my mind I was thinking (OMG are you for reals! Where the hell have you been!). Asked her about our peach tea and asked her for a refill on my water.   She reply's back \"Oh, I totally forgot about the peach tea\".  No apology what so ever. The peach tea FINALLY came out after we were done with our pizza.To top it off she charged us for the troubled peach tea.  Aside from the horrible waitress the pizza was awesome and full of flavor.   P.S. If you hate your job that much, please do us all a favor and quit. Go find something else to do with your life.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zKvLqECRuKPBcRm8-i_qjw",
        "caption": "Photo of California Pizza Kitchen at Tempe Marketplace - Tempe, AZ, United States. California club pizza",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zKvLqECRuKPBcRm8-i_qjw/o.jpg"
      }
    ],
    "user_id": "zQ1OJLGeBLGEcnIPzxlCPA"
  },
  "2Po0Dsgillsr2AwhUyRElQ": {
    "date": "12/15/2013",
    "text": "I've had a gift certificate burning a whole in my wallet for far too long.  Finally, the chance to use it!   Leah was our server and she was fantastic!   I started off with a glass of Colby Red Blend, while enjoying my glass I goggled the story behind the wine, it was created by a father whose son had undergone open heart surgery twice in order to raise money for The American Heart Association. Great wine with a great back story!   We split a salad and a pizza.   After drastically modifying the Waldorf Salad with the cheese and dressing on the side we quickly realized a whole salad is way too big for just the two of us (and we like to eat) with a Wild Mushroom Pizza. The salad and pizza were fantastic!   We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "biwNJEk-AHVSyRkrQK8c9w"
  },
  "PyMDN2gJ_ucy_NwUaVsECQ": {
    "date": "7/18/2013",
    "text": "I went to this place with some co-workers during Wednesday lunch hour.  I ordered the Thai Chicken on whole wheat regular crust.    The ingredients, sliced carrots and bean sprouts, while fresh kept falling off because it was just sprinkled on the top.  Overall, I finished it, but something about the sweet paste didnn't really match what you'd expect on a pizza.  I am just used to having salty pizzas.  The waitress was not attentive and did not refill my iced tea.  Not until we were leaving did she offer to fill it with water when I was just chewing the ice because I was just so thirsty.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "E-VrONfypxIWIf_jxTPz-Q"
  },
  "h7clzbBSbOefXRQszHPXIg": {
    "date": "1/23/2016",
    "text": "Tastes great and the staff was very friendly and timely. Portions are small for the price.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KH5OObCuWJfjaWqnoDFo7Q"
  }
}