{
  "FNPow-NZxz8K36P_EGYGSA": {
    "date": "10/23/2016",
    "text": "I live near Scottsdale so I only popped in because I was in the area. The location is a little weird. From the outside it kind of looks like I'm going to an abandoned warehouse. Once you actually turn into the parking lot- you will feel better. It's a huge location. You can sit indoor or outdoor. They have cozy seating. They have a special smoking outside seating area. They often have a band outside. On the far end there seems to be a private biker area. There were lots of tvs inside. Somehow it was not very loud. I can't explain it. I'm used to having to shout, but I didn't here. During high peak game time they label the tvs with what game they will play so customers can sit accordingly without having to worry about someone wanting to changed the station.  The pumpkin feta salad was very bland. Just small bits of pumpkin, seeds, and lettuce. It also come out late-later than the pizza and artichoke dip. The pizza was average. They were super busy sat night. It took over 20 min to get soda and coffee refill. Waiter took the cup to refill but didn't come back. Nice guy. It was swamped. A manager looking type man placed cheese and peppers on our table after we were finished eating and after at least hour of being there. Nice environment, great ideas. But organization and service needs a bit of improvement. I will go back though. Timely service isn't that much of a big deal when your mainly focused watching a game on",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uUiB73808cdOg1Tx77UjVg",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Artichoke dip yummy!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uUiB73808cdOg1Tx77UjVg/o.jpg"
      },
      {
        "img_id": "aVnI5s4HfTMgE5V7Uh937Q",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Veggie pizza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aVnI5s4HfTMgE5V7Uh937Q/o.jpg"
      }
    ],
    "user_id": "nmM5O_cjIt-hBIIz7-23MQ"
  },
  "JDjKusIvm9klTflT12EqYA": {
    "date": "10/13/2017",
    "text": "We (my wife, daughter and I) decided to try somewhere we hadn't been yet and decided on Desert Rose a few blocks from home. We loved the patio area which is what you first walk into. They have very nice seating with all of the patio furniture (many padded). It is self seating and the layout is good. The staff we were in contact with were fantastic. As we were seating we noticed the Nebraska Cornhuskers flags on the wall and found out they are a Husker bar. Which is nice for us as we are native to Nebraska. Looking at the menu the prices are on the high side at first glance however the portions accommodate.  We had the chef salad, chicken Alfredo, and the prime rib French dip (I might add the French dip is a monster) and all of the food was fantastically delicious. We noticed they do a Sunday champagne brunch with $.25 refills for $25 And it's all you can eat. We will be returning with the rest of the family soon. Great place and job well done. Thank you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uucxO1pxcxLsT412ivXqDA"
  },
  "MbJgMySDfviDyG8BUqI63g": {
    "date": "2/17/2017",
    "text": "The food was awesome bacon wrapped shrimp appetizer, prime rib was perfect, the  Alaskan cod fish and chips was delicious. We also had the chocolate cake all the servings are shareable. It's a place for everyone tonight they had live music with Chuck Delflorio he was great really enjoyed the live music a place for all ages, games, drinks and really great food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D9qd-m2DIdfuhBNFPyqSfA"
  },
  "SSEei-d9Eu25BZ5ctCN_kw": {
    "date": "4/16/2017",
    "text": "Desert Rose is an incredible find! Food is fresh well-prepared very reasonably priced every Sunday they have a brunch $19.99 per person. Every sort of food you can imagine from prime rib to shrimp fresh fruit omelets made to order every side ever known to man as well as....... wait for it...... you buy the first Mimosa at regular price and every mimosa after that is one penny. They have an incredible patio  a  DJ, music , they have games like toss back giant chess giant Connect Four giant Jenga. Staff is friendly professional laid-back.  And extra they ate very \"Family\" friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wy2X3O0lzs2wkj3UcYWKYw"
  },
  "IQOOvkiy3JdGt-4VpCD2hA": {
    "date": "4/13/2017",
    "text": "This is the Best place in town. The food is excellent and the atmosphere is very welcoming and you will end up mingling with the other patrons in the bar. They have so many things to do  from a large out door chess game, Karaoke or open mic on some nights!! There is steak house and lots of couches to sit outside and enjoy the weather....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x9Ru6WK_pPc-erWMOMOI1g"
  },
  "bfz_JyZt5S8LC52WMANpPg": {
    "date": "4/7/2017",
    "text": "I really like this place. It's fun and has a lot to do while just hanging out with your friends. I don't care for the food. I've only ever eaten outside and everything was always OK. Nothing great and nothing I'd want to take home and eat later (but I did take leftovers because they're pricey). Drinks are good they have a nice variety. It's family friendly because they have bean bag toss, jenga, ping pong, chess and checkers. Overall fun place near downtown glendale.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uzjQdpb3ay1YjTB7Xm1VZA"
  },
  "7FRJdxbAnngBCjjLutJrLA": {
    "date": "10/30/2016",
    "text": "This place has so much potential- huge place- excellent music with an awesome DJ. It's hidden off of Grand Avenue and literally on the same street as Glendale Police department and perhaps this might be the factors of why this business does not have such a large crowd. Honestly, there was such potential for this place on a Saturday night as I only watched a bridal party take advantage of this awesome place!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "MagAoZ5NutB5tHw1wzVHeQ"
  },
  "_M81D9JBWaaQMJyvDuzrzg": {
    "date": "3/26/2017",
    "text": "So of the things we have had so far... Brie Crisps were an A+ idea with B- execution. They weren't very dynamic from a flavor stand point and the bread they were served on was simply warmed. Would have benefitted from something acidic like balsamic. The Thai Chile wings were solid, crispy and delicious, ranch was on point. I had the Lamb Burger it was ordered Medium Rare came out Medium Well but was full of flavor, the fries were bland and left a little to be desired. My husband had the Prime Rib Dip, this sandwich was delicious and was everything that you would want out of a dip, however again the fries detracted from the rest of the dish... next up Carrot Cake... pretty stoked about this one I will share shortly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZgZKVka6AsVGXqStXJj82g"
  },
  "7tMHJxYwAVz0VMkWqAlC0w": {
    "date": "3/14/2017",
    "text": "Amazing place on the weekdays, especially Wednesdays!! Beers not too pricy, food is great, tons of different games to play for kids and adults and live music !!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jxSFehyz-PohqFujNG-DJg"
  },
  "FOM2YQC1EEvUtC5pTWA74Q": {
    "date": "3/14/2016",
    "text": "Had dinner here Friday. The place has a great opportunity to do fantastic.  The space is huge for sitting outside enjoying the evening with an area to play things like an oversized connect 4.  We ordered the Sliders and a pizza. The slider flavor was excellent. Great prime Roast flavor   We ordered the simple pizza with basil and tomato to get a sense of flavor.  Spot on for flavor. Cheese had great flavor. Not just a cheap mozzarella.   On the other side of the coin. It seems like they are working out some kinks. But those will work out. Just go to relax and enjoy the time on the patio.  The pizza, although amazing, needed to be in the oven a little longer.  The crust was a little moist in the middle.  We took our leftovers home and had them the next day after a quick heat on the hit grill. Crust was nice and crisp with a great flavor.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1YyjgFicEAdRXDICoU0S2w"
  },
  "SpOlGyQ1utD_UMGrMPWeAQ": {
    "date": "11/22/2016",
    "text": "Food was ok. I wasn't blown away. Pizza sauce lacked flavor. The prime rib was good. Our server was the best part of our experience! Great for kids and great for big groups.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZF2CFifmuP1BtNtnc4lvfg"
  },
  "85gRiyH0t4QksSiDMVPBEA": {
    "date": "3/12/2016",
    "text": "I absolutely love this place. I grew up in the auto supply and welding company that were once in these locations. I always hoped someone would save these buildings and give them life again.  I had Valentines Day buffet here and i loved it. The food was really really good and the staff was eager to help. The outside has oversized versions of childhood games and plenty of places to hang out. Very well done. Kids were welcome and i was pleased to see couples and families hanging out. I will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Na91t6SEr1moJCd0t3IXjg",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Na91t6SEr1moJCd0t3IXjg/o.jpg"
      },
      {
        "img_id": "KmehZ7iVLlA1Uhbyl-seSA",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KmehZ7iVLlA1Uhbyl-seSA/o.jpg"
      },
      {
        "img_id": "r41uYCHxwhDqKT3UmtsyZw",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/r41uYCHxwhDqKT3UmtsyZw/o.jpg"
      }
    ],
    "user_id": "NNwVf7z9OCmkplma9vrdCA"
  },
  "Nawygp1HpInkZril_jZeOg": {
    "date": "3/8/2017",
    "text": "This place has amazing food!! I thought at first it was a bit pricey but after having the $15 philly w steak fries I certainly got my money's worth! They use prime rib and I swear it's the best I've ever had!! My wife had the bacon wrapped shrimp and they also were amazing!! This place is worth making the trip. And did I mention live entertainment too!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VpdyQ92j2k81bhNVHGHuJg"
  },
  "Bo_EVq6uQNVf2NLLuC5vTg": {
    "date": "3/5/2017",
    "text": "Good but there was an older blond lady with a  ponytail l with a waitress uniform who started to be disrespectful to the staff and yelling. I will go here again but I hope not to see her again. She ruined the mood",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A0UZ_o0BfRtuk6pUPixAcw"
  },
  "igMX_Dxzz3qLHT1yRX093Q": {
    "date": "3/5/2016",
    "text": "This is a very cool place to go. Huge, in Old Town Glendale with a very large indoor restaurant \" industrial style\". It also has a large outdoor patio with comfortable seating and lots of TVs, a \"garage\" that is a cigar bar, then more outdoor area...  so I give it 5 stars for atmosphere.  Food is not cheap. We have a large variety of food in our group. The steaks were awesome at around $30 each. However some of the less expensive food was not quite so good. The lamb burger was very thin and less than flavorful, especially once you got through a giant stack of lettuce tomatoes and sauce. The prime rib sliders were so dry we had to order a jus sauce to make them edible.  The service was very sketchy too. There were only a couple of other tables being served the night we were there, but we had to keep sending somebody back to get our waitress for drinks and another items such as eating utensils. She just never seemed to make it around to our table... But she was nice enough when she was there.  The food and the service is what brought down my score.  I will go back and try it again. We were there about two to three months after opening, which should have been plenty of time to get things together, so I hope things will be better next time. One more shot...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y3Z0kc2qZKjLf8-Yf7hjGQ"
  },
  "orF2q7zw82hVfs62BoSEpg": {
    "date": "12/10/2017",
    "text": "This is my favorite spot in town. Absolutely love everything, from the food, the drinks , all the way to the full size games outside with a beautiful patio. Donovan and the rest of The staff is amazing and super helpful, that's honestly what make this place. It has all different types of foods, like steak, wings, of course the pizza, and pastas. And oh, you can't forget about the beer selection, honestly way better then buffalo. Has literally everything for a great amazing day/night. This is a place you take the love of your life too. Haven't had any problems here at all.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G1YA2the0C6FBKRf8jiQ5g"
  },
  "cYdfe8nAzvz71HpiYdklDw": {
    "date": "12/8/2017",
    "text": "We came here at 530 sat in the bar for 20 minutes before walking out without being served. Came back to listen to the Elvis impersonation guy who was good. But with 10 seats open at the bar outside bar, we were told by the crack whore behind the bar that she was to busy to serve us that we need to come inside to get a drink from someone else. This place is not a place to go",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KTwwxgzm9cF8grunb0aFRA"
  },
  "FMF4XUKL1MXECtzGnK1UGA": {
    "date": "11/7/2017",
    "text": "Written for the steakhouse but impacts the pub as well: This place has an identity crisis. The food is decent, so let's start with that. Some great cocktails on the menu as well. But they were sharing bartenders with the pub outside. So don't let the fact that they are marketed as two separate businesses fool you. It took awhile to get drinks; our servers had to be flagged down; and we had to serve ourselves water. As for the outside - totally different. It used to be a place that was seamless - the pub to the steakhouse and back was completely comfortable for all ages and groups. But now - the pub does not have servers, people order at the counter, and they have signs up prohibiting gang signs and colors. When did it turn into that kind of place that we have to worry about it? Won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v3Ote4hiFnwsaj3E_X0-yA"
  },
  "y2O9NjDKeJXPV3fwObqlDQ": {
    "date": "12/18/2016",
    "text": "Service is awful! They have plenty of people available but are standing around doing nothing half of the time! If you're the type of person that likes to go out and serve yourself, go here! If not stay home!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vTgkIuY8PFurpxVESLb1zQ"
  },
  "llfjPLip2aOWhai3mCM_3Q": {
    "date": "7/23/2016",
    "text": "Me and my husband met for lunch here and the wait was ok being that we were rushed due to the time. We had a pizza and it was delicious and the service was great . I will be going back for more.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "deryjTlc54AWh4fPTnU5ig"
  },
  "CbGXCYh2XSvvRWbcvPzG4g": {
    "date": "4/11/2016",
    "text": "My boyfriend delivers beer here and told me about it. I was hesitant to try it out at first, but am happy we did. The atmosphere is so much fun to just relax and enjoy some games while drinking and eating.  They had life size connect four, jenga, and shuffle board to name a few.   I tried the seared salmon burger which was delicious. The salmon was crispy and the bun super soft. I would ask for light tarter sauce next time, but definitely a dish I would order again. My boyfriend ordered the burger which was juicy and flavorful as well. We sat at the bar and service was awesome.   We got a tour of the cigar lounge which was restored and still has adobe walls exposed.   Lovely little gem, I would gladly visit and share with friends and family!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "8bc6od_LBGg79fHhDgSPUQ",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Seared Salmon Burger",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8bc6od_LBGg79fHhDgSPUQ/o.jpg"
      }
    ],
    "user_id": "bNwvHKV6g-bwegXWJNQ18Q"
  },
  "8zsT4OOEfSMQnr6wJuX3pA": {
    "date": "4/15/2018",
    "text": "Came for the Sunday brunch! Got here a little early,enjoyed it so much sat and enjoyed the place for several hours! Top notch !!!!! Prime rib is off the chain",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DGTgyN7XCTg4L8Gd6yI5yQ"
  },
  "W8GYOLjSn-BxsUUUlX1sxA": {
    "date": "3/29/2017",
    "text": "5 stars for food, the servers desire to help and the atmosphere.  0 stars for the management.   There is absolutely no leadership or guidance here. We were literally asked 5 times \"what would you like to drink\" before our drinks arrived. Servers were not knowledgeable about the menu. Someone needs to step up or hire someone to run this place correctly.   The food is far better here than the steakhouse next door. It may be the same kitchen but not the same quality. The live music and games are fantastic for date night or families with teens.   I really hope this place gets their act together because there is a ton of potential.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "R3s8mmbaNgmfKpUGZ8Mbbg"
  },
  "ixp1VzQ43q5zPZM4RAU42A": {
    "date": "5/5/2017",
    "text": "A good place for older kids for sure. The food is mediocre, but the time spent goofing off with an impromptu family game night was great. Service is less than desirable. Everyone wants to help but it's as if they have no management guidance. In the span of 15 minutes, we were asked 5 different times by 5 different servers what we'd like to drink. When we finally got our drinks, we experienced a similar situation with the food order.   In the end we will return, but not to eat, just to order our own drinks from the bar and play games.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "cRDYyJV8dBteW87rM9Llhg"
  },
  "F3Dv9bnR-XzNzLtiTYYCPg": {
    "date": "10/22/2017",
    "text": "This is such an awesome place!!! We brought our fantasy league here and was able to get a table large enough for us to see all the games! The kids had a blast playing games and we enjoyed the amazing food! Can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "taDO9202yG9ImUgGOW68iA",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/taDO9202yG9ImUgGOW68iA/o.jpg"
      }
    ],
    "user_id": "3IAtSUjwjnGUFvsRlQpQVg"
  },
  "aTHTz3B1k6Sjv86aJwzPOQ": {
    "date": "4/21/2017",
    "text": "Love this place! Found it on accident the first time. The brunch, you need to do yourself a favor and go to their brunch. Steak and mimosas!!!! There is other stuff but steak and mimosas! It is a clean place. The restrooms are clean as well. This place is huge, but can fill up fast depending on what is going on. The \"yard\" area has bands and giant games, like Jenga. Patio seating and there is also a cigar lounge (different building). Staff is friendly and professional. Service overall is good. I once had a chicken dish with herbal lemon butter, don't get it. The chicken was very bland. Update: the guy running the cigar lounge is much friendlier now. LOL",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "b3XbMZn_ToJPUFAnQhfV1g",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Beer and Summer sangria",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/b3XbMZn_ToJPUFAnQhfV1g/o.jpg"
      }
    ],
    "user_id": "2oh3TW6eiLC-YJoZwTSgPg"
  },
  "kLDnBcOgLDIKPSsAWTrH_g": {
    "date": "4/5/2018",
    "text": "Like the other reviews said, the bartenders could not give less of a shit about the customers. Also, why are we tipping when the service is the exact same as Wendy's? You walk up, look at a menu, order, take a number, and sit down and wait about a 20 minutes to get your beer and an hour to get the food. This place is terrible and it just keeps getting worse. Go next door to Cuff, their staff is super friendly and they are always on top of it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nIA3tFvUexyp9siSO7ax-Q"
  },
  "7o0B8OAyJelhouFow4xa7Q": {
    "date": "11/6/2017",
    "text": "I am so torn... and I am going to copy this review for the steakhouse too since I am not entirely too sure what I experienced. The food was good, the facility not so much. We walked into what we thought was a steakhouse/restaurant and were not greeted & when we asked for guidance we were told to seat ourselves and go to the counter to order. Then we heard karaoke, so we headed to the next room, which I think was the gastropub. We sat down and reviewed the menu, then watched some people order before a server (with food in hand) saw our deer in headlights look and came over to us. She walked us through what we should do & gave us a menu since the one I took from the previous room belonged to the steakhouse.  We went up to the BUSY cashier and placed our order- no tip since we did all the work. If I did not ask for a water cup in addition to our alcoholic beverages we'd have been parched. Our beer & pineapple cider came after a few minutes and my boyfriend had to go back to the bar to order another beer before our food came out. We would have drank about 3 drinks each, but we did not want to have to keep on purchasing them one at a time. Oh, we also checked outside for seating but I was completely overwhelmed. The outside is beautiful and huge, but it was filled with live music, tons of games and kids- I think there was also face painting taking place. A man walked by and handed us business cards, we thought he might work there, but he was just trying to get the word out about his business.  The nice server that gave us guidance delivered our food, she said she would be back to check on us, but we only saw her walk by a few times.  We had already decided we would never dine in again, so we were hoping the food would be awful. We were wrong, the food was really good. I did leave a tip, just because I felt the two people that gave us guidance (cashier & server) deserved to get something, as we were not sure what was what.  I don't really like crowds, so that in addition to the lack of customer service is why I won't dine in again. I may order to go- but I don't even know if they do that. I am sorry my review is so awful, but it kind of fits into my experience, as I had no clue what was going on there.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "othmxOmbCmyjpI6x3_6nxQ"
  },
  "w_BVH4i6eSvNUKk0018dmA": {
    "date": "1/20/2017",
    "text": "It's a rainy night and don't want to drive east for a decent meal so we decided to try out Desert Rose. It started out OK but as the evening progressed service became next to none. We got more attention from Sophia the bus person!  Really disappointing as there aren't too many places to eat downtown.  The food was OK for the price but management has a long way to go...maybe hospitality classes would help...and the servers need training.   What really did it for me was how a very large group, that was going to be spending hundreds of dollars on food,apps & drinks,was crammed into a few tables . When I mentioned to the hostess that it looked like they needed another table added on she replied with 'they're just gonna be squished'...and they were! Won't be buying dinner there again!",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Iq0Hkg_CfpkPSxlcT8hY8A"
  },
  "tCytOnnUQtPgywCPwZj5kg": {
    "date": "7/15/2017",
    "text": "Food: good but pricey and they don't offer much for kids at all. Location: I like that it's spacious and there is a lot of opportunity. The games outdoors is fun and the live music is awesome!  Service: I've been there 3 times so far. First time it was awful, had to flag down waiter several times for everything we needed and it wasn't that busy there. Second time it was better but hostesses were on phone while I stood around waiting to be helped. Third time it was better no complaints at all. I came in with a group of 12 or so and was very pleased with service. I do like their option to order individually at the cashiers desk so no one sticks yoh with their bill.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YXK9PJ2Om4i_ZDGsk80OFw"
  },
  "yGdl5XnqziffWiZxLw0XkA": {
    "date": "5/23/2017",
    "text": "This restaurant gets a 2, instead of a 1 star because of the great bartenders and wait staff. We come, every week, in a soccer group full of adults and kids! The atmosphere seems very kid friendly, but it's as if Dave and Teresa, the owners, can't stand children! We have been asked to move, several times to \"follow\" our children. Our food has been undercooked, thrown on the table in various spots, regardless of who ordered it and ultimately felt unwelcomed. We tried and tried, to no avail. The concept is awesome, but the owners aren't accommodating to patrons. We would love to come back, but the amount of money we spend here doesn't seem to alter the way we're treated.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cH4x3KACq0A7hpBJlCN1_Q",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Literally got reprimanded again by this guy, then took a picture of him and the owner getting into it, in front of customers!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cH4x3KACq0A7hpBJlCN1_Q/o.jpg"
      }
    ],
    "user_id": "uhG_kD_q6StVNLDTlUELuQ"
  },
  "s5g0dk_5AGiJSzZm-8tn2w": {
    "date": "3/30/2018",
    "text": "Knock off OHSO Brewery, with over priced bar food, followed by watered down drinks and crappy service. Would NOT recommend at all. Save your money and go somewhere else.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xyfZE9AqWFREPplKFx7JvQ"
  },
  "PW7VYBTzVlYxU6FVq_8Ubg": {
    "date": "9/16/2017",
    "text": "Food was great and atmosphere on the patio was fun.  Enjoyed our time after dinner playing ball of the outdoor games provided.  Service was a little slow on getting drinks at the bar, but other than that had a good time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Lz_6z-HrmUdkVMh3yRv-_g",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. French dip sandwich with sweet potato fries. Delicious",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Lz_6z-HrmUdkVMh3yRv-_g/o.jpg"
      }
    ],
    "user_id": "0SApmfUe9_BHJTfBNGWgbw"
  },
  "1-1rORQuRtrtAC8qLCjEIQ": {
    "date": "12/10/2017",
    "text": "We always have a good time at desert rose. The food is great (margarita pizza is my favorite) and the variety of beers are crazy and the prices are great also.  The kids love going here, I think it's cool that there is something to do for the whole family no matter what age. If you haven't been you should.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KjwQxjN36oTiwIM66dzzMw"
  },
  "TYoTdMz_3C6-Wofh7Vev6w": {
    "date": "12/18/2016",
    "text": "What a disappointment thought this was pretty good place since I've been to their Steakhouse next to here wasn't the greatest but was still pretty good figured try this out let's start with the service it took at least 15 minutes for someone to come to the table can't really blame the server on that I think that's more of the hostesses job now the server she was friendly new the menu pretty well couldn't give any real suggestions with the order they were out of a few things she was just very slow she took forever to take the order to bring the water back I had to get up two times walk to the bar to get water refills which is kind of BS whatever I will be there regular cheeseburger medium rare it was not very good at all how do you make a dry medium rare Burger don't know too much bread the guy who brought the burger sat it down and walked away didn't have a chance ask for ketchup or mustard or anything for the burger or fries so I got up and went to the bar and asks the bartender for the stuff wife had the salmon salad fish was OK but the dressing tasted like butter again no server to ask for something different never once saw any manager walking around won't be back",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IFvtsza3jN_m7BKnuWLTCw",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IFvtsza3jN_m7BKnuWLTCw/o.jpg"
      },
      {
        "img_id": "V30k9JNiKk-MUuYnOOTURg",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Salmon sandwich",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/V30k9JNiKk-MUuYnOOTURg/o.jpg"
      }
    ],
    "user_id": "kbfpED-6FURIsNlsAXqc2g"
  },
  "m_STEofC48ThvgpJlZYRiw": {
    "date": "12/5/2017",
    "text": "I don't know how to score this--  I want to give 0 stars for the restaurant, but I want to give Donovan, the bartender, 5 stars!  He turned an otherwise ugly and disappointing experience into a pleasant one.  This will be the last time we go in there, however.  I don't really want to go into the details, there are too many to list, but Donovan took the time and went out of his way to serve us and make us feel like valued customers.  I don't foresee this place staying open for much longer unless someone buys it that knows what they're doing.  And I hope Donovan gets snagged up by someone in hospitality that can use his skills, instead of them being wasted by a restaurant that seems to be \"bothered\" by paying customers.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mEiR7F_z1dyiSkCNl5calg"
  },
  "ZpYyd4pjg4F5ByqST42Euw": {
    "date": "2/14/2016",
    "text": "They put the Jumbo in Jumbo Shrimp! I stopped off with some friends to have brunch and the brunch was loaded with good stuff. An omelette station, carving station, all the regular fixins and jumbo shrimp! The atmosphere is classy bar with awesome lounge chairs and tons of life size games like connect four and jenga!   Literally the best made to order omelette I've ever had! You have to check it out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yRSq1Gr1zgiHadCW0N6tUQ",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Best jumbo shrimp ever!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yRSq1Gr1zgiHadCW0N6tUQ/o.jpg"
      }
    ],
    "user_id": "JOWWyzguVD2IcmIFKTZjBQ"
  },
  "nU0FY-4EEg1LcgqltYbulQ": {
    "date": "1/16/2016",
    "text": "So much fun here at the Desert Rose Pizza and Gastro Pub!   The family and I are sitting outside under the heaters and watching the playoffs. Like any good sports bar they turn the music down and commit to the full game affect with plenty of tvs inside and outside! The staff is very pleasant and accommodating. Drinks are definitely flowing here from wine and cocktails to the $10 BUCKET OF BEERS!! My mom and I shared the 24oz bone-in ribeye with garlic mash and broccolini. The food is delicious and the paired house wine topped off a fantastic afternoon/evening.   P.S. They have a brunch coming soon, as in TOMORROW! From the hype, it sounds like it will be buffet style and include tasty beverages like mimosas and bloody Mary's! Can't wait, see you tomorrow Desert Rose #desertrosesteakhouse #desertrosepizzaandgastropub",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "-8xpfqewAbDMvPPQZUvdmA",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Sports bar done right",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-8xpfqewAbDMvPPQZUvdmA/o.jpg"
      },
      {
        "img_id": "tqfTcXL3-9Uhlf6Eee5s3Q",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Gorgeous family picture and outdoor patio!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tqfTcXL3-9Uhlf6Eee5s3Q/o.jpg"
      },
      {
        "img_id": "pxfH7ryXsglw8RuWUiVoKw",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Bucket O&amp;#39; Booze",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pxfH7ryXsglw8RuWUiVoKw/o.jpg"
      }
    ],
    "user_id": "2ZJgH9E4kwXTnBa1REPYZg"
  },
  "berSPJmjERlP3z3uzRpo2A": {
    "date": "3/9/2018",
    "text": "Pricey and slow, for the product ,Bar tenders did not seem interested,  The good  Out door patio is cool and different .",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R_JeOdmsDxZHdDq1J7By1Q"
  },
  "IyslhYOeXQwKdf6BNSa_ig": {
    "date": "1/7/2017",
    "text": "This place is a pretty cool place, but however the service is horrible! They didn't even clear our table unless we handed the server the plates and we sat there for 4 hours an then only thing that kept us there was an incredible band Dust Storm City! All of checks came wrong after asking for them several times.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JY-XvND-qlYPKb7KWtLMjQ",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JY-XvND-qlYPKb7KWtLMjQ/o.jpg"
      },
      {
        "img_id": "8QYWik3M9pJk8OM84il8xA",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Buckets of empty beers that the server never picked up, ugh!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8QYWik3M9pJk8OM84il8xA/o.jpg"
      }
    ],
    "user_id": "WKIHo_r-vky8foJo9FRQ-w"
  },
  "ctM1JGqc0EO5JifPpUH0UQ": {
    "date": "8/3/2018",
    "text": "Great brunch/night place to gather a group of friends for some drinks to chat, grad a bite to eat, and have some fun. Enjoyed having our bookclub meetings and also catching up with some old friends. Food is great with multiple drinks to choose from beer to wine. The fun part of this place they have ping pong, giant chess, and a cigar lounge, and more ;)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4G7amfizasBX3hwU2Wo_dw"
  },
  "MVj5419NRlTges7Q_imqoA": {
    "date": "4/8/2017",
    "text": "My boyfriend first came here for a dinner for work, and I'm really glad we finally went back so that I could try it! It's almost a hidden gem out on Grand Ave., I don't know how people find out about it other than word of mouth :)  Despite being pretty busy, we've never had to wait for a table, and the service is always quick as well. The only thing I didn't like the second time is that we got placed at a super small table, which made it hard to fit all of our food. It seems like they should have more of a dining area.   The pizza here is some of the best I've had in a while, and their wings are great, too. I definitely recommend the Thai barbecue sauce on those, it's delicious :) other than that we liked the calamari and the bacon wrapped shrimp, but those I could go without. Next time I'd stick with pizza and wings!   The beer selection is great, too, I've tried a couple of new ones and really liked both! They also have a lot of fun games on the patio like giant jenga and giant chess/checkers, as well as live music!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iKO2PcgrCvDjUzhnUpDdMg"
  },
  "5g9pzqRGotd0Lsa3QnD27A": {
    "date": "10/1/2017",
    "text": "The food is decent and the staff is good, but they don't serve you. Want a drink, go to the cashier and order and pay for it separately. Want food, go back up and order and pay. Want another drink, let your food get cold while you walk back up and order and pay again.   Super inconvenient and defeats the purpose of a sit down restaurant when servers don't even come by the table.   The staff even expressed how much they hate the concept. Not going back until it's changed back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 1
    },
    "photos": [],
    "user_id": "DIGeapVOD_uW0HpASuxJWQ"
  },
  "-wMIQbi2bEYqIhZRllQq6A": {
    "date": "5/12/2018",
    "text": "Horrible food and horrible customer service. This place is just horrible all around . I was told this place has horrible customer service and gave them the benefit of the doubt. All the rumors we're on point and very True. I ordered a prime rib salad and the prime rib was absolutely disgusting. When I brought it to the manager he acted like he was upset at me for complaining.  I never ever usually complain about food I just don't go back . This was so bad that I told the manager he can take it back and give me my money back . I will just go get a better salad at McDonald's smh.  Don't waste your time or money with this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "UZeAlqL-QPRJTcR05z36Kw"
  },
  "Y7y8xHA8nf-kPpvoi-iFtg": {
    "date": "4/13/2018",
    "text": "STAY AWAY! My boss's lamb burger was obviously rotten, and the bathroom that only holds one person has no working lock. I was walked in on three times after locking the door each time. Do not come here; OBVIOUS SAFETY AND HEALTH HAZARDS",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "zl9dYWtUM8WxsKFrsL9lbg"
  },
  "9KXPg5RVc8w3_d1-VrygcA": {
    "date": "9/26/2016",
    "text": "I really love this place.  Stumbled across it while driving around lost in my new neighborhood. There really aren't nice quality places to eat in my immediate area so this place was a True gem. We love it so much that we dine here at least two nights a week.  The food is typically top notch and the service is usually really great.    However, my visit to the restaurant this weekend was surprisingly disappointing. I ordered their amazing blackened chicken alfredo - its probably the best thing on the menu and the best alfredo in town.  So when the server delivered a completely unseasoned plain piece of chicken I called it to his attention.  I told him the chicken is usually very well seasoned and this chicken had no seasoning at all.  He called the shift lead over who went to the cook.  The cook confirmed that they were out of the seasoning!  This dish is all about the seasoning. The shift lead apologized and offered a gift card due to the kitchen closing, so I wasn't able to order anything else.    When you are out of a main ingredient it would be great practice to let servers know so they could let customers know and not try to get away with serving a plain piece of chicken (that someone could make at home).    So we received our typical $48 bill and no gift card.  I brought the gift card offer up to our server and he said \"my manager said you're not getting one because she gave you a 'discount' on the chicken.\"  There are two issues here: one the lead needs training on never over promising customers.  I did not eat the food and I don't think i should have had to pay for their mistake.  I feel at minimum I should have been given the option to order something else.   This place is not cheap.  We are paying high end prices for quality and  service and I didn't receive either this weekend.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 11,
      "cool": 0
    },
    "photos": [],
    "user_id": "dViXK7-cwiX5YV7cEQQ84w"
  },
  "IPsHier8BPW0gVDGzBFdmg": {
    "date": "7/22/2018",
    "text": "We were there last night for a buddies Birthday. The outside patio was great; lots of tables, games and seating area to spread out.  They had misters and a pretty good DJ that played a mix of music.  There was also karaoke.  They have a all day happy hour menu that's a good value too (5$ potato skins, zucchini, etc.). The cigar room has a good seating area and a nice selection of cigars. The only negative is that there were young kids there till closing and there was a sign that said \"over 21 after 10PM\".  Overall it was a great place and I would definitely recommend it especially when the weather cools down.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NIh94z4aGoE807EIz8B0og"
  },
  "hgwp356uP-r1qZG-ep04jg": {
    "date": "8/26/2018",
    "text": "This must be the easiest cooking job in the world - You don't clean your fryers, everything comes from a can or bottle - you ain't butchering the cow or anything so you're literally just putting burgers, steaks and mixing store bought items together, heating it up and say this is a gastropub?  Do you even know how to cook?  The only reason there's even a star at all is due to the saving grace of Mona, who didn't stop moving to work or attend to my party the entire time there.  Tldr; Beer is fine, food is ABHORRENTLY overpriced for near microwaved nonsense.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jB32v5WVXDDoG-tjluZbuw"
  },
  "SmkibzXIG_NgoU9xgJBCSA": {
    "date": "9/3/2017",
    "text": "Would never return.  No at table ordering.  You had to go to the bar to order food-drinks...couldn't run a bar tab.  Earlier evening long/haired pointy tail bartender was extremely rude and didn't know the menus of drinks.  We came because they advertise that they are Nebraska huskers bar; however, there was no indication that it was so.  We were moved from table where we were eating and watching the game to make room for a group of +50 to show up 1.5 hours later (this group never showed inside) their venue was outside....our tab was $170 for 3.  Their drinks were over priced and service def under delivered.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bh0VbJxVq7E1adHj7HIaHA"
  },
  "Gdg2bovU-PZrWdVGu_VIeQ": {
    "date": "12/13/2018",
    "text": "I have eaten at Desert Rose twice in November.   Both times, the food our family ordered was delicious.   It is a quaint, inviting place that is perfect for children of all ages, as it has games.  Connected to the outdoor seating is giant Jenga, ping pong and many other activities. The menu offers everything from burgers to delicious Street tacos to fried squid.  The place is casual and affordable.  We will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Koo_rS5AlfSuuf9VkzHVEg"
  },
  "BMpUH5KNzB6FzedDAujSVw": {
    "date": "6/10/2018",
    "text": "We went for the Sunday champagne brunch. The food was fantastic and the service was super friendly. If you want to splurge a little on a great breakfast, I recommend pigging out here. Bring your appetite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8iMC1xicnnbF9veHbyuMjg"
  },
  "5S_wv8abJYWgZYrB8weVBw": {
    "date": "4/7/2018",
    "text": "Don't bother going to brunch here... there are minimal options, serve yourself, just an overall poor experience. Wish they would just hire waiters and stop trying to be 'European' with the style of service. I want to like this place but the management which will attack customers who make suggestions to improve the place needs to take their heads out of their a**** first.  If you want to pay $25 per person for brunch, but do all the work serving yourself... this place is for you.  If you like drinking mimosas for 50 cents out of water cups.. this place is for you... the 25 cent mimosas are out of the champagne flutes.. but they won't tell you that unless you ask for your 25 cent refill.   If you want biscuits and gravy.. with gravy you serve from a crockpot.. this place is for you  If all you want is an omelet, prime rib, menudo, or sausage for brunch...this place is for you  If you want no service, then this place is for you.  If you want an owner who will attack you if you have a complaint... this place is for you.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "baOzFvNhqgoT0tVJHABoww"
  },
  "f95PFb7zfOCTzcsTnNpIeA": {
    "date": "4/26/2018",
    "text": "This used to be one of our favs. Now you wait on yourself both for drinks and food. Their music, live or not, is over the top loud. So loud can't hold any conversation. Drinks were good but our party left and went someplace else to eat so we could enjoy each other's conversations.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "axcDak9PQwlhtVy1398_uA"
  },
  "5u7GuiHwcfOaD1CvMH5mqg": {
    "date": "4/30/2018",
    "text": "Pizzas are way overpriced................. It's not like they're putting gold leaf on top of it",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HsXE_ex6PvNGvqAXBvIUoQ"
  },
  "z2EyZrosu9fexRdtied6oA": {
    "date": "9/26/2017",
    "text": "Super fun atmosphere, tons of things to do and great music depending on the week day. I went for the buffet on Sunday and my stomach was more than happy with the food that was there to choose from. I can't wait to go back and check it out again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CWWjR_FeCVTln402tqRIxQ"
  },
  "GpK7q_zH951rt3TGWGZR4w": {
    "date": "10/13/2017",
    "text": "This place was fantastic! Super fun environment with super fun bartenders! Bryan was great and witty kept us laughing all afternoon! Omg also they carry my favorite strawberry-lime hard cider, so I was instantly in love with this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aubc5TU7ZSVcHq4U5wrfNQ",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Rekorderlig strawberry-lime hard cider",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aubc5TU7ZSVcHq4U5wrfNQ/o.jpg"
      }
    ],
    "user_id": "fViiQ8f8kknc4wj1zbEx8A"
  },
  "qeUA8zZrgcb5DuqHX-PMXQ": {
    "date": "11/6/2016",
    "text": "Good food. Great service! Nicolas was our server and was great.  This is a neat place that varies by day of the week. Live music, outdoor craft market, outdoor games, lots of TVs and beers selection.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5B3aoSd3EHlDEYOFu8MdEg",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5B3aoSd3EHlDEYOFu8MdEg/o.jpg"
      },
      {
        "img_id": "bbTI05YImE0Jxa6cb1Z5ng",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bbTI05YImE0Jxa6cb1Z5ng/o.jpg"
      }
    ],
    "user_id": "kWf-keMsAeWji8-AsgmiZw"
  },
  "c0RfIk3Pq-TaeOwuE1wRXw": {
    "date": "10/6/2018",
    "text": "Well it's been awhile since my lady and I have been back. But a friend had a birthday party here. Not much has changed. My be worse. Bottle no chilled glass. Slow getting ur food and not enough help delivering the food. The food is better since last time. But I don't want a Carl's jr at these prices.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QzdqrfbR1zgFSTNNnJhnRA"
  },
  "NakjDcDYGYgpXYG-Yc1POg": {
    "date": "5/8/2017",
    "text": "Place is pretty big and opens to outdoor patio. I went here at 4:00p to watch a baseball game and was charged $5 cover for the boxing fights that didn't start till 6:00p. A bit ridiculous seeing how it was two hours prior! Plenty of good beers on tap and bottled. A bit pricey especially when they were served in plastic cup! The food was pretty good, had the buffalo and Thai spicy wings and mac n cheese. The one thing that bothered me was we sat at the bar and plenty of bartenders were walking by but I had to flag someone down every time I needed another drink! They should be paying more attention, the place wasn't overly packed at all. I give them three starts mainly for the good but that's about it.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "PTrnDevaF6yqTate1E2F8w"
  },
  "kZUATKdJoz5yHLWoqjy8Zg": {
    "date": "5/20/2018",
    "text": "I'm sure this place is great for dinner, but brunch was a bust. $25 per person for food that you get for free at Holiday Inn Express. There was a scavenger hunt for coffee, it was ridiculous. But mimosas are super cheap so I give it a star!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IRo6DL1GpS6Pr952V3_BSg"
  },
  "leDAYeblddMlvrYfWueHHQ": {
    "date": "4/16/2016",
    "text": "Awesome place!! and food is amazing Christian and Mercedes are great employees!!! Great service better than any restaurant I've ever been!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hrroM-sZZ9rJAl7OGwarkw",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Awesome pizza!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hrroM-sZZ9rJAl7OGwarkw/o.jpg"
      },
      {
        "img_id": "DkrIvL85qhyeeXaIQ9XwvQ",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Very good draft beers!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DkrIvL85qhyeeXaIQ9XwvQ/o.jpg"
      },
      {
        "img_id": "RD5gFCrbnCYoAN82qI8oSQ",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Awesome car show good times!!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RD5gFCrbnCYoAN82qI8oSQ/o.jpg"
      }
    ],
    "user_id": "vrnBlgdGlyrAloRyTUszHQ"
  },
  "hCEwPC6lN4R501n19eKhXw": {
    "date": "2/10/2018",
    "text": "My family and I really enjoy this place. We have eaten both inside the steak house and outside on the patio and each experience has been a good one. Very relaxing atmosphere on the patio and we really enjoy all the games with our kids and friends. The food is also really good!  Service has also always been great, very friendly. Highly recommend this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w7g-00QaZ1yUzSWJH35xzg"
  },
  "9EpH78hM9X_LXQsjo9F5Pw": {
    "date": "5/5/2017",
    "text": "Awesome find in the middle of nowhere!  Less than 10 minutes from the baseball fields in Glendale.  Huge outdoor seating with a brunch buffet on Sundays.  Great craft beer menu, lifesize Connect 4, checkers and chess on the patio.  Best of all, the food was awesome, too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ahOX1RKx1Ee8JOD7-DxG7A"
  },
  "xns3HbZ0-H341f-65pQ2HQ": {
    "date": "6/23/2017",
    "text": "Absolute worst experience ever. The sad part Is the food is decent and concept almost there if run by better management. Terrible service- had a party of 8 took 30 min to get all drink orders and still missed some. A \"new\" waiter who said he was new we gave a break and tried to help him it but over and over made mistakes- the final cut was when we had to wait 40 min after several mishaps with the bill. Will NEVER return. Read other reviews... advice to owners- hire professional staff and train them before putting them on the floor.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4BozR-iWQDO9kE1XL2QOsQ"
  },
  "2AcFG_-awlDSQA39ONSk7A": {
    "date": "4/9/2017",
    "text": "A hidden gem. This place is the best choice in the area. A pleasant surprise amongst all the car dealerships and industrial buildings. The decor is shabby chic with oversized chairs and sofas to get comfy in. Service is warm and friendly and the food is great too. Traditional with a modern flair to make it interesting. Try the tortilla soup it is top notch and the burgers were prepared perfectly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "hv_IyfQ2MLdF-W83Kl_YaQ"
  },
  "5LkQF4j1FsjGNnmkhKibpA": {
    "date": "4/21/2017",
    "text": "One of the best restaurants in the west valley! The service is incredible, the food is fantastic, and the live music makes for a great time! I wish I could give a six star rating.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "7TrRH5tBlotxe6OK5T5ZtA"
  },
  "fIVuPiS8Blx_rXSitlJwAw": {
    "date": "9/2/2016",
    "text": "Enjoyed a sausage pizza and a cheese pizza. I loved that they are always cleaning the table dishes did not back up and drinks were always filled. The waitress Darby was awesome. And the bacon shrimp was wow wish I got more of them but ya I understand lol! Coming back!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zZI5q85UCL4i7PRSJqHFSA",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Beautiful weather for an outdoor dinner!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zZI5q85UCL4i7PRSJqHFSA/o.jpg"
      }
    ],
    "user_id": "IeXBAah0Q-pk1rn9LesF4A"
  },
  "o-nBh3iETT37YXmtV8j2BA": {
    "date": "12/10/2016",
    "text": "It has a nice atmosphere but Libby the bartender was the most rude bartender I have ever had. We asked about titos being more expensive than  absolut (not complaining just curious) and she answered with \"I don't set the prices\" and walked away. Then when we asked for our card to pay for the check she intentionally ignored me and my family for about 15 minutes while making multiple drinks. I asked her again if I could have my card and she said \"one minute\". Five minutes go by and I ask once more and she said \"I'll be with you in a minute\". There were 5 people at the bar. We had to go bother the manager to get my card to pay my check.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "NUpKV2gyTlx5gDEf7pz62A"
  },
  "DvVjJ2gWKV4rEoBe8I4K8A": {
    "date": "1/14/2016",
    "text": "TL:DR version: Overall a nice addition to downtown Glendale. Great patio. Decent food. Good service. Dog friendly.  Worth a trip to Glendale. Great patio. Lots of room. Good service. Prices were a bit on the high side for bar food. The menu seems to double at the steak place, but it was good. The beer on tap was diverse and plenty of choices for everyone. The gastropub is part of a complex of steak house and cigar lounge. I saw food and drinks being taken to the cigar lounge, so if that's your thing you can eat/drink there, too.  All the servers were knowledgeable on the menu and very courteous. Lorenzo was our server and he was friendly and professional. He had nice suggestions on the beer menu and food options.  The patio has lots of seating from tables to couches. You won't feel crowded. The large TVs provide a great view of any event. Lots of parking.  I came here because I read they had a dog friendly patio and that was a big plus for me. Everyone was very nice to my dog and I would return for that fact alone. I'd like to see some kind of treats for my dogs or even a dog menu.   I will come back here, but the price of food would put this place a bit lower on my return list or I'd come for a beer or two and not really to eat. My bill for 5 beers, two sandwiches and a desert was $75 without tip. This was for two people splitting the food.  Lastly -burgers are good. French dip so-so.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3qAudxedWMgIboNlKlr58w"
  },
  "r1PZ-QH8NNsBsvyP7U-xTQ": {
    "date": "4/16/2016",
    "text": "Everything was wonderful, service, food, cocktails! Hubby gave the 1/2lb burger 9.5.  Good beef. I had the French dip, very tasty, but pricy at $14. Overall experience was good. I would come back and recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "efs2H8zgshT47TWjIdayEg"
  },
  "iKPLtVoI3uWp18aPYm-ehQ": {
    "date": "8/9/2017",
    "text": "Very cool place. The patio looks so fun...it's summer so didn't get to enjoy it although they do have misters out there. Super good pizza and friendly staff",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LIbCnqGlSMmw2dfHQHjW4g",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Fire pit cut LEDS",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LIbCnqGlSMmw2dfHQHjW4g/o.jpg"
      },
      {
        "img_id": "p47UDeJklZwnIOKFsVmQpA",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Meat Lovers",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/p47UDeJklZwnIOKFsVmQpA/o.jpg"
      },
      {
        "img_id": "YMuHtIDRoJdAPH0CcEyLdw",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YMuHtIDRoJdAPH0CcEyLdw/o.jpg"
      }
    ],
    "user_id": "uCMIxPAMOOtptj8lgeqV7g"
  },
  "2paBr9rSI_Tw0oHT2zbFTw": {
    "date": "6/8/2017",
    "text": "I come here with my family. Today's server was THE BEST her name is Eleanor. Wish she could be our server every time we come she is courteous and kind to people. Great service Eleanor!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BS4lt258ZrIpdBPeaymzLA"
  },
  "lYMW38v7JthcPh3H2Od-CQ": {
    "date": "2/5/2017",
    "text": "Service is horrible, waitresses are more busy hanging and chit-chatting than attending customers. It takes 20 minutes to get a drink refilled and for them to come see if you need anything.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2XZbl0Q1cs9GndBajAIFiA"
  },
  "DZNF2WhI3r6l-7gLerpivg": {
    "date": "5/24/2017",
    "text": "Lost some good customers due to there lack of friendliness and unwillingness to cater to customers. We usually come here once a week with family and at least four other families. Yesterday was the last straw on putting up with bad service. I'm the type of guy that if the food sucks but the service is great I won't complain just keep my drinks coming. The vibe we got from the owner's is that they don't like kid's and they don't really want them in there establishment. If anyone knows of another place that is family friendly and with Karaoke please let me know.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bGz5aWN9mrz2sf0UKQtH0A"
  },
  "WWq3yfehhPrL3nFyCM6zjA": {
    "date": "2/5/2018",
    "text": "We rode our adult trikes down to Desert Rose and we're welcomed there by all the employees. Hortensia waited on us and was efficient, kind, and entertaining. We met the owner, Pete, who helped us around the place and made sure we were well cared for. We even came back on Monday afternoon to enjoy the hospitality as well. If you are ever in Glendale, this is a must go venue to experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MGtHmPNXCVKKVVwwuVTRMg"
  },
  "fq192MsmDr6trqGo4itoKA": {
    "date": "4/23/2017",
    "text": "What great place , a little bit of something for everyone ,, even a dog menu .   what a cool chill atmosphere ... Loved the prime rib brunch , even had menudo ,,see you again ,,",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5xDx2XnSVpU9E1OCO52umw"
  },
  "dFz-Hz7NACNcgGgDFCTZCw": {
    "date": "8/27/2017",
    "text": "We went to desert rose on Friday night for a function on the patio. We arrived to find out that the patio wasn't ready. The manager was running around trying to uncover the TVs so they can turn them on. They changed the way they do their service on the patio. You now have to go to a server that is set up just inside the bar and order from her everything for the night. They will then give you a number so they can deliver everything to your table. There is no customer service whatsoever at this place anymore! They drop your food on your table and don't even ask you if you need anything else. I ate my steak with a butter knife. The drinks took at least 20 minutes to get. Their new system ensures that everyone will have a horrible time on their premises. I used to think this place was worth the effort to go to. But now I will do everything in my power to make sure that I don't go there and no one I know will waste their time or money there. Customer service be damned - your organization will fail by not making it a priority to take care of your customers.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "XUB7CTmMUOQtO1TkcI-4-A"
  },
  "-i29FbvsFeymy66r3qVCwg": {
    "date": "10/7/2016",
    "text": "Absurdly terrible  Food is all from the freezer  Staff is not trained  Service is absolutely lacking.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "xeaN41ng2gIccTPn1cF5WA"
  },
  "cq1K6VHL26uL2el7IC80fw": {
    "date": "12/24/2017",
    "text": "Great food! My favorite was the coleslaw. I'm usually not a coleslaw fan but I would eat their's all day long. They also had a super fun atmosphere. My kids loved playing all of the games, including giant chess!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "plCesAHtCvRxVAAv-NnDsQ"
  },
  "0rzGX6UOIrrSKs6CjSXGAw": {
    "date": "2/11/2017",
    "text": "Pizza is very good. The fish and chips were good as well and I highly recommend the Orange Blossom Beer.. service is awful, we complained about our flavorless overlooked Prime rib and all we got was .. \"oh really, I'm sorry\".. no offer to comp or replace with something else. We waited well over 30 minutes for the bill and then had to pay at Bar because she never came back for the $",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TcFOgpHCb9cS4DbRorLFqg"
  },
  "vPcqqjqBWg3-RaGSduq0Rw": {
    "date": "5/7/2018",
    "text": "Came last December and it was a little busy for a Saturday and the waitress would not even acknowledge us.  We had to go get our own drinks.  I am more than happy to tip for service at any level, but not when we are ignored!    And now my friends and I stopped by for cinco de mayo and I was there for over one hour and nobody never came over for drink orders!  The table next to us had food brought to them and the servers didn't even say hi to us!  I really used to like this place but they need to find there identity!  They are just to confused!    And I don't think you are going to get 3.5 million for trying to sell the place!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CXmX1FjBHjBwUtLWnFAE9g"
  },
  "lwjPPWHPgwk2czlT22uP8Q": {
    "date": "3/16/2018",
    "text": "I used to live in Tulsa, OK, and there was an old Irish bar there with a beat up shuffleboard table.  My buddies and I spent hours and hours at that table and absolutely loved the game.  I put shuffleboard above both pool and bowling when it comes to games to play while drinking.  Desert Rose has a beautiful table.  As soon as I saw it and threw a few pucks, I knew I loved this place.  Then we ordered beer and food.  Great selection of beers both on tap and in bottles.  The food was surprisingly great.  We had a pizza (the one with chorizo) and my brother and I, both food snobs, devoured it.  Their wings were fantastic.  Philly sandwich was perfect.    We ended up going back another day, this time later at night.  It was packed but not super packed.  Still good service and a nice lively atmosphere.  Pretty cool place to hang out and grab a bite in Glendale.  Recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "770VGA6RSSvNrBRKKC4cEQ"
  },
  "dIurj11vPGMgNSlwOhHrfA": {
    "date": "12/2/2018",
    "text": "Desert rose is one of my favorite places for a group activities I have had teambuilding events and family birthdays. I love the service that we received every time their system is incredible and have awesome games outside things like giant checkers giant connect four corn hole and others. They also have a live DJ that contributes to the ambience of this location. I often speak to Teresa who is the owner's wife she is the sweetest most hard-working woman I ever met.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ts7wwm7fBX4y6wpGmSzDmg"
  },
  "0YnBeCUhn6z3VqqZnl29Dg": {
    "date": "4/13/2019",
    "text": "Great place! Good beer and food, atmosphere, games, stogies.. 5 stars! Also kid and pet friendly with an awesome patio and outdoor pool tables. Go to spot for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d0SRCSdBvrV2ENHfNTLTIw"
  },
  "7sRvwdHcrqVAYEGRIflXyg": {
    "date": "3/2/2019",
    "text": "Went in for breakfast one morning with my girlfriend, owners son served us and seemed like a nice guy. Fast forward a couple weeks, we go there in the evening and my girl slips and falls outside and spills all over herself. She approached the owners son (manager) about the situation and he was a complete asshole. He said he was off the clock and didn't want to be bothered. Rude rude rude..... I'll never go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mZJTAvcij6y1M8buteukFA"
  },
  "lOdMp7kSnBhUPLcF-MTdjQ": {
    "date": "4/8/2019",
    "text": "Really enjoy the atmosphere and food here. The service is great....when there is service.  Not feeling the go up and order yourself method or there just being 1 server for the entire place during non peak times. That is the only thing that keeps me from going more often.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3jpeBhrflGVWbsrJAA0KdA"
  },
  "RXNs4McHh5c8cVFksCWS_g": {
    "date": "8/14/2017",
    "text": "Expensive beer Doesn't serve expensive beer in glassware on the weekends  Excessive foam / head on expensive beer Doesn't keep open tabs on the weekend  Terrible attitude from some of the staff  The layout and concept of this place are awesome, and the food is pretty good too.  But for the items listed above, this place would be 5 stars  Come on the weekend, and enjoy all of the above!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "AzhVKzAF-w6MYZp2sqBNiA"
  },
  "lCSyhp42hDPgIv5mV_4pbA": {
    "date": "2/18/2018",
    "text": "This was a really cool chill place. The yard has very neat overesized board games. I had the brunch buffet I was completely happy with it. My favorite part of it was the French toast. They also had a bike event going on in another portion of the yard. I would like to go again. I had a great experience.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "f777rBESswAwDKGUi5ucdw"
  },
  "NFZPwxddwaj_ptDIDv_w4A": {
    "date": "2/25/2017",
    "text": "We came here around 330 on a Thursday. We were the only ones there. We ordered wings and beer. The wings were really good and actually came out before our beer. The ambiance is great and they have couches everywhere with tvs and heat lamps as well as patio furniture and life size games like jenga and chess. Unfortunately the service wasn't great, it took about 15 mins to get our beers. Then when we wanted our bill we asked the waiter for our bill, waited about 15 mins and then I went inside and asked the bartender for our bill, she then went to find the waiter and asked him to take it to us so that was disappointing. May be good for happy hour however.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "xtLOgZggdzQ3Yu1BaSQQHw",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xtLOgZggdzQ3Yu1BaSQQHw/o.jpg"
      }
    ],
    "user_id": "OMDMDg9avDOkjjle7Fvt5w"
  },
  "j4wz0yJQ9YARs_yHZnEBvg": {
    "date": "1/7/2018",
    "text": "Super chaotic and slow.  They need a better process, waited 1 hour and 32 min for a personal size pizza and the manager explained it away with \"yes, that's normal, we're busy\".  Next time I'll eat first then go here for music and drinks.  However. The prime rib dip and spaghetti were delicious, these took long to come out but not 1 1/2 like the pizza..   appetizer came out with food , hate it when that happens! Fun place with lots see and do, but the service needs improvement.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "IG67Drh3w1ZDNyBLKl8VSA",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. One hour and 32 min for this! This place is ok if all you wanna do is drink.  Not a place to have dinner when your hungry.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IG67Drh3w1ZDNyBLKl8VSA/o.jpg"
      }
    ],
    "user_id": "C-5hEYDPTNFzkpjO4mI1hg"
  },
  "O7om0fGPrejfIgoJPV7gog": {
    "date": "3/2/2018",
    "text": "The atmosphere was very neat and a different experience than a typical bar/restaurant. The outdoor games (life size jenga, chess, checkers, connect four & corn hole) were super neat!   I would've given place 5 stars but 30 minutes after ordering and not even our appetizer was delivered - we asked an employee what was going on. They explained the kitchen had a ton of orders and would get to our appetizer soon. 40 mins later our appetizer and pizza both were delivered.  All was fine but I feel like the employees should've offered some sort of compensation or small extra since we waited so long for our food.   All in all I will return here again. Very neat place",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CdojJr0572BymRAKD1Iu_A"
  },
  "gD_6x0-_-LqmjY7hr5FwFQ": {
    "date": "12/23/2018",
    "text": "So I have gone to this restaurant for several years and I have noticed a steady decline in both the service and the food!  Today was a real low point.  I was forced to pay for my meal as I ordered!  It was really weird.  How do you even tip?  I can see asking for your card to keep a tab but I was ordering food!  I was dressed well so I didn't look like a transient and I have visited the place many times.  My last visit for sure and if your deciding whether to try it or not don't!   I hate to write critical reviews for a business but if they don't care then why should I!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "TzIb9n37c5PNp-0HyeTBXw"
  },
  "1wP0dMpIQQC8PYokOelB4A": {
    "date": "12/17/2018",
    "text": "My company had our holiday party here this year and while I hardly write reviews I felt the need to post my experience. While the atmosphere outside is fun and awesome to look at, the service received was seriously awful, and at work today not a single person had a positive thing to say about the service, specifically the bartenders. Questions about drinks were responded to with eye rolls and a ton of attitude, menus slammed down on the bar in front of us, and when we tried to use a drink ticket for a $4 beer (the only thing that the drink tickets counted for - beers under $5) the bartender ignored it and charged it on the tab, then walked away to help someone else when we pointed it out. There were multiple parties as well as regular customers and the bar was absolutely packed, I'm not sure if they were understaffed, but it really seemed like it. I also heard at least 4 other coworkers report similar experiences at the bar. I thought the pizza was pretty good, but I would never come back because of this experience, unfortunately.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "CTFyGC9OpG_cKNmra6vMfQ"
  },
  "llhTjotOU4o7FApbCbHC4Q": {
    "date": "6/14/2017",
    "text": "We had my daughters graduation party there. They did everything they could to accommodate us. We ordered pizza and wings to eat and the quality was excellent. The hostess was exceptionally helpful and gave us excellent service. Will definitely be back. It was a party of 38.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lspOnpVbo5w-sZAA-UaIoQ"
  },
  "xso4npR2VC8105c7VrktDg": {
    "date": "12/17/2017",
    "text": "A bit pricey with mediocre food, BUT the venue is fantastic. There's tons of tv's and games to keep you entertained for hours! The staff was also very accommodating to letting you request a specific football game to watch. So if you're looking for a place to play a few games or watch a few games, this is your place!  Pro tip: skip the nachos and just order the pizza.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "H4tFJTl_VzkeqRg8QWzL8Q"
  },
  "lTXGHSBrH9iCnDWh3Iju_A": {
    "date": "5/14/2018",
    "text": "We had a not so great experience on Mother's Day brunch and due to what occurred we will never return. First the food was not that great for the $25 that we spent for each person. I've had better. I'm willing to look past the food if the service and atmosphere are good but this was not the case. The service started out ok but became somewhat interesting...... My father who is 65 years old went outside of the gated patio to smoke a cigarette, even though we were on the patio he thought it was the right thing to do since there were no obvious designated smoking areas. As my father attempted to come back in he was spoken to in a unprofessional manner by the woman working the front register. (They were having everyone check in and pay one by one) She started to shout at him and insisted that he pay AGAIN!! He explained to her we had already paid and ate and even offered to walk her over to our table to see where we were sitting. She said \"No, but the next time you go outside you need to tell me!\"  My father witnessed \"\"others\" come back in the gated area who were not spoken to in the manner he was. It was kind of the way your mother would talk to you, you know like a child. He is 65 years old, we are hard working people and NO ONE in our party was trying to get a free meal, trust me the food is not that great at all. We even made reservations! Next time they should do a stamp or ticket system to avoid this type of incident. This may not sound like a big deal to others but to me customer service is very important.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "lXQppBb-RblkbC3CefSINA"
  },
  "q0Cqx05IseSTquuDTX7nOA": {
    "date": "12/2/2016",
    "text": "So this is now my 3rd lunch here, spread over several months. The food has always been good. The service has moved along from inattentive to almost too attentive. Yesterday my server was Nick and he was on top of things. The food seems to come out faster during lunch each time too. Small detail, the bun pretty much disintegrated before I was done with the burger. Not an everyday lunch place because of price but it is nice to have a little more upscale place in the area to choose from, especially with a fairly wide menu.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 8,
      "cool": 11
    },
    "photos": [
      {
        "img_id": "u3tJDBWrXkpw51tifqqHhg",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Big fat cheeseburger.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/u3tJDBWrXkpw51tifqqHhg/o.jpg"
      }
    ],
    "user_id": "Z128ihQea7BLPh2T9q9sKA"
  },
  "VU2KtrojipIzqyLpwxT7-g": {
    "date": "5/25/2018",
    "text": "My boyfriend and I came here fairly regularly when it first opened. The food was great, the service was great, I would've given it 5 stars. Within the last year, however, this place has really gone downhill. As many have said, it's basically a fast casual spot with sit-down restaurant prices. We went last time and had to go up to the cashier to place our order and get our own silverware. We ordered 2 beers and went to sit outside. They have a full bar, however, I got my beer in the bottle while my boyfriend got his in one of those small plastic water cups. The food was bland and not worth what they're charging, and the server didn't even bring napkins. I don't know why there has been such a dive in service, but it's unfortunate, and we won't be coming back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "n3eUc2P_EVBjr4Me8Xh37w"
  },
  "9EmkW1Oqhp3OLmEiollJew": {
    "date": "7/29/2018",
    "text": "Really disappointing and overpriced brunch buffet. Very limited selection. Salads were warm so we weren't about to try the shrimp that was on the serving table. Nobody checked the temp of any of the food the entire time we were there.  Food was mediocre at best and no one ever checked on us during the meal. You pay at the bar and have to leave a sign on your table indicating that you paid. Just not welcoming or comfortable. Absolutely NOT worth anywhere near the $25.00 per person they charge.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ak8qMZkcaZ38wbCYniN4sA"
  },
  "0a-WAymr0mocrWJgOie1pA": {
    "date": "2/27/2017",
    "text": "Music loud and annoying. Server asked what we wanted to drink and stood there as we looked at the menu. Perhaps she was in a hurry but we were not. I ordered a merlot but I am pretty certain it was a cabernet. Husband ordered a burger it was good but certainly not amazing. House salad is boring and over priced. Place was a nice feel but they have a ways to go. I will someday try the steakhouse.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ldatfPwaf_hyfoF5o2U48g",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. 1/2 House salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ldatfPwaf_hyfoF5o2U48g/o.jpg"
      },
      {
        "img_id": "24SFxwiLpyNzSXtFHYhSzw",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Hamburger and fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/24SFxwiLpyNzSXtFHYhSzw/o.jpg"
      }
    ],
    "user_id": "rtRVb54VIXOUI_5mT1rhgQ"
  },
  "BsveW68Ck9WaX6MzWRUhnw": {
    "date": "12/7/2016",
    "text": "Pizza and the schuffle board and other games such as cornhole, giant jenga, and ping pong were great.  I registered on yelp as usual, ordered pizza, when time to pay they wouldn't honor the yelp discount.  I hadn't order a large enough pizza to qualify.  Fine my fault, no big deal. After eating played some cornhole and was ready to leave, they had thrown out the other half of my pizza even though it had been boxed to go.  They admitted mistake and got manager.  After a somewhat heated conversation he gave me coupon for $5 off which would cover about half of what I lost.  Fine, several days later I come in order pizza, register with yelp just like we did first time.  Ordered the correct size pizza.  When time to pay would not honor $5 coupon along with yelp normal discount. The manager wasn't very friendly during both visits and I figure I will never recoup my loss and they're weren't that many people there.  Now I can see why, if that's how they solve an issue that was not the customers fault.  I worked in a pizzeria for over 10 years, that would never happen, bottom line, if not customers fault you do what is right for the customer cause they can go anywhere and may refer your place of business.  I was disappointed not only the first visit, but the second!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FJc1MAqjRZ2MjaPErZ9n2Q"
  },
  "4pNEGChKdUJMBZ3RxqPIIQ": {
    "date": "1/7/2017",
    "text": "Had a blast but the service was terrible! Waited 2 hours for our food. Only 4 restrooms for a lot of people. The band \" Dust Storm City\" were amazing! If you haven't heard them you should definitely come to see them!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ic8rVdHRAyvy_i2z0KsKrQ"
  },
  "4uG7ja6UxYj1GAL-Y1xALQ": {
    "date": "1/26/2016",
    "text": "We had passed this place a couple of times on our way home from being in Phoenix. Today we decide to have a late lunch. The weather is perfect to sit out on the beautiful patio. There are several TV screens but thank goodness the volume wasn't on! The music they did have playing was great. The pub is between the cigar lounge building and the steakhouse building. All belonging to Desert Rose.  Our server, Brian did an exceptional job catering to our needs. When asked about two of the many beers they offer, he brought us a sample, which by the way helps to decide on what you'd like to drink. I had the prime rib salad which was beautiful and tasty. I thought the oil dressing that came with the salad had no flavor at all. But the salad really didn't need help. My husband had the prime rib dip sandwich that came with a side of delicious crispy fries. He was pleased with his order.  There is a shuffle board indoors and jinga outside. They are also pet friendly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7WgEslpFcToO1tg5di5tHQ"
  },
  "5f_QjIeluJCwzGTJsxVxUQ": {
    "date": "12/4/2016",
    "text": "Sat for an hour waiting for my food. When I asked about it, they told me it was never ordered.  Was my sixth visit, the others were great but Saturday must be when they can't meet demand.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HZ00ZliV2eUc2O0BOG9kIA"
  },
  "2i_2DeJTNwkv6KnkN2deXQ": {
    "date": "9/11/2016",
    "text": "love this place!  fun on many levels with sports bar, cigar bar, restaurant and play area.  we moved around a lot and the friendly and helpful wait staff made sure drinks and food followed us.  lots of choices for pizza from \"loaded\" to light and tasty margherita.  bacon wrapped shrimp appetizer is a high protein mini meal!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6O_ZET2ic20DQ2ui0s0Sbg"
  },
  "FyLvEfjKczeL_2rgDjZ64A": {
    "date": "5/1/2016",
    "text": "Visited approx 1pm on a Saturday. Was initially confused be where to enter at first however a gentleman hanging a sign/lights on a ladder directed us. The 'steakhouse' entrance was at first is what threw us off. (The Desert Rose Steakhouse is a separated area from Gastropub, opening @ 4:30pm). Once in, we were  greeted and guided to our table. The table was fine, as soon as we were seated 'Steven' asked us for drinks, receiving our menus. The environment is perfect for a Saturday pm nosch with large screen tv's, baseball games, etc.  Steven seemed to be tending bar and waiting our table at that time. It appeared to have slowed some service but it was tolerable. My wife ordered the fish & chips and I had the lamb burger. However, we requested an appetizer, bacon wrapped shrimp being served 'prior' to the rest of our meal. After about 20 minutes we asked regarding our appetizer and was told the kitchen was running behind by Steven. Ok no problem, We asked again not to serve everything at the same time. Well approx 5 minutes later Steven, and two wait staff speared with everything with Steven saying ,\"I gave them the massage but everything was still ready at the same time.\" We requested that to take the entrees back and leave the appetizer. At first told 'we will reheat the entrees when ready'. We requested that new entrees be prepped since our order was not presented as requested. One of the wait staff acknowledge that would be done. It appears the kitchen had some issues being behind on orders for whatever reason but it did reflect on the food quality. The bacon wrapped shrimp was tasty but very dry. The fish was equally dry and tasteless, the lamb burger had good flavor but it also was dry especially the challa bun. My determination is the appetizer sat under heat for too long or was cooked too hard and the entrees were reheated despite our request for them being remade.  We will naturally make another visit believing that it just may have been a rough moment in the kitchen. Steven and the rest of the wait staff were great. The food had great potential in flavor.  Just would like suggest that when a customer makes request please honor it. If there is an error in an order addressing it is one of the most basic customer service issues that is so easy to correct in food service. For the price the value did not match up due to the food preparation and taste. Looking forward to returning.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_1sj0HmXjnH2qoLz3ql7XA"
  },
  "Ebz9MyDjYU6LJnRQAItE1Q": {
    "date": "6/13/2016",
    "text": "The service is impeccable. Ask for Darby. The back patio was so comfortable you never want to leave- it's like being in your own backyard. If you don't have a backyard, this can be yours. The prime rib French Dip was outstanding! There's even a dog -friendly menu! Oh, and Cigar Smokers in Glendale have a new home with their Cigar bar!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XquPzSmk1ew379R9QguZoQ"
  },
  "dnSNk_K6oUwM5l5R3ZE45g": {
    "date": "4/2/2016",
    "text": "The one star is doing this place a favor.  This is my 2nd time here and the service is horrible, lots of service people walking around or they just congregate together and talk to each other.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tBOZ5pH8XjjZBaLWYtBxow"
  },
  "grz_bsE87i9-A875YYG3yQ": {
    "date": "3/17/2016",
    "text": "Food Pretty good, location and ambiance have potential, however the staff was disorganized and a bit clueless.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mXsE8cE6cEzePogGVCiUlA"
  },
  "FLKtBOQc8ajWmYzqiCO5Ng": {
    "date": "8/24/2017",
    "text": "The new concept just does not work.  They changed their concept so that there are no wait staff, or hostess.  You have to go to the bar to order your food or beverage and you pay for your food and drink in advance.  You receive a number that you bring to your table.  Each time that you want another beer you have to order it and check out.  No one checks to make sure your order is right or if you need anything else.  I  have been coming here regularly since it opened.  It used to be a friendly place with super friendly staff that provided great service.  All of that is gone, and you are now a number. The cooking of our orders was different as well and not as good as it was.  The fish and chips is now fingers of fish rather than the several large succulent pieces.  The salmon sandwich changed and is smaller, with plain mayonnaise rather than the yummy dill sauce they used to have.  We will not be back, our regular go to place is no more.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fRAEpNKLTIWPE427qDJUmQ"
  },
  "zKX-Q04D2NQSU4ALpCKRSA": {
    "date": "7/2/2016",
    "text": "Kudos to Desert Rose! We had a party of 20 that we planned in advance with Teresa, everything went flawlessly, the food was amazing and the staff attentive. We highly recommend Desert Rose for your next company event!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GJiDDABZiVf2jcTNcK5qGw"
  },
  "bsM9CTXYgiWo76GekcyCWQ": {
    "date": "6/20/2016",
    "text": "I was excited to check out this new establishment and was happy that I did.  The atmosphere is relaxed and entertaining.  There are a lot of tvs so would be a great place to watch sports.  The patio is like being in your own backyard with comfortable chairs and sofas and a mister system for warm days/nights.  The menu had a nice selection to choose from.  I had pizza, my boyfriend had the fish and chips, my son-in-law had two varieties of wings.  The pizza was so flavorful, the fish was fresh tasting and the wings were awesome.  My daughter had the lobster roll sandwich.  Her only complaint about it was it was a lot of bread.  The only reason I am not giving it 5 stars was based on our service.  Our server was MIA for a while towards the end of the night so we had to flag down another server to get ours.  However, It was NOT bad enough to keep me from visiting again.  Overall, I would definitely go back.  I want to try the steakhouse next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2R88_ITOxR0hGmOiKIUmOQ"
  },
  "h12Bbl0dHDDXCf2ifPztUQ": {
    "date": "3/2/2016",
    "text": "Wow what a cool place! We had dinner at the steak house. Started with the Brie crisp and added mushrooms, outstanding! I had prime rib which was good. My only complaint was the under cooked baked potato. My husband had the seared scallops which were amazing. I also had the ginger-peartini which I loved, not too tart and not too sweet. Our server treated us to cheese cake for our anniversary, and not just a slice to share, but two slices. The interior of the steakhouse is much nicer than the exterior, so be sure you go inside. This use to be an old welding shop, so the next building over is a pizza and brew place with indoor and outdoor seating. They have a huge connect 4 and Jenga game and corn hole games. Lots of outdoor seating. The owner Pete was there and gave us a tour of the cigar lounge which is a historic Adobe building that he restored. Tons of historic cigar box covers from Havana Cuba where he bought them. And for the cigar connoisseur they sell over 100 brands of cigars and lockers to store them. We loved it and plan to make it a regular hang out for us!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K3QuxfmkGrDJIJfDuuO40w"
  },
  "niw2MEOi_MmxcwSE3ivubA": {
    "date": "5/20/2016",
    "text": "The Desert Rose is a jewel in the desert! Well, in beautiful downtown Glendale, actually. What a fantastic place; excellent food, friendly service and an atmosphere that is open and inviting. Every time I go, the staff is courteous, engaging and eager to make your experience, whether dining or just relaxing, an enjoyable one! And don't miss out on Wednesday night's car show, put on by Nancy Perry. It will take you back in time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RimQ8T9WyG7MdA0H4S4zLw"
  },
  "dUpaotb8UZmStu_DKylVJQ": {
    "date": "2/28/2016",
    "text": "Great setting, good Sunday brunch. Lots of potential! Friendly staff but where is the hostess and who is in charge? Hope the business is successful, can see a lot of thought went into making the setting relaxing and fun for all.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "io_gqy3fxtxh5nQSWk8mlQ"
  },
  "oh2RKq-ATm50f4UInrdagQ": {
    "date": "4/13/2016",
    "text": "This was my 2nd time here.  Cozy place to meet for dinner and beverages.  I had the Lemon Herb Chicken.  It was OK.. Moist but it was the basic boneless skinless chicken breast type dish.  My son had the Pumpkin Feta and Spinach Salsa Salad.  Although this wasn't quite what he was expecting... I thought it was delicious.. and a great Vegetarian dish!  The sauce was amazing.  My husband ordered the Meat Lover's Pizza and the table agreed that this was the  best dish of the night.  Crisp crust, meaty toppings with a cheesy crust was the bomb!  We topped it off with a slice of cheesecake to share, nothing out of the ordinary, but good.  We'll be back.. This place is intriguiging.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xKrCs0OzpoUlWHYW7Ip6qQ"
  },
  "El68Lho8kEfMT21g70ANTw": {
    "date": "7/26/2016",
    "text": "First time there, came to see the entertainment with a group of friends. The three women singers were great, that's about all I can say about this place. i ordered a Cheeseburger and a bottle of beer. beer was served in a frosted glass, really tasted good. The problem was the waitress we had for our group must have been new. She would start to bring food to our table, then turn around and take it back to the kitchen. The food she did bring was served to the wrong people. My friend had a salad that came in about 1/2 hour, no burger yet. Another guy opposite of me, had Pasta and a Meatball that he was waiting for. After about another !/2 hour, I told the waitress to cancel my burger and just charge me for the beer and my friend's salad, She got upset and said,\"it will just be a few more minutes\". . I said I didn't want to wait another 40 minutes. As I paid the bill, the guy just got his Pasta after about an hour wait. There were still people at the table that hadn't received their food.. Place was so noisy that you could barely here the singers or even converse. I didn't feel the wait for a $14.00 burger was worth it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9TBxciLESdIVodzUVwtIWg"
  },
  "CiScr44maZfRUvFevzedDw": {
    "date": "5/1/2016",
    "text": "As an avid supporter of local businesses, I really want to like this Glendale restaurant. However, the execution is a bit lacking. My family and I tried Desert Rose and were first impressed by the expansive spread and relaxed atmosphere as we walked up. We sat on the patio, and were delighted to see some patio games for this kids: ping pong, cornhole, etc. We ordered our drinks and asked how the games worked. Our server told us, \"just ask me if you want the paddles!\" After a while, we hadn't seen our waitress for a bit, so we asked another staff member, who told us \"just leave your ID with the hostess table up front to get the paddles!\"  Then, after walking to the hostess desk, we were told, \"no ID needed, here are your paddles!\" Three different messages pretty much sums up the disconnects we experienced through dinner. We started with wings and the kids ordered lemonade. Too bad we didn't realize the lemonades were $4.00 each, and were extremely potent; the homemade-sour kind that our kids couldn't even drink. Our wings came, but no silverware, napkins, or plates. After that was rectified, we ordered pizza: a personal 8\" Margarita for me and a 18\" for my husband and kids--half pepperoni/sausage, half Hawaiian. Then, when the pizza arrived, we couldn't believe our eyes. Apparently the chef had never heard of Hawaiian pizza or was completely not paying attention while making it because the 18\" had half pepperoni/Canadian Bacon, and the other half pineapple/sausage. How does that happen? Our server asked if we wanted the pizza remade, but we didn't want to keep waiting, so we made do picking off toppings and mixing it around for the kids to be able to eat. The crust was good, garlicky, and warm. The Margarita pizza was pretty good also. While eating, I kept observing diner guests walking up to the front to enter and the hostess table was irregularly manned. Confused guests with no one to greet them would seat themselves until staff would wander over with menus. I found this odd since we were eating dinner at 5pm on a Sunday and it wasn't very busy. Overall, the wings were the best part of the meal--we had the Spicy Thai which had a nice flavor and crust to them. Again, the staffing and execution were really the problem. At one point, my husband ordered another Arnold Palmer to drink. \"No problem!\" 5 minutes later, our waitress was wandering around looking bored. When she next stopped by to check on us, we reminded about the drink. \"Oh sure, right away!\" Maybe she forgot what she was doing in between wandering around the non-crowded restaurant... Thankfully our bill came with a 10% discount due to the pizza mixup. Again, I REALLY want to like this local business. They have great event and serving space, have a dog-and-kid-friendly patio, and a neat location in downtown Glendale. I'm hoping the management will read these sorts of reviews and make a few changes to ensure the service and quality match the pricing and expectation that this venue holds.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "09U_g9r-BWnhhjfNUGPxbg"
  },
  "E1R6JrunKetvxxhIG2gP_g": {
    "date": "4/8/2016",
    "text": "I see very mixed reviews for this establishment, but will share my experience as it was truly one of the best I've had in a long while.  I met a coworker friend and her parents for Easter Brunch.  We arrived a bit early, but were welcomed in.  By welcomed, I mean welcomed jovially by EVERY worker and what I assumed were the owners or managers.  As the buffet was not yet open we began with $5 mimosas... every subsequent one was $.01.  Yup, one cent. Our server brought replacements the moment we dropped to 1/3 full. Although we had a  waitress, we were taken care of by many employees; topping off coffee, removing plates, moving umbrellas, asking if we needed/wanted anything -all without hovering or being intrusive. Now the buffet - it was WONDERFUL!  Beautifully and perfectly cooked prime rib, omelette station, fruit, salad, scones, huevos rancheros, colossal shrimp, eggs benedict, and on & on... Between the four of us, we probably had just about every option.  Some of the food was 'ok/fine' but the prime rib and the omelettes were fantastic! I cannot compliment the atmosphere enough.  What an eclectic smashing of venues... steakhouse, sports bar, patio dining (which is surrounded by raised beds full of fresh herbs) outdoor giant jenga , cornhole and the like games. The entire south side of the property is lined with the most BEAUTIFUL and fragrant rose bushes and lime trees. The cigar bar/lounge attendant was quite helpful and I left with a couple Nicaraguan stogies -one of which I will most certainly be purchasing again.  All in all one of the best vibes received from a new place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LA3Xy3Fyp1AO0E2AIDjOhw"
  },
  "jW62D87qZC1-I57V6AICBw": {
    "date": "2/18/2018",
    "text": "Have never been here before, came for brunch. Mimosa I'm not a fan of but this one was actually good! The pozole was good, had a buffet line of French toast, pancakes, waffles which I opted for a waffle and it was a thumbs up! Prime rib Cesar salad, and shrimp... yes please!   Outdoor seating with such a cool atmosphere, patio tables and chairs with music, over sized chess, checkers and Jenga! How cool is that? Such a very laid back just wanna kick it atmosphere! Can't wait to come here at night!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jHONHSh8BHkmDARrfcoCGg"
  },
  "10joYNBNP81t0Ot2LHXzMg": {
    "date": "3/18/2019",
    "text": "Ok we just ate there.  Food was great!  We had tacos and wings and they were high end!  Additionally the wine list is extensive and A++ but you have to ask for the full wine menu.  Very good wine and beer selection!  Only complaint:  we walked in to sit at the bar and there were dirty dishes all over at the bar.  It takes 2 minutes to clear a bar.  So we sat and waited for the bartender to come over and clean an open spot at 3:15 on a Monday .  After that a lady took over and gave great service.  Very friendly folks there.  We will be back .  High quality every time and super nice people working.  Everyone is welcoming.  Food and drinks are fantastic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "fbdoogtz5I7P-WS69fdqcg"
  },
  "D8yCYDZ-JCs9RgovXTKRQg": {
    "date": "11/23/2018",
    "text": "Whether youre looking for a chill place to grab a beer and a smoke with the boys, a lively bar to kick it with friends, or a nice date nite, this place has it all w/o being overwhelming. The staff was friendly, Food was good, and a great location if you wanna stroll over to old town glendale.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hELHdE-3IQ0Jl2981n58WQ"
  },
  "XmZ24XudTTJFwfwq5Et_IA": {
    "date": "6/30/2018",
    "text": "Perfect for family .. lots of food choices great beer menu and appetizers and big plates .  Lots of fun outdoor games such as corn hole , checkers , chess huge connect four and jenga .  Live band",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "DyD5P8yAibkpMOVnIWVNpg"
  },
  "Ip8a3AaYHBXDraE37zTGTw": {
    "date": "1/19/2019",
    "text": "Come here often and enjoy the atmosphere but this time, not so much. Owners son sat at the bar and when asked if they had the UFC fight he yelled at the bartender in front of us  using many choice words. We come here for the fights all the time so wasn't expecting them not to have it this time. Ordered food and drinks, drinks always good food over priced for bar food. Found out after we decided to cancel our order when they were not showing the fight, that we had paid someone else's tab on our bill. Check your itemized receipts cuz had we not cancelled our order we would have never know we bought a round for a stranger.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pYw01f3tdiJNWMkRWjJovg"
  },
  "scXev0nLCcHdvghc0DmkEA": {
    "date": "11/17/2017",
    "text": "Too strange for words.  The food was good & delivered hot - so that's good.  But with hamburgers priced at $13 to $15 .... I feel it is totally not OK that i have to go retrieve a menu, then stand in a long line to place my order, then carry my own pre-wrapped silverware and napkins back to my table..,. Then go get my own drinks from a dispenser.....   prices are too high to be self serve!!  What is the owner thinking?  None of us could figure that out...  As I understand it - bar service is the same routine.  I can only imagine the loss of revenue associated with that plan!!!   And the poor people working there - you can guess with total self service the tips are not there. I hope the owner sees the error of his 'out of the box' idea before he sinks his own ship.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wc9GTXhl14zC8o3rdEyAOg"
  },
  "v-Ypb1v989CtqDCmG6rpAQ": {
    "date": "12/10/2018",
    "text": "Dont b scurrred. Go ahead on and wander on into the back side entrance of this hacienda compound and give this place a try. Thank You Desert Rose, you truly live up to your name because thatS what you really were for my family on Thanksgive night/ Black Friday eve-- a rose in the desert, an oasis of good eats coming to our rescue in quite literally the middle of nowhere with no options in the dark late night on the other side of the rail-road tracks. So go on in, grab a menu, give the friendly bartender lady your order and seat yourself. Get ready to eat \" the best chicken wings ever \" says the chicken wing connoisseurs in my family; very tasty pizza with a delicious crust, even a custom made and modified highly appetizing veggie pasta dish....",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "C5a58DoD-ERYCsMOZFu0Lw"
  },
  "OVjl7-Jab4DOwfTS-bJ-fw": {
    "date": "5/21/2018",
    "text": "Me and my boyfriend went back last night. We start at the bar, the plus was we didn't have to pay for our drink then the food then the drink. We finally were able to pay it all at once. So that was an improvement, however, the bartender seemed like she hated her life, her job and couldn't wait to get rid of her patrons. We didn't get a \"hello, what can I get for you?\" Or \"how is your night going?\" What we got was... What do you want to drink! That's all.  I was reading some if the Google reviews for this place and the owner is so rude in his comments when someone says they wish there was table service etc. The owner replies \"ITS NOT A PUB SETTING!!!!\" and things like that. He tells people that \"you should have then just stayed home probably safer for everyone\"   The ironic thing is that multiple times on multiple responses from him he says \"it's not pub\"  then they need to change their name. They clearly aren't a \"GastroPUB\"    I feel prices are way to high for a self serve place as well everyone is rude rude rude!!!   I also refuse to tip, since its self serve I'll keep the extra cash for myself.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "zUdVP8vwuUXJ_3a-AEHVXg"
  },
  "z3YJwToWmaDkM-2hJY6ELA": {
    "date": "3/12/2019",
    "text": "I liked this place. The food was incredible.  They have games a large connect four, checkers and pool table. The area has lots of space for moving around. They have family restrooms. The atmosphere is fun perfect for a family night out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EJhAvLOdPquZEaZhWz1T-w"
  },
  "OIHIfktDRL5mZ-bjaW-f7A": {
    "date": "11/15/2016",
    "text": "Once inside, this place is huge! Has a cigar house, an outdoor patio and bar, inside bar and gastropub with shuffleboard , karaoke, and a very nice steakhouse. Good prices seem a bit high but I haven't tried any entrees to elaborate on the food. We stayed at the bar. Bartenders are very friendly. Great beer selection.  It's off the beaten path but worth a visit.  #supportLocal",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "MvCegPvVisSal6mp-bCZ0w",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MvCegPvVisSal6mp-bCZ0w/o.jpg"
      },
      {
        "img_id": "1x_9XnQONVG7AWONtCA2HA",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1x_9XnQONVG7AWONtCA2HA/o.jpg"
      },
      {
        "img_id": "4WvtHJjuuyNfGld5GGY14g",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4WvtHJjuuyNfGld5GGY14g/o.jpg"
      }
    ],
    "user_id": "ZXSNzKI638WQ3x5iKgM-ug"
  },
  "SBezInnPxfxwfGO4BgAkYA": {
    "date": "3/3/2019",
    "text": "First time here and it was the worst experience ever. Came for breakfast on a Sunday. First of all beautiful place however the SERVICE IS HORRIBLE. Stood in line for 30 minutes for a drink and then another 30 minutes to pay for our tab. People are skipping the line and getting helped when there are people who have been in line for 30-45 minutes. HORRIBLE. First and last time there.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U3LGFob_A0QRLWx3GBu4vw"
  },
  "cq1lWIg_ZXAPdMgrer10gg": {
    "date": "3/2/2019",
    "text": "What a gem in the desert!!! We got to experience this wonderful pub, eatery and outdoor fun space tonight and I am hooked!  The atmosphere is so relaxed and positive with tons of space.  We had the bacon wrapped shrimp that melted in our mouths and then shared a pizza and the mushroom Swiss burger, the bun was literally the best bun I have ever eaten in my life.  But let's talk about the staff, amazing!  We did not have one person walk by our table without asking how we were doing or clearing plates or cups.  By far one of the best places I have been too in the valley and will now be my go to hang out for either dinner, drinks and cannot wait to go for Sunday brunch!  You guys are killing it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QKa7G71aVhkpyo6-oLPk4g"
  },
  "J9DQ7OSr2gK0OTYQT4scEA": {
    "date": "5/2/2019",
    "text": "Good music. Terrible food. If you just stick to wings and onion rings, it's ok but pizzas are lousy and steak is worse with over cooked veggies.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "T0cRws8bn94BaKS-0y_K0A"
  },
  "4B6ZC9I6xImwUKLHnHCOJQ": {
    "date": "2/17/2019",
    "text": "Worst place to go for breakfast! Staff and management is rude and inconsiderate! We went for breakfast , waited in line and they took other guests before us 3 times. I guess they did not need or want our business. Customer service is terrible!!! We took our business elsewhere.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D3V_BxTjScxemy_JzeZWMQ"
  },
  "vFMwzQvQmHdP4RrJ2mzjvA": {
    "date": "9/26/2017",
    "text": "Hubby and I were excited to go here for lunch on a Tuesday afternoon.  We'd been to the Steakhouse a while back and had enjoyed it a lot.  First off, we thought they were closed, because there were no (zero) cars out front...we should've heeded that red flag.  But, I saw the signs saying to walk around to the stand to be seated and receive menus.  We walked in and were the only people in there, other than 2 people at the bar and a handful of employees.  The bartender (I assume that's who she was, since she never left the bar) gave us some menus, told us to sit where we wanted and to come up to the bar to order...huh??  I was already a bit disappointed, because the doors were all open and it's not quite cooler weather, yet.  They had fans at full speed going inside, but that's so annoying when your paper menu keeps flopping over from the wind...it also sucks when you're served hot food and it gets cold instantly.  Not only that, but there were dirty dishes sitting on another table.  Obviously, they're so busy...NOT...that they just left them there.  How hard would it have been to clean that up?  I'd understand if the place was hopping and the servers were running all over the place, but c'mon...  The bartender was very busy chatting with other employees, we couldn't even get a glass of water.  Hubby and I checked out the menu, and there looked like some nice options.  But, decided we weren't in the mood for this, and felt like we were bothering them by being there.  So, we got up and left.  Very, very disappointed...we were really looking forward to coming here, but was definitely not what we expected.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "y5Ak9VZeYWjaX52lb1hjXQ"
  },
  "8qR1Ol1jx_hVu1P81CzVcA": {
    "date": "2/3/2019",
    "text": "After some minor glitches our party of 25 had a great time. The manager Theresa made everything right, the food was sooo good, reasonably priced and the locale is fun, fun, fun. There is something for everyone, all ages, there! Staff was very nice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q8zQkK5eFSgsZWFIcKOw1A"
  },
  "pbOL2CEkEamLIVvcpZiTfQ": {
    "date": "2/4/2017",
    "text": "Had the meat lover pizza, onion soup, chocolate covered banana martini, and wings with the Thai BBQ sauce.   Food-Everything was fresh and tasty!   Service-We had great service from Camille and the rest of the staff that made conversation with us and helped us with  requests. Atmosphere- Such an awesome place to hang out and bring the whole family.  There is a large patio area with giants games (checkers, chess, connect 4, jenga, ping pong, and cornhole).    Yes, I recommend & yes, I will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BKbPn-6hVTg0AaJExKOgYQ",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Funnn!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BKbPn-6hVTg0AaJExKOgYQ/o.jpg"
      },
      {
        "img_id": "LiUGsEm9yJfuTb_fRkKUaQ",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Cornhole",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LiUGsEm9yJfuTb_fRkKUaQ/o.jpg"
      },
      {
        "img_id": "oD__mZAAvOdobt95-JOtXQ",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Giant checkers!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oD__mZAAvOdobt95-JOtXQ/o.jpg"
      }
    ],
    "user_id": "iCkgHkZZIcSGK5yIxAZhGg"
  },
  "BB7G-hc596wuaGcc-F98IA": {
    "date": "6/15/2018",
    "text": "The pizza's and not that great just mediocre the pizza dough has no flavor and I like the crust but this crust I will leave for the birds. Beer is cold and a lot of games to play but that is all. Will come back for cold beer but will eat before hand",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9lb2owRQ0MYydubkXTTUYA",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. The pizza&amp;#39;s and not that good",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9lb2owRQ0MYydubkXTTUYA/o.jpg"
      }
    ],
    "user_id": "m7SaizaBUpIf0G0UJxgbAA"
  },
  "pIuXgkocSof62KS8zlFMEw": {
    "date": "11/8/2017",
    "text": "The service is decent here, I would rave about it. The food is a bit pricey in my opinion. Pizza is okay. I've watched the UFC here a couple times and it's not a bad experience.  Definitely nicer to do when the weather is nice outside. I have heard the steakhouse is decent but I've never been.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "YpnuAoUgJQFsEh06cCbjkA"
  },
  "mFsIjrDm8PSuuRP6iydwzA": {
    "date": "9/30/2018",
    "text": "Horrible. Absolutely horrible. The staff was so rude. Especially the manager. Everything is so unorganized it was driving me crazy. First time there and the last. Will not give them my money and I'm going to make sure I tell people not to go there. Looks cool on the outside but It's the complete opposite inside. Don't waste your money or time going there.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "m3iILcJZiB-8uFWx7pMVhg"
  },
  "ZpqIBTU5D1fc9NgNkaHUOg": {
    "date": "5/12/2017",
    "text": "Love the set up of this place and outdoor games. Great for large groups and families. In the past the service was horrible. But we went recently and the service was great. Love the Papago Orange Blossom beer on tap! Food is good, not great & is very pricey for the quality. I would have given this place 5 stars if the food quality improved or they drastically reduced their prices on their menu.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bWBfTltRpJgK9UP5eBz-7g"
  },
  "G5pO6ngw9Nd963i7dAMz_g": {
    "date": "2/8/2016",
    "text": "I came in for a quick lunch on a Monday afternoon. Service was quick and friendly. I ordered the sliders. There was such a pathetically small amount of meat on them that I ended up just taking the meat from one and combining it with another in order to make it a decent meat to bread ratio. If I recall correctly, the menu said it came with a \"jalapeno\" mayo or something to that effect which had no flavor of jalapeno and really just tasted like horseradish.  The server was kind and offered to get more meat for the slider but was seemingly shutdown by someone back of house.   I really like the concept of this place and think it is good for the area. I would love for them to succeed, but it seems they have got some work to do to make that happen.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0qPoEAZ9NNEcuBY62M1ABg"
  },
  "GxCsYNJxX8KoSTExWnJTDw": {
    "date": "8/28/2017",
    "text": "This place used to be amazing....well the place still is and the food is too, but the customer service is awful.  They no longer have waitresses so you have to order at the counter and they bring your food and drinks to you. While this may sound OK, and it is for Mc Donalds, this type of business model doesn't work when you're paying $10 for a drink and waiting 20 minutes to get it.  On the bright side, you certainly won't get drunk or spend very much money because you're constantly getting up to order and it takes so long to get your drink that the prior one is completely out of you blood stream.  Hopefully management monitors these reviews and makes some changes or this place will become another statistic.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EUO7EAjitxtbOsJ50ZemvQ"
  },
  "33lsTcWiwUfMshWdfrAjwg": {
    "date": "8/14/2017",
    "text": "This place rocks, live music and great food, I love the pizza, and cigar lounge.  The owners are very cool and they go above and beyond for you.  Thank you for the good time and my future good times.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fvD1vRr9JG2JQJO10-Pp7Q"
  },
  "2VHs5lRBR1Axx0NHnztSBw": {
    "date": "8/8/2017",
    "text": "The restaurant was nice to come to and bring business clients for lunch. Now you have to order at the bar and serve your own drink. No more table service. This sucks. Hope it changes back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P6UlpHylO9y47y0KEb-w2A"
  },
  "GTdmXSjYZaY2v2IrPREiIQ": {
    "date": "3/2/2016",
    "text": "Visiting my sis in AZ, found this steak house.  We went on a Monday night and there was only one other couple but it was 8 pm   Our waitress, Destiny was a gem   Very professional and friendly. Anything we asked for she got for us   Food was another story   The steak was very good, they came with 2 sides that were pretty bad   1 person had the Mac and cheese (very watery and tasteless)  the twice baked potatoes were basically baked with a 1/4 in of mashed on top  what does it take to make a descent side dish, it  ruined our meal     So basically it was so so",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "So0w8c9wck6TY-i6c48Bqg"
  },
  "oauwuwXdgMVN9-jZd6l6aw": {
    "date": "1/21/2017",
    "text": "It my very first visit tonight for a friend's birthday, which we had a reservation for 30 + people. That right there should tell you that you're going to be busy and that group will need lots of attention. So we show up little by little, basically trickling in. Yet the individuals that got there first were ignored for about 3o minutes before any drink orders or anything at all was acknowledged. Finally we were able to order our very first set of drinks which arrived nearly 20 minutes after ordering. All of the guest that were there to enjoy the birthday festivities began to arrive minute after minute at that point. Yet our server was nowhere in site, so, yes, when she finally arrived she was very overwhelmed by the amount of people that were present. At this point guest were ordering food and food from the ladies that looked to be bussing tables and doing a much better job than the server herself, whom in our opinion as guest wasn't doing much at all. It was taking so long and so many people were upset the manager began walking around and asking what drinks were ordered. He told us he would make sure to take care of drink orders and they would he on him/the house. Immediately all the drinks appeared to the tables. After all the hassle food began appearing to the tables piece by piece, yet all the orders were either messed up or missing items. Some items would appear only several minutes later, only after making complaints to whom seemed to be management for the evening. Worst part is my friend whom made the reservation for her very own birthday party was completely ignored. Never once was she asked if shed like to order food or drinks... So we brought this to the attention of the so-called manager, he made sure her order was rushed out from the kitchen due to it being a salad of some sort... She received it and could not and would not eat it, she found a metal nut and bolt in her salad. She got the attention of the manager of person a ring as manager, she showed him what she received. He quickly pulled the plate off the table and did not replace the salad at all. We were all charged full price for drinks and food, on top of that and the horrible service we all received we were all charged an auto gratuity of 20% which none of felt the server in any way reserved from any of us at all. On top of all the bs that took place the people that were told the drinks were taken care of, they were charged full price for all drinks... None taken care of at all... This restaurant takes no accountability for their mistakes or their employees, never again will I return to this establishment ever again. First and last visit ever... Sad to say, because this place could be great and so much better.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "L72akYjrZLnCP9VVCFudJg"
  },
  "jkCRhjM8-hmSLLd8QoL5RA": {
    "date": "4/24/2016",
    "text": "Tried this place out and was not disappointed. Service was outstanding as well as the food. Lots of local craft beer on tap. Outside patio is the place to be when weather permits, plus there are a few activities like Baggo, ladder ball and ping pong and don't forget about the on site cigar shop. Downtown Glendale keeps on getting better.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9V5MacmAl8tjJjzS8eNpBQ"
  },
  "T_MSY3mzzjL-KlW47wSsQA": {
    "date": "4/21/2016",
    "text": "Really love the atmosphere,  and the short drive.  Great food on both sides, live music, games etc. Can't wait for the citrus trees to mature!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eXkE3cDQ_2EyiI_BGPcdQw"
  },
  "czCy07pqTM05ZR7o0YiKDQ": {
    "date": "7/10/2016",
    "text": "We love this hidden little gem, great craft beers, attentive staff and last night we tried the mussels. We're planning on trying their Sunday brunch next. The patio was actually cool last night, unfortunately we didn't notice until we were leaving.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sN7Pf26gPbPvep898X-CWg"
  },
  "718fEgEHqh3-0pYnv5G4IA": {
    "date": "7/7/2016",
    "text": "The pizza is amazing! Thick, soft dough and the best part is the garlic butter they spread over the crust after it has baked. Sirloin sliders and fish and chips were also great! Will return often. They take care of the biker crowd for different events. Lots of fun!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EyJ1wzlFgJYqaKMB2-Cl4g"
  },
  "6Hq58w06j_-Nt-sUWQOMLQ": {
    "date": "4/28/2016",
    "text": "Great experience! 25 people and excellent service. They moved us from inside to outside with no problem and were so pleasant and anticipated our needs. A little pricey but large portions and great quality.  The French dip sandwich was excellent. We especially enjoyed the patio, we played games, great entertainment and even danced.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bVFwk40Sax8s50MV6Uifog"
  },
  "DoBygsISvkoSERzgixcFeA": {
    "date": "1/29/2016",
    "text": "WOW!  Glendale's new shining star!  Very impressed!  Went for drinks, appetizers and dessert after a long day.  The beer and wine selection is top notch and varied to appeal to all tastes.  We had the Brie appetizer and gluten-free pecan chocolate cake.  Delicious!  (I'm not gluten-free but it sounded good and it was!)  Joel and Nick went out of their way to make us feel welcome and offered excellent customer service.  There's plenty of seating inside and out of this aesthetically beautiful venue, with large Jenga, corn hole, table shuffleboard, and enough large screen TVs to watch any game.  We can't wait to try the steakhouse!  Well done!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "TEcrNGeOoFmgBDNZ6UvvCw"
  },
  "FHCal8sGc8Ny7TR-RJkm0g": {
    "date": "3/19/2016",
    "text": "My new favorite hang out! Awesome place, a lot like \"the yard\" or \"the deuce\"  in Phoenix, but in my neighborhood! Good service, the bartender is helpful when choosing a drink, love that it's very kid friendly, nice open space. Had a great time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n_LgjVEbgm15SERvzvlXkQ"
  },
  "cHbsnHcIafEr6EeAaxet5A": {
    "date": "4/10/2017",
    "text": "Desert rose was a wonderful experience my wife and I went there for our anniversary 4/10/17 the live music was wonderful and the food was amazing the steak was so tender and flavorful you didn't even need steak sauce and the macaroni is a must try it tasted like my grandmother cooking we will definitely be back thumbs up Desert Rose !!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wx-lZXS8DF_2jRRKaxUvhg"
  },
  "BtuD8bJAHVFBfxun_B_eEw": {
    "date": "4/6/2016",
    "text": "Went there about a week ago, had a good meal, and a few drinks, the bartender was quick to offer up some whiskey, think her name was Christina, she said they have like 70 or so different kinds. Was a good time, I'll definitely be returning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8dO01BmoAVMrn2Rx6VdNQw"
  },
  "5-lVQImrJQzDaZTA9kWfLA": {
    "date": "5/14/2017",
    "text": "Destiny is AMAZING!!!! The management needs to get their s**t together!!! Mother's Day brunch was a disaster!!! Food was great but soooo unorganized!! Soooo understaffed!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IfBAC2ZsKWM3rL3s6Sqx3Q"
  },
  "6fCBmr11FhJSTDtj19vVcw": {
    "date": "5/1/2016",
    "text": "Service was a little slow at the start but the whole rest of our visit it was much better.  We took our son.  We played foosball, ping pong, giant connect 4 and shuffleboard.  So much fun!  It is a little pricey. There were a lot of tvs.  The food was delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xZfizYDyviXY6Gyc_cJHWA"
  },
  "4vJsgdfSMAxc2wg1Ly_OxA": {
    "date": "4/18/2017",
    "text": "We were there on sat @ 630pm. The service was. Very bad. Our appetizers and entre were brought out at the same time, and the food was so cold the butter did not melt in the( what they call a baked potato) was a steamed potato. We had to ask them to take the food back! A good manager should do that automatically without us asking. My husband was given carrots that were raw. I think the only reason there were other people in the place was to hear the band, which was very loud. This is the second time we were there and we will not.wE will not be going back. Their deserts are right out of a cardboard box. There was sun streaming in the door and not one person asked if we would like to move. The staff need to be taught how to serve and treat customers with respect. Management is severely lacking!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GlI7xv-gJ6SqF6s5dJ7SWw"
  },
  "XVw5qfOj7jvhcCOj_CBrIA": {
    "date": "12/27/2016",
    "text": "What a place, great layout and space! But I don't think I could be more disappointed with the mishandling of a check. We all have had experienced a mischarge at a restaurant/bar once or twice and how the staff corrects the situation is a good gauge on customer service. Being charged $83 after you are given a bill of $23 and a reply \"of sorry\" \"your account should be rectified in 48 hrs\" doesn't cut it. That is simply telling me as a customer if your staff messes up, I, the consumer will just have to understand and adjust for the next 48 hrs. Customer establishments that treat these issues with care and actions immediately are where people return to give the establishment another chance. In this instance I will not return, because Desert Rose didn't ask for a second chance, Desert Rose didn't encourage me, persuade me, or simply invite me to return so they can better my perception of them. Have a blast if you go but have low expectations  on service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vezkHusrZFwK7lJcqjXsuw"
  },
  "WAapqEzHE_g7n-C0fNi8Ow": {
    "date": "6/13/2019",
    "text": "Oh my goodness I wish I would have known about this place when I lived out here before in Glendale! Ooooooh cant say enough about this place..... Tons of entertainment with different things to do. Such as life size checkers and chess, connect four & jenga along with corn hole, pool tables, air hockey table, plus dance area. This is a definite place to sit back & relax conversate and enjoy laughter plenty of sitting patio like on your porch in your backyard on a patio table with chairs.   So like the pictures show you have the opportunity to play checkers, chess, connect 4, pool and hot air hockey, and they also have shuffleboard, corn hole & other board games. I don't know what they're called.   As regards to the food it's OK I guess. Little bit pricey. I ordered fried pickles slices for about $7 & no dipping sauce, small portions 4 the price. They even have a cigar bar where you can go and smoke cigars and a little patio area to.  some down seen have a small And also I notice those on lot of motorcycles there so that's another thing to check out. I definitely coming back.  Oh BTW the dress code is very laid back n casual.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "m0yeAnB6chK3DYbkIhgi_A",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Patio sitting area. 1 of many area",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/m0yeAnB6chK3DYbkIhgi_A/o.jpg"
      },
      {
        "img_id": "CJtnsX0T3yWtRzxrPsMFeQ",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Hmmm may need to check this out 1 day",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CJtnsX0T3yWtRzxrPsMFeQ/o.jpg"
      },
      {
        "img_id": "9ippHfHZ13oHSrASDMvTHg",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Life size checkers",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9ippHfHZ13oHSrASDMvTHg/o.jpg"
      }
    ],
    "user_id": "6vztYlXWTdqT4xomFcu75g"
  },
  "gSU1lKfQsOQorZAfVzE-fw": {
    "date": "5/28/2019",
    "text": "Good sangria  Horrible bruschetta. On a thick slice of bread. The only decent one was salami and pesto. Original mozzarella- cheese was untasteful. Ricotta had no flavor. Just really disappointing.   Sangria was actually really tasteful. Just a Small glass for $7. Not worth it. Over priced.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DC-H7UE4Rl9cGHruBwFMQA",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DC-H7UE4Rl9cGHruBwFMQA/o.jpg"
      },
      {
        "img_id": "KBIW14mMMPwdxjOh7_ktjw",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. The brie bruschetta was way too sweet.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KBIW14mMMPwdxjOh7_ktjw/o.jpg"
      }
    ],
    "user_id": "E8xjLfGu81Z7jiouYJYVsg"
  },
  "ZCiZzR_4eLgyFTLb4Q1nLg": {
    "date": "5/2/2019",
    "text": "Awesome open concept bar. Everyone was friendly. They have plenty of outdoor games such as cornhole, connect 4, Jenga.   Definitely recommend.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "injPcslyI-V0DbZ8rhSeRg"
  },
  "VcE4ygPXnie-EkxVQOMjhg": {
    "date": "8/23/2019",
    "text": "OMG this place is so much FUN! Beer, Pizza, Music, Games & so much more!!! Let's not forget the awesome service",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xp8QHy92E7tzVcA3PR5rsw",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Games",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xp8QHy92E7tzVcA3PR5rsw/o.jpg"
      },
      {
        "img_id": "b1bkv5iM9gKgaFYruI7i0w",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Beer",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/b1bkv5iM9gKgaFYruI7i0w/o.jpg"
      },
      {
        "img_id": "p8uu0VXlCDQ4UXQNPm9kyA",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/p8uu0VXlCDQ4UXQNPm9kyA/o.jpg"
      }
    ],
    "user_id": "3IrJGPdXyLX2DqPScfvD2A"
  },
  "LfPARRkT8xrQ7gfjLJU_Aw": {
    "date": "8/8/2019",
    "text": "It wasn't busy when we arrived. Saturday, 9am. Party of 4. We ordered our drinks but nobody came to check on us. We left after 30 minutes of no contact.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "BOP3BD72GHECRiJOJ7HIJQ"
  },
  "jroW9XmXfpl5-8fkli_FfQ": {
    "date": "10/22/2018",
    "text": "AWSOME VIBE,GREAT FOOD, AND GREAT CUSTOMER SERVICE. We will definitely go here again on a datenight or with the family, something for everyone!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CYY5BbP24IW-T96xffYEYg",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CYY5BbP24IW-T96xffYEYg/o.jpg"
      },
      {
        "img_id": "u1R_ssA8eJSI62a5vzoK-A",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/u1R_ssA8eJSI62a5vzoK-A/o.jpg"
      }
    ],
    "user_id": "haK4kC0OtvfxfpxWnAoofQ"
  },
  "IjdswPx_WZuODczVW7FbPw": {
    "date": "8/21/2019",
    "text": "I come here to play poker Wednesday nights. I sit at the bar, order off the Happy Hour menu and have a couple of beers. I hear from others that the steaks are great and that I should try it next time. I can't relate to other poor reviews where their service had been horrible.  After I walk in I am greeted immediately. I tend to sit at the bar for Happy Hour. Not only does the bartender treat me well, smiles and is friendly, but other servers and bartenders behind the bar are always saying hello, asking if I need anything. I have not had to wait any longer than need be for my beverage and food. The food is delivered promptly and hot- with a ton of flavor. I recommend giving this place a try. I have had nothing but an extremely positive experience here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p0loCJV5LZJ6_9i7XAEd8A"
  },
  "PbfxPInBoEoddUqsLrjmYA": {
    "date": "7/13/2019",
    "text": "Always wanted to come to this place! Jason, the bartendar was awesome! Recommended the corn beef hash and it was amazing! Definitely will return!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FX2mP5bw9DhynR6yjOWnlQ"
  },
  "NYfGiWRwdHLjxh_HGqK5RQ": {
    "date": "8/13/2019",
    "text": "Friday nights in the large dining hall remind me of an Old Western variety show, lots of fun the crowd is Lively but considerably older, food with solid service was good. By the way they have open mic on Friday nights",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WKXlfsB-HKxseimTlJj6RQ"
  },
  "hsPUL3SY9C2R8Bio6FuvQw": {
    "date": "8/10/2019",
    "text": "Absolutely the most wretched experience I have ever encountered. It was torture from start to finish.  The service was lost. Had no idea where they were or how to take care of a customer. Notice I said customer, not guest. We were treated as hogs to the slop trough. The food was not fit to eat, for humans. Meatballs tasted like SPAM, to be kind! The pulled pork was mushy and bland. First time I have ever left over half a meal for the trash. Then let\"s talk about that poor soul who was pretending to sing! Put him out of my misery!!!! Needless to say, I will never be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EzKbvDAhHeM1dKrHYvVN_w"
  },
  "V0nvnikJYZs9lmXo8HzjaA": {
    "date": "8/5/2019",
    "text": "Crazy big place with lots of outside activities. Food and service are pretty good. Had muscles and pizza. Both prepared nicely and flavorful. The \"spicy\" Hawaiian was great but a few too many jalapenos. Reasonably priced, good service, good food, fun place.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "JsDvwQzUTUPhj9D0ynrQ0Q"
  },
  "bdOMsNqOovoumNxNNe4jqw": {
    "date": "3/26/2019",
    "text": "Love this place so much fun and great selection of beers. The staff was friendly and prompt. Great look Desert Rose.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AnwuTAUJ1z_u_ZKqOP3Eww",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Fun, exciting, place to bring the pup hang out with friends and have a great time. Lots of great drinks, beers, and wine. Oh yeah food is",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AnwuTAUJ1z_u_ZKqOP3Eww/o.jpg"
      }
    ],
    "user_id": "zY4RR6kG0AgioqbgpXCsFg"
  },
  "8Uo3cXTJF1YusYqa0iOo6g": {
    "date": "3/31/2019",
    "text": "We have been here four times, the first...it was like OMG!  How could we not have been here before??!!!!  The food was good they had live entertainment,  catered more to an older crowd but entertaining.  The service was spot on to where we were never left wanting.  We came back after bragging the place up and brought family,  we were the butt of jokes for quite some time...there were maybe 5 tables in use, no groups over 4 per table. 2 servers a hostess and bus personnel.  The service was so bad we stayed thirsty and became cheerleaders trying to get the attention of our waiter.  We were sarcastically commenting every time he finally came around how we must look like horrible tippers or smell since we never see him.  The third time was with my daughter who wanted pizza and we were going to have steak....we sat in the restaurant and was told no pizza in there....uh WHAT?  OK, so my daughter just ordered a salad to tide her over until we left, again the service was lacking but nothing like the last time but we still needed to flag him down for refills.  Now the final strike occurred last night...my wife and I just left an event and were a little hungry as we drove up Grand Ave we decided since it was fairly early we would try here again, it was just before 4pm...there were 3 tables seated, one of which was a party of 6 and the other 2 tables were parties of 2....the hostess sat us and told us Mark would be serving us.  We looked at the time it was 355...come 4 o'clock he finally made his way to our table and introduce himself and say he would be right with us, no drink order taken...414 he came back and asked if we were ready and I said, well we'd like to order drinks and an appetizer please, we did and he left....we waited...and waited....and waited....come 426 my wife is fit to be tied and now HANGRY we weren't seeing Mark anywhere and 2 other tables were sat and had drinks from another server....meanwhile the hostess is be bopping around attempting to appear busy....why isnt SHE helping out if Mark is this busy??  Which as an ex- server my wife was befuddled....we gave up, we left without letting anyone know and we hope they enjoyed the appetizer and drinks we ordered we dont think we will be back anytime soon....and such a shame it is a quaint little place and had a good time out first time around....",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "qgtRPFqskbohnS80_t9ORQ"
  },
  "s34L6yfb_YJi807wanojvw": {
    "date": "5/17/2019",
    "text": "The food was very good! The fries were good & hot! Service by (I think) Michael was good! My only issue with this place was the size of the plates! They're so small! Our food kept falling off of the plates!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Og0XhX580PEEGEwzvqnyw"
  },
  "FVJMKWIQ1VHQFFcI4bkC9w": {
    "date": "6/8/2019",
    "text": "Pay attention to the other reviews, there is a theme here. First of all, the food was amazing. But the 2.5 hour ordeal to get it and pay for it was horrible. Sorry, the absolutely horrible service did not make the food worth the wait. Worse, the waitress kept my credit card on her and she avoided me and my wife. I told the manager after waiting 45 minutes to pay my bill and nothing. We had planned on moving a large business event here but the reviews and our personal experience have made us decide to move it somewhere else.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "D4DQkey01s8zmuwIu_J0tg"
  },
  "A4zot1N9k0JyYB4OybKYJQ": {
    "date": "6/20/2017",
    "text": "I've been here plenty, but wanted to give it the year or so to grow into its full potential. With so, so much space to work with, Desert Rose has finally carved its identity as a premium sports bar featuring ample games and music outdoors.   The food itself is decent. I'd say the pizza is the best value on the menu, and better than anything you'll find at other sports bars even if it's not what you'd expect from a place that appears to specialize in it. And the rest of the menu is arguably pricey, yet is really a cut above what similar establishments will serve up. I feel as though naming it a \"gastropub\" is a misnomer that leads you to raise your expectations too far above the simplicity of the menu, and that die-hard foodies may be left wanting more. That being said, I recommend splurging on the bacon-wrapped shrimp, or even the clams. There will be an item for everyone!   The outdoor seating is in pristine condition, and when weather permits allows for giant games of connect four, checkers, chess, and more.   The back patio seats a hundred or so, and they love bringing in live music (especially banda!), which is welcome entertainment to a historic neighborhood that's often dead during warmer months. In fact, shows like these represent what really draws me to this place. There's always something going on, and you can enjoy it with their great beer or liquor selection.   To conclude, the food is a-ok, I'm a fan of the drinks, and the atmosphere is as good as it gets. I'll be a regular.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 10,
      "cool": 4
    },
    "photos": [],
    "user_id": "YpGt3hdq5adPlEFn9fQ2Zw"
  },
  "M3pZWKi_13oC7Nw-0mJdOw": {
    "date": "3/9/2019",
    "text": "If you're looking for decent food with good vibes and a fun night out this is the place! I went tonight for a friends birthday. I had the lasagna! Huge portion and really good! The Caesar salad was on point too. What sold me was the courtyard area! Great DJ and a dance floor , games and just a overall good vibe for a Saturday night! I enjoyed myself and can't wait to go back. The service was good too! Sorry no pics",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "djpXw-UpUhu5c1c0dQvEIQ"
  },
  "8Qv5U1rBP9l4Qv8EbBJNew": {
    "date": "10/20/2018",
    "text": "One of our family favorites!  We coach little league and pee wee baseball and our parents enjoyed having our team party here.  Food and drinks are always great, a small pizza and nachos were enough for mom, dad and two boys. They have a lot of daily events And the Sunday brunch is on point!  Where else can you find Mimosas, Menudo, prime rib AND croquettes (which I had no clue about before).  There are a lot of TVs inside & outside making it a great location for games and UFC.  We liked refilling our own drinks and ordering at the front counter was not a problem. There is a Cuban inspired cigar shop there as well.  We got lucky one night,  and got to watch the UFC fight in the plush cigar smoking chairs.  The owners know their community well and it's nice to know they remember us.  I just asked my son his favorite thing about Desert Rose: he said play games.  In the courtyard area there is giant Connect four, chess, checkers and Jenga.  There are also ping pong tables, corn hole, and pool tables.  Everyone we've taken here from 7 year old children to my 96 yr old grams had a great time at Desert Rose.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4tdLf23JM3mY_7TESU5d1g",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4tdLf23JM3mY_7TESU5d1g/o.jpg"
      },
      {
        "img_id": "q9jcJuXG5eOCwrBY0MDMQQ",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/q9jcJuXG5eOCwrBY0MDMQQ/o.jpg"
      }
    ],
    "user_id": "xiwyJvtfDTJpeavCNEHWCA"
  },
  "oOkp5do6S4nWYZqopBB9dw": {
    "date": "5/23/2017",
    "text": "In our party of 4, not a negative word was said throughout the entire experience!  The quality of food will have your taste-buds begging to return!  The other 3 in my group had already eaten a couple of hours ago & weren't starving, but two of them cleaned their plates!  First off, we were headed to another restaurant, but it was closed.  So, this place popped up on the Yelp search and was literally right across the street!  This is a great find!!  When we pulled into the parking area, I just headed closest to the lit up patio.  We walked up to the reception stand and was asked if we wanted to dine inside or out.  This was the Pub.  Good thing I chose inside, it was nice and cool in there, even with the door open.  As we were sitting and perusing our menus, I noticed another door leading to yet another restaurant!  That is the Desert Rose Steakhouse.  All the food seems to come from that one kitchen.  Next door to the patio on the other side is the Desert Rose Cigar Lounge.  A bit of something for everyone in one location!  We ordered the Chicken Blanco, Peppered Beef French Dip, Chicken Sandwich, and Seared Salmon Sandwich.  The last item was mine.  I can't even describe how excellent it was!  I loved how the salmon was so nicely seasoned and seared!  The salmon was quite a bit larger than the large bun, so you definitely get your money's worth (although it is $14.  I ate the \"extra\" part of the salmon before picking up the sandwich.  I would definitely get this again!  Inside the pub, they have a shuffleboard table and some other games.  If you find yourself sitting on the patio, you can enjoy the larger than normal chess and checker boards as well as other games they have.  I saw Corn Hole, too.  There is live music outside and they pipe it in to the pub, so that was cool!  There were children playing with the outdoor games while adults were sitting and chilling out.  So, if you are looking for an informal place to dine and/or maybe a place with activities, this would be a great venue for you!",
    "rating": 5,
    "rated": {
      "funny": 18,
      "useful": 21,
      "cool": 21
    },
    "photos": [
      {
        "img_id": "Z5ZTq-lkaYLdtS6pFLiWVg",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Chicken Blanco",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Z5ZTq-lkaYLdtS6pFLiWVg/o.jpg"
      },
      {
        "img_id": "7EkoiW86eGliFSFb9LTPfw",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. White Rose",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7EkoiW86eGliFSFb9LTPfw/o.jpg"
      },
      {
        "img_id": "ZIkUCVONhBdrOqrNRcxMJg",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZIkUCVONhBdrOqrNRcxMJg/o.jpg"
      }
    ],
    "user_id": "s_FAHFKUl4YqNofYZC1NYg"
  },
  "gdmURB1TPxdlsE1CkCQHkA": {
    "date": "2/16/2019",
    "text": "This place sucked! I have been wanting to come here for a while now and I finally went on a Saturday night. It looked like a fun place, however, I did notice a few dirty dishes to the side as I walked in. There is a sign that says to get your menu and order. We go to the order station and no one is there. So we start to look at the menu. Still, no one acknowledged us. The bartender could see us but she did not acknowledge us either. A few workers walked by and ignored us as well. The workers had looks on their faces like they had corkscrews up their a$$. All in a bad mood hating their job. I see a tip bucket and to no surprise it is empty. We ended up leaving to go eat elsewhere. What a disappointment. Find a better way to service your customers. No one helped, looked or acknowledged us. Good luck trying to eat here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "gAkiUuunU0wb4FSVOpJmyg"
  },
  "yHDzJKr4dHmJA1b_NdcXxw": {
    "date": "4/25/2016",
    "text": "Well one of the owners responded to my review, Theresa O, stating I changed my table 3 times (we did not & how would this person be able to accuse us of that since they don't even know who I am).  She stated that I wanted proof the bread on my sandwich was gluten-free, I did not, I accepted the sandwich with a gluten-free bun when it was served.  And about the ketchup, yes I will go on with that since the waitress doesn't know what the rules are.  Anyway not going back so of course they don't want me back.  I don't want to get into a pissing match however I don't like it when someone accuses me of something I didn't do.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "zyebSPCZLUZHapi-dSHU5Q"
  },
  "n-1feaCNqVASTEOn2SuC9A": {
    "date": "4/16/2016",
    "text": "I've visited Desert Rose twice. I thought the first time was a fluke, since they recently opened.   It wasn't.  I met a friend for dinner with her daughter about a month ago. I was greeted promptly and decided to have a drink in the attached steakhouse before my friend arrived. The bartender in the steakhouse, Jonja? She was great. I was quickly asked what I wanted and I decided to try the Summer Sadie. It was fantastic. Unfortunately the visit went downhill from there.   When my friend arrived, we were seated outside on the patio of the pub. The chairs and seats are patio furniture much like what you would find at someone's house. Which means you feel like you're a five year old sitting at a big kids table because you're so much lower than the table itself. The service was slow. Incredibly slow. We ordered the Brie bites for an appetizer, for $10. What we got were three tiny pieces of bread (like someone cut three thin slices off a baguette with halfway melted cheese on it. For ten dollars. I am fairly sure that I could buy a whole thing of Brie and three whole baguettes for that price. I had the salmon sandwich for my meal. The salmon had a good flavor, but when I asked for dill aioli on the side, I got mint. The server proceeded to tell me 'well the kitchen says its dill'. Note: dill and mint look completely different. If it was parsley? I could understand as the leaves look the same. But dill and mint? She went back twice before I received the dill, when I was halfway done with my dinner. Overall the experience was disappointing for spending almost $50 for a drink, what could only be referred to as a bite for an appetizer and an ok salmon dish.   The second time I went was a few weeks ago. My husband and I both ordered personal pizzas. I got a two topping and he got a meat lovers. We each had a few beers on the patio (2 each). When the bill arrived and was $62 we were a little taken aback.   The website clearly stated that happy hour was from 3-630 every day and that there were a few dollars off the drafts during that time. Much to my amazement, in looking at the bill the tiny, four slice personal pizza that tastes like a gas station pizza my husband ordered was $16! $16 for a personal pizza??? They even over charged him for the beers he had, the menu clearly showed they were $5 and they had $6 on the check. They did fix this part of the bill but told me that happy hour didn't apply on Saturdays.   Needless to say, we won't be going back. I'm sorry, but your prices are *obscene* for the product you are delivering. Mediocre food for caviar prices. I'm pretty sure that La Piazza Al Forno a little bit up the road doesn't even charge $16 for a personal pizza. And their pizza is fantastic. So is oregano's. And I can get the same quantity of pizza for less than $10 for lunch any day.   You have a great concept. But the delivery is being presented half assed at best. The servers argued with me over the check; when I showed them what is on your website. I've had better frozen pizzas. The prices will lose you a lot of business. Either amp up your food game or lower your prices. You're right on grand avenue charging Scottsdale road prices.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JMfWJaFqTz-7-XGYR3vaGw",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Prices on the website",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JMfWJaFqTz-7-XGYR3vaGw/o.jpg"
      }
    ],
    "user_id": "4c9AcxLg3_6_fSioPITpQg"
  },
  "lNPqa-VQ02OtyJvMauXOLQ": {
    "date": "9/2/2016",
    "text": "Great food, great games, great tv's, great staff, just all around GREAT!!  Brian and Mel are so much fun when you're hanging out at the bar and enjoying some amazing food while watching the game!!!!  Chicken Alfredo is a regular order of mine, sometimes I get shrimp instead.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "FFo6LcBgaFiUgcUHvGqTag"
  },
  "292luT11L9q8_qsbAfy9bw": {
    "date": "11/17/2016",
    "text": "cool place. unique concert and layout. Order a half house salad and split cod and fries. Food was great. Service was almost perfect served us chips and fish with no silverware and no napkins. Things happen. otherwise it was good. I'd come here again. recommend try it out at least once or thrice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nJg9y-DJDJ60-eOG-_mrbw"
  },
  "b1Mtx8D3V2_Zdar1kxzoAA": {
    "date": "3/19/2016",
    "text": "Hate to do this, because I love supporting local startups especially cause they are needed in the West Valley. Though, they were rude in explaining why after 30 minutes we didn't have our small appetizer. Essentially saying, we don't need your patronage. Don't go unless you want to risk getting stressed or being projected on.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "kfKW8YscmlCV8uy6wBsEqQ"
  },
  "YlVDr4TPkIPl2nRz6e8fvw": {
    "date": "6/10/2016",
    "text": "Food is really good but the service was very slow. We had a party of 10, with individual tickets  It took over 30 mins to get our food and when you're on a lunch break from work, taking an hour and half isn't acceptable with many emplyers. We discussed bringing our customers here but that's just way too much time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CI_sxAsM-_xbpxnrATU6Fg"
  },
  "02PrhxReEu6N9bePXPxNrA": {
    "date": "4/2/2016",
    "text": "We had a meeting at the Desert Rose Pizza and Gastropub. OMG I wish it was closer to my home...They have everything a man could desire (Well almost). Cigar Lounge, Steak House, excellent food, service and atmosphere. Great parking for motorcycles and would be awesome for any event!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "PTUgNrDC5hAH4bMEGgWAiQ"
  },
  "C4fwAt0UNiFoTCRoWxxMWA": {
    "date": "11/4/2016",
    "text": "I happen to come across this place as I was walking along grand ave, I just dropped off my car at Sands Chevrolet for service and wanted to grab a bite to eat. Upon arrival I noticed there were 4 different sections of this place. There was a steak house, a pizza place that connects to the bar area, a cigar bar, and the outside area where they play live music. I honestly didn't know what side of the building to enter, and ended up on the side with the pizza. They had a lunch special, bugger fries, and a drink. As I was deciding what to eat I ordered  a whiskey smash from the bar. The presentation of the drink was not appealing. Instead of  using the mint as a type of garnish they shredded it to piece and stirred it in the drink that not only made it look gross, but made the mint taste supper overwhelming that I couldn't really enjoy it, also the mint did not look fresh. When I finally ordered my food I was really disappointed I couldn't order a steak because I wasn't on the steak house side, so I settled for the lunch special. I wanted my buger medium. The fries were alright, once you got pasted the first couple on top the rest were really blain, no seasoning. The buger reminded me of the patty s you would get at McDonald's, it was grey and had no flavor. It was a really think patty to, that was I guess well done, couldn't tell because it was so grey, like it was heated up in the microwave and not cooked on the grill. The staff was really friendly though, and kept asking if I needed anything which I did appreciate. I might have to come back to get a second opinion.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8VaBSsgOBkDSRw7WxGwFdw",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8VaBSsgOBkDSRw7WxGwFdw/o.jpg"
      }
    ],
    "user_id": "A8RtwFMc_EJCOfbmFOhdbg"
  },
  "pRwrnblG48E8rwA8G30wvw": {
    "date": "10/31/2016",
    "text": "holy cow! lets just say of you have never eaten here, you are MISSING OUT! Place is amazing!! first time here and would DEFINITELY be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2LwpeevpYz7RyfmbcOd-ug"
  },
  "ltpQJZls8fu9XR_eztC9Mg": {
    "date": "2/13/2016",
    "text": "WTF.....what a joke. Started bumpy to begin with. Receptionist told us seating was very limited but yet there were a lot of empty chairs. Most employees looked nervous, a bit sweaty, and unsure. I'll give them the fact that they've only been open since late January but it seems as if this business is run on a wing and a prayer. Okay now here is where it gets redonculous. I ordered half a pound of chicken wings and I was presented with three, yes I counted them, three chicken wings on a plate. There goes $7.See the pix in photos. The kid who brought them to me said they weighed them first. lol. I asked for a napkin and was brought a dirty linen napkin and a few cocktail paper napkins. The only thing this place has going for it is the atmosphere.....period.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 8,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "pi4R-Jv91EE5PWMDVdW3bA",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. 7$ half a pound = 3 wings :(",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pi4R-Jv91EE5PWMDVdW3bA/o.jpg"
      }
    ],
    "user_id": "L_P4pOgJRSQZ-UDSr0bH-Q"
  },
  "30g7c4wpl-FVgdX5wpdPSQ": {
    "date": "6/4/2017",
    "text": "This place is horrible! First of all, the food is super overpriced. I wouldn't mind the high prices if the food was of good quality, but honestly, the food was less than desirable. We ordered an 18\" meat lovers pizza, and it needed more sauce, cheese, and meat. The toppings were very skimpy, especially for a $30 pizza. If I'm gonna pay that much, I expect the toppings to be piled on. The crust wasn't very good either, it was very bland. The pizza was definitely not worth the price. We ordered lemonade to drink, and there was nothing special about it. It was just average lemonade, served in a disposable cup, with almost no ice. It was warm. The service was also terrible. We went to Desert Rose to watch a performance, and naturally sat outside. We were there for about two hours (during the course of the performance) and we saw our server maybe three times? And when we did see her, she was rude and seemed like she was forcing herself to walk to our table. Overall, this place is HORRIBLE. Little Caesar's pizza is way better compared to this. At least there you get what you pay for. I will never come back to this place again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "i9zUkTjJYUnTWB7jtDTflg"
  },
  "h5itRkt5PwpCYLjQUpD-1Q": {
    "date": "10/22/2017",
    "text": "Wish they had more vegetarian options other than salad, mac and cheese, pizza. Pizza was just ok.  Crust very doughy, like it came out of a  can, not enough sauce.  Other than that it was very relaxed and fun.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6rwRUzaJwRg5hwO0tE29cw"
  },
  "QnVdAruS-iG9SBP6WRkY9A": {
    "date": "4/3/2016",
    "text": "Way over priced for wings only received 3 and they weren't anything special. Pricey for the area.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "hhJXhYnWBk9LeI-U-L_3CA"
  },
  "jSEBVK-ZHp5aF_-u_9LDHQ": {
    "date": "1/23/2016",
    "text": "My family, and I have been to both the steakhouse and pizza & gastropub and unfortunately, we won't be going back until some improvements are made.  We were very excited for this place to open since we go out to eat often, and this place is just down the street from where we live.  After going to the steakhouse during their soft opening, we decided to give the Pizza & Gastropub a try.  We happened to be there the night of their grand opening, and the chamber of commerce was there for an event.  It wasn't an issue since we were able to be seated right away.  The staff is very friendly (that's why they get 2 stars), and attentive.  I was disappointed to find out that they don't have a kids' menu (same as steakhouse), but asked for a half order of fish and chips...I wasn't sure if my 5 year old would eat it, but thought it was worth a try since he normally likes fish sticks.  The server wasn't sure if they could do a half order, but said she would check.  They couldn't, but I went ahead and ordered a full order anyway (last time I am spending $16 on a meal for my kid!).  We started with chicken wings and artichoke dip for appetizers... Chicken Wings: They are served dry with the sauce on the side.  The chicken was fine, but we just prefer them tossed in the sauce. Artichoke Dip:  There is room for improvement with the flavor of the dip, and the bread that they serve it with is hard, but not toasted brown...so either brown the bread when you toast it, or don't serve hard bread. Two people in the party decided to share a large pizza (meat pizza), one person had a lemon chicken dish with a salad, and the last was a philly cheesesteak sandwich.  Both the chicken and sandwich were fine (nothing to write home about, though).  The pizza was OK too, but again, nothing to write home about.  When the bill arrived we were shocked to see what the total was.  Keep in mind we had a total of 3 beers and 3 soft drinks at our table.  It turns out that the pizza was $33...which we thought was excessive, and don't even think the menu has that price on it.  We will never pay $33 for one pizza again!  Also, the lack of the children's menu makes this place VERY family unfriendly...if they don't want kids going there, they will be missing out on a lot of business! Also, I realize they pub and steakhouse share a kitchen, but to have the exact same food seems like a missed opportunity.  The pub feels more like a sports bar and they need to have food and prices to reflect that.  The biggest problem of all is they are too expensive for downtown Glendale.  They need to lower their prices, increase the quality of their food and build up a following.  We eat out a lot, and were hoping that this would become one of our regular haunts, but we won't be going back until things get sorted out.  I don't think they are going to get many repeat customers for mediocre food at 5 star prices.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 8,
      "cool": 0
    },
    "photos": [],
    "user_id": "xR10PpF_-irYgQWdcOMS_g"
  },
  "0Jt1JWD_iBCsycqAWLdGnw": {
    "date": "9/11/2016",
    "text": "Awesome place this is our new favorite hang out the food is great they have life size connect four and Jenga and other games",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cpgf_T1RrYsIhrj0HXLp2A"
  },
  "HTrEnPjAWpmmfRKIIzStEQ": {
    "date": "3/19/2016",
    "text": "Really good food, incredibly poor service for large parties. They gave very little attention to a party of 40 people. They have lost a lot of repeat business. Worst attitude I have ever experienced with management. Forced 20% gratuity an NO WAITER! We had to go to bar and order and forced tip?!? Wtf. Like we are doing you a favor by eating here. The guest of honor had food delivered as apposed to eating here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "5sXPBMNx2-08pgEbVo7m1w"
  },
  "31gSVKT1mJEc33MoDiz7Rg": {
    "date": "7/7/2016",
    "text": "Overpriced for what they offer. I was so excited to see what was going to come of the beautiful space but, I was a little dissapointed. There is room for improvement. An easy fix and this place will be the best in town.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SaySYCYrJrG5H6-10VB40w"
  },
  "J7VwnukU_1pR3xyKosUNlw": {
    "date": "2/9/2016",
    "text": "Came here last weekend with some friends. The service was extremely slow. Our server was not attentive at all. The bus boys were more helpful. It took a long time to get both our drinks and food. The pizza was warm but not hot. Some of our wings were still pink. The manager came over to apologize and took the wings off out bill. I will give it one more try and I hope it turns out better then the 1st time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "UgFbhLM02_D8AHjlf5V0tg"
  },
  "usrUp_HuPGjHvVMEiZxOfg": {
    "date": "1/30/2016",
    "text": "My husband and I went to a birthday dinner here last night. We had a large party of over 20 people. From start to finish we had a great experience. The food, service and atmosphere were perfect. We had the the ribeye, mashed potatoes and onion rings it was all top quality! Everyone seemed really happy with their food and how quickly we were all served. When we finished our party was walking over to the outside patio area, the kitchen staff all said good night and thanked us. The patio is covered nicely in lights there's another bar and tons of games. We played for a couple of hours before heading home. I was really impressed with how polite all the staff was. We will definitely be back soon!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "E-WU8naSdYUksobqXqgXLw"
  },
  "KqctbbD9awPsht6Tz6qO4A": {
    "date": "7/10/2017",
    "text": "Two words. .....too expensive! !!!  This is not Scottsdale ladies and gentlemen,  the pices are what one would pay at a hotel overlooking the ocean.   This place is in Glendale,  off the beaten path mind you and wait for it,  a lovely view of train tracks and trashy houses.  The place is huge and, food is subpar and the staff....wow. ...I don't know what to say.   I ordered a drink from a bartender,  or someone who was working behind a bar,  and they didn't know how to make a vodka soda with lime.   Hmmmm....I'm no experienced bartender but I'm pretty sure what I ordered is self explanatory.   Maybe this place is cheap for large parties, other than that, can't see the use for it.  Won't last long,  trust me! Who ever bought this is going to lose a lot of money in the long run.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uRzfmFcpmepQQb_8gEJcag"
  },
  "EvRMqGIqk840FWo6LdAJpg": {
    "date": "5/21/2018",
    "text": "I was so excited to try this place out, but it was a big let down! I came here with my mom for brunch, we were looking for pet friendly restaurant patios, since we were coming from the dog park with my two dogs. We walked in through the patio, It was our first time here. It was a little confusing, we found out that you have to order and pay cashier for food, and drinks you order, that it is self service, ok. So I waited outside with my small dogs outside, while my mom ordered inside, the wait time to order was about 15 min... that's not a big deal, but in the amount of time it took from when we first arrived until my mom was ordering with the cashier, not one person working there greeted us, it just wasn't a friendly environment. Then, I was approached by a woman who worked there, she came over when she noticed me with my dogs sitting on my lap. She scolded me telling that they are a pet friendly, but per state law dogs can't be on furniture. I was a little confused because I was briefly sitting here with them on a cushioned patio chair until my mom came back outside. I responded to the woman that it was my first time here, and I didn't know. I explained, I was just sitting here briefly just waiting on my mom. My mom heads outside, as the woman is still talking. She proceeds to tell me that they are the only dog friendly patio in AZ, I replied that's not True. She told me again dogs are not allowed on furniture, as I was getting up. She thought I was leaving, and told me I didn't have to leave, and I could sit there. All the seat cushions on patio chairs had black ash from fire pit. I explained, I was just waiting on my mother, and that we were moving to a picnic table. My two small dogs were just laying down, they are very well behaved, and weren't causing any trouble. I would never let my dogs sit or lay down on a table where food is going to be, but it was bothersome that I'm just waiting outside on a chair, and I get scolded like a child! I honestly feel like a big deal was made over nothing! The same woman came back over to our table telling my mom she forgot our table number for our order. She was very rude, and very unfriendly! Staff that dropped off food were unfriendly, with no customer service! This is not a pet friendly place. My dogs, and I did not feel welcome here!  It was a very negative, and bad experience, and I do not feel comfortable coming back here, food was just \"ok\". There are plenty of other establishments that have pet friendly patios, that are welcoming with great customer service, this is not one of them! It's unfortunate, because I really wanted to like this place!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9plzR9ytJtFcT6J8xLdQCw"
  },
  "jVOvyvNltxZCXZI-t-n0dQ": {
    "date": "9/3/2017",
    "text": "I hate to give such a bad review for this place as, the owners are such great people but my latest visit was probably the worst customer service I've ever encountered. The new counter service is horrible. I ordered a beer and waited and waited for someone to delivered even though there was 2 people behind the bar doing absolutely nothing.  Both were just standing there.  Then they both left the bar to chat with people. When I finally received it the server put it in the middle of the table and said \" I have no idea who's this is for \" and walked away.  Wow. This would of never happened a year ago. Very disappointing.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NuFKjUFgSMLDMoepWZtC0w"
  },
  "A3I2XmB0fFwU1fQxwFqaRQ": {
    "date": "6/26/2016",
    "text": "Hidden gem in downtown Glendale! Sunday brunch was delicious, huge shrimp, make your own omelette and alot more. Great ambiance and very friendly staff!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "D1pQPVLVqv2yHjr2CEGu1g",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/D1pQPVLVqv2yHjr2CEGu1g/o.jpg"
      }
    ],
    "user_id": "WvKrRF73eiy0WV1751oobQ"
  },
  "5K-PEXpWxrHMWHtoEKqa5A": {
    "date": "5/15/2018",
    "text": "Used to like this place. But it's turned into a self service walk up.  The music was too loud. Went there with another couple. Ask the manager to accommodate us.   \"Nope. Can't. \".   Had a beer and left",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MdXA5C87R7gRBHPz6_-Wgg"
  },
  "A_0WD6d8sPyRpQzpVuyP-A": {
    "date": "4/19/2018",
    "text": "I was there last night, 4-18 at 7p and will say this: GET A NEW BARTENDER! The woman who was working the bar ignores customers waiting for drinks! I stood at bar and she wouldn't acknowledge me, and I was the only one waiting!! She just kept walking back and fourth doing her thing with a scowl on her face!  Finally a younger guy (who I think was new and maybe training) helped me. He was VERY NICE and will do well there. Also, $7 for a draft beer. Ouch! On a positive note, the people I was seated with raved about their fettuccine alfredo. Love the venue, but the service part still needs help!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZzBgxz76VzapGy58-eOPEA"
  },
  "-oldE31sx2wHtKn_OHRLWg": {
    "date": "4/24/2018",
    "text": "The place just opened when my friend and I came in. It was very nice and clean but the prices were pretty high. The beer glass was not cold and my beer wasn't cold either. Nice bartender but may not be back anytime soon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jPy5x1WstUOtKI9x51UQ-g"
  },
  "Fe6MwZ7-lXXo3Fg7L3-UXA": {
    "date": "9/25/2016",
    "text": "Accidently found this place looking for a Brunch, the location is in old town Glendale and cutest inside and outside restaurant..Sat at the Bar and the Bartender was great always ensuring I was ok.. Got the Brunch 19.95, all you can eat. The brunch was a variety of treats, salads, Prime Rib and Omelette bar.. Will definitely go back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sGO-stZSJKX39qzKfUraYw"
  },
  "IN-retxMa_-8ew9wpo7f7w": {
    "date": "4/28/2018",
    "text": "Came here to check out the place to possibly reserve for an event. It seemed great with the games they have outdoors, and pretty relaxed setting. Bit disappointed with my food and drink. Fish and chips with 4 small fish sticks that were almost burnt if not a bit over. It was kinda laughable thinking it just came out of the box but yet so overpriced. My cucumber collins tasted like water and cucumber with a spritz of lemon. I don't know, maybe hubby was to blame for them skimping on my food and drink with the minimal tip he did as he was confused with the self serve for the most part. I did send him along with some cash for additional tip as he picked up my drink...but what a very expensive flavored water that turned out to be. Maybe the other items are good. I really wanted to like this place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PmIW3IvZEUEWEVdc-4VRJA"
  },
  "_Vo9ZYieB8dNQYP7YUfp_A": {
    "date": "11/19/2017",
    "text": "Has potential, it's a fun atmosphere love the outdoor games and entertainment but I personally won't ever be going back and i don't think any of my group of 20 people with will either. Prices are to high for quality you receive and wait staff behind bar is so rude. They act like you are bothering them if you need to order something. The drinks were terrible. If I'm paying $8 for a shot at least give me a full one. Or you want to charge $11 for a Long Island, no problem but I expect it to taste like a Long Island, not a big plastic cup of sour mix on ice. And please, at least serve your terrible drinks with a smile, and be kind to your customers.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xxaUiD9fqLdM5ZGnIOFZJQ"
  },
  "syHP5Vyy1mSViL8eunpzXw": {
    "date": "2/18/2018",
    "text": "I usually have a great time here. Donovan always has a smile and a bad joke for me. Last night however was a whole different story. Sat at the bar and the older goth lady with the bangs( don't know her name because she didn't even acknowledge me) was too busy talking to who ever. It's sad that such a fun place can turn into a bad time all depending on who's working. I left after 1 drink and will turn right back around if I walk in and see her next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "glVSOUm5zrnpLhQEmKCVQA"
  },
  "FnDT6wYOAm1_8vwj9VAaZQ": {
    "date": "4/6/2016",
    "text": "Fire the manager and the head chef. 3 visits HOPING for a satisfactory experience left us wondering how the people running this place got their jobs!  Service in is the worst. Lots of people \"look\" busy but we were constantly thirsty and stayed hungry for too long.  Pizza was burned on the outside and raw inside, and was $35 by the way! Steak was cold on another visit.   Please make this work! We need this on the west side!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "IOvoTh_W52BrcFPI9aWNaw"
  },
  "lvMAPF6mtbndN1EzVe82EQ": {
    "date": "6/24/2016",
    "text": "Best trendy hot spot in Glendale. I can't believe I've lived on Glendale 2 yrs and missed this place! We ordered a pizza and it was thee BEST pizza I've ever had. Our bartender Melanie D was on spot and so adorable. Loved her, loved the atmosphere, loved the food!   I will be a regular here for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hnhOENruqCT9ZzNbwr0aMQ"
  },
  "FycSfCRcfRWukWlxQLN8aA": {
    "date": "2/19/2016",
    "text": "Mycenary on tap, yeah e yeah!   I've been here quite a few times and I can vouch for the wings, salmon salad, and marg pizza...not necessarily all in the same visit though.    Solid selection of beers and liquors. Free games so you can stay awhile. Maybe my favorite Desert Rose spot, I dunno but I dig it.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 8,
      "cool": 7
    },
    "photos": [],
    "user_id": "TQ9A1LVp6z-fIc494RsLDQ"
  },
  "jUArPI9F1aqc5Qw93zMIzQ": {
    "date": "8/13/2017",
    "text": "Amazing food,burger and. Philly cheesesteak amazing ! Wonderful staff and service. Lots to entertain you with live music corn hole tons of tvs for sports",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "arh6gGlnAkszdCvShM5-qw"
  },
  "oa6tJ4LwQ_inRYn2NoRvKQ": {
    "date": "5/17/2016",
    "text": "Stopped in here on a whim one night and my wife. We sat at the bar and had bar appetizers. Good food good beer selection. We need to go back so I can do a more in depth review. Very open atmosphere and they have an outdoor area with bags. Saw kids and older people there all enjoying themselves. I would come back and try some more food options...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uOhTm-DrdulccQqDh1E8aw"
  },
  "GmwdasrVWSyNb06P8vYzVg": {
    "date": "3/19/2017",
    "text": "My friend and I were in the area and had grown hungry from walking around at an event nearby at the Glendale Civic Center.  We had our two toddlers in tow, so we hopped on Yelp and looked for something nearby and new (to us) that we'd never been to before.  Desert Rose popped up, so I checked the \"More business info\" section to see if it was \"good for kids\" or not.  It said Yes!  Excitedly, we strolled over and walked up.  The outside patio looked great, there was a life-size checkers and chess board, plenty of open space, comfy-looking seating areas, and some large tables that people were congregated around.  We decided to eat inside, since we had the little ones and it was getting a bit toasty outside.  We were greeted right away by an employee, I don't think he was an actual host, but he showed us to a large table in the back corner of the restaurant.  We laughed about this, but we were thankful the guy seemed to understand the benefit of being in a corner when you have two toddlers.   So right off the bat, I needed to change my little one's diaper.  I head over to the first restroom area, and there were several private stalls, but each time I opened a door, I'd peek inside to hopefully say \"Aha!  There you are Mr. Changing Table.\" But, not a one to be found in the first area of bathrooms.  I head to the second area of bathrooms, (this place is huge!) and again, a nice row of private restrooms, all very clean I may add, but again---not a changing table in sight.  Frustrated, I lay my baby down on her portable changing pad (at least I had that) on the cold hard bathroom floor, cursing my fellow Yelpers who have checked the 'Yes, great for kids!' box. I then begin to wonder....how could a place so big not have a changing table??   My next goal was to track down a manager and ask this question, but of course, I was sidetracked by the crankiness of my little one - she was ready to eat, dammit!! I head back to the table, ready to check out the Kids Menu.  Surely they must have one if this place is \"good for kids,\" right??  NO.  No Kids menu.  I ended up ordering the Mac and Cheese, since I knew it would be shareable with the kiddo.  I decided to splurge and add Crab to my dish, for an additional \"market\" charge of $12.  The Mac comes out, and the flavor is underwhelming.  My daughter loved it though!   Bland, with a toddler-size portion of overcooked seafood on top... go figure.  Now if anyone has a child under the age of 3 who is reading this, you won't be surprised when I tell you what I'm about to tell you.  Later on at home, I pull out the leftovers since I barely got to eat any at the actual restaurant.  I take a bite of the crab, and it's SHRIMP!! (Read: frazzled mothers/fathers often don't fully absorb details/directions/what kind of protein they've eaten until hours later.)  I remembered from the menu that shrimp was an additional charge of $8.  I double-check the wadded up receipt in the diaper bag - Mac and Cheese, add crab, $22.  Okay, so $18 vs. $22, not a huge deal, but still, IMO, that is quite an expensive lunch for what was served to me (again, a small portion of shrimp atop a bland pile of mac+cheese)  I also think it's maddening that they charged me $3 for a club soda with some lime juice in it :-(   All in all, I may go back again (without child!) to give this place another shot for happy hour, but my expectations for the food will be low (which will probably be a good thing for this place.)  I would like to add that our server was friendly and helpful, came to check on us serveral times, as well as the bus boy who cleared our plates and brought us to-go boxes.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "15XB4juZj8R48IshMOj0hA"
  },
  "SkDztmkOOuDCDz0fBN5Oaw": {
    "date": "1/22/2018",
    "text": "I frequent here during lunch weekdays and occasionally weekend nights when I'm not working. As a bartender myself I have high expectations for drinks and service. I love that I can sit at the bar for hours, even during shift change and not be bored. The bartenders are amazing, make tasty drinks and always keep fun and friendly conversation! Kim is wonderful during the weekdays especially! She always takes care of me, and makes sure to check on me frequently! The owners are amazing, I love seeing them every time I'm there putting in work! Wonderful staff, great food and great drinks!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "r8igjD8sQsVXfsjKr818uA"
  },
  "S6HJdBCzR9BB5Xc7Hi3wfw": {
    "date": "5/30/2016",
    "text": "I'll admit I wasn't in here for more than an hour, but it was long enough to take a great impression away from this place.  First, the beer selection is really good. It's located right next to OTG beer and wine bar(a local favorite of mine) and Desert Rose makes for an amazing transition from one place to the other.  The manager Todd is awesome. He talked beer with me and helped me choose a great bottle from Dogfish Head. This place also has shuffleboard and a lot of comfortable seating outside.  This place is huge. It also has a steakhouse and cigar lounge that i've yet to check out; but it's definitely the kind of place you can lose yourself in for a few hours.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cn-RDjSKQ5xR8HL_8tYXyw"
  },
  "zTfBqZO5tbt09twmPMd-QQ": {
    "date": "2/26/2017",
    "text": "I would give the atmosphere 10 out of 10 the food 7 out of 10 and the service and staff 3 out of 10. Long wait times, management didn't do a good job in training the staff.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "OzETGbgcAn8udzCgzUjp0g"
  },
  "Crhsk3RzMODKIjSWDqEisw": {
    "date": "3/18/2017",
    "text": "My wife and I stumbled upon this gem while looking for a great patio that is dog friendly. Did we score a winner! First the rule of the house is \"dogs get drinks before people.\" Such a great place. The patio is one of the best we have found. Corn hole, giant chess, connect four and jenga along with ping pong. The beer list is solid and from what I was told by the couple next to us it changes every couple days. The food was great, especially the Brie Crisps with red peppers. They also have prime rib sliders. THANK YOU SIR CAN I HAVE ANOTHER!!! Our waitress was so cool. Heather you rock and your service is on point! They also have a great outdoor stage and beer garden with live music almost every night. We will be back many many times. Thank you Desert Rose for a great afternoon of music, food and drinks with our puppy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5M-xmyQ2ZncozUR2piwbBg"
  },
  "8ZEQK0PoMWb21Vqpifcicg": {
    "date": "4/24/2016",
    "text": "First timer and Im in awe! This is the neatest cleanest most awesomest place ever! Staff is friendly & informative! My new fave spot live music, sport showings, & bucket o beers specials! Breakfast buffet & mimosas! Separate cigar bar outdoor gaming & dining! Just come here and see for ypurself!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oXybrvlP2dB5fUkwjAR4Tg",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Bucket o beer minus 2",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oXybrvlP2dB5fUkwjAR4Tg/o.jpg"
      },
      {
        "img_id": "mXaoGHZfd7UDWHcP8-Kpkg",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Menu....",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mXaoGHZfd7UDWHcP8-Kpkg/o.jpg"
      }
    ],
    "user_id": "_m2DXqlEF2DOXXjDVz_EAg"
  },
  "hW_i7BxlWqxP6LJ96sdy0Q": {
    "date": "1/16/2018",
    "text": "We were going here with a group of friends.  We called ahead to reserve and area and they wanted $150 deposit...we skipped that idea and just showed up.  Pizza not good and tasted like a frozen pizza but the wings were good.  It was pretty pricey for the area.  They had special prices on beer buckets and wings yet none of the cashiers were aware of it.  We had to get the manager to honor their deal that was posted on Facebook as well as all over the bar... The outdoor area is awesome!  There was a DJ playing music, corn hole, large chess and checker board, ping pong, large connect 4 games, jinga, pool tables, shuffle board, and more.  We had a blast.   It's a little strange because you go to a cashier to order and then someone brings you what you order.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bBxnCK6-2kkaml6SPj4JCQ"
  },
  "9qxFmRI4HKHX6GR89FqcSg": {
    "date": "12/30/2017",
    "text": "Fun atmosphere, there is indoor and outdoor seating.  All types of tables, bar, high tops, couch sectionals with heaters for the evening.  Music, corn hole, chess and plenty to televisions to watch sports.  Plenty of parking too  Menu is large, we went for their burgers - bbq burger excellent with a fresh toasted bun.  Burgers are large, expect to take home leftovers.   Onion rings were delicious.  The pizza and calzones on a nearby diners table looked very good.  I will plan to try their pizza on my next visit.       Staff is very friendly, they work s a team.  Easy going and helpful.   You order and pay in advance and they bring the food to your table.   Great for single diners to large groups.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zXFxTj-vAgWx7oqxygel6Q"
  },
  "GvETv7ft6ApIu-SGX6-Bsw": {
    "date": "3/4/2017",
    "text": "This place is incredible. If we could give them 10 stars we wood. 1. Food is awesome and reasonably priced. 2. The drinks are fabulous. 3. The staff is incredible.  Kind. Attentive. Sensitive.  We originally came to celebrate a birthday of one of her friends the food was excellent the service was awesome certainly five star quality but the best part was unfortunately one in our party we can to choke the manager Kyle was incredible. he took care of everything as our friend was given the Heimlich maneuver. Kyle immediately manage the situation. he brought compassion and and kindness.  A few heartless patrons were put off by a choking person.  Kyle and Elenor, our waitress made up for their callousness with compassion. All in all we will be back.  Many times.  Kyle and Eleanor; thank you so very much for making a scary situation less intense.  Thank you for adding a little humor and compassion. our night continued in a jovial way because of your hard work, service, and humanity.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "qdnFbywyGNoULuOkz5WvXQ"
  },
  "184nIgE1qkisWakeoSBJow": {
    "date": "8/30/2018",
    "text": "Great place with good vibes & personable staff. Mary the bartender along with Ortencia the manager showed a hospitality like you were coming to your own home. Johnathan the server showed A+ service with his professionalism & attention to detail. Wish I can give this place another star. The employees really make this place a cut above the rest.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2N94mgcOs2e1GpS70DN74Q"
  },
  "6Wcyk7Jw7MQl8JR5KSG2PQ": {
    "date": "3/24/2017",
    "text": "This was interesting how I ended up here but I did not end up on this side of town to eat here originally. We got here just as they opened at 11 and it was quite confusing as to were to go we we just entered through the open gate which led to a great looking seating area outside under shade. We bumped into an employee which gave us a run down on the three establishments on one property.  This recently Renovated welding yard was turned into a steak house, a pub and a cafe. A lot of money was put into this property and it shows. We went to the pub portion and was seated and we looked at the menu. Prices were not cheap but when they brought the food I was greatly impressed with my French dip sandwich. Does it taste as good as it looked? YUP!!! It was 15.00 dollars and I feel it was well worth the money for my environment and quality of food. Live bands every night! Shuffle board in bar area  Nice fully stocked bar Friendly staff!!! Great food   Yes, you need to try this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-aM2f5hkyoBKeqpvw8MlmA",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Pub entrance",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-aM2f5hkyoBKeqpvw8MlmA/o.jpg"
      },
      {
        "img_id": "mIgLbPas7xzmzQQKwJe6cA",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Pub entrance",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mIgLbPas7xzmzQQKwJe6cA/o.jpg"
      },
      {
        "img_id": "Tcd3N9KrHT58cZN_XM2l9A",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Steak house entrance",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Tcd3N9KrHT58cZN_XM2l9A/o.jpg"
      }
    ],
    "user_id": "cHqmmzGKl6yXmklRRRzYLw"
  },
  "hKxdiyFQIeNO-VY1JD7j7Q": {
    "date": "10/1/2017",
    "text": "It gets 2 stars because the pizza was good. That is where the good stuff ends. You cannot open a tab. No table service. No service at all pretty much.  Only a few staff and not sure what they were doing.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "6mEKyRW_poayn9Zuz3IE_g"
  },
  "uMxvFcPxOUK1CIWPmNVtJA": {
    "date": "2/2/2018",
    "text": "There was no wait staff. There was a message on the table to see the bar tender for menus and to order food. Is this a fast food restaurant? We left without dining.  There is steak house next door. The food is priced like they are serving prime grade beef in a class atmosphere. The beef was at best commercial grade served in a warehouse atmosphere.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jOFMr_4TYsa-fPxpJNBtKg"
  },
  "aIAjR1NHFhGnXrtg23kNLw": {
    "date": "6/18/2017",
    "text": "This place is awesome!! Good food good atmosphere and the cigar lounge is amazing!! Thanks Larry!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IbHgyYmN_OK2NjSPTaGzqA",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IbHgyYmN_OK2NjSPTaGzqA/o.jpg"
      }
    ],
    "user_id": "IEvdmZLbQP2KFfX9eipZRw"
  },
  "opCymFq9DkHYlEHaFHu8dA": {
    "date": "11/9/2017",
    "text": "We had some pretty awesome food and beer here! The staff is friendly and the place is huge. You do have to place your own order at the register so if you are looking for a more traditional restaurant for the night this probably isn't the place. They have a ton of TVs and plenty of different events going on every month. The pizza and artichoke dip were amazing and I can't wait to go back and try some new things.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "sR68vEBs90HTKR2OHIyLMQ"
  },
  "xFqVeIFueADg0LIIhG0PJg": {
    "date": "8/25/2016",
    "text": "The atmosphere was great and the service was great. The food however was a whole other story. It is overpriced for what you get. I ordered a meatball sandwich, it came with two meatballs and a bit of sauce and fries for 12$. I could have received a better sub at subway with more meat, chips and drink for less.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "YtZl1LIZWWZ2YZbBM2OgLA"
  },
  "r-K3ZfrHwFR8sGbGR-YrKA": {
    "date": "8/18/2017",
    "text": "The food is great, but if you're coming to this pub to knock back a few beers, it's painful. You can't keep a tab open, so you have to make individual purchases. Fix it!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "GfOrWmRxX92kBNb0c-OH_A"
  },
  "97uEl6iafUbU8XrXoeNpwg": {
    "date": "11/18/2017",
    "text": "Update! Our heartbeats only grow for our new favorite place in Glendale! Ask Donovan to do his Christopher Walken impression... Out-STAN-ding!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "phXdwsXuRIE-rR4PoT_2gQ"
  },
  "QFJIGgW6IFyLxk9oM-JcXg": {
    "date": "7/18/2016",
    "text": "Really wanted this to be great!!!! I love downtown Glendale!!!! Went for lunch today. Greeted and seated fine. This was a casual business lunch. Ordered Diet Coke... FLAT . Music level went from 2 to 10 for no reason... Eventually lowered back to 2. Ordered lobster roll.... It looked good. Brought it up to my face and it reeked of a fish odor.... One taste said it all... Not fresh... Server picked it up and replaced it with a Philly Cheesesteak. When she came back she explained that some lobster just stinks like fish...WHAT???? She said she tasted my sandwich and she thought it was fine.... Guess the customers are wrong!!!! Cheesesteak had no onions, no mushrooms and came with horseradish. HORRIBLE!!!!  I thought their steakhouse was bad... And it was. This is worse. Forgot to mention paper menus that looked like hell.  Avg ticket has to be $15 and you can't have real menus???  No BUENO",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "SgoEwA8InG_1D9fgYbNbqg"
  },
  "_UB99UQihi3prihniwpWkA": {
    "date": "5/6/2016",
    "text": "This place will be our new hang out spot!  Love the atmosphere and the ambiance! Thank you lover for taking my mother and I here for a voluptuous dinner and drinks!  Much thanks to our waitress, christy! She was AWESOME!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DVNTAzwXgIYqutWGe4tdvA",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DVNTAzwXgIYqutWGe4tdvA/o.jpg"
      },
      {
        "img_id": "MR9sW2J3lA7MiES3rnRYKQ",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MR9sW2J3lA7MiES3rnRYKQ/o.jpg"
      }
    ],
    "user_id": "DeH7ggFPYmCVqFc7MyyLAQ"
  },
  "e3TVAGwRw3EtnePlOYYhrw": {
    "date": "8/23/2017",
    "text": "In the past I would have given this restaurant 4 or 5 stars but not anymore. Recently, the restaurant has gotten rid of any waitress help for the lunch hour. You must order everything at the bar including refills and bring it back to your table. This restaurant isn't set up well for this, and it just doesn't work. We were doing company lunches here 3-4 times a month and unless it goes back to having lunch time staff we won't ever be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xp-jpL80hIgFHLijbcmhJw"
  },
  "UQphEa9QF6qvqolWTJcwTA": {
    "date": "9/25/2016",
    "text": "Awesome place! Ashley our server was kind enough to special order a pizza for us,half margherita and ricotta with brocolini in white sauce, my fiance choice and I have to say, good choice! Also, our little one wanted fruit, and Ashley was kind enough to make him a little fruit plate, he was very happy!  Amazing! Great place for families and amazing cigar lounge as well! Devin, was kind enough to show us around and educate us on the types of cigars that the cigar lounge had! We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "s-NVxJtgcqrseHh3oju3og",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Customized half red and half white sauce pizza, margarita and ricotta with brocolini!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/s-NVxJtgcqrseHh3oju3og/o.jpg"
      },
      {
        "img_id": "VWnnvTg5tGfy4nyR2QxvlA",
        "caption": "Photo of Desert Rose Pizza &amp; Gastropub - Glendale, AZ, United States. Awesome job on the customized pizza, and making a little fruit cup for our little one!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VWnnvTg5tGfy4nyR2QxvlA/o.jpg"
      }
    ],
    "user_id": "XG8l6-AZKkBsyvDUzvDC-w"
  },
  "3bhp1D6xlp16rNiyf6KKUg": {
    "date": "9/30/2017",
    "text": "They changed their payment system which is pay as you go.  So if you are drinking at the bar you pay for each round which is annoying.  Their staff need food safety training.  Saw the bar back cutting strawberries with her bare hands.  Also saw one of the wait staff use her bare hands eating out of the drink garnish caddy.  She also, with her hands, pick up some mint that fell off the top of a drink and placed it back on the drink.  It had fallen on the gross black mat the completed drinks wait for service.  This place is gross!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ynB2LYRYV_tOuvgn7WWtNQ"
  },
  "6uXfqHSnK4yyHVa5Zffb9Q": {
    "date": "6/15/2016",
    "text": "Cool venue, nice patio. I love refurbished old warehouses. I probably can not really add to what everyone else said. It reminds me of the Yard a bit. I had the Philli steak sandwich, with fries and a side salad. The salad was a bit bland but maybe that was my dressing choice. The sandwich was actually very, very good but be warned very, very messy! Lol. Have lots of napkins close by. My friend said his Cheeseburger was very good and very messy too. The fries here are very tasty. The place is costly though so not sure I will be back often. I would however like to try the steak place next door. The menu is so eclectic. Lots of cool choices for food. The patio will be nice to sit outside and have some beers and play some games. Lots of TV's in the place and a cool looking cigar bar. They also have live music planned. Lots of fun check it out.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "dEk7mXM4npuDPmxrwPcEgQ"
  },
  "0MxArBD2uRF9dh8r6xcraQ": {
    "date": "10/3/2016",
    "text": "This is by far one of the best places I've been to for brunch and football. Great open patio seating with plenty of monitors to watch the games on Sunday. With a great brunch Buffet and stellar prices on drink specials. The food in their brunch buffet is a good variety of flavors. Easy to satisfy all members of the party.   Solid recommendation for this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vui1ZBzhFk3zhVXqSNcPGA"
  }
}