{
  "F0vqF55RHucwscVyYoQ7Rw": {
    "date": "1/3/2017",
    "text": "You can feel good when you eat the food here. The people that work here were really super nice and that was a good thing considering how busy they are. They move people in and out fast but are super friendly doing it. I did not feel rushed and I really like the BLT I got.  Yes the food here is really good but I also really like friendly people.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z9xOAbElyehjVETxExWvpQ"
  },
  "RFbJ1_OIgv00tm6Zb3Vlng": {
    "date": "3/3/2015",
    "text": "I want to say that the people here are amazing. I was keeled over on the airport floor next to the bathroom (due to food poisoning from mexico), and the manager at wildflower bread company, Lauren, noticed me and came to my aid. She gave me water, checked up on me, and eventually called the airport medical team for me. It's so rare you meet people who care about the well being of strangers, but she is one of them. I'm sorry to say I couldn't try the food, but sometime what makes a place great, is the people. And I'm sure her care for others reflects in the food they serve, and the company they run. Thank you Lauren! -jennifer",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 4
    },
    "photos": [],
    "user_id": "g7nuu1skAJIaL83_-7rKAg"
  },
  "Jni6jf22AAs6VNVddcGSzg": {
    "date": "6/3/2016",
    "text": "Although I almost missed my flight because of it and had to run across the huge Phoenix airport, I walked almost the whole airport before choosing takeout from Wildflower. The guy working the counter was so nice! I wasn't sure I wanted to eat there or what I wanted. However, he was very patient and kind. He let me try a sample and answered any questions I had. I finally decided on a cauliflower masala vegan soup. It was a bad choice for a flight but yummy for my tastebuds, ha, ha... It did stink up the flight cabin, though. I also got a half sandwich of the turkey brie on challah bread. I was pleased...except for almost missing my flight, ha, ha... For airport food, this was fabulous--customer service, taste, and creativity.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "g86couR6Jp0zkActZmZzTA"
  },
  "E2ReXpS_xzusBq2Gu6S-vQ": {
    "date": "3/17/2016",
    "text": "For a vegetarian person it was awesome sandwich. Customer service is super cool. They emailed me receipts when i forgot to collect.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bZtcFbjhfvaJwy9Nza7pEQ"
  },
  "ZcYFMIk0XRqcqz13lId9GQ": {
    "date": "12/22/2014",
    "text": "Taking a red eye flight out of terminal 4, I was very glad to find this Wildflower store open 24 hours next to my gate. The staff was very nice, but they not prepared for the rush of Christmas travelers after midnight. They had salads, not no salad dressing. They were out of soup and sandwiches and I felt lucky to get their very last bagel. I also picked up blueberry muffin. Each were around two dollars, which is pretty reasonable for airport food. Both were very tasty and large enough to hold me over until I got to my final destination 10 hours later.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "l-B4axUNxQ9FVVxeQm8t2A"
  },
  "76C7LwWR7KsAW3mXWY0MlQ": {
    "date": "8/27/2015",
    "text": "Stopped by for a cup of coffee on my way out of town. Sitting on the plane I finished it and my last gulp came down with some kinda of nasty string and nasty pieces of I don't know what! Disgusting. How can this happen? I'm on the plane now so I can't go back.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cl-FoGf3G-eh82NMl2aSug",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. A close up! I almost puked!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cl-FoGf3G-eh82NMl2aSug/o.jpg"
      },
      {
        "img_id": "5xVbGW_tu3YMVOSG-QIrFQ",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. Nasty string or who knows ugh in my coffee! Disgusting!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5xVbGW_tu3YMVOSG-QIrFQ/o.jpg"
      }
    ],
    "user_id": "txMLWhO9pEltisUDSxGvTA"
  },
  "lvy9UrdXBdLYRoRIawkgHg": {
    "date": "7/3/2015",
    "text": "2 stars for the food  1 star for the customer service  Lady with curly reddish brown hair kinda chunky was working the cashier and yelled at her coworker right in front of 3 customers. Very rude to the gentleman in front of me and to my boyfriend.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TIOjUpviICVRiSibNo2fUQ"
  },
  "JoS4w3_r9rzzQeYbW5KlUw": {
    "date": "8/18/2015",
    "text": "I was so glad to find a cafe that offers healthy meals using super fresh ingredients right in the airport terminal!  It certainly brings a breath of fresh air to airport dining scene.  Everything is made fresh that day including the bread, sandwiches, salads and soups!  All at a good price point.  I ordered the basil mozzarella panini and a side of quinoa salad.  They were both delicious and the fresh ingredients made a huge difference.  The service was excellent as well!  Overall, I highly recommend this cafe if you're looking for reasonably priced fresh and healthy dining options at the airport!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZQZC755A7rQJBseeJhqPyg"
  },
  "o39KsQ3msZNDkAZBhfjICQ": {
    "date": "2/14/2017",
    "text": "Great healthy airport food. Very creative, I had a chicken quinoa salad! Upbeat staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bY-lz00_63iTmKq8lbVs7g"
  },
  "aATfFCKgjDSX-ioNZZElIw": {
    "date": "10/21/2016",
    "text": "This place always has the best food and the friendliest most efficient staff.   No worry about lines, they get you in and out fast and on your way to your flight.  No stress!!!  They have it down!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bCb7g0C_yiZsaa7_-LJ0vg"
  },
  "uTYqPedxOgV4aprrqm_VcQ": {
    "date": "7/19/2016",
    "text": "I'm surprised as to how good the food is.  I ordered the Asian chicken salad and was nicely surprised.  Service was also quick.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "6vu9sE4gK84CBWqwlm4sQQ"
  },
  "iclBiakduJkMfZaI2TkRBQ": {
    "date": "7/13/2016",
    "text": "Greeted warmly by the staff, I was overwhelmed by customer service. Happy, friendly faces and a can do attitude. The cookie was great too!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F2sLIivlEBX6zcieLw5B1A"
  },
  "ggFXySDaj00bH2VS_sRpAg": {
    "date": "8/18/2015",
    "text": "Quick Review: 4.4/5 Food Quality 5/5 Convenient, 4/5 Price  If you are searching for healthy food at a reasonable price in the airport, I recommend going to Wildflower.  I had my salad in 5 minutes.  The food is fresh and good",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BAuJZ3LRZ-cfFPqXeRYRZg"
  },
  "4n10Ua8hPoLhyjEx8386ig": {
    "date": "9/2/2015",
    "text": "Decent airport food that's not the same as the rest.  I had the chicken BLT....not bad. Had some sort of zesty guac on it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qAuZ9Qi7iSqukH40iQdWXg"
  },
  "8xT0y9m6uQfi_ybwXsCutA": {
    "date": "11/21/2016",
    "text": "Chipotle egg sandwich was great. Fresh, tasty and quite healthy. The pumpkin soup was also very good.  Coffee, however, was disappointing. I ordered Americana, which is the True test of the unmasked coffee quality. Their coffee was way too weak, similar to MacDonald quality, not anything like that of a good coffee house (but priced the latter).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l-JjJ67HgJuqczENb2lfLA"
  },
  "wdKwkJsA9Ei7D5KD0JVWYQ": {
    "date": "2/5/2015",
    "text": "The Super Greens Spicy Chicken Salad is probably the best salad I've had in a long time. Surprised it's in an airport. I highly recommend this when in Skyharbor Phoenix Airport.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XtwW0E4prnhPl2UWXLhq8g",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. If you like dark greens with rich bold dressing and chicken mixed in for added protein, don&amp;#39;t miss it.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XtwW0E4prnhPl2UWXLhq8g/o.jpg"
      }
    ],
    "user_id": "hk0gGac5w6iii9PkjNmcZg"
  },
  "9dLgMUVap6tRsknMhg_poA": {
    "date": "11/3/2017",
    "text": "The food was excellent! The staff went above and beyond to be helpful on a busy morning. Unfortunately, since this is an airport location, it doesn't have all the breads, baked goods, and specials a full storefront would have. It's still one of your best bets for PHX airport food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d0YW5HllAsTt51SgY1qRqA"
  },
  "x9TZniZoVdq4Wyx77PB2iQ": {
    "date": "5/23/2015",
    "text": "Healthy yes. Tasty meh. Small portions. Ate my whole sandwich in about 5 bites. Big bonus though for being 24 hours.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TAzGPFt9x99JCYWtDmZDWg"
  },
  "o5uBeeZj7DqIXkpfDiH_Rg": {
    "date": "12/9/2014",
    "text": "This place is wonderful. Not only did they accommodate my post-breakfast, breakfast order, but they did it with genuine friendliness.  Every person I encountered here was pleasant and friendly. The store is clean, there's a large variety of options and the food is great.  I hope they will open locations in the other airports I frequent!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2vT5wzBqaHu6LWFitZtdTQ"
  },
  "luCSoNyLoTL4-ybLmXJDEQ": {
    "date": "12/26/2014",
    "text": "Seeing healthier and vegetarian friendly options is always a relief while traveling! I had been to other Wildflower Bread Company restaurants before, but I think this was my first visit to the one at Sky Harbor. I love it when places tell you on the menu if soups are vegetarian or not, always a big help to me. I got the half vegetable soup, and half brie tomato and pesto sandwich. The cashier was nice, no issues there. Was irritated though that I could not get a half salad. Both my mom and I wanted half salads, kinda sucks we could not get them since other places have that option available. Another downside was that it took forever for them to get us our food. My mom ordered like 10 minutes after me and still got her food before me. Like all I got was a cup of soup and half of a simple sandwich! The lady called my name and i got all excited..just to then have her say \" your food isn't ready yet, it will be soon\". Like you couldn't have just walked up and told me that instead of getting my hopes up? But that isn't a big deal, was thinking out of hanger haha. The soup was pretty good, I enjoyed it, not amazing though. Felt the same about the sandwich, felt like something was missing. I did like it though, just was not quite as good as I had anticipated. My Wildflower Bread Company experience was not terrible, but it also was not amazing. I'd like to go to the location I live near to see if it is better than the airport one, which I would imagine it is!",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "18qEoFOVEernpVLh97PQPQ"
  },
  "aypxym5A5JEMfzBjIrH0wQ": {
    "date": "4/3/2018",
    "text": "I ordered the half soup and sandwich, choosing roasted red pepper and smoked Gouda soup, as well as a turkey tomato and Brie sandwich. The soup is amazing, I would like it to be thicker. The sandwich accompanied with a very strong mustard was a little too overpowering. It would be better if the sandwiches were made as they were ordered rather than pre made because the condiments do tend to make the bread soggy. Otherwise for a location serving at an airport not too bad. And very affordable.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hI97TDGWBR-BepEqN071tQ"
  },
  "i_oj6F0Z9IrIR8pbN2spdQ": {
    "date": "7/4/2018",
    "text": "The quinoa salad was AMAZING! I'd order it again, and again. The service was so fast that I almost didn't believe it. The cashier could've used a little touch up on customer service; nothing bad, just not very welcoming.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ihByGwx4YyZ3ZItyKrvQAg"
  },
  "gYrP4ulQ-loBzRAsqjigPA": {
    "date": "1/10/2018",
    "text": "Clean simple food, well priced, good choice, well priced, has seating, staff very courteous.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "j9bZjGexANfDGTOc2ipiLA",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/j9bZjGexANfDGTOc2ipiLA/o.jpg"
      }
    ],
    "user_id": "wRpQ8KUtnH0V6fphE7eZow"
  },
  "pMRr5rZUzC5ggNiMFw1Fxw": {
    "date": "5/25/2018",
    "text": "Yum, yum, yum! I couldn't believe how good this place was (and that's not just compared to airport food). Everything tasted so fresh and their customer service is above and beyond. The employees comped me when my order got lost. Unheard of to have cheerful and kind airport employees. I so wish Wild Flower was near me in California. I'll be excited the next time I have a layover in Phoenix.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ye4pRgX3bDIOLh27REUdwg"
  },
  "CoD_gNXCUJVqCoTPCoeqQg": {
    "date": "7/24/2017",
    "text": "I love their soup,salad and scone!! They are so friendly and care about customer! You should stop by,if you are in PHX airport!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Z2Ex78S4orZ0A9ZXY8_zQ"
  },
  "4k59WaoEVffvsaxhjsQFVw": {
    "date": "2/10/2017",
    "text": "So I missed my connecting flight to LA and this was the only place still serving food! Someone at the taco place recommended them \"their food is better and they are still serving\" they said, and I listened :)  The staff was fast and friendly, my order (wig special instruction) was executed perfectly. I hung out for an hour using up my entire $12 voucher from American Airlines. Maybe missing my flight wasn't so bad? There's a counter top with plugs and USB for charging (lots of plugs actually).  Finally, the food was awesome... healthy and pretty cheap too. I like how healthy it is (except the deserts). The menu is large, don't judge it by what's in the display case only, there is so much more :D",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6bq7JGjuoA2E-rcJ0VAwUA",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. USB charging and plugs so you can power up!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6bq7JGjuoA2E-rcJ0VAwUA/o.jpg"
      },
      {
        "img_id": "KYvkWjQEwqOP4OxWNCtdQA",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. People love this place, they serve late (shot taken at 10:40pm when I missed my flight)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KYvkWjQEwqOP4OxWNCtdQA/o.jpg"
      },
      {
        "img_id": "9NBD5dkQqka_pUqY02BZ0w",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. Vegan mushroom veggie soup, very good... one of the four daily choices",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9NBD5dkQqka_pUqY02BZ0w/o.jpg"
      }
    ],
    "user_id": "GTc_v4TRMk09HHeOkzeu_A"
  },
  "_HEmkxOVHnXzB2bUYJeRMQ": {
    "date": "4/18/2018",
    "text": "Had an excellent experience! Not only was the soup and salad delicious, but also the service was GREAT! Samantha went above and beyond to ensure that my dining experience was something to remember. She was pleasant, very helpful, and made my time at the airport ENJOYABLE!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kAOAntJRpTevNvjwf8aGNg"
  },
  "H3NJQIDvD-0MjElA3NE1Lg": {
    "date": "11/16/2017",
    "text": "I look forward to my morning flights out of PHX because it means I get to grab breakfast here. The staff is always smiling, the coffee is hot and delish, and the food is fantastic.   I had a mocha and the spicy chipotle egg sandwich for breakfast before a flight home. Best damn breakfast sammich I've had in a very long time...and I'm a girl who knows her breakfast sammies. Grab a bite and a coffee here, you won't be disappointed.   I would post photos but the sammich was gone before I thought to. #noshame",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cRs49OYxxoM4agO1I7gnYg"
  },
  "r58uSbFLvjYXZzwYseE9Uw": {
    "date": "6/12/2017",
    "text": "Not to bad of a egg sandwich eggs were fluffy and the bread was soft and flavorful a little pricey but it at the airport so not to bad would try it again in town",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kbfpED-6FURIsNlsAXqc2g"
  },
  "K6E2B7jJIMwFVxkDfaLZMw": {
    "date": "3/13/2015",
    "text": "Needed a healthy place to eat at the airport, which is a rare find. Although the Employee who I encountered was rude when I ordered, the food was pretty good. It's a small place with limited amount of tables.  I got the Vegetable Quinoa Salad and it was pretty good, but not as fresh as I wanted it to be. The dressing has a nice lime flavor to it which makes it taste better. They give you one thick slice of sourdough bread with it, which was pretty good too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4i-eRGTdxbLvkrmJP8IDlw",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. Vegetable quinoa salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4i-eRGTdxbLvkrmJP8IDlw/o.jpg"
      }
    ],
    "user_id": "nuI-SoswDI6KhS1BAwAu4g"
  },
  "iDLHJsubQXRaLHPqb_1eIw": {
    "date": "6/7/2017",
    "text": "Wildflower Bread Co recently catered an event I worked at and I knew I had to review them! Not sure where to start and I am admittedly writing this knowing I can review all of their items because I sampled one of each (this mistake totally derailed my diet)- they were just that good. Tried the raspberry cream cheese croissant, chocolate croissant, blueberry muffin, low-fat chocolate muffin, chocolate chip scone, cranberry scone, morning glory muffin, turkey and brie sandwich, ham and swiss sandwich, tuna sandwich, chocolate chip cookie, cranberry oatmeal cookie and coffee. Wowwwww that's scary writing all of that down. Highlights are the Chocolate croissant and morning glory muffin. Both were phenomenal and my top picks. The morning glory is like a spiced muffin (almost like carrot cake or pumpkin?) idk but was delicious! The blueberry muffin and raspberry cream cheese croissant were both amazing as well. The scones (chocolate and cranberry) were both good- don't get me wrong, but I liked the other much better. Scones seemed a little dry and crumbly and not as sweet as they should be. Coffee was great! Chocolate chip cookies were phenomenal, huge, moist and basically half chocolate- just how I like it, Cranberry oatmeal cookie was alright, but I'm a huge chocolate person so thinking the choc chip cookie downplayed it.   As far as sandwiches- the turkey and brie absolutely knocked it out of the park- wowwwww so great and the mustard!!! The mustard. The mustard is phenomenal, super grainy and really flavorful. Definitely tastes house made. The ham was also super good, tuna I wasn't super wowed but still decent.   Overall this place is absolutely great, not a Panera copy cat at all, seems very self made and has a selection not like any other bakery ive been to. When I'm back in Phoenix, this is the first place I'm coming to!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hL327vQ6JIANtQWGCEZHMw"
  },
  "EAk3dQpydDl09C7vRUKg3Q": {
    "date": "10/29/2018",
    "text": "A lady named Tracy met my group in line and recommended the Spicy Chipotle Breakfast Sandwich, it was phenomenal! Great sandwich! Thanks for the recommendation Tracy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i_r9M5GchFVeeFZ0MLdrCA"
  },
  "o_s8-2bbPA4Z7wuOUe9CsQ": {
    "date": "4/29/2018",
    "text": "Very good for the price. They took care of my wife's particular need. The Spicy Cuban was very good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "78LpXnTDXEn1AeoISwfnGA"
  },
  "-Y1iHZxJUkTLPcDJGoqqnQ": {
    "date": "8/7/2018",
    "text": "Just a note to compliment Wildflower and particularly Samii at the American Air terminal at Phoenix Sky Harbor. Great food and a smile goes a long way when stressed out from the whole flying experience. THX",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cK3XU8pqbWS7MK6Tn53rNg"
  },
  "S5_-85oLO1pJrSDKoJ19Eg": {
    "date": "8/8/2017",
    "text": "Very good 2nd Time there basil pesto sandwich vert good there coffee well be going as I pass thought next time",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nl30G4QAAsFfCBGvre7LIg"
  },
  "6WjS0HEdBIsVEdej9rJ_tw": {
    "date": "10/7/2018",
    "text": "This place is amazing! I was having so much trouble deciding what I wanted and the lady offered to just make something for me and it was amazing!! They're all so friendly and I really recommend you go there. They have a diverse menu and their fruity smoothies are good too",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kkUV8I_VqSUILAydYolRZQ"
  },
  "NH-1XNXvVWdsiRCen2KtHg": {
    "date": "1/25/2016",
    "text": "Everyone is super friendly behind the counter and loved to explain each thing on the menu.  Seriously, though, in all honesty - I REALLY needed coffee this morning.  \"So\", I asked, \"is it possible to get a few shots of espresso, on ice, black, unsweetend?\"  - I got a vibrant... You GOT IT!!! She offered up on of the luscious, buttery happy treats in the case - screaming my name and wanting to get on the next flight with me... but i politely refused and a gal gave me a huge smile rang me up - we will get that for you right away!!!  Seriously? totally makes your day when people are nice. I bet the people who work here are only hired because they are positive and energetic - They are awesome.. not some downers. Kinda glad I didnt walk a mile to that other coffee place.  The coffee was great, too. I would love to have tasted this coffee cold brewed (didnt see it on the menu), just to really know what it taste like!",
    "rating": 4,
    "rated": {
      "funny": 15,
      "useful": 17,
      "cool": 16
    },
    "photos": [],
    "user_id": "fkdHGcAkrSAnBrtgdc6rQw"
  },
  "7ofrwsTA3QxHviXA9ZdYJg": {
    "date": "8/6/2017",
    "text": "Treated like a star while wearing a tanktop at 12:10 in the morning feels good. Fast, polite, helpful... the staff was bomb.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C-RSP_4NgG6kJmtocjR5Rw"
  },
  "8SA4G6u99JSHnETVwNrs9w": {
    "date": "3/3/2016",
    "text": "Was really excited to try this place after all the reviews as I needed to grab lunch before my flight, and as you can see from the photo, my bread was grilled way too long so it was super hard and oily. The fillings were minimal and regretted not getting Panda Express next door.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "y3MhRDrNvvwQCizlLOjM_g",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. Wildflower grinder",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/y3MhRDrNvvwQCizlLOjM_g/o.jpg"
      }
    ],
    "user_id": "iCYMf_sHRevmzWg8la-LVw"
  },
  "UfPwW0Jz4KPHzRnH6bNcXw": {
    "date": "10/3/2017",
    "text": "This is my favorite spot to grab my morning coffee and pastries at Terminal 4.  Jonastine Garcia always greets me with a smile and goes above and beyond to ensure her customers are satisfied! She's an example of what customer service truly means!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JYbOLbbsl6iEVwXOJMKdvQ",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JYbOLbbsl6iEVwXOJMKdvQ/o.jpg"
      }
    ],
    "user_id": "rHPmsmSbaMdSqOGrOna_2Q"
  },
  "bRdWAJekwGilTW7iCu9Pvw": {
    "date": "7/18/2018",
    "text": "Had a great turkey, tomato, and brie sandwich, and a delicious cup of spicy roasted red pepper soup.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "7mMIG8VMV4yk-r116PLlZg"
  },
  "8YIc6Pzc41l03aixSsVZcA": {
    "date": "8/8/2018",
    "text": "I am at terminal 4 waiting for my 83 year old father to arrive, the plane has been delayed a couple of times.... I decided to get some coffee at Wildflower Bread company. Rauel was pleasant, upbeat and polite. He has such a great attitude. He made me a fresh pot of decaf AND he had almond milk. Turned my night around... His persona makes him a valuable employee. Thank you Rauel!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-IJ4C06PI1yfPdrNCcSj9Q"
  },
  "VW7Y3rCdsogF3g2uw6vE_w": {
    "date": "10/25/2018",
    "text": "Amazing service by all the workers here. It was a refreshing and satisfying experience. Despite the heavy airport traffic, they were swift on their feet and quick to get people in and out. I ordered a wildflower cappuccino and steel cut oatmeal. Both were delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OlyFXW8Vezw-LUJcym_b8g"
  },
  "BX2YEwDCKiXiFitS8ParVQ": {
    "date": "1/1/2018",
    "text": "EVERYONE: Airport food is bland and overpriced. WILDFLOWER: Hold my artisan, fresh-baked bread.  Okay, so Wildflower isn't gonna change your life. But there's a good chance it'll change your travel day for the better. And that's saying something.  This place serves genuinely good (not just airport-good) food, made with fresh ingredients, and some actual TLC.  I got the Cuban, which I dare say was up there with the best renditions of the sandwich I've ever had. I was skeptical of the \"imported Brie\" (Brie on a Cuban?), but I'll be damned if it didn't fit the bill and then some.  My wife was pleasantly surprised by her Vegetable Quinoa salad as well, and the woman at the register even threw in some fresh bread to go with it, at no extra charge.  I'd have gladly paid the same price for the same food out in the real world.  Well played, Wildflower. Well played indeed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-JcrmJ480tjd_Q6w2kc9dQ"
  },
  "dieD9tBmXQVRR7Pe-4tzng": {
    "date": "6/16/2017",
    "text": "The food is very bland and far from fresh, pastries are as hard as a rock and the soup is like watered down Campbell's soup from a can (which is actually better) and coffee is tolerable. The last time I got an iced tea there was a pink hair in it. Looked over and what do you know? The unfriendly worker who was making the drinks has pink hair. Then I noticed only the ones in the very back are wearing hair nets while all the rest of the grumpy Wild Flower staff has their hair down and all over the place. Not to mention chipped nail polish and dirty uniforms.          Unfortunately that is the only place to grab a coffee (all I'll ever get from there) before you board a plane around A9-14. Otherwise, allow time and go elsewhere in the airport to avoid this place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FU64hTkZBM46uGsHh8NyWw",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FU64hTkZBM46uGsHh8NyWw/o.jpg"
      }
    ],
    "user_id": "dh2utEz3TTI1CBmAQBsU2g"
  },
  "y73UriZ5_xJDQXW_1RhuXQ": {
    "date": "2/6/2017",
    "text": "Whether your'e pressed for time or simply don't want to do the full service thing, this is an excellent choice in terminal 4. Terminal 4 is known for the vast dining options that are locally owned, which I love! 4-stars For the food but the customer service is so darned friendly that this place is a 5 in my book. Traveling can be really exhausting so it's refreshing to have a meal inside an airport where the entire staff is smiling and just plain nice.   I ordered the veggie quinoa salad and a half turkey and Brie sandwich with a bottle of water for $23. My meal was light and fresh and more than acceptable for an airport meal.   They made delicious sweets too... so if you've got a sweet tooth be sure to grab a cookie!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "6ObFF8-uKnOAlXuSH4TlyQ"
  },
  "UXvdxmRpaDDXKpo3HcOEuA": {
    "date": "4/17/2019",
    "text": "I've never went to Wildflower but I was willing to try new things while waiting for my flight. Daisy gave a lot of different ideas of the food. She made sure I knew what was in the food and I ate good. Food was amazing & also customer service was GREAT!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pgsJiPwePzXxt5ywN05iOA"
  },
  "rh_euznpfcFtu_bJiShQsQ": {
    "date": "6/19/2017",
    "text": "Six am in the PHX terminal and the volume on the annoying noise that passes for modern music is turned up to 11. People have to yell to be understood. Maybe the volume could be at 6 or 7 until 8 am. The loud noise puts everyone in a bad mood.   Average and bland food but I guess I'm supposed to  like it because it is allegedly organic and sustainable. I don't want political food disguised as a marketing scheme. I don't fit the market profile.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MRx1AZo_Sw-cctdqKxUgFw"
  },
  "HMoRtetrUPsGH0eqISg2OA": {
    "date": "8/10/2017",
    "text": "Check your food- especially if you are vegetarian, vegan, or have food allergies. I asked for vegan potato and greens soup and the basil, brie, tomato sandwich and they gave me the potato ham soup and a ham and Swiss sandwich.  I realized the soup issue after I ate half of it(probably because I was hungry and didn't expect and issue...I did realize that the soup was a little creamier than I would expect for vegan food and then I noticed the ham bits- prompting me to ask about it. The person at the counter apologized and was nice about getting me a container of the correct soup.   I didn't realize the issue with the sandwich until I was on the plane. I was hungry still and ready to dig in- when I opened the wrapping I saw the ham and Swiss cheese :( I couldn't believe that both the soup and sammie were done wrong!!! I have to drop my review down to two stars now for my strict veggie and allergy-prone friends who would have paid dearly for such mistakes.   There was a cute little kid dancing to fun music when I ordered but was she thaaat distracting?? This was the third time I've had a mishap from a server in the last three weeks. What's happening America???  Original post: Thank you for being open for us late night and weary travelers who need food! Appreciate the hot soup and sandwich offers- it will help me get through my next flight. Writing this as I sip on my tasty potato soup! Friendly staff too! :)",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LRcbILd08P_LMHYY5h77Cg",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. My late night dinner!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LRcbILd08P_LMHYY5h77Cg/o.jpg"
      }
    ],
    "user_id": "_DCsVuJNAMVHNJyZIkz8OQ"
  },
  "OsNJbWSg4DUmRLim8NsrlQ": {
    "date": "12/20/2018",
    "text": "This was a great stop for us to grab a sandwich before our flight. 5 stars for sure!! The restaurant was busy but yet positive attitude from everyone working  there. Sami served us and she greeted us with a smile, cheerful girl and had a good spirit about her. We were able to get our sandwhiches in no time. Even after a long day felt good to come into a restaurant with a good atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6PacQOdtUjpVArJalLqh8w"
  },
  "vMSRRXHHiCNeNcUrbIP1-Q": {
    "date": "3/31/2019",
    "text": "I wanted to have a sandwich while waiting for my friend to arrive. They clearly microwaved my bread because by the time I sat down it was a piece of steel!! Very sad! I paid $11 for the sandwich. I get it, it's the airport, but really!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yt0eEGzdYxAtMgsJ2ga3bg"
  },
  "x2lL4pY_l9Xt5BeJKdaaHg": {
    "date": "8/26/2018",
    "text": "Pretty good for airport food. The quinoa salad was delicious! Good healthy ingredients and fresh.  I highly recommend it. Their vegetable soup was ok and their bread that came with the soup was on the hard side. Would come back for their salad and to try their sandwich though.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "buDDx51mr9qRnxmOpfAytQ"
  },
  "6bVD7le5f9ijwUnW6ECnYA": {
    "date": "3/20/2019",
    "text": "Best salad I've ever had! I got the wildflower chopped salad for my flight and it was sooo yummy! It was the perfect combination of ingredients and perfect size. I can't wait to eat there again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QC9GoTPFMH1Lo2qsSafHhw"
  },
  "K104apo8ykIpQiCfzw_Z3Q": {
    "date": "5/9/2018",
    "text": "My experience today at Wild Flower was great! Samantha was very nice and helpful. I didn't know what to get and she helped me pick a very taste sandwich. She was very patient and helpful. Thank you again Samantha!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "u9DKRPXKsUJ9J5O9efFuyA"
  },
  "r61lT72wc6M5OjwG8tGDjA": {
    "date": "2/10/2017",
    "text": "I walked away from this place and was doing a findmeGF search and turned back.    So the chicken enchilada soup which was gluten and dairy free was great.    I also got their Asian chicken salad with the cilantro lime dressing, since the peanut was not GF.   Food tasted great and the ladies up front were a blast to talk to.    Over by gate a9 definitely a good find.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xj6kMUw7q59UYZznQtHKDw"
  },
  "hZeeQT_xO5alh4x8WD1VIQ": {
    "date": "8/15/2018",
    "text": "Great breakfast this morning!  Real pancakes hot and fresh, scrambled eggs and great country flavor link sausages!  My five star wife loved her AIRPORT breakfast... now our go to spot at PHX. Clean and friendly tooooo!  Alex B and Patsy are great!  Thanks guys.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xzyKTLYlTpxWTGWJBGsjCw"
  },
  "HbblbkO4hoTFTZKwR1GJ9Q": {
    "date": "10/18/2015",
    "text": "Ignore the word \"bread\" in the restaurant name, and order a salad: they're actually really good! The chopped salad or their seasonal kale-quinoa are both solid, with a good size and plenty of toppings for various flavors and textures. The pesto vinaigrette dressing was great, would buy by the bottle. At around ~$10 (with a protein), it's not a bad deal for a healthy airport meal.   Line moves fast, salads and sandwiches are pre-made and boxed up. Not sure if they'll make a dish fresh if you have special requests or dietary restrictions. Lots of seating and outlets to charge up your devices while you munch.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 11,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "nMCe58RXz_jtM6TyJE7yRQ",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. Chopped salad with pesto vinaigrette",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nMCe58RXz_jtM6TyJE7yRQ/o.jpg"
      }
    ],
    "user_id": "bLbSNkLggFnqwNNzzq-Ijw"
  },
  "tewGSf39DV-5HgwnCL5-Dw": {
    "date": "4/4/2017",
    "text": "Our gate was boarding and I needed someplace quick to grab some food. Short line and friendly service. My sister chose the ham and Swiss sandwich to share and seriously - BEST SANDWICH OF OUR LIVES. No joke. I have come to hate sandwiches over the last few years due to so much traveling + it being one of the most sensible quick and filling options. The flavor was simply divine. The bread was so fresh.   I'm sad to see they only have locations in Arizona but will definitely come here if I'm ever in the Phoenix area again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IcyZicmhme4so0JBHwVsvQ"
  },
  "g50LQGkj2SC3K2CB18Folw": {
    "date": "7/16/2018",
    "text": "The food was really amazing! The cooking staff was really top notch and the manager it's great",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JyCiVF1qk38gyaQWMorS9w"
  },
  "lNS81YD49QUDl35UXkZDkQ": {
    "date": "2/18/2018",
    "text": "Bruno made an amazing 3 cheese ravioli with meatballs. Great customer service up front as well. Great food before getting on my plane",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NkBmkHF6JchhJR24IgJpCA"
  },
  "5HXziAZQeYNF6se-zvs3gA": {
    "date": "7/13/2017",
    "text": "Jennifer was awesome. She let me sample the white bean kale soup, was super couteous, and polite. This store, #17 in the terminal by southwest and americam is super clean and good amount of outlets",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ycna_R_Cvh7m8Ysqvim5Bw"
  },
  "CU93rLpEiHgPXAFaanI2pA": {
    "date": "12/23/2016",
    "text": "Surprisingly good for a quick bite at the airport. Arrived to the terminal just in time to catch my connecting flight. Wildflower Bread Company was just across from my gate. Busy day at the airport due to holiday travelers but the service was in and out. Very efficiently organized: You go in one way, place your order, walk to the other side of the shop, pic up and off you go. No lines, unlike Starbucks. The staff was very friendly and chatty. I do not know how they keep their cool among the bustle at the airport. Plenty of sandwiches, salads and soup options. I got a half Brie and pesto turkey sandwich to go. The bread was good, fresh and was the right texture. Not soggy not too thick not too dry.  It did not fall apart when I unwrapped it later on the plane. The pesto nor the sun dried tomatoes were oily, the flavors were good. The lettuce was fresh and crisp. The size of the half sandwich was perfect and the coffee was hot and strong.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "51MT2EldvR7fMTvU1MYxWg"
  },
  "riYI88nvh1Qvvtv0tCD38w": {
    "date": "4/1/2018",
    "text": "Big thanks to Martin, who helped me order a salad despite my food allergies which could have prevented me from ordering any of the salads on the menu. He really went above and beyond the service I typically get in an airport restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_icP6MTqhoGP6BL5eRKmGw"
  },
  "EJJvod4KmKCcTEmLTAPiPQ": {
    "date": "9/1/2017",
    "text": "I am not one to do this at all but the service I received I had to write a review. I was in Phoenix Arizona on the 31st of August around 3-4 waiting on my flight back home when I got hungry and decided to give Wild Flower Bread Company a try. As soon as I got there one of the managers just had a very rude tone towards me and I felt rushed during my visit. I was looking at the menu and she had told me the line started back there but I wasn't ready she turns around and I believe I over heard her say \"people are stupid they don't understand where the line starts\" to one of the other employees. I still got something from the menu because i wanted a try and the young lady who helped me at the register had a completely different attitude. Manager should really have a better attitude. I didn't get her name but she had her ponytail braided and glasses. But overall the food was delicious.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dCAzM9sH9kscY5j8lgXZZg"
  },
  "K0vKy_3nNd8k5YuhE5yQ7Q": {
    "date": "7/13/2016",
    "text": "I arrived at Phoenix Sky Harbor looking for a good cup of coffee and discovered Miss Jessica knew how to create a signature drink with half the sugar.  She was pleasant and fun to talk to.   Knowledgeable employees are always a credit to your business. I will make sure to revisit this location again.  I recommend your shop when traveling to, from, or through Phoenix.  Thank you and know you have a good employee in Miss Jessica. John Kitto",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2-uiw3DIpK7NT7YEHcWKYw"
  },
  "YvdD4d3fU-NAP_nWp0JfcA": {
    "date": "9/15/2017",
    "text": "I had the wildflower chopped salad and it was fantastic! Fresh, tasty, and healthy. I highly recommend this place for lunch when you are at SkyHarbor airport.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HkZkGCDiX2AWk3PG2LlAyw"
  },
  "dG-o5Clsw2TVEykjeTu5CA": {
    "date": "5/28/2017",
    "text": "This is about the turkey blt-plus. Im like cracking up at how absurdly huge the bread is on this thing. Was this sandwich designed by a human? Humans don't like bread to be 12x's the mass of the ingredients. And it wasn't even good bread. It's like a hard flavorless styrofoam-hoagie you'd get at any grocery store. I guess i had expectations for an $11 sandwich from a \"BREAD company\" sheesh.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7Ky7Dx_Gq0W8A0UoLRtYlg"
  },
  "fpMVJnQo7nUapuGhUcfvBQ": {
    "date": "7/14/2017",
    "text": "The chicken Asian salad is the best thing you can order. When ever I'm craving a salad I come here! The also have amazing sandwiches and soup. If you are looking for a fast causal place to go this is the place for you! It's also not too expensive. If you like Panera you will love wildflower!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OE-3uY0F1VYUrfa5iCpgEw"
  },
  "8nQcB080qx0fc5VI-wqA9w": {
    "date": "6/9/2016",
    "text": "Stopped through for just a quick Bite to eat before a meeting and Jacob was outstanding at the register and True after the meal was served.  Food was good as well.  Will definitely come again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "35XvOJ-Kfaue3YG6dEs7DA"
  },
  "1D5YPUjqWYQTRuEKHfZJbQ": {
    "date": "2/8/2016",
    "text": "OK, really didn't expect this at the airport of all places but we had a great breakfast there this morning!  Scrambled eggs and oatmeal were all hot & freshly prepared.  And, the best part was we had 3! employees stop by the table to ask if we needed anythiing.  Really!  At the airport!  We were pleasantly surprised by the whole experience.  Thanks Wildflower!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "-sqK9cXC9wfiYQZtK5s7jQ"
  },
  "ZLvSpUGqb0YXXDjzvssm1g": {
    "date": "1/16/2017",
    "text": "Outstanding chopped salad, fresh and healthy ingredients. Got the Thai Peanut dressing at the clerk's suggestion, it was really good. My friend also enjoyed the egg and bacon sandwich.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QlhdjfLcQFbTCtcjsbSniA"
  },
  "L-8TjuKkI0wZJTXd_YoaQA": {
    "date": "5/29/2017",
    "text": "Just got off a red eye from Hawaii.  This place is a bit of a cluster F.    It's not even all that busy and they're screaming like maniacs.  \"NEXT GUEST READY TO ORDER!!\"  Then I'm trying to place my order and between nearly every word, the woman is literally yelling in my face \"WILL THAT BE IT?!?\"    That actually just slows things down.  Let people place their damn order.  To top it off, Blink 182 was playing very loudly while all this is happening.  That said - the coffee was not bad and my breakfast sandwich was pretty good and came put very quickly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5hGUoKTHpp1wLaOYVlDJHQ"
  },
  "fGOjzrs7zelNDG8u6atIng": {
    "date": "4/24/2017",
    "text": "I was out of the country for 6 weeks and stumbled upon Wildflower in my state of hunger.  I knew them because they are nextdoor to Changing Hands Bookstore in Mesa, AZ.  Lauren Hufford waited on me;  she was delightfully enthused about all the food offered, and willing to help me in any way possible.  Her service was beyond expected.  Then when I looked for the tip jar, it was ALL for the USO!  All of the employees at that location give their tips to the USO!  This is one that should be reported on the news, as an example of our heartful Americans!  The entire staff is so united;  you can just feel the positive, enjoyment of being there.  The next time I pass through I will make it a point to stop at Wildflower, say hello,and have a great meal!  They are the Food Angels of the airport.  Bless them!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1fB9OnV1boLDQFwb-z310w"
  },
  "TDyFBIqkGzCmxj180vlw6w": {
    "date": "6/19/2017",
    "text": "I ordered a Chinese chicken salad, and asked for ranch dressing instead of the traditional dressing. The guy behind the counter accommodated me without missing a beat! Very friendly and personable.  They give you a good amount of salad for the price, and it comes with the tastiest bread ever!  The place was clean too. I noticed that each time someone got up - an employee was there to wipe the table down and sweep under it.  I look forward to eating there again the next time I go through the PHX airport.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5NRMj4urpsELRnxQNTnJeA"
  },
  "SewtplEHBEjw4vn3BQ30zg": {
    "date": "5/5/2017",
    "text": "My second time through here in a month headed for a red eye flight to the east coast.  Last time a Thursday night at 930pm was quiet but now it's a Friday at 930pm and the place is hopping. Very quick.  Very fresh and tasty.  Super helpful staff.  Can't say enough good things.  The colorful salads are yummy, have really healthy options, and they will switch out dressings.  Tables and counter space and phone charging ports.  Makes a 3 hour layover a comfortable tasty and productive time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ft6zrSyzk0MdLL3BoUXdGw"
  },
  "jZLvWo4QP7qIuQcpYy69XA": {
    "date": "8/24/2016",
    "text": "Their chopped salad is life changing. And no I'm not exaggerating. Do yourself a favor and eat this salad everyday. You're welcome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "x4HnUx2HL9HKaYS8oM20RQ"
  },
  "Ju_1LBFeK5crhpLbZH8juQ": {
    "date": "10/19/2016",
    "text": "Such a good breakfast sandwich. Had the chipotle egg sandwich and it was delicious. Perfect size and they have charging ports at the bar table.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PUesgSf5b0J5cxPrgP9fzw"
  },
  "vY-VsIumqLjZ8HPjzDSa0g": {
    "date": "8/11/2015",
    "text": "Pretty good quality food! I got the grilled cheese which came with arugula and tomatoes which was way above a standard grilled cheese. The service was great and the biggest perk, CHARGING PORTS all around the seating area. Hard to find outlets at this airport so this place is great to eat and charge at the same time",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "TX5KjehuV7mrGYGEFRwjVg"
  },
  "LaNQ1NAchgoM1cBlsT9b9w": {
    "date": "3/31/2016",
    "text": "Turkey BLT and Potato Cream Cheese soup are both good. Even better when you do the half soup half sandwich combo. Better alternative to Panda Express next door",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Pqg4MWGS4if65halKG1FYQ",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. Half soup and sandwich deal isn&amp;#39;t bad with a Turkey BLT and Potato Cream Cheese soup.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Pqg4MWGS4if65halKG1FYQ/o.jpg"
      }
    ],
    "user_id": "vCd5EoKoLFX88us_3eE3VQ"
  },
  "0vclsVkNW5wA0UUPW2g5aA": {
    "date": "10/29/2015",
    "text": "I am amazed at the excellent customer service of this airport cafe! They go out of their way to be kind and are very fast and efficient. Plus, they have sot milk for my latte!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "v125nUf6_LLhdquIeIBwfw",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. Waiting for caffeine",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/v125nUf6_LLhdquIeIBwfw/o.jpg"
      }
    ],
    "user_id": "hkDaf_kN3-MwrjBmZnHWXg"
  },
  "dkH-uNQcdB51CIWL4HiQ_A": {
    "date": "8/9/2018",
    "text": "This is the best airport food experience I've ever had. The woman working here was a sweetheart and the food was a good sandwich (especially for being in an airport). They had yummy pastries and cookie options as well. Pretty cheap for airport food too. I paid 15 dollars for a sandwich, bag of chips and a huge cookie!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GxdvUXrpFv7u4phTgbMy9A",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. Huge cookie, hand reference",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GxdvUXrpFv7u4phTgbMy9A/o.jpg"
      }
    ],
    "user_id": "d4xgjQ4NNaI-HCPTcAdQaA"
  },
  "gyalW692oH0HO2TA8G63wQ": {
    "date": "4/11/2017",
    "text": "I am not sure why this place comes up in the \"vegan\" category considering their only vegan options are a mushroom soup, and bagels. Prices are surprisingly reasonable for the airport, and they offer a variety of 'healthy' salads, sandwiches, baked goods, and coffee beverages. Service is slow, rude, and completely unfamiliar with their menu. When I entered the ordering line I asked an employee about their vegan options, and he straight up replied \"I don't know. Ask the cashier.\"  I got an Iced Americano with soy milk, and a Multigrain bagel with avocado spread and tomato, which came to $7. The coffee was terrible-bitter and watery, with maybe half a shot of espresso. The bagel was thrown together, with the spread on only one side. They didn't even cut it in half. However, it tasted pretty amazing due to the fresh multigrain bread. This was no grocery store bagel. The bread was light but chewy, and packed with freshly baked flavor. A surprisingly delicious lunch, and a real treat at the airport. I would come back here for a bagel, but not for anything else.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "O9fCYTHvIbwMeqUR7vdNgQ",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. Multigrain Bagel with avocado and tomato and Iced Americano",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/O9fCYTHvIbwMeqUR7vdNgQ/o.jpg"
      }
    ],
    "user_id": "u79JLmKzua7wxGxs1Q3Qkg"
  },
  "Jlt803kY0bJGTnS3un8UzA": {
    "date": "3/1/2019",
    "text": "My wife and I got half tea half lemonade drinks.  They told we could get free refills.  After we finished I went up to get refills and they suddenly wouldn't do it because they said free refills are for tea only however they ALREADY told us half and half would be fine.   We wouldn't of even paid for the OVER PRICED drink if we knew we couldn't get refills.   DONT TELL ME ONE THING AND DO ANOTHER!!  Thats the most ANNOYING thing!!!  Will never step foot in one of these establishments again.  Get your sh#t together.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "G-kvKVKiTk1UCGtXVs7rbQ"
  },
  "XnT8oA0LrG5Agl-trYPP9A": {
    "date": "4/19/2019",
    "text": "Good food and the manager Michael is amazing. He represents that company so well.  I will come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8pZ5HkaIaEttL2305cCi7w"
  },
  "_km16k0CmtE8IhLSIr-6HQ": {
    "date": "2/18/2017",
    "text": "A serious step above the typical airport food. The breakfast and lunch options are more than basic and there are plenty of options with fresh vegetables and fruit.  On the way to the register are prepared foods such as sandwiches, salads, and baked goodies. The salads were really nice salads with good toppings, not crummy iceberg trying to pass for salad. The overhead menu offers the hot options that can be ordered.  My husband and I both ordered Ultimate Bacon & Egg Sandwiches. It was a nice sized sandwich. The ingredients were fresh and the sandwich overall was tasty. I also ordered a Rice Krispy that had chocolate drizzle on top. That was really good and also a large portion. Our orders came out quickly even though they were very busy. A travel must!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "-0ZIW5Uv7RAEQMrcVvRZcQ",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. Ultimate Bacon &amp;amp; Egg Sandwich",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-0ZIW5Uv7RAEQMrcVvRZcQ/o.jpg"
      }
    ],
    "user_id": "3nIuSCZk5f_2WWYMLN7h3w"
  },
  "iWkIkXyxs8_DCMnuGleYXQ": {
    "date": "8/19/2018",
    "text": "Best food/coffee and service in the airport. I would like to acknowledge Sonia, Raul, Rebecca and Andrea for always being so polite and helpful to all travelers and employees. Thanks so much for your hospitality. One of my favorites is the salted caramel macchiato and the chewy fudge brownie",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "wO6ZQzs5EDBJY75KXFSl6g",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wO6ZQzs5EDBJY75KXFSl6g/o.jpg"
      }
    ],
    "user_id": "RULBqNEBC7IuQE3J0Fxw6A"
  },
  "Zh5rk44sawGKlKGP9AhSUQ": {
    "date": "4/18/2017",
    "text": "Picked my poison at the airport in Phoenix during a lay over and chose Wild Flower. Man things are pricey in air ports. Wish it wasn't so. Got the half soup and sandwich. Got the turkey blt plus. Which came on Challah bread. The bread for me was too think and I took the bottom part off. It was cold too which I knew but wished it was hot. The ingredients were fresh which is good.   I was disappointed they didn't have souls with meat not even a nice chicken noodle. Damn damn damn. But on the bright side they had a mushroom soup which was chalk full of mushrooms seemed like shiitake too. It was pretty darn good. I can't turn down those  fungi.   They had other yummy bakery items but I figured I shouldn't since illl be indulging enough on this trip. Overall. Not bad but not great. Service was friendly  as well which was nice.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "-QH3egRXgWyMqU-5R7P3LA",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. Blt plus with mushroom soup.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-QH3egRXgWyMqU-5R7P3LA/o.jpg"
      }
    ],
    "user_id": "mvl0vneJENr7uJFYf2cFwg"
  },
  "HHrxsf9eb79UWw_JJhNS3w": {
    "date": "4/1/2019",
    "text": "They don't really offer much in the way of the bakery and the coffee is mediocre at best. I wanted coffee and a pastry but it just ended up with a slightly warm cup of coffee so actually going here for the \"bakery\" and coffee, I would skip it! The staff was not very friendly or accommodating either so overall it was a very unpleasant experience. This has been such a lovely morning until this point I have had only good experience beginning my travels.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XadHt5ROYfAtWHmiogjPBQ"
  },
  "NRMNVsQIGlZ3m426hFBm6Q": {
    "date": "11/19/2016",
    "text": "Very good airport fare. I'd recommend their sandwiches, since they have some great, hearty 9-grain breads. Salads offer interesting combos, especially the Kale Quinoa Vegetable madly. You can easily make it vegan by holding the cheese, and they'll add more greens instead.  The staff is very pleasant, and they have a stock of ready-made items and you can customize too as noted above. Very good coffee in the morning.  It's a little confusing knowing where to order (right, left of the counter, in the middle, I'm still unsure), and it'd be nice if they had some tofu or mushrooms, re: more heartier veggies.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "iaV1mxG-d_ZWtl-8Arr6sQ",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. Kale quinoa salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iaV1mxG-d_ZWtl-8Arr6sQ/o.jpg"
      },
      {
        "img_id": "Os7z4dggcGjuNP_O88FLuw",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. 9 grain bread.  Toasted is good.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Os7z4dggcGjuNP_O88FLuw/o.jpg"
      }
    ],
    "user_id": "RKPkxOYQlM0BjhM-H6_vAw"
  },
  "tfGLQOwl1jfnSnxzqt_yEg": {
    "date": "5/26/2018",
    "text": "FANTASTIC DELICIOUS Airport Meal! Today I visited Wildflower Bread Company at Phoenix Sky Harbor Airport, and when I asked, Alex for a suggestion of what to order he suggested getting the pesto chicken with ravioli rather than penne as I was debating these two pastas. He was so kind & helpful, and it was absolutely delicious!!! This meal was prepared / cooked by Bruno, and the waitress who helped me, Samantha, was so sweet, and we chatted about her favorite wildflower meals as well.  It was one of the most delicious pastas I've ever had. I also frequent the wildflower in Flagstaff, Arizona, and I am always so pleased with my meals there as well!  The waiters & waitresses at Wildflower are always so friendly, kind, and helpful. I always leave with a smile on my face.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mOWWvPbk4i76V1xO4n3Gpw"
  },
  "B_XQ6z1_FywH8HmH36eqqQ": {
    "date": "4/20/2018",
    "text": "It's so hard to find a legitimately good salad in an airport. I tried the Spicy Super Foods salad and it was truly spectacular! The chicken alone is probably the best, juiciest, delicious shredded chicken I've ever had on a salad anywhere. It's hard to do better than this with fast food, and to find it in an airport is even more rare.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NMPPVxlwdunbtu-jDzXJfg",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NMPPVxlwdunbtu-jDzXJfg/o.jpg"
      }
    ],
    "user_id": "8u0jeTENcIlKxr4W7o7NNw"
  },
  "Jb7u_Z6NMxW--9kxyThK_A": {
    "date": "12/25/2016",
    "text": "Laying over in Phoenix this morning I found this little gem of a breakfast sandwich station in the airport.  All the food is made fresh to order, no microwave madness here.  I ordered the Ultimate Breakfast sandwich and was glad I did. Loaded with egg, bacon, pesto, roasted tomato and arugula, this was a sandwich if satisfaction. The brioche bun was soft and very flavorful.  I also had a vanilla latte that was great. They have juices, muffins, bagels, and other sandwich options, but the Ultimate Breakfast sandwich is excellent.  Service was very good and it only took a few minutes for everything to come out.  4 stars  The song of this review is \"Leavin On A Jet Plane.\" by John Denver.  Lots of reviews coming up from Mazatlan, Sinaloa Mexico...stay tuned!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DIZ53GIyt2HRH0kcfLbgqQ",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. Ultimate breakfast sandwich",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DIZ53GIyt2HRH0kcfLbgqQ/o.jpg"
      }
    ],
    "user_id": "ABlSOquUAEYSUvySN0AeXw"
  },
  "kAL4x1HhU8K22rNE77FNNw": {
    "date": "12/5/2018",
    "text": "Dude. Airport places usually suck. This was amazing! The food and people were great. People know we are in a hurry and while nice, don't delay and have a sense of urgency. The food..... Chipotle breakfast sandwich was yummy and mango passion fruit lemonade smoothie was the bomb!!! Definitely recommend to people in terminal 4 in the A section.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N66N1DDBhDAGgAc-Asqhdg"
  },
  "aHxlABTv_GEykCaFXLDRjg": {
    "date": "9/28/2018",
    "text": "The food was fantastic and the staff were so nice even when it was super busy ! Will definitely stop in here again when I'm in phx airport",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jJM94KRrzCXZRHf44ppWPg"
  },
  "hm1aD3wisBOmI88Mm0j96w": {
    "date": "5/25/2017",
    "text": "Place is open 24/7 and has healthy options. Service is great, employees are efficient and keep their spot clean. Food and coffee are great, too.",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 9,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "Qksfl1-VIVlTlmdnXnwTAA",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Qksfl1-VIVlTlmdnXnwTAA/o.jpg"
      }
    ],
    "user_id": "PcvbBOCOcs6_suRDH7TSTg"
  },
  "SPHwAfXe0KMzV9RqEuiB4A": {
    "date": "9/23/2018",
    "text": "I had a great experience here!  After coming off of a long flight I was very hungry. I didn't want any feta in my salad which and more chicken instead which was not a problem. Samii was very kind and polite. She even gave ice for my very hot soup. Will definitely be back when flying through here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4ggZnM0lZkuBiTxBA9gyNQ"
  },
  "cQTvP_q1pP5tK5FKk2ioQg": {
    "date": "9/17/2018",
    "text": "The coffee is great! We got a Chai latte and a Mocha, both of them prepared by Samantha H.. She was great and did the best coffee we could have ever asked for. Thank you! We will definitely come back to get more coffees once we pass through PHX again :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "APV1PqFQA4RS0D0oDAT4zQ"
  },
  "pbiztiMQ_SBpRnVluG7oFQ": {
    "date": "8/12/2018",
    "text": "Great food - fresh and delicious - great for the whole family with different food preferences.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ooy13GmqILr-VmDlh6ADxA"
  },
  "9pisMrVBmHWj7pB6DoIdXA": {
    "date": "8/10/2018",
    "text": "Arrived at PHX with an hour to kill before my client meeting. So tried this place and ordered the Caesar salad. The salad was inedible. Never in my life have I seen a Caesar salad made this way. The spices and dressing were separate with the spices strewn about the salad and after adding the dressing the spices just clung to it but did not absorb and so just became a crunchy mess. They also put the stalk in the salad. A few bites and I just gave up and threw it away.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "fKuuhADbXJH8L7cXYm3MVA"
  },
  "CoQbYN__QDw_fou9jEJApQ": {
    "date": "3/13/2018",
    "text": "Wildflower is one of the better food options in the A and B gates side in Terminal 4 at Sky Harbor. The sandwiches aren't amazing but pretty good for the airport. The baked goods stand up on their own. I walk over here all the time when I'm at this airport for the chocolate chip scones, which are perfectly buttery, with plenty of chocolate chips. My partner loves the chocolate chip hazelnut sea salt cookie here too. I'm already looking forward to my next airport trip!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "OQBMu7x0V4Oz3iFv3x0i5Q"
  },
  "z1Po9I3DlV5VMVTnsj5U3g": {
    "date": "4/19/2016",
    "text": "Stopped in before our flight - very fast, very fresh & very friendly. And super clean. Someone constantly walking around cleaning",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZchBiQsRP-sQIxmoldvzaA"
  },
  "1Gdum2nv0lvMmr-eq7XVlA": {
    "date": "12/19/2014",
    "text": "With some extra time before a delayed flight we find ourselves at Wildflower for some snacks. The food was good no question. But what impressed us most was the service. An incredibly friendly team of people!  And while sitting and eating two different people stopped to ask us if we needed anything and how our food was. Unexpected in an airport counter service food area. Thanks for a great experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "AuQ87lD1LuZXB4Dnt6rQ6A"
  },
  "GCH3AqQRsJ3c8l01niFymQ": {
    "date": "9/18/2015",
    "text": "Excellent food. Excellent staff .Excellent service. No doubt the best Wildflower in the Valley. Why? Because it has Excellent management. We make it a point to eat there when at Sky Harbor,  Rich, the manager mingles with the customers, makes sure food and service meet and exceed customer's expectations. We have dined at other Phoenix metro Wildflowers and have concluded those other operations need to send their employees and managers to Wildflower at the airport  for training on how to be customer friendly and serve outstanding food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nuB8dgodCPlw84pjnXpvIg"
  },
  "4oFbloLbqvO1OyXJ9bBlXQ": {
    "date": "1/1/2015",
    "text": "Great sandwiches and soup... Courteous staff.. Perfect spot for a quick snack in between flights",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QFGysZbKWBj6jBtZHsNFdw"
  },
  "4Skt-t-HY87QBzDJHrOMyA": {
    "date": "7/11/2015",
    "text": "Fresh like flowers, this is a perfect place to eat or pack your food for the long flight. They have some amazing range of sandwiches, bagels, soups n bakery products. I tried their vegetable Quinoa salad and a nine grain bagel which were quite gud. Also their, chocolate chip scone was quite delish.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oKsBUuCzg8Hb99-regZP6g"
  },
  "3J4j352Um38fgzf2NLVJEA": {
    "date": "3/9/2015",
    "text": "Good tasting healthy food is hard to find.  And to find it at an airport is truly shocking.  I had the Asian Chicken salad and my wife had the Caesar with chicken.  Both were very good and there were at least 3 other options.  Staff was pleasant and the food came out quickly.  Worth getting to the airport early.  They also will pack it to go.  I'm not sure if the dressing will go through TSA or not, might need to ask.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "8WlCfNo70e9otMrn7Esfhg"
  },
  "CwDCwZDXR-0jT1vwAaMuGQ": {
    "date": "2/8/2016",
    "text": "enjoyed the Cuban sandwich.  great for a stopover.  tasty with nontraditional pressed bread made crisp.  nice amount of spice.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "kS1MQHYwIfD0462PE61IBw"
  },
  "05mXV_jx6xlvBnvipzeSlA": {
    "date": "10/24/2014",
    "text": "The staff at this restaurant is amazing! Supremely friendly! The food was also amazing. We loved the sea salt and hazelnut cookies. Highly recommend when you're at the airport that you stop by. It meant a lot and made our wait at the airport much better.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DH1qw6N9wMBQ-K06LJvCDQ"
  },
  "2YpjrUNvP6E3nE1Q_txaIQ": {
    "date": "5/2/2015",
    "text": "I went here after a trip to Chelsea's Kitchen was unsuccessful, and I'm glad I did. Not only did I save about $20, but the service was good (friendly employees), and the food was tasty. I ordered the vegetable quinoa salad with no feta, and would gladly order it again. Served with a large piece of fresh sourdough for $10, you can't go wrong. And it's filling!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kd6j2MXo69v9KYEwGfkShQ"
  },
  "STtCD3h2PiFv6A-ipy5S6g": {
    "date": "3/28/2015",
    "text": "I had a kale salad and it was super delicious. This is a great, healthy place to eat at the airport. Fairly quick service. However, I had to clean my own table as it looked pretty dirty. Otherwise, very, very good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vwwp4QxVhmP7uNJz4pdkDA"
  },
  "ycNX6ZGsYZPyMbjbxzavnA": {
    "date": "3/22/2015",
    "text": "Nice healthy fast food in Terminal A at the Phoenix Airport. Lots of healthy choices and the only place for coffee at this end of the terminal. Not a lot of seating and feels crowded but a good value.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OQZOpOXTowiQYjGT0gLeVg"
  },
  "r_VoXWxrDWB-qvchs12wYA": {
    "date": "1/2/2015",
    "text": "Usually food at the airport is sad. For breakfast, the chipotle egg sandwich here was very tasty!! It was hot and satisfying. If you're in terminal 4, check it out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gPGeKYkwwPh0oB9d8m9MGg"
  },
  "uYYjMKyvKUsEcEvhuDwXDg": {
    "date": "7/25/2016",
    "text": "Had a lay over in Phoenix and wanted to grab breakfast. Wildflower was just outside the gate. Ordered eggs and sausage. When my order came, it was missing the sausage. They quickly fixed my order. The food was fresh and very good. The staff are awesome. We'll make sure to stop by on my way back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v0qnkC7EloQZReRnP2sOlw"
  },
  "mKRyB5iO7dXpIp2Tn5W_pg": {
    "date": "7/28/2015",
    "text": "Service was fast, and the food was really good! Brooklyn was extremely helpful in helping me find something that fit my dietary needs. The place was a little crowded, but then again it is an airport. I'll definitely visit here again!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mnd3gUcuembdg-jKK0UWeQ"
  },
  "IwEbZPAcfEr-BD6NId18Tw": {
    "date": "7/6/2016",
    "text": "Loved the turkey blt. They lost my order so the manager comped my sandwich.  Very friendly- I will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AJQszy5KhlZ3zN3uaEn3mw"
  },
  "42nNuHsdsAV_VEaWUlHIAA": {
    "date": "5/31/2016",
    "text": "One of the best choices at Sky Harbor!  Trying to eat plant strong (super easy while traveling, she says sarcastically) and they have the BEST options: quinoa vegetable salad and tonight they offered a fantastic vegan cauliflower masala!  I would cross terminals to eat here!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OzFGz_Hesh2LJb-tp0FbpQ"
  },
  "B5UUAkfti0ADX5pi3SJb7w": {
    "date": "6/12/2015",
    "text": "Visiting Scottsdale on business!  Love this place.  Great quality sandwiches, soups and salads.  Friendly service and quick on the food delivery.  I'll be back a few more times before I leave!  Outstanding!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4a2h681L6mu1BzcXxpHw7g"
  },
  "lyrLB18pukF_feZACcgOew": {
    "date": "5/31/2015",
    "text": "Best spot in the airport for people looking for a healthy meal. Lots of options with good bread for sandwiches and fresh salads. The wildflower salad is made with quinoa, a variety of veggies, and all over fresh arugula. Best option they have.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dqlVlEhX5edMf5c3Q6PhjQ"
  },
  "__Ll7eMYlG3n2rqrdRKiwA": {
    "date": "5/15/2016",
    "text": "Haven't eaten yet as I am about to board a flight, but it looks yummy and the service was super quick and friendly - can't wait to try the food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mfFyoyxI_SbScHg9HsGv3A"
  },
  "TtPuyHCS9bTfUY1VHfTVsA": {
    "date": "6/7/2016",
    "text": "Only vegan-friendly place in terminal 4 and the food is excellent, great service and chill atmosphere. The vegan quinoa salad is great! Coffee drinks don't charge extra for soy (i.e. \"Vegan tax\")). I will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z-XLOpSBxzPYeHW57PJ4VA"
  },
  "5QkxAmT3vS4A6gq2GD8PsA": {
    "date": "4/19/2015",
    "text": "You need to come to Austin Tx. Nothing like this there. Fastest growing big city in U.S. Still lots of hippies. Sheldon",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5sPfwLAyjREBZ7TFK8wuYA"
  },
  "-yMk0gwU_hbpIl80Rnnfig": {
    "date": "4/24/2016",
    "text": "Laura is terrific, very friendly and helpful.  She was at the Wildflower in Concourse A near an AA gate.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7S0rr6aWE3i9MYFJCi-59g"
  },
  "H41C-IElc9dsJ7lWmF4Fxg": {
    "date": "1/1/2015",
    "text": "Loved my butternut squash ravioli.  Also had their blackberry orange lemonade.  Very good.  Super nice price for the airport.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aW42jxSsxqgmJxwXfrzD5w"
  },
  "6Fx7xNjrTK42I-SY6IMJOg": {
    "date": "3/20/2016",
    "text": "I had the tomato pesto & Brie sandwich, grilled. It was deliciously unusual. Service was very quick and friendly despite the long line.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w9MeTefuxQshVeAJA0VIkw"
  },
  "z34RXY2dHk5HJGrjiuMYUA": {
    "date": "9/10/2018",
    "text": "Wow! For an airport meal, this can't be beat.  Line moves pretty fast.  I hate salads, but I got the quinoa vegetable salad, and it was really great to eat. Satisfying, flavorful, fresh, and didn't hold me down. Served with a great piece of bread, which is the secret to keeping anyone normal happy.  Airport prices as expected, but surprisingly not too terrible; a filling salad was $10, and God knows what else I could have spent $10 in that airport instead.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 8,
      "cool": 7
    },
    "photos": [],
    "user_id": "lUPSEbFRd3jDOM5agGnjWQ"
  },
  "poKSS-KdiIKDwO4wbzc0Gg": {
    "date": "12/6/2018",
    "text": "I had a layover here and decided to go to Yelp to check out good places in the airport. It seems like they did a great job; the salad I got (wildflower chopped salad) was amazing, and I felt so good and healthy eating it. I never eat salad as a large portion of a meal, so I was impressed how nice it is, especially because even though the salads are premade, they are very fresh and the ingredients complement well with one another. I think I found the place to go to when I am in a hurry and have a layover at PHX.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qJ7gMEms0yoGvkKb_uUVLg",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qJ7gMEms0yoGvkKb_uUVLg/o.jpg"
      }
    ],
    "user_id": "L4EjPVeYhStlA7fFb-1Gzw"
  },
  "Qq3JjeeKLsNI9ezr3XUcuA": {
    "date": "9/4/2019",
    "text": "Great place for a quick breakfast sandwich and coffee before jetting out! Alan, the gentleman working the front counter was full of energy and had a great attitude that was delightful to me.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QeFobhJHVYU2CJgQsuuMGA"
  },
  "xgCKVYZr6KTnvnUouuZthA": {
    "date": "10/9/2018",
    "text": "Seemed to be the only place open on this concourse at 4am. I bought a really good Cranberry Scone for now, and a Super Greens Salad for the flight. The salad included feta cheese, very moist thinly sliced chicken breast, sun dried tomatoes, and a spicy Mediterranean vinaigrette, on a bed of kale, cauliflower, Brussels sprouts, etc. Very nice salad. A bit small, but still very satisfying. A chunk of bread came with it too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qTL_Yu1LYndKGRGwVY9TMA"
  },
  "UEt5LaIjzgfHzWGthpgIDA": {
    "date": "8/9/2018",
    "text": "Absolutely adore this spot. I am a creature of habit the best 3 dishes are the Spicy Indian lentil soups, the Butternut Squash ravioli and the Butternut Squash salad during the winter months. During the summer months the sweet potato sandwich is amazing I sub avocado for the cheese! Vegans you are in luck they are super flexible and always have a vegan soup option.   It would be nice to have some vegan pastry options though.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "-d78vV86WnU2uWac1fEntA"
  },
  "j20iQfl4TBcM8dBcGNh-lQ": {
    "date": "9/29/2018",
    "text": "So disappointed in our choices here.  First, no decaf coffee was made so we had to wait.   Took almost 10 minutes and it was so strong we couldn't even drink it.   We each ordered a breakfast sandwich and they weren't as described.   Supposedly the cheese is mixed in with the eggs, but you couldn't taste it at all.  The bread wasn't grilled which was disappointing.   The slice of ham on my husband's was so thin it was almost non existent.  My bacon was hardly cooked.   Overall, lousy experience.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1I-CEVANa_4wkGzNTs5RAg",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1I-CEVANa_4wkGzNTs5RAg/o.jpg"
      }
    ],
    "user_id": "AXBsPgSbyjGkAqPLSwiTYg"
  },
  "IiHiqWA7vbZyLF8tnL0eWQ": {
    "date": "2/23/2019",
    "text": "Poor customer service from the front end. They were not busy, but the cashier was rude. She acted like it was a bother to break her conversation with her coworker. I asked for no cheese no chicken on the quinoa salad. In the end, there was no feta cheese and chicken but they gave me a Caesar salad dressing with Parmesan cheese.   I think the management may need to train them more on customer service and getting orders right. I do like the food at this company. Too bad for the customer service though. I spoke with the manager regarding the issue. They refunded my purchase which was fair but I was so bummed about missing on what would have been an excellent salad.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ozYvncPmEITQcEyc0u_cDQ"
  },
  "HMptD0j8QrstBFnaS9Rt7A": {
    "date": "11/22/2017",
    "text": "The 45 minute layover at PHX afforded me only a few minutes after traversing the terminals to pick up a quick bite to eat.  Good ol' Panda Express had a line extending out in to the open so we ended up just next door at the bread place.    Wildflower Grilled Cheese Swiss, imported brie, cheddar, organic arugula & tomato on grilled Nine Grain $7.59  Bought one of these and brought it on the plane.  That turned out to be a great move as the plane remained at the gate for another hour (which has nothing to do with the eatery) as we ate the sandwich still on the ground.    I think the consensus was that this sandwich should have had some sort of meat in it.  It was a good but pretty small bite to eat.  Airport food will always carry a bit of a premium with it- this was worth it for the stop-and-go nature of my visit.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "WBucYoRSUYb5TQDtSUkzZg",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WBucYoRSUYb5TQDtSUkzZg/o.jpg"
      }
    ],
    "user_id": "62TPDA37iXppqA0xXJrSPQ"
  },
  "sKZu0b5zgmxHCYFuxGTpZg": {
    "date": "5/19/2019",
    "text": "Dude here told me the passionfruit iced tea is not black tea so my only option is hot tea. I looked it up after and FYI  it is black tea  I even asked him if he was sure like 3 times.  Also the broccoli cheddar soup has unchewable fibery parts of the broccoli in it",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PdqpvoBSNKIuFjTSK5vZPQ"
  },
  "-C5hsEOn4VPGYYpcxUhwpQ": {
    "date": "4/6/2018",
    "text": "Why 5 stars? Because cheers to airport food that's actually really great!      ---   ---   ---  Before making the flight all the way back to Tampa, I knew that it would be smart to grab something to eat at the airport. I'd only been to PHX  one other time, so I had no idea what restaurant options I'd find, but I found the selection to be pretty solid compared to most airports. I walked by a burger place that I was super tempted to order from, but then I noticed the really great reviews at Wildflower.  As I was reading glowing review after glowing review, I was looking at the menu and a bit confused. These looked like some pretty basic sandwiches, and while I love a good sandwich, the nearby burger option was tempting me.   But I went and order the sandwich and after one bite, I completely understood why this place is so beloved. The bread is amazing. Why is the bread not like this at every sandwich shop? I'm not sure but this simple sandwich was probably one of the ten best things I've ever eaten an airport.  I actually don't even remember what the sandwich was called. My wife happened to take a trip to Phoenix one week after me, and per my recommendation, she ended up ordering the same thing. She insists it was called a grinder, but there's nothing on the Wildflower online menu that's called a grinder. Either way, it was some kind of ham in between toasted bread and I wish I could have one every day.  I also scored some chips that I'd never seen before and loved them. Again, I don't remember the name brand because I'm really terrible at this whole \"writing reviews\" thing, but keep an eye out for an interesting chip selection.  Lastly, I ordered the Georgie Peach smoothie (I remembered the name!) which was delicious but probably just a pinch sweeter than I would have preferred. I like things that are sweet but this was *really* sweet. Still, I could tell it was made with love.  To top it all off, the employees working here were super nice and friendly - not the norm at airport eateries! This was definitely a very memorable experience for a fast-casual airport spot!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 3
    },
    "photos": [],
    "user_id": "pou3BbKsIozfH50rxmnMew"
  },
  "lkvheFe5-XXv3fnU_F2bGQ": {
    "date": "4/9/2019",
    "text": "Some better non meat sandwich options ..which are super hard to find at the airport..  seriously  what is the deal with everything having ham in it or turkey with cheese? ..    Priced OK.  (compared to everything else..  I wish we went to the one in town .. the guy said they had lots more selection.. so I'm bummed about that..  So if you are going to Phoenix/Scottsdale go to the main one ..  I had on my list to go to this one : 4290 E Indian School Rd, Phoenix, AZ 85018  but we didn't have time.. instead we went to another bakery ..  that had had really good bread but sandwich topping were so so.    So this place the bread was not reg. challah but a roll  (good but misleading) i had the brie and basil and dried tomato.  really tasty, flavor wise. The chocolate scone was also good (no sugar on top so that was nice too) ..  Service was quick.  Yummy pre-made sub sandwich with interesting ingredients.   Way better than subway..  seriously.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "XYoe8gupMdkW1dIh37Bsjw"
  },
  "sOsMW_B8VdY19G_hPcGP_A": {
    "date": "10/4/2018",
    "text": "I was served a dish of kindness. It was 9:30 pm and although they were clearly trying to cleanup/close up shop for the night, I was greeted with a smile. I wasn't expecting much from my \"last of the night\" chicken noodle soup but it was savory and full of noodles. We chatted about which cookie was tastiest (chocolate chip) and she sent me on my way with a sincere \"sorry your flight got cancelled \"- which was more than I got from the so-and-so at American Airlines. I'm only sorry that I didn't catch her name so I could tell her manager how much I appreciated her. Thanks Wildflower server!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "E3R01ki3iaic1nonV83yng"
  },
  "yryf0mFaocItBDIiAbCJYA": {
    "date": "6/2/2018",
    "text": "Very impressed for airport food. I came through here on a layover and got a spicy chipotle egg sandwich (add bacon). It was very enjoyable. It wasn't as spicy as I would have hoped for but still had good flavor. If I ever layover here again, this will be where I eat",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "miatnQB1jaKDZ5TQ_J276w",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/miatnQB1jaKDZ5TQ_J276w/o.jpg"
      }
    ],
    "user_id": "q8V8MDINpPmPg_0STAsDSw"
  },
  "jbiIehM8aYeOD2Yj5VbKuA": {
    "date": "5/31/2019",
    "text": "Excellent service they got me in and out fast. I recommend this place if you have to go to the main gate",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Kj3BhT-7_wleKgNGLPJRA"
  },
  "OJr_QtWGIdJDfIBjo7zebw": {
    "date": "3/4/2019",
    "text": "Between flights in a long stressful travel day, we were looking for something to eat that was in the terminal and vegan. Chances weren't good that we'd have anything more than popcorn till I went to the counter at Wildflower. I feel so fortunate that Samantha was on the job.  I timidly asked if I could get a salad with no cheese and Samantha responded in a completely amazing way. She recommended a salad base and let me choose from lots of different toppings and suggested that it be split into two different containers for sharing. Then, she anticipated my needs and told me to hand her my empty water bottles and she'd get them filled for me.  Wow! I was totally caught off guard! I'm used to being treated as a hassle when I ask about special dietary things and airports can feel even worse, but Samantha (along with Raul B and Micheal in the kitchen) turned our day around!  I'm looking forward to traveling through this terminal again! Thank you for excellent customer service!! The salad and soup were awesome!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Faqk4DRHobRRHiQdGDnNg"
  },
  "uyOHzerCQgG99VoMr0HijQ": {
    "date": "9/30/2018",
    "text": "Wildflower in PHX goes against all the airport food stereotypes you're used to. Great service, affordable prices, and delicious food! One of the best airport food experiences I've had. The bread they use for their sandwiches is fresh and soft. They have plenty of vegetarian options and I'm sure you can modify those to make it vegan. The service was amazing and everyone was SO nice! Definitely check them out!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4LEYWOK4PfsoIeM2vs6L4A"
  },
  "9Q7VFsItaohSL2B8M-DjQw": {
    "date": "8/12/2018",
    "text": "Being hungry at the Phoenix airport on a ungodly hour is not good way to start a day but Wildflower Bread Company made it amazing! I am not a big fan of airport cafes but Wildflower Bread Company is not your mediocre or regular airport cafe.  My breakfast menu came with a great cup of coffee, an awesome sandwich and a full heaping serving of amazing staff!   Now that's 5 stars in my book.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "JfZFw5gIPHcY73Z4PA-yvA"
  },
  "D_yyXCA0-oNDPDYDYBjtKg": {
    "date": "1/11/2018",
    "text": "I had an hour layover and didn't want to kill time sitting in a restaurant waiting for food. I came here instead since well, I can still eat somewhat healthy while at a layover.   I got the tomato, mozzarella, and basil melt and it was delicious. The bread tasted pretty good for airport bread and didn't tasted like it sat out for days on end. Their chips came with interesting flavors and their smoothies were freshly made.   I'd stop here again if I'm at this terminal for food. It's very convenient. They also had an area for you to sit and desserts behind the glass to get to go for the plane ride later.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 8,
      "cool": 4
    },
    "photos": [],
    "user_id": "EDBTE8HMO-iN5hAi9B382A"
  },
  "Z9cszUSoMH14eq6AjqURQg": {
    "date": "7/12/2018",
    "text": "Amazing sandwiches, service and staff!!!  First time eating at Wildflower and really didn't know what to expect.  From the moment we walked in we were greeted with a big smile and welcome from Sami who was doing a impressive job at keeping all the tables clean after each person left.  We didn't know what to order and Maya was so friendly, helpful and had great suggestions and even gave me a sample so we could decide.  We decided on the ham and cheese which were handcrafted by Freddy.  Wow did he do a fantastic job and probably one of the best sandwiches we had in a long time.  You guys have made a customer for life!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "bfwTv9DohP2owQ8V5ZxfhQ"
  },
  "dXDZwiccXMvyCDTQK4A_tQ": {
    "date": "9/9/2018",
    "text": "I'm so glad I tried this place instead of the Panera. Even though I missed out on the Panera rewards. Everything about it was better. The quinoa veg salad was great as was the pumpkin latte. I had a 5 hr layover and spent several hours there, I'm glad I wandered over from C term and found this place. Every table had usb and wall plugs and the staff came by regularly to take trash and refill water and coffee. Daisy, Bruno and Samu were sooo nice. The service felt like a small cozy downtown bistro instead of an airport restaurant that wants you out as soon as they give you your food. Thank guys!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "COnWEdWo-RLfKTuUw8MLaQ",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. Power ports at every seat!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/COnWEdWo-RLfKTuUw8MLaQ/o.jpg"
      }
    ],
    "user_id": "ybNE301DRNBQvp5lChZdTg"
  },
  "uQrAtLNoSfl5rrvy9TbmWQ": {
    "date": "2/17/2016",
    "text": "My husband's father was traveling with no money. We called to pay over the phone for him to get some food.   Laura and her team were amazing and offered to make him a meal on their own. Best team ever that works there. Very impressed with their good hearts!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hkOQ78KfScbU6_6WdmqwOw"
  },
  "EWOTxE85Fkf3gIBTeeN0Xg": {
    "date": "8/30/2015",
    "text": "Seriously this is my favorite airport quick service. The food was super yummy. We had a bowl of soup and sandwich and then grabbed a cookie for the plane. The line moves quickly and there is a good amount of seating/standing room with lots and lots of plugs to charge your electronic devices. I loved that they were open late as many times later flights are stuck with prepackaged snacks or vending machines. This is a True gem and I would love to see this in other airports.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "0ZL5GlH3FjVJ9ATnGDNRGw"
  },
  "YCZU8dJFwfOEEUYddPZ0BQ": {
    "date": "2/21/2016",
    "text": "Stopped for a quick bite during a layover and it was spectacular. Ordered the spicy Cuban sandwich and it was tasty. I was working on my computer while waiting so I might have lost track of time but it didn't seem like I was waiting too long. The team member that brought out my sandwich apologized for the wait and offered me a cup of soup.   It was an awesome gesture and he was so sincere. I read other reviews talking about awesome service and he definitely lived up to.   Thanks for the great sandwich amazing service... And the soup!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vv3cnVRyr-5GX4aiZRIUcw"
  },
  "a_2X4ttMAiOzC0G49Ybwsw": {
    "date": "2/15/2017",
    "text": "Great salads, fresh ingredients. Only downside is that there isn't a full menu at the airport location. For airport food the cost is great and it's nice to not eat something greasy. It's easy to take salads through the tsa checkpoint!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_5LdGSGFerAZ3qIavav7sQ"
  },
  "ZzF6kWtJUHsau-O94bjkeg": {
    "date": "7/22/2015",
    "text": "A step above the typical airport salad. The Vegetable Quinoa Salad with chicken was very fresh and had great flavors. Also had a yummy smoothie. I wish food like this was available at more airports.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ln-fHocXqShzUF5beKwc3A"
  },
  "JIjsaPUk9a5Eg27Axp3jRg": {
    "date": "10/24/2015",
    "text": "Have come here few days ago. They have breakfast, sandwiches, soups, salads, and yummy drinks here. This place is a bit expensive but airport food is always insanely expensive so I guess it's to be expected. Highly recommend this place for u guys !!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "_U-yWCk3Twq9MqKoisutjw"
  },
  "k0AvcfwhrE3yJw9RMUATWA": {
    "date": "8/12/2015",
    "text": "This is a delicious place for a layover lunch! Between the three of us we tried a cold sandwich, hot half sandwich, soup, and a sweet roll - all were great! Tasty, fresh, and very creative ingredients.  Looking forward to the return trip!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "L11L03C5Z14zXvmv_gu3HQ"
  },
  "Oj8nUeDbt2scT1pY3LFfwQ": {
    "date": "6/1/2015",
    "text": "Puts a whole new standard to \"airport food.\" Breakfast sandwich,  \"Ultimate Bacon.\" Delicious, with a soft, warm brioche bun that makes me sad to know I'll never have it again. Perhaps they could add a little more pesto and a little less arugula, but all in all, a great way to fill up  for breakfast. On top of that - great music and power outlets! And most importantly: The long line snaking out into the airport floor didn't take much time at all. Ordered within 5 min. Received food within another 5. Perfect.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qw0o51KCoJe1kh6lGGkkeg"
  },
  "wXP7f8iECGeB0-hMERDJJQ": {
    "date": "12/20/2016",
    "text": "For airport food, this was a decent choice. They allowed me to customize my salad.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JyWLbWIPyFwSAfyDa6v_Og"
  },
  "W13HHuSUPnLu6J5U-IsZ9A": {
    "date": "11/19/2014",
    "text": "Nice to find healthy options when having a layover.  They had three ready made sandwich options that all sounded good.  I landed on a pesto, brie, sun dried tomato, and arugula sandwich.  It was perfectly seasoned with just a hint of salt and sweetness from the sun dried tomato.  The staff was friendly and efficient.  I felt for the price it was an excellent way to satisfy my hunger.  I'll be back next time through the PHX airport.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "iHB75LCfFkIC1Oj86CqT1A"
  },
  "7o9Zhnu17SYSWDVR3pArjQ": {
    "date": "1/13/2016",
    "text": "The very best cranberry scones I EVER had.  Not too sweet, satisfying texture and chewy cranberries.  When I told the girl how great they were she gave me one on the house. Edwin is the baker.  Terrific...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BxyXgIt5PkY6OADfdjb1HA"
  },
  "TNMAeP105Yefh0zDenNAmQ": {
    "date": "1/11/2016",
    "text": "I had two really good meals at Wildflower Bread while visiting Arizona over the past few days, one in Scottsdale and one in Sedona. So when I saw Wildflower at the Phoenix airport I thought it was a no brainier to pick Wildflower over the other airport restaurants. Wrong. I had the \"Ultimate Grilled Cheese\" - unfortunately it had an undetectable amount of cheese. I mean almost no cheese whatsoever. No cheese = little flavor, it was actually quite dry, especially around the edges. There was some cheese in the middle - not much - but literally no cheese at the edges.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X3WObTO7F4-EddRlR-4rjg"
  },
  "qhzk560Z7I9o3F4bcEXcvw": {
    "date": "5/1/2015",
    "text": "Great manager!!  Realizing I had a cane & needed assistance getting my items back to my flight gate, he bagged everything up and then offered me a pastry, gratis!  Exceptional attitude, great spiritred, another reason I love coming to this place! Oh, and the coffees pretty good, too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0qcMy4uLnoV9AoO_5GRjbA"
  },
  "SCULN1vfAS7ShnO7BrWVkw": {
    "date": "10/20/2015",
    "text": "While I dont expect the best at the airport, I do expect the coffee to at least be drinkable. Ordered an iced mocha, she served coffee and milk. No sweetness at all, she forgot the chocolate. Okay. So I asked if they could please remake it. She took my coffee, poured a ton of chocolate syrup on it, and shoved it back to me. Not a great way to be treated... I just wanted a decent coffee, man...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dIuYkwYX9zDctKN644P-Vg"
  },
  "ofEESG8oFM7hhY8LfJKZ5Q": {
    "date": "1/16/2017",
    "text": "Visited Wildflower before my flight and the food was ready very quickly. The service was beyond exceptional. Britney Reid was very kind and had such a great smile. She took great care of us. Will definitely come back here again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kSo1-eWHSvDcs6OH4wivzg"
  },
  "hLVxu_QU5uVM3LakEkSOlg": {
    "date": "11/6/2016",
    "text": "The bread made the sandwich! Great for breakfast. The lady at the register was also very pleasant",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rsuuX2HyMVWQdFNZOJGoig"
  },
  "dp4-A8WSkpwE2W5Qx-gsvA": {
    "date": "3/8/2015",
    "text": "My experience here was amazing. I was greeted very warmly and in an airport that's saying a lot. My food was made promptly so I could make it to my gate with plenty of time to eat before I got on the plane. I was given every dining accessory I could possibly need in my to go bag. Lastly, MY SALAD TASTED PHENOMENAL! I had the wildflower chopped salad and it was perfectly hearty and savory! The dressing was incredible (and I never eat salad dressing) and to add a bit of interest, they topped it with dried sweet corn. Genius! I can't say enough about the freshness and long lasting impression of the food and the quality of the service here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "izv3zbf1XLjz8Z9bGdOJgA"
  },
  "eBdKF5fNJ71zpqA26remyA": {
    "date": "11/27/2016",
    "text": "This is like a much much better Panera bread. Great food -- great value- without exception. We have gone here many times during visits to Sedona.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E3Wm8QYeVwz8IsXITIofoA"
  },
  "3hwzqGSX44EXWN10j0V2Wg": {
    "date": "9/20/2014",
    "text": "Best customer service and nicest people ever! My sandwich took unexpectedly long and was given freebies for the wait. A+",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "kitAOxUSgFGhR3JLPrDCvg"
  },
  "w1oh3nLBNanpTdhNyadxdw": {
    "date": "9/22/2015",
    "text": "Very good option for an airport.  Had a  sandwich and it was enjoyable and makes for a good meal on the plane.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qmVXmbchh1V-PYSpvWU_rw"
  },
  "5GtpN46POjrDcHgKcQeB4Q": {
    "date": "9/3/2019",
    "text": "I've eaten at many Wildflower locations and have enjoyed each one.  The menu is very robust and it's easy for all types of foodies to eat together in the same restaurant.  Whether you're just an average Joe or need to eat vegan, paleo, keto or something else.  You can all sit down together at Wildflower.  This airport location is a nice surprise and a bit of a relief.  You're not stuck with the usual fast food at terminal 4.  You can get a Wildflower salad or tasty breakfast dish for your journey.  Just remember, *don't* buy a drink if you're going to buy food for your flight.  The restaurant is located outside of security and although you can bring your food through the TSA checkpoint, you'll have to ditch any drinks you buy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5SestduEtjxmUMPeQmgNmA"
  },
  "jxPe-S77sNs586yuX9WbTQ": {
    "date": "8/26/2019",
    "text": "Very kind service at an airport establishment with a tasty kids sized sandwich for a big kid! The kids size is actually great for a small eater like me that doesn't like many toppings. I chose turkey, lettuce and tomato with mustard all on wheat bread and it suited my taste perfectly!   The turkey was not salty and tasted homemade while the bread was delicious!   Overall, I wouldn't hesitate to try this place again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4ayVX0YKY3GSP2IICpLJXQ"
  },
  "OrzJ0EtxYp6-s_htUAeMAg": {
    "date": "8/10/2019",
    "text": "I was waiting for a connecting flight and needed a quick sandwich to take along.  I stopped to grab one here.  Service was quick and sandwich had already been prepared.  I love tuna and that's the one I ordered.     On the flight I finally had an opportunity to have open the sandwich and eat it.  Sandwich was very cold.  My guess would be it was made in the morning because it was fresh but not overly fresh.  You could tell it had been sitting a little while.    The tuna was very taste-less and a little bland.  However, there were other seasonings that I wasn't too happy with.  I especially did not like the big apple chunks in my sandwich.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a8Yu6dm8ptckNlW2LDUbZg"
  },
  "DVVTJeQRxJAjDGsPKClgUA": {
    "date": "9/9/2019",
    "text": "Great service! I mean great. Young man Allen, I believe working the counter like a pro! I had the the roast beef sandwich. It was great.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bFii641L_HHm0BR-AgpodQ",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bFii641L_HHm0BR-AgpodQ/o.jpg"
      }
    ],
    "user_id": "RjdDMSrixgKfpVwbqnqYgQ"
  },
  "5B-k3q4i8-Zr1U134BS2Pg": {
    "date": "7/29/2019",
    "text": "If you're looking for something different than the typical fast food airport style places to eat, or a place with vegetarian options, look no further.  They have plenty of meat options too.  This place has plenty of fresh sandwiches, salads, and bowls to choose from, and the lines aren't crazy like some of the other places.    Although the sandwiches and salads are made ahead of time, the bread is still fresh and so are the rest of the items on the sandwich.    I had the tomato, arugula, and brie sandwich for $9 (remember, it is an airport after all, so prices are going to be high).  A sandwich is just a sandwich, and usually what makes or breaks it is the bread.  Well, the bread really made this one - it was fresh, soft, and oh so tasty.  The service was quick, and servers very polite - very unusual for an airport location.  :)",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 12,
      "cool": 10
    },
    "photos": [],
    "user_id": "vQAM8ZNOl9mzScxdwSd1DA"
  },
  "AGdgkEoRnDwmoSKigXxmbw": {
    "date": "9/14/2019",
    "text": "I eat here anytime I take a flight out of Phoenix. The food is always fresh and good flavor. This spot is clean and help is friendly. Today I'm ordering the tasty ultimate bacon breakfast sandwich.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jA_M0gkwjBaV305KdaZJXw"
  },
  "DqWC_eyGFTmHS18KdBr8oA": {
    "date": "9/11/2019",
    "text": "Went to grab a bagel real quick before starting work. Ive gotta say the service sucked. Cashier walked to the back right when i went to order. On her phone and just walking around back there where i could see her. Other staff saw me waiting and yet noone said anything. After about 5 mins she finally comes back to take my order. If i could remember her name id put it here. As i was waiting for my bagel i watched her ignore another customer while she was talking to the cooks and on her phone. Smh. Used to be if someone saw you standing in front of the register someone would ring you up..guess not anymore.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hZSeRURkTzGrATsXnFpQaA"
  },
  "pV2ggDVTQ1bZm0AQmWhv9g": {
    "date": "3/9/2019",
    "text": "Great airport option. Fresh Sammie, great ice tea. It's not the best produce, but it's always fresh. Add some salt and pepper and it's a nice fresh clean pick up in the way to the gate.  There are charging plugs for both usb and standard outlets. Sit and work while you eat.   Easy go to for salads and sammies!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "rgqfd-dkC8UBe3Vr9j4u0g",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. Turkey &amp;amp; Brie Samdwhich",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rgqfd-dkC8UBe3Vr9j4u0g/o.jpg"
      }
    ],
    "user_id": "kuVBLsd-NOhYCPKpzjKnPA"
  },
  "nKX3Vl8GiJi5ddT01wDdWg": {
    "date": "9/10/2019",
    "text": "Stopped for breakfast before my flight, Lupe made me a delicious latte and pastry, started my morning and trip out great!! Thanks for the wonderful service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OKUEm72Ftzo9N5WtWi87Zg"
  },
  "6mrwzLkypVGFc3CB9cAHMw": {
    "date": "7/27/2019",
    "text": "Worth the long walk to get here.  Anytime I have a layover I always make my way here for a very nice healthy option. Today I had the quinoa vegetable salad and enjoyed the fresh jicama, mint and greens. Sun dried tomatoes is a great travel smart idea.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "AizlLNBn83FJh29KXigCLw"
  },
  "Z5eV76vrLceEiosiIFosYQ": {
    "date": "7/20/2019",
    "text": "The food was so fresh and delicious! The gluten free cookie was amazing! The service was prompt but friendly! I like the option of how much dressing I wanted! The veggies were fresh and crisp! The store was very clean love the outdoor seating ! Would definitely go back !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "fvy8MKnSeurzltbcM7imgQ",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fvy8MKnSeurzltbcM7imgQ/o.jpg"
      }
    ],
    "user_id": "FSPJTAcis9WE7QBRdKkIGg"
  },
  "YA783b8I9Rzzu0Pzkl5W5Q": {
    "date": "8/28/2019",
    "text": "This was pretty overrated. I had a hard time telling if the bread had award-winning taste cuz my tuna sandwich was soggy. The soup that came with it was a smoked salmon chowder, and also runny and overly salty. My expectations for airport food are not high, but on a place with 4 yelp stars I get my hopes up",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0kUH9Zi-MKZybdUF1Fpfkg"
  },
  "Aj9NhimhA_DYbJEL44HTRw": {
    "date": "10/28/2018",
    "text": "I've been here a few times when I land in Phoenix Sky Harbor Airport. I usually get a soup and sandwich, hot tea and cookie. The lady manager at the time was very friendly and helpful.  The Menu changed a bit; but I still tried their soup and turkey cranberry sandwich. The soup was good but the sandwich wasn't like the ones I had before. Not much flavor. Maybe because the workers who made it wasn't enthusiastic.   But the new lady manager was very attentive at asking if we enjoyed our meal and when I mentioned how I didn't really like the Turkey cranberry sandwich, she quickly refunded me and gave me another sandwich of choice. Excellent customer service!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_gwvCdX7RYc6usrpx0LIGg",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. Great service",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_gwvCdX7RYc6usrpx0LIGg/o.jpg"
      },
      {
        "img_id": "z1QQnTWGNQSahFkI4pcdAA",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. Second Chicken Salad sandwich",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/z1QQnTWGNQSahFkI4pcdAA/o.jpg"
      },
      {
        "img_id": "CimkavRCo3SPNV8n9qdYhw",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CimkavRCo3SPNV8n9qdYhw/o.jpg"
      }
    ],
    "user_id": "PN_TA5PO9WI7LZjUNFS1YQ"
  },
  "8m-cw--nR5ytT36dQhwinA": {
    "date": "1/20/2019",
    "text": "Quick breakfast stop before our flight. My wife got oatmeal, good fruits and a side of brown sugar. The oatmeal was a bit stiff, so she had to go back up and add some milk, but overall it was tasty. I got the Spicy Chipotle Egg sandwich. The bun was soft and tasty, and there was a generous helping of egg, with a bit of sausage, tomato, spinach, and a zingy sauce. The sauce was a bit unevenly distributed, but had a good kick and was tasty.   Order came out pretty quickly, which is important at the airport. When you're in the queue, there is an employee who only retrieves items out of the display cases for you (muffins, cookies, parfaits, pre-made sandwiches, etc.). For any items that need to be prepared and for coffee, you order at the register. That was a bit confusing for many in line, although the employee did explain it over and over!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "saooOqCMJfLMhb09BfMIEg"
  },
  "xNP6bJPlPd5GrdcUffFHww": {
    "date": "11/25/2018",
    "text": "Healthy and fresh option for airport food! I stopped here twice on my 2 layovers this week-- once for breakfast and once for lunch. The Spicy Chipotle Egg Breakfast Sandwich was so delicious and filling! Broccoli Cheddar Soup came in a huge bowl with a side of bread. Skip Panda Express and hop over here instead!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "22Fi2wSSTu0NywPHUxWWAQ",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. Spicy Chipotle Egg sandwich",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/22Fi2wSSTu0NywPHUxWWAQ/o.jpg"
      },
      {
        "img_id": "o_6mz9-f_79LX7oO8j2ZjA",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. Spicy Cuban",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/o_6mz9-f_79LX7oO8j2ZjA/o.jpg"
      }
    ],
    "user_id": "OH93UQIpOSHdYH86UEflhw"
  },
  "i3ugIt6dubADm3onFQQQlA": {
    "date": "2/3/2019",
    "text": "They serve fresh food AROUND the CLOCK, in the airport. Loved the Asian chicken salad, very light and the mint tea is just refreshing. Compare to other places, the price is decent and service is quick.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "q1xGlckKVUs3EOx-WdNYGw",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/q1xGlckKVUs3EOx-WdNYGw/o.jpg"
      },
      {
        "img_id": "VVk2QxVC54-E7WjxEJmAsw",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. Asian chicken salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VVk2QxVC54-E7WjxEJmAsw/o.jpg"
      }
    ],
    "user_id": "yUngqxBzqCgcdL4heo4Heg"
  },
  "89MmHmFE6-h0bsmNbzXwPA": {
    "date": "2/3/2019",
    "text": "I had 3 hours to kill between connections, so I had plenty of time to yelp and read some reviews for places to eat at the airport. I came across Wildflower, and thought I'd give it a try being so highly rated. Customer service was great. Definitely 5/5. The person helping me was very informative with the products. I placed my order, and had it about 10 minutes later. Now, the food, this is where the 3/5 comes in. The mac and cheese sounded amazing, but it was just some ziti pasta thrown in cheese sauce. The cheese sauce was watery and had almost no flavor. I also ordered a roast beef sandwich. It was just ok. The roast beef wasn't what I thought it would be. It's more steak than roast beef. The bread was also too hard for my taste. My mouth is still feeling it from how hard it was.  **UPDATE** Within 24 hours the founder of Wildflower contacted me to make things right. That goes to show just how great the customer service is! Although I am in Texas, I will definitely keep them in mind while traveling to give them a 2nd shot!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VdP8MQQY4lv1ycdUavklXw"
  },
  "5CCzRBgcg3YQXSYdYr_ong": {
    "date": "5/31/2018",
    "text": "I have been on what it felt like a never-ending search for a good, healthy and tasty food at airports. When I traveled to Phoenix, Arizona, I found this spot, a bit far from my gate, but I was willing to walk 15 -20 min inside the terminal for a good food.  Seems like a popular spot at this airport, it had a long line, but the line moved quickly with efficient staffs. They had some seating, but it was mostly taken.  Most of the people were ordering salad or sandwiches, and they were pre-made and ready to go in the window showcase. Their staff make them in the kitchen right in the back, so they are pretty darn fresh! It helped with the purchasing process, and to move the line along.  Since I was going to get on a flight home, and I was not getting any food on the plane, I decided to get a scone and a salad. I chose Chocolate Chip Scone which was bigger than I expected. It was very satisfying and delicious!  Then I found a nice surprise in a bag, my salad came with a complimentary bread! I could tell it was not some cheap piece of bread, but high quality one. How awesome!  For salad, I chose Wildflower Chopped Salad, and it was a really nice, big salad! It was super fresh and put together beautifully. The quality was very noticeably high. Lots of texture, flavor and ingredients mixed together in a perfect harmony and became one big delicious family! An awesome salad!!!  I also couldn't help myself from getting one of their popular cookies... Chocolate Chip Hazelnut Cookie with Sea Salt which was huge, bigger than my hand. It was soft, moist, again with all the high quality ingredients. Yum!!!  Kudos to wildflowers! Now I know it is possible to eat well at an airport! Everything I had was just amazingly delicious, high quality, healthy... All we need now is to have Wildflower Bread Company at each and every airports!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ycmVNA_0z73XBcGAw9Ot5g",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. Chop Salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ycmVNA_0z73XBcGAw9Ot5g/o.jpg"
      },
      {
        "img_id": "s59bLYGVrE51mnIXEjcTyw",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. Chop Salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/s59bLYGVrE51mnIXEjcTyw/o.jpg"
      },
      {
        "img_id": "v-jjPahKbFggGytfYRb44g",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/v-jjPahKbFggGytfYRb44g/o.jpg"
      }
    ],
    "user_id": "xLJhiR7QIbLTFWX6FzUQ7A"
  },
  "gckUZOYztJUhFgiEt-zVCw": {
    "date": "4/11/2019",
    "text": "My expectations for airport food aren't normally high so I was pleasantly surprised by the deliciousness of my breakfast sandwich.  I had the spicy chipotle egg sandwich and it was really good. Fresh roll, eggs well cooked, chipotle sauce was tasty and spicy.  My wife has the egg breakfast and said the rosemary potatoes were a nice surprise.  Pretty reasonable on prices compared to other airport food.  I have a happy belly for my plane ride now.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "vvBfoQf7ObV3YUg0JVgfYg"
  },
  "GJRsLwNxqkAGczaTQUVzgA": {
    "date": "1/11/2019",
    "text": "Fresh veggies but you know in airport things are more expensive about 20-30% more. Came Friday 11 am and no queue lots of space. Their soup taste find and don't have the feeling of instant soup or can food taste like some other places. I wanna try their cookies and bread but no carbon for me as I ate too much during this trip already! Have more veggies guys!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CL4zAmZ5OCamEnl00NrcaA",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CL4zAmZ5OCamEnl00NrcaA/o.jpg"
      },
      {
        "img_id": "5EujX3aD0Jj2QrPWOC3kIQ",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5EujX3aD0Jj2QrPWOC3kIQ/o.jpg"
      }
    ],
    "user_id": "0amUDN39lxE3uL_ODAS5jA"
  },
  "64lB7v5YPzN6XDa4LVmF0A": {
    "date": "6/30/2015",
    "text": "The food was excellent and the staff did a excellent job as well. I would grab a light sandwich here if you are running by. I want to try he Albacore Tuna next time!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ppAkzt57zgmeaI_DdmgOTg",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. Salads yummy pastries and tasty cold sandwiches. Love he Albacore Tuna sandwich",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ppAkzt57zgmeaI_DdmgOTg/o.jpg"
      },
      {
        "img_id": "zBiDTDRZaxJ8BWyRoLwpmA",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. Excellent place to grab a bite to eat while traveling through Phoenix",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zBiDTDRZaxJ8BWyRoLwpmA/o.jpg"
      }
    ],
    "user_id": "qkYKhlOqUXVeLCY1YQLyoA"
  },
  "mXc-Xi9vnwZjJY4nvLUxEg": {
    "date": "10/7/2017",
    "text": "Stopped in for breakfast. My first time at Wildflower. The gentleman helping me order was very friendly. He helped me customize a breakfast sandwich with chicken and regular scrambled eggs instead of egg whites- it absolutely delicious. Another coworker even delivered the food to my table and they gave me a free cookie for being so excited about the sandwich and wildflower experience. Amazing customer service and loved the sandwich!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HCQhwvLzl7eyvQ3xLRejFw"
  },
  "ieH5P_Bvuyp9pO4e25-CBA": {
    "date": "6/5/2016",
    "text": "Great salads & breads. First one I ever ate at was in Sedona Arizona. Can't say enough good about the large yummy salads.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "IUDF3CTfrOsykgSW0F1pdQ"
  },
  "lsvmS6r5OysRXKh19uKQuw": {
    "date": "7/20/2016",
    "text": "One of the better options I have had at an airport, especially Sky Harbor. The soup and (Cuban) sandwich combo was pretty reasonably priced, and very delicious. Very friendly staff.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wTGFI5Mz0hb68Xr22nDWxQ"
  },
  "jta3DSc3Vr2KMEj1juzAlw": {
    "date": "2/9/2015",
    "text": "This place reminds me of Panera and Au Bon Pain. I got the ultimate grilled cheese. Not sure why they put tomato and arugula on grilled cheese. What ever happened to good old fashioned cheese and bread? lol The chocolate chip cookie was good. It was huge.  This place is a bit expensive but airport food is always insanely expensive so I guess it's to be expected. This is probably one of the healthiest options at the airport though.   Service was quick and the cashier was friendly.  Overall this place is nothing special. Not bad, not good.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UWdibGtq55hgSXLvsgtDHQ"
  },
  "Pf_FvaF7mK17cAjaZBPuiQ": {
    "date": "6/16/2015",
    "text": "I decided to stop by because of my layover. They have breakfast, sandwiches, soups, salads, and yummy drinks here. I ordered a turkey BLT sandwich which has chipotle and avocado on Challah bread. It is really flavorful and fresh. I also ordered a Georgia peach frozen drink and its really good. It includes lavender in it and you can really taste it. The staff was also friendly and knowledgeable. A plus side to this place is that they have bars with outlets to charge your electronics. All in all, I hope I get a layover near the A gates next time when I'm in PHX so I can stop by here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BiG7mNy6QnYHuxMSovJorA",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. Turkey BLT with Georgia Peach drink.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BiG7mNy6QnYHuxMSovJorA/o.jpg"
      }
    ],
    "user_id": "dOCDbQAT-QsV8Bpyfdj44A"
  },
  "lhpGl2GJJQegbHlxO8Lk0g": {
    "date": "10/3/2017",
    "text": "What an unexpected treat it was stopping here earlier today. Crunched for time, I picked up an Asian chicken salad and a large passion tea to take on the plane. Yummay. Great veggies and dressing. The employees were courteous, made friendly eye contact and treated us professionally. Will return next time I am in Phoenix.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G8fcTQiBRWelnxG0mBIeFw"
  },
  "pI6qXCYzY_upZQ-8H8Yt4Q": {
    "date": "7/22/2016",
    "text": "The Wildflower Chopped Salad is to die for!  Imagine healthy eating at the airport waiting for your plane...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RwJb1tFuUqfIFTDTV7AF-w"
  },
  "u_e0EHPTkPHBNW4zPg5C4Q": {
    "date": "7/1/2016",
    "text": "Thank you sooooo much for having one of your locations at the airport.  What an oasis in an otherwise food desert of fast food.  I've always heard that Phoenix airport offered better tasting food options and your restaurant confirmed this.  I generally change planes in Dallas....well not any more.  A great tasting salad with Quinoa, good dressing and other tasty morsels was nirvana to stumble upon.  The young man who assisted me was polite, helpful and friendly.  And the roll that came with the salad was also yummy.  I'm very grateful to you.  As someone who eats primarily organic foods traveling is a huge challenge to me and unless I pack my own lunches from home, I'm usually hungry when I travel.  Hats off to a great company thinking outside the box.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9ZzQTsT0ZPRZhSY3zESWGQ"
  },
  "JMssM_iTrqCPYr76-tJYGw": {
    "date": "7/17/2016",
    "text": "Serviceable. More affordable than most airports food options but nothing inspiring. Mushroom barley soup clearly comes from a bag.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e_Xe4rAn08tjfFcoYFdNbw"
  },
  "p6Dee2r5GfWnMoQf4Z2ZPA": {
    "date": "1/11/2015",
    "text": "This was surprisingly good. Usually unimpressed with places in airports. Got a tomato, basil, feta egg white sandwich on multigrain bread.. Good flavor. Light and healthy tasting. Service was fast, which was surprising considering the line. I also got a latte. Ordered a small and got 12oz.. which was bigger than expected. Earthy flavor. Decent. Price was reasonable.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gceE2mlTEWm42C2c_F9c7Q"
  },
  "F2JRuDKRPjrjrmxInA7BVw": {
    "date": "5/28/2016",
    "text": "Awesome wildflower, remarkable team in the morning and at night! Great and helpful! I recommend it if you are in the lower A concourse, specially if you love healthy, local foods including sandwiches, unique soups and salads! What I really love getting for breakfast is the chipotle egg sandwich, love the house made chipotle sauce! Get the Ultimate Grilled Cheese for lunch 3 types of cheeses with arugula lettuce and roasted tomatoes, and of course the turkey blt plus, one word delish! Dining room is always nice with two tvs and room for charging your laptop and phones for that next flight! Definitely stop by for great food and great friendly service that makes you want to come back for more! An unique airport experience, but if you are used to the local outside wildflower you'll still have all your favorite pastries and coffee drinks but just a smaller condensed menu for the grab, order and go type of feel.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PL3DlMTkqrC_TwDsUhNzwg"
  },
  "K33OCGKX0h73V9k_POcFGg": {
    "date": "9/25/2016",
    "text": "Stopped in for a quick bite before my flight. Was surprised by the shear pleasantness of the staff and tasty food options. For the weary traveler expecting often rushed service, this is a welcome change to the typical chain restaurant and grease infused garbage.   Congrats to wildflower for breaking this mold.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tjj6PerQwqF94XfR7RwxGw"
  },
  "kjV8TR9dAYzz33x1Xo6zgg": {
    "date": "9/26/2017",
    "text": "This is my boyfriend and I's first experience dining at Wildflower Bread Company. I speak for both of us by saying this was a delightful experience! First Kudos go to the staff under the professional and approachable Manager Adrienn. We were met with smiling faces of cheer who assisted us by answering our inquiries in regard to the inviting Menu.. I preface this by the unexpected agenda we were under after our Airlines had a one hour delay in boarding/takeoff due to a safety issue. This interfered with us making our connecting flight to our eventual destination for my boyfriends Corporate Convention in Minneapolis. One can imagine the state of stress this ushered into our unexpected venture. We selected Wildflower Bread CO. due to the initial ambiance followed by an equally impressive choice of healthy menu items. The highlight before the food arriving was the friendliness of the cashier who was a becon of light that never stopped. High praises to this well managed crew of flowers. Isavel who delivered our Turkey Sandwiches with delicious soups to boot. She followed through with a continued warmth and customer service supreme. Britner R. , Brittany M and the energetic cooking staff who prepared a delicious menagerie of taste. It engaged all our senses and initiated a better tone to our day. Many thanks!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ujpP5MFYDrFFOwxDRLYsVw"
  },
  "7PkzwDssg0js-mpSSUyesw": {
    "date": "1/12/2016",
    "text": "Great egg white, roasted tomato and feta sandwich and coffee!  Best part was the friendly service --they went above and beyond.  Free coffee refills and nice relaxing music.  Very clean and will be back, definitely!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "UNixrWG4IyywITPgyzf0ww"
  },
  "_a5SIl_SlmApLHHOjNOs-A": {
    "date": "10/27/2015",
    "text": "Meh. Went for a tuna sandwich without cheese or mustard. It was pretty bland, bread was too soft. Overpriced. I walked every gate looking for something different to take onto my flight. There are about 20 restaurants all exactly the same. I guess if you like Turkey and provolone there are probably some good dining options here. Dreadful.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "iFoyT7lmT7UDxLV3botlKQ"
  },
  "MKmYGdW8LEnpJ4UZ5Ugs3A": {
    "date": "8/9/2017",
    "text": "Wednesday morning 9:00 am and music is annoyingly loud as if you were in a bar. Forget talking to each other. Ordered Grilled Ham and Egg Sandwich. I swear it was microwaved like a fast food place would.  Opened it up and there were three (3) tiny pieces of ham about the size of half of a dime. $ 6.99.  Turn the music down, serve fresh food. We're big fans of Tempe location and we're sad to experience such a disappointing meal.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZhWgS3SYCrHfV3e8CUNecQ"
  },
  "MwxmGDW3OZ1pMemJbRVA3g": {
    "date": "7/3/2017",
    "text": "This place was great, not even considering it's at the airport.  And reasonably priced for airport food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i2lhOtO4SyJ3bawBCJOCGA"
  },
  "yvkJaBLFqa7xquhaFSoCkg": {
    "date": "5/3/2015",
    "text": "I love this place. The food is good, healthy and reasonable priced. The staff here is always so very very nice. It is just a feel good place all the way around.  There is a lady that works there (wish I would have gotten her name) who just seems so motherly and caring. She was the one delivering food once the order came up. She gave the little boy next to me a cookie because he was reading a cookie monster book and he was so thrilled. Hard to find lovely people these days.  So I always find time to stop here and eat on my travels through the Phoenix airport.  The downside is that it is before you go through TSA, so give yourself plenty of time to stop here and eat.  I just LOVE their coffee but unfortunately I have to finish it before going through TSA. I hate that part.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JSqmsGAX93RlfEsfB9UCTg"
  },
  "Fd9wzV4u2Y_bJu7Z7tdDPg": {
    "date": "4/14/2016",
    "text": "Food and service in this place is amazing :) I was suggested a taste of the soups today and I was delighted with both the soup and the salad I purchased. Couldnt ask for more in an airport :). Very happy camper :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ULFJ4XhAIvF5jaNJmFEQuA"
  },
  "sCK8M68ehMtcGrCN6wEsEA": {
    "date": "6/29/2018",
    "text": "What great customer service! Samantha helped us figure out what items could be easily made vegan. She was super friendly! The quinoa salad was fantastic!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JVYqBcWYvlbeU-BKAdUyHg"
  },
  "fcRZ-K1L4YBkkcuNgHVa7A": {
    "date": "11/22/2016",
    "text": "4 stars for the super friendly service. 3 stars for the food.   The menu here is more limited than Wildflower's outside the airport - I wanted to try the Wildflower Triple Club, but unfortunately it's not offered at this location. They did have the Turkey Cranberry Walnut Stuffing and most, if not all, of their Classics.   The food wasn't bad, my chicken lemon soup tasted pretty good, although I wouldn't say it was great. All in all, a decent airport option.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WyKF2lFR3rPFr4LQsT_B9g"
  },
  "da8htzNOW72Q0AgW2_fIZw": {
    "date": "6/6/2017",
    "text": "Ordered a tuna sandwich,  it should have been called a cheese and mustard sandwich.  There wasnt a table spoon of tuna between 2 pieces of stale bread.    Whoever made tbe sandwich must like mustard because the sandwich was dripping in it.  Maybe that was there way of hiding the fact that there was no tuna.  Would have returned the sandwich and  asked for my money back but was boarding a plane.  That is probably banking on.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "ujPDy_xPOmC8tgzizzGpsw"
  },
  "R7tHyowYRUFCvelhfLAwFA": {
    "date": "10/17/2017",
    "text": "I'm not sure why they have high ratings. The cold sandwiches are pre made, the bread was soggy.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Af8QdWjxOW64efpVkJqoag"
  },
  "ab2XKZFeWADi84qndfhFLg": {
    "date": "5/12/2015",
    "text": "Pleasantly surprised by this late night dining experience in the Phoenix airport.  Greeted immediately as I entered the area and the young man (with an awesome fro) that was working the register was all smiles and very welcoming.  Very nice at this time of night (well at any time really).  The Ultimate Grilled Cheese was pretty good - so good that I scarfed it down before remembering to take a photo for this review.  You'll have to trust me on this one.  Everyone here has a smile. I love that!  And there's a nice bank of seating that includes power outlets.  What more could one ask for in an airport eating establishment?  Nothing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "6zCbtpoSW-gBH30ymsZ1NQ",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6zCbtpoSW-gBH30ymsZ1NQ/o.jpg"
      }
    ],
    "user_id": "Z3nwYQzDUimoUl8LNDIxjQ"
  },
  "m4CK-uGlFWLFlJTh0shzSA": {
    "date": "4/7/2015",
    "text": "I had a bagel, pricey but not surprised it in an airport.  They initially gave me the wrong bag and they seemed a bit confused but it was super busy.  I am guessing it is always super busy though.  A new system would help them manage the tidal wave of customers.  I would go back if I was there and desired sustenance.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "7XSASqhhAcjCh6DKufBo1g",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7XSASqhhAcjCh6DKufBo1g/o.jpg"
      }
    ],
    "user_id": "HzeVbLwHoWdNGA1IYWJ-nw"
  },
  "QH7fWBMSZS5Tmn20vNndAQ": {
    "date": "3/7/2015",
    "text": "This is a great spot for some quality sandwiches. I tried the blt and it was pretty good. My friend wanted to purchase a cookie but the size of the dessert is so big. So the worker gave us a kid size cookie for free!!   This place is located near gate B & Smash burger before security check.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "T4rXSHtNUOA47GXS63S6mg"
  },
  "CKOi1BqIyrb4Gd1BnqkYXg": {
    "date": "4/4/2017",
    "text": "Super fast service & GREAT attitude for airport workers. The girl who served me was genuinely interested in how my day was going. Very pleasant experience and the food was good too! Thank you for making my layover better.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "7MIzSojCj9YTqPyXYkxAFA"
  },
  "XWk6OyeHse526aeO1RVrJA": {
    "date": "8/17/2017",
    "text": "Staff was friendly but food is all premade and on par with gas station sandwiches. $25 for two was also crazy! We threw everything but the half soup out.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "SPHCzh82a9cHs9TV_0ODpg"
  },
  "HUkPi5gkLQra223299FFQg": {
    "date": "4/17/2015",
    "text": "This is the spot to eat if your in the Phoenix airport.  Fresh food that taste good and pent receptacles for charging devices between flights. They were thinking about travelers when designed this. To keep the line moving. You order and they bring you you're food's.  Not bad deal since you will need a moment to grab a place to sit.  The staff on today work very well together. Lots of good choices on the slim menu. Definitely not over priced for airport foods.   Stop on if your on a layover or when exiting and want a good sandwhich.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fnxXONGMKeOF8oMmoCTuWw"
  },
  "7LJO1JVdCWkBxU6FU_Lt4Q": {
    "date": "10/12/2017",
    "text": "Unbelievable customer service!  These guys aim to please!!! You can tell Felix, Raul & Jaime really love they do!  It shows! Besides the great food and healthier choices for airport food--I'll continue to go back mainly because of Felix, Raul & Jaime!!!  They're at gate A9!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8p6a6PUMoZ17Kt4kun0UWg"
  },
  "O53d8vkpZvPR2eITxnwD4g": {
    "date": "6/16/2017",
    "text": "On a lay over. Looking for something fresh and tasty. This place jumped out at me. The food was great! Little pricy but that's ok. Worth it for airport choices. Was helped by young guy. Very helpful friendly and you can just tell he works hard. Very refreshing after getting off a plane.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DyAgLOaf3hQ5b3CLPSaOgg"
  },
  "hshmBDs4osqi7jVjrLt0nA": {
    "date": "12/1/2014",
    "text": "Not a lot of healthy options when traveling so this place is a must for me whenever I am in Phoenix Airport which is every other week.   Their soups always taste great and super hot. Their sandwiches are also so fresh and tastes great.   I agree with everyone who posted a review that their customer service is excellent.  Little tip: if you ask for a cup of water, they will give you a 12 oz water in their wild flower plastic cups with lip for free.   I am deff a fan of this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZEKLwT8cqw8rFhPwdP-dCg"
  },
  "XHh4YEMvmXJ0j-5KnBBgwg": {
    "date": "4/12/2017",
    "text": "Great sandwiches.  Very fresh and delicious.  Pastries from the bakery as well are delectable and great for breakfast.  I'll be back to this gem of a spot next time I'm at this airport for sure.  Line wasn't so bad either.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "FFo6LcBgaFiUgcUHvGqTag"
  },
  "MoJJdHTpgsk9eVS57FQR_g": {
    "date": "9/23/2017",
    "text": "On the way back from NY and since I'm still on East Coast time, I'm hungry.  Wildflower was the closest to my gate.  Got a Albacore Almond Tuna on Challah bread.  Requested no mayo on the bread (yeah, I know tuna salad is made with mayo) because I despise it! They made me a fresh one and it was great.   The bread was fresh, slightly sweet and just a little chewy. Actually the bread was awesome.  Came with almonds, apple (not too much in fact I didn't notice it until the last bite), celery, scallions, Swiss, tomato and Romaine with grain mustard.  Pretty darn good.  Not as good as a Bella Napoli Mixed Italian in Albany but, a nice sandwich.  Quick and clean and they even have chargers at their high top tables to recharge those drained cell phone batteries.  Check it out. I think you would agree that this is way better than that other sandwich place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U-yyxIuO7BNF7VZZu4-bVA"
  },
  "g8rzDBHH6VG4NiQOCjmAIQ": {
    "date": "4/25/2018",
    "text": "7:45am and the food tasted like it had been sitting for two days.  Only thing to buy close to Gate A11.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PDR5fsXS-KNSeZ3vMzcZsQ"
  },
  "S3lCbn4FuFebj1L0Arw3tA": {
    "date": "7/30/2016",
    "text": "Really good food, cold and hot sandwiches, soups coffee and cold soda drinks.  Pretty pricy $$$ but  than again it's airport.  One thing I didn't like is the fact that guys behind counter were  bit arrogant other wise good food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "n9yC48z3AN3ZJ_X9Lq0NJw",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/n9yC48z3AN3ZJ_X9Lq0NJw/o.jpg"
      }
    ],
    "user_id": "HxL8rTluKRUABDKn9tO9Rw"
  },
  "t0jshrQh13tGiiLE1Hat-w": {
    "date": "12/24/2016",
    "text": "We stopped in this morning before our flight back East for the holidays and had a great experience.  The staff was extremely welcoming and friendly, the menu was extensive and the food was good.  I enjoyed a half turkey, tomato and brie sandwich with a bowl of spicy chicken enchilada soup and my husband had the ham and egg breakfast sandwich with fruit - all quite good.  It makes the experience even better when the entire staff seems to enjoy what they are doing even when they are working on Christmas Eve!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "cMEtAiW60I5wE_vLfTxoJQ"
  },
  "G1leqQi9efvlXTjPYdCVWw": {
    "date": "2/21/2016",
    "text": "This is my go-to place for coffee/danish when I am connecting through Sky Harbor in terminal B.  They do a great job with their espresso drinks and their danish/sandwich selection is fantastic and fresh.  They also do salads however I have never tried one.  I am usually all about their Caramel Latte and Croissant!  The prices are reasonable for the airport and they have really great friendly service!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0yrF14nWVAFeI0fG29a63g"
  },
  "7UH8kSPnUDAt-_HxLkPrpQ": {
    "date": "5/16/2017",
    "text": "Fun food truck, but I thought their pizza was just ok. They scrimp a bit on the sauce and toppings, and I wish they had more options. Not bad, just not amazing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "PRGtQZznMp8U0n_3kbruug"
  },
  "nsFMZXZ4l_iUzyC8K3koaQ": {
    "date": "1/14/2016",
    "text": "Lucky for me there was no line so no wait. I ordered the half tomato, basil, pesto sandwich with a fruit cup. I wanted something healthier than a burger and fries. Alright for $11 food at an airport. The sandwich was good but I think it would have been better panini style. The melons and grapes in the fruit salad tasted about a day away from being too old. Not grand but not horrible but I've definitely had better.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "gXLTS8ftydM1Bsta7VPD-w"
  },
  "itNWwNxFIF-XJ0nfsz5p0w": {
    "date": "9/13/2017",
    "text": "Had a spicy chipotle egg sandwich and it was awful.  The brioche roll would have been good when  fresh, but it was stale.  The spread was gross and decidedly not spicy.  Not good.  The service was ok.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UM2ddHV68UD6-LAfxcmQgA"
  },
  "dB4BefRrIe3sXeH2PhoLLQ": {
    "date": "12/31/2016",
    "text": "Best customer service EVER. This is a great story, please read along.  December 31, 8.30pm, we stop at Phoenix airport to buy a salad at  Wildflower and a drink. Both excellent and fresh. my 10-year old daughter manages to forget her luggage at the register as she carries her ice tea. We board our plane and only realize she forgot it as we land in LA. Panic moment. My daughter is in tears. I am very upset. I was lucky enough to have the receipt that had the manager's cell number. It's now over 10pm and I have near no hope that someone will get back to me on NYE. But 30min later, my phone actually rings and it's the founder himself. He found the luggage and he offers to ship it back at no charge when realizing we don't live in Phoenix. Amazing act of kindness. I offer to pay for shipping and his response  was ' do something nice to someone else'. Selfless, and Very rare in this crazy world we live in. Lesson of hope & kindness. There are good people left. Way to start 2017 as well!  Ps the food was very good too. Sorry for blabbing!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "JfMC23bbMwlrbp87WjmdNA"
  },
  "cqnx8C6u25nLp6dtObnWIA": {
    "date": "6/4/2017",
    "text": "Received a recommendation to check out this restaurant by one of the information volunteers at the airport.  I'm so glad I listened to him.  Got the chopped salad - it was great.  Fair price; so fresh and yummy.  Fast and courteous customer service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9bs-jvAayiWN1Hq2iDLiXw"
  },
  "KbhBPQPbnxA4Nb7n-qQiKg": {
    "date": "3/25/2018",
    "text": "I am \"Super Fan\" of this place! I am a Flight Attendant and it gets old eating the same foods at airports. Well never at Wildflower! I look fwd to any flights that take me thru Phoenix. Because I know where I am going to be dining! I have told several fellow FAs about this Awesome place  and they are now hooked too! I tell anyone looking for Good, Fresh and Amazing food to go to Wildflower! I am laying over in Phoenix this week. Wildflower chopped salad (and a chocolate Pumpkin muffin) here I come!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z0zIVX5AzyFAASlH_oW-qA"
  },
  "ajb1Vnco4v94Vjkn8sr8Pw": {
    "date": "7/4/2017",
    "text": "Vegetable squash soup: 4. Pesto tomato cheese sandwich: 2. Can't taste the pesto, needs more tomato as it mostly tastes like bread and cheese. Portion size: 3. Airport priced and sized: 2.5 - $10+ for a half sandwich and soup. $16+ for a whole sandwich and soup.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qH1vbw7Cw3sdo_lvHlEg7A"
  },
  "1ar2ACyzzboVdgL0twzsZg": {
    "date": "2/3/2018",
    "text": "There could not be a sweeter/kinder staff in the Sky Harbor Airport than this team. Whatever their management is doing, they are doing it right  as their customer service is above and beyond. A special shout-out to Samii for going above and beyond!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ANQ_FtWQLNJo555uxj111w"
  },
  "qy1DT1v0jq6i83jvvo7yuA": {
    "date": "2/28/2018",
    "text": "While waiting for my sandwich to be prepared, noticed a sick employee making the sandwiches. Had gloves on but kept wiping her nose with her sleeve etc.  this is how we get sick while traveling folks. I requested a refund and they graciously gave it to me.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zy77eFBgwPTrsLFkikifzw"
  },
  "SOySGROS50-ZW3mtg9ysyg": {
    "date": "2/26/2017",
    "text": "Excellent potato cream cheese soup. Very rich and hearty. Great for a sore throat. Paired with half sandwich of turkey, tomato and Brie. Nice combo.  Finished off lunch with a huge delicious chocolate hazelnut sea salt cookie.  Nice break between flights.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rbPD2XnDFn-kqRAoHvrLRg"
  },
  "T6D0qaV_Qc7jDlIU5TBvWg": {
    "date": "4/13/2017",
    "text": "This was a great place to stop by as they had a variety of baked goods to choose from and I enjoyed my chocolate croissant and hope to stop by and try more later!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ry0kAvWu83fu-Ku8jcMLoQ"
  },
  "DM_RUchLHwveVj2rd-d1AQ": {
    "date": "9/11/2018",
    "text": "I love this place! The line was fast. An employee named Maya was so nice! 10/10 would recommend this place!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OO8QBHLnArv8Mud9x3sziA"
  },
  "3rFqjGMGgk3NfW4tm5bKnw": {
    "date": "10/28/2017",
    "text": "Daniel and Raul are such friendly people. I am so happy with my service. Such a positive environment to have a nice yummy lunch and amazing cookies here! Super satisfied!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "P9UeWZLopyyJ-ctdjvvPmQ"
  },
  "yEiFuDPZ4wljb2j5_fZBlg": {
    "date": "11/16/2015",
    "text": "Another \"meh\" location in the culinary wasteland that is the Phoenix airport.   On a short layover (like 30 minutes short) I ran through this place to grab something to eat to spare myself the salt-lick that is an airplane sandwich. I ordered a panini and specifically asked for one sans-pickles. Not only do I hate pickles but something in my allergies makes pickles hate me.  It took a while to make the sandwich (now boarding zone 2), and I was okay with that because I was probably getting something made fresh.  Picture me running my big butt on the plane, door closing, me opening my sandwich. Pickles. Lots and lots of pickles.  $10 sandwich in the trash and another $10 spent on a salt lick sandwich on the plane.  Here's the GREAT news:  I sent a Twitter message to Wildflower and was immediately contacted by someone. I called them when I landed 4 hours later and they credited back my purchase, even without a receipt. I like that level of customer service and, next time, will let you know if the food is as tasty as the customer service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "z_3g5HK6Dp01bMDAD7-N3Q"
  },
  "6PLG46x_zqxAqvI4AoSncQ": {
    "date": "11/27/2017",
    "text": "Ornery staff arguing with each other in front of customers. Sandwhich had to be \"remade\" because my order was forgotten. Then, took a bite and found a large chunk of plastic! Just skip this one if you treasure your time and health.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "rpRMsKuqeRZldrDMngVolg"
  },
  "DLRuwyOnA2m3pWu28JH8Fw": {
    "date": "9/26/2016",
    "text": "I actually liked this place, I had the spicy chipotle egg sandwich. I wasn't to excited about it. Looked healthy and all. But it was very good, I liked the spinach and the brioche roll. Food is well worth it, Especially from the airport. Prices are as expected, and they have a very large selection.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "UG4EKu13JRwzRix6ESINdg"
  },
  "EvYrICBRXRzIHsuyNxWG6g": {
    "date": "11/22/2017",
    "text": "I ordered a coffee here right before thanksgiving on a busy travel day and in a sleepy haze forgot to grab my credit card. I forgot all about it and 15 minutes pass as I'm waiting for my plane. The clerk walked up and down the terminal shouting my name till he found me. I realize this doesn't have to do with quality of food but the company was willing to go the extra mile to help a customer on a busy day which deserves 5 stars in my book.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Cif9qVYskLte_fmAbmJdnw"
  },
  "IzjUYhuotF6ttOXmRIj2zw": {
    "date": "8/14/2015",
    "text": "Excellent little spot in Terminal 4 for breakfast!  I ordered the spicy Chipotle egg sandwich.  Delicious!  FOOD: 5/5 I ordered the spicy Chipotle egg breakfast sandwich. Scrambled eggs, sausage, feta, slow roasted tomatos, spinach and Chipotle sauce on a grilled brioche roll.  6.99  Made fresh to order and unlike typical airport food, this place gives you your money's worth. The sandwich was filling, the ingredients, fresh.  AMBIANCE/DECOR: 5/5 Open seating with both high tables and normal table seating.  The high tables provided plenty of outlets which were a huge plus if you needed the extra time to get a quick charge while eating.  SERVICE: 5/5 Excellent staff who are extremely friendly and attentive.  As customers waited around for.their orders, staff members would be aware of those that have been standing around for a while and would kindly ask for their numbers to ensure their orders were being taken care of.  COST: 5/5 For being an airport establisent, I was quite surprised that I wasn't feeling like I was paying an arm and a leg for a meal.  Especially given the quality of the food I was pleasantly surprised. Most items can be purchased under $10 and again, the portions are generous.  I will be making this my go-to breakfast spot from now on.  I cannot wait to try their other foods.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "D5cEqZ_nLVOXopNf5NgrEw",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. Spicy Chipotle egg breakfast sandwich on brioche bread.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/D5cEqZ_nLVOXopNf5NgrEw/o.jpg"
      }
    ],
    "user_id": "0AP8keIdzR7exbF8lLvufA"
  },
  "Q1biV4fOdWgaJnbMNBNucw": {
    "date": "1/12/2017",
    "text": "I like this bakery very much after my visit to Sedona. They serve delicious sandwich with fresh veggies and good soup as well. Today I enjoyed eating half BLT and spicy chicken enchilada soup. Both must be great for me and I could recommend to eat them here. Last week I came here and enjoyed foods of course. When I come to Phx, I have to come here to eat fresh sandwich!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ip8S08Gjb1g1CXMPVkx3zA",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. Half and half",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ip8S08Gjb1g1CXMPVkx3zA/o.jpg"
      }
    ],
    "user_id": "o6g1zCfbKi_XaKubD8xJJg"
  },
  "sOB0G45wbuwaRXt1LVhdIA": {
    "date": "1/6/2017",
    "text": "Tuna sandwich - healthy Turkey and brie sandwich - healthy  Bottle water - as expected Service - ok",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RAVJ9h2pbejfvuzPknleMg"
  },
  "Ns7ThOePgYY5yDDcO6tHfw": {
    "date": "8/29/2015",
    "text": "5 stars? Yes! This is by far the best airport food I've had. I had the quinoa salad and the potato soup and my partner had the turkey BLT sandwich. Like most everyone has mentioned before it was really great to have a healthy option that was tasty. The potato soup could have been better, however I was pretty obsessed with my salad. Additional plus, they were quick with orders. I had 7min to catch my flight and I totally managed to get my food on time though there was a lengthy line.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "228VjeUAs0Wz9NMOkutjOQ",
        "caption": "Photo of Wildflower - Phoenix, AZ, United States. Quinoa salad and potato soup.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/228VjeUAs0Wz9NMOkutjOQ/o.jpg"
      }
    ],
    "user_id": "KEvvlfQjO225u45Hr4KGQg"
  }
}