{
  "XHnW76LwcQoXEpXB2lj3ug": {
    "date": "9/13/2013",
    "text": "Fresh coffee that's roasted on site? Count me in!   This place is my new favorite hangout when I visit Scottsdale. It's really hard to find a local shop that pours a good espresso, but I've got to say my double I got at Altitude was the best I've ever had. I even had an opportunity to see the roaster in action. How cool is that?  When I walked in I was instantly greeted by the owners Craig and Paul. Both are very proud of their establishment and have every right to be. The interior is beautiful. Everything is done very tastefully and it has a very relaxing vibe. They also offer free WIFI so this is a great place to come study, or finish your novel, or whatever work you need to get done in a relaxing environment.  I had a Panini which was excellent and had organic chicken. I can't really say I'm a Panini connoisseur, but this is by far the best one I've ever had. I also had a freshly baked chocolate chip banana muffin for desert.   What more is there to want? This place rocks. Do yourself a favor and come in and get your fix. You won't regret it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "nsM4MOnAfTrK0zcSDflGrw"
  },
  "eFIQ5D6k9QhyQa7c8iwJiQ": {
    "date": "3/4/2016",
    "text": "I like supporting local businesses, and try to avoid places like Starbucks (for several reasons). Altitude Coffee Lab is absolutely DELIGHTFUL! Seriously some of the best tasting coffee around. The pasties are amazing. Love the ambiance and the lakeside location. I consistently go out of my way to have coffee here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u1wCSHT8QvB9i9wrtbIIQA"
  },
  "WFcbi5XA4ar04-C_V2Txeg": {
    "date": "9/15/2013",
    "text": "Trendy new coffee bar! Great coffee roasted on the premises and nice little menu! Check it out. So nice to support a local with way better coffee than Starbucks!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3z2HfxZMyyF6NuBItDCGTw",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3z2HfxZMyyF6NuBItDCGTw/o.jpg"
      },
      {
        "img_id": "HANO1sS95nEbNzuL6YZ5gg",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HANO1sS95nEbNzuL6YZ5gg/o.jpg"
      },
      {
        "img_id": "7RauM_X74oIhfu1bB4Ja0w",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7RauM_X74oIhfu1bB4Ja0w/o.jpg"
      }
    ],
    "user_id": "fK0-h1rZQF7HGjr5EPEq5g"
  },
  "prRnzC2yhdwgrIASq7rCEw": {
    "date": "10/26/2013",
    "text": "The atmosphere here is tremendous. You feel at home as soon as you walk through the doors and are welcomed by friendly people who actually know something about coffee.  The coffee? Excellent. Keep in mind, this is not a Starbucks.  Be ready to wait a few minutes for your caffeinated beverage but it's worth the wait.  I haven't tried and of the food yet but there was a quiche brought to a table nearby that looked delicious. I strongly suggest sitting on the patio while you have your coffee. There's lots of comfortable seating.    Overall, this place is my new go to when I want a good cup of coffee. You should try it too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "veE9_4M1NJDB9fm7C55IvA"
  },
  "Pj9RtUMttWB4h9Dq7RDWpQ": {
    "date": "1/7/2014",
    "text": "Went here for breakfast with the girlfriend last weekend and we were both very happy with our experience at Altitude.  We both wanted breakfast but were dreading the portion sizes at Butter's (one of our favorite spots,)  I suggested Altitude as we've wanted to go but hadn't make it happen yet.  The location is great and we really liked the decor/ambiance of the place.  It's low key, clean and feels inviting.  We were both greeted by who I'm assuming was one of the owners and went to order.  A Cappuccino, Latte, and 2 of their egg white, bacon sandwiches and everything was great.  The food tasted fresh, the bacon wasn't a dried out piece of bark but a thick cut with a lot of flavor, and we both enjoyed our coffees.      We both like that we now have a new place to go have breakfast when we are looking for something lighter and more low key.  We are planning on going for dinner/happy hour soon as the menu features meat and cheese boards, bruschetta, and an appealing drink list.  You can absolutely tell the owners really care about what they do and while they are clearly still fine tuning everything I absolutely recommend checking this place out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Dj1_YUaEGAu486WEu9a2fg"
  },
  "aZfBSnQ-Ky94vgT7hBks3Q": {
    "date": "3/3/2015",
    "text": "Simply put, these guys have the best roasted coffee around!  Even after having spent time in Seattle and San Francisco, this truly wins Mugs Down!  They get pretty busy, but still manage to get your order completed pretty fast, which is rare amongst the coffee cafe crowd.  They have some special pastry they bake at the shop that is AMAZING!  I rarely write a review, but these guys earned 5 Stars.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XOM2YxEhJahleLv3n0gwPQ"
  },
  "VjmscQeOw6aaTauORzCtbw": {
    "date": "7/19/2014",
    "text": "What an awesome coffee shop! I pretty much live in coffee shops around town to read and so I always love stumbling on to a new find like this.   The vibe is really cool and relaxed.  The staff is incredibly friendly and attentive.  The drip coffee is wonderful.  The breakfast sandwich is stellar.  The view is spectacular.   My only wish is if they had some more stuffed chairs/couches to kick back in but as long as the misters are going, the patio is very pleasant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N5L1kEeq8ixhuuFvD7Q8hQ"
  },
  "pAfXteS9oigZc0vsTts3bA": {
    "date": "6/12/2014",
    "text": "Pretty patio-and nice service. I had an iced toddy..very good. My only complaint is that the large portion is actually a pretty small cup-felt like a 16 oz but it might have been a 20 oz. Besides that-I'd return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dJP1RDSrtDnSDCM2i23Wow"
  },
  "WpewCoy0Y3scs24z87fkSA": {
    "date": "9/17/2013",
    "text": "This roaster and coffee shop is a fantastic addition to the coffee scene in Scottsdale.  As I write this I'm savoring a cup of Rwandan coffee from beans roasted just two days ago.  Roast is much lighter than what is common these days and I appreciate the flavors that are brought out because of it.  They roast their own beans on site and have a beautiful, newly built shop that is very bright with an abundance of natural light, very clean, and accompanied by warm & friendly service.  Espresso is among the best in the valley, and I was happy that they accommodated me on my request for a ristretto shot.    They're easy to see when going southbound on Hayden with their location behind Chipotle.  Ample parking on the Chipotle side of the lot.    Enjoy this gem before everyone else does and it starts to get crowded.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "Q4Qfu-3vYtL1LRm2X1b0Gg"
  },
  "cyx9gLFbboRgH2MfDx-LkA": {
    "date": "10/27/2013",
    "text": "This new place is great and overlooking the Scottsdale Greenbelt it fits so nicely into its location...calling it a coffee shop would be selling it short...yes that have great coffee and roast their own beans but the food is also great!...just had one of the best egg white, spinach and feta omelette a ever...they also just got their liquor license and are expanding their menu and hours...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JK_Cijt1AvIZ3hm8Zsw27A",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JK_Cijt1AvIZ3hm8Zsw27A/o.jpg"
      },
      {
        "img_id": "nOSNMBj8XMyS_oTe9ue-mQ",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nOSNMBj8XMyS_oTe9ue-mQ/o.jpg"
      }
    ],
    "user_id": "cEJrDftVWm_JczRXT1xNxw"
  },
  "JrltTbGO7qqHXqYXThi1tg": {
    "date": "10/7/2015",
    "text": "Totally a cute place and I love the atmosphere, but holy crap...the iced coffee tasted so burnt and flavorless. 3.50 for a small iced coffee and it was awful. Such a bummer.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hylg642xNVl1NXIRw7LMow"
  },
  "ShJAYtC_HL5Zh7ViQc790w": {
    "date": "9/22/2013",
    "text": "A breath of fresh air for McCormick Ranch.  Great coffee, panini's & scones!  A very laid back atmosphere with a happy staff.  The owners are great guys and really know their coffee.  Ask them about the beans and roasting process and you will get an education!  Alcohol & an evening small plates menu is coming soon...I can't wait!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "oARQEsnbK8SqEBZ88w1QQw",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oARQEsnbK8SqEBZ88w1QQw/o.jpg"
      },
      {
        "img_id": "zTXslbtda1ulTony1sXhqw",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Beautiful Roaster!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zTXslbtda1ulTony1sXhqw/o.jpg"
      },
      {
        "img_id": "1CBOxtj5yDlAUORBD24QBA",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Jesse Cottle in Piano",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1CBOxtj5yDlAUORBD24QBA/o.jpg"
      }
    ],
    "user_id": "WsP8QHk2BP7x-2wMwKbDeg"
  },
  "EaZFvGGJfcFpu8CBqjasoA": {
    "date": "9/8/2013",
    "text": "This just may be my new coffee place! They toast their own coffee, great views from inside and out, and they have all local and organic foods. I had a lovely conversation with the owner--super nice! Love this place:; I think they will do great!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "tC9X8GBJeRQFZiJEG9Iz2g",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Egg whites, spinach, feta, and avocado with shiracha!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tC9X8GBJeRQFZiJEG9Iz2g/o.jpg"
      },
      {
        "img_id": "K390DLzq-JjSz5DqkFHMLg",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. View waiting for our breakfast. 3 is my lucky number!!!!!!! It&amp;#39;s going to be a good day!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/K390DLzq-JjSz5DqkFHMLg/o.jpg"
      },
      {
        "img_id": "1vC7T2PSmTsjx3nwH3u6zw",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1vC7T2PSmTsjx3nwH3u6zw/o.jpg"
      }
    ],
    "user_id": "Gi5x_ly1GH6nRQJSWnWqlw"
  },
  "h7VJPMnu1eAnuXgyWLQJig": {
    "date": "5/8/2017",
    "text": "Found this place on yelp after an event on this side of town and stopped in for a cappucino. I will admit I am insanely picky with my coffee and have about 3 shops I actually love in the valley and now I have 4. The shop was cute and had lots of space, both indoors and outdoors to lounge while you read or chat. They were quick to make the drink and last but not least, it tasted amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5WdrLuZ_zUjY0WLsnJKW7w"
  },
  "byxpWZ615ALlDr9xIurkIA": {
    "date": "5/6/2016",
    "text": "Arrived from Sydney a week ago. Have been waiting for a good coffee. This place has EXCEPTIONAL coffee. Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2BL0_Bk7_hEm0LnnRmX6TA"
  },
  "syXwj8QXhVwUq1jUxgDdtQ": {
    "date": "6/5/2016",
    "text": "I absolutely love this coffee spot - authentic experience and delicious coffee.  I was really surprised at the quality of the food as well, as I only initially went in for a small cappuccino.  The customer service is alway consistent and very pleasant.  It is great for working from with fast wifi and plenty of plugs, plus a huge bonus is the setting.  It's situated right off of the green path in McCormick and looks out onto the lake - just lovely! High-fives to Altitude!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tzFIIBNzBoM4OIhzwbNhyg"
  },
  "v-DyXjVouyHacVd7_E-VJw": {
    "date": "7/16/2014",
    "text": "Best iced toddy ever! Gives Cartel a serious run for their money- fast and friendly service too! Free wifi, which is standard but nice. Prices are a little more expensive than Cartel though- which is strange because this place is so hidden and small.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YoIR5UhOaya4amGv0Gn98A",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Yummers",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YoIR5UhOaya4amGv0Gn98A/o.jpg"
      }
    ],
    "user_id": "H8unqfEoxVrv95YsmRbSrQ"
  },
  "OQp7wvpkYTJHxc600aA9Ug": {
    "date": "9/29/2013",
    "text": "Coffee=amazing. Roasted on sight. Talented staff Food=memorable. I've tried two different paninis so far. Prep, presentation of the salad and panini were so perfect. The chef even came out to check on us. That's what makes it memorable.  Atmosphere=unique. They have contemporary feeling mixed with recycling wood for displays and art. It has an old antique piano and a brand new state of the art roaster which, to be honest, is a piece of art in itself.   I will be a regular st this coffee lab",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "OLsdZ6V-MZtuiR7kdRjq1Q",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OLsdZ6V-MZtuiR7kdRjq1Q/o.jpg"
      }
    ],
    "user_id": "z8LKMlSUb8wtMnBZbUSUbA"
  },
  "wzBcThn9m9W09YKEiAWv-w": {
    "date": "7/4/2015",
    "text": "I was very disappointed to have such a poor experience at Altitude. The previous Yelp reviews built it up and I was very excited to experience this unique coffee shop, however the customer service was horrible as the barista was incredibly rude and the Americano I ordered was not very good. When sitting at on the back patio we were asked to leave for having our own water bottle that was not purchased at the store. Very poor experience and I wouldn't recommend this shop unless some change was instilled.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "_S1YAMD6QPTuyMx4hphwsg"
  },
  "QvrkRe19sDq0VeCmUofGww": {
    "date": "2/15/2016",
    "text": "I love this place. One of the best cappuccinos in AZ (Tastes like the coffee from Israel). Great view of the lake and all the people who come out to do a walk. They also have some baked goods and other stuff to eat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gabhpjJI6tgjnNPsiHHavg"
  },
  "e6SrxZAvjo7ar1q7UWqRJQ": {
    "date": "4/1/2017",
    "text": "We ordered a latte and an americano, both were so awful we threw them out at the gas station down the street.   The weakest latte I've ever had, I'm not sure anyone taught the barista how to make a proper espresso.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fe3VwbZHZiCYXUHoD2ZXQQ"
  },
  "M9ytL1iGy2MBfkJFwD1HgQ": {
    "date": "3/27/2017",
    "text": "Pros- cute location, nice patio  Cons- service was slow, didn't ask what kind of milk I wanted so made it full fat, chi tea was just ok.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u9317OG5YF_aq4mAG0y5Sg"
  },
  "3EeGVAI5hGLEL_0JOmP49w": {
    "date": "8/12/2018",
    "text": "Unbelievable service! We came in as a large group and we immediately were attended, the coffee is superb, I had the gluten free cheery pie and it was so good! I will come back again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EsqPqSurf0TqOPNda4WddQ"
  },
  "jUX0usF_tpNRDDZN-biLPg": {
    "date": "12/27/2017",
    "text": "The barista was a LITTLE awkward but overall really nice vibe. I liked the view of the lake and the dog friendly patio was a nice touch. I got iced chai latte with almond milk and it was delicious. Definitely would recommend. I will be going back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M_ustnYdW_oA9AJC6vwW6g"
  },
  "XNRqP2E2MNQE4mQnn0ldIw": {
    "date": "10/24/2015",
    "text": "It's nice, but when your there you can't help but get the feeling they could be doing it a little better. Breakfast could be a little larger portions (even if it costs a bit more), patio could be a little cleaner, tables could be spaced a little more comfortably, coffee could be a little more interesting, etc... Love that it's near the lake and close to our house. Great stop while your on the green belt and good quality was good.  Four stars is a bit aggressive for my experience but I don't want to deter anyone from coming here. Support local businesses. Too many Starbucks out there... Step it up guys. I'm happy to give you five stars if you do. Your not too far from it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qtcIJPrRzthR1ZHIzhn97Q",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qtcIJPrRzthR1ZHIzhn97Q/o.jpg"
      },
      {
        "img_id": "F07HPR6zFgP3WUp74Fe8KA",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/F07HPR6zFgP3WUp74Fe8KA/o.jpg"
      },
      {
        "img_id": "hyiqYIKpbQtpOVZKnGMiwQ",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hyiqYIKpbQtpOVZKnGMiwQ/o.jpg"
      }
    ],
    "user_id": "YlfYMCw8bLmPaJD8m7fcSA"
  },
  "vl6VAPDdg5jSPyUzp__bAw": {
    "date": "12/6/2017",
    "text": "Latte & avocado toast delight!! (Insert drooly face emoji) This place rocks! Treat yourself to avocado toast on locally made bread, you will be very happy you did. This place even has a nice little outdoor seating area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n2uWzAZg89493ittJJOwKA"
  },
  "3h3MS4JfEL4-W6Km6wpcTQ": {
    "date": "11/9/2017",
    "text": "Great place for some good coffee and outdoor seating. They do allow dogs on the outdoor patio and they have treats and water available for the dogs which I thought was pretty neat. I had a delicious cappuccino and scrumptious croissant. I will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sR68vEBs90HTKR2OHIyLMQ"
  },
  "Vzl3B6KgtcoFFZYkqO2WEQ": {
    "date": "8/12/2017",
    "text": "Love Altitude, great place to sit outside and relax w friends, kids and dogs. Great spiced chai and dirty chai",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6s2IugxDwWLoJiu6eg7HZQ"
  },
  "vjajD_VFidyn8Yo7ndoq9A": {
    "date": "2/3/2015",
    "text": "Tried this place. Based off reviews I was cautious but hopeful.  This place fell short. Baristas were friendly and helpful but seemed slightly annoyed when I asked them a question about their menu. They then took on the attitude that they knew more about coffee than I do. They don't. However the masked friendly customer service did continue until the end. You can tell they use a better quality coffee than some of the chain places but it's a total waste when you pair it with the cheapest flavor syrup that you can. In the end the price is way too high when you're peddling Monin syrup. I will continue my search for decent coffee in AZ.   P.s. had to laugh when I saw the manager sitting doing work at the only 6 top table which seemed to be one of the top complaints by other yelpers... does he not check up on these reviews??",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "SLXvA2emVYZyNAzvEJ4vfg"
  },
  "CGc33L-mFcxLGGpND6zlhQ": {
    "date": "6/28/2017",
    "text": "Ugh! I cannot believe I have waited so long to try this place. Went today and had the best latte I've had in Arizona. Super creamy with a very smooth balanced espresso. Seriously delicious! Also had some of their avocado toast, which was perfectly executed. Generous portion of ripened and seasoned avocado atop a thick chunk of \"noble\" bread (which is chewy and soft in the middle with a nice bite to the crust). Had several bites of my husbands fantastic breakfast burrito. The breakfast burrito was awesome and had the perfect ratio of egg, cheese, potato and meat. This place will definitely become a regular watering hole.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Kr5HTRVP3Ko-JgrtHV-sYA"
  },
  "1bkA0lYJa-0ISTfp1YQ-BQ": {
    "date": "6/17/2016",
    "text": "This place is cute, has AC and friendly staff, and pretty darned good coffee. My husband and I are coffee snobs (annoying, I know) and this place meets all of our criteria, and hubby loves the cold brew. We didn't have any pastries, but they had a nice offering. We will be back.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VUk3lcb1RzT5QrM6sXtfyw"
  },
  "49pJ5LDpezSjrVWbJUnn2g": {
    "date": "5/26/2015",
    "text": "The coffee is superior. The staff are sweet. The food selection, though limited, is prepared with care and fines.  Yummy! I wish they would open another location at my studio in Paradise Valley!! Until now I was horribly disappointed with the coffee places around Arizona.  Thankfully I found Altitude Coffee Lab!  I'm new to the Phoenix Scottsdale area coming from San Francisco and New York habitations so I've had abundance of the best. The coffee here is however fantastic - actually superior to most coffee cafes everywhere.  Did I mention the folks are sweet and friendly? The outdoor seating is comfy and relaxing. The coffee and pastries delicious.  A little slice of heaven. And the music is also great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ixhemErRt0312cRGRo4xTQ",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Snap of patio at Altitude Coffee Lab",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ixhemErRt0312cRGRo4xTQ/o.jpg"
      }
    ],
    "user_id": "jPKBkjVNuoOXIzxhgY__rw"
  },
  "eGSaHd5_IcZmhqPNE2iVXA": {
    "date": "9/21/2016",
    "text": "Nice cafe, cool atmosphere, good coffee. Prices are a bit high (that's the one star dock), but I guess you pay for what you get!  Outdoor seating area is really quite nice and next to a small lake!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xU0NV_Z1O4LoAhoCUBdVaw"
  },
  "yPpOVhRWusyu6NYFPAWz0A": {
    "date": "10/28/2014",
    "text": "Very nice ambiance and cozy breakfast place.  I had the salmon breakfast bagel.  It was really good, I don't think anyone can really mess that up. I haven't tried their coffee since I am a tea person.  But the tea was served nice and hot. I wish they brought the tea to you instead of a more \"starbucks\" routine since this place is a big step up from starbucks.   The staff was really nice and simple.   My only complaints: There was a piano inside and it was beautiful. HOWEVER, someone kept playing it and it was so loud right in my ear, they should have put the piano outside on the patio lounge area so you wouldn't be trapped by the noise.  The music being played in the background was not appealing.  It reminded me of a teenager who overused eyeliner with emotional issues.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lVDn0daie6qwOU02Lrjz8Q",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Indoor view of out",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lVDn0daie6qwOU02Lrjz8Q/o.jpg"
      }
    ],
    "user_id": "EV7g_mmArfB-JiHz1rD-MA"
  },
  "13Px3r-lVI_WUF1T20urPg": {
    "date": "2/21/2015",
    "text": "This is my all time favorite coffee shop. Roasted in house coffee, great food and a beautiful patio overlooking the lake.   When not in Arizona you can also order their beans and have them shipped to you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3OQh2EGAcJJ6_G6K71uuDg"
  },
  "c6jrSjvAqTTmH4KqhCsUiQ": {
    "date": "12/26/2015",
    "text": "Love this place!  I always try to have my coffee here since it's so tasty and pretty at the same time. More locations are much needed.  They have an amazing patio that overlooks the lake. Very cozy and the service is great. The decor is like a little cozy house with a piano. I had a hazelnut latte and it was delicious. The coffee tastes like perfection. My cousin got an almond milk latte and I had to taste it. Hers was also delicious. They also offer food, I have had the salmon salad before, very good if you're in the mood.   Keep up the great work, I will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZtnwURZcYCl5qUOFPF5SEw",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Hazelnut Latte",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZtnwURZcYCl5qUOFPF5SEw/o.jpg"
      },
      {
        "img_id": "_ZBBLs6f6ihtbxfNo3S0wQ",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Ours perfect little Lattes overlooking the patio and beyond!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_ZBBLs6f6ihtbxfNo3S0wQ/o.jpg"
      },
      {
        "img_id": "B8pNR0i9s5Fwc_24ROT_WA",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Fun fact!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/B8pNR0i9s5Fwc_24ROT_WA/o.jpg"
      }
    ],
    "user_id": "UFkZNdtjhOjs5K83_wC72A"
  },
  "F0_5IvraxZnA3NMevZn98w": {
    "date": "10/23/2017",
    "text": "Awesome spot. They roast their own coffee beans, so if you're looking for just a regular cup of coffee, this is an excellent choice. Fait amount of seating, especially if you like sitting outdoors. Almost all of the indoor seats have a power outlet next to them, which is also super helpful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m028D2hwkj-krkHBc_4hkQ"
  },
  "1G2fhSvSbkJdeAOFic8I0w": {
    "date": "7/12/2014",
    "text": "I have been searching for a coffee shop that stands out since moving down to AZ from Minneapolis. I've found a ton of average spots that feel run-of the mill and when I came across altitude I was pleasantly surprised!    The shop itself is a little small and could use some extra space but it has everything a classic coffee shop should have. A friendly staff (complete with fantastic mustache on the man who roasts the beans), a bean roasting machine there in the store, cozy tables, perfect lighting, a light food menu that is done well rather than just \"done\", a beautiful old piano, an outdoor patio that is cozy and welcoming and misters that spray while you sir under the shade of a beautiful tall tree overlooking a fountain across the way.    I was very impressed that they carried more dairy free milk options than just soy!  The wonderful man with the mustache even shared that they were careful about the almond milk they selected to ensure it would support the latte art they enjoy sharing with their customers. As a girl who LOVES both almond milk and latte art it made my day to know I could get both. (Typically almond milk doesn't hold the design as well.)   After sitting outside enjoying my coffee I decided to order a salad. I trusted the barista with her suggestion of the strawberry salad and was pleasantly surprised by the portion!  Typically salads from these types of places are small and leave me hungry. This came out massive and tasting amazing!    I recommend Altitude to anyone who is looking for an experience to go with a great cup of coffee.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "g7Nfe1nHrHmlTtkBwFr6hg"
  },
  "xDr9wzCy3issrT9EQuPsmg": {
    "date": "5/4/2016",
    "text": "I love this coffee shop!   The coffee is decent, the chai is good, the vibe is great! One of the best coffee shops to work out off. Great seating, outlet plugs, and quiet atmosphere. The music is rarely loud and the conversations are always moderate. While I usually sit inside, the views of the lake right outside are super beautiful and refreshing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gx-i0ZHtV_JBNWNYLPz_zA"
  },
  "ktUmvQUxZm4plPBdJbQLSw": {
    "date": "9/25/2017",
    "text": "Helpful baristas, cozy environment, yummy Ethiopia Pour Over. Would definitely come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ebVEod6BjCuqytsXZfsVBw"
  },
  "XOf1kp5cdqPQ-_rVwF70Ng": {
    "date": "3/27/2014",
    "text": "I have been three times, The first was not long after they opened and they were short staffed and slow,but the coffee was good so was the food. I thought I would give it another shot a month later it was much better, but this last time the food was bad coffee was bad, not sure if they changed the way they do things but is was bitter not real creamy and the food and service was poor. I don't even see the same people had had the two other times.... Not sure I want to go back",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kERdqxIJjYd0M3N0xHJ6AQ"
  },
  "YDHfQTHV1LmOVFQGK8eidw": {
    "date": "1/9/2014",
    "text": "I've been to this coffee place about 8 or 10 times since it opened up and really enjoy the atmosphere and vibe that it gives off. The location is perfect and has some nice views if you're able to take some time to relax and just enjoy the day. It's nice that they have mostly the same staff each time, so little by little you feel like you get to know them and they you. I'm all about going to places where you can feel like you're a regular. The coffee here is delicious, as well as the food. The coffee isn't super hot when you get it, and I'm not sure if that's intentional since the temperature seems to stay consistent every time I've gotten my coffee. I actually don't mind it--it's hot enough to taste like a good brew, but not too hot that you can't enjoy it right away. Haven't tried their evening events yet, but am looking forward to trying them as it seems like they have a lot of fun evening events on the horizon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ub-ZtV3qD1dPSbgBINgi3g"
  },
  "OIHduiB9dfKyOhQjChmG9A": {
    "date": "1/1/2016",
    "text": "The best local coffee I have found.  Beans roasted to perfection, they are very proud of their work.  I buy their whole bean and use it as part of my \"coffee-snob\" daily routine. haha  Great place to relax, super chill and right in McCormick Ranch.  Keep up the great work guys.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jW4auSvxDW4kqV-cEic9VQ"
  },
  "UPQIeGa9txjVcwGVCzVUfA": {
    "date": "4/8/2014",
    "text": "Stumbled upon this place in my neighborhood. The coffee tasted good, although you only have the option of choosing 2 or four shots of espresso. Owner is nice, they have a piano that can be played, and the patio overlooks the water which provides for a nice work place during the day. However, the wireless connection is awful. Both times I went to work, the connection constantly cut out, internet would freeze, etc. They tried to restart a few times, but it didn't seem to help the situation. Also, there are no outlets outside on the patio. All in all, cute place and nice feel, but probably will not go back if I plan to work or use my computer.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p66V9Y_8uvWaS4Iw5_1ozg"
  },
  "rM9HGX_U7vwolIno2pIP7Q": {
    "date": "11/6/2013",
    "text": "Great coffee (comparable to the best coffee shops in NY, SF, Chicago, etc), great food, great service, great ambiance. Was visiting from NY and it became my office for a week. Very surprised to find this gem in Phoenix!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P4a3uuq4BhvegWii7NAw_w"
  },
  "VmlPNtuKHUIDZKKPP7-xvA": {
    "date": "10/7/2014",
    "text": "At first it seemed like we may have found  a GREATcoffee place, but was quickly disappointed as my order was totaled and the mocha arrived, warm at best and lacking in depth. The staff is not engaging. Snobbish is how I would describe them. I am really sad to have to write this review, I was REALLY hoping to have found a go to place for my mooring joe...Over priced and under serviced.....",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "T6H8cfW6CXk2ZBlK6ktYqQ"
  },
  "k4IgakyiQ_IPhSG_0Wzh3w": {
    "date": "11/21/2015",
    "text": "Wonderful place a month ago but the last four visits I saw the chimney cake machine being hauled out (this was a signature pastry), ordered a French Press and took 20 minutes and three trips to the bar, ordered a FP again next visit and the barista poured it into two big cups??? So finally went back to a nice presentation of a double espresso which comes on a board with a side of club soda......except it didn't as I got just a little cup all by itself.  What's going on here?",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rrJkNfazmFjzbqxO0c1yeg"
  },
  "y9WqrDQ-WwY1BW4ThsUXnQ": {
    "date": "11/28/2015",
    "text": "I'm a serious Yelp user and snowbird from the Northwest who is enjoying an extended stay about two blocks from this coffee shop.  I was really looking forward to checking out the place and perhaps becoming a regular customer, but when I got to the front door, I saw that the owner discriminates against my kind.  Yes, I'm talking about the \"no firearms\" sign.  If the owner wishes to use their business to make a political statement, I feel I must do the same by taking my business to one of the other coffee shops in this nice little mall.  It's only fair, right?  I'm giving three stars because the items I could see inside looked really good.  I am so sad!  :(",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GMYrVXXxQXaxK0YqTHaaQw"
  },
  "AJ0vVur16BZUZWomtNtnrQ": {
    "date": "7/8/2015",
    "text": "Had trouble finding a decent coffee while recently visiting Scottsdale.  I finally found this place! Nice latte.  Friendly service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EYLmKJH2ZscF-xXtujRzHA"
  },
  "8U61UXbdca2u_aUyaA4fRA": {
    "date": "11/26/2013",
    "text": "Discovered this little gem last Sunday!  The staff was friendly and helpful.  My husband appreciated the free refills on coffee as he needs several cups to get his fill.  Really enjoyed my latte on their lovely patio...the perfect way to spend a November afternoon in Scottsdale right by the lake with the mountains in the distance.  The patio is nicely set up with comfortable furniture, a beautiful tree hanging over it, nice decor and a great view.  The inside was cozy too but the patio is what wins me over.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j_0cO14CHeDzTG2GqikrLQ"
  },
  "_s8JhJ7sMKfgVuriRO2niQ": {
    "date": "2/20/2014",
    "text": "Love this local spot! The drinks, food, staff and decor are all awesome! Great patio by the lake/bike trail (think pit stop). Also, they have cocktails and open mic some weeknights. Oh, did I mention the champagne infused muffin, the Royal 57, gotta try one!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "yo0piVFR47Rf73Xk1KVHGQ"
  },
  "PCy3bdDHueUCRpc6BJF8QQ": {
    "date": "5/4/2015",
    "text": "Just arrived in town and have been making the rounds; am fairly certain that these folks brew the best coffee in the Valley.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jn4AlNUXrOsMlqytvmP0GQ"
  },
  "CwecrelLQ230oyVhnQBspg": {
    "date": "4/23/2015",
    "text": "Went to Altitude Coffee a few days ago, the barista behind the counter, Anne was amazing. She was very knowledgable on all of the coffee and recommended their new blend Ethiopian. She was right, it tastes and smells delicious. I highly recommend coming to this establishment, they know their stuff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xVypV4xDH2vEdHAI6X2A2Q"
  },
  "BDXiexwcLmrdirBbyIBWxA": {
    "date": "4/12/2015",
    "text": "This is the best coffee shop with gourmet brews as well as excelelnt breakfasts and lunchs. Great music on the patio and the staff is friendly and professional; the best thing about Altitude is the manner in which they make the coffee. it is perfect with the best fresh beans and they bake their own goods. This is a rare treat and the price is right.Try the Brussel Sprout saiad or the Chicken sandwich. The patio overlooks a small lake. Highly recommended. Enjoy the happy hour, great wine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nxtft9_6MzyVS1HlTBH6Nw"
  },
  "HnNDVLV8xUtqnyraf6eufw": {
    "date": "4/10/2015",
    "text": "Friendly service, great latte with perfect foam and a nice patio with view of canal. Very nice!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s_6EhWfWI3OHki6HiESt9A"
  },
  "OpmQA9lmn0p3g5quBoOaQA": {
    "date": "12/26/2014",
    "text": "Stopped in for the first time and ordered a mocha. Truly excellent coffee and a really cool atmosphere. Can't wait to try out the patio when it's warmer. Really could have done without the odd man playing piano samples in the back the whole time though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pee3-T-K4XZP52auVNyAqg"
  },
  "EXQD1C3mACbdPdcg58TrJg": {
    "date": "2/11/2015",
    "text": "This place has a cool vibe, and great coffee. The Hungarian pastry was one of the best pastries I have tried.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zjMKsoh6uzsr4jvH0L3lkw"
  },
  "zlIan_v6SysRv82qHWcxSQ": {
    "date": "9/29/2013",
    "text": "I never do reviews, but I had to comment on Altitude. Perfect location, coffee, decor even the music wasn't too loud.  I will never step foot in Starbucks again. Friendly staff and the fresh chocolate chip muffin I had was to die for!! I had chai tea that was perfect. This place will be too crowded for a seat soon. But they have a beautiful outdoor space as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "j-ND70QEFHzO6YWm3dbiRQ"
  },
  "aFgiUowovvluWhgwW59ZJw": {
    "date": "9/14/2014",
    "text": "Adorable place and nice setting.  The food was great and the wine pour was very decent.  Nice presentation for the food and the ambiance of the place was great.  Just enough choice of wine and food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dUX2H1_6WogjArP1a4qIYQ"
  },
  "3RjUJ-7vD2nvOuvGyJsd8w": {
    "date": "10/26/2014",
    "text": "Poor customer service ruined the entire experience. The coffee was about average, the decor was adorable, but the barista's were so rude that we just took our coffee to go instead of enjoying the ambiance. Won't be recommending this place to others.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zZyVqQFjkx3VcFbKFS1B0w"
  },
  "AVpz_qxzMCLZSkLtqEqF8w": {
    "date": "10/13/2013",
    "text": "The cappuccino was perfect. The atmosphere is lovely.  The piano is a nice touch -- there was a talented pianist when I was here (although I would be concerned about too many kids playing chopsticks).  Relaxing, decor is very homey.  And love the abundance of puppies.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ihslw_sPl1bR0f3AfFhBFw"
  },
  "fTSP6BG6SiyBpFNQ_jcWFA": {
    "date": "9/19/2013",
    "text": "IN LOVE! Cutest place. Love the decor, the staff is so friendly and the food and coffee is amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Ox46lZ-r7a4Vma7f3sdhQ"
  },
  "ddzHKBG_l3Vm-o5kCcQN3w": {
    "date": "6/16/2018",
    "text": "The mocha and white mocha are both smooth and amazing, but even better mixed together. Nice patio seating and super friendly baristas. Will definitely be back here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f9uRf7PdblCgMIS3hizCJw"
  },
  "oZbcbyPSWdqkCH8mMAKN4w": {
    "date": "4/17/2018",
    "text": "Great location. Pretty good food. Great coffee. With that being said, the workers are not personable at all. No smiles. I have been here a few times so it wasn't just an off day. All I can say is they are lucky for their location or I don't see how they do good business.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bAdLKrUkSOXOsvS-9-U-rQ"
  },
  "Q3kPU0mcFFL0tmekL8Hu1g": {
    "date": "8/29/2017",
    "text": "The place is scuzzy, which is a shame given the location. They needed somebody to just clean the patio. And, the interior was worse. As for the coffee, bleh. I think their roaster has consumed too much Starbucks since they seem to go for that burnt taste, but with even less depth. The one interesting item was the almond biscotti. With a soft chewy center and traditional crispy outside, it was worth eating even if it could have used something more than vanilla extract as flavoring. All in all, not a place to which I would return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jL41h4Ez98PZfqiKzbbY1w"
  },
  "I_Gw6nhh7ahA1dUwVMQAMA": {
    "date": "4/8/2016",
    "text": "I came in on a busy Sunday morning with a long line. The employees were so sweet and apologetic about waiting in line. I did not mind as I always expect long lines on a Sunday, but it was refreshing for them to not be stressed out and happy-go-lucky.   I had the iced coffee, plain. It was delicious! Not too bitter but not too chocolate-tasting either.   The man in front of me had a bagel with lox, herbs, and capers that looked delicious. Their breakfast menu was quite expensive but looked like a good quality, fancy meal for a coffee shop.   I will definitely be back here next time with my dog. Their dog-friendly patio is very cute with comfy couches. It overlooks a gorgeous part of McCormick Ranch's lake. I highly recommend for family, holidays, or a date.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "sHY6JcgWOHLP4vR836Esmw"
  },
  "ladcFC69qPdt4vYwSFBEgQ": {
    "date": "11/19/2018",
    "text": "I was greeted by a girl and I asked her a couple questions about the menu. After, she pointed to her right and said, \"you order down there.\" I ordered an iced soy mocha and a yogurt granola bowl. The yogurt granola bowl took about 10-15 minutes. One of the workers then said,\"your yogurt granola is here,\" and it was sitting on the counter. Meanwhile, we had a number stand that usually the worker brings the food to the table and takes the number. Come to find out, my boyfriend said he saw the yogurt bowl there for about 5 minutes (not knowing if it was ours) before they said anything about it. Three stars is generous and I only gave them this because my iced mocha that was not half bad. I would say that the iced mocha is a step above Starbucks. I would expect friendly, helpful workers at this coffee shop that I heard good things about but got just the opposite.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e0gttBLNa6IFXbG3ypRvjw"
  },
  "rtpSE9XbM1kpr6OpNC7pZQ": {
    "date": "11/9/2016",
    "text": "I dig it. I really dig it.   Altitude is great because it's small and has a personal feel, but has so much seating. There's a huge table inside for groups as well as two long bars with seating and multiple smaller tables. There's also a pod sized patio out back with more comfortable seating and hang out areas that is shaded in the afternoon and looks out at a small lake.   The barista had that vibe of a Seattle hipster who knows coffee like a pro, and the service was very fast and polite. Most importantly, the coffee is stellar, and although I didn't get any, the baked goods looked delicious. A+++",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "w-DTrFEN0aEUKiprK3XQCg",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Vanilla iced coffee",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/w-DTrFEN0aEUKiprK3XQCg/o.jpg"
      }
    ],
    "user_id": "00Gxhh6VuzIlg51TXV_ZLw"
  },
  "Agpg4Yc_JgK6vv0j0IAbEQ": {
    "date": "8/24/2017",
    "text": "Excellent coffee!   Also scrumptious chocolate croissant   A little tough to find but worth the hunt within the shopping center parking lot",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r64WY53LOMRPowHDu2JIXw"
  },
  "zot4CCL8vY5PXKPaImquow": {
    "date": "1/14/2016",
    "text": "I'm seated alone at the small bar at Altitude Coffee Lab reading the handwritten chalkboard menu while I wait for my order of a V60 pour-over of El Salvadorian house-roasted beans. This is my second time here. It's been over a year since my last visit and I let my mind loose for a moment to wonder over how much has changed during the time that's passed between.  Upon entering, I was helped by a polite & attentive barista named Max (I hope I've got that right, buddy...), who was quick to recommend the newest addition to their single origin coffee menu: the carefully sourced and freshly roasted bean from El Salvador. It was so new that it hadn't even made its way to their menu yet. I immediately agreed to give it a whirl.  I look around me, taking in the interior seating options filled with happy customers, the old piano set against the back wall, the balancing architectural elements of red brick, reclaimed metal, and wood. I take a slow in-breath and open my ears to the ambient soundtrack playing softly behind the hum of conversation, coffee grinders, milk steamers, and passing traffic.  When my coffee is delivered to me, it is without fanfare and I take a moment to breathe in the fragrance of its steam before taking a first sip. My eyes close and I can feel an unwitting smile tease the corner of my own lips. Max wasn't kidding. This really is wonderfully satisfying - flavorful and a little sweet without being too tart; complex with just a hint of nuttiness.  My first thought is, \"Well done, Max!\" My second thought is, \"This might be one of the best cups of coffee I've ever had.\" I look up and happen to catch Max's eye, offering him a smile and a thumbs-up. I ask one of the other baristas nearby if all of the single origin coffee options have been roasted here on site. She confirms that, yes, in fact - they have been.  The large roaster that is to blame for all these delicious flavors sits not far from me to the left. Later, Max will tell me that he's in training to be an auxiliary roaster. His love of good coffee and process is evident. We talk about music for some time, too, and I learn that he's personally responsible for the soundtrack I've been vibing to this whole time.  A friend joins me unexpectedly, asks me what he should order. I recommend the El Salvador through a V60. He is as impressed as I have been. The door behind us opens and closes as customers enter and leave, quietly trading places around us. The sound of a piano swells to fill the room - someone has decided to play, and it's absolutely beautiful.  By the time I am gathering my things to leave, my entire being feels... settled. I wave goodbye to Max and the other baristas, swing my backpack across my right shoulder, and follow my friend out the door. Looking back through the window, I know it won't be long before I'm back for more of the same. I toss a silent thank-you to the coffee shop, the morning, the sun...  CONCLUSION  Featuring an intimate and welcoming atmosphere, adequate seating options (both indoor and out), a phenomenal drink menu, and outstanding service, Altitude Coffee Lab hits on all cylinders with utter efficiency. If you have yet to visit this little gem, you're missing out. I can't recommend it highly enough and know that I'll be a happy regular from now on.  Altitude Team - thank you for caring about your work, about your brand, and about your guests. Don't ever stop doing what you do - it's noticed, and it's appreciated. More than you know. I'll look forward to seeing you all again soon.",
    "rating": 5,
    "rated": {
      "funny": 6,
      "useful": 13,
      "cool": 10
    },
    "photos": [
      {
        "img_id": "uX3pzPPV_zJ7tDIYBdJfqA",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. &amp;#34;Coffee Varietals&amp;#34; Menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uX3pzPPV_zJ7tDIYBdJfqA/o.jpg"
      }
    ],
    "user_id": "15Yrx7yqhGp-uUc5ghCcUg"
  },
  "1Ml5LjySH3TfVJKxQ08nbg": {
    "date": "2/9/2018",
    "text": "This is hands down my favorite coffee shop in the Scottsdale area. After having had enough of Starbucks' bitter tasting, overpriced coffee, I wanted a new local spot that could make a mean iced latte I so frequently crave. This place is it! Not only do they have amazing tasting coffee drinks and foobut their prices are great as well! It has a cute home-y vibe inside, and a great dog-friendly patio out back near the lake. The location is fantastic - right in McCormick Ranch and situated right on Lake Marguerite with a fantastic view of Camelback. I love getting my coffee to go and taking it for a walk around the lake. Oh, and do yourself a favor: order an Iced Caramel Macchiato (or Iced Caramel Latte, as they refer to it). You won't be disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QZ3FD2WyBf5asELsQCXH0w"
  },
  "2kHaIFnfyDidr20OtQGCtA": {
    "date": "6/23/2017",
    "text": "Great little coffee shop. Good vibes, atmosphere, and environment. You can see the water and fountain from the patio. The coffee is very good as well. Great place to study, meet a friend, or relax.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gix0MkDv2_6QnmDGxw6vjw",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Patio",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gix0MkDv2_6QnmDGxw6vjw/o.jpg"
      }
    ],
    "user_id": "wLuc66bIM1HMU5zGZPdUQg"
  },
  "dEgl4566GTwnW-AtyRtgpQ": {
    "date": "7/2/2018",
    "text": "I love drinking coffee, especially freshly roasted coffee. Lakeview Coffee is one the place where you can get fresh espresso. They roast the their beans right in the coffee shop and when enter the coffee shop you can smell the coffee. The espresso has so much nice creama and smooth taste. If you are a coffee lover, I definitely recommend this place. The last I was here I had a bad customer experience. I mentioned on yelp and the Owner, Issac emailed me and apologized for the service I got from employe. He offered me free coffee and asked give them another shot. I went today and Issac was there. I saw the new employees and everyone was very nice and greeted me right when I went in. The owner took care of me and gave me free coffe even if  I wanted to pay for it, He Said No, it's on us. They definitely improved their customer service. The coffee is good as always. Thanks Issac. We'll be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "C6111py7n6OZYEQi1-Gz7A"
  },
  "tCS_sGh87582_uYkkAs0IQ": {
    "date": "3/22/2017",
    "text": "Not sure if they have new owners but not the same as the past few years. I enjoyed coming here staff were friendly. But this year the 2 ladies that are working behind counter are rude and just not very welcoming. Nice outdoor patio and dog friendly. We ordered breakfast sandwiches and they came out basically out of the freezer ice cold, had to take them back in to reheat. My husband ordered a coffee and it was warm, he asked for it to be a little hotter and the girl gave him a lecture on temperature of coffees. Really just make it hot enough without burning your mouth.   Not friendly at all, food is so so, only positive is great outdoor seating to visit with friends.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1FybbM4RnJJxxEhts68MWw"
  },
  "NTIwdHl_icJL4xIT6MCWMQ": {
    "date": "6/29/2018",
    "text": "Coffee is super bitter. The pastries are overpriced Costco at best. There appears to be like 10 owners that stand over you like it's their first business. The decor reminds me of retro 90s. I would suggest buying better coffee beans and hiring someone who knows how to roast. The other option is to just add a ton of creamer and sweetener. Beware sitting outside for low flying bird bombs and the smell of the dumpster that's just around the corner. They get a ton of bike and transient traffic so the bathrooms are super dirty. They keep them dark so you can't see how bad they are. Just another overpriced Starbucks wannabe. I believe there is another coffee choice nearby or you can save your money and go to Cartel in Tempe.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YIkkc_7TVbajSzdThs_UgQ"
  },
  "5rCq9l4BrNHDDTJxGKxR0g": {
    "date": "2/22/2017",
    "text": "Buyer Beware! At first I thought I was getting a quality bean, but now home realizing the 1 lb bag of Columbia Natural whole beans were mixed with fermented beans giving off a sour taste when brewed! Very disappointed. Not how any business should treat local or out of town customers!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "L8akBxkYULPuu9FB9fNa5w",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Bag purchased.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/L8akBxkYULPuu9FB9fNa5w/o.jpg"
      },
      {
        "img_id": "lMt2pgWaOpGOemUwfiC35w",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Mixed beans! Not sure which bean was mixed with  Columbia Natural, but the darker bean smells fermented.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lMt2pgWaOpGOemUwfiC35w/o.jpg"
      }
    ],
    "user_id": "iI_JOfWo3i1u0ByCuFu0jw"
  },
  "m-6ohGmx4KI05WY9YI3IeA": {
    "date": "2/12/2017",
    "text": "Great coffee,  good food. A little small, but nice.   The people working here seem to really know what they are doing. I'm already looking forward to my next visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3yJfLRTc4QVGpfuUpFyc8w"
  },
  "_ThjqRVNXyLkziZaRyTr9Q": {
    "date": "9/18/2017",
    "text": "This is my favorite coffee shop in Scottsdale. Their coffee, desserts and breakfast/lunch menus are good. The environment is amazing. Relaxing and inviting. The management and the service is superb. I totally recommend it to everybody!  They also have a beautiful Saturday events with a live band and drinks. I always enjoy the elegant evening event with my family and friends or reserve it for a private party.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HkV4pOum7sIcmBn479LF7A"
  },
  "b2S6Kv-tSOXE4CveWEWVSg": {
    "date": "3/16/2017",
    "text": "I love the selection of teas that they have here! I enjoy trying the various selections.They also make tasty almond milk lattes! Super cute patio area overlooking the lake, plus it's dog friendly! I haven't tried any of their foods, but it will give me another excuse to return. Great service & tasty drinks!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "sRrl6zoyLYRTVlhdn25hhQ"
  },
  "djrU8D5MTC_PNd61gBq0tw": {
    "date": "1/5/2018",
    "text": "Good place to come drink some great coffee, grab a snack, and relax....     great dog friendly out door patio and chill atmosphere",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wnU0lQ3niA3LSLyUjJqNZw"
  },
  "r7eEme4A5Lp2LtxO0lcvmg": {
    "date": "10/22/2015",
    "text": "I came here to meet some coworkers for a morning meeting and to grab a quick bite. I absolutely LOVED their patio, especially the fact that it has a water view! :) I also brought my furry pooch and he had a blast relaxing on their patio while getting a ton of love from other guests. Their coffee was delicious, my latte had a pretty design, which always brightens my day! I also had a bagel with all of the fixins'! Great coffee, yummy/simple breakfast food, fabulous patio, water view, dog friendly, what could be better?? Oscar and I will definitely be back! :)",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 8,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "5wmwEifhr6bKxsmQYMqmTQ",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Wild Salmon &amp;amp; Organic Bagel",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5wmwEifhr6bKxsmQYMqmTQ/o.jpg"
      },
      {
        "img_id": "WBuZeYy1myRaDYian-9EIA",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Oscar loved the patio and I loved the coffee... We were happy campers!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WBuZeYy1myRaDYian-9EIA/o.jpg"
      }
    ],
    "user_id": "e6iCOIhtupBCiw-VwBvJ4A"
  },
  "I47Tmzdd1rsZQPu_ZvggPA": {
    "date": "9/7/2018",
    "text": "This review pertains only to the espresso I had. Terrible. It's a nice spot, clean.. cute girls working there. I imagine other things are good based on the reviews and how busy it was on a Friday at 10am but the espresso was extremely bitter.. lady just now complaining her cappuccino wasn't creamy.. \"it's like flat coffee\" she said.. there ya go",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Jy6wftE0bS71mRS4Lso8A"
  },
  "lHUf0J5ayd3xUAWsnOjJrg": {
    "date": "11/1/2014",
    "text": "I had a wonderful relaxing morning listening to some videos and spending time with the dog.  The latte was very yummy and they made it perfect to my specification.  The coffee was of very good quality as I did not get a headache or the jitters.    All the other people around me looked like they were also having a great time!  I really enjoyed the people that stopped by to say hi and pet the pup.  The staff was very friendly and even brought my dog a bowl of water.  How cool was that.  So definitely a dog friendly place and I look forward to my next visit!  Thanks,  Jim Kreisman",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tZkX6535CPH5Rbkxn9Fr0Q"
  },
  "M13o9f9JL9NKu9CqVz81mQ": {
    "date": "9/27/2014",
    "text": "Yesss!!!  - Delicious espresso  - Non-annoying internet music channels keep me feeling groovy - Nice view (patio AND lake) - There's a piano! - It's not Starbucks",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rs-HbyVraRCP2X4ey1t-IQ"
  },
  "BML0rPz7Ywc0t9iNOs5foA": {
    "date": "9/15/2016",
    "text": "This place has wonderful third wave coffee. They roast it all there! So great!!! The free wifi is awesome too of course.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-wEDMzRHg9MxoOvWBlDOVA"
  },
  "iHgX0YqE9pqgqpZiHHrMZA": {
    "date": "10/4/2014",
    "text": "Just had a cup of coffee from this place. I tried the dark roast. I found it to be of excellent quality without the need to sweeten or add anything to it.   The environment is pretty nice. It looks like they also serve hard alcohol and wine there. It would be a good place to hang out and read a book without feeling like your selling your soul to the trendy hipster gods.   They also sell their coffee beans which I really like seeing in a coffee business. Definitely intend on visiting again and will probably pick up some of their house blend coffee beans on that visit.   My only encouragement for the business is that I felt the price of the coffee was a bit high. Then again it was a premium cup of coffee in Scottsdale which I suppose comes with the territory.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7aM07dn_D7NeYT4WH2BqTA"
  },
  "xB-Tv4T21OwFRBnur2resA": {
    "date": "7/29/2016",
    "text": "Great service and a sweet little homie feel to the location. Great view and quiet. Definitely will make it one of my to go spots. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "S50vEN7EI-7RanI4gPVDLg",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/S50vEN7EI-7RanI4gPVDLg/o.jpg"
      }
    ],
    "user_id": "G-3DdSrQybZFlrQtOzrUeg"
  },
  "z6o_bVCkPILPFygNSmVmiw": {
    "date": "4/12/2014",
    "text": "Two stars because they allow dogs. Great start.  It goes downhill from there. This place has a great location. A cool hip vibe.  And they can't stop tinkering with their service or menu. They had incredible salads. Then they downsized the portions. Then they changed the salads. Refills on their amazing iced tea were free - now they are $.50?? This was the final straw. Who the ---k wants to stand there and dog $.50 out of their bag. Or - oh better yet - let me run a $.50 charge on my credit card.   I really hope they find something that works and stick with it. Key word is works because it's so obvious there is some knucklehead partner investing here who should not be involved. That's all I can think. Because they have everything - dog friendly, great patio, cool interior - and somehow they are ---k--g it up?  You know the worst part? I was so annoyed by the refill price, I stopped to yelp. Now I'm late for the dog groomers. Thanks, Altitude.",
    "rating": 2,
    "rated": {
      "funny": 5,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "dXfkkV1d0W-RAVMs1-4V8g"
  },
  "KtA9zXXP4Seu1I455H7hzg": {
    "date": "7/19/2016",
    "text": "Coffee is great, not incredible. Staff is very friendly and knowledgable and quick to make recommendations to people that need tips.  The patio is great and has very comfortable and spacious seating. The downside comes during the summer when you are forced to sit inside due to the heat. The barstools are not very comfortable and there are only a handful of tables",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ajrw6pcj1Nt9FUEL9nhqdw"
  },
  "lJUeR6nj-8AKRKMTa0g2TQ": {
    "date": "8/22/2016",
    "text": "Friendly staff and comfortable setting.  Coffee is supreme.  I think I found my new office.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GaXhexL5Q3rFKGcrMG6mIw"
  },
  "7nqZIgG03akgoHlNICN9og": {
    "date": "3/8/2014",
    "text": "What a bunch of absolute business idiots! We arrived at 1pm for lunch. We're seated and ready to order. The owner comes out and says they are closing for an hour to take a break. And we should come back then! NOT!!  We will NEVER come back and spread the word and share this story!",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "-F9XyLN_0mqbA7LxEFO4UA"
  },
  "leTdHpVejKUUwwN_62i-4Q": {
    "date": "2/7/2015",
    "text": "My friend and I met here to catch up and ended up working there the rest of the afternoon. I had a latte and was introduced to something I am now completely addicted to... the KALE CAKES!! Because we were there so long we ended up getting lunch too. I had one of the salads. It was yummy. They have some really great seating inside, but the patio is where you should definitely hunker down. While the cushy furniture isn't all that cushy, the landscape more than makes up for it. I've been back three times since my initial visit for those crazy cakes. This will stay at the top of my list for coffee spots. Did I mention how much I love the kale cakes?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VOID7jyZf0EbuUJuwcXjIQ",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Look at all the goodness!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VOID7jyZf0EbuUJuwcXjIQ/o.jpg"
      },
      {
        "img_id": "9m0bPgfF1hKnMsmT2SyiUA",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Kale Cakes from #AlititudeCoffeeLab = new obsession. Healthy goodness!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9m0bPgfF1hKnMsmT2SyiUA/o.jpg"
      }
    ],
    "user_id": "UqibbDXf9JhGviOReV8RBg"
  },
  "P3zhzcXlJ6kdT29Z2ZKN5g": {
    "date": "5/31/2015",
    "text": "I love this place, definitely my new favorite coffeehouse. It has a beautiful outdoor seating area, I went with a friend and we even brought her dog.. It was so much fun. The chai tea latte is my favorite, we also got one of their pizzas, although it was a little messy to eat, it was very delicious. Love love love it here, I keep bringing new friends to share this beautiful place. I can't get enough of it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bt4CBMEThHAOrGUaXTv5Sw",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Their Chia tea latte is awesome!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bt4CBMEThHAOrGUaXTv5Sw/o.jpg"
      }
    ],
    "user_id": "-6s5WT2JkFHVvEaTqyQohA"
  },
  "OPmR6Hv_POT-naPLlvFkaw": {
    "date": "1/21/2014",
    "text": "I came here for two reasons: 1. As a great addition to the coffee tour of Phoenix! and 2. because I had time to kill in scottsdale. I really didn't think it was anything special (sorry guys!). I know they roast their own coffee, which is nice, but the coffee was very ordinary. It was fine, but nothing spectacular. Additionally, they have only one size of coffee in mugs (I wanted 16 oz, but could only get 12 unless I wanted a to-go cup... odd). The atmosphere was fine and the owner (possibly?) said they have karaoke, which is kind of neat. Seating inside is a little limited, but I easily got a spot at the window bar. If I were in the neighborhood, I would consider going back, but I think Press is a better choice for the area, and several downtown coffee bars would beat it hands down. Anyway, it was ok, but I won't be rushing back.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 3
    },
    "photos": [],
    "user_id": "d_TBs6J3twMy9GChqUEXkg"
  },
  "GKA8Crutp5s4XNKBIPQ3eQ": {
    "date": "3/1/2014",
    "text": "I frequently visit Scottsdale for business and I saw Altitude on yelp so I wanted to check them out. First off this review is almost purely based off of their coffee quality. (Which after all is the most important thing about a coffee shop.) I didn't try any food on the menu...so I can't say anything when it comes to that.  Anyway, the cappuccino I ordered was very sour and almost had a bad lemon tang to it. I actually could not finish my drink because of the foul taste it left in my mouth. I usually don't like leaving bad reviews of a place, but truth is I just couldn't finish my drink...which shouldn't happen. I should be enjoying every sip. I don't think I'll be back anytime soon, as there are better options in the area.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "TK4vWEymYV42Q8XlRzu0Sg"
  },
  "t3tI6NsZoX7SaYORa1_Nlg": {
    "date": "12/27/2016",
    "text": "Wow.  Awesome coffee.  Not much more to say that hasn't been said in other reviews.  First time here and I will be coming back soon!  Great service and the people working here were awesome.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "2PBfX3D7bJyGCPiToMvTAQ"
  },
  "bwte4RxYbiHentZwFJPODA": {
    "date": "1/27/2014",
    "text": "Not many places you can get espresso, wine, bloody mary, breakfast, lunch, bruschetta, wifi, AND bring your dog!!  Oh, and they have dog biscuits too!    I LOVE this place.  All of the staff and owners are really friendly.  Some of my favorites are the salmon bruschetta, egg white breakfast wrap, and the caprese panini.  I haven't tried the dog biscuits, but I have it on good authority that they are amazing!  Right on the lake, so great pre/post walk/ride stop!!  They do open mic night on Wednesdays too if you like to play!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "hS1i4ZL4RHIAMZHxwDGreA"
  },
  "aEkGcE7n438_zvoW0QKLiQ": {
    "date": "6/12/2015",
    "text": "Charming place and great service. I came here for coffee and to work remotely for a while. The service was good and friendly. The almond milk latte was delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vj9a_1mv2o2uml8-6Bud2w",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vj9a_1mv2o2uml8-6Bud2w/o.jpg"
      }
    ],
    "user_id": "SacHipl8K4k9eBGJq23oiQ"
  },
  "0IlIrBMFvP05LtM20oC9VA": {
    "date": "4/7/2014",
    "text": "I just discovered this gem and I will be back soon!   First and most importantly, the coffee is great and so are the lattes!   Second, I have never met a nicer staff at a coffee place. They are super friendly and accommodating to all of their customers needs. We wanted to take pictures there and they had no problem with it and even helped us out. They really go above and beyond.   Third, it is right on the water and it is so beautiful and relaxing to sit outside here and drink coffee. They inside is decorated perfectly and is just adorable.  Finally, not only do they have coffee, but they do wine and cheese. What more can you ask for!?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DQ5Szn4T14ddEd6F5jHHpg"
  },
  "3DbtDMZWBvi-cF6zx6cRRQ": {
    "date": "9/23/2013",
    "text": "Not bad coffee- but the little 'chef' guy needs to learn some manners and respect. I get that you're enthused about your store, but when I mentioned I'm a regular at the roastery in the same mall and was checking this place out, he sighed and said \"yeah, they aren't very good\". Lesson number 1, don't ever do that.  Bad etiquette and poor taste, followed by watching him interrupt our ordering- flirting with the counter girl and causing her to take almost 10 mins for a latte when place was empty- I will not be returning.  2 stars for patio and a good product- hopefully they can learn some better service, as the roastery has them at this point big time.",
    "rating": 2,
    "rated": {
      "funny": 5,
      "useful": 15,
      "cool": 1
    },
    "photos": [],
    "user_id": "8ZWHjoWFFWBV1C1J8KqKmw"
  },
  "9WqMgYyXOy0TaKJdkIaJNQ": {
    "date": "4/13/2015",
    "text": "An excellent place to relax, enjoy the beautiful view of the lake while listening to coffee house music and drinking delicious coffee!  Great staff and impeccable service.  :-)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gO-CsAIFP4cvBoUoXmLDJA"
  },
  "XVIXvhoFwrUiQ2HrruX3yg": {
    "date": "10/17/2013",
    "text": "Have tried this place twice, probably won't return until they work out the kinks. The menu in the wall is big so you can't miss it. The problem is that it's only a part of what they offer. Their REAL menu is on the counter by the cash register and if you're lucky you'll notice it on your own because they don't draw your attention to it. There was only one counter menu and when I asked for another I was given an 'old' menu with different prices and food choices. What?  It took way too long to get our food and it wasn't hot when it finally arrived. The owners  seem not interested to correct these easily correctable situations.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "-GSbmUH39PdZkPU7cKGMMg"
  },
  "Xpaj9ICpCHq6rUPianhsgQ": {
    "date": "11/8/2017",
    "text": "First time... Gorgeous shot of Guatemalan and Ethiopian. I'll be back!  Beans are fairly priced for a micro roastery.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fMVnY7REYnrewg4AtaTtPw",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fMVnY7REYnrewg4AtaTtPw/o.jpg"
      },
      {
        "img_id": "pf4juJCK2uF4DVVg60qKvA",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pf4juJCK2uF4DVVg60qKvA/o.jpg"
      }
    ],
    "user_id": "kb3LTzLd2lgVQn3t8ts63g"
  },
  "uIAHsZ4ugxFTvmixlLBYAw": {
    "date": "5/4/2019",
    "text": "Great coffee and amazing gluten free pastries.  The friendly staff makes it even better.  Very scenic and peaceful area to enjoy a cup of Joe.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oBHGaaxz14-rF4Rndjb8LQ"
  },
  "g1JaO6TMTj9zMHtspuV9Og": {
    "date": "4/19/2019",
    "text": "We were passing through and found this coffee place nearby and I have to say their drip coffee was quite impressive!!! They well exceeded my expectations and I had the most delicious cup of coffee I have had in awhile!! Would recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jQx0BX1u8f2rUaJ2XTdnyg"
  },
  "lJLYmfsmEl9jbZ065Yrnpg": {
    "date": "10/18/2018",
    "text": "I went here for the first time the other day and it was wonderful! The view of the water is so peaceful and when coffee comes with latte art, well that is just a bonus! I'm looking forward to going back soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jV-MHT6BbWw_Lfh-hlfa6g"
  },
  "LPIAEWBRR7oqZl6bW_-OQw": {
    "date": "3/28/2018",
    "text": "Altitude is one of my top 5 coffee shops in Phoenix Scottsdale area Always solid relaxing atmosphere  Locals are looking coy to have you",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qbZlO17MDbzkYLgVv5Kj5w"
  },
  "kpdFPf8UY5zL4CoPmAaYmQ": {
    "date": "11/10/2018",
    "text": "I've been there a few times over the past couple of years.  Pretty view of the pond...nice found the coffee to be \"ok\" and the service the same.  I don't dislike the place there just isn't anything I really like about the place either.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0YZK6daN_87bsb5TqWY1IA"
  },
  "j_MxtleIFHIY0sySqc0UkQ": {
    "date": "2/5/2017",
    "text": "Decided to come in today to enjoy a cappuccino <a href=\"https://www.yelp.com/biz_photos/altitude-coffee-lab-scottsdale?select=4FehYDds5pD-j1mO10BE7Q&userid=M9rRM6Eo5YbKLKMG5QiIPA\">yelp.com/biz_photos/alti...</a> and a flaky almond croissant <a href=\"https://www.yelp.com/biz_photos/altitude-coffee-lab-scottsdale?select=B_oaDaVFvdAyJWTY5sV2Hg&userid=M9rRM6Eo5YbKLKMG5QiIPA\">yelp.com/biz_photos/alti...</a> when I saw that <a href=\"/redir?url=http%3A%2F%2FStumptown.com&s=359dd0c60d8fab574e7a05fa0f390abe2f2380d18283f8c3004a3b245ea63b1a\" target=\"_blank\" rel=\"nofollow\">Stumptown.com</a> (15% donation) and Altitude Coffee Lab, among other coffee shops nationwide, pledged to donate a part of their sales to American Civil Liberties Union this weekend only. <a href=\"/redir?url=http%3A%2F%2Fsprudge.com%2Fa-handy-map-for-this-weekends-aclu-cafe-sponsors-115411.html&s=2604bb2a12bebc1cd488757be842ce03b55201185ac570c4db15ab66ffbd648a\" target=\"_blank\" rel=\"nofollow\">sprudge.com/a-handy-map-...</a>  Of course, I found more goodies to try, such as a delicious chocolate croissant (generous chocolate amount- thank you!) <a href=\"https://www.yelp.com/biz_photos/altitude-coffee-lab-scottsdale?select=Uiesscw6OWSpnb4rMDW2aQ&userid=M9rRM6Eo5YbKLKMG5QiIPA\">yelp.com/biz_photos/alti...</a> and a Baked French toast, minus the powdered sugar dusting. <a href=\"https://www.yelp.com/biz_photos/altitude-coffee-lab-scottsdale?select=f60YYK0eI5O7LqLRcNAKIw&userid=M9rRM6Eo5YbKLKMG5QiIPA\">yelp.com/biz_photos/alti...</a>  Cappuccino was creamy, with hints of cocoa and clove.  I loved the texture and flavor of the almond filling in the croissant,  but wished there were more of it.  The baked French toast's presentation was a surprise- it looked more like and had a mouth-feel of a bread pudding.  I asked if it came with fruit and/or cream, and Cait, the friendly and helpful manager, offered up strawberries or blueberries.    I called Altitude yesterday, spoke with Andrew and  asked him for more info as to what percentage of the weekend's sales were going towards ACLU, but he did not know.  However, he promised he'd find out more by Sunday.  I came in today, spoke to Cait, who took my order at the counter,  but she also did not know.  She asked for my email and promised someone would contact me with the info.  I had doubts that no one knew about the fundraising, and my doubts were cemented when Cait asked how I found out about Altitude and said fundraising-- I replied through a search online about said coffee shops.  An article named Scottsdale's Altitude Coffee Lab and Chandler's Provision Coffee among two of the 350 coffee shops participating nationwide.  Hmm... hoping that a good portion of my purchase does find its way to ACLU, but if not, I still found great coffee, great delicious pastries, and good customer service at ACL!  Thank you Cait, and thank you Andrew for the beautiful coffee art! <a href=\"https://www.yelp.com/biz_photos/altitude-coffee-lab-scottsdale?select=JItAVSWN-8O8KRAWPoZBpQ&userid=M9rRM6Eo5YbKLKMG5QiIPA\">yelp.com/biz_photos/alti...</a>  p.s. Glad that I was able to finally purchase a few beautiful mugs (one is a Mazama!) from Stumptown while knowing that 15% of my purchase is helping to fund ACLU!  Also am looking forward to trying out delicious-sounding organic and/or direct-trade coffee beans I'd normally rule out due to their high price tags.  ($19-$24 for each 12 oz bag!)  pp.s.  Called up Chandler's Provision Coffee Bar today and received confirmation that it is indeed donating 10% of its total weekend profits to ACLU.  Please help support a worthy cause!  NOTE: Altitude pulled out of the fundraiser,  but supposedly donated $10 in my name.  Glad Provision and other valley cafes proceeded with their pledges!",
    "rating": 3,
    "rated": {
      "funny": 27,
      "useful": 46,
      "cool": 46
    },
    "photos": [
      {
        "img_id": "f60YYK0eI5O7LqLRcNAKIw",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Baked French toast.  More like bread pudding.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/f60YYK0eI5O7LqLRcNAKIw/o.jpg"
      },
      {
        "img_id": "lUAnMjYPRLwRW1YYlIHdIw",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Baked French toast!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lUAnMjYPRLwRW1YYlIHdIw/o.jpg"
      },
      {
        "img_id": "PhrKxPoi1w60YRdpcCb0bw",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Baked French toast.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PhrKxPoi1w60YRdpcCb0bw/o.jpg"
      }
    ],
    "user_id": "M9rRM6Eo5YbKLKMG5QiIPA"
  },
  "MmpHAKK60p6bx1w8KFaVhw": {
    "date": "12/6/2017",
    "text": "Not impressed with the service or coffee, but love the location on the water.   I decided to give Altitude another try after having been there once prior (about 2 years ago). My mocha was flavorless and not hot enough, and the barista was very unfriendly. Being a small coffee shop I would expect the opposite.   If my coffee would have been great, I would return, but not worth it for me to go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xX4LKxPkZrhqI5CQwm0uXQ"
  },
  "HhSDvD9TJF5THC-Nj8w60g": {
    "date": "3/17/2018",
    "text": "Beautiful place by water. Cozy with nice 70's music playing softly. Nice employees. Delicious avocado toast and coffee. Bought some coffee beans for home. Free coffee with beans purchase. Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Wr4DsnOwDaP-B5eEOZ6sXw",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Wr4DsnOwDaP-B5eEOZ6sXw/o.jpg"
      }
    ],
    "user_id": "T-NcwTfUt6tq-iOSm5J2sw"
  },
  "NqsV4cS3IwqgFJrCLWqz7w": {
    "date": "11/6/2016",
    "text": "Delicious dirty chai, beautiful patio with cozy chairs and tables and pops of reddish seat cushions and umbrellas to enjoy the weather, great staff, personality. Large drip coffee for $2.75. Dirty chai latte 16oz is $4.45 and comes with a lovely design  :)   Large chocolate moist muffin is worth sharing. I'd come back for another latte!!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "GulporeP35ZUP9RvKmsxjA",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Dirty chai latte",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GulporeP35ZUP9RvKmsxjA/o.jpg"
      },
      {
        "img_id": "IH-gluKOzAZBL_s04bDnug",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Outdoor patio seating",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IH-gluKOzAZBL_s04bDnug/o.jpg"
      },
      {
        "img_id": "tpZw32yEdAwHy-BoIhERaA",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Pastries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tpZw32yEdAwHy-BoIhERaA/o.jpg"
      }
    ],
    "user_id": "ia5kvJxYR8gPItl9O4W0Mg"
  },
  "DraiUX81ErxLX1PBLmMEow": {
    "date": "10/26/2017",
    "text": "OMG! This is my 2nd time giving this place a try and I will NEVER do it again! I'm done! Stopped by on my way back to the office for just a side bite to accompany my lunch (bagel, grilled cheese, side salad, etc).......This is what I got for $5.50+tax! $5.50!!!! ARE YOU KIDDING ME!!!!  She did a great sales job talking this crap up! When I got back to the office and saw what was in my big takeout box, I nearly  myself!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "c0WCw2XTnfzoP_yjGPiuNw",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Sun-dried tomato basil &amp;amp; feta toast..... Great &amp;#34;snack&amp;#34; she said.... So not worth the $5.50 I paid for this!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/c0WCw2XTnfzoP_yjGPiuNw/o.jpg"
      }
    ],
    "user_id": "O71PN016VT8c-D5pg2gEWw"
  },
  "fJoBgqdD5HFC4QUKd2tjYg": {
    "date": "8/11/2018",
    "text": "I'm giving one star because I cant do less. Very disappointed in their coffee and knowledge of making coffee. We ordered a mocha latte total of 3 shots and unless these were shots of sugar milk and chocolate I'm not sure what happened. It was the sweetest grossest triple shot mocha latte ever. Do not order unless you don't like coffee. Also ordered a lg cold brew and was served a regular. Confirmed with the blond who made the drink and I said is this a large she says yes, and in fact it was the regular. So overpaid for very over sugared chocolate milk and wrong size cold brew. Was not worth 12.00.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j1nOlxCtkPL2DxXfFe77wA"
  },
  "CSubMLloBZtHx2gEHX-BXg": {
    "date": "1/21/2018",
    "text": "Amazing coffee! Every time we come to Scottsdale it's a must for us-yes we are going every morning  when we here.Coffee is probably one of the best and Avocado toast made with Fresh avocado (NOT a pre made spread like must places). And the service is amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "scppA9R4nmJOopmVUuqmEw"
  },
  "jouLd7jw_YUUg7DWwCAH5w": {
    "date": "8/21/2015",
    "text": "I just wanted to update my review real quick to say Oh em gee, the pastries! Wow. (I'm totally scarfing down a cinnamon scone and a chocolate chip cookie as I write this.) The scone is so flaky and crumbles like it should... so good! And the hint of cinnamon goodness is a little autumn tease (don't rush it though, I like summer!)  The chocolate chip cookie was so good; didn't stand a chance. It was soft and chewy, and baked thick so it was almost half-baked, and ooey gooey. Exactly how I like my cookies... if they even make it to the oven. Haha!  Moral of this post: Go get some delicious pastries at Altitude! NOW! Do it, go...",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 16,
      "cool": 10
    },
    "photos": [],
    "user_id": "HHrDK8PKL3div1uBYym6LQ"
  },
  "vfcpgL4Yt9rt_FOFzCrk_Q": {
    "date": "6/19/2018",
    "text": "This is a little Gem. They make one of the best cappuccino's in the valley. Their coffee is fresh roasted and they do the perfect mix. To top it off the cappuccino had a big heart on it before I took it away.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MuP8_0VV_waK4qwOXILhTQ"
  },
  "mNhiR0tzAEDR0qg29RsZgw": {
    "date": "1/12/2018",
    "text": "A little more pricey than I would have liked but other than that, I am very happy with my experience! I got a pomegranate iced green tea and my friend got a Frappuccino, which totaled around $9 (not including tip). They were a good size and really tasty. The main reason we came here was because we could bring my dog and it has excellent outdoor seating and even dog treats!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "l0qggWzrc_e_W45YA8J-PQ",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/l0qggWzrc_e_W45YA8J-PQ/o.jpg"
      }
    ],
    "user_id": "cgsBIQaHDwZ1TEd5oMAWKg"
  },
  "weIzw-ZQXI-gXdd9P1r-hw": {
    "date": "11/12/2017",
    "text": "Great place! Right by the Indian Bend wash, this charming place is in the perfect spot. Beautiful outside seating and cozy inside seating - suitable for any weather. They make great coffee and their light fare is delicious. Noble bread is to die for! Food is a bit overpriced for the amount you get, but that's Scottsdale...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1xxamTPWOmhSPYYj0F4Jkg",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Breakfast sandwich w/no bread",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1xxamTPWOmhSPYYj0F4Jkg/o.jpg"
      },
      {
        "img_id": "3rCCn0xbAZFJYVkqeoS5-g",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Avo toast",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3rCCn0xbAZFJYVkqeoS5-g/o.jpg"
      }
    ],
    "user_id": "NSk5--N50J2pnTybhD97zg"
  },
  "6-sv433cmVsjTynMOsfCNg": {
    "date": "12/29/2018",
    "text": "My morning go when in need of coffee before work. Great staff, coffee is always good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jku3w9OzakZCYYtqIFkEvA"
  },
  "RZEfRdR6lrYBjbpJvfWVgQ": {
    "date": "7/15/2018",
    "text": "Love this place. Great coffee and they have gluten free pastries. New ownership is fantastic - really makes this place stand out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6wNLHq7HcfdhfcKWD5ubZg",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6wNLHq7HcfdhfcKWD5ubZg/o.jpg"
      }
    ],
    "user_id": "X8vhISkLC4QDjZ6R3YUmkQ"
  },
  "-fTsUkCuVJnC_6iHYLLD6A": {
    "date": "6/29/2018",
    "text": "Ran out of gas looking for the gas station on Hayden. Had to park it at Lakeview Coffee. Avery, the barista helping me, let me use their charger, borrow their phone and gave me some much needed water. So polite and didnt hesitate to help someone in need. I decided to try the latte here and it was absolutely amazing!! Great ambiance, helpful people and an overall great experience. Highly recommend Lakeview Coffee!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yJqFAZy8wjkwxTpHklfpOQ"
  },
  "CvUqRVadu8kf-8oz62NACw": {
    "date": "9/28/2013",
    "text": "Fantastic addition to the neighborhood, excellent coffee, great patio, atmosphere is exactly what one needs when sipping on a cuppa. Staff are supper friendly and the menu is growing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "cVIjlQsEHrAwJhHCaoX2xQ"
  },
  "8Syuq1fftX837_QirPZ6Gg": {
    "date": "10/20/2013",
    "text": "Great little menu with Paninis, wraps, salads etc.....Great coffee, nice staff and when the weather is great, the patio is excellent with a view of the lake....yes, McCormick Ranch has lakes.  I will definitely come back here regularly..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4WYMIyXfXEzWiJKJuKdUTg"
  },
  "QV1ct2BZLZquYaQpoLkyFw": {
    "date": "5/30/2014",
    "text": "Awesome patio!  My girl and I love this place. Love Friday night's here when they have entertainment.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oj2-VtOqyRqfkCu6PgrHcQ"
  },
  "ZUPpWuNt5CSWUNysDLxd7g": {
    "date": "5/28/2014",
    "text": "If you looking for a great place to hang out, with amazing coffee, snacks, and friendly service... Altitude Coffee Lab is the place!  I have heard that they offer entertainment on the patio, so I am going to check that out and try some of their wines.  In the land of corporate coffee shops, go and try something different.  You will not be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lG64lAyEAG1W3tkPGGPyAA"
  },
  "SArDehYJMkImgt4s76c05A": {
    "date": "2/22/2014",
    "text": "This coffee shop is not exactly close to where I live....However it is worth the drive. Why ? The coffee is superb, the baristas don't have an attitude and the beans are roasted n house. The owners are also super friendly and welcoming. I usually come here with my dog and I am assuming he feels welcomed too as Altitude also makes dog biscuits !!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YfvMjY-G6y86Ov2tS5Txww"
  },
  "mXJ2UEsXpPe5SnGXJLpHwg": {
    "date": "12/29/2013",
    "text": "Although they have some work to do (I have been here twice, and both times, the waitstaff forgot multiple items on the order), they are nice people, trying to create a place where people can gather over a light meal and enjoy the space.  And a wonderful little space it is!  It really does have a nice VIBE: clean, modern, simple.  The food is similar: simple, not fancy, not stuffy.  And I really do love the coffee!  But really what impresses me most is that this little start-up has a pretty good crowd on a Saturday!  (I think that is a Billy Joel tune...)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yks-zWhYKVV-S_luTu3dNQ"
  },
  "uUwndc1KN-eBmCpSBxLv9g": {
    "date": "1/13/2015",
    "text": "A great place for a cup of coffee or tea. Excellent atmosphere. A gem that not many people know about.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s0sdBsjQHLq5987oOrfh1Q"
  },
  "m1foMIQL__Ua2AoYLvGbzw": {
    "date": "7/2/2014",
    "text": "I consider myself an Americano snob...and freshly roasted espresso at Altitude is seriously THE BEST cup of joe I have had in the state of Arizona. Would have to travel to California to get something comparable.The owner is very friendly and took the time to ask about my life. Worth the trip from anywhere in the valley!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BTpW-71-g0yETGY8wsfOqg"
  },
  "wVW2iJz-O7oYy7n8pQ3eRA": {
    "date": "9/25/2013",
    "text": "I stopped in this afternoon with the family for a coffee and hung around for an hour or so. I'm glad we have another local shop roasting coffee in-house in Scottsdale!   The drinks were exceptional. I got a cup of the Guatemalan single-origin which was delicious. Even though they said it was a darker roast (which kind of turned me off initially) none of the complexity of the cup was lost and you could tell that the coffee was fresh. My sister had an iced chai tea latte and my dad had a latte. We all enjoyed our drinks very much.   The ambiance was nice, plenty of good seating and a good patio with a great view of the lake at Mccormick Ranch. I will definitely return to get some work done. I can see myself hanging out here in the cooler months :D.  There is room for improvement though! First, I wish that they brewed their coffee by the cup for customers. There are other places that will brew each cup to order using a chemex, aeropress, V60 or the clever. Although you will be waiting five more minutes to have your cup of joe, you know each cup is as fresh as possible. With that said, although I'd prefer my cup brewed after I order, it does save time and the cup I had at Altitude this afternoon tasted as fresh as any. Second, I wish they had more coffee offerings! A house blend and the Guatemalan were the only two that were available. They should definitely look to expand their offerings! Also, please don't start over-roasting coffee...  All in all, drinks were exceptional, ambiance and interior design were great and the location was excellent. Also, the people were friendly and service was great! I know this place is going to do really well here. I can't wait to return and try some of their food and other drinks. They only lost a star because of the two areas of improvement I listed above.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hVZMF_Vnmmr9kb63H5A58w"
  },
  "fnHhH-a3UXloVzcdl1BYPg": {
    "date": "3/30/2014",
    "text": "This place is amazing!! I go here a lot (once a week) for business meetings etc. I always get the egg white breakfast sandwich and I can't stop eating it! The prices are great!! It is also located in a beautiful area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ShcOJmQ6btAqy8JcufwqLg"
  },
  "nqwzMK_EbwUe7bci7kqX5g": {
    "date": "9/18/2013",
    "text": "Fantastic to see a quality independent open in Scottsdale. Altitude is poised to be the \"Urth Caffe\" (LA's Best) of Scottsdale. Best of luck to Craig and team, their coffee is exceptional. C'mon Scottsdale...Support this local joint!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ezF0ppO_4CgxYpQYaceHHw"
  },
  "KP5i04Be7QtPQ1S-9EzUuw": {
    "date": "2/27/2014",
    "text": "Great coffee, atmosphere and food. They have wine, beer and open mic evenings. All the necessities in life; beer/wine, food, water and music.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XkrU3KBGuXkuUeWUzK4hEQ"
  },
  "dMonLZCRrwIq7Wi1htfuwg": {
    "date": "5/1/2014",
    "text": "The service is good and the patio is pleasant and comfortable. I like the green iced tea!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TZEsIMjNJAh4qUas9wr6qw"
  },
  "Lyx7GX7GJiXaZdMf6aY-iA": {
    "date": "7/5/2014",
    "text": "Love the patio here. It is one of the few places during the summer afternoons where it is not too hot to still enjoy the outside. They also have live music and fantastic drinks!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IjVS3SzwiTlI1zRO8VC3Ng"
  },
  "BYUV_TIAw7Nc_JHUkmUgGg": {
    "date": "2/9/2014",
    "text": "One of the best places in town for coffee. The food is spot on and great baked goods made fresh everyday! The chef is definitely going to be one to watch for. He's always super creative and comes up with the tastiest items, sweet and savory. Try the maple bacon muffin!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kAVlg8RisHJLrhdTKOCbqA"
  },
  "wzclidFCcf9ztQePkmyoyQ": {
    "date": "6/24/2014",
    "text": "Went here today with my family and was very impressed. I wasn't even through the door and right away I heard a pleasant voice greet me. Very strange as Im not used to an establishment like a coffee stop in Scottsdale have customer service or appreciation. Very cute and cozy inside and very clean. We had a Cappuccino, Latte and an Iced Latte. All were very pretty and tasty. I felt welcomed here and would definitely go back again. A completely different experience from the coffee stop next door.  I would come back next time to check out the food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j956tzE85O7ijUJuVF-leg"
  },
  "MVYfRAWQ-mKhbD2NQhJ9Eg": {
    "date": "5/29/2015",
    "text": "As a coffee snob I was excited when I came across this place. Seemed pretty cool inside, nice little patio overlooking Mccormick Ranch and a welcoming decor inside.  Best part is they take their coffee seriously. Usually if you can sense the passion a place has for its craft immediately, the craft turns out pretty darn good. That is the case here,  great coffee, and what excited me also was great iced coffee, they aren't just putting coffee over ice here they take the time to do it right.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZY6qvHbhTnHuMn0pB7XBNA"
  },
  "PrQ1M558HAk4Mo4VhDjkBw": {
    "date": "10/8/2015",
    "text": "the word 'lab' suggests a more precision operation than my girlfriend & i encountered on our one visit to altitude. after spending a coffee-less morning down the street getting blood drawn, we were jonesing badly for quality coffee & this place let us down in a big way. the staff appeared better trained in customer service than espresso preparation. the two quad americanos we ordered, made consecutively by the same barista, were different in flavor & consistency but both distinctly off. one had crema & was bitter tasting, the other was thin-bodied, no crema & sour tasting. there are many variables to a good espresso & it's not always easy to identify what exactly the problems are, but a place identifying itself as an artisan coffee cafe needs to do better. after a couple bummed-out sips we left the americanos on the bar & went to cartel.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7c83B4vLGf9V_5X8ub6hOQ"
  },
  "rd8XRJKtAlDPizL2U3Q7rw": {
    "date": "5/25/2014",
    "text": "No need to go anywhere else.  If Cheers was a coffee shop, then they'd call it Altitude; familiar faces, friendly welcome, good conversation. Add great coffee, beer on tap, a dog patio for the kids, international accents and decent music and it's pretty much the royal flush right there.  Just add a TV for the World Cup and I'd move in for the summer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XfbxxUaUVxtgCxIjWhBkfQ"
  },
  "W1-5lHaMSXC5ljUsMSyneg": {
    "date": "11/3/2014",
    "text": "If you like great cappuccinos & Italian style panini's, this is your place. I drive past a lot of coffee shops multiple times a week to get to Altitude because there is more pride in their fares than most any other coffee shop around. Favorites: cappuccinos (I mention again because they are truly exquisite), light roast coffee, gluten free breakfast wrap, chicken & grape salad, pastrami panini.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "1WsVqP0LuGlonNYuB78NgA"
  },
  "SnGnVDLl6ZEWyZcJOfadJA": {
    "date": "5/12/2015",
    "text": "Great little coffee place.  Lots or organic stuff on the menu.  My only complaint is that got my order wrong.  That being said, I still liked what I got.  Will definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oPXN3RsycxWhEaHJu3WZQQ"
  },
  "Pq7BmdAqEGr-mIFy2FgoFg": {
    "date": "9/14/2014",
    "text": "Very cute coffee \"lab\".  Great patio facing the park.  I had a ice green tea and it was good and decently priced.  I would definitely like to hang out here again if I'm in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Z8g8lyU6ILsItOKJmJmxQ"
  },
  "8-NiBD5giqYvhN6MNiZOqw": {
    "date": "2/22/2015",
    "text": "Hands down the best latte in town! So smooth and rich. I've been coming here for over a year and the lattes are very consistent. Also a great location with a patio overlooking a lake. Love chillin' here on weekends or getting work done during the week. And some of the best live music on Sundays. It's a rare gem in Scottsdale.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "chJPlcbLdaBuMnM4RfG4iQ"
  },
  "zG_SpuQuGHpf28736mwukQ": {
    "date": "2/22/2015",
    "text": "Awesome local coffee shop that roasts its own beans. Great atmosphere with patio overlooking a lake. Tucked in behind the Chipotle. One of 2 coffee shops worth coming to in Scottsdale!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MCmh70KD5DdNkU4e79Lixg"
  },
  "77rxZ-wSAFD3AAvXqQpMTA": {
    "date": "5/6/2014",
    "text": "I love this place!! The coffee is delicious and doesn't tear up your insides like some other well known coffee establishments. Sometimes the little designs they make on top of the latte are so pretty that I almost feel guilty drinking the work of art...almost! The service has always been great and you can't beat the view. The patio is People and Dog friendly. People friendly because most of the patrons are cool and chill and not the Snottsdale type...most of them. The view is incredible...from sitting outside overlooking the lake and watching the fountain to the eye candy sitting at the table next you. ;-)  On Thurs nights they have open mic night from 7:30 - 9:30(ish) and you can hear some really amazing music (not awful karaoke) and have a glass of wine, vodka, whiskey, coffee or all of the above.  I hear they have music on Friday and Saturday nights as well but I haven't been there to experience that...yet! I'm sure it's amazing too!! If you're looking for a cool place to relax and take in some AZ beauty (in all forms) ;-) you'll love this place!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1d7sst3Ygb8GSwZ7haYv5Q"
  },
  "ZN5RV2eccCBZ7N6bf19ZfQ": {
    "date": "5/4/2014",
    "text": "This place is awesome. The coffee is great and roasted in house. When the weather is nice, they have a great patio that faces the lake. The breakfast sandwich is made to order and you can taste the freshness.  Yum. Also they have live music at times on the evening and a bar.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "prpOBEbyb1HD26t4755gtw"
  },
  "CJaDQ0TlAAWWFOEPo5su6w": {
    "date": "4/20/2014",
    "text": "I stumbled upon Altitude after looking for a coffee shop close to my house (this one is literally a minute away). The baristas really take their time and make quality drinks. I used to work at Starbucks and I can tell you that they sacrifice quality for speed all the time. And when you're paying almost $5 for a drink, I would personally rather wait for a good drink. This is definitely the best coffee shop I've been to in Scottsdale.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OPdj80klEaMFSXzUWq34WA"
  },
  "umnjiF5tQWRPsEsBUE9DYA": {
    "date": "11/10/2013",
    "text": "I've been going to this coffee house for a while now.   I enjoy the dining experience.  I like the people and atmosphere there.   The coffee is great - with one caveat.   On occasion I've gone there during the mid-afternoon (2:30 - 3:00 pm) to do a little work on my laptop and enjoy a cup of coffee.  On every occasion the cup of drip coffee they've served me was lukewarm.    When I've brought this situation to their attention they've always corrected the problem by brewing a \"fresh batch\" - however - a True 5-star coffee house would not wait for their customers to tell them the coffee they're serving was sub-par.  I still frequent this place - I still enjoy the experience - but here's my lesson learned - if you want a good cup in the afternoon and you're going to Altitude - get the Americano or Chemex pour-over.   Steer clear of the drip coffee in the afternoon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pcf1joHBqqE9C5kglPDchw"
  },
  "y3LkPyF2tqKM7DUuZJ3cFg": {
    "date": "9/4/2014",
    "text": "I've been to my share of coffee shops on the west coast. Also having lived in Seattle for five years I've spent a lot of time studying in the many local shops. Altitude coffee definitely has its charm--patio seating, nice decor, and decent coffee. However, I give it four stars only because I didn't feel the place was put together well enough to make me feel its personality. It was kinda messy in my opinion. I've been back twice because I'm visiting phoenix. It wouldn't be my first choice, but it wouldn't be my last either.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q6QX-kpKUHfeWoQPxITVaA"
  },
  "-7D5YekZ6WdbMJx_5rccfQ": {
    "date": "10/26/2013",
    "text": "Great ambience, comfy seating in and outside on the patio, pretty good coffee, friendly service... hope they can keep up the good work!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "uluHjQdwAlwzeJgsKvh-MA"
  },
  "dn0Oo1kMIq2DbMw2o0yhDg": {
    "date": "4/17/2014",
    "text": "Found this lovely coffee shop on YELP...so thank you.  It was/is lovely and has now become a place that i meet my girlfriends in the morning.  The atmosphere is warm and welcoming. You do not feel like you are in a parking lot patio as they have many plants and umbrellas that give you the sense of privacy and relaxation.  The coffee is lovely as well as the muffins.  This is a great discovery and you will not be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pSkQqZg-sIpzwtkBI8bwcg"
  },
  "kmklcQH-Nmwu6HfRtwJ3uw": {
    "date": "1/30/2015",
    "text": "Great little patio overlooking part of the lake. In house roasters with an urban vibe. Coffe is strong, but not bitter. Would like to see a better selection of baked goods - both savory and sweet. They are very dog friendly, which is fun.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ooXsLdMrFF0Gvaxqk84MRQ"
  },
  "w2zCCPYx570puZ6qaXdh6g": {
    "date": "6/22/2014",
    "text": "Scottsdale is currently my home away from home & I was worried I wouldn't find a good coffee place to compare to San Francisco for my daily (ok twice daily) fix. I am so glad for yelp to help me find this place! It is in an unassuming little strip plaza. I would have never found it without specifically seeking it out.  Amazingly smooth coffee.  The beans are either organic and/or sustainably sourced. They roast their beans in-house.  The lattes are also delicious.    The atmosphere is wonderful & the staff is very friendly.  There is outdoor seating that is comfortable & they have wifi.    If this place were in SF, I would make this my go-to place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1b4tahv5bz8bOprU75sfIA"
  },
  "byxqiZ8NeeZSWl4HTkmkdA": {
    "date": "10/18/2013",
    "text": "If you haven't been to Altitude Coffee Lab yet, GO!  Great coffee, wonderful scenery (Lake Marguerite), exceptionally nice staff!  Coffee great, scones out of this world and lunches yummy!  AND, coming soon, happy hour!  Check with the staff about a glass of wine on their lovely patio overlooking Lake Marguerite.  Dark Roast coffee was excellent today!!  Enjoy!  K and L",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "5GA2gMRKd64OULusklMnHQ"
  },
  "z9CLQE_kgdT2GUS1SPGQPA": {
    "date": "5/25/2014",
    "text": "Wonderful neighborhood coffee shop!  I came across this gem at the suggestion of a friend of mine.  I have been several times but just am getting around to writing a review.  The service is always friendly and prompt.  The lattes are fantastico but the brewed coffee was a little weak for me (I'm used to the green mermaid).  The patio area is a wonderful spot to sit and enjoy your coffee.  The bonus is that it is a dog friendly spot and I have spent many an afternoon with my dog on the patio.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SOlU2m6AcGorSNJ-aURVUQ"
  },
  "WzH3sopeb4LIIU7Xs5kERg": {
    "date": "12/30/2014",
    "text": "This place serves an excellent latte, but the sandwiches are very small and over priced.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fpKGOHYvn81nBXgw4bCoPA"
  },
  "9GpNd0Mg8w1Idlp6TGO1_g": {
    "date": "9/20/2013",
    "text": "I was looking for a quick lunch and stopped in today to see my options.  Limited menu but several paninis so I ordered the \"Fancy Nancy\" which was prosciutto and cheese.  Unlike Starbucks,  the sandwich was scratch made so took a few extra minutes.  Out comes not fast food, but a plate and presentation that looks like an upscale restaurant.  My panini included a small side salad.  The panini was fantastic!  Simple yet very flavorful and just the right size.  Can't say anything about the coffee 'cause I stuck with bottled water.  But I would highly recommend this place.  Eavesdropped on the owner's conversation with someone else and learned that beer, wine and limited spirits are in the plan.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "2hIReEf7I2kXAk6mU3axJg"
  },
  "mSEIKbFV-mBiVmsCxOJklg": {
    "date": "7/12/2014",
    "text": "They are SOOO FRIENDLY! Not too friendly, but they love what they do and it shows. Food is great, wine is available. Oh the food is tasty too btw.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VNhR3sSkG3T-4oZPOYyaWQ"
  },
  "aFGgpGhA6HDtvQGqrnM8Ug": {
    "date": "9/23/2013",
    "text": "I'm 15 minutes away but its worth the drive when i do drink coffee. Workers were inviting and vibe was good.  Solid tea selection white lion.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "l2mIHrd5GVBrHczVwFLLoA"
  },
  "yuhoAgEn3cGUBXhMPonaWQ": {
    "date": "11/19/2014",
    "text": "Great spot, great ambience.. Best coffee I've had in Scottsdale period! People are friendly and it's got a nice vibe.. Def worth a visit",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XhxE0WO8-Dh2J5FZ3E4Y9g"
  },
  "VAIVnykMLA3_hogRk7sTjA": {
    "date": "10/19/2017",
    "text": "It's a feeling... sometimes, it just feels right. This was my first time at Altitude. I was looking for a coffee shop to plant my little booty down and get some work done. Some people like coffee shops that are busy or have comfortable seating or if they are like me, you're looking for a good cup of joe with something people on top. :) I liked the vibe here... the barista was very welcoming, the place was cute, plenty of seating inside and out. It also has a dog friendly patio with some doggy treats and water set up.   My go to is a white chocolate mocha but I didn't see it listed on the menu. I asked if he could make a white mocha and he said yes. Yay! I grabbed a seat outside and he brought my beverage out to me.   After an hour or so, it started getting too warm so I retreated to a seat against the wall with an outlet.   Being in N Scottsdale, it's not crowded and I really like that.   I would definitely come back to this place and bring Rocky (my 4lb chihuahua).",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "Xu8I3Cl3DFluycJZaV7ovA",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. White chocolate mocha",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Xu8I3Cl3DFluycJZaV7ovA/o.jpg"
      }
    ],
    "user_id": "WSptrgW8NLFBNvw1FOpifw"
  },
  "w_g3lIwwW2KXgm3Iosm63Q": {
    "date": "10/11/2017",
    "text": "If you are in the area, this place has great-flavored espresso coffee and a good brunch or lunch menu.  They roast their own beans. I know because I watched them do it.  There is a lot of outdoor seating and enough indoor seating so you can probably find somewhere to sit most of the time.  I ordered a cappuccino in a ceramic cup. It had a nice smooth texture and a full-bodied flavor. If you like your coffee hot, I would recommend that you specify the way you want it. I didn't and I thought that it could have been served a little warmer.  Overall a solid coffee shop that is worth a repeat visit.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 8,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "16efIMj3UXzX02cRr4lX4A",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Wall art.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/16efIMj3UXzX02cRr4lX4A/o.jpg"
      },
      {
        "img_id": "wQUKNjzqkQtveuGKHzVI2Q",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Do you need beans?",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wQUKNjzqkQtveuGKHzVI2Q/o.jpg"
      }
    ],
    "user_id": "diYbASjeqV4CxkoyeBeBGw"
  },
  "jqVyoq0T_h0EDR2fj6udUQ": {
    "date": "1/3/2019",
    "text": "Great little spot for coffee, breakfast and pastries. I had a decaf latte with  oat milk and the breakfast burrito. Loved both. I am always super excited when coffee shops carry oat milk :) They have both indoor and outdoor seating. The outdoor patio has a partial view of the beautiful lake nearby. Lastly, really clean bathrooms. Always a nice bonus in my book.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ANFcmRRQVt_VqPn4KrpSVA",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ANFcmRRQVt_VqPn4KrpSVA/o.jpg"
      }
    ],
    "user_id": "6NApFGRx79TUC3AeU1A5rQ"
  },
  "vl59X2_ZO8Pv7zTMj2b2LQ": {
    "date": "5/7/2019",
    "text": "Loved the coffee, the atmosphere, the View of the lake, everything about this place honestly. The guy at the counter was patient considering how long I was taking since this was my first time here. I got the caramel cappuccino and it had the right amount of sweetness. Will return here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vXS3P3EZaVP3HLaYOlbLmg"
  },
  "FV-NyYJt6LPddK4C4MkvXQ": {
    "date": "4/13/2017",
    "text": "Came here one Sunday morning to meet up with lovely Yelpers, and I really liked their ambiance. Their patio is by the lake, a great place to hangout with a cup of coffee.  I tried their cappuccino, and I really liked it. You order at the counter and have to bring it to your table on your own. Coffee is really full, I had to walk so slow to bring it to my table. I thought I was incompetent to be a server when I can't even carry a cup of hot coffee efficiently.  I also tried their avocado toast. They put generous amount of creamy avocado, I really liked avocado part. Toast was a tad too crunchy, had a difficult time slicing. Despite of very busy on Sunday morning, service was quick and friendly.  Not sure if I would order their food again but would like to come back to sit at the patio for relaxing morning with a cup of latte. Just need someone to carry my coffee.",
    "rating": 4,
    "rated": {
      "funny": 12,
      "useful": 20,
      "cool": 23
    },
    "photos": [
      {
        "img_id": "hRHLDR8A0Iejn4T9BgdZyg",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Avocado toast with cappuccino",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hRHLDR8A0Iejn4T9BgdZyg/o.jpg"
      }
    ],
    "user_id": "Gfxb_D1k8tueAoGn4cseoA"
  },
  "l1JceCFOCsCv6XWmOIwMcg": {
    "date": "3/26/2017",
    "text": "What a beautiful morning for a finely crafted brew! A group of us gathered together at Altitude to sip and nosh in this picturesque coffee spot. Much thanks to Yuko H. for organizing!  The menu consists of breakfast, lunch, coffee, tea and smoothies. I had the avocado-egg-balsamic toast with an iced latte. Although it was pretty busy this late morning it came out quickly. The toast had a very generous spread of creamy avocado, sliced hard boiled eggs and a drizzle of balsamic vinegar. Overall it was pretty good. I would have liked an additional hit of acidic flavor or a different texture to balance out the creaminess and smooth textures of the avocado and eggs, maybe a thin slice of tomato on top or pickled onions would help? The bread was well toasted but a bit tough to eat with the other ingredients as the crust was very hard to bite into.  The iced latte was smooth, refreshing and delicious. There was no hint of bitterness whatsoever and it was a perfect complement to go with the toast.   While the indoor area is nice and cozy the patio looked gorgeous and was very dog friendly so I will have to keep this spot in mind next time I'm in Scottsdale looking for a dog friendly spot or for good coffee drinks.",
    "rating": 4,
    "rated": {
      "funny": 16,
      "useful": 20,
      "cool": 22
    },
    "photos": [
      {
        "img_id": "OFPlN3QMUNC45-3-h15Fxw",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Avocado egg toast with balsamic",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OFPlN3QMUNC45-3-h15Fxw/o.jpg"
      },
      {
        "img_id": "T1ip3mFyIwD5RyYNv_J6Vg",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Iced almond milk latte and sunflowers :)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/T1ip3mFyIwD5RyYNv_J6Vg/o.jpg"
      }
    ],
    "user_id": "DK57YibC5ShBmqQl97CKog"
  },
  "UMgVC378dXa2Arkkx5E8vg": {
    "date": "8/5/2018",
    "text": "I met some friends here and wow, the first thing that happened is the counter girl came over with homemade shortbread cookies and said, we baked too many, would you like some? Yes, of course! They were perfect, not too sweet, yet buttery and yummy. The tea selection was good and we shared this crazy dessert called a Kurtosh since it was a birthday celebration. Incredible. They warmed it first and then we all tore off pieces like pull apart monkey bread only this was so much better! (Wish we'd snapped a pic but look at the pics on yelp and you'll see it.) what a wonderful place!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xiaJ1lug7dz3EjwF03FlrA"
  },
  "IbY3FiJfGMIFyJB-c-JvJQ": {
    "date": "8/3/2018",
    "text": "Hungarian Chimney Cakes OH MY!!! Stopped in for morning coffee and breakfast and left with one of these tasty cakes too!!! The owner Issac warmed it in the oven for the ultimate experience!!! The young man who took my order over the phone was very friendly and greeted me when I picked up my order. Also, I requested a little spice on my avocado toast and it was supberb!! You must check out this charming coffee shop with a beautiful lake view in the heart of Scottsdale",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YuXqMH8wGgzY4C-eojIyrA",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Hungarian Chimney Cakes OH MY!!! The owner Issac warmed it in the oven for the ultimate experience!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YuXqMH8wGgzY4C-eojIyrA/o.jpg"
      }
    ],
    "user_id": "_JkWhBrqmJN70sj0LfXZow"
  },
  "dr4doshX4nlQtvqRhQvm2w": {
    "date": "9/1/2018",
    "text": "This place has become my office away from home.  The outdoor patio is relaxing to say the least and dog friendly.  My 10 year old English Bulldog loves it and they have free dog treats.  My only complaint about the  outdoor patio is that is that there are no outlets.   The inside is quaint with beautiful artwork and plenty of seating space.  They have a coffee roaster and on a typical day you can watch them roast the beans.   I have tried several of their beans and have been impressed but make no mistake, this is no Peixoto.   The staff is awesome.  Always smiling and friendly and the music they choose to play is dope.   Prolly my favorite roin Scottsdale.     UPDATE:  9/1/2018 Ownership changed and so has quality.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nh4vG-Se-6_MimJ_8A9jmA"
  },
  "NxmqAEbkvQAjeX3yhXaZzQ": {
    "date": "7/25/2018",
    "text": "Beautiful patio- also has some misters. Coffee and baked goods delicious. WiFi great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Gbh5yvOsIqr5XeBsakGTJw",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Gbh5yvOsIqr5XeBsakGTJw/o.jpg"
      }
    ],
    "user_id": "rkQebc9j4GBu2fXnqefFkw"
  },
  "5eiE7phAElnJ7aDEmigw9A": {
    "date": "7/4/2018",
    "text": "We just happened upon this place on this the 4th day of July 2018 and I'm glad we did. The coffee wasn't just pretty good it was pretty and good (see the picture). In today's day and age an independent coffee shop is somewhat of a novelty and I was too embarrassed to order a vanilla latte so I skipped the vanilla and just got a straight latte. I also enjoyed a Tartine with butter and Jam that was excellent. I sat and sipped my Latte licking the foam from my hipster beard (more mountain man than hipster) and listened to the Jazz playing thinking coffee shops don't play jazz anymore and that it was nice for a change. A few minutes later the same top 40 hits started playing but for the 5 minutes prior it was perfect and after it was still very good. If you are ever in the neighborhood check this place out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "V8a2ErhhpDWeKMV4ytWS1A",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/V8a2ErhhpDWeKMV4ytWS1A/o.jpg"
      },
      {
        "img_id": "d5qVpeAnWA96RTFGqxnsQg",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/d5qVpeAnWA96RTFGqxnsQg/o.jpg"
      },
      {
        "img_id": "DdSzHTSzaPDsLJFyEBIesg",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DdSzHTSzaPDsLJFyEBIesg/o.jpg"
      }
    ],
    "user_id": "EM1WbHjeYvo1522Cks23iw"
  },
  "n9V7EGokYYHpMpbk72jKEg": {
    "date": "7/24/2018",
    "text": "The best food and coffee in town! I'm there almost every day for having my coffee and also the service is amazing . They make a renovation and this place looks awesome!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ueaQ5FdFIeC6P-izqwAhtQ",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ueaQ5FdFIeC6P-izqwAhtQ/o.jpg"
      },
      {
        "img_id": "Visz3XtQkd7x4imUAT7y1Q",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Visz3XtQkd7x4imUAT7y1Q/o.jpg"
      }
    ],
    "user_id": "lcl0ZlpmdOu_2tuBz9tinQ"
  },
  "BRZsg3luQ2Z1e9up_lqdAw": {
    "date": "8/27/2018",
    "text": "The place is much improved since we were there a few years ago - the whole atmosphere seems better - we decided to give it a try again and went in and had coffee and a snack - we saw friends there that we know  We felt the barista was very friendly and the place seemed fresher and cleaner and of course the name is changed so we don't know if that means new management or new owners but we will definitely be back  We are happy about the situation because it's in route to places we go and things we do",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eES5jdZxHV55e7X1RZuGdQ"
  },
  "DA8SM3bnJGW_Xu2oxqpZwg": {
    "date": "1/5/2018",
    "text": "Lakeview knows how to do it right! I love the ambience and delicious beverages and food. I come here often with my mom on our bike rides. We enjoy the avocado toast and delicious vanilla lattes. I highly suggest adding balsamic glaze to your avo toast. You won't regret it! We love the location and the phenomenal patio, great for Arizona weather. I can't wait to come back :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aAci3BPnxiVyRKiklKbg0Q",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aAci3BPnxiVyRKiklKbg0Q/o.jpg"
      }
    ],
    "user_id": "fqSp8HsQFzo7Z9Gn8nqddA"
  },
  "SYxWaT7Lky-yPe0bgl20iQ": {
    "date": "8/19/2018",
    "text": "Beautiful and quiet place on a nice lake. The coffee is very good and fresh and the food is great, like the avocado and egg they have on a bread is recommended. Pastries looks tasty as well. Customer service is good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TQGqLIlND0eGVmP5a8XRWQ"
  },
  "Ab8jK-BV1kxrDyHk3Trxeg": {
    "date": "6/1/2019",
    "text": "AVOID  Why? RUDE people who have no idea about customer service. LOUD so-called music that you can't talk over, so why sit at a coffee shop? Limited menu offering no options unless you like carbs and gluten. Just so-so coffee. Unacceptable parking. No reason to go here. There's MUCH better places neaby.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h0GRtwnEQP4mr0KbtnPR2A"
  },
  "Kk9kQWoenRL6NkNz0KSHDQ": {
    "date": "8/18/2018",
    "text": "Great coffee, friendly staff. Lox was  very fresh and tasty. Plus the Saturday love music really give it a vacation chill vibe.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xrZBn_O6wUxqvYFfP3w7YQ",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xrZBn_O6wUxqvYFfP3w7YQ/o.jpg"
      },
      {
        "img_id": "_b9IWUVEwTJoA8XWQmOVWA",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_b9IWUVEwTJoA8XWQmOVWA/o.jpg"
      }
    ],
    "user_id": "Kz6pfBuIs9Sysrr6TQb2LQ"
  },
  "iTVnilbeR265GCw7qeaC1A": {
    "date": "6/11/2018",
    "text": "Three stars for the nice lake view and nice staffs. The coffee is okay, only few selections of desserts are available and taste ok. Their name is not Lakeview Coffee by the way lol",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7JrezcU7OfTDEKiNeLOr0Q"
  },
  "SkXFnp1Bq_3rqbKL7m-RwQ": {
    "date": "9/1/2016",
    "text": "Went in with high expectations (pun intended) - lost altitude, though.  Ordered a V60 pourover, and asked for the brightest coffee they had.  They pulled some of the Kenyan coffee they use for their espresso to make the V60.  It really wasn't that bright (bright finish, but immediate taste was dark).  Not my cup of tea...err...coffee.  Nice people, cool place, but not where I want to get my next pourover...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "7O1HRYcM3GVn24bpnB0o7Q",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7O1HRYcM3GVn24bpnB0o7Q/o.jpg"
      }
    ],
    "user_id": "Olo_x4fV1sFBtlj6COf9Wg"
  },
  "I7QU9q1cOxbddHf5-s_KvA": {
    "date": "11/7/2016",
    "text": "I don't get out of town much, but when I do I want to try as many local coffee shops as possible. This gem located on a quiet suburban Scottsdale road was just what I needed to finish up my recent trip to the Phoenix metro area. Everything about Altitude spelled success - sharp employees, outstanding coffee (latte and black drip), and great food (both pastry and kitchen made).   Great patio area off the main door and lots of items to choose from inside. While we were there, an employee was packing up coffee to ship - I'll definitely be purchasing some blends to make at home.   Overall, an outstanding experience with everything I was looking for in a \"off the beaten path\" non-touristy coffee location.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "iVfSUwjhM70oBtQeFwQcDw",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iVfSUwjhM70oBtQeFwQcDw/o.jpg"
      }
    ],
    "user_id": "nx3gtrrFfe_EUuOiGK7y5A"
  },
  "vk21UX3Q3F9c9_K4E1hY5A": {
    "date": "9/21/2014",
    "text": "I've been coming here for awhile, and wanted to wait before writing a review, but here it is.  (Note:  I am a health freak, Gluten free, dairy free, carb restricted, so not much common food lives up to my expectations or needs):  * Ambiance (mellow, chill, nice, lake view) -  5 Stars  * Music (they have live music, and normal music is not too loud and a mix).  I'm pretty mellow and like to work or read or talk so it's good.  - 5 Stars  * Service - 4.5 Stars most people are pretty good esp. when you know them.  * Tea - - they say they are local and I looked her up she is locally located, but teas are not made locally ever.  Some are organic and I don't like plastic casing.  They also don't give enough - cups are good for coffee but not much tea e.g 2 oz per say 6 oz of water.  There are also temperatures of water for each type of tea (then I'm a tea nut).  So many are doing better tea - coffee plantation has yogi teas and will put two in a bigger cup, cartel has tucson organic loose leaf teas.  it's really weak, unflavorful (iced green is actually good, it's different tea) and the in-house mugs are too shallow/small to get a good amount. It's also the most expensive in the area $3.15 vs. $2.15 - cartel exception, but they have good product!  They started using Mcclendons honey and produce, but I guess it was too expensive for them so now they use a processed honey -  1/2 Star  * Coffee - I hear mixed things - i don't drink it, but it is their main deal - I give it a 4 stars as I've had the decaf with and they have Almond milk.  * Food - If I could or wanted to eat the normal SAD (standard american diet) food I'd give it a 4, but I can't, so I don't .  I'd really like to see people change what is being served everywhere e.g., flour products, bacon and eggs, salad... (there really is a whole huge world out there other than those things). Not very flexible with taking out adding items.  - - 1/2 Star",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "8DqvPOsZPbbQh9BRWb4Ghw"
  },
  "x5UV2kS4h5FCCHbGJ2ih-A": {
    "date": "1/24/2015",
    "text": "This place has REALLY great coffee. Their macchiato is served traditionally as is so smooth. The location is nice; great for dogs to hang out on the patio and read while you drink your coffee. Their food is great quality but a little overpriced and small portions... will definitely be back for the coffee though!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jse2G11QnoCtJ5_BJjYuzQ"
  },
  "ss_s9oix-aIq_RYftKOt0Q": {
    "date": "5/28/2015",
    "text": "Great spot to people watch but honestyl the ice coffee was amazing.. nicely roasted and the bean already had a hint of sweetness that I didnt even need sugar, Just a little creamy. I also got the smoke salmon bagel and that was really good too and just gave me a great start to my morning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hIlQOXn094Q205B_vu7Sjw"
  },
  "LJazrXyv5k9JRVnuBJnf5g": {
    "date": "8/30/2016",
    "text": "Cool atmosphere and comfy seating. Coffee is decent but everything is overpriced. $10 for an Americano and a plain bagel with cream cheese.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RbMf7dUHV-wuENX8tanQzw"
  },
  "xRkgbSoUpE8OvYsp4k-Zzw": {
    "date": "2/26/2015",
    "text": "Let me start by saying that a large part of my dissatisfaction with Altitude Coffee Lab is that their website has obviously not been updated in a while. Now I'm not particularly concerned with the quality of a company's website; however, I came to Altitude over my usual haunt (The Coffee Bean) because their website said they were open until 9 pm, and I always find myself rushing to wrap up whatever assignment I'm working on when The Coffee Bean closes at 8 pm. Welp, it turns out that Altitude actually closes at 6 pm. Had I known this, I would not have gone there to study. Also, there were menu items listed on the website that were no longer on the menu, which was disappointing. Continuing on, the iced mocha I ordered was actually pretty tasty. Drink-wise, I have no complaints. However, the $8 caprese salad I ordered came with three tomato slices...but only two slices of mozzarella. Maybe I'm overreacting, but I thought the point of a caprese salad was to have a taste of tomato and mozzarella in every bite. If I wanted to eat a tomato slice drizzled in balsamic vinegar, I would have done so at home. That extra tomato slice did not give the illusion that it was worth $8, why not just pony up the third slice of mozzarella? As for the atmosphere, Altitude definitely has the whole \"independent coffee shop\" vibe nailed. There are a lot of little tables for people who need to get some work done as well as one very large table for study groups. The patio outside is GORGEOUS, I will admit, and the owner obviously invested in nice patio furniture. There was also a lot of bad art hanging on the walls, an important coffee house staple that people, for one reason or another, seem to go absolutely nuts for. My one big complaint with the atmosphere is that it's pretty dimly lit inside. I can't really hold this against the place though, because there is nothing innately wrong with dim-lighting-it's just not practical for studying.  What I can hold against this place, though, is the super snobby barista behind the counter. Look, I realize that you'd rather be doing other things, but those other things probably aren't paying your bills, and that's why you're here working, Mr. Too-Cool-For-School. It's not like the place was busy or anything, yet this guy seemed bothered to answer my questions. It's not like I asked a ton of them either; maybe like, three. This was especially troublesome considering he was A LOT nicer to the more attractive women. I expect that type of nonsense at bars in Old Town, but not in a coffee shop.  On the other hand, there was another gentleman there, I'm guessing he was a manager of some sort, who was on his Customer Service A-Game. He had a smile on the entire time and went out of his way to be accommodating, not just with me, but with every single customer. Honestly, had this charming chap not been present, I absolutely would have given Altitude a 2-star rating without hesitation. Also, they have wine and beer available, so that's a plus in my book.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dSWJYuyqJXL6Bw8roBsUJw"
  },
  "5cGCANmUJ6zdp3bxwFRMIQ": {
    "date": "11/23/2015",
    "text": "Great coffee, delicious pastries and really nice people. Sounds like a perfect combination to me.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ex3HZL5sqKb17eiP1bVbWg"
  },
  "J-IjvL0oGwDdaFKz86BPmw": {
    "date": "9/27/2015",
    "text": "Great little coffee shop, friendly and located in a great area overlooking McCormick lake. If you're looking for a small locally owned great coffee shop, look no further.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u9iLVgWBcDE-gtDTJaQeiw"
  },
  "zK85Uq93Ks6FhahQN2nbVA": {
    "date": "2/17/2015",
    "text": "Fantastic coffee and the owners aren't too bad either. But honestly a stop worth making if you're in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nvbWabk8bfjJ6j6XGW8mEw"
  },
  "TJesQBa0amYe6l2L2JdYDw": {
    "date": "10/2/2014",
    "text": "Amazing coffee! Breakfast was good too, but can use more verities.  Owner is a sweet guy, and staff is just perfect coffee people :) I will be back for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZWGCV58pupE0ZRTZYbvTYg"
  },
  "5rsb6iS8j9y4gGNa1mRcjg": {
    "date": "3/27/2014",
    "text": "Perfect spot on the lake.  Lovely relaxing patio.  Nice owner and staff.  Hipster vibe, not another boring coffee shop.  Plus they sport soy AND coconut milk alternatives.  Elevate your coffee experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "YWqgaqWNWLQXPzGR5c5j1w"
  },
  "GI-omcKtiC1FpCTqVyoR-Q": {
    "date": "8/25/2014",
    "text": "Awesome coffee, freshly roasted. Great food selection as well and an amazing space to relax in.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qTBvRzSQta8OpgqGyk13mg"
  },
  "NRFL4O3KFDwiom7rwgDqyw": {
    "date": "3/1/2015",
    "text": "This is officially the greatest coffee place I have ever visited in my life. The vegan, gluten-free snickerdoodles are to die for, and I highly recommend the frozen mocha if you enjoy sweet drinks. Plus, love the outdoor view!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e4fzoWQKkzLNDiXeLZgIDQ"
  },
  "dNJRNyxOJubgV4RlTdkZKg": {
    "date": "7/12/2015",
    "text": "The coffee is decent. We used to come here regularly. Then all of a sudden, it changed to closing at 3pm. Who does that?!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_VfNvQQWOnoafilv6edsKA"
  },
  "mxmzINNMNY6HUh7NRanUlA": {
    "date": "4/26/2015",
    "text": "I've come to altitude a few times now. A friend and I get breakfast here about once a month! Such a great place to get together with friends! Coffee is amazing. I always get an iced white mocha, it's phenomenal. This morning we got the egg white breakfast burrito, which was on point. The views are spectacular. That is the main reason I come here. The staff is nice. Lots of people with dogs. It gets kind of busy on Sunday mornings. Menu is a little pricey for a coffee shop, but understandable considering its location in Scottsdale. I would definitely recommend this place for people meeting for coffee or if you are looking to get some work or studying done.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T6i2SZ8h9X_y6miBu-MiOg"
  },
  "uMPlAXjTnoNrZEPAc3jfBQ": {
    "date": "7/3/2015",
    "text": "Very good.Fresh, amazing service.I had the mocha latte with a shot a vanilla my daughter had a cranberry hibiscus tea.Both very yummy.Staff was very professional eager and happy to give recommends.The price was moderate no \" fancy price \" for coffee.we will be back .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xy4-gRbmKPlKVetyVG1mkQ"
  },
  "IRhOtf0vbre8CnYN9riA2Q": {
    "date": "4/19/2015",
    "text": "Fresh OJ, nice outdoor patio, dog friendly, and a gluten free blueberry muffin that is insane! Oh and they have good coffee. They lose a star only because of their lack of good almond milk. We will definitely be regulars when we visit Scottsdale.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Efwob65qgiu_YFVzO4kjTw"
  },
  "NW8Iyi6uR8mOzHJJKhzz2g": {
    "date": "2/3/2015",
    "text": "They have the best coffee and the best service! I go at least once a week, and my visits just keep getting better and better! The people are so friendly and they have such a nice patio where you can bring your dog! I highly recommend this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x8o0oDpEjnYhLtZHhou7pw"
  },
  "uTTpPptKceyVdYIzAZaVXw": {
    "date": "9/3/2015",
    "text": "They really know coffee here. They roast on site as the first evidence of attention to detail. Any drink that you order is given the attention as if it was the only drink that would be made all day. It is impressive. The views are great. In cooler months I hope to enjoy the patio.   It is the sort of place that you expect to bump into Juan Valdez.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3cKi8BNKJT1OsWYMY4EivQ"
  },
  "gnWQk_UinIASleWhJurSBw": {
    "date": "6/1/2014",
    "text": "Much smaller place than I expected. Nevertheless, my cappuccino was right on! And the service was very friendly with smiles. We didn't try the food today and sadly there was no maple bacon muffin.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EmWM0sdx0-RKN78RNetx2A"
  },
  "snNA4QXteNXuzWHRziExzg": {
    "date": "4/4/2015",
    "text": "Okay, so last time I came my experience was not the greatest! Well I talked about how fantastic their chai was though and I just wanted to try it again. I came to get my fantastic chai and the two girls that were working today were awesome!! This experience was completely different than the one I had last time and I'm very happy about that since I'll be now coming back more often!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5lMbIxjftFGJLnUb9RxvGg"
  },
  "Q6OgJRBXEyXKh7_bnnXyjg": {
    "date": "9/20/2019",
    "text": "Has been several months since my last time here during a Trek ride. Not it today however. Accidentally driving by and is open, so just came out with my favorite 6 shot Americano and honey. And I see they also have some wonderful food options here I'll want to try...another time however. Great staff and very nice seating outside and in both.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZRnsUs9q6DbeJbOLjCY4ZA"
  },
  "2mvjtye-saTn2eaJVXOuMw": {
    "date": "5/1/2019",
    "text": "Came here for breakfast with a friend and it was a beautiful day to sit on the patio! We both ordered coffee and 2 different kinds of breakfast toast.   I ordered mascarpone and walnut toast that was drizzled with honey and it was delicious! It was a decent sized slice served with an orange garnish. It was simple but well done and I'd definitely enjoy ordering it again!  My friend had the avocado toast. It looked great, the avocados were nice and ripe, it was just a little bit bland being just avocado, it could have used a little more seasoning, but was fresh and good!  We would definitely return for walnut toast, the service was good as well!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "CDN1Et67EgyygXtuBqFeWQ",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Walnut breakfast toast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CDN1Et67EgyygXtuBqFeWQ/o.jpg"
      }
    ],
    "user_id": "5CpLP6c3RQT4w9CyI-Burw"
  },
  "Xe43WEjEJcn-vvu-nEwu1w": {
    "date": "7/21/2019",
    "text": "Cute little coffee shop tucked away in a shopping center near Butters. We came here on a Saturday morning and was able to get a seat outside. I enjoyed a cup of iced latte and a toast with butter/jam. This coffee shop is located right next to a lake (hence the name) so I advise you go for a little walk after.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "cJ6gxRkKxNgW5EEu4oUHdw",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cJ6gxRkKxNgW5EEu4oUHdw/o.jpg"
      },
      {
        "img_id": "sIM79NALPo0jyAUDpx7sNw",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Scones",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sIM79NALPo0jyAUDpx7sNw/o.jpg"
      },
      {
        "img_id": "o7gdsPbxudpouV0YLD-47Q",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Scones and iced Latte",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/o7gdsPbxudpouV0YLD-47Q/o.jpg"
      }
    ],
    "user_id": "aLyOQ-QfCDyIMkFRHWarMg"
  },
  "mzDTd3mVIvqveOiI7d8oxA": {
    "date": "1/25/2019",
    "text": "Located next to a lake where many folks were out walking their dogs or riding bikes. The patio is perfect spot to take a break with your fur babies for coffee and delicious breakfast.   We tried their breakfast burrito. It was nicely toasted and served with yummy salsa. Perfect portion size too. Highly recommend!  They also had many tartines (French word for toast with toppings). We chose their original and it was the bomb! If youre hungry, you could probably eat two orders of these.   The French press took a while to make for them but hubby enjoyed it very much. Their latte was delicious as well. They do have soy, almond and coconut milk options. Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 16,
      "useful": 31,
      "cool": 28
    },
    "photos": [
      {
        "img_id": "YBtBvUn6TZ7KNteX8mdEJA",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Breakfast burrito",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YBtBvUn6TZ7KNteX8mdEJA/o.jpg"
      },
      {
        "img_id": "IloQaIhC2lmrmEqSuC4dwg",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Original tartine",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IloQaIhC2lmrmEqSuC4dwg/o.jpg"
      },
      {
        "img_id": "HXENyCGT2Cv6WECbXGL1Zw",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Coconut milk latte",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HXENyCGT2Cv6WECbXGL1Zw/o.jpg"
      }
    ],
    "user_id": "zlFj4sJmPwzS1WdEB0FnFQ"
  },
  "To0p8mUXFrl-CWTSxz6T5w": {
    "date": "1/25/2019",
    "text": "This is a great little coffee stop. I really dig in the view of the lake as the name states. Fresh ground rich coffee with a wide selection of bakery and treats.  The environment is warm and cozy and lends to a great place to wind up your morning, pull out that laptop or tablet and drive into the days work load   They are located in a very upscale area. No need to pack your heat or bring your posse. Lol. Very relaxing in nature. In warmer months it is fun to truly enjoy the tranquility the emminates from the water.  The run drink specials and the staff here know their stuff. It has a little of that rustic cafe feel.   They are not far from the Salt River Fields. If you are grabbing an early game pop on in and enjoy some treats... I have been here several times and quite relish the minutes invested.  #irishcatv2 #vino2 #vino2ultimate #vinosquared #twylytephotography",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zWtxMoM09S1Y4KR2ivvBKg",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Great view here! Good staff and brew!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zWtxMoM09S1Y4KR2ivvBKg/o.jpg"
      },
      {
        "img_id": "VoDmDhldTrz6-cjn7T8IfQ",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Great.patio and location. Super place to chill out.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VoDmDhldTrz6-cjn7T8IfQ/o.jpg"
      }
    ],
    "user_id": "TSThCn9RaHqYF1VknVTTRQ"
  },
  "gkuedlDEa6vQEf_oyjyDBw": {
    "date": "7/12/2019",
    "text": "What a lovely coffee shop! Located on the West side of Hayden Road in North Scottsdale. I think the name says it all. First thing you notice is the beautiful view on the small lake, perfect to enjoy a drink. I had a shot of espresso with cold milk on the side. No plus charge for the milk and the espresso was delicious! They use a Guatemalan and Ethiopian roast that will blow your mind. Service is also courteous. Prices are fair considering the prime location. Highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "HJfuzbFTwREQJ13sUUzHWA"
  },
  "lb4B2i0cIpNFgQAMdsCzgw": {
    "date": "9/29/2018",
    "text": "They used to be altitude coffee lab but they just recently changed the name.   Good little coffee shop on the corner.   I got a small iced latte with caramel & organic vanilla (they didn't have white chocolate mocha). It tasted good maybe could have used a little more flavoring but it was good. Not to sweet & not to bitter.   They do have a patio outside as well.  Also you can order some coffee thru UberEats",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "e5TrCpc6Hpt_BR-x_IBIZg",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/e5TrCpc6Hpt_BR-x_IBIZg/o.jpg"
      },
      {
        "img_id": "ynwVvrbdzvi_X85Ll9ffrA",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ynwVvrbdzvi_X85Ll9ffrA/o.jpg"
      },
      {
        "img_id": "udmk2T11T5AwB9FK_20YHw",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Inside",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/udmk2T11T5AwB9FK_20YHw/o.jpg"
      }
    ],
    "user_id": "7C4B2Skmh4X9f8xJDo9O4w"
  },
  "-9wcHAJkbmmKEv5lRpaRLg": {
    "date": "4/16/2019",
    "text": "We ordered a vanilla latte and a traditional macchiato . Great service. My husband wasn't too impressed with his macchiato,thought the Cartel coffee place was way better. My latte was good. It was nice sitting outside,amble seating!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dc18czOzT4Ym715LpPs05Q"
  },
  "0CGRlH8jeTxQfoNDjd6LJw": {
    "date": "4/3/2019",
    "text": "One of my fave places for coffee! And they have a really good chai latte. Plus, they have a liquor license to add bourbon into that chai ;)  Great dog friendly patio overlooking a neighborhood lake - so Peaceful",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "J237RaoLNGlznbzyWz_r-A"
  },
  "VnGo66c_eqOz-viLGLt6Kg": {
    "date": "5/25/2019",
    "text": "Boss had locked the office key in her office. We ended up sitting in bldg lobby for an hour, and I decided to make a breakfast run as we wait. Boss gave me money to buy if I fly. Found Lakeview On Yelp nearby, and decided to go there. Ordered 5 breakfast sandwiches for $5ea, but they were out of the sandwich bread, so was offered breakfast burrito $9ea, plus 5 small coffees (3 Caramel macchiato and 2 Americanos) came out to $71. Our company just moved in the area. This place is real cool. Great view of lake from outside patio, cool art hanging on walls. Dogs are allowed on back patio but not inside.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "rsYuC2QxNklhkHLdoNw4dQ",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Great view from patio",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rsYuC2QxNklhkHLdoNw4dQ/o.jpg"
      },
      {
        "img_id": "uXbFBGHCtp2ykTBIkQUZzQ",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Pet friendly patio, not indoors!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uXbFBGHCtp2ykTBIkQUZzQ/o.jpg"
      }
    ],
    "user_id": "-kXUKwcLhc88UZInn6cEnQ"
  },
  "H-Ttl6td5Ib7haKlxsfhxA": {
    "date": "8/3/2019",
    "text": "If only the customer service matched the quality of the coffee! First time in, was asking about all the different types of flavors and coffee they can do (I was the only customer in line so I thought I would be able to take a minute to ask), didn't expect to be teased by the workers for asking. Thanks for that, 100% won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cdN4cCp77_XZxsxURxtnxQ"
  },
  "v_P1tievw_lLDClL9FyhMA": {
    "date": "3/3/2019",
    "text": "What a cute little place tucked away in a cute plaza in Scottsdale.. The barista was charming and so very helpful.  I was # 3  to place at my table , and he's like that's because I'm working on you #1. I had an oat vanilla latte with there breakfast sandwich.. so delicious although I wish it was real bacon and not turkey bacon but either way ! Yummy!!!! Will definitely come back!!!!   Keep Rocking it guys:-)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Va6c7FjA5Eb_9iFbgZ3-oA",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Va6c7FjA5Eb_9iFbgZ3-oA/o.jpg"
      }
    ],
    "user_id": "2dkyMxi9Zn6xXrzK5nYQxg"
  },
  "lAENg-8UwHHhbyqQrTtxBw": {
    "date": "4/12/2019",
    "text": "Stopped by in this quaint little spot for some coffee located next to chipotle and Butter's restaurant. Had to circle around a little to find it here and glad I did!! There is a lot of seating outside and a nice amount of seating inside! There is even a Beckwith piano in the back by the restroom to play...well not sure for show or really for play...anyways got the hot vanilla latte and is really good! The cold regular latte is also really good!! Great spot to chat with others and hang out in a pretty quiet coffee house with lots of seating available!!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 4
    },
    "photos": [],
    "user_id": "nwPIsasc3LaCyeottksMtA"
  },
  "c_BEnc6oRYbiF5ezVe1gpQ": {
    "date": "5/6/2018",
    "text": "Altitude is one of my favorite places to get my coffee fix! This cute little neighborhood spot boasts a variety of coffee drinks, light bites, and pastries.   My food pick is always the avocado, egg and balsamic toast. Paired with a large iced latte, there's no better way to start your morning!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "iwS1uHzlZ6MUvIw8lRJq8Q",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iwS1uHzlZ6MUvIw8lRJq8Q/o.jpg"
      }
    ],
    "user_id": "KaYukl9swlpo71HupJrUWw"
  },
  "Wt69aLPvMzNL1Qs9dqdQew": {
    "date": "8/29/2019",
    "text": "Avery always hooks it up with Good coffee. Lakeview Coffee is the closest I've found to Seattle style coffee.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UP2xGAtI66-jHXUAp91o1w"
  },
  "86PvdRAThWV-_thDNOSkZw": {
    "date": "12/6/2017",
    "text": "Workers seem like they just rolled out of bed lol  BADASS PIANO :D  Trying to figure out my 7am order was met with some curt words from the workers there, maybe they didn't have their morning coffee yet, I was also the only one there..  Seats with view of the pond are nice   Avocado toast was more toast than avocado, and they put wayyy too much salt on it, defn overpriced too  My drip coffee was decent; come to Altitude if you need a quick pick-me-up",
    "rating": 3,
    "rated": {
      "funny": 8,
      "useful": 15,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "5pWimVN_QmC5T6uLM2Og_g",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5pWimVN_QmC5T6uLM2Og_g/o.jpg"
      },
      {
        "img_id": "wLT9mSDZarm1_B47wTHHQQ",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wLT9mSDZarm1_B47wTHHQQ/o.jpg"
      },
      {
        "img_id": "PQr4RiaiBRIK-KRZHViPNw",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PQr4RiaiBRIK-KRZHViPNw/o.jpg"
      }
    ],
    "user_id": "kzDzdbPupHiglDzs9HD0vA"
  },
  "iaeNSItn7H-loVwQNs8WbQ": {
    "date": "2/26/2019",
    "text": "Tried the Ethiopian blend espresso in my mocha and gluten-free cherry bake well( coffee cake )which was out of this world. Visiting from Washington and this was our one and only coffee stop, it's definitely a must visit",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ux28gdRu1SR6qQ0DwXOV5A",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. My forever coffee date",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ux28gdRu1SR6qQ0DwXOV5A/o.jpg"
      },
      {
        "img_id": "1H2wTjeN6fqbpENrmvtxCw",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. View from the patio",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1H2wTjeN6fqbpENrmvtxCw/o.jpg"
      },
      {
        "img_id": "P9hyG8bqmNvLrtAnoIcIbQ",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Cherry bake well pastry",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/P9hyG8bqmNvLrtAnoIcIbQ/o.jpg"
      }
    ],
    "user_id": "cNfnmBYnfgKY8Dqf0OmRPQ"
  },
  "nLxMpafVE-vVz0JcBjp_hA": {
    "date": "11/5/2017",
    "text": "Great tasting coffee--just the right amount of bite with milk for a latte.   Yes, there is an incredible patio here, but wait...  Reasons to stay inside #1--drinking a hot beverage when it is still a tad hot outside is best enjoyed inside--at least it was for me. There was plenty of seating inside too.  Reasons to stay inside #2--The coffee barista/owner/? was busy with the roasting machine. This was definitely fun to watch while inside!  Reason to stay inside #3--The pastry cabinet keeps screaming your name! Another reason to stay inside. Short walk to grab a yummy treat.  Reason to stay inside #4--enjoying the artwork! When I was here, the art on the walls was from a Portland based person or inspired by Portland downtown scene. Cool to view.  Reason to stay inside #5--you get to listen to the baristas happily greet customers! Baristas were efficient and nice, greeting us upon entering.  The patio is definitely an option, but the inside can be just as great, too!",
    "rating": 5,
    "rated": {
      "funny": 19,
      "useful": 34,
      "cool": 33
    },
    "photos": [
      {
        "img_id": "XSUIwW8iWq9TO8SA0mc5nw",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. I know this business doesn&amp;#39;t really need another photo like this, but look how cute that art is!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XSUIwW8iWq9TO8SA0mc5nw/o.jpg"
      },
      {
        "img_id": "DaiIM7qmul0ou_u5n_7POQ",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Some awesome pastries plus the cool dude working the beans.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DaiIM7qmul0ou_u5n_7POQ/o.jpg"
      }
    ],
    "user_id": "Q6iiwjxWCfesMNz2sJYHZw"
  },
  "AKy7ueJQtCvbVc6p0i1VKg": {
    "date": "11/4/2017",
    "text": "This place is so neat. I met a friend here for coffee and it took me some time to find it as I was in the shopping center south of here. There is a small fountain and lake next to this shop and it creates a serene and laid back environment.  I ordered an iced latte with almond milk and caramel syrup and it was enjoyable, lots of caffeine of course but I drank it slow. I loved their outdoor patio, the weather was perfect and the seating comfortable. They do have food items but I didn't try any this time, maybe during my next visit.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 13,
      "cool": 12
    },
    "photos": [
      {
        "img_id": "gYNTnjRBHvQ01Dif0YwK0A",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gYNTnjRBHvQ01Dif0YwK0A/o.jpg"
      }
    ],
    "user_id": "4cZ3f3i0Slv2W9mLN_VZBw"
  },
  "B7HpADZuVPrmK5m2a8uZvA": {
    "date": "11/4/2017",
    "text": "Really really dig this space to study in or just read/write! The outdoor patio is just lovely, especially when Arizona isn't scorching hot! There's a nice lake, some pleasant bougainvillea bushes, bikers and families enjoying the outdoors, and if you're lucky - some pups! It really is a location that feels like it fosters community.   On top of that, the coffee is great! If you're a versed coffee addict (which I'm not...), I think you'd be pleased with the selection of whole beans. If you're into the sweet and flavored lattes (which I'm also not entirely....), I think you'd be pleased with the options which aren't overwhelming. If you're in the middle (which I am), you've got your choices!  Also, if you play piano (which I do), you'll be pleased to see a very cute upright piano in this fun spot!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "Nw2IjZphx5PG3IT9DrUNdA",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Nw2IjZphx5PG3IT9DrUNdA/o.jpg"
      }
    ],
    "user_id": "OuNHzBUaatejTsuhjMtnqg"
  },
  "aolm53GeSCBnzeC-sitsHw": {
    "date": "12/11/2013",
    "text": "I'm not a huge aficionado of coffee shops but I did enjoy Altitude.  Small and independently owned, they make a nice cup of Joe.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S9Jw00eZHVj5_0sOM_C5Rg"
  },
  "O8wFwsGWhFg9F0M9ufRYXQ": {
    "date": "4/17/2017",
    "text": "Great place to grab some cold brew and stroll by the lake.   Their patio is usually very shady, nice to relax outside and slow down.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VOOATaXHsLWzIIiG-m1yWw"
  },
  "vw8uOAv9MFpMh_FWRFW5Yg": {
    "date": "12/27/2015",
    "text": "Awesome tea/ coffee/ pastries and what a gorgeous location. My dog loves sitting outside when I get my London Fog tea and a pastry and we love sitting by the pond with the ducks while we take a walk and admire Arizona sky:)) lovely cafe",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xBxmaLiSLXN68Gqj_zdjkQ"
  },
  "_9cn_fl9yDl7n_7E3JKvkQ": {
    "date": "8/2/2015",
    "text": "Lovely Coffee joint. Great Staff and patio seating:)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "n42Pj5Avd4bEPjzeZaNEMg"
  },
  "A_R5Knap1iRrIExOMN_RxQ": {
    "date": "9/30/2013",
    "text": "Excellent. Everything, Excellent .  Right off the greenbelt, quiet enough for meetings but not stuffy.   Great food, great coffee.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nkYN18Hho3s4m5XsRPqnBQ"
  },
  "_3OZa3offR6rxrW-Fi8gig": {
    "date": "9/2/2015",
    "text": "Nice folks, great coffee with a good location.   Skip the one a block next to butters  Much  better coffee!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "C2EThwvYMK1eHS1UsoPRAA"
  },
  "mzqvjtm4CIKm2tvNb1RLbw": {
    "date": "7/11/2014",
    "text": "Best coffee!!! Also, when you're enjoying your coffee there, they actually use a real coffee mug. So enjoyable!   The patio view is great. Staff is always friendly, patient and helpful!  I've referred out of town visitors and friends to Altitude and they've all responded with a resounding -Thank You! Starbucks has it's place. But who doesn't love a charming one-of-a-kind coffeehouse with killer coffee and ambiance!? A+++",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3XBmPXwYNL3Go9okoddQJg"
  },
  "JKdHd2o2ddHIIPqFYOUyZg": {
    "date": "12/29/2016",
    "text": "Really enjoying coming here. The food menu has changed recently and everything is now made inhouse. They have Noble bread options as wells a bunch of other stuff. Coffee great as usual.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hgjkcUD5HKbplTZURiipMQ"
  },
  "7D6P6oRBakthyk_p_FNplQ": {
    "date": "3/23/2015",
    "text": "This is about their Kurtoskalac. Skeptical, since I went to Hungary a few years ago and enjoy authenticity in a pastry, I was extremely disappointed in the hardness of these. In Budapest they do not coat it with anything. This had a very hard, almost caramel-like coating to it, which was a surprise to my family and I. We came to the coffee lab specifically to taste these. Nothing like the homeland unfortunately. Please consider revising the recipe, or at least offer both types (hard and not hard). The price was a bit steep for the quality.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-o0I7l3fdoRULj7kn8KMLw"
  },
  "Di5lvQUrX7dUSrO-dYAUyQ": {
    "date": "5/26/2014",
    "text": "This is the best coffee shop in Scottsdale hands down. it's perfectly located in the McCormick Ranch area on Hayden. It has a great atmosphere, incredible food and a friendly staff. Not a corpo cookie cutter chain... Love this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JHKnoLXwzoQE4iy6sHylkg",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JHKnoLXwzoQE4iy6sHylkg/o.jpg"
      },
      {
        "img_id": "mzydLTs6K3wkVvagN6tLrg",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mzydLTs6K3wkVvagN6tLrg/o.jpg"
      },
      {
        "img_id": "MGoHglHr30UoSjbnAzLA4Q",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MGoHglHr30UoSjbnAzLA4Q/o.jpg"
      }
    ],
    "user_id": "wmc5qKGTVDgINEJkDXrISw"
  },
  "czicaTjYyUATRGKIirXq6w": {
    "date": "1/4/2016",
    "text": "One of my favorite neighborhood spots! Best coffee in town in my opinion. It's great for coffee on the go or if you need a chill place to sit down with your laptop or tablet to get a little work done while getting out of the office. Been coming here for over a year and get my fresh ground coffee beans so that I can make at home. Highly recommended the house blend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EUUOhIFFnCNHms1NwHIw2A"
  },
  "xmg-AjM5wSfpGEhDiJxPrg": {
    "date": "11/13/2013",
    "text": "SLOW INTERNET ... Ok Coffee If you are trying to do work in this coffee shop, don't rely on their snail speed internet.  You're faster going somewhere else or tethering your phone for internet.  They should upgrade their internet from home internet to an actual business one.  As for the beverages, I had a French Vanilla Latte recommended by the barista which was too spiced in my opinion.  The attempt of the heart with the foam was a distorted heart but still cute.  The motif in the place was cute. I like the concept and decorations.  Overall it was a decent experience if you're not in a rush to get work done.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dRC3mqdY2S9ArcSE04-kTw"
  },
  "lTqBcsIOwGn6yNa_1P5c9g": {
    "date": "3/3/2015",
    "text": "I stumbled upon this quaint and cozy coffee shop while in Scottsdale on vacation. I'm extremely picky with my coffee and always try little coffee shops wherever I visit. Luck would have it that I came in as they were roasting their coffee beans and I was invited to partake in tasting all the batches they roasted. The owners are extremely friendly and the coffee is outstanding. They also serve these sweet treats that are addictive. I wish I could remember the name! I ordered an egg white, spinach and cheese frittata that was heavenly. I had to come back the following day and order another one for breakfast. I'm not local so I can't have their coffee every day. However, I can have the next best thing: I order beans from their site and I can enjoy them every morning. Hey guys, how 'bout opening a shop in NC?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VNVwApN2u71I2JIREGsWfQ"
  },
  "XtPr82o-6asefTDff_-_mQ": {
    "date": "3/28/2015",
    "text": "I just took up the coffee habit and really enjoy sipping a cappaccino here at Altitude. The patio overlooks the lake and it's the perfect place to relax and watch life go by. One of the nicest spots in Scottsdale.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "s38SsSiuDqI8qWX1mWowYA"
  },
  "GW7Is1Rt2KR7cRdDRfkPNQ": {
    "date": "7/8/2015",
    "text": "I love this place, LOVE! Anyone in the neighborhood either because they live or work near here need to experience what my taste buds, my heart and everything in between feel when I'm here. The owners are awesome and very knowledgeable. The baristas and manager rock! The coffee is delish and has never let me down. The area is adorable by the pond with the ducks. It's clean. I mean, I'm not sure what else to say! If I could legally marry this place I would. Bessie is such a warm and friendly presence every time I come. Please support this awesome local business. You won't regret it!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nUaJUxRVOa31HgdOZv2bRw"
  },
  "NIdizZHSiXvRWmLKXt7Dsg": {
    "date": "3/14/2015",
    "text": "Unfortunately I did not get to try anything to give a review on the coffee and food. I live in the area and wanted to give it a try because they say they are pet friendly and the menu looked pretty good BUT when I got there  they would not let me bring the dog in while I ordered, I asked the if she could come outside to take my order and without pause she said no! Maybe if she was the only one working and they were busy  I  could understand but needless to say they weren't.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-rWmFxic3k9VWMqvL93HaA"
  },
  "yUmq8qvw8L0RPAGJkZKrIA": {
    "date": "12/8/2015",
    "text": "Super cute patio and awesome drinks. the only reason they dont get 5 stars is because they do not offer Italian Sodas which is what I like to order at coffee shops since I dont drink coffee. Highly recommend this place if you like coffee and tea!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yZpRNzyvzft4fzPeT0fJRg"
  },
  "wsutzcXTKjfIOdJeF-G1HA": {
    "date": "8/28/2014",
    "text": "i've only been here once but.... my iced latte was alllllllll milk... like barely any espresso.... it was not well made. the barista wasn't very friendly either, kinda odd because it was dead and... i'm a paying customer. shrug.  it's quiet, so would be a good place to read or relax, but.... eh. not my scene.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "zSwb7qNpSgU3ekHMpiHsOA"
  },
  "m-sEFWSJZ2JOWuyWvIvQEw": {
    "date": "6/17/2015",
    "text": "Delicious Toddy! My friend and I grabbed a morning snack with coffee. She had a iced latte that she enjoyed. We also split a Hungarian pastry that was pretty tasty as well! The ambiance is nice and relaxing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YDFRDj6uC2v9oThuT0MyFw"
  },
  "bJxfYXBBG_rdXCYXoVI47g": {
    "date": "8/11/2015",
    "text": "This is my favorite coffee place in Scottsdale! The staff are always friendly and the coffee and tea are very good. My favorite is their pomegranate green iced tea. Like other reviewers have mentioned, it overlooks a residential lake and green space with a fountain, so the views are gorgeous. The patio is nice, and has different seating arrangements so you can lounge by yourself or chat with friends. It's not pretentious at all either, and (usually) not too crowded. My only complaint is I wish they were open an hour later (they close at 3). Overall a great place to chill and enjoy a drink!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XQI8eUkEdugLRBz3mKPgxg"
  },
  "-u1oBj9a16zWAELx97ffbA": {
    "date": "8/20/2015",
    "text": "Love this little coffee shop. When the weather is cool their patio is a great little escape to just enjoy some coffee and relax. My favorite chai tea latte that I've had.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "40mKWnLOjW_g22I0hGRzNg",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Chai tea latte",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/40mKWnLOjW_g22I0hGRzNg/o.jpg"
      }
    ],
    "user_id": "hLv0UHsogVJP1mWKJ_l8ww"
  },
  "UYx3sn3wK2ume-ZiZSrcHQ": {
    "date": "4/24/2016",
    "text": "I an lucky enough to live basically across the street and can attest this is probably the best combination of quality coffee and caffeinated delectables, healthy food and ambiance.   The patio overlooks a big pond and bike trail with a large fountain lighting up the dusk.   I am sometimes forced to study at the anti gun starbucks down on hayden but they never seem to be happy you are there and they cackle and laugh loudly behind the counter  The pony tailed gentleman I had yesterday couldn't have been more pleasant and he even brought in his own I Pod playlist which was infinitely better than the crass, weird aggressive Bernie type music Starbucks now plays.   I highly recommend this place and I am not even a coffee aficionado.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "76rx_NjCnxjfrpbDgmjWVg"
  },
  "XBCefdA7M5S16J3GcC5T5A": {
    "date": "10/13/2015",
    "text": "This is such a cute little place with the best chai latte I've ever had!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "JUAPbqBPaTwcpnHwLzvvOg",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JUAPbqBPaTwcpnHwLzvvOg/o.jpg"
      }
    ],
    "user_id": "CB_UeKErQDT0r3v6R9Eang"
  },
  "hAC_DEJhCJsyHSHXUDYzLw": {
    "date": "1/8/2018",
    "text": "Coffee is pretty decent. Food, location and service are really good. This is one of my favorite spots in Scottsdale!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w3u3SxIOSNHx1gnz_e2h8g"
  },
  "jbmaLaXehs3uumCS1-p2Kw": {
    "date": "5/5/2014",
    "text": "I don't even drink coffee, Irish Whiskey is me deal here, or a local brew-beer. However my wife drinks coffee, and I eat the MAC-N-CHEESE. yeah boy!!!!  Ask Patrick for the M&C and a beer he will set you up.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0ZExQ2PACaFOzD2hRH8qrg",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Great live music   Best in NSCSD",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0ZExQ2PACaFOzD2hRH8qrg/o.jpg"
      },
      {
        "img_id": "j0O8uo0AbBm8pS-_Yet4BQ",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Glass half full",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/j0O8uo0AbBm8pS-_Yet4BQ/o.jpg"
      },
      {
        "img_id": "NUyJfvP1WOIWL7dLcG8Z4w",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Dogs love the air at altitude",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NUyJfvP1WOIWL7dLcG8Z4w/o.jpg"
      }
    ],
    "user_id": "egZxO0KEVuCyyfODxHbmYg"
  },
  "lRcI57n3SiWKBrI5OnXdYw": {
    "date": "6/1/2015",
    "text": "I adore this coffee shop so much. Their Gibraltar and lattes are out of this world. It's a cute place to have a coffee date! The service is always too notch, as always with smaller coffee shops, don't come in with a stupid long coffee order, like you're in a drive thru, this place is here for those who want to relax with good, unfussy coffee.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ICw4trkmmulxI-SwmY0yiQ"
  },
  "-Rs7UB4t3jhQkTl9IW8Mgg": {
    "date": "10/17/2016",
    "text": "The best part of Altitude is the view! So few cafes and restaurants in Phoenix take advantage of the landscape or scenery available to us. Altitude, however, has mountain, tree, and fountain views--and it is so pleasant! Take a few hours to slow down your life, and enjoy your coffee [honey vanilla latte] and your friends in this lovely spot! Wish they had whipped cream tho and somewhat reduced prices.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "22dqLO1If5t3j06a2gd7lA"
  },
  "MAYjycT0v4g8ba6R8W9Rjw": {
    "date": "12/16/2017",
    "text": "The best coffee in Phoenix and very very good espresso drinks. Great location, very friendly staff. I also buy bulk beans for home brewing from here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qqBvGZf2gIklGX4q6eD6HA"
  },
  "ZMuZhoNCEY4BUAeDTEmrqw": {
    "date": "1/13/2017",
    "text": "I just ran in quickly for a dirty chai, but it looks like a cool place to hang out. The barista was helpful and friendly. They serve breakfast all day. Yes, it's a little pricey for the drink, but still not bad for the experience. And the dirty chai was one of the best I've ever had!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2LPtZOBB4NmkuWdLisyKoQ"
  },
  "SHP7MWOB6DVgURRKPPLk4Q": {
    "date": "2/18/2017",
    "text": "I really like this coffee shop!  I was in here the other morning and had a delicious iced coffee. I was on my way out of the shop with about half of my coffee left and dropped it. I went back in to let them know and they gladly replaced it.  They also had a nice promotion where if you buy one food item then you get a drip coffee for free.  I also had a blueberry muffin which was amazing!  I will definitely be coming back(:",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MbChyRFmIjDw6N09HCJORw"
  },
  "2HFtxK0mI1VFA7pcMmjbQA": {
    "date": "6/25/2015",
    "text": "Great coffee, chill atmosphere, great scones. Not a great lunch spot, but a good snack spot. I'll try breakfast and coffee next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "vmNpaHBJKsztk7796laHag"
  },
  "SwjTzw_PJAvYtYseBZBNNQ": {
    "date": "11/4/2017",
    "text": "The coffee is pretty good and they are knowledgeable about coffee which is a nice change. The food looks great but I have only tried the coffee so far.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JadJapYjugS18OmxbWg_kw"
  },
  "i9_y3G15TvLgsKTBRW7TAA": {
    "date": "9/20/2014",
    "text": "I came into Altitude with high hopes, but unfotunately my experience was average at best and WAY overpriced.  Despite there only being a few people inside, the space was very cramped and I sat at the only open table - which looked like it hadn't been wiped in hours. I ordered a latte for myself and a bold brew for my mom. My latte was ~okay~. My mom's bold brew coffee was TERRIBLE. It literally tasted like water. I can't imagine what the light roast tastes like... luckily, I won't have to.  The ambiance is really nice and I love the outside patio. I just wish they had more seating availability inside. Also, it was weird that a guy was sitting at the table next to us awkwardly FACING us for over an hour (with no drink or anything whatsoever) and then it turns out he's close with the server/manager? So he was basically hogging a table when seating was cramped as it was. He started massaging the counter girl...awkward? And super unprofessional for the manager to be sitting at a 6 person table on his laptop.  TL;DR: For $7, I got a mediocre latte and my mom got a terrible coffee. Even though Altitude is aesthetically pleasing, the main reason you go to a coffee shop is for... the coffee. With that said, I am hesitant to come back. I prefer the Village Roastery which is right around the corner.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "C1bwG8PIulWxnj1_6OW9cQ"
  },
  "fJjNAqhGKq-nf5QIYvZ-6Q": {
    "date": "1/19/2017",
    "text": "Great place.    Loved the roasted coffee beans I bought a few days ago.   It was wonderful that the gal could tell me what day they were roasted.  I don't think most people understand how much better coffee is with beans roasted a few days ago instead of out of a package with the \"use by\" date a year from now.   I definitely will be buying more from here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XQUMSi3XGM9PkzReuSA3fg"
  },
  "rkjoQr6gCiZBO-yd_SwFPA": {
    "date": "9/17/2014",
    "text": "I went here today for my morning latte. I order a hot dirty chai latte and payed $4.80 for it. I left and started drinking my latte what was just lukewarm and had no espresso in it.  Well a dirty chai latte is a chai latte with a espresso shot!!!!  My drink went into the trash! What a waist of money and disappointment!",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "EupRrNJ6zjssMwgpWOvjkA"
  },
  "evCnBYz0fvRV2YYXf6_dTA": {
    "date": "5/23/2015",
    "text": "Wow, the coffee here is amazing. They roast it on premises and it's thick and delicious. Don't forget to try the peanut butter cookie, and wash it down with the iced pomegranate green tea. Excellent service as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hWVTWn4_ozjYJP5bcUrZ2g",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Deeeeeeeeeelicious!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hWVTWn4_ozjYJP5bcUrZ2g/o.jpg"
      }
    ],
    "user_id": "Hisw0-1tJ4z-FrGhSsKNEA"
  },
  "TNm06qICCEiche9BlGes8Q": {
    "date": "7/9/2016",
    "text": "This coffee shop is located close to the lake with an amazing view if you sit outside. Coffee and treats are great, baristas are friendly and the manager usually hangs out in the coffee shop and makes sure that I'm taken care of. They even serve alcohol if you feel like it. The sits inside are limited but it's very cozy and the place is not loud so it's good for studying or work.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ZhO7ixP3HRtrry5ygfYFQ"
  },
  "0GtTn5BVQOm6TTNjHGmRIw": {
    "date": "7/13/2014",
    "text": "Found this place on yelp and decided to stop by for some breakfast, walked in to a nice atmosphere with great decor, it was almost full but still nice and calm.  We ordered our sandwich and a mocha and took a seat.  When my coffee was done, nothing but better news as it tasted amazing and the barista was a nice and friendly guy.  As was our breakfast sandwich on croissant! But the problems lies with the manager/server. At no point were we greeted or acknowledged in anyway, until he wanted our table! He got up from his empty 6 chair table where he was on Facebook to hover around our 2 chair table to talk loudly about how they are going to use our table, we got the point after hearing it indirectly three times and left, hopefully they take some courses in customer service so we can give it another shot",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ruYPB845qDuJVpogQ600xQ",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Breakfast sandwich",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ruYPB845qDuJVpogQ600xQ/o.jpg"
      },
      {
        "img_id": "YIjwp9ktuTbRi2HphaS3cA",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Mocha",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YIjwp9ktuTbRi2HphaS3cA/o.jpg"
      }
    ],
    "user_id": "sNTJ4hkw6lulb2RBUeJi7A"
  },
  "5gl-jOP-tAZrNkPP6cG6eg": {
    "date": "2/21/2015",
    "text": "What a beautiful spot! The staff was friendly, amazing coffee and these unique delicious kurtosh pastries.   When in Scottsdale it's my favorite place to relax and get some work done on the big patio with coffee.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JyzSWbn8ST46p6lPN0Bcbg"
  },
  "JY9Q6mRZQeKdQssg_56GjQ": {
    "date": "2/12/2015",
    "text": "A beautiful place. Almost like being in Europe at a  Cafe in a small town. Coffee is good, food is good, I highly recommend this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iPSavYE4nEdf82hE_tKfnA"
  },
  "3xf9ZC-Ext2dedyf5Jcvvg": {
    "date": "6/4/2017",
    "text": "A Decent little coffee place. Had to stop in for coffee before a big day at Odysea (around the corner). Coffee was good, the baristas a little out of it. They smiled but you could sense they didn't really care that you were there. Ok pricing for what you get. No vanilla powder which is my go-to.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TMilGgbY0iUdiGulPFC3Xw"
  },
  "8tnDSNfBY28nICXPLV_Uaw": {
    "date": "12/21/2016",
    "text": "Great little coffee shop. I've stopped by here twice now for lunch while out at a client's office. I highly recommend them for coffee and lunch. If I lived closer, I'd check in more often. They brew their own coffee right in the shop which is cool. They have outdoor seating and are near a small body of water with a fountain and grass so you can \"believe\" while you eat you're not actually in the middle of a desert.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qOd6Azix7tVKRb-uTSZ65A"
  },
  "TEpGG-3Mym8LTbGjz298jQ": {
    "date": "12/4/2015",
    "text": "The atmosphere is nice. Located right next to the lake.  Dog friendly establishment.  My friends bought their pumpkin spice latte, I got their Americano. They liked their latte. I thought my Americano had a rich, coffee taste- it was good.   Free refills on the Americanos & the server was nice and gave my friends a free refill too.   Will be there again for coffee & our morning walk!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "9uE0smG2bwgkI95RPj0lPQ"
  },
  "NadbsRBHmVctDkdZ5hcfuQ": {
    "date": "3/1/2017",
    "text": "Great view and great coffee. Perfect place to arrive in a bicycle and just enjoy the ambiance. Capuccinos are delicious",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "PgN-rqXVZvx9UT_eAMxtAQ"
  },
  "GLiV8Y4u03B98YcPDRzmIA": {
    "date": "8/29/2014",
    "text": "I met a friend for breakfast. We both ordered at the counter and then took our number outside. Great location, ambiance, decor. The interior has a variety of seating as well as cute shaded tables outdoors facing a cute little lake Plus, its dog friendly outside!. I ordered an Americano, which was good, but everything else was the highlight. For breakfast, I had the egg white frittata with spinach and goat cheese (see picture). It was very tasty (with the addition of hot sauce).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dBy0TnO_V6VCzDOcY1z2lw",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Egg white spinach and goat cheese frittata with an Americano.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dBy0TnO_V6VCzDOcY1z2lw/o.jpg"
      }
    ],
    "user_id": "4XIjdvV3bz-e_NYzJRJLHg"
  },
  "ObNJgl0W7F0PbUNNysMJEQ": {
    "date": "8/27/2017",
    "text": "Love the coffee drinks and baked goods at Altitude! Great location, very cute patio area, and amazing customer service! Can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SUdXC4a73KyL5twfcdmoFg"
  },
  "2ZKWE3bsOyP3VTTfC6jN5Q": {
    "date": "2/28/2017",
    "text": "I am so happy to have this establishment within walking distance!   The staff, coffee, and edibles (not those kind) are all top quality.  If you have a few minutes, the patio is a nice place to chill out and listen to the birds, or bang on your keyboard.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "eLI-qVqxda4l6ClIoR_OEg"
  },
  "b-QEZ8GXRi7CeZcjZvdK3Q": {
    "date": "2/12/2017",
    "text": "We stopped in the other night after dinner with our 3 year old in tow.  They were technically closed but were super nice to stay open to make a hot chocolate for our son and coffee for us.  We were really touched by the gesture as the person helping us, a mom herself, understood the disappointment a toddler would have with not getting his drink.  Thanks so much!  You guys are awesome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Y7019L7fz3l156_AICqhDg"
  },
  "MFQSKM0-AGboeAH6yZMWNg": {
    "date": "5/13/2016",
    "text": "One of the better coffees I've had in a long time!  Great little patio with wifi!  I will be back!  I do hope they add more food items to their menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "62Lp-OSlNL-XPXgOAcXH8A",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Best coffee!  Vanilla, hazelnut latte!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/62Lp-OSlNL-XPXgOAcXH8A/o.jpg"
      }
    ],
    "user_id": "BEAkpyqHhfqfdvXK73eTgQ"
  },
  "ZdVOrqLXNZMqrKi9eCMHzg": {
    "date": "5/11/2017",
    "text": "Just got a matcha green tea latte from altitude. All I got was milk with a ton of sugar and really mild taste of matcha. They only had sweetened almond/soy which made the drink even worse. The girl in the front desk couldn't care less.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RwHNWjWCIg1a-ggCkL0hxA"
  },
  "RkI31v70cBhQuX8qhJ0hMw": {
    "date": "8/22/2015",
    "text": "We were very disappointed with our trip to Altitude Coffee Lab. I took my sister there yesterday and she had a great iced mocha that had a strong flavor and was quite tasty. So, today I went back to get coffee for her and my friends.  They all got iced mochas again because we told them how good it was. The mochas tasted either like \"lightened up\" chocolate milk or milk with a touch of burnt coffee added in.  I don't even drink coffee and I was disappointed in the taste.  They were all sad because they have a morning routine of going to Dutch Bros, but were hoping this would be the new \"spot\". Right after I got home and they tasted their coffees, they went and got different ones somewhere else.   They enjoy a good morning coffee and this was extremely disappointing.  The overall ambiance of the coffee shop is nice and quaint.  It's a good place to do work, but it's a bummer that the coffee served inconsistent.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "ipqkpKJUOwzMRIItRqsjWw"
  },
  "YE3J_UTIqg71pxsZww1vig": {
    "date": "3/1/2017",
    "text": "Absolutely adore Altitude! The coffee is great and the atmosphere is supreme. Relax on the patio for a water view, or stay inside and enjoy the stellar decor. Cait and Andrew were hilarious and let me interview them for a school project I was doing that day. Overall, a fantastic spot to chill, eat, and relax. My new favorite place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vPOsA4sfAVQfaFHx2ulLhw"
  },
  "ygCB9fLZyQBmyP-Jom1YBw": {
    "date": "4/9/2016",
    "text": "Came here on a trip to Scottdale. Everything was perfect here: coffee, food, baristas, wifi, power plugs - everything I could want in a coffee shop.   Both times I got two pour overs - both were great. Will come back any time I'm in Scottsdale.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U20N6J7HryL9UKZYHy7W0Q"
  },
  "fRFkkUVYlpHRELSyQjcG-A": {
    "date": "6/23/2015",
    "text": "I feel like if I come back for food and a latte sometime I will be able to come back and give a more accurate, updated review. But the great atmosphere and service gave me enough to review for now! First off, the barista was incredibly nice and friendly. Also super down to earth, didn't seem fake like people working in those type of positions sometimes seem. She gave us some recommendations and stuff. The best part was most definitely the atmosphere! Was cool to be able to see the little lake outside of the window. Good music was playing, I could see puppies outside, all positives! I also liked the succulents and lights and stuff outside. It was very neat. I absolutely love tea, so when I saw pomegranate green tea on the menu, I was super excited. Unfortunately the tea did not have even a hint of pomegranate flavor. I'll have to come back for a latte instead, since they roast their own coffee and everything!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "18qEoFOVEernpVLh97PQPQ"
  },
  "PPA1JIbfwzoNQhgFWjhQ_w": {
    "date": "5/18/2014",
    "text": "I'm a fan of...... Obviously the coffee! Fresh and toasted \"In House!\" Then there would be the wine, beer and liquor (I have a vested interest in this department)!!! Oh and I'm a huge huge fan of the breakfast sandwiches and the Maple Bacon Muffin",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ENA3SBRkIafbHZg0c4guKg",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Tonos Frio + Nadia Cabernet+ Anchor Steam = great times",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ENA3SBRkIafbHZg0c4guKg/o.jpg"
      },
      {
        "img_id": "nUllxNJS15xIj1Vjv1ew9Q",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Tonos Frio",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nUllxNJS15xIj1Vjv1ew9Q/o.jpg"
      },
      {
        "img_id": "Ty_h4ID4aiZdav8PhbPAwg",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Tonos Frio gig Great live music in scottsdale ---- yep you heard me right",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Ty_h4ID4aiZdav8PhbPAwg/o.jpg"
      }
    ],
    "user_id": "shwixbfGDLPS9tV5mMWbZg"
  },
  "XuxCZcRIDr-F1_BjCXp7xQ": {
    "date": "6/8/2015",
    "text": "This is slowly becoming my new favorite coffee shop. I have been here several times now and every time the service has been quick and friendly. I am always welcomed with a smile/greeting and a \"have a nice day\" as I'm leaving.  On Sundays, they have open mic from 2-4pm. Normally, it's just a guy on guitar but once there was a man playing Pink Floyd on the piano. I have been back a few times in hopes of the piano man, but no luck.   My go to drink is an iced vanilla latte. The vanilla, espresso, and milk all blend together to make an amazing drink. The espresso isn't bitter but smooth and stands out nicely. They blend their own beans, so be prepared to be impressed. My husband recently tried a blended peach black tea and it was delicious. It was both sweet and smooth with the tea flavor. It tasted really good on a hot day! They also have blended green tea, so I'll have to try that next time.   They have a menu of items - both breakfast and lunch. They also have a pastry case filled with rotating items - cookies, muffins, cupcakes, etc. I'm not sure if the pastry items are made in house or not. I haven't asked and haven't seen a sign. One time, I split a blueberry muffin with my husband. It was delicious - it was moist with a good streusel crumble on top and had a lot of blueberries. Another time, I tried a chocolate cupcake with espresso cream cheese frosting. The cupcake itself was decadent - both moist and chocolatey. The frosting was good but I didn't really taste the espresso. The cream cheese really stuck out. However, I'd order it again. Finally, I've also tried a chocolate chip cookie. Which surprisingly, I did not like. It looked super puffy and inviting, but didn't deliver. The cookie itself was dry and kind of tasteless. Otherwise, all of their other pastry case items look delicious and I'll probably try one of everything eventually.  In addition to their amazing drinks and pastries, they have a wonderful outside patio with plenty of shade and seating. The patio overlooks the nearby lake, where I've seen a lot of wildlife. I love coming here. My husband and I have made weekly dates to stop by, grab a drink, and sit on the patio. I would highly recommend this place as a date spot, a hangout with friends, or just a place to grab a quick coffee. I will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "XJYFjbH-oTmu2dATTqyauQ"
  },
  "QujY8F2Q2XcAOwnRsIUp1g": {
    "date": "8/15/2015",
    "text": "Just a great casual coffee place. Helpful staff - I ordered an extra shot in my latte. The woman helping me mentioned that they pull all shots as doubles, so I could get two extra shots for the same price if I wanted it. Just a nice, helpful suggestion. Baked goods looked amazing but I didn't try anything. Really cute, good sized patio. Nice, laid back ambiance.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "qvBULxruuHUAj-yumrB1Qg",
        "caption": "Photo of Lakeview Coffee - Scottsdale, AZ, United States. Tasty latte - none of that burnt, bitter Starbucks taste.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qvBULxruuHUAj-yumrB1Qg/o.jpg"
      }
    ],
    "user_id": "g21eFOcpqwCNMjoYv4BKOA"
  },
  "fBinPSu3FCelA2Aghwh-Qw": {
    "date": "11/25/2015",
    "text": "What the What?!?  A coffee without Kurtosh is like a day without sunshine!  Where oh where did they go? Sniff! Sob!  I will gladly restore the stars when the Kurtosh returns, by gosh!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LRki_2GO-IGTh-3IBOBOMg"
  },
  "_LDea6BsrI5tZLGiwmjIrw": {
    "date": "5/31/2017",
    "text": "This is a lovely little privately-owned anti-Starbucks coffee shop (a joy in itself). The coffee is lovely and the view outside of the edge of the pond is nice. I will return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JiCX0VjZm-XPDzpXfaT7zw"
  },
  "o7wP0FOFW-TWG29Xkk7Qlg": {
    "date": "1/17/2017",
    "text": "They really have great coffee drinks here (you should take a bag home) and the location is very park-like. A nice place to hangout for a bit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OlNMGfTQZ6VP_jP4jHA0TQ"
  }
}