{
  "TZYOoBnVtX7BX-9UEjZIHQ": {
    "date": "12/14/2007",
    "text": "This is a solid, clean, family-owned Thai restaurant in central Phoenix(Arcadia).   I can't rate it higher because Malee's is too far a superior choice for me, and using Malee's as the 5-star standard for Phoenix Thai food, this instinctively comes in at a 3, which is my standard for \"good\", aka, I'm not complaining but I'm not blown away either. One of my staples at all Thai restaurants is the tom kha gai soup, and the one here is, again, good.   The atmosphere is typical of any local neighborhood favorite. The decor is nothing special. It was fairly crowded on a weeknight, signaling its popularity with local residents who know where to go when they get a Thai craving. The service is typical family-owned friendly.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "mIysRk_cJ5K_BMZ-r06TFw"
  },
  "r_aEyvwbwHF5gN0J4LAR5Q": {
    "date": "10/7/2012",
    "text": "This was one of the first places I dined at when I moved to Phoenix and I was quite impressed. The green curry tasted very authentic and service was impeccable. It's a must try!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cYDUzjUL-MguFb55e8EW4A"
  },
  "ls3hCFg2SQZwL5oKQ5q6iA": {
    "date": "11/1/2009",
    "text": "I was a bit disappointed by this little place, as I've heard so many good things. I always order the same dish at every Thai restaurant (pad Thai) so it gives me a good basis for comparison.  The pad Thai here was a bit soupy, and was severely lacking in veggies. It didn't come with tofu either, which was too bad (all of the other vegetarian dishes did, however). It seemed to be made up of sauce and bean sprouts, with a few noodles thrown in.   I wouldn't rush out to this place. There are plenty of other phenomenal Thai joints around.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4SeXADCmqLg1W0qTVaEkXQ"
  },
  "72koQmvu7C7VXXYkxN9DCg": {
    "date": "6/12/2009",
    "text": "Ok, if you watched Seinfeld, you are familiar with the term \"soup Nazi\" and you know where I am going with this...  The food is AMAZING. The best Thai in Phoenix (next to Thai Rama their 2nd location) but the service, ughh well, keep your expectations VERY LOW.   Special requests are not welcomed and rarely honored, but the food is well worth the emotional abuse you endure. Check it out, it is a great eat!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "GoARWqayYXgYsW1cKTi4Mg"
  },
  "24c7uCT2ljPTieXh78nEpw": {
    "date": "10/29/2009",
    "text": "One of the best Thai Restaurants in Phoenix. Nothing fancy from the outside, but inside provides an authentic vibe, great service and amazing food at good prices. The new website (includes photos of dishes) helps with take-out ordering. The Pad Thai and #35 on the menu are a must.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tUZtqzqE0bIOcLelcR4opg"
  },
  "FmiLKFncpaMRwFIBW7gcTg": {
    "date": "10/22/2009",
    "text": "Now that is some spicy Thai food!  When it comes to choosing Asian in Phoenix one usually has to be pretty selective.  Thai Lahna takes away some of that selective pressure.    As an appetizer we had the Chicken Satay.  It was okay but didn't blow me away.  The peanut sauce, however, was really, really good.  Which made up for the kind of tasteless Chicken Satay.    For entrees we chose the Pad Thai and the Fried Rice.  We ordered the Pad Thai medium and the rice hot.  The Pad Thai was definitely on the flavorful spicy side.  It did make me sweat and cleared out my sinuses.  The Rice was really good...Although scallions and onions in the dish made it a bit too oniony.  Next time we would probably tell them to hold the scallions back.  The rice was also like a nuclear explosion going off in your mouth.  It was wonderful!    The portion sizes were good without going overboard.  I will definitely be enjoying Thai Lahna again.    Next time I want to venture into their curry dishes.    I give this restaurant 4 Noms!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TVE7hbPC-GskuPUEfVbdQA"
  },
  "TInFKf4PM6LhaW2zrEA2GA": {
    "date": "5/8/2010",
    "text": "Things I loved:  The Thom Kha Ta-lay (med) was creamy, spicy, and FULL of seafood and fresh kaffir leaves. The chicken satay had a nice char but was still juicy (so rare!). The cucumber and onion relish was surprisingly sweet and a great counter to the heat.   Things I only liked: The Pork Kwediaw Kraphrao (mint and pepper stir fry with egg noodles) was not as mediumly spiced and could have used a touch more mintyness. They were out of Pumpkin Custard, which made me very sad as it sounded awesome.  Verdict:  I would go back to try a curry or rice dish, for sure!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-oHBgKNC6xGHIGdoZW3ReQ"
  },
  "wYl8Dj2ck2BW02Sry4j2xw": {
    "date": "2/18/2009",
    "text": "I tried Thai Lahna tonight after my Metta Yoga session next door with fellow yoga enthusiast Steve S. It was a little after 7 and Thai Lahna was pleasantly empty. You know, there were a handful of diners enjoying their meals but the small storefront was still quiet and servers meandered around checking in on guests and greeting us when we stepped in. I thought the decor was impressive in that it was actually Thai, not just generic Asian like other Thai places I've been to. Steve agreed that it was \"Thai-ed together\" well.  sigh.  The menu reads like a novella, but of course I only have to flip to the Vegetarian page. There were two or three appealing Veg options but the rest seemed pretty bland; noodles with vegetables, broth with vegetables, white rice with vegetables. I went for #93 the steamed tofu with...white rice and vegetables, with a 'light soy' sauce. My dining companion ordered #41, a shrimp and veg entree.  Service was quick and both the servers seemed friendly enough, and pretty quick with the water refills and ice spill disasters. I thought my dinner was decent with a standard mix of veggies, but seasoning wise found it basically salty and surprisingly oily. I wasn't expecting a spice explosion but sodium alone doesn't do it for me. I would like to come back and to try a few apps or other vegetarian options, and at $7.95 a dinner its a decent wallet-friendly choice.   Oh and at the end of the meal when we were comment on the decor we were presented with two chinese fortune cookies which kind of broke the mood...especially since my fortune wanted to teach me how to say \"long time\" in chinese. yeeeah.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "rzq5nqG2NG13o3ISxJSrsQ"
  },
  "Toywn4VQ9SZFSnsH4BmSEw": {
    "date": "2/22/2013",
    "text": "best Thai Food in Phoenix.  The have a whole vegetarian menu and The sweat and sour tofu is amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jPpdTCwFf0shhqppXv9tPQ"
  },
  "G9Zscp3b7ZgsfGpUnTqoNw": {
    "date": "10/5/2009",
    "text": "Disappointing, but I have to preface by saying that my taste is spoiled by the diverse Thai restaurants in Southern California (LA and SD), so my standards may not be representative of Scottsdale.   We ordered:  Beef Pad See Ewe (missing that \"pan-fried\" taste, it's soggy and too salty)  Chicken Pad Thai (sauce was not infused into the noodle)  Green Curry (okay)  #29 Pork dish (i think)--too oily  Thai Tea-- Decent  Fried Rice--They ran out of crab so we got the chicken instead--nothing to write home about   No mango with rice because they were out of season. Sob Sob   We really had high hopes, but were left high and dry, plus an uneasy feeling of grease in our tummies...Sorry to contradict the high ratings, but if you are a spoiled brat and come from the land of diversity, you too will understand. :)",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "I4uZM6PqMKFDK3qrh_KLvA"
  },
  "qUmpdkwGccy_tZlhbes_Yg": {
    "date": "7/9/2008",
    "text": "Lunch time today I had a craving for Thai so I went there to try Thai Lahna for the first time. When I walked in I was not greeted by anyone for a number of minutes, so I sat myself and before being greeted by anyone my silverware, a menu, and water showed up. Maybe they like the element of surprise. I ordered the #11 lunch and thought it was very tasty. The quality of the veggies could have been better, and the cheap white rice didn't impress me much, but the taste of the sauce was delicious. The soup was also very good and for $8.12 it was a cheap meal. I would say Thai Hut was a little better, the the difference was miniscule, and I did like the service much better at Thai Hut.  3.5 stars",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "sjWvk3DZapZ-9ULAFtDmYw"
  },
  "Sb1BhsZJ4ue46QllWCgTZA": {
    "date": "10/7/2011",
    "text": "A great takeout restaurant, it is a sit down restaurant as well but I don't much care for the atmosphere of the restaurant. The food is delicious, I recommend the yellow curry with chicken.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "V2t_oLWYP1TPVdNQhk1L3Q"
  },
  "UHGxds92vLVuufF_RpMnmw": {
    "date": "3/21/2010",
    "text": "Best Thai in Phoenix in my opinion.  I love their extensive menu and the service is great.  The Chef here cooks ALL the time, so the food is consistent and wonderful.  Try the Phat Thai is the best I've ever had (and I've had a lot of Phat Thai).  Always clean and has a fun and funky interior design.  Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WvbVXObwaEMbKFX5TFfGeg",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WvbVXObwaEMbKFX5TFfGeg/o.jpg"
      }
    ],
    "user_id": "rWk_AbsnkXxjC_GAUlNV6A"
  },
  "DNBLO5PSTlOiwKUro4mfHA": {
    "date": "11/28/2009",
    "text": "Talk about a stomach ache.  Too bad I can not give this place a 0 or negative star review.  First off, I have eaten very authentic Thai food in Thai Town in Hollywood.  The prices are dirt cheap and the food is excellent.  This place the food was more pricey and I had tremendous stomach and digestion problems the next 3 days!  My best friend who is Thai thinks that the curry I got lacked the curry.  Thai curry has the peanut sauce and curry base.  He thinks I got all peanut and no curry.  Just thinking how much peanut I might have ingested makes me want to puke right now.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8DX3pBJt96HqRxV8ACLdYA"
  },
  "D2xddGYQZsm8Gt2qhDIxNA": {
    "date": "11/17/2009",
    "text": "Ever since sponsoring a Thai officer many years ago in another life I lived in another place.. I havent really ying yanged for the Thai til recently.. I had visions of his fish eye lime ridden soup in my head for years.. bless his hard working, soul.. It did me my hard to please self in on the Thai food for at least 10 years... The soup here is awesome.. I could have made a meal of it.. It comes in a authentic pot , all lit and hot! I had the Pad Thai.. keeping it real and keeping it simple Thai for this first time back to the Thai after all these years.. Im a new fan.. I love it.. cant wait to go back and get more adventurous.. JUST no fish eye soup.. never ever again! More hot pot soup tho ... Any day!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1sGYXSkJHPhJ6wQtc-RbZw"
  },
  "jNqL8WL_ZbUwQpPk5_IWVA": {
    "date": "10/3/2012",
    "text": "I went to Thai Lahna yet again last night because I am addicted.  The complexity of the curries are amazing, but I love the pineapple fried rice with curry powder, scallions, tomatoes, shrimp, chicken, spices-----and they will really heat it up with the peppers!  The staff are always very friendly.  I usually go once a week now that I'm back in the Phoenix area------oh, and don't forget the coconut ice cream!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "unl3agQcToliCIKC056-aw"
  },
  "yUMwI1LxrE33XqsuscFaOA": {
    "date": "6/2/2012",
    "text": "I have never eaten in at Thai Lahna but I get take-out from there often. It's pretty good food and the prices are fair.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UlSNealkwU8pieWYixlp4g"
  },
  "rCqBsC2scnjLablXPyPhOw": {
    "date": "4/9/2011",
    "text": "This place is in my top thai places ive ever been to and ive been to many around the country!! I am obssessed with thai food since i was in grade school when i tried pad thai for the first time and i was hooked...their panang curry is AMAZING and i always get it spicy!! The pad thai green and yellow currys are also delicious...this place isnt fancy or expensive its perfect for take out or a casual lunch or dinner...love it everyone should try it!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "rKOVduk_kQpoIiom5lbBAQ"
  },
  "aIzODSpEucsQw9kVTltMqA": {
    "date": "8/13/2010",
    "text": "Some of the best Thai food I have had in Phoenix, and I have tried almost all of them. The downside is that the service is TERRIBLE! Even when I call for take out orders. I have never had someone be so rude to me on the telephone before, I asked a question if they had a certain dish and the lady said no and abruptly hung up on me. If you can fight your way through the rudeness on the phone, you are in for a treat with the food . . . or just go down the street to Old Town and go the Malee's.  RUDE RUDE RUDE",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hUkfXrfezVU24wZqzK4d-w"
  },
  "yo9nCE0aPvLXOn3rwgSNwA": {
    "date": "8/6/2014",
    "text": "I regularly order carryout from Thai Lahna. I have been for years. I have eaten in on many occasions too.  The decor is dated, but this is a family style place. For the price, it is really hard to beat. I love spicy food, and Thai Hot is hot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8e9CdgOc3A_MAdcDi0-tZw"
  },
  "l1aciUjU6kh_Nh0Rc4rU5A": {
    "date": "4/20/2015",
    "text": "The food was delicious, portions are big. Decent pricing. As for the establishment, it's clean, it's pretty and it smells good. I'll have to remember to try some of the other yelped recommendations in food choice. Thanks guys...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R4-68tlEQjtxpR2PN4lKag"
  },
  "auMrV9jOLUicBXSEfjCIIQ": {
    "date": "5/20/2016",
    "text": "Service sucks.  Food was all too salty.   Don't waste your time here. Took 9 minutes to get a waiter to bring water and take our drink order.  Another while went by without ordering and the Hispanic (not Thai) waitress didn't know the menu items.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ucmdy7zFflmqMKTmT8zyRw"
  },
  "UWzEry-L97RMsSIO50cVbA": {
    "date": "4/30/2016",
    "text": "This is one of our favorite Thai places to eat. I understand service might not be the best but I believe they are doing their best given their given situation and circumstance. If the service is not your particular brandy it is probably best to get your food to go. However, the food is amazing and good. Always thankful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I2YcIt0oQMME3Dh3RpKFQw"
  },
  "wfVTiIMcv_hIFrRKlMqkig": {
    "date": "10/10/2014",
    "text": "Stopped in here on a whim as I was passing by and hungry, plus I love Thai food.  Service was prompted and they seem to have quite a few regular customers. I have a yellow curry dish with was flavorful and had just enough spice prepared medium that I have a nice sweat going. They lunch special was very reasonable and filling.  I would stop by again if I'm in the area and have a Thai craving.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sOCuf-jZo43DUzWTDKiR9w"
  },
  "jGbrWzoMbK7Ox7F-kaFMuw": {
    "date": "3/28/2016",
    "text": "Unfortunately I found myself pretty underwhelmed, but I would have probably given them 4/5 if their service had been decent. Actually watched a group leave before ordering because no one came to bring them water or menus for 15+ minutes even though they only had three tables. We did get our food in a timely fashion which was nice, and my sweet Thai tea was very good. The food was kind of greasy, but not terrible. I think it was a bit overpriced and they had very few appetizers, not to mention there were quite a few items on their menu that definitely weren't Thai, which is fine if you aren't advertising how \"authentic\" your restaurant is. Plus they don't offer fresh rolls!!?? The waitress also did that annoying thing where she very rudely corrected my pronunciation even though she said it incorrectly, which is a really great way to not get a tip. (I left a tip anyway.) You have to walk through their kitchen in order to get to the restrooms which typically shows that a restaurant is confident in their cleanliness but I really don't think that they should be, it looked kinda gross in there. Oh and someone had spilled quite a bit of cabbage and other food next to our table and it was never cleaned up in the hour or more that we were there.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ngesTFfvIMLgzFsbMSRXRQ",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States. Won ton appetizer, and sweet Thai tea",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ngesTFfvIMLgzFsbMSRXRQ/o.jpg"
      }
    ],
    "user_id": "bjByM_iS9nRMOvooT_wH2w"
  },
  "lfnDDHsOuDd1dwkrFNjOXw": {
    "date": "8/16/2014",
    "text": "I say three stars because of service. We waited 5 minutes for water and then minutes later to actually have our order taken. I would say 4+ stars for food and service but that didn't happen.   Now atmosphere is kinda Asian/Taiwan setting which is cool but don't expect to be wowed in other area's such as the bathrooms or decor on the tables etc.  Cool place, check it out but you've been warned.   Cheers!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BeMrTqigcLyK6LnVj5pugw"
  },
  "3Gwjiyxj-Jam7y71eejuFA": {
    "date": "6/4/2017",
    "text": "I love Thai Lahna.  I have been eating here for over 25 years and visit at least two to three times a week - this is despite that fact that the location is out of my way since I have moved.  The owner (Tom) and his wife do all of the cooking.  This has meant that the quality of food has been completely consistent over the years.  The garlic chicken (number 33) is really fabulous.  It is one of my favorite meals.  If I could have only one last meal on the planet, I think I would choose garlic chicken at Thai Lahna.  Five stars all the way!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ilz7r50fmXiiA2Efv_OD6Q"
  },
  "KvS_9f3zP0IOwadvHsoySg": {
    "date": "11/22/2013",
    "text": "Thai food is pretty easy to do well. Unfortunately thai lahna cuts a lot of corners and serves mediocre food. It's a neat little space with cool decorations but it's nowhere near the best thai you can get in the area   Chicken satay was ok, but the peanut sauce was runny and gross. Chicken lahb (I normally see it called \"larb\") didn't have nearly enough citrus and I could feel granules of chili powder on my tongue. Green curry with beef was underwhelming in flavor and lacked any interesting tasty veggies  If a friend made this meal for me, I'd be like great job, keep working at it! Unfortunately this is a restaurant, so it gets 2 stars",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DlSNIlZgjDRw4oPoIzfhTg"
  },
  "1dC0s-KngL9XcDN5IQln_w": {
    "date": "6/7/2013",
    "text": "Truly what I'd consider a 5-star Thai restaurant.  Naturally, people's opinions & tastes differ, but having lived in Thailand and eaten Thai food in hundreds of places in the US I consider Thai Lahna one of the best, spot-on Thai restaurants going.  This is a family owned and operated restaurant that's been in Phoenix for over 30 years now.  A lot of the family leaves for their annual visit home, and the restaurant is closed for the month they're gone, which is a huge bummer for me.  Whenever I go to Thai Lahna I normally get carry out, and usually stock up so I can have several great meals out of one trip.  But once in awhile I'll dine in when they're not that busy so I can get a chance to chat it up with Tom, the owner and main chef.    I've read some reviews where people felt put off by the service, but all I have to say about that is that few Americans really understand Thai culture.  Thailand is renowned as \"the land of smiles\" but what people don't realize is that although they're known for being friendly, if you're a fuss pot, act rude or pushy, they'll shut you down in a NY second without giving it a second thought.  Too many Americans are used to getting what they want and when they want it, which goes over like a fart in church in just about every 3rd world country.  So act humble and polite, and it'll pay great dividends in any establishment you go to, and Thai Lana's no exception to that rule.  If you can go there in a non-rush hour time, you'll probably get an entirely different impression and have a really enjoyable meal as well as be influenced to do what I've done, which is to make them your number one choice in Thai cuisine for the entire Phoenix Valley - or at least in this part of town!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "GFdpIJQSJANaas61z3U7Dw"
  },
  "bfxpuq6fh3TPAyzdJ0h1gA": {
    "date": "4/14/2017",
    "text": "I've been eating at Thai Lahna since I was little - my family has always loved this place. The last couple years though the service has gone terribly down hill. We live a few blocks away so when we do take out, we usually leave when it should be done - so if they say 15 mins we'll leave then to give them a couple extra mins cushion time since they're not usually super punctual. More often times than not lately it seems they've forgotten our order and don't start until we are there to pick it up. And per the other reviews - they are not very friendly on the phone and the line is often busy and you're usually put on hold (and if you're lucky they'll remember you're holding because if they don't and you hang up...cue the busy signal when you try to call back...)  Still really great food but we often make the drive to Sa Bai to avoid the hassle!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "egpr3CBwZ6eIHY2KIQ3J2Q"
  },
  "RNq7aQMp-VJ9PJhANKJrZQ": {
    "date": "8/19/2013",
    "text": "Two times eating here and two times leaving very satisfied. The pad Thai is perhaps the best I've had in Phoenix. The panang curry was nothing short of addictive. The mango w/sticky rice was a delicious end to the first meal there.   I believe they've been in business 30+ years making them the oldest Thai place still in operation.   The service has been friendly, the location clean, so I will certainly be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7kQa-CO8reE5jZirvN3zLQ"
  },
  "AhVkzryeK8KMxx2WnjBrxQ": {
    "date": "10/15/2013",
    "text": "We used to love this place and get take-out from there 2+ times a month but something happened over the last 12 months and their philosophy on customer service became non-existant.   My girlfriend is vegan and we ordered (take out) pad thai without meat/egg. It had chicken, no biggie... We called them up and they told her that it did not have chicken in it and that we would have to take it back to prove they had prepared it wrong. When she brought it back, they hadn't even started cooking the food because they believed that she was lying. We swore we wouldn't go back...   Today we thought we'd give it another go. I ordered chicken pad thai and wanted to replace the shrimp with veggies. After putting the phone down for minutes, I could hear her talking to the manager. They wanted me to get veggie pad thai and add chicken (Another $2). She told me that this is because they pre-prepare their food.   We've decided to just get thai from Sa-Bai and they will get our 2+ times a month thai fix.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "S5_KLxxgt8MSlWfczTB54g"
  },
  "sOm3adoU7QJlmNq_whWG8g": {
    "date": "12/22/2016",
    "text": "Got take out from here tonight for the first time and it was not so good. The meat tasted old and nothing like beef. The green curry was extremely salty and could not be finished. I would not recommend this place for take out again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xNYSwxZT7JgZc2WuJDVLxQ"
  },
  "F1Cbgrm6r8WnjjpZ65irEg": {
    "date": "12/17/2013",
    "text": "I've been eating here for over ten years.  Each time I'm in the area around lunch time, I try to eat here. Over the years, the interior has stayed clean and fresh looking. The most important part being that the taste of the food has stayed consistent and delicious!  The menu has a good variety. Both the lunch and dinner prices are reasonably priced.  It's nice that for over ten years, I can count on having good service and a good meal here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9uE0smG2bwgkI95RPj0lPQ"
  },
  "LcjBCs_AViFCa54IbiN2kA": {
    "date": "3/2/2015",
    "text": "Worst Thai food I've ever had in my life. Overall, the food was greasy, smelled strange (flavor-wise, I think that there was way too much going on). I had the shrimp phaht sii-iiw, and It even included warm cole slaw/ veggies (yuck!). I don't seriously see myself having Thai for a long time...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "sAhPZ_MmXqelagJUUm4geA"
  },
  "YEWGxygIShbPd6HzVbY9Bw": {
    "date": "5/30/2015",
    "text": "The service was great but the food was average at best. I ordered two of the most basic Thai dishes chicken curry and Thai BBQ chicken. The chicken was gross and the curry was runny and not very flavorful. The rice was soggy. I wish it was better as I really enjoyed the service and it's the closet Thai spot near my home.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CrBa61fbUa8BuWJDy3Obgg"
  },
  "GKjnB_hoUNCwW97ppRxBiA": {
    "date": "7/12/2015",
    "text": "The food is amazing but the service sucks. I haver been there 3 times and on the 3rd time my friend and I waited 15 minutes and still no one came over to offer water, take drink oder Nothong! Not even eye contact or \"well be right with you\".... we walked out and went somewhere else and I still think  the staff didn't notice. On a good note the first 2 times we went the pinapple fried rice is by far the best thing I have ever had!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_T9Oskmc89sfWGcKEvvAuQ"
  },
  "F7r9VGqZRxUNXrcTZDHDrA": {
    "date": "9/16/2013",
    "text": "I am not really a fan of Thai Lahna. I stopped to order off the lunch special menu.  I found it very interesting that there were NO noodle dishes on the lunch special menu.  I was pretty disappointed with that, but still decided to order something to eat.   I had the Phik King Kai with chicken, but, ironically, it didn't have much chicken.  I enjoy green beans, but the green beans to chicken ratio was not equal.   The lunch special comes with egg roll, fried wonton, soup, and rice.  The soup is not included on take-out orders.  The fried wontons are described as \"Crispy fried wonton stuffed with seasoned pork. Served with hot mustard and sweet & sour sauce.\"  However, what I received was a fried piece of wonton paper folded into a triangle with about 1/2 teaspoon of pork.  I was confused wondering if this is what they usually serve as the appetizer and charge people for it.  The whole meal tasted more like Chinese food and I was disappointed as I really wanted Thai food.    Service was pretty quick, but I just had take-out.  Thus I can't attest to their service in the restaurant.  The interior was rather dark though.  The shades were pulled down which seemed to help with the heat on the hot day, but it still left the restaurant dark.    Thai Lahna is just not for me.  If choosing Thai, I'd rather search for another place or just choose another type of cuisine rather than coming back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Suq-J8j4GjYwk_19dOFIWw"
  },
  "1Xn4HYGiOnGxixUp8TuFgQ": {
    "date": "4/12/2011",
    "text": "Tasty lunch specials at a great price of $7.95.  I chose the Lahna chicken which came with wonton soup starter (lots of green onions - yum), spring roll, fried wonton + sauce, Thai slaw, chicken with dark sauce.  Pretty good but I'd like to go back and try a more standard Thai dish with more cooked veggies.  Note: I didn't taste the saltiness that others complained about.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EFF4SHrUaioh8FHMMM2VjA",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EFF4SHrUaioh8FHMMM2VjA/o.jpg"
      }
    ],
    "user_id": "yaJPtrrvckma2OcUpvcGpA"
  },
  "WE-2sp7XDYYwXY2cgihA4A": {
    "date": "3/24/2013",
    "text": "Convenient - close to the house and easy. This was my first time here and it was eh. I got the beef and broccoli - I know, not a traditional Thai dish by any means, but I was in the mood. The sauce was good and the broccoli was cooked well but the meat was too thin, dry, bland but managed to taste weird. I ate everything but the meat and was still full so not a total loss. My boyfriend got the pad Thai and it was also only ok.  I don't think I would return here, but I also don't want to judge it on a one time trip.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ij7OcAO5FpoNKxS1RzNoWw"
  },
  "U_jzSVUdV-Wv6QqV5oIc2A": {
    "date": "5/25/2017",
    "text": "Good food, I have only gotten take away. But the curry is good, pad Thai is bomb, and so are the spring rolls",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RExn6FAubCHMpQAmszAlTg"
  },
  "4K9mhL1s_bMc0U9nXkYniA": {
    "date": "6/4/2015",
    "text": "Cool ambiance. Eh service.  Good, not great food. I've had better Thai food elsewhere. Food is a hit or miss and can be bland. Rice was over-cooked. Try it for yourself.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "JFA0FSgyKNYl0nmt9mKoLg"
  },
  "8vdc0FBg_oGIXxStdzM4vQ": {
    "date": "4/6/2017",
    "text": "Its a nice place with rude servers. I dont care if you dont speak English, learn the names of the dishes on the menu! My favorite on the menu is the Tahi Lahna Special Chicken for lunch. Everything else is mediocre at best. I have my favorite Thai place in the Phoenix Metro area....and Thai Lahna isnt it. I would only stop here for lunch or if I am in the area craving Thai. I wouldnt make a special trip here.........",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jmwWu7IDOiIlEF26oUYTzg"
  },
  "KSVSIiy0X75Dy0hvsYFIBQ": {
    "date": "7/1/2015",
    "text": "I won't lie to you. I just ate food meant for at least three people. It's my last night in Phoenix and I knew I needed this to be my last meal.  I don't care about your political views, but this place is former presidential candidate approved! A photo of John McCain under glass is next to the cash register. So it has to have some merit, right? I've had several dishes here and they're always great. I'm a spicy food aficionado and they always do me well. I've had a couple beef curries, the panang is classic. The won tons as a starter are fantastic- you can't get better than some crunchy, deep fried won ton skins with a little bit of really flavorful meat! Always a standby, get spicy beef fried rice.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "y3AZyVhJSGYxzlRi0rK9HQ"
  },
  "8r7ebTIMakQEJ7SE48-1Xw": {
    "date": "1/25/2014",
    "text": "Picked up food.  Had to wait a little too long for it to be ready despite calling ahead.  Food itself was decent.  Had beef in red curry w green beans.  Wanted it Thai hot--it came kind of medium.  Good flavors but not enough heat and way way more beans than meat.  Also had a shrimp over lettuce app.  Liked the lemon grass flavors but the lettuce tended to get too soggy w all the sauce.  Tasted my friends coconut chicken soup.  Good size portion but the flavors -- while good -- we're not as crisp and coconutty as I am used too.    I didn't see any Thai basil dishes...maybe it's an ATL v PHX Thai thing??  When I'm back in town will check out some other places.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gqpgl3jaqXI--pOZ60pEAg"
  },
  "5Ft2wARBcfzd1I6oGaYJXQ": {
    "date": "1/25/2015",
    "text": "We live in the neighborhood and have given this place plenty of chances to shine. They are consistent in one area: letting us down every time.  We're \"glass half full\" people. We're optimists. In fact, I don't think I've ever given a place a 1-star review. But when it comes to Thai food in Arcadia, stick with Sa Bai around the corner. At Thai Lahna, they are consistently slow at delivering average Thai food (at best). And by \"slow,\" I mean GLACIAL.   if you go, expect long wait times for basic curry and rice. If you order take out, expect even longer wait times. A recent example is when I called in for takeout -- one order, just vegetables in red curry with rice for my wife, who was working late and just getting home. She said they told her 15 minutes for a wait time, so I went over there in 20, knowing exactly what kind of service I was getting into. I took a magazine.  I was the second guy waiting to pick up my single-dish takeout order. The first guy got his order (also a single meal with rice). So did SIX OTHER PEOPLE who came in to pick up takeout after I had arrived. All of them waited, and waited. No one was happy. An hour later, I got my saucy veggies and rice. When I notified them that this was a constant problem, and that we wouldn't be coming back, the staff (who are not Thai and do not speak English) simply nodded and said something about being busy. Keep in mind that when I arrived, there was one guy waiting for takeout, and about 3 out of 12 tables occupied by couples. There was no apology.  Steer clear of here and pay the extra money for Sa Bai. You won't be disappointed. They're nice, legitimately Thai folk running a great restaurant with a takeout window. It's slightly more (about $12-15 for an entree), but you won't be disappointed the way we are every time we go to Thai Lahna. Or, if you fall into the Thai Lahna Trap, walk over to Autumn Court across the parking lot for some great Chinese food that is fast, hot, cheap and plentiful from a very friendly, enthusiastic and outgoing Chinese owner.   I think Thai Lahna would die a quick death if there was ANY other place to get decent, legit Thai food for cheap in the Arcadia/Biltmore area. There just isn't. As a result, we're stuck with this place.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 3
    },
    "photos": [],
    "user_id": "1ESAJBn_pEjfCQiMhypCgA"
  },
  "8DH8HJNIBPvF_ch57FyVgA": {
    "date": "11/10/2016",
    "text": "The absolute best Thai food I've ever had. One word- AUTHENTIC - there's a reason this place has been open for over 35 years.  I never stopped at this place until tonight and wow!  I'm officially a regular after one visit!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TseW_BaZU0wIjnBvrTTe4Q"
  },
  "VIyyAGa2tmbZouvp9bmQCA": {
    "date": "10/7/2016",
    "text": "I have been eating at Thai Lahna for over 20 years. It is the first place I ever tried Thai food, and the red curry is still the best I have had anywhere. I mostly do take out orders, but I still like to dine in too. The prices are also affordable, and the wait staff is experienced. I like the spice level to be mild, and the chef does an excellent job to avoid making the food too spicy.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rrV_iewf_L73wURjFDP0Hg"
  },
  "CJOcmQUqvG-6qKtET7lUUg": {
    "date": "3/22/2013",
    "text": "Any thriving restaurant needs to understand the marriage of great customer service and consistent food. The consistency here is not a given. My first experience, the food was good as expected, tailoring alot of flavors to an American palette rather than your traditional Thai one. The service, like most reviews have stated, is courteous but very short handed and overwhelmed at peak dining hours.   My last and most recent visit was somewhat disappointing. My panang curry was really flavorful and packed the right amount of spice. However, witnessing bad management practices definitely left a sour taste in my mouth. I ordered take out  ahead of time to minimize the wait but ended up spending over 30 minutes waiting simply for change. Scolding an employee and fighting over who the customer belongs to is never meant for display at the register. I'm disappointed given that Thais are known to be friendly and so welcoming.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "zEBjQm_S26TI1Etpvie9sw"
  },
  "CT0w5mDa30wevLrH7UMycQ": {
    "date": "1/20/2015",
    "text": "I'll start off by saying I wish I could give this place at least 3.5 stars. It took awhile for my boyfriend and I to get seated and served. Once we were, the rest of the time went fairly smooth.   The restaurant is a bit outdated with cliche Thai food restaurant decor but don't let that distract you from how good their food tastes! I ordered the Chicken Pad Thai, no shrimp. It was just how I like my Pad Thai, a little spicy and a little crunchy from the peanuts! My boyfriend ordered the Coconut Chicken Curry which was way better than I was expecting! We both split our dishes so I got the best of both worlds. The sauce on the curry was creamy without being thick, if that makes sense, and it was awesome.   Prices are decent but it took awhile to pay the bill, just like it took awhile to get served in the first place. So if you have time to spare and are not a stickler for impeccable service, then I'd check this place out because the food is really good!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "LrkuATjnUC7i62ExOXmGcw"
  },
  "Uus6WIB_TT4xPyk0CYLOCQ": {
    "date": "1/22/2017",
    "text": "We had such a delicious dinner on Friday night - the crunchy combo appetizer, pad Thai, curry chicken and the coconut milk soup.  Really yummy.  We had everything spiced at medium which was perfect because we could add additional spice.  The only issue with this visit was the service, which is always pleasant.  I think they're short wait staff so I waited on hold for 15 minutes and then my husband had to wait 30 minutes to pick up.   Even with that it was still worth it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "60QOCa-G_0onWB0n3NCikg"
  },
  "SZ1TMlGOySB3Z-DQ9gigtQ": {
    "date": "8/13/2017",
    "text": "Hands down, Thai Lahna has the valley's best yellow curry.    I have easily tried about 10 yellow curries from the competition around the valley desperate to find anything that comes close.  Why, you ask?  Hands down, Thai Lahna has the valley's shittiest service.  I'm not talking about on one occasion, either.    Here are the top examples:  - Hung up on multiple times trying to call in an order - Put on \"hold,\" i.e. the phone put on the counter while several other orders taken from walk ins before me - Surly waitress who is surly every. single. time. I have the misfortune of having her for dine-in And the topper... - Picked up an order with a friend and then wanted to run an errand before going home to eat.  I'd already started snacking on mine when Thai Lahna calls and tells us they gave us the wrong order - two chickens instead of a chicken and a vegetarian.  Okay, cool, we'll come exchange it.  Still on the errand and they call again, \"ARE YOU COMING?\" Yes, geez, we'll leave now.  We get there and they demand to see both yellow curries, I surmise to confirm the incorrect order was given, then take back the full curry!  What restaurant does that?!  I waste my time and gas to remedy YOUR mistake and I don't even get to keep the mistake for my inconvenience?!  I'm giving them 4 stars because I'm a sucker for their yellow curry and I'll take shitty service in exchange for its amazingness.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b0ZQTu188XnvLzmsTdvfHg"
  },
  "IWWK_eKHMtvwT9udtscYdA": {
    "date": "10/18/2014",
    "text": "WORST THAI we've ever had. Greasy, gross, packaged mix flavors. And not Thai--it's bad Chinese food pretending to be Thai food.  Here's what we ordered: 1) Mii Krobb (me grob as it's called at other Thai restaurants). This sticky yumminess is supposed to be created in a wok and the sauce cooked *with* the noodles. The crap they gave us was a bunch of short, pre-made crunchy rice noodles with red-dye #40 sweet/sour sauce DRIZZLED on it. Seriously????? Gross. We took one bite and no more.   2) Phaht Thai (pad Thai at other Thai places): so gross we didn't finish it! Very greasy and tasted like the sauce was made from a packaged mix.  3) Sweet n Sour Tofu: the tofu was disgusting--it's fried first, then dipped in batter and fried again. I took one bite and didn't eat any more. Massively greasy blob of gross. Sauce says it's homemade on the menu but it looks nuclear red and tastes packaged.  4) Spicy Thai rice: again--uber greasy and also not flavorful.  We will never go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "_jYEC7fvqTxu5R2jhk_NDQ"
  },
  "P_Tm2SFdJDWuTbx3eUwCAA": {
    "date": "12/20/2016",
    "text": "I am being generous by giving this two stars instead of one, due to the fact that I actually ate the food.  The service was terrible and had I not been starving, probably would have passed on lunch.  I ordered sesame chicken, which lacked any sesame flavor. The sauce, which tasted like a thickened soy sauce with a little bit of ketchup added, overwhelmed any other flavors.  The consistency of the chicken was fine and the rice was OK.  They really need to work on their timing, as there were two of us there for lunch and one entree arrived almost 10 minutes after the other.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5SBo-Pq0GBZ14LwgR11fDw"
  },
  "zvH93sOhuKDTOBpUOeDLig": {
    "date": "2/27/2016",
    "text": "I' m 100% Thai and have been wanting to eat here ever since my mom moved back to Thailand since I was desperately needing my fix. It's been a while  since I have found myself so disappointed in a restaurant. Red flag #1 was not seeing one Thai waiter in a supposedly\"Authentic Thai Restaurant\". I didn't  see the cook either, but the quality of the food and the odd ingredients added to the dishes left me wondering if I was eating at Filibertos. I had the Beef Rad Na, which was sub par. Usually the noodles are nice and fat, but thes were half the size of the noodles found at Wild Thaiger. The gravy was decent, but the broccoli was the regular kind instead of \"Chinese Broccoli\" I'm used to. All in all, the ingredients and the noodles in the dish tasted cheap. My wife had the Beef Pad Si Ew. Again, the noodles were cheap , mushy, and half the size they are supposed to be. There were also all kinds of weird ingredients added like shredded carrots, bean sprouts, and cabbage thrown in there.  Stuff you would expect at a Mexican fast food joint. The Thai Iced Tea was overly sweet and even the Fortune Cookies where cheap. You know things are bad when Panda Express not only has better food than your restaurant, but has a better tasting Fortune Cookies too. People who know what \"Good\" Thai food taste like should probably look somewhere else. I only wish I did. We came on a Friday night and paid $30 for takeout.  P.S. As we waiting for our food, a gentleman came in and asked the hostess if they had Pad Si Ew. She said the didn't have it and suggested something else. I JUST ORDERED IT AND SHE SAID THEY DIDN'T HAVE IT!!! That's why you need at least one person who speaks Thai and understands the menu.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "v1ka4KQjSWKfCQVDO8_ytw"
  },
  "TsyFCzFtnj2p9AZoh2_Hog": {
    "date": "5/17/2016",
    "text": "Extremely disappointing! I just moved to the area and needed to find my go-to Thai, this restaurant will not be it. I ordered a simple Green Curry and it was so runny and bland. The veggies were not cooked still raw. Thank goodness I ordered peanut sauce otherwise all I would be tasting is warm rice mush! This dish cost around $11.50 and all I got was rice, a few green beans, bamboo shoots and warm coconut milk. Not worth it at all.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "D5cXnEn1rDN17bQYkPBNbg"
  },
  "ynzf-snp1x4ijRzxFpB3mw": {
    "date": "3/25/2016",
    "text": "BEST THAI RESTAURANT IN THE WORLD! Seriously. I'm the biggest Thai food conesour on the planet, so I've tried Thai restaurant in many countries. But no where compared to Thai Lana. The first thing I do when ever I get to Phoenix is head straight here.  Their signature dish is the Tam Kha Gai (Thai Coconut Soup). The secret this restaurant has that separates it from others is they use a special chili paste and almost all of their dishes which gives it an incredible flavor without making it too spicy (you can add more spice if you want).  And while Pad Thai is The quintessential Thai dish, the rich flavor at this restaurant really sets it apart.  The restaurant is always very cold which is nice on a hot Arizona summer day but it might be worth bringing a light jacket.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "O2bvVSaTbYCqcm1iNHW_ow"
  },
  "N8Awo7NtNDPHE10g2H62TQ": {
    "date": "9/2/2016",
    "text": "I came in for lunch and ordered the yellow curry lunch special, medium spicy. It was perfect. Nicely cooked rice and a heaping amount of yellow curried chicken and potatoes. I spoke with the owner/chef Tom and can confirm what other reviewers are saying that he is a total sweetheart of a guy. He's in his 70s and still working hard with a great attitude.  I had the coconut ice cream for desert and it was the best ice cream I've had in as long as I can remember. I don't normally order ice cream for dessert, but I'm happy I did. I spoke with the co-owner, Jane, and she confirmed that she makes the ice cream herself, homemade. It's fantastic.   Now, some of the reviwers talk about the wait staff being unfamiliar with the menu and/or not speaking Thai; I can't comment on that because I didn't encounter any issues and I don't care about the ethnicity of someone bringing me food. What I can say is that the husband and wife that own and work at the restaurant are absolutely from Thailand, speak Thai, and take pride in their food. I'm not in Phoenix very much any more, but I'll be sure to stop in again when I am.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZNF9Lef2t3eKfFkRRP_c4g"
  },
  "aDfL-f9OIoQH08wEC6CTZQ": {
    "date": "4/16/2016",
    "text": "We visited there twice. Same two servers there both times -- both have a truckstop approach to service and know little about the cuisine they serve. The first time I was impressed by the seriously traditional Thai menu and traditional food presentation.  The food was good but too salty for us, so we mentioned it to the server who said that they would be willing to make it \"as we like it\" the next time.  So we returned to try it again.  We mentioned to the server we wanted less salt and ordered pad thai.  Unfortunately, the taste was overly sweet.  The server rudely told us that since we wanted less salt, that's why it was sweet.  I also pointed out all the black, burned, crispy debris mixed in to the noodles, and she had no answer about that.  We paid for the whole meal, and we won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EwUpC8RBc8qdGm2AnAQnjQ"
  },
  "HmNSeFQpAEM9L972SKGEYQ": {
    "date": "3/16/2014",
    "text": "Was the first Thai restaurant to nourish me with curries and noodles when I moved down to Phoenix and as such it holds the pole position when the call for massaman arises. Friendly family service offering all of the Thai standards we expect.  Fill up on the classics but don't leave without savoring the Mango with Sweet Coconut Sticky Rice dessert.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "SCo1UBoeN3bhRMkSYuiX1A"
  },
  "mN73kxEObeSTokq4Zavf0A": {
    "date": "7/30/2010",
    "text": "This place is the equivalent of salt lick Thai. I could taste very little else over the heavy hand with the sodium in the kitchen. None of the mouth watering aromatics that normally characterize Thai were detectable either. Sorry basil, lemongrass, coconut milk and galanga. \"Mixed vegetables\" consisted of bamboo shoots and green beans (very adventurous), and the bamboo shoots were undercooked and mega crunchy. Hot apparently translates to a mild tingle on your tongue, so don't go expecting to sate your Scoville craving. And to top it all off the portions we received were meager for the prices.   I might have caught them on a bad day, but there's much better Thai to be had in the valley. Even though I live in Arcadia, I don't think there's any way I'm coming back.",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "dyhTHLIf6eWBvU78Y3T06A"
  },
  "9ggvMdpdtO6iSVQT7fPvQA": {
    "date": "10/30/2013",
    "text": "I would love to be a bigger fan of this restaurant since it's in a great location in the southern Arcadia area, however the food just isn't consistent. For every 5 meals I eat here, 1 of them is not good, and to me, that's one too many. The staff isn't too ambitious either. Yet when the food is good, it's a real treat. The pad thai is a great dish especially when paired with a cold Thai iced tea. Prices and portions are reasonable. Would really like to see this place become more consistent with serving up tasteful, quality dishes and with improving the staff morale.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HPuywU9mgUcRwf7W-yYz-w"
  },
  "MdS4L-79DcB6f6QWQzfxHQ": {
    "date": "12/3/2013",
    "text": "Used Yelp to find some Thai food while i am in Phoenix for business. Fast good service and excellent food. Highly recommend it!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8qmB-gSIP-rtvSkDT1_g4g"
  },
  "_by2KNXxjkZhNh4y2plZyg": {
    "date": "10/16/2013",
    "text": "We used to go here a lot and service was always slow, but the other night service was horrible as we waited 5 minutes to be seated and another 10 minutes before leaving as we had not even received water or any interaction with our server... Very disappointed as their food was always good, but going to try something else next time.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CidUSeG0LiSB-CvBG1iHXQ"
  },
  "jv8LKIUeHan1GtQ8I-IdOQ": {
    "date": "8/17/2010",
    "text": "I have to admit that Thai food is probably some of the best to come out of Asia. Healthy for the most part, great flavor and color, and not deep fried for the most part.   I have lived down the street from Thai Lahna for nearly 2 years and I just now stopped in. Can't really say why I wanted so long, but the point is that I made it, right?   Soooo good! The menu explained what each dish was very well and all sounded great. Took nearly 15 minutes finally pick one out. I got the #36 - I don't remember the name of it but it was a Thai curry sauce with chicken and green beans with medium heat.... soo soo good! And my friend got the #33 - a garlic sauce with chicken and onions on a bed of lettuce (I would ask for no lettuce next time for sure)... his was great as well, he was looking for something similar to a dish he ordered at Thai Rama and this one was damn near close to the exact same thing.   *Note: there \"hot, medium or mild\" sauces are pretty dead on, the hot it way hot and the medium is pretty perfect, might have an ulcer the next day but tastes great at the time.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "36uY0YLHy70zR7YoXLUKSA"
  },
  "apVRETjjMpp6PdCojsHrZA": {
    "date": "11/9/2013",
    "text": "The staff were very slow to bring out our order, and the Tom Yum soup we ordered had non-traditional Thai ingredients in it and was not very good.  Thai E San on 7th Ave and Indian School is the same price and tastes better when you order off the menu.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ziN9BCPoS6qqKan2vqdarg"
  },
  "MvKGyvLCOuJjemv7nmK0aw": {
    "date": "11/5/2011",
    "text": "I visited Thai Lahna during lunch on a Thursday and the place was empty when we arrived, but as me and my coworker we're leaving, the place was nicely filled. A great hole-in-the-wall spot, quaint,  with unique ethnic-looking decor.  I ordered the fried noodle dish with chicken. The dish was greatly presented and the dish was good, except the sauce was a little too sweet for my taste. I was wanting some spice!  They have several dishes I'd like to try out, so I'll probably be back...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w0pA_3W2rJVLj9ensvpUeg"
  },
  "tYsHRn3DkGDQVmb6CVX1Nw": {
    "date": "5/21/2013",
    "text": "I am glad I found this place. Food is good and and served quick. I have ordered take out a couple times as well. My only complaints is that the different levels of \"hot\" are different every time and was charged more than the stated online menu prices that no one at the restaurant could answer why.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aa2jzpaYSW-4GMhF05eWqg"
  },
  "XjzHkuqWxKRS9tb3f6fYuQ": {
    "date": "1/18/2015",
    "text": "So I hate to do this, but it needs to be done. I still think the food here is fantastic, so why the bad rating, you ask? Well, 55 minutes is why. When my sister went to pick up our food for a to-go order, she waited there in the restaurant for 55 minutes!! AND that was on top of the 20 minutes that they said it was going to take. So, we ordered at 11 (when they opened, so it wasn't like they were busy yet), and they said it should be ready for pickup at 11:20. That's when my sister showed up. They told her it would only be a few minutes. 55 minutes later at 12:15 (I sure wouldn't call that a few), she finally got the food. I was so pissed and I wasn't even the one who had to wait there! I just felt terrible that I had talked my sister into picking it up and she was left hanging without any updates, progress notifications, etc. They knew she was there because she checked in a couple times, so what was the issue?! She's so sweet that she didn't give them any crap about it, but I just feel that they displayed horrible customer service, so I wanted to update my rating to reflect it. When we told our brother about it, he said that two weeks before he also, placed a to-go order. When he and his wife showed up to get it, they told him they had forgotten about it and that they would have to wait another 20 minutes! I guess the lesson here, is just never order the food to-go. Super disappointing. :(",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fe2OygvNOAbPPmnEbfZDCA"
  },
  "qVQ_BvHXYLXF1J1dL3MIIw": {
    "date": "8/13/2012",
    "text": "The food was excellent, especially their tom kha gai. It was so good that it was worth tolerating the bad service last Friday night. I have to admit that it was our first time experiencing poor service at this restaurant but it was memorably bad. I'm still giving you guys an excellent rating because your food is worth it!  Please just don't forget that a table of people exist. It was frustrating watching other people get entertained and get delicious food and then doubly frustrating to get ignored while I was waving my hands at all the wait staff wildly.  Again, food was good enough to overcome service. I think the answer is to dine here on weekend nights if you are in a hurry.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_L0xxgjX8f4rr9ZauMCWjg"
  },
  "M-pY1XlOWaw12jXEWENyiA": {
    "date": "1/11/2010",
    "text": "Me want to likey likey but no can do.   I'm disappointed in this place and the 4-star rating it got. How misleading. I should have known this place was no good when I didn't see a single Thai person in the joint. Don't tell me they were all in the back cooking either. Its like walking into a Mexican restaurant and all the wait staff were Chinese. Well... now its sounding like ChinoBandito. Anway--- I digress.  I came in for lunch and the menu was expansive! I've never seen so many words that begin with K.  I wanted to try something different than my regular pad thai, curry, tom yum but I couldn't decide and went off something from their lunch menu. I think it was Thai bbq chicken with spicy sauce. I figured, I can't go wrong with that. Not traditional Thai but I couldn't make up my mind about the others.   Well, they ran out. I wasn't sure if they ran out of Thai bbq or chicken. Apparently its bbq so I settled for the sesame chicken. Bad idea. When in Thai- I should probably order Thai... but... um.. how do you screw up sesame chicken? The Panda Express has mastered it! Now you!  It will be a while before I try this place out again but I just didn't expect them to not be able to cook. I will start at a one-star for now and promise to order an authentic dish next time so I can be a better judge.  I did have the thai milk tea and that was good. So one-star for good tea!",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "9KIGNO7qJ6366VBAzO0Npw"
  },
  "ih4CwXRCHfosjVp4WeAg4w": {
    "date": "12/19/2011",
    "text": "Customer service was horrid.  Wrong food served.  Staff less than friendly.  Food mediocre.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xpu2SvO6eBNH10Wz-8omhQ"
  },
  "7rE-1guct0hf4v4DZYbqWQ": {
    "date": "6/22/2009",
    "text": "I recently was craving Thai food and came across some pretty stunning reviews for Thai Lahna.   I must say... I was REALLY impressed!   My table started with the vegetarian hot and sour soup. Everyone really seemed to enjoy the flavors and the plethora of veggies. I love those little flaming soup bowls they use.   I ordered the yellow curry with tofu, mild/medium as my entree. That is generally my staple Thai item and it was REALLY good. Extremely flavorful and a great portion size.   The restaurant itself was pretty small and the bathroom scenario left a little to be desired, but I was certainly impressed with our quality of service. We split the bill four ways and added a cash to-go order. The poor girl handled our complicated check out very well.   I can't believe I lived within walking distance from Thai Lahna for over a year and missed out on such a delicious place!!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 11,
      "cool": 10
    },
    "photos": [],
    "user_id": "rA97zeqOrUYuEM69n0Xn4w"
  },
  "F3jauJWeGZ9k7GX-ppumKw": {
    "date": "8/9/2009",
    "text": "When I have a hankerin' for a new Thai place, I contact Chris T.  He recommended Thai Lahna and I am a bit perturbed that it's so close to my house.  You see, I go pretty often.  Like twice a month.   I always get the #35, which is a peanut dish in a brown sauce.  It's orgasmic.  Seriously.  It comes with chicken, but you can substitute tofu, which is key in my book.   Staff is very friendly, though I almost always get take-out.  I drool as I drive home with my bag neatly closed, smelling it down Indian School.",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 8,
      "cool": 8
    },
    "photos": [],
    "user_id": "tJ1qdNdG0tZywbgH9uw9qw"
  },
  "XeK__tqF3PFouwilxvZynQ": {
    "date": "3/21/2008",
    "text": "I can't rate Thai Lahna higher than 3 stars, although their Thai Coffee and Thai tea are 5-star worthy. The food was just okay. In fact, it read more appealing on the menu, which is gigantic. How is one ever suppose to decide?  My lunch buddy and I went today to try Thai Lahna for the first time. It was pretty full around 12:30. I snagged a table. Service was prompt and we had waters in no time.   We ordered a shrimp app that was made in chili/lime sauce with mint and lemongrass. Uhm, it was okay. The shrimp is nothing to write home about, but I did enjoy munching on the bed of lettuce that was drenched in the spicy sauce. I really, really, really wanted this to knock my socks off, for the seasonings sounded like they would create an \"oh my god\" experience. What a shame.  I ordered the Eggplant Jay, since it came highly recommended. Little did I know I'd have to fight off 500,000 onions for one piece of super delicious eggplant. Not my idea of a good time. I really wish this dish could have been better. The eggplant was good - what there was of it.  My friend ordered veggies in red curry with coconut. It was pretty tasty, until you bit into a sliver of corn and about fell out of your chair from the punch of salt. Wowza.   Price was decent. The app ended up costing more than either of our entrees, which was strange to me. But, oh well. It averaged out to about $20 a person for all that, drinks and tip included.   Parking is a cinch, since it's in public lot. I had no problem finding a spot during the lunch rush.  SOMETHING STRANGE:  We weren't asked if we wanted to box up our left overs until AFTER we had paid and were getting ready to leave. I thought that was strange. But, it would have been one thing if I had really wanted to take the food home with me. I didn't.   Chance of my coming back here? Same chance as UCONN winning the NCAA tournament this year. 0%, thanks to an upset by San Diego. What a game...   The next time I'm craving Thai, I'll stick with Malee's, like Pierre said.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 8,
      "cool": 6
    },
    "photos": [],
    "user_id": "KeuwC8E1238SP6xyKpBM6w"
  },
  "0BWNM8Stpt5fb-Sqf1DcXw": {
    "date": "3/26/2009",
    "text": "Mmmm.... Thai Lahna.  Thai Lahna is the person you spy from across the room that you're not too sure about but then after talking to them you find out that they're pretty damn cool. Yeah, that's my Thai Lahna.  My group walked into the store front restaurant and were greeted immediately. Some of the crew had already arrived and arranged for a large table to be assembled. Nice! We sat down to look over the menu. I already knew that I wanted to order the pad thai because that's my \"test dish\" for thai places I've never been to. I also selected the masaman curry. There were six of us and everyone got dishes to share.   When the food came out, it was a TON of food. We decided to do the good ol' Yelp Conveyer belt (chomp, chomp, give). My pad thai and my curry were spot on, and perfectly spicy. Everything I had was very good. I don't think I had an issue with anything.   So why not a 5 star review? Simply put it's not the best Thai food that I've had, but it's pretty damn close and the service was a bit lacking.   Thai Lahna is a must try if you're in the mood for some savory, spicy food!",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 7,
      "cool": 7
    },
    "photos": [],
    "user_id": "-fQPzH-e-ubDIiLQhybEjQ"
  },
  "DDf4fbEXjtbIM3K6PJdpAg": {
    "date": "12/29/2007",
    "text": "Growing up in Phoenix, in particular the Arcadia neighborhood, Thai Lahna is sentimentally one of my favorite Thai restaurants in the area. It's genuine, straight-forward and now oft-familiar Thai fare served in a clean, well-maintained atmosphere. It has all of the golden mom-and-pop attributes an enthusiast seeks without the (easily misguided) trappings less-seasoned Thai explorers might find distracting.  Be forewarned, the service can be slow, often frustrating. During peak times, when it's most busy, don't prance in thinking you'll get in and out in a short timeframe. Sometimes, having overly bubbly, cheerful service is, well, not necessarily a priority with the owners. Most of the time, the service at Thai Lahna is perfectly functional, and that's all that matters.  The important thing about Thai Lahna is the food. All of the curries, noodle dishes and soups, are without a doubt baseline good, and worth most superficial hardships you may incur with the previously touched on service. Even if it's not the \"best Thai food in the world,\" everything often tastes like it should.  It's worth a visit if you live or happen to be in the area.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 7
    },
    "photos": [],
    "user_id": "Gg6wtmCGKcgaEqnN88aIUA"
  },
  "THUdzW4q55Ijjv-qvCqk7w": {
    "date": "7/25/2008",
    "text": "Yum.  Thai Lahna has been on my list for a while thanks to Yelp, and now that I finally got around to it, I wish I hadn't waited so long to check it out. It's a cute little place tucked away in a strip mall. After reading the previous Yelp reviews, my date and I mentally prepared ourselves for good food but perhaps not the greatest of service. So we were pleasantly surprised by the friendly and attentive staff. Especially me, especially when our waitress got my back in front of my date...   She said, \"How spicy?\" and I asked her which was hotter - Medium or Mild, which my date found wildly amusing. Because I thought every place is a little different, right? Sometimes Mild is hotter, sometimes Medium is hotter? No, apparently not, according to my date. Apparently Mild is always hotter than Medium no matter where you go, and I'm an F'n spicetard. But our valiant waitress, bless her heart, jumped right to my defense, saying no, I was no spicetard, people asked her that all the time. All the time. Now, I don't know if that's True or not, but I appreciated her saying it just the same.  The menu is loaded with vegetarian options, and they'll replace meat with tofu for the ones that aren't (still might want to check sauce ingredients). Shared the sweet and sour tofu and a shrimp dish (can't remember the name) and both were equally delicious. The Thai iced tea was tasty, too - sweet, but not too sweet.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 6,
      "cool": 5
    },
    "photos": [],
    "user_id": "6I1KT1SCGbAaTzTIMqF_eQ"
  },
  "5UTIsYjRoLfaPE67sx2_Zg": {
    "date": "2/28/2012",
    "text": "I got to the restaurant, looking forward to some great Thai food in the area. Lunch hours end at 2:30 (they close before dinner), and I arrived at 2:10. Didn't think it would be a big deal. When I walked in, the lady immediately told me that they close at 2:30 and handed me a menu as if I should order takeout. I asked, \"Can I eat here?\" and she said I could. I sat down, looked at the menu for maybe 1 minute, and she came by and wanted to take my drink and food order at the same time. When I told her that I was still looking, she again reminded me they close at 2:30. I should have gotten up and left figuring I was not going to have a relaxed lunch, but I did not.   The dish I ordered had a star by it, indicating it was spicy but could be modified to customer's taste. So when I ordered it, I asked if it could be prepared mild, and she said no. Okay then. The food came quickly and it was good, but they made it clear they wanted me gone quickly by giving me the check right away and asking if I wanted a takeout container while I was eating. I must have made them uncomfortable reading the New Times while I was eating. Here's the kicker--after I boxed up my food and was opening my fortune cookie and finishing my drink, some other lady came over (she put a vacuum nearby) and said, \"I'm sorry, we close, 2:30.\" I glared at her and told her I was almost finished.   Someone needs to tell them that the doors should LOCK at 2:30, but not to expect everyone to scram if they are having a meal. I will never go back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aPhwq_YYD1uCO3Q1mSlzcQ"
  },
  "loMAAKEUfzetuAq70vzu3g": {
    "date": "12/7/2008",
    "text": "I've seen many reviews of this place, I finally have gotten the opportunity to go!  My friend and I were lucky to not be plauged by the iffy service I've heard about in other reviews.  We were greeted quickly, and served VERY quickly.  I can't remember the names of them, but for some reason I remember the number of the items -- one being 44, which was shrimp with veggies and coconut milk.  It was great -- the veggies were crunchy, the shrimp weren't rubbery (but maybe too few of them).  It had wonderful flavor.  I would definitely get it again.  The other dish was 35, which was chicken with peppers, onions, and cashews.  It was wonderful too -- the veggies were nice and chunky, the chicken was tender, and the cashews were a nice additional texture.  One of my few complaints is that soft drinks are served in a can.  Come on people, it's Phoenix!  It's hot and dry, and we're thirsty, dammit!!!!!  Pony up the $$$ and get a fountain!  Also, we ordered the food medium, and it really wasn't that spicy.  The last time I went to La's Thai and ordered medium, my taste buds were slashed and burned -- not so at Thai Lahna.    I will definitely go back -- but order my food a bit spicier next time!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "oVohybumtEwNI_fL60r0uA"
  },
  "kW8OUrBvCfMQoCOJQ47pMg": {
    "date": "10/2/2018",
    "text": "Love this place.  Decor has not been touched in eons, but it is clean and the food is great.  In a Phoenix-funky old strip mall on Indian School.  Can't figure out what one person is complaining about saying it is not Thai.  They cook the way Thai people do in their homes, not like cookie cutter places.  Tom Kga Gai is served in flaming cauldron with floating spices so your 2nd and 3rd cups are even more flavorful than the first.  Vegetables in house made chili sauce are addictive.  Panang curry is velvety and flavorful with added spices and coconut milk.  Pad See Ew was nice and salty/ savory.  Everything is made fresh, so when the place gets full, imagine they have to hustle.  One of our run away favs!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fZ7rx2Wwkx3jfUUx-eMdDw"
  },
  "0IMXgW-PXDDbmv0QFdlbaw": {
    "date": "8/25/2017",
    "text": "I come here about once a month at least. Whenever I have a craving for some good spicy Asian food. The staff is very friendly, especially if you are not sure what to order. They have no problem taking a moment to explain the items to you. I'm impressed with how well they recognize me as well.   The decor is very nice as well. Comfy booths and chairs. Thai art and decorations. It is a very relaxing place to grab lunch, dinner, or take a date.  I typically am nervous to try seafood in arizona, but their shrimp is pretty damn good! So don't sweat it, unless it's super spicy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rB99PjVzRf6FR0RV0BcT8g"
  },
  "AQJJCNoQb8WBMWcdqGEXog": {
    "date": "11/24/2015",
    "text": "I could seriously eat here every day! I have been coming to Thai Lahna since I was young and the Pad Thai is always a must (comes with chicken AND shrimp)! This last time we went, I ordered the Tohm Khah Kai soup (add a side of rice) and it was literally out of this world. The best part was that it came flaming! {Great for Yelp photos! ;)} My boyfriend and I were practically drinking the bowl by the time we were done. It is definitely enough for 2-4 to share before your main meal. It is the BEST dish on a cool winter evening! Since Thai Lahna is only a bike ride from my house, I will 100% be back soon!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "MOu_yEwGQfV7KconNGrgxQ",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States. Pad Thai with chicken and shrimp!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MOu_yEwGQfV7KconNGrgxQ/o.jpg"
      },
      {
        "img_id": "oCisSgb086f2jx07KQtIrg",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States. Tohm Khah Kai Soup (Add a side of rice!)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oCisSgb086f2jx07KQtIrg/o.jpg"
      }
    ],
    "user_id": "e6iCOIhtupBCiw-VwBvJ4A"
  },
  "JmMHczUTPOmgnEEaWFEkQA": {
    "date": "8/9/2018",
    "text": "This was probably the best yellow curry I've had in a long time. My friends and I ordered the yellow curry shrimp at a level 3 spice and it was fantastic. The only downside is they don't serve brown rice, everything else was perfect",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MUzkeKnrsmgaWTgPzbWaRw"
  },
  "KxGEdVzsyUlMqgpLkpB1pQ": {
    "date": "11/5/2017",
    "text": "I like this place more than most other Thai places in town. It's usually not too crowded and so the service is usually pretty good if you're dining in. The vegetarian Tohm Khah Phahk is really yummy. The pad thai is super garlicky and more flavorful/less sweet and ketchupy than some places make it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BL4N8daNUj3LlE93Cjsh7g"
  },
  "F4bB8fuvxHbhVwbWsRsVXA": {
    "date": "5/15/2017",
    "text": "We stopped by for dinner this weekend with some friends and had a good experience.  We hadn't been to Thai Lahna in well over 10 years and thought we should try it again.  We shared the egg rolls to start - beware of the spicy mustard...just a little will do, but definitely worth it to clean out your sinuses.  I had the panang curry with pork as my entree and ordered it mild...lucky I did as it seemed more like medium than mild to me.  One of my friends also ordered the yellow curry mild and it was almost uncomfortable for him.  Overall the food is great, the prices are reasonable and the service is decent.  Definitely a good \"go to\" for consistent and flavorful Thai food in the Valley.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "cMEtAiW60I5wE_vLfTxoJQ"
  },
  "WqRObbMXcuVa9WPslknIgw": {
    "date": "11/9/2017",
    "text": "Ordered to go. Service was friendly. Pad Thai was on point. Looking forward to trying more dishes next time im in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2VhVWgmjlJ0V9S9V0S3buA"
  },
  "1neRzL3MkG83Pq7C4BnsbQ": {
    "date": "8/21/2018",
    "text": "I never write reviews but people need to be warned. I eat a lot of Thai food and years ago Thai Lahna was the best. I ordered carry-out tonight, the shrimp appetizer and Thom Yahm Khai. We took one bite of the soup and spit it out. It was beyond salty and was sour like it was made last week and they we're still serving it, the fresh herbs were even brown. We eat this soup at least 3 times a month from other places so it's not like we just didn't like it, it was just that bad. I opened the shrimp and my daughter who loves shrimp immediately noticed the strong odor of bad shrimp and ran to the restroom. We immediately took it to the trash outside. I am wondering if they changed hands because the original owners used to pride themselves on serving good food. If I just didn't like the food I wouldn't write a review, I would just not eat their again. If you're going to serve me food that is beyond it's expiration date then people should be warned!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eSdBXNwm50Ifcdtu7GnsDA"
  },
  "8CAxXPACVR_BSAsfMxeXzA": {
    "date": "5/10/2016",
    "text": "LIFE IS TOO SHORT TO EAT BAD THAI FOOD! Nothing in the dishes we were served resembled fresh. Everything was over cooked and mushy. The predominant flavor was salt which really brought out the musty taste of canned bamboo shoots.  Our server triggered all my abandonment issues.  The reason I gave two stars, not one, is because the place is clean. I appreciate clean.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "RFOfmFefmpl-o1QJsPCcwA"
  },
  "mw-q3_zwukRMt2laCWr7hg": {
    "date": "10/14/2017",
    "text": "I ordered chicken pad Thai and the food was delicious but The service was less than. I ordered something to go and the lady at front helped two other people when I had been waiting already. I ordered to go and she barely acknowledged me. She didn't even tell me she'd be wish me soon just kept tapping away at the register for a few minutes then finally took my order. Wouldn't go here again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9k-HIKhAhmzO3tYIJtu_fw"
  },
  "ZJOrtcb5jrMEEcZH01SfJA": {
    "date": "3/1/2016",
    "text": "Maybe don't treat your loyal customers like crap when your food is mediocre to begin with. I've been coming here out of convenience for years, since there's only one other Thai option in the area. Went to place a phone order today and the woman taking my order was seriously annoyed with me, kept cutting me off as I was trying to tell her which items I would like (a simple lunch order, nothing complicated) and she then hung up on me as I was mid sentence. Rude! I guess you don't need the business, as I ended up getting lunch from Sa Bai instead.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 10,
      "cool": 1
    },
    "photos": [],
    "user_id": "QG9ZJatKSWj5p5VrW3cfMA"
  },
  "Dhn1TsEZIJSnAAD9TfkRaQ": {
    "date": "7/8/2016",
    "text": "I lived in the valley and used to eat at Thai Lahna before moving away. Now that I'm back I've eaten here a couple of times again. I called to place a to go order and it was 4:45pm I was told to call back at 5pm... Which I did.. Very specific with my order as I always am..Pad Thai, no egg, no shrimp, extra spicy, extra bean sprouts. I was told my order would be ready to go within 20 minutes. Showed up to pick up my food, within said amount of time. When I went to pay the waitress was going to give me someone else's order..no big deal...Then she asks again what I ordered.. I shared with her.. she said you didn't say no egg... extremely argumentative she was.. I told her I did tell her no egg, no shrimp two times..She said they would remake and it would be another 20 minutes...I waited 30 minutes  Pros Food is pretty tasty especially for take out  reasonably priced  good location  Cons  Rude waitress (middle aged Latina with blonde/copper hair) ~ the other Latina waitress is so friendly and nice $1 extra for hot sauce... after this ordeal.... you have to be kidding me",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "s2zQPdqXpIF1pMSbnLu62Q"
  },
  "nn2SWiy6M8uhYyD_aY_PVw": {
    "date": "11/6/2017",
    "text": "This is my \"go to\" for great Thai food in the ARCADIA area.  All of my orders have been take out so far but plan to dine in when the time calls. They are fast, no nonsense and always on time. The food is outstanding as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WARqoIrnX4UoJ9oKvrc6tg"
  },
  "fTzK7UQrcp4dlZbtaXwkcw": {
    "date": "5/7/2018",
    "text": "Went here after work with my kids. Didn't seem too busy. Somewhat felt like I was rushed to order only to be told that I couldn't just order pineapple fried rice with just chicken. Weird. Ok. Order our drinks and it was awhile before we even got them. The 1 server was running around taking orders, cashing out pick ups and helping others. I felt bad but why not ask for help? Food was ok, but my daughter had ordered mango sticky rice to once again be told she couldn't only get the rice. I don't know what's so hard about not adding certain things but overall the service was slow and the food was just ok.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "39WqhGxNUa18fJvmCy3MjQ"
  },
  "EjhupBXiSLIh_mGjpCP6Qw": {
    "date": "3/24/2018",
    "text": "I'd give 1/2 Star if I could. We decided to come here because the wait was so long at another restaurant. Maybe not the best decision, one server was working and was playing busboy, server and cashier. We finally were sat and then waited 25 minutes while we watched people leaving because no one was taking orders. 51 mins after I asked our order be taken, our food arrived (and while we waited we watched a party of six and four get up and leave because no one came to their table, guessing they let at least $200 of business just walk out)! Not sure if they were short staffed or what, but when our food arrived the lady said she was sorry but nothing more. I ordered sweet and sour tofu since I eat vegan and it was ok, there could have been more sauce and one would think it would have come out of the kitchen hot but was semi warm. My husbands dish was a veggie noodle (can't remember the menu name) and our friend ordered pad thai. Nothing to write home about. All in all, very disappointing, there were no explanations as to why service was so horrible and the server acted as if she didn't care so we won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9PO_R8F0SfyDjkejHPuknQ"
  },
  "Ex16G3RQNc3VTanLYuj_wQ": {
    "date": "9/1/2017",
    "text": "Pretty hit or miss depending on the day of the week. Massive selection of apps and dishes. I normally order from specialties. The tom kha soup is spicy and tasty.   The service is mediocre at best. Also, their website is defunct which makes carry out ordering difficult without seeing the full menu. The people who take call in orders don't speak English well. When calling in know the item number and don't dare attempt to pronounce the Thai name. They will hang up on you. True story.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b3rH3XTbbQ5AsCBowYgAEQ"
  },
  "_KAG8hZxpw5uTWbC1kJJEQ": {
    "date": "1/19/2015",
    "text": "The food is not terrible but it is also nothing to write home about either. I know that others had bad customer service I cannot say that was True for us. Usually Thai food has so much flavor and normally we cannot get enough, however these dishes were more like bland and very limited in any real flavor at all. I will say the sweet chili sauce was good which was a relief so we could add I to make some flavor. Chicken Satay was underwhelming. We had fried rice was good avoid pork however the shrimp were pretty good. We also had BBQ chicken which was not terrible and came to the table flaming that was nice however very limited on flavor again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oZ6I6Ff7lWCXVZ9eXLu81A",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oZ6I6Ff7lWCXVZ9eXLu81A/o.jpg"
      }
    ],
    "user_id": "9PZKQuLC5lUs0rJBbWOvjg"
  },
  "AuajyAgwDGVsVc5quNO0LQ": {
    "date": "7/24/2014",
    "text": "Delicious food, affordable pricing with decor from half way around the world. This is a definite must if you want authentic Thai cuisine.  The Green Curry was right up my alley. The Combination Seafood Soup is excellent , quite large and easily shared. Soups are served with flame shooting up thru the middle. It's quite impressive and keeps everything warm. Be sure to order a side of rice to accompany the soup.   Wontons (Kiaw Krohb) are served with a smaller than average pork. This is great for folks who enjoy the crispiness of a the fried wonton wrapping. (I personally would like more pork, but, that's just me.)  Booths line the wall with 4-top tables down the middle. Service is with a smile. However, they may be a bit strapped in coverage. But they're so gosh darn nice it doesn't matter :)",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "uNEh2rYBFesdCNefLeKknw",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States. Seafood soup!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uNEh2rYBFesdCNefLeKknw/o.jpg"
      },
      {
        "img_id": "XKiNFh8UIjtLg0Nh8jpejg",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States. Wontons!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XKiNFh8UIjtLg0Nh8jpejg/o.jpg"
      },
      {
        "img_id": "MPFz1ERaJuj3_5w_Yg0hrg",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MPFz1ERaJuj3_5w_Yg0hrg/o.jpg"
      }
    ],
    "user_id": "EJ7ZhRHsMWj8du77LX34gw"
  },
  "ziSevxBRgAEW0zvlhseziQ": {
    "date": "5/7/2016",
    "text": "Quoted 30 mins for our take out...an hour later we finally have our food.  Worst place ever!Food was gross!Stay away!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LFBb8k1DTEcN83TZmNfzRA"
  },
  "9wZSxk4SOSVje8uq-aW7ag": {
    "date": "5/31/2016",
    "text": "Finally, an amazing Pad Thai, made with chicken AND shrimp! Great Red Chicken curry too, my mouth waters and my nose runs from great spices!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tmvdZHf5bptjzuggvS5PAw",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States. We love red chicken curry &amp;amp; Phat thai!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tmvdZHf5bptjzuggvS5PAw/o.jpg"
      }
    ],
    "user_id": "GowYMkTI6z_9Ds3oTX1b7Q"
  },
  "nIRs5Fm4G_2nD3GIIvue3g": {
    "date": "9/25/2013",
    "text": "I have been a customer of Thai Lahna for 12 years.  The service I have received on my last three visits has been so bad, I now pledge to never return.  I don't make this decision lightly because they have pretty good food.  Last night I placed an order to go and was told it would be ready in 20 minutes.  I arrived 25 minutes later and was told it would be ready in another 10 minutes.  After waiting another 30 minutes (a total of 55 minutes since I had placed the order), I asked to see the manager who had been in the kitchen this whole time.  I was told she would be right out.  I stood there at the cash register another 10 minutes; no manager.  I asked again to see the manager (my food order was still not ready).  From the kitchen I heard \"Tell him I am too busy!\"  That was the last straw.  I asked for a refund on my credit card.  Instead of a refund, they charged my card a second time.  While she was fixing that, my order finally came out.  I told them to keep the food and give me my money, which they finally did.  This is a place where management has completely lost touch with what service is all about.  The girl at the counter was trying desperately to help me.  If the manager had put forth even a half effort, I might have been able to shrug it off.  Her total dismissal of the customer prompts me to take my business elsewhere.  I would encourage you to do likewise.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Ek87fStJ5ikghMOJbXbmA"
  },
  "cjrb_iANHD60OTdFbZadlw": {
    "date": "6/21/2011",
    "text": "I've been coming here for years and they seem to have gone downhill.  Food tends to be a bit too salty, and the last time I went I requested medium spicy and it came out nuclear.  I still like the place but they seem to have lost their consistency and culinary rigor.  Service tends to be a bit slow but that's nothing new.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YQuiNRqQnjkOSX_VSbjOFA"
  },
  "GIJOcUw8E-tEaH_G7R2HVQ": {
    "date": "6/12/2008",
    "text": "I I was very surprised at the quality of the food and the taste.  I absolutely LOVED their red curry.  The coconut milk was light w/o the digusting chunks that you see so much at bad thai restaurants.  The vegetables were fresh and crisp and chicken dry yet tasty!  I can't give this place more than 3 stars however because when I asked for soft tofu in the curry they said they don't do that, they can only offer fried tofu.  It was so so absurd that I was just so stunned, so I asked \"well ok...how about giving me the tofu that you use BEFORE you fry it\". She said well we don't do that.  lol...it was so OBNOXIOUS because I have gotten soft tofu at every Thai restaurant I've gone too on west coast and east coast and even at the THAI TEMPLE IN LA!!!!  Gimme a break.  The last thing I wanted to mention was that service is very very very minimal which is fine with me.  But I did see a couple wait over 15 minutes for someone to come take their order and they were so fed up they got up and left.  The workers there didn't even bother to go after them and apologize.    I doubt I'll be back.  Way too many good places to try.  Too bad because I really like their flavoring and spices.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "-KzxlotDy9GQ40dRRCGHkQ"
  },
  "7GM0FH_EwwBTUE-67_MN-Q": {
    "date": "12/13/2007",
    "text": "Thai Lahna is destined to become my answer to \"I'm hungry, I'm tired, and I'm afraid to open the fridge because I know it is full of take-out boxes dating back to August '07.\"  You think I'm joking.  I wish I was.  But I digress.  TL is that DL (as in \"down-low\") kind of place where you can just sit and decompress over a warm plate of food at the end of the day.  The hot tea is good.  Make sure to try it.  As for food...  I can only talk in generalities because unfamiliar foreign words I can't pronounce just don't stick in my brain.  So, here we go, the spicy soup made with the coconut broth is fantastic.  And the curry dishes are very good as well.  I've tried something described as being made with a \"light gravy\".  I don't recommend that.  The menu is overwhelmingly large, so it's going to take me a while to work through it.  I will report back my fave at some undetermined point in the future.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "ExI15M-oXjHcF42-G1xv9w"
  },
  "gFj1DTmgrWqp6jfg5oAl7Q": {
    "date": "1/30/2009",
    "text": "In part, my five stars go out as a thank you.  This is the first Thai place I found in the valley where I left consistently happy.  Not dazzled, but happy.  I never experienced the snags in service that other reviews have mentioned, and every dish I tried was at the very least fresh-tasting and pleasant.  I always run Green Curry and Pad Thai as my first visit inquisition, and Thai Lahna aced them both.  Their Pad Thai is still very much in contention for my favorite in Phoenix.  The Green Curry has a great flavor, but lacks the array of vegetables that set a few other places apart.  So far, after over a dozen visits,  I have been very pleased with every dish I have tried, specifically remembering the coconut milk soup, yellow curry and pineapple fried rice in addition to the previously mentioned staples.  In all honesty, I probably feel a little more 4-starry about Thai Lahna, but because it made me believe there could be good Thai food here, I add the fifth for now.  Plus I need it to be ahead of Thai Rama, which sucks.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "xyBNI0UNQqLbwl9HygbM8Q"
  },
  "T0EX8WVYrB-az5iJOvjKDA": {
    "date": "8/9/2008",
    "text": "Over the course of the last three years we have been to dozens of thai restaurants, searching for something as good as what we've had in California.  I would say that this place exceeds anything we've had before anywhere.  I had the yellow curry, thai hot, and it was the best I've had.  The curry paste tasted home-made, and they cooked it truly thai hot.  This was the first place we've been to here that they actually listen and cook to the requested heat level.  I was sweating up a storm by the end of the meal, and I can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ahcfbl7w6r_1q40XNUeKYw"
  },
  "M8DimpkPT5QHsOv6DK-V3w": {
    "date": "9/20/2010",
    "text": "I admit that this restaurant is in my neighborhood and has been a mainstay for us for several years, with 2-4 visits per month with consist ant quality and yummy-tude. My personal Thai favorite dish is Tom Kah Guy soup and Thai Lahna's is the version I use to measure all other Thai places we try when we are traveling. The menu is expansive and usually the selections are top notch. We will keep going back as long as they keep the doors open. And, BTW, if you get the chance, try the pumpkin custard and Thai tea with cream.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XEtswafcW2kxSnWqB6mqQw"
  },
  "TnD-pJ47d9yvIQiuDn4xAA": {
    "date": "12/12/2018",
    "text": "Excellent for take out. To dine in, place needs to revamp inside to make it nicer. Otherwise food is good. Good prices. Good food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "JzyrxahPFwKUjNgxugyOCw"
  },
  "TRL60NisssARoTdH6GKwFQ": {
    "date": "5/25/2019",
    "text": "I don't understand how some people hates this place. The food is over the top. The staff is very nice to my family and i - especially the chef.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UR8QFsIniGbkCibtfhTM3Q"
  },
  "sJmtXMyTqWzArjmiWUoZTw": {
    "date": "1/10/2019",
    "text": "I ordered take out a few days ago and the chicken Larb was mediocre. It's just a salad so no big deal but then we ordered Angel Wings and got some squid dish. Food wasn't terrible but just an average first impression.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k6fboRNAwZ14PWk4N4AJjg"
  },
  "ISBR4c0Qvxz7t3F1haRJpg": {
    "date": "7/10/2018",
    "text": "Bad customer service. I Didn't like the dish I ordered. The sweet and sour sauce was too thick and the crab Rangoon patty had barely any filling. When I complained and asked the waitress if I could Change my dish for a different dish, she refused stating that they would take it out of her paycheck.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yxx0OUPN3eD9bQQUy4arPQ",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yxx0OUPN3eD9bQQUy4arPQ/o.jpg"
      }
    ],
    "user_id": "TrLI_oceVDcjVtFNe6JoSA"
  },
  "8xCNpRRY323y6YtqtOBmzw": {
    "date": "12/13/2018",
    "text": "Hands down the best Thai food in the area. Green beans are the bomb! Definitely try them. The staff is also fantastic, very friendly and it's family owned!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3W8XO1hFeaEDpsDiU2DCmw"
  },
  "ktyiuSdRsabxEz1h3hgF2w": {
    "date": "4/18/2019",
    "text": "this place has gone down hill.  We had a group of 6 of us for an early dinner at 6.  mid week.  We were the only people in there and we were rushed and the waitress acted put out and rude.  The food was very mediocre and one of the entrees came 15 min after everyone elses.  We won't be going back :(",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xZhXsWrEasgSsFBmxEhXGg"
  },
  "SoP0fY41y6nuDSDPhPEHeg": {
    "date": "4/19/2018",
    "text": "I absolutely love LOVE love this place. Great little family owned spot with a warm and friendly staff and amazing Thai food. Make sure you try the chicken satay and the beef lahb as appetizers. For soup, 15A combination seafood, the lemongrass base is a delight for your taste buds and every dish can be made to your specific spice level preference. Make sure that you have the coconut ice cream for dessert, it melts in your mouth. Simply wonderful!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dY3E005qpiOKn41ZUILeCQ",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dY3E005qpiOKn41ZUILeCQ/o.jpg"
      }
    ],
    "user_id": "U_lyi_9_7s-ioYl76C5Ojw"
  },
  "a1XWpHEdUYns-ttnX2gm2w": {
    "date": "7/25/2017",
    "text": "Pad se ew, beef.  Walked in, placed a to go order. Asked for it to be mild.  I got my food.  Got back to work and it's definitely at least a medium.  There's the makings of a whole jalapeno in there and so much powered pepper.  The food isn't good enough to go back.  And to be clear, I don't mind spice, but I prefer my pad se ew mild because of the sweet brown soy sauce on the noodles.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6CUBlX1aNUv2Rhle-7LX0A",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States. Had to pick out a sliced jalopeno in my mild pad sew ew.  I&amp;#39;ve never had jalapeños in this and the menu doesn&amp;#39;t state jalapeños either.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6CUBlX1aNUv2Rhle-7LX0A/o.jpg"
      },
      {
        "img_id": "XIPdG8euZgjGMPT1GXOFiA",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States. Pad se ew with beef",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XIPdG8euZgjGMPT1GXOFiA/o.jpg"
      }
    ],
    "user_id": "ZjaNE5PtYk8j2K1kOpr2Ig"
  },
  "cAzbadjkeP1z0QWmqNOtoA": {
    "date": "1/16/2018",
    "text": "Recommend this place from Beer & Wine Saloon next door. So far Excellent has been here for 35 years WOW!  The chicken satay was outstanding with peanut sauce and cucumber salad.  #54 Pad Thai (Phakt Thai) looks amazing and it does not disappoint.  You can season it how hot you like.  Definitely coming back with friends!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "q0ZnUSb8uCcMCvLfJkDFEA",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/q0ZnUSb8uCcMCvLfJkDFEA/o.jpg"
      }
    ],
    "user_id": "cVxew5-_pz2XEIGFj4-Szg"
  },
  "hvFLZyeC282Z8ujesusY9Q": {
    "date": "3/6/2018",
    "text": "I love thai soup and Thai Lahna has the best Tohm Khah Kai. I have tried at least 5 other thai restaurants in the Phoenix area and this is by far the best.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eoHoJv3hjGhDrotdH6T2Sw",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eoHoJv3hjGhDrotdH6T2Sw/o.jpg"
      }
    ],
    "user_id": "F3rlOC50zOwwbEpkczrUSg"
  },
  "lu3lyCbL1igHfmU9DMGtog": {
    "date": "6/13/2018",
    "text": "If you're tired, don't feel like cooking or just plain drunk then order from here. The food is eh okay from the low quality ingredients used while still meeting Thai cravings.   After eating here multiple times, I absolutely WOULD NOT recommend dining in - unless you're okay with never getting service or help from either of the two ladies always working.   Here's my main problem: The menu prices are increased from what is both printed and found online AND item description are not the same.  For example: I ordered the pork egg rolls ($4.95), which are no longer made with PORK (and now $5.75)... something I was told only after bringing them back. The woman working laughed awkwardly as if caught in a lie when I asked if there was a mistake but thankfully the owner refunded the amount to me - which was less than the amount paid because for some reason they charge excess \"tax\" on items.   Don't believe me? Check your handwritten receipt and find out how much you were charged for tax. You will see at least $1-$2 above AZ tax rates... 1 star rating for unethical business practices.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HQZf7uP16049NBpQcedbUg"
  },
  "1pNRdxoJPWEkjtdm-vn3ww": {
    "date": "1/5/2018",
    "text": "I've been dining here for years, I really love several things about this place. 1.) When you walk thru the front door you notice the proudly displayed food grade reports, I'm all about the A's... 2.) The waitress has worked here since my first visit, and she always has a polite smile and friendly attitude. 3.) The chef is reliably consistant and True old school, he peals the shrimp for all the dishes. The only un-etible part left is two tail fins!! I always get #14 off the lunch menu 'phat phet kang kai' spelling? Carrots, green pepper, curry, coconut milk, chili peppers, chicken, shrimp.... words cannot justly describe the yum factor on this dish. My only complaint is the owner shuts the place down for a month to visit his Thailand every summer...i will keep coming back as long as he does!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nrlR-nNkZSr5tbw5zv5niw"
  },
  "X0n4-UXeA6rwgpHSTUXGtQ": {
    "date": "8/14/2018",
    "text": "My favorite restaurant, have not had better Thai iced tea and yellow curry ever in my life. Try the sausage salad it's something you don't see anywhere. End the great meal with coconut ice cream!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GMND9Gnd8KyEVDZDmriB1Q"
  },
  "7o1GzmsZSGavYHdUw487vQ": {
    "date": "6/9/2018",
    "text": "Wow, what a total disappointment and waste of $30. I rarely complain or put up a bad review but this warrants it. Worst red curry I've ever eaten. Tasted more like chicken stock and was a greasy watered down coconut milk with no Thai flavor. The Pad Thai was a bit more edible but I've had better frozen box Pad Thai. I ate here several years ago and it was good. Don't know what happened but I will never be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N_CgPQZH5YaBfY3dTfi-Jw"
  },
  "j2dASmG9aG9h8OQ6FrTRiA": {
    "date": "1/14/2019",
    "text": "Penang is great but whoooaaaaa!!! I paid about $6 for a large Thai ice tea. Definitely the most expensive Thai ice tea I have ever purchased and nothing special about it. It wasn't even that big.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hWsStEpgcperRhxjcX-8nw"
  },
  "UC5LBqeJ8cXJWOKbmyHr3g": {
    "date": "6/4/2016",
    "text": "Mmmmmmmm Thai Hot!    The owner/chef (husband) is so sweet. He usually comes out to check on who orders it sooo hot & looks amazed haha!!    And the little waitress, Marada, is adorably awesome!! She always remember my faves & takes care of me!  Whether I'm in a rush or just taking my time; they are always very gracious & professional.   It's a quaint little place with lots of regular customers.  Even the customers are great:  I asked one of them what they ordered since it smelled so good & she was offering me a taste of her dish. Sooooo sweet!  Something I have done as well but it's great when there are others willing to share the YUMMINESS!!!    FYI:  they are closed between 230-5, Mon-Fri. Only open for dinner on Saturday. Closed Sunday/holidays.",
    "rating": 5,
    "rated": {
      "funny": 6,
      "useful": 6,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "lZe4a6EXwQBn2HHuSdR82Q",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States. Yummmmm lol",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lZe4a6EXwQBn2HHuSdR82Q/o.jpg"
      },
      {
        "img_id": "BLu_gsr4T98xgRS1dIKEcg",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States. The staff is sooo sweet, especially Marada, because she always remembers my faves &amp;amp; Thai hot: #36 today",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BLu_gsr4T98xgRS1dIKEcg/o.jpg"
      }
    ],
    "user_id": "zFp22UYxTFPmyFDjkSy7FQ"
  },
  "_tNIf0JDJyJljWF0Tke1oA": {
    "date": "12/8/2018",
    "text": "Friendly, but terrible service and food that seemed anything but fresh and high quality. My chicken and veggie stir fry was 90% onions and half cold. My date's food was forgotten and came out 15 minutes after mine. Cups and plates were covered in water marks and tiny stains. I had heard such good things. Very disappointed!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vEyjjb8zfubhGFCMp6Exow"
  },
  "86kyv_Hi4VwEcVIzWT4qDQ": {
    "date": "10/4/2017",
    "text": "Love this little Thai restaurant near Arcadia. Friendly service and you can't beat the food. It's been a staple of ours for many many years. Try the number 14 soup! Delicious!!! You can't do wrong with anything on the menu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AnafqSKkHQ7hEGzQtitHlg",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AnafqSKkHQ7hEGzQtitHlg/o.jpg"
      }
    ],
    "user_id": "b1Y35DPYKgVLf3XnlXMBaA"
  },
  "PZG1k1bXRWrlHvOWOMYTvw": {
    "date": "2/27/2018",
    "text": "Really good food, very comforting, and the ambiance is really lovely. Most restaurants look plain or ugly but his place really had a sense of calmness and beauty. The service was nice and fast and I was happy to have leftovers for the next day!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SpORIkmTMNDxixFOcIE8cA"
  },
  "OePA07o23NJG_Wg2iuBbww": {
    "date": "8/21/2017",
    "text": "Delicious food! The service is kind of slow so don't come here if you are looking to get in and out quickly.   Lunch special #11 Great.  Comes with a small cup of tasty soup!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TPZbqNXMA2xMXLLd1zL_0A"
  },
  "UV16wl36nFiMQEXIlsFVng": {
    "date": "9/16/2009",
    "text": "When it comes to Asian style privately owned restaurants, most of them run into each other for me. Thai Lahna, on the contrary, is in a league of it's own. The scene is what any would expect, and the service is curt, but the food is what you're coming for, right? The portions are generous, with no shortage of protein. The sauces are so far above average, it makes the entrees at other local restaurants taste like happy meals. I'm not kidding here, if they only offered their sauces over rice I would still go as much as possible. But let's not detract from the content, all ingredients are cooked to perfection. The bamboo shoots have never been too firm. The chicken has never been too tough. The scallions never wilted.  Down sides: table-side manner (servers are all about the business here), only canned sodas, long wait when it's busy (but it's hard to hate on a place that is too busy), how full you are for hours after leaving... ENJOY!!!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "X0YNdFWGSEUgONUKfiOPqw"
  },
  "vdCnv7LIc1Ewo07KqCexTw": {
    "date": "9/5/2010",
    "text": "I'm a fan of the joint - but like my friend quoted on her review, I'm disappointed in the amount of vegetables you receive in your meal. The green curry was AWESOME - but it only came with bamboo shoots and green beans. Next time I'm going to ask for extra veggies and see what happens, but even if it's just extra green beans, I'm happy with their curry. My date had their pad thai and it looked great. Yes, there are better thai food places out there (Wild Thaiger has impressive plating and food with lots of veggies), but this one is pretty close to me, and easy to get take out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_h7MvLhBZ3Tzu8wktuKlGA"
  },
  "kTzXnrC4Yz1pzTbAKqYqAw": {
    "date": "1/19/2009",
    "text": "Not too bad.  Seems just like basic Thai food. Been here a few times and tried about 6 dishes.  All were good but not \"oh my gawd\" good.  The shrimp dish was good I remember that.  The iced tea is gross, get something else to drink.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "HtCPdVujYJAZF4FKr-C9Lg"
  },
  "mW8yb-4rYpFr0c5a2yROew": {
    "date": "1/12/2006",
    "text": "Cute place for consistent neighborhood Thai. They handle all the usual suspects quite well, and the thohd mahn (fish cake) and yahm neua nahm tohk (spicy beef salad) are super.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "mM2lXZF7srcZ1FaPx8L7uw"
  },
  "UI2I86Tpf1kiBMilOs-JtA": {
    "date": "7/8/2010",
    "text": "I love the decor and ambiance of the restaurant. I ordered a spicy dish and it's so good. Mmmmm",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ARD0462wLtliY5PJXay0Q"
  },
  "6A0dtUws5jQvSMWquErVOA": {
    "date": "9/16/2010",
    "text": "I have been here 3 times.  The first two times the food was good and everyone was nice.  It's a little dirty and dark in the dining room, but I don't mind an old divey place if the food is good.  Yesterday I went there with a colleague for lunch and they brought us water.  We waited for 15 minutes for the server and then left and went to Pei Wei instead because there were 3 other tables waiting for the server when we got there.  And they weren't that busy.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xde2rO3XVt0Do8kLRIt2Dw"
  },
  "0YZaH21E3Xj09wE8xxCBjg": {
    "date": "6/12/2012",
    "text": "I've been eating here for at least 15 years. And I must say its probably the only thai restaurant in the phoenix area that I will always return to. The food is tasty and consistent. I've tried many of the surrounding thai restaurants and most of them leave a lot to be desired. Thai Lana makes really good food. I recommend. Shrimp with chillis and mint I think is number 45 or 46 its tastey and I usually ask for one notch below thai hot so its hot but not so hot. Also I recommend the yellow or red curry. Coconut flavour and never watery just the rite amount coconut and spice. The portions are addiquete. I usually oder these two plates and invariably I always have some ledt over to take home.  A friend that is very much a steak and potatoes guy. He dosent care much at all for thai food. He really likes thai lana. In fact its been his suggestion that we dine here on our two most recent visits. The ony con I can think of is that they don't have brown rice. If they had brown rice I would give them 5 stars",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rXkDEUaVzYrg_kZqn0H_rQ"
  },
  "QUqaT5Hl1H3EoGq1d0MneA": {
    "date": "9/29/2008",
    "text": "I really like Thai Lahna. The food is good and the restaurant is close to my house. Unfortunately, it's closed on Mondays and I always seem to crave Thai food on Mondays...weird.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8cf5U6sCwYPKDKyLfSi6Ig"
  },
  "R7HKAwGqU-0ZEFWLBB4e0A": {
    "date": "4/5/2010",
    "text": "Typical strip mall restaurant. Not very pleasing on the eyes. One person on the staff is super nice the rest haven't found what they are good at in life just yet. The good part is the food. The lunch #7 w/ beef and Thai spicy is where its at. Under 10 bucks with a tip. You get a small soup, egg roll, won ton, rice, along with red curry green beans, beef, all on top of white rice. Its usually an excellent meal. I have been disappointed a couple of times on them holding back the heat and meat. When I say Thai spicy I expect it to be very hot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DPitNu466172os6m0Yri1Q"
  },
  "oc9VSfc8GT4cSpCsZ0m0sw": {
    "date": "6/30/2008",
    "text": "This place lacks in atmosphere, but makes for it in price, location, and great food!!!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "o4gaI4EdzxJ9Al4houpusw"
  },
  "2MuvCizESIpLqK-SuRA0JA": {
    "date": "8/16/2011",
    "text": "Do not waste your time and money. There are other good Thai places in town where friendly service and delicious food are standard. Went here today and the service was abysmal - the food uninspired. The music was so loud we asked for it to be turned down and the server just raised her eyebrows. She turned it down and then five minutes later it was turned up. The waitress was rude and I could have whipped up a tastier sesame chicken in my own kitchen without a hefty price tag. Do yourself a favor and eat at Sai Ba or Malee's!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IEk-gu_r06SL9144PMmcVA"
  },
  "RRQfGvj_qDimwuxMguRHHA": {
    "date": "1/8/2012",
    "text": "This is the best Thai restaurant in Phoenix. The food is authentic Thai and delicous. The prices are good and the portions are good sized. The yellow curry is fantastic, as is the whole chicken. My husband and I are consistent customers, we go to celebrate anniversaries and birthdays and have always had good service. l always enjoy the food and will always go back. Too bad not open on Sundays. I highly recommend this restaurant for excellent Thai food.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kz1G4pFqmdSUspZo-EWOxA"
  },
  "6yu2BDSIJI3vNHQfTcBO4A": {
    "date": "9/6/2009",
    "text": "I love Thai food. And I like it hot. Thai Lahna wraps these two expectations up in a perfect package. It's the most authentic Thai food in the Valley!  Like so many culinary jewels in the Valley, the restaurant is nestled in a strip mall between a tanning salon and a yoga studio. The tables are covered in the same silks that I brought back with me from my own Thailand adventure and the staff is super friendly.   I am addicted to the hot and sour soup with chicken. It's served piping hot with tons of vegies and even more flavor. I always choose the lemon grass flavor, but I'm sure the coconut one is equally delectable. The Green Curry (#71) is also a favorite because I'm a big fan of bamboo shoots. I usually get it with chicken. I also love the #55 (which I can't actually pronounce, yet alone spell) with beef.    For lunch, the #6 will change your life. I like it with chicken and a TALL glass of water. I always order is spicy but for the faint of heart I would recommend going with the mild version.   I generally order takeout but dining in is also a fun experience. I have not had one bad meal here and the price point is right on! Take a group of friends and have fun!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0ogESd8pNHuFz0wl0SuIoQ"
  },
  "jeIBUYfSfrhrEPuHEF1Qiw": {
    "date": "11/9/2008",
    "text": "Still going strong after all these years and rightly so, Thai Lana rocks it every time.  Great food, fast courteous service, and mom-and-pop ambiance.  You really can't go wrong with any of the food here, but I especially love all of their curry dishes.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "M8Gtdxk23L4ztJpb7hPw1w"
  },
  "y3Ak_T_vUNu1ClkeWOg33Q": {
    "date": "6/23/2012",
    "text": "Food was good, service a bit slow. I forgot my American Express card there and the next day got calls from the Amex office about suspicious activity on my card and sure enough some one was using it to buy goods from a Disney store in DC. I mentioned it to the owner but she said it couldn't possibly be any one from her place. her only concern was if their charge had gone through before I cut off the card.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wzUDVxl3x_91RRC-VE3Sjg"
  },
  "9plAtlrI5UCfWv_43nBhIQ": {
    "date": "3/28/2007",
    "text": "Great Thai cuisine prepared by a family staff in nice surroundings. The best Thai in our neighborhood, maybe even in this part of Phoenix. Parking is easy and convenient. Call first if you don't know the schedule as they go back to Thailand now and then for visits.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xy6i8OxC2Sos7ZUPmNjxwQ"
  },
  "uMzEXWYkagxXOetVjxB5wg": {
    "date": "4/20/2010",
    "text": "This place has such good food.  The Thai curry is great.  Only issue, you have to ask the wait staff to fill up your water or drinks as they must think that Arizona is scarce with water.  I would give them a 5 star but I just can't because of the waitstaff.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RLWABq0_VVtfab5rhh-JNA"
  },
  "oC0rybVqSF7FBRhUdOjeyQ": {
    "date": "4/23/2011",
    "text": "So... I went to this place off of word of mouth for goo thai food. I took my 2 sisters and a friend. Tea was really good so I thought we were off to a good start.  My sister started off with cabbage raps that were over salted and not good. We all placed an order for different things so that we can get a feel for the restaurant. I ordered a noodle dish.... they brought me a rice dish. I was trying to tell the waiter that the dish was wrong and they were very rude and would not help me at all. I attempted to waive down another waiter and asked for a manager and they told me that he would not come out. After that My 9 months pregnant sister was served her sweet chicken.. (now keep in mind she is a little less patience then normal in this last month so not so easy to please).. gets her food and it was cold and bland and dry. She asked for them to fix it and got push back so then asked if can then order something else. The waitress said yes and then took the order. 15 Min goes by and she asked what was the eta of her food and the waitress said that they manager told her that she sent her food back and that he was not making her anything else....... Crazy right! SHE WAS VERY UPSET, NOT ONLY DID THEY SAY THAT THEY WOULD BUT THEN THEY DIDNT EVEN TELL HER THAT THEY WERE NOT GOING TO BRING HER ANYTHING ELSE.  We asked to speak to a manager and then he came out from the kitchen and yelled at us to get out and leave that he will no longer serve us.   I don't care how good the food is....THIS PLACE HAS THE WORST CUSTOMER SERVICE THAT I HAVE EVER SEEN. I HAVE WORKED FOR RESTURANTS AND HAVE NEVER HAD PEOPLE TREAT THERE CUSTOMERS THIS WAY!!!!!!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7sZwt-HFFjRXp5_a4BueIg"
  },
  "k4XYO6iRHMX2AHdmAk-NUA": {
    "date": "4/4/2012",
    "text": "Ordered lunch special at $7.95. Foods not that good, I had No.7 with Beans and meat. It seem to be missing something in flavoring. Maybe MSG or something. The meat tasted precooked but the beans was ok. The spring roll needs more fillings and more flavors. The service was ok but waitress didn't come by to ask for refill. The best part was the rice and the clear soup with strips of wonton.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lgCdP_uWbFoy6G8WwABSqA"
  },
  "H3RymqlUv66qVeQNLASMVw": {
    "date": "10/2/2013",
    "text": "I have been going to Thai Lahna for over 2 years for their yellow curry. It is absolutely AMAZING! (and as all of their curries are). I have tried yellow curry at almost every place in Phoenix, and it is because Thai Lahna's is best I put up with the mediocre service. I have called to place my order many times to pick up after work and been put on hold which has meant any of the following (since they don't have hold, it's just the phone being put down): 1) being hung up on 2) being left on the counter forgotten about as I've heard many people place to go orders at the desk. There is one employee that has such a piss poor attitude and looks like she hates her life, but everyone else seems great. One time I placed a pick up order with a friend of yellow curry and vegetarian yellow curry. We picked our food up and went on errands. During our errands we get a call saying they gave us the wrong order and didn't include a vegetarian and we could bring it back. We said okay, we're on errands, we will. Apparently it wasn't soon enough for them because they called us back and asked where we were. When we returned they made us show BOTH the yellow curries and took one back, which I guess is fine but every other restaurant I've ever been to would let you keep the extra, and considering we drove back, I would think this is fair. Overall, I will be going back, but only because the yellow curry can't be beat.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZigcXEaAY6JrNNS9Ci85Ew"
  },
  "saGmMMzWTbCLcryxMDbuCg": {
    "date": "8/13/2019",
    "text": "Authentic Thai. Love at first bite. Lol.  Quaint, attentive staff, hearty dishes... good for date night. I will return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xLzR8wPVcpD_p-TiQmc9ew",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xLzR8wPVcpD_p-TiQmc9ew/o.jpg"
      }
    ],
    "user_id": "5-ni6jRdBKI4I6ZVMpMIxQ"
  },
  "xUYiSqB4wtWmIhqipNSJdw": {
    "date": "2/1/2019",
    "text": "This was my first visit to Thai Lahna Restaurant and the food and service were great. On this visit I was with a small group. However, we were seated immediately, our menus were given to  us promptly, and our drinks were served quickly. What I appreciate, is the owner stopped by our table to make sure that we were satisfied with both food and service.    All the dish's  that we ordered were flavorful and well-spiced.  I ordered medium spice and it was perfect; just what I expected and hoped for. The Crab Rangoon, Fried Wontons and chicken/veggie Potstickers, were delicious.  The prices are extremely reasonable, the service is amazing, and the food is delicious, what more can you ask for?  If you're ever in the neighborhood stop by you will not be disappointed.",
    "rating": 4,
    "rated": {
      "funny": 7,
      "useful": 17,
      "cool": 17
    },
    "photos": [
      {
        "img_id": "kJFVO4qQxhuE3XM6z6D5uA",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kJFVO4qQxhuE3XM6z6D5uA/o.jpg"
      },
      {
        "img_id": "hbYASkQKv9QfBDdzqzAGig",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hbYASkQKv9QfBDdzqzAGig/o.jpg"
      },
      {
        "img_id": "xy7c2r-02VZGthk3_ZPvAw",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xy7c2r-02VZGthk3_ZPvAw/o.jpg"
      }
    ],
    "user_id": "MMf0LhEk5tGa1LvN7zcDnA"
  },
  "x9v4R8mh8rTmkxo7Xz1gPA": {
    "date": "7/14/2019",
    "text": "Sadly this restaurant could have been good if it wasn't for the owner (who is also the cook) who does not understand good customer service.  My boyfriend and my friend ordered their fried rice. I ordered their pad Thai (vegan) and my boyfriend did not like his rice after taking a bite of it. It was too mushy. So he wanted my pad Thai dish instead. I asked the server if he could please have my dish instead of his rice. She said let me talk to the owner she usually will make me pay for this dish when this happens. I was so concerned when I heard that. The owner is the cook, and she came out and told us we were wrong for not liking her food. I explained as a paying customer I would like another dish that we will pay for and we only had a bite of this one. I would think as an owner you would understand and want the best customer experience for us. She said that's not right but I will do it this one time. Poor server, she should go work else where and I do not see this business standing long after what I witnessed. I will never be back. Try Thai E San for great Thai food and service which is not too far from here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8khV5R9YQ_eb7AruHGnRaA"
  },
  "7aZ-21MHo4JbO8e0SyTkEw": {
    "date": "6/12/2019",
    "text": "One of the best Thairestaurants in Phx! Every single dish I have had, has delighted and excited my tastebuds!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7QxA6vWkoFoxS1J-g5O4fQ"
  },
  "Y-uB0ljWAFh_BzRJ9ic4iA": {
    "date": "2/25/2019",
    "text": "First time here!!! We've been wanting to try it for ever!!! And it's definetly authentic Thai! I love Curry Chicken, so I got it and it did not disappoint on the flavor department! I would definitely add bamboo shoots. But other than that, delicious!! My husband got Pad Thai, and the kids ordered sweet and sour!!! We will come back!! Oh and the lady who served us, gave us great customer service and even made recommendations!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Jf-_7bfZO-zL5Fq1xtVHvg",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States. Pad Thai, sweet and sour chicken, yellow chicken curry.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Jf-_7bfZO-zL5Fq1xtVHvg/o.jpg"
      }
    ],
    "user_id": "3icGdYOk0d3M7Dk_EJIGOA"
  },
  "cBAGRowEzzs8Vaz3UKIbYg": {
    "date": "6/17/2019",
    "text": "First, let me say that the interior is just lovely and such a surprise for a strip mall restaurant. We arrived early, so there were almost no other customers in the restaurant, but this was the worst service/server I have experienced in years.   I asked the waitress if I could have mild heat if I ordered the Fisherman's Platter, or if I should order a different dish if I didn't want too much chili;she assured me there would be no problem.  She brought a flame-heated dish (the largest open flame I've ever seen set under a dish on the table--not beside it (then walked off without any comment whatsoever and didn't return to the dining area at all). When it's 105 degrees outside, I do not want a large fire sitting a few inches from me on the table, so I finally went to the back and asked her to just bring a bowl for the food and remove the fire. It still required a second trip to the back, insisting she come with me and then, she couldn't find a bowl so put the hot platter on the table and at my insistence, removed the open flame--(she had tried handing my companion a vase of water and telling HER to put the fire out). By now there was one other couple in the room, so we didn't see her again until she brought the bill.  I put the sauce on the rice--there were only a few very tiny shrimp, mussels,and a couple of rubbery pieces of squid with some bamboo shoots in an extremely hot sauce--so hot, it wasn't possible to taste the flavors of anything in the sauce--pretty-much inedible.   Maybe Malee's in Scottsdale has me spoiled,but I expected to be able to taste something other than pepper and curry in Thai food--and see more than a tablespoon of rubbery \"seafood\" in a $14 Fisherman's Platter.  Judging by the decor, someone in this restaurant cares about it, but that wasn't the impression conveyed by the waitress or the food on this visit.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uhxQ8zE2nZRuxGHJgOeMLg"
  },
  "y257BwGU6hTjxO7jxoqcxQ": {
    "date": "4/11/2019",
    "text": "Delicious food. The waitress brought a pretty aluminum serving pot of rice that was only a third full. Weird. Not enough rice for three people, but the dishes we ordered were wonderful and fresh with good quality meat.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "psISCUPJIJZx8DeLr-ZYWw"
  },
  "-b3HvrZjMvXmr70Ywrr47Q": {
    "date": "7/13/2018",
    "text": "I love beer and I love Thai food. When I was at the Whining Pig getting my drink on, I started to crave noodles, as one does. So my friend and I hopped on over to Thai Lahna to get a quick takeout order before we returned to our pints--and boy, oh boy was it quick! We were probably in and out in under 10 minutes, with two full entrees in hand.  I'm usually a drunken noodles kinda gal (I'm not an alcoholic, I promise), but since they don't have it here, I had the Phaht Sii-iiw with chicken, medium spice. It was some of the best I've ever had. Super flavorful without being salty, and everything cooked really well. I feel like often times the broccoli can be overcooked and kind of mushy, but it was done well here with still a bit of crunch to it. My friend had the red vegetable curry and was less-than thrilled about it, but said it was fine.   It was cheaper than a lot of other Thai places in the valley, in my experience. My noodles were $9 and her curry $8.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IqoPX2xo4_WdU3VMLKW2Lw"
  },
  "30XHPfqwxBj8DPn_uESiGg": {
    "date": "2/16/2018",
    "text": "This place is absolutely terrible, I have no clue on earth how people rated this place over 2 stars. I am disappointed in my fellow yelpers right now. I am not even sorry about what I am going to write.   First off, I went in for lunch (lunch menu is terrible, nothing I wanted) and it was completely dead, I mean no one in there. I got the soup that was included, which tasted like chicken noodle soup, nothing that even resembled Thai flavor. There was a Chicken Bone that I bit into. I felt like I cracked my tooth and I took a picture so everyone knows, this wasn't something small. The soup was terrible, I couldn't even eat it after that.  Second, the fried wontons with pork in them was another disaster. The pork looked like something from who knows where, but it was awful. The wonton was fine, but the pork inside looked half cooked and the look of it made me want to puke.   I got the Panang curry beef. Another mistake on my part, or is it their fault? The flavor was blah except for the spice level. It was mediocre at best. There were also little pea size chunks of something dark and I couldn't figure out what it was. Some mysterious ingredient, I have no idea.   Forth and final. Not only food was terrible but so was the service. The server kept bugging me, like what hurry are you in? I have no idea what I want in 30 seconds. Then after coming by multiple times, I rushed my order and then, she didn't do anything to check on me after my food arrived. NOTHING. Why do all that work and bug me, then not even follow up, make no sense? I don't know if this guy was the owner or what, but I see a gentleman scrubbing the floors next to the disgusting bathroom and then I see him walking in and out of the kitchen. I pray to the Lord that he did not make my food after he did that. I left there and about an hour or so later, I felt like absolute garbage. Like a sick feeling.   This is terrible. I will never be back, ever.  I am done, I need to go throw up after this review too.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 15,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "JhJTzz9_WWtaAYgFfH8WUg",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States. Panang Curry",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JhJTzz9_WWtaAYgFfH8WUg/o.jpg"
      },
      {
        "img_id": "e3Mp8bF-F7UuI9iyQ8pX4g",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States. Wonton....12 to a order",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/e3Mp8bF-F7UuI9iyQ8pX4g/o.jpg"
      },
      {
        "img_id": "7gjKycx7wStm2H0yFfzBoQ",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States. Yummm a bone in my soup. UGGGGHHHHH",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7gjKycx7wStm2H0yFfzBoQ/o.jpg"
      }
    ],
    "user_id": "LS0Cj5IiH28NnSChCLPSQw"
  },
  "KqAJQpPoi6Y_oP05DHrpAw": {
    "date": "7/15/2019",
    "text": "This place was not nearly as good as the ratings are! The food was too greasy, the vegetable soup barely had any vegetables, the shrimp pad Thai had 2 pieces of shrimp, we asked for mild hot and it was not spicy and had no flavor and worst of all at the end we got the coconut ice cream and it was frozen with big pieces of actual ice and it was nasty! The waitress was not helpful, was not around and when we told her about the ice cream she said \"oh well\" and still charged us $10.99 for the worst ice cream I ever had!!! Would not ever go there again!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ntIi4XW0yC198YcjZNyYYA"
  },
  "VAng1CbgidEma3QIbZuvcw": {
    "date": "2/16/2018",
    "text": "This place serves up some killer thai food!  Prices are cheap (most that we were considering were under $10 per plate) and the food is outstanding.  This is one of those hole-in-the-wall restaurants where you've probably driven past many times but never stopped to eat.  This time, when you drive past, stop.  It's well worth it.  We had the rahd nah noodle dish with beef (I had no clue what it was, but I saw broccoli and a light gravy-like sauce in the description and thought it sounded good) and the panang curry with chicken.  We ordered both as \"medium,\" which had the perfect amount of kick for me (I'm usually a mild fan, so if you're more of a spicy person you probably want to go aggressive here).  I'd order either dish again in a heartbeat.  The flavors were great, portion size was perfect, and my husband thinks that panang was probably the best panang we've ever had.  We'll be back!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "MwWO6axFPTCXqN0DAfUhIQ"
  },
  "zpmwLcXW4mPT849H7CRlJA": {
    "date": "7/2/2019",
    "text": "I've been going here since I was a little girl, always been a pleasant visit til recently. I ordered the Chicken Pad Thai (my usual). The place was dead & my dish took longer than usual to come out. Once it was served, there was no chicken, my fiance & I waited til a server came by but no one was paying attention so he took the dish to the server & pointed out the problem. The thing that irked me  most-the server decided to pick up my fork & move the the noodle around not once, not twice but three times to make sure there was no chicken on the plate, as if I somehow ate it before making the complaint. The server also being so for sure that there was chicken on the plate. I don't remember shredded chicken growing feet & walking away from a plate.When it was sent back to the kitchen & served again, the portion was literally half the size of the first portion. Experience totally not worth what was paid for.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eYPynvp91PIkY_KFlI6f5g"
  },
  "pQYWSNBft0lqFKKkn52RSg": {
    "date": "4/5/2019",
    "text": "This place is not worth checking out. I have to mention that we used to go pretty often to Thai Town in Los Angeles. So we are experienced Thai eaters. We came in to eat and take some out for my mom but realized we won't do that because it's bad! I think it's the worst Thai food I have ever had! We ordered Pad Thai and Pineapple rice so they seem have the same seasoning and overall ingredients, they just substituted rice to noodle as and added some chunks of pineapple! Pad Thai does not have peanut and freshness as you may expect. While I ate pineapple rice I ate chunk of salt, like ball of salt seasoning twice!!!!! Mentioning service, it is pretty bad. There is only one server so we waited just to order 20 min, I am not even talking about water refill or basic things.  We will never come back here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ll9qnJ9asvb5_o39OrIbPw"
  },
  "eS-sKxR5Pfq4H_L_fuZ10g": {
    "date": "6/5/2019",
    "text": "Wish I could give a \"zero\" star, but I can't. The waitress doesn't pay attention to you, have to try to catch her eye to order or ask for anything. First she was impatient while taking the order when my fiance stopped to think of an additional plate he wanted, she started walking away asking if he needed more time. She got my order wrong, and when I pointed out that was not the dish I had ordered, she stood there and argued with me. I even pointed out that while I was ordering, I had the menu opened on the right page and that she asked me for meat option and if I wanted it spicy. She stood there and continued arguing that I had ordered what she brought, to the point I told her to cancel the meal.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bb47Fyu3LXirAet0bMZs7Q"
  },
  "fGHgfCXl5REDRE5EAJnanw": {
    "date": "6/25/2019",
    "text": "The worst ever Thai food I've ever had! This place is a disgrace to Thai people of AZ.  Seriously do not waste time or money to eat here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NJSj1NJn59T7hzN_XD139g"
  },
  "e7twPoM5RfdCa1gey7XHFw": {
    "date": "2/11/2019",
    "text": "This used to be my favorite Thai restaurant I ate there today and won't ever be back! I ordered the coconut milk soup and my niece ordered the Pad Thai but asked for no bean sprouts or green onion and the server brought out some weird fish soup way before my nieces food came out and when I told the server she gave me the wrong soup she got a major attitude with me and almost wasn't going to fix it meanwhile my niece is sitting there starving with no food when the server brings the food of a table that sat down 20 mins after we ordered then she brought the right soup that I ordered still no food for my niece when her food did come out after about 45 mins the food had everything she asked not to be in it. This was probably one of the worst dining experiences I've had in years!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RU9Vg1ERB87OETJyv5pvwA"
  },
  "1zGxkz9S0k2ABZ62crKkAg": {
    "date": "4/24/2019",
    "text": "Nice quiet sleeper that's been here for awhile. Great neighborhood location, menu & prices! Try it...",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "3lUEQb9TIxOeAUtvgh7p8w"
  },
  "mi3Wx23j7mqeNsXMr0BHkg": {
    "date": "1/4/2019",
    "text": "Best Thai Food I've ever tasted! I've been coming here since I was a kid in the 90's and I've never had a dish like the #33 on the menu. It's Garlicky. Sticky rice with mango or custard is the best as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jrp4tWty3GgJSKAoEIuTTg"
  },
  "pFyCnfhiDc7gH7xgTZuO9w": {
    "date": "7/2/2018",
    "text": "I'm very picky when it comes to Thai food - I usually just make it at home, but I was being lazy and thought to give Thai Lahna a try. I've been to hundreds of Thai restaurants and most disappoint. I ordered the Tohm Yahm Kai soup, green curry, and pad Thai to go, It came out to $33 -which is pretty good for Thai food! If you don't know, typically Thai food is pricey!  The soup was really good. I think it could've used some more mushrooms and herbs to add more flavor but overall it was good.   The green curry was also good - again I think they could've added some herbs to add to the flavor but they did add tons of bamboo sticks which I love!  The pad Thai was delicious! The sauce was probably some of the best. But again - I think it could've used some more herbs like cilantro or scallions or even a lime wedge.   Overall I'm happy with this place and will return!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ck7S7p_LfzqgXWJ_PNchyw"
  },
  "689AH-A0qSDWxcTY6U10NA": {
    "date": "2/8/2019",
    "text": "The restaurant completely screwed up our order the meals were so spicy hot that my mouth sinuses we're burning. Call the owner to discuss it and found him rude and confrontational. Not only did he tell me that he wouldn't fixfix the mail he kept telling me I ordered hot, and was also quick to tell me that I couldn't dispute the charge. Since I have Stomach ulcers I can promise you I didn't order spicy. Good luck with your business model there bud!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lcGaex7fEofwN-r31Pme7g"
  },
  "nfw2h4ybrNUxprJESMk3oA": {
    "date": "1/13/2010",
    "text": "Spending the year in Denver is causing me to have Thai Lahna day dreams...even if I was just there two weeks ago for a little Christmas vacation.   I've been going to this magical place for over fifteen years...right Mom? and I never walk away disappointed. Lately, we've been dining in more than taking out and that has been a real treat. The serving staff aren't necessarily there to give you the best service, but to give you the best authentic Thai food you will ever have! They're letting you into their territory and I'm letting you in on our little secret of the best Thai in Arizona!   If you're a Pahd Thai fan then look no further, this is THE BEST YOU WILL EVER HAVE!!!!! The sauce they use is mouthwatering and is causing me to have a panic attack because it's so good! I admit I get it on the mild side because I'm a major wimp, but even my friends and family have loved it at any spicy level.  On my 22nd birthday I took my friends in to try this amazing place and all of them have come running back to it!!   Whether its the curry, noodles, rice, or soup that you want, they have it. Perfectly seasoned and waiting to be devoured.   Try everything and anything and I promise you will always be satisfied!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JdePfSSMJ18dC8IFdApY0A"
  },
  "w-0_bLw-TswKmNr2D-pVqA": {
    "date": "12/21/2011",
    "text": "What a joy to discover Thai Lahna with my friend Keith Galbut who has been going here for over 10 years. I can see why. Family owned and operated - and everyone is very friendly and helpful. Of course all that matters is the food, right - and it's marvelous. We tried several dishes and all were well spiced and wonderful. Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "byS5I9HMlMqjiTrjqnCscg"
  },
  "JTIaMfKt7yFxz0Cltn_5Pg": {
    "date": "9/20/2010",
    "text": "Okay, still a solid 4 stars, but I have to update to make sure everyone is aware that if there was a soup good enough to warrant putting up with the beratings of a moody Saddam Hussein doppelganger a la Seinfeld, it would be the #15 soup at Thai Lahna.  It's absolutely incredible.  Mouthgasm in every spoonful.  I don't even want to know what's in it because it definitely tastes like \"butter\" is one of the top 3 ingredients, which makes it awesome for my mouth but not so awesome for my ass. But it's totally worth it.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "ZyNaPQFOsaKOOLHTFVAdZw"
  },
  "XIj9V_7liaBVwWzBi99img": {
    "date": "8/5/2011",
    "text": "The vast majority of restaurants don't last 5 years.  Thai Lahna has lasted for decades and for good reason.  Consistently above average in every category - food, service, value, and a comfortable atmosphere ideal for a date or dining with friends.  My worst experience here was better than my best at some places in Arcadia.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bVMOrLZdGfOm4xxL-oZNWQ"
  },
  "mtCVQI059RrobKrz9fFbtg": {
    "date": "12/5/2015",
    "text": "The service was terrible. The Pad Thai was average. I didn't see one smile from either server. I had the Pad Thai with chicken and shrimp. It was a very small portion size and they were trying to hide that fact with sprouts and cabbage. My Pad Thai was delivered without the peanuts. I had to go and get someone, as no one even looked our direction after the food the served. She made me fork thru the dish to make sure there were no peanuts. Then came back to say they were out and left. I had a Thai Tea, which was good, but they never came back to ask if I wanted another or if my friend wanted another beer. Then there was the flavors...I have had a lot of Pad Thai in many different city's around the U.S. and this was not good. I can't put my finger on it but there was a spice or a flavor missing and the sauce was oily. The shrimp was cook well, but the chicken was dry and tough. I haven't written many reviews, but the experience was so lame. I won't be back and would not recommend this place to anyone. Perhaps, I am a little spoiled having lived so close to Cha Da Thai in Scottsdale. But to be clear this place is not for a Pad Thai lover.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xxcFhAM4H27ikkSu2GDGDg"
  },
  "wp_np-glNtr66uh2STIiiA": {
    "date": "11/7/2011",
    "text": "Love, Love, Love this place.... The service has never been an issue for us, even tho others say they have had problems with their service. The place is filled with lot's on the walls to look at, and music in the background, (thai style music). Their coconut soup with chicken is heavenly. It comes on fire....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EKa4QS3BTbgxjERYGDR3-g"
  },
  "DxzxzDt_bl-i33vwE3llEg": {
    "date": "2/12/2011",
    "text": "This is my favorite Thai food restaurant in my neighborhood because their food is consistently delicious.  Their prices are reasonable.  This mom and pop place is cozy and simple.  It is great for dinning in or take out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MKSfj5IeCi5xUkHz6BIpug"
  },
  "rautxXWzWq4yQrh36KCnng": {
    "date": "12/21/2010",
    "text": "Their red curry is not Thai style but Laos.  I didn't really dig the curry.   One thing I hated about the place,  I have to ask multiple times to get refill.  I don't have much to say about the place, since it is just typical Thai place, and nothing intriguing.  But food is okay to  good depending on what you order..  Soup is too salty and not much of flavor.  I don't think I will be visiting this place in the future!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xiEcNDwKwrbcf5NaL21oew"
  },
  "0zpkAJQmkUU0KbaMKICNAA": {
    "date": "9/7/2010",
    "text": "They have arguably the best thai food in phoenix, however they are only open about half of the time that I want to eat there... They close for a few hours in between lunch and dinner during the week, and sometime they will just be closed with a handwritten sign saying they will be open the next day.  Very inconvenient, however the food is sooooo good that I can't help but go back again and again!  5 stars!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VPTPLmF_Q5wgEKqEIy0sDw"
  },
  "IQgCp4MiSPppEPXCM1Vl5A": {
    "date": "6/4/2010",
    "text": "much overdue review, but...  i guess it doesn't matter what was ordered here, because somebody has a heavy hand as far as salty condiments are concerned, so dishes are peculiarly salty, and it is possible that while en route to our table, someone surreptitiously powdered the food with yes, even more salt. flavor isn't necessarily bad, but if you didn't know, i prefer a blend of flavor(s), not just a flavor (salty).   if you are luckily having salticious cravings, and would like to experience edema and other related salt and water retention, this is a great place.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "S8pm4tUyneQUDKLr4B2ptg"
  },
  "Ec_D8hko1i3VQtWuYLgB4A": {
    "date": "3/24/2013",
    "text": "one of the better thai food places in town.  try the pineapple fried rice and of course the standard pad thai.  Service is ok and a good place for take out too if you live close by.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Ux6jUsYoWA_A3fc5XpLVw"
  },
  "1KLkTuJOm-LfTEuzy5gOHQ": {
    "date": "5/30/2011",
    "text": "I go this place often. Curry is always good and the coconut chicken soup is the best in the valley. I order rice with the soup. Yummy!!! Service is usually not the best. I have had a lot of frustrations trying to do pick up orders. They don't answer the phone or put you on hold forever and forget about you....but once you get your food its worth it!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6M13mHczKkA5MSgFgkicgQ"
  },
  "LEue5VYkm0lz5dLdQ73C7w": {
    "date": "1/1/2010",
    "text": "Through unusual circumstances, I ate at three Thai restaurants within 24 hours the other day -- Bejarong Thai in Mesa for dinner, Thai Lahna for lunch the next day, and Malee's Thai Bistro for dinner that evening. And the winner is ... good ol' dependable Thai Lahna. I realize, though, that I am in a bit of a rut as to what I order there and need to branch out to some of their seafood and vegetarian entrees before I can call myself a Thai food aficionado. Also, my Far Eastern journey led to the pleasant discovery of Bejarong, which comes in second. Malee's -- I appreciate your twists on Thai food, but my half-plate entree was not worth the $9 I paid for it.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "0wvlpzuR4mnZfMcoG8N31Q"
  },
  "Cb3osbVty7wIN9HcqVZyow": {
    "date": "7/20/2013",
    "text": "I have tried this place 4 times. The food is not very good. I have lived in Thai Land but don't expect to get the same excellent food here. I love Thai food and Thai people, don't think much of this place, I live close by but go elsewhere. The food is bland, overcooked and pretty Americanized. I have always been pleasant, patient and courteous but never gotten good service. The servers are lazy and sometimes rude and you are going to wait a longtime for every step of the service process. With so many good Thai restaurants in Phoenix there is no reason to eat here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HdxlItXqjeGP2t21tf6s1Q"
  },
  "YiWy9l6fgm8Pf0Bg8zrOsg": {
    "date": "1/6/2011",
    "text": "This place was alright,  I'm still looking for a place like that late night stand that I frequented so much in Chiang Mai... I haven't had much luck here in Phoenix...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-qCD4tYOv92CnFBMLRIOaA"
  },
  "hGtQ4AGV7qUGLSayyPNC2w": {
    "date": "7/23/2009",
    "text": "Woo hoo! Thai Lahna now has a website: <a href=\"/redir?url=http%3A%2F%2Fthailahna.com%2Findex.html&s=ef5a352a7f33d549c717996bd855cfaec2005c46f9b39bbafddaf52b837085dd\" target=\"_blank\" rel=\"nofollow\">thailahna.com/index.html</a>. It will be so much easier for me to order to-go now!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 3
    },
    "photos": [],
    "user_id": "gru76BjkRY6UQVcw_yAxiQ"
  },
  "ncTKsLnDozh8qZUTcnVZNA": {
    "date": "5/27/2011",
    "text": "Absolutely the best red curry in history.  Wife loved the brocoly chicken.  I live in Idaho and there are only 2 restaurants in Phoenix I go out of my way for.  Thai lahna is one of them..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vl3Yu7aRhk1N1KFMJHfLig"
  },
  "tOtTwVvJUgOHfPDRFFHU7A": {
    "date": "9/24/2010",
    "text": "The first time I tried this place I had no desire to return. However, over the years my family has coaxed me to go back several times and I have to admit, I'm glad they have. Had several tasty dishes here, but I can only specifically recommend the Thai Omelette... it's damn good... that is all.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a06g_pO2zRmGQmFlfzTLNw"
  },
  "m3_rDC2bYoSl1h2qjBfcIw": {
    "date": "10/25/2010",
    "text": "Your standard Thai fare, but there's much better Thai food in Phoenix (e.g. Thai Basil, Thai Rama). Their yellow curry is all chicken, hardly any onions or potatoes.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8J9P5IXOkkLLeTX207Km4w"
  },
  "JwilPydqisNC_VPvh3sTPg": {
    "date": "10/13/2007",
    "text": "Best Thai in town. I've been eating here since 1994 or so.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "uqJ0kCrmZOEZzbt4qV3ODA"
  },
  "N2d44L-wcwNwPOD36gF7PA": {
    "date": "3/18/2012",
    "text": "Whenever I'm in the mood for Thai, I order some take out from here. I've had a few things that were just okay, but have found that I love their Phaht Thai and prefer it with just chicken, no shrimp and no bean sprouts. Oh and medium heat. Yum!  I don't think this is a place I would ever dine in at, but for Thai takeout, it's perfect , plus it's just two minutes away from me!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "midS4e50ZmuOeGyNm3aoUg"
  },
  "ZIW4cMcIDumH3ux_IVwhIA": {
    "date": "8/16/2007",
    "text": "I was so pleasantly surprised when I tried Thai Lahna as it's rare to find authentic restaurants in this city!  I moved here from Atlanta where all of the thai restaurants seemed authentic, but it took awhile for me to find good consistent thai food here.  Now I'm addicted!    I frequent Thai Lahna on my own and with friends... I've never had anyone say they didn't like it; even those that have never had thai food before... I live nearby, so I will order take-out often.  If you like eggplant, try the 'Eggplant Jay' - #92 on the menu.  It melts in your mouth.  If you are in the mood for soup or you think you might be coming down with something, order the chicken and vegetable soup - you will thank me!  The only negative thing I will write is that the service is not great.  They can be slow, but it's worth the wait.  Also, be patient if you call for take-out.  I've been put on hold for 5 minutes or more and I've also been hung up on before.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 5
    },
    "photos": [],
    "user_id": "dIIKEfOgo0KqUfGQvGikPg"
  },
  "LeXU3fSIKUCpcO5dLMtwrQ": {
    "date": "8/17/2008",
    "text": "Best Thai I have found in Phoenix, so far.  This is not just excellent Thai food for Phoenix, this is excellent Thai food for the Bay Area.  It's that good.  Thai Lahna's food will intrude into your thoughts for days after you eat here.  Like gustatory flashbacks, you will find yourself thinking about how wonderfully flavorful everything was.  We had dinner here with Christine O & Myles (+1) and shared 2 appetizers and 4 entrees.  We had Chicken Satay and Angel Wings.  The Satay was the least interesting item we had, it was merely good.  Everything else was great.  Our entrees were Phaht Thai which we ordered with no spice and Khung Nahm Prik Pow which was sauteed shrimp with roasted curry paste, onions, chili, bell peppers and mushrooms.  Our friends ordered a spicy pineapple fried rice and a beef dish which I can't recall the name of.  All of the dishes were richly flavorful and had plenty of sauce to carry over to the steamed rice.  One enjoyable highlight was the point counter-point going from the spicy heat of the rice to the almost sweet sauciness of the Phaht Thai.  We can't wait to get back here and try more dishes.  My only complaint about this place is that they need to put some sort of tinting on the windows to a height of about 3 feet.  When cars are pulling into the spots right in front of the restaurant some diners were blinded by the headlights.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "QuZbJquRtbY9O9JrB9NpxQ"
  },
  "bgyBLXHyVxyuA7nG8qYfeg": {
    "date": "9/16/2008",
    "text": "Two stars for serving a good squid dish, albeit a bit chewy, ordered medium spicy.  Was surprised Mom enjoyed it as much as I did, since she cannot handle the spice level that I can.  Wish they served more dishes I can try, but with my food allergies and the note asking for no substitutions, Thai Lahna's menus are very limiting, hence the rare two-star rating.  (I know of a handful of restos that cater to my allergy concerns.)  I won't be visiting TL again until I can choose more than ONE entree from their numerous  meal selections.  The extra star is for their coconut ice cream served over sticky rice!  It's not everyday that I can savor the sight of my Mom enjoying her meal.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "M9rRM6Eo5YbKLKMG5QiIPA"
  },
  "M4fpgKwG8YUg5EEZSZzXFA": {
    "date": "11/9/2014",
    "text": "The food was very good and its value was even better.  Wasn't too crowded but take out was booming. My new favorite Thai place for sure",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qe3PPom8aVfmEthp_609uw"
  },
  "1JUih-d_nfrLvZ3DKQ1cMg": {
    "date": "11/15/2011",
    "text": "Requests not taken on dishes.  I'm not a big fan of carrots and asked if the dish I was interested in ordering could be prepared without them.  \"no\".  I then asked about several other dishes and the bottom line was that they prepared them how they wanted to and the customer be damned.    When my food finally arrived, I asked for a refill on my drink -- that refill never came.  The food was bland and I had to remove all the vegatables I didn't want.    Every other Thai restaurant I've been to has no problem with a simple request like this, and had much better service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "hEqLkfGmr5D9FQLzsmv2ug"
  },
  "2ibEv0aeQ3CuX0Xook7xfQ": {
    "date": "1/2/2012",
    "text": "I really wish I could give Thai Lahna more stars because of their location - the Arcadia area needs a good Thai place (enter Sa Bai?).  I'd rather give them some advice, although based on their customer service, I don't think they are open to constructive criticism.    I went there regularly up until Valentine's Day in '06 when I was served raw fish in my seafood stew.  They were super busy and the undercooked food would have been forgiveable if they acted like they cared, or offered to replace my meal, which they didn't.  To further break the mood, our main waitress (possibly the manager) was extremely rude to the rest of the staff and was yelling in a very squeaky, high pitched voice from the dining room into the kitchen.  I felt horribly embarrassed for all of them.  We decided to try it again - because of location.  The service was not necessarily rude, but they weren't friendly and didn't make us feel like they welcomed our business.  The food was too salty, completely masking the flavor of the dishes we ordered, and making me wonder if they salvage leftovers by re-cooking them and adding more salt (gross).  The positive reviews on yelp regarding flavor are very curious to me.  Then they acted like our request for take-home containers was an inconvenience.    With so many other restaurants in the area, including several Thai restaurants within 5 miles, we would much rather go somewhere with happy, nice employees and flavorful food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JaX-PMgI75CggE6ZzflsoA"
  },
  "TaCryJ62zqBt8Pm1d4oT_A": {
    "date": "1/7/2015",
    "text": "I live quite far from Thai Lahna, so I'm not able to make it there often.  But I went last night, and it confirmed once again that they make the best pineapple fried rice I've ever had.  Here's what is mixed with the rice and curry powder:  scallions, white onion, chicken, shrimp, pork, trace of egg, tomatoes, tiny potent red peppers, finely chopped green bird's eye peppers (if you order hot like I do), and pineapple.  Order it medium or less if you're unsure about your tolerance because their scale leans toward the hotter side.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NvRLr4sdrvbbkSa05bQinQ"
  },
  "KDpm_ToL3UsUu2y_D1DZkQ": {
    "date": "7/11/2014",
    "text": "Is the food here Thai or Chinese?? Where is the basil, an important ingredient in Thai cuisine, in their dishes?? And the fish sauce, another crucial ingredient that marks Thai flavors?? This could pass for Americanized Chinese food though but I'll pass on this place next time...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zrGGeBBerzHzCmkl3pBkag"
  },
  "bvcsXixCnL07eJoHWt94sg": {
    "date": "3/5/2012",
    "text": "I used to love this place but I suspect it has changed owners in the past few years. we had a friend in town who fondly remembered a meal he once had there so we decided to try it again.. It was a pretty bad experience with bad service-they were unprepared for a busy Friday night. What a disaster! The food is ok ( too salty) but the presentation, lack of care is evident both in service and overall experience. Someone at Thai Lahna needs to regroup and reorganize. I hope they get their act together because it is a great location and has been good in the past.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n-YoyJx2_hXs1j9jb1bkrw"
  },
  "kFIcD7VWO2sfP4TPf8QNtQ": {
    "date": "12/18/2011",
    "text": "I love this place for their pad-thai; it's SO flavorful and delicious! With the perfect amount of heat too! I find that the chicken is a little dry, so I order it without and stick with all prawns. SO GOOD!  I've only tasted the other dishes from friends plates. I find the curry (I've tired yellow) is a little salty (and lacking in something...) I generally stick with the pad thai, since it's so good. I have had the chicken in coconut broth. It is pretty good, has a lot of lemon grass flavor and, obviously, coconut. Again, I find the chicken is a little dry (you wouldn't think that for a soup, but, it is) presentation is really cool....they serve it in a silver, thai style bowl, with a flaming center (you generally share it with the table, all dipping from the same bowl).  I've never had problems with service, they are very friendly, a little slow, if anything. It is a small restaurtant, a little out-dated, but o.k.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iAd8XaHxv05iXyEiZ62Ibw"
  },
  "hktjZ6OwyjHEUMSAhNx8nQ": {
    "date": "1/27/2013",
    "text": "When we first sat down, one of our party asked the server if they had sparkling water.  She, unfortunately, spoke very little English.  Rather than getting someone to help her with the question she didn't understand, she shoved the drink menu in his face and walked away.  WOW!  We made our order, beginning with Chicken Satay.  The response - we are out of chicken satay.  So, we decided to go with beef satay.  A few minutes later, she came back and said they were out of that also.  So, we decided on the egg roll.  We were very upset to see the table next to us receive an order of chicken satay.  What is going on here?  Now, unlike every other decent restaurant on the planet, dishes do not arrive together at this restaurant.  My Phaht Thai (allegedly one of their specialties) arrived first.  I was about to dig in when they came and grabbed it away from me claiming it was for another table.  Then I watched as the dish that was on MY table was given directly to another diner.  No wonder this restaurant has so many Health Department violations.  Finally, all the dishes arrived (one at a time) and we were able to eat.  The Thai Lahna Special Fried Rice (with chicken, beef, pork and shrimp) was the best thing we had - good flavor and tasty.  Not particularly generous with the meats, but for $9.95, we weren't expecting much.  The Kai Phaht Khahnah (Chicken stir-fried with broccoli in a light oyster flavored sauce) was the next best thing - the oyster sauce was really pretty good.  Everything else made us wonder if the chef could even find Thailand on a map.  The Phaht Thai was horrible.  It was basically rubber bands masquerading as noodles and bean sprouts with a couple small pieces of chicken and 2 shrimp.  The Vegetable Curry was unlike any curry I've ever seen.  The \"sauce\" was so thin and runny, it was more like a soup than a sauce.  All in all, this was a terrible restaurant that I would highly NOT recommend.  The only thing good is the price.  Certainly not the food and DEFINITELY not the service.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "wPDiYHaHUip8QkxFr46qKQ"
  },
  "C9F5pLduDwrBwv72fOw2DQ": {
    "date": "6/20/2012",
    "text": "I started going to Thai Lahna a few years back, and it's one of the few Thai restaurants that I keep returning to.  The Pad Thai uses thin noodles, which is unique and gives it a very different texture.  The pineapple fried rice has some awesome spices and the chunks of pineapple add a subtle sweetness to the whole dish.  Their curries are definitely good as well.  The appearance is a bit of a \"hole-in-the-wall\" but if that bothers you, you can always call in for take-out instead.  Service has always been fast and polite for me, but that varies based on who your server is, so I can't make any promises there.  Thai food is awesome for vegetarians, and Thai Lahna does not disappoint in this aspect.  It's one of those places where you can have a completely vegetarian meal and only notice that there was no meat after your meal.  They are definitely generous with their portions and their pricing is very reasonable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qe4M3ynaIgzsrGhJu8nIkQ"
  },
  "_ItiOL9a_cA5eU2zxZ487w": {
    "date": "5/3/2011",
    "text": "Found this place as we were driving by wondering what we felt like for lunch. Glad we stopped because this place is a keeper. The staff is legit, service is decent considering how busy it was during the lunch rush and the food is just amazing.   We had our usual fare at any Thai place. The dishes we use to measure our fondness for the place. Yellow curry and pad thai. The lunch portions are good for a good price. The yellow curry had tons of chicken in it and was delicious. The pad thai was tasty and peanutty...just how I like it.   I'd like to go back and try their Tom kha Kai - the coconut milk soup and I wanted to try their dessert - mango with sticky rice - but I was already too full to handle it. That's okay, another reason to go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "oG34tQ9DhUrq_Jbm3Bs6aA"
  },
  "iqdPLmua1iSO2dr4gX6-Ww": {
    "date": "1/4/2011",
    "text": "A Piping Hot Bowl of Red Vegetable Curry Hit the spot on a Cold Rainy Day in Phoenix.   It was my first time here. There was one other person dining at the time. It took at least 5 minutes for me to be noticed. Since I was in a hurry I decided to order to go. I was told it would be about ten minutes and that was pretty accurate.   I sat at a table and ate my to go curry. It was a huge portion, the flavor was pretty good and it had a Ton of veggies in it! My only complaint is that the veggies were really mostly bamboo shoots, celery and baby bok choy, with a few carrots and green beans. I would have like more variety and maybe some eggplant.   The Restaurant was small and cute, I would return again when I'm in the area and craving Thai and have more time to go through the menu.  3 stars for now, until I try it a few more times.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "pQdIIsbV5dGOVz_kWfMRTw"
  },
  "o6NyVskXcN0UcOkBZsWajg": {
    "date": "6/16/2011",
    "text": "Yay I am here with a happy update! The past few times I have been back, they have NOTICEABLY improved both timeliness and friendliness, which brings them to a solid 4 stars in my book.   Kudos, Thai Lana, Kudos.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "S05ujQ92h7YNDzY6u7wr_A"
  },
  "SXgaWY-dcQwrYWtNdOIUJw": {
    "date": "4/13/2013",
    "text": "Food is great.  Bathrooms are disgusting (which naturally makes me wonder what the kitchen is like).  And the past four times I have been here, the service has been atrocious.  Tried to order two different beers, only to be told that they didn't have them.  Too bad the service is so bad because like I said...food is great.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IQWPQ-fbL8b9-833ajaNVw"
  },
  "INOS5Z0eGaP5eIgqR9U8NQ": {
    "date": "1/25/2014",
    "text": "Would be 3.5 to 4 stars for solid food but phone was busy for an hour straight.  I decided to go there and place my order. I saw the phone was left off the hook for the last 2.5 hours...phone was ticking on screen. She then told me they were busy with orders and lied (server who was taking order at desk). I guarantee the owner who is very nice doesn't realize why no one called to put in order all night. I called every 2 minutes for an hour and no one even picked up order.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8zz2CuBQDhKaT7ax9hP1pw"
  },
  "NRnESaMizxHnuG-kji5riw": {
    "date": "11/4/2013",
    "text": "Ok, I've ordered takeout from them twice now and it's been a challenge. The staff has no knowledge of the menu without ordering by numbers. The dishes are not spicy and portions are on the small side for the price. When I arrived both times I was not greeted and it was dead in there. I asked for chili oil just anything that would make the dish spicy and neither staff member knew what I was talking about. I will not be coming back just for the fact that they may not know where they are working!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vuN9EKK6abFvCQfek9rUtg"
  },
  "qn77p0bkW2eXqRffZkQ96A": {
    "date": "3/2/2014",
    "text": "I love thai food and go to various thai restaurants weekly. I went here recently. Waited 10 minutes to be seated. Then waited another ten minutes before leaving. I overheard a \"to go\" customer complain about the wait. She had been there for an hour! Very dated decor is another negative.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yMduE2Fh5AKm5E0ve_Q0bA"
  },
  "A_Tl5zIitae99bJBu1HIRg": {
    "date": "11/11/2012",
    "text": "Food wasn't bad. Yellow curry was average. Pad Thai noodles were chewy and sauce was well flavored. The pumpkin custard dessert was worth saving room for. Thai iced coffee was delish.   Service was blah. First, the waitress had the heaviest rose perfume on. So heavy I could taste it when she came by. Luckily, sort of, she hardly came by. If she was going to douse herself, I wish she would have used a Thai tea scented perfume, or anything that would've paired better with the food. Seriously, one spritz is all you need ma'am. Also, we were given the bill before we were asked if we wanted any thing else or dessert. When we did order dessert it was plopped on the table before our main course dishes were cleared off. I had to push them off to the side with my forearm bulldozer. Blah.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TwAx5VOg3cQ2JZd-FFTyFg"
  },
  "PY2jcyH1W0yJ-6E_Alx89g": {
    "date": "5/19/2013",
    "text": "I have been eating at Thai Lahna on and off for about 4-5 years now. Not many know but Thai Lahna is the first Thai Restaurant in Phoenix. This is what their chef/cook told me months ago when I was there. I don't know if this is True, but it made sense to me.   When I first started enjoying the food here the one thing I did not enjoy was the service. Orders were wrong, and the servers rarely would come to refill drinks. I am happy to say that this has all changed. The servers are on top of their game making sure that all customers are being attended to in a timely manner.   The Sweet and Sour Tofu was amazing!!!! I felt like I was having a desert and dinner at the same time. It was so good my friend and I ordered a second entree. The serving size for this entree seemed a little small, but on the other hand we get over served portions at most restaurants.   Overall I really enjoyed my meal here and look forward to coming again. Also the Tom Kai Gai or however you spell it is amazing as well!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "kno7AYD42uvc2ssEZgbmZA"
  },
  "ssHeOj6Rdr2YLokgzAdBJg": {
    "date": "9/17/2012",
    "text": "Thai Lahna, some of the best flavors around. From the Tom Kai Gai, to their Prad Prik Khing rice, its just a food orgasm in your mouth.   Like many, i'm always dissapointed in the service. They're shorthanded and they have their wait staff help with kitchen duties like cutting vegetables, etc   I recommend either A. ordering take out or B. Order your food when you get there, to minimize the wait.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DssV9fskchomqfh7jeYavA"
  },
  "SxFzx_FtAJc0vQiCsSaMRA": {
    "date": "6/13/2012",
    "text": "Wow!  I just got home from one of the most satisfying dinners in years!  The food here is amazing!  First though, let me get the formalities out of the way....  I was actually ready to be disappointed because Thai Lahna only has 3.5 stars. HA!  I've definitely eaten 3 star Thai.  This is WAYYYY better!  The restaurant is small but not too small, and  the ambiance is mellow and  inviting.  It works.    The water is not abominable, but considering that Thai food can be very hot, investing in a good water filtration system would do wonders.  Frankly, the water was kinda terrible. Of course, I still drank 3 glasses of it. So it was obviously not the worst. Service is not gushy, clingy, pushy, or anything else that would annoy me.  They are actually more hands off than most places, but we didn't suffer one bit.  Now, to the food.  I'm smiling again because my  tummy is very happy.   We split the Mii Krohb.  The shrimp and chicken were cooked to perfection.  It was like eating chicken and shrimp flavored clouds.    We then split the Kwediaw Kraphrao with chicken (#55).  I asked for it to be Thai medium since I figured that would be about equal to \"American Volcano.\"   It came out to be just about the right amount of not quite mouth blistering heat. Every time I thought the heat was too much, it mellowed.  The mint flavoring was subtle, and there was a very light touch of anise that was a surprise, but PERFECT.  I can't really say much about this dish, except GO GET IT. Even though the Kwediaw Kraphrao is a noodle dish, we did get a side order of rice so as to not waste the incredible sauce.  Even the rice was well done and a much higher quality of rice than expected.  Just about a third of the way through our entree, we experienced a delightful event when the owner came up and introduced himself and told us that he had cooked our food himself! Perhaps this is why it was so amazing?  He is a Thai genius!!  This might also be why some people have given Thai Lahna bad reviews?  Maybe he wasn't cooking for them....  Anyhow, I was willing to skip dessert, but coconut ice cream sounded pretty good since I was cleaning my patio earlier in the 107 degree heat.  Oh.  My.  GOD.    It's handmade.  He makes it himself!  You can taste honest to goodness coconut milk!  I wanted to cry because I was so stuffed I could only eat two bites.  Please ignore the 2 star reviewers.  They're all high.  No. I'm kidding. Sorry.  But if the owner is cooking, every 2 star reviewer on Yelp needs to go back and give it another try.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "F0Oco8PiWbkM3INpbIh1Pw"
  },
  "azMln91sWr97hA2DPEUF1Q": {
    "date": "11/3/2016",
    "text": "The best Thai places have the worst service and this is one of them. This place hits the spot when it comes to pad Thai! So good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uYwAmFXxznR5-hGONv4NBg"
  },
  "oedw0css2y5foQpmJyJLBA": {
    "date": "2/23/2015",
    "text": "The food was pretty good. It was a Monday night, somewhat busy. I was a party of one and waited ten minutes or so before my order was taken (was ready after about one minute). The server took another tables appetizers and drink order before asking me anything.    The portion size was the killer. I am still very hungry. I ordered #86. Usually I have left overs at other Thai places. I'm not a large individual with an obscenely large appetite. I wont be coming back. I'd need to order two dishes, and this isn't a $18/meal place.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y8AtXXqDvssWe9XfQmHJrQ"
  },
  "pVelsTITOOHkglQ92lbYhA": {
    "date": "6/20/2014",
    "text": "This food has me drooling every time I think about it.   Great food and normal service.   The only thing I dislike is the rice portion given. You are given the same amount even if your alone or with three people. They charge for extra, and that is my only concern.  Other than that, great Thai tea and food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "VUGX0q83CJGS4pTdd1qufQ"
  },
  "QGovETjVFgsSWsmQWWzDiA": {
    "date": "2/21/2013",
    "text": "I've had one okay experience at Thai Lahna and one pretty bad experience.   The first trip, my friend and I received our food promptly and it was good. I had the pad kee mow and it was tasty and the serving size was large enough to have a take home box. The service was nothing to write home about but it wasnt awful.   The second time I came with my husband, the service was deplorable. It took us 20 minutes just to get a glass of water and an acknowledgement of our presence. My husband ordered pad see eew (I'm so sorry I don't know the correct spelling, I'm just going phonetically here) and the waitress told him that they didn't have it. It's a pretty common thai dish so he asked for it by a different name, like drunken noodles, and she said she didn't know it again and only knew \"the number\" - common for restaurants with hard to pronounce dishes. She said she didn't know the names of the dishes, she just wrote down the numbers. She was really short with us and basically belted that if it wasnt on the menu they didn't have it.   She then asked her colleague to come over to our table to again point out that they don't have the dish, and began speaking over our table to each other in Spanish.   She then left for 10 minutes when someone from the kitchen staff came out. My husband asked again for the dish he desired and the staff member knew it immediately and put in the order.   I can understand a fresh server and someone who isn't as familiar with the menu, but to be put on the floor with zero training and to be so rude to a customer really blows my mind.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4zYIcJNAaiYHZkRPcGb_tA"
  },
  "GWxaCHeUug2gzsOMCJpsIw": {
    "date": "6/1/2012",
    "text": "I came to this place several years ago, when I swear it was the only Thai restaurant in Phoenix.  I remember I really liked everything.  But this most recent trip after all those years made me realize it has really gone downhill.  My first and biggest gripe is that they don't even have Thai Basil on the menu.  That should be a staple everywhere and it is my favorite dish.  Maybe it is hard to get fresh basil in the desert?  So instead I had some yellow curry with potatoes and chicken.  It was okay.  Nothing special.  The rest of our meal was just mediocre as well.    Also, the Thai iced coffee had cream in it, instead of sweetened condensed milk.  That is a big fail right there!  I am sure that by now there are many many better Thai food restaurants in the Valley.  Go and find them.  Pass this one by - unless you are really hungry and stuck in the strip mall for some reason.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "HCigPWp_cx0GsoA_iO_jsA"
  },
  "1aKgFGANGEinBZSKR0LfxQ": {
    "date": "5/20/2013",
    "text": "Love the Phat ti. (Pad Tie)? That's how it sounds. :-P  Ambient - Walls and decar are all pretty much thai inspired.  Red table cloths and golden accents all around.  Dim lighting, coozy, booths and tables.  Service - They are for the most part very attentive and friendly.  Food - LOVE LOVE their pad ti or is Phat tai, well how ever it is spelled.  IT is DELICIOUS.  We have tried other places and its just not the same.  This is the place for Pad Tie! :-P",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uRNxoFcZ4a2VLXAJ2v9dhQ"
  },
  "KBRj8A_TG0Wh0alikuBFJw": {
    "date": "10/1/2014",
    "text": "Been to many thai places, service at this one is rude and slow, more expensive then most other places and small portions, forget it, dont easte your money!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EdCEnDNG16wSzIDMu-xiOA"
  },
  "-v2q6oaqa2Uheub4z0FmAg": {
    "date": "6/4/2014",
    "text": "Bottom line - I have been eating here for over 14 years.  My wife, myself, and my two daughters LOVE their food.  We have only eaten in the restaurant once or twice.  We almost always opt for take out.  The decor in the restaurant is simple, and not really very impressive.  People come here for the food, not for the atmosphere.  The menu is extensive.  We have tried many of the various dishes.  Anything that sounded good on paper was equally good in reality.  We have never been disappointed.  Yes, you might have to wait for them to prepare your meal.  Quality takes time, and there are a lot of loyal customers who are calling in their orders.  So, even if they don't seem busy with patrons in the restaurant, they are super busy back in the kitchen.  My family and I have tried almost all of the Thai restaurants around town.  We have found a few good places, but we always compare it to Thai Lahna as the gold standard.  I have a dream of having a big party, ordering everything on the menu, and trying every dish that they make.  I guarantee that it would make me the most popular guy on the block, and I would get a chance to try some of the dishes that sounded good, but I never had a chance to try.  To sum it up, the decor and the atmosphere are average.  The wait time can be a little long.  But, if all you care about is the food, then you will love Thai Lahna.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AqCCI-lvzr810FRgKepVNg"
  },
  "A-usNWHnRQ4uPH0gCCyH2Q": {
    "date": "6/5/2015",
    "text": "EVERYTiME I try to go to this restaurant they are always closed. The food is amazing but don't even bother going because they will be closed. Even when you go during their listed \"open hours\" they will still be closed. They clearly have not adapted to the modern age.  GREAT FOOD, But they Can't be bothered with your business, they do not care about customers and just make food when they feelike it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3kNFG6RbFejl9Jb7thKJYA"
  },
  "qFtFBp7RrvaiT6F0Epuabw": {
    "date": "10/20/2010",
    "text": "Meh. That's what I've got.  My partner and I shared a Tom Kah soup. There was lots and lots of soup, but not much on the way of flavor. I found it a little bland...and even though it was on the vegetarian page, I thought it tasted slightly of chicken broth, so I didn't finish it, though I normal would have. Not stingy in the way of veggies, but not much flavor either...  Now, I also ordered my panang curry mild...but here, no absence of taste. No, I was gulping down glass after glass of water. My partner tried it (she likes spicy food), and told me it was pretty spicy. I made it through the veggies and the tofu, but then had to stop. Way too spicy for me.  Another think was that there are no changes. I hate onions, and was not pleased that there was no way to order any of the other dishes without onions. Their service was also incredibly slow, but I've found that to be pretty typical of Thai places in AZ.  I will say that my partner enjoyed her chicken dish, which actually came out at the spice level she asked for.  I don't know if I'll go back again...I much prefer Tips 88 and Thaiger.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZW217qAFcBZIFYQleDnm8g"
  },
  "8gYLy8LAZCTJvV-nVNt3JQ": {
    "date": "8/9/2014",
    "text": "I have been to many Thai restaurants and I usually always rate a Thai place by their pad thai. I have to say I was not impressed.  First of all when your paying for shrimp pad thai and not inexpensively cone to find they only give you 3 shrimp. There service was good and the decor was very authentic but just was not worth the price you are paying for. Even tho it was ok I will not be returning. There are more places to choose from.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UQvipLPNTEVYr8jO04iJaw"
  },
  "bYBFNRlAVUDM8uxWgcWOmQ": {
    "date": "8/12/2013",
    "text": "Thai Lahna is one of my favorite restaurants. We go there at least once a month, sometimes more. Their food puts every other Thai restaurant to shame. I always get the Phaht Sii-iiw Neua and my fiance gets the Panang Curry. I always want to try other dishes but then I remember how good Phaht Sii-iiw Neua is and can't say no to that. The noodles are fresh and the dish is spicy, but not so spicy that it overwhelms the flavor.  The only issue with Thai Lahna is the service. We've stopped going in and just order Take Out now because of the service. We either get really awful service, super slow service. The one Thai server that we've ever seen is actually really nice, but the others are so rude. Thankfully the food is amazing, otherwise we would not get it.  I thoroughly recommend trying Thai Lahna, your life will be incomplete without it. However I also recommend just getting it for take out. If you have to eat-in, do not sit in the corner, you will never be served.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lp1GsmAUT0tgRBlXbJwLNA"
  },
  "4AXV3o3F9cyVD6jFuoyW3g": {
    "date": "4/27/2013",
    "text": "Got the #13 Tom Yum soup, which was salty to almost unedible, with shrimp cooked to within an inch of their life, pretty poor example of this type of soup  The #54 Pad Thai was done reasonably well, however the menu states chicken and shrimp, there certainly was no shrimp in this dish it was just chicken, - Americanized but still tasty   Based on this trip I would probably not return",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fTz-nwS5wn-QyW5JFsFffQ"
  },
  "gXl5_vorw47K2MTMgasr8A": {
    "date": "1/29/2009",
    "text": "So I really wanted to Yelp something today. So, a buddy (@groovypucks) and I went to Thai Lahna.  I noticed it had a LOT of reviews and still maintained a pretty reputable score!  Hey, its only a block or two from work, so why not?  We get there and are immediately seated which in my opinion is rare.  For the rave reviews, I noticed it was kind of 'dead' for a lunch crowd.  A few old people and the owners were all I really noticed.  We get a booth seat (I love booth seats.  If I could work, sleep and eat in a booth seat, I would die a happy man) so I am already getting excited.  Groovypucks and I take way too long looking at the menu and finally decide on our dishes (which we accompanied with a Thai Tea).  I asked to make my curry spicy(#36 Yellow Curry Chicken with Green Beans), and it WAS!  Almost too spicy, but I attribute that to my lack of experience with their dishes.  If I were to order it again, I would order it medium.  Groovy got a Peanut and Chicken dish (#35) with onions and peppers.  I tried a bit, as I am comfortable in my sexuality, and I really liked it.  It was Damn good! That's right, Capital D!  The service for the rest of the meal was below par, but not to the point that it was annoying.  It just took a little too long to get my food and my check at the end...  ...And with this review I leave you with my fortune  If strength were all, tiger would not fear scorpion.",
    "rating": 4,
    "rated": {
      "funny": 12,
      "useful": 13,
      "cool": 11
    },
    "photos": [
      {
        "img_id": "NT04zlMz9soSsa_6bFVdTA",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States. Rice",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NT04zlMz9soSsa_6bFVdTA/o.jpg"
      },
      {
        "img_id": "OyO31UMjHKR561eWA35mTA",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States. #35 Peanut Chicken dish",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OyO31UMjHKR561eWA35mTA/o.jpg"
      },
      {
        "img_id": "iTW-BNfrqF7O89X_-A_Dlg",
        "caption": "Photo of Thai Lahna Restaurant - Phoenix, AZ, United States. Menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iTW-BNfrqF7O89X_-A_Dlg/o.jpg"
      }
    ],
    "user_id": "TQo2DFe6O6LWALv_awgcCQ"
  },
  "W0Q4MdGzIitLcjHWygK6hg": {
    "date": "1/13/2016",
    "text": "The Waitress & the cook were extremely rude!  I walked out and won't be back again.  They also don't serve Phat Thai on the lunch menu, which I found odd, since it's such a favored Thai dish.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1l32cSfvdHYs67G_zzhOsw"
  },
  "SVAtM8A0pHa1eIVH8nhqyw": {
    "date": "1/9/2015",
    "text": "I just moved back to Phoenix from New York and was set on finding an authentic Thai restaurant. I was really impressed by this place and would highly recommend it to anyone looking to experience traditional Thai cooking.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pl_vSicLWDRw-XV26VM6Ig"
  }
}