{
  "aBwhIHMdlHpiXOT_Za3nLA": {
    "date": "2/23/2016",
    "text": "First time here and very good experience.  Good food and very friendly ppl. Very happy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "BECnTFF9fhIyxg9CiKEaqw"
  },
  "O-BUGQQ0MDhXu7dDl95Pxg": {
    "date": "1/28/2010",
    "text": "I visited Phoenix and tried about 5 different Mexican restaurants, and this by far was the best one- fresh, hearty, and reasonably priced.  They had absolutely delicious, freshly squeezed juices- Cantaloupe, Pineapple, and Watermelon- they topped it off all the time, absolutely great.  We also got their guacamole which was good with cheese on top.  Their chips were stone-ground thick and grainy, crunchy chips (not the thin, oily chips I've gotten elsewhere) and their red chipotle and green pico de gallo sauces were thick, creamy, and super fresh (not like I've had at other places).  They all tasted lke they were just made in mortle, pestle, and blender in their kitchen.  I got their Filet Mignon with melted cheese on the bottom of the plate and sauteed veggies on top.   Very good, meat was very soft and cooked perfectly, worked well with a good combo of cheeses and the veggies.  Came with flavorful, soft rice and beans- all worked very well together.  My co-eaters got the duo stews (with chicken and pork) and something else which they both loved.  It's decorated well with lots of festive colors.  Go visit this place and support it!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "y8jJV4AeH6ZEBagQ_ys8KQ"
  },
  "ma218yJIQwld4ogzNY3S_A": {
    "date": "5/20/2014",
    "text": "This was my second time here and I enjoyed the food, but spending $28.00 on a plate of Mexican food just doesn't sit right with me.  Bario Cafe just down the street, while also expensive, does a better job.  I don't think I will be back anytime soon.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BqE21d_vGACZFU2U8dCRSw"
  },
  "bR7_vN1GaJJX6oHquADO8Q": {
    "date": "5/21/2014",
    "text": "Wow, this is a really great Mexican restaurant.  I first went there about a year ago and was quite impressed.  Tried it again with my wife and friends this time and everyone thoroughly enjoyed their meal.    I'll try to come back to this place each time I'm back in the Phoenix area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vruD9SXf04GGZ453xDhtTA"
  },
  "bBNWe9FL8_YenTrwFZEYSQ": {
    "date": "4/28/2012",
    "text": "Great atmosphere, incredible food and good service. It's a cozy, soft- lit oasis that serves authentic Mexican favorites like chilaquiles and mole. The guacamole and salsas are to die for. They also have a great lunch menu. The servers are attentive and polite. One of my favorite places in Phoenix!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eDqH7Gr6Pqo7adfZwfQetg"
  },
  "ZRUVAa1If_Y4hYUiYumqNQ": {
    "date": "5/10/2014",
    "text": "Do not let the flourescent pink facade scare you! This is arguably the very best authentic Mexican cuisine experience you will ever have the privilege to experience in Phoenix. I grew up here, born and raised here in the valley .... I now live in another valley... Of the silicon type and I can assure you we have nothing like this that even comes close anywhere in California! I've been all over the planet for work and pleasure. These guys do the real deal! And... The best part is that while it's easily 5 star food, it's totally affordable... We ordered 4 margaritas, a great shrimp dish to share, table side made guacamole and with tip it was $55 out the door! All ingredients are ultra fresh and home made! Including the simple syrup in the margarita!  An amazing destination restaraunt for date nights, etc. highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3X6sa62CczV9i_NwcRgsDg"
  },
  "tW41exZGW2OoA8OANKSF2g": {
    "date": "3/12/2015",
    "text": "This place not only has good authentic Mexican food, but it's delicious, reasonably priced, and the staff is very friendly. It is a family owned restaurant. I highly recommend this restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EHYsjHJIX7IHcgE13k4vmg"
  },
  "JIdN0-z4Xf0anabrciRJVw": {
    "date": "12/27/2014",
    "text": "I have been coming here for over 10 years.  It's about time I write a review.  Awesome date night location. Best tortilla soup hands down. We get it every single time we go. We also get the crepas de cajeta when we have room. The tinga and sincronizadas are pretty good. The tortas on the lunch menu are freaking amazing. It's a little on the pricey side, but I am blessed enough to swing it no less than 14 times a year.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W8GKODV2omcrux2tpHuTtQ"
  },
  "zOWMmgouRreTvPWS4MTXJg": {
    "date": "5/27/2016",
    "text": "I live nearby and never thought to try until I saw the Check Please show and it looked good. Went yesterday and enjoyed the food but thought it was way too expensive for lunch! Should have checked my bill closer. They charged me a $9.00 open bar fee!  I only had one Margarita that they charged me $6.00 for. I only asked for a little additional Pico and we got extra chips that we did not ask for. Tried calling them but no one wants to answer my question and they tell me to call back in 10 minutes and then again after 2pm..... The food is okay but not worth the price. After tip for two people I paid $60.00!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-2IwTzPT4DB4tcFKdZZqtw"
  },
  "mh-Lj3pOhqzoHXdYwlvxWw": {
    "date": "2/24/2010",
    "text": "3.5 stars rounded down to 3.   This restaurant has somewhat of an identity crisis. Also known as \"Asi Es La Vida\" (you can find reviews on Yelp under that name as well) from the outside it looks like kind of a fun, colorful Mexican place. Then you enter (through the back door only) and you are confused by the decor. Fancy linens, silverware and plating say \"fine dining\" but the uber colorful walls and standard Mexi-decorations on the walls send more of a \"home cooking\" message. In fact, the restaurant is oddly shaped and seems like it was once someone's home, or store front, but definately not a restaurant.   The service is impeccable, and again, a little confusing. The waitress placed my napkin on my lap for me and was extremely friendly, then took 20 minutes to bring chips and salsa to the table.   The menu is pretty limited and fairly priced. The food though, leaves something to be desired and is, again, a little manic. Take previously mentioned chips and salsa for instance: AMAZING salsas. Very fresh and very delicious, they were paired with some of the crappiest chips I've ever eaten at a Mexican restaurant. Very strange.   Their Agua Frescas are also amazingly refreshing. Freshly made and free refills, booya.   The food, while good, missed the mark just a bit. My buddy had the chilequiles (a personal favorite of mine) and I had the Recalentado (Mexico city for left overs) which is Cochinita and Chicken Mole. I felt the cochinita was a little too sweet and citrusy while the mole was a little too savory. Again, something just not right.  Both plates were good and all but, as I say, weren't over the top delicious. Both meals, drinks, and tip took us to about 25 bucks.   I would definately eat here again, but not sure that I would go out of my way to head to this place....",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "K1r3vc3zH-kHyo3FgkQkaQ",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. The Sign",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/K1r3vc3zH-kHyo3FgkQkaQ/o.jpg"
      },
      {
        "img_id": "FF0dSpHcnQUSF0IOEd739g",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. The Restaurant",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FF0dSpHcnQUSF0IOEd739g/o.jpg"
      }
    ],
    "user_id": "l_7FtKIGjqYXagtDjVdN7g"
  },
  "LGVYs6fcJuQ-_Fzt-I5Ygw": {
    "date": "7/24/2008",
    "text": "I was enchanted just upon entering this place (see pics)  It only got better once I was inside even though it was a pretty small place , approx. 10 tables.  It was dark for ambiance but brightly decorated, white linen tables, fresh flowers on each table, parrots mirrors etc.etc.  We started with the Guacamole and tostadas with a salsa trio  (see pics) Pico De Gallo, Chipotle and the most Divine Fresh Tomatillo Salsa I have ever tasted, I was literally eating it with a spoon once the chips ran out!  Everything was so fresh and tasty!  We also ordered a Watermelon Agua Fresca which was so refreshingly delicious, even though I'm not sure it was a good mix with Mexican food (we took it to go)  I ordered the Enfrijoladas: Homemade corn tortillas filled with chicken and topped with a black bean sauce (see pics) WOW! This was so Perfect I can even begin to tell you how Much I LOVED it!  My guest ordered the Farolitos Al carbon with Chicken (see pics) The taco came with rice speckled with fresh veggies like corn and chiles along with a bowl of soupy pintos. Another Amazing dish even though the tacos were pretty spicy overall it was all very fresh and flavorful.  Unfortunately we did not have room for dessert , but that's just one more reason to come back.  Did I mention the waitstaff team.......Impeccable service!  My glass never emptied, in fact It never even got half full.  I can't forget the man on guitar ,I mean  who doesn't love being serenaded during Lunch!  A Definite Must Try Folks! You Don't Know What Your Missin'!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 8,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "9QCuipwZrrJMqadm7VkcGA",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Frijoles",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9QCuipwZrrJMqadm7VkcGA/o.jpg"
      },
      {
        "img_id": "MZWgLva3z09ecK6zfUvv0g",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Farolitos Al Carbon with chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MZWgLva3z09ecK6zfUvv0g/o.jpg"
      },
      {
        "img_id": "pu7Af8BAjW4w7adQZzF7MA",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Enfrijoladas: totillas filled with chicken topped with black bean sauce",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pu7Af8BAjW4w7adQZzF7MA/o.jpg"
      }
    ],
    "user_id": "pQdIIsbV5dGOVz_kWfMRTw"
  },
  "hHV4vvQWI7fEI6Rz7j2kjg": {
    "date": "2/9/2015",
    "text": "I enjoyed the atmosphere and art. The food was very good and just the right amount.  Laid back and eclectic.  Great choice for Mexican food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "49fiE6XCAQ5qvAmAMM95OA"
  },
  "8opzMzIPhuJlajDR-NaNJw": {
    "date": "9/3/2006",
    "text": "This joint seems fairly unassuming from the outside, but inside it's brightly painted with colors of traditional Mexico. The staff is really friendly and the food is excellent. From the shrimp appetizers to the tortilla soup to the chicken enmoladas, they've hit a home run each and every time I've been there. The agua frescas are a perfect complement to the meal and are strongly recommended. The only downside is the place lost its liquor license some time back so it's booze-free, but you wouldn't even notice it because everything else is so good. The warm atmosphere is an added bonus - something many ethnic restaurants fail at providing.  Definitely a great stop. I say forgo your hankering for Filiberto's check  this place out atleast once.  EDITED SEPT. '07: Seems like Asi Es La Vida has had some issues with the Maricopa County Health Department. Knock a few stars right there. And they're STILL waiting for their liquor license? Uh, it's going on almost two years now. Something's not right with this picture.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "rnEherIQD8NkTMXqucg3HA",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rnEherIQD8NkTMXqucg3HA/o.jpg"
      },
      {
        "img_id": "rZx5LaqSsDSi510O5DhOlQ",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. The front dining room",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rZx5LaqSsDSi510O5DhOlQ/o.jpg"
      },
      {
        "img_id": "nw-iSYetzFPsWurDDyK4vg",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nw-iSYetzFPsWurDDyK4vg/o.jpg"
      }
    ],
    "user_id": "AKXqbuifvfvNEpr3Qs51hQ"
  },
  "cZ5U-K3vBQQ9OhogJ-yMLg": {
    "date": "3/25/2013",
    "text": "Romantic or cozy, depending or who you're with.   White table clothes and full places settings. Entrees are $15 and up so don't be fooled by the $$ rating.   As intimate and high style as it might be you wont feel out of place in shorts and a t-shirt.   The service was friendly and attentive. The menu is creative and tasty. The food is delicioso. Even the stews are light. The ingredients are fresh and well prepared. The plates are beautifully presented.  I had the slow roasted pork in an orange sauce and my what a dish. The pork was tender, juicy and plentiful. The orange sauce was an odd but perfect compliment. The rice was light and loaded with vegs, The black beans were meh (the low spot of the meal) but add a little of their wonderful salsa and you're set. Did I mention the warm and comforting corn tortillas. If they weren't fresh pressed I'm crazy and served warm.  This is not the mexican food you see where I come from (Tennessee) where the ingredients are mounds of plopped refritos, fake saffron rice and slathered in cheese. I do love that stuff but after the meal at this shrine to Frida Kahlo. Asi ES la Vida, por supuesto!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7rpkaDNGa6Fp6EYRPDLu6Q"
  },
  "9PEN2wWSWqSGOvgZuIoAAg": {
    "date": "8/6/2014",
    "text": "This place takes such care in their food preparation... Their entrees are always top notch. This place is much more upscale in their food and prices, but I think is well worth it for the ambiance and the food that they serve.. We shared an appetizer and an entree and it was plenty of food. We live right down the street, so I would love to see this place continue to do well. It has great servers and was a great experience...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RTElp42I8CzRWNhe5gp-iw"
  },
  "je0YEJwMFHjhuOuNF4M34w": {
    "date": "6/26/2014",
    "text": "This is great quality mexican food.  I've had two dishes from here.  The green chili enchiladas and the Torta...... Great food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1-4ssy_zv7zKIFTofPCM6g"
  },
  "D1DTlK_drnwWEeGDuBfg2A": {
    "date": "10/1/2013",
    "text": "Food was authentic and yummy, although a bit cold.  Not sure if it sat too long in the window, but the huge shrimp would have been excellent-had they been hot.  Service was fantastic!  Will be going back for hopefully hot food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "FSg0NHSOE_sinIph6fTtQw"
  },
  "M3CLhfbDpq3pAneusMZ8Cw": {
    "date": "3/4/2014",
    "text": "Don't be fooled by the (not-so-appealing) purple exterior and sign out front; this is a cool, stylish place inside with some quality food. I went for lunch and enjoyed the mole chicken enchiladas -- outstanding, though the portion was small for $9.99. Chips with fresh guacamole and salsas was a good choice; otherwise I probably would have been hungry after. It only came with a few chips (not enough), but they brought more as soon as we asked. A friend got the black bean sauce enchiladas (I think) and seemed happy; he said his tortilla soup was tasty but could have used some vegetables or something, because for most of it he was just spooning broth. He seemed a lot happier about the margarita; there are a lot of options for quality ones there. No problems with service. The place was empty at prime lunch time.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rg0LvIIHcoeakmncJjz2IA"
  },
  "B65gXXmAcyQ0uyDxgdz_kw": {
    "date": "2/8/2015",
    "text": "The service was very good our waiter was excellent.  The only thing is the food proportion was very small for the price. I left hungry that's all I have say. The waiter was awesome.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N_qgZlhySSXauBd4THotgw"
  },
  "859h257nLdToTZU10CQgRA": {
    "date": "5/3/2014",
    "text": "The last time we had such amazing food was definitely in a fine dining establishment in Cabos. The flavors were amazing of everything everybody had in our party. The margaritas were awesome. Two brothers and a sister own this place. They are amazing, courteous and so hospitable. A must go to place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mR0N5-ypFf2lFZn8SJ-cUw"
  },
  "wh4Rl3gQJpiV9fjslbZjuQ": {
    "date": "6/24/2016",
    "text": "First time here-saw this Check Please Arizona. This place is fine dinning Mexican food!  Everything was delicious. The scratch made margaritas were perfect.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sOKyiDaGrSE5oKvOuutKmQ",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Fresh made guacamole",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sOKyiDaGrSE5oKvOuutKmQ/o.jpg"
      },
      {
        "img_id": "NaUMLI-RqsHH50H4w59mMw",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Cameron Al Mojo De Ajo. Jumbo butter fly cut shrimp with garlic and olive oil. The side corn dish was fantastic.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NaUMLI-RqsHH50H4w59mMw/o.jpg"
      },
      {
        "img_id": "gQVIh4G4Jo3HK8Qcpfz-QQ",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Filet mignon-felete Es La Vida. Topped with poblano peppers on a bed of melted house cheese",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gQVIh4G4Jo3HK8Qcpfz-QQ/o.jpg"
      }
    ],
    "user_id": "kZ_9dajk4lbQfUtCfw6zMA"
  },
  "rNCJrrPXfwP9lQQPuu6Uuw": {
    "date": "4/1/2017",
    "text": "Good food, very nice service but very overpriced. Don't order the sea bass fish entree, comes in a white bland sauce. Filet mignon chipotle was good. Guac was good, not great and the sampler was a good way to try the chicken mile, pork stew and shrimp poblano dish. $144 for that? We had a few drinks but still I'd rather go to Bario!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "80PRx8kcU2BK7IRB2gjCBA"
  },
  "kNeRqpvV3tPjBdiigynwzw": {
    "date": "1/20/2018",
    "text": "Fantastic family run Mexican restaurant in the neighborhood.  Friendly, knowledgeable staff and amazing food.  Rare to have this kind of service in any Phoenix restaurant!  Mole to die for along with guacamole and two yummy homemade salsa's to complement any meal.  Highly recommend and will be back again soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qoc45drIPrbbP3_AKEo3Nw"
  },
  "O8K0RELDYGbOExZfeP6J8g": {
    "date": "3/11/2017",
    "text": "Excellent atmosphere especially when the musician is there adds a subtle tone to the environment.  The waiting staff is friendly, and the food is delicious -- authentic Mexico City and Yucatan style food.  One of the nicer (white table cloth, $15-25 plate) and better Mexican food restaurants in the valley.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_srSHBxGU9y0EkTFgd3JBA"
  },
  "dV5aX9r1uC5H5J4hWnJZpQ": {
    "date": "7/13/2016",
    "text": "Beautifully prepared, generous portions, flavor for days. The atmosphere was cozy & intimate. The singer/guitar player is very talented; we sat at the booth to the left of his station & the sound was not overbearing at all. I took my leftovers home & had them for breakfast the next morning. There isn't really a selection of vegetarian dishes on the menu, but the server was extremely accommodating & rattled off an entire list of meals that the chef could prepare as vegetarian. Will absolutely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ztWicZSlrw82Ri0aqKF-MQ",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ztWicZSlrw82Ri0aqKF-MQ/o.jpg"
      },
      {
        "img_id": "7y0IdF0X1gKRdNiSidd1Eg",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7y0IdF0X1gKRdNiSidd1Eg/o.jpg"
      },
      {
        "img_id": "08DSzU0WSUoK-sMSBbfNDQ",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/08DSzU0WSUoK-sMSBbfNDQ/o.jpg"
      }
    ],
    "user_id": "u6QlCukJyp8Lc4An-znIKQ"
  },
  "tVhmTfeGZxjQFzEBRNTr_g": {
    "date": "7/11/2017",
    "text": "Amazing food and I love love LOVE THE DECOR paintings of Frida khalo . The outside of the building is bright pink which makes me even happier I love how the waitress was extremely helpful to my friends that didn't know what some of the things were. I was little discouraged when I saw they didn't have a vegetarian plate but then the waitress told me about it and told me they would be happy to make it for me ! Super helpful and great service will be returning and recommending this beautiful gem",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fir113Nv1VUw3DqOOholzQ"
  },
  "BEgwIjJ8F4YABfAnbnGbQg": {
    "date": "4/17/2017",
    "text": "We had a wonderful experience. I love the ceramics and bird motifs and Frieda Kahlo and Diego Riviera tributes. The sangria was to die for. Loved the aztec lamb and the flan and the homemade guacamole.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T6XIvv52T6FyFxCF8GmKKQ"
  },
  "KQlTNUw49u8BkNZAPfj-sQ": {
    "date": "5/22/2016",
    "text": "In town on business. Used Yelp to find this fabulous restaurant. Delicious. Charming. What a pleasure. I had one of the steak dinners. Yum!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q23RLuvpJi--M67V7H-Yng"
  },
  "QV8pfsGFNRiYEApVt3KLEw": {
    "date": "5/21/2017",
    "text": "This was my first time there and I was very pleased with my chicken enchiladas mole. Also tasted my friends pork dish and it too was fantastic. Desert was a chocolate flan type dish and very rich and smooth. Staff was very helpful and attentive.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t4MGifRN4TpK_0edkQZtxQ"
  },
  "G_4ZeBnRPWKZdfn1RCdyfw": {
    "date": "6/24/2017",
    "text": "What a wonderful dining experience. The food was excellent, the service was attentive and the dessert was scrumptious! Highly recommend this to all who want authentic Mexican food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qnvwWqxPWmrFwCO2yhHnDw"
  },
  "t2CjGWbC2Vo3uWTn_8BRTQ": {
    "date": "10/26/2015",
    "text": "Wow great restaurant and amazing food. I'm really impressed that this place doesn't have more than 300 reviews !! This night they had a Really good seafood special serving and that was what my wife had to order really fresh and just made right. I order a steak with some tortillas with mole on top, but before that We had some appetizers that could been better! Wait I can't forget about margaritas and tequila selection! I order a Cadillac margarita and it was made with fresh lime juice Don Julio and Agave with Grand Marnier float outstanding!!! They know how to make an original traditional Margarita",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "UIQNGUmeqg9VoSAHr2CYDw"
  },
  "koRFXooJN-ywEkvEhVpNfg": {
    "date": "2/1/2018",
    "text": "very good lunch and dinner menu! i am a regular there for lunch, casino plate is what i get",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0F7skRSfURAuHsQsXHx8mw"
  },
  "u5bgS6WPpPUjVlOutFVZ3w": {
    "date": "3/9/2017",
    "text": "Parking is pretty small, other than that this place is great! Their setup is beautiful as well as their decoration. The customer service is rather EXCELLENT! Super friendly. They do have different lunch and dinner menus, just a heads up. The different salsas are all good and the food is just delicious. Full bar, one of the best micheladas I've had. Will definitely visit and send more people this way!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ip1Uwju75i4T25px35cMdA"
  },
  "eVOULHHU9fVDH23TQLJ90A": {
    "date": "6/13/2016",
    "text": "Myself and 4 other people in my party had a fantastic meal at Asi Es La Vida this evening.    2 people in my party ordered Camaron al Mojo Ajo dinner which they could not quit talking about - the chef cooked the Jumbo butterflied shrimp to perfection - and these were seriously large jumbo shrimp! My other party enthusiast order the special of the night which was also some shrimp meal which she ate ever last spec on her plate.  Lastly my other friend and I had different filet mignon meals.  I did taste her meal which was the Felete Asi Es la Vida and it tasted wonderful; however, I had the Filete Chipotle (minus the chipotle sauce) which was extremely delightful.  I did order a sampler appetizer for the table which the waiter stated would be wonderful addition for our table and everyone ate everything.    For dessert we had an ice cream crepe which was so good I wanted to order another one but thought maybe I shouldn't.  Here's a True testament... I do not really care for Mexican food but my friend wanted to go to the best Mexican restaurant and I had asked some locals where the best Mexican restaurant was and they told me it was this place and that is and my friend said it was absolutely the best Mexican food she has eaten at.  And me personally not caring for Mexican food, I now love Mexican food and I love this restaurant. My birthday in on Wednesday and my friends already asked me where I wanted to eat and I said Asi Es la Vida - so we will see if I get my birthday wish :)  Anywho - great experience - love the staff and loved the food AND make sure TO definitely order the ice cream desert.  Respectfully - Mikasa Barton  Sent from my iPad",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1oL3Q_XWZe0x4NBClIotnA"
  },
  "1imSl2U-lbtYG6_pgBQLgQ": {
    "date": "1/10/2017",
    "text": "Stopped by on a fluke. Was actually going elsewhere when driving by I mentioned to my son had always wanted to try this place. I'm so glad we did. Tortilla soup, ceviche were delicious & flavorful. I had the filet mignon along with the rice & beans. I don't find many places that can make black beans that good, if any, however the chef here has mastered it. My filet was smothered in poblano which I love. Tender & flavorful. Our waiter was engaging, helpful & knowledgeable about the food & drink - what a breath of fresh air. The decor is cozy, beautiful & eclectic. Fresh flowers & white table cloth on the tables give that extra little touch of elegance. I thoroughly enjoyed the evening. Will be back... with guests. Thank you so much for a memorable evening - not just a meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rXDqOtMie36VjQMLQdwHsA"
  },
  "yUPq_DaD-mI9StKfctsG8A": {
    "date": "11/1/2015",
    "text": "You know,  there are a great deal of Mexican restaurants here in the Phoenix area to choose from, but I think this place is worth a try for anyone looking for some quality Mexican grub! Excellent ambience and there are different daily specials that might not be on the menu as well. Make sure to ask your server for any of those specials. Friendly staff make this place a great place to visit time and again. The chips are only okay but the three styles of salsa that they provide are amazing! We tried a couple of the desserts and really enjoyed the Tres Leches cake and the chocolate flan!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "hvI4AyN_UrI2NJzByM0GWQ",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Tres Leches goodness!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hvI4AyN_UrI2NJzByM0GWQ/o.jpg"
      },
      {
        "img_id": "zqGEtNhOKCmhW6C5wHN6fA",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Cool ambiance here!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zqGEtNhOKCmhW6C5wHN6fA/o.jpg"
      }
    ],
    "user_id": "iFmGKI47ic0jbpTnQZf2Ng"
  },
  "YW-5NfLhImWweV-Wvw30eg": {
    "date": "6/25/2013",
    "text": "Three words... Authentic Mexican Charm.  My mouth and soul smile when remembering my experience at Asi Es La Vida. This is NOT your typical Mexican food place. The food differs by offering a more Southern Mexican palate. The food is top quality and prepared by a master of his craft. I have NEVER tasted Mexican food like this in Phoenix, therefore Asi Es La Vida is the place I will return to if I am craving it.  From the Frida gallery to the classic Latin music, this five star restaurant is an experience all Phoenicians must experience. Exceptional service, one of a kind plates and culture at it's core. What more can a girl ask for?  Five stars respectfully given to Asi Es La Vida.  Muchas gracias por su comida hecha de corazon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "9rlCyThc_I7OUEnHkTVRjw",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Back entrance.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9rlCyThc_I7OUEnHkTVRjw/o.jpg"
      },
      {
        "img_id": "iIFUGOPg_RLY_OgaibyQdA",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Ceviche!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iIFUGOPg_RLY_OgaibyQdA/o.jpg"
      }
    ],
    "user_id": "ens0W1AzB5ogdKSaTVd38g"
  },
  "WA0w-LVHdxDy-qeTmnM5Gw": {
    "date": "1/12/2017",
    "text": "Delicious  My husband and I just moved to the neighborhood and will definitely be visiting this restaurant often. Great appetizers, dinner and dessert! The ambiance was nice too with a great guitar player/singer right next to our table.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VNr_naWHb8XGB-2ibLb5jQ"
  },
  "pliJze6Bs7ynooG7tbQHkQ": {
    "date": "12/9/2016",
    "text": "We had such a wonderful dining experience! The food was so delicious. I think they make my favorite mole sauce of all time. Also the relleno de rey is out of this world delicious. We will def be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1lnHICUqli8xLJnKlIH1FQ"
  },
  "FTk-eIfi8_AbiFKL6YiYdw": {
    "date": "7/14/2015",
    "text": "Overpriced and out-dated. Simple things like the pico were obviously old (mushy tomatoes, soggy onions), the camaron crepe appetizer was tiny and they used iceberg lettuce as its garnish. Ordered a $26 filet minion medium rare and it came out medium well. All other dishes were just barely warm, not hot and definitely not fresh.   The main dining room smells like rat turds: literally. Years ago I helped a friend remodel a house that had a severe roof rat problem: it's one of those smells you wish you could forget. This place sucks. Go to Barrio Cafe if you want quality upscale Mexican cuisine.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NhmphSLfLLI4FY_C_q3SVw"
  },
  "_FZGFPHfDmpe5fCk0PB-_w": {
    "date": "5/17/2009",
    "text": "Took two girlfriends here who had never been here...everything was perfect. I got the Filet Mignon which is smothered in green and red peppers and onions and placed on a corn tortilla which is covered in cheese with fresh slices of avocado with a side of black beans and rice pilaf! While my friends had the new york strip steak and the some other 3 cheese entree. The food was all amazing the service was excellent. I finally got to see the Mariachi player play guitar and enjoyed the ambiance of this place very much...I almost didn't want to Yelp about this place...and wanted to keep it a secret...but I would rather that people go all carrot mob on this place so it stays in business. One of the best places I have been to eat in phoenix. Truly deserving of it's five stars rating.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "DMHPVjHKaUStUBMPH2TjNA"
  },
  "DgST0ekfnLXUR2W1yzC-0w": {
    "date": "3/12/2006",
    "text": "Words cannot describe this food.  It is a True delight to dine here.  Authentic upscale Mexican food.  You will not find chips and salsa here.  You will find amazing shrimp dishes, an array of freshly prepared salsas and watermelon juice.  Cozy, colorful, and wonderfully unique.  Lunch is a total bargain.  Dining is a little pricey but totally worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "ExI15M-oXjHcF42-G1xv9w"
  },
  "3JyGV1aPIweWWdizARAztw": {
    "date": "3/23/2011",
    "text": "So the update is, dinner is even more amazing than lunch.  And then we went back again for lunch, and it was even more amazing than dinner.  The service is purely unbeatable, and the food is right up there with the service.  At this point, I would just get the chef special or whatever the waitress recommends, because I've never been let down.  And definitely get the pineapple juice.  All you can drink for $2.50, fresh and delicious.  And the guacamole?  I'll let you try that for yourself, let's just say it might be better than my own.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "VWDL0VgQ2ivpN3oYhL_WsA"
  },
  "urXev71E_knCnRSvMGEhAA": {
    "date": "5/17/2010",
    "text": "I've been passing this interesting looking place for years, 10 in fact, and finally this last Sunday with little else open I did a U-turn and popped in. The colors made my eyes pop! Just sitting in that beautiful renovated home and viewing the colored plates and white napkins in beautiful glasses with linen on the tables made me feel romantic. Well it was Sunday morning, and therefore I was very hungry. We were the only one's there but the waiter was so nice to us and took time to explain the specials and told us of their many freshly squeezed juices. I had pinneapple juice which was wonderfully flavored, Tortas, and homemade guacamole sauce. I was blown away, the chips were actually made there and real tortilla shells. He said weekdays were busy at night but weekends were rather empty, lunch crowd perhaps. Either way I definitely will go back and wish I could bring a pretty senorita with me in all her glorious spanish heritage to have an exquisite night in this cozy setting.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "RAeQit8R2rGFYKj7-RkiPw"
  },
  "f2dgL0XhHBo4RMxnM0b2kQ": {
    "date": "7/23/2011",
    "text": "Went for lunch.  Atmosphere is pretty nice, but I'm a fan of food, not mood lighting.  The food was decent, but the servings were smaller than I expected for the price.  For lunch, I ended up parting with about $16, which is pricey for a midday meal.  Otherwise, service was good, and I'd probably go back on a date.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uMfGOyETFJ0l_YdhwWJIDg"
  },
  "ZgMuIUzpoeGHFkBDWK5NJQ": {
    "date": "8/28/2008",
    "text": "I had a great time at Julia's UYE here!  I was not sure what to expect, and I had a really good time.  I was not impressed by the restaurant however.  The place in funky and fun, and I really liked the eclectic decor.  The people are very friendly, and the food was tasty.  I had a great soup that I enjoyed very much. HOWEVER, I feel that the staff took advantage of our entire group.  Two people ordered small appetizers in which the staff took the opportunity to turn into multiple, small, $25 appetizer plates. We were not expecting this, and it inflated our bill dramatically.  I would say there was a little bit of a language barrier between us, but the staff certainly was able to flatly say they had explained it to us.  I feel we were  treated rudely, and our bill was deliberately inflated as no one else was in the restaurant.  The food was good, but certainly not worth the price, and although I will forgive many breaks of service, when it is done deliberately, I will not go back.  All in all I had a wonderful time with the group (thank you all!!!!), but I will not return here on my own.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "h1DCfD9A-QbDj4EeqRbDmw"
  },
  "HZcAAJzmdDElstvwjKWgPg": {
    "date": "9/18/2016",
    "text": "S invited me down to check out Asi Es La Vida for lunch and I am glad I did.  The restaurant is a cute little place on 24th street with great decor and friendly service. I would say the interior is tastefully done, the noise level was appropriate and the service was efficient. S and I both ordered the Torta lunch special ($7.95) and a drink ($3). The sandwich was really good and similar to a Cuban. Tasty roasted pork with cheese. Good stuff. I think the price for the drinks was a bit on the steep side, maybe $2.25 would be more appropriate. Also, our friend T joined us because he was in the neighborhood but had already eaten. So he just ordered a soda water with lime ($3). Now unfortunately, I have to get on my high horse here. 3 bucks? Really? It's water that's fizzed up by the carbonation in the soda machine. This should have been complimentary. If you bring a bottle of \"Club Soda\" and a glass of ice, sure, charge 3 bucks. But charging for water that's run through the machine is a joke. It's the little nickel and diming that will run your restaurant into the ground.  Since S and I both Yelp, we each got the five-dollar dessert for free offer when we checked in. I used mine and we got the tres leches flan.  It was good and S pretty much ate it all (he loves him some dessert), and it was free so no complaints here. It's a nice gesture. Good lunch value. Drinks overpriced. Charging for soda water. Friendly service. 3 Stars.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "Ewh8F9VHxWncvP5Wcsn1fQ",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Flan",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ewh8F9VHxWncvP5Wcsn1fQ/o.jpg"
      },
      {
        "img_id": "hF8vAsMfPu1W0xkr4M-4wg",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. $7.95 Adobada Torta",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hF8vAsMfPu1W0xkr4M-4wg/o.jpg"
      }
    ],
    "user_id": "5UYjT5YDKSuApFax2t2eqg"
  },
  "I7QKhn6cBp-gDALbpE4CUw": {
    "date": "7/28/2018",
    "text": "We are \"locals\" staying in Scottsdale at The Royal Palms for a nice stay cation and didn't feel like putting up with the snobbery Scottsdale can frequently deliver. In the mood for some good authentic Mexican, we found Asi Es La Vida. A little hesitant because we've had True delicious authentic Mexican, this place more than delivers! The ambiance is simply stated yet enough to take you away. Live music softly playing in the background and a gracious family that owns and runs the place. Our server Irving was a True delight. The food is THE BEST Mexican food I've ever had! I must go when in the area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5_gCPgsuj0keskSaR4Q0Zw"
  },
  "ebUbbGtqy0xrAM8cPdiDdQ": {
    "date": "6/19/2018",
    "text": "Wonderful, hidden Jem...  loved the food and service was excellent. Will come back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4niCWzP7cFqe8FKYMbWmIQ"
  },
  "gDzdGIzy4eJqEo-QeaaKDw": {
    "date": "4/23/2018",
    "text": "Truly a hidden gem - that is, if you call can a bright pink restaurant \"hidden.\" Family owned by lovely people. Friendly service with amazing food with amazing food. I will most definitely be back when I have out of town visitors!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fXCZo1wlba3kY7HjP9PnOA"
  },
  "HGA2h4FcFOoBUvABfYE6lA": {
    "date": "1/6/2015",
    "text": "Well, I finally made it to Asi Es La Vida. It's kind of sad how long this place as been on my \"to-try\" list.   First, I love the quirkiness of this place. Being an eccentric individual myself, I felt right at home. Why aren't more places in Phoenix painted in bright, happy colors. This is the hot-ass desert, we don't need more brown.   Second, my server obviously had a passion for the food. I mean, he was excited about it. He made me want to eat it. I was like, you know the joys of a good foodgasm, don't you? You and your suggestions can be trusted.   Don't you hate it when you ask a server for their opinion and they have none. Wtf is up with that? Just make it up for god's sake. That's better than a shoulder shrug. You will find no shoulder shrugs at Asi Es La Vida.   Lastly, the mole. I love mole. There are very few places to get mole in Phoenix. I don't understand why, because it is literally heaven for your mouth. Asi Es La Vida's mole is on the sweeter side, which is fine with me, because I like all kinds of mole. Yes, there are different kinds. And, like I said, yes to all of them.   Ok, I'm not done. I have one small gripe. A teeny-tiny thing that won't keep me from coming back, but damn was it a bad choice. It has to do with the fabric covering the booth seats. It's corduroy. Freaking corduroy?! Have you ever tried slipping gracefully into a booth covered in that stuff? Well, I have now. It isn't easy or comfortable. All of your fabric is catching on all of the booth's fabric and it's just a mess. I had to adjust myself so many times it looked like I had hemorrhoids. No, no, my butt is fine, it's just this damn corduroy!",
    "rating": 4,
    "rated": {
      "funny": 8,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "T8LqkYbwMPZmvXSsUfN8sQ"
  },
  "nS08IBfCQ-BwirDCfoNXZw": {
    "date": "10/13/2017",
    "text": "Just passed by and it looked interesting.. great little place and nice staff.. was very surprised at the size of guacamole you get for $8.00, not much.. equally surprised that they charged  $8.00 for a rum and coke and a beer was only $4.00.. too bad, I enjoyed it but won't be going back.. as a customer we look for consistency and no surprises..",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EGCAmPogwOqi6NUrt3zt_A"
  },
  "3yv9Fa4xY2eiH2fi-X9ttQ": {
    "date": "5/20/2018",
    "text": "In all honesty one of the worst experiences I've ever had.  Ordered Chicken tortilla soup that only had a few strips of chicken in a red broth.  No veggies, tortillas, rice, or zest in the broth.  Had to dump the itty bitty salsa that was on the table to give it even the minimal taste.  Marguaritas don't waste your money.  Our bill was $200 and the soup was my main course.  Three other people ordered but one was just a vegetarian dish. Hubby got a 4 pc shrimp dinner that was tasty & our other friend got Chilean sea bass that was okay.  I'm just saying it's very pricey for what you get.  The only thing that pops is the majenta color of the building.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RrujgsA0EZ6cZZVTcJCoeg"
  },
  "SfMQ_hkWC_shvehpqrNB1A": {
    "date": "12/15/2016",
    "text": "Super super overpriced. I share a dish with my husband and had one agua Fresca and one Bloody Mary and we paid 71 USD! Are you kidding me? The food was just ok... nothing outstanding. One friend of mine ordered the michelada and it sucked!! Was like tomato paste. We shared a dessert with my friend and was just ok... the only really good thing was the service.  I will not comeback to this place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5yDjKBIvVvN8KMnb9QoF_Q"
  },
  "yAG_SMP9X8GrPk9XZbxinQ": {
    "date": "3/13/2016",
    "text": "Just about every food guide for Phoenix pointed me towards Barrio Cafe as a \"must try\", so I decided to check out that award winning restaurant. But after being told there was a minimum one hour wait for a table and seeing $22 enchiladas/$12 tortas on the menu that included a heavy fusion-spin, I decided that it wasn't for me.  I looked up a similar Mexican cafe nearby that also serves traditional Yucatan and Mexico City style dishes, and ended up outside a building painted in purple-flamingo pink called \"Asi Es La Vida\". From the color of the building to the surreal Frida Kahlo paintings that adorn the walls to the countryside Mexican music, this place had the vibrant and inviting personality that I liked. In addition, the prices were a little more reasonable compared to Barrio Cafe, so I gave it a try.  Based on what I found on the menu, I determined Asi Es La Vida prepares regional Mexican cuisine with a Mexico-City flair. I ordered the recalendato because it combined two of my Mexican favorites, mole and cochinita pibil.  My lunch began with thick corn chips that reminded me of tostada. It was accompanied with two of the best tasting homemade salsas I've ever had. The red salsa was my favorite because of its predominantly smoky profile, while the green salsa appeared to be a more bright, a verdant puree of coriander-mint and green chile. They're more like thick dips rather than the typical salsas at taco stands which I find to be either too chunky or too thin, and overly one-dimensional (simply variations with increasing intensity of heat and no distinct smoky tones available).  I did not do my research so I got \"hustled\" by the waitress - I said yes to guacamole when asked (who would say no, I later realized guac and chips were not a complimentary side). It came with another plate of chips. The guacamole wasn't assembled tableside, but tasted like it was made one by one to order with lots of avocado pulp, so it was actually worth the extra $3.95. The amount of lime flavor added was just right, not too bright.   The main course was decent but not exceptional. It tasted like a comforting dish prepared at someone's home. The rice was super light and bland, the beans were not refried with melted American cheese (thank goodness not border-style) but instead slow cooked with white cheese sprinkled on top like it is done in Mexico. I thought that the cochinita pibil was prepared better than the mole poblano. For the cochinita, the meat was served in chunks rather than like pulled pork, but the marinade was balanced between acidic and sweet. The only improvement I would suggest is to cook it more \"picante\", it was flat and missing an accent. On the other hand, the mole was a big disappointment since it was overly sweet without a hint of spicy flavor. It didn't have layered, complex, or intense bittersweet tones of the mole poblano that I have eaten before. The mole wasn't something I wanted to lick off my fork.  Overall, Asi Es La Vida was a pleasant change of pace from the Sonoran, Tex-Mex, and Southwestern food that is popular in Phoenix. The service was attentive and the restaurant is family-owned. It's not a loud place like Barrio Cafe plus there is tablecloth, so it could work as a cozy date restaurant. The food was more traditional than contemporary-fusion style. To best honest, I wasn't blown away by the food, but it tasted better than the other Mexican food I ate while staying in Phoenix.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 10,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "B4aldy-9z4p8g45EIPK-QQ",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Corn chips with the best salsas in town",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/B4aldy-9z4p8g45EIPK-QQ/o.jpg"
      },
      {
        "img_id": "K8VxySOC1LCtY0kTtYOt_Q",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Lunch special: chicken molé, cochinita pibil, rice, beans",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/K8VxySOC1LCtY0kTtYOt_Q/o.jpg"
      },
      {
        "img_id": "pGI99NqEeZ7FUVsdl2T9GQ",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Guacamole made to order ($3.75)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pGI99NqEeZ7FUVsdl2T9GQ/o.jpg"
      }
    ],
    "user_id": "YHr-ijGyWQg3hsP-sEEl4A"
  },
  "81ZpSHeG2ZIOSpErccpyIQ": {
    "date": "11/8/2014",
    "text": "ENVIRONMENT - A more upscale Mexican restaurant. Great for a nice date night!  SERVICE - Very friendly and helpful  FOOD - Overall, i thought it was a bit too pricey for what we had. I'm not an expert on mexican food and don't have it often, but here's what i thought. + Carne tampiquena $18 - steak, rice, guac, and refried beans. Again it was okay... Nothing special..I actually prefer the striploin at other places, maybe mexican just isn't my thing.  + camaron al mojo - $25. I dont think this was worth it. It came with 4 shrimps which weren't that flavourful. There was also salad, corn, and rice, along with some garlicy bread. Not worth $25.... It didn't impress me.  + queso fundido $6 - this was an appetizer. I mainly got this cause it has nopales (CACTUS!!).. It's my first time travelling out west sooo yeah. This was maiinly just mushrooms and cactus cooked in melted cheese which you put in soft tortillas. The nopales just taste like green peppers, and the dish was just okay.   + margarita $6 - strong! But mm drink,  Don't forget to check in to claim your dessert! They gave us 3 types of desserts to choose from. We got the chocolate flam which was pretty decent. Soft and spongey.  But i'd probably wouldn't come back.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "ip_1lbYg964kfl5vjxmZBA",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Flan - the free dessert from Yelp checkin offer",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ip_1lbYg964kfl5vjxmZBA/o.jpg"
      },
      {
        "img_id": "UVgafm_5v7PD5D34xMpfqA",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Carne tampiquena $17.95 - thin sirloin",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UVgafm_5v7PD5D34xMpfqA/o.jpg"
      },
      {
        "img_id": "mSQkOOiZl63aGwRhMFkeSA",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Camaron Al Mojo $24.95 - shrimp dish",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mSQkOOiZl63aGwRhMFkeSA/o.jpg"
      }
    ],
    "user_id": "WVTxk0-DxPKJ7TckvUx_dA"
  },
  "CFdNtHL7ljn_Fl3gOigJdA": {
    "date": "6/19/2017",
    "text": "They have good and variety on entrees. Good price for really good and tasty food. Great service. Pleasant environment.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KEgZALXE8rOmcUACWwmfzg",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KEgZALXE8rOmcUACWwmfzg/o.jpg"
      }
    ],
    "user_id": "fCftn2ICg0CswBIUSdSbKQ"
  },
  "t1DZToYcsoVd9kAJ2Gc3kQ": {
    "date": "10/8/2016",
    "text": "The building is pink - do NOT be deterred.  Enjoy Live music, upscale Mexican with superb mingling of fresh flavors.  We loved the the Filet with poblano peppers and grilled onions.  The Crepa de Cajeta dessert is superb. Our server Irving was passionate about the food and made great recommendations.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "v_sIgWAimCVl2UPvAnl2eQ",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/v_sIgWAimCVl2UPvAnl2eQ/o.jpg"
      },
      {
        "img_id": "9EBNbUHN0IVvWOcPDJgdgg",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9EBNbUHN0IVvWOcPDJgdgg/o.jpg"
      }
    ],
    "user_id": "gJrKGm1RlNmc8HlWXrNInw"
  },
  "MdbUWNvyODiLH-i8SToV5A": {
    "date": "5/24/2016",
    "text": "I can speak to a few things of excellence...and anything I didn't try I presume is amazing.  Guacamole and tostada chips. Mole Cochinita Pibil Veggie Quesadilla Shrimp Dinner  All 5 out of 5 for sure...service was very family oriented and felt like eating at someone's home...I'll be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GlBLmwSWjt4o-5upEDwsEA"
  },
  "hy01zPdCtHRPxZEunv-EmQ": {
    "date": "11/3/2017",
    "text": "We've been here twice. We don't review unless the visit warranted comment. The service and food was outstanding both times. We have another 5 or 6 trips before we've tried everything on the menu. Of the 50 or so Mexican food places we've tried in the valley, the is in the top 3. No complaints whatsoever. I just always forget the name. I say \"pink house Mex....\" and my wife's eyes light up. It's a little pricey with drinks and dessert, but ohhhh try the tres leches, AMAZING!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vxAwqQNSI4DumxdUt5pnhw"
  },
  "CCmdvlHziGkL_oW62eoLug": {
    "date": "8/7/2016",
    "text": "This place is by far the best Mexican food I've ever had the people are very friendly and hospitable! I don't like Mexican food but this place really made me keep coming back! I highly recommend this place to who ever is in this area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JIijoE7VAJtZXPK0jI_c7A",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Best watermelon juice in town too!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JIijoE7VAJtZXPK0jI_c7A/o.jpg"
      }
    ],
    "user_id": "3kLI__fQO9okODlU6blH7w"
  },
  "cNPPEJLZ2C1SMJDUGSk3FQ": {
    "date": "8/5/2017",
    "text": "This place was AMAZING!  I had the chef special and a glass of Moscato. The best thing to date. It was really quiet and intimate. Nice romantic Saturday night date. They had a guitarist playing beautiful music the entire meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6TuX5zVx_moN4cWextBfqQ"
  },
  "Z3ikvxqB1Zff4xijai8zWw": {
    "date": "10/22/2017",
    "text": "The food isn't bad. But it's way overpriced. You could get just as good food for a cheaper price all over the valley.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g0UJg8p83Pr-u1CZfEcFxw"
  },
  "CoENx0B55CW4xzcECaW1KA": {
    "date": "4/19/2017",
    "text": "The service here is exceptional! It's rare nowadays to find great service. We were completely catered to and the food was amazing. Our server, Irving did a phenomenal job at helping us select our entrees as it was our first time there. We will definitely be returning!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o-zFE2o_DMJc_lsZKRX9xw"
  },
  "H22zNNR2GsqoV4RvLB43Xg": {
    "date": "9/1/2016",
    "text": "Great family owned place. Super authentic and AMAZING tequila selection. Very small and cozy with amazing ambiance. I'm really excited that we live right down the street from this pink Jen!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JknqDJT5-M6ArKDrWejGIA",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Great family owned place. Super authentic and AMAZING tequila selection.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JknqDJT5-M6ArKDrWejGIA/o.jpg"
      }
    ],
    "user_id": "I-BI0CMsHvEA7bHEc3QpPQ"
  },
  "R4vxFo7C7iqtFi3OyW9Gng": {
    "date": "6/3/2017",
    "text": "Food was amazing. Service was great. In the menu - Poblano Mole and the Ropa Viejo were really delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oNe2SQ2koOVOI-9A4h_Jmg"
  },
  "zxEXYeSaMVMb8z_9hYxnTA": {
    "date": "1/20/2016",
    "text": "This place is great. I love all of the Freida paintings, and the owner is always so friendly and behind the bar and ready to chat with you. I never wait long, The food is SO GOOD. Unlike any other Mexican food I've had, the ceviche and Adobada are a MUST. and the sangria! Very yummy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DOEDh6V32j_yueWct_ikrA"
  },
  "l-CYBTWdl4-jZCCnBqPBQQ": {
    "date": "12/12/2016",
    "text": "Great place, delicious food, good atmosphere and awesome margaritas. With a combination like that I do not think you can go wrong.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p9g8rYGJHwf_HapbZHyqCA"
  },
  "SR4TTWDsXyhTR4WdZgcsYQ": {
    "date": "8/8/2014",
    "text": "Can not say enough great things about this restaurant. My girlfriend chose this place for our date night and it was amazing. Amazing, authentic Mexican food? Check. Romantic environment? Check. Top of the line service? Check. Can't wait to come back here. Do yourself a favor and check this place out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6BZS_Glgf1qBQ2-e1KAOIw",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Chaco flan!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6BZS_Glgf1qBQ2-e1KAOIw/o.jpg"
      }
    ],
    "user_id": "eEBsrTC6DaOmXfn9Zl7cgA"
  },
  "Of68e6Z5r5gj-UCzwwKIZw": {
    "date": "10/15/2013",
    "text": "When I walked in I was greeted quickly and seated. The thing that hit me was I walked all the way to the \"back\" which was the front of the building. There was a small bar and it was very dim inside for 11am. Perfect for dates. As it was, I was alone - but a lot of decor for me to look at while I waited. I passed another small seating area but I guess that was for overflow.  The waitress was super nice and suggested the guacamole and salsa sampler. I agreed. Salsa? Yes, please! The guacamole was delicious, home made! The green was my favorite, you can definently taste the lemon. The chunky salsa was spicy - perfect. The had a red salsa, but it had that mole taste to it....I dont' like mole. The chips were the regular tortilla chips you can get at the store - the green bag with the man wearing a sombrero...lol..not the best.  I order the Cesina dish. Thinly sliced meat with refried beans, rice and corn tortillas smothered in cheese and enchilada sauce. My first thought was, this is Mexican food? LOL Or am I just used to Filibertos/Juans?  The beef was tasty and not at all chewy like I expected. I was given two slices which was filling. The refried beans were good but the rice came with peas and carrots mixed in. For some reason seeing those little squares of carrots turn me off. Why from the bag? The toritllas reminded me of my dad's enchiladas. He'll take one tortilla, smother enchilda sauce and cheese on top and so on until he has about 5 layers. What was served was two layers, not typically how I eat tortialls. I actually almost asked for flour tortillas to eat my beef and beans with when I realized what the cheesy goo was at the end of my plate. But pairing the tortilla/cheesy goo with the beef and beans pulled the dish together.  Checking into yelp I recieved a free dessert. I showed the waitress my phone and after my meal she brought me a white tres leche's cake. Was there other options? Not sure, she didn't give me a choice. Thankfully it wasn't a chocolate desert.  All in all I thought it was a very beautiful atmosphere, especially if you were there with a date. The food was delicious and the employees nice. The parking is small and looks like during a busier time people would be forced to park along a residental street.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "13sD6TO71SdkB_Xcn275Ug"
  },
  "hTWT3LPA2HNJa4cFp4s1Rw": {
    "date": "8/16/2016",
    "text": "This is a fabulous restaurant. I had the Chilean Sea Bass. It was great, not too heavy. My mom got some kind of soup with potatoes & mushrooms, it was excellent. Our friend got some kind of combo plate with beef and pork. It was great, but I liked the beef better. We got the chips and guacamole for an appetizer, they were fantastic. This is not a typical Mexican restaurant. They don't have any fried food. Their customer base leans more towards eating healthy. They said its Mexico City food. I want to go back soon. I don't know the specific names of the dishes, sorry.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IfSM3KeY690LDD2BP7y5jQ"
  },
  "RxEgpCCFijlicDFYcXSlaQ": {
    "date": "11/5/2016",
    "text": "This place is a hidden gem!  The food , staff and live music is amazing!!!  You have to hear xavi hurtado he is amazing you have hear him.  Check this place out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oQ9FuEK4phBtQmFXwLGZVQ"
  },
  "BlOXKOPBklBverzZw14ltQ": {
    "date": "4/13/2014",
    "text": "I purchased a Groupon for this place as I live nearby and have driven by it a hundred times without really knowing what it was.  I was a little apprehensive after reading the other review stating that the service declined after they used the Groupon, but I was hungry so we went.  The first thing that surprised me was the level of service.  The amazingly kind waiter sat us, and then did the whole placing the napkin on your lap number, thoughtfully went over the specials and answered all of our questions, as well as making very helpful suggestions.  He was friendly, sincere, just awesome.  Our beverages never dropped below half full, and he ensured we had everything we needed and then some.  Towards the end I pulled out my phone to do the Groupon thing, he politely offered to take care of it, then after came back talking to us about how they are trying out Groupon to get more local customers.  He did not make us feel weird for using it, actually chatted with us about the origin of the restaurant and what they were trying to do.  And he did not add any auto-gratuity.  I actually tipped over 20% because this was the absolute best service I have received in a very long time!  Our food was delicious, I got the Cesina - very good, the salsas were excellent as was the guacamole.  My husband got something that was similar to a steak quesadilla, it was wonderful as well.  But as much as I loved the food, (and we loved the food!), I am still just blown away by the service.  Definitely 5 stars, and I have a new regular place for great Mexican food close to home!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YCFGfjdgycYYgcflgMJYiw"
  },
  "2Llr08bt1z4gnepod3ZxMw": {
    "date": "12/31/2015",
    "text": "Stopped in on New year's eve and sat at the bar for margaritas and appetizers. Alex was really friendly and the ceviche was great. We will definitely be back for dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xR8ekQoPyUKGQJGsWV7dHA"
  },
  "NN3PvbcZnf5nb3PpP7TmGA": {
    "date": "5/21/2014",
    "text": "Ambiance, decor, delectable regional cuisine from Mexico, all combine to make this a truly wonderful destination for all things Mexican.  The original chef, a former taco stand owner on the island of Cozumel, made his way here in the 90's and opened \"Such is Life\", a phrase he adapted from a friend who invested in his dreams back in the island days.  Once upon a time, this restaurant had garnered so much attention, it was even listed as one of Phoenix's most interesting dining destinations by the New York Times.  Although it has changed owners, they have tried to keep the original menu and the concept going strong.  From the hand painted portraits of Freda Kalo on the walls, to the colorful folk art and paintings, to the regional music playing softly over the speakers, this place smacks of authenticity inside and out.  When I am here, I feel like I am on holiday in the heart of Mexico.  And when my plate of Camaron Al Mojo de Ajo comes out, I am transported to the beach in Tulum or Puerto Vallarta.  First \"must try\" is the Crema De Cilantro.  Absolutely incredible soup with cilantro, garlic, potato puree, avocado, and chicken. As the name implies, it is divinely creamy and full of gorgeous, simple flavors.  Next on the list should be the Queso Fundido with poblano, championes, chorizo, and nopales.  Excellent!  A slightly different take on what you would expect from a standard queso, and it does not disappoint with all of the wonderful ingredients.  For a light and coastal entree, I recommend the Camaron Al Mojo De Ajo.  For $24.95 you get a very generous plate of large, plump, butterflied shrimp baked with garlic and virgin olive oil.  This is absolutely one of my favorite Mexican restaurants, as it also offers diners a more fine dining culinary exploration.  The menu is simple.  Other entree offerings include fish filet and leg of lamb, and filet mignon.  Appetizers range from $5.95-$12.95 from Ceviche Acapulco (marinated shrimp in fresh lime juice) to Coctel de Camaron (Pacific jumbo shrimp cocktail).  Absolutely everything ordered, down to the made to order guacamole and salsa verde (one of three salsas served at the table), the house margaritas, and Aqua frescas was outstanding and I would highly recommend a visit to this iconic Mexican restaurant.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 11,
      "cool": 7
    },
    "photos": [],
    "user_id": "P2sQVHyHmy4WA0I7NI5hWg"
  },
  "OMdq0Pn5Fn-eOVv1WB5t6w": {
    "date": "5/18/2015",
    "text": "Food and decor were great just like the last time but we had a large party and at the end of the meal the server hadn't split the bill whatsoever If you're gonna charge gratuity on the tip then you should split the bill at least and make it easy on us Last thing we wanna do after food and drink is math",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gEfBCDtfQC9-HGT76l_orQ"
  },
  "lmcnKNw9FrhQ9sfSNvDqjw": {
    "date": "6/3/2015",
    "text": "Amazing authentic grub ! Really nice atmosphere and fast service. Awesome margaritas.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9odCxHCEzSEdlbYotW4-ng"
  },
  "7M7SGgGCeOyLxlXbw9NqhA": {
    "date": "11/14/2016",
    "text": "Authentic Mexican food.  Superior service.  LOVE the ambience!  Always feel like we are back in Mexico while dining.  Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FKPlGBRXG9xIW5q86LJuzQ"
  },
  "4ycX4Kod7AmSESdQBbNfQQ": {
    "date": "11/13/2016",
    "text": "The service, the food, the beverages...all were amazing! Four of us went during our lunch hour and we were in and out within an hour. It was awesome. We started with a shared appetizer of guacamole and chips, alongside three different salsas: green, chipotle , and pico de gallo. For my lunch entree, I had the green chicken enchiladas and an agua de sandia, which were both delicious! For dessert, we all shared a creme brulee, which was good. The best thing was the food, and the only downside would be the portion sizes for the price you pay, but it does not take away from the authenticity. Can't wait to go back with my husband!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aKYqhgmQrRXNMtxz2S2ffg"
  },
  "0EwDxvUqkdHg0PCQwAIkWg": {
    "date": "9/5/2012",
    "text": "This place is great! Food and service is both top notch. I couldn't believe that this palce wasn't packed, but it was a week night and towards the end of evening.  Had just flown in from business trip to Mexico City and I enjoyed this place more than anything there...  Not from Phoenix but love Mexican food and this was one of the best. Will go next time in town.  FYI - Wrote this review on iPhone in March..can't upload until on laptop and had forgotten to upload....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fp3sjvpUGHeervFw3jQbew"
  },
  "IYBfNBOGmoh3xV8wDjflRA": {
    "date": "8/31/2016",
    "text": "I thoroughly enjoyed my dining experience here. I have driven by for years and often wondered about the space, quality of food, etc. After seeing it featured on \"Check Please\" I grew increasingly curious. My partner and I have had this on our radar for some time and we finally made it in yesterday evening. We walked in and it was a bit disorienting finding our way to the front. I had read a couple of reviews both positive and negative about this experience but it was a welcome journey. We were warmly greeted and found a delightful spot to sit and enjoy this gem of a space. Decor is lovely, lighting was great and the ambiance was even better. Our server(s) were brothers and they were kind, informative and eager to help us make our way through the menu. We ordered the queso, sangria and I had the shrimp de ajo I believe. I mentioned to my partner that I appreciate when a chef elevates a dish with basic ingredients and that I do not have a problem paying a decent amount for food when the entree is presented in a creative manner.  This was the case here. We were in a bit of rush however I am eager to return and enjoy this restaurant. Kudos to this small business and I am proud to have it in my neighborhood.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nRI-8Zvi_mkF6vcnkiMGSQ"
  },
  "2fIKXc-eCpbCIHQ8k0avIg": {
    "date": "6/14/2015",
    "text": "Don't let the wild exterior fool you. This place is fantastic. The inside is cozy and romantical. Great atmosphere, service and food and drinks. Enjoyed some live music with my meal. The ceviche is to die for!!! The mojitos as well. Highly recommended and I will be back. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e9eqBdpZaTJcO16JuEFkTg"
  },
  "SlETDnzprHwdIYCXkSVZaQ": {
    "date": "1/27/2013",
    "text": "I will start by saying that I don't know Mexican food. I put that disclaimer up so that if anyone ever reads these small insignificant little critiques of mine, I can always point to the claim I have no idea what truly this stuff is supposed to taste like because I am not a chef or even a professional. I work in IT for Pete's sake. With that said, this place was one of a kind. I may have only gone one time but that was all I needed.  The building is big, purple, and on the corner right on 24th Street. Talk about location. There is only about 8 parking spaces behind the place but not a worry because we were the first ones there for lunch. Your experience may vary. Inside is way more romanticly themed for 4 guys from work out on their lunch break. Small table, candles, I am not going to say more for fear of my sexuality being questioned. We were seated immediately and had ice water within moments. We ordered a plate of chips and salsa to wet the appetite. They brought us an entire plate covered in guacamole with freshly made chips individually stuck in it. This was a good signal of what was to come.  Fairly basic menu. Spanish terms that I can't easily pronounce. So I ordered what could best be described as a steak quesadilla but in this particular quesadilla was Chihuahua cheese. I have never heard of it before but once I tasted it I realized it is certainly something I won't soon forget. It is a creamy, mellow, and simply delicious cheese. Put that between a nice fresh tortilla and some savory steak and there you have a really great lunch. The only thing I can think of to ding the meal on was portion size. I by no means am a big eater. Quality over quantity all day long. But I could have used a little more to fill me up. Nitpicking, I am.  Go here. Eat lunch or dinner or whatever is appropriate for the time of day you are there. The staff truly care about your meal and your experience. The chef came out and asked us how it was and I never had a half empty glass much less a totally empty glass of tea. The host even unfolded our napkins and placed them on our lap. I have no idea if that is a cultural tradition or not, but it was very pleasant. I shall be back indeed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g3blbs6_HQiFJp3UcPCEMg"
  },
  "ON_vO_RW9QTZ0hsbi8tCKw": {
    "date": "6/4/2014",
    "text": "Here last night using a Groupon. It was for $50. We had one appetizer and a couple margaritas, two entrees and our bill was over $100 easy for the Groupon.  And if the food has been all is good or outstanding me I could have stomached the price. But the truth was the food was average at best probably overpriced. There were very few people in the restaurant and yes the service was incredibly slow and not overly friendly. I would not recommend this restaurant to my friends.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ko42ibT0BW_3jsQmoZMRSg"
  },
  "4h_bORkjzThx69gxX5Qd0A": {
    "date": "8/21/2012",
    "text": "One of my favorite places in the Valley! My ex-boyfriend and I used to come here for lunch and dinner all the time! Great memories! The atmosphere is casual but intimate and cozy.   The aguas frescas are delish! I usually get sandia (watermelon) so yummy! Guacamole and salsas are to die for but what really keeps me coming back are the Enmoladas, Enchiladas Verdes and the Cecina and Milanesa Tortas! So amazing!!  Try the sangria - they put an incredible amount of fresh lime juice at the bottom of the glass! I absolutely love it!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jv7CiKRr1IhtkgMsTgsrMw"
  },
  "B74iuqatUgC5ZIA81ceh8Q": {
    "date": "8/22/2016",
    "text": "The food here is amazing and the service is great too. This is not generic \"Mexican food,\" but rather Mexican cuisine. Every dish we have had here has been amazing. And don't pass up the sangria, it is delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UbdvNmjSaKFU7GbS1123lA"
  },
  "B4tPBQ91mzAlN2FgictHyA": {
    "date": "11/5/2017",
    "text": "Excellent, outstanding by far the best traditional Mexican food we have had in Phoenix yet! Margarita was outstanding not too sweet and great tequila pour! You will nor be disappointed! Check it out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "W2K94WPhkHNHXMiaAIA7Jg"
  },
  "w6SutGxSx_hkzWP-8UGl7g": {
    "date": "7/18/2018",
    "text": "This place is super overpriced for what it is. There ain't nothing besides a guy singing that should suggest the outrageous prices. Food its good but definitely not on the $20 and higher range. The service is good but of course you will get undivided attention if you are the only customer there. The owner definitely needs to work on menu and prices.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JPq4SJulSjfIx2LZld8AiA"
  },
  "GhSEMB0q8ovUloaR93cZrw": {
    "date": "5/23/2018",
    "text": "Try the watermelon Agua Fresca. It's quite tasty. The queso fundido is delicious as is the ceviche. Great authentic Mexican cuisine. A lot of flavor for the price. The location is interesting. A giant pink house on 24th st. 10/10 would recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3lWp-X_5WlTZG6vWLWCRLg"
  },
  "rGGsu69nJpCbqqPxdUrZAQ": {
    "date": "7/13/2018",
    "text": "This place is delicious! And they were very kind, I was just stopping by to be able to pick up some Mexican food since I flew in to sky harbor and was on my way out of town.. they were very quick and whipped me up some delicious enchiladas in less than 10mins",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a5Y7vFFXNsCsC1Yj1OSOhQ"
  },
  "PXcykDxgnOliXBIsIuf3fw": {
    "date": "4/29/2016",
    "text": "I rarely post reviews on Yelp, but came straight to the computer after leaving Asi Es La Vida to post this review. I am writing this because I really don't want other diners to end up feeling like I do now, which is basically overcharged, under-fed and cheated out of a nice night out with my wife.   My wife and I eat out several times a week. We have been driving past Asi Es La Vida for years now, and finally decided to stop in tonight to celebrate a special occasion. I really wish we had picked a different restaurant.   Anyway, if you drive down 24th Street in central Phoenix with any degree of frequency, I'm sure you've seen Asi Es La Vida - the vibrant pink building is striking. You enter the restaurant through a narrow rear entrance and there is no host stand, or no one on duty to show you to a table. We ended up walking awkwardly through the narrow hallway, which eventually empties out into the bar area. We stood there, clearly looking bewildered, and no one came to help us. We had to flatten ourselves against the wall to make room for the server elbowing her way through the aisle. Finally, a bartender pointed to a table and we sat down. Don't expect someone to welcome you, or ask you about a seating preference. We would have liked to have been seated in one of the quieter back room areas, but instead were plunked down in a table next to a musician playing the guitar.   Our server arrived and took our drink orders. A few moments later, a different person arrived and asked for our drink orders. We had trouble discerning who are server was, since there seemed to be a confusing tag-team thing going on. A female server brought our drinks. Then, a few moments later, the same server brought another drink that we hadn't ordered. We told her that was not our order, and she took it away without saying anything.   Throughout our dinner at Asi Es La Vida, service was pretty awful: we asked for water and never got it. Had to flag the server again for water. The female server didn't come and check on us, only casually asked over her shoulder if everything was going while she worked on clearing a different table. Nobody said \"Thank you\" or \"Goodbye\" or any other basic pleasantries you expect at a sit-down restaurant.   I could honestly put up with cold, uncaring service if the food was great. And here is the rub:  ALMOST EVERYTHING WE ATE HERE WAS AWFUL. Like, cutting-corners-everywhere-to-turn-a-fast-buck level awful. Out of a tin can awful.   We started with the guacamole for two. We got a plate of guacamole with broken pieces of stale chips planted into what barely passes as guacamole for one. I have honestly gotten more guacamole by the friendly sandwich artists at Subway. Strangely, the guacamole is served with three ramekins of salsas: what are we supposed to do with all this salsa, and only about four chips between the two of us? The guacamole cost about $6.   Then came our queso fundido, which was essentially a small, greasy puddle of melted cheese on a flat plate. It came with chorizo and a few nubs of nopales (at least, I think there were nopales in there). It came with four tortillas, one of which was partly broken. You know how tortillas break when they are cold and stale? This was almost that bad. Plus, I know Food City tortillas very well, and these resembled them to a tee. Just don't expect fresh, good quality tortillas - don't even expect properly warmed up tortillas.   Then the entrees. I ordered the \"Borrego de Azteca\" ($19.95), which is described on the menu as a \"leg of lamb.\" There was no leg of lamb on the plate. Instead, I got a few chunks of chewy meat, a soupy, super-bland puddle of watery white rice, and corn. Ah the corn: someone went through the trouble of using a can opener and nuking them in a microwave for me. They were chewy and super bland, with that distinctly un-fresh taste you only get from food that has spent months in a pantry.   My wife got the mole plate, which was okay. But honestly, i really doubt there is any cooking going on in that kitchen.   Have you ever seen that Gordon Ramsay show, \"Kitchen Nightmares,\" the one where he tries to salvage languishing restaurants? This place really reminded me of the restaurants profiled in that show - before they have been rehabbed.   Please save your hard-earned money! You deserve to be treated with respect -  not as an afterthought, as if you are somehow intruding in someone's private home. Take your money and head over to Barrio Cafe, or even Taco Bell - at least they smile at you there while taking your money.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 9,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wmlkY9RxetBCvyJ6gMlSwA",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. discribed as leg of lamb...yeah...it was like 7 bites of chewy meat, bland boring rice, and canned corn. $20 for that.. weak",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wmlkY9RxetBCvyJ6gMlSwA/o.jpg"
      }
    ],
    "user_id": "n4YZrPspQxGyZPMcKiDjZA"
  },
  "J3rN6JzIL5bZm-q2gqFQFA": {
    "date": "9/10/2016",
    "text": "Guacamole and salsa were amazing! We had the cesina and special (shrimp enchiladas) and the flavors were wonderful. Cute ambience, nice for a date. Great service too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yKrxRvz2_juwwiwMbXSRvA",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yKrxRvz2_juwwiwMbXSRvA/o.jpg"
      }
    ],
    "user_id": "Q4_GklBdHkKaFnRulFxmLw"
  },
  "qptEyLlEcUUzZhUrXnGOJA": {
    "date": "8/12/2017",
    "text": "The food was pretty good, but this place is way over priced.  Especially for lunch.  I had green enchiladas and one beer and it was $18 after tip for one person for lunch...Ouch...only two of the lunch entrees come with rice and beans.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Bmt9x2gWpOYuj5NXceftg"
  },
  "THHbGroBqE5EgUSditl1aA": {
    "date": "1/29/2018",
    "text": "This place was amazing. If you're looking for authentic Mexican food that is a bit more high-end then this is the place to go. The food is absolutely delicious, the service was really good and the place itself was tastefully decorated with lots of Frida Kahlo art. We will be coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "clKLIqFsd-Rd5Kuygw4PSw",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Thet let us choose our free dessert! The crepe was sooo good with ice-cream inside and I think I tasted some kahlua as well.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/clKLIqFsd-Rd5Kuygw4PSw/o.jpg"
      },
      {
        "img_id": "CrmBCEUq5zgzY3wAtnmAng",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. The mole was delicious, rice and beans were very good as well.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CrmBCEUq5zgzY3wAtnmAng/o.jpg"
      },
      {
        "img_id": "djdSK0tF5QsF13DMXYaO1Q",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. The tampiqueña was absolutely delicious! Every single one of the items on the plate were perfect.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/djdSK0tF5QsF13DMXYaO1Q/o.jpg"
      }
    ],
    "user_id": "49D9bLa9O7fvgGieVAyZpg"
  },
  "5Jkr3clIEWQtaT3PvjzorQ": {
    "date": "5/17/2016",
    "text": "If you're looking for the typical Mexican fare this isn't your place. This is a family restaurant that gets 5 Stars for ambience. I love Frida and art, so that takes it to 6 Stars as she is prominently featured in the main dining area while Diego Rivera gets the back hallways. The food was really good but lighter fare. This isn't a smoother your food in cheese kind of place. I heard folks raving about the shrimp special but we didn't get it.  Instead my husband ordered a steak dish and I got the fish. We shared a small bowl of Mexican beans. I think they should have given us each our own bowls. Nevertheless, the service was outstanding. I got a creme brulee for dessert, which was good but not great. I will return and make different choices.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "XgR5sAjfkwVRa62ZDE86rQ",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Dining area",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XgR5sAjfkwVRa62ZDE86rQ/o.jpg"
      },
      {
        "img_id": "wP7c1x15pdgfBBeBAMt1_w",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Place settings are very colorful!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wP7c1x15pdgfBBeBAMt1_w/o.jpg"
      },
      {
        "img_id": "yi14i0y7q7_56Yd3XQ5ZUQ",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Frida on display and the amazing bar and ambience!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yi14i0y7q7_56Yd3XQ5ZUQ/o.jpg"
      }
    ],
    "user_id": "-zrXNYGN93L3DiujE7zABw"
  },
  "CLa-WMaiecupENkQOCJNeQ": {
    "date": "9/22/2018",
    "text": "Ambiance is warm and inviting. The service is impeccable. The food is amazing! We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aw4oCJZJfITV84ptehjsXQ"
  },
  "RN1xpJrf-W1c5urZiW-QMQ": {
    "date": "4/16/2018",
    "text": "This place is awesome. Great food and service. Friendly staff offered suggestions and the house margarita was very tasty...not a bottled mix.  Try it...you will like it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yz5geKk9EhQ9rdU7UaGPXg"
  },
  "q9BbLFpqiMXCHPXKLOaJgQ": {
    "date": "6/4/2017",
    "text": "Place is great! food is amazing very autentic ! Very clean restaurant and  the waiter was ver attentive. Place had a mexico feel but with a very romantic feel to it. Would definitely be coming again to this place we had the chilaquiles with chicken and the enchiladas verdes that were both super amazing no room for disappointment here. We also got to try the salsa that comes with 3 diffrent flavor of sauce which are so deliciomus!! We also had appetizers we could not say no to free chocoflan! and we also ordered a crepa they were so amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "t9HieicpwPw12hzbMGmdrg",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Free chocoflan !!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/t9HieicpwPw12hzbMGmdrg/o.jpg"
      },
      {
        "img_id": "IwaXeAwbCopsi3vDhT8yvA",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Crepas!! So amazing with a hit of tequila yes please",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IwaXeAwbCopsi3vDhT8yvA/o.jpg"
      },
      {
        "img_id": "EEFa3TwV93nWR27NEBub4Q",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Corn with crema",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EEFa3TwV93nWR27NEBub4Q/o.jpg"
      }
    ],
    "user_id": "_BU0vvNDvrCo64MCi1OltA"
  },
  "ViddrYVIe7TmYyOPkCOdjw": {
    "date": "3/9/2018",
    "text": "Delicious! Family owned business who are so personable. This will be a favorite for years to come!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3h3cKFripPztbRAzOVdN5g"
  },
  "madsenJQwvxcRFSa6KCsAQ": {
    "date": "4/21/2017",
    "text": "Love! Love! Love! Beautiful ambience--perfect live music & an artistic celebration of Frida Kahlo.  Exquisite food and fresh made drinks. An amazing neighborhood gem!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_NYueEWGdmaOeR8xxePuCQ",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_NYueEWGdmaOeR8xxePuCQ/o.jpg"
      }
    ],
    "user_id": "_TkXMVrilJMbt4V8nbHjQA"
  },
  "nhadU3lPGSuuRJa0u64DBQ": {
    "date": "3/6/2018",
    "text": "We were in town from the East Coast looking for some authentic Mexican or Southwestern food and found this place. It did not disappoint! Not a low-end hole in the wall; nice atmosphere, great service, good food. The rear entrance from the parking lot is more of an afterthought than what should probably be the main entrance these days, but that's not uncommon and other than that everything was great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "znjzbezse8sZbJN1RDyzvQ"
  },
  "S6IC5-dFjDX_DfcADNRVpg": {
    "date": "3/28/2018",
    "text": "great! the only thing is the waiter wasn't very attentive but he also was trying to explain and entertain a couple of intoxicated tourist's an their barrage of questions. The food was great but a little over priced for portion size; we went at the end of lunch so our meal's were a few bucks cheaper. We went for the Mole an let me say it was worth it the flavor was powerful an rich, served with warm tortilla's i would go back just for that. We also got the pork marinated in an orange/ zesty type sauce fantastic! we decided for dessert an got a piece of Tres Leche to share; the piece was 5$ an so small we devoured it in a few bite's that was my only regret. If you're wanting authentic go here but beware the price may turn you off.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pcXz0Yggs5yRqVjQSp8BMg"
  },
  "H55lnBlzoLuNLwClIE_TAA": {
    "date": "3/14/2017",
    "text": "I was here in Phoenix catching some Spring Training games, and I had a hankering for Mexican food! I used my handy dandy yelp app, and this was the first place that popped up! I was NOT disappointed.   I ordered the Ropa Vieja, and it was delicious! It has so much flavor, and it was just the right amount! Our waitress was very attentive and sweet. I love the Frida Kahlo art, the colorful decor, and the warm atmosphere. Not to mention, the music was just right! It reminded me of my childhood and I love it so much! I would definitely like to explore the menu more!   You Phoenix, have a hidden gem!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "plm8fjEFF_VktvzNYXs7SQ"
  },
  "sqdexnIh-Q39NFgyxZeJyg": {
    "date": "9/22/2016",
    "text": "My first visit to Asi Es Mi Vida was outstanding. The staff was friendly and made me feel at home. The service was exceptional.   I went specifically to try the Mole Poblano. I can truly say it was the best mole outside of what i've had in Mexico!   I'm on my way back for a second visit this evening and i look forward to trying other dishes tonight.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dwFHrT8T6rlfHwIXpAgjVQ",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Looking forward to mexican at Asi Es Mi Vida this evening",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dwFHrT8T6rlfHwIXpAgjVQ/o.jpg"
      }
    ],
    "user_id": "ao5yXAcxZ1Huwl8nANRvaw"
  },
  "IJphyUQl4SXaSDSFJcY_og": {
    "date": "1/15/2017",
    "text": "I visited Asi Es La Vida with a rather large group, and we were given a private room in the back, which was nice.  The decor of the place is great, inside and out.  Our waitress was nice, but service was slow; she could have used some help, I think.  I felt we got hustled with appetizers:  she didn't ask if we wanted them, she said \"I will bring you A and B,\" as if it was complimentary.  But they were good, and a nice variety, so okay.  Others in my group liked their food, but I was disappointed.  I ordered the night's special, a \"surf and turf\" combo with shrimp and rib eye steak.  The two large shrimp were bland and a little tough, and the steak was shoe leather.  I ordered it medium, but there was not a hint of pink or moisture in the meat.  I really needed a steak knife, but it was not provided.  On the other hand, the sides were good.  There was a corn salad that I could have eaten an entire bowl of, it was so delicious.  Also on the side was some good rice, small pieces of toast, and greens.   All fine.    This entree was $27.00, which was way way WAY overpriced for what I got, considering the quality.  Since my friends were pleased with their meals and the menu looked interesting, I might give them another chance if I'm in the area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bq804l1SZrupD4d7w0FGHQ"
  },
  "QbMLunl0dc1Nod7JZDcs2w": {
    "date": "1/19/2016",
    "text": "Decided to try this bright spot on 24th street and I can't wait to go back!  Food, drinks and service was great. Very nice, bright place! I had the \"Asi Es la Vida\" salad with grilled chicken. It was fresh and filling. To drink I had fresh pineapple water. Heard from co workers that the margaritas are good, but I went during work hours so didn't try them.  Everything about this place makes it a 5 star.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1-5x8mKWM9r4KRrfaRXpNg",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Asi Es la Vida chicken salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1-5x8mKWM9r4KRrfaRXpNg/o.jpg"
      }
    ],
    "user_id": "KaInzAaA34pzA2VWypKmew"
  },
  "IxFyr-xud46rewbQdyY-bg": {
    "date": "12/20/2009",
    "text": "OK, we went to the \"new\" Asi Es La Vida last night after watching all of the sign changes and \"now open\" signs come and go over the last several months. Here's the scoop: the original owners sold it in June and it became La Taz de Oro or something like that for about 3 months, then those owners left and the original owners took it back. They were in Mexico in the fall and were delayed getting back to reopen Asi Es La Vida, plus they had to go through inspection processes all over again, so they didn't open until November, and here we are. And it is exactly the same as the last time I went! All that change, and nothing changed. Kind of funny.  I have one complaint. Before we went, I looked up their menu online and saw that it had changed dramatically from the last time we were there. I remembered fancy Mexican food with a high price tag, and the menu online boasts your more low-brow enchiladas and tacos fare for much lower prices. I thought, cool, a new neighborhood Tex-Mex joint that won't break the bank. But the menu is EXACTLY the same as before all of the changing of hands, the only change being that they brought all of the prices down about $2. So I don't get the online menu and they should definitely update that.   Anyway, the food is very good, as usual. High end Mexican. Still no chips or bread to start. And the weird TV-Dinner rice is still on the plate...they must have just called their old distributors when they reopened.   We shared the queso fundido with chorizo, which comes with corn tortillas and a variety of salsas. Excellente and spicy. Then I had a bowl of Crema de Cilantro, which was rich and creamy and almost smoky...would love to recreate at home. Entrees: I had a combo of mole and ropa vieja. The ropa was a tad on the salty side, which I like but others might not. The mole was superb. Hubby had a steak filet with chipotle sauce...he said it was excellent.  The service, as usual, was impeccable...they strive to make their customers feel like they are dining at the Ritz.   Oh, and now it is BYOB, so that's new.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4VmuXuSRhv5UxYUy3tMpiQ"
  },
  "HHClx-I6xBa9CoqpRA2lig": {
    "date": "8/11/2012",
    "text": "I visited this place today for the first time in 15 years.  I have to say:  they still have all of those amazing recipes and flavors.  Now that I'm back in town it will certainly be a restaurant that I visit frequently.  Seriously tasty food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "unl3agQcToliCIKC056-aw"
  },
  "P2x7VaI7UX5uNLKq2Zm7eQ": {
    "date": "7/16/2011",
    "text": "Over priced! Stop for a quick bite before a flight out of town. Never heard of the restaurant before and would never recommend this place now.  I was charged for the\"complimentary\" tortillas and guacamole - $3.95 for one person. The sirloin entree I ordered was tough and dried out, and was only about 5oz. The majority of the $17.95 entree was room temperature refried beans. Save your money and go to Taco Bell!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q--JwCfxsSuJYqym7f2s2w"
  },
  "6_aUWh2z2HH1EdqE_4ccBw": {
    "date": "9/17/2011",
    "text": "This place is pretty decent.  A nice change of pace from the normal mexican restaurant.  The dishes have tons of flavor.  The appetizers are not really worth the money though.  The guacamole was only so-so.  They do have nice flavorful specialty fruit drinks -- definitely order one of these.  I don't know how this place stays open though, we were the only ones in there at lunch.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5ixKDo5KQlvEqAJeyCUpsA"
  },
  "XEmf8z3K1NgqIkJEqFPuWg": {
    "date": "8/15/2008",
    "text": "Legendary service.  Our waiter killed us with kindness.  And knowledge.  And quick refills.  I don't remember the last time I've had service this good.  The grub was above average.  A little pricey, but not unreasonable.  I think my mole hovered around 17 dollars and I'd absolutely order it again.  Very balanced.  The decor is rad.  At first, I felt like I was walking into a little mission.  Once inside, I found a very comfortable, colorful dining room.  Like Danny said, not much to talk about.  It's not my favorite Mexican restaurant, but it's in the top 10 somewhere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0mdh1mokAAZSMibcAaXUEg"
  },
  "Ea0LSXKMxZOnVRT3a0P44g": {
    "date": "7/6/2011",
    "text": "Every time we have out-of-town guests, this is the \"Phoenix Mexican place\" we take them to. Quaint and homey atmosphere (think doting abuela's formal dining room), adorable service, mind-blowing flavors (NOT TEX MEX), and painstakingly cured meats (those magicians in the kitchen are fifth-generation butchers from Mexico City, you guys!). Free salsa and chips and watered-down syrupy margaritas? NOOOOOoooo these are elegant, upscale, tenderly prepared family secret recipes. Eat slowly. Close your eyes. Bring your own margaritas. And give your Cleveland friends another reason to move to Arizona.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Sw41WxXQo6bqAW-H88x3Yw"
  },
  "H_nsc_L1CEXOwr8p1BLM0w": {
    "date": "7/19/2013",
    "text": "This place is the best of the best. Great food, great atmosphere, and Greta drinks. I had the carnitas tampequena which was great, and wife had a shrimp special that I wish I had ordered. Went because of yelp and I agree with those that gave the excellent reviews.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7Wm8quXikHXS3q1viryQbA"
  },
  "gSYS5x7AHX3Z38qJ_6T6OA": {
    "date": "11/9/2013",
    "text": "Wonderfully fresh food and pleasant background music.  Our waitress, Cindy, was most helpful and attentive;)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xpTXcTLAs_DVNulCngr9Fw"
  },
  "886wHajtjg68rM8F0uE7kA": {
    "date": "6/4/2011",
    "text": "Randomly choose this place on Cinco de Mayo. Food was great, Mexico City cuisine FYI. Only down side we did not know it was BYOB.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5LE-pxvIqxFtJxRg-qpCHQ"
  },
  "BzA5ShzavrkzWC-EPVF1PA": {
    "date": "2/3/2009",
    "text": "Very good!!!  I have been coming to Asi Es La Vida for the past 1 1/2 years and every time I walk in I am greeted with a happy face and a warm smile.  They make you feel like you are at home.  The food is very delicious I have tried most everything on the menu and have yet to find anything that I dislike.  There is live music everyday except for Wednesday, I believe; the music is played my one man and his guitar.  He always plays beautiful music and you can even request songs and if he knows them he will play them.  There are two seating areas in the restaurant one where the live music is played and the other is to the left as you walk in the door.  They are always specials of the day from the appetizers to the main entree.  I am a big fan of the Carne Tampiquena and my girlfriend loves a dish they will make if you request it, at the moment I am not sure of its name but it has fish and it is covered in a cream sauce, it too is very delicious.  While the live music is being played you will start to feel very relaxed and not rushed like some restaurants can make you feel.  They don't try to rush you, they want you to feel welcome and enjoy your time with them.  I like that you aren't served a bowl of chips and salsa like typical cheap mexican restaurant serve.  If you are thinking about going to this place I strongly recommend that you try it and you will fall in love with the atmosphere, food and the friendly people that work there.  Oh it is a little on the expensive side but worth every penny.  ENJOY!!!  I have been told that you can bring your own bottle of wine and seen some people bring their own because they don't have a liquor license yet.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1fq-gL1i_8xKhc9VgOZDGw"
  },
  "uw8hQhIa6blVqznTWQWBsg": {
    "date": "6/7/2011",
    "text": "great little latin/mexican hideaway.  It is byob so bring your favorite your vino.  The decor is unique and the service is prompt and courteous.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SVqtuI34wJsPZ4i5_Vjcgg"
  },
  "SkRYBZSF0prI1_41Xcn7uA": {
    "date": "8/31/2011",
    "text": "The food is delicious very authentic but it is pricy.  They dont have happy hour so its a minus. But if you are looking for a Delicious bite and you have the money this is a good place to experience",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E67YpxFiKjuK7NVoCUkHpg"
  },
  "p_MLG5UGt77EiZW6_QRPog": {
    "date": "2/13/2011",
    "text": "This is a really cute and comfortable place with above average Mexican food, although I don't claim to be an expert on Mexican food. My daughter and I had lunch there recently, and I just loved the place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TOkUvlHGBUn0mBUC4V0N6g"
  },
  "D4RAwkypvMPURUJKclcyvw": {
    "date": "10/20/2010",
    "text": "it's a dose of mexican comfort food and hospitality.  i'm definitely not a mexican food connoisseur, but i definitely know fresh, tasty, and homemade food -- and this is where it's at!  conveniently located around the biltmore area, the restaurant is a pop of color on 24th street. you can't miss it!  for dinner, we didn't need reservations on a wednesday, and were greeted with warm, professional, and attentive service. the menu offers many traditional mexican plates of food (like the delish mole poblano i had), so don't be expecting any nachos, quesadillas, enchillada buffet (though i secretly wished they had some).  everything from the BYOB (with no corkage or additional charges), to the personal service, and the free-flow pour of aqua frescas (watermelon for me, yum!), was just so home-style and comfortable.   the food was no different - the guacamole, the tortillas, the mole sauce, and even dirty rice -- all tasted like it came from mama's kitchen.  there was enough depth of flavor for all dishes to be interesting, and enough simplicity to make it casual and easy to eat! (use your hands!) portions were just right, and coming from san francisco, all that food for under $50 was a steal!  definitely a go-to for the next biz trip to phx... gracias senorita!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ayDJwiqty-u3PJ4q6REVIw"
  },
  "qZehTbg4K25POiA_lyL11g": {
    "date": "4/29/2010",
    "text": "Fantastic food and service! Went for lunch today and have the Enmoladas ($9.95) - Chicken Enchiladas with Mole Sauce, Melted Chihuahua Cheese & Finely Chopped Lettuce. Will definitely go back to try other dishes on the menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "pDOedjeoT5YhjD8ZmkpxNg"
  },
  "S7crn0CGZ7Mh4cEddw2WPQ": {
    "date": "11/17/2008",
    "text": "Loved it! Make sure you come hungry. The food is wonderful with tons of flavor. The interior is very unique and fun and the staff is very attentive. You can't really ask for much more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "YL9bTV9s2l7vGkVW3OyiqA"
  },
  "i6e4zak7ZoQhVrfA1yvIXg": {
    "date": "8/28/2008",
    "text": "We went here for the fabulous UYE. As the restaurant is often empty, Julia though it would be good to give them some business...but in the end it was our group that ended up being given the business. The words highway robbery come to mind, but I guess we weren't really on the highway. The prices listed on the menu really didn't seem that out of line, a bit on the pricey side but nothing alarming. Our waitress slyly sold us a kazillion dollars worth of appetizers that were not on the menu. We got 4 plates which consisted of 4 individual sauces with some stuff in them...one had shrimp, one had chicken, one had pork, and one had chihuahua. Oh wait, I think that was the cheese on top. Anyway, the plate with 4 tablespoons of sauce was not worth the $25...oh wait, we got 4 of them. The waitress also managed to slip two orders of guacamole in on us for $11 a piece. As far as the entrees are concerned, the portions were small and the food was kind of meh. The mole was way too sweet for my taste. The biggest bummer of all was NO BOOZE! The $120 worth of appetizers would have gone over much better if they were washed down with some frosty margaritas. A couple of pitchers and they could have slipped us some $100 flan.  Regardless of the price and the mediocre food, it was well worth going for the amazing company of the awesome Phoenix Yelpers. I don't think I would go back for the food though.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "QmH5O1JHDOBvUqzr4vz5-Q"
  },
  "gucCfVDujqBwKmya61lHPA": {
    "date": "8/23/2008",
    "text": "I would go to Asi if it were just me and another, because the decor is nice for intimate setting, in particular the fun guitar guy who is not too loud to drown out conversation and doesn't wander about the place, just plays lilting melodies, upping the ambiance considerably. This is responsible for one of their stars.  I might go to Asi with someone who speaks Spanish to be better assured of understanding that the order is right. Even with slow clear English it was hard to get a straight answer from our hostess regarding what something actually included. We thought we had communicated properly, but the charges at the end were a mind opener. We ordered one appetizer platter and four appeared.  I thought the normal (24.95) platter had been split among four plates as each plate had about 2T of  stews on it.  We asked and she said yes, this is how they do it with large parties, for sharing. In reality each plate was a separate full price platter. ..... $99 for 4 of these? OUCH. While the foods at Asi are pleasant, the prices are a little steep for the size or quantity received. If you are a large party,( we had 17) expecting to split checks, don't. Bring cash, they will only allow two credit cards to be used to pay and you'll have to split out your own check.  Back to the food: I ordered the leg of lamb, but my lamb was cubed and buried under a thickened tomato based sauce, not explained on the menu. It was decent flavoring, but not what I was expecting. My partner got the \"especial\". The Shrimp was flayed open, large and fresh, the steak medium rare and free of too much fat, but again covered in a tomato sauce. As we both can't handle too much acid, that lowered our joy. The vegetable was corn and onions in sour cream.  I thought my $20 entree included a salad, but this is only a tomato and a slice of lettuce on the side of my plate. I consider those Mexican garnishes, not salads. The sauces that came to the table were really yummy and were good on the homemade tortilla chips and guac. This was all at the UYE event that Julie so graciously organized and while we enjoyed the guitar player and munchies and our company, we left with a sour taste at the bill (434.00, not including tip) and the way things were poorly explained by the hostess (the chips/guac was not complimentary either it was $8 a plate and they brought four of those too without being asked for multiples). Another star would have been given if there weren't such unfortunate (and not corrected by the restaurant, nothing comped or made clear until too late) billing issues. So if you go, be very clear with your order, prepare with cash just in case, order some flavored waters, enjoy the guitar guy and watch out for misunderstandings.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "vpFzsr7_ub_bpEPRHTthNA"
  },
  "PyCJ5rmCa9TFJM5Pm0v5UQ": {
    "date": "11/15/2011",
    "text": "I would NOT recommend this place to anyone!!! I just went to... well...\"dinner\" here and it was absolutely horrific. The service was OK, the Margaritas where good, and the chips and guacamole weren't bad. However the $17.90 plate and $19.00 plate we ordered where disgusting!!! My boyfriend and I each tried each others and his tasted like throw up and did not look like what was explained on the menu and mine tasted like dirt with a slab of 2  dollar meat that was dry. I have had authentic Mexican food before and this...well... I don't know what this was!!! The \"food\" absolutely explains why this restaurant was on  \"Unsolved Mysteries\" makes you wonder whats in the food!?!?!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "oJhEZ5OyvVTpdZ2rBYbL6g"
  },
  "HuiQhTDYfvLO-s7cs1ijVA": {
    "date": "10/26/2011",
    "text": "They got alotta nerve!...When we questioned the $10.95 for guacamole and 10 chips which we assumed was complementary.....The waitress had the audacity to act like we were the first to complain about it...then gets sarcastic when we asked for a to- go drink....thats ok though..her tip was reflective of her service...food was ok...but skimpy...like they count the grains of rice....ridiculous....Pleeze this place is whack! crazy cramped! THUMBS DOWN!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "nIhnR5B2Ydt2O3rJDFh_JQ"
  },
  "HxV-vqxv9YYqLFDvg-qh1w": {
    "date": "8/22/2012",
    "text": "Classy mexican restaurant few miles from the the biltmore area. Servers are very attentitive. Menu has some unique items and the few dishes I have tried have all been great. Defnitley reccomend. Enchiladas were great and a slow cooked pork dish that I forgot name of . Two people with drinks expect a ill 60-80.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N_IFBJrVN5CVRNi4UmKf1g"
  },
  "FPyvbTflo-XhRZ1HpG56aA": {
    "date": "5/14/2010",
    "text": "A definite 'Gotta try at least once' I was pleased with the eccentric artistic decor. ^Very cozy,^ good waitstaff, ^very refreshing \"Sandia drink\"  ^live guitar player some evenings ^Good Sangria wine, ^Great desserts, -small menu and a bit more than I would expect to pay however, I keep coming back. I recommend any one of the steak dishes and go for an evening dinner when lights are dim and candles are lit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gMvIRH6ipF60ZUWXyXcegA"
  },
  "XeFmOuzrnGnVHX4SyTu_Tg": {
    "date": "8/24/2008",
    "text": "Great UYE here last week.  Friendly staff, but missed some very important details when describing the appetizers to our large group.  We were brought 4 platters at $24.95 each.  ----NO BOOZE!!!    ----NO BYOB!!!   So the \"value\" part of this restaurant totally sucks.   My combination of the pork something and the mole, which were good but not great, were incredibly small portions for $17.95.  I seriously did not have enough meat in the mole sauce for a single taco. Weak. Beans were average. Rice was tasty, but like another reviewer said I think they used frozen vegetables.  I think the Guacamole was $10.95!  It's kinda a nice place, but the prices are easily 2 to 3 time higher than what they should be.   I'll go to Barrio Cafe and not this place from now on.",
    "rating": 2,
    "rated": {
      "funny": 9,
      "useful": 17,
      "cool": 10
    },
    "photos": [],
    "user_id": "HtCPdVujYJAZF4FKr-C9Lg"
  },
  "7gPbAkj72EUJ9qGoR6cesw": {
    "date": "3/25/2008",
    "text": "As a lifelong Arizonan I am embarassed... EMBARASSED I tell you... that I never knew of this place until recently. (Hat tip to the Yelper who told me about it; she knows who she is). I was so astounded by its typically Phoenician style of unassuming-slash-surprisingly-cool that I asked the waitress how long the restaurant had been there. I expected her to say a couple of years or something.  Try 20. For two decades this place has sat here and Mr Wannabe Expert on Dining Out in Phoenix had no idea it existed. I bow my head in shame.   An old Mexican man strummed his guitar to a quiet folk song as we enjoyed our lunch on a weekday. The food was tasty and just a touch less fatty and greasy than regular Sonoran food. The 3 varieties of salsa were good, as was the guac we ordered with our chips.   A business colleague of mine from Houston will be in town for a few hours in a couple of weeks, just enough time for us to grab lunch. I'm bringing him here.",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 10,
      "cool": 7
    },
    "photos": [],
    "user_id": "mIysRk_cJ5K_BMZ-r06TFw"
  },
  "TU0XEup_1twJ1dQ9BoQ2Kw": {
    "date": "7/11/2008",
    "text": "This place is super close to my work, so after reading about it on Yelp I decided to try it today. I actually never paid attention to the building before, it was just one of the many I passed on my way to work.  I walked in, looked to my right and saw into the kitchen. Huh? It was really clean, but I kept walking and made my way to the bar/dining area. The set up and entry is a bit confusing your first time there, but the next time it won't be a problem. The server was unbelievably nice and helpful. He showed me the lunch menu, and helped me pick something out. I went in to get my food to go around 1:30 PM and one other couple came in while I was waiting.  Then this guy came in and started playing guitar and singing in Spanish. He was fantastic! He even sang Sweet Caroline in Spanish. Neil Diamond in Espanol; I love it! The server even got me ice water while I was waiting. I was so relaxed and enjoying myself while I was waiting that I was a little sad when my food came, and I had to leave.   OH yeah, the food turned out to be delicious too! This is not the Sonoran Mexican fare we are genuinely used to in AZ, this is more like Mexico City cuisine I've been told by my Mexican friends. People who are looking for the standard chips and salsa fare may be a little confused. If you are not looking for that, this place has wonderful food and atmosphere. I won't be able to eat lunch there all the time, due to budget, but I will definitely be back. I want to hear more of my American favorites sung in Spanish too. I wonder if he knows any Britney songs?",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 8,
      "cool": 8
    },
    "photos": [],
    "user_id": "iL_CR-WQnveqrff9LecqAQ"
  },
  "cDpk6n8tkdWOAnkVqWQncw": {
    "date": "8/16/2008",
    "text": "I was totally underwhelmed - and totally shocked given all the exceptional reviews from other trusted Yelp Elites.  The rice was WEIRD. There were frozen peas, carrots, and green beans in it, and I swear the rice was Uncle Ben's.   They don't really have chips. They broke up some tostadas and put them on a plate. How weird.   2 stars for the authenticity and quality of the food, lack of chips, prices not in line with the level of quality of the food, and totally overdone vibe.  Overall: Not great, over priced, overdone, and... weird.",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 7,
      "cool": 2
    },
    "photos": [],
    "user_id": "uqJ0kCrmZOEZzbt4qV3ODA"
  },
  "9Bp6Q8Z14QPakvueLR4_EQ": {
    "date": "8/6/2009",
    "text": "The best gourmet Mexican in Phoenix....and yes that includes Barrio Cafe.  It's a shame that we lost this place and I hope that the new ownership carries on the menu and maintains the quaint ambiance of the original.  This was truly one of the great unheralded culinary landmarks in Central Phoenix.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 2
    },
    "photos": [],
    "user_id": "SCo1UBoeN3bhRMkSYuiX1A"
  },
  "qTSHOdkD2PhyYu3MEvJyAw": {
    "date": "8/5/2008",
    "text": "After reading Laura R's review I decided that I have to stop by this restaurant that I pass to work everyday, also thanks to Jason as well.    It was great to see some rare items on the menu. The service was great and the food was prepared to perfection.    I do see similar patterns, my friend and I were the only ones in the restaurant. at 6:30 on a Monday how sad.  A place like this needs to get more exposure, hopefully it can keep a live during slow times.   The atmosphere is is cozy and the service staff was helpful and bilingual.   I must return for the dessert because I passed it up the first time.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 5
    },
    "photos": [],
    "user_id": "D9patliQtlm646P_fyiCaw"
  },
  "ZKbzmX16T9dkyMIDpnLDww": {
    "date": "8/23/2008",
    "text": "Had such a good experience last week I jumped at the chance for a return visit last night for Julia's UYE. But now I'm thinking I may have jumped the gun giving them 5 stars right off the bat. Yes, the food was still delicious, the service was still friendly and attentive, the atmosphere still rocked (especially with the guitar guy - Love that guy!)... But it's the high prices I have a problem with. See, the food's good, but not that good, not good enough to warrant the high prices. Especially the special combo appetizer plate, a tiny little thing that ran $24.95, which we didn't discover until the bill came. And we apparently unintentionally ordered 4 of them. oops.  Thanks Julia, for a super fun UYE!!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "6I1KT1SCGbAaTzTIMqF_eQ"
  },
  "ceSdkBYBqzK08RmJKFyf0Q": {
    "date": "4/26/2014",
    "text": "Awesome service, excellent food! Expensive for the quantity of food, but the quality was outstanding.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jina0bmdAszge7fSOmtKeQ"
  },
  "mm33lysobxUmjpI2QNywqg": {
    "date": "8/10/2008",
    "text": "Thank you previous yelpers! This was a great lunch. We started with the guacamole and salsa trio - what a combination of flavors. Tried the Aqua Fresca, the sweetness of the Cantaloupe Aqua fresca balanced wonderfully with the spice of the Enchiladas Verdes ~muy bueno. My lunch guest had the Enfrijoladas - chicken filled corn tortillas with a black bean sauce.  Can't wait to go back for dinner soon",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 5
    },
    "photos": [],
    "user_id": "VkvvWhZwsE2v8XYoX3J3ig"
  },
  "6s-Jq8ud94KZXpw2q1KU1Q": {
    "date": "10/7/2008",
    "text": "I still think this place is awesome for LUNCH. I have been back multiple times including the lovely Julia's UYE I was not too happy that night and will probably never do dinner here again. But lunch people.....lunch I just have nothing to frign complain about everyone I take here loves it the guac the tomatillo sauce etc everything has been a hit except the veg synchronizada it was boring with just mushrooms but the harsh reality is that you would probably never order a synchronizada because you dont even know what it is. I'm sure the others with meat are much better. FYI they are like a quesadilla but much better with those home made tortillas!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "kCVPl2RumlSgSDx9PMfXDA"
  },
  "LUC8KhiS4QgAuN5-lw_1qg": {
    "date": "1/5/2010",
    "text": "Well, I can see how some people wouldn't like this place.  Everything is fancy, tables, decor, food presentation, BUT the food quality is not fancy.  However, that doesn't mean it isn't good.    It really just seems like a half ass'd effort honestly.  The food was just as good as any other nice Mexican place with less on the menu and comparable pricing.  i had the Enfrijoladas from the lunch menu, pictured bellow, i thought it was delicious.  Other reviewers are complimenting on the proportions and it is True.  For the same price elsewhere you can get the same thing WITH rice and beans.  All said and done, i had a plate of chips with some really good guac, the meal, and a water for $13.  I would eat there again, but only if i was going with someone to a fancy dinner.  This will not be my first choice for Mexican food when i'm craving it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "dR5yz9ZyeBS3sbYAXAOmdw"
  },
  "ppMEYTpQesMzXnCHL3zaZQ": {
    "date": "7/6/2008",
    "text": "Asi es la vida. Verdad. Verdad.  I went here for lunch. There was a man playing acoustic guitar in the main dining area. My experience here was beautiful, authentic, and delicious. Our server was a bit confusing, but nice enough.   The food was legit Mexican (take that with a grain of salt as I am a definite gringa) and incredibly fresh and well prepared. I was completely impressed. It was a bit pricey for lunch, but definitely not outrageous.   I would highly recommend this to folks looking for an authentic, somewhat gourmet, upper-end, and delicious mexican spot in Phoenix.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "clSor65-ie2nuNmcr6tUUQ"
  },
  "aDiCxA6MINOcX4XR67awRg": {
    "date": "8/28/2008",
    "text": "I had the enchiladas verdes, and thought they were very good  *however!  they tasted just like the enchiladas verdes at Pink Taco.... which I think is a bit strange*  My friend had the chilaquilles and also found them to be very good  I was a bit put off my the lack of chips and salsa to start.  When I go to a mexican restaurant, I NEED CHIPS AND SALSA!  :)  Then when I requested chips and salsa, they looked at me like I was crazy, and then brought out a plate with 10 tortilla chips on it.  Great....  I'd go back, but don't think I'd go out of my way to do so.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "OPN-dDUBkH7uH-G8nOnskg"
  },
  "k3Fmghe74UbNTuu_IAWqPA": {
    "date": "6/25/2008",
    "text": "This was pretty good fare.  I had a stewed lamb dish.  Unlike any Mexican I have ever had.  Come to think of it, I've never had lamb at a Mexican restaurant, or in Mexico.  Everyone I was with enjoyed what they got.  Most had Mole, one had a steak.  The tappas we had at first were a good sampling, even if they were foisted upon us.  I went with a big group.  The waitress was pushy, that was the only negative.  She basically told us this is what we were getting for appetizers, a sample tray, and we were getting 3 for the table.  We really had no input.  They did not have a liquor license, but I can't dock any stars for that if they let you BYOB and no one advertised it for its drinks.  Although I must tell you that bar tender looked pretty lonely at his empty bar polishing his glasses all night.  I was told the liquor license thing is an on again off again thing for them.  They insisted on pouring the wine we brought in, even though no one there could tell a Chardonnay from a Pinot Noir.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "lC7GQ8CYduEE35MB5FOJEg"
  },
  "kHCuROgT88fk-PN87xLhsg": {
    "date": "10/18/2014",
    "text": "This has to be the best Mexican restaurant in Phoenix.  A friend told me to try it and I was not disappointed.  The enchiladas verdes are amazing.  The chicken inside was soft and tender.  The decor and ambiance was very nice too.  I would highly recommend this place to anyone who enjoys good Mexican food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Umwbkc93ZoB8q3Y3URUbhw"
  },
  "A7l9VL0yoAuArsW5vPc6zg": {
    "date": "9/30/2007",
    "text": "There are only a coupl'a things that prevent me from giving this place one more star.   1.  I thought their guacamole was way overpriced at 8.00 and not at all like the guacamole I've had prepared fresh at my table for the same price.    2.  I ordered the agua fresca in watermelon (which was delicious, by the way), but my friend ordered the pineapple one and hers tasted like colored water.  Seriously.  It was like night and day in comparing the two drinks.  When I took a sip, I was surprised they would even bring it out.  When we pointed out the weak flavor, the server only was able to suggest the watermelon like I had.  Hmm....  So I was here on the 13th and thought their food was actually pretty good.  It was far better than what I could get in the DC area after living in CA all my life and having the luxury of choosing a different awesome Mexican restaurant for every day of the week.  We didn't get any other appetizer, but the salsas that came with the guacamole were outstanding.  I ordered a sampler plate that consisted of a pork simmered in orange juice and the ropa vieja.  Both dishes were really tasty and I enjoyed them veyr much.  My friend ordered the appetizer sampler plate.  I don't recall exactly what was on it, but I do remember taking a bite of the chicken mole, which was done very nicely.  We were there pretty early, so we were the first customers to arrive.  While were were there, a couple was seated nearby.  I didn't see anyone else after that.  The atmosphere is lively and cozy at the same time.  Lots of care went into decorating it, as there are many personal touches.  There is a parking lot behind the restaurant, which beats having to find a spot on the street.  I will be back in Phoenix in December...I hope they have their liquor license by then!  A margarita or a beer would make the meal complete and then I would give it that extra star!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "d9mSbe_sbWVlnaGtlylmfQ"
  },
  "9Re3agYdis4BckgKBBJ98w": {
    "date": "5/23/2014",
    "text": "I was so disappointed with this restaurant. First of all the decor was very charming and I really did like it, the way to get to the table was a little weird but it wasn't a deal breaker. The food however was a deal breaker. I ordered the Enmoladas and the mole was way too sweet and it was not made from scratch. My mom ordered a dish called Cesina, it was a very thin cut of steak (which granted it does say thinly cut in the menu). The taste of the steak was a very unenthusiastic \"ok\" but the plate came with some chilaquiles and that sauce used in that was definitely from cans. The rice looked and tasted like minute rice. We Mexicans do not eat this puffy looking wet rice! It was the weirdest thing I've ever been served at a Mexican restaurant. I have NEVER been served rice like this. The chips served with the guacamole were actually tostadas broken up and they were store bought tostadas. The guacamole was ok. I hate not being able to support a local restaurant but this was just laughable. It was definitely not getting my money's worth. If I wanted to eat the food they served I could have done so with a lot less money. Won't be coming back ever.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mdsXi_Im1XYNs1p3bKgJ3g"
  },
  "Ahb4aMQo45H1Eh4qIx5jcw": {
    "date": "11/13/2014",
    "text": "This is my first YELP review, but I felt motivated to do it for this place. WOW! The very best mole I've ever had. And the fish dish (pescado a la versceruzana) was outstanding. This just wasn't the best Mexican food I've had in a while, but the best meal I've had in quite some time. Don't miss it! The atmosphere is great, staff very friendly and even a wonderful guitar player.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V5QQmc4kZB9237-mTBCzFg"
  },
  "4z2SRrGx61eTd9McnOnwsQ": {
    "date": "8/8/2018",
    "text": "This restaurant was on my radar for a while but had never actually made it until my birthday last week. I went with my parents, who love everything about Mexican culture and decoration since my dad is a Mariachi. When you walk in you immediately notice the beautiful decor and how nicely set up the tables are. We got greeted by a nice lady and she was very attentive to our needs the entire time we were there. The mole enchiladas are TO DIE FOR! So so good. Their micheladas are delicious as well. The lady made conversation with me and my family and even brought two slices of cake with candles since we were celebrating my mom and my birthday. We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XJNY_hMIYM_DWyh-AgJA3A"
  },
  "2LZFd39hLo7qZ5NRut4ihw": {
    "date": "10/6/2018",
    "text": "We love this restaurant. The food is delicious, fresh and authentic!! We love the intimate atmosphere with the fabulous music by very talented musician singing Spanish songs. The drinks are very good and the desserts amazing and yummy!  Parking is easy and plentiful. Finally the service is professional, prompt and welcoming!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5v_DGp_tjmZsMggr4j-9bQ"
  },
  "RaP8rhlk86BLLrTqY365QQ": {
    "date": "2/27/2017",
    "text": "There's no missing the vibrant pink building that is Asi Es La Vida. The restaurant has been on my foodie radar since I saw them featured on an episode of Check, Please! Arizona. Inside is quaint (which is the nice way of saying it is small but not in a bad way, more in the cozy way) and filled with Frida decor.   We were promptly greeted and asked our preference of table. A booth was available so we opted for that. After spending earlier in the day walking around, I was thirsty. They offer a few different flavors of Aguas Frescas (pina, melon, sandia). I went with the sandia (watermelon). It was not overly sweet like some Agua Frescas can be. It was very light and refreshing like drinking straight watermelon.  For an appetizer we got guacamole. Even though I prefer a slightly more acidic guac, we still managed to eat the plate clean. The guacamole came with three salsas (and extra chips). My favorite of the three salsas was the green tomatillo - medium heat and great flavor.   For my entree I had the Cochinita Pibil. The menu description is: slow roasted pork with an orange based sauce and sweet red onion. The dish is super tangy and citrusy. Since I am a fan of those flavors, I was very happy. I also sampled bites of the mole and tinga and would have easily ate a plate of all three if that was an option.   Before you leave, don't forget to use your Yelp check-in for a free dessert. We were brought flan. Which I typical do not like (it's a textural thing). It would not have been my first choice...or my choice at all but asi es la vida. I was pleasantly surprised to have actually enjoyed this flan so that's saying something.   If you are in the neighborhood, find the bright pink building and enjoy some great Mexican food.",
    "rating": 5,
    "rated": {
      "funny": 27,
      "useful": 49,
      "cool": 49
    },
    "photos": [
      {
        "img_id": "BN4KRBIhOjHPprm_Dk7-gQ",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Flan (Yelp checkin dessert)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BN4KRBIhOjHPprm_Dk7-gQ/o.jpg"
      },
      {
        "img_id": "dZKFHJRp4MgSrEo7u5MWow",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Cochinita Pibil",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dZKFHJRp4MgSrEo7u5MWow/o.jpg"
      },
      {
        "img_id": "ZJ6TqmpGWw3-lzUKMcxTsA",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Watermelon Juice (soooooooo gooooooood!)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZJ6TqmpGWw3-lzUKMcxTsA/o.jpg"
      }
    ],
    "user_id": "5ylIKMA-zoXZvH_-X26YOg"
  },
  "3lP6J11uIulEhw0pnOGBrQ": {
    "date": "6/4/2018",
    "text": "Totally pleased.  Nice ambiance the food was excellent.  Service superb.  Very clean.   I will be back.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "mXCzXxmjHlQiWkH4wHJZ4A",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mXCzXxmjHlQiWkH4wHJZ4A/o.jpg"
      }
    ],
    "user_id": "EsdLwzG4OJHTsDyCUp7WXg"
  },
  "5oj695MfwKl_fxE8L7-zMA": {
    "date": "5/31/2018",
    "text": "One of the best meals I've ever eaten, and BY FAR the very best Mexican food I've found. Superb service (handmade Palomas for us!) alongside impeccable food. Order one of everything, we couldn't find anything that disappoints!!  Six stars if I could!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HZWTJJxgEBxhTClu3KHxFQ"
  },
  "Hxd64x_DRh0EiyNBZumBsA": {
    "date": "1/5/2019",
    "text": "Good service. Sat at the bar, food was great. Tortilla soup was delicious as was our sincronizadas (pork) and the fresh fish was great!! Will be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5yqtK_4Np8vzS4bSq-RKAQ"
  },
  "-LFl67Q8waOX2kpZfzC29A": {
    "date": "3/13/2018",
    "text": "Truly upscale unconventional Mexican food.  The decor is warm and inviting a small yet well stocked bar with a plethora of tequilas.  The bartender was very knowledgeable, I was dinning with family and my Aunt likes rare tequila they were happy to chat and make suggestions.  Decor is dark and warm, Frida Kahlo portraits throughout.  The staff was fantastic some at the table were unsure about some unfamiliar sauces so our server brought out a sample for us to try.  We started with Queso Fundido which was a fantastic flavor rich and savory.  We all just ordered a bunch of dishes and we all shared, Cameron shrimp baked with garlic and oil (not my favorite) it was okay the shrimp was a bit dry ironically enough, Filet chipotle was fantastic topped with chihuahua cheese and aioli sauce, cooked a little too medium for my taste but still very good! Crepes de Cameron, shrimp crepes with garlic topped with a chardonnay cream sauce AMAZING! You owe it to yourself to try it and forget what we think of as Mexican food in AZ!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "-25cVbYRa4ZWyqZRQT7Y0A",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Amazing Decor",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-25cVbYRa4ZWyqZRQT7Y0A/o.jpg"
      }
    ],
    "user_id": "IZnsvdPqU_LWTy4yfgiX4A"
  },
  "g3Pt6Rar3K3FiULISey1hA": {
    "date": "7/14/2018",
    "text": "This place was amazing. We went for a birthday dinner.  The plates were well thought out and flavorful.   Definitely a must try!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PbgOSqJ6TRwiU3w_ldRFww"
  },
  "9i0Mx26vGdkPQbB_dfCb8A": {
    "date": "4/1/2018",
    "text": "The worst ever. Food is awful & prices are high.  The service is awful, place not clean & their desserts are gross.  Not worth the time here.  They give you melted Ice Cream in a soup Dish, they did not care. Walked out.  Review is True, so correct the problem, do not attack the reviewer",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "v7FPnMzdbl6J7U_8H1BWZA"
  },
  "npp5FheM466AOfdNr5EqXg": {
    "date": "1/19/2019",
    "text": "The food was amazing. The atmosphere was eclectic and cozy. The service was phenomenal. Our server explained everything in detail and brought a tres leches dessert for the birthday at our table. I will absolutely be back here. Also, we went on a Saturday night and they had a phenomenal singer/guitar player for background music. I haven't even left the table yet and I had to write this review ASAP.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XtE40wWnn_bH2nRZV4zoEA",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XtE40wWnn_bH2nRZV4zoEA/o.jpg"
      }
    ],
    "user_id": "V1WI3Tml_eL4S_sLMlQJ9Q"
  },
  "lVMTOTwLFxrFGzLCI0Tdtg": {
    "date": "7/30/2016",
    "text": "I'm always pushing my girlfriend to try new restaurants, especially Mexican ones. Unfortunately, they often end up being poor choices and we angrily regret not going with an established favorite that we know won't disappoint. However, every once in a blue moon, we'll stumble upon a place that we wrongfully assume is just another generic Mexican joint, which ends up exceeding our expectations. Asi Es La Vida is one of those rare places.  The restaurant itself is very small, tastefully decorated, and has a great atmosphere, complimented by live (but not loud) music during the evenings.  Their guacamole is one of my personal favorites due to its simplicity and high quality. They provide you with a limited amount of tostadas, but don't fret, as they always bring more out later.  For dinner, we've had the Enrollado de Res, which is a sirloin stuffed with three different cheeses and covered in a chipotle sauce. I took a risk ordering this, having never had it before. It was excellent and has since become my favorite thing on their menu thus far. My girlfriend usually goes for a mole and cochinita pibil combo, which she is consistently pleased with.  I've also had their \"Filete,\" which is a filet mignon that's topped with cheese, onions, peppers, and garlic. I usually scoff at the mere mention of putting anything on a filet, but I actually ended up enjoying the way it was prepared.    Keep in mind, if you check in on Yelp, you can get one of their (cheaper) desserts for free. We've had both the tres leches and flan. Both were good, but there's a reason why they're willing to give them away freely. The slices are so small that two people can easily devour it within seconds. If they were any smaller, they would be classified as free samples on a toothpick.  I am sometimes taken back by some of their prices and also find it very odd that their parking lot is often full, even when there's practically no one inside the restaurant. Is there something going on upstairs that I don't know about?  Food wise though, we're big fans and I find the experience to be quite unique in comparison to most Mexican places in Phoenix.  Highly recommended!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "eQTtHiG_r0b5Fp1aLp3WKA",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Tres Leches",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eQTtHiG_r0b5Fp1aLp3WKA/o.jpg"
      },
      {
        "img_id": "eTiaxS6WnuilsxBsjQdNMA",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Enrollado de Res",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eTiaxS6WnuilsxBsjQdNMA/o.jpg"
      },
      {
        "img_id": "yHVnzSO44cKx1BrZeoU48w",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Tampiqueña",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yHVnzSO44cKx1BrZeoU48w/o.jpg"
      }
    ],
    "user_id": "TCPLaprJm4FFei2DkW6K6g"
  },
  "J67mvBQuUJfTdVvLPWGl_Q": {
    "date": "8/26/2018",
    "text": "This restaurant has some of the best service in the Valley. Super romantic atmosphere with delicious food.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZaGBboQeZJNCOQNLn5qUXg"
  },
  "ixrx8wSqFAuONnVnV6dDnQ": {
    "date": "11/23/2018",
    "text": "The most delicious traditional Mexican food ever. Prepared and served by family members. In a beautiful intimate environment.  With wonderful music. It just doesn't get my better than this.  Poblano chiles, shrimp, mole, steak, margaritas. Everything was perfect!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GY3jbmYlYE7bxU5IRRqBwg"
  },
  "S2hwVe7Dg845X4WkvgwTtA": {
    "date": "5/19/2016",
    "text": "I love the funky pink building. I love the authentic decor and traditional Spanish music that was playing. I love the cute little preggo chick that seemed to do it all (hostess plus waitress for ALL the tables). I love the food - tortilla soup and enchiladas for me and beef tacos for my guest.  Delish!  However... I do not love the bathrooms (seemed kinda unclean). and I do not love that they only offer chips if you order the guac.  Pardon me, but giving me several salsas before my entree but no chips is just straight up rude.  DON'T YOU KNOW HOW MUCH I LIKE, NAY LOVE, CHIPS?!?! It was practical torture, but I simply didn't have room for guac. We tried to pay for chips alone, but were again told we could only have chips if we bought guac.  Weird.",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 7,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "OUkwDGn9arF2yDKkDTOzCw",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Enchiladas verdes (chicken)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OUkwDGn9arF2yDKkDTOzCw/o.jpg"
      }
    ],
    "user_id": "MPGqUhAsmVEHq9k9X6VZKw"
  },
  "9ke79kVLBlQloZ2N3h0hhw": {
    "date": "1/6/2018",
    "text": "Great neighborhood find!  Appetizer special had a sample of queso fundido, chicken mole and guacamole and three salsas. The tomatillo salsa was outstanding but the chipotle salsa was too smoky.  Everything else was very good. Entrees we shared were the chicken tings and cochinita pibil combo plate.  The pibil was outstanding, slow cooked magnificence. The other entree was Enrollado de Res, tender beef rolled around cheese and spinach.   That was amazingly good. I would order it again without hesitation. There was a talented guitarist playing and singing Spanish songs. All in all, a great date night and superb meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "C1YRppJ0N7bJKHoAFzp_Dg",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/C1YRppJ0N7bJKHoAFzp_Dg/o.jpg"
      },
      {
        "img_id": "09n5n3rSuneXJ5ZchLTyEQ",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/09n5n3rSuneXJ5ZchLTyEQ/o.jpg"
      },
      {
        "img_id": "gSOCtRcnfsJBEum6hCln8g",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gSOCtRcnfsJBEum6hCln8g/o.jpg"
      }
    ],
    "user_id": "FX7BjzTJAuCAul1eXyRWqw"
  },
  "3cYhjo6dDz-SCrN0nL16IA": {
    "date": "4/7/2018",
    "text": "Best tres leches ever!! All entries are amazing and the service is excellent. We come up dinner weekly and love the atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JMPBDvjiOaxXUBlVomykYg"
  },
  "P7-QYRw7JjERVfonxmT9EA": {
    "date": "7/17/2018",
    "text": "Asi es la vida is one of my favorite restaurants in Phoenix. Their shrimp crepe appetizer is addictive!  The food is always very authentic and fresh, and the service is above and beyond!  I've never had less than an exceptional experience dining here. The live music is also great. Definitely recommend this place for an authentic Mexican dinner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aLd1Nya3F5qq3poVGsJNwQ"
  },
  "23X1sCt2fbsZzEMuTuSkLQ": {
    "date": "12/30/2015",
    "text": "Decided to try Asi Es La Vida and boy am I glad that I did.  Enjoyed the Carne Tampiquena which is amazing - thinly sliced top sirloin served with a poblano pepper filled with cheese, enmolada, guacamole and beans. The food came out hot and ready to eat!  This is a nice little place on 24th street with great decor and friendly service.  I cannot wait to return and try more items out on the menu along with maybe a friendly margarita.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "X_aQg7easkICSQMvk6Miiw",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Tacos!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/X_aQg7easkICSQMvk6Miiw/o.jpg"
      }
    ],
    "user_id": "YF3KmwYMeONIfX02OTxwFw"
  },
  "Q2ajGS7VuAexTFRqfz1s7Q": {
    "date": "8/18/2018",
    "text": "Asi Es La Vida is like no other Restaurant! The ambiance is so amazing!!! I love their creative menu! The food and service is Excellent! The little touches and attention to detail make this restaurant like no other! Thanks for making our visit so special!!! Well done!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "C81d7Jb_hssSPEcmoPDPLw",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/C81d7Jb_hssSPEcmoPDPLw/o.jpg"
      },
      {
        "img_id": "MLstNLGQTi5xL2uUJkvt1Q",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MLstNLGQTi5xL2uUJkvt1Q/o.jpg"
      },
      {
        "img_id": "vk5fowoKW2qbpLbYlU_v9A",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vk5fowoKW2qbpLbYlU_v9A/o.jpg"
      }
    ],
    "user_id": "2AyGdbRkB8NyXSXw-jqMGw"
  },
  "AfzUjQ7uQLWDVTOGWegluA": {
    "date": "5/31/2018",
    "text": "Our dinner was phenomenal, thanks in part to the wonderful recommendation by our server, to try the appetizer special.  The chicken, pork, and shrimp sampler was amazing! Although the construction along 24th street may appear daunting, do not let it keep you from enjoying a fabulous dinner here! We will be back to continue our journey through the menu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "E197-AZl9TGSJHOKNAm7_Q"
  },
  "JWOwJoEdZkUC_l9XRSAWdA": {
    "date": "5/15/2014",
    "text": "We just dropped in for lunch. What a pleasant surprise. Linen tablecloths and classy soft Mexican music in the background. The menu is not the standard Tex-Mex tacos and burros; rather it is Central Mexican cuisine. The chipotle sauce is smoky with a nice hot finish, the tomatillo sauce is bright with a great flavor. The bar is well stocked with 65 tequilas, the Marquita's are made with fresh squeezed lime juice. Every bite was a pleasant surprise. I cannot wait to come back for dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X20V8vqXDGexTVYBUdyIow"
  },
  "CZo-bz4iXHoyH46C-BsR5w": {
    "date": "2/6/2011",
    "text": "I call this place the little gem in my neighborhood.  My guy and I walk to Asi Es La Vida from our place and are always warmly welcomed and provided excellent service.  We haven't been when its been very busy -which makes me sad, as I'd like to see the place with a line out the door - but this kind of adds to the charm because you're almost guaranteed to have a nice relaxing lunch or dinner.  I really enjoy the atmosphere too!  The bright colors and busy walls are distinct and its very small and cozy.    The food - I've had maybe 5 or 6 different things off of the menu and have never been disappointed.  I'm not a big mole fan but I still really enjoy it there.  Everything is bursting with different flavors.  Don't get me started on the watermelon water - I probably average 4 glasses each time.  I just can't stop myself!  It is so refreshing!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "xbb6s5fFOQxul18vzD1Jtg"
  },
  "co-QOyNKhXyKxB4TWcRwng": {
    "date": "3/2/2014",
    "text": "The food was excellent and the waitress was super nice. The free dessert (tres leches cake) was so good we had to order a second one! The menu was a little limited but everything we ordered tasted great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KsIMJT1yK4Xsa3-gw1Tuog"
  },
  "gN4H6gRcNr43Y5gcBHqw0g": {
    "date": "5/6/2014",
    "text": "My kind of place. Not your typical fried Mexican food. Ingredients were fresh and super tasty. The chips and guacamole is the <a href=\"/redir?url=http%3A%2F%2Fbomb.com&s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\">bomb.com</a>. Small and cozy but not cramped. I'll be back! Oh, enchilada verde- highly recommend, again fresh and not loaded with tons of greasy cheese.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_yKNQQLE-zofraDmjbZs4Q"
  },
  "C5qDp8igLbmKt_ybQT6Rvg": {
    "date": "5/13/2011",
    "text": "I sometimes feel like 3 stars is a little deceiving. This place was good, I don't really have any complaints at all, but was it memorable, great, and would I really have an urge to go back, not necessarily. It was definitely more fancy than I was expecting given the other reviews. They try to make it have an upscale, date-night kind of feel, and that's cool, especially if you take advantage of the BYOBooze, w/out a fee. Something I was not aware of, but wish I was! The fresh guac that is offered is not complimentary, but it is good and well worth it.   The menu is not chalk full of the usual enchiladas, chimi's, etc, but some fancier (maybe more traditional) Mexican entrees. I had a sirloin that was stuffed with three different cheeses, spinach, bacon, and covered in a tomato based sauce of some sort. I was a little disappointed in the lack of rich complex flavors given the players of ingredients, but again, it wasn't bad by any means. My gf had some vegetable type enchiladas that she said were very good, but we both had the same conclusion. It was good, nothing to complain about, but nothing great either.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iRBcGD15pU6Nr45w07cRzA"
  },
  "glWQ7ZIjLU1IP8wHIJzQmQ": {
    "date": "10/13/2013",
    "text": "Don't let the neighborhood or outside scare you. The place is Great! Amazing unique Mexican cuisine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IGseYnL1j8q9Pyt6byaEgQ"
  },
  "b-kIJnigSw6_gQjq6wzA8A": {
    "date": "5/27/2013",
    "text": "Finally came around to trying this place out... well worth it!  I had their sopa de tortilla, which was very different from other tortilla soups that I've had in the past--nonetheless, it was delicious!  My sister had the crema de cilantro, which was also very good.   For our main entrees, I had the enmoladas and she had a torta de adobada. The mole sauce was sweet and rich!  Tasted just like my mom's!  My sister loved her torta and the buttery rice that accompanied it.   The service was super friendly and the food tasted amazingly authentic!  We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1CBoNxmbQzZX3RP3fbXmnQ"
  },
  "bBlKRuevwWH6PwicvJbVGg": {
    "date": "12/24/2012",
    "text": "Just finished eating here. this place looks classy even if it is a little small. service was great. I had the enchiladas verdes & my guest ordered the Enmoladas. My plate was delicious, the right amount of spicy & tasted very authentic. The enmoladas were good too, were more on the sweeter side, but savory. Yes portions are on the smaller side but the food/taste really made up for it.  We then had their flan for dessert and oh man it's exactly what flan should taste like. This place is so delicious I will definitely return for dinner (they offer different menus and more selection) .",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ffddwy8YZ81JLi1xmSWV2g"
  },
  "vBIkctWblK4IsoNq7GaIHQ": {
    "date": "10/2/2010",
    "text": "Went for dinner this time, date, perfect. My honie is so sweet, he doesn't make a fuss about the price, but honestly, that's why this place is empty. You can tell they tried to lower the prices; but people in AZ just don't pay $15 a plate anymore.  The upside is that the prices ensure you'll get a table and plenty of attention by the staff.  Another bummer and why there are only 4 stars: The last time we went there were margarita's...now it's bring your own bottle of wine. (~hope there's not some weird political mischief taking away their liquor license; everything in AZ business is soooo wild west). I wish we would have known, we would have brought a bottle.  I wanted to try the lamb, but went with a pork dish instead -Had pickled onions sliced thin on top...an amazing Mexican stew; and the usual rice and beans [that some lady below didn't like]. It's white rice tossed with a little cilantro and finely chopped veggies; simple, healthy.   John had a beef steak dish; a house specialty. He had them cook it med, rare so I would try some, but he probably should have ordered it rare for his own enjoyment. It was very tender none-the-less.  We had cantaloupe juice last time, which inspired us to try to make cantaloupe margaritas at home (we're no good at these things I guess)...so this time I had pineapple and he had watermelon. The juices are perfect to clean your palate from the rich flavors of the food.  We love their sour green sauce, but then I'm a fanatic for tomatillos [green sour tomatoes].  The Guacamole was exactly the same as it was at lunch. They serve it on a plate, with homemade tortilla chips, spiking up from the guacamole like a rocky shoreline on a green sea. The chips are heartier than the thin and oily homemade tortilla chips you get elsewhere here; they have strong texture, no oil and lightly salted.   I prefer the quality of the food here to the greasy food elsewhere. There's no lard, no grease and everything is cooked to perfection. Not overcooked. However, we won't go here often, b/c my boyfriend never lets me pay for these things and we're not particularly affluent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "cVz8ZPsnXCzb_ovHv13LBA"
  },
  "DxHTm-7IUqUlSK-tlhjN1w": {
    "date": "12/23/2010",
    "text": "This place is AMAZING.  I have been to this restaurant many times and have brought other people that love it too.  The dishes are freshly made down to guac and fruit juices (yum!).  The mole is to die for.  It is so rich and deep in flavors and I get excited just writing about it.  I've ordered it many times.  I've also had their cochinita pibil which melts in your mouth it is so tender, juicy, and a tornado of flavors in your mouth.  I've also had the adobada and what more can I say ... it's just so good.  I especially love their fruit juices because you can see it being made from an actual fruit, cantaloupe, pineapple, watermelon, etc.  So fresh and refreshing!  Price might be a tad high for the little things that I've noticed but when my palate was having a climax for almost 2 hours everytime ... I think it's worth it.  :-)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "XASX3QxuAnbWDIEleHDRjQ"
  },
  "Fc-7e6zBU0rh0pPhAzUCYg": {
    "date": "10/20/2013",
    "text": "I'm not too far from this place they have some great food and really cool people that serve you very knowledgeable about what they have and the service was impeccable thank you and hope you enjoy",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZuCXUnvBXN9wj2S8ZD40qw"
  },
  "wq9TCyOs7kWXL0sawE4TVw": {
    "date": "8/9/2012",
    "text": "A friend suggested we try this place and unfortunately he must have had a better experience then we did... first off the A/C was broken when we arrived so it was hot - we sat under a fan to get some air circulation (this probably didn't help with my attitude of the place -wasn't their fault and they were working on it but hey...first impressions).  We sat down and got our menu's, it was the dinner menu and WAY too expensive for us - we thought about leaving just then but decided to order drinks and an appetizer (oh yea, no drink menu so I guess you have to wait for the bill to see how much the drinks were), but then the waitress (who was very nice) suggested the lunch menu - much better but still priced a little high. We passed on the chips and salsa appetizer deal she told us about that was for 4.. priced at $18 (ummm no). So we decided to order... she took my order first and then took my girlfriends order - then she walked away, not taking the orders from either of our husbands (well okay, guess we are sharing then). So the food arrived, quite quickly, but the serving size was smaller than what I expected for the price and not really a meal you would usually share. The food was very good and full of flavor though.  We probably won't go back to this place with all the strange issues we had and the prices are just a little too high, especially considering the huge number of competing Mexican restaurants.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "ePfhvRM-deQgMduESHRWDg"
  },
  "Wh5uQ4hIbIFjxmcAwQ3d_g": {
    "date": "11/7/2010",
    "text": "This was truly a unique experience for me. I was just happening by on my way to the airport from N Phoenix and saw this listed on \"Yelp Reviews\" for restaurants around me and though I'd check it out.  I was well received and the climate of the staff was very pleasant. My food came within a reasonable amount of time although I was the only one of two seated in the restaurant.  I ordered a watermelon juice (real watermelon juice) on ice which was sweet and refreshing to begin with and the waiter recommended the lunch item that was a top sirloin skirt marinated, ride beans and some kind of layered tortilla bake with cheese and tomato salsa. They also brought out 3 ramadans of  Pico De Giulio, a smokey chipotle and tomatillo sauce.   The steak was tender and all the sides were unbelievably delicious.  Lastly I ordered a vanilla Ice Cream Crepe covered in caramel sauce and it was one of the best deserts I have ever eaten.  With everything including the tip my meal came to $25.00 for lunch.  for the quality of the food it was worth the price if it were a dinner, but 25.00 lunches are for me a little over the top.  So although the food was terrific, the pricing was not.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UHQ6Gwdt2ujYjhLxleMZqw"
  },
  "4BO0ayn9XPoxQ_-jNWD7Hg": {
    "date": "7/29/2015",
    "text": "Just inexplicably phenomenal! Cindy provides awesome service and the manager is stellar. They are always so accommodating! The guacamole is crave able and the enchiladas are out of this world. You can't go wrong with the salsa roja  either! In love with this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tXQr61G5LqZ7KRLFJwN3qw"
  },
  "B53qCskQcbzjRvF1QPTOgg": {
    "date": "4/30/2011",
    "text": "We found this place completely by accident, but it called to me from the road.   When you arrive they provide you 3 sauces a hot chipotle, a medium green chile and a mild pico de gallo. I mixed the chipotle & the pico... to die for. My friend, who normally perfers a milder pallet enjoyed it too. She raved about the guacamole, said it was even better than hers. And she's the expert.   Be sure to start with one of their traditionally Hispanic juices. We had both a glass of the Watermelon & the Cantalope. We were wondering if they would mix juices; our waiter overheard & yes they can.   My friend started with Cream of Cilantro soup, which turned out to be delicious and the serving size was substantial. Then she had a salad with chicken. On her first bite she paused and savored. We both did a lot of that.  I order a beef dish that was new to me. It was thinly sliced, yet still succulent and such a flavor! The plate also contained refried bean, rice and some killer chilequiles.   A couple of notes - I asked the waiter what region the food was from because the beef reminded me of the food of Jalisco & while the chilequiles seemed pure Sonoran. He said it was from a region south of La Ciuidad de Mexico.  - the restaurant currently has to no liquor license, but you can bring in beer and wine. The new owners are in the process of applying for one.  - the name \"Asi Es La Vida\" if translated word for word would be \"This is the Life\" however in colloquial Spanish it mean \"Such is life\" or \"That's how the world is\" LOL  Unfortunately I live in Gilbert, but I'll be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DqNH4isXL9JTJfLc1btnKg"
  },
  "lQ-KgVrCPrWZPqjdUN5lTw": {
    "date": "4/1/2010",
    "text": "They re-opened!  I'm a very happy foodie right now.  Went for lunch today and it was as good as I've come to expect.  I got the special, which was sea bass.  Unbelievable.    I usually get the specials and have never been disappointed.  Don't forget the guac & chips to start off.  They aren't complimentary, but well worth the price.    All of their natural juice beverages are the best I've ever had.  My favorite is the watermelon.  Yes, I order watermelon juice at lunch!  Crazy no?  The mariachi that's normally playing lunch wasn't there today, but I'm okay with that.  Just happy they're open again.    The service is amazing.  Very personal, prompt, and inviting.    Consider this rating a 7-star!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "wUGjJyKgXDuXDaqP-TbLwQ"
  },
  "751BkOHkwNSq-2isoUYFdA": {
    "date": "11/4/2010",
    "text": "WOW!  We drove by this place a few times before deciding to go in tonight for a celebratory dinner.  We loved the entrance (very quaint) and were pleasantly surprised by the \"unique\" interior decor.  Our waitress was AWESOME!  Very friendly and patient with us... we don't eat Mexican food much and I had no idea what most of the menu said.  Also, I am mostly veggie.  That being said, the menu is mostly not veggie!  When I mentioned this, not only did she have the chef make an entire plate special for me... they also made the tortilla soup veggie for me!  The cantaloupe juice was TO DIE FOR and the fresh guac and chips were delish.  Hubby loved his mole and... whatever else that was meat that he ate.  We will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b9xOA9iedNV9Njvqx5Orkw"
  },
  "Qn5OY-3Nd48ZIGBS9nem1A": {
    "date": "8/11/2015",
    "text": "Food is ok. This place used to have awesome food, not sure what happened here but its different now. Great for a romantic date, specially on Fridays",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VcXILMht4_8z4aBoj2gKNQ"
  },
  "rOnmxyr5989bYUaFWD7dcA": {
    "date": "7/21/2015",
    "text": "I love this restaurant... From the fun, artsy decor to the mole sauce... it's great!  The enmoladas are amazing.  Seriously, the best mole sauce I've had in recent years.  The dining area is small but cozy... the atmosphere is so comfortable and unique that it makes for a great experience.  The staff aims to please... they are always friendly and attentive (and they don't overdo it to the point where they're annoying).  Give it a try if you haven't!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6PUNuDZpL9TivGYE6pBZ4Q"
  },
  "t0ZrRAKQw1AY3vSCFQYq5g": {
    "date": "4/10/2013",
    "text": "We found this place by accident and now I'm a big fan.  The outside of the building is colorful but from 24th street it doesn't scream try but you need to.  We started off with the guacamole which was very flavorful but they served it with the chips stuck in it so there weren't enough chips in the beginning.  I had the shrimp special which was delicious but I don't like to have messy dishes served with tails on as your fingers get sticky.  My friend had the cesina a thin sliced sirloin cured and then grilled.  They served this with the chilaquiles a tortilla casserole in a ranchero sauce and rice and beans.  The sirloin was very flavorful and nicely spiced and the chilqquiles tasted like a dish a grandmother would make with love.  The space is a little small and tight and service was a little slow but the servers were very friendly and the food was fantastic.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x3QPIQR4wIkvI0Ibll7tXg"
  },
  "8SW9_0zIyE-Hr7h05TvZLQ": {
    "date": "7/3/2019",
    "text": "Don't let the pink exterior scare you away from this restaurant, hidden in plain sight on 24th Street as the food and ambience are spectacular. This is not your run-of-the-mill Mexican restaurant but an upscale bistro designed to excite the senses with delightful aromas of spices. The waiter who served us was polite, efficient and helpful as he explained all the choices.  The parking lot is small but probably adequate so long as some of the customers park on the street. This may not be the cheapest Mexican restaurant in town, and it's definitely not the most expensive, but you will definitely feel that the cost of your meal will be worth it.  Go, indulge, enjoy and appreciate this local establishment.",
    "rating": 5,
    "rated": {
      "funny": 7,
      "useful": 11,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "igoku7ZVz_n-R3Vk0pc6Hg",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Mmmmmm yummy.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/igoku7ZVz_n-R3Vk0pc6Hg/o.jpg"
      },
      {
        "img_id": "l_m5ZFiDxbH5uMQgrRIxpw",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Great Wine Rack.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/l_m5ZFiDxbH5uMQgrRIxpw/o.jpg"
      }
    ],
    "user_id": "diYbASjeqV4CxkoyeBeBGw"
  },
  "8liYfJzQ3NeT3HyY2jk8TA": {
    "date": "8/18/2019",
    "text": "Asi es La Vida \"this is the life!\" a wonderful authentic Mexico City style restaurant on 24th street and about Osborn. Great ambiance inside wonderful art and Mexican sculptures. We enjoyed the service everyone was very friendly and helpful with the menu. We ordered the guacamole and chips fresh and full of flavor. I had the Cesina thin grilled steak served with chiqules rice and frijoles delicious. My wife had tortilla soup and the crepes di Cameron my daughter enjoyed the enchiladas with white cream sauce. Everything was full of flavor we took advantage of the Yelp check in for free dessert, give them  a try if you are looking for something different.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "H1XgToqjhGCtfVV9Vo1bnQ",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Bill",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/H1XgToqjhGCtfVV9Vo1bnQ/o.jpg"
      },
      {
        "img_id": "o4Dk2fVxUzMDnX2XFuqRQg",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Free Tres Leche cake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/o4Dk2fVxUzMDnX2XFuqRQg/o.jpg"
      },
      {
        "img_id": "CMyoIe_c_Fy_fDlwyK4hAg",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Enchiladas crema",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CMyoIe_c_Fy_fDlwyK4hAg/o.jpg"
      }
    ],
    "user_id": "_lQ9kg-SXdaKNyvRS-I4Ug"
  },
  "5ISOKM7JegWeEYBm614Nag": {
    "date": "2/10/2019",
    "text": "I've driven by here so often and thought \"oh, interesting pink building.\" I'd not driven by and thought \"I have to eat there.\" Now, I'm driving by and thinking \"I want to go back and eat there again!\" You just can't judge the food or interior by the exterior. The building really doesn't look like much during the day, but at night, it comes alive with great food and service, wow!  Our waiter was fun and did a great job of taking care of us, including starting our group off with Mexico City sangrias. So delicious! And, to his credit, he warned us that they would go down like Kool-Aid. I have to disagree. Kool-Aid doesn't even come close to the delicious taste of these Sangrias (yes, that is plural--yep, more than one). I guess he didn't say they tasted like Kool-Aid, only that they'd go down like Kool-Aid. I guess he was right.  We started by sharing a plate of guacamole. Yummy. Great flavor and the tomatillo sauce was incredible! For my entree, I had the sea bass, which was simply wonderful (melt-in-your-mouth wonderful), and what a great ingredient, the green olives in the sauce, just the right amount of kick. Nice presentation of the food, too!  We did the Yelp check-in offer of a free dessert, which we shared four ways (no guilt there). The next day, we all wondered if we hadn't had the Sangrias would the food had tasted so delicious? We all agreed the answer was YES.",
    "rating": 5,
    "rated": {
      "funny": 8,
      "useful": 17,
      "cool": 15
    },
    "photos": [
      {
        "img_id": "8C5cALCnzRKkSLpx8hH9VQ",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8C5cALCnzRKkSLpx8hH9VQ/o.jpg"
      },
      {
        "img_id": "V5U4QiolVQ0oPgAFwREFyg",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Guacamole",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/V5U4QiolVQ0oPgAFwREFyg/o.jpg"
      },
      {
        "img_id": "-tb4dsQXfBATs7rllvHzYw",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Sangria (knock you on your butt)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-tb4dsQXfBATs7rllvHzYw/o.jpg"
      }
    ],
    "user_id": "Q6iiwjxWCfesMNz2sJYHZw"
  },
  "eaB-xSTlIZQB2s483FHwqg": {
    "date": "2/14/2019",
    "text": "This is a super upscale Mexican restaurant and a hidden secret of Phoenix.  I'm not talking cheese-filled tacos/burritos/enchiladas.  Expect Chilean sea bass, perfectly-cooked tampequena, and delicious mole sauces.  Service was amazing; we received personal attention that you'd find at high-end restaurants around the Valley with twice the price tags.  We also were serenaded through our dinner, with live guitar right near our table.  100% recommend the Mexico City Sangria.  Wowza, that drink packs a punch.  Our table guacamole was freshly-made and served with a variety of salsas which alone were worth the cost of the guacamole.  I had the tampequena, which was delicious, but also sampled multiple other meals around our table.  You probably can't go wrong.  Don't forget to check in on Yelp for a free dessert!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "7XfiFNOLUBipeAmITbXP6w",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Tampequeno!!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7XfiFNOLUBipeAmITbXP6w/o.jpg"
      },
      {
        "img_id": "GOHC0tq4bnfEQppLMpG51Q",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Mexico City Sangria!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GOHC0tq4bnfEQppLMpG51Q/o.jpg"
      }
    ],
    "user_id": "MwWO6axFPTCXqN0DAfUhIQ"
  },
  "X9p2zWgK8FuEBowVPVErSQ": {
    "date": "1/19/2019",
    "text": "My companion and I stopped by Asi Es La Vida during our visit to the greater Phoenix area. I actually really loved the restaurant! The restaurant's vibrant color of the building and the cozy, intimate ambiance inside was super cute. Really a good place for a casual, non stuck up date or with friends/family in a non pretentious environment for sure.  I had the pork Farlolitos and my companion had a tortilla soup and a recalentado. We also shared salsa+guac and chips for appetizer. I loved my meal..very light and tasty. My companion liked his meal too...although after we left...he told me he actually preferred my dish than what he ordered (I tried his dish too and I agreed with that statement!). We also go tres leche and flan (flan was complementary from a yelp check in) and I loved both desserts. Overall, nothing much to complain about. We were there during lunch, so it wasn't so crowded. But I think if you plan to go there for dinner, it's best to make a reservation ahead of time (the restaurant isn't so big...so theres a chance you may have to wait without any reservation).  Overall, I would love to come to this cute place foran authentic Mexican meal again. I'm typically not a Mexican food lover (due to the fact that I think that food at most Mexican restaurants is heavy and made me feel so sluggish post-meals). But I do make an exception for this restaurant. Food tasted light and healthy...desserts werent too sweet...and the ambiance was super cute. I would love to come here again.  The only minus is that their lunch menu selection is smaller than their dinner menu. I actually was eyeing for one particular dish durung our lunch stop..but was told they only serve that during dinner. Oh well, maybe next time I'm in the area..I will get to dine here again during dinner!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "o8maoBU-mC8LSLix8pnsyw",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Complementary flan with yelp check in!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/o8maoBU-mC8LSLix8pnsyw/o.jpg"
      },
      {
        "img_id": "XSNTdtm9b_QP1K1I4SnOTg",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Pastel Tres Leches ($6.95)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XSNTdtm9b_QP1K1I4SnOTg/o.jpg"
      },
      {
        "img_id": "j6-Ot-veArB_k1UCLBnhWg",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Pork Farlolitos ($9.95) - they actually give you 3 of them but I forgot to take the picture until after 1 was gone!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/j6-Ot-veArB_k1UCLBnhWg/o.jpg"
      }
    ],
    "user_id": "6yw_4m8IBhdPeAvQNbFMDw"
  },
  "HdiPcu-btep9eq8XPwoQMA": {
    "date": "8/20/2019",
    "text": "Used to live in Phoenix and found this gem of a restaurant back around 1998.  Now, I live in Michigan, but travel to Phoenix about twice a year and always have dinner at Asi Es La Vida.  Upscale Mexican food.  Great food.  Great service.  Love this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fzkya-6Nb0q55FAGt-yIhw"
  },
  "0CUbjy9D0rZMSDxatkQIZg": {
    "date": "12/20/2018",
    "text": "The real deal...from Mexico City. Probably the best mole I have had. First time here for lunch. Had the appetizer plate as a main dish. It included cochinita and mole, cochinita pibil and a shrimp crepe. Exceptional meal. Three choices of salsa. Shared a tres leches cake slice for dessert. Unique decor and one of a kind. Very well done!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "8_msyG1XX8u-B56bRcwVHw",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8_msyG1XX8u-B56bRcwVHw/o.jpg"
      },
      {
        "img_id": "tHNbugXV3PJAtbyseV8wxg",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tHNbugXV3PJAtbyseV8wxg/o.jpg"
      },
      {
        "img_id": "3lMe_xOnha4u0AkVkPyzHw",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3lMe_xOnha4u0AkVkPyzHw/o.jpg"
      }
    ],
    "user_id": "LQi0uu43n0jSTulZFvXtwA"
  },
  "pQIK7mfKbgvkEhbc7euj2w": {
    "date": "1/22/2019",
    "text": "Wow! What a great surprise. We drove by this bright pink building several times before finally stopping in. The interior is lovely! White tablecloths & pretty decor. You feel like your in Mexico City. We've been here twice for dinner and lunch & both times were very impressed. Everything is delicious!   I had a skinny margarita that was great! We ordered the sampler appetizer that was delicious. Try as much as you can it's all good. And their fresh juices are good too. The Mole is hands down some of the best I've tasted. They have Guisados that are stews, Yummy! The Pescado a la Veracruzana is also very good. I'm so happy that this place is so close! We will be back often!!   It's a family owned business and it shows that they put their heart into it! Do yourself a favor and go!! The service is as good as the food! Enjoy!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZkndTivrPLSE890bHVb61w"
  },
  "Y9fdLtbFKUvG9fEQ3bYgKw": {
    "date": "10/27/2018",
    "text": "Hands down the best Mexico City Mexican food in the valley and that comes from someone that has eaten at many local establishments. We'll get to that in a bit.  You just can't miss this place. It is just north of Osborn the on 24th Street. If you miss it I would be amazed as it is the brightest, pinkest, restaurant I have ever seen. What you would assume was the front door is actually locked because of the live music they have I believe 5 nights a week. The music isn't loud and will not disrupt your evening at all, but adds the perfect ambiance for what will be a dancing tongue of joy you will be feeling shortly.  We sit at the bar 90% of the time and like with most family establishments we get to know the employees quickly. We have met two of the sons, I believe the only daughter and the mother who helps out in the kitchen.  This will presently surprise you as the Mexico City Mexican Restaurant has white table clothes and the decor sets a perfect mood.  Finally to the food... I am a mole snob period. I won't name other names on this review but know that there are many varieties of mole depending on the state that you are visiting so there probably really isn't a \"True best mole\" unless you are comparing it to the state in which it derived from. This, however, is my favorite so far on this planet...  Then I found their cochinita and that literally changed my life. I can now fully endorse not only their mole but now my favorite cochinita ever.  I always grab a cerveza when I am there but my wife will snag either their sangria (little splash of vodka added, my wife says it's unbelievable) or their margarita. I highly suggest sitting at the bar if the daughter is there and asking her to just say margarita for you... it is awesome the way she says it.  I cannot highly recommend this place enough... so much that we are debating getting the cochinita 2 days before Turkey Day so we can enjoy it on that day.  Lastly, I am not a dessert guy... just not my thing... but have had a bite of their flan which I saw another patron wait patiently for an entire pie to bring home for a party he was hosting... asked him what he thought of it and thought it was the best he had ever had... he then asked for a slice for him alone for that evening as the dinner party wasn't for a few days :)  Again ask the daughter to say \"margarita\" for you :)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "qHED5mJetXpySUL_Or9MpA",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Some of the amazing art and decor",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qHED5mJetXpySUL_Or9MpA/o.jpg"
      },
      {
        "img_id": "elTn0TIbFwbfRqFMxrdxRA",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Lunch menu 2018",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/elTn0TIbFwbfRqFMxrdxRA/o.jpg"
      },
      {
        "img_id": "pOxyQ80doo6tAGpehaHGew",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. One of two shelves of amazing tequila&amp;#39;s... tell the brother what you are looking for and he can broaden your experience with tequila",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pOxyQ80doo6tAGpehaHGew/o.jpg"
      }
    ],
    "user_id": "8bt-F30D_tW-ajPG-IpZSA"
  },
  "UVX0kQVzPv2qASG4UhUt6A": {
    "date": "3/25/2019",
    "text": "I'm not at all impress with this place. But I do see why white white folks like going here. Really the food is not worth the price. I ordered the seviche and it came in a small pudding bowl with 5 crackers for 11$ /12$ bucks. It was plain. It was shrimp, a lot of lime and cilantro. I do not recommend this place if you want to EAT. This place is charging way too much. I recommend Barrio Cafe even tho it's the same price range but the food is way better and filling.  I give it 2 stars for the vibe.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GJJPGC3m5EGJHRDYW5HyZw"
  },
  "o6Ue39KBwNBDESwpLxHBug": {
    "date": "6/28/2019",
    "text": "Great food! Amazing authentic upscale Mexican food! I go once a month for it! Can't miss the bright pink building on the side of the road on 24th. Stop in! It's a must!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5VItKvwNVexr4qodgdWN5A"
  },
  "HvYxpH6yoQDnzVYfDLU2pw": {
    "date": "8/31/2018",
    "text": "This place is the real deal!  Live music that stops while you talk with your server. Beautiful Frieda artwork all over, and gorgeous, colorful plates.  We started with skinny margaritas and guac, which were delicious and shared the carne tampiquena. We loved it!  The steak was quite thin, but still delicious. We ate it mixed with the rice, guac, and poblano with beans and cheese. Their mole sauce is delicious!  We we're given the option of having the mole enchilada or an enchiladas with green sauce. That mole was so good!!  Their tomatillo salsa was excellent. My bff ate it with a spoon. (:.   I'd love to return on my next trip to Phoenix!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "68Pz3adTFyy7tgkcpfzBcA"
  },
  "86_3AVRbSmDfBHJNQuYo2w": {
    "date": "9/7/2018",
    "text": "Well you wouldn't know it but the bright hot pink building has the absolute best Mexican food in all of Az. I have been here so many times and have never been disappointed. They have a huge selection of tequila and make there sangria fresh. Excellent guacamole! And there shrimp crepes I could eat everyday! Wish I took pictures but the food was eaten before I even took my phone out. I have had so many different items from the steak to the enchiladas and I find the food so damn good. You can't go wrong with any option on there menu, if you go for lunch you can ask to see the dinner menu and if your not in a rush they will accommodate you by making something off the dinner menu. The brother and sister bartenders are so friendly and make u feel like you are in their home.  I have been here many times so much that they remember me and my family. I have never had a bad experience ever! Have loved everything that I have ever had!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "br6sa7YbrYmRwF3A2e4VuA",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Cochinita pork is amazing and pork mole is fantastic",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/br6sa7YbrYmRwF3A2e4VuA/o.jpg"
      },
      {
        "img_id": "kpkbVJCGRBBQRq18RH3cZQ",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Best sangria with fresh squeezed juice and vodka and wine",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kpkbVJCGRBBQRq18RH3cZQ/o.jpg"
      },
      {
        "img_id": "hLanFnT2VWQwFxOiPK1D2Q",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hLanFnT2VWQwFxOiPK1D2Q/o.jpg"
      }
    ],
    "user_id": "FOozVx4k0CrDf2wPYJYqWA"
  },
  "ydkq59XfO3yLiWbkJ2zObA": {
    "date": "12/30/2018",
    "text": "Delicioooooous.  Service was excellent. Guacamole yum and the fresh pineapple juice awesome.  Had the adobada and chilequiles and was good but willl definitely be back to try out so many other options that sounded great too   The Crema de cilantro soup was great. Thick and creamy.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Zv4GQ5RriCKnQUDQin2vSg",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Zv4GQ5RriCKnQUDQin2vSg/o.jpg"
      }
    ],
    "user_id": "TAgqgqeoEhKALVODkOES1Q"
  },
  "gbrp1bd9YUUwpMPcGn5urQ": {
    "date": "11/8/2017",
    "text": "What an adorable little place!!!  I don't know how I ever missed the hot pink exterior every time I drove by.  My friend picked this place for us to meet for dinner.  You park in the back even though that's where the entrance is.  Their front entrance is actually blocked from the inside.  It's interesting because you walk through a front lobby area, through a door, down a hallway, past the kitchen and then into the dining area.  The place is small but very quaint and decorated nicely.  It's actually quite romantic as the night we were there, there was a guitarist singing some beautiful Spanish tunes.  We learned they have live music Thursday through Sunday.    I ordered a shrimp dish which came with a toasted baguette, rice and this amazing corn concoction.   The shrimp were butterflied and were quite large.  I enjoyed every bite.  We also ordered the chorizo fundido cheese dip and that was amazing.  I could've eaten 2 more plates of those.  For dessert, I received a free dessert by checking in to Yelp.  I had their flan and loved it.  The bonus was their watermelon drink had free refills!  There was nothing I disliked here.  Service was great, food was fantastic.  I want to take the hubs here next time for our date night.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Uyr0aveD2G9cAV_MxNGJMg",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Uyr0aveD2G9cAV_MxNGJMg/o.jpg"
      },
      {
        "img_id": "IgZLV1v0PMG0FP2vsFIjdg",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IgZLV1v0PMG0FP2vsFIjdg/o.jpg"
      }
    ],
    "user_id": "WwW0bh9cXtyl4ruIKjlAqg"
  },
  "6jdjMm2kds4JuL6g8-VCAg": {
    "date": "11/30/2018",
    "text": "This is my favorite Mexican restaurant in the Phoenix area. You walk in and they immediately treat you like family. The food is great, the drinks are strong, the atmosphere is inviting. Everything tastes fresh and typically feels healthier than most other Mexican restaurants. This is my go to restaurant when I'm in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "E2hbmxTMUgNj0W4b6-tgcQ"
  },
  "SjBr5DNP6c99wXmLLY91kw": {
    "date": "12/2/2018",
    "text": "We absolutely loved this place! We brought our extended family who was visiting from out of town. They requested Mexican and this place has been on my bookmark for years, since seeing it on 'Check Please Arizona'. Everyone thoroughly enjoyed their food and the live vocal guitarist was on point! The only thing I would change would be bringing our 2.5 year old, probably not the most kid friendly place  (white linens and lots of people on dates minus kiddos.)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cmFzsgnhwY8O01_O9v7RlQ",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Who doesn&amp;#39;t love a pink restaurant?",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cmFzsgnhwY8O01_O9v7RlQ/o.jpg"
      },
      {
        "img_id": "1NlRDAbIrgc9QVBYEZFmcw",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Love all the authentic art work! The lighting was perfect",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1NlRDAbIrgc9QVBYEZFmcw/o.jpg"
      }
    ],
    "user_id": "xlzun3_iFzaFwFImLM6E6Q"
  },
  "DZ4lST9MuXOtCELWfpkxaA": {
    "date": "1/19/2019",
    "text": "Took the other half here on a whim after randomly driving past this unique looking restaurant the previous day. Boy! Am I happy I made the decision to give this place a chance! I ordered the 'filete chipotle' which is a cut of filet mignon served over a small tortilla and melted cheese and topped with a perfectly flavored chipotle sauce. I was worried the sauce was going to overpower the steak however, I was wrong. The sauce perfectly complimented the perfectly prepared cut of beef!   She ordered the 'filete Asi Es La Vida' which is a filet mignon again served over a tortilla with melted cheese and topped with grilled onions, poblano peppers and garlic. Both steaks were perfectly prepared, were very consistent in terms of texture and perfectly hit the spot!  Both entrees were served with a side of rice and black beans which were also quite delicious. We ended the night with a slice of flan, which also tasted amazing!   Do yourself a favor and give this place a try. It's the perfect atmosphere for a date night and they even had live music while I was there. Fair warning that the place is pretty small so arrive early or make reservations. The service was also quite impressive. High quality food and excellent top notch service for not a bad price! Both of our entrees were only $28! I'm happy. She's happy. My wallet is happy. Most of all, my stomach was happy! I WILL return in the near future to try their lunch menu, which looked a lot more relaxed(tacos, enchiladas, chilaquiles etc.). Give this place a try! You will NOT be disappointed! Mark my words! Provecho!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GmmQVzGYYBeasckY5LvOtA"
  },
  "oH4Yk1UdmGqxbgEYhAEdpA": {
    "date": "7/11/2019",
    "text": "All I can say is the food is to die for! It made me feel like my mom or abuelita had cooked our dishes. The place is so cozy and so like home. Top quality, elegant, and delicious. My compliments on our server, so nice. I am so impressed with the entire place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0JQi1yS6o44Ytz5p1_ppjQ"
  },
  "Fkqje9HURUd2F_y87Gyf_w": {
    "date": "12/12/2018",
    "text": "Asi es la vida is an excellent place for some fancier Mexican food. The food is the star her. I've had just about everything on the menu and it's all fantastic. The guisado stews are delicious. The cochinita pibil is amazing.  Very quaint. It feels like this may have been a house previously, which makes the layout a little funky. They often have a guy playing guitar softly near the bar area / very romantic. The Frida artwork on the walls is a nice touch too. It's not cheap but then again this isn't a -berto's place. Would be a good place for a first date, or to take out-of-town visitors to. Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pZ_rhjEO2hlOqoOJJc-pjg"
  },
  "M9YX0rDD0pjyb8AvncJ56Q": {
    "date": "9/21/2013",
    "text": "If you want to experience Mexican food that differs from the Sonoran and Tex-Mex versions you know, this is the place to go. Asi Es La Vida serves \"regional Mexican food.\" Our party of three shared the thick, flavorful chips and delicious guacamole and split a dessert of ice cream filled crepe topped with warm caramel sauce. Our luncheon selections were individualized, except when one of our group, who grimaced when another ordered Crema de Cilantro soup, tasted his and decided to duplicate his order. Her dislike of cilantro was overcome because it didn't overpower the other flavors in the soup. Each entree was a pleasantly unique dining treat. They included Adobada, Enmoladas, and Chicken Sincronizadas.  Service was prompt, courteous, friendly, and efficient.  We liked the decor and art on display.   I had been here 20-some years ago when it first opened and East Coast friends took me there after reading a rave review in the New York Times. We gave it raves, too. But life intervened and I didn't get back. Over the years, as I occasionally drove by, I was put off by its garish external transformation. I'm glad I read the recent New Times back story about this restaurant and decided to return. And, now, I'll be back with some frequency.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "TKWlJiqFJ1HNxMA7lwOJMQ"
  },
  "UQVO7KYQ4mHiWcb0D52c-w": {
    "date": "2/13/2016",
    "text": "Service was wonderful. Food was fab. Had special appetizer sampler and shrimp special. Alexis our waiter was extremely helpful wth suggestions. Restaurant a real gem",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cfFkodDZ9w4iCZZG7hqI4w"
  },
  "ovP4tWLwqFpCgkJL0ddIxg": {
    "date": "5/26/2014",
    "text": "This place is small but the presentation was nice. They had fruit juices & the food was authentic. The waiter was professional and quick. I will defiantly be coming back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oKT9Xyo64TLOzR3Y7qBjOw"
  },
  "dRrhNWJd0sfjD0b7thiQ5g": {
    "date": "4/16/2011",
    "text": "Went here for lunch with a co-worker.  They brought us out a typical small guacamole and cold chips before we ordered.    We ordered our food- chicken quesadilla and carne asada tacos.  The beans were cold, but the food was good otherwise.    We had a nice time, and when the bill came were in a rush to get back to work.  We noticed the bill was significantly higher than expected.  When we asked our waitress why, we discovered THE SUPPOSED COMPLIMENTARY (WE HAD NOT ASKED FOR THEM) SMALL CHIPS AND GUACAMOLE WERE $10.95!!  We did not have time to address the management, which I would normally do in this case.  The waitress did not apologize, and confirmed there was not a sign or note that informed us the chips and guacamole were mandatory and not complimentary.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 8,
      "cool": 1
    },
    "photos": [],
    "user_id": "DikvlDDYS3WLPugS1-5A7w"
  },
  "HGPJBMChhwm0jtZsBQXJHQ": {
    "date": "3/8/2012",
    "text": "TORTILLA SOUP = not the biz.  that's all I tasted so that's all I'm rating this place on lol",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jND4Ie4s2HEheM3Ugb6unA"
  },
  "ttV64S8NkGXXyjz_K9ERQg": {
    "date": "12/4/2014",
    "text": "My first time and will be back soon !! My wife and i enjoyed it so much.friendly <a href=\"/redir?url=http%3A%2F%2Fstaff.cheap&s=33eb6436ca18ce99aefcd17ee4fe4c449108002cfbcef149b104ec5a22c07be5\" target=\"_blank\" rel=\"nofollow\">staff.cheap</a>.yummy,romantic,amazing food. Love the atmosphere so pretty inside love al the Khalo portraits.yummy flan. Recomend to everyone inAZ",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WlZKmSX0sKpYPEEVuYIR9w"
  },
  "heBFZj7I2AcLi2jW0eOsxQ": {
    "date": "4/12/2016",
    "text": "This family owned restaurant is outstanding! The Mother is an absolutely gifted chef. The family staff is very friendly, personable and attentive. They cannot do enough for you to ensure that you have a fun, wonderful dining experience. My husband and I dined at lunch and then went back the next day for dinner. Yes, it was THAT delicious. We had the specials that were really outstanding. The margaritas are the best that I have ever had.  The food is authentic Mexican and not your run of the mill tex-mex. This cozy restaurant is extremely clean and beautifully decorated with colorful paintings. The acoustical guitarist added the perfect touch to a wonderful meal. We love this restaurant and we can't wait to return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IGbxPMPewyXpW2slDdareA"
  },
  "mLNew3_yP1BSVRlZUIBsFA": {
    "date": "4/12/2014",
    "text": "Amazing experience!  The food was fresh and homemade.  The service was genuine, helpful and very attentive. The margarita was made from scratch and they had fresh squeezed juice.  I would highly recommend this place! !!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L9m9R0FGjjOJW-7LAjg_uw"
  },
  "U2CepdXL8MQyUMaLj1-V0Q": {
    "date": "2/16/2016",
    "text": "Decided to have a family birthday celebration dinner here. Had reservations and everything ready when we got there.  This is not a large chain restaurant  but a small intimate family owned establishment that still accommodated us.  Our service was exceptional and very attentive.  This is not your typical  Mexican food that is here but rather Mexican cuisine that you would see in Mexico City or even in Oaxaca.  Everything we head from the appetizer sampler to our dinners was fantastic.  Nothing microwaved everything very fresh and cooked to perfection. Three  of us had the special which was Gulf Shrimp wrapped in Bacon and grilled  was excellent and not over cooked. The other three in our party had three different steak dinners  Felete \"Asi Es La Vida\" , Carne Tampiqueria, and  the  New York Strip all said cooked  perfectly.  Everyone was too full to have any dessert.  Very nice touch to the evening was the live music a single guitarist  playing Spanish music and singing.  This restaurant has been added to our list   of nice places to return to.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ueT5uI3qHERwN3TkonxvpA"
  },
  "zV7Dois7ae7n0S-wkRJnpA": {
    "date": "2/20/2014",
    "text": "Came here on a recommendation from a friend. Never would have come in otherwise - if you're put off by the exterior as I was don't be! EXCELLENT service,  and the food was wonderful!  Get the cilantro de crema soup to start. You won't be disappointed. It was pure comfort in a bowl. Our server said they are famous for their award winning mole. It was delicious. Many levels of flavor to savor. This would be a nice date place, upscale dining with live music on certain nights.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GPAI8n8Gt_fQ5GsRXGXknQ"
  },
  "x1EaXU0BjupTI0WBw6NCEQ": {
    "date": "9/21/2015",
    "text": "The food was ok and I like the atmosphere but when I checked my credit card statement, I found the establishment had changed (increased) my gratuity.  That happens very rarely in my experience but when it happens (usually by a dishonest server) I make it a point never to return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zb3IKmIEIaBqMevAiP3o_g"
  },
  "yCLZoLaSsXYw1PKDYWQA0Q": {
    "date": "5/17/2014",
    "text": "Don't let the cliche, vivid exterior fool you into thinking this is just like the other \"Mexican\" food places. The food and drinks are far from basic on the delicious scale. If you're searching for True authentic Mexican food this is the place to try. For a second I thought I was having grandmas secret Chicken Mole recipe, which is what I would recommend!  P.S This cozy and intimate place also host live music on the weekends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w5fX7Ehb9_rhMvOQaOz-8Q"
  },
  "lEaj0MPNmf1ACGDjAACFdw": {
    "date": "4/13/2016",
    "text": "The best Mexican food I have ever had, truly authentic cuisine! I have never liked mole until I tried theirs. Cochinota pibil is my favorite Mexican dish and it is a hard one to find, and they kill it! Family owned and operated they treat you so well! You will be dying to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KAQQcM1qrhclyZ9G3euPwA"
  },
  "MKUsLSYPNYha4RZMORvxkQ": {
    "date": "10/2/2014",
    "text": "The best mole sauce I've had anywhere, including in Mexico. Delicious guacamole as well, and a rotating selection of agua fresca. Tiny place, but beautiful interior and excellent service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rbmM6JGWldrApKT_cLz6uw"
  },
  "YxigT4iY_AAmvwq9yk1uEg": {
    "date": "5/6/2013",
    "text": "Im wondering why it took me 4 years to finally eat here but man am I glad I did. Top notch service. Enchiladas were some of the best i've had. Really fantastic margaritas. Will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "RAtI6Ue6LXXDwuFl6hDwHw"
  },
  "_lVxv1pGEFHrjXrPc2SMfA": {
    "date": "3/3/2016",
    "text": "Disappointing.  Had roasted pork in a nondescript red sauce for ca. $16.  Wasn't impressed.  My dining partner thought their entree was so-so.  Good guacamole & margaritas, but won't be returning.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8v-yiOnSrpzihD0Q8BoPvg"
  },
  "F2W1G1WixAcMIgvkJ7FW8g": {
    "date": "2/6/2014",
    "text": "I've been dining at this establishment for a while now. I absolutely love the food. The service is outstanding; very friendly and attentive staff. The decor is nice and relaxing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Uiu_O1oAqUvvJOGjgno9Eg"
  },
  "a3K-4IP1l0De65VyNS8JBw": {
    "date": "7/1/2011",
    "text": "The juices were fantastic like last time.  tostada chips and guac were fantastic.  I ordered lamb again...this time the smell was great and tasted good.  The rice with frozen veggies were still wierd considering its an expensive dish.  service was also great...will come back here again to try other things.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fqd2-YolEWhgvcwIhnsvRg"
  },
  "yPwEiTiW2Dqwzj3Wf-Q1_Q": {
    "date": "12/16/2013",
    "text": "Excellent food. The appetizers were delicious. The margaritas were very good...very smooth, not made too strong. My entree was the Chilean sea bass. The sauce was the most amazing mixture of cream, chipotle, and wine. My husband ordered the filet and was blown away how tender the steak was. After dinner, the waiter arrived with a slice of cake for my birthday. I had never had Tres Leches cake before this moment and it is my new favorite dessert. The restaurant had a singer performing in the dining room. He played guitar and sang beautifully. This was a wonderful dining experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oI2H-oeuvJDY1E7hYI-zhw"
  },
  "EacU6_X-qD_du-o1ueBGzw": {
    "date": "4/16/2011",
    "text": "I had lunch here earlier today and while the food is decent, something really turned me off.  I usually order water to go with my food and when I did, the server brought back 2 water bottles (for me & my wife).  I asked for just regular water but the server replied that his manager can only provide water bottle unless we also order drinks.   This nickel & dime-ing by the restaurant manager really put us in a bad mood.  The service was good (not the server fault) and the food came out fast enough.     We order the Chips & Guac, Chicken Salad & Enfrijoladas (I think).  The food was decent. The total bill for 2 lunch with tips came out to about $31 and that includes the $2 charges for 2 bottle water.  Congrats to the manager for forced selling bottle waters to the customers. We won't be back to this place in the future.  I should've drove a bit further to Barrio Cafe.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DFkxnNqx5G-QVMwNnfb-Sg"
  },
  "UponXh2wP4n5A9R5cyLrKw": {
    "date": "8/5/2017",
    "text": "Absolutely delicious! We had great service, ambiance was lovely, and the food was incredible.  I highly recommend \"Asi Es La Vida\".",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v8O1kq2jC7yp1kcWvDbUNw"
  },
  "rykix5lyWNp35OqRBxWGAA": {
    "date": "1/18/2014",
    "text": "My husband actually found this place when he was researching recipes for cooking nopales. They have an amazing dish with nopales, chorizo, and cheese from Chihuahua. We went for lunch and that dish isn't on the lunch menu, but they made it for us anyway. I can't say enough nice things about Asi Es La Vida -- if you're in the neighborhood, you should definitely check it out.  As I said in my check-in:  Best mole ever. Best sangria ever. Love this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "QwY-oL7QkCRyZzjubEHKSw"
  },
  "6u8vUncjWQg7809zQnuH5A": {
    "date": "3/25/2016",
    "text": "Great little place for lunch-you can't miss the purple/pink building. Co-worker & I decided to try this place after seeing it on Check Please Arizona. Ordered the guacamole to start-very fresh & tasty. The chips were tostada chips which is better-sturdier chips for the guacamole. Three types of salsa was given: tomatillo, chipotle & pico. All very flavorful. In order the Chilaqulies w/pork. Very delicious, I was surprised that is a pork steak instead of shredded pork. My co-worker ordered the Enfriolada-the black bean sauce was yummy according to her. We also tried their fruit waters-watermelon & pineapple, both refreshing! Service was awesome, attentive & friendly. This place is definitely a must visit again to try other items.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "egybhvOhHyl4gjmqvjXtow"
  },
  "Tc4qM61oyb9itP7FU7lsmw": {
    "date": "4/30/2016",
    "text": "Pretty good food, nice people! Had the house recommendation of chicken enchiladas verdes and it was muy bueno! An eclectic decor (Frida Kahlo themed!), flavorful food and good conversation is what you get here. Loved it! Four stars only because this is my first and probably my only visit for a long time (since I was just passing through). Otherwise, I'm sure they'd be worth five stars in my book and will return of I'm ever in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v0UcxshrmIwMnd448pOAhQ"
  },
  "37_1XKPP82bagRUZAaew_A": {
    "date": "11/6/2014",
    "text": "Every time we come here the food is fantastic!  This week it's the Elk Chop special. We both highly recommend them.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GlEJolAoa9QKGI2BUCA7Ig",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. The Elk chop special is a must have!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GlEJolAoa9QKGI2BUCA7Ig/o.jpg"
      }
    ],
    "user_id": "ggiWrmMydRodR8vVD_WShg"
  },
  "wKwepA78FGOfGf7Vsfq4CQ": {
    "date": "6/28/2014",
    "text": "Very very delicious. .hidden gem, nice place to take a date.  The Cremosa cilantro soup is a must. great service excellent food.!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KuscjaDacFNU-JRdZflS2w"
  },
  "84F4KX-GWuhFNr68HGun8A": {
    "date": "7/4/2016",
    "text": "A local suggested this spot to us. Exceeded all expectations. This is not your average Mexican spot with burritos and tacos. There's a sense of elegance and authenticity that you cannot find elsewhere. The food was incredible and the service was great too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B81vqgUtsXUNiKxFCrT1BA"
  },
  "q7geQFOQDWeWEVJjYTvV5g": {
    "date": "5/18/2016",
    "text": "Service is always very friendly & helpful.... Is a very low-key place with authentic Mexican... The green & red salsas they bring out are my FAV .... their Chilito Poblano app is VERY good....I def recommend, & have been there several times.  I prefer to go there for lunch as is less crowded & smaller portions, but that is just a personal preference!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j_Pyj2lkKDweybEt4SCOjg"
  },
  "ciNeSOXYxQI1MQkLEug_yw": {
    "date": "3/29/2014",
    "text": "Went for a cocktail last night and left after experiencing an amazing dinner. The restaurant is quaint and romantic. Excellent music choices played in the background which added to the romantic atmosphere. The food was to die for! I ordered the Tinga dish and wasn't disappointed. Chicken was flavorful and melted in my mouth. The pinto beans and rice that accompanied the chicken were delicious as well. My friends enjoyed their meals too. One order Enrollado de Res and the other a Ropa Vieja/Tinga combination.   The gentleman at the bar explained how everything is freshly prepared on site with the exception of the tortillas. They cut their own meat and are happy to serve those with dietary restrictions. Their lunch and dinner menus are different, I cannot wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BdyLGKKM92gvyJ-zXkvjww",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Tinga and Ropa Vieja combination",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BdyLGKKM92gvyJ-zXkvjww/o.jpg"
      }
    ],
    "user_id": "Zpl9xIF8EmbX_H4fczLMqQ"
  },
  "iK5TwA8HzPKZrQhM1BY7Lw": {
    "date": "11/9/2014",
    "text": "Don't let the bright pink exterior (and it's location right across the street from the Arizona Republican Party) fool you, the food here is top notch. Moles are as good as everyone says they are and the red and free salsas were incredible. The steak was well marinated and tasted good even without the mole sauce. Unlock the free Tres Leche through yelp, it's worth it. Although you might be so full from your meal that dessert might be the last thing you want.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GmqiqkPPzP1f2E7YWeM0Mw",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GmqiqkPPzP1f2E7YWeM0Mw/o.jpg"
      },
      {
        "img_id": "b1NphN1QdSmIGTjqtZEOMg",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Tres Leche!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/b1NphN1QdSmIGTjqtZEOMg/o.jpg"
      },
      {
        "img_id": "qvnlK13kMpilCrBWk0NQ_g",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Two different salsas and pico de gallo, the red sauce was amazing",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qvnlK13kMpilCrBWk0NQ_g/o.jpg"
      }
    ],
    "user_id": "6WelJCRGUJ46xoKdXNWXrg"
  },
  "YryTkkpwAY_qo9Y7ZT-NzQ": {
    "date": "6/18/2017",
    "text": "Great lunch! I started with the mushroom soup (delicious, garlicky broth), also enjoyed the salsas and chips (great grainy texture and toasted flavor), and the chicken mole poblano and pork combination platter was classic but not the slightest bit trite. Coming back with more friends soon!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TiLMduSeghECv-wBWdUNrw"
  },
  "8znUg0vXTVj5Ejvdv6ZBKw": {
    "date": "10/29/2014",
    "text": "Excellent, authentic Mexican! Has to be the best in Phoenix. The emoladas were incredible..with the most complex and flavorful mole I've ever had. The menu is select, and thoughtful. Portions are decent, not over the top excessive like at most places these days, and the service was outstanding. The ambience? Frida Kahlo themed and beautiful, with a tasteful vibrance that is both exciting and calming at the same time. It's quiet enough to have an intimate conversation, and there is a small bar and also separate rooms for larger gatherings as well. Will definitely start frequenting this place. It is a True find.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FmXkygM40Nzz56XNgJKB6Q",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FmXkygM40Nzz56XNgJKB6Q/o.jpg"
      },
      {
        "img_id": "DNFgKooJYpBONoQT814CSQ",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Handpainted decorative place settings",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DNFgKooJYpBONoQT814CSQ/o.jpg"
      },
      {
        "img_id": "z5_Ga2uwGMf4FoGgHzKdBw",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Entryway is inviting",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/z5_Ga2uwGMf4FoGgHzKdBw/o.jpg"
      }
    ],
    "user_id": "kNsBqMF92hxqdjUlrS_lIg"
  },
  "Oi1h0Efh_CsWxt33jA20lQ": {
    "date": "6/16/2014",
    "text": "Intimate setting that compliments an excellent brunch. Specialty juices & drinks were tempting.  Guacamole & chips were excellent with a nice presentation and flavorful salsa options.  Enchiladas with mole were fantastic. Beau enjoyed enchiladas with green chili sauce.  All eats taste extremely fresh. Portions realistic. Service was very crisp and polite.  Although lighting is dark, surfaces appeared very clean and sparkling.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3h3qmd0qgTA_-hnlcCodFw"
  },
  "xXs3FA3U3LTMY46ZRxrkSw": {
    "date": "9/4/2013",
    "text": "This place is a hidden gem and when driving through here for years I have to say the exterior makes me a bit weary on whether this place is capable of producing great food.  We decided to stop by for lunch with a few compadres from the office.  The moment you park in the back and walk in you know toto would be saying we are not in Phoenix anymore but he would say donde estamos aka as where are we?  This place is an interesting spot and the experience was beyond my expectations.    I want to come back as soon as we can make it to a margarita kind of night simply because they have a great array of tequilas and the food was spot on during my visit.  You have to respect a Mexican spot that has a very small menu, this means confidence!  They have a great Agua Fresca selection that they will continue to refill for you.  Our table tried all different plates and they were awesome.. I recommend their chilaquiles.    Finish off with a great flan and you will quickly realize why you never came here knowing it was here all along..   If you can uncover what is upstairs, please do so as it leaves me wanting to sneak in and find out.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "Vw3DWRZF-8Wt_A5rWKLKHQ"
  },
  "ZqjnEtts_piJlb6o1wOO1w": {
    "date": "11/5/2013",
    "text": "it was not bad but not good. I found that it was overpriced and a much more appetizing read than eat.  For appitizer we got chorizo app which was just a quesidilla with chorizo that was cut in half that cost $8. It was good but not $8 good.   For dinner I ordered Lamb Shank that was like $15 which had great flavor but I was only served like 5 small super tiny pieces of lamb that where over cooked.  For dessert I ordered a crape which came out cold  I was not impressed with the place or the food.  Service was great but in my opinion not worth it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "1EMRJJGrOwCcS7RVDon1Cg"
  },
  "sav71ZIPZyZLMTqceTw9WA": {
    "date": "8/12/2011",
    "text": "I went here for the first time at lunch today, after having passed by the place about a zillion times!  After reading other reviews, I knew better than to accept their \"offer\" of chips and guacamole.  I think it's strange that they would charge people for that when it's not even listed on the menu as an option.  Also, when they brought out chips and salsa prior to our meal, they literally gave us a PLATE that had maybe 6-8 chips on it!  Really??  Thumbs down for that!  I guess if you're not ordering the chips and guac you're just SOL.  However, the food was really good!  I had the verde enchiladas, and the verde sauce was great!  My friend ordered the conchita (sp?) with mole sauce.  She loved it!  We both had the watermelon juice and it was delish and very refreshing.    They also have a \"check-in\" offer from Yelp, that will get you a free dessert, which we used.  The default dessert must be flan, because that's what she automatically brought out to us.  It was good, but not great.  At the end of the day, I'm a foodie, so I'll put up with some \"extra\" stuff to have some good eats!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jEFFcMyjBwSx-IRrS3pvrQ",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Prior to our meal, they brought us a PLATE with about 6-8 chips on it, and some salsa. LOL.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jEFFcMyjBwSx-IRrS3pvrQ/o.jpg"
      }
    ],
    "user_id": "an-ijVpGQxgiOBX9qTBOyQ"
  },
  "FLbffsGl2i-wuAoHxnhNqg": {
    "date": "4/7/2013",
    "text": "This unique Mexican restaurant is one of a kind and definitely deserves some praise. My husband and I have been dining at Asi Es La Vida, at least weekly, for about 2 years now. We first found this local treasure when looking for somewhere to lunch on the one day a week Morgan works from home. Thanks to wonderful reviews on Yelp and it's proximity to our home, we settled on Asi Es La Vida. When we entered, a waitress immediately sat us at the corner booth. The bright interior was decorated with multiple beautiful, paintings of Frida Kahlo and enough colorful adornments to keep you visually stimulated for the duration of your meal.   Our waitress came over immediately to say hello and let us know a little about the menu. With a nice selection of homemade aguas frescas to choose from, I figured the watermelon sounded like a good choice. My husband was sad that he chose tea after trying my delicious beverage. It was light, sweet and just what it claimed to be....simply watermelon juice. It was perfect! Figuring we had an hour for my hubby's lunch break and wanted to enjoy this new restaurant find, it seemed only necessary to order an appetizer. The waitress suggested their guacamole and homemade, white corn tortilla chips. Soon we were presented with a small and perfectly portioned appetizer that came with pico de gallo, a mild green salsa and a roasted, spicier salsa as accompaniments. It was exactly my type of appetizer! I love to mix stuff together and create each individual bite to be a bit unique. This can be dangerous, however, as I tend to end up making a mess.  We each ordered a torta; I chose the avocado and cheese, while Morgan went for the adobada. My torta was delicious, served on a lightly toasted roll dusted with a delicate white cheese. I can only assume my husband's was as flavorful and fresh as mine, since he was suddenly quiet and did not return his torta to his plate. Then.... it was gone! I looked down, and so was mine!! This was defiantly a good sign. Throughout the meal, our waitress remained attentive to our needs. When she offered us the tres leches or flan as desert, we declined only because our little bellies were already full and happy. We happily paid our tiny bill (less than $25) and have been eating at Asi Es La Vida ever since.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "lNts94QhDJMGmFSZYlJdOQ",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Cantaloupe juice.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lNts94QhDJMGmFSZYlJdOQ/o.jpg"
      }
    ],
    "user_id": "YOMb9mF0GysOtY_4_CBSbA"
  },
  "wSW3F0pyA8pOWFdAcs6lcA": {
    "date": "9/21/2015",
    "text": "I took my dear friend there for dinner. Great taste and well prepared. The shrimp cocktail was fresh and tasty.  Prices are quite high compared with other Mexican restaurants.    Most plates are above $17.00, shrimp cocktail is $12.00. I would probably not go back due to the high prices versus value. Cute interior design but exterior needs to be improved.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UpZMAww4ncpqrXKLMVY6Ng"
  },
  "SRtC-4HdZpwphlA1wGdRNg": {
    "date": "1/10/2016",
    "text": "Awesome place, great people, the flavors WOW! Don't pass it up if you are in Phoenix!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NcDKTdhh92n5Zt8pYNyr5A"
  },
  "8C5OPjNuJjuY0oHr09TwEg": {
    "date": "3/26/2011",
    "text": "Last Saturday we tried Asi Es La Vida at the recommendation of a co-worker. Boy, am I glad we made the drive from Desert Ridge to try this neighborhood gem. I only wish we had places like this near home. Maybe we'll need to move!  We started with Chips and Guacamole...out of this world. I had a beef entree (sorry it's been a week) and my partner had pork. Both were excellent.  He had flan for dessert which he thoroughly enjoyed. The prices were reasonable and service was top notch.   It's a little on the small side...so don't tell anyone about this little gem!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "7QVNLrJDkjsDsCtODlPdsw"
  },
  "ux5CUBTwFruZcPvXwL-ApA": {
    "date": "12/1/2016",
    "text": "Such a cute gem in a totally unexpected location. Go hungry, try the soups ( I love the cream of cilantro), lunch is a great option for budget diners. Go at diner and try everything. If you have eaten bland uninspiring Sonoran style Mexican, you will love to know Mexican food is different.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jWujMFNGbb5ksxSvYZDGCQ"
  },
  "3w4SOk2GvRllYyr_Eu2pKw": {
    "date": "11/13/2017",
    "text": "We had such good food and excellent service. Our friends really enjoyed it! The atmosphere is just so pleasant. Don't let the exterior of the building detour you from enjoying this restaurant",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zxKES5Id-AbjBoYkJ1lnyQ"
  },
  "zx-1Dj_WB73DvQG4w8Vz4A": {
    "date": "10/29/2015",
    "text": "I had the lunch menu. I do love the size portions of their lunch menu. You don't have to be concerned about whether you get too much or too little food.  They have great soft spoken servers who don't over power you. I feel that the entrance was a little confusing due to having to wander to through to the back of the restaurant to find assistance. All in all I enjoyed the time and price. I would recommend them for a casual lunch. I do however wish their lunch menu had an al' carte option for some things. But I think they do the to simplify their menu. Which is a good thing too IF you're in a hurry. Highly recommended, you won't be disappointed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "axNp1-efCzA__4-PHY-G2A",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. The tableware is awesome and pretty.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/axNp1-efCzA__4-PHY-G2A/o.jpg"
      }
    ],
    "user_id": "OJRMnsY9x0kDkjcilftb-Q"
  },
  "Q69L8IJ9BUIshdo9wca9aA": {
    "date": "2/6/2017",
    "text": "Excellent, quaint spot serving authentic Mexican food. Willing to serve items not on menu to accommodate guests. Always a pleasure & experience with a friendly staff. Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d453WRUQkZR4Basdj_3w1w"
  },
  "zFhkSrXgolQUQmBXby_dog": {
    "date": "12/16/2016",
    "text": "We have been coming to Asi Es La Vida for over 10 years and have never been disappointed. The tortilla soup is the best I have had in the valley. I have tried about all their chicken based lunches and all are very tasty. Hands down the Crepa de cajeta is their best dessert. The restaurant is decorated in Frida paintings and they play a great selection of Spanish music.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M67FpNSuZmQwcpbMw5eKcQ"
  },
  "lgRAXmUNwHh0ndgWJoUEUA": {
    "date": "6/30/2015",
    "text": "Nope. Grew up in San Antonio, so I have some tertiary knowledge when it comes to Mexican food. Met Irving. Nice enough guy. Was on a date and she was happy with what she ordered - standard enchilada fare. I had steak - Carne Tampiquena. This, my friends, was a sirloin that could compete in the Ironman Triathlon. It had EXTRAORDINARY straying power, much like the leather on my 15 year old Doc Martens. Couldn't do it. Even ordered it on the rare side of medium rare so that it couldn't be over flame thrown.    As we were getting ready to go, our check was grossly out of whack, price-wise. Here's why... As we were waiting to order, Irving asked us if we would like some guacamole to go with our chips. Sure, I said. We ordered a bowl, which was small, perhaps 6 oz. That bowl ran $13 on the check. Notice that it isn't on the menu.  Never again. Ever. EVER.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WdHiZ8gwBi281nKgmiXrxg"
  },
  "fCAra6h-rHwNeha_k6KOww": {
    "date": "1/6/2013",
    "text": "Best Sangria I have ever had!  I was with a friend and we were in the area and hungry so I used yelp to search something nearby and ended up here.  Pricey? Yes, quite so... I'm never really in the habit of checking the price rating for Mexican food places but I will definitely do so from now on. The price is the reason for the four star rating. I feel they should have larger portions for the price.  The food was great. I had chicken soup, it was tasty. We shared a chef's special which that night was lamb. It was very good as well. We had the pastel de tres leches and it was fantastic.   The service was great! The server was right on top of everything and took some time to explain the menu items and give us recommendations. We got there just before their closing time and they didn't rush us at all the entire time we were there.  This a great date place. Look forward to coming here next time with husband.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "pLau_8ZPnx9SP8rmmUOYfA",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Best sangria ever",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pLau_8ZPnx9SP8rmmUOYfA/o.jpg"
      },
      {
        "img_id": "xWn2vQkezUU2sn6g-9GZrg",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xWn2vQkezUU2sn6g-9GZrg/o.jpg"
      },
      {
        "img_id": "ToAtcRc7CL6FOKkNwu51QA",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ToAtcRc7CL6FOKkNwu51QA/o.jpg"
      }
    ],
    "user_id": "YDW9pzW5XLb4yyBmba2cfw"
  },
  "L7KHSnQvUKhFN9pL5HaYrw": {
    "date": "3/31/2015",
    "text": "On a business trip here from LA as my wife was doing an event the next day here in Phoenix. Our hosts recommended Asi Es La Vida as a quaint Mexican Restaurant with wonderful food. Wow, we were NOT disappointed, not by the great authentic food, nor by the warm and hospitable service provided by Irving, a class act of courteous and professional service. Wish we had this restaurant and Irving in OUR neighborhood in LA ! Next time in Phoenix, will definitely be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ykoLaqjFfrqL7oZhuU71Wg"
  },
  "0y4_o5vk76AibY3KX-EWwQ": {
    "date": "1/28/2016",
    "text": "Overpriced  And please people serve chips and salsa and get off your high horse ! I know this is \"traditional\" mex food  They serve chips w guacamole and give the tiniest little cups of salsa  The food we had was tasty but not near enough for the 18$ a plate  We had to ask two times for extra chips and they kept bringing small bowls of chips  All in.... I won't be back",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sbzx_xyNOzMvkMkrMkYfOg"
  },
  "gnzVkRTozcFUO_6TEvxA1A": {
    "date": "6/27/2014",
    "text": "That's life.  I really dug this place.  It was different.  Upscale, but not fancy.  Great Mexican food without a single taco or burrito.  Apparently, it's more like the cuisine of Mexico City, instead of the the Sonoran Mexican food we typically eat... but what do I know?  The defining feature of this place is blindingly pink building in a not-so-great neighborhood.  (It's not a bad neighborhood, but it's a contrast from the luxuries just a few miles North on Camelback.)  Inside, the place feels like a collection of narrow, cozy hallways, and the place settings at the tables are elaborate.  We started with a margarita and a fresh watermelon juice.  The margarita was a little too strong, but the watermelon juice was refreshing.  We started with guacamole.  I heard it was made table-side, but I got duped on that one.  The chips were very thick, like tostadas.  The guacamole, salsa, and pico were all good, but not special.  Next, we had a shrimp appetizer, served over a crepe.  The cream sauce was unexpectedly amazing!  I was trying to sop up the remains with tortilla chips.  It was foreshadowing of things to come... this place knows its sauces.  For the entree, we split a steak dish.  The steak was pounded thin, marinated, and grilled.  It was tender and delicious, but the sides were the stars.  There was a folded chicken enchilada in a mole sauce that was out of this world!  The rice, and the bean-stuffed pepper were also nice accompaniments.  (Next time, I think I'll just order the mole.)  We also had dessert, another crepe filled with ice cream and topped with a tequila carmel sauce.  The sauce was delicious.  Unfortunately, the cold ice cream made the crepe a little gummy and hard to eat.  The waiter was friendly and attentive.  The prices of everything except the entrees were very reasonable.  (The entrees are a little on the high side.)  If you want a different, upscale Mexican experience, this is the place for you.  Great date spot,too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "zxsGLpHvzbVqNDm4svFQ5g"
  },
  "wXRsVHEN-0bjCt3RB-owdw": {
    "date": "3/24/2017",
    "text": "Absolutely terrific food and service. From the appetizers to the main course to the drinks and to the dessert. Terrific all around and would highly recommend to friends and family. Please enjoy!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "t2Z2DIvvmNdjoH54SFGaKg"
  },
  "xwB7s-x8vZxHpCMu9E-M5g": {
    "date": "6/1/2016",
    "text": "Went there on a Friday night and there was live music playing, a pleasant surprise! The food is absolutely delicious and the service was amazing! We had a very attentive waiter who was funny and charming. I will definitely return for the tasty food and intimate environment.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ct2xir6eJB4ZZ2jWkQB48Q"
  },
  "xUnHq1DIsuavQf7uxemjaw": {
    "date": "6/27/2016",
    "text": "What an amazing quaint gourmet Mexican restaurant! The chipotle filet mignon was tender and flavorful and not too spicy. Everything on the sampler appetizer was good.  The live music was an added plus. Reminded me of something in Santa Fe for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J2TsIYthmYvzcmri0w0ytg"
  },
  "lNPyYydMbe10LLlg8xg0eg": {
    "date": "6/21/2016",
    "text": "This place was recommend by a co-worker of mine. My wife and I went for lunch and we where absolutely amazed!  Thank you guys for such a great meal. Everything was so well prepared and the service was great!  We will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CNFavZXlCOzRSrbmF7UkjQ"
  },
  "LUmb89xCYv0tXGo4yAgX1g": {
    "date": "7/13/2016",
    "text": "When my anthropologist friend who travels all over South America told me about this place, I knew I had to try it. Oh my! Food is delicious. I had the Chile's Verdes with shrimp. Guacamole superb. Great service. The restaurant is gorgeous inside. We will be back again for more...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oOvLxUAxsuEbVun7g4ib-A",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Nice table settings",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oOvLxUAxsuEbVun7g4ib-A/o.jpg"
      }
    ],
    "user_id": "y1R0sVNk1qZi8hbFNWXyqg"
  },
  "46YJ18YG6leU0sszUFDdkg": {
    "date": "1/21/2015",
    "text": "Upscale Mexican food is so hard to find even in Phoenix AZ. but this beautifully decorated place is the real deal. Fantastic family service, impeccable presentations, and food with real attention to detail with full flavor balance. The Sangria was fantastic and the three entrees we tried were perfectly prepared. Portions size was just right but leftovers would have been nice. :-)  These guy's have it figured out and if you get around the color of the building this is  fine Mexican dinning experience bar none!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iC-Tlq0oYp3iwaLsNmgygA"
  },
  "GisrLlHo2lm2PWaOltsUlw": {
    "date": "10/26/2014",
    "text": "Nice Mexican restaurant  The vibe seemed authentic inside the restaurant. The staff was nice  The food was decent but not amazingly delicious.  I had the Queso Fundido which was interesting because it had cactus. It tasted like green peppers  The Carne Tampiquena had shrimp that was overcooked and did not taste good.  The camaron al mojo is the sirloin, it was decent but not too special.  i would recommend someone to come if they haven't had Mexican fishes before. But for someone who has Mexican food often, I would not recommend.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RrrBQh88DJHPxDO9dYtuxw"
  },
  "UvpjEA-AEmvo05TJVWgMBw": {
    "date": "6/10/2014",
    "text": "I really like this place.  The atmosphere is authentic and so nicely dark in the summer.  They keep the place as dark as possible which is so comforting to us Phoenicians.  I liked the chips but didn't love them.  They are the thick kind that is almost a Mexican version of a cracker.  The sauces were excellent.  I  had chicken enchiladas and they were very good.  Again the sauces were fresh and homemade.  The beans were excellent as well.  Even the rice was different than what I have found in other Mexican restaurants.  It was white instead of yellow rice with vegetables as an accent.  I would definitely go back when in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "99IzKcayZXphirngvlZE6A",
        "caption": "Photo of Asi Es La Vida - Phoenix, AZ, United States. Delicious Enchilada with wonderful beans and homemade sauce.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/99IzKcayZXphirngvlZE6A/o.jpg"
      }
    ],
    "user_id": "S_Joujv7euX3N9yHqE4IMw"
  },
  "r8pjOnyHue_WUi_lTwZNTA": {
    "date": "8/18/2014",
    "text": "We were there for a late Sunday lunch. The food was great: bistec, and mole. Service was reasonably attentive. The choco-flan was quite good. Great Latin American art throughout.  This one goes on the list.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "60g_pQI9BdqpSx2eQIhGAQ"
  },
  "4wsvald5bINvO5rf_wf-eQ": {
    "date": "7/24/2015",
    "text": "Good food but a little on the expensive side considering the portion size. I ordered the enmolada plate for lunch and all it was was just two small chicken enchiladas with mole, no beans and rice.  Stay away from the caldo de pollo, it was pretty bland.   If your really hungry, not a place to eat.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GjD6lyDdil4Zowjrehacjw"
  }
}