{
  "O1Li2LSqMr4WuBJMkdnEHg": {
    "date": "7/22/2017",
    "text": "Absolutely love the bartender,  Michael!!!  Great happy hour specials! Try his version of the Kentucky Ginger!!! So amazing! No one can replicate it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mKSIIwXRj04R6MpKDa8Ncw"
  },
  "fFQWXxxYXk44naMmGb1nFg": {
    "date": "7/16/2016",
    "text": "Delicious and unique! Fish tacos were so fresh and perfectly grilled, nice char on the outside and juicy on the inside.  Ambience was very cool. The live band was so talented and the decor, inside and out gave it a great vibe. Would recommend in a heartbeat!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ip07xtNDSJ1KQXNg7Fk8Hg"
  },
  "X4mNqKtUAdXcloirPoMcPQ": {
    "date": "1/12/2016",
    "text": "I was a huge fan of Gallo Blanco and was skeptical of what restaurant would take over after they left. I am happy to say that Cafe Tranquilo has been a fantastic addition to the Clarendon Hotel. I live within walking distance of Cafe Tranquilo and tend to go there almost weekly. I am thrilled to have such a great spot nearby. Their menu is solid! They've made fantastic changes to their menu since they've opened. I've enjoyed their breakfast (try the chilequiles) and dinner options. If you're just hanging out for happy hour, get the guacamole, tacos, or Elote dip....you won't be sorry. They serve Lux coffee, major bonus points there! And a HUGE shout out to our server Jake!!! His service has been top notch and his recommendations have been on point. Thank you Cafe Tranquilo...I will likely be back within the week. ;)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9yvKe6-x4y8qOjowg0opxA",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Elote dip!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9yvKe6-x4y8qOjowg0opxA/o.jpg"
      }
    ],
    "user_id": "FfBnDi6shNHSMvGQGXctqA"
  },
  "Rnca4jE3nHXmUoINHPvzaA": {
    "date": "8/8/2015",
    "text": "Nasty shrimp tacos today!We must have gotten the rejects!  Very slow service.music is horrendous!! It's going to be a very long while before we eat here! What a waste....",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "hmG0UtYjQgUPcXXE4lqvPQ"
  },
  "l8JvY6LJOCtYXHt3tao2rg": {
    "date": "12/4/2015",
    "text": "I have visited the Clarendon quite a bit and find the restaurant there, Cafe Tranquillo to be a breath of fresh air every time. Breakfasts at the weekend deserve to be lingered over, with a Bloody Mary or two and some friends, and the menu and staff there make this a delight. May I recommend the chiliquilles highly but be prepared to share them.        The bar is well stocked and the bar staff really know their stuff with a well thought out cocktail menu and local craft beers. Poolside bar service is a huge bonus in the summer months too. Allow a little extra time at weekends as the local crowd is augmented with travelers from the adjoining hotel.         Visit this oasis in the centre of Phoenix and you'll be coming back for more.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jRDCqpIYJSskdQn5PA-7LA"
  },
  "Dgb4Kr0o9JlybQsD20Spkg": {
    "date": "6/4/2015",
    "text": "Lackluster service and just-passable food makes this hotel restaurant a rather forgettable place. I went there for breakfast twice, while on a weekend \"staycation\" at the Clarendon Hotel, chaperoning my son during ComicCon. When my wife booked the room, it came with breakfast vouchers - vouchers that are actually only good for $12.50. Add a cup of coffee to almost anything on the breakfast menu and you're almost assuredly going to blow through the $12.50 if you include tax and tip.  Not that I'd try to dissuade you from having the coffee. It's actually really good. Probably my favorite thing there.  On my first visit, the service was absolutely abysmal. I was seated at the counter -  in full view of everyone - for over 15 minutes before the hostess (seeing that I was being ignored) took it upon herself to scribble my order onto a post it note. I ordered a breakfast burrito with chorizo. I think places like Chipotle have raised our collective expectations as to how large a burrito should be, and this one came in at disappointingly \"modest.\" It was, however, packed with chorizo. Unfortunately its flavor was masked by the copious amount of salt that they put on it. Yikes. It was served with two salsas (stick with the red one) and a small bowl of fruit. Not great, but hey - it was under the $12.50 mark.  The next day the service was a little better. I was seated promptly and my waiter took my order right away. This time I went with the sausage burrito. It was actually smaller than the first one, mainly because there was very little sausage in the burrito. Oh, and no salsa. No fruit either. I wasn't really going to make a fuss and complain about this \"free breakfast.\"  But I'm also not planning on ever coming back.  You may have better luck with their lunch or dinner menus, but I'm not going to find out...  Happy dining!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 2
    },
    "photos": [],
    "user_id": "vWLHqiJu5Z2tRghSH8ammw"
  },
  "36-rT_vP62_kTVw5osBFVg": {
    "date": "6/21/2017",
    "text": "Let me start by saying this review only has to do with my most recent visit.  I was there with a friend last night (Tuesday), and we went because of Bingo.  Yes, the temperature yesterday was a record high but the temperature in the restaurant was also a record high!  It was practically sweltering!  We sat in the lounge as that is where Bingo was happening.  The ONE bartender was overwhelmed as he was making drinks for not only the bar crowd but the restaurant patrons as well.  The place was jammed packed as it was not only Bingo, but Taco Tuesday and everyone likes a bargain right?!!    The staff was incredible though...everyone was pitching in to help where they could and kept a smile on their faces while under great stress and heat.  I was at a community table and my friend and I ordered guacamole, the delicious corn and two chicken tacos plus house margaritas.  Everything tasted delish but the lady next to us said our chicken tacos looked different from hers....ours was shredded chicken and hers were like cubes of chicken.  We asked a busboy and he went and checked and came back and said they had run out of chicken and were having to use a different kind.  I really liked mine but the lady next to me said she didn't like hers.  Anyway, the place continued to bustle and the poor bartender continued to be in the weeds.  I can't say enough good things about how the staff worked together to make an effort to keep things moving but there really should have been two bartendars on duty.    I love the fact the hotel allows Bingo to be played there and it brought in a good crowd of people who were all ordering food and drinks so its a smart move, but next time please have the place cooled down and make sure there is enough staff.  I have been here several times in the past and this was my first somewhat negative experience so i'm willing to give it a pass.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uX_x79YoBJphN0v5W06PDg"
  },
  "Ii_Pcj-VQUBAx7BoBaXwjg": {
    "date": "6/16/2015",
    "text": "Gallo Blanco was super close to me, and I would go there a few times a week. I loved the food, and I was so sad when I closed down. It's taken me awhile to try the new place, and I was pretty skeptical after seeing the abysmal reviews on Yelp. I've ended up going 3 times before posting this review. Initially, I thought people were being a little unfair on this place, and I stand by that, although each visit was so different that I can understand why people might blast this place.  Yes, it's trying to fill the void of Gallo. Yes, there are a lot of similarities between the new menu and the old Gallo menu. The same staff work here, but the decor is different. The outdoor patio area is bigger, and it looks like there's a private banquet area with its own little patio attached to the restaurant. The servers wear uniforms now.  We started with chips and salsa and some drinks. I had a boring rum and diet so I can't comment on their cocktails, although I will say my drink was strong. Beer was fine. The prices for drinks are a little higher, and I guess there wasn't a happy hour, but now there is? Not sure what time or what deals they run during that time.  Chips and salsa were reminiscent of Gallo - a red one, a green one, and some pico de gallo, but this place gave us a creamy avocado one, too. The red salsa, if you want to compare it to Gallo, was a little less spicy and a little less refined in terms of flavor. The green one, again compared to Gallo, was a little spicier and a little more tart. Pico de gallo is pico de gallo. The creamy avocado salsa was nice. Chips are the same. Objectively, I think the chips and salsa were good.  Husband had a burger. He said it tasted just like the cheeseburger from Gallo. He asked for medium rare but it came medium well, maybe well done. The fries were nice. I had a fish taco, which featured rockfish, and a carne asada taco. I think there's more protein in the new place's tacos. The carne asada was cooked differently so it was actually a bit more tender - maybe due to the fact that it was shredded and not chopped up like Gallo. I liked the rockfish taco a lot. It wasn't like Gallo's fish taco, but it was good.  Ended up going there again and the carne asada taco was super chewy. It was seasoned pretty well but the meat was just too tough. The fish taco was still pretty good. On a third visit, the carne asada was better, but not as good as the first time around. Food being inconsistent isn't good, but I'm glad it got a little better instead of progressively worse.  For people complaining about the service - well, in my honest opinion, the service was on the bad side at Gallo. It was SO SLOW - took forever to place an order. Food would come out quickly, but if you wanted a refill on a nonalcoholic beverage, or even if you wanted a second cocktail, it took awhile to grab someone's attention. It also took a long time to get the check and have it processed. I honestly think it's about the same now. The restaurant wasn't dirty when I went in, so I can't really comment on that like others have mentioned.  So overall, I think it's pretty good food. I like that it's close to where I live. Service is OK. It's got a nice ambiance. The prices aren't fantastic, but it isn't highway robbery, either. It's tough saying goodbye to Gallo because it really was outstanding, but I think Cafe Tranquilo is pretty good. If you haven't been, I think it's worth a try - just come with an open mind.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "CEoMgtYwcskmU6VOeDAwVw"
  },
  "c4IguhG-7FBF363pcLN19Q": {
    "date": "4/15/2017",
    "text": "The fish tacos are by far my favorite thing on the menu! Shrimp tacos are good as well and the guacamole is delicious! I've always had a great dining experience here and the hotel is beautiful I love how it was restored! They did take off the pesole soup which was a bummer so hopefully it'll make an appearance soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GkNsHjUIln0dwcsn8QCYSQ"
  },
  "ZOxubgKVkrd402oBYe-HyA": {
    "date": "2/5/2017",
    "text": "Loved the food and atmosphere. It really is tranquilo  We had elote for an app, tacos and the flourless cake which was sooooooo good! Margaritas were superb and not too sweet. We were given an aperitif on the roof and listened to a band underneath their heated rooftop deck. Fun night!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "FLFdMWrf42oSeKdw-qbckA"
  },
  "k67Jae-_NZCWutWx6yI4aQ": {
    "date": "11/6/2016",
    "text": "We stood at the hotel and had breakfast here for 3 days. All 3 days the food was amazing the staff was great and the environment was well kept and very clean. It was amazing to see the staff working together and they had such great attitudes. We sat at the bar so we were able to see all the back end that the chef's were doing. Let me just say WELL done chef!! It was great to see how you enjoy what you do. They were cooking and enjoying their time back there. They were pumped up and ready for the day. I loved it! We are from LA so sad to say some people just are not like that so to come to this restaurant was wonderful. We will be back because we are moving down here. So thank you to the entire staff! Well done! You all deserve to hear how well your doing. Keep it up!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CYqwz-hSmLHzBTCJPf794Q"
  },
  "lkuqITq_cne_gtejLr8Bkw": {
    "date": "9/4/2016",
    "text": "This place! Had breakfast here two days in a row. It's THAT. good. Had Huevos Rancheros and pancakes. If I had to choose between the two, it would just be sad.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "LXfXjP9R6_zlRzOUWWnEHQ"
  },
  "qzuR54_pWSa8iTCzFbatUQ": {
    "date": "9/8/2015",
    "text": "Ate here twice for breakfast while staying at The Clarendon Hotel. The outside patio was nicely shaded in the morning (and pet friendly). We opted for the spinach and mushroom scramble and gringo breakfast both days - they were both great, as was their iced coffee.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "rORPA-C2JxnByRUjCaqmcA"
  },
  "3VGjnK_1y7Bw-Sp_nQzdhQ": {
    "date": "6/23/2015",
    "text": "AMAAAAAZING zing to everything they serve! Fresh margaritas, HOT food, not the kind that sits under the lights until the server is ready to serve  you. This food is FRESH! After living in East LA for 27 years I was doubtful I would ever find anything \"authentic\" Well, I was wrong! This far surpassed any expectations I had!  I stayed at the Clarendon and it was just too hot to go venturing far. Lucky me!!! I just wish I could have packed up food to go and teased everyone on the plane.  And this is not just about the food, the service was top notch, you could tell the staff was happy to see me. I wasn't just another check in the crowd. The table was well set, the serveware sparlking, the glasses spotless. Above and beyond is all I can say Just such a cool place!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "qpjc9ee5MuPZnmgCwiXvOg"
  },
  "U2xifZNjgsXkXvdzG7Ch5g": {
    "date": "3/4/2015",
    "text": "Let me start off saying that we want ALL Phoenix restaurants to thrive.  We popped in on Sunday late morning 3.1.15 all knowing that Gallo Blanco was no longer and wanted to have a nice experience at a former fave spot of ours. We were disappointed. I try not to write negative reviews but we left the restaurant upset and feeling was we just wasted our time and money....The food and service was terrible.   -The bar was dirty and unkempt, terrible first impression. -Staff stood at the bar while one pregnant server chatted about her personally aches and pains as we ate. Gross  -That same staff proceeded to order her lunch in front of us for 10minutes, go to another register!  -The menu is way overpriced  -The tacos lacked flavor ie tasted like white grandma tacos from Minnesota where she found the recipe from a 1979 issue of sunset mag - The presentation of the tacos- terrible. Just slapped down open face on a plate by that same grandma or from a prison kitchen  - $8 mimosa on a Sunday, really?! - No brunch specials or items of any kind  - $5 small iced toddy- that price is ridiculous  - Music was barley playing and what was heard was not impressive  -We just left and walked by a group of staff and no, thank you, see you later etc.   Understanding the concept had to transition quickly but there should be no excuse for bad service and dirtiness. I don't see how anyone would can't to come here until they dramatically change things and get their act together.   - peace, love n tacos  m",
    "rating": 1,
    "rated": {
      "funny": 6,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "IWO2B10fmT27HEK_4euzyg"
  },
  "-dVJbUCW3ZcUv1PXN1E-Dw": {
    "date": "11/18/2016",
    "text": "Ordered the carne asada tacos along with beans. The meat was lacking flavor and nothing new was added. Keep in mind that you are paying $3 for a taco that is consumed in three bites. It's better than Taco Bell for Mexican, but certainly not going out of your way for.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "otCx_9SYFiMaObxYbOnbQw"
  },
  "Q7XHDUdyLKSH2atxw47S2g": {
    "date": "2/17/2015",
    "text": "It's painfully obvious that Cafe Tranquilo is still working out the kinks with the sudden change in management/name. My boyfriend and I came here Sunday evening around 10pm and the place was pretty dead (which we expected). I hadn't been to Gallo Blanco in a very long time, which is regrettable since I live right near The Clarendon.   The good: The food is great. I ordered the chopped salad and loved the jalapeno dressing. My boyfriend ordered carne asada tacos, which he enjoyed. The tacos did come with an awfully large amount of salsa compared to the size of the tacos (street taco size). Weird. He ordered 2 and wished he had ordered more because 2 does not a meal make!   The bad: Service. While our server was certainly a nice person, for some reason our beers did not come until after our food was served. It's just beer, so I do not understand why we waited so long. Plus, we were one of a whopping 2 tables dining (not counting the few people at the bar). We also had to request silverware.   I admit that I was expecting to hate this place based on other reviews that I read. It is not Gallo Blanco, but was anyone expecting it to be the same place? If you adjust your expectations a notch and go in knowing that this is a different restaurant, albeit has a similar menu. Overall, the food quality is there, the service could use some improvement.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 2
    },
    "photos": [],
    "user_id": "eCc5bRw6hBsky6BKtYSP3g"
  },
  "v9ROJUh0nOPiwrL-SvnnsQ": {
    "date": "8/17/2016",
    "text": "I had breakfast at Tranquilo three mornings while staying at the Clarendon.  It was the best free hotel breakfast I have had.  The Heuvos Rancheros was perfectly spiced (did need a touch of salt).  It was a good atmosphere.  Great way to start the day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "rguQaOT-JB3rSrCgRlGl9g"
  },
  "RFPxHiaDwH9M5pxnFW6mgg": {
    "date": "4/4/2015",
    "text": "Looks like it could be be good, but pretty bland all around.  My wife ordered a spinach and mushroom scramble and it was nothing better than a novice chef could make at home.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "60_OEmz2EHmB9it20I0uGA",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Chilaquiles look good, but bland.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/60_OEmz2EHmB9it20I0uGA/o.jpg"
      }
    ],
    "user_id": "GeUfLNgXpBu41O0t2GNSxw"
  },
  "wt3x3rqTqUqtWAllnCS24A": {
    "date": "9/16/2016",
    "text": "Great food the pork tacos are to die for! The margaritas are also killer! Loved the vibe and history behind the hotel.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "rL2uY_Xc9QMDdCcmCgJsEQ"
  },
  "sJopDyXp2YfP_xVOckLmhQ": {
    "date": "3/24/2018",
    "text": "This place had 2 food violations from the health department last week, the food is served in small portions and the service was slow, I had to keep asking for my server to get something to drink. I wouldn't recommend this place at all to anyone.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aVuARx25a8HlNtIk9jgp_Q"
  },
  "HlJmVXGrYfNZMo9BSKZw0Q": {
    "date": "4/13/2017",
    "text": "Ok, this place is super cool, always great music, easy parking, super awesome staff, but the FOOD and House Margaritas are amazing! Best happy hour! $2 tacos and $5 margaritas! And the guacamole is perfection!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "y1X2St8Nlg0g3oh1jkrwvQ",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/y1X2St8Nlg0g3oh1jkrwvQ/o.jpg"
      }
    ],
    "user_id": "iMTkdrrsE0lMSgZmZGjMZg"
  },
  "gczK1vMUesSEy_oatOGPBQ": {
    "date": "11/6/2015",
    "text": "We live nearby and walked in at 8:30 on a Friday. Many empty tables. Just four of us, looking for a cocktail and nachos.   Hostess says \"We're looking at about twenty\".   \"Twenty what? Minutes?!\" we say.  \"Yeah, sorry, we only have two servers on staff\" she replied.   \"We don't want to wait 20 minutes, you really don't want us to eat here??\" There was maybe 20 people in the restaurant.   \"Yeah sorry, it will be 20 minutes\".   So we walked out. If they don't want us to sit at an empty table, we won't force our way in.  It was just okay the last time we went, right after they opened. Was hoping they would improve. I guess I'll never know, because I'm never going to attempt to go back.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "9HFXxmPnSgoh6uh3_IL3Pw"
  },
  "FgdWYjaOpTebPZovSpMMbg": {
    "date": "3/10/2018",
    "text": "Yikes! I would stay away. Staying in the hotel and came in to eat yesterday and today and both times we got up a left. Service was super slow, they were painting and doing construction on a busy Saturday morning which is just poor planning. Nothing on the menu looks that great. We won't be eating here even with 2 $10 vouchers from the hotel. Don't waste your time.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hOKm9mL4mUEkd9X5y2mHbw"
  },
  "Br0dJ1xdCfgTtxgJmOcgvw": {
    "date": "11/15/2015",
    "text": "Cafe Tranquilo is owned by the Clarendon Hotel and it's a great add.  Now that the hotel and restaurant is owned by the same owner, you can order room service while staying at the hotel.   The food here is excellent and mouth watering delicious! On Sat, I had a party of 6 adults and 6 kids by the pool during lunch time and we were provided with great service by Yusa. Everything we had was good.  The chips & salsa, chips & guacamole (chunky full of fresh guacamole & flavorful), grilled cheese sandwich- everyone enjoyed their food.  And it was promptly served. Which can be a factor when receiving poolside service from an on site restaurant.  Great add & I look forward to getting room service while staying at the Claredon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6F_WryEhLX9PEUqADq1Vsw",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Coctel de Fruta con Chile- fruit w cucumber jicama lime chile powder",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6F_WryEhLX9PEUqADq1Vsw/o.jpg"
      }
    ],
    "user_id": "9uE0smG2bwgkI95RPj0lPQ"
  },
  "6rxe42BQkRNVVxrmzv2Tcg": {
    "date": "11/7/2016",
    "text": "Had a blast at this restaurant. We went both for dinner and breakfast and both experiences were fantastic.  The ceviche was extremely fresh, the salad for the chips were delicious, and the pupusas were authentic and doughy (in a good way). The chilaquiles had a great kick with the salsa ranchera (I rarely see ranchera anywhere).  Ambiance was flawless and service was spot on. Even live music at dinner ! We would return here even if we weren't staying at the hotel.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "43VuSgXYWSjUybZi_WoN8A"
  },
  "KCfM4QGT3zCvLTTrFPaewg": {
    "date": "2/11/2017",
    "text": "I just had dinner and now breakfast here and it's magical. I came in expecting mediocrity and received the world! I had rib eye with chimichuri and the most flavorful veggies all sizzling on a skillet. Flan brulet for desert too.   Now breakfast. You can't go bad but the flap Jacks taste of something unique and that sent it over the moon.   Here's the best part.......service. they're normal, funny, happy to help and serve you. I usually feel like I'm part of their daily problem but here they make me laugh. I loved it all. I can't wait for more cause it's in my hotel.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "HCkAGsHZNsSFd1SaOfO_sw"
  },
  "baE-tykmY8Krl5qcWS_N0A": {
    "date": "3/16/2018",
    "text": "Terrible place for breakfast. Dry potatoes, too crisp bacon and the smallest sides of toast I ever had plus a glass of orange juice was $5! Eggs were yucky too. My total was over $32 and I barely ate any of my breakfast.   I should have know when I seen the servers taking back plates from customers that were over half full of food.   Avoid this place",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nFpGaemBPqGnQPT2CsTxow"
  },
  "Ebdapy8iD4oieYo2vO3d1A": {
    "date": "5/14/2017",
    "text": "The food was delicious but the service was disappointing. We were late for our reservation time but still got seated, that was nice. The place was a bit empty and that's why I didn't understand why it took so long for  everything. Drinks took forever, food took forever. Had the pork taco and carne asada it was yummy.  The guacamole taste authentic and fresh. The quesadilla was a joke lol ... it was small small little think. It's an okay place won't pick it but will go if invited.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P2-6fFaloQscwnrfcPBFAw"
  },
  "i3QQdwlAxulD8W5RqyfLVw": {
    "date": "12/26/2016",
    "text": "My husband and I were fans of Gallo Blanco and we're disappointed when it closed. It has taken a long time, but we finally decided to give Cafe Tranquilo a try. We went on Christmas Eve mainly because it was one of the few places open.   We had the chips & salsa trio and street corn for an appetizer. I need to get over the fact that chips & salsa are NOT complimentary in a Mexican restaurant. For our main meal he had the steak burrito and I had grilled garlic marinated shrimp tacos. I am gluten intolerant and I do not eat meat (seafood/fish are my exceptions). I wish there were more gluten free and vegetarian options. The shrimp did not taste garlicky nor did they have a grilled flavor. I taste more than anything the creamy Mayo tasting sauce they put on it. A little of that sauce went a long way. My husband enjoyed his burrito and the portion was substantial, he needed a doggie bag.  The highlight of the evening was the live entertainment. The singer sound like Jose Feliciano. I would return to hear him.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9jA5_7o9V4m6i8ZRb4t6LA"
  },
  "S9YS5iNmY5O2GLwrToRS0w": {
    "date": "7/14/2017",
    "text": "I come her often for breakfast and lunch and their food is delicious. I get their pancakes for breakfast and it's really good. Service is great very attentive and cool personalities.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v10rqxQnOxdYydcYRILopA"
  },
  "eGR-DSrIzsf6ZE9yWHFRzQ": {
    "date": "8/5/2017",
    "text": "Came to Arizona to try this restaurant and was not disappointed .  Our server, Jacob was amazing, Food was excellent, and the Aguas Frescas were very refreshing. The dishes were authentic, fresh, and very tasty. One of our favorites were the Chilaqilues. The flan melted in my mouth",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PVZdlgPFK5Qpyomlh8LvYg",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PVZdlgPFK5Qpyomlh8LvYg/o.jpg"
      },
      {
        "img_id": "w5R0t3sh_9gwb1aas11Fuw",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/w5R0t3sh_9gwb1aas11Fuw/o.jpg"
      },
      {
        "img_id": "MDf4KjNYn3fi6s5WGyOHWA",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MDf4KjNYn3fi6s5WGyOHWA/o.jpg"
      }
    ],
    "user_id": "ArQGBKQ01BfElrHyE0vIOw"
  },
  "Ba9cVAybhWLR82laxOoSlA": {
    "date": "10/30/2016",
    "text": "This place needs to get their act together.   We've eaten here three times because we were staying at the hotel.   This will be the last time.   We get there tonight at 9:30. We're basically the only ones in the place. Yelp says the place is open until 11, but our waiter tells us kitchen closes in 20 minutes.   We order guacamole which takes 10 minutes to make it to the table.   We order a salad. I see them walking around carrying the plate from side to side in the kitchen and looking as if they don't know why they are there. By the time it gets to us the hot chicken is cold. It's now been 45 minutes since we sat down.   We canceled that and the tacos that we ordered which apparently take an hour to make.   The previous two times we've been here for breakfast the food was so slow that I was almost late for work.   Don't know why this kitchen can't push out food in a timely manner especially for food as simple as tacos and salad.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "XufTeRjGG3wqJUDl4yascw"
  },
  "QV8QHuIYKyqHGT9d3vXFAg": {
    "date": "10/2/2017",
    "text": "We stopped in for happy hour one evening in August and had a good experience!  We enjoyed 1/2 price tacos and wine at the bar.  Friendly bartender, decent tacos and nice atmosphere.  I hear they are going to renovate the space and I think it definitely needs a facelift.  Excited to come back this winter and checkout the rooftop bar!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "cMEtAiW60I5wE_vLfTxoJQ"
  },
  "k8brd6SztiLVSKQ4dwcNYA": {
    "date": "2/4/2018",
    "text": "They have a 7 dollar burger that disguises itself as a 12 dollar burger. Breakfast and service are solid. Dinner is overpriced relative to the quality/quantity.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k4Q-iYILlC0eK6mIs_8eTQ"
  },
  "1HvL7n-0fVYjJvvM-7HoEQ": {
    "date": "3/29/2017",
    "text": "L-O-V-E the coffee!!! Delicious tasting coffee, especially when they bring it pressed to your table! Seem to be short staffed most of the time, which usually means waiting, particularly on weekends. The pancakes are a safe choice, with the chilaquiles being my least favorite. Like ordering the breakfast burrito in a bowl with the tortilla on the side, shareable portion.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6GT6kAIyCT9MA7y1ZN_PUw"
  },
  "9dicYMApmLi39RSf4yngHA": {
    "date": "9/28/2017",
    "text": "The food quality is good for the happy hour prices but I am extremely disappointed in how my friends & I were treated. I was with a group and we had paid separate checks and closed out. We hung out for at least 30 minutes after closing out to chat and finish our drinks. The waiter came back and said he had accidentally undercharged my friend. She took out her receipt and pointed out that she had already paid for her meal and drinks. The waiter walked away. We hung out for a bit longer and left (after being there for over 2 hours total). Turns out the restaurant had reopened her check after we left and charged her the additional money without her consent. After calling the manager to try and discuss the situation, he said he would try and reverse the charge and left it at that. I don't think I would return after the way this was handled.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "CrBIEuEzn2AL58jWVRDGmA"
  },
  "OdcVEX2o8DOaYoucS0PmMw": {
    "date": "7/8/2015",
    "text": "Cafe Tranquilo is the restaurant of Clarendon Hotel, where we stayed for two nights in Phoenix. Each hotel guest receives a complimentary breakfast voucher good toward $12.50 worth of food excluding alcoholic beverages. It's a great value and very kind of the hotel.  We just ate dinner here the night we arrived from PHX. Complimentary chips and salsa were served as soon as we sat down. In addition to salsa, they also gave us avocado dip, mole chili, and chili verde. The chili verde was my favorite and chips were bottomless! Moscow Mule was put in its right place as Tranquilo serves it in a tall trim copper cup. Cosmopolitan is a pretty pink in a champagne glass.  Tacos are all a la carte. Out of the three my favorite was the beer battered fish. Batter not too thick and it came with a tangy mayo sauce. Carne asada is just okay, with a smokey taste to it. The braised tinga pork was also tasty. Pork was tender and not stuck in the teeth.  For breakfast, they have a big selection including gringo (regular bacon and egg), chilaquiles, huevos rancheros, French toast. Their coffee is excellent, not the cheap watery stuff from a can. It's a breakfast blend with an aroma. Coffee is always piping hot.   *Gringo Breakfast ($7.5) two eggs any style with choice of bacon or sausage. Bacon is inconsistent between the first morning and the second. Maybe the chef took the day off after being slammed on Fourth of July. The fried potato is diced and sauteed with onion and bell pepper.   *Chilaquiles ($10) is a bit too chili-ish. The sauce is very red and the taste very strong. Diced chicken with two overeasy eggs. It's not my favorite chilaquiles but it's adequate enough.  *Mushroom and Spinach Scramble ($9) is much better than the chilaquiles. Two scrambled eggs tossed with chopped mushroom and spinach. It's very good with melted oaxaca cheese. Totally hit the spot, as I love scramble.  Coffee and water are always refilled with a smile. It's a very friendly and casual dining atmosphere.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "VqgG5rAmIOqMhElUafs4Zg",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. 7/5/15. Dinner: chips with salsa, avocado dip, mole chili and chili verde dip",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VqgG5rAmIOqMhElUafs4Zg/o.jpg"
      },
      {
        "img_id": "wSMLL8kmKpTZhri27192kQ",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. 7/3/15. Dinner: beer battered fish, carne asada and braised pork tacos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wSMLL8kmKpTZhri27192kQ/o.jpg"
      },
      {
        "img_id": "fumAsnUfmtiNWTz-kUIVjA",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. 7/3/15. Dinner cocktail",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fumAsnUfmtiNWTz-kUIVjA/o.jpg"
      }
    ],
    "user_id": "Zy_Rw00SjE47uhv-WuHTDw"
  },
  "SJLXS5hOXVLaoqdV_kWyOg": {
    "date": "10/2/2016",
    "text": "Not only is the Clarendon my favorite hotel, but the restaurant inside, tranquilo, is by far my favorite place to eat in AZ! As a Californian here for the Rams game, I expect a lot when it comes to service and Mexican food and this place surpasses my expectations. The food is amazing; the juevos rancheros are the best. The drinks are ridiculous here as well. Spiced apple cider mimosas were hand made by Jeffrey, the best bartender ever, and were absolutely amazing.   With that being said, Jeffrey is the most amazing in customer service and made us feel comfortable from the minute we walked into the bar. He was attentive and super helpful when decided what we wanted to eat and drink. He was even training at the same time with a full bar and made sure every person was taken care of. We came back twice specifically to see him.   We are so happy with our experience here and will definitely be back for the great food and great service!   Thank you Jeffrey!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "0MQxJgzJXRdD0ZKU28oryg"
  },
  "ryEG1rbNLTecy3CTAKLfcA": {
    "date": "12/7/2016",
    "text": "This restaurant is in and adjoining cool hotel. Having a chat with the woman behind the front desk at the hotel who wanted to warm up her lunch in the restaurant (Tranquilo) microwave and found out they have no microwave, nor do they have any freezer, and it shows. The food here is fresh, fresh like you're in Italy. Mexican fare, under the circumstances I thought it obvious to order the mole and wow it was a taste sensation. Everything down to the exquisite taste of their tortilla chips. A real pleasure",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "TR_hhepkSt53suf9H47xOQ",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TR_hhepkSt53suf9H47xOQ/o.jpg"
      }
    ],
    "user_id": "aww_dtuumJH2FwxDnf-GXg"
  },
  "eAhEi-IEY1zsXLMTrzMEow": {
    "date": "4/21/2015",
    "text": "This place was not a home run. We came by to check it out late night and service was ok food was ok, beer selection was average. I WILL be back to try more things",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LY1iz1qMdTiS7RiGORoRUQ"
  },
  "dXk7MisYd-ZqaIaVfs0SXw": {
    "date": "10/18/2015",
    "text": "In town from Tucson, where we have our fair share of Mexican food. The chorizo breakfast was tasty and the hubby enjoyed his huevos rancheros. Treated ourselves to bunuelos for dessert...delish! Service was fine overall.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uQXpERJGodwdMY1dXzS1VA"
  },
  "FuaEL3q3HpcVaK-SkE3wrQ": {
    "date": "8/26/2015",
    "text": "This place is fantastic. Great ambiance, food, and service. Today's special, chicken enchiladas in house made tomatillo sauce was fantastic. I wish I could take bottles of that sauce home! We will be back here every time we are in town!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mi-YtQK52FPmlEuz1yjRBQ"
  },
  "_ozI_fJtstzRmOfw0TWAlw": {
    "date": "11/2/2016",
    "text": "I loved the decor and the casual feel of this terrific restaurant next door to the Clarendon Hotel. Easy to get to and easy parking. The service was just fantastic and the food was delicious. I ordered the Carne Asada Torta - a tiny bit disappointing only because the meat was a bit tough. My friend had the chicken torta, which was just about perfect. I will definitely return to try other dishes, which looked delicious!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PVR709xa0QhoYEfY8lt7sA"
  },
  "t9whYIj65RiNZVxfEY6IhQ": {
    "date": "8/26/2015",
    "text": "THIS PLACE IS AMAZING! Any food made by Dan is definitely far better than other places. Great food, good atmosphere, and fair prices! I will definitely return",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4WbaUQUhqt1XtxyAJMb_lA"
  },
  "3cXWSE9Cy1_1T3qxYdhgtQ": {
    "date": "3/8/2015",
    "text": "Serving the lovely Clarendon Hotel, Cafe Tanquilo is a great spot to get refreshed takes on Mexican classics. Newly added vegetarian friendly options make this a great spot for parties of all types. Carne Asada is always great and revamped chicken dishes are a delight. As always, here in sunny Phoenix, cocktails and beer selection is vital and this spot delivers. Always, always, always get the Bloody Michelada, you cannot go wrong?",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fe3_cTa53qB9baYl0zGx0w"
  },
  "Fo-egjipBgLK9RQQ2DxrLQ": {
    "date": "7/27/2015",
    "text": "The food is good but service is horrible. I was staying at the hotel and went here for breakfast. Food took forever and server didn't ever come back to check and see if we needed anything. Then after lunch we were by the pool and ordered drinks and appetizers, but half of the order never came and the service was super slow again! Don't bother coming here for food or drinks",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P7ROQH7F5qecB3WbGJXayA"
  },
  "EBbwiAKmeaYxQsR9GTB0PA": {
    "date": "6/7/2015",
    "text": "The carne asada torta was delicious! Chips were ok but the guac was amazing! Reason i'm not giving it 4 - rude waiter! Hardly anyone there and he could not handle it? and to go off on you because you were rushing him for the check? Unacceptable",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YtRiXByXyqGUvjy_-OBoJQ"
  },
  "eauhtVGcnQgTi-6Ut8J4VA": {
    "date": "4/23/2015",
    "text": "The food is delicious. The drinks are absolutely amazing. Atmosphere is more open and inviting. Highly recommend the el jefe, flama dolce, and the que melagro cocktails. Chicken torta with a side of cucumber jicama coleslaw is so yummy! I feel like customers are giving negative reviews because they're expecting Gallo blanco. Not the same restaurant!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "q3fL7PRGj_IrYzwEmx0G1A",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. flama Dulce $13 que Milagro $13",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/q3fL7PRGj_IrYzwEmx0G1A/o.jpg"
      }
    ],
    "user_id": "QlCbMQHtPzVU9GT0nqJ9oA"
  },
  "4tPGdX7VYsJT1lFQwR6Oew": {
    "date": "2/13/2015",
    "text": "The food was great unfortunately they don't have ranch dressing, the ambiance was great. The homemade ice cream was great. Wish we had a little faster service",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6rifWcJIpSDzg1llvpna2A"
  },
  "BZ9Wp2e0RURccOWS_Wzsbg": {
    "date": "3/20/2016",
    "text": "We had breakfast here 5 days in a row. By the 2nd day the staff already knew our names. The service was awesome but the food was amazing!!! I swear everything they make is from scratch and I found myself snapping pics of the food. The (in-house made) Granola bowl with fresh fruit and Greek yogurt was incredible. I'd list everything I ordered but seriously it was all so good just try pretty much anything on the menu. A shout out to Fuego for taking such good care of us.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7xEwx4Q7u6jau0VRmxzBAA"
  },
  "JEv1iPd1wo4y2u4ZkPDYyA": {
    "date": "4/28/2015",
    "text": "The service was absolutely amazing! The drinks were very refreshing and delicious. I tried alittle bit of everyone's food and everything was on point!!  I'll definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xw4IiVR-_mybKrSYjZgEcg"
  },
  "FG24XSs0CBw9oNJJBfuqMw": {
    "date": "5/8/2016",
    "text": "Okay, so we start with the positive: great atmosphere, clean, decent service and it was free for me to eat the brunch buffet (25.00 for my boyfriend). Now the not-so-nice part (I really don't enjoy this, but if the bags torn, just rip it wide open): I'm glad it was free, cuz I would laugh in their faces for charging 25.00 pp. It was good, but not for 25.00 pp. Bacon, eggs, potatoes, pancakes, quesadillas, ironsteak sandwich, fruit salad, nachos, and quinoa stir fry. No drinks, nothing. Then the lighting at the \"buffet\" was so bad, it was hard to see what was what. Even some of the shorter guests had a hard time seeing what was in the servicers because they had them up too high. Then the tables...so crowded, they tried sitting me, my bf, and baby *in a car seat* next to a 400lbs dude that was blocking anyone from sitting anywhere near him. Then the bathroom situation....only baby changing station was all the way in the back, in the handicapped restroom.  No big deal, unless your employee spends 10-15min in there,  and only opened the door because you started banging on it. That leads to another question: who spends 10-15 min in the restroom, but it's not for pooping?  Hmmmm... oh, and the emergency fire exit was blocked by clutter. Did I mention the 3.00 bottle of water so I could feed my baby? I spoke to the nice young man there (who seemed to be in charge?  No one wore tags etc, and the head people all wore civilian clothes) he said he'd speak to the staff.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vailGHtkJcb6O0lETZ8LhQ"
  },
  "Qu2NLH_ljNbzxr4_D8wgyw": {
    "date": "3/3/2016",
    "text": "Great service and good food.  sort of a hipster Phoenix vibe.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bs4Ih2LpQaN063Egi9VdIw"
  },
  "ajjzcCi27o5hOckl2xr3Wg": {
    "date": "4/29/2015",
    "text": "Huge huge improvements in food and service and overall atmosphere since the previous operation.  A neighborhood favorite. Just got better.  Try the chicken torta, it's amazing!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FLrTScnnMPJDH2HlWtPFIQ"
  },
  "-W_zb_DgoeBj4fHlykkDgA": {
    "date": "2/16/2015",
    "text": "I came here expecting to eat at Gallo Blanco and instead found that Gallo Blanco has been replaced. There was no cocktail drink menu. We were told it is still being developed. We had the guacamole as an appetizer, and it was good. It comes with pomegranate seeds. The chilaquiles were ok. They seemed more like nachos with tomato sauce on top. The pork belly taco was very good, although I was not impressed with the tortillas. Overall, this dining experience was disappointing, but I will probably come back later when the restaurant has more of it's menu put together.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "GPsSAGB45yodTwDN9i0GgQ"
  },
  "ebUkI9tnPW6FXoGmKPIYkg": {
    "date": "2/14/2015",
    "text": "We had the chile burger with bacon and were not impressed. The peppers were not even not and the cheddar cheese seemed to be of poor quality. What's up with the fries? Was the cooking oil recycled? It tasted like it when I had the fries. The pancake was not the way I remembered it.  I won't be back. Too disappointed that this place has tried to replace Gallo Blanco. You have a lot to learn. It's all in the details. Enough said.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "yciqs9iLvROJ7Ef219yqWQ"
  },
  "_LxUVQzEuq_Qw1h1I6ou4w": {
    "date": "8/25/2015",
    "text": "Just so so. Hipster atmosphere but he plates did not add up. Mid-summer tomato salad featured anemic veggies without flavor - no excuse for that!  And a specialty sage margarita lacked flavor and was inexplicably served after the food. Not worth the marked up prices.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KoSQGZ_hfcCNGkVWvuw9fQ"
  },
  "08H37l9LUDNbcFdXYtr_FQ": {
    "date": "2/24/2015",
    "text": "Just finished reading the new times review. Posting my response here.  Meh, I suggest you read the review again. Not far off the mark is way too kind for \"spicy rubber\",\" over priced 1/2 chicken \", \" hard to swallow \" tacos, \"salsa that failed to bowl us over\" etc. Thoroughly disappointed that Gallo is gone. Why the hell would you hire a chef that already had one failed restaurant unless you want another. Just sayin'",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "koTyfPcHf-y_GvLG7TdVRw"
  },
  "dRfTZ-wenHLZUIHSk5FFFw": {
    "date": "7/6/2015",
    "text": "This is definitely one of my favorite spots to eat downtown! Last time I was there we had exceptional service and Jake who brought out our food was very kind and efficient! He even burned his hand trying to take our hot plates out! He recommended the flapjacks and I was very happy with them, definitely going back for the friendly service and great food !!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xitENMn2mWmou-jGpyLY1A"
  },
  "ML3GwBq_ialbNFD-iXI38g": {
    "date": "8/31/2015",
    "text": "Had breakfast here this morning and was a little worried since I loved Gallo Blanco and their migas dish. BUT...it was FANTASTIC!! THE breakfast burrito was excellent, eggs were creamy and it was the perfect size came with a side of avocado and a thick slice of watermelon. Fresh squeezed OJ was so sweet and delicious. Luz cold brew coffee made for really  a GREAT breakfast. My server Fuego was super cool and friendly. Highly recommend!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FT84s_BmtzPEhyaHz0R2bg"
  },
  "9ZybFp8HJRBId1euJshgAg": {
    "date": "7/22/2016",
    "text": "So disappointed with Cafe Tranquilo. I live nearby and have eaten here or ordered takeout many times. The quality has really gone downhill. Not sure what is going on but the last 2 times I have ordered out, the food has been terrible and the attention to detail lacking. My Tranquilo chopped salad today did not have the tortilla strips or cheese on it and the salad dressing was awful. It used to be really good. I really want to like this place but I will not be going back",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "BbuSahyl62u5MnJBip_Iqw"
  },
  "vZ-MyBwUc6XgXvS90UuITA": {
    "date": "4/17/2015",
    "text": "We started with chips and salsa, which were good. The chips are thick and crunchy and all 4 salsas were good.   I ordered the veggie burro. It was very reminiscent of elementary school cafeteria food. It was made up mainly of carrot circles that tasted like they were frozen and then steamed.   Everyone was very nice, but the service was really slow even though the restaurant was nearly empty.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "meuMlzL8LwKzDXf-levTbQ"
  },
  "TJTI0GVLIqgxDoRh1wEFSA": {
    "date": "1/16/2016",
    "text": "Cafe Tranquilo is a nice place to enjoy a meal. We went to Sunday brunch, very relaxed atmosphere. Bloody Mary was awesome, 4 dollars. Food was great. La Tripleta is what I ordered, could only eat half and was stuffed. Jacob was our server, he was amazing. The place is sort of hipster which threw me off, but it did not detract from the overall experience, or annoy me. I will definitely be back. Oh, and this place makes everything in house. Very fresh, savory, and filling. Decent tap beer selection too. Overall, I normally hate eating at hotel cafes, but this place was pretty amazing!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QPV0VVmF_faL8OabHPiOQw"
  },
  "xEQCnxOOJGV0U7pFsz1QYw": {
    "date": "8/16/2015",
    "text": "The food was very bland, we ordered ribeye medium and it was well done we also got the vein cut parts you could not chew it, portions very small for the price. The bar had no blender for margaritas, no mint leaves for mojitos, no mexican sprite,Very disappointed. Don't waste your time or money here !",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kl_b2irZzTM8-UX-xn7a6Q"
  },
  "CKR83EHTC_l7aj3Cmnenbg": {
    "date": "3/4/2015",
    "text": "Slow service , lack of wait staff, the Potatoes taste and look like chopped up french fries with raw peppers cut up into them. Super small servings. Not impressed. Hopefully they will get it together.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cyjv_YTt4TQ2UKEyutWNBA"
  },
  "OJpUbRg5CxIhZ_h--9Z3rA": {
    "date": "7/1/2015",
    "text": "I highly recommend checking this spot out.   The food is amazing and the staff is always on point with a smile on there face. Keep up the great work guys, you have a customer for life!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GbfbjnPZYjfMdKh1IpILMQ"
  },
  "X06dGgTu4wVUmFufTdMnEw": {
    "date": "8/20/2016",
    "text": "Stopped in just to have a quick drink and some appetizers. Food and service was exceptional very friendly especially  Nicole. She was very hospitable and kind. The atmosphere was great they in fact had a pool party going on that I was very envious of. Will definitely return especially to enjoy the nightlife.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jKJACsKfJYU6SZXAPGQPXQ"
  },
  "gEip9EOcL86LflmUxq6IBA": {
    "date": "6/12/2015",
    "text": "Great Decour, and excellent food! Their breakfast was great. We were a party of four and everybody was happy the pancakes were fluffy and incredible the breakfast burritos awesome, mushroom and spinach omelette is to die for! Waitstaff attentive and friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "atjsQkVq88mXZSoJN2JoiA"
  },
  "C1VQGcLZjbvltBE29B3zjg": {
    "date": "10/25/2015",
    "text": "I hate to say it but obviously not as good as Gallo. The Guac was missing the orange that it used to have, but still good. I think the veggie tacos are even better, but I missed the corn in the old ones. The drinks were a little lackluster. The waitress was a sweetheart. The main thing that bothered me was that their menu online was different in person. They listed nopales and potato tacos online which was the main reason I came here. Also a daily Mac and cheese which they didn't have.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WFN-sUvDzJz9Ip5lxEBJSA"
  },
  "uniKbxapLP_KCcq_CTdQAQ": {
    "date": "2/22/2015",
    "text": "I know I know is not Gallo Blanco but..... not happy...the  food huevo con chorizo it was good but the coffee tasted burned...service is really bad they didn't offered us more  drinks we ordered our favorite flapjacks  almost 20 mns after we finished our food the flapjacks still didn't arrive to the table..... not sure if I'll give it another chance.....I expected too much from it :(",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "zDrPBxohoqqxmWL9cJWRJg"
  },
  "kG2TErFYj97ZM6ZGscDdhQ": {
    "date": "7/26/2015",
    "text": "After 10-15 minutes of waiting for the server, she started off by telling us that they were short on staff even though there were 10-12 tables and 4 servers.   As for the food, the presentation was good. Unfortunately, it goes downhill from there, due to the stale potatoes and bland chorizo and eggs.   The food and service in its restaurant doesn't match the hotel.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "srCQjyaBotVR4nLtcTIxkg"
  },
  "4_VSPz14RtKddyak6lX1VQ": {
    "date": "6/3/2015",
    "text": "The food was great & the drinks were even better! The bartender said she was new but made the best Manhattan I've ever had and I'm from NYC. Easy Five Stars!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "e0K7zAm6hhlSMriMWhQQ1w"
  },
  "rMnU__CQHrY9KcqoY7SePg": {
    "date": "7/8/2015",
    "text": "Tried breakfast at this place with and our server, Jacob, provided excellent service. He's very knowledgeable about the menu as well as passionate about all the food Cafe Tranquilo has to offer. Jacob was attentive to our needs while having a positive attitude.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iv_8O3BFhI4SNX1cAP-Kbw"
  },
  "5EYQBUYccvh6a6vJ8_4ISg": {
    "date": "7/24/2016",
    "text": "We came to this restaurant because we were given tickets as part of our stay at the attached hotel.  We tried the gringo breakfast and the spinach and mushroom omelet.  Both were excellent.  Coffee was pricey but good. Service was quick and attentive.  The house made salsa hot sauce was good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IuPFXdNqdAirYBU9ExqRAw"
  },
  "FKrkQgDXeWGtVdz4H7e6bw": {
    "date": "6/22/2015",
    "text": "The Carne Asada tacos are as good as ever. I've done both dine and take out. Service has always been good. I enjoy sitting outside when the weather is good. The restaurant is comfortable and has a nice atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6A5EoiDmF4c-6Aqdaw6sHQ"
  },
  "-gGeOkGTmzG1HKfsQowXTw": {
    "date": "7/22/2016",
    "text": "Nicole Rae Joe has outdone it again!  Classic high end authentic Mexican food, live music, local artist exhibition, hip decor, great ambiance!  Will definitely come here the next time we are in Phoenix!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WdiKIlYr1fh-AEhQ2DBN4w"
  },
  "qPMG8iH1Ig3TqHH-qRSL-g": {
    "date": "8/3/2015",
    "text": "The food isn't bad. Each time that we have eaten here, either a maintenance man is fixing something or there is pipe we are afraid it's going to burst. Maybe next trip to Phoenix it will all be fixed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PB12rXSugGTOAiLYPA08mA"
  },
  "Ygk9mK9LjPwRw6qZi0_WjQ": {
    "date": "6/27/2015",
    "text": "A friend and I we're staying at the Clarendon  for a staycation we went on a breakfast voucher for breakfast during the week day and we had a server name Jacob he was amazing went above and beyond even offered us or try horchata to put with our coffee very personable very cute. He brought out every kind of homemade salsa the restaurant had to offer without even asking him . Was unsure to try cafe tranquila cause I was obsessed with Gallo blanco but I was very much so pleasantly surprised ! Thanks Jacob !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "f6VnR4YQenIL-cJAU2IO9Q"
  },
  "JOIxEKFTM9SjlOixWtNPLA": {
    "date": "9/11/2015",
    "text": "Wow !  Best Bloody Mary !  Started things off in a great way ..   After asking my server for his advice on a breakfast dish .. I was very happy with his choice ! Eggs cooked perfect & my bacon was excellent!!  I'm very picky about my morning meal & this place was jus up my alley !!  All be seeing Jacob & his killer Bloody Mary Soon !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kQcR_PTJVGJ3pgBBctOTXw"
  },
  "T3CnppzcqnNdi3E8x5DtMA": {
    "date": "6/14/2018",
    "text": "Very annoyed! We called at 930 to see when they close. They said 11. We got there at 10, and they told us they were closed! We asked when they closed again, and a man came inside from smoking and said they decided to close early smh!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yh_7YQPIxvdBOBAQyFALeQ"
  },
  "iNR0GF1YhFuxkEdp9eUv9w": {
    "date": "7/25/2017",
    "text": "Came here because they were connected to The Clarendon. We weren't sure what to expect to we figured we'd give it a shot since I got a free drink ticket for checking in.   The drink was tasty and strong. No complaints there. Service was fast and friendly. I enjoyed my Chilaquiles and the Avocado appetizer they had for dinner.   When we went back for breakfast, I had a great cup of coffee along with my fluffy pancakes. Great spot!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "ilC8HaDyWXd3f0nBgiyayw"
  },
  "u-GshmVYfMulQN5eBHuwrw": {
    "date": "7/6/2018",
    "text": "We had a large party, and called ahead to be sure they could accommodate us. The food was decent, but the service was completely lacking! Before ordering, we asked about split checks, and were informed they couldn't do so, but could charge credit cards however we ask them to. We kept track of what we each ordered, but when the bill arrived, happy hour discounts weren't accounted for with each item, but rather were given as 1 discount at the end, and like items were lumped together. As a party of 20+, it took some time to determine what each family owed. Their wait staff were highly unprofessional and rude in their comments to us. Horrible experience and would not recommend!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c7LgRmo3lppxsi4BCGO5JA"
  },
  "Qq6WlUK8hh3fPjE-c-XJZw": {
    "date": "7/28/2017",
    "text": "45 minute wait after we placed the order to get 3 tacos which were , by the way, nothing great. An unapologetic server who could not be bothered to check in and tell us why the wait.  We had to ask him 3 times about what was going on and each time he seemed bothered by the question more than trying to see why it would take so long. Whatever. There are better options for shitty service and mediocre food. Hard pass",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "gynMtvoyHZrSDsHMecwd8Q"
  },
  "Bb10ciT-OBidk95gSu12Lg": {
    "date": "5/20/2017",
    "text": "Went with a group here the other night. I had not been inside the Clarendon for several years. I like what they did in the space in front of the bar. We were seated right away for our reservation. Most of us ordered from the happy hour menu which made the food and drinks very affordable. Service was good the entire visit. I had deep fried avocados (very good), grilled chicken taco (over grilled and weak mole flavor), fish taco (good), traditional margarita (ok). The restaurant seemed sort of quiet. After dinner we found out why, There were many people taking advantage of the spring weather and live music on the rooftop. I would come back again if somebody wanted to meet up.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "Z128ihQea7BLPh2T9q9sKA"
  },
  "iFxQCWeWK_n0S4P7P4uR-g": {
    "date": "11/12/2017",
    "text": "Great patio...  loved the Elote! Perfect for sharing on a lazy Sunday afternoon...  if you come here check out the hotel pool area, Beautiful!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pvAJzwLjLXPOJvmt9STJJg",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pvAJzwLjLXPOJvmt9STJJg/o.jpg"
      },
      {
        "img_id": "FNVOAqoTrV6oyvepRrAdiA",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FNVOAqoTrV6oyvepRrAdiA/o.jpg"
      }
    ],
    "user_id": "6neB0yDfgm4fzvu31_1mRQ"
  },
  "0eEAgYr_J2oh1kAd_q3wwQ": {
    "date": "5/13/2018",
    "text": "Good food concept. Didn't try to re-invent Mexican food but gave it a good twist. Fresh food and enjoyed dessert.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "21XaCUZnGSDpXjwT0aL0eg"
  },
  "oHgxOddQdDQr9p9MJRlMkw": {
    "date": "4/26/2018",
    "text": "Andrea was the most amazing attentive waitress I ever experienced. Food was so amazing great quality and happy hour 5$ margaritas got me! But there dessert omg to die for. Thanks for a wonderful experience I shall be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gYmthLSaLgWw9CMbC5ZYww"
  },
  "z1GtVRr3qA7VLtZsVmzQ-A": {
    "date": "4/4/2016",
    "text": "From the beginning this meal was ideal. I can't say enough about how flavorful the food was. The subtle seasoning was just enough to enhance the flavors of the base item without over-powering.  Both the shrimp and ribeye were dazzling entrees that were only made better with the sensational sides.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "N96cW2XWsFIWkUn54YSNAA",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. The Flan. A smooth flavor, and perfect texture all the way through. Perfectly accented with chocolate and fresh berries.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/N96cW2XWsFIWkUn54YSNAA/o.jpg"
      },
      {
        "img_id": "fmwx0TBCaUoc-MsnY2A8fA",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Perfectly cooked ribeye grilled with hickory and pecan woods.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fmwx0TBCaUoc-MsnY2A8fA/o.jpg"
      },
      {
        "img_id": "v1iyyM153RgaardUMHV3BQ",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. The Shrimp Sofrito is a must!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/v1iyyM153RgaardUMHV3BQ/o.jpg"
      }
    ],
    "user_id": "_H4zSKKoIFjpwH7gEJmMew"
  },
  "TkA29T40Bwm9AG3zEciuqw": {
    "date": "4/7/2016",
    "text": "Food and ambiance is great. Ask for Jacob, he is the best! Service is always improving. Get the pork and shrimp tacos!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "gOYgSEbE-Z7cqGsgGW3LBg"
  },
  "Zki7zOFp2mqct6V-jXseXQ": {
    "date": "5/19/2017",
    "text": "Went there and tried a couple of their taco's. They were tasty! Keep in mind, these are not traditional street tacos, but the two that I had were great!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5PDxvB-QQ5VgzukfZ0zlag"
  },
  "FPfDwrA_aaaQN7GXueL_Uw": {
    "date": "5/6/2016",
    "text": "First, I'd like to preface by saying that I had no issues with the quality of the food. When I first discovered Cafe Tranquilo on Grubhub, I liked the La Peruana salad (with carne asada) so much, that I ordered it again the next day.   Secondly, I should add that that's the ONLY thing I've had from there, probably about four times now. So I'm relatively familiar with this specific lunch. It comes in two sizes, a large and a small, running $8-12 respectively.   So today I ordered the large salad again, sans asada. When I received my order, the container seemed smaller than I recalled. I measured the container out at 6.5 inches long, and decided to call and make sure that I had the correct size. Although I was assured it was rang up as a large (no duh), I could not get a straightforward answer about the size of the to go container.   I was told that I could be accommodated if I went in person, but the reason I order through Grubhub is that I generally can't leave my work. And though I was inclined to go down there just to prove a point, of course I dropped my car at the shop this morning. I was also told that even if it was wrong, they couldn't send another, and rather made it seem as if since I ordered through a service, that I would not get the same treatment as an in person customer. If that is the case, than perhaps Grubhub should not be an option.   I wasn't trying to get over on anything, or even have it replaced. A note for my next order would have been fine, IF it was even the case that I received the wrong one! But I don't know if it was or wasn't because my original question about the container was continually avoided.  However, I do know now from the gentleman that I spoke to, that the drinks and food are measured, and he has great trust for his people in the kitchen. So much so, they are apparently infallible to any possible human error, rendering my question ridiculous.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "t42K1H96lPbPF0akCDKunw",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. This is the food in the container (before I ate it) Looks good right? It was.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/t42K1H96lPbPF0akCDKunw/o.jpg"
      },
      {
        "img_id": "lAlg2AM29HZQymUX07tMRQ",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. This is the container.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lAlg2AM29HZQymUX07tMRQ/o.jpg"
      }
    ],
    "user_id": "7YCjuNE9QcB40B2ZvywnCw"
  },
  "AJG9L-J2kOewkYHCOEfEJA": {
    "date": "4/2/2018",
    "text": "Had a intimate birthday celebration dinner at Tranquilo and was very pleased! Pork belly taco was bomb diggity and the fried avocado are my new favorite appetizer! Oh and let me not forget the waiter recommended a great wine that totally compliment dinner! Unique atmosphere out on the patio, great service and a totally cool rooftop bar!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qqr54njMgBDMlu7Qtg9QVQ"
  },
  "nFp3DsZFhkk9Zpu00uNIUA": {
    "date": "2/22/2017",
    "text": "I stopped in at the bar. Falyn is a great bartender - it was clear she was trying to get me into trouble. Sometimes that is exactly what a bartender should do though, and this was one of those times. Fun friendly bar and patrons. Did not eat here......",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "Nlt47sn6lkJoXUkEHd3kfQ"
  },
  "p6Ke0eGTBFj-kz213ML-9A": {
    "date": "6/14/2017",
    "text": "Cafe Tranquilo is my go-to neighborhood brunch spot. Great service and trendy ambiance.  The Green Chili Chiliquiles paired with a Bloody Mary is my recommendation. I have also had the yogurt bowl, delicious on a hot Phoenix morning. Either way, can't go wrong with anything they have to offer on the menu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eqjAtzvytERS51VXlT6TTA"
  },
  "8vkDZIt6AH95fAdVBt2bpQ": {
    "date": "7/18/2017",
    "text": "Loved this place on Cinco de Mayo. Loved the bar upstairs with the bird nest chairs. Had the vegetarian burrito and was so stuffed I almost didn't finish! Please go here you will not regret it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "-d78vV86WnU2uWac1fEntA"
  },
  "mUY4g1tSnFMtDnqaSmbIfA": {
    "date": "7/28/2017",
    "text": "I am here again from Colorado after dreaming for months about Cafe Tranquilo pancakes. Were they really that good? So I order a stack and it's like crack to an addict! There are no better pancakes. (The waiter tells me the secret is Mexican crema.) I was not fantasizing. They are not just a distraction to the great huevos rancheros and huevos con chorizo, which are great too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "MF5JY9idQJDuRJ2alHqYGw"
  },
  "iyWLgxn3Y6HV-VIVTF5s4Q": {
    "date": "5/24/2017",
    "text": "Overall Cafe Tranquilo was a pleasant experience. Food was good, tacos were okay but for 2$ each during happy hour you can't go wrong. Chicken taco was really bad but the fish taco was one of the best I've had in Phx. The place is hip, good drink specials during happy hour. Will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6r1aLsIMEVCkt3aTleoA7w",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6r1aLsIMEVCkt3aTleoA7w/o.jpg"
      },
      {
        "img_id": "KHZF1AsYXYIrnH8_tHf_FA",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KHZF1AsYXYIrnH8_tHf_FA/o.jpg"
      }
    ],
    "user_id": "ib_ZTEwlCyz7xUCNXfmv_g"
  },
  "VyOXgz0CGPv_K-9ndppDrg": {
    "date": "5/10/2017",
    "text": "A great happy hour stop for anyone in midtown Phoenix! They have $2 tacos and great margaritas and cocktails 3-7pm! For the table I recommend the Elote Esquite, a delicious blend of skillet corn, peppers and cojita cheese! Also the house made guacamole is solid choice. After dinner make sure to go up to the rooftop bar and enjoy the live music and drinks around sunset!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ug4W98GjGo8uKGNwbKIP_Q",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ug4W98GjGo8uKGNwbKIP_Q/o.jpg"
      }
    ],
    "user_id": "QLMOFcS-GMbbFwIUJoVnow"
  },
  "8FOQOOyp4NEBW3C1Y3yQAA": {
    "date": "3/23/2018",
    "text": "Please note this location was named on the CBS dirty dining list on March 23. Violations included slime and food buildup on kitchen  equipment and employees not washing their hands properly",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cjul1bp0PtI4rhT7tPERYA"
  },
  "fVugIpgFhmXzJ3ly2njosA": {
    "date": "8/31/2017",
    "text": "Excellent restaurant Cafe Tranquilo is inside The Clarendon Hotel near downtown Phoenix. Warm, friendly staff, great Food & Beverage! I'll be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fkpZ-zkKXjWs7JK3T-r9Aw"
  },
  "VJzdDw-dICTN-eaZZuqGew": {
    "date": "7/9/2017",
    "text": "After a 2-day drive from Texas, my husband and I were looking forward to a nice dinner. Unfortunately, we didn't get it here. First, we ordered the elote appetizer. 10 minutes later the waiter tells us they've run out. He offers to get us chips and salsa. Another 10 minutes later, we flag him down to get the chips and salsa. The spinach chop salad was horrible. Lightly dressed with something resembling water, it was almost inedible. I returned it and got the Caesar salad, which was ok, but I could have made a better one a grocery store salad bar. Shortly after sitting down a musician started playing in the bar area,and the sound carried so much we couldn't carry on with our conversation. All in all, a real disappointment. We told the manager, who gave us some free drink coupons...sorry, that doesn't make up for substandard food and service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yeDt80iylA_5FKnOKxt0jA"
  },
  "oZKtrCd2gdkxErdjM6JW4w": {
    "date": "1/7/2017",
    "text": "I enjoy all of their dishes. I believe that one of their dishes alone makes the restaurant deserving of 5 stars and that's the braised pork benedict.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "BR-K9icLmeFaTMqSlE11IQ"
  },
  "qU22VcC6B279tX4r8QrFPg": {
    "date": "9/15/2017",
    "text": "Best restaurant/cafe on Phoenix. Food Is tasty and delicious and Jacob is always so nice to us",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t78Qdy8VoBoE6rcK4mdyXQ"
  },
  "Jlh1Z7rqWIaXusumedps2g": {
    "date": "9/15/2017",
    "text": "This place is legit! Great food all the time and I've been here 5 times!! Jacob is the best server here, we always have amazing service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I37i4Xn6mZIeKqSotlKO_g"
  },
  "EN-PJgNXB1istN30ndWyrw": {
    "date": "11/6/2016",
    "text": "Just want a snack.  They got it.  Glad I came, because now I know their food is good and I want to try more.  Looking forward to my future visit as Falyn was a great bartender and the appetizer was great!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "FFo6LcBgaFiUgcUHvGqTag"
  },
  "TL3DyaL6ONEZ_Eve0aLGmw": {
    "date": "9/5/2017",
    "text": "When are the changes going to stop?  I live in the neighborhood, and used to frequent Gallo Blanco.  The menu/food was consistent.  When it changed to Cafe Tranquilo, I anticipated a few growing pains, and I tried to continue my loyalty, but it seems that frequently, when I go in, there is another change, to include the decor, menu, happy hour specials, staff, etc.  My most recent visit, today, was more of the same.  Now, they have 'counter service'.  So, I had to place my order at the host/hostess station, take a number, and have my food delivered to where I was sitting?  In the middle of taking our order, the host took a call and proceeded to take their order while making us wait.  Had to eventually go into the bar and have the bartender refill my water.  Also, was looking forward to having the pancakes, only to discover they no longer offer all day breakfast.  Way too many ongoing changes.  Not reliable at all.  I won't be going back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GJ672GV5lEFljsbcBDsuWg"
  },
  "vbKq3SAZK4GrXUJXo05Ehw": {
    "date": "12/14/2015",
    "text": "I'm from Oakland , CA and visiting Phoenix for the first time to meet my friend who is living in New Zealand.   I'm huge into local, artisan,  and organic farm to table food with high quality meats and make it a huge priority in my diet.   I decided to stay at the Clarendon in part because of my research into the good scene at Phoenix and reading  the extremely good reviews of Tranquilo. I take yelp reviews with a grain of salt to manage my expectations, but Tranquilo completely blew my friend and I away with the impeccable kind service and extremely high quality value of delicious food. They use cast iron here , no microwaves and are proud to source their dishes from local farms and high quality butcher shops. Even without the free breakfast vouchers, the meals are an absolute steal for what you get. It made a very picky East Bay SF food snob very happy.  Jacob, the manager was super sweet and accommodating to my possibly strange requests. Jacob was super passionate about the food and incredibly welcoming to a new visitor. He told us where the food was sourced and gave all sorts of cool recommendations on other places around town.   I also love that they are gluten free friendly and have Grass fed beef. We are definitely getting breakfast there tomorrow!!!    I'm excited to come back to Phoenix with my boyfriend and friends  and stay at the Clarendon.   I am so impressed and surprised that Phoenix is now the place to go for high quality farm to table food without Bay Area prices!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "aa9T868OpSdFKuJ-swIVmg"
  },
  "RsBfCyL099APw10y8Q2hIQ": {
    "date": "12/9/2016",
    "text": "The Bloody Micheladas are soooo good!!! Chips, salsa, and guacamole are awesome as well!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "J7xfWyoVv90PVn2T7JZuhw"
  },
  "rRVlVU3DYehcG49hBrvf4w": {
    "date": "2/7/2017",
    "text": "There are few places that are 5 star from parking to check. Being greeted by the GM, Nicole with warmth and humor. What a doll (and she works!) Easy breezy menu. Delightful staff. Excellent IPA perfect coffee. Don't miss any of the tacos! See you there!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "E3Zp9Z7xi42CXpmViFvHFA"
  },
  "V5dUKFPKmS5srQIVlY7bGw": {
    "date": "10/10/2017",
    "text": "This place decided to cancel taco Tuesday on Tuesday! That's like having your kids run downstairs on Christmas to find no presents under the tree because Christmas was canceled! This sucks",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "AutQ4vYTx0yms6x3oHyykw"
  },
  "EuDI7xYgGIGC1Io62xMAEg": {
    "date": "3/3/2017",
    "text": "Best guacamole I've ever had! Service is incredible. Go during happy house, tacos are only $2. Would definitely recommend this!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gJvWs2fECQhh7jniXVCv5w"
  },
  "Zjc32Zz90h4ABzh64DWTEQ": {
    "date": "11/24/2016",
    "text": "Hosted a birthday dinner here for 30 people in the hotel lounge, Cafe tranquilo. Servers were incredibly attentive and conscientious of our various allergies. Limited food menu but what was there was awesome. Loved the vegetable tacos that were bursting with flavor! Flourless chocolate cake that melts in your mouth with decadent flavour while maintaining the fluffy texture was to die for! Guests loved the array of cocktails, wine, and beer selection available. Had plenty of space to mingle, take pictures, and enjoy the very talented live musicians seated nearby. The simple but lovely rooftop bar had a pretty view of Phoenix, strung up lights, live jazz music, and plush seats you can sink into. Drink and food prices were very reasonable given the classy feel of the space.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "He2UXphOsEq7U5LDyd3n4Q"
  },
  "FbKj1gmuj6UpD0jFWXdqEg": {
    "date": "12/12/2015",
    "text": "Great service and food Thank you. I'm so happy I took the time to speak to the hostess, she was so kind to tell me some history of the restaurant and made my guest feel welcomed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "EwjUvzrk92EpwlpljtlNlw"
  },
  "5XDhLEzGLmC9dVgwaPH7_g": {
    "date": "12/14/2016",
    "text": "Got a breakfast burrito to go.  It was good but $12 (with tax sans tip) seemed a bit steep.  The menu showed burros for $7.  Not sure what exactly I was charged for and wasn't given an itemized receipt.  With so many other places in the area, I probably won't be back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rri0tESLDdNo0YmDAMDi0Q"
  },
  "mcvNCZB1yhTH_K5iReVtzg": {
    "date": "8/2/2016",
    "text": "We had our food delivered.  Most of our food was bland, or looked like it was just tossed around or into the to-go container.  It didn't come with our full order!  Items were missing.  After calling, the girl I spoke to said she would have the driver run it over right away.  AN HOUR LATER still no food.  The driver finally calls me to tell me he can't locate our address.  They gave him the wrong address with no suite number.  Not impressed at all!  When we finally got the pork taco, it was upside down in the box.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ntCMfCHQvqu67UqBN7GASw",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Really?  Charming....",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ntCMfCHQvqu67UqBN7GASw/o.jpg"
      },
      {
        "img_id": "GtXiyH2t_5DNzlXpP2zvsg",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Upside down in the box.  Seriously?!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GtXiyH2t_5DNzlXpP2zvsg/o.jpg"
      }
    ],
    "user_id": "V9MbFRNzm2ksKcyzMgR-4A"
  },
  "UDSjUOj8mVhB7T-6fFet2w": {
    "date": "1/18/2017",
    "text": "Service was great. Atmosphere was really cool for Sunday brunch. Food was great. I had the omelette. Will definitely come back on my next trip.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "c3sOrJB284AtDHOMggDffQ"
  },
  "ASy3KUUu1-eEP2QBDc6_Jg": {
    "date": "12/29/2016",
    "text": "Our server Sivan was excellent. 15 out of 10 stars. If she isn't your highest paid server, idk what you guys are sleeping on. Gave us the great recommendations and was a treat.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "edCYgmacFj3diyaj8eCEcQ"
  },
  "npndcAuHpJmqIGO3AASVBg": {
    "date": "9/17/2016",
    "text": "Out with one of my good friends - wondering where to go & thankfully our wandering took us here. I hadn't been to CF for awhile & had only gotten take out,  so ran in & out at lunchtime. Thankfully we got to go in, relax, enjoy the beautiful atmosphere & delicious food. We were greeted & promptly seated. The chairs comfortable, something I don't normally notice, cause most restaurant chairs aren't anything to write home about, but that was the start to a great experience. Comfort. Attentive service with a smile & knowledgeable staff. And I hadn't even eaten yet! We order the avocado fries (really!) with a wonderful dipping sauce, those disappeared quickly then we got our meals.  My friend got asada tacos & I got the Cuban inspired sandwich. My friend really liked her tacos, but was feeling the rice & beans were lacking. Can't please everyone & honestly we're pretty hard core about our mexican food. However my plate was absolutely delicious!  Cuban inspired, taken upwards. The bread was soft &perfect. Towering with meat & served with a side of tostones. What I loved is that this wasn't fluffed with fillers i.e., lettuce tomatoes,etc. And there no french fries. On the side because they're in the sandwich... Wonderful! My photo does it no justice. Everyone should try this & plan on taking some home for a late night snack, it's a lot of food. My waiter was awesome because he got a Dr Pepper for me (it wasn't on the menu) above & beyond service! I'm a fan.  We will be back with a crowd because I love taking people to wonderful places I've been so they can experience it too. Bonus, easy parking & its free.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "gDgNhj44C3iumCLzPZtv6A",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Yum!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gDgNhj44C3iumCLzPZtv6A/o.jpg"
      },
      {
        "img_id": "HHZXXy12jTt7aMHiqswlwQ",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. My sandwich. Heaven in a bun.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HHZXXy12jTt7aMHiqswlwQ/o.jpg"
      },
      {
        "img_id": "d_mQr_NLJ2igzzy7URhAQw",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Avocado Fries. Awesomely delicious!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/d_mQr_NLJ2igzzy7URhAQw/o.jpg"
      }
    ],
    "user_id": "rXDqOtMie36VjQMLQdwHsA"
  },
  "ew0O2W7doVW7Vv52LZaGiw": {
    "date": "7/23/2017",
    "text": "After running around on a Sunday morning, my husband and I stopped in here for a late brunch. It's a very modern restaurant with a relaxing atmosphere. We started out with Bloody Mary's and the Elote Esquite, which came with chips and three salsas - avocado, tomatillo and ancho chili. If you're not sure what to start with, start there!! Amazing flavor! Next we ordered tacos - shrimp, pork belly, carne adovada and deshebrada roja. While small in size, they are giant in flavor! Our server Jacob was very welcoming, helpful with the menu and made sure our every need was met. We didn't have room for dessert but I can't wait to come back for cafe y flan.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K8t8rFz20YA3fWfe-eWOeQ"
  },
  "bwyc7eVTUUgitNS-QG5Bew": {
    "date": "1/20/2019",
    "text": "Awesome tacos, better chilaquiles. Great happy hour. $2 Mimosas.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r5vGR5uVtPr910BPyf-RAA"
  },
  "AHrEgYaVGoZ9qNMsmA3xBw": {
    "date": "6/5/2017",
    "text": "Met up with a handful of fabulous friends to give Cafe Tranquilo's HH menu a whirl. They had me at  tacos and tequila, who said tacos were only good on Tuesdays!?  $2 tacos and $5 Margaritas, yes please! I ordered the beer braised pork taco, a veggie taco, a margarita, a diet coke and a water, it's all about balance... The service was friendly and fast, maybe a bit too fast because I ordered before I saw the taco special listed on the board....Mango Habanero. Five minutes into the evening and  I was already filled with shame and regret... Thankfully the fabulous friends share, so I got a chance to try it, the panko breaded avocado fries drizzled with a jalapeno aioli, and the Kraken spiced rum...delicious! The beer braised taco was average, the veggie taco with sweet potato smear was surprisingly my favorite. Perfect sized tasty tacos, cheap drinks and good service made HH a success.  But for me what bumps Cafe' Tranquilo from a 3 to a 4 star is the roof top bar with a great view of the city, plenty of comfortable seating, a few tables so you can take your tacos with you, and the chill vibe of a live band.  AZ weather permitting this is the place to be...",
    "rating": 4,
    "rated": {
      "funny": 22,
      "useful": 34,
      "cool": 34
    },
    "photos": [
      {
        "img_id": "E_epSLXW8w0B6Xzf3H-iUg",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. The Kraken.... spiced rum",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/E_epSLXW8w0B6Xzf3H-iUg/o.jpg"
      },
      {
        "img_id": "rkjx9hpClOxhe3AA9CPF_w",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Veggie and beer braised pork taco",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rkjx9hpClOxhe3AA9CPF_w/o.jpg"
      },
      {
        "img_id": "f0BWThnw460edFCBjtRSog",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Mango habanero pork belly taco",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/f0BWThnw460edFCBjtRSog/o.jpg"
      }
    ],
    "user_id": "HmILc-lgVKZS7mWNdYCSJw"
  },
  "A9_pOTZ0yKKNcgNVRHZ1hw": {
    "date": "5/12/2019",
    "text": "Been here twice, and it's now a go-to for me whenever I'm in the area for work. Innovative, fresh Mexican food and attentive staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TsPee9-21EqD5380ygMG0A"
  },
  "NUy16feus1hhp9_xjcHqwQ": {
    "date": "5/9/2017",
    "text": "It's been a roller coaster ride,  hasn't?  Those who know,  know.   After a separation with this place,  I report that I'm happy again.  They have live music every night and the performances on the rooftop are awesome with the city as a back drop.  Happy hour is great.  Great beers on draft.  Fish taco is a must try!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "tA-RJ1ipbIg7pBNlDvcYlQ"
  },
  "SiYbRwYZvtlEpVZCe9-axw": {
    "date": "5/5/2019",
    "text": "Decided to check out this place yesterday and was super happy with my experience! My pool server Deborah was so great. She was super attentive and friendly, and was very patient with me as it was my first time there. Definitely recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k9gsugCFsK9e6g9QQgcjmw"
  },
  "SDguM9JX2pEX2irDTh6s2w": {
    "date": "10/26/2018",
    "text": "I love this place and love the food. Pork belly tacos are amazing. The Elote, while not quite traditional in its presentation, is my favorite. Its a must try and great deal for happy hour. That is of course when they wait on you. I was seated at the food bar by the host. Then eventually after about 5 minutes the host brought a glass of water. After about 10-15 minutes sitting at the food bar right in front of where every sever picks up the food I was finally asked if anyone helped me yet. The place was not busy at all. Shame on you guys. Please step it up. I like you.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zDGGAnTvhOiSV1gTJKZHTA"
  },
  "ZNZAMJla3gAuE8QNNDj6RA": {
    "date": "3/1/2018",
    "text": "One of my new fave places, to get tacos!!!!! At the Clarendon hotel Great atmosphere great lighting cute inside hip and trendy Old building. Very clean inside they do have a patio outside and you can eat on the rooftop there's a bar and tables up there and the bartender makes a really good house margarita. So grab a drink and watch the sunset or Go down to the restaurant and have their tasty tacos my favorite so far and have the fish taco and the shrimp taco.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "2LBnQ_3eashaaZRI11mnKQ",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2LBnQ_3eashaaZRI11mnKQ/o.jpg"
      },
      {
        "img_id": "x1PWviTaROQCemrHuUE0JA",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/x1PWviTaROQCemrHuUE0JA/o.jpg"
      },
      {
        "img_id": "yUfgwT1HfQ5Q40qts3TwPg",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yUfgwT1HfQ5Q40qts3TwPg/o.jpg"
      }
    ],
    "user_id": "RrH9eyHaTWT9PB8-FnmRmw"
  },
  "Kpfzq78YhJ_yGqxhV3o8hA": {
    "date": "4/29/2018",
    "text": "This place is nestled inside a creative hotel in Phoenix. Casual atmosphere with slow service during pool hours, because pool patrons take precedent. But it's worth the wait. Tacos, avocado fries, salsas were awesome. The roasted cauliflower with cabbage was amazing. Beans and rice great. Cactus tacos fair.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "q4Vc3z1ZhgM8JIT-Q89HbA",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/q4Vc3z1ZhgM8JIT-Q89HbA/o.jpg"
      },
      {
        "img_id": "X6LtyAT8_ymBkwKlA5IS1A",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/X6LtyAT8_ymBkwKlA5IS1A/o.jpg"
      },
      {
        "img_id": "W5ABuYQDJHyZEfbX77sSkQ",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/W5ABuYQDJHyZEfbX77sSkQ/o.jpg"
      }
    ],
    "user_id": "Y5PdG9zbRPrH0XJXH_b4SQ"
  },
  "QsYXajWV41CfPT443tSasA": {
    "date": "4/26/2018",
    "text": "Andrea is the best server I don't think I've been to a restaurant and have had a waitress be so honest!!! I legit love her and the food her it's amazing. If you are Looking for good Mexican food and a fun atmosphere go here, sit in Andreas table section and have a good time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YScPqHzz1jB_vxWQkBomKw"
  },
  "XIMHCW8YDmJAeO27Sjmxxg": {
    "date": "3/30/2018",
    "text": "Crafty mixed drinks and sophisticated atmosphere!! The Sky Deck Bar, is perfect for cool evenings watching a full moon, and a walk on the patio with drink in hand is relaxing. Friends stayed at the hotel, reminded me of the 60's- Classy",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1a8meiVWspD0V-mf0j_C8w"
  },
  "RT4S4CXCDhFUdDz9-s3zxQ": {
    "date": "4/7/2018",
    "text": "After my visit yesterday, I got to update my older review.. I simply loved the place! Staff was so polite, great service and the rooftop is the charm! Amazing view and live music - perfect way to unwind yourself after a busy week!  Margaritas were good and the corn dish from the appetizer menu is my fave!  I'm sure I'll be going there again very soon!:)   We (me and my colleagues) went there for a happy hour on Friday evening. This was our first visit. Not at all impressive!! * The salsa and chips weren't complimentary. * Quesadillas were too dry. * No hot salsa. The one they call hot, weren't hot at all. * Very limited drink menu in happy hour. * Food options in all are limited.  Avocado fries were really good and fish tacos were good too. But other than that, not at all impressive - even though it's a cute place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mqfglxPe5B8sHrMoJ5AdbA"
  },
  "ndqsBBClz9xE5Qnyvrs-3Q": {
    "date": "11/5/2017",
    "text": "I understand that this place is under new ownership. I hope they are able to turn this place around. Ever since Gallo Blanco left, it has not been stellar. I've been here a handful and don't see myself going back, I am always disappointed.  My daughter and I and a couple of friends went here for breakfast yesterday morning. I was promptly greeted by a  very nice woman and we were seated quickly. Unfortunately, the menu has very few options and is not kid friendly. Since their breakfast is a little pricey, I just ordered to Gringo Breakfast for my daughter and I to share, which was not enough food. In central phoenix, you generally don't get children's menus, but most places have an a la carte menu so the parents don't have to spend $11 for their little's. The food was okay. The eggs and bacon were cooked well, but the potatoes were bland and didn't have the best texture.   Overall, the service was good which is an improvement. I hope that the food selection and quality improves with the new management staff.",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 5,
      "cool": 5
    },
    "photos": [],
    "user_id": "XOk0Wx1X2qzK5GQq05Aaww"
  },
  "vp5flV05Bs-75_61cnxkNw": {
    "date": "1/21/2018",
    "text": "Fantastic happy hour!Great customer service! A fun chill place to hang out at! Love the the roof top and live music!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iGwIVlQBFX5h2_8sCdIyJQ"
  },
  "CQDORDAwk4xVkp_d0x1Ubw": {
    "date": "9/17/2018",
    "text": "Just had a really awesome lunch here. Our server was Fuego and he was amazing. All the recommendations he gave us for food, etc. were on point. The food is fantastic (we had tacos, elote, roasted veggies, and rice.) Laid back vibe too. Check this place out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "27Otvf8GufHvunWRoYMY7w"
  },
  "lSA4YtW53k2lbR-eQuc56Q": {
    "date": "3/23/2019",
    "text": "Paid $85 to wait 50 mins for a to go order to take to the roof top. Restraunt wasn't busy didnt know why I had to wait so long then they bring my order snd ssid the nachos weren't ready its been another 20 mins and there still making them? They said? Food is ok get better tacos else where the cheese for the nachos were stuck to the paper in the box and not the nachos, also the cheese was dry, the best thing was the fries! I would expect more from this kind of restraunt. Tacos were mostly lettuce. Smh not a good experience at all. Now iI gotta go back down to ask for the rest of my order after over an hour!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "luqoMoNJ_LOvDjq6FFVDAw"
  },
  "4s8-SAaZKYSnDhUS21U77Q": {
    "date": "8/19/2018",
    "text": "We stayed at the Clarendon Hotel and tried Cafe Tranquilo thinking, well at least we don't have to drive anywhere for breakfast..., Amazing food for breakfast, dinner, brunch as well as happy hour! Guaca, tacos Elote Esquite awesome! Service outstanding and friendly!  We will definitely come back to the cafe regardless of whether we stay at hotel.. Visitors from L.A.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FLOZgFnZY9nSV7UsAxDnZg"
  },
  "iCSPIhh42RBXgOn0nFHqiA": {
    "date": "8/14/2018",
    "text": "The only thing better than the exquisite food is the friendly service. I struggled not to spend my entire stay in the Phoenix area at the Cafe. I would strongly recommend this establishment to anyone visiting the area or anyone who wants delicious food and a relaxed atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SphWmPiXCMTAE4j18ZioKA"
  },
  "pxsaUqfeIEUN_vJ1Xcq3ew": {
    "date": "7/8/2018",
    "text": "Had the fish tacos with a side of rice. I got the fish fried not grilled. I would get it again but next time I'll  try the carne asada tacos.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZuQOZsHU26nHcLxvysKYqg"
  },
  "XmODNxLrnwdEidZsjL-7sA": {
    "date": "12/18/2016",
    "text": "Service: 5 stars. Food: 4 stars. Since I was here for a company party, we had a private room. The food was pretty good, but most of the menu items were overpriced, in my opinion. The service was amazing, and the staff was very accommodating. One side comment is that soda was served in a can, along with a cup of ice. It didn't seem appropriate for a restaurant with above average prices.  APPETIZERS - The Elote Esquite was the best dish! Perfect for corn lovers. It's a corn salsa with cheese on top. Super sweet but delicious. The chips & salsa trio were average. The green chunky salsa tasted like straight-up lime, the red salsa was spicy, and the light green one was a creamy guacamole. The avocado fries were... interesting. Basically warm, mushy, deep-fried avocados. Other people liked it; I wasn't too fond of it as I'm not a big fan of avocados anyway. The guacamole was what you'd usually expect.  I got the carne asada burrito. It was delicious! I also had the horchata to drink which was pretty good. For dessert, I ate the flan brulee, which was a good finish.  There was live music in the restaurant, which provided a great ambiance. The rooftop on the fifth floor is open to the public, and there's live music there as well. I highly recommend checking it out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xNl0SW_PoOKLfK_n4cBipw",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Rooftop view!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xNl0SW_PoOKLfK_n4cBipw/o.jpg"
      },
      {
        "img_id": "2_8-4LCA4tY93M8YIFNiYA",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Flan Brûlée",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2_8-4LCA4tY93M8YIFNiYA/o.jpg"
      },
      {
        "img_id": "UDl1pEEC7CRY8Ayv3K-uHA",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Carne Asada Burrito",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UDl1pEEC7CRY8Ayv3K-uHA/o.jpg"
      }
    ],
    "user_id": "6fnH-NVt-6Z6x18Hn4P_mg"
  },
  "Zjo407wBz8z_1rP-Iwl7tw": {
    "date": "2/9/2017",
    "text": "The Jolly Diners headed to Cafe Tranquillo. The appetizers were avocado fries, chips, guacamole, and salsa. Delicious. For entrees mom had a burger, sister had tacos, and I a veggie burrito. Everything was really good. This spot is really good looking. It's in the Clarendon Hotel, and has a great modern look with lots of large windows and outside seating. The atmosphere is good, there's music playing, there's a sybar on the top floor, and it's inside a really nicely decorated Hotel. Cafe Tranquillo is a great you can take anyone; family, a date, and have a good meal for a reasonable price. The Jolly diners rated this establishment at a 4.3 out of 5.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "06O64fN5lVHiejTjkJf5rw",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Gaucho and chips",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/06O64fN5lVHiejTjkJf5rw/o.jpg"
      },
      {
        "img_id": "CV67Q0dw6_RaElkwJhiHpQ",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Menu2",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CV67Q0dw6_RaElkwJhiHpQ/o.jpg"
      },
      {
        "img_id": "CJLeVm7cHpV_NBjpfw5gFA",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Menu1",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CJLeVm7cHpV_NBjpfw5gFA/o.jpg"
      }
    ],
    "user_id": "wlc3ueOUwo5e3NFqeVWeDw"
  },
  "gHNFw-OiAqCMsVXUQb-fQA": {
    "date": "12/26/2015",
    "text": "Ate at the bar x2 for breakfast due to the wait.  Both times I had great service .  The staff are very friendly. Loved the Chillaquiles chicken veggie combo!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lXYRMZEAousmXLTN_KcJ-w"
  },
  "Wn8CFanNydU4r1WPskOBDg": {
    "date": "11/23/2015",
    "text": "Super delish guac AND salsa AND drinks. Super friendly service. Great vibe in here. My husband's report: \"wicked cool.\" We enjoyed this place thoroughly. Went back for breakfast and both had huevos rancheros - REALLY good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sT2UDudW8MISunCaN9YRAw"
  },
  "VfnUk8o0l77P4z1Dt92Gog": {
    "date": "12/25/2015",
    "text": "Fabulous, very delicious Carne Asada burros for Christmas lunch, with avocado salsa.  Highly recommend!  This restaurant is wonderful!  Lee and Pat",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5qgtsemhZ0dEJJdmjoX2SQ"
  },
  "AqhO_GFtP5MDR_p1zgG9sA": {
    "date": "1/18/2016",
    "text": "Ate here Saturday because my husband and I were staying at the Clarendon hotel and had breakfast vouchers. We had been at the hotel since late Thursday night and my husband started feeling really sick on Friday. Saturday morning we woke up and he was running a very high fever. There was no way he could go down to breakfast.  I went down with the vouchers and mentioned to the hostess how sick he was and asked about using his voucher to bring him a take-out order. She said she thought that would be okay and so I went and ordered my food.  I had the flapjacks and unfortunately they weren't cooked all the way through. It was like eating batter half-way through =\\ After my food I asked the waitress about a carry-out order. She told me in a clipped tone that the voucher was dine-in only and that she'd have to charge me for the take-out food. I explained the situation and she stared at me looking skeptical and said \"people say that ALL the time, but I'll go ahead and do it this time\".  I don't see why it's such a big deal for people to use the vouchers as carry out. We're staying at the hotel, it should count no matter what. My husband truly was sick and I didn't appreciate being \"doubted\" like that. We decided that next time, he'll just walk his sick-self down to your establishment and infect all the staff and guests with his sickness, since that apparently is preferable..",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KKxzg6clJk5aFacOMmAF9A"
  },
  "0-jLBXVLTGlMHfQzF5HlBA": {
    "date": "12/26/2016",
    "text": "Before moving to Phoenix, I stayed at the hotel while looking for places to live. My mom and I went to the restaurant and were very impressed and found the La Peruana salad delicious! After I moved I was wanting the salad again for dinner so I placed an order for pick up. When I got home I noticed the salad was more like a side salad than an entree. In addition they forgot to add my shrimp which was a $7 add on. I called the restaurant to let them know and they apologized and told me they would refund my money which never showed up in my bank account. I decided to give them another shot and ordered the same salad through UberEATS. Again, ingredients are missing and so is half of my salad. It definitely was not worth the $12. I'm disappointed that they think this is acceptable service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ElQ5g8Dlar7LNjN0fwSt-A"
  },
  "vo9v2f1FwgT-H17awlhnaw": {
    "date": "9/27/2016",
    "text": "We ordered the Torta and a few Tacos. The torta was great, but the taco size for $4 per taco was way too small! Totally not worth the price per taco! The beans tasted all canned! When this place was Gallo Blanco, it had awesome food and service! We used to love this restaurant when it was Gallo Blanco. Will not come here again! Sad that the change in the restaurant name brought the quality way down! The service on a Monday evening was very slow and poor",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "PV8l9GZ54IPF6Fd4Q0y6_w"
  },
  "GQdf0fYT55qr-PKmxuae8w": {
    "date": "3/13/2015",
    "text": "Save your time! Save your money! Save your eyes and save your palette! Be sure to bring good company, because that is the only way you'll endure the understaffed poor service, mediocre food and completely mismatched decor/styling of this restaurant.  Cut your check in half and get better food and service by visiting a \"-Bertos\" restaurant. I will not be visiting this place again anytime soon nor would I recommend it.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "t4njL9Hw8rZkuF3yKi-Y9w"
  },
  "xUi8W3qmK5Xko_n8n3U8zg": {
    "date": "4/18/2015",
    "text": "This place is absolutely AMAZING!! The food is 5 stars and the Margaritas are out of this world! Make sure you put this place on your list to visit. Haven't been for brunch yet but I've heard great things!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "4ibWvkUZgG4ECWRr0_IbCQ"
  },
  "xdhw3fteqMgg4_RUyszd6A": {
    "date": "3/20/2016",
    "text": "Over priced for what you get and every single one of the staff that came to my table complained about the other staff or having worked a long night before.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gSWCTivUaWagPmMbpMEYUw"
  },
  "Ev6kh98wSukBZdbWO57UxA": {
    "date": "11/18/2015",
    "text": "We ate here about 5-6 times on our last visit to Phoenix.    Amazing well priced food, so fresh and authentic.  The salsas were some of the best we've had!  Drinks were incredible too!   The service was what really made this a five star.  I think Pedro was the exceptional one in all of our visits.  Thanks so much.  GO here!  you won't be let down.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "x-c62KllGyVKfSKmoKRCWw"
  },
  "Olozr-VqLK-ymlUzkkjy3g": {
    "date": "3/27/2015",
    "text": "I used to frequent Gallo Blanco until I moved away from Downtown. I was in the area and was so excited to come back and was disappointed when I walked in about realized it had changed. We stayed anyway and the disappointment never changed. I missed the old guac, the tacos were mediocre (some of the shrimp tacos had ONE shrimp) and the sangria was only ok. On a positive note the server was excellent. This place used to be packed, but this time it was pretty empty on a Friday night and I completely understand why.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "dKYLVJ48zMEN0AeE54rV4Q"
  },
  "pZdiYyO1OlezGZ02M2Lt6w": {
    "date": "10/18/2015",
    "text": "I'm giving 4 stars as a guest of the hotel. As far as restaurants attached to little hotels go, couldn't ask for much more. Ate there twice for breakfast and once for dinner, and found it affordable and tasty enough. The breakfast voucher totally covered my breakfast cost, and they give you one for each person in the room. $12.50 was totally enough per person. Patio seems very dog friendly. We also had drinks from the bar at night, totally satisfied. It's adorable, and the only criticism on that would be definitely trying too hard to hit all the \"hip\" points, becoming almost a parody. Whoever designed this hotel and restaurant has my vote to develop Hipster Disneyland - someone obviously created this place with a \"how to attract millenials\" handbook in their left hand. While definitely immediately noticing I was being heavily pandered to, I'd also say it was lovely. Servers seem incredibly stressed out, and forget little things. While I'm usually easily annoyed at that, it's clear its not the servers faults and this place is just getting started with their procedures and getting the flow of this place down. I would totally recommend this hotel and restaurant combo to friends.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lkd5OBWufyHeU-h1ziIWIw",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. View from the patio seating",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lkd5OBWufyHeU-h1ziIWIw/o.jpg"
      }
    ],
    "user_id": "07S59PQYirCY9ylQbCygoQ"
  },
  "eygasKz5q19uQOsn3JHbxA": {
    "date": "4/17/2017",
    "text": "A friend decided to buy us dinner, tacos, from here and have it delivered...1 block away.  I was looking forward to it, and I can't say that it Impressed me.  I didn't know you could get tacos, beans and rice served in a \"tossed salad\" container, because that is what we both got.  it was all mashed to one side of the container.  Chips came with it, so we decided to use them and scoop out the dinner.  The chips were stale, the food cold, and wondered how long it had sat on the counter, because the beans had already \"set up\".  I won't be suggesting them again, and definitely not for take out.  it was about 40 dollars for what I guess was 4 tacos, two sides of beans and rice, and the dog wouldn't even eat it...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dcps8piPZClp5frw4gZoyQ"
  },
  "m7qF7bcGHbT9k-GZ2zr-VA": {
    "date": "7/25/2015",
    "text": "We love sitting at the bar, having a drink, and some chips and salsa at Tranquilo. This is made even better by the very attentive bartender Matt. He is one of the engaging, responsive bartenders I know. He is the main reason we like hanging out at the  Tranquilo bar and the reason we will keep coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "S4WrYGniAUOtqX4V7LwwVQ"
  },
  "93dSxmbCH74-Wn4a8YP7EA": {
    "date": "1/6/2016",
    "text": "Came here on a weeknight for a few drinks after an interview. Didn't try their food, but the bartender made some great local beer suggestions and I was able to take half of my beer in a to-go cup up to my room at the attached Clarendon when I got tired of sitting there. They had plenty of TVs playing sports, and actually also had a jazz band playing Pink Floyd covers which was pretty unique. The Clarendon provides gift certificates for Cafe Tranquilo's breakfast menu if you stay there, though like I said, I didn't eat anything (although everyone else's orders looked tasty).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R2sa4F-vbcIL-1LoNwZ1vw"
  },
  "y0cIP3kxdOzW1RLrRgfnZw": {
    "date": "8/27/2016",
    "text": "This place is amazing!!  My wife and I wanted to get away from the annoying children to get some R&R.  Needless to say, the bar scene was great!  Our bartender, Jeffery, was awesome!   It's great to know a fellow Southerner, but his customer service skills were awesome.  He was very punctual with our wine refills.   But, even more, his craft cocktails were phenomenal!   I will definitely be back again!   Well done, Clarendon!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1QIjy-BCyniX9y1wxHNsHA"
  },
  "AAJwifAXNt0Dex2Qf60C2g": {
    "date": "2/20/2015",
    "text": "We were just at Gallo Blanco a month ago and, as always, enjoyed the food. My husband and I went in today and did not realize that this place was a different restaurant. There had been ongoing construction for a while to revamp the place so I figured that's why is was slightly different when we walked in. It wasn't until our snooty waiter told us it was now Cafe Tranquilo and looked flustered when we were caught off guard. Our beers took forever to get to our table and when my husband's burrito arrived it was tiny! My pork belly taco was dry, the fish taco was yummy. I left feeling sad because we absolutely loved Gallo Blanco. It was our go to spot when we wanted tasty carne asada. We will not be going back. Gallo Blanco RIP :,(",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "KE42YiraseZqgoXfBUMSRQ"
  },
  "wiBhw9RQUvDRcZglzNHAKQ": {
    "date": "9/3/2015",
    "text": "I ate here on a Tuesday night while on a last minute staycation (our power was out for 24 hours due to a monsoon storm).  The best part about this place is the ambiance.  Music and lighting was really chill, would be a great place to meet a friend for dinner and/or catching up over drinks and dessert.  I sat at the bar (dined alone), ordered a taco and half order of posole.  The service was perfect.  I even had the opportunity to charge the dinner to my room which was very convenient.  The taco was really tasty and I'd come back for that, but the posole was just ok for me.  It wasn't the best I've had in Phoenix.  The broth, hominy, side ingredients were good but the pork was kind of terrible. It was cubes of hard pork. I'd rather have no pork than weird cubed pork. I'm thinking maybe they throw that in last, like when you order pho?  Either way, I'll be back and maybe just pass on the posole and definitely get tacos and a beer.  Also, I ran into some friends who were having a beer at the bar.  Super fun to have a local hotel restaurant/bar that is awesome enough that the locals hang out there too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "le_aqblZJsCDOmapuOZbiw"
  },
  "d3_Nk8vbTKnh7OdM5Z9QJA": {
    "date": "3/3/2015",
    "text": "Totally impressed. The papas fritas were amazing. Had a good kick to it with the pickled jalapenos.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "smh0QdZOAyKFphK0xTzaHQ"
  },
  "42f1LLibzFJ5u3lcJhy5iQ": {
    "date": "3/20/2015",
    "text": "Cafe Tranqilo is fantastic.  All the staffers were pleasantly sweet and personable.  The foods superb, for those not from Phoenix.  I was very impressed at there authentic Mexican style fusion.  Just so you know I have never had Gallo but I'm sure it would have been great.  I believe in giving this restaurant a try,  not too many restaurants around Clarendon Hotel.  Loved there Guacamole and Chorizos.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "FT3wQTkwIZ6U4hF3Fg6MBQ"
  },
  "jjvkTpoorPWIdcaJce9AWQ": {
    "date": "2/23/2016",
    "text": "My family stayed overnight at the Clarendon this past Sunday and ended up eating both breakfast & dinner here. Tranquilo is excellent!!! All of the ingredients are fresh and the chefs know how to cook them. At dinner our server was Pedro and he was chipper, friendly and knowledgeable. He even knew what we were asking for when we asked him if we could get some Chiles Toreados (toasted jalapenos) on the side with a bit of beans & rice. Getting the special side was easy and the kitchen staff/cooks made the jalapenos just the way we like them. For my meal I ordered the Steak Special: 100% grass fed Rib Eye Steak (medium rare) w/Chimichurri sauce on top of grilled vegetables, served in a skillet. The meat was tasty and easy to slice into (like butter) and not over cooked, the vegetables were also cooked perfectly tasty and still slightly crisp. The sauce was merely an accent and not over powering at all.  My mom ordered the Chicken Mole and again it was cooked perfectly, juicy not dry and the mole sauce was spicy and not overly sweet like most. My aunt ordered the Fish Special, Salmon over vegetables. Again the salmon was cooked to perfection, slightly crispy on the outside, done on the inside but not dry at all. The vegetables were great as well.  Since we all finished our entire meals, we sadly had no room for desert. We also had Breakfast here as our room came with a $12.50 voucher for each person. There is no complimentary coffee in the lobby but you can purchase coffee or tea to go for $3.00 plus tax. The coffee and black tea were both quality, my mother and I are kind of picky about both. For breakfast I ordered the Chilaquiles with Chorizo instead of the listed Chicken or Vegetables, the Chilaquile sauce with the Chorizo made this dish the favorite of the morning. Rich with some spice but not overpowering, I could still taste the egg, chips and Oaxaxa cheese. My aunt had Eggs & Chorizo with beans and my Mom had the Huevos Rancheros served in a skillet both were very tasty with just enough spice. I also ordered the Greek Yogurt & Quinoa granola (to feel a little bit healthy), definitely worth going over my voucher amount. The fruit was freshly cut and the yogurt was soooo creamy. Our server at breakfast was named Fuego (obviously a nickname :), cheery and attentive.  As for bar drinks they were good but if I lived locally, I would probably get drinks elsewhere before hand (or after) and come here for the excellent food, vibe and service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "rzPao45npweNm2pHns-jZA"
  },
  "MWEVtZcTupXd_Ya6Rr_vqQ": {
    "date": "4/25/2015",
    "text": "Went for dinner while staying at the hotel. Good food and service! Everything was delicious and it was fast. Our server was attentive and friendly. Then back for breakfast! The breakfast was amazing! Delicious and made to order. As guests of the hotel it was completely free! Our check was $27 and it was completely covered.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "tjaEr6OZQbYoWozV7Ut6OQ",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Egg whites, spinach, and fresh sautéed mushrooms",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tjaEr6OZQbYoWozV7Ut6OQ/o.jpg"
      },
      {
        "img_id": "zlppMHj7w9mAsm8bwSN7Og",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Gringo breakfast",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zlppMHj7w9mAsm8bwSN7Og/o.jpg"
      },
      {
        "img_id": "m4NholJVausu03JTTPSkHg",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Fruit con crema",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/m4NholJVausu03JTTPSkHg/o.jpg"
      }
    ],
    "user_id": "XyMJGeKoQd6ZOMO0x86k8A"
  },
  "KQfGLdB6bUhcN1X2SDk9yw": {
    "date": "2/7/2016",
    "text": "One of our favorite places to hang out and have some fabulous food. Try the Pork Mole! You won't be sorry.  The fish tacos are the best I've ever had. The elote and guacamole are favorites as well. The service is great! Everyone helps out and makes you feel like you are their only patron.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "q-iLLSN-PLuQFM6FjR_IwA"
  },
  "hzsZXM-v2FnVyjjhEBYDkA": {
    "date": "1/19/2016",
    "text": "The taco plate is awesome! The service is terrific and the ambiance is very nice. This is my favorite place to chat with a friend, celebrate a coworker or just to have a treat.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "0xUJ54dIGd7xlZy_-2jMvA"
  },
  "b8BvWPkn_SpoXFpd2DJTcw": {
    "date": "8/26/2017",
    "text": "Inaccurate web description. Only offers discount tacos on Tuesdays. Tacos were too overpriced and charged for chips and salsa and didn't have a great Mexican beer selection. It's was okay to try once I guess...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hQAVub19SXbpqJLGHt-8vg"
  },
  "xjXRWuAFdpM8V2gaHrLgMQ": {
    "date": "3/5/2016",
    "text": "Jacob, the waiter,is wonderful!  So friendly and relaxed.  For additional options, he volunteered the brunch menu during the dinner hour, recommended a yummy wine, and told us about a complimentary cocktail on the roof during sunset.  Thank you Jacob!  What a lovely evening!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "TJ4UGAIC7g8kF4hXSCYMJg"
  },
  "4m0qsvRT2sssUXJZvIF9NQ": {
    "date": "2/19/2016",
    "text": "You'd think with food vouchers, you'd get the run-of-the-mill continental breakfast with generic danishes and cold coffee... nope! The free breakfast vouchers covered a great variety of items on the menu and the food was delicious. They sure were busy, but the staff was still very friendly and attentive. Great experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "TVI9-hPUn6zTuhYPAlipXQ"
  },
  "pvLbxctCuufxcJgpqxRKhQ": {
    "date": "3/29/2017",
    "text": "This place is always so nice to come to! Tommy, the manager and event coordinator, as well as Falyn, our favorite bartender, are just the sweetest. My boyfriend and I live very close and come here often. You can't beat the fresh, local ingredients and the welcoming atmosphere. I highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "MJf-fyOCeHBMp7DDAiGm7A"
  },
  "-7ndTKd548uAgJL_N5efTw": {
    "date": "5/26/2015",
    "text": "Okay, okay... It's not Gallo anymore.. I was heartbroken, too.   I had my reservations about going here, due to the spotty reviews and everyone saying it just wasn't the same...   It isn't the same.. However, it wasn't awful. The main thing I miss about Gallo was the shrimp and grits, and the fried cheese thing, but hey, I can burn cheese in a pan at home. So out with the old, and in with the new.   Downside: The bar area with the black walls, DEPRESSING. Put some artwork up, it's a bar, not a funeral. Also, the bar tender could try to smile once in a while, if your job is that awful man, don't do it.   Upside: The fish torta, my new favorite, and I really love the El Jefe, so grumpy pants bartending gets a few extra points because that drink is outstanding...   So give Tranquilo a whirl!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hio3CC9VhW6YvTDcO5q0lQ"
  },
  "b8zWIPc4i56MyloRKUzd3g": {
    "date": "5/1/2016",
    "text": "This was a completely gratifying experience. Everyone at the hotel was very nice, and the room exceeded our expectations. We also ate at the cafe, and the meal was delicious (breakfast). Chris and Jacob had stellar service and greeted us with a smile. Jacob also brought us an horchata creamer for our coffee, and although I usually prefer my coffee black, this was an excellent suggestion!  Thank you cafe tranquility and hotel Clarendon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KQLiJ9345KefjWPFu3fQLA"
  },
  "r7OnigRWlpLGXqPMTZDkwQ": {
    "date": "1/23/2016",
    "text": "So happy to finally check out the Clarendon's restaurant re-vamp. The Huevos Rancheros were delicious. Definitely order a beverage that includes their fresh-squeezed OJ! Jake was a rockstar!!! Will most certainly be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pw4xPBqlJSZYiVPFf0yGmw"
  },
  "lVumyrrz1TzEcl1a3X-LBQ": {
    "date": "1/24/2016",
    "text": "Amazing!! Our sweet waiter Jake made a wonderful recommendation on breakfast that was to die for! It was pork and veggie  chilaquiles. Great food and service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "olI-Wj19tI7dQGnjsNgHPQ"
  },
  "Aw_nQutK0NgFdxGQ2xba9g": {
    "date": "4/7/2016",
    "text": "Fallon is 100% hands down the best bar tender. Attentive to our every need, polite & beautiful. Doesn't get much better than this!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kkX64rFCdzD4vDIdinG24Q",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Fallon is by far the best bartender!!! The most attentive, beautiful &amp;amp; considerate person we&amp;#39;ve come across in a very long time!!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kkX64rFCdzD4vDIdinG24Q/o.jpg"
      }
    ],
    "user_id": "5Re5sHyRxc8y-MlH4OCzRQ"
  },
  "aQfS1dB5eUzTAQbN9-u8kA": {
    "date": "4/4/2016",
    "text": "Been here for dinner had great tacos salsa is bomb. Cool clean atmosphere great for happy hour  or a date also if your at the pool they will bring it out to you. Decently prices for what your getting . This hotel and resturaunt is a great GEM of downtown",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UnHgzkveAHjZEYT5MWHu2A"
  },
  "pq-4LGT5GIsLEnYpt4vAkA": {
    "date": "12/11/2015",
    "text": "I came here last year when it was Gallo Blanco. I was in town for business and came back three times that week. Unfortunately, I won't go out of my way to come back. Aside from a flavorful salsa verde, my carne asana burro lacked the robust flavor profile I was addicted to under previous guidance. Many of the dishes look the same, but the flavor has left the building.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Dnj3HTsYG9o6SxH7oha2A"
  },
  "-l4labDY2UrfelDAoUld2w": {
    "date": "5/15/2015",
    "text": "You will never have a better breakfast burrito! Their food is amazing. Seriously. I stayed at the hotel attached to it for over a week, so I tried almost everything on the menu. The prices are very good & everything is freshly prepared and just so delicious. All of the tacos, the burritos and the entrees are simply wonderful.   I wish vegetarians would eat steak just so they could try the steak burritos here. Unreal.   After drinking their freshly squeezed orange juice every day I don't think I can drink regular orange juice ever again. The coffee was wonderful too!   Their staff is really friendly and they're accomodating to whatever requests you may have.   Overall: very clean, excellent service, and amazing food& cocktails at great prices! Please give this place a try",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XUhx4VJwaix3Jra--OsLog"
  },
  "Uz0J4L_7Ra8YA36nxXK4lg": {
    "date": "7/14/2017",
    "text": "<a href=\"/redir?url=http%3A%2F%2FBOMB.com&s=ac71b33d32e90570e9c0d70edf9b4cac5f20e98e10501794c62801370f5dd3f7\" target=\"_blank\" rel=\"nofollow\">BOMB.com</a> this is our go-to restaurant when we're not sure what we're craving. Great drinks, food and ambiance. I will say I was a little sad when they started using canned corn instead of fresh corn for the elote app. It makes a big difference!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oDUGMTm9IxBjMGJivj_hjw"
  },
  "AahHC8eBmeZcmDaD742CCQ": {
    "date": "5/14/2016",
    "text": "Very cool place with patio and nice indoor dining. Very friendly staff. Happy hour pricing was nice. We had the guacamole, which was very good, chips and salsa, which were very good and the Peruvian Ceviche, which was disappointing. Even with the happy hour price, the 1 thumb sized piece of fish with a couple other fingernail piece sized fish in there, it was not worth the money. It was not that tasty either and I've had ceviche in Peru and many Latin American countries. I just didn't have much flavor and the portion was sad. Anyway, presentation was nice but that's all we had. I would go back to try other dishes for sure.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "He1eoJZhjG3eNMNqPuHfQw"
  },
  "4Ofs3udTHUwSczfsk7u7YA": {
    "date": "12/13/2016",
    "text": "This is well situated for hotels in the midtown area. We were greeted in a friendly manner and our server, Jacob, was both entertaining and helpful with suggestions. The margaritas were great - not overly sweet, the chips and salsas and our main dishes all delicious.  Portions are large so bring an appetite.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Q26BLbCJDEU-VJXmSsXf1g"
  },
  "hCV82ENlBAXaN8cyxzdgaQ": {
    "date": "6/19/2017",
    "text": "My sister, niece, and I were really excited to try this before I flew back home. Unfortunately, we didn't get that chance. Took a few minutes to be recognized and then when our name was taken, the people after us (with a similar party size) were seated before us. Waited about 10 minutes before a server, who honestly seemed rather out of it, seated us. She said she'd be back with menus and silverware. She never returned. Everywhere around us was hustling and bustling. We saw her, with menus in hand, go to other tables and into the kitchen. Many other servers passed us by. My sister even made eye contact with her to try to get her attention and she looked right at us and then walked back into the kitchen. We honestly felt invisible. After waiting about 15 minutes, after about another 10 minute wait despite there being visibly open tables, we left. At that point, we were starving and I had to get to the airport. Super disappointed but also really rude/unprofessional. I saw her on the way out and let her know we were leaving so feel free to give our table to someone else. She didn't even apologize she just stared at me and mumbled \"ok bye.\" What the heck?",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8H7X71JHz6_mn9-PQf8xcA"
  },
  "NeE2v5UDJZFjBRfu-_4yDA": {
    "date": "11/20/2018",
    "text": "Best tacos  chips and guacamole! Ordered it to go to take to the rooftop there. Best rooftop view I've seen in downtown Phoenix. The weather was perfect  The staff was helpful and courteous. The meeting we had was productive. I suppose if you're on the rooftop bar level and needing to use a restroom then it's a little inconvenient to go down the elevator but not a big deal. Lots of seating areas for small or large groups and self serve water available at the bar was convenient. I enjoy the kitschy eclectic decor. While I was there they were hosting a silent auction in the lobby with various art pieces. I also learned a bit about some of the local history of the place which was interesting. Be sure to notice the statue bust in the lobby to learn more on that. It's worth repeating but I'm not repeating it here because I want everyone to go visit and learn it. Haven't been to the spa yet but I think I'd enjoy it! Putting that on my things to do list",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "S6bCgEGEjRMB9tkiIG5xyA",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/S6bCgEGEjRMB9tkiIG5xyA/o.jpg"
      },
      {
        "img_id": "eqAh3Ejped5bwKzhVcufAQ",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eqAh3Ejped5bwKzhVcufAQ/o.jpg"
      },
      {
        "img_id": "-gnuyCChRKXiKDnLomOpUw",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-gnuyCChRKXiKDnLomOpUw/o.jpg"
      }
    ],
    "user_id": "e9Mgh_gg9otmZOqX2X7_sw"
  },
  "SsvuYJ5awHLld2sMehr1Rw": {
    "date": "10/24/2018",
    "text": "(Review is for the bar area)Good place to go watch a game or go relax after work. Good drinks and happy hour food specials. I believe the name fits this place perfectly very relaxed ambiance and super friendly staff",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "RIm5Xpu7MKciGEJ_fLdr5g"
  },
  "M7OVQa05935RPKWKIC4r9Q": {
    "date": "8/27/2017",
    "text": "In the beginning, I really enjoyed Tranquilo Cafe.  It was everything you want from an up and coming restaurant but now things have changed.   My husband and I decided to enjoy a Saturday evening happy hour before going to the movies.    Tranquilo Cafe was the place to go for an amazing happy hour, not any more.    The drink menu was margaritas (standard), selected wines and beers.  Now the drink menu has gotten a lot shorter, scarce and more $$.   The food selection was about ten appetizers that were  half price on the happy hour menu.   Now the food selection has shrinked... Oh My!   The kicker is the TACOS... They were half off but now they only serve the tacos half price on Tuesday!  To some people this isn't a big deal but to people who make happy hour a seque to dinner, this is a huge deal.   When customer service was excellent and now I'm sitting at a table holding a menu for 20 mins before someone even noticed I didn't order.    That's a PROBLEM....  Most restaurants know a way to your customers heart is to  keep True to roots and maintain the quality of EXCELLENCE you started with! Not to dminish the quality and then ask for more money$$$!   WE, THE CONSUMERS MAKE RESTAURANTS, RESTAURANTS!",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 7,
      "cool": 5
    },
    "photos": [],
    "user_id": "Rp1_suVRaH7Fha0RsT9u5Q"
  },
  "-01-AkRlxZi7rDQf-y732g": {
    "date": "4/18/2018",
    "text": "I love love LOVE their shrimp tacos! I do grilled but the fried is delicious too. The service is always amazing and the staff are super friendly. It's located in a hotel so the vibe is always laidback with unique and fun people coming in and out.   I seriously love this spot! Plus they have Happy Hour ($2 tacos) EVERYDAY 11-7pm!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "GP_gJRKN6si02SkUAbKSQw"
  },
  "aBHkRWKHxSYcz2hllHD3Uw": {
    "date": "6/21/2017",
    "text": "Cafe Tranquilo was the place picked for May's International Supper Club UYE, we were headed there to try out there happy hour menu, and I have been back since then too!   The Happy Hour Menu is 7 days a week from 3pm to 7pm, and has $2 tacos! Hello!! It doesn't even have to be Taco Tuesday to get $2 tacos! Oh sweet!  This review is for the few times I have been.  Ordered the Elote Esquite for starters, its Mexican street style corn off the cob with ancho peppers and cotija cheese seared on cast iron skillet, it also comes with chips & a trio of salsa. This elote corn dip was delish and gone before we knew it, can't wait to go back for more!  The Tacos! They are like street tacos  and have homemade taco shells and I have tried the following:  The taco special was a pork belly with habanero mango, to me, this was one was ok; I was expecting more of a sweet kick with it being habanero mango, so it was little on the mild side.  Had a fish taco and its Tecate beer battered white fish and it was a pretty tasty taco  Of course I had to have a carne asada taco, it's a chimichurri ribeye steak, and this too was a good tasting taco! Yum!  My favorite taco, which surprised me was the veggie taco, it has a sweet potato mash as the base and seasonal veggies, this time it was onions & mushrooms, so delsih! I need to order more soon!  If you find yourself lookin for some great grub during Happy Hour, go give Cafe Tranquilo a try!",
    "rating": 4,
    "rated": {
      "funny": 12,
      "useful": 19,
      "cool": 18
    },
    "photos": [
      {
        "img_id": "fOy_LgyCGudaXAOhY99Ahg",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fOy_LgyCGudaXAOhY99Ahg/o.jpg"
      },
      {
        "img_id": "uDyzNOotuduBlBGUYNwmZQ",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uDyzNOotuduBlBGUYNwmZQ/o.jpg"
      },
      {
        "img_id": "B94WIfQ02DBkJEnxnD4PNA",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/B94WIfQ02DBkJEnxnD4PNA/o.jpg"
      }
    ],
    "user_id": "bpgbVPJcG-wQ4cNBcPPIxw"
  },
  "e_0tIrYl26nY8dnj8vXpYQ": {
    "date": "5/5/2018",
    "text": "Tranquilo is definitely a tranquil, peaceful and trendy spot inside The Clarendon Hotel. With a favorable happy hour menu until 7pm that serves up $2 grilled shrimp tacos and $5 margaritas you are in for a fun inexpensive time. Friendly, attentive, quick service are pleasing factors when dining out and this spot offers it all while maintaining its chic trendy vibes. I would definitely want to go back to try more of their delicious artfully crafted street tacos like the shredded beef deshebrada marinated in Mexican coke, chili rojo, garlic and chipotle crema. Muy delicioso!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jtFXIKnB70M5S8A8rDxFpQ",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jtFXIKnB70M5S8A8rDxFpQ/o.jpg"
      },
      {
        "img_id": "l37hhvE4VEJFpTTeoQoYcA",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/l37hhvE4VEJFpTTeoQoYcA/o.jpg"
      }
    ],
    "user_id": "AbVdT3VAgGKhaH7XTi8iew"
  },
  "z2LXY3q_NrDGjY-xMjuxaQ": {
    "date": "5/3/2018",
    "text": "Great food and a fun atmosphere. This restaurant is located inside the Clarendon Hotel which is a wonderful place to stay. It's an extremely unique hotel with a great ambiance.  I love this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "G7dt3Iez6eACWxGLjzegKg",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/G7dt3Iez6eACWxGLjzegKg/o.jpg"
      },
      {
        "img_id": "tlHh1qbEX7_oJdqZPJ8a9A",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tlHh1qbEX7_oJdqZPJ8a9A/o.jpg"
      },
      {
        "img_id": "XpOCYebp419ibY2f4fyVqg",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XpOCYebp419ibY2f4fyVqg/o.jpg"
      }
    ],
    "user_id": "CG1LBeZIp35fy0x91SUN6g"
  },
  "rfhqJcyr9Xm43oD9tA_SPw": {
    "date": "2/24/2018",
    "text": "I came here on a Monday night with some girl friends and was pleasantly surprised at their promotions! They had inexpensive margaritas and $2 tacos. I think they have this promotion throughout other days of the week but I cannot remember... sorry!  The tacos were good with the promotion, but I wouldn't want to pay more as the taste is not that great. The drinks are strong, I'll give them that. We also had Guacamole for the table with chips and that was alright.   I checked in on yelp and was presented with a discount. When the check was dropped I showed it to our server and she said she had never seen it before and had to consult her manager. They discounted the check but the demeanor she had was that she was annoyed.  Overall service was good and the location is very convenient for my friends and I to meet at. The food though wasn't so good that I would go out of my way to come to this location though.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DGR6BUVAm8jW7zxdmEQ7DQ"
  },
  "1e_YCum_mIXKywyWt_x16g": {
    "date": "4/29/2019",
    "text": "Decided to grab a bite to eat while staying at the hotel. The cactus fries were good app to start with, something light and flavorful. Ordered a couple of tacos, and I definitely recommend the fish tacos(get them crispy).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q58tr-wzmLpjZSkcXsFR4Q"
  },
  "RBhnQrUpo9bsT_DuCfvEBA": {
    "date": "2/11/2019",
    "text": "Really good! My gf and I ate here and we're so excited we did! The atmosphere was very chill and relaxing., the food was really good and authentic. The salsa and chips were really good, especially the green salsa. We'll be back.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "hkGmRnz5vCx7Mbnepu-O3w",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hkGmRnz5vCx7Mbnepu-O3w/o.jpg"
      }
    ],
    "user_id": "qA7xdJJQ4M8PP7OK9woM9g"
  },
  "VFv-P9Eo6w8bOYrttxyNqA": {
    "date": "3/13/2019",
    "text": "Awesome food, good service, not too expensive - We walked over from the Hilton Garden Inn...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "M85bGSz-xsi3880zMXAA4A"
  },
  "oUXbFPKhrSkQ9BajVOHymA": {
    "date": "7/6/2019",
    "text": "We asked for a table for 5 and were told by the hostess it was about a 30-45 min wait to sit inside but there were tables available. But after waiting about 5-10 mins we got a table inside. After being sat, no one came over to the table until we flagged down a waiter to put in some drinks. A friend had ordered a drink and didn't get the drink he ordered. The ceviche appetizer is pretty good, tacos were nothing special. We also asked for separate checks and we all got different items on our checks from what we ordered. We did not ask to have it changed since the items were a dollar or more than the item we ordered but at this point we just wanted to pay and head out.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WZE1iYz6lgxl4HRW2wN2Cw"
  },
  "GJHOQ_42yk9ZJ6ZtRepuSw": {
    "date": "2/28/2017",
    "text": "On a random Tuesday, I stopped by Tranquilo for a lunch with a coworker. They have a special for the month of February - $2 tacos all day! Score! I ordered three and my coworker got five (they are small tacos and he's a big dude haha). I had a shrimp taco, carne asada taco, and a pork taco. He ordered two carne asada tacos, a shrimp taco, fish taco and a veggie taco. I wish I had better things to say about Cafe Tranquilo... but the food was not impressive. The restaurant itself was cute but nothing spectacular, and overall not worth the visit.  Out of the 5 varieties of tacos we ordered, the only ones we actually liked were shrimp, fish and veggie. The carne asada tacos were bland and the pork taco was also lacking in flavor, and even worse, it was soggy! The shrimp and fish tacos were flavorful due to chipotle aioli and fancy crema, but without these sauces I don't think the tacos would be any good.  There are far too many great Mexican restaurants in Phoenix to eat mediocre tacos. I won't return.  + avocado salsa very tasty + $2/taco all month long (Feb.2017) + shrimp and fish tacos were good - chips and salsa are not complementary - no spicy salsa or hot sauce available - carne asada and pork tacos were meh",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "G8gXflOP7ZqHZuh5HiKByQ",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Shrimp, fish, carne asada, and veggie tacos",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/G8gXflOP7ZqHZuh5HiKByQ/o.jpg"
      },
      {
        "img_id": "M40kmfr7LjTVm19PRndZVw",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Shrimp, carne asada, and pork tacos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/M40kmfr7LjTVm19PRndZVw/o.jpg"
      }
    ],
    "user_id": "105tIg6brHiGDBXuGbbizA"
  },
  "-HVZxpu2dGNl0Ty7jC9W2w": {
    "date": "12/10/2016",
    "text": "I almost feel like writing this review might be unfair.  I literally feel like family here.  I started coming here some time in 2015.  Fell in love with the awesome pancakes and started coming more regularly to enjoy pancakes and tacos.  But some where in the year, I started inviting friends to meet me on the roof top for cocktails, or when I scored a pool pass, I would invite friends to join me at the pool to hang out and eat food, or I would bring my laptop and sip coffee and work.    I've never been to a more welcoming establishment!  The one thing I will say about Cafe Tranquilo, and the Clarendon, in general, is that the staff goes above and beyond to give you the most amazing service possible. I could list so many instances in which their service was simply amazing, I will share 2.  My A/C broke last year.  I wasn't sure that it would be repaired that night.  I called and stopped by the front desk to see if they had rooms, explained I wanted to give the repair guys a little longer, but I might be back.  An hour later, I get a phone call from the Claredon's front desk asking if I was ok, and did I still want to come back.  I was shocked that they would take the time to call!  Fortunately, that night, the A/C guys had just notified me that they were about to switch my AC back on.    I stopped in recently, and this inspired my review update....  I pull out my laptop to work in the lounge.  My server, Falyn, stops by to take my food order.  I say... \"Hmmm, I saw some one with cheese fries and chorizo the other day, I could go for something like that...\". Falyn simply said, \"if we have the ingredients, we can make it, no worries!  I'll bring that right out.  want anything else on it like sour cream?\".  Oh, and it was so delicious... so guilt-inducing delicious.  Those fries were the most amazing comfort food.    I'm sorry folks, but I go to a lot of restaurants, I co-host a supper club for Pete's sake, and it is rare that you find a restaurant that will go off script/menu for you like this!  Rare to find a hotel that will personally phone you, when you haven't actually confirmed a reservation, to let you know they were holding a room for you just in case.  Oh the JOY!  Return Factor:110% I love this place",
    "rating": 5,
    "rated": {
      "funny": 11,
      "useful": 14,
      "cool": 16
    },
    "photos": [
      {
        "img_id": "AUVLhby7j3pk79KZSqrsDg",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. my custom order of Chorizo Fries.  So Yummy! Perfect comfort food",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AUVLhby7j3pk79KZSqrsDg/o.jpg"
      }
    ],
    "user_id": "DHQWSHz6b7Jsy-A04m1cIA"
  },
  "pm0B67jeQIl5qqKwPm-lbg": {
    "date": "3/30/2019",
    "text": "Exceptional service from our server. Food was more than delicious. I love that a lot of their food is sourced from local areas. I will definitely eat here again when I'm in the area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0G_CV2Y1e58XXz1WXlv4og",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Granola bowl and chilaquiles",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0G_CV2Y1e58XXz1WXlv4og/o.jpg"
      }
    ],
    "user_id": "-BnUZ7GNSMVTLH47kSD2ew"
  },
  "Fi8X_75-oPhKA_sJInnTJQ": {
    "date": "2/24/2019",
    "text": "Super good food and service. The entire experience was fantastic and I am all ready looking forward to my next meal here and my bill isn't even paid yet. Hahahahaha",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2jbVZAhYDdXJ58VqNvGYzg"
  },
  "dBRjPcHzDnSGi4fSu_2QDw": {
    "date": "3/29/2017",
    "text": "It's tricky writing a review of Cafe Tranquilo and not letting your personal feelings cloud your judgment.   You see, this particular spot previously housed a little place known as Gallo Blanco. The flavor of their tacos, particularly their carne asada, is forever burned in my memory. As a result, I have to remind myself to not compare these people to a place that no longer exists, at least not for the time being. It's simply just not fair.  With that out of the way, Cafe Tranquilo is a neat little hotel-based establishment that focuses on Latin-American cuisine. We stopped by one late afternoon to try some of their offerings. The place was empty for some odd reason - which was in stark contrast to the last time I was in this same dining room three years prior.  Their chips and salsa were excellent quality, with three variations being provided. Additionally, we ordered some tacos, including pollo, asada, pork, and fish. All were fine for what they were, although still not eh . . . never mind. Beans and rice were also all right.  Honestly, I don't know. Taco standards have significantly gone up in recent years to the point where I feel like I might have to return here and dive a little deeper into their menu to find out what they're all about.   It won't \"wow\" you - but it won't really make you wince either.  Give them a try at least - as I do feel they at least deserve a fair chance.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "TCPLaprJm4FFei2DkW6K6g"
  },
  "RNFeSyZEKkyhf2etFUJrBg": {
    "date": "9/12/2016",
    "text": "Had breakfast here. It was excellent so I am only giving my review based on that. We had the granola fruit bowl and a chilaquiles. Also had their delicious Lux coffee which is a coffee place around the corner. The coffee is sent as while beans to this restaurant where it is then grinded up for the freshest coffee. Pure heaven.  Moving onto the food. Hubby ordered the chilaquiles. Their chilaquiles was not only beautifully plated, it was delicious. Had a mixture of if chicken and fresh vegetables. The green salsa was prepared fresh. I had a butter and was blown away how good it was. I ordered the granola fruit bowl. It's a big parfait. Beautifully served in a big bowl. Fruits were freshly sliced and just the right amount of honey accented the bowl.  The best was Fuego our server. He is all positive vibes and was always in to of our coffee and water. He's the best.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "cdLW3gwKm7pk0_nv7c5vbQ",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Lux coffee is a medium to light roast. Freshly grinded beans at the restaurant. Lux roasters is around the corner from here.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cdLW3gwKm7pk0_nv7c5vbQ/o.jpg"
      },
      {
        "img_id": "7jFR7PliCr0CC5RJjY7jew",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Freshly cut up fruit, Greek yogurt, drizzle of honey and a dollop of fresh creme. Pure goodness.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7jFR7PliCr0CC5RJjY7jew/o.jpg"
      },
      {
        "img_id": "rOhw1JVHpE2U4XXb-0qyxQ",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Their chilaquiles was not only beautifully plated, it was delicious. Had a mixture of if chicken and fresh vegetables.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rOhw1JVHpE2U4XXb-0qyxQ/o.jpg"
      }
    ],
    "user_id": "jsp8h4yF3VI7_sk3EyvEIQ"
  },
  "9Vv-jwDjT2WhidPPi8YN6w": {
    "date": "2/1/2019",
    "text": "Earlier in the afternoon I had taken a tumble hiking and was pretty cut up so obviously a margarita was the only medicine I was searching for. Super excited to have drinks with a friend because the bar is adorable, I bounced inside and the experience was incredibly disappointing *cue heartbreak emoji here*.   After I didn't like my drink, I brought it back to the bartender full, and he charged me for a new one! I served in college and was shaken with this news. When a customer hasn't liked their food or drink, I FIXED IT. Then when I returned to my table the waitress told my friend and I that we had to leave because she needed our table. She didn't offer to move us, and she didn't ask if we could move- she told us. We were eating an appetizer at this table, It was so bizarre! \"Why you gotta be so mean?\" - Taylor Swift. What an unfriendly hotel restaurant. I would never invite any of these people to a birthday party. I'm usually pretty upbeat and funny in my Yelp reviews but this experience just made me sad.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qmxZRLA1oDRWa7_I7xGeCw"
  },
  "coPBj7jl9mHHUgexVaJ3Vg": {
    "date": "1/23/2019",
    "text": "The bar tender Raul was very nice and helpful. And the drinks were in point. Also they have 2 dollar tacos with happy hour and an awesome breakfast menu. I recommend the chilaquiles.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P0_qDNhyX92ffVnrFnVRVA"
  },
  "5UXsQIAVXi9znXZV6fnzOw": {
    "date": "8/2/2016",
    "text": "Visited the bar while staying here.  Bartenders were friendly and knowledgeable.  Both b-tenders managed the over-zealous aspiring rock star dude.  Drinks are priced like a 5 star resort @ about $8.00 each.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "N2OUdPlS9RQHjE3zB7dtQw"
  },
  "VXI4TDpUCCSanE4TxQ3itA": {
    "date": "10/14/2015",
    "text": "We ate here mostly because we were staying in the hotel and it was convenient and our breakfast was free. The first day I ordered the huevos rancheros which was AMAZING. They delivered me this warm, bubbling skillet, coated in melty cheese with fluffy eggs over corn tortillas. I gobbled up every bite and later, ordered a burrito poolside which they DELIVERED. During our stay we also had the guacamole, pancakes and vegetable tacos. The tacos were a little flavorless on their own, but they have this incredible salsa verde they serve on the side. I seriously wanted to bottle that and bring it home.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uzsUx0YAN4omzKb0gltY7w",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Huevos Rancheros",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uzsUx0YAN4omzKb0gltY7w/o.jpg"
      }
    ],
    "user_id": "-hNVwhu7tycOA5tBQCaYGQ"
  },
  "sZDKvbGWVEwDqkpSorSLTw": {
    "date": "6/3/2015",
    "text": "Delicious cocktails  & food. had the quinoa salad & guacamole. Also had the ceviche but I would recommend choosing another appetizer, the ceviche  was so bland we sent it back . Good service and friendly staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9odCxHCEzSEdlbYotW4-ng"
  },
  "57Hg_rnqzzPy7OnVoRnvaQ": {
    "date": "10/11/2015",
    "text": "There is no breakfast menu now, just a small brunch menu. It took 45 minutes to get our food. I hope this place stops going downhill.  But, our server was nice and let us know immediately when she realized her mistake.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8uGF17zf-fT8UMfr54Svkg"
  },
  "VQSYrTgFLfopHGaf6xD-XA": {
    "date": "9/4/2016",
    "text": "When I need good all around good new age Mexican food you come here. The bar has great drink selection.the service is spot on. If you are staying at the hotel here they give you breakfast vouchers. The breakfast was amazing every morning. I would get the pancakes and my friend would get the huevos   rancheros. Great location I would highly recommend it if you are staying here in Phoenix.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "F6acjmOqd4Gs6uD2dtRABQ"
  },
  "4R_qUEQCzJwV9AD27REqcQ": {
    "date": "4/21/2018",
    "text": "I have mixed opinions and experiences with this place, so I will average it out at 3 stars. I consistently like the food, the rooftop view is always amazing, and I love when they have live music. The customer service is what varies. Sometimes the staff is friendly and quick, but the last couple times have been subpar at best. First, it is really frustrating that not all of happy hour or the menu applies to the roof deck. Usually they are cool about letting you order downstairs and bringing it upstairs, but last time the bartender downstairs gave us a lot of attitude. He then also forced us to close our check, because he was leaving. As if that should dictate when we close out? That is not normal practice, and he was just fishing for a tip after being rude to us. Another recent time I went, our server dropped off menus and never came back, so after 20 minutes we just left. And it was not even busy. Thus, hit or miss here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o0bt-m8zqqg0M-E9xKq3-A"
  },
  "q8rWNPP588U5nbOdgYRVKg": {
    "date": "10/29/2017",
    "text": "Good food, good drinks. Was there for happy hour. Recommend mescal margaritas & mango glazed pork belly tacos.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1UnuAry1cl_16K48QUsTnA"
  },
  "bdCB400LWvkFFizlSEDMWQ": {
    "date": "7/25/2016",
    "text": "I work directly across from here and love going here during my lunch hour with co-workers. Great place and great neighbors!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7XC-uU55H_m-rPjPaUXuvg"
  },
  "AExORYJo94hLHP0NCfShaA": {
    "date": "2/16/2015",
    "text": "Located on 4th Ave just north of Osborn, Cafe Tranquilo is the Clarendon Hotel's restaurant (inside the old Gallo Blanco space).  The change in management/ownership was pretty recent--and sudden--but my family was in the mood for Mexican food so we decided to check it out.  Bottom line:  no, it's not the same as Gallo and I think they're still working out the kinks, but I'll be back.  We ordered chips and salsa to start.  The chips are thick and crispy and come with four different salsas.  The creamy avocado one was our favorite by far, but the green/tomatillo salsa was nice as well.  The spicy red salsa was OK but a bit too smoky in flavor; I thought it could use some citrus or something else to balance it out.  Pico de gallo was the last of the four and seemed like it had been made up a day before and didn't keep well; it was not much beyond what you'd get at a grocery store -- edible but nothing special.  We still inhaled a ton of chips and finished off most of the salsa, though.    For main dishes, I ordered three tacos: 1 chicken, 1 shrimp, and 1 grilled vegetable.  I thought all were good, but it would have been nice to get some lime wedges (or some of the red and green sauce bottles that Gallo used to have).  My mom ordered the Ensalada Peruana, and was underwhelmed.  To be fair, the first ingredient listed on the menu is quinoa, but it was too heavy on the quinoa and the vinaigrette wasn't really noticeable, making the dish kind of bland.  (I tried a bite and agreed with her.)  My brother ordered a cheeseburger and fries with horchata to drink and liked it all.  They didn't have a printed drink menu yet and only had about 4 or 5 mixed drinks to offer, but I'm sure that will be developed with time.  I'd also like to see more agua fresca options be offered in the future.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "g9LUvEAloT5BZNrvkqqAOw"
  },
  "NKZHewyV85j7t1Aeyd1-nw": {
    "date": "5/10/2016",
    "text": "Amazing Mexican food. We ordered a carne asada burrito and a bean and cheese burrito. The flavors of the meats and beans were delicious and the waiter was happy to bring us a variety of pico de gallo and other salsas. We are on the deck and enjoyed fantastic cool weather in the evening and the ability to talk about our day without interruption. This place is fantastic and the ambiance was enjoyable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ndssfx9LA9WpIIvj67wJuw"
  },
  "KQg32kDb_NVSvg6Uy-t71w": {
    "date": "2/16/2015",
    "text": "I thought everything was pretty good. I had cevice and pork belly taco.  Disappointed that the cevice was shrimp and not fish, and it lacked a little heat, but nothing a little hot sauce and a squeeze of the lime on the rim couldn't fix. The pork taco was a little bland, but the green salsa fixed that right up. It was cooked properly.  Because I'm an optimist, I wanted to rank 3.5, but gave it a 4. I would definitely come back.  Though.... I was a bit disappointed that they had run out of margarita mix. Would have expected limes, simple syrup, and some orange liqueur.... But hey, in the spirit I just got the shot of tequila with lime. I think they felt bad enough I got a double.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "QeqBu6gCFNYTwJ6fKqZfew"
  },
  "MSC01m7E7wG783cPVFsX8A": {
    "date": "7/26/2016",
    "text": "Great service, food, and atmosphere!  The food was unique and made with fresh ingredients.  We especially enjoyed the ranchero sauce.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Lv9CTaFgfmCirG1KIujIA"
  },
  "i3bYQCrQkYh_nE_Y_7NbMg": {
    "date": "3/25/2016",
    "text": "We were fortunate enough to have a beer paired dinner on the rooftop of The Clarendon with a group of our closest friends to celebrate our marriage and I couldn't be happier with the way the event went!! The decor & theme were on point and looked beautiful against the Arizona sunset.  Each course had a matching beer chosen to compliment the meal it went with.  My personal favorite was the Java Stout Float for dessert! The staff were excellent in timing the courses, as well as describing the dish a few times for the guests that were distracted.  Every person that attended the dinner left saying that it was a very unique and delicious food experience they will talk about for the rest of their lives.  Definitely the perfect way to start off our celebratory weekend!! A huge thank you to Nicki, Vince, Joe & the rest of the staff at Cafe Tranquilo for making it such an unforgettable experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "AEQCNkS6XGOxlOaza7yIdA",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Creme brulee flan with chocolate dipped coconut macaroons",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AEQCNkS6XGOxlOaza7yIdA/o.jpg"
      },
      {
        "img_id": "VERdntICI58d4G2Vv1hzsw",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Bloody Maria &amp;amp; Damas Brillantes drinks.... both delicious!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VERdntICI58d4G2Vv1hzsw/o.jpg"
      },
      {
        "img_id": "yENmqSK28oMPnklyepXBdw",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Beer Paired Dinner on the Rooftop of The Clarendon... So magical!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yENmqSK28oMPnklyepXBdw/o.jpg"
      }
    ],
    "user_id": "3MsFenE6xitctkz1wHgwAA"
  },
  "tIsGKHtMP4DUfStT8GPwcQ": {
    "date": "2/13/2016",
    "text": "I used to come here when it was Galleo. Similar fare but they have live music now Thr & Fri nights on the rooftop (so thankful they renovated it) and $2 tacos wed/thr from 2-6pm--which im gonna have to remember.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "suD8AjbVgB4pAXLawhIAmQ"
  },
  "KRjLwmlN_1xmeFRnWEfdrg": {
    "date": "9/7/2017",
    "text": "Man was I surprised. Hidden inside a small boutique hotel, this place has style and the food to back it up. Amazing $2 tacos every night, fresh farm to table food, and great service. Highly recommend whether you are staying at the hotel or not. Excellent breakfast as well, and I suggest getting the torta. Wow",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jw8uu1q59V4-OBfLbFWxsQ"
  },
  "XMOYxGOcKiGobF9lC98few": {
    "date": "4/4/2016",
    "text": "Such a fun place to come and have a beer and dinner with friends....  I had a burrito, guacamole and chips. Ingredients were very fresh and everything tasted amazing the guacamole is to die for. We will definitely be back. Can't wait to try more of this amazing menu. Cheers",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "U9m6UmME0QyZ7wqMhM7akg"
  },
  "Te4N5c9P3W6XDK_KkMOaxg": {
    "date": "10/17/2016",
    "text": "This is one of my go to restaurants in Phoenix. I have been here for breakfast, lunch and dinner and he food is consistently great at all meal times. The staff are friendly and the owner, Ben, is just an amazing human being. I love, love, LOVE the Chicken Chilaquiles- great for fast, lunch or dinner!! The flapjacks are moist - keep in mind, this is a flapjack, NOT A PANCAKE (two completely different dishes), and they are delicious, especially with a side of crispy bacon. They've got great drinks, a great place for happy hour after work. Try it for yourself, you won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "54jqOlO3TWR0zoBIv0_bOA"
  },
  "h3FJ_fRrzkiydjBfBALxZg": {
    "date": "11/14/2016",
    "text": "I was not impressed with breakfast. I had the chilaquiles they got them wrong two times and the they did taste good. They forgot my side of avocado and they do not have dairy free milk.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nqUKkcNxUbE1zNGvH_3h5Q"
  },
  "eEemVydXpP5EykRU8F5IWg": {
    "date": "6/19/2015",
    "text": "This is my little gem in the city... I can call them at midnight and still order chillaquilles!  I have tried the different dinner specials they have and I constantly tell myself, \"Oh they need to put this on the menu...\" Oh and I can taste hints of chocolate in the mole sauce.  I'm getting hungry just writing this review and I think I know where I'm going to grab some dinner! But seriously.. check this place out. Great menu and flavors!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9SSZ2mz6UiS8qYiwX-kAJg"
  },
  "f94o7b77eNSwkZMua1Rc-g": {
    "date": "3/5/2017",
    "text": "I was staying at the Clarendon and decided to give this place a try based on the reviews.  I am glad we ate here.  The guac was really good.  My favorite dish was the corn and cheese.  The tacos were really good also.  I agree with some of the other reviews about the shrimp tacos not having a whole lot of flavor to them but there are so many other dishes that were really tasty.  Also, the drinks were tasty too...especially with so many places downtown serving crappy margaritas.  The service was excellent.  I had the flan and I was a fan.  I generally like slightly denser flans and this one was the way I like it.  I also tried the shrimp ceviche on another night and was a fan.  Good happy hour deals.  The kicker for me was that we were expecting jacked up prices for being attached to a hotel, but these were some of the most reasonable prices we encountered in Phoenix, especially after having eaten at a few places downtown.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "a4nhy231AX3j3LqnWKW3Ng"
  },
  "Bd1DtIKkKzl9OIwNn3_9Kg": {
    "date": "9/8/2019",
    "text": "Came here for lunch during a seminar and holy moly! This place is a gem. The carne asada burrito is amazing and the spices are on point. I can't wait to go to another seminar now!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fsyVPNDN20YLq4d62BD78Q"
  },
  "8SMjiwOox-Txmi3FSeCETA": {
    "date": "9/20/2019",
    "text": "Had a business lunch here yesterday. Team was friendly, service was good and the horchata was amazing. The food was overly cooked, bland and boring. Considering this is Mexican food, I was quite disappointed. The interior of the restaurant is also very boring in fact it needs some help it's bland brown the ceiling is awful with pipes exposed that are dirty. The entire place just needs some soap and water and some elbow grease.  I've been visiting the Clarendon since 2005 and I must say overtime the restaurant has gone from a high-end French restaurant to Gallo Blanc to now this. Overall it's sad. So many good options for Mexican food in Phoenix pass on this one.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6kYR0Mgls7lQQ8VtXWdJoQ"
  },
  "liY8O-nq4Q75lOjxJ2a8Gw": {
    "date": "9/14/2019",
    "text": "Fish tacos are bad, and so were chicken tacos tasted like chemicals. The cheese on the carne fries tastes like nothing, there is no flavor. Fries were too big and tasted like shit. The rice is bad, and it's green. I gave them an extra star for the live music.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DJS4j8sCNamop5V7wOA6HA"
  },
  "h7yQaIB034EFHC-sMigiQQ": {
    "date": "12/15/2018",
    "text": "My wife found Tranquilo on Facebook from a brunch promotion they are doing with $2 dollar mimosas, and chilaquiles.  Downtown hidden gem? Tranquilo is located at the Clarendon hotel and I can't believe we just stumbled upon it.   We began our after noon with watermelon and orange juice mimosas, the watermelon is where it's at. We ordered the Migas Skillet which comes with papas, eggs, Anaheim chiles, and fried onion topped with avocado drizzle. We added Carneasada for an extra $3. This is a must! So come here and get this because the flavors along with their green Chile is amazing! To add, we ordered chicken tinga, fish and received a complementary shrimp taco! Use the chile red especially here and you won't be disappointed!   So happy we found TRANQUILO The staff was extremely hospitable and pleasant, the chill music set the mood, and the food and drinks were on point!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "camqYlsMGriNk-Z2Kj_A8w",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Watermelon mamosa",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/camqYlsMGriNk-Z2Kj_A8w/o.jpg"
      },
      {
        "img_id": "ZLTIzZ3AgWG5nhXgpB7arw",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Migas Skillet",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZLTIzZ3AgWG5nhXgpB7arw/o.jpg"
      },
      {
        "img_id": "9lLN6IYdQOxSs2FG-tYDnw",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Mogadishu Skillet with Carneasada. So GOOD!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9lLN6IYdQOxSs2FG-tYDnw/o.jpg"
      }
    ],
    "user_id": "i6DNxPy0KVZfmsFEkSIw0A"
  },
  "qvlFkV9UbR7vyBRO-5zMJg": {
    "date": "9/3/2019",
    "text": "Food is okay is just okay, a step above most Mexican food chains, but service has always been great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3uS0Fj7RSi28DSl1lNDeJA"
  },
  "X-IYwwbg23q1oMIGZPS9XA": {
    "date": "7/9/2019",
    "text": "I am staying at the Clarendon hotel and visited this place multiple times today. It is wonderful! I definitely recommend the grilled fish and grilled shrimp tacos, the pork belly is amazing. The salsas are fantastick . Green sauce is spicy and flavorful, the red sauce is very nice compliments to the tacos. The guacamole was salty and Limey. Taco Tuesday is an amazing deal for gourmet tacos.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SfmBwM314xNrr82EWHDRsw"
  },
  "FdE8EjBKQi3OKi-1b6bAsg": {
    "date": "3/5/2019",
    "text": "Food tasted great but a definite rip off for a VERY small portion and my order wasn't even made correctly. Even though some employees were great, some were rude and awkward. Won't be coming back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Z7D68BY_B8csFeNAXIl2PA",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Cactus Fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Z7D68BY_B8csFeNAXIl2PA/o.jpg"
      }
    ],
    "user_id": "y4bta822g1EdRujmuLV39g"
  },
  "quCgx1_qt-94E04Fgod46Q": {
    "date": "5/3/2019",
    "text": "I stop there for a late lunch (happy hour was very good I only paid like $1.84 for a beer)... I also have the apple kale salad which was pretty good and only $10; table service was very attentive; very quiet during this time of the day, a friendly ambience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "iABIbyx-ZpAU-y8hg7FFUg",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iABIbyx-ZpAU-y8hg7FFUg/o.jpg"
      }
    ],
    "user_id": "1CDs9-DeXNSvx_QzevMbrQ"
  },
  "BVfHiJ7C7iKrtC_NEt1pAA": {
    "date": "10/15/2018",
    "text": "We celebrated a friend's bday here on their patio and i love that they have happy hour on the weekend, too. Their $2 taco specials are fantastic and the shrimp and fish tacos were my favorite. (Also tried a chicken but it wasn't too special). I liked the mezcal margarita and tried a house one, too. Overall just a cute restaurant with good service and great specials! Will return soon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "94jeHZI1slb-Ic1P54o_LA",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/94jeHZI1slb-Ic1P54o_LA/o.jpg"
      }
    ],
    "user_id": "KuEmun7kYxjo8suC5cjjtg"
  },
  "WLZezwOKEWnrbmhhi7yDOg": {
    "date": "8/6/2019",
    "text": "I've only been here for breakfast and it's delicious! Closest chilaquiles I've eaten that resemble my moms. Both the green and red are amazing! The breakfast torta and chorizo are also really good. You won't be disappointed with whatever you order.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5bb074xmuqvQZBXVJtJUEA"
  },
  "iPB3iMB8RwKFjp2u32Hexg": {
    "date": "8/27/2018",
    "text": "This place was buzzing on a Friday night! It was even difficult to find parking! Live music was amazing. The food was great. The only thing I will mention is poor customer service. We had to wait for everything: from our drinks to our check. I couldn't figure out if they were surprised to be busy on a Friday night.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "jkEG275tQGqVRPt6WquxeA",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jkEG275tQGqVRPt6WquxeA/o.jpg"
      },
      {
        "img_id": "nstkkSOwcW3u3VYf07YhYw",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nstkkSOwcW3u3VYf07YhYw/o.jpg"
      }
    ],
    "user_id": "XaySBCbHur-DVCbf3XkdIw"
  },
  "u4FNln5FZJssQik_or3UIQ": {
    "date": "4/15/2019",
    "text": "This place is surprisingly good..so many places have been meh, lately. This place the drinks were really above average. The margarita was nice and refreshing. Even if we were not staying at this hotel we would come back. The 3.00 al la carte tacos are very flavorful and filling. Very deceiving by the size of them. The shredded beef were great! Their Happy Hour is a great deal for sure! Staff is very nice and attentive.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vJ8M8o2LyJr8efY_t2OlcQ",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Happy Hour Margarita",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vJ8M8o2LyJr8efY_t2OlcQ/o.jpg"
      }
    ],
    "user_id": "_PAHAWo7DfqLuiziXVvteA"
  },
  "A_NyByp_m_yzpHWJiTTw6Q": {
    "date": "4/15/2019",
    "text": "Checked in the hotel and asked where we could get some good tacos. Front desk told us to check out their restaurant and it's a good thing we did! Tacos were tasty and hit the spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dH6fVhZdM3d_aKAJl9FXQg",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Cactus, pork belly and fish tacos!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dH6fVhZdM3d_aKAJl9FXQg/o.jpg"
      }
    ],
    "user_id": "IXlMls0nGQbS3-U2BgY0Eg"
  },
  "P-JZpIVmrIrzLQmGb48nQQ": {
    "date": "4/4/2019",
    "text": "Service leaves much to be desired. Food is pretty good.  Initially excited to eat at this restaurant as we were staying at the Clarendon. We ordered the bottomless chips and salsa, as well as the quac. Although bottomless, we never received a refill on our chips. The fish tacos and fries were tasty. We ordered the Chocolate Tres Leches cake and it was the worst Tres Leches I have ever had. Dry and hard. The  tres leches was pooled at the bottom of the bowl instead absorbed into the cake. The margarita that my friend had was heavily served over a glass filled to the brim with ice. When she asked if she could have less ice, our server told her that everything was measured appropriately. If you are staying in the hotel go for a matter of convenience. If you aren't, don't make the trip.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lUOVxiGP-QUdwvcwSO4sHQ"
  },
  "oL78DHIHJ_Nt7aWDaxydtA": {
    "date": "3/18/2019",
    "text": "The atmosphere is nice. The food is meh and a little on the pricey side.  I was excited for the soup. I don't recommend it.  The mojitos are good tho :)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JXjurJafuCwIDGWI6N4Qhw"
  },
  "uhyyoB8o5JHxSHTk1vtGTQ": {
    "date": "6/29/2019",
    "text": "Food: 4.5 stars Service: 1 star Ambiance: 4 Volume of the band: .5 ( as in \"way too loud for the space\")  Was here for lunch once...had the best chicken enchilada ever!  There for dinner last night (7:30ish), place was nearly empty and yet the service was well below average!  We had to ask for menus, appetizer plates, wave down the not busy at all bartenders...what's up with that?  Food, however, was outstanding... tortilla soup, jalapeno pinto beans, shredded beef taco, salsas all top notch!  Well stocked bar and fun cocktails, to boot.  But they really need to step it up on the service as I'll not ever return if i don't see a major improvement on the next visit!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "icZ2sPb9wjwdKxP1uOw1ww"
  },
  "0jgsL3giDcLwirEsyZcBAw": {
    "date": "1/13/2019",
    "text": "We love this place. Fun staff, great service, delicious food and good drinks. Their menu has changed over the years but changes are good.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Ib1tICbgBURic_v6gMYnMA",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Mole wings with jicama, so good",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ib1tICbgBURic_v6gMYnMA/o.jpg"
      },
      {
        "img_id": "u4z3ZrqrngwnvlUp8oHTAA",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Muffin burder now serve with fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/u4z3ZrqrngwnvlUp8oHTAA/o.jpg"
      }
    ],
    "user_id": "reUMLWwXDGiyUJWm-zQ7QA"
  },
  "quYWvQ_Zm32ydfPooFZCiQ": {
    "date": "2/10/2018",
    "text": "At our table: Granola bowl with crunchy granola and yogurt, peaches and strawberries. Very good! Huevos rancheros with scrambled eggs, corn tortillas and black beans had s spicy flavor but the food needed to be hot in temperature too. Ok. Coffee- dark roasted and when drunk black was very strong.  Huge orange juice...please, do not hand out straws, save landfill space for something else we no doubt will need to toss out! Music was loud as it bounced off walls and ceiling with no acoustic tiles. We asked for music to be turned down a bit and they did; thank you!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "rUNoRdfFehKyySSqfABb2Q",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rUNoRdfFehKyySSqfABb2Q/o.jpg"
      },
      {
        "img_id": "OrIizR4c0VgbOt2Xuj4NaQ",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OrIizR4c0VgbOt2Xuj4NaQ/o.jpg"
      },
      {
        "img_id": "xukfy6v_j7ElQEEX_mlb1Q",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xukfy6v_j7ElQEEX_mlb1Q/o.jpg"
      }
    ],
    "user_id": "xfSiMtuhrlZNszvU2q_bCQ"
  },
  "w_BhJt-T7oYShvwYPu2Exg": {
    "date": "6/7/2019",
    "text": "Great Happy Hour.  Margaritas excellent made with fresh ingrediance.  Yummy Happy Hour menu. Priced well.  Chips and Guacamole, and Elote Esquite my favorite.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RT1QWtcksilvhMe5Xke6mg"
  },
  "RMzBaHqUsWspkblHIK_r8Q": {
    "date": "11/11/2018",
    "text": "Came for a taco Tuesday! I believe if I remember correctly, all their tacos were $2.00 and they had more than just 5 selections.   Service was mehhhh, but the tacos were worth it.   Came during a late evening, the weather was divine so we sat outside.   Cheers, Tranquilo, I'll be back.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "9uO9V6UHF6B7DreL06NoBg"
  },
  "45UvNFQlIrnwajHyuVHeYQ": {
    "date": "10/18/2016",
    "text": "Whenever I am in Phoenix, (which I try to stay away from ) I know I have to eat here. Even if I don't stay at The Clarendon, the food is worth driving across town for. The service is great, the coffee is great, and the food is always incredible. Any meal of the day, you can be fully satisfied. For breakfast the chilaquiles (with pork, as secretly suggested by waitstaff)are fantastic. The tortas are faboo for lunch.. You really can't go wrong here. It's great people watching, fun music playing. And the vibe is vibrant. A win all around.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zSb1qhyVc7eM0rWNRjuPOA"
  },
  "_Ri3Dm99oLQMwcNbjU-bbQ": {
    "date": "2/20/2015",
    "text": "I have to say. I was let down thinking it was Gallo blanco. But once the waiter said they changed. We gave it a shot. In short -No Happy Hour  -Not the the same food. Carne asada burrito was tiny and unflavored, very over priced. -The tacos are double what they should be. But they are decent -Service is poor, beers came out late and flat as if they been sitting?",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "Tj77fmZpjrntxsYYhwAYUA"
  },
  "Jz9AUmLsC1W3pASqtL5t7g": {
    "date": "10/10/2017",
    "text": "Food is great but they cancelled Taco Tuesday, ON TACO TUESDAY!!!!! What kind of a Mexican place is this?!?!?!  super bummed so we ended up coming to Urban Taco for $1.50 street tacos #tacotuesday",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AOwEWlT5l-dA5_W1lCLrbQ"
  },
  "SnErCPl5nO602ODHDHpeBA": {
    "date": "11/6/2016",
    "text": "Falyn is awesome.  Get the fish tacos grilled and add another shrimp taco.  Total chill place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wc-k2DqfFv-9k-YYle_Rsg"
  },
  "fGE0bVltBkC-2uJ0Eaj4FA": {
    "date": "2/16/2015",
    "text": "Used to love Gallo Blanco and go there for lunch/dinner/happy hour! Sad to say the replacement restaurant is not that exciting.. I went there for lunch with two friend of mine. We shared the Elote dip appetizer (Meh..not so much of a dip). We got complimentary sauces to try, and the creamy avocado was awesome! My friend ordered the chopped salad (was real good), and  we each ordered the chicken taco. All tacos came on one big plate. The chicken taco was moist but bland..I got the pork belly taco (very over-cooked (some pieces were hard to chew crispy and not in a good way!) and lacked seasoning. My friend got a shrimp taco and there was only one sad little shrimp on her taco, it was also kind of meh.. This was a pretty disappointing lunch..used to be a great location and we had great expectations out of the chef/restaurant combo!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "jlxU_6pjcffyAxXAZ4aHkA"
  },
  "Ag3MRECwsm8vinSuz_tw4w": {
    "date": "2/1/2017",
    "text": "I went here to meet a client that was staying in the adjoining hotel. The place looks exactly the same as my last visit, down to the dust and grime in corners, and dirty bathrooms. We met at the bar so I only consumed a bottled beer since it seemed like the safest option. It was refreshingly cold and got filled me up enough to get to a clean establishment soon after. Good luck if you do eat here. I'll keep lighting a candle in my nightly prayers for all the people that I know are getting sick here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GZcF8l35dRTKIi6ero5erA"
  },
  "PcfNEGxonkrEqUD8l81npg": {
    "date": "10/21/2016",
    "text": "Delicious food in a great atmosphere. Dinner and breakfast were equally as delicious. The service makes this place shine. Both times that we went for dinner, we sat at the counter and Jake was our server. Not only is he very attentive, but he is just an all around genuine dude. Eat here. You'll enjoy it immensely.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XINw7-T2AbBohamAHZcmSg"
  },
  "I8VY2_yfpYTM4Pl_uqMAxA": {
    "date": "12/9/2015",
    "text": "Shortly after I posted this I got an apology from the GM and he seems like a smart enough fella to help turn this place around and promise to give it another try someday. Hi Peter, Thanks for the note and wish I could have had a different experience to report. You guys will always be 2nd fiddle to the Gallo Blanco unless you can do something uniquely different. It's too bad you can't use your north patio for the hundreds of locals to walk up and pickup some late night take out in a timely manor.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fOYLR_xEYjlPgM8RFSUDZA"
  },
  "wCuLtzd34oQ8pj3E4UiXYw": {
    "date": "3/19/2017",
    "text": "He surprised me with a date here, the ambiance was perfect, live music was a little loud, but the beer was cold and food was delicious! We started with the Shrimp Sofrito - gigantic shrimp and perfect combination of spices. I opted for another appetizer for my main course which was the Ceviche - it wasn't as good as mine but with some salt and lemon it was perfect. lol highly recommend! Has a hipster kind of vibe, very laid back and perfect for a date or quick meet and greet.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jP7kw2uZBlINcu95PNRp_w"
  },
  "l1SVcbSFnuKPgKJAP5nHMA": {
    "date": "9/1/2016",
    "text": "This is probably the best poke stop. I just stop by to have a drink after work and was actually given an amazing recommendation by the bartender Jeffery. Their jalapeno mango margarita, which if you like spicy and fresh squeezed juice is mind blowing, not only did I stay for dinner but was entertained comically and mentally throughout my entire evening! I would recommend stopping in to see Jeffery any Thursday night along with their amazing musically guests. Also a great things going for is the live music they have Thursday - Monday's.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "A1-lJlTTlAZLD172gDGnnA"
  },
  "XkVRmmtV-V1aj3E1z0iaOA": {
    "date": "4/7/2016",
    "text": "It took me awhile to make it to Cafe Tranquilo. I used to come to this location when it was Gallo Blanco and enjoyed it. I finally made it out to CT when invited by a friend a couple weeks ago. Unfortunately it wasn't all that exciting. I understand the concept of 'modern Mexican' food and appreciate that in general it is more complex than your typical Mex fare and therefore more expensive. This food was more expensive than your typical restaurant, but seemed fairly basic. I got the carne asada burrito, and it was very small and came with no sides for 8$. There was nothing special about it.... just meat, beans, cheese, and avocado. It was fairly bland and didn't warrant its price tag. I luckily had ordered chips and salsa (for 3.50) and had a very very minuscule amount of salsa to put on said burrito to give it some flavor. Back to the chip situation.... if I pay almost 4$ for chips, I would think they would give refills on the teeny tiny cups of salsa, especially because their basket of chips was quite generous.... this was not the case ( or at least wasn't on the night we were there). The salsas were good, with the green salsa being my favorite. Anyway, I just don't see the need to go back to this establishment when there are other 'modern Mexican' places in town that do a much better job of making their food feel special.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 4
    },
    "photos": [],
    "user_id": "d_TBs6J3twMy9GChqUEXkg"
  },
  "5mEL55I-nYkqqbhE4KUPUw": {
    "date": "4/4/2016",
    "text": "This is one of my favorite place says to come get a burrito and guacamole and chips!!! They have The best guacamole dip I've ever had!!! Has a lemon flavor and comes in a pretty big bowl. The environment is very urban. This is a great place to take somebody on a date. Very clean on the inside in the waiters are very professional and respectful",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 3
    },
    "photos": [],
    "user_id": "9mkaaU4tx5J-029axdvGXg"
  },
  "GXvdoZQnzAHsDxWQPQ2R6w": {
    "date": "4/14/2015",
    "text": "Had to deduct a star for how I was welcomed or made to feel unwelcome. I checked in late after a long day of flying and was happy to hear that the restaurant was open late. I walked in and looked on the restaurant and it was empty but there were a few seats at the bar. I asked the bartender if I could order dinner from the bar and she looked at me like I had four foreheads. She finally said yes and then I had to ask her for a menu? I also had to ask for water. Maybe she's having a bad night?  I ordered a burrito but it was more like a chicken wrap. Regardless it was tasty. The food in this place was decent, the service not so much.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "I8y70DRMUcJlivX-LbEudQ"
  },
  "SpMlHUfNh2Sq4E9F6yNYgg": {
    "date": "12/4/2015",
    "text": "Another amazing breakfast. Egg Scramble and Alex had the granola with greek yogurt. Great start (or end) to the morning. Ask to be seated with Jake. He knows the menu.  And check out the Christmas decorations by the window. I rearranged them a little :-).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Kf2uqT6XlKP-kSqKWd1DJw",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. One of my.light appetite favourites, an angus cheeseburger and twive deep-fried fries.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Kf2uqT6XlKP-kSqKWd1DJw/o.jpg"
      },
      {
        "img_id": "3OCp2Xc0GDmy1w7LdVCXCw",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Can you believe this is the half-size house salad?",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3OCp2Xc0GDmy1w7LdVCXCw/o.jpg"
      },
      {
        "img_id": "1TvrPHujE0RbZLpzRyxcag",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. These trees give an idea of the class attitude and warmth of this venue.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1TvrPHujE0RbZLpzRyxcag/o.jpg"
      }
    ],
    "user_id": "vXzvpWVztGwd4OK8pnT1CA"
  },
  "E7iu89jBBSiKgTTfIonuOw": {
    "date": "10/18/2015",
    "text": "Everything we tried was awesome. We're staying at the Clarendon so ordered in on our first night, then went back for breakfast & dinner the next 2 days!! Met a group of friends for dinner on our last night in town, place was full, but there was not a ridiculous wait for our party of 10 which was awesome for Friday evening! Had:  Flap jacks Granola w fruit Fruit bowl Freshly squeezed OJ Freshly squeezed lemonade (so tangy and good!) Chicken burro Chicken tacos  Salmon w veggies Elote appetizer  Guac & chips   No complaints,  all so tasty!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "h1mn5DaKLOinuif6XrbRtw"
  },
  "hkZLnVS3-64Zv6DXfHTWaA": {
    "date": "4/1/2016",
    "text": "Cafe Tranquilo at The Clarendon Hotel in Phoenix is amazing!!! The food is so fresh and yet still made quickly. Because we were staying at the hotel we had dinner and then breakfast the next morning. The menu had something for everyone in my family. My daughter is so picky, but even she said that she loved the food. (Mom is happy about that! She ate her whole meal for a change!) Our server, Jacob, was so  friendly and helpful.  (We were lucky enough to have him as our server for both meals.) It felt like we were having a meal at a friend's house or something! At breakfast, he recommended the flapjacks and they were so fresh and perfectly cooked! Served with real maple syrup too...Yum! All in all a great restaurant in a great hotel!!! We will comeback to Phoenix just to stay and eat here!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 1
    },
    "photos": [],
    "user_id": "-6OotbGh0X4-rzlyeqrU4Q"
  },
  "_YbZXNjVQl93vVRoiDoI4Q": {
    "date": "7/9/2015",
    "text": "Service: 5 stars Drinks: 4.5 Stars Food: 3 stars Coffee: 5 stars  Service: Jacob our server was amazing. He defiantly made this place special! He brought Horchata to go with the coffee in addition to cream without asking to give us something different to try. He also was super creative with the menu substitutions we could make. We stayed two weeks at the Claredon and got free breakfast daily, by the end of the week we started getting bored.  Drinks: I had a few cocktails at the bar and poolside. One cool thing is they let you double any drink for 1/2 more. i.e. $15 gets you 2x $10 drinks combined! Cocktails I liked were the Mezcal one, and the margarita with St. George Spirits Raspberry Liquor.  I think the bar is this places best asset. They do drinks really well, and it is a chic atmosphere.  Food: Well I'm super picky. That's what living in the bay area does to you. We had breakfast every day here for two weeks and I tried almost all of the menu. The pancakes are really awesome, so was the scramble, but only because I asked for them to custom make me something. I would ask for bell peppers, onion, cheese, chorizo, and it would taste amazing. The secret: they add taco seasoning to the eggs! Highly recommend you do that.   The chilaquiles and huevos rancheros were both disappointing. The chilaquiles for some odd reason had carrots in it! Didn't exactly go with eggs. Their scramble off the menu - spinach and mushroom was also pretty boring. These guys could be a 4 star on food if they gave the chef some creative freedom and added more stuff to the breakfast menu. They have 8 items; not a lot of selection..... it would be super easy to add omelets for example.   The saving grace: good coffee. The coffee both warm and cold brew iced was awesome!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OPtv-lFAgcddoUuHCcTHUQ"
  },
  "5YhgTHJvxqIebWlN6c11wA": {
    "date": "4/25/2016",
    "text": "Top notch! Above and beyond! I don't write reviews very often, but I felt compelled to for this restaurant. I ordered from them through postmates based on reviews and their food did not disappoint. However, my postmates driver did not deliver me the correct order. I called the restaurant to see if my food was still there, not only did they apologize, but the manager personally delivered my food. How awesome is that!?!?! Phenomenal service and absolutely delicious food! I highly recommend checking out this place, it's more than worth it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cc_oadqeBZFiuIhMGm-Zew"
  },
  "gmban8p0oPiMNfrxXKIqMQ": {
    "date": "6/24/2016",
    "text": "I really want to like this place.  The atmosphere and design are lovely.  Unfortunately, the prices are completely overstated.  3 ounces of salmon for $25???  No thank you.  The prices need to come in line with the simplicity of the menu.  If the prices were comparable to portion and quality, I could become more of a fan.  It just seems very misaligned.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "aKvdxWXSKgd02Mzj1itBWw"
  },
  "iTqcz3T__uWpf_NbEspNPg": {
    "date": "9/1/2016",
    "text": "Jeffrey was a perfect bartender.... Perfect IPA on draft based on his recommendation..  Great food, great music and cool vibe..  Do yourself a favor...  Check out the Clarendon and enjoy the good vibes..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hutFptdtH0qMNDg9yQ5rZg"
  },
  "l7KLK3IEH00TQKe7tjuBfQ": {
    "date": "10/30/2017",
    "text": "They just redid the menu in the last few months here. We'd been coming here long before the menu change, so I was a little skeptical. They simplified it quite a bit. But oh wow did it deliver! We've loved this place in the past and the menu change honestly just made it even better! They did take away the kids menu, which with us having two kids was a bit of a blow, but we were able to get our kids items that they liked on the happy hour menu. Definitely worth checking out!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xX4876t-3l_lXBYxw-NVYA"
  },
  "p8rUTm000oVEsDA2L270Sg": {
    "date": "11/16/2016",
    "text": "We came to the roof top of the hotel for their bingo night which happens once a week. The free bingo on the rooftop was hilarious and fun, but the food, drinks and service was just \"okay\". I ordered two cocktails and the bartender had to take the drink menu from me and use it as an instruction manual for the drinks I ordered. The drinks tasted fine, but it now makes sense why the line was incredibly long because he had to look up each cocktail.   We ordered the elotes, avocado fries and chips and guacamole. It all tasted good, but again nothing out of this world.   Overall I will definitely keep coming to the live entertainment each week, but will probably eat before and stick to beer or wine.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ddZQHQWevDIYKkrgQQw9ZA"
  },
  "4T77V4UhiPhh2VbuCYTAVA": {
    "date": "6/5/2017",
    "text": "I wasn't sure what to expect after the former restaurant closed, and this one opened in its place. But I was very impressed and loved my meal! Happy hour is fantastic - $5 classic margaritas, $6 guacamole, $2 tacos, and more! The guacamole was some of the best I've had, and the chips were thick and crunchy and addicting. The service was excellent, food was delicious, and prices were fair. Plus my husband's amazing ribeye was grass-fed which is a big bonus in my book :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "htOYuRL68PFjVaBG-D072A"
  },
  "pn2SSEPggBsgIcLZYpGZ4A": {
    "date": "4/7/2016",
    "text": "I can't say enough about this little gem in the  Clarendon Hotel! The food is delish, drinks are delightful, the $2 tacos on Wednesdays and Thursdays for happppppppyyyyyyyy hour are bomb and the  wait staff are fantastic- especially Jacob and Michael! Take a drink up to the rooftop for the sunset and the central Phoenix skyline reflections. Music on the roof on Thursdays, Fridays and Saturdays until it gets too hot. CHECK IT OUT ONE TIME and experience it for yourself!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "F5XU4IJy_8ZsMEjTenzmSg",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Cafe Tranquilo&amp;#39;s Raging Diva for Phoenix Pride!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/F5XU4IJy_8ZsMEjTenzmSg/o.jpg"
      }
    ],
    "user_id": "Qq9ZH3bVQeCR_YW37zzokw"
  },
  "ud5OsGRxW2zH6yhKfMRlZw": {
    "date": "5/6/2016",
    "text": "Awesome place. I had the grass fed steak special and veggies.. Delicious and perfectly cooked.  The shrimp tacos and the Cesar salad were great too.. Going to have breakfast here in the morning and already looking forward to it!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2Ife7D_y9FVf-9z1rdEMCA",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2Ife7D_y9FVf-9z1rdEMCA/o.jpg"
      }
    ],
    "user_id": "1uacAbVhws4zT8TXKNkhNQ"
  },
  "b5zgBhZjo6gmTo7y-4fRZQ": {
    "date": "11/29/2017",
    "text": "I came in before 9pm and that's a mistake because the chips are cold and rather chewy. The rice I ordered was dry and hard and my server was busy chatting it up with other staff rather than taking care of me. I have to keep in mind that this is not Gallo Blanco and this hot mess needs more help than taking the physical location of an awesome restaurant. Remain tranquilo and move on.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d5-_loBSM81yS4RaU72bug"
  },
  "0fpsi_Ct8hfp-RbuZc4K1A": {
    "date": "4/16/2016",
    "text": "I placed an order for pickup with the host, she was very friendly. When I got to the restaurant, she said she recognized me (maybe by the sound of my voice?) and had everything ready to go. Maybe I should have opened the bag and double checked my order, because the only thing in the bag that was correct was the chips and salsa. There was some sort of torta, a bacon cheeseburger, fries and my chips/salsa.   I was really hoping this would be a new restaurant to frequent while in town, but unfortunately, I will not be back. The bun on the burger was soggy, the torta had an odd flavor, the chips and salsa were just ok. I did eat all of the fries though, they were really good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "DOADB8K_f--DRHZZIok8dQ"
  },
  "ZWtjpEtRzbvHItNse88hjA": {
    "date": "7/18/2017",
    "text": "Every time we come here we always order the guacamole and the carne asada burrito! So good! Also they have such a chill spot on the roof with bistro lights",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "P1eQu1UfMNtfJVWfxxvEdQ"
  },
  "T3OJO5AsQHIJNmWPcjfaDQ": {
    "date": "6/21/2015",
    "text": "The food here was absolutely wonderful. My husband and I had breakfast here and just enjoyed everything that we ate. He ordered the Chorizo and loved it. It came with an amazing side of potatoes and roasted vegetables, tortillas, and beans. I'm fairly sure he nearly licked his plate clean!  I ordered the chiliqueles with chicken which was an odd offering. I've never had chicken in chiliqueles before. Next time I would have ordered it with the vegetables. We also ordered coffee and it was fantastic.   I would highly recommend this restaurant for breakfast, which is served all day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "28f9NWZEaem0-ak9JfiwiA",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Chiliqueles",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/28f9NWZEaem0-ak9JfiwiA/o.jpg"
      }
    ],
    "user_id": "HS2HdCaXl3UwhTlg7v2xzg"
  },
  "JVOhxtSrRFg7art-jTQGaQ": {
    "date": "10/27/2016",
    "text": "Our bartender- Jeffery- was hilarious, on point with the drinks, and full of info about things to do in the area. We had only planned to stay for one drink but we spent the evening laughing with him and the people at the bar.  The hotel is beautifully decorated, and the roof deck was amazing, but we opted to stay downstairs and talk with Jeff. I would highly recommend ANYONE visiting to stop in- or stay here. We are staying at a hotel down the street and regret it. The pool looks so refreshing and there are cabanas... Why didn't we stay here???  Back to the booze... We had tequila drinks and Jeff gave us the option to upgrade the liquor: so much better! Will definitely be back, thanks to him! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1AJD4IldxrJyjjRJcZneUg"
  },
  "Sjj-4dmZCofK9nuBiUIhLA": {
    "date": "4/25/2018",
    "text": "Service was ok but the food sucked. My tacos were fried shrimp,fish, grilled steak and al pastor. All my tacos were refrigerator cold when they were served. The server said it was because of the fresh pico de gallo on it. No all of the meat was like taken out of the fridge and served up on cold tortillas. I don't recommend this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "71VVDCPouM5fldCywWxNWg"
  },
  "9v7W8DWKG1HJhM8F7KLojg": {
    "date": "10/16/2016",
    "text": "Great food, great service, great perk of breakfast included in stay. The Clarendon is our favorite place when we stay in Phoenix",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rKp_F7q4Mdbbc8aP6wZKYg",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rKp_F7q4Mdbbc8aP6wZKYg/o.jpg"
      }
    ],
    "user_id": "UxOoj_Uc1dND31DjH7o2kA"
  },
  "nijr4mdNwkdkqZfJugafxQ": {
    "date": "3/11/2016",
    "text": "WOW WOW WOW! To start off I would like to Thank Mr. Jacob!! This gentlemen made our dinning experience very memorable....actually the full staff did. Being greeted once you walk in to a clean, modern and fun environment. Next big things with young professionals. Great work with the remodel will definitely be back once a week.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "J2g5ObNAHknn9YoReWpXmg",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Walking in.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/J2g5ObNAHknn9YoReWpXmg/o.jpg"
      },
      {
        "img_id": "nriEzvk8hoQT_SvniMZGRA",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Fish and shrimp tacos are the best!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nriEzvk8hoQT_SvniMZGRA/o.jpg"
      },
      {
        "img_id": "cyxocmyQsdDXNB_H6mG2zg",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Yummm...best guacamole with a sprinkle of cheese.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cyxocmyQsdDXNB_H6mG2zg/o.jpg"
      }
    ],
    "user_id": "7VOT4Vlz3RPcR8gpdaMfPw"
  },
  "zAFdcDYhVB252Yp2YQeWsQ": {
    "date": "4/29/2018",
    "text": "Don't believe we'll return.  A group of us were on the patio. The entire inside of the restaurant appeared empty.  It took over an hour for food. Beverages came a bit sooner but ice was half melted.  3 coffees appeared when only one was ordered.  When food arrived, two sides of rice came out when only one was ordered.  A Sonoran dog came out with cheese and crema when it was requested to be left off. A new, cold dog was delivered....now without the bacon. When asked the waitress informed us that the bacon was wrapped around the hotdog. No, it wasn't.  Upon checking with the kitchen, the waitress let us know they were out of bacon!  Chef could have informed the waitress when the order was placed.  Place better get their act together or we'll be seeing ANOTHER name change!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6MJj6rNzCxpbEdDdy_2cCg"
  },
  "A-MwWvxbD2b14HdEwuC23Q": {
    "date": "7/5/2015",
    "text": "We ate here while we were at a party at The Clarendon Hotel. For the 4th of July (possibly always? Not sure) they had poolside service from this restaurant. The waitress was super friendly and helpful when taking our order and was prompt with drinks.   I ordered the carne asada burro which came with fries. The meat in the burrito was actually really well cooked, fresh, and tasty. I like that the tortilla was toasted and still warm when the food was brought out to us. It was super messy and tough to eat, but still good and definitely worth having.  The price was super inexpensive for what we got (two meals and an alcoholic drink), only about $24. The only downside is that the service was a little slow on as far as getting the actual food out goes, and there were a few things we asked for but never got.  But I would come here again for sure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "feBp2hNYuUcvsGtBNgRP9w"
  },
  "oTPD2y96V71VNn3qjmzHpQ": {
    "date": "4/20/2018",
    "text": "Cafe Tranquilo was OUTSTANDING! The menu has something that everybody will love, and the service was absolutely phenomenal! Jacob was a fantastic server who didn't mind running back and forth for us for all of our requests! We have already made plans to come back to Cafe Tranquilo during our short stay in Phoenix.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "geILOU28fjDeW85sgLcU6A"
  },
  "hdLYVvszCmTlCALBpxincw": {
    "date": "6/20/2017",
    "text": "Went here with friends for bingo night. Bingo was fun but hard to hear. My friend got the guac, ceviche, and three of their tacos (chicken, steak, shrimp). The guac was delicious. The ceviche was horrible. As a person who loves spicy food this was  too spicy and had a very weird flavor. My friend did not enjoy his tacos. Not enough flavor. I ordered the Tranquillo Chopped. Sounded amazing. Nope. Bowl of coleslaw. I got it mainly for the kale and there were (no exaggeration) two pieces of kale. The dressing was supposed to be jalapeno and it had absolutely no flavor. And on top of that the prices were ridiculous for what you get. 10 dollars for a bowl of Cole slaw?!   The atmosphere is what getting the star. Other than that, there are many great places around that are worth the price.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WV0vbZht0IsqPbFYJnHATw"
  },
  "e6RjjJ6IDkSrQvvJus697g": {
    "date": "3/21/2017",
    "text": "Do yourself a favor and get the pancakes. Our server Jacob helped us choose what dishes we should order.  He also gave us some good local tips.  We split a spinach and mushroom egg dish with side of home fries.  All of the staff seemed upbeat and attentive to our table.   I would recommend locals check out this place for brunch, wish we lived less than a state away so we could try more things on the menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VZRZv1-6TxplC3KB-3-MJg"
  },
  "aVT1NFohg-7rtZX1aojZTg": {
    "date": "9/7/2017",
    "text": "Visiting town and didn't expect much from a hotel restaurant and bar. I know I set the bar low but they surpassed every expectation I had.  Two great meals. Amazing tacos and margaritas for dinner.  And great breakfast this morning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ktQc4fUZpkyzoxCgWTTtrw"
  },
  "xRmRoVKPXgMrRjH_JLaDnQ": {
    "date": "6/11/2017",
    "text": "Yummy!! This food was so good. You can tell they make everything fresh. The food has a signature taste  that I enjoyed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "AQYj5EotBUSHi7dfOxMm3A"
  },
  "R7-EC1nNM_A9cduOMYvtZg": {
    "date": "8/4/2016",
    "text": "Love this place! My boyfriend and I had dinner there on Sunday night and we were blown away by the pork mole. Best pork mole I've had in the valley, I travel weekly to Mexico and this is the first mole I've had that even comes close to anything I've I had south of the border.  My boyfriend got the chimichurri ribeye steak dinner, and it was outstanding. Service was excellent, Daaiim our server made perfect reccomedations.  There was a band in the lounge that we weren't expecting, but they were excellent. We love live music this was a nice surprise, we'll be back! Keep up the great work!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "MWmGiDuqlBRAZbX6rHutBQ"
  },
  "mVkF7ifBBx1U3p5Z3WP7Hw": {
    "date": "1/19/2018",
    "text": "Excellent food, have been here a couple of times. The 3 stars is because the front desk hostesses did not sincerely apologize and did not make up for messing up our Postmates take out order. I ended up drive up to the restaurant to pick up the order she forgot to ring in. Waste of Postmates money I paid. May not return due to this customer service not doing anything to rectify the error.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dQOgmOh0a4CxUKf0PpAVFw"
  },
  "PS5R54S-YUHJtbD0-T89Gg": {
    "date": "7/31/2016",
    "text": "We didn't have the best experience when dining here.  We received breakfast vouchers because we stayed at The Clarendon and our service was horribly slow.  They seemed frantic and understaffed.  Our breakfasts took 49 minutes to come. Our server never asked how we were except to bring the check.  He was aloof.  The flatware and cups were dirty.  Our table was sticky.  My flapjacks were doughy in the middle.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ysqfg2Ah_i3mBCxWHCFBhA"
  },
  "I36CKSSVc5cTbh1AAnX1ww": {
    "date": "7/27/2016",
    "text": "The first time I went to Cafe Tranquilo I was amazed I got the vegetarian burrito and all the flavors in it were outstanding and HUGE! both halves i had to grab with two hands. I ordered a watermelon water which was good too but in a small cup. This was around 6pm.  The next time I went around 8pm I was excited to order the same thing along with an appetizer I got chips and salsa the chips were so stale and hard to eat. The burrito was so tiny!!! Both halves fit in my hand. No sides were given and I ordered the watermelon water which was a normal sized cup. Needless to say my bf and I did not get full and had to eat somewhere else after. The service was slow and barely paid attention to us. I am very disappointed with the service and food. I am never going back",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "HHjq62FDBI-2xvFiTzHsVg"
  },
  "nUkSMAlz1lja7fPZaiisrQ": {
    "date": "10/10/2017",
    "text": "We showed up for taco Tuesday only for them to tell us that they no longer do taco Tuesday. We live very close and were extremely disappointed to hear this. We were there last week and they had the special!! The worst part is, they still have the fact that that do taco Tuesday on their website.. WOW what kind of False advertising is that?",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Uby8JLx9AS0-TWW1MjxENg"
  },
  "dm6EdwoukBo8q-bclmcmJA": {
    "date": "4/4/2015",
    "text": "Clarendon's controversial concept for cultivating Chicano cuisine offers conventional dishes, with a little bit of the unique flair that makes the executive chef a bit of a local celebrity. And while your taste buds won't be left bored, I can't exactly promise Tranquilo will hit the spot.   I was excited to give this place a try, especially after giving them a few weeks to work through any inconsistencies. I decided to go with something modest and simple. Here goes:   Carne asada burrito: The gold standard of casual Mexican fare. The meat used was clearly of above-average quality, but the choice in seasoning was conspicuously sweet. Almost like some sort of BBQ sauce. That would totally kick ass in taco form, but IDK about how it meshed with very strong, tangy cotija, and some of the saltiest pico I've ever had. No really, that salsa needs to be toned down. I am surprised at how poorly it was executed considering your other salsas (one's avocado, the other is...chipotle?) are absolutely legit. BTW, please make an effort to warm up your tortillas. Another BTW, this dish is a healthy portion size, meaning the average American should be prepared for something a bit small.   Jicama cucumber slaw: This is more of a palate cleanser than a side dish. Looked cool, sounds cool, but IDK what they wanna do with this. It's just a crunchy, slightly sweet, forgettable little bowl of nothingness. Boring.   Margarita: Damn good for $6. 10/10 would drink again.  Service is also pleasant (bravo for fixing this, Clarendon) and swift. I think this place has potential, and that way too many people are trashing it on Yelp because they can't stop crying about its predecessor taking off. But while diners who miss their old haunt aren't quite ready to put away the tissue, this is at the very least worth a try, so that they may fine-tune the flavors of affordable, quality food to become a worthy CenPho competitor.",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 9,
      "cool": 7
    },
    "photos": [],
    "user_id": "YpGt3hdq5adPlEFn9fQ2Zw"
  },
  "xTQb5ODOs2FsA-ViP2myEg": {
    "date": "8/29/2016",
    "text": "Booo Cafe Tranquilo.... We have ordered from them through postmates previously (there aren't a lot of good Mexican options on the app, and the food is decent but not amazing).   This Sunday after a day of drinking poolside at home, we decided to order from them again. They twice accepted our order and then later canceled our order with the message \"we are too busy.\"  I guess you have as many customers as you need already, so you won't miss our occasional order.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "I7_9ixOu4b8z6UnzSpCpOg"
  },
  "KG64OvNsSsEWsariTUuRjw": {
    "date": "5/7/2015",
    "text": "I loved it when it was Gallo Blanco, but like all good things; it doesn't last.  I came here with a large group of one Friday night to now Cafe Tranquilo.  The place was pretty hip looking, but the crowd was nowhere to be found.  The place was quiet, too quiet for a Friday night.  As I sat I ordered a beer and like most Southwestern style restaurants chips and salsa was served with four different salsas; Pico de Gallo, Red Chili, Green Chili and creamy avocado.  My favorites were the Red and Green Chili; love the kick and the chips seemed like fresh cut tortillas fried...definitely nice start!  For my entree I shot for the Campechana Ahogada; a torta sandwich with ribeye steak, chorizo, avocado, tomato, cheese, eggs and a red sauce.  Definitely a larger dish then I expected.  The bun was nicely toasted, but protein ratio was definitely way off; maybe 2 cups of ribeye compared to a 8 inch bun.  The tomato didn't really add anything special except that is was there; if they were planning to give it some texture then that didn't help.  The egg was a nice compliment, but in the end it just wasn't enough.  I think a little more texture and something to compliment the red sauce would have made it work. - Enjoy!",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "W4VdRIUurzHEwg5-nT7pVQ",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/W4VdRIUurzHEwg5-nT7pVQ/o.jpg"
      }
    ],
    "user_id": "kjeX2RXvW7RhBbD2QLd5jA"
  },
  "XmKWXrwx6l7DaABrMuobtQ": {
    "date": "9/8/2016",
    "text": "I ate here several times during my stay at the Clarendon. Starting with breakfast, the mimosa was a great compliment to my meal. I also ordered the fresh, squeezed OJ on a separate occassion, which was honestly the best fresh OJ I've had. I could appreciate the fact they used thick cut bacon. My breakfast entree also came with an array of salsas which I could pair with my eggs or potatoes. For dinner, I ordered the cuban sandwhich. It was crafted so well. Although it was a bit pricey for a sandwich, I would definitely order it again. I also got the watermelon agua fresca which was a nice addition to the dinner meal. This restaurant gives good quality service and also has specials during the weeknight and weekends. You can also enjoy live music on Thursday nights which I definitely did.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yMGZw_h8jLTTTynEkJmCcA",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Midtown breakfast burro.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yMGZw_h8jLTTTynEkJmCcA/o.jpg"
      }
    ],
    "user_id": "RHVpSzqkBtkB3h5Tg8k8Qg"
  },
  "wyfZrPbH1vT5CN79gCR0lg": {
    "date": "8/24/2016",
    "text": "BEST. BURRO. EVER.   Let me first tell you I ordered in using Uber Eats, it was my first time using the app. The driver did not show up so the restaurant took it upon themselves to call me, informed me the Uber Eats driver did not show up, my food had been sitting for an hour and they were going to remake it.  They also contacted Uber Eats support for me! The restaurant also had their own courier deliver my food at no charge. They went above and beyond and I am forever grateful. At the end of our conversation the manager of Cafe Tranquilo said, \"may this be the best burrito you've ever eaten\". She wasn't kidding. It was the best chicken burro I have EVER enjoyed and will be ordering from them again.   Uber Eats also followed up with me, refunded my money and gave me a promo code toward my next meal.   I am one happy, and satiated, customer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "QETFGugFa4ydF1HW3nIqnw"
  },
  "r_We5H5PvyuXaUEmuaGjVA": {
    "date": "3/3/2015",
    "text": "I can't get enough of this beautiful new restaurant. I'm slowly trying everything on the menu!  I've notived a huge positive change in the service and I hope it continues to get better.  Now a larger outdoor patio and finally FULL service on the rooftop deck!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "SxQEOlnQu9-N6uUcOHbZwQ",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. New chairs. Paint. Mirrors. The patio is amazing.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SxQEOlnQu9-N6uUcOHbZwQ/o.jpg"
      }
    ],
    "user_id": "D1VBrc65U8gjbAMdJ5CbXw"
  },
  "K_oR-1-sKrANFJkuRJwzQg": {
    "date": "11/21/2017",
    "text": "From 5 stars to 3.  They are changing everything all the time. Management you are fixing what wasn't broken. As a regular it's disappointing. The food is not tasing the same. Go back to the basics.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_ztG3N8TJOU2FHEHxM9dSA"
  },
  "xkrCwTZ-aWh4xbO8-ZUhhw": {
    "date": "5/12/2016",
    "text": "I was staying at the Clarendon Hotel, so I used my breakfast voucher here the next morning. I sat inside, but they also have a small outside patio, which looked really nice. Service and ambience were very mediocre, but nothing to complain about. I ordered the granola bowl, which, tasty was it was, was probably not as healthy as it sounds. A small mound of greek yogurt was piled high on top with quinoa granola and plenty of fresh fruit, then drizzled with honey, and finally finished off with a very generous dollop of whipped cream. I actually thought that the bowl would have been better without the crema, but everything else was delicious.  Probably wouldn't have come here if I didn't have the breakfast voucher, but the food is decent enough to be worth a quick stop in the morning when it's complimentary!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 11,
      "cool": 8
    },
    "photos": [],
    "user_id": "kMB--Dl13I-etkyZLwJpkQ"
  },
  "cytLl04D8ngkHUKetShc4w": {
    "date": "6/13/2016",
    "text": "I went to Cafe Tranquilo over a month ago and despite being extremely distracted and busy I wanted to give my positive feedback for the food and staff.  It was my first trip to the hotel or restaurant and my fiance and I found the staff to be extremely on point with their service.   We had Jacob as our server and he had awesome scotch recommendations along with recommending the steak special which I found so good that I returned a week later to order the same dish.  We sat on the outside patio and we found the atmosphere to be relaxed but upscale enough to feel as though we were having a special night.    I have recommended this place to my friends and I will be returning for the delicious steak special!!!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "iN_7aJPsG4x5oUtDNpmc5w"
  },
  "8bKUTDj2daM6Q4lxnHHbkg": {
    "date": "12/10/2017",
    "text": "Came for breakfast on a Sunday morning. Service was very slow and food was ok. We ate on the patio, which was nice, but we probably won't be back due to the service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a_IS5OjJyYXKzhFl0f71GQ"
  },
  "LwL4C6k_wCXL_ZzZ8KUiXw": {
    "date": "11/19/2017",
    "text": "First & last time here tonight. Service was awful, we weren't even offered a refill on drinks. Tacos came out soggy. Guacamole was super cold, almost as if it was frozen. Service was awful, and we were the only ones in the restaurant. So sad, I really wanted this peace to be good.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wx6jDbHcsfFPora2MMo6lA"
  },
  "0b3MV3G6y14MsEtIfU-Uuw": {
    "date": "4/19/2015",
    "text": "Great Food and unbelievably low prices !! I checked into the hotel late at night, after 11PM but they were serving a limited menu at the bar.   I got the Guacamole, which was very fresh, some of the best I have ever eaten, ( I'm from San Antonio and know good Guacamole).   a large portion and a good price.  The chips and two types of hot sauce which came with it were great as well.  I especially loved the green hot sauce.    This morning I got breakfast which was also superior.   Wonderful server.  I tried the yogurt with fresh fruit and granola. Loved it.  Everything is very fresh and beautifully presented.  The server. recommended the Chorizo con Huevos  which I was a bit hesitant to order since chorizo can be very greasy.  She said that it was from a local company and was very good.  She was right.  The chorizo was perfectly seasoned and not greasy and came with homemade tortillas, potatoes and beans. For $7!!!  Can't wait to try dinner.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pg4JOcgHLvldvIXaR87Nmw",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States. Yogurt, granola and fruit with cream.  Only $5.  Very delicious.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pg4JOcgHLvldvIXaR87Nmw/o.jpg"
      },
      {
        "img_id": "6cxfIxz7x5tzn6DfJSzhoA",
        "caption": "Photo of Tranquilo - Phoenix, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6cxfIxz7x5tzn6DfJSzhoA/o.jpg"
      }
    ],
    "user_id": "yQoLmEXrxecCZF9p4lBcPg"
  },
  "pHtjKymZsibgUcR8D1tc8w": {
    "date": "9/25/2016",
    "text": "I have only had breakfast here a few times with the breakfast voucher that you get from staying at the attached Clarendon hotel. I am looking forward to dinner one of these visits. Each time overly impresses me.  I really enjoy this last visit to prompt a review; the spicy Bloody Mary as well as the perfect portion of half chiliquilias was delicious!!!!!  My server whom I had at the Bartop; Jess is Amazing!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BjiDlVbN4AsDEwVoNWuf-Q"
  },
  "DcDAvDPxxM5LIBCM5PTVUw": {
    "date": "4/23/2016",
    "text": "I usually don't write bad reviews. We stayed at the Clarendon so we had breakfast here one day. It wasn't very crowded and they said they could accommodate my allergies and celiac. But there wasn't anything on the menu I could eat.  In situations like that, I usually will just ask for a hard boiled egg or an omelette made in a separate pan and this has never been an issue in my life. But here, they only make hard boiled eggs at lunch. And they only make omelettes on the weekend. And they only have good customer service on days that don't end in 'y'. According to our waiter, they stick to \"basic egg cooking methods.\"   So I got poached eggs that tasted like vinegar. I didn't finish them. My husband is not a picky eater at all and he said his meal was soggy and bad. The service was pretty bad .... We asked for refills on tea and they never came .... Even though we had vouchers for free breakfast, we never went back.  (My husband did order dinner twice while at the pool and he said both meals were fine then. So I'm assuming there are different people working at night.)",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "9QMPOB3vXULM7EtLHvsUiw"
  },
  "yg0NjGbp_v_LOPw4-6dhbw": {
    "date": "2/15/2015",
    "text": "Well, sad to say, though I've eaten at Gallo Blanco probably 30+ times, I was shocked to hear they left the Clarendon. Call me Lives Under a Rock. No, I don't read the paper... I was there less than a month ago to celebrate my little big girl's birthday with yummy crepes. Today she said, \"Mommy Yummy Crepes!\" Sad sad sad face.    So here's the good, coffee is still great. As a self-confessed addict, that is a must for any breakfast restaurant. The mimosas are quite nice, not too much orange juice if you know what I mean!  The corn tortillas still have that homemade kind of feel, but they need to be cooked longer. The chorizo and eggs were tasty enough and I especially enjoyed the whole beans.   Here's the bad, potatoes. Not sure what was going on there. They are small itty bitty diced things. So small that when fried, they are basically just hard bits of greasy crunch. They had random slices of onions and peppers mixed in as an after thought which were cooked al dente compared to the over cooked pototoes.   The service wasn't what I was used to from before. Not particularly friendly. Could be that they were stressed over the latest turn of events. But the place was half empty and it took forever to get our food. Seems if the new place wants to garner favor, they should have been warmly warming up my coffee. No such luck.  As this is one of my go to neighborhood places, I'm hoping Clarendon gets it together. I'll be keeping an eye on yelp and see if it improves.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "tRa166LrObdUxi0RscuVuw"
  },
  "JsMJikaBknQE8IxFU1Rlaw": {
    "date": "7/4/2015",
    "text": "Came here for brunch and had the flapjacks. It came with 2 and they were good and pretty large. Had a mimosa and tasted good and just the right amount of alcohol. The atmosphere was nice. It was busy when we got here and had to wait a few mins to be seated which was fine. The hostess was nice and informed us of our wait time and we were seated in less time then she stated originally. Good place for food and to relax.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mg_qKy0KMZpJzONLCo0EjQ"
  },
  "bfHm41b2bQzD49Zaz9-rXw": {
    "date": "11/6/2015",
    "text": "Drinks were so good, limon chingon, margaritas, Bloody Mary and the tacos ! Guacamole was Delish also",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ctq2vi34iSOn3SDWz3Ubmg"
  },
  "0AA5Ax9qE9oBqH8r_2m62Q": {
    "date": "11/21/2015",
    "text": "I've been here a few times and the food has always been fantastic. The service has also been terrific.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "osB45uf_eVRDpAE9VPU-Zg"
  },
  "nM4MaORau1YdwsnbFpq6hQ": {
    "date": "6/18/2015",
    "text": "Uch, I cannot get over how mediocre/borderline bad this place is. This had nothing to do with Gallo Blanco goggles either. The tacos are just ok- chewy bland meat, dry chicken, overly salted everything. I decided to give it another try today despite our bla first visit, because I REALLY wanted to like it. My husband ordered the Pollo Asado platter and the chicken breasts, pounded super flat, were dry as a bone! He ate about three bites and was done. I had a salad, which was fine- but it's a salad- you don't have to cook salad. We ordered two desserts which came with ice cream. When they brought out the dessert, we asked about the ice cream and the server went to check - coming back to say they \"don't even sell ice cream.\" I pointed to the specials board in the back of the restaurant and it clearly said \"with ice cream.\" To this she replied, \"oh yeah we have to erase that.\" The brownie dessert was so bad- I mean dry as a bone crumbly terrible bad. I'm pregnant and eat almost anything- especially chocolate brownie- and I wanted nothing to do with this thing. Maybe the ice cream could have hidden it. On top of everything, the service was SO painfully slow for the restaurant being near early. After we ordered, it took almost thirty minutes to get our food and another thirty after that between waiting for dessert, check, etc. The first thing I did after my meal was text another foodie friend to tell her to stay away! So so so sad :(",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N_GCDLRq_EssIY-wStxOoQ"
  },
  "2h7JRfdUiu-mWIp7NZ6z0Q": {
    "date": "6/9/2015",
    "text": "The food was delightful but the service made me never want to go back again. You should never feel like dining somewhere is an inconvenience. From the start the host Marshall was very rude. I always give people the benefit of the doubt because I've worked in customer service and sometimes people just have bad days but his attitude was unacceptable. We had a party of 7 that was staying at the hotel come down for breakfast. This was apparently this was too much for him to handle. He sat us outside in the direct sun (which he didn't ask if this was ok and its June in Phoenix) and the tables we extremely hot. We had to sit at two different tables which we were ok with but once more tables opened up inside we asked him if we could put some together and he just walked away from us when we asked the question. At this point one of us went to the front desk to complain about this issue but they did not do anything to resolve it. The whole time he made it seem like we were the rude ones. I felt extremely uncomfortable.  We did have an amazing waitress Jessa who jumped in and made sure our table was taken care of. She was the only part of the experience that was worth mentioning.  With all this said I will probably not go back to the restaurant when we stay again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cNSk5j_k6Kkp2t_dEDGMAQ"
  },
  "gkw0n7tfnB4NhIawYphUfA": {
    "date": "6/17/2015",
    "text": "Visited on a Tuesday morning.  This is the best home style Mexican bistro cooking I've had in a long time in a clean and edgy setting.  The cook has prepared such delicious things as homemade salsas, roasted corn and cheese appetizers, delicious and interesting salads and tasty fresh guacamole accented with pomegranate seeds.  The chilaquiles plate was very delicous.  The watermelon cooler drink was refreshing and superb on a hot June day.  I only rate 4 stars for two reasons:  one of the newer waitresses didn't seem very interested in our table but I saw the others were hustling and later was informed the waitress was in training.  And secondly the temperature near the window was very warm.  If you are interested in trying some freshly prepared and interesting and scrumptious cuisine in a cute environment, I highly recommend.  The ambiance was also very nice there, eclectic music in the background and modern decor.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "quVSDW-DdbxoQRfPw5kY9A"
  }
}