{
  "rZVjilqsxs7p3KFMVo3pRw": {
    "date": "5/3/2014",
    "text": "Mustard leaves wraps were delicious, pumpkin  prawn curry was excellent , chicken wrapped in eggplant was very creative and tasty , could not resist the coconut ice cream. The gracious hostess Moi and wonderful staff make this place to my must come back list",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qD81ZwKgAS-DW_6YH91gSg",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qD81ZwKgAS-DW_6YH91gSg/o.jpg"
      },
      {
        "img_id": "Dux5QAacRpcoGb2KGmdr2Q",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Excellent thai good with a gracious hostess and wonderful service",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Dux5QAacRpcoGb2KGmdr2Q/o.jpg"
      }
    ],
    "user_id": "PcZkNGVDJVbowHwbrRyl1A"
  },
  "m-i9n1vpkpsZ_64DZ-uS-w": {
    "date": "2/21/2013",
    "text": "This place has Americanized Thai food from central Thailand. I do give them props for making Khao niao available on the menu as this is a rarity for the city dwellers in Bangkok. (Just as you can tell if someone is from the East coat or down south by their dialect, you can also tell where they are from by what they eat/cook) I heard the owners talk and they were speaking proper Thai with little slang, this is how I know where they were from.  The larb left out many of the necessary flavours. It was bland, and did not have the nuttiness from the toasted rice. I had to request extra fish sauce and red pepper to be added.  There won't be a next time because I cannot stand paying for butchered Isan food. This is definitely a farang restaurant.   Sorry, but chun sanook maak mai dai.",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "1HRvVamS8OZ2NFEUSSLSBQ"
  },
  "ucpwQEnS3lWM_EqVSiq2PA": {
    "date": "5/4/2014",
    "text": "Still my favorite Thai restaurant in the valley. Every dish is perfectly cooked, meticulously presented and mouthwateringly good. Not your average dishes so be adventurous. The wait staff will gladly explain any and all dishes. Not too spicy, unless you want it to be, but packed full of flavor. The portions are not huge...they favor quality over quantity...but its not expensive either.  Great location, cold modern interior, this is a 'must try' gastronomic delight.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kchTM2GB-t4yUrdzt_yzPw"
  },
  "IckpxaA4UtA-cAu0Vcu-oA": {
    "date": "3/6/2014",
    "text": "Drinks are inventive and well poured. The food is excellent. Roti and chicken satay with peanut sauce.  Mango and sticky rice for dessert.  Small outside area that is comfortable and on parking side so it's quiet.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c7NsL0IWlPDLEdjuUGORTA"
  },
  "7RiE0X7Y6GRwz03YVsapLg": {
    "date": "8/27/2016",
    "text": "Yum! Loved the cocktails, loved the food, and appreciated the friendly service. We will SO be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2abm_8wxPxYtXmDUbvix9w"
  },
  "MVfznBUN306hmW3IeTv_ew": {
    "date": "11/23/2013",
    "text": "We went in for the first time two Friday's ago and had the most amazing meal.  I had the port shoulder and asparagus.  It was delicious and spicy, just the way I like it.  It's a more modern take on the traditional thai menu that I appreciate.  We always sit at the bar because we like talking to the bartender.  She is really friendly and has lots of helpful tips about the menu.  I would have given the restaurant five stars, but I took one star away because we went in again last night and I was not impressed with the drunken beef entree.  Kind of bland.  However, the indian bread and beef appetizer is delicious.  Overall this is our new favorite local hangout.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xHOiHYbYwJeXjxTrHK2oxw",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Pork shoulder with asparagus.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xHOiHYbYwJeXjxTrHK2oxw/o.jpg"
      }
    ],
    "user_id": "cD76r8Rfg7xcUqso9HEjSA"
  },
  "tmFqmXZgqHtGc6UB982OTw": {
    "date": "8/2/2015",
    "text": "I didn't like Thai until I discovered this place! Everything tastes so fresh and delicious. Love the wide rice noodles and crispy vegetables including lightly crisped basil leaves. Everyone I have taken there says it's the best Thai place they have ever been. Also, the place has a nice feel to it. Just a note - They aren't open all day so check before heading over.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kjfBvZlRzs1_7vdp7SZbeg"
  },
  "CR8EmKtmleXmKWzw5nDWUg": {
    "date": "3/8/2011",
    "text": "This is a quaint little restaurant tucked away in the Shops at Gainey Village.  I must have passed by it 3 times while my friend watched and laughed....one of those days, I guess.  Very well decorated and mirrors along the sides of the space and loft-like ceilings make it more spacious than it really is.  Staff is courteous, but not clingy, which is nice.  I had a chicken yellow curry and my friend had a spicy pork dish.  My curry was nice and spicy, yet very flavorful.  I love the addition of cucumber salad on the side.  It is a very pretty dish. The sweet fried onions sprinkled on top of the curry was a nice touch as well.  It really balanced out how spicy the curry was.  The Thai Milk tea helps with that too.   Will definitely be back for dinner to check out more food!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "8zLHoFuAKCY29xyTfbUErQ",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Yellow curry chicken",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8zLHoFuAKCY29xyTfbUErQ/o.jpg"
      }
    ],
    "user_id": "DSDL_v5dvLOIJ-o5sRhz4w"
  },
  "ERr-B2s6Qq2Yoa2IdMC7OA": {
    "date": "1/17/2017",
    "text": "Best Thai food in town!!!  Service and food were both  A+. There happy hour menu is very resonable. Try the pad thai and fried rice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Uxx3vy4-jVKPB0pyvE__g"
  },
  "0CuWA2iITtzKnLcowK8N4g": {
    "date": "3/3/2016",
    "text": "My office is a block away and this is a great lunch stop. They have lunch specials, flavorful ice tea, and respect the need to get back to work in a timely manner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yq2FEPCGALgF0ZpndRdapw"
  },
  "Qg-vjUwf38QHEkvFCs-awQ": {
    "date": "3/30/2017",
    "text": "I had a movie director visiting and took him to Soi 4. He left an expensive cashmere blazer on the back of his chair. The restaurant said that it could not find it. That is not True. I am surprised that a restaurant in this area would do this.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2l6-o6N_0-9zYCseHcE9-Q"
  },
  "t8dLm-5JhhYI7YP74L27sQ": {
    "date": "4/3/2015",
    "text": "Went for lunch on a Friday afternoon.  Nice decor, very classy/trendy looking inside. Good beer selection. Had the vegetable rolls for an appy, and the Pad Ke-Mao, very tasty w/ steak and basil.  Recommended for Thai fans.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CJqgUQeWhdgbDyLAFy7xvQ"
  },
  "h8532gkLdfbXvHCNETYIHA": {
    "date": "1/31/2013",
    "text": "Ok, ok, ok, when I first tried the steamed pork wontons and the mixfood seafood soup I did not have high expectations for the rest of my meal. I had read about Soi 4 having delicious Thai and I was excited, so the first two things I tried were a let down.   But, when the crab fried rice and the stir fried steak with onion rings came my opinion definitely changed. The steak was cooked perfectly and the onion rings were amazing. I could have literally ordered another plate and would have finished it completely. If I went back again I would like to try another starter and maybe a salad, but I would have to get the steak again, it's too good to pass up.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "JaWyPlPiQajclZbaa19PDg"
  },
  "pTnHFJaxAQnYutvVTCmyZQ": {
    "date": "2/10/2017",
    "text": "Maybe it's better if you eat in because there are a lot of very good reviews for this place, but I had some food delivered through ubereats and it was really bad. The pork dish had no flavor at all and the meat was chewy. The sea bass reminded me of a soggy microwave breaded fish from the grocery store. I would not order again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VzKXFFBjxf-CDBDeWl0GWg"
  },
  "BdEGi3WBrw7AItbhkithGQ": {
    "date": "12/23/2015",
    "text": "Greatest Thai Food on this planet we call Earth!!!..... No really!  I have no more to say.  PS - Get the Gai Kua with Chicken.  *Dont forget to ask for the spice tray!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lCzmwExbiUFEOKjUSCvBXw"
  },
  "H_iAjyUPLCXkS9ay1kvevA": {
    "date": "8/27/2014",
    "text": "Jack talk Thai? Jack talk Thai, real well.  Great Thai, in the higher priced to portion sized but worth it.  Drinks are no joke, a double is $24, so idk if that's the best place to drink it up, but the food is the best Thai I've had in AZ.  ROTI,Pad Thai, Garlic Shrimp all really good, Plus probably the most beautiful hostess I've ever seen.  Enjoy",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SCKAqGeP3H9PFLnfnnVYfQ"
  },
  "jI2WnYphh8mdeZZ9kN_uIg": {
    "date": "11/16/2013",
    "text": "If you want a typical Thai restaurant with 15 generic noodle dishes then this is not the place for you.   If instead you like variety of creative and delicious options then you will love this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wYG3U9H63XKDrrb1d1QJ0g"
  },
  "FYDqogZWYSSeV4sAyfgeOA": {
    "date": "4/13/2013",
    "text": "My 3 girlfriends and I recently had a birthday dinner celebration at SOI4 and we had such a wonderful time there. The staff was so friendly and attentive from start to finish. The decor was modern, simple and stylish.  We loved sitting right by the open patio which was quiet and breezy.  We arrived early enough to enjoy happy hour appetizers and drinks.   We tried all the happy hour appetizers and so glad we did.  Standout appetizer for me was grilled veggies on top of an indian fry bread with green curry sauce - don't remember the name but it was so different and so good!   For dinner we shared crispy whole fish, chicken satay, shortribs in panang sauce, prawns and pumkin in a red curry sauce and crab fried rice.   Every single dish was perfectly cooked, well seasoned and so delicious.  The crab fried rice is amazing - I could eat that every night!  We were totally stuffed but had room for two deserts - sticky rice with mango and coconut ice cream which they comped for my friend's birthday.  We literally rolled out of SOI4 3 hours later completely happy, stuffed and satisfied.    Looking forward to taking my husband here for date night very soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "C941yxQI9LSAaiFKZg5EVw"
  },
  "pmrYCgqFGPztQxQha-SW8w": {
    "date": "9/4/2015",
    "text": "I came here for lunch and thought this place was really good.  I am not a huge fan of Thai food but, everything here was delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P501CvOohbV8XmteH5_cDg"
  },
  "L7DT3yPEpMgB4N5wqPUasw": {
    "date": "4/28/2013",
    "text": "This is not authentic Thai food, but that does not at all mean it isn't truly excellent ... because it is. Look, I was born a Jew but I've never practiced the religion - does the lack of integrity to my roots mean I should be avoided? Of course not.  Heck, my friends surely love me, just like you will love Soi 4!  The dishes here are creative, wholesome, delicious and made from high quality ingredients. And I love the mellow countenance of the staff people.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tFgmSUJyJjMIKES6d4etvQ",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Looking into the restaurant from the front patio.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tFgmSUJyJjMIKES6d4etvQ/o.jpg"
      }
    ],
    "user_id": "XOGeSobgYIw-y57yW2ypfA"
  },
  "t8vL1VLUBMfjX0LJoZOyaw": {
    "date": "1/7/2017",
    "text": "I love Thai food so I was very excited to try this place. It is somewhat casual with a nice comfortable ambiance.  Service was very good. They have a happy hour so try and hit that as this is a Thai restaurant in the middle of Scottsdale and the prices do reflect that.  We did a few dishes from the hh menu and then ordered family style from the regular menu.  Pad Thai and pineapple rice were delicious as was the Panung Neur.  Really delicious flavors, but I do wish the dishes were a little larger. They offer take out as well and they have plenty of parking.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G10ZWrbL6xT-2CK1UxczbQ"
  },
  "zX70vD_ZYNljDmZcdr6s_w": {
    "date": "11/17/2017",
    "text": "So far so good! We just sat down right at 5 pm which is when they reopen for the evening. So far the service has been great. We have seafood salad which is awesome. We also got chicken Satay which was fresh. The complimentary wine celebrating 7 years was really good. The main course of Thai chicken and cashew was almost completely authentic with the only exception being the cucumbers which I have never seen in chicken and cashew. Overall one of the best Thai restaurants we have been to",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xFQOMduGADTezup4u6ODnw"
  },
  "bg9DiXf2ssY0D4CVS99TgA": {
    "date": "11/10/2016",
    "text": "Outta this world!!!....   Soi4 is a must visit for dinner if you've never been. The quality of food is completely top shelf.  If you enjoy Thai food, you won't ever be disappointed.  The dthom kai gai soup is totally off the hook along with Pad Thai!   These folks have done their homework.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "TzOIgv1YU_FmPxOkPeYRkg"
  },
  "7lv-gmhJI6-lGJh6Y0ZVkA": {
    "date": "8/21/2016",
    "text": "Pretty great food in a trendy setting with incredible service, our waitress was quite attentive and kind.  Had the Plamuk Tod as a starter, I'm still raving about the sriracha-chili vinaigrette, it was delicious.  My entree, Panang Neur, was a recommendation from our waitress and fantastic.  Any curry fan should try this dish, it was perfectly prepared and utterly delicious.  While on the pricier side, this place is great for innovative fare. Will be back for sure.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "-8IE2xzOvjzm5yFvM9NfKg",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Panang Neur, really great dish",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-8IE2xzOvjzm5yFvM9NfKg/o.jpg"
      }
    ],
    "user_id": "WVxADgC3NTaPCNU_8LuSyQ"
  },
  "MGJrY9nFDdsR4Crn678Z3Q": {
    "date": "9/19/2015",
    "text": "The atmosphere and service was great.  The  vegetable ingredients were of a high quality.  Food concept and menu choices were on point.  This place just needs improvement on execution.  Here is how they fell short.  #1. When the server delivered our food, her thumb was directly on the inside of all of our food plates.  This is a huge, no, no......  #2. Portions were extremely small.  I understand \"lunch size\" portions,  but I saw the disappointment on all 6 of my male coworkers faces when their dishes were set in front of them.  #3. I had the Pad Ke-Mao.  Pictures looked great on other Yelp reviews.  My disappointment came when I had a dish of over cooked, soggy noodles set in front of me. Bummer right?  The skirt steak, we all know, is not one of the better cuts of meat, but it shouldn't end up in your napkin because you just couldn't chew it any more.  Would I go back? Yes.  I think maybe they had a bad day.  It happens.  This place would have rocked if the portions were a bit bigger and the noodles cooked properly.  They had a super tasty condiment selection with little peppers in vinegar and other chili and pepper pastes as well.  I will probably try happy hour next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qVwJzThLi3AEa5mRWXeE8Q",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qVwJzThLi3AEa5mRWXeE8Q/o.jpg"
      }
    ],
    "user_id": "krLnUW1pmvUUdCdD_wGSAg"
  },
  "cwrRoqsgsYhjjc4BBLdaRw": {
    "date": "8/9/2017",
    "text": "I used to eat at Soi 4 four to five times a week from the day they opened a few years ago. The last three times I've eaten here were just okay but I brought a friend to eat here tonight and it was very disappointing.  I've eaten the same dish about a hundred times but tonight it wasn't good. The chicken was tough and fatty and there was a ton of black pepper on top (never had it poured on like that) and when I told the server she wanted to argue as opposed to make it right. She was sub par as a server anyway so we paid the bill and left.  I'm not sure if the same family owns this but it's not the same. I will not recommend Soi 4 ever again nor will I eat there again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "grhSy3MyHWCZ-2LtSLYGcA"
  },
  "jMtPuM8em-fHZ2kLKFzl_A": {
    "date": "5/11/2018",
    "text": "Love this place!! Finally some authentic, delicious Thai food! Coming from someone who knows Thai food as family is from Bangkok, this is good! The service is great too!!! You won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WQ3pfxwljkbelMjAZHiv8g"
  },
  "YhxM2vD_lUpLrQUQQ-hsgg": {
    "date": "9/30/2017",
    "text": "The pad Thai is amazing, along with the pad see ew and spring rolls. Really really good food, the service isn't terrible, but it could be a bit friendlier. The food is so good that it doesn't really matter tho.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i4zlrngUfDASv0bwrB8pjQ"
  },
  "B3KLE3UrAzqU8YxXAE66Gw": {
    "date": "11/26/2014",
    "text": "I visited Soi 4 today for lunch with my boss, who is a \"regular.\" I love Thai food and trying new restaurants so I was excited to check it out - plus I was super hungry!   I was not disappointed. My boss and I both got the \"happy hour\" lunch curry for only $7. You pick the meat you want and then yellow, red or green curry. I got the yellow chicken curry while my boss got the red beef curry.   Both came out of the kitchen very quickly and was played very simply - with a generous portion of jasmine rice and curry. Mine came with fingerling potatoes and onions while my boss's had green beans and squash.  The curry was fantastic - super flavorful and fresh and the portion was perfect! Did I tell you it was only $7. AMAZING!   I will definitely be back and can't wait to try their other menu items!   The service was great and atmosphere/decor is very nice as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1Bga49Vx_lUFsB01g6s30A",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Red Beef Curry - happy hour lunch - $7",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1Bga49Vx_lUFsB01g6s30A/o.jpg"
      },
      {
        "img_id": "wu21ZJXVc_1lpyrFMgsYEg",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Green Chicken Curry lunch happy hour - $7",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wu21ZJXVc_1lpyrFMgsYEg/o.jpg"
      }
    ],
    "user_id": "VU2lpEyNSp16Gk8Ujrkiqw"
  },
  "AH6ztqdH1xxQh_y7pA2kfw": {
    "date": "10/29/2017",
    "text": "It's a cute place with a great staff.  This is not the best Thai food I've had in general, but it is the best I've had in Scottsdale. It's convenient, so I come here all the time or pick up food to go.  I'm addicted to their pad Thai and their mango with sweet sticky rice! ...Although there was one time I ordered the mango with sticky rice, and the mango was bland, pale, and fibrous.  I'm just hoping it was an off day and won't happen again. Their curries are good but by no means authentic.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u0xVzfCIHo8HFX6oihj22Q"
  },
  "bE3nUUFBBRIT81fpmBZECw": {
    "date": "3/28/2017",
    "text": "Racism at its finest!  Why would you place 5 African American ladies (3 of which are doctors) upstairs in the back when there are perfectly good tables in the main dining area of a mostly empty restaurant?  That's only the beginning of being suspect.  It gets a little more suspect when the ladies ask to be moved to the table setup for 5 in the front at the window, but the hostess says the tables are reserved for a group that made a reservation and specifically asked for that table.  It all gets confirmed when a party of 6 is forced into the table that was setup for 5 and one of the ladies of my wife's group goes down to directly ask the party about their reservation upon which they say \"we didn't have a reservation and didn't request this table\"... and then it's topped off when the female manager acts as though she can't come to the table to explain the situation at the request of these African American Doctors.  If you truly have racial restrictions or don't respect the patronage of minorities or anyone else then just say it so we don't waste our time and wealth with the likes of you! Yes - I present myself with an alias on Yelp specifically for the reason of avoiding this type of overt racist treatment before I even get to the restaurant.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "vWkLOcA67wUI3BzuLI8oeQ"
  },
  "zhb_imN4C0BOSRTGHS0t7g": {
    "date": "10/19/2017",
    "text": "My partner and I had dinner the other night after dropping someone off at the airport. We were so impressed with the food and service we are thinking about going back again all the way from our winter home in Queen Creek. THE COCKTAILS WERE OFF THE CHARTS AND THE APPETIZERS PHENOMENAL. THE lady manager made us feel so welcome and we enjoyed our short rib Penang Curtis , Cordova fish dish and crab fried rice.  The place is spotless and the food quality is exceptional...  We are looking forward to going back!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BLhnP6lJJkS-I230OBEMlg"
  },
  "8qjlJgMjLh5hsRiF4yebrA": {
    "date": "5/1/2016",
    "text": "This place was really good and my best friend is Thai so I get authentic Thai frequently.   We had the corn cake appetizer, I had lightly breaded prawns, friends had: shrimp appetizer, tofu with green beans, & crab fried rice. Everything was very good and very well seasoned/flavorful!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1XH_9JX6SHUDaXNDeFqM_w"
  },
  "aUOqSBmiDmT2VykT3WJRcA": {
    "date": "2/28/2016",
    "text": "Visiting from New Jersey with a few golf buddies and we were excited about hitting up a nice Thai restaurant while on our golf vacation. Unfortunately, this one missed the mark by a long shot. I'm in the hospitality business myself, so I don't ever want to hurt another business so I'm doing this in the spirit of trying to be helpful.   It all started out well...a very friendly waitress and prompt seating but it all went downhill from there. My buddy orders a rum and coke and comes out with virtually no alcohol in it (a very light pour).   Then we decide to order dumplings only to hear they have run out of dumplings. A Thai restaurant on a Sat night at 8PM running out of dumplings?...unacceptable.   Then my buddy and I order the whole red snapper only to have the waitress come back a half hour AFTER we place our order to tell us \"sorry, we're also out of red snapper\". Again, for a Thai restaurant to be out of one of the main staples of Thai cuisine on a Sat night is just off and for the waitress to not know they were out or to not come back 5 mins after us placing the order is also unacceptable.   We then wait an inordinate amount of time for our food order to come out with the place not being all that busy and sadly, most of the food was rather uninspired or uninteresting.   The other bit of strangeness was that there was a basketball game on the TV while we're eating. In comes a group that I believe was friends or family with the owners. How sweet I initially thought until this group and the place suddenly morphed into the equivalent of a sports bar with cheering, yelling and jumping up and down. I didn't come to a Thai restaurant to have my meal and conversation interrupted by a basketball game or cheering fans.   To be honest, the waitress was all smiles all evening and I appreciated that but something was just off here. At a minimum they should have offered us a round of drinks or \"made it right\" by giving our table a free dessert or something, but what concerned me here was that the waitress was generally unaffected by what was going on which tells me this was just a normal night for them.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "0sKC11swy8jXRCVBGgPi4Q"
  },
  "bNtNA8EAugjwiK3emugZCA": {
    "date": "10/4/2016",
    "text": "Five stars for the ambience, not too fancy, not too casual. I just felt calm and at peace in there, weird! Service was good too. I haven't been to too many Thai restaurants to compare, but what was served tasted fresh and healthy, light yet filling. There's a separate vegetarian section on the menu, score! Only complaint, the portion size was too small, we ordered corn cakes and there were just three of them on the plate, how about at least 4 so people can share with some dignity!  The appetizers are steep but the entrees are reasonably priced but you have to order rice separately, disappointing.. Overall we had a good time celebrating Husband's birthday and I guess that's what that matters!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1XQMEszUNQHXbuTB83Z8Tg"
  },
  "txM59ZaXxA3nhPK1eJ3uoQ": {
    "date": "10/28/2017",
    "text": "With so many choices of Thai food in Scottsdale, I would avoid dining here. My biggest complaint is overpriced bad food. The lettuce wrap appetizer tasted like it came from COSTCO. I ordered the crispy chicken with green beans. What I got was overcooked chicken nuggets with Uncle Bens precooked rice. At $14.00 a plate. Life's too short to spend an evening eating bad food. The decor was very nice.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LEcbbPBolWqi7QF5To6mEA"
  },
  "Nt_6Vf4G7EEOsREsNNnusw": {
    "date": "12/4/2014",
    "text": "My wife and I visited Soi 4 when we were in Scottsdale and absolutely loved it. To start the atmosphere is modern and hip. I have to start by saying that I am not a big Thai food fan. I go to Bangkok Thailand a couple times a year and hardly ever even eat Thai food when I am there. My wife drug me here kicking and screaming because she loves Thai food. The menu was great...the service was great and I will return without complaining.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IYPLDnmWogUG1Y5FOTeoTA",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Ginger martini and appetizer",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IYPLDnmWogUG1Y5FOTeoTA/o.jpg"
      }
    ],
    "user_id": "UFeT5Jvd2UL2LSiKgj8Gmg"
  },
  "9hJHiBx-9Ka09WKYK9ol5Q": {
    "date": "7/12/2017",
    "text": "This place has the best food ever!  The atmosphere is modern and sheek.  The deserts are so awesome that I would go here just to eat them.   I give this place a 10 stars!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KWY0QyEXEMGh6xCB5oMUzg"
  },
  "Q7TWDTs9vHSRnipRKES1xQ": {
    "date": "9/13/2016",
    "text": "I have been to Soi 4 probably 5 times now and each time my experience is worthy of 5 stars.  I celebrated my birthday there last night with friends who had not been and they were blown away.  The service was amazing and the restaurant has a great vibe.  Some of my favorites: Miang Kum (get this no matter what), Pia Muk Tod (calamari), Dtom Kha Gai (soup served tableside), Kao Pad Pu (crab fried rice), Pad Thai (for your friends who aren't adventuresome, Panang Neur (braised beef ribs). They also do a whole fried fish (last night was red snapper) that they carve at the table and is amazing.  When you want to step out of your \"normal\" order go for the fish. For dessert the fried banana with coconut ice cream is drool worthy!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g3Kisu-mziBS9b3mGF8sVw"
  },
  "kzE05qjVZDBvo24JfB56OA": {
    "date": "3/3/2018",
    "text": "Excellent Thai food. Pineapple fried rice, steak roti, corn cakes, tamarind prawns, eggplant are all great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2g1fG5HAu-BKpX_RNnSEuQ"
  },
  "de2WBKZ_B2xXipOeVzczcA": {
    "date": "12/4/2013",
    "text": "We have been several times and have positive feelings about this place. The staff has always been friendly and efficient around us. In addition to the expected wine and beer there are some other adult beverages. I prefer wine although I realize beer is more typical. I have consumed Singha beer here if that helps. The wine is more than adequate. I note some reviewers express concern about untypical dishes. This is the USA and tastes vary from Thailand. As has been the case with Mexican and Chinese cuisines, change has to occur to meet market needs. I am not an expert on Thai food but have had a few meals in Bangkok and feel fine about the dishes here although I should add that hotels catering to foreigners there may not be wholly authentic. In any case, if you know Thai dishes by name you will find plenty to choose from. My wife and I have been happy with the results. Dining is more expensive here than other Thai places we have been here and elsewhere. This is high rent and generally nicer than usual which explains it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "D6SEKcIne80A0AhwiEV2Rg"
  },
  "lkBhA08ZyKRXRzIkLU5Npg": {
    "date": "5/5/2011",
    "text": "I had the Pad See Ew.  It was pretty mediocre - too sweet, slight burnt taste and not very flavorful.  Food presentation was lousy, just dumped on the plate without garnish.  Service was indifferent, even though there were few customers.  There are much better and still authentic Thai restaurants in town.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "X_FvczZAo8n8tD-GdpQ5RA"
  },
  "tzbPz1l5jKz1w6icK9qOiw": {
    "date": "10/1/2012",
    "text": "Loved the appetizer with with the mustard leaves it was terrific. Have dined here twice and both times I've really enjoyed the food. The atmosphere is very eclectic and you can actually hear your dinner partners speak. The food is tasty and fresh, I highly recommend it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LChpxlbc-SFhLlwdKFAHpA"
  },
  "N_liCSFb57GY8h8nH4FyTA": {
    "date": "2/20/2012",
    "text": "Went there last night with a friend to try the place. I think we got a waiter who was just dying to be fired, because if after our experience he wasn't fired right at the end of his shift, you may go through the same thing we did. For some odd reason, we got the \"server from hell\" with an attitude bigger than the restaurant itself. Who knows why....I sure don't. From the moment we sat down to shortly thereafter when we abruptly got up from our table and walked out, this idiot was rude, disrespectful, and not qualified to be anywhere near people. I kept looking for the camera thinking it was some kind of gag and we were on one of those network prank shows. Seriously. The \"manager\" tried to offer us another table on the way out and talked briefly to my friend who again explained everything this clown said, but I was in the car when that took place. The food aside, which he screwed up as well by bringing something we didn't order (BIG SURPRISE THERE), I wouldn't go back in this place if you dragged me screaming. Now, I know this is a \"waiter\" review, and not really a restaurant review. But, think about it. If the management has this person working there, what does that tell you. Right. If you go, I hope you enjoy your meal there with another person waiting on you. And you just might. Not me, I'm done with them. NEXT.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "juOJweJ9P4QYE2NEQkfBig"
  },
  "1NCxVRn2C7TTtPCnZorscw": {
    "date": "7/21/2014",
    "text": "We tried this restaurant after a recent newspaper restaurant review that was very favorable.  We went on a Friday evening after Happy Hour and ordered off the dinner menu.  From comments posted by other reviewers, we were prepared for the smaller portions and higher prices.  Overall food quality was good; dishes well prepared and tasty with complementary spices; decor was modern and appropriate for a Scottsdale location; and they were busy for a summer night.  We had already researched the menu options and ordered five entrees (for three adults) given that serving portions would be smaller.  Service was ok and competent.   Our favorite was the Pad Ke Mao which was the flat noodles with skirt steak.  The rating was lowered when we realized that our bill included a dish (Kha Gai Pot) that we had not ordered.  Would like to think it was just an innocent mistake on the restaurant's part, but we should have also checked our bill more closely.  Overall, good experience, but not high on our list to return.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pw094sYF_NRFo0sweBr52g"
  },
  "ixyuD8AHHJk_Nhj7jZNx_g": {
    "date": "12/22/2010",
    "text": "We just went there tonite.  As far as the interior, they did an excellent job...as far as the food...I will go back to our favorite in downtown Scottsdale!  The Tom ka gai could not compare, nor would I say any  of the entrees nor salads were anything to rave about.  Sorry!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-znBbADZqQ_30bWe6o6rKg"
  },
  "DeOrd88CZwyGH4LHjUhrHA": {
    "date": "12/20/2010",
    "text": "Excellent Thai, not the typical selections you see at most Thai places. Decor and overall atmosphere very hip. Prices are reasonable for what is truly an Asian gourmet meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "j4U0Yj0EPEA8neKCUe8yTw"
  },
  "qDfXqItclMAIb8DO7La3Jg": {
    "date": "8/26/2011",
    "text": "The food is delicious, and the staff was extremely polite. The interior is a really well-designed modern space. The prices at lunch are very affordable...$10 for most entrees, $7-9 for apps. I'm not sure how it gets listed at $$$?! The portions were kind of small, but understandable for the price. The only negative...I ordered my dish extra hot, and I was a little dissapointed that it didnt pack a lot of heat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "drnpxv6eMytXXBgabX8peg"
  },
  "uiGeEQLSnoSQDhHcQdQzVQ": {
    "date": "12/12/2010",
    "text": "Superb Thai restaurant; just about the best Thai food I have ever had. Try their Pad Thai or their Panang Curry, and their FBI (Fried Bananas and Ice Cream) for dessert. Once you try SOI4, you will be back again and again...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "38JCsIBE5chaNJWsRrhzdg"
  },
  "oGI2lxkYXhDDOLA3bJEgVA": {
    "date": "1/4/2011",
    "text": "This place is excellent.  I was in Bangkok last summer so I am very familiar with Thai food.  Very authentic.  Everying we ordered was great and the service was wonderful.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eITHbGdIkjCksctAMlmLLQ"
  },
  "q3oi5zU5maXJv0njg2P_PQ": {
    "date": "3/22/2011",
    "text": "Went for lunch today and have to say I was more than impressed by the flavors of the food.  Shared the shrimp and pork dumplings, had a hot beef dish with vegetables and my friend had diced chicken all really good and both served with rice.  Will go back for sure and try other things.  Service was attentive and the space is very nice...Could see it being loud inside if full as there are allot of hard surfaces..",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AX17szD411CCaZfXl2KTig"
  },
  "7JPy7i0CcXU61n_dzLtChw": {
    "date": "8/19/2011",
    "text": "The food is very good and the decor is nice.  Unfortunately, the service doesn't follow.  Our waiter messed up our order multiple times.  The bartender knows absolutely nothing about wine - don't ask for his recommendations.  The hostess is totally clueless.  The kitchen is the key, not the front of the house.   Looks like they need to totally rethink the staff outside of the kitchen.  Go and enjoy but don't be surprised to be frustrated.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GWGAv8h20-vkQi1U5rKhEw"
  },
  "vckFaX1fH-h-N9EgjMC62w": {
    "date": "1/9/2011",
    "text": "We got off to a rocky start, they were overwhelmed by their newfound success on a Saturday night.  We sat down and waited and waited and waited for someone, anyone to acknowledge our existence.  We were the only Asian folk there but I guess we're not their target audience...Just before we were about to leave they at least brought water - which had a bug in it.  Oh Well, it did just open so we ordered away.  The food is very good and nicely spicy.  The apps are excellent and the menu variety is nice and interesting.  My Thai wife approved.  The space is beautiful and let's face it the rent in Gainey village must be astronomical which explains their higher prices.(they even charge for rice - our sticky rice was old)  Once they iron out their service issues it should get much better.  I can get Thai food nearly as good for cheaper in Chandler where I live but for a date night out this place will do nicely.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y7NaaCb4AkNjpdHVLuPCaQ"
  },
  "LLN1QL1lyX0OsmWPUtnWeQ": {
    "date": "4/12/2011",
    "text": "Went to lunch at 11:45 and the restaurant was fairly empty. I was joined by two other companions. We ordered salads and \"wok-fried fresh tiger prawns and sweet mango in chili-basil sauce\". The prawn and mango dish was light and tasty. My salad was too spicy for my tastebuds. By the time we ordered dessert, the restaurant was busy. It took awhile for the waitress to come back and tell us they were out of the dessert that day, which was OK with us, so we asked for our bill Then several minutes later she came over and said they had the dessert and wanted to know what we wanted her to to do with it  We passed on it, but it still remained on our bill and we had to get it taken off.  My  next visit for lunch was a similar experience. Good food, but the waitress got our order wrong, even after I pointed to the item on the menu since she could not understand English. I had to send the food back. Food was good, ambiance is nice, but the service is slow. They need more waitresses, and ones that speak Engllish, as most of us do not speak Thai. I recommend that you go, as the food and atmosphere are pleasing  Just allow time for a leisurely lunch or dinner.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q1IJOoK33xccldy7EGnRXg"
  },
  "DiLIlqhYYfpK1zXNDY7m2Q": {
    "date": "2/21/2011",
    "text": "This place was amazing! I have been to Soi 4 in Oakland, CA (the original Soi 4) and the Scottsdale version is just as impressive. Eye catching decor, pleasant wait staff, mouth watering food...it had all the right stuff. You have to try the Kanom Pak Gard (Turnip Cakes), Roti (Grilled Indian Bread), and Kloie Tod w/ coconut ice cream (Fried Bananas). I was here for dinner last Saturday evening with a very large party and the waitstaff and management were very accommodating. It is a must try for the residents of Scottsdale!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qK0-BDYaN6PQ4_AWaFAHFg"
  },
  "uB4IpQ8UW35AN7vM9ErHFg": {
    "date": "9/21/2011",
    "text": "Great food, good service, cool place.  Overall the prices are so-so.  Certain dishes are definitely disproportionately expensive, and too small portioned.  But other dishes (like the roast issan chicken) are a great value, so it's a mixed bag.  Have gone for lunch a few times and enjoyed it very much, and stopped by for happy hour once a few weeks ago with friends.  Not going to lie, the drinks are overpriced. Period.  During happy hour, drinks revert from overpriced to acceptable, but not what you'd consider a happy hour \"deal.\"  That being said, their drinks are unique, strong, and damn good.  Skip the happy hour apps though.  We tried nearly all of them, and for some reason, they were a far cry from the quality of their standard dishes.  Overall we still like the place and it makes a nice every-once-in-a-while lunch for people who work in the area, and a good place to grab a few drinks on pay day.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VV4BxspKB8ajkK3pEs0Htw"
  },
  "uR2G3zYoTBCVbUuFM_0ZOQ": {
    "date": "4/2/2012",
    "text": "has become one of our favorite spots for the delicious mix of flavors and heat.  drinks are quite good as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nuB5btOpU57miZ1aUGhb-A"
  },
  "JMyR3R1tNWiqhU92jyJD7Q": {
    "date": "7/18/2011",
    "text": "My regulars list is a small one.  When venturing out to a new place, it's only after a great deal of research.  Chains and scene places, etc don't make the cut; places with great food, service and ambiance do.  That being said, Soi Four is a most welcome addition to that list.  Given the excellent architectural design, I would have been happy with passable to good food; yet everything we ordered was incredibly flavourful and balanced... much like the restaurant's design.  Service was expeditious.  I can't say it was excellent (it certainly wasn't bad); it was efficient, mostly friendly and we didn't feel overly rushed (it was a Friday evening after all).  In sum, happy to have this cosmopolitan, reasonably priced independent option, of which there seem to be far too few here!  It's the kind of dining experience I've come to expect after living in San Francisco and London.  My hat goes off to the owners/management for raising the bar.  Many, many thanks.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U6AblY2if6nUtyDlJ913tQ"
  },
  "ZZI11XgVfldMoQeFEr9fHg": {
    "date": "2/22/2015",
    "text": "Great experience, the mustard leaf appetizer was over the top as well as the sea bass entree. Great service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "65uAAJ72TUm0JHSja-qPxw"
  },
  "RbZ7P9p0Y6cWIxhepIEhVQ": {
    "date": "5/31/2011",
    "text": "We spotted this place after dinner at Chez Vous, and decided to check it out the very next day, and so glad we did! It was a slow saturday, only a few people when we arrived, very quite and chill environment, i absolutely loved the contemporary deco! We shared a spicy pork dish with asparagus, and a green curry plate with tofu and veggies. Both dishes were very flavorful, but the pork dish came in a bit less warm than we expected, and if only there was more juice/soup in that curry, we wouldn't have to dig for it. But overall the food was really good, and excellent services! We'd love to go back to explore some more!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "soc2J5OHH7V6JQ7t211Icg"
  },
  "1TM3FCK50hmzYWxR_ES7Kg": {
    "date": "9/10/2014",
    "text": "There are hundreds of Thai restaurants in the Scottsdale, but this has the ingredients of real Thai: authentic food, gentle atmosphere, respectful and attentive service. We recommend highly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jQBB3BG8FpnbzVtzAPPc3A"
  },
  "D6ZxNUiVxPtr1VSdm4G-QQ": {
    "date": "9/15/2011",
    "text": "Wow...this place is fantastic in every way!  The atmosphere is sleek, modern, warm, and gorgeous.  The staff is very friendly.  And the food...amazing.  I've been there for lunch, happy hour, and dinner.  All the meals I've had were prepared perfectly, and every dish was outstanding.  I particularly liked the catfish dish (don't know the real name of it) and the garlic noodles with clams dish.  The signature cocktails were nice, and the Thai iced coffee was smooth and tasty!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0eA25m6Oq9b2fcwupt8-hQ"
  },
  "rJh0W61VBOhJkCz-6H-L-g": {
    "date": "6/2/2011",
    "text": "After driving past this place a couple times, I finally decided to stumble in.  I was very happy with the service and the food. I highly recommend the coconut soup, it's to die for.  The presentation of my salmon dish was picture perfect. Love this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "YH8y8WjeGMUhsEY2M6FqBA"
  },
  "Wz8F7hFZGXDNw7XrX-mWLg": {
    "date": "2/24/2011",
    "text": "RUDEST staff ever!  My girlfriend made reservations for Saturday night via OpenTable. When we arrived, the hostess argued with her saying she couldn't have made reservations as SHE had the tables blocked until that morning and that SHE was the one who opened them back up so there was no way we could have had reservations. When my friend dumb-foundedly replied that she was sure she made reservations and attempted to pull them up on her iphone, the hostess turned her computer monitor around and pointed and said \"My tables are all blocked and you are not here\".  I was shocked!  In what society did this sort of attitude become acceptable?  What happened to \"I'm sorry m'am, I don't know what happened but your reservation is not appearing in our system.  Unfortunately we are booked solid so it could take an hour or so for a table\".  Things can and do happen.  That is OK.  But this sort of rudeness is simply intolerable.  I suppose it is best we weren't able to eat there, if the front people are this rude, imagine the rest of the staff!  No food is good enough to be treated like this.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "9RZhMr4znKKkxmGX7lDONw"
  },
  "uHNJDqMUx_bPTm9EPqp1pA": {
    "date": "9/18/2014",
    "text": "Stylish eatery, well presented and tasty offerings. Service is a bit slow, but waiter was knowledgeable and steered me away from a too spicy order, recommending a choice I was pleased with. We enjoyed our meal and will return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mZ7HTf1QfPJmJ1d17zwCHQ"
  },
  "chHvpql3tjkeBzd_dGXJ0Q": {
    "date": "4/19/2011",
    "text": "This place is great!  Very cool decor, great service, and great food.  The dumplings and the chicken with string beans were delicious!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "cMEtAiW60I5wE_vLfTxoJQ"
  },
  "jgeHY-BbutcnJMBfUz68eg": {
    "date": "8/14/2014",
    "text": "LOVE THIS PLACE! I've lived in NY and LA so I've had some really amazing, authentic Thai food. Soi 4 is flavorful, delicious and affordable. I eat here at least twice a month. One of my favorite restaurants in the valley. The ambience is really friendly and open. Highly recommend to anyone that enjoys yummy Thai food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YFR2h0z1QWOrvoG-j-FmTQ"
  },
  "UFN0lXZjEuAS0FHIkFa5FA": {
    "date": "12/16/2010",
    "text": "I have been to Soi 4 twice now!  Very excited that this place in in the valley, as it is always hard to find good Thai food once you leave either of the coasts.  This place has very tasty food and the restaurant is beautiful, chic and romantic, but not so much so that you're intimidated by it.  It has a good mix of casual flare.  Check it out!  The fried bananas with coconut ice cream and honey are especially memorable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "lcmxGGpW4WulZOHphSTBmg"
  },
  "FM-JftWGFZDLqx43vcAeHQ": {
    "date": "3/8/2013",
    "text": "The service here was awful.  She brought our salad and appetizers along with the dinner rice, which sat and got cold while we ate our first courses.  Then my hot pot came out.  Although I was not done with my appetizer, the waitress dished that out to get cold as well. About midway through my hot pot, she asked if I would like dessert and we realized she had not delivered my husbands dinner order to the kitchen, although she had repeated back the order to us.  Ten minutes after my meal was complete, my husband's dinner arrived.  We will not be back.  The food was not that good to endure watching one another eat.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "obXcVENhMYcwjhvSTGEFeA"
  },
  "TxQXnyA1NCyZLDK054loGg": {
    "date": "1/12/2011",
    "text": "Wonderfully different Thai restaurant in the heart of Scottsdale. I've been eating Thai food for 30 years all over the country and this one still had surprises for me. One cautionary - it can get pricey. Two of us at lunch, 1 appetizer (the turnip cakes are awesome) and 2 dishes was too much food (suggest 2 appetizers and 1 dish for solid eaters) and was a $40 total after tax and tip and only tea. BTW, it's towards the north end of the Gainey Center.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3IYOwOPo4zpnaYUu4VHXbw"
  },
  "WlA8cT9OZ0buKxF3tK08_Q": {
    "date": "2/6/2011",
    "text": "we've been here once for lunch on a Friday. we ordered a Pad Thai and a kieow wan talay. both were pretty darn delicious. we also had two thai-iced teas. those were winners in our book. service was just okay. nothing exceptional.  we're excited to return and see if they are still good the second time around. fingers crossed! :)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8qTbSxhUFVy2A4lcftYqXQ"
  },
  "hP_Q0vLSRICev7HkHfybGQ": {
    "date": "2/13/2011",
    "text": "This place has potential.....had reservations for 8pm, got there a little after. Our first impression walking through the door, is cool place, sexy atmosphere....we waited to be seated for about ten minutes. The hostess was dealing with an angry customer that thought the wait was too long- she handled it very well and in a professional manner. Waited a looong time for our server, and even longer for drinks. Seemed a little disorganized, and this was obviously our servers first serving job. The food was good, not great....nothing remarkable about the experience. Cool atmosphere, it just opened, so once they work the growing pains out, I might try it again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DIauPrmee9V2P8x7lC_vkA"
  },
  "mvvB9dMoIEwJsOzkZ2wUmQ": {
    "date": "12/12/2013",
    "text": "Nice enough atmosphere, but the food was just average, and I felt like they were charging a premium based solely on their location.  I wouldn't be against stopping in again if a friend wanted to try it, but otherwise I'm not drawn to go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Es9y0GOmk4CrtQdAra8uFA"
  },
  "FO2EFECyqeHWDVOFY_mMTA": {
    "date": "10/11/2011",
    "text": "First time at this spot just outside Gainey Ranch, but the food was amazing.  We shared an appetizer and then each chose an entree to split family style.  Everything surpassed our expectations (including the service).  We ordered 'Miang Kum' which are fresh cut mustard leaf wrap of roasted coconut, shrimp and sweet palm.  The main courses, though, were what is going to keep us coming back: 'Panang Neur'  which was panang red curry with beef short ribs;  'Kang Gari' the roasted chicken in yellow curry; and the pineapple fried rice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H0ddBzn_fENMQR-3_8vL0g"
  },
  "JJ_lLrmHsgW5TsWGoCvPjw": {
    "date": "6/18/2011",
    "text": "This place is suck!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X57oEvC_S5ijx31xj65d1g"
  },
  "-dEpCX20rrWNrg4yKPlZ4w": {
    "date": "8/27/2011",
    "text": "This must be one of the biggest restaurant secrets in Scottsdale.  I can't believe that Soi 4 isn't packed at all hours.  The food here is truly great.  If you're wary of spice, the kitchen can whip up mild iterations of dishes - if you're adept at eating the spicy goodness that has been bestowed upon us, the chef is proficient at adding those flavors to the food too.  I highly recommend starting off with the mustard leaf wrapped prawns.  Don't fool yourself into thinking that you're ordering lettuce wraps.  The sweet-spicy combo, and the Thai chilies are all unbelievable.  I have never had anything similar anywhere else.    In addition to the mustard leaf wrap appetizer, the Pad Se Ew and the yellow curry chicken are also phenomenal.   Even without having eaten more than six or seven different dishes on the menu, this has become one of my favorite restaurants to go to.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9-tnmxjeAsBZ0u0t2OgOFQ"
  },
  "FVdixYasBBYIPqdyzM4qxw": {
    "date": "4/30/2013",
    "text": "Best Thai ever. Anywhere! Dani and Ken the owners are there almost every night and will take care of you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UdipEXG7sYS_rfy9Kvty3A"
  },
  "l3TGz5RQM90xIxfv96NcSw": {
    "date": "1/13/2011",
    "text": "Easily capable of 5 stars I will hold that rating until after visiting again. The staff is great. The hostess/owner is a jewel in the dining room frequenting tables and graciously offering a beaming smile. The food is wonderful. Hitting all the right notes of Thai cuisine. The decor is beautiful and the seating invites conversation with neighbors, who I may add were warn and charming. We will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hADUTSKTOABdGv8dK7JBFg"
  },
  "5o86m81KxJD61mpK15lmZw": {
    "date": "8/26/2017",
    "text": "Went here for happy hour just to check it out. Tried their Thai wings.... outside crisp and boiling hot, the inside raw!!!! Check please... left!   No sense in trying anything, don't want to get sick.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "zMSapb9VmGKJFNRJUGJSqg"
  },
  "KPsMq_Wo8YEEF1bDlAcNwQ": {
    "date": "6/20/2018",
    "text": "Love this place. Great quality fresh Thai food. Been a couple of times and not disappointed. The service is also excellent and the cocktails yummy. Don't miss out on this little gem.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UllvNF6HkgDZf0tmuOwaEQ"
  },
  "s61WnByQGW-B1-7BHuY1pQ": {
    "date": "1/3/2019",
    "text": "This place is a cut above your typical Thai restaurant. They take familiar dishes and elevate them. We haven't had one thing on the menu that wasn't phenomenal. And because of this, we keep returning. I've had Thai in lots of cities, and this is my absolute favorite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pP1NiL_Y1bYNuNlNt6dLgA"
  },
  "pOvuAGhUlqbazDUc8cNQxA": {
    "date": "5/15/2018",
    "text": "Possibly I should give Soi 4 a 5* review. We have only been there twice and actually had never been to a Thai restaurant before. The people who work there are all very nice. The food is reasonably priced and very good. The two kinds of soup are exceptional. The pineapple and shrimp rice is fantastic. The wine is nicely priced at Happy Hour. It is a locally-owned establishment that goes out of their way to provide good food and good service. Maybe, after another visit or two we will move the rating up to 5*.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q3vdDPakx6_Y7gjhb1fpPg"
  },
  "xGfMdXxi7kgNOqWq0E_L9w": {
    "date": "11/19/2018",
    "text": "We went to Soi 4 at the recommendation of one of our good friends and we were not disappointed. Actually we were very satisfied with our experience at this upbeat Thai restaurant. The setting is quite contemporary and the service is excellent. Our appetizers consisting of the roti with skirt steak, chicken skewers, and the corn cakes were quite delicious. And the drunken noodles/beans with tofu were quite good as well. All in all, we really enjoyed ourselves and look forward to returning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HH1cE_wUTL4Zf4y0f11ZPw"
  },
  "Wr9ViFP0yg9gCReDBpydaQ": {
    "date": "3/3/2017",
    "text": "We absolutely love Soi4, it is our favorite and the BEST Thai restaurant in Phoenix Arizona.  I don't really want to call Soi4, Thai OR fusion, it's actually an eclectic, intermixture of fresh and piquant flavors and spices.  Here are our favorites   Bpeek Gai Tod Crispy chicken wings tossed in Thai chili glaze  Pla Muk Tod Thai fried calamari with sweet Sriracha-chilli vinaigrette  Larb Gai Salad of minced chicken, nuts, roasted rice, dried chili flakes, and fresh herbs.  Pla Sriracha Pan-seared Corvina seabass with garlic pepper sriracha sauce and vegetables  Pad Ped Pladook Stir-fried crispy catfish, green beans, squash, & wild ginger with aromatic red curry  Roti' bread and Coconut rice",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XSD_bPU2fLtHb2zhcHLRHQ",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XSD_bPU2fLtHb2zhcHLRHQ/o.jpg"
      }
    ],
    "user_id": "tyMIeKOh_3QEy5SaMXk6lw"
  },
  "QyTL6-0Vo14EjH5oiEgQ4w": {
    "date": "5/13/2017",
    "text": "Beautiful restaurant with dimly lit, trendy, Asian interior. There is seating on the ground floor as well as balcony. Service was good. They were quick, friendly, helpful. We came here for dinner during the weekday and had a reservation but don't think you'll need one if you're dining on a similar day. Food presentation is simple and well-constructed. They have a full bar. I ordered one of the cocktails, and I absolutely loved it. I could have drank 10 of the same drink. The food was mixed; some items were amazing while others were lacking. The Indian bread was a perfect mix of crunchy and soft and the taste left me desiring more. The steak in the Neur Namtok Salad was perfectly juice and flavorful. There was a chef's special: marinated chicken wrapped in pandan leaves. The chicken was extremely juicy, but the taste could have been better. We ordered other a la carte items but the fried meats were too soggy and didn't have much tasted.  Overall, great restaurant, service, drinks. Food also tasty but does have some room for improvement.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0slkblplfPombgvqEeqPWg",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Ground floor. Front view of restaurant from the back.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0slkblplfPombgvqEeqPWg/o.jpg"
      }
    ],
    "user_id": "uQ8n0xWLk-heB9D4NmqQgA"
  },
  "aI_1JDStUQV0dEuvueR2zA": {
    "date": "2/20/2016",
    "text": "Food was pretty good but the service was soooooo slow. Granted our group had 15 people but still it was pretty bad.   My wife and I both had the sea bass which was great...you can even spice it up with some peppers if you like (which I did).   However my friend who sat next had to send his sea bass back after a few bites when he discovered it was pretty under cooked. His girlfriend found a long black hair in her dinner (and sent hers back to the kitchen as well).  To add insult to the slow service and food issues, the restaurant charged my friend (who made the reservation) a \"cake service charge fee\" of $22.50 for us to cut and serve the cake that somebody brought for our friend's birthday. This was clearly the restaurants misguided way of \"thanking\" that person for bringing a large group to the restaurant and ensuring we won't EVER go to Soi 4 again. (See picture that shows the \"cake service charge\"...unbelievable).",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "zxNYflrjk4wxsCBWgMzmrA",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zxNYflrjk4wxsCBWgMzmrA/o.jpg"
      }
    ],
    "user_id": "CmW677QbmnRxJN2XuR6_bQ"
  },
  "LJdK0ip4N9wIkGTY4-GhGg": {
    "date": "5/5/2018",
    "text": "Wow. It hurts me to update this review with such a negative experience but wow. We are regulars here. Tonight we had bad food, horrible service, and a bad overall experience. Literally everyone around us sent their food back. Our regular dishes were bad. We had salmon, it was very over cooked and dry. The curry sauce and vegetables were literally cold like from the refrigerator. It took over 30 minutes to even place our order. We complained about our food, yet we never saw a manager, and the server admitted they had a new chef, but didn't offer any apology or anything. I feel completely ripped off for spending$100 bucks for bad thai food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3GBxQuOfkic77gm-JcBlFw"
  },
  "2zhkWpBNr0RhReTwK4KGCg": {
    "date": "1/27/2016",
    "text": "Really enjoyed this restaurant. I ordered the papaya salad and it was wonderful, although next time I would opt for no shrimps because the surcharge for adding shrimp was $4 and you only get 3 medicore pieces.. so that was a bummer. Other than that my entire party really enjoyed their food here. My bestie commented that although the place was good, it was a little too americanized for her taste which I could definitely see where she is coming from, nonetheless I enjoyed my salad and would come back to try more dishes.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "gkZvzzBl1kho3ya7wrqgHQ",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Papaya salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gkZvzzBl1kho3ya7wrqgHQ/o.jpg"
      }
    ],
    "user_id": "Hy_ko_2hkLTxvO7G0pIGsw"
  },
  "hs3g81LYKtpYgPxz0I8ZBw": {
    "date": "10/12/2018",
    "text": "Delicious food and the service was amazing! Muay C was so informative and gracious but wonderfully personable. Food is flavorful, gorgeous colors and textures!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XgEOeT2NrEL9lLVIo5CM4Q"
  },
  "mt9K87aFkhNKjv4gfulVRg": {
    "date": "12/7/2015",
    "text": "(Lyrics - Murray Head - One Night In Bangkok)  One dines at Soi Bangkok and the world's your oyster The bars are temples but the drinks ain't free You'll pick a rice with every entree plate And if you're hungry then the get a small plates please I can eat my eggrolls and the Yelping is up to me!  I've been here several years ago and back then I totally dig this place.  Needless to say, I still dig this place!    The restaurant is very well laid out and beautifully put together.  Service here is top notch and very helpful.  For our food we ordered the Calamari to start.  Overall, plating here is not lacking in any way and let's just say and the calamari itself was very meaty and crunchy atop a bed of grilled onions and carrots.  I didn't really care for the sweet and sour sauce it came with but that's just me.  For my entree I went for the BBQ chicken with green papaya salad and rice.  Needless to say, I was surprised to see it was half a chicken served with side of salad and rice.  Chicken was cooked to perfection and I had to bring half of it home.  I think next time I would have ordered something else like my two friends who ordered the Salmon served with red curry and crispy catfish with vegetables.  My favorite was probably the catfish; crispy to the bite and with a hint of curry spice and ginger.  The salmon was different cause I've never had it served with red curry, but it totally worked.    In the end, Soi 4 Bangkok Eatery is a must go if you're interested in traditional and new school Thai style cuisine.  Beautiful setting with good eats! - Enjoy!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 7,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "dX7_nDjAIsWXSPTVuRPuFw",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dX7_nDjAIsWXSPTVuRPuFw/o.jpg"
      },
      {
        "img_id": "1fRnOz5B-dkAfC1ghhbO6w",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1fRnOz5B-dkAfC1ghhbO6w/o.jpg"
      },
      {
        "img_id": "JSgiSMDFy6GmQBZeSc2b1w",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JSgiSMDFy6GmQBZeSc2b1w/o.jpg"
      }
    ],
    "user_id": "kjeX2RXvW7RhBbD2QLd5jA"
  },
  "pKXnPsuRwb_lJ-ENJ6T72A": {
    "date": "12/3/2015",
    "text": "I've only ever gotten takeout or DoorDash at Soi 4 and it's always been lick-your-plate-clean gooooood! I would classify this place as \"Modern Thai\" it's not trying to be authentic and their interpretation is done oh so well. I've tried the Khao Soi lunch special, the Bamee Talay, Gai Tai-Krai and the Panang Nuer. Everything has always been cooked perfectly and tastes amazing even after sitting in takeout containers for 15-20+ minutes. I'm overjoyed that they offer Khao Soi which is a Northern Thai dish, it's one of my absolutes faves and is very hard to find in Phoenix. The Panang Nuer which has melt in your mouth braised short ribs is another must have dish. Each dish I try from here has been better than the next. I will have no problem eating my way through their menu and continuing to try new dishes as it seems you really can't go wrong here.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "XiJ55iY0LEOl23ZstmGYsQ",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Khao Soi",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XiJ55iY0LEOl23ZstmGYsQ/o.jpg"
      }
    ],
    "user_id": "QG9ZJatKSWj5p5VrW3cfMA"
  },
  "E6vbbSYycCIybEHL3AkQDg": {
    "date": "9/17/2018",
    "text": "We (our party of 6) had booked a reservation for Saturday evening and all of us spent a wonderful 2.5-3 hours at Soi4.  The hostess and servers were exceptionally nice, cordial, and knowledgeable.  We thoroughly enjoyed a couple appetizers and we were guided through the menu with suggestions.  We all had a different entree and each of us was very pleased with our selection.  We really did not want to share!  Too good to give up even a bite!  (But we did, anyway!)  Beautifully, presented and delicious.  The atmosphere on the upstairs mezzanine was intimate and relaxing.  We did not want to leave! All of us enjoy Asian cuisine - we, now, have a new favorite place and we plan on making Soi4 a regular stop on our \"Asian rotation\".  (As you can see, I did not detail our selections......they were all outstanding and, we imagine, like the 6 entrees we had, every other one would be just as good.....I had the duck and, dare I say, will probably order it the next time I go.......loved it!) Thank you Soi4, for a memorable dinner......Gary W.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jf1DkcaSyhY07MuDBgEpEw"
  },
  "gMJmhxo5djq7v8ZxKINQ-Q": {
    "date": "12/31/2017",
    "text": "This is one of the best Thai restaurants we've been to in Phoenix or Scottsdale. The feel of the restaurant is cool,  the dishes are fresh and quite good.  The prices are very reasonable and the staff was great! We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WsP8QHk2BP7x-2wMwKbDeg"
  },
  "IlmmXNmesJvRFF3x1IXh9g": {
    "date": "10/13/2016",
    "text": "This is probably the best Thai food I've ever had. I've eaten here a lot, and every item I try is excellent. I started today with the crispy spring rolls (Paupia), which were very light and super flavorful. 5/5. We then had the light battered shrimp (Goong Makahm), which was in kind of a sweeter sauce. I don't quite know how to explain it, other then it was phenomenal. 5/5. The last thing we had was the wide noodles with skirt steak (Pad Ke-mao), Which was very savory in a brown sauce which included basil, garlic and chili. 5/5.                    This place has a great atmosphere and a very trendy Decour. Almost everyone who works here is Thai, and they are very proud of their restaurant and their service. I've eaten Thai food in just about every place in the United States, and this is the best, bar none. I'm not sure how the owner ended up in Arizona, but I'm glad that she did!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-PwBdF8y-z8XSu9JaLLZgg",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Trendy Decour with great atmosphere!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-PwBdF8y-z8XSu9JaLLZgg/o.jpg"
      },
      {
        "img_id": "Jc3qRVhqCooTikVXFhhD1A",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. The wide noodles with skirt steak in a savory brown sauce.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Jc3qRVhqCooTikVXFhhD1A/o.jpg"
      },
      {
        "img_id": "VI3L1gztqqb7i9N7KmP9mA",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Lightly battered shrimp with rice and a sweet sauce.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VI3L1gztqqb7i9N7KmP9mA/o.jpg"
      }
    ],
    "user_id": "ynGxfARCgSDdFTy27Z1nxQ"
  },
  "0PU2KrQ0V_Q13DS6M1lzBQ": {
    "date": "1/15/2018",
    "text": "Where do I begin the Ambiance is okay and somewhat modern I can see why it has a draw but other than that I would rather go get real good tie from a hole in the wall. Actually bought take out for my staff at my restaurant being cooks and chefs my guy is got different things that may be off the beaten path really wasn't good the meat was tough shrimp way over cooked not an experience I would go back to unfortunately what was supposed to be a green bean dish was diced green beans not the typical dish that was explained and I know my Thai food super disappointed won't be back",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YrKpGphRP2_jDbRW2sCyPQ"
  },
  "FRBIH73zBLhED9xILpTHbg": {
    "date": "10/28/2016",
    "text": "This is a really great Thai restaurant! They make dishes that I have never had before, and combine flavors that are very unique. I especially like the skirt steak with flat noodles and a hint of peanut sauce. I also really enjoy the calamari with sauteed onions and a very unique red sauce. Finally, they have an incredible chicken curry that sits in a very light broth. You can get it with a choice of jasmine rice or coconut rice. I prefer the coconut rice. Also, if you like to drink, they have a fully stocked bar and the bartender is very generous with his pours. All in all, this is one of the best Thai restaurants in The Phoenix area!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "OPgpF5z6jSH_MdGEcXhPlw",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Great Decour.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OPgpF5z6jSH_MdGEcXhPlw/o.jpg"
      },
      {
        "img_id": "nTjUEmAHfqtTDZYPT3_khg",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nTjUEmAHfqtTDZYPT3_khg/o.jpg"
      },
      {
        "img_id": "F-llpc1yFgn-KyGxqRuPlQ",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/F-llpc1yFgn-KyGxqRuPlQ/o.jpg"
      }
    ],
    "user_id": "VZ_AXsHgpjDsd-AqtMKy-A"
  },
  "lbXjCznpeV9_XfjtE0xoxg": {
    "date": "2/21/2018",
    "text": "Our go-to for the best Thai-fusion dishes. Has a great range of menu items and always service that caters to dietary restrictions.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9p__DIfrh1oUd9fqCdM7kg"
  },
  "n8Btf6FPVEeILN6lhQVquQ": {
    "date": "1/21/2018",
    "text": "Their Pad Ke-Mao is out of this world! I can't seem to order anything else on the menu because every time I come here, I have to order it. Ice tea is delicious. Service is good. Nice atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CeUBcrV1JHr2mTFiaCHGUg"
  },
  "CsboUehIR9pHhjaKvj-bWg": {
    "date": "1/20/2016",
    "text": "Nope, never coming here again. I came here with a party of 9 and ALL of us are severely disappointed with our gross oily food. I sent my pad Thai back because it tasted like NOTHING but oil. And I have never ever sent food back. Gross food. Teeny tiny portions. Seriously, where is the rest of my food... But with how gross it is I do let want it anyways. Gross. Boo. Also the service... Um, 40 minutes waiting for my drinks that contain NO alcohol is not ok. Yes they should have had rum in them but the weak juice that came out was pathetic.  90 minutes for my gross food. I sent it back when it was gross and never saw my server again. Yep NEVER COMING BACK. EVER  The good reviews I found online were completely misleading. Bummer I came here for my husbands birthday. This was a bust Oh and now the manager comes out.... Wow angry man you have issues. I didn't ask for you to come talk to my table. But here you are. No one is mad. We are laughing at how bad this place is and here you are being rude, I explain I am not refusing to pay but if he wants to know why I sent my food back I will tell him and he goes off on me saying that no other table is complaining. I ask why he is mad at me and my table and he gets ruder. Crazy. Avoid this place. Seriously. It's not as advertised.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "G96v5sKOh4s6k_BcqYqo6w"
  },
  "y5RTTW2Db32NUFhg5hBb-w": {
    "date": "8/7/2016",
    "text": "By far the best and most authentic Thai food I've ever had. I spent 2 months in Thailand and this place was fantastic. A little lacking on ambiance but the food was WOW.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sUz1xq2j6tx5bm41HuLTPA"
  },
  "76XBGMrY3c50gLfsFs9_7g": {
    "date": "1/20/2016",
    "text": "Ordered our meal 38 minutes after sitting down. Food came 1 hour 47 minutes after sitting down. The beef plate came with 3 skinny oily small pieces of beef. Noodles way over cooked. Expressed my dissatisfaction to the waitress who's resolve was to smile and say nothing.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "b5zwcsrxmTiaOHYUWIklSw",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Where&amp;#39;s the beef. Oh that&amp;#39;s right there is none. Or might as well be none.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/b5zwcsrxmTiaOHYUWIklSw/o.jpg"
      }
    ],
    "user_id": "MFaZwUpYfov0zAYnbTo6dw"
  },
  "PxOsOVD3-8QE2iUrQJ0pKg": {
    "date": "7/26/2016",
    "text": "One of my absolute favorite thai restaurants ever!!!! Amazing food, beautiful atmosphere",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-hPQU8OfxfztYZYgr5GTsw"
  },
  "abzlaeQ7wFuG3rWFksRKkg": {
    "date": "10/15/2015",
    "text": "it's not every day I eat Thai food, but it's pretty much amazing here. at least the catfish meal I had was. so much more than flavorful. I was supper pleased. and my colleague's beef bento box meal was the same.  I also had the fried mango and ice cream dessert - loved that too. and excellent service.  I wanted to come here again before leaving but had to try as many different spots as possible while in AZ. I was with you again in spirit tho, Soi 4...",
    "rating": 5,
    "rated": {
      "funny": 12,
      "useful": 18,
      "cool": 14
    },
    "photos": [],
    "user_id": "1DDDJAA6CJd2EsaV0B7GXA"
  },
  "uoN1ctEeOapW9y_ruCPyXQ": {
    "date": "7/24/2016",
    "text": "Great place! The trip started off a little sour when they had trouble getting the doors open and we were stuck in the 110 degree heat. But the in-laws wanted to show up right at opening. The food was delicious, my 2 year old devoured the calamari appetizer. Happy hour had some nice specials and we loved the crab fried rice (also a big hit with the kiddo) and the pad se ew (got it with beef instead-amazing!). But the best part was the service. They were so attentive and wonderful with the toddler. Even stopped by to wipe the table when I took her to the bathroom so she wouldn't get any food on her when she got back. Will definitely go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CY-TarXhp1OIiOt1-gmCrQ"
  },
  "ACPhGxsEggLIXWsiFARh-w": {
    "date": "2/13/2015",
    "text": "Went for lunch. The windows were open and it felt great.   The Miang Kum appetizer was delicious, with a terrific variety of good flavors.  The Somtum salad was crunchy and flavorful. The Dtom Kha Gai soup was very very good, especially the mushrooms eaten with the chicken. The broth was wonderful.   I got the Thai ice coffee. My wife got Thai ice tea. The tea was good, but the coffee was great!  The fried bananas and coconut ice cream were excellent. We also had the sticky rice and papaya for dessert. I was wondering how good that would be. It was much less sweet, like Asian desserts can be, but was also quite good.   The service was not bad at all, but was not as good as the food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MBWfPPRphtRM4rVoYTfOaw"
  },
  "hhR15uRf_iejtkTpN4Qveg": {
    "date": "7/30/2014",
    "text": "We dined here with some friends!! It was great I had the rice! My boyfriend could not get enough of the sticky rice? I enjoyed the drinks a well all of the desserts are delish.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Oz21pBYHtf1DkcqmcUhhAQ"
  },
  "cEa3IKW1miZw1umAMIMRYw": {
    "date": "10/6/2014",
    "text": "They were really outstanding last week,  The catfish salad, cooked crisp but with a savory cabbage and nuts.  Great combo.  The mustard leaf wraps, also wonderful Grilled veggies, great char taste with a flavorful curry sauce.  Yum, good as it gets here.  Also the bartender makes a damn good drink.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tJnY6lhStvS3aS5z07awpg"
  },
  "EWI8pmTDVWaehazptZfaGQ": {
    "date": "5/30/2014",
    "text": "We dined here on the recommendation of staff from the Hyatt across the street.  Modern yet warm ambiance, plus really good food and plenty of tasty veggie dishes and creative presentation.  Service was friendly and knowledgeable.  Cocktails and desserts were excellent too.  I really loved the warm sticky coconut rice with the best fresh mango I've ever eaten.  Overall a really great meal at reasonable prices.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UyoLQh30JaFm-4NRpBCD9Q"
  },
  "qcLYN4x7R_bq98hE9aK8Ag": {
    "date": "3/14/2015",
    "text": "One of the best Thai food I have ever eaten in Arizona . If u r a Thai food lover then u must try here. Try their Pad Thai & Egg Noodles. It's just out of d world . Glad I got this place after researching so many restaurants.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fQkeXu4qDJCzmjSQTn5OGw",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Egg Noodles",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fQkeXu4qDJCzmjSQTn5OGw/o.jpg"
      },
      {
        "img_id": "j1-ekVL10lmezhN9mdQW9A",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Pad Thai",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/j1-ekVL10lmezhN9mdQW9A/o.jpg"
      },
      {
        "img_id": "31_xTJ9Te9oe6M2yu5-xeQ",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Chicken Skewer",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/31_xTJ9Te9oe6M2yu5-xeQ/o.jpg"
      }
    ],
    "user_id": "shsqzfXpsrRZQkW3oZa81Q"
  },
  "RrdeFYZi-WYd_WQiZSrEXw": {
    "date": "8/26/2013",
    "text": "There's definitely a reason why Thailand is named \"The Land of Smiles\" :) What a fun and lively place. Service here is wonderful! I work very close to Soi 4, so you can imagine...I eat lunch here quite often. Our second time to the restaurant, all the servers recognized me and my co-worker the moment we stepped into the restaurant. Since then, we've been treated like family/friends every time we visit!  Pros: Great ambiance, GREAT service, fun lunch and happy hour specials  Cons: I do think their dishes are a tad bit Americanized. I'm South East Asian-American myself and grew up on some pretty authentic Thai dishes. Nonetheless, the dishes are still pretty satisfying.  What I recommend: Definitely get the Pad Kee Mao (it's a Thai basil and pepper stir fry with wide/flat rice noodles + your choice of protein). This is probably their best dish on the menu, and certainly my favorite. If you're familiar with other Thai restaurants around town, the Pad Kee Mao is most similar to the Drunken Noodle dishes in most other Thai shops. If you like a full-flavored dish, make sure to try this one!  I've also had their Pineapple Fried Rice with chicken, their Tom Yum soup, and their Red Curry. All were good, but none popped out like the Pad Kee Mao did.  Can't wait to go back!  P.S. if you work in the same business complex, make sure to let the servers know before you pay! I think you get 5-10% off the bill. :)",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "AgX7lANZykaH2sywwoczvA"
  },
  "Jwpirv-01BLOJuuzVs0dEw": {
    "date": "4/14/2016",
    "text": "Had dinner there tonight for the first time. The place was not too crowded so we had very good service. We loved our food. We had the wrapped shrimp appetizer, shrimp and eggplant dish, the skirt steak entree, and a chicken dish. All were delicious!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ws24eitA5AbiFZezf4rm8Q"
  },
  "3nsTsF8dD6_ZsSXndvEXtg": {
    "date": "4/29/2014",
    "text": "Service - 5/5 Food- 3/5 Value- 2/5  Simply for the sake of information: the menu online is not up to date--most prices are actually $1 higher, and these are NOT the enormous portions one may be accustomed to when ordering thai, indian, or chinese food. It's Scottsdale, I get it. I'm just letting you know.   So. I brought my dietarily restricted friends (one vegan, one gluten-free-ish pescatarian) here for a Sunday evening dinner, and we were immediately impressed with the super cool decor including a really neat chalkboard full of Sanskrit writing. We sat on the patio and enjoyed the padded benches and minimalist tables. The hot green tea was so good--some kind of mango or other tropical flavor made it interesting without overpowering the green tea flavor. Our service was good; we had three people total stop by the table for orders, refills, and food delivery. Things were prompt but not rushed, and friendly but not familiar. Just how I like it.  But....the food. Wah wah wahhhhhh.  I was really excited to see a $10 Dtom Kha Gai hot pot on the menu, as it's my very favorite Thai appetizer. Unfortunately, this particular one was no good at all. It was a milky white color instead of the typical orange/red color, which indicates a lack of chili oil or paste and fish sauce common of the dish. The lemongrass and galangal flavors were barely recognizable, and the soup just had no zest. The pescatarian and I ended up adding a spicy fish sauce to give it some flavor, but the vegan just added dry chilies. It sucks to be the one ordering an app for a group, talking it up, and having it totally flop.  We also ordered the veggie spring rolls, after the server told us it came with six. Technically, that was True, but it was actually three rolls cut in half. I was annoyed by that, since it was $7. They tasted like every other little 2-bite spring roll you've ever had.   For entrees, we elected the charred veggie green curry, and pad thai with tofu and prawns. The pad thai was fine, but too sweet for my taste. It also lacked spice but I added my own. The green curry was rumored to taste like pickles, per the pescatarian, but I didn't pick up on that. Perhaps the asparagus was pickled. The jasmine rice was good; the brown rice was great. We ordered the Roti bread, and it tasted very good, but for $3.50 it was just silly stingy--it was the size of a corn tortilla, cut in 4.   I *might* come back here if I am in the area and try some of the dishes that other yelpers loved, but I can't say I was impressed with any of the food we ordered.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9sXD1UHgayRx2eK5n4RQxw"
  },
  "B8plL1-PvhEnpzsVjpFGZw": {
    "date": "6/19/2013",
    "text": "Great Ambiance, Good selection even for me Picky Vegetarian. Serves a good selection of Americanized Thai creations. Good Service.   A perfect place for a quiet lunch or the late afternoon. Have been there several times and had taken several of my business associates; they all love it as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "v33h5lhnhrr-JqnHVTrUfA"
  },
  "XRXetOK5OpDgSPLLeN_VfQ": {
    "date": "8/22/2013",
    "text": "This is a fabulous little Thai place.  Very cool atmosphere, not so loud that you can't have a nice conversation and the Staff is all very friendly.  They have a fabulous Happy Hour with lots of small plates (which are GENEROUS portions) for $5.  I ordered the green curry and the shrimp and pork wontons along with 2 draft beers - all of this was only $17!!!  AMAZING!  I will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "O1ZxHtyoFI4DxCTTG_xd6A",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Green curry with vegetables on fry bread - spicy good!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/O1ZxHtyoFI4DxCTTG_xd6A/o.jpg"
      }
    ],
    "user_id": "3D7Ie-Rmmhn1RzFrVieRZg"
  },
  "l7pFF0wcQT0TR_dAuLXExQ": {
    "date": "2/20/2016",
    "text": "This was a WONDERFUL restaurant!  Great ambiance, incredible appetizer menu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6z8srsnMM_Nh07_wpKXc4g"
  },
  "R0yiTIoAUj2-f91qzoIXBA": {
    "date": "2/15/2017",
    "text": "We are back in Scottsdale and wanted to find something close to our hotel.  Props to my husband for locating this great little spot nestled around a ton of restaurant choices!  Outside looking it I was thinking we should maybe go somewhere else, but I'm glad we proceeded.  We discovered we made it for the tail end of happy hour plus it was a Monday, so we got half off a bottle of wine!  Staff was friendly, our waiter was super helpful, and we liked everything we tried on the menu.  We grabbed a few appetizers (satay, bread) and split the wide noodles.  All were super tasty.  Our waiter convinced us we had room left for dessert, so we got the coconut gelato.  Super delicious!  Great flavors, relaxed atmosphere.  Would go back for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ufRjuc3551IEoceGTSOnLw"
  },
  "iedQC-0lEfWcUg0zrCz1Cw": {
    "date": "1/29/2014",
    "text": "This is a yummy Thai place with super trendy decor, slightly pricey to pay for the atmosphere, but solidly tasty.  The pla pao (grilled fish wrappped in banana leaf) was very juicy and tender, delightfully healthy and, with the sauce, full of flavor (the sauce was also quite light and a little went a long way) - then it was excellent.    My best friend ordered the dtom yum goong soup, which was a little on the sweet side with good lemongrass flavor.  He also had the goong makahm (prawns in tamarind sauce with shallots and garlic) and said it was just ok.  He thought my fish was excellent, too, though.    I'm only giving three stars because the fish was a smaller portion than I expected for the money, especially because they charge separately for rice.  I'll have to go back and try a few other dishes to see if the value is better.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xR4engcg6Vm8xToBgKI5FA"
  },
  "TAhw116xXXOFpKKgR2J8NQ": {
    "date": "3/11/2017",
    "text": "We love this place! Best Thai food town! Happy hour on the weekends are also a nice perk.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rc8kTwr8l5LjyJ9AUlrswQ"
  },
  "fG_Bl2_v2ejqIvl8_UI9fw": {
    "date": "12/3/2017",
    "text": "This was probably our 4th meal in AZ when we first moved here. The shopping center Soi 4 is locates was just across the street from where we stayed for a month. Needless to say, we tried every restaurant in this center.   The solid 4 stars is for decors and service. Food was just alright. Given that it's location, the price was somewhat understandable. Although the serving could be a bit more. I didn't get that authentic taste like how I wanted/craved for. I probably wont be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "clEE8q-e99TGR0Q3H55MLw"
  },
  "tndTfREk7xkxr0YGcW6Tdw": {
    "date": "5/26/2019",
    "text": "I keep coming here because the food is actually really, really good. The owners are from Thailand so the food is authentic. The problem is, there is ZERO consistency in the kitchen. The portions sent out by the kitchen are never the same. For almost $20 a plate, they need to stop sending out dishes that look like half orders. When I said something, I was told to pay for double extra next time because it's \"only a $2 upcharge\" for each. If the portion control was better, this review would be 5-stars easy. When the portion control gets better, this review will change to 5-stars.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ppKEyUZ5KEeQVX-ao0y4cg"
  },
  "o1KbuKODreg_xz1yFwxr5Q": {
    "date": "3/21/2018",
    "text": "This restaurant was pretty good and better than I expected. I want with my husband for happy hour and dinner. The price was reasonable and the ambience inside was nice. I would go back there recommend for a date.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ux4jofEoBrxD5doyihh1SA"
  },
  "km6PymOKVukX4YxBc2T5tw": {
    "date": "1/19/2019",
    "text": "We LOVE this place! The food is perfect every time. The owner and his wife work the front of the house and bar, and run a tight show. The decor is beautiful. Portions are right on; prices are fair, and food is to die for. If you like spice ask for the spicy caddy to heat it up even more! Great happy hour too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "__rM1OjUq8ObJj_zquL5MQ"
  },
  "uEfHzTEXwadSSVMSX1ZMAw": {
    "date": "12/21/2018",
    "text": "Writing the review because I promised I would. (This was before eating) I was in Scottsdale for a quick trip and didn't have wheels to get around once I got to the hotel. I picked this place because it was close by, had 4 stars and I was in the mood for Pad Thai. I placed an order for delivery (or so I thought!) through Grubhub and waited almost an hour before reaching out only to find out there had been a processing error and it was set as a pick up instead of delivery. Needless to say I was pissed and hungry and didn't want to pay $10 or more for a lyft to go a mile down the street and back. Grubhub was absolutely no help!!! But I called the restaurant and spoke with someone and they agreed to deliver my food. I was so grateful! I had ordered shrimp pad thai and spring rolls. I believe it was the owner that came and delivered the food to me. Not only that, he said he remade the pad thai so it would be hot and fresh. You can't beat this kind of customer service!   In full transparency, I'm awarding them 4 stars due to service alone. The food itself would have been maybe 2.5-3 stars. Could be that it was mild and didn't have enough spice or seasoning  but it was super bland. The spring rolls were meh too. But again, the service was A1.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tcn7cSZwjz28FPRJckdTZg"
  },
  "7WCguBV9TPj1iZKj2AdSGA": {
    "date": "7/25/2017",
    "text": "Best Pad Thai ever! The hubby and I have a Thai (well most Asian foods really) addiction. Like we go at least once a week if not more. Our favorite Thai dish is Pad Thai. It's a good barometer for the restaurant. Decent Pad Thai = decent restaurant. There was a fair amount of people dining on a Friday evening about a month ago. Luckily there was no wait to sit. It did seem to take awhile before our server greeted us and got our drink orders, but not an unreasonable time. To start off we ordered Bpeek Gai Tod (crispy chicken wings tossed in sweet Thai chili glaze), Thai mimosa, and a Thai mule. The wings were large, crispy, hot, and yummy. Our drinks were a good compliment to the appetizer. For our entrees we ordered Dtom Yum Goong and of course, Pad Thai. The soup came out in the lit hot pot. There were plenty of shrimp and mushrooms. My nose was running so it was indeed both sour and spicy. Love that lemongrass. I don't think we've devoured Pad Thai quicker than we did that night. We agreed as we were eating it, that it tied for first place if not beat our first choice Thai options back home in Austin. Authentic flavors and ingredients, the right amount of heat, meat, and veggies. The portion sizes on everything was enough that we were full. Maybe too full. Would love to come back if ever we find ourselves in Scottsdale again.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "KlXtq4caT9WxfOfC6HMG4w",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Tom yum",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KlXtq4caT9WxfOfC6HMG4w/o.jpg"
      },
      {
        "img_id": "4G1VjBPkCCYUyWymNjiICw",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Wings and Thaimosa",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4G1VjBPkCCYUyWymNjiICw/o.jpg"
      }
    ],
    "user_id": "aX6SQOlK2A_oUrSJ7wqp_g"
  },
  "O4Npp8b1_OTMmym8uZhTVw": {
    "date": "12/22/2018",
    "text": "I deliver for postmates and was waiting for an order..the host Ken was very rude very short and very degrading...you would think that a business would be more customer friendly when it comes to account holders or customer service  period",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j6Jddj3uI9KKYl1bfqROlw"
  },
  "qecn-tZL1im3LftY-BQNEg": {
    "date": "10/13/2018",
    "text": "Beat Thai food in scottsdale. Crave worthy and mouth watering food, always. Great little hole in the wall spot. The spicy beef wide noodles are a must. Also a decent happy hour.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "208g0yjOoSJK2GzLAJO3-w"
  },
  "_l7GMSt9-hYy_m2seGEozg": {
    "date": "3/7/2018",
    "text": "We ordered takeout from here bc we stayed at Hyatt down the street, and this place was convenient to pick up dinner on the way back to the hotel. Food was mediocore for us. We ordered the crab fried rice, chicken satay and mango with sticky rice. They were small portions which is not what we're used to. Our meal was $38+ for 3 items. The fried rice was super oily (see my pic) and there wasn't much \"crab\". It seemed just like it was \"topped with crab\"!! We chose these items bc of what yelpers advised, and the entrees were so disappointing. My wife liked the mango and sticky rice dessert but you can't really mess that up. Its not rocket science! When I called, the gal that answered was super rude just bc my phone call showed up on her caller id as out of area! She was ok though when I picked up the food. The place seemed packed for a weeknight, but its probably a bunch of out-of-towners like us, getting ripped off for mediocore Thai food. We've definitely had much better than here!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zjaMy311qRxH19aRiCVUrQ",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. see that oil? its glistening! crab fried rice takeout! Nope! Never again!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zjaMy311qRxH19aRiCVUrQ/o.jpg"
      }
    ],
    "user_id": "yN97yLvqV38Xu1HOvT6uyg"
  },
  "AD_lCpCzhIIKGg9HJYt3ig": {
    "date": "10/15/2018",
    "text": "Wen on a Sunday night 6pm.  Had the calamari appetizer, very good. Then Pad Thai, wasn't quite as good as previously but still good.  Service was not good, took a while to order, waitress didn't know that they were out of draft beer, had to be reminded that we needed knives, need to be reminded that we needed hot sauce.  Not on top of her game.  Would probably give them one more try.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zpqp3iPhyNU9foneMMF7QA"
  },
  "_2DW7jPzPcjLZpCr1j5QHg": {
    "date": "7/5/2017",
    "text": "Stopped by here on a whim one night looking for \"something with chicken\".  The design is very hip and modern and it would be good place for a date night.  There is a little patio outside for when the weather is nice.  Food was delicious. Had chicken skewers and a chicken and rice dish. Both were good. Also had some bread but it was an extra charge, relatively expensive ($3.50), and only four small pieces. Minor complaint but I would say the prices are slightly expensive overall.  So 4 stars for the food and two starts for the price = 3 stars for me.     Overall, there are some nice places in this plaza to eat.   I might try the Tavern Grill or The Living Room as a 1st choice option in this plaza.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VRPRi118ILWtU6x9xEirrw",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VRPRi118ILWtU6x9xEirrw/o.jpg"
      }
    ],
    "user_id": "30RqwSe6xYs2_LlW0oQiDQ"
  },
  "8aCgPs5zw95mlKUGs1s2Vg": {
    "date": "9/2/2018",
    "text": "My new favorite Thai food. The spicy wide rice noodle and skirt steak....yummo  if you are in snobsdale..oops meant Scottsdale eat here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A0o102kPcSvmk0m1R-_n5A"
  },
  "1Y1zyFUeKxxn8WwrNvMoAQ": {
    "date": "12/15/2017",
    "text": "Fun spot for lunch during a conference. We had friendly service, fresh food, and overall a good experience. I like a lunch combo option, it's always nice to get a few different things at one time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4azObAj7zGY89cyqgsZdVw"
  },
  "ZnWzPxZ1cb3xh4wlB4QTsQ": {
    "date": "1/9/2018",
    "text": "This place is amazing I was so sad when I couldn't find any good Thai places anymore! My favorite Thai restaurant closed down years ago and I couldn't find anything to replace it in state!! I came here a few years ago and forgot about it because it's so far from me! But I went here the other night with the hubs and the food was amazing! I cannot tell you enough good things about this place from the tiger shrimp appetizer to the drinks to the entrees! They have a great music selection and the ambiance is so relaxing for date night!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "J8xJINiDbblI47LcRHWgRQ",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/J8xJINiDbblI47LcRHWgRQ/o.jpg"
      },
      {
        "img_id": "1luZdHjymVa_q_WzQ4uzgQ",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1luZdHjymVa_q_WzQ4uzgQ/o.jpg"
      },
      {
        "img_id": "rvKL4zQVfkGROOPuuuI6_A",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rvKL4zQVfkGROOPuuuI6_A/o.jpg"
      }
    ],
    "user_id": "iiUNqrwTC7AnTm9Y4D5jdw"
  },
  "_ET2r74kTcQdWc__4EIgbQ": {
    "date": "12/30/2017",
    "text": "I love this place, it's near my work, the food is great! The wait staff is awesome (always)! I can say that, thier food is pretty authentic!  I should know, after all I am Thai. This past week we were there for happy hour, and of course the food was fantastic. We ordered Crab Fried Rice () and Tom-Yum Shrimp ().  So delicious! My favorite are Pad See-Eew (), and Kua Kling ()...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_z8-5opaP8X1ba0lYJJOQg",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. All the hot sauces",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_z8-5opaP8X1ba0lYJJOQg/o.jpg"
      },
      {
        "img_id": "p_A9q9n3BwJCtMnWfmrwcQ",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. &amp;amp;",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/p_A9q9n3BwJCtMnWfmrwcQ/o.jpg"
      }
    ],
    "user_id": "zjE_s-f-Ol5M7hlDrZ1tSw"
  },
  "a_9jebj7yrfbf941qEHR1Q": {
    "date": "11/4/2018",
    "text": "I went into this restaurant as a single. The restaurant was less than half full.  The man at the door tried to give me a small table squeezed between two occupied four tops. He also said I could have a high top table In the back. I told him I wanted one of the empty four tops and he said no I can't have it. I said fine I am leaving. He walked over to me and said f__k you as I was leaving. He claims to be the owner.  It was one of the rudest things I have seen in a long time. I will never go there again. I went there out of convenience but it is not worth it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6p3A7EZuJ8GWzfyopmmdhA"
  },
  "v9V4yrnOFjjU310sBJ09Cg": {
    "date": "2/9/2019",
    "text": "The food and service is consistently great!  Highly recommend this place for the adventurous and people who like the standards.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zk0Nwf_FW0ewTy7DxONEKA"
  },
  "45RBEq94kFhf8kzKB5SOtg": {
    "date": "5/25/2018",
    "text": "The worst experience. We wanted to check this restaurant out for AZ Restaurant Week. We had a 7:30 reservation. They sat us and the server was not quick to come to our table. We were splitting a drink to start (lg Kirin) and asked for an extra glass, which we didn't get. When we went to order food she told us the prawns were out. There were only 3 things to choose from on the restaurant week menu and one was a veggie dish, so that limited things. I asked for there was something to sub out. She said she would ask the kitchen. She can back (not quickly) and grabbed our menus and said they were out of all restaurant week food. Not really apologetic. It was 7:30 on a Friday. How are you out of every item on a menu that brings people in. She brushed it off and told us they like things fresh. We didn't stick around to give any of it a try.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ODUbA6fH_dXDIPMSIYAiPg"
  },
  "ARzXwmZQ8nk9JXjKl_NE6A": {
    "date": "6/28/2018",
    "text": "Great Thai food!  I got the drunken noodles with steak and it was incredible!  Waitress was very helpful and the environment was trendy and nice.  We are here on vacations and will probably come back before we leave.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WQYPVPNzEZELOKTXYLBaAQ",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WQYPVPNzEZELOKTXYLBaAQ/o.jpg"
      },
      {
        "img_id": "14St-AsQoh130KoVjfa2nA",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/14St-AsQoh130KoVjfa2nA/o.jpg"
      }
    ],
    "user_id": "kQnmev2MnkKMDpFqcscdbw"
  },
  "-9GqtTgsp6A6DzAYrE3L4Q": {
    "date": "7/31/2015",
    "text": "We were a group of 9 girls on a bachelorette trip in Scottsdale. After eating out the typical Western diet, we wanted some Southeast Asian food.  I didn't have high expectation since there is not a large Asian community in Scottsdale. I've worked in a Thai restaurant before and the food was actually authentic and delicious.  They even offered a few original dishes that I've never tried before.  I loved their take on the Thai BBQ chicken.  There was so much flavor and it wasn't dry at all.    The wide rice noodle and Phad thai were both on par.  They were delicious and we ate the whole thing.  The only dishes I found below my standards was the papaya salad and larb gai.  I felt that both lacked flavor.  Service was great and speedy.  Our food arrived quickly and were were out the door in no time.  If I was ever back in Scottsdale, i'd definitely return.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nctIBc1Z4PHNk_wK0PMZkQ",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Thai Taco",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nctIBc1Z4PHNk_wK0PMZkQ/o.jpg"
      },
      {
        "img_id": "kRzr5TDWZPIdTI49xo4iSw",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Phad see you beef",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kRzr5TDWZPIdTI49xo4iSw/o.jpg"
      },
      {
        "img_id": "IN37DG45F7DiYs5imdVgGg",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. large group",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IN37DG45F7DiYs5imdVgGg/o.jpg"
      }
    ],
    "user_id": "LfKztiKBS2P2_QoNeilWeQ"
  },
  "4fxRibbn5bVzUCVAOYJZtg": {
    "date": "5/21/2011",
    "text": "Yum Yum Yum!!  Had an overall good experience all around. Couldn't resist trying the indian bread with steak and mustard leaf wraps--they're as good as everyone says. Everything was sooo full of flavor. Can't wait to go back!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ANAP7Jqkrr4QMQNiB5vHOA"
  },
  "lF9Rx5b410CiUniDn75UHw": {
    "date": "6/14/2013",
    "text": "After reading all the reviews and accolades, I was pretty excited about going here. The ambiance is great and so was the server. We started with the indian bread and steak, which was phenomenal. I then ordered, based on reviews, the Sweet Thai Shrimp (noon ma gong??) It was ok. To sweet and not spicy. It was a small portion. It didn't blow me away. Our table had the short ribs, which tasted like short ribs should and the salmon, which didn't seem like a great piece of fish. all in all, it was a fun night and a good experience, but dont expect everything the awards tell you.  It was $100 for 3 of us with a few drinks.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EgSFKMAhBJsdHzYLvb2DnQ"
  },
  "whDOWW1WZRaFTz9RzTqQLQ": {
    "date": "6/6/2013",
    "text": "Great Thai food.  wife and i are Thai food junkies ever since traveling to Thailand last year.  this place is good, real real good",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yzlrv1uZ1v5724zsfYnTVw"
  },
  "hRwiVgTJ9EFZM1_kjptP4g": {
    "date": "2/1/2013",
    "text": "Like everyone else says the ambiance is very nice - for a restaurant in a strip mall. But hey this is Scottsdale. The food was definitely above average and interesting - not just typical american Thai food. I'd definitely like to go back to try some other dishes.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4m1PPtF587WIZTBlT6xh6A"
  },
  "TN3fg4N1eQx_NTzZnbyETw": {
    "date": "12/29/2013",
    "text": "Delicious food!! I am from NY and always try to find delicious Thai and this is one of the best places I have ever eaten at. I love Thai and this restaurant really does the trick. The decor was great and the food is A Plus!! Yummy Yum Yum!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TYTv6h2rY6P8J4X6nmi9Fw"
  },
  "r5QUBvSw5-Mcctb_GtUOmw": {
    "date": "3/16/2013",
    "text": "I usually give a restaurant a couple tries if the first time was so-so.  This Thai house totally redeemed themselves.  The duck dish is to die for. The noodles, great!  Good work Soi!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5RMrBxjIIvdTBl5prcAzvQ"
  },
  "CpgSnGlXUnkiA7IN_7CHpw": {
    "date": "7/13/2013",
    "text": "Nice decor, excellent service. Apps were ok, but no knives to cut the dumplings. Food was average or below. Yellow curry was flat and ke mao  had zero spice...like they forgot how to make it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mvprvejKfsnJ3vmwJky_nQ"
  },
  "vIpajPWac8MWYGi_Zp3ZuQ": {
    "date": "10/6/2011",
    "text": "Love the feel of this place.  The mushroom/oyster soup is not to be missed. Good seasoning/taste. Get in on the clay pot with prawns as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A4a_tkQsgMbNZv9KSxb_qA"
  },
  "JwFHRcQ71BFRPZXBFVcqGw": {
    "date": "2/20/2013",
    "text": "Delicious thai food - Prawn , pumpkin and red curry was perfect and the eggplant green curry roll was also very good (less spicy of the 2).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XQUAcF-qeJwSqsTkH9htfA"
  },
  "cDV3IKq6sqCYAT3bhy24Rw": {
    "date": "7/5/2012",
    "text": "Great ownership!  the flavors are very accurate and traditional but with a modern flare.  Outstanding architecture and decor.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LwccdGsY95BXN98RMJLsbg"
  },
  "UM-zb4I3FAl9YR38wBmmvQ": {
    "date": "10/30/2012",
    "text": "Very chic ambiance. Service is very good and efficient. Food is very tasty, and they will gladly adjust the heat level to your liking. The traditional coconut chicken mushroom soup was outstanding - light coconut cream broth with light chili and lemongrass notes.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aHX4jtJYIdRuJip7sSKSnw"
  },
  "wNX7By7tegmZpw3nOLi6NQ": {
    "date": "5/12/2013",
    "text": "Atmosphere was nice. Ambient lighting, modern design, soft music. Food was not great. Lemongrass soup was bland, and the green curry with vegetables was sickeningly sweet. Couldn't eat more than a few bites. We'll stick with more authentic Thai.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b5lqYzGRFPq2lldoj1TLJw"
  },
  "sBkWzMnURfCz8Fq4PKexKA": {
    "date": "1/2/2012",
    "text": "Let me first say that I really appreciated the ambiance and the music selection that soi4 selected. I absolutely loveeeeee tai food:-) but, soi4 has much to work on as far as food quality and taste. I had the mustard leaf small plate to start which was great. Then, moved on the the Tom Ka Gai which lacking flavor and tai soul.later on, I moved to the pad seew which was bland and flavorless and had to use tons of tai chili fish sauce to make it better. The last was the best it was fried bananas with coconut ice cream and this was truly amazing. I made a special trip just to go to this restaurant but I don't think it beats my favorite local tai food location.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Q3FrFwO6mIfUy2eHIBqbA"
  },
  "rEmfLsHswexRhO_0J5B-Lw": {
    "date": "9/22/2012",
    "text": "We've eaten Thai food all across the country and this was phenomenal. The duck breast curry was lean and flavorful.  We had a small plate of a wonderful blend of spices and coconut on mustard greens....mmm mmm...the extra lean  short ribs came on a sauce that I would love to steal the recipe and attempt recreation at home,  would love to clone this place and bring it to Chicago !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xn7HtOHHLOO_s9p-q84-Eg"
  },
  "OQ6B2_xkDDr95yAPpwCjig": {
    "date": "9/22/2014",
    "text": "The food ? Meh! Not good. Expensive ? Yeah! There's much better Thai food in town. Don't go.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wDrCkEsru6mMJAgrWaibqw"
  },
  "YjCyRKmrOkoTAyI1P5md7g": {
    "date": "4/28/2013",
    "text": "My wife and I went here for her birthday. We love Thai food and most of the reviews on here were great. Unfortunately it didn't live up to the praise for us.  For the appetizer we got lemongrass meatballs. This consisted of four small meatballs on toothpicks. The flavor was okay, but a bit bland and the portion size seemed really puny.  For the entree my wife got the pra ram rong song, which was supposed to be filet mignon with peanut sauce and vegetables. The \"filet mignon\" was charred on the outside and the shape and toughness made it seem like a piece of sirloin rather than filet. When we mentioned this to the waitress, she tried to instruct us on how to cut the steak across the grain (!). My wife let her know she had worked at a steak restaurant for years and knew what filet should be like; she just kind of shrugged and said sorry.  My panang neur beef short ribs were much better. The sauce was a little more beef gravy-like than regular panang, but it was nice and the short ribs were cooked perfectly.   Overall, it's not a place I would choose to go back to. The lack of any response from the server about the tough steak (why bother to ask if everything is good if you're not going to do anything either way?) is a big reason, but the flavors weren't really a standout in any case. Plus, charging extra for rice is really tacky.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HWZ6A8Otul7frS_kWxy2Tw"
  },
  "O4LYYO80Pyu3_FucoFAIsg": {
    "date": "11/7/2011",
    "text": "Very questionable place.  I have lived in Sydney for quite a few years where the asian food is fantastic so have something to go by.  I ordered the corn cakes, steak/bread for dipping and Fish Trap(combo of seafood in yellow curry).  The corn cakes were perfect, no problems there.  the steak with flatbread and curry sauce for dipping was ok.  The main problem is they were very cheap with the steak.  The pieces were mostly small and not enough for the bread.  The green curry was blah (but this is scottsdale so yeah).  The main disappointment was the Fish Trap.  It had what I think was meant to look like sliced scallops but was really sliced fish.  I'd be pretty afraid to get the scallop satay here, I wonder whether they are trying to fool people with sliced fish cheeks instead of real scallops?  The main disappointment here was the squid. It was big sliced tubes that were so chewy and rubbery that I couldn't slice them with my fork.  It was too undercooked (and i like my seafood undercooked) and I don't believe the squid was good quality in the first place.  To end the nite I showed my waiter the squid, showed him how it was so rubbery that my fork just bounced off it when I tried to slice it.  He went back and the on duty manager offered to buy me a dessert.  I wasn't looking for anything free, but offering to buy a $6 dessert for a flawed major ingredient in a $16 meal shows why the place is so cheap food quality wise in my opinion.  Basically the menu of this place looks nice and imaginative, but I think they are cutting corners ingredients quality wise and I won't be back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "W5rlt9ZpZK4eAdMIFR2QUA"
  },
  "eTy6daVtMy0qH-1nTRxX3w": {
    "date": "4/2/2011",
    "text": "On our second visit to Soi Four, we ordered the mustard leaf wraps for our appetizer. They are a mixture of shrimp, soy sauce, coconut milk, spices and fruit wrapped in mustard leaves. To die for! Very complex, savory, yet light at the same time.  For our second courses we selected Pad-Thai and a rack of lamb with a ginger rub. The Pad-Thai was the best my friend and I have ever had and we have sampled many between both coasts. My rack of lamb was done to perfection with just the right amount of kick. If you enjoy Thai food at it's best, go to Soi Four.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "U1ZtYH67Mbivgy7j4L_E0A",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/U1ZtYH67Mbivgy7j4L_E0A/o.jpg"
      },
      {
        "img_id": "MVcn5rCnIy2kC2C1ir3few",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MVcn5rCnIy2kC2C1ir3few/o.jpg"
      }
    ],
    "user_id": "gJ76tIg7GJUscGkwu_A3kg"
  },
  "BBN_MnHKTEySFzx4YLQ8fA": {
    "date": "3/18/2013",
    "text": "Fantastic and authentic Thai food.  Not the cheapest prices but worth it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y07zgfOaBYToIBJQk115lg"
  },
  "RpoYXSvtSQOpT14Wl8RMiQ": {
    "date": "4/21/2015",
    "text": "Excellent food, presentation and service.  They accommodated our vegetarian requests easily.   Especially enjoyed the corn cake appetizer. Fried bananas with coconut ice cream were terrific.  However noise level and very hard, unpadded chairs will keep us from returning.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RtXjKmnqgCjLv-A4h6wX0Q"
  },
  "aOO6D9fnCE70OT94X48Ojg": {
    "date": "11/23/2011",
    "text": "Love this place.  Happy hour specials include a Thai sausage that is incredible.  Imagine summer sausage mixed with Thai spice.    Fish:  I've eaten catfish all over the country, and the catfish here is some of the best I've ever had.  Very light breading, spicy, with a host of vegetables as a compliment.  Love it.  Meat: Lamb and steak surprisingly well prepared and delicious. Short rib is phenomenal.  Minced chicken is also superb.  Dessert:  The coconut ice cream with fried banana's and honey.  Do I have to sell that?  You could slop these things on a plate with no forethought and it would be delicious.    I find the place is reasonably well-priced, particularly for a spot in PV/Scottsdale.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-x9-NmVSwx7DzvuF_sRaGQ"
  },
  "ulkzdQgrQgb7VUItB-E_tA": {
    "date": "1/16/2013",
    "text": "Going to make this short and simple. A DATE, invited me to this place Jan 2nd 2012. OMG! He ordered fo rme-'everything' on the menu! Everything was unbelievable! 10 stars out of 5 stars is how I rank this place regarding thefood, ambiance,location, staff, cleanliness, cheerfulness of staff and presentation of foods!  Go there!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "-zXoRC8lg2lybWLI48S-8w"
  },
  "7AFchec2KT2HWbR1sDwh1w": {
    "date": "5/6/2013",
    "text": "This was the most delicious Thai food I have ever had. This is also the best food I have experienced in AZ including some high end restaurants. It \"tasted like vacation\" as eloquently stated by my dining partner. We split the dumplings, papaya salad, and eggplant wrapped fish green curry. AMAZING!  I am seriously in love with the delicate fish and amazingly flavorful green curry. Suspiciously not spicy but it was great! The deep fried bananas and coconut ice cream are also to die for. Our waitress made fabulous recommendations.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IVo_5i_pBbQGnlmkvKRk-g"
  },
  "bbarcy52aFMtVwJD5EfNag": {
    "date": "4/18/2014",
    "text": "Had the pad thai (a bit mushy), the neur namtok (yum!), pineapple fried rice (very yum) and an appie they recommended that was similar to mini lettuce wraps (so good!).  The decor is modern and we felt the portions were just right.    Fried banana dessert was crispy, hot and tasty!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2kDUghiHnJyya_iM4XOovQ"
  },
  "Uk7B3kL5Qno2oSIY-OGviw": {
    "date": "9/12/2011",
    "text": "I am in Phoenix for work and my brother (who lives here) took me here for dinner tonight.   I am from Minneapolis (Uptown to be specific) and we have a solid Thai scene in the area. Soi 4 would fit right in. I got the panang Neur (braised pork ribs and veggies in a spicy sauce) and it packed the perfect amount of heat. Not hot to the point where I couldn't enjoy the flavor, but my nose was running... and that is a good sign. DELICIOUS!   My brother and sis-in-law love the pumpkin curry. This was my first time having it and it was amazing. The flavor is so unfamiliar but uniquely delicious at the same time. There are actual chunks of pumpkin in the dish which add an amazing textural element. (Okay, with that last comment I feel I'm getting a little too \"foodie\" but there's really no other way to put it.... just order it and see for yourself).   I will be coming back the next time I'm in Phoenix.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MED27c1AyMg98fl9CxDIEg"
  },
  "1zKZUyVyPCP9cO89v6BTIA": {
    "date": "10/8/2013",
    "text": "I stopped here the other day on the way from the airport to my hotel. Yelped thai, chose top rated place on my route. Love thai, and this place came up highly rated.  I really enjoyed the food and the service and it deserves the rating it has.  Had the toong tong (thai style dumplings), crab fried rice, and panang neur (short ribs in a panang curry sauce).  I love dumplings, they delivered, and liked the cabbage leaves with it.  The braised ribs were just amazing - tender, (no bones) able to break apart for bites with sauce with simple fork action, and the sauce was perfect. White rice with that was perfect, enough sauce to sop up. Fried rice was good, but liked the other dishes way better.    I asked for thai spicy, still wasn't hot enough for me, but I am realizing that i have reached a threshold where it is hard to make something spicy enough for me.  They gave me the little set-up with 4 condiments (vinegar/chile, pepper flakes, red pepper past and another res sauce), all were great additions which i tried with all the dishes.  Service was good, only complaint I guess are the prices of the cocktails compared to the food  Very reasonably priced food for the quality, so slight disjointed feeling on the drink.  Overall though, really excellent food, just loved the flavor mixes, not straight up thai, has that fusion twist, and loved it. The servers were great, different ones checked up on me, just really have to say good job.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VRikEa8jlpbrS0p6SnVCtg"
  },
  "3QDHPFHO6J3n6ONvr-apMw": {
    "date": "5/18/2011",
    "text": "Wow!  I have experienced some wonderful Thai joints in my life, but this is one of the best.  First, the food.  It is tremendous and the clarity of flavor is amazing.  I have been trying to work my way through the menu for several months now, but always seem to come back to the short rib panang (panang neur).  The short rib is always moist and lean and the curry has just the right amount of heat.  Order it, you will not be disappointed!  In addition, you can't go wrong with the pad ke mao (spicy skirt steak with wide noodles) or the pad se ew (noodles with pork).  They also have numerous vegetarian options, if that is your particular flavor.  I have not quite made it away from the proteins.    I understand that they have a fairly decent happy hour, although I haven't had an opportunity to experience it yet.     On to the decor.  Sandwiched in between boutiques in Gainey Village the owners had their job ahead of them.  I understand that Wendall Burnette was the designer (who also designed St. Francis Place in central Phoenix), and the minimalism definitely comes through.  The place looks great, but it is not what I would necessarily describe as comfortable. Perhaps as the restaurant gets broken in it will soften a bit.    The service - I have visited the restaurant four of five times and have no complaints.  The servers are more than happy to assist with any questions regarding the menu and will definitely give you recommendations based upon your own personal preferences. All you have to do is ask.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "P7jyYvWRK88nxZWUPrz89Q"
  },
  "DHe40At1VnoAKJHey2HS3A": {
    "date": "6/28/2014",
    "text": "Very nice. The food was well-prepared and tasty. The staff made the experience very pleasant. They were attentive but not intrusive, and were willing to accommodate a couple of small requests. The chairs could be a little more comfortable, but overall I really enjoyed the place and will return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BZpUu36mC-WRf0AIBANvMw"
  },
  "yzkQtL2iFno_y_PwMjpgiw": {
    "date": "6/21/2013",
    "text": "Very nice place.  Food is very good and priced fairly EXCEPT the drink glasses are a  joke.  They have to serve the smallest drinks in Arizona in comparison to other restaurants within 50 miles AND the prices do not reflect the size of the glass.   Drink the beer do not buy the specialty drinks.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BMd9p4g8BSJDhrDi3SZE1w"
  },
  "9ri7QA4m--5wZ6azM2VrbQ": {
    "date": "11/14/2011",
    "text": "Service a bit slow on arrival...took about 10 minutes to get water and place order even though they weren't that busy.  Shared the pork and shrimp fried dumplings, excellent. Dumpling sauce was slightly thickened, a very nice detail.  Pad Me Mao.  Spicy and delicious.  Grilled skirt steak with side rice noodles and chili sauce.  I've eaten in several of this group's San Francisco locations, this location performed very well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UgzYBNFSyln_5dlqZjS0HA"
  },
  "wUrJoesrjGqcQ3mFdm0hDw": {
    "date": "2/21/2011",
    "text": "Soi 4 is a fabulous new addition to Scottsdale. Not only is the service fabulous but so is the food! The restaurant is family owned and some of the service staff are even children, nieces and nephews of the owners. You can tell they really know about their food. You will definitely not be disappointed with anything you try here. Even the decor is wonderful. Everything from the bright colored pillows to the pieces of art were all delivered straight from Thailand. This place is seriously as authentic as it gets!  For appetizers I would recommend kanom pak gard (sauteed turnip cake with egg, bean sprouts, and chives served with Sriracha sauce), keow wan roti (pan-friend indian bread and grilled skirt steak served with green curry dipping).   For a salad option, somtum (green papaya, string beans, cherry tomatoes, and nuts tossed in sweet garlic lime dressing).   For amazing noodle dishes try drunken beef Sizzling stir-fried skirt steak with green beans, apple eggplant, lemongrass, chili, and basilo (spicy wide rice noodles and skirt steak stir-fried with basil, garlic and chili), pad se-ew (pan-fried wide rice noodles with pork, chinese broccoli, egg, in Thai black bean sauce).  For meat plates, drunken beef (sizzling stir-fried skirt steak with green beans, apple eggplant, lemongrass, chili, and basil).  For dessert do not forget to try either the mango sticky rice or the fried bananas with coconut ice cream.  They also have delicious signature drinks as well as a great wine selection. Soi 4 has only been opened for about 3 months and they will definitely not be going anywhere soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ecch309vIV_RB6GXpwEtPg"
  },
  "-cMltIyiYeVHSZb4cTe8eQ": {
    "date": "12/15/2010",
    "text": "This is the real deal!   Having traveled to Thailand and having lived in the San Francisco Bay Area, let me just say that the reality is Thai restaurants in the valley were lacking in authenticity. Sure, I could find some neighborhood Thai joints that satisfied my craving for the sweet and spicy flavors of Thailand, but it wasn't until I had dinner last night at Soi 4 that I remembered what Thai food really tastes like!   Don't be put off by the upscale location and mod decor. That's not reflected in the prices!   Once we were seated, Dee, the owner, came to greet us, explained the menu and answered our questions. She was absolutely delightful as she pointed out their specialties. It is such a rarity that the owner takes the time to introduce him or herself, that we were impressed from the start.   A must . . . the sauteed steamed turnip cake with egg, bean sprouts, and chives served with Sriracha sauce on the side (kanom pak gard). Had we not had the guidance of Dee, we most certainly would have passed this up on the appetizer menu. Wow! An explosion of flavors -- sweet, spicy, textured. I could make a meal on this alone. The Golden pouches of crab and pork served with sweet Thai dipping (toong tong) are a home run, too.   We ordered two salads, both of which were fresh, scented, and full of flavor. They can easily be shared by two or three people. The Grilled eggplant salad with minced chicken & prawns topped with lime, coconut dressing (yum makuer yao) is my new favorite salad. I'm a huge fan of eggplant, although I recently learned it has very little nutrition content :(   We all wanted the Pad Thai as our entree, so we ordered two. It hearkened back to the Pad Thai we had throughout our trip to Thailand a few years back, when I was surprised to learn that real Pad Thai was not orangey-red and covered with peanuts!   Just a few comments about the cocktails -- top notch! I had the Full Moon (Ginger vodka, pear nectar and cranberry) which was full of grating of real ginger - amazing! My husband had the Mango Cosmo which he thought was equally as good.   Service was so-so, but I have to overlook that on this occasion because Soi 4 has been open less than a month and it appeared that some of the staff was just learning the ropes and didn't quite have the menu down. They were otherwise pleasant and patient, gave us plenty of time to just sit and chat before ordering.   I can't wait to go back to try some of the other small plate and entree dishes. This won't disappoint! \"khorb khun\" for a yummy dining experience!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qxmdrMmjTzgQhyHXKuyy3Q"
  },
  "DFh5WJhw6-H3ec8347DqJg": {
    "date": "9/20/2013",
    "text": "Best Thai food in Phoenix!  This is by far the best curry I have had in Phoenix. The yellow curry with chicken lunch special was an great deal and delicious. Will be my new go to Thai restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mDP1idXQ-w-91ZLY9Xr5Bg"
  },
  "zVoOfydKgHNlI2cUIIeWDw": {
    "date": "1/26/2013",
    "text": "One of the best Thai restaurants I have ever been to. Fresh ingredients, excellent preparation of traditional dishes (Pad Thai, Papaya salad, pumpkin curry, green coconut curry) and some interesting spins on Thai flavors with certain non-traditional dishes (Indian flat bread with skirt steak and green curry), great presentation. I've eaten here dozens of times and have never been disappointed. They also own restaurants in Oakland and San Fran. My only disappointment is they over-sweeten their Thai Iced Tea.. that and they don't have a restaurant in Los Angeles. Too bad, they'd put every other Thai restaurant out of business.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "z22JqwXbQH5n-0MpF-1sOA"
  },
  "_ZasJPiTfEjYWLqNzn1aKQ": {
    "date": "8/6/2013",
    "text": "Attentive and friendly service and a nice, modern atmosphere. Great spot for a date night. Prices are very reasonable and they have a fairly extensive menu. The Pad Thai is my favorite dish and I've tried a handful of appetizers - everything I've tried has been very good. Definitely my favorite Thai restaurant!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rcTn6KPGYLsG8D8-_4MDNQ"
  },
  "4Ef0qCoJEGkySuG7Gxn9iQ": {
    "date": "2/24/2014",
    "text": "I ate here a few days ago with my son and his girlfriend; we were all pleased with the atmosphere and the food.  It was hard to decide what to order because it all sounded interesting and delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rI5nstF82t8UQC5GxLeT8g"
  },
  "t1JbmKu5L5z5RGue_7Lm5Q": {
    "date": "4/27/2011",
    "text": "This place is yummy!  I was very impressed with this thai food eatery.    I love the decor, very mod and chic, great date place.  The tom ka gai soup was excellent.  Salmon dish was great as well and crispy chicken, basil and green beans with chili was good.  Pricing was not bad at all and the presentation of the food was impressive.  I would recommend this place any time!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Cts7waInWCn6f_RvcgW3Q"
  },
  "VUN1SWtyfnHFl7b5XFcw7w": {
    "date": "6/22/2014",
    "text": "I've been many times and last nights meal was the best Thai I have experienced.  The Spider Roll special was a nice way to start the meal.  We had the crab fried rice and it was moist with plenty of crab intertwined throughout the plateful.  Also,the short rib Panang was so tender no knife was needed.  Both the sticky rice and the Jasmine coconut rice were perfectly cooked.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PT6H5iKfiTxewi0ZSEppkA"
  },
  "hrQr0-lqYpi9XZHf_qiQng": {
    "date": "7/17/2013",
    "text": "The owners have the food down for sure.  They own a restaurant in San Francisco and make Thai that mirrors True Thai cuisine.  Service was slow but I think they were just understaffed that night.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ai7iG-6YoIrdixnNYkFWzg"
  },
  "-au3EG6axhrGbgSlADVCSw": {
    "date": "6/10/2013",
    "text": "First time and wasn't disappointed! The ambiance was definitely upscale for a Thai place and the food and service were upscale as well !  We found a great new Thai place near home that is perfact for a date night or family dinner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xaUMIgs4lggFdUwPEys7tQ"
  },
  "_QHj39_RSs5sNnWcevshLQ": {
    "date": "7/18/2019",
    "text": "I have been eating here for a few years and love the food. Noodles are better then in Bangkok!  According to my friend from Bangkok.  Lately I've been exploring the menu and have found some excellent salads.   Never too crowded with excellent service. If you haven't tried you must.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B6lANx_r-IFyqj7zcPI6Sg"
  },
  "huC8EmFtOoDTncgM4wlGEg": {
    "date": "9/29/2018",
    "text": "Came here for a dinner with a group of friends for a bachelorette dinner. I will say our service was exceptional! The waiters were so polite and so helpful with the menu choices! I had the cilantro cocktail omg soo good! And the drunken noodles with chicken and not steak...I got hot but for the veteran spice eater....you will want thai hot (I imagine). Will def be back, I enjoyed it :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "m2DK3QCFuQ969AoLQJm0vw",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/m2DK3QCFuQ969AoLQJm0vw/o.jpg"
      },
      {
        "img_id": "VZycrri4Pz7dKLTf4SgkNw",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VZycrri4Pz7dKLTf4SgkNw/o.jpg"
      }
    ],
    "user_id": "j4KaTVeOxUyIRjdRO3vl0Q"
  },
  "7zFm1QsBqKdMnZilkwFM_w": {
    "date": "2/18/2019",
    "text": "The food was really good and reasonably priced for the area! However the service was not so great.  The servers seemed confused on who was supposed to help which table. The food came out at different times and they were out of the duck and salmon.   And on a side note the bartender wiped up a spill on the floor with a paper cloth and didn't wash his hands after. Kinda gross.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "UG2y54Iri9q2h4bZMyD1Qg"
  },
  "rrNUIbJsTak3fyXZxfSgKA": {
    "date": "8/16/2019",
    "text": "Excellent meals. I'm a pretty big Thai buff and this is definitely my favorite Thai joint in Scottsdale",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PioUB_nkEHGrgND7hjgUmw"
  },
  "4rdyIu0IpiF1OFaCZhuVLA": {
    "date": "6/23/2019",
    "text": "Excellent service, very nice atmosphere, outstanding food, reasonable price given the location, very professional and friendly. Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zSyU4COSy29fqrkmJGoD7w"
  },
  "RAurqfmnIy74_A_f5c02MA": {
    "date": "3/3/2019",
    "text": "Food was pretty good the only complaint is the very slow service and it took 15 min to get our alcohol drinks because the bartender was MIA. Would given it 4.5 stars if the service was better.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "65JreNnPCY79x-nI2GXYaA"
  },
  "t63GUs7v2XIQQW0K5w3alg": {
    "date": "11/26/2018",
    "text": "Met some friends here after randomly picking it because of the great reviews. The reviews were right, this place was great! A touch spendy, don't come here looking for the $5 mega Thai burger (is that a thing? Maybe it should be)! Anyway, portions were about right, if you're hungry you won't likely be splitting a meal. However, bring friends so you can share a bunch of meals, which is what I did with my friends! Sides, including rice are ala carte, be sure to order the coconut rice. How I loved that coconut rice, I'm tempted to go tomorrow and just order like four batches of it and nothing else, it was amaze! The coconut ice cream and fried bananas was also excellent!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "18kdN1OidK-iezWAocWBzQ"
  },
  "OGOQRThttlilnn4w7ZsujQ": {
    "date": "11/5/2017",
    "text": "This is a modern Thai restaurant with an upscale feel - perfect for a nice dinner with friends or colleagues. You'll find a truly fresh look as compared to other Thai restaurants, complete with a bar and second floor seating that overlooks the ground floor. Plenty of space and tables inside and we were seated promptly on a Friday night.  The happy hour deals are fantastic. First off, the happy lunch deal gets you a red, green, or yellow curry with added protein for $7.50. Happy hour lasts from 5pm-6:30pm and you can get $3 drafts, $5 house wines, and $5 snacks. Our group just missed happy hour but stayed for dinner.  I ordered the tofu dish with vegetables and was pleasantly surprised how flavorful it was. There was a nice spice to the dish (though if you like spice, say you want the high spice since medium is hardly spicy). And the crunch of the cashews in the dish was a perfect complement to the fried tofu. Dish had a nice kinda sweet curry, but it tasted amazing when mixed with Jasmine rice.  Fantastic restaurant and quality Thai food. Can't go wrong.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "hzfplnHf_SY8zAkf4xOHaw",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hzfplnHf_SY8zAkf4xOHaw/o.jpg"
      },
      {
        "img_id": "x5WtTzImzA_FlCP3IEhagQ",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Happy hour menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/x5WtTzImzA_FlCP3IEhagQ/o.jpg"
      }
    ],
    "user_id": "YtbefIy9Svn7VuDAky69YA"
  },
  "NMmcg6eumVuGCOo0psnrLQ": {
    "date": "4/7/2019",
    "text": "We met friends for happy hour, then dinner. They love this place, and it was our first time. Without going into detail about each appetizer and entree we had, let me just say that each and every bit was fantastic, from the broths to the sauces to the rices to the desserts. I intend to work my way through this menu, over time. When you hear \"everything on the menu is really good,\" it is not correct. Here, it is.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "iVpGAAPNff_sBxDLUuMkMQ"
  },
  "xag3q0QGU9WYWESlEf8UQg": {
    "date": "4/1/2018",
    "text": "Why 4 stars? Because this was a tasty and fun experience.     ---   ---   ---  This was one of those meals with co-workers that I don't often get to see, where the most memorable part of the evening was the conversation. I've probably experienced about 50 of these dinners over the last few years, and every time I sit down to write my review of said experience, the details are a bit fuzzy. Between being engaged with colleagues and the flowing wine, I was not on the top of my Yelp game on this night.   We sat at one very long table upstairs and had a menu of pre-selected items that all came out family style aka the best style. As I mentioned there was no shortage of wine and the staff was prompt/friendly.  In terms of food, we had items like chicken skewers, papaya salad, pad thai and many others that I didn't catch the name of. We ended with fried bananas and coconut ice cream which is one of my favorite parts of eating at a Thai restaurant. Nothing stood out as absolutely amazing, but nothing was bad, either. Just an all-around solid meal.  I would definitely return on a future visit to Scottsdale!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "pou3BbKsIozfH50rxmnMew"
  },
  "dPMUtijO17jj4Rm6VxuJog": {
    "date": "2/17/2019",
    "text": "A unique restaurant. Flavorful dishes beautifully presented. The service was slow but it was a busy Saturday night and the food was amazing... so worth the wait!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "efiZqOW3XgkJXxkERPEoig",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/efiZqOW3XgkJXxkERPEoig/o.jpg"
      },
      {
        "img_id": "LH6IkqZNw7PJAhjyamIcnA",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Prawns with eggplant",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LH6IkqZNw7PJAhjyamIcnA/o.jpg"
      },
      {
        "img_id": "k-5ygKMmo1qgW-HMohOZvw",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Mango with coconut sticky rice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/k-5ygKMmo1qgW-HMohOZvw/o.jpg"
      }
    ],
    "user_id": "bVN8yyz66h1hLWb20ZJdRg"
  },
  "Cct7FQY5oz3g9LplveetzA": {
    "date": "5/18/2018",
    "text": "Came here on a weekend. Pretty far drive from Gilbert, probably as far as I would drive to.   LUNCH M-F 11:30am - 2:30pm  DINNER M - Th 5:00 - 9:30pm Fri & Sat 5:00 - 10:00pm Sun 5:00 - 9:30pm  HAPPY HOUR Daily 5:00 - 6:30pm  ---------------------- Parking: big lot, no issues. In a plaza.  Environment:  fancy, more upscale, modern layout, a second floor, I guess if this place gets packed, clean.  Food: I tried the Gai Gra prow.  Minced chicken wok-fried with blue lake green beans, basil, garlic, and fresh chili. (add fried egg $2.50). Spicy level: spicy (next one up is thai spicy). For me the spicy was just right, had a little kick, but bearable. (you can ask for additional spice on the side) A little stingy on the rice in my opinion, and will cost additional for more rice.  Overall flavor was right and pretty good! loved the crunchy basil that appears to be toasted on top.  quantity- just enough if you are average hungry.   Mango sticky rice - sticky rice was done well, easily devoured all the mangoes.   Price: $12 + Chang beer for $6 + tax Mango stick rice? uncertain, as it was not on menu.   Service: Attentive. fast. friendly  Overall: Recommend trying happy hour, avoid the dinner prices",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "io3JoPj05TGtuaBCB-u-6Q"
  },
  "wBVDHw33GZ6-OXkqh1LfAQ": {
    "date": "10/14/2017",
    "text": "The most upscale Thai restaurant I've been to, well, it is in Scottsdale, AZ (I thought about shopping around in the plaza after eating here but everything is high end boutique or brand names. My husband and I sure felt like backpackers...)  Too bad the food wasn't that high profile in taste. We shared a Pad Woon Sen and a Crab Fried Rice, both could be a little less bland, although the \"wok hei\" about made up for it for this Eatery to receive an average rating. Service is cordial.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AmWFSniLGlf_g-4RYx60jg",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. pad woon sen",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AmWFSniLGlf_g-4RYx60jg/o.jpg"
      },
      {
        "img_id": "KuYyJg20NPPQGOoJatiIMg",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KuYyJg20NPPQGOoJatiIMg/o.jpg"
      },
      {
        "img_id": "0AJ-pS8Xugo3hUlurfDAFw",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0AJ-pS8Xugo3hUlurfDAFw/o.jpg"
      }
    ],
    "user_id": "KMNrOXkfx7CLAaxA6y0dWw"
  },
  "veePF7THX-RHb_fpqKi7Xw": {
    "date": "5/20/2018",
    "text": "3.5 stars.   A pretty good Thai place. The inside layout is trendy/modern which I liked.  The pad ke-moa was a little too oily but not bad.  The kieow tod (shrimp & chicken/pork dumplings) and the Yum Woon-sen salad (chicken & prawn w/ vermicelli) were my favorites.  The fried banana & coconut ice cream dessert was very good too.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EEhEYZ-qYkeEj9MXzzl_5w",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Thai tea",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EEhEYZ-qYkeEj9MXzzl_5w/o.jpg"
      },
      {
        "img_id": "7SeWDSt5bgoANt6jhD6yew",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Pad Ke-moa",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7SeWDSt5bgoANt6jhD6yew/o.jpg"
      },
      {
        "img_id": "AQNVoW5gZ7yTMh4Y3SM9cg",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Fried Bananas w/ coconut ice cream",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AQNVoW5gZ7yTMh4Y3SM9cg/o.jpg"
      }
    ],
    "user_id": "YYJyRguDNjEYWzozCSNnFQ"
  },
  "8klXbTqDTohdCSVg-Gt_gw": {
    "date": "3/21/2018",
    "text": "Great spot.   The atmosphere is chic and open.  The food is fresh and flavorful.   Our larger group tried a bit of everything.  Ask if the have any whole fried fish left.  They go quickly!  Drunken beef, Pad Thai, papaya salad, short ribs....all delicious!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gb4UX0xZVda2X8sHuwV_FQ",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gb4UX0xZVda2X8sHuwV_FQ/o.jpg"
      },
      {
        "img_id": "_FRCLIw5igoYNrAELan2wQ",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_FRCLIw5igoYNrAELan2wQ/o.jpg"
      },
      {
        "img_id": "d762K8brOsx9fjYvRcf_Dw",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/d762K8brOsx9fjYvRcf_Dw/o.jpg"
      }
    ],
    "user_id": "55rwZXJn6S5JKp2vDHyO5w"
  },
  "RTV93fDqdox5j2PveELMNw": {
    "date": "10/14/2018",
    "text": "Beautiful place, friendly staff and good food. Only wish we did not have to pay extra for rice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GAIShZWzEqwIgTbXkjoMug",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GAIShZWzEqwIgTbXkjoMug/o.jpg"
      },
      {
        "img_id": "b5qM6axmhy7KVOP-0IxiCA",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/b5qM6axmhy7KVOP-0IxiCA/o.jpg"
      },
      {
        "img_id": "41MswKB4i0H1JGTepTw4Bg",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/41MswKB4i0H1JGTepTw4Bg/o.jpg"
      }
    ],
    "user_id": "o-yDNsuwtcbG8iFQM3TrEg"
  },
  "t5VdPIFDWMlZRxPu8ZuclA": {
    "date": "2/19/2017",
    "text": "I brought my family to Soi 4 for a early Friday night dinner. We walked in and it was very modern and fancy looking. High ceilings with the main dinning on the bottom for and outside. They have upstairs dining too and I noticed the larger groups were upstairs.   We started off with Paupia which is basically crispy vegetable rolls. I thought they were pretty good. We also had the Plamuk Tod which was calamari. It came with about 8 pieces of calamari with carrots and onions. The sauce on the side was really good. Spicy and sweet. Calamari was cooked perfect. Not to chewy. Really good but a small dish.   I had the Kang Bpet which was honey roasted duck filet with Spinach, lychee, and pineapple. The server told me that this comes in their medium heat only. Was a little tentative at first but actually their medium heat was really mild heat to me. Duck was cooked really good. Not a lot of fat on the filet. The dish really came together with the curry and the pineapple and lychee. I got a side of brown rice with this. I really liked this curry dish. Outstanding.   My wife got the pad se-ew which had pork, broccoli, and egg. She really like it a lot. My daughter got the pad ke-mao and it had steak and basil. Their version of drunken noodles. Very good. Daughter loved it. Then my son got the gai yang which was Thai BBQ chicken with sticky rice on the side. I didn't hear any complaints from him. He liked it a lot.   For dessert I had the Thai iced tea. Got to say that this was probably one of the best I've had. Not too sweet. Perfect blend. Really enjoyed this. We also got the Mango sticky rice. Sweet mangos and I loved the sticky rice. Really good.   So the service was pretty good. They brought our water cups right way and our server greeted us pretty quickly. Our server Aimee Carrero knew the menu very well and helped us make some pretty good decision. Not a lot of personality but she was very efficient and took care of us. Also, liked it a lot where they put your own water pitcher at the table.    So overall the ambiance was pretty cool. Dim lighting, pretty loud with all the tables enjoying themselves, and you can hear low music in the background. Food was really good but the heat level could be a little higher. Just remember if you are one of those people that likes high heat. The service was great.   So overall, I really enjoyed this place. Probably one of the best Thai places I've been too. I will most likely be back. Enjoy.",
    "rating": 4,
    "rated": {
      "funny": 33,
      "useful": 57,
      "cool": 56
    },
    "photos": [
      {
        "img_id": "mhH7wK-VpwHDEe48iwg4Jg",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Gai Yang - Chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mhH7wK-VpwHDEe48iwg4Jg/o.jpg"
      },
      {
        "img_id": "-VB38MGdek5F2Gw46nUvmg",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Pla Muk Tod - Fried Calamari",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-VB38MGdek5F2Gw46nUvmg/o.jpg"
      },
      {
        "img_id": "wzNQ-cP6cAagDZI2I-huBA",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Paupia- Crispy Vegetable Rolls",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wzNQ-cP6cAagDZI2I-huBA/o.jpg"
      }
    ],
    "user_id": "asL1d04xS3y8YQtU5ota-g"
  },
  "tPZlkLw9epjidM5uTeKuaQ": {
    "date": "3/8/2019",
    "text": "Another perfect meal today at my favorite Thai restaurant in town.  Addicted to the Pineapple Fried Rice, the Pad Thai and all the curries.  Never disappoints",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HlK7u0NYao-SoUG71hvM4A"
  },
  "c041dxeZPtRMvE29D6ZJQw": {
    "date": "10/23/2017",
    "text": "This is my first walk away review on Yelp. We walked in and were given a table. When I went to the restroom my better half was served water and then no one showed up for ten minutes, we set the timer to be sure we gave them enough time and then we left.  Tons of servers walking back-and-forth looking at our table and doing nothing, the guy that sat us down was nowhere to be found and when we walked out no one cared or even looked our way.  It was the oh so dreaded and typical, not even half full place, with lackadaisical service.   They obviously have issues with their service. Too bad, it smelled good in there.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "PMhBMIpAH_wf0aAe2OOIFg"
  },
  "3YciqWG23a_BlnbXa2npxg": {
    "date": "12/19/2017",
    "text": "I have been here a few times over the years and have always enjoyed it. Last night was another good experience and we had great service from Nong. We ordered the Dtom Kha Gai soup to start, which was fantastic. It arrives in a flaming soup pot, and has a beautiful balance of tart lemongrass, sweet coconut milk and juicy, rich oyster mushrooms. I could make a meal of it! We also had the braised short ribs in panang curry. The meat was fork tender and the curry was delicious. And, we tried the Pad Thai. Although it was good, I have had better. I wasn't a fan of the tofu in it, which was fried and served in really tiny pieces that made it chewy. As a wine enthusiast, I wish the fact it was half price wine night (Monday) had been mentioned when we ordered a bottle. We would have certainly \"ordered up!\" So if you are a wine person, put Soi4 on your lineup for Monday!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "R9rXIKMPfe7I9LrAYItqEA",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Dtom Kha Gai soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/R9rXIKMPfe7I9LrAYItqEA/o.jpg"
      }
    ],
    "user_id": "kkF31xZwHj2cN9pH0l5N7A"
  },
  "cwyeyc_pVLWIQjuNdHr2Mg": {
    "date": "8/29/2014",
    "text": "They have gorgeoussettings both outside and inside. But that's about it. The food is mediocre and overpriced. I ordered Tom Yum soup and Eggplant dish. Tom Yum soup was not that flavorful and portion is too small to be charged $7 with Tofu.  The eggplant dish was pretty tasty, but they did one of my pet-peeves; charging a cup of rice separately!  I guess if you are not Asian, then this place can be a hot place to go, but I think Asian people like myself can find somewhere else.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ES3lshMGgHS3lu2x81o2hg"
  },
  "u_1s4jAnDBaNsdGlalZslA": {
    "date": "10/19/2011",
    "text": "So here's the skinny on our experience.  Decor: Modern, Sleek..ultimately a little cold and austere. Good, Bad..depends on your mood I guess.  Service: Young Asian girl, stellar server. I'm a question asker. Whats this? Why this? What does this mean? Every question fielded effortlessly as if she had cooked it herself. Very prompt and courteous.  Drinks: Pass. I ordered a drink that supposedly had 151 rum inside. It would take me 4 drinks to catch a buzz (this coming from someone that gets drunk on 4 sips.) The cocktail menu is unimaginative and probably cobbled together by their liquor rep to sell more skyy vodka.  Food:  Very well appointed, artfully plated, but a little bland, commercially palatable for the American palette, so if you're idea of spicy is something akin to putting a little pepper on your fries, have at it...If you like your Thai food with an authentic kick, go somewhere else. Also they charge for rice bout $4. For a 6oz bowl. Note: I would rather you tell me my curry was $18, then tell me it was $14 plus $4. For the rice. How many of us eat our curry without rice? Not many.  Seftel called this his new favorite Thai place...Howard my friend, you are suspect. Sometimes I wonder if maybe you're the one that we should be reviewing O.o  Total cost, 1 drink, 1 appetizer, 2 curries (plus rice), dessert. $78.99. Still hungry upon leaving...still craving Thai food.  Pros: Sleek interior, One well trained server (Matinie? her ticket said). Great presentation and plating.  Cons: Shameful drinks, Bland slightly overpriced food. Scottsdale strikes again.  Bottom line is that this place has great potential, if only they could take the plastic covers off the upholstery, and let their Thai Flag fly. Warm it all up a little. The ambiance, the food...and make sure that all the servers are as good as the one we had. Soi 4 you have a ways to go, but a straight shot to get there! I only wish I could say that we'd be back to see if you do...but it's doubtful. So many places to try, so little time...",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "3HEJDAYnVmXrP0b5eMxGEQ"
  },
  "xCQFbYUF4SLMK_pLzwO_iA": {
    "date": "1/8/2015",
    "text": "Soi 4 is a favorite go to restaurant. The food is consistently excellent and the service is outstanding - efficient and kind.  I particularly recommend the pad se ew and the mustard leaf wraps. Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FV4lvJeKTnl6vbTKAvBbgg"
  },
  "Gdk_LFOIxAlBN29E8FRDeQ": {
    "date": "8/12/2014",
    "text": "Love love love! My favorite Thai place! The atmosphere is very cozy and elegant. Among my favorite items are: Thai Tea, Crab Fried Rice, Pad Thai, and Veggie Rolls. We have never had a bad server, either.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VGDVve2DaK1vpa1Vv9rhfg"
  },
  "3ZbOX0P73s6n4heLToh-sQ": {
    "date": "11/3/2014",
    "text": "had a great first visit.. table was ready and the service quick and correct.. food was very good. Thank you.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6cJaug7IlMWHU-LogWvezQ"
  },
  "XjUQqmYUUaIFzxqlbcC4ZA": {
    "date": "3/5/2012",
    "text": "I finally made it over to Soi 4 and as soon as I stepped foot inside I began kicking myself for not trying it sooner. The decor is chic and minimalist with clean lines, industrial materials and orb-like rattan lanterns overhead. Above the main dining room is also a hanging balcony of sorts, which gives the space a nice three dimensional quality.   The food itself is outstanding. It's some of the best Thai I've had outside of Thailand. The flavors are deep and authentic but the dishes, rather than being traditional, push beyond the standard pad thai and curries. They are very sophisticated and elegant versions of the classics, but still stay True to the original concepts.   I recommend starting with the kanom pak gard-- a warm, sauteed turnip cake served with egg, bean sprouts, chives a spicy-sweet dipping sauce. The poh taak seafood soup is also good for a starter to share. The broth is complex and refreshingly spicy and the seafood is fresh and flavorful. Follow that with the som tom (papaya salad) paired with sticky rice.  For mains, you really can't go wrong, but I love the pad ke-mow and kang kua mu (\"coconut braised pork shoulder, kabocha squash, and Thai basil in tangy red curry\"). Definitely save room for desert. The menu doesn't list mango sticky rice, but they will have it if the mango is in season. It's outstanding. Get the fried bananas with coconut ice cream, too, if it's available.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3WOL-vicU07Qx0SNUdkIgQ"
  },
  "boMOtwZDRJ1a8AI8f4Ua1g": {
    "date": "7/31/2014",
    "text": "Nice ambiance, dinner menu pricey, staff was friendly, not the best Thai but decent for the Scottsdale lack of ethnic food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bL1WfC79oRhrZ4qATEJuBw"
  },
  "5K6RkEBaWi_l3ZHD9lq74Q": {
    "date": "7/18/2017",
    "text": "I can't say enough positive about this place. My wife and I were in Scottsdale, enjoy Thai food, and after reading the yelp reviews couldn't decide between this restaurant and the one in Old Town. Since we stayed at a resort exactly between the two we decided to try both. We had dinner at the first one, in Old Town, which was okay (a little dingy though) but when we went to Soi 4 Bangkok it was superb. We went late and the host/bartender served us (great service). The yelp review mentioned the Thai tea so we ordered it (a little pricey at $4) and it was the best we've had. Ever. They brewed the tea properly, something usually not done. We had the corn fritter appetizer and, again, probably the best we've had. 3 corn patties and a garnish of cucumber-pineapple salad. Great flavor, great presentation. We didn't have a main (it was late) so we had dessert, mango sticky rice. The portion was small, which we like, with 6 juicy mango slices and sausage-shaped sticky rice in sesame seeds. We only had Thai tea, an appetizer and dessert but it was so good I decided to write a review (I don't write many). My wife and I have eaten Thai food in many states but this place stood out. The food was superb, the service great, the decor fresh and new-looking.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CWuEzmEHjDysHmYTVIsWDQ"
  },
  "-k5FQg-00WhrQakZj6qnlQ": {
    "date": "11/19/2012",
    "text": "Simply put? Amazing. Unless you're looking for another run-of-the-mill strip mall Thai restaurant.   This is Thai fusion at its finest. From the ambiance, to the Veggie Roti to the Panang Neur and Pang Gari Gal, you'll discover a dining experience and complex, layered flavors that will have you planning your next visit with the first bite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r8SCBKfPbRIr4k0T7byZnA"
  },
  "d5R60RbNP0hK7Jh5jmdasQ": {
    "date": "5/18/2016",
    "text": "Great atmosphere with a few different, but yet delicious, Thai food!  Our waiter was awesome (very attentive and gave us good recommendations) so we loved the service!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TcKIV016o7FODtfluVMxtw"
  },
  "PHAKIavDgeAMzbT6f4Rgwg": {
    "date": "4/14/2015",
    "text": "This place was really good. The food is awesome. I had the kieow pu for the appetizer and pad ke-mao for the main course. It could have had a little more spice but the flavor was really good. I would definitely recommend this place. I will be going back to Soi 4. I cannot wait. Delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5chiriN16KCMQVH_O6kamg"
  },
  "TVUHP_MnTuhARdQFMa_Xuw": {
    "date": "2/18/2014",
    "text": "The toong tong was a decent appetizer and the pad ke-mao was a good entree, but the pak rad kang (with chicken added) was a disappointment. All in all, the food was fine. Not special, but not terrible either.  This rating would've been higher--that is, 3 or even 4 stars--had the service come a little closer to living up to the hype in other reviews. As it was, we had a 7pm reservation and were seated promptly upon arrival, but no one came to our table for a full 20-25 minutes after being seated, despite several tables sitting empty (and uncleaned) around us. Had the place been full, it would've been more understandable. But it was kind of ridiculous how good they were at ignoring us as we pleaded nonverbally for at least a strong beverage to pass the time.  Incidentally, when it came time for the check, they were very attentive all of a sudden.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ez7yykr5jNRMXCbtSR-6Tw"
  },
  "h0HvxK3yG-TW9Z3z9Lc1Ow": {
    "date": "6/21/2011",
    "text": "This place is my new favorite...everything on the menu is really delicious!  I keep going back and trying different things and continue to be happy.  The food is kind of traditional but very high quality...no funny meat here...The short rib panang Neur...is my favorite as is the port shoulder!  I love the sticky rice!!! I only wish there was an Indian restaurant with these standards in our town:(",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "hddbff7JsR4Wb273XmE4NQ"
  },
  "-BM4ZzagFzuROj3ml1s5iQ": {
    "date": "4/7/2014",
    "text": "Soi 4 is the best Thai food I've had in Phoenix. My boyfriend an I are vegetarian, and there are many choices for us here. We love the turnip cakes as an appetizer. All of the main dishes we have tried have been awesome as well!  The service is always great and there is typically no wait!  I definitely recommend checking this place out if you are in the Scottsdale area!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gZ5Mnwng2mOq1J8JXP2Fkw"
  },
  "9pbaad2ZSRpM2wXdkTPwYQ": {
    "date": "9/2/2012",
    "text": "Looking for a place to eat on a Friday night and we stumbled across this place! , I wasn't in the mood for Thai food but once we ordered our appetizers and entrees I pleasantly pleased! The taste of the short ribs was delicious and our tiger prawns were very tasty!! I would recommend this place for a relaxed date night",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xPws2n3V4xkrqvLXPgopoQ"
  },
  "31EAHzF8pbJa8ueNazp9cQ": {
    "date": "6/20/2014",
    "text": "Cocktail menu looked great, but none peeked my interest enough to order. Started with the fried calimari, which came with a sriracha vinaigrette that was very tasty. For my entree, I tried the Yellow Curry with Chicken and it was delicious! I ate my entire plate. My friend had the gai gra prow and didn't like it at all. Honestly, I tried it and it wasn't very good - my curry was ten times better. The service was very courteous but didn't check up on us as much as we needed. Usually, if you notice that you your table hasn't been touched, it's not a good sign. All in all I'd definitely go back for that curry!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mDyfUNkphEyfbaqGHC4W5A"
  },
  "PymOaD3stV-aaRMq1mWMZA": {
    "date": "10/8/2014",
    "text": "My husband and I love coming here for their cocktails and to grab a bite.  If you like Thai influenced cocktails with ingredients like lemongrass, basil and ginger, try Soi 4.  The ambiance is beautiful and the food and staff are great too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aLb6aKgpZq59T7RyE2cndA"
  },
  "UECjizZ60or2wyzFkM_Nsg": {
    "date": "5/30/2011",
    "text": "Too expensive considering the overall experience. Food was good but nothing to rave about. Menu is very non traditional. The peanut sauce was good, and so was the eggplant dish I ordered . I just feel that considering the amount of food we ate: 3 appetizers, one salad to share, two entrees, one glass of wine, one desert  for $ 76 is pretty steep in my opinion. Service was friendly and efficient.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "YfvMjY-G6y86Ov2tS5Txww"
  },
  "KNzS2XOVF5rub8w2Pr9XWA": {
    "date": "10/18/2011",
    "text": "I stumbled upon this place because the Mariee bridal salon I wanted to check out was closed.  Absolutely shocked at how delicious this was!  The decor is a bit dark and moody, but uber-modern and Thai hipster.  I dug it.  I was just there for a light lunch.  I went with the spicy hot and sour soup with prawns and oyster mushrooms and a fried catfish salad with mango, green papaya, cilantro and lime.  And a tall glass of Thai iced tea.  I'm a big Thai food fan, and actually tend to eat only Asian food (Korean, Vietnamese, Indian, Japanese and Thai.)   I was blown away by the quality and presentation of the food!  The soup was spicy but still had subtle delicious flavor.  Plenty of prawns and mushrooms, but absolutely perfect balance.  And the SALAD!!!!  Best thai salad I had ever had, hands down.  And I've BEEN to Thailand!!   The Thai iced tea was also delicious.  Service was friendly - big smiles - overall just a really lovely surprise.  Can't wait to come back next time I'm in Phoenix.   Kap Kuhn Ka!!    Arroy Dee!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "huhJabtTh5_QWaJ1Tul1Mw"
  },
  "IOBCvpwzN_wJ7jhbZX0mzw": {
    "date": "1/30/2011",
    "text": "Went back and overall had a better experience:  better food and much better service.  Relieved to see some improvements and think that they will start to build some regular and return customers .  Will be back with others to experience good Thai and  hope to see this place continue to pick up business!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "uluHjQdwAlwzeJgsKvh-MA"
  },
  "IkTOWNroEpXpfGpwxZBiNA": {
    "date": "9/7/2019",
    "text": "This is my favorite Thai restaurant in Scottsdale. The food is authentic and delicious. We have tried so many different items on the menu and everything is so fresh. The staff is great and easy to come find a table. They also take reservations online!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "463_kz6lC7WJiPS3GK9kaw"
  },
  "r4L19iVu2uX_DVWj441K4Q": {
    "date": "8/1/2019",
    "text": "Modern decor. Menu a mix of traditional favorites and more unusual items  Nice wine list.  Angus steak with onion rings snow peas in mild chili sauce was pretty sweet. Skirt steak with wide rice noodles listed as spicy but not really.  Satay was very good.  We'll be back to try different menu items,  Very friendly service.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9vTVcqAtH6jyGk2Oufc7nw",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Floating 2nd floor pretty cool.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9vTVcqAtH6jyGk2Oufc7nw/o.jpg"
      },
      {
        "img_id": "GO1qqX7pDTscXYZrm8m_5Q",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Wide noodles and skirt steak",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GO1qqX7pDTscXYZrm8m_5Q/o.jpg"
      },
      {
        "img_id": "S4ZndTDaqnB93UAGyedPDg",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Angus beef",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/S4ZndTDaqnB93UAGyedPDg/o.jpg"
      }
    ],
    "user_id": "dZYjUPaFQvaxGaHjDVoO2A"
  },
  "R5ubZbZ239OdzhCGcAt4zA": {
    "date": "3/21/2019",
    "text": "Tried again tonight w Postmates & we have a winner !! Yay !!  Spring rolls B  Dumplings A- Chicken Wings A + Wide noodles w skirt steak A  Pineapple fried rice w prawns A  Prawns w mango A Yes it was $100 but super good. If they hired a new cook he or she should be commended!! Each dish had its unique flavor . yay again !!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nX55th0dv0MLodYjzuTDxA"
  },
  "MM5uYWbvoRZdsP_8o7WY-A": {
    "date": "7/28/2019",
    "text": "1-time visit during my stay in Scottsdale. I've had plenty of Thai food before, and flavor-wise the food was alright but portions were small and price $$. My friend and I shared an app and entree: the fried chicken wings ($9) + Pad Kee Mao ($15). Not a very filling meal. Again, standard Thai cuisine but I did notice the fried chicken drumettes were quite deeply pigmented/bloody (bone + meat) which made me question how fresh the chicken was but, according to the internet, is healthy and fine to consume if fully cooked. The flat rice noodles also had a bit of a bite to them, not completely soft/translucent as I've had in the past.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6fypugaDGLT7CbQH3N9G4Q",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Pad Kee Mao ($15). OK but sadly small portion",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6fypugaDGLT7CbQH3N9G4Q/o.jpg"
      },
      {
        "img_id": "DQNPveedeDPJPoCQpZJU9w",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. ~5 pieces of chicken for $9. Sweet chili sauce alright",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DQNPveedeDPJPoCQpZJU9w/o.jpg"
      }
    ],
    "user_id": "7bb1FK71jF-I2DKI45gpnw"
  },
  "n42PkuWae2YyHJ-ff_yGdg": {
    "date": "3/13/2019",
    "text": "Cute Thai restaurant in a high end shopping center.  Great service, moderate prices.   They use typical Thai flavors like curry paste, lemongrass and basi, but the menu is not the typical Thai food I'm I am used (soupy curry  for example).   Food had a good heat, the papaya salad for example was too spicy for some at our table, but I thought it was delicious.   I had vegetables with a red curry like sauce but the focus was more on the proteins with little sauce to soak into my side of rice.  I didnt see all of my go to Thai options, but enjoyed what I had and will certainly be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yE1290cGpf2s_sJT37ZZrw",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Ginger mule to kick off the meal",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yE1290cGpf2s_sJT37ZZrw/o.jpg"
      }
    ],
    "user_id": "NorW_qcBjw3JWYDsN9z9ag"
  },
  "oHt1QFW_w232r4UEXb_sQw": {
    "date": "5/9/2019",
    "text": "The lunch special is amazing.  Try the red curry and all for it Thai Hot if you dare.  Mochi Ice Cream flights finish the meal perfectly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fWxuOGEYN6Kek2WnmLHK5A",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Lunch Special",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fWxuOGEYN6Kek2WnmLHK5A/o.jpg"
      },
      {
        "img_id": "w10VViWc86wVPlYAxFewpA",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Ice cream flight",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/w10VViWc86wVPlYAxFewpA/o.jpg"
      },
      {
        "img_id": "gv3kbNHNnD7I9PKqsth5Ug",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Sunlight",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gv3kbNHNnD7I9PKqsth5Ug/o.jpg"
      }
    ],
    "user_id": "HuPF1XOx3N6U5BEYnTWqKA"
  },
  "DPIbssrCNsqcsh2M5eguOQ": {
    "date": "11/3/2018",
    "text": "The atmosphere is really nice! It's not too noisy but it's not quiet either. I'd say it's great for a date or with a group of people.   The food is good as well!! We had the crispy chicken wings, yellow curry and pad thai noodles. They also have a happy hour that's reasonable in price.  My only complaint and reason why I gave it a 3 star is because the food took extra long to come out. Our appetizer for some reason was quick but our main entree took close to 30 mins. We actually wanted to eat our chicken wings with our side rice but by the time the food came out our chicken was already cold. Our waitress was apologetic and was really nice thou. I just wish they were a little quicker.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q5e_7iWo-D8JK98t3dITFg"
  },
  "gh386o5gHPUMO4tzGEveFg": {
    "date": "7/31/2019",
    "text": "Lisa, my server was amazing! I like to see what is good by asking the servers to surprise me. She didn't even hesitate. She just took the challenge and succeeded. She brought me out the Corn Cakes which were sweet and delicious. Then for the main meal she got me the Braised Beef Short Ribs... it was a curry and it was delicious! The service was amazing and the atmosphere was friendly and inviting. No visit by the managers but they were there mingling with the guests and enjoying a drink with them.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QOUwSXoMmcOuC7LWoF8mew",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Braised beef",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QOUwSXoMmcOuC7LWoF8mew/o.jpg"
      },
      {
        "img_id": "OWadtNUeGZKXCoxkoIk-kw",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Corn cakes",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OWadtNUeGZKXCoxkoIk-kw/o.jpg"
      },
      {
        "img_id": "tSoptG6OLOWCq7PEllqLBA",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Bill",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tSoptG6OLOWCq7PEllqLBA/o.jpg"
      }
    ],
    "user_id": "MHVbH5SNUQzcgPMBMgJ5FA"
  },
  "zS7rQ_qSEahS6X70iFHTvg": {
    "date": "7/5/2019",
    "text": "Their DoorDash pricing is 3$ more compared to restaurant menu . I believe you are serving same quality food , then why the difference?",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Xj3FLBlW66FL510G5MLFuw",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. DoorDash pricing",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Xj3FLBlW66FL510G5MLFuw/o.jpg"
      },
      {
        "img_id": "KUxy-cpQUw8cUw9scnxOkw",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. DoorDash pricing without fried egg option",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KUxy-cpQUw8cUw9scnxOkw/o.jpg"
      },
      {
        "img_id": "k-6AhnMQ6cM_oltkjPpuJA",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Restaurant pricing",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/k-6AhnMQ6cM_oltkjPpuJA/o.jpg"
      }
    ],
    "user_id": "R226nmsWGEZm8rVR-4gQJg"
  },
  "Y0kh0qi_M1dD0TPnJHbT5A": {
    "date": "6/12/2018",
    "text": "Soi 4 Bangkok Eatery is a solid choice for Thai cuisine in the Valley and after more than a handful of dining experiences here, I'm definitely a fan.  I've dined at Soi 4 with parties of 2, 4, and approximately 20, and I've never been disappointed.  Service is attentive, atmosphere is fun, and the food / drinks will not disappoint.  If you go with a group, you can't go wrong being seated in the main dining room or for a little more privacy, you can request the private mezzanine, which is pretty awesome.  For appetizers, I recommend the corn cakes, calamari, and spring rolls... You can't go wrong with any of the noodle or curry entrees, and a few favorite veggie dishes are the Eggplant Red Curry, Wok Fried Japanese Eggplant (can you tell I'm an eggplant fan?), and Brussels Sprouts.  I don't think I've eaten anything at Soi 4 that I haven't liked though, so be adventurous and order what sounds good to you!  Prices are moderate and location is convenient -- at least for me!  Looking forward to returning again soon!",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 12,
      "cool": 11
    },
    "photos": [
      {
        "img_id": "n4yrhNk353_Z7VQeSP4DZg",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Pad Thai",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/n4yrhNk353_Z7VQeSP4DZg/o.jpg"
      },
      {
        "img_id": "1cAzaseT_ynOIVKQ_xNLeg",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Eggplant red curry dish",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1cAzaseT_ynOIVKQ_xNLeg/o.jpg"
      },
      {
        "img_id": "7royjHb2qAum91yaneGhrw",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Fried bananas and coconut ice cream",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7royjHb2qAum91yaneGhrw/o.jpg"
      }
    ],
    "user_id": "dIIKEfOgo0KqUfGQvGikPg"
  },
  "-KkYQyRFZdvORDvB3vz3fQ": {
    "date": "6/15/2018",
    "text": "Soi 4 does Thai food with a modern flair and they do it well!  First off, the ambiance is fabulous. I felt like I was in a trendy Los Angeles restaurant from the moment I walked in. They also play relaxing, yet upbeat instrumental music that added a nice touch. We were greeted promptly with waters and we ordered a Sauvignon blanc and a tequila drink from their speciality cocktail menu.   For an appetizer, we shared the traditional Tom Khai  Gai soup which came in a flaming hot pot. It was delish and a nice start to the meal! For our entrees we shared the Minced Chicken entree and the Spicy wide noodles with stir fried beef. The noodle dish was amazing! Great flavor, perfectly tender beef and a variety of fresh vegetables. The minced chicken dish was a little boring. It was just ground chicken and veggies. I'm glad we ordered rice on the side as it doesn't come with it. The chicken would have been great in a lettuce wrap but the dish just seemed unfinished.   All dishes are a bit pricey, but I felt it was fair for the service, ambiance, and location. We will definitely be back next time we want to enjoy elevated Thai food!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 5,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "FmfcUp43IVz-bQGi5ht2NQ",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Tom Khai Gai soup",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FmfcUp43IVz-bQGi5ht2NQ/o.jpg"
      },
      {
        "img_id": "hlvqNNQ4CDR1l3DbgLQVjg",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hlvqNNQ4CDR1l3DbgLQVjg/o.jpg"
      },
      {
        "img_id": "yNc8qF6Rek8dYLSMB9QNQw",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Minced Chicken entree",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yNc8qF6Rek8dYLSMB9QNQw/o.jpg"
      }
    ],
    "user_id": "KaYukl9swlpo71HupJrUWw"
  },
  "THNrcLtMT_udXus8FaxZVQ": {
    "date": "11/12/2018",
    "text": "Soi 4 is a fantastic place for Thai food, pricey but it's a trendy place and for sure worth the visit. I believe it's family owned. The atmosphere is chic, trendy, dimmed lights and great music.  They do have an upstairs area for eating and I could see that being a great place for a larger party or even a work event.  Ordered the yellow curry and it was tasty.  If you're looking for a \"trendy\", date night restaurant and you're craving Thai, head to Soi 4.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Y9OiJZLLPRLuLmhlAUZahQ"
  },
  "YLA-wauCoFZZJ97tvLW2XQ": {
    "date": "10/16/2018",
    "text": "We had a birthday party here for 20 and it was excellent they had tables put together for us and service was terrific.  The food selection was fantastic and was very good as well.  Even with a large party of diners they were still able to make sure everyone was taking care of.  And I love the atmosphere there!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 5
    },
    "photos": [],
    "user_id": "iDlkZO2iILS8Jwfdy7DP9A"
  },
  "vkxg3EtayjPwO_8UCqTH5g": {
    "date": "5/20/2018",
    "text": "Nice happy hour options! I was the only person during open so I enjoyed the great service all to myself. The food is GREAT. You're not going to find any Chinese-American options, and that's okay because the drunken beef is fantastic. Expensive, but fantastic. It is light, has fresh green beans, Chinese eggplant, and lemongrass. It doesn't come with rice, but that just means you can have noodles or brown rice.  With happy hour specials, start your dinner with fat chicken wings and $3 Chang beer. Or, have a cocktail with house-infused liquor. They have ginger or kaffir lime infused vodkas available. The loss of star is because the prices are high for what I'm used too and there isn't an outdoor option. The decor is very slick, but I would have preferred to enjoy the sun at 5pm.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uLEo3BzHmeIeFRK483j2Sw",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Condiments like prim nam pla!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uLEo3BzHmeIeFRK483j2Sw/o.jpg"
      },
      {
        "img_id": "wioU-KqLOmwiMQgKf7lPSQ",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Drunken beef- so good",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wioU-KqLOmwiMQgKf7lPSQ/o.jpg"
      },
      {
        "img_id": "k1CCfbSr-CXyvwn7OZushA",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Chicken wings $5 happy hour",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/k1CCfbSr-CXyvwn7OZushA/o.jpg"
      }
    ],
    "user_id": "h-fLV73R-wF0OQ-9dQkbKQ"
  },
  "7Aq0HRzCrmCNqODJvjNnjQ": {
    "date": "8/4/2019",
    "text": "Great Thai food with excellent service and really nice setting.  Cocktails are mixed just right as well. Great casual dining.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AhMC1lsErb4twLT9FaBxGw"
  },
  "oVNpnpsV0WqjKG9V1vglzA": {
    "date": "4/14/2019",
    "text": "Very good food at reasonable prices. Very clean and quiet atmosphere. Staff is very polite and attentive.   Only complaint is the parking situation. There are a lot of businesses in this center and the spots are small. No fault of the restaurant, just difficult",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CY9BgknyYIvyNhgDDp7uYA"
  },
  "IVMuHYK-UmAMidYKJToWGw": {
    "date": "3/14/2018",
    "text": "I was thoroughly wow'd by a recent first experience at Soi 4. We were a pretty large group and although you might feel that means you won't get the individualized attention a table of 2 or 4 at most might get, I think I can speak for our group and say that we were treated so well here! I absolutely loved it.  I'm vegan so large group dinners can be a challenge. Not the case here. There were two of us plant-based folks at the table, as well as someone with a severe shellfish allergy. Our superb waitress was extremely well-informed about the menu and I immediately knew that we were all in good hands. The apps came out and there were vegan spring rolls (delicious), along with an array of other meaty Thai specialties. Our wine and water glasses were continuously filled and our every need was attended to throughout the meal.  There is an entire vegetable section of the menu. Although the rest of the table dined family style, we were able to order off the menu. I opted for the Chap Chye, a vegan glass noodle tofu clay pot. The flavor explosion... is an understatement! Since the tofu is marinated in star anise, this flavor sang through the other spices and I was pretty much in Thai food heaven (Thai food is in my top five favorite international cuisines). Bok choy is the perfect vegetable, I mean, it really truly is, and it also complimented the textures and flavors. I ate the entire thing (save for the mushrooms which were a bit too big and rubbery for my liking). No, really, the entire thing and it was a large portion.   The sultry Bangkok ambiance lends itself well to intimate dining, and our group got to sit up on this really cool balcony upstairs, which was basically a private dining room overlooking the lovely downstairs. I just glanced at another review that reminded me that Soi 4 is located in a strip mall! I had completely forgotten because they've transformed the space into a gorgeous restaurant. That kind of says it all, doesn't it?   Delicious food. Excellent service. Lovely ambiance. Soi 4 should change its name to Soi 5 (stars).",
    "rating": 5,
    "rated": {
      "funny": 8,
      "useful": 18,
      "cool": 14
    },
    "photos": [
      {
        "img_id": "i7q7SBZl8OJ3g8nP5tEDMw",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Chap Chye - a vegan glass noodle dish with Bok Choy and tofu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/i7q7SBZl8OJ3g8nP5tEDMw/o.jpg"
      }
    ],
    "user_id": "0G-QF457q_0Z_jKqh6xWiA"
  },
  "pUXGK5YGCZ25fdPW2RmsCQ": {
    "date": "9/23/2018",
    "text": "Decided to try Soi 4 for a dinner date with my husband. The restaurant is very chic and upscale, awesome place for a date! We ordered the fried shrimp and the dumplings for an appetizer.  I ordered the chicken curry for my main dish and it was good. The only reason why I didn't give Soi 4 a 5 out of 5 was because you had to purchase rice to go with your curry. The majority of Thai restaurants gives you rice when you purchase a curry dish. $1.50 isn't a huge charge but still, rice should be part of the meal in my opinion.  Would totally come back here though, service and food was awesome.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "3AV5ONopdwL5qKYW20SRdg"
  },
  "Oa9Dezkfvybul98t_d8Jmg": {
    "date": "3/13/2018",
    "text": "Had a lovely group dinner here recently and was really impressed with both the food and the service! Our large group had the entire upstairs with a long table and a set menu printed out for us and ready to go. Our server was so on top of things from beginning to end and didn't miss a step, even when some people in our group had orders beyond the set menu, we had trouble deciding on wine orders, etc.   The highlights were many but I especially loved the papaya salad, crispy shrimp, and fried banana with coconut ice cream for dessert. It wasn't the healthiest dinner ever, but it'd definitely possible to go healthy there, too - and my vegan dining partners had a great meal as well!   The decor isn't what I would expect from a Thai place - a bit glossier and fancier than normal - but it makes it a nice choice for something like a birthday dinner or work team dinner, without breaking the bank.   Though the experience was wonderful from start to finish, it was the service that really took it to five stars for me!",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 12,
      "cool": 12
    },
    "photos": [
      {
        "img_id": "eWjpEmGzce2HXPvzE0BiRA",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Fried banana and coconut ice cream",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eWjpEmGzce2HXPvzE0BiRA/o.jpg"
      },
      {
        "img_id": "kznGdWY2HKySHSE-iCkMxQ",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Shrimp",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kznGdWY2HKySHSE-iCkMxQ/o.jpg"
      },
      {
        "img_id": "k-YFxfjKX26E36qjJJP3MA",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Chicken curry",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/k-YFxfjKX26E36qjJJP3MA/o.jpg"
      }
    ],
    "user_id": "yh8_9Ix1wp9dekvyOZbilQ"
  },
  "UzLPk95_yWc3_99Antglkg": {
    "date": "8/23/2018",
    "text": "Wait what just happened? I was supposed to love this place. It was highly recommended. I gave it only 3 stars because I don't just hand out 4 and 5 stars , without the place, truly being flawless. Unfortunately, it came down to flavor, and they just don't have it. Soi 4, has presentation, cool restaurant, great location and \"pretty good Pad Thai.\" My lunch special was $17.00 came with white rice, (I really don't think it was jasmine) however the menu said it was. Coconut soup, that had no flavor, but thankfully the spice tray had all the traditional spices to add flavor to it, egg roll, and Gai Pkhing. Unfortunately, this was way too sweet. I think what was worse than the sweetness, was the breaded deep fried dark fatty chicken meat. I've never had this dish with breaded fried chicken, at any other Thai restaurant. I love deep fried food, but what really attracts me to Thai food, is it's freshness and vibrant flavors, which this place totally lacked. Hubby got the lunch special, chicken Pad Thai, it was good, and only $12.00, it didn't come with soup, which is fine, since it had absolutely no flavor anyway. He did get an egg roll and a tossed green salad. (Would of been nice to get a Thai salad, instead of California greens with cucumbers on top.)  The server knew I didn't care for my dish and brought out a complementary coconut ice cream. I thought that was very nice! I don't think I'll come back, only because I've had better Thai in Phoenix, at a better price point. I feel like you're paying higher price for a nicer Thai restaurant and compromise on quality, and taste of food. Definitely not authentic. I guess I'll stick to the hole in the walls, with outstanding Thai food!",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 4
    },
    "photos": [],
    "user_id": "ED7dq2rT3IWXjSl58CR36w"
  },
  "EbvFh2eP7mafX7l4Cmq-VA": {
    "date": "1/5/2017",
    "text": "Had three great meals there.  The fourth time was a lunch and it was terrible.  Some of the dishes we had previously ordered were terrible, service slow and the place was almost empty at lunch time.  Asked the waitress and she said they had a different cook.  Later the manager came and, when asked, said it was the same cook they always had.  She did not take any comments on the marked negative difference in their meals well.  In fact, she got insulting and almost pushed us out the door.  It is good when it is good, and when it is bad - you better not tell the female manager.  We will not go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4VRYQxjYVLHpKx-1e8F3uA"
  },
  "GCAySjpyw3TQKVHH9XLIMw": {
    "date": "7/7/2012",
    "text": "Looove this place!  I loved the sexy, yet simple atmosphere.  I felt as though the air was cleaner somehow just walking inside.  Let me first say that Happy Hour prices were outstanding!  I have to admit, I think my favorite Happy Hour spot, StingRay, has just been outdone!  The food was delicious!  All of it!  ALL...OF...IT!  From the cucumber salad to their famous appetizer, the mustard leaf wrap, it is flavorful and fresh.  The service was pretty good, but there was some confusion I think more than once, so it delayed the service a bit.  When I have to stop and say, \"Hey, where's my [fill in the blank], I know the service is lacking, although I would say not enough to keep me away!  I was really, really happy when I left here, might have been my company, but we all loved it so that is what mattered!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "yks-zWhYKVV-S_luTu3dNQ"
  },
  "jS2sHlkWBAS6nRqhuGcBRw": {
    "date": "12/8/2016",
    "text": "We have been frequent customers for four years, quality & service great every time.  You must try Miang Kum, outstanding appetizer.  Muay outstanding part of management team, Nick could not have been attentive.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jy1AwC8Zs4KmC32VGREsJg"
  },
  "mkhxsd16sYOMo5jEIp95qw": {
    "date": "12/4/2016",
    "text": "Soi 4 is incredible!  It is our go-to Thai food restaurant, and unique in that it combines great Thai food with excellent mixed drinks.  For once, do not just get water with your Thai food!  The decor is amazing as well; it feels like you are in a modern city restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BObcqom_OV-OdQPmYjjTeg"
  },
  "yfQ3BVY2pdn9hPAuPCZSAQ": {
    "date": "11/6/2016",
    "text": "We are actually pretty much regulars here. Food, service and atmosphere are exceptional. Great Whole Fish and Pad Thai.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x4rQMKeYMnqKx-bpzQ4zPg"
  },
  "pwTgMZ2xDnWGalGPI52m5A": {
    "date": "5/2/2011",
    "text": "Well in the interest of full disclosure, I will share that I know the owners very well.  But I will say I know this business after 22 years as well if not better so this is a straight up posting.  Soi 4 has got it right.  What impresses me more is to see the level of commitment to constantly improve; to offer their guests a better experience every time.  The progress from opening to now is admirable.  The team has gelled an operates like a tight family.  The menu is evolving as Scottsdale patrons provide feedback on home-runs and suggested tweaks.  The beverage program is dynamic and fully considers the food.  The food is dialed in extremely well.  It is authentic Thai with an appropriate nod to North American palates.  It is tough to do without losing the complex flavors of Thai cuisine.  Soi 4 has done it.  You can't experience Soi 4 Bangkok Eatery in Bangkok yet you can experience Thailand at Soi 4.  There is something very unique here.  It has captured the essence of what I enjoy most about Thai food and the culture.  Yet it delivers it in a way that defines itself separately.  Hence the 5th star.    The place is cool, modern with numerous design elements that seem to keep it always-new.  Credit to the architect and family for capturing the essence of Thai culture and their own hip vibe.  This is a place where you can be comfortable is warm weather attire or in your urban duds for a night on the town.  The diversity of clientele is very interesting.  And I believe the undeniable quality is the common thread here.  Be sure to reach out to the owners when dining there.  They'll quickly welcome you into the Soi 4 family.  You and perhaps more importantly, your belly will be very glad you did.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_oIP7dms5AVZrGzbVjN8rg",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_oIP7dms5AVZrGzbVjN8rg/o.jpg"
      },
      {
        "img_id": "OURfgOZuCY6lb8QXx9FisQ",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OURfgOZuCY6lb8QXx9FisQ/o.jpg"
      },
      {
        "img_id": "8XmoLnicCSz9wRFGLt7rfw",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8XmoLnicCSz9wRFGLt7rfw/o.jpg"
      }
    ],
    "user_id": "NK5Vkh07Y14PAWeoDPYJmA"
  },
  "pkqtE1sLXWWqJZYT99rY5A": {
    "date": "8/1/2012",
    "text": "Went to dinner for the first time at Soi 4 last night.  The decor and ambiance is amazing.  Great for a romantic date.   The service left a little to be desired.  It took quite a while for us to be greeted by our server and be served our drinks and it wasn't busy...at all. The food was delicious!!!  I had the duck breast in red curry on baby spinach with pineapple and red pepper.  Such flavor!!  I can't wait to go back again and try something else!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ac9a3EDZ0NHHU__CqQ29eQ"
  },
  "sQg684I_s3S_y8eBgSrLYg": {
    "date": "3/12/2016",
    "text": "Amazing food! Full of flavor !  The food is consistent but the service is not.  We recently took some friends visiting from CA, one of which had just returned from a trip to Thailand, so I wondered how it would measure up?  There were 6 of us and we were seated right away as we always use OpenTable reservations.  The service is ALWAYS slow to approach here.  The other four people had never been.. Two live in CA and the other two live 3 miles away.  We ordered drinks and all but 5 of 6 orders arrived.  We waited a bit ( chatting away ) but finally one of the male guests got up and asked the bar where the other drink was?  Finally bringing it over and having ordered food we waited.  And waited.  An hour for the food.  This place is eclectic and food divine.  Service is slow as molasses on a cold winter's day.  No matter which day that we've dined here the service is always consistently SLOW.  We would dine more often but there are so many options in this town, it's too annoying to have to wait an unreasonable time to dine.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yg7F6mK68820Z6fJzDdALA"
  },
  "Z_MULG4GVYVgpMjyfzrEZA": {
    "date": "7/15/2016",
    "text": "Pls don't server uncooked shrimp and clam with noodles. If you did then don't offer to take the plate and recook. And don't charge when someone declines this.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z7UOikr7F31IBAgJ-GeC-w"
  },
  "6ImfIMxjdCRlyXXlcRfM8w": {
    "date": "4/27/2014",
    "text": "A dynamite meal!  Chic, creative and most importantly delicious Thai food. Don't come here expecting the \"same ol' same ol' Pad Thai\". This place combines favors, textures and colors to make for exciting and flavorful dishes. I strongly recommend the mustard leaf app (appetizer...not iOS application) for starters and the Chilean sea bass entree. By the way, the place itself is slick, attractive and comfortable. Make sure you don't miss this gem.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Uap40j9oIbzT8ivnmAVCWQ"
  },
  "wusnIedwInZsx5Zrm8Zdvg": {
    "date": "3/2/2016",
    "text": "If you want authentic Thai food in PHX this is the only place. I go to Thailand often and I have to say their Thai food is actually better than in Thailand because they have better ingredients.  We go there often and have always enjoyed our dinners, no complaints at all.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2l-8JuwlDUD7A3BWGmZ5Uw"
  },
  "TMAkATNt1klh3vXa4Nq_FQ": {
    "date": "6/25/2015",
    "text": "I'm giving the two stars for the decor because the food was mediocre to bad. The shrimp and mustard green wraps was mostly toasted coconut and an overly sweet sauce. The amount of shrimp was comical. It was a 1/4 of a cocktail shrimp on top of each little wrap. I've never seen a shrimp cut into pieces. Unreal. The skirt steak app was just as bad. The chewy steak tasted of burnt and nothing else. The green curry dipping sauce was insanely spicy with no tang or flavor. The hot pot of lemon grass chicken soup meh. The chicken was boiled and dry. The oyster mushrooms were soggy and giant.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jST6viALNr-3aaG8VkDZjw"
  },
  "Z4eJVOSFlSvYJ9YFRp5A9w": {
    "date": "2/20/2016",
    "text": "We were a party of 6, there to celebrate a family Birthday. Having eaten here once before we thought it would be a good choice to return. HOWEVER, we will never return to Soi 4 and I'm guessing they don't care.  Our order was placed, and the appetizers came out after a while. Then we waited, and waited. After an inordinately long time, 3 of the 6 dishes came out. It turned one of the 3 was not what we ordered so the server took that dish back and left us with the 2 (without the rice that was ordered). Better than 10 minutes passed and still no more dishes. I went up front to the Hostess to let her know what was going on and asked for the Manager. When I returned to the table the Waitress was there, without any of the dishes, and she was apologizing not only for the delay BUT informed us that there was no more Lamb which was one the remaining dishes to be served. At this point I was very upset to say the least, telling the Waitress this was unacceptable. She asked what we they could do now, so it was decided that she would take back the 2 dishes from the table and work on getting all 6 dishes (one being changed because of the Lamb being gone). The dishes all came after a bit, and the food was good.  The Waitress was hardly apologetic, except when she brought the check. When I asked the Hostess on the way out, what ever happened to sending the Manager over, she informed me that our Waitress was the Manager.  Sooooo... we will never go back... there are certainly more than enough Thai Restaurants with real service, good food and a more appreciative attitude.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lEcr4m4iBkNvUo-WKONkJA"
  },
  "xm6MFk7b5qwoQpqbITci2g": {
    "date": "5/18/2016",
    "text": "I've gotten take out orders from this restaurant many times. They've made mistakes in the past but I got fed up the last time I picked up a food order although they did remake the food. I came in and ordered a few days later requesting that I not be charged because I had to drive a total of 45 minutes the last time due to their mistake. The owner refused. Not only is this bad business but the owner obviously does not care about his customers. There's plenty of good Thai restaurants in Phoenix and that is where I'm going from now on. I'll NEVER come back here because of this greedy owner.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iSbAYtamJ6Mmaj348-BvrA"
  },
  "p_kDYZOf7vAHtm5KnttKQA": {
    "date": "6/16/2014",
    "text": "Really good Thai food and rather authentic. We like to start with the pan fried Indian bread with curry. The 3 main dishes that we really like are the pineapple fried rice, minced chicken, and roasted duck in red curry. Serving is rather small.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "X51dMCSLSKlgWAwEd9YVEA"
  },
  "spbSW6j4FhDwEEfc41Bk5g": {
    "date": "3/5/2012",
    "text": "Fantastic food and service, and the ambiance fits perfectly -- modern, clean, spacious yet dark and cozy.    We had a former employee of their Bay Area location doing all the ordering for us.  She knew what she was doing.  The miang kum (appetizer, \"fresh cut mustard leaf wrap of roasted coconut, prawns, pomelo, fresh herbs, and sweet palm\") was the absolute star of the show for me.  SO.  DELICIOUS.  This is a weird thing to comment on, I know, but the sinks in the bathrooms are GORGEOUS!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ev55kUL77kZk6xCYam5www"
  },
  "9XfEiCzp9d0miN4ASPcYvg": {
    "date": "1/15/2015",
    "text": "I love it here! Creative twist to classic thai dishes. Great service. Beautiful decor!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "elyFxS3PzzcXWq55jgxuLw"
  },
  "f1g37fpS2_k9mgT02g4AMQ": {
    "date": "7/30/2012",
    "text": "The good part first: The decor and the environment is amazing! The design and decorations are superb and are lovely. That's the only reason I'm giving them 3 stars.  The bad: The food is too fancy schmancy for Thai food. Thai food is all about flavor and about the food, not how fancy you can plate it. The portions are way too litlle as well. Along the lines of this, there is only a few items that are traditional Thai. Everything else is just an Americanized version of Thai food, which I guess is what is good for the upscale area that it is in.  If you are looking for real Thai food, this place is not the place to be. But if you want some fancy date Thai place, go ahead and go here.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EoVKoQcCVxz-wWVqCAymHA"
  },
  "zxFc1IA3oW23uFU5eDj6sA": {
    "date": "1/22/2012",
    "text": "I like Soi 4, not love, but a good like. I have been 3 times, twice for dinner and once for lunch.  Service has been good to very good.  Not having a lot of experience with Thai food, I always have a lot of questions and like to ask for menu explainations. My inquiries have always been met with smiles, good descriptions, and some great suggestions.  I love spicy food, but would not say that anything I have tried is overly spicy.  I have enjoyed most of the small plates and the Miang Kum is a personal favorite.  For lunch, the bento box is a good way to try a smaller taste of several different dishes.  This is a great place to order several things and dine family style with your companions.   The decor has a cool, urban vibe. Unfortunately, during busy times, it can be a bit noisy.  Upstairs there is another dining area that would be really great for a private party.    Love having Soi 4 in my neighborhood, it is a great addition to the Shops at Gainey  and I will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "caEisRFzWv_Trxjekjywdw"
  },
  "96hiaoiQkbiWiH7Wym4baQ": {
    "date": "4/8/2015",
    "text": "Was in town on business and wanted Thai. Amazing is too poor a word to describe this place. The food was authentic, flavorful, spicy. I cleaned my plate. I had the lunch  \"Benton\" which included Tom Kha, Shrimp and Chicken dumplings, and Catfish green curry. Good buy for 16$  The curry was almost too spicy but so fragrant and flavorful. The atmosphere is modern, but comfortable. The staff was brilliant and  catered to my every need.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YN5iyh9L3lv_u0aaoAyAfw"
  },
  "23NeK_wfJV6KAAPFXCsFzw": {
    "date": "6/1/2017",
    "text": "Soi 4 Bangkok Eatery is a hidden gem (at least to me) in North Scottsdale. From the outside, the place is unassuming but when you get inside the decor is trendy and cool! We ordered the Kieow Tod for our appetizer. For those who don't speak Thai, the dish is composed of crispy dumplings pan fried and filled with chicken and shrimp served with Thai ginger soy. While good, they were a little plain for me. For my entree I opted for the Pad Ke Mao with shrimp. I loved mix of basil, garlic, and chili! The shrimp was cooked perfectly- my only complaint about this dish is that there wasn't enough! We decided to go all out and order dessert. Our server recommended the fried bananas with coconut gelato and it was AMAZING! I would come back just for this dessert. Service was great, I loved that our server made a few recommendations and took time explaining the menu. I look forward to coming back and eating my way through the rest of their menu.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 6
    },
    "photos": [],
    "user_id": "-nIVKbFxgBMHPVRJV2Djqw"
  },
  "Au2VmwgN4gAtGSdz-BnMZw": {
    "date": "4/15/2015",
    "text": "I found soi 4 bankok on yelp, and chose this place for a celebration, because the of the decent reviews and ambiance. I mean most of the thai restaurants out there are the typical place you want to take out from...not spend a nice dinner at. So with that being said, the decor was the reason for us choosing this restaurant, and it did not disappoint.    I came here with another couple, and had wonderful service...however the food fell short. We ordered the calamari and the tiger prawns as an appetizer to split. The calamari was decent, but there were only about 8 pieces and fairly large in size which caused it to be slightly on the chewy side. It came with siracha dipping sauce and freshly sauteed veggies.  It would have been nice with a sweet chili sauce or something more to dip it in. The veggies, however were scrumptious! Id order the meal with out the calamari just for the veggies.  The tiger prawns were delish. Crunchy, fresh and definitely worth eating again. We ordered the pad thai, the pork w veggies, and the seafood yellow curry. The pad thai was a little on the sweet side, but definitely decent. The pork was ordered as a thai hot, and left my husband adding more spice to it. The seafood yellow curry was the most disappointing...it was supposed to include shrimp, scallops, calamari and crab. It pretty much consisted of too much calamari, some shrimp, lots of hard to eat greens and nothing else. I even had to ask the waitress if the kitchen forgot the scallops...there were none in sight! And after the already chewy calamari appetizer, i was regretting my selection with plenty of it in my dish. As for yellow curry, i think it was a soy-based curry sauce...not a usual authentic yellow curry im used to w thai cuisine.  The mango sticky rice was a must order, but id skip the fried bananas.  Overall, i want to like this place, and i think i would try it again, but order something totally different.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "myaeY3NbX_2zJvLwDg7cSw",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Two small slivers of scallops...over all meh...wont be ordering the fish trap again",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/myaeY3NbX_2zJvLwDg7cSw/o.jpg"
      }
    ],
    "user_id": "boYRJ1VOX3iNmsGmJ0Mswg"
  },
  "6x2r_c_FqGp25YRr2qzMag": {
    "date": "1/25/2011",
    "text": "Oh great, another Thai restaurant, I thought to myself when I noticed the sign going up for Soi 4 located in Scottsdale's Shops at Gainey Village. There are so many new Thai restaurants popping up all over the valley, I have a hard time keeping up. The problem is that so many of them, more or less, have the same offerings and while Soi 4's menu is seemingly traditional, it's both modern and engaging. It's sister restaurant in Oakland, Ca was voted as one of the Bay areas best, seems they have some big shoes to fill.   Fortunately for me my dining companion is originally from Thailand. She brought her knowledge of Thai cooking which in turn gave Soi 4 street cred. We both fell in love with many of the dishes from the Keow Wan Roti ($8) a pan-fried Indian bread with grilled skirt steak and an out of this world Kao Pad Pu or crab fried rice ($10).  More love came from an order of Miang Kum ($7). Eaten like a taco, the \"meat\" is made from roasted coconut, prawns, pomelo, fresh herbs, and sweet palm then is placed on a mustard leaf. These were so light yet bursting with flavorful complexity. I know it's typical, but ordering Pad Thai ($12) is a must, if they can't get this one right, well they have no chance. Soi 4's version was no disappointment, the noodles were nice and springy, the stir-fried jumbo prawns were tender and combined with tofu, egg and bean sprouts, it's worth mentioning and ordering.  Of all the dishes that were tried, the Kang Kua Mu ($13) was my absolute favorite. They take pork shoulder then braise it in coconut milk, add kabocha squash, aka Japanese pumpkin, and Thai basil with a bit of tangy red curry. After a single bite I wanted to keep this one all to myself, tender and flavorful with just the right amount of heat.  Not all was perfect on our virtual trip to Thailand.  The Kana Mu Grob ($10) which is made up of Chinese broccoli and crispy pork belly with chili-garlic sauce. It's too bad that the belly was dried out and chewy. Pork belly when done right is so succulent and tender, even when it's crisped up its mouth-watering good.  We simply ate around the pork and enjoyed the broccoli which was tender inside with a slight crunchy exterior.  The Sticky Rice ($2) seemed old as it was unwrapped, the ball turned hard almost immediately. The familiar Neur Namtok ($10) or grilled skirt steak salad with fresh herbs, roasted rice, chili, and fresh lime juice, was pretty standard fare, though this version was considerably under dressed.   We let them know what we thought about the good and the not so good. I strongly feel that when there is a problem you need to let them know as soon as you can. Your helpful feedback only improves the food and service, most business owners appreciate it.   You know what they say, with competition comes innovation and Soi 4's delicious food, striking space and a full bar, I have to agree.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "zheREuEhhN0EiMtNFpsZyA",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zheREuEhhN0EiMtNFpsZyA/o.jpg"
      },
      {
        "img_id": "pbEY_hNcnE5IVdZV89ygNA",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pbEY_hNcnE5IVdZV89ygNA/o.jpg"
      },
      {
        "img_id": "GYLA9TjxZd1OTHHx7tsRkw",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GYLA9TjxZd1OTHHx7tsRkw/o.jpg"
      }
    ],
    "user_id": "p_azadim_uWFOXAhhKB3ag"
  },
  "PsDuusjt5tft5tKYMQTJwg": {
    "date": "4/1/2015",
    "text": "If I could give this 6 or more stars I would! I met a friend for lunch after he said it as the best in town.  He wasn't kidding - this place is the real deal.  I went back 3 more times within the next 2 weeks - I had to try a few things that looked great on the menu.  First trip -  We ordered the \"miang kum\" Fresh cut mustard leaf wrap of roasted coconut, prawns, pomelo, fresh herbs, and sweet palm - Wow - I have never had anything like it - unique flavors that blended perfectly in your mouth. Pad Thai - I had tofu pad thai with no egg - the best vegan pad thai I have ever had - Period!   My friend ordered what he claimed to be the best dessert in town - Coconut Sticky Rice with Fresh Mango - he wouldn't let me try it - I was not happy!  I vowed to try it within a day or two.  Second Trip - 2 days later Came in by myself and ordered the crispy vegetable rolls - very good with a couple of spicy sauces to dip in and then had the Coconut rice with Mango - Absolutely one of the best desserts I have had in town!  Third Trip - within a week - Lunch meeting Ordered the miang kum again - turned my business partner on to it - fantastic! Next up -kua kling mu Spicy southern Thai stir-fried pork shoulder with asparagus *** Spicy and very good  Fourth Visit - 3 days later - by myself Ordered the pad thai Fresh rice stick noodles stir-fried with jumbo prawns, tofu, egg, bean sprouts, a chives - flavorful and sensational! Followed up with coconut rice and mango (again) - just as good as the first time!  This is my first choice for any business lunches in Scottsdale and even if I have lunches 2 days in a row.  It will not disappint!  Oh yeah - the service is top notch and the place is very clean!  Thank you and keep up the Great Work!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "ylbloQXL-rW5AJQVBxt2Lg"
  },
  "ORD4Wt_I3ZPirdzdORrOQg": {
    "date": "8/4/2016",
    "text": "Great food, great prices, friendly staff, and quaint but very nice and peaceful atmosphere. I had the Pad Thai and it was really good. Plenty of flavor and they didn't skimp on the shrimp. I can't wait to go back and try more dishes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "adLitnjaqjKzMD7VaEqFgg"
  },
  "ePdpesg139fnxa3fRSvGIA": {
    "date": "10/28/2016",
    "text": "Dropped in with friends after a wine event. Service was excellent and food was amazing. We only shared a few appetizers while we chatted but the menu looked fantastic and will go back soon to try some entrees. Nice Thai themed ambiance and quiet dining - highly recommend you try them.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zCFeHM0R43qowsbjUrPXVg"
  },
  "fm_04AYytmZorveng6U09g": {
    "date": "11/13/2014",
    "text": "Sleek setting, somewhat slow service, and some of the best executed Thai in town.  Many might complain that it has been watered down to better accommodate the Western palate but I don't mind.  The food is light yet filling and the freshness stands out.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 3
    },
    "photos": [],
    "user_id": "SCo1UBoeN3bhRMkSYuiX1A"
  },
  "KRDCwXFRA18AtZp2R5kbGg": {
    "date": "9/6/2016",
    "text": "Authentic Thai food in a beautiful setting.  I love their Pad Thai, and curry dishes.  They also have some pretty good cocktails on the menu.  One suggestion is that when bussing plates after appetizers, take the silverware too.  I always think it's annoying having to put your fork and knife with food on it on a table that's wiped with a dirty rag before service. But other than that it's a great place to eat.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_bUf-9uN9ajvLs03VBxn6Q"
  },
  "RpvCrPixeBypKcPgLNjBuQ": {
    "date": "7/23/2015",
    "text": "I have eaten here quite a few times. My book club seems to like this place because it's quiet enough that all 8 of us can hear everyone at the table.  I have never been blown away by the food. It's pricey for what it is.  I did enjoy the knowledgeable discussion of the bartender the last time I was there, which is a nice feature.  The ginger vodka . . . . Is something special if you enjoy ginger!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wcDhhBk1d0_lCdvB8sds1g"
  },
  "UMfAc-cbQ231qwcLl0dIhA": {
    "date": "5/3/2015",
    "text": "Amazing food and service.  We had a group of 6 on a Sunday night. Great happy hour drinks and appetizers.  Everyone loved their entree and dessert was the perfect end to the meal.  We will definitely go back and highly recommend dining here if you're in the area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cPYTYKyKXuTD35H6U-N71g",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Ginger Drop...delicious!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cPYTYKyKXuTD35H6U-N71g/o.jpg"
      },
      {
        "img_id": "3-_xobfz3WnJ48g7_x5c0A",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3-_xobfz3WnJ48g7_x5c0A/o.jpg"
      }
    ],
    "user_id": "WFY2F6xJH_tPLpY0CUsUmA"
  },
  "FtyKcLGK7MFdr-DGfKrRYQ": {
    "date": "6/22/2015",
    "text": "Service can be slow - we went for lunch on a weekday, and there were only 2 servers working the whole floor - I never got the chopsticks I wanted for my meal, because no one came by to check on us once the food came out. That said, the food is very authentic, and the ambiance (especially at night) can be great. This last time was actually a disappointment, though, because the flavor profile of my papaya salad was off - too much umami & spice, not enough of the rest. It might have also been because I was thrown off by the color - I'm used to a papaya salad being served with julienne carrots and tomato wedges, but it was all green...with peanuts. I already knew there would be no shrimp/prawns on it, but it was still visually unappealing. Even a side of red cabbage i/o regular cabbage would've been a nice touch.  In any case, the food is (almost) always on point, and I'll be returning for another visit...perhaps on a more relaxed schedule.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LbvtJc7hXl3OeranZZ_w2Q"
  },
  "GQ16h-0WedTHQbdKNvhaww": {
    "date": "5/22/2013",
    "text": "What a great place.  I went with some business associates last night and enjoyed everything from cradle to grave.    Made reservations for 7:00 and really didn't need them since the place wasn't very busy.  I was warmly greeted and sat at a nice table towards the back so we can talk.  The place is nicely decorated, very modern and trendy.  The waitress showed right up to take drink orders and suggest menu items that were her favorite.  Thai food is funny like that, no matter how many times I see a menu all of the Thai names still confuse me.  I chose the Drunken Beef which was nice tender, skirt steak cut in squares with apple eggplant, lemongrass green beans with chili and basil.  This dish was so flavorful I couldn't believe it. I absolutely love lemongrass and Soi 4 did an awesome job creating this masterpiece.    One member of my party was very particular about what she wanted and how it was to be prepared and Soi 4 pulled it off to a tee.  Very accommodating.    We finished up with dessert and I had the fried mangos with vanilla ice cream and mixed fresh berries.  This dessert is by far one of the best I've had in awhile.  It took a bit to come out but I assume that the wait was due to them preparing them fresh.  Sweet, succulent mangos gently fried and the berries complimented the ice cream perfectly.  Unfortunately I don't like in Scottsdale but will return to Soi 4 during my next trip.  Check them out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-rlIN1BFK65MyHWt_HhPJg"
  },
  "58ZLbz2t5rcd1ETa3HJIrA": {
    "date": "8/6/2015",
    "text": "First time at this little Scottsdale bistro. Good atmosphere.. Great service. Very clean. We ordered the dumplings as an appetizer, and for a Thai restaurant, they were totally bland. That is the last negative thing I have to say!  Our lunch meals were amazing!!! First was the mango prawn dish. Wow... Prawns still has a crunch bit were tender & tasty.  Then the cubed Angus steak dish. Tender, cooked to a perfect medium, surrounded by veggies and onions.. If I can say one thing - the lunch portion size was a bit small, unless you get an appetizer or two.  Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "letr5QRfeVRh0AhDiCJ5jw"
  },
  "ws1BApKqwVnsU416SPhDmA": {
    "date": "12/30/2014",
    "text": "Soi 4 hit the spot on Christmas Eve. We were visiting from CA and looking for a Thai place to help with the cold-cough going on. Service was friendly and attentive but not overbearing (that's a pet peeve!). The food was trying a bit too hard to be hip Thai () and ended being just ok in the process... it's not cheap by any means.    We got: Miang kam - a bit too sweet but very fresh and really delicious! They serve them with mustard leaves probably because betel leaves aren't easily available in the West. Chicken soup hot pot - ok flavour, not much going on. I've had way better. But good value. Noodles with shrimp and chicken - quite good, not extraordinary. Veg red curry - disappointing in flavour and the vegetables were raw!  We'd probably not go back to this place because although it wasn't bad, it just wasn't great.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_nEoolMSiaTUwwzrfdpwzA"
  },
  "DUWEFaTPPJ38Ws4jnd3Ggw": {
    "date": "8/6/2016",
    "text": "Amazing food AND service but...my God!! It was so hot in the restaurant!!! TURN ON THE AIR!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dXL_fvlvwjEvlR29mPaPJg"
  },
  "G-RRkJqtYMS5GPd3jJ5d2g": {
    "date": "10/9/2016",
    "text": "Service is always great, staff is knowledgeable, considerate, prompt.  Food is very high quality, fresh, consistent and tasty.   Highly recommend the thai iced coffee, Plamuk Tod and Kang Gari Gai.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FB8duzpiG5WvOgnoOKVvOA"
  },
  "VEXolJu1OpS49Rf-AyHf2w": {
    "date": "8/25/2017",
    "text": "This wasn't what I had in mind when I was craving Thai food, but I was pleasantly surprised. The food is a bit higher priced but very worth it. We loved the flavors and creative food. I would definitely go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vG3SGyE9ZIqIXnkK_-I4MA"
  },
  "UrQItZZ3DyruoiUvJJOd9Q": {
    "date": "4/29/2016",
    "text": "The restaurant is nice, the service is really good, and the food is pretty good.  My favorite so far (from a past visit) was the Kang Makeur (eggplant stuffed with chicken in cabbage served with a green curry sauce). Today I ordered delivery and am disappointed with a few things. I ordered the Roti Bread ($3.50) and received a small warmed flour tortilla cut into 4 pieces. The taste was decent, but honestly, it should have been 35 cents. Don't bother. The Gai Pik-Khing (crispy chicken w/ green beans) has a fairly decent flavor, but the chicken is far from crispy and I think I may actually need to cook it a bit longer. It seems underdone. The  Pad Ke Mao (wide rice noodles and skirt steak pieces) is pretty good. The steak could stand to be a smidge more tender, but the noodles are perfect and so are the spices. All in all, the food is fine, but not really worth the prices they charge. We dropped $40 for lunch on 2 entrees (one with jasmine rice) and a tortilla. Maybe they should consider rolling out a lunch menu for delivery.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "mzHRaYLoV-lwX79HghP6lw"
  },
  "dglE8iANgDHpDNds-pL78Q": {
    "date": "9/8/2014",
    "text": "Happy hour here last until 6:30p, score. And they have a good variety of cocktails.  Food is solid. Not as many rice options as I would like. They concentrate more on curries, soups and noodle dishes.   There is an open dining area, so it can be a bit noisy, but not too bad. The atmosphere is sort of like a nightclub lounge, so not a big kid and family spot. But if your kiddos are older or reasonably behaved it shouldn't be a problem to bring them. There isn't booth seating, but they do  have booster seats available.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CbHXrH-CHM8egdKYAxqaPQ"
  },
  "i3PXcyjm5X7hflPVdTYHUw": {
    "date": "8/30/2015",
    "text": "I'm on a market visit in Arizona,  and stopped by Soi 4 for dinner. Intended to or a light dinner, but ended up ordering 4 things. The ambiance is wonderful and lively. I had the fried calamari, dumplings, yum talay (seafood salad) and eggplant salad. I have to say they were all so good.  The calamari are Thai style, not crunchy but more like crisp sauteed with onions n carrots. The salads were spot on with the right touch of lime dressing and light. The dumplings came with their seasoned home-made soy sauce that was delicious.  Please get the cilantro martini and kaffir martini, they are devine! Would come back again n again if back in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1IrqlOfRQXrJizMwuUY7CA"
  },
  "u6SFq37ao30lddaCo7c8Aw": {
    "date": "2/5/2016",
    "text": "I was passing through the area and needed a break from starvation and congested traffic. I wanted Thai food and stopped by. The service was friendly and polite, and I ordered the $7 curry lunch special which was quite tasty. Presentation is more in tuned with what I'm use to and I find the ambience very much to my liking, and not at all reflective of the rampant redneck, white supremacy worshipping atmosphere of AZ, esp. Scottsdale. I'm from a much more culturally diverse and urban city (Los Angeles) so I found this restaurant as pleasing; a haven against the suburban wasteland of stay at home stepford housewives and their stupid, spoiled kids.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "53yYO0deON-cl9-MqwYdMg",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Red curry with crispy tofu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/53yYO0deON-cl9-MqwYdMg/o.jpg"
      }
    ],
    "user_id": "SpORIkmTMNDxixFOcIE8cA"
  },
  "Ja88gO5mwUcWtbQjnc5nNQ": {
    "date": "10/1/2017",
    "text": "Love this place! Locally owned. Kin and Danny are the best hosts. Consistent quality food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ye4lacOQC6jjOcHLzuKsxw"
  },
  "-wZajzYbWEUBYGj7DW-zXQ": {
    "date": "5/9/2014",
    "text": "Soi 4 deserves four stars which to me means that I will be back - but I don't think I will come back here.  Go figure.  I guess Thai food is not my favorite.  That must be it, because the ambiance, service, and food quality and quantity are pretty darn good here.  The room is new, clean, and modern; the tables are properly spaced; and the noise level is quite acceptable.  I find the chairs uncomfortable after an hour or so and got up with stiff knees but perhaps I'm just getting older (no perhaps about that).  The service was friendly, prompt, and not obtrusive.  Our server, however, did not know the menu well.  The food is the way I image traditional Thai cooking would come out if prepared by a well-trained but non-Thai chef.  The duck in red curry for example was tender and tasty, but the scant curry sauce and four or five mini bites of lychee and pineapple added little.  A crispy chicken dish was better.  The only knock is prices, which are kind of weird.  Beer, wine ($10 for an indifferent glass), cocktails, and appetizers are expensive.  Entrees are reasonable, sometimes even surprisingly low-priced.  At happy hour the drinks are reduced, and a small selection of appetisers is $5, which alleviates this problem.  Happy hour is 5 - 6:30 (not sure about weekends), and you must order by 6:30 to get the lower price.  So if you are here for happy hour, or if you don't drink and don't want starters, Soi 4 is quite reasonably priced, but otherwise your check can mount up to the point where the value proposition just isn't there.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "moj7DUHkP4j9yfwFm-oOHQ"
  },
  "rKDafy221VbwkXc3QRnC3A": {
    "date": "2/20/2016",
    "text": "Nestled away in the Shops at Gainey Village in North Scottsdale you will find this amazing Thai restaurant.  Walking in it feels more like a trendy eatery than a traditional Thai restaurant with its dim lighting from large overhead lantern-shaped lighting fixtures and light modern music playing in the background. The dining area is filled with modern tables made of wood and metal with additional seating in a loft on the second floor, which appears to be for large group meals. Glancing over you can see a flat screen television playing a college football game situated behind the full bar. The most interesting part of the environment is the attire of the customers as there does not appear to be a specific dress code required to dine here. There are people arriving fresh from work in collared shirts with ties, but also women in leggings and over-sized sweaters.  Happy hour runs from 5pm to 6:30 and they offer discounted cocktails, beers and house wine, as well as a variety of starters for $5.  The menu itself is fairly large with choices in rice & noodles, meat, poultry, seafood, and vegetables. All of those entree categories has a variety of options to choose from. We ordered a variety of items in order to have the best experience possible. We started with fried calamari with a sweet Sriracha chili vinaigrette, served with some stir-fried vegetables on top. We both enjoyed the flavors of combining everything together in a bite. It was just spicy enough that it gave it a kick, but did not take away from the other flavors. For our main course we ordered a few different dishes to share. Crab fried rice (kao pad pu), slow braised beef short ribs in kaffir lime leaves and 'panang' curry (panang neur), and spicy wide rice noodles w/skirt steak stir-fried with basil, garlic, and chili (pad ke-mao). The flavors of all these dishes was authentic and we absolutely enjoyed every item that ate. The serving sizes are just enough, but because they are so flavorful it leaves you wanting more.   The food at Soi 4 was consistent with traditional Thai flavors such as coconut, garlic, lime, and chili sauce. Many of the items were served in different types of curry sauce. The cooking styles of many of the items was stir-fried, wok-fried and pan-seared.   We had a great experience at Soi 4 and will be returning again. The service is welcoming and the vibe in the restaurant is relaxing. There are so many items on the menu that I wanted to try, so I look forward to going back and sharing some other new dishes. I highly recommend people come here to try the food. There are some many options available that anyone can eat here. Plus, the flavors are delicious and dishes are sharable, so bring a friend or two when you go.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9YKFKbLmjyrmbD-_aJP1xw",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9YKFKbLmjyrmbD-_aJP1xw/o.jpg"
      },
      {
        "img_id": "hKw0qWouEK3h6MFgukxp_g",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Calamari",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hKw0qWouEK3h6MFgukxp_g/o.jpg"
      }
    ],
    "user_id": "3gaJS5drxZIbTcscHeDPVA"
  },
  "bARGWoYSHPj0yCeMTvA9yA": {
    "date": "8/28/2014",
    "text": "Like most places in Arizona, this place was dead by 8:30 at night. That being said, the staff was very attentive to my late dinner needs.   My waitress was helpful in deciding what to eat, the Miang Kum was intriguing & being that it was her second choice, I opted in. I love wrapping my food in mustard or lettuce leaves, and the ingredients all paired well together I couldn't even tell I was eating shrimp. As for my entree, I chose the Salmon since it's more flavorful, it was well done & presented nicely.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZHqwFU0t1XGk7hZGjA-46Q"
  },
  "Cc60MbaDhe2rRzjggH4QZw": {
    "date": "12/14/2013",
    "text": "Unique, interesting and different Thai but I do note very small portions.  We started with stuffed mustard leaves called Miang Kum. I don't know what all was in them but they were a roller coaster of sweet spicy sour crunchy and coconut. They don't taste like those Girl Scout Samoa Cookies but had that same additive quality and that same coconut snap to them.  I tried the Stuffed Eggplant with Chicken in Green Curry Sauce called Kang Makeur Sai. I do have to say the Green Curry sauce was nearly perfect and was the best Green Curry sauce I've tried in years because it wasn't too sweet and also didn't have too much coconut milk. I liked the taste of the dish but for me it was too soft of a dish in texture for me. It was sort of like an Asian Pancake with a small amount of chicken wrapped with soft eggplant in a really delicious well made sauce.   My husband tried the Spicy Stir Fried Pork Shoulder with asparagus called Kua Kling Mu. He liked the taste of it but was disappointed with the portion and said out loud, \"I will need to stop for a hamburger because there is only two ounces of meat on this plate\".  I would like to return and try other interesting things here but I know my husband will never suggest this place so I don't know if I will ever return.  I noticed that they offer $7.00 lunch specials and a three course dinner special (I think $36.00)",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "cB3BPhDIYEAoVe-ccSNHyA",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Kang Makeur Yad Sai",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cB3BPhDIYEAoVe-ccSNHyA/o.jpg"
      },
      {
        "img_id": "6bKNueoMYAAUPtJk2qPK2w",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Kua Kling Mu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6bKNueoMYAAUPtJk2qPK2w/o.jpg"
      },
      {
        "img_id": "PaFEEkmBC6_mPyDw8U6xoQ",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Miang Kum",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PaFEEkmBC6_mPyDw8U6xoQ/o.jpg"
      }
    ],
    "user_id": "V-BbqKqO8anwplGRx9Q5aQ"
  },
  "hlJZVffgd3j_LHJ3ZYj9wg": {
    "date": "2/22/2016",
    "text": "Soi 4 is a highly polished Americanized Thai restaurant that sports nice ambiance and offers up some very nice presentations but is not very authentic and by no means out of the ordinary. They have an original location on the Rockridge district of Oakland where inside to live and that place was somewhat better actually.   I lived in Bangkok for a long time. Soi 4 has some of the polish of the newer more upscale Thai restaurants in Bangkok but offers little of the authenticity. Tom Yum very weak. And they cook without fresh Thai chili peppers? Really? Dissapointed. To be clear, not bad food, just not the real deal I was hoping for.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LqGGfAFVXjjNcIU8KPXxIA"
  },
  "_ID-rFQZ_Nz_hm5iPNeDEQ": {
    "date": "10/12/2015",
    "text": "This is my favorite thai food in Arizona. I have been here a dozen times, each time trying something new. I have not been let down yet. Of course, some Dishes stand out more than others. My favorites are:  1. Pad Thai 2. Yellow Curry 3. Eggplant Wrapped Chicken 4. Lemongrass Soup 5. Coconut Rice  You can't go wrong with any of the things listed above they are amazing. I recommend getting the coconut rice no matter what, it's awesome!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DQ5Szn4T14ddEd6F5jHHpg"
  },
  "Kxqv5NJQlaRc_E0MCslfUQ": {
    "date": "3/19/2017",
    "text": "We had a party of 4 adults, and ordered a variety of food, and all of it delicious! We picked up food, and while we waited we sat at the bar and had a drink, and had the best service. This place is a common pick-up place because lots of locals were coming in. We will definitely go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rL1yrjEUslkzzJXWzja2KQ"
  },
  "ZTAqxgCHK-BK3RCgeFgg1Q": {
    "date": "10/7/2015",
    "text": "Because this place is so close to my home and my office, and is reasonably priced, I'll give it another try in the future. But for my first visit, I wasn't bowled over. The decor and atmosphere of this place is great. No complaints there. Our server was friendly and attentive, so no complaints there either. But I ordered the Pad Thai for lunch and while it tasted good, I was seriously disappointed to receive a HUGE serving of rice noodles but only THREE medium sized shrimp in the entire dish! Honestly, a serving of noodles that size should have had double that amount of shrimp.   Hopefully they'll do better on my next visit or there won't be a third!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "uJucNa2iF6Qdp3woEte73g"
  },
  "h-DadlhEgkSCLxiJyUvDyg": {
    "date": "3/18/2017",
    "text": "Kind of a small plate Japanese-Thai experience with a very metro attitude. Adding to the local rotation",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OlNMGfTQZ6VP_jP4jHA0TQ"
  },
  "Z4u4rbm0T4LTeiGRI3w5sw": {
    "date": "4/13/2017",
    "text": "Outstanding Thai food and fast courteous service in a clean cool unpretentious atmosphere. If you like duck, their Gang Ped is the Best!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8zvoABdUO8RXM-CUvpp7iw"
  },
  "ehag60MwNOHEBitjb4-TXw": {
    "date": "3/12/2017",
    "text": "So I had the 'Fish Trap,' which is shellfish in a spicy and very tasty sauce.  Not always on the menu (ask) is the crab fried rice.  My companion had extra crab (for extra fee), no tomatoes and asked for it to be spicy.  Excellent.  Pair it wth 'ajad,' the delicious cucumber salad.  Echoing other reviews the soup with the oyster mushrooms was excellent.  We did take out, so cannot comment on the ambience, etc. But Eric was great and I would happily dine there any time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PMCuIuGGiGMuxd3SWrGxIA"
  },
  "qDBC7W6yv3xL4GmZMCixEA": {
    "date": "11/20/2015",
    "text": "My favorite Thai food that I've eaten in the area so far. Some competitors around botch simple dishes. I get the bento for lunch but I'm always too full to finish the entire thing. You get an appetizer, salad or soup, and a choice of three meals.  Tom yum soup is great. Sweet, sour and hot.  Also I love the flavor of the green curry catfish.   My favorite thing about this restaurant is when you ask for hot sauces you get many options: you get paste, chili powder, pickled jalapenos and Thai Chili's in fish sauce. All very good.   Happy hour is all week. I need to come back for dinner service sometime!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "c7OeRa9HgUyiygUvjimb3A",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Hot sauces",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/c7OeRa9HgUyiygUvjimb3A/o.jpg"
      },
      {
        "img_id": "yfEbT4rLI5fvGQSAeqdGaQ",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Bento box- Tum yum soup",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yfEbT4rLI5fvGQSAeqdGaQ/o.jpg"
      },
      {
        "img_id": "NoKCjqfQt-NkmEWsU5Ngrg",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Rice and spring roll with bento",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NoKCjqfQt-NkmEWsU5Ngrg/o.jpg"
      }
    ],
    "user_id": "uGcMQYyBa9XzywVa1qZ6bg"
  },
  "EahF90Y9JSR-hGka3aQmqw": {
    "date": "12/13/2015",
    "text": "I took a friend to Soi 4 yesterday and had another nice meal.  Every time I visit Soi 4 I enjoy their food-it's flavorful and the interior of the restaurant is really pleasant.  The only thing negative I can say about this place is the service is often slow.  Yesterday we had to wait quite a while before our server approached us to take a drink order, and no one else was in the dining room yet because it was very early.  Bottom line: delicious Thai food, great cocktails, somewhat inattentive service",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rTLiGlOtHfE3uqbVW8RzdQ"
  },
  "SbutUSDWUinfnicHR-ImFQ": {
    "date": "3/26/2017",
    "text": "The food at this restaurant was Thai authentic. We sampled Pad see ewe, yellow curry, panang, and several appetizers. For a Sun evening and 11 people (with reservation) I felt the service was very slow. We also felt left alone and ignored. That is the only reason why a 5th star was not offered",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ECu99m4MISs0owK8aPYABw"
  },
  "HKL2QLS0sO26iLq_F6ElUg": {
    "date": "11/3/2016",
    "text": "THAI Food is my favorite, but oh boy am I picky. When I order green curry, I want to see three times the amount of veggies than meat. The green curry here is unreal. Charred veggies include: red bell peppers, green bell peppers, asparagus, green Beans, eggplant, and more. I loved the atmosphere, the food, and the overall feel of this place! If you are looking for incredible Thai food at an affordable price, you have to try it! I'm still impressed..and now I want another dinner. Cannot wait to go back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gFqSXjxKTN85iwELuLX1fg"
  },
  "txVBUX3cN8WJUDjtB4alwQ": {
    "date": "8/16/2013",
    "text": "What !! Vegetarian section ! Boom 5 stars !! Ok that aside I love the ambiance, the music was lounge-y yet had an upbeat tempo, not loud enough to drown out your company but loud enough to drown out the noise from two tables down. The food is spicy enough for my crazy palate and that makes me happy !  Extensive drink options and a knowledgeable bartender is always a plus, even had some local brews.. The service was good , could be better but definitely not shabby. In all it sure is a Win win win !!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "BzkeSPxMseaR67A8QLxJCA",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Happy hour menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BzkeSPxMseaR67A8QLxJCA/o.jpg"
      },
      {
        "img_id": "akTZASHXdab63BNzfbP1MA",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Gai Satay",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/akTZASHXdab63BNzfbP1MA/o.jpg"
      },
      {
        "img_id": "Ijb9RPlZyGcMRVj9IiDZbA",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Fresh cut mustard leaf wrap (miang kum)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ijb9RPlZyGcMRVj9IiDZbA/o.jpg"
      }
    ],
    "user_id": "gynMtvoyHZrSDsHMecwd8Q"
  },
  "QFSH7wbuSFlauGJ7TqeqQw": {
    "date": "3/19/2017",
    "text": "Been here half a dozen times for lunch or dinner.  Just getting around to completing a review.  Love the atmosphere,  the staff is always friendly, and I've never had a bad dish. favorite is chicken in  yellow curry.  Don't leave without dessert,  fried bananas, or warm berries.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cN3Shb2jDR23bHuDABMCBQ"
  },
  "qxUVrGIQKEHM5YIw9Lzowg": {
    "date": "9/18/2015",
    "text": "Had pineapple fried rice and Iced Thai coffee!! So tasty, friendly staff, and cool/relaxed atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NG-qi2uZLFh1haFij1rQMw",
        "caption": "Photo of Soi 4 Bangkok Eatery - Scottsdale, AZ, United States. Pineapple Fried Rice and Iced Thai Coffee!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NG-qi2uZLFh1haFij1rQMw/o.jpg"
      }
    ],
    "user_id": "UezPJqGngJt_JZDXXr618Q"
  }
}