{
  "9ITy-fCkGHLu3bwgTAQHUg": {
    "date": "10/22/2015",
    "text": "Don't let the exterior of this place fool you, food was very good. Prices were excellent and food took less than 10 minutes to come out. Would come back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eSegkH7DFoa0PRxRJGTYxg"
  },
  "_wu93TVnNd5AU3tCdEBJ4g": {
    "date": "9/24/2016",
    "text": "Looks like your typical fast food place on the outside but the food is a step up from all the other berto type fast food joints.  Lots of choices and free chips and salsa.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kgmvv8Y7WJLNOvbIiKHCoA"
  },
  "v7ZAnHDcWGjRG34wwutjEg": {
    "date": "4/9/2012",
    "text": "I think this is one of the most authentic Mexican taco shops around......I've never had anything I don't like. Plus, they keep things very clean inside.   The burritos are HUGE, even the tacos are pretty big. The tortillas are *perfect* and the refried beans are sooooooooooo good!! (the fish tacos too!)  I love that they have free chips and a salsa bar with cucumbers and radishes (a typical taco shop thing) They offer different specials, just be sure to read the hand written pappers taped above the cash register.   This place isn't anything fancy, but the food really is good....and it's cheap! (fair warning: don't come here on a diet, haha)",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "iAd8XaHxv05iXyEiZ62Ibw"
  },
  "ORkFyvv_3pNKsUtelayy6A": {
    "date": "10/18/2014",
    "text": "Definitely a solid choice for a quick mexi meal. Great variety of salsa, all were delicious. Our breakfast burritos delicioso!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "70JaJL6CHS0O6Ot8M_qLqg"
  },
  "-v4WRat-ZF2PoLqeMq0Z7A": {
    "date": "3/15/2015",
    "text": "This place is a dive but very good...good meal under 6-7 bucks... slow service but worth the wait...great place to stop when your camping out at a local hotel.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fpYlu6bzUNJ06PJwWUmRmQ"
  },
  "8Vb5IXdM69-a8ejog-SSeg": {
    "date": "7/24/2016",
    "text": "Best Mexican food restaurant in State! Ever since my first time trying food here, I never and never will go to any other Mexican food restaurant. Food is AMAZING!!! I've been coming here for YEARS. Staff is great and helpful also. I rather wait 30 minutes for my food here than go somewhere else.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S7yjm-tCd-1RFPpXW8XedQ"
  },
  "rTa-vVKjajxnu5zA5UHIRg": {
    "date": "12/8/2014",
    "text": "Awesome and inexpensive. Tacos are huge and come with guac...abodaba and carne asada are perfect. Chips and a variety of salsas while you wait!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZA2aRrXV5Xm5F94TEkd0Xg"
  },
  "zHeKGCyNwTolqgjNAJQlsA": {
    "date": "1/19/2014",
    "text": "Rolled tacos were miserable, undercooked and soft in the middle. The avocado and cheese overwhelmed the poor things and they were not able to withstand the pressure - collapsing under their own weight. The horchata was even worse as this version tasted flowery and they decided not to add ice to the drink either. Every salsa in the place was burning butthole variety, so gringo's aren't welcome. The crowd was clearly skewed towards the spanish speaking hombres. Also, get a drive through installed, so I don't have to go inside and deal with all the drunken patrons. Oh, don't bother now, I won't be back anytime soon.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ELcQDlf69kb-ihJfxZyL0A"
  },
  "tvRZiTKr8uF3Csp7Yzi6dg": {
    "date": "6/3/2016",
    "text": "Green chile burrito is a real winner!  Place was packed with people from the local Mexican community who were patiently sitting out a long wait for orders. The wait was worth it in the end.  If I lived in the Tempe area I'd come here often!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KAOZ82V8duoUk7aDjPSVUQ"
  },
  "FnhytlgOkvm7N9rxg95wog": {
    "date": "8/26/2014",
    "text": "The problem I encountered at midnight on this idle Monday night was the hunger for some Mexican food. In Colorado I have had Albertaco's, and I have had Filiberto's here in AZ, and unfortunately Poliberto's seems to be riding their coattails. The rolled tacos tasted burnt, or like the fryer oil was bad. The mixed burrito was hot, but lifeless, no flavor. They need to add salt or something. All in All, not terrible, but not for me. The salsa bar was cool, but I really wanted there to be a drive-thru. I would say, drive a little further, and get Filiberto's.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k9IJk6EiCxa7zdneGBMzMQ"
  },
  "lMSQqPDZ083brx1OT4hIpw": {
    "date": "4/15/2016",
    "text": "Just found a traditional Mexican restaurant fast food style. The prices are very reasonable and they gave free chips and salsa! Parking can be difficult but it's worth the wait!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E0H-jcN-vB4orY9IX0EjIg"
  },
  "4YnHzWyJ48hHvl0bJoJ9bg": {
    "date": "4/21/2015",
    "text": "They have the best street tacos in the whole city of Tempe and the most friendliest service. This is my Sunday and Tuesday spot and they will always have my business!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zmMV4NBJlw1abwygPMIgNA"
  },
  "lwbckZ_Y3koHUh9y7j7DXA": {
    "date": "5/10/2014",
    "text": "They must have run out of every spice except for salt and just added extra to compensate. I love salt but even this was too much. Also, diarrhea. I've since stopped eating here. Given the choice, I prefer the runs to be caused by Filiberto's rather than Poliberto's.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n6V0J2jv7iJiBoy3efgWaQ"
  },
  "OprdphLtsKMPnKwZ9hJrrg": {
    "date": "7/19/2014",
    "text": "I love the unlimited serve yourself chips. The portions are MASSIVE and the price is perfect. The food quality is good too, one of my new favorite Mexican restaurants here in Arizona for sure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QOpFT-OMTEP_yvFXxxkX3Q"
  },
  "AO5Vxx64fDh6N52CS6pPyw": {
    "date": "12/17/2014",
    "text": "OMG. Me and my hubby are about to move to Arizona and we followed the Reviews show on yelps. We did not got dissapointed. This place is so amazing and we loved it. Cheap, lots of food and great service. Very clean too. We already found one of our favorite places to eat once we move here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1OgTLjGsVgcfkyUQYjTJHg"
  },
  "VB71SKQnlavDVkif8NBHcA": {
    "date": "2/21/2013",
    "text": "YESSSSSssss! I love this place, I am able to call in orders with OLGA! salsa bar is my fave.... counter help is very helpful even if she is working alone.  Rolled Tacos supreme is a must have! they have diff items to make everyone happy.  g2g.... time to pick up my lunch!!!!   ~Rebecca G.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pd5HPDu88iE6ZFwLwhm1_w"
  },
  "11eR5AqpygvaIeELKCgnAg": {
    "date": "11/15/2014",
    "text": "No Complaints.  Carne Asada was nicely seasoned, tortilla wrap was nice and warm with just the right amount of char on it.  I'm guessing they heated it up on the grill or some kind of press.  Fish tacos were tasty and massive.  Two very nice portions perfectly fried.  Salsa was good and not watered down.  Will be local stopping point when heading the the mall area around here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LKIWblikBUgIJZYnMOfrpA"
  },
  "FlZN7J6ehOYAS4sBWQ9Fbg": {
    "date": "2/3/2015",
    "text": "Food was good and inexpensive . I had be mini tacos in carne asada and carnitas both were excellent .",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wGCAPPfTH9ycGOZg9BaK3g"
  },
  "MmE63i5gMePes6tGB9w-NA": {
    "date": "3/31/2015",
    "text": "This place used to be awesome but now they can't even get one order right, though the menu has not changed the staff has and that makes a big difference when I think about going to Polibertos, one star because it has lost its way as  what was one of the best mexican food restaurants in Tempe.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z_og0Ht6IxftRafypWkflQ"
  },
  "j2-tFl6hKQxU6jGM0Ow_Ew": {
    "date": "9/11/2011",
    "text": "The pursuit of the guacamole burrito continues...  And now that I have moved to Tempe, I have an entirely new set of hispanic hot spots to try...especially since Poliberto's is right across the street from my new digs.  I am not seeing the shabby outside or inside that some of the reviews tout.  The building, the parking lot, the interior are all clean and well maintained.  The salsa bar is spic and span, the tables are clean and the trash is certainly not overflowing.  Even the restrooms are well maintained.  In the week I have been in Tempe, I have enjoyed Poliberto's twice.  Both times, it's with the same order:Guacamole, bacon, cheese, sour cream and onion in a tortilla...a guacamole burrito.  The price has varied both times I have ordered it...the first time $3.25, the second time $2.75.  The thickness (size) of the burrito also varied...the $3,25 version was smaller than the $2.75 version.   Maybe the day version (smaller and more expensive) is different because the temperature is higher?  We can all make adjustments because of the sun! hehehe",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6ywZ6BHXvdas8o-omBli8g"
  },
  "anaD5BHLFfIIoKuPt-nzJQ": {
    "date": "6/19/2016",
    "text": "I give it 4 stars only because of the service. The girls are not friendly. The wait time is long. I order my food and still have to wait atleast 15minutes or more. I love love their tacos. The meat is flavored good with a lot of meat. That's my only taco shop I go to.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2FUH-b1GPmEOvGvSaJq7jA",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Salsa bar",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2FUH-b1GPmEOvGvSaJq7jA/o.jpg"
      }
    ],
    "user_id": "KMUGmhDmsfGROgS3QzdMbg"
  },
  "TwbOrveovgx_wTPFvbe6uA": {
    "date": "4/29/2017",
    "text": "Their carnitas are my favorite item, the prices are great, they have a salsa bar with all you can eat chips. What's not to like about this place?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "D-kHnEoD81SA42_gqh45yQ"
  },
  "iJUB2Y4-PZWA_7_L5T79XA": {
    "date": "3/29/2016",
    "text": "I been here a few times and everytime I walk in I get transported to the south of the border with the smells and taste of the food. The food is amazing and the best I have had in this area. It takes awhile to order since there is only one order taker that I have seen on my visits, and just because it's popular.    I would recommend the ground beef tacos or the flautas, they are delicious. The only negative aspects of this restaurant are the booths and tables don't get wiped down fast enough for the clientele coming and going. Also, the free chips and salsa don't get refilled as often. So after dinner rush chips are gone or low and so is the salsa bar. If the staff was there to wipe down tables and fill up the salsa bar and chips this place would get a 5 stars vote from me easily.   Overall, great place for Mexican takeout.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "E9ZA_1n4Fqrv4dgbxIt7AA"
  },
  "RgSxphvLkyTw-66rMr5-uw": {
    "date": "9/29/2017",
    "text": "8am on Friday morning and they're closed with no posted hours on the door.... yelp shows them as open....the advertise that they're open for breakfast... obviously not... lame!     Edit: the food is really good.. the best of the 'bertos by far... changing score... just ticked at the mis -posted hours... damn good food... just wish they wouldn't twice fry their nacho chips ... too much grease",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d-6FAR9qg-6Awa5wbiLvvw"
  },
  "JqfyQh-qaVP388tTWlBEAA": {
    "date": "8/20/2017",
    "text": "Great food and really cheap for the portion sizes. My favorite place to get Mexican take out even though it's a 20 min drive...there's a lot of other little places which are closer to me. Doesn't matter what you order - it's all good! I love the enchiladas",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ATLBO_y_0UjpK_zscsejbg"
  },
  "QSTtYCVfWf4t_zMYEIpgQQ": {
    "date": "11/17/2014",
    "text": "It's not the prettiest looking taqueria, but it gets the job done. Came here with a group of 10 guys after a long morning of community service after an even longer night of drinking at the bars. I made a beeline for the free chips and salsa next to the typical cucumbers and other vegetables that let you know you're in a legit taco shop.  After inhaling my first bowl of complimentary chips, we ran up to the counter starving and ordered the huge burrito with rice and beans wrapped up inside of it. I can't remember what it was called, but I do remember thinking that it was a great deal. The food came out a little slow, but the chips and cucumbers were more than enough to keep us occupied as we settled in and watched the Cardinals game on the TV.   The burritos came out and life couldn't have been any better; they blew Filiberto's burritos out of the water and just made my day. Definitely a solid taqueria option here in Tempe, and they get an extra star for the free chips and salsa.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cesJam7tnkUIFj8aqZGROA"
  },
  "r0a1bmR-sYEIk-dRoKDJtQ": {
    "date": "7/28/2016",
    "text": "I love how there's a \"serve yourself\" chips a salsa table set up. The table has mulitple sauces and salsa with plates and to-go containers. That was a plus since I hate nagging ppl for more.  They also offer deserts.. the last two times I went I got cheesecake since they mentioned it was made locally. The first one was better than the second cheesecake  Picture menus are great  The food needs more spice to it but I guess thats what the variety of sauces are for at the table",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Mt4phpvxQLX18Z1TK84FQ"
  },
  "ORzhO-0aBpaaQYPaQ3GWog": {
    "date": "2/4/2016",
    "text": "I had a pretty large order of breakfast burritos that I wanted to order for my team. I tried to call in and order (5 times) and no one answered the phone. I stopped by and placed the order of 20+ breakfast burritos. The burritos were pretty good size and worth the money from that perspective, but it seemed like they were just full of egg and potato... very little meat. I know it's tough making an order like that, but take your time and treat it like it is an order for one. Did I say take your time? They definitely did that... it took about 40 min to cook the order. I don't know if that would have been a problem if I called in, but waiting in the restaurant while they cook the meal... blah One last thing that threw me off is the young lady that took my order didn't put salsa with the order, when I asked her she told me I had to go to the salsa bar and make my own. Twenty plus individual salsa containers? You want me to do that and I just spent $100? That's lame. She ended up getting me some salsa in three big containers that everyone would have to share from... I thought that was a cop out and pretty lazy. Food for thought (no pun intended) go above and beyond for your customers. It would have taken you and the cook 3 min max to fill up a variety of salsa containers.  I don't have a huge desire to go back... it won't happen in the near future. Go try it for yourself, you may have a different experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "C6h8OyGRm0atkXyC9I2Z4Q"
  },
  "-irT9NmqZ4oZj7-EXVmCfg": {
    "date": "6/1/2016",
    "text": "I had the Camarones/Shrimp Ranch. The dish came with refried beans, rice and a lot of medium size shrimp cooked in onions, red and green peppers. This dish was medium low spicy on the heat index. It had a great fresh taste.  We arrived at 12:30pm and was able to get some of the home made salsas.  I enjoyed this meal. Seating can be limited.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nWkBs9neiel8dqKzepj6ug",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Camarones/Shrimp Ranch, a great lunch! MrPink",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nWkBs9neiel8dqKzepj6ug/o.jpg"
      }
    ],
    "user_id": "hm1T_7QV_JKpLzhZ-xCFuQ"
  },
  "BWxXylGOMc9d_thji1wnwQ": {
    "date": "8/4/2014",
    "text": "My favorite Mexican spot to go to when I'm in Tempe Arizona :D Their Shrimp Quesadilla is no joke!! I'm sad i didn't take a photo of it :(",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sHOxQpXNYGF2YHkSeLKKEA"
  },
  "4Ts6Bqck-vkqtsvNWoxpyg": {
    "date": "7/18/2017",
    "text": "Best burrito spot in Phoenix.  It's my secret spot.  Food portions are huge and their burritos are delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2vAPkrhwQkHPUtSsiQYT7A"
  },
  "dUsuWxADrGXFpbGNGYMwCQ": {
    "date": "3/9/2018",
    "text": "Soooo good! Born and raised in Phoenix and this is one of the best in the valley. Do not compare it to filibertos because that would be an insult. I've tried almost everything on the menu and they have yet to disappoint.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FBywasvq7TmYV8ofP5E8Dw"
  },
  "WnovzlulNRtK9N-hQgjD2A": {
    "date": "7/1/2014",
    "text": "Was driving to Taco Bell, drove past this place and Taco Bell was closed.   We said hey, let's give it a try. OMG it was so good. I live in Tucson. This place is a True hole in the wall, but so good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ABaDXhzUa0UFFB9YSrbGhQ"
  },
  "PnE-g--C4bRv4WLILzK2Hg": {
    "date": "3/2/2017",
    "text": "Just go here, I'm visiting from bay area, ca and  Jesus great food at great great prices..  10 tacos outta 10 on my taco meter ... 3.50 torta and 5.49 SHRIMP AND CARNE ASADA BURRITO! ENOUGH SAID",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t3jKl-eHjujirW4MaHy7Mw"
  },
  "CBxysu5IMIJYEmNdfgLcdQ": {
    "date": "4/2/2017",
    "text": "Excellent food and amazing prices. Food portions are h u g e. You can share most of the combos with two ppl easily. 5 dollar chimis that taste amazing. The combo chimis can feed 3 ppl easily and it's only 7bucks! All salsa is good too. Only think I wish was the place was a little bit cleaner.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J3rmGtqYgPZzh9l5q3O3WA"
  },
  "a5g8bz8gk6658uW_-MmdHw": {
    "date": "3/9/2017",
    "text": "Top notch comida Mexicana! My buddy and I ate here and really enjoyed the fresh cooked in demand food again Fresh! Great hot chips as much as you can eat variety of salsas. The menu is very extensive, so many options we have to come back and try another combo before we leave town. Great place, very authentic.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rEOge0CkubhXHU566-S8bA"
  },
  "7GddKG55DIgv5LqH9cirWg": {
    "date": "10/15/2017",
    "text": "Closed earlier to leave. Couldn't get food. They raced to the door to close the spores as we were about to walk in. This is the worst type of employees to have.  I would fire them at my store if they closed down even a minute early.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q0GxbmPyu7dY3lHoDNT22A"
  },
  "8lu4VyGDqEXWWR3qj7fjdg": {
    "date": "6/1/2017",
    "text": "I always get the carne asada burrito here when I am nearby. You can't beat the price to food ratio. The chips and several variety of salsa are great while you wait for your order.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SohqoCC-r5o1K9Qnxcr7jQ"
  },
  "iewBBlegAUS_ZVHdfh2hwg": {
    "date": "10/23/2015",
    "text": "THE...........FREEKING...........BOMB  2nd visit here today. Carne Asada burrito with just guac and pico. It was about the size of a football and I ate EVERY.......LAST.........BITE. If you're near here and looking for food, breakfast, lunch or dinner.....go here. Girl friend doesn't know what she wants to eat? Go here.  Out of all the \"Berto's\" in AZ, this is by far the best one.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PdCR2ElSc0cVym5dCN3Zsw"
  },
  "R8adHRKg1yyr43DfVPszBA": {
    "date": "8/15/2016",
    "text": "Always awesome and great prices. You get enough food to make 2 meals out of 1 plate, and the average plate is around $7.50. Whenever we're in the area, we make it a point to stop here!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0bN5GZzkQl80cBjPAT6hsw"
  },
  "MEGeIhMKIBS4uEIl1ErvLA": {
    "date": "10/2/2017",
    "text": "Yes the chimi is big. But you can skip it. Takes forever to cook, as you start diving into it it's watery from all the onion and tomatoe inside. As far as flavor, I didn't taste any. The rice and beans were more enjoyable to eat.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "JHvHdq7whtBCCnGj8DSSrQ"
  },
  "YViKPO9OWSaOw3a2R7xvRQ": {
    "date": "12/7/2017",
    "text": "My new favorite place ever! I refuse to spend my money at any other Mexican food place! I'm sooo in love with the California burrito and all their salsas! I had it for the first time the other night and I am already craving it again!! I will be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dExhUQ93wuw7laonWxSDOg"
  },
  "Zi-ynVM5XyhZMh2b2DCrgQ": {
    "date": "11/26/2017",
    "text": "I used to love this place. It was great food. My only concern used to be that they would overdo it with the cleaning chemicals and the place would smell terribly. Unfortunately, I must black list Poliberto's. They received a D on their health inspection. There are so many great Mexican food places in the Valley, why risk getting sick? (I don't think anyone actually got sick, but the risk remains.) I'd have a hard time going back even if they are able to raise their health inspection score up to an A. Again, why risk it with so many other options out there?",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KhWYMiyz6_46SIZLMCogVg"
  },
  "zMUzo-g726OABEvU5FmnkA": {
    "date": "12/10/2017",
    "text": "Live nearby and it's our favorite stop when we crave carne asada fries, rolled tacos, menudo and enchiladas combo! Better than most fast food choices in this area, two thumbs up!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_gmrPyxBmRRPOvFmIFkg9Q"
  },
  "2r-HzxKRnGXi5mIs-Wx4oQ": {
    "date": "1/26/2018",
    "text": "One of the BEST MEXICAN places to go around the area. If you think chipotle is good, then this isn't the place for you. Food is always cook to order and is always delicious. To top it all off the pricing is very cheap and you can buy A LOT of food for under $20. Me and my wife call this old faithful. It may get a little messy due to them being extremely busy all the time but you'll forget all about it once you take your first bite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ER5ZVSNM7ft9NKtFr-sMzQ"
  },
  "-ac_YoJEHCitAjBzBRoD-w": {
    "date": "10/14/2016",
    "text": "Thanks again Yelpers. This place was awesome! We ate here during out 5 hr layover at Phoenix. The place is walking distance from Arizona Mills mall. I ordered the chimichanga platter and my wife got the carne asada platter. It came with rice, beans and drink for around $8 each. You also get unlimited fixing bar which includes 3 kinds of salsa, fresh chips, carrots jalapeno mix, lime wedges, fresh sliced turnips and cucumbers. Fixing bar was great bc it made you feel healthy while eating a giant fried chimichanga.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wtB65_YD2Kyp3NaSJz_6TA",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. My deep fried beef chimichanga and my mouth for size reference.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wtB65_YD2Kyp3NaSJz_6TA/o.jpg"
      }
    ],
    "user_id": "H31v8xm39YaXp0BeWgXGYQ"
  },
  "OXjlRv9E-vjgK5t-3aUneQ": {
    "date": "1/10/2018",
    "text": "This was the second time we ordered a chimicanga and again WRONG...will never order again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yqr4AP2f2ai7TCWI4USoeA"
  },
  "gszokub5ngJ3czW5J3efFA": {
    "date": "12/31/2016",
    "text": "Not fancy, but large amounts of very authentic Mexican food. Lots of locals eating here, that's how I knew it was going to be good. Not disappointed. Great prices, too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3zUjkwL4Igh444Dwy4eEIA",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Great selection of authentic Mexican food at great prices.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3zUjkwL4Igh444Dwy4eEIA/o.jpg"
      }
    ],
    "user_id": "IDNx4oIVJev20gkLKfudxQ"
  },
  "1nPerJx63wREnIoZcfmydw": {
    "date": "9/23/2017",
    "text": "One of my favorite hole in the wall taco shops!  I have had roiled tacos only but they were delicious and reasonably priced!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lW4-fwht1tzBJ1aDUr0o4Q"
  },
  "t1I3rA0vcjtcXFjVdSnEvg": {
    "date": "9/12/2016",
    "text": "This place was clean , it smelled good . Like good food good , and clean good . Even the beans were awesome . Recommend the carne Asada tacos and the lemonade !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "j_h1ziGhSKvXcHC5tIyaAA",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/j_h1ziGhSKvXcHC5tIyaAA/o.jpg"
      },
      {
        "img_id": "wAxmcCZZCblRe9QrmqmzTA",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Mexican Mexican",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wAxmcCZZCblRe9QrmqmzTA/o.jpg"
      }
    ],
    "user_id": "IkybYuVyB5x-z0_Gr7ujKQ"
  },
  "KAs8Ztq3gkJvG68I55Q3IA": {
    "date": "2/24/2015",
    "text": "This place is great! Food is cooked to order most of the time, condiment bar is good and fun and eventhough a single person works at the register or at the cooking area, food is SUPER! VERY accomodating order taker and patient, ALL of them! This Poliberto's for MEX food for me, thanks...  ( THIS, AN OLDER REVIEW BUT SEEMS THIS LOCATION STILL 100% GREAT)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "74EcFRiUWz_k-GQ4rVcTag"
  },
  "5gianRvxmi_4FbZWLfl9qA": {
    "date": "10/20/2017",
    "text": "The food at this place tastes very authentic. They also have really good salsa, free drinks with the combos, and free chips with purchase. The only bad thing is that the decor is very old and not super clean. Very good food and its usually always pretty busy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SZ2uOgsmxe0bGxws39Kepw"
  },
  "vbSIr7Q1W08K8RNuAid5lQ": {
    "date": "8/2/2016",
    "text": "Solid so far. It's great for a late night meal. The guacamole is standard here so go wild and order them all. The tacos are large and the chicken has a nice seer and flavor. The carne asada is good too and the salsas have nice flavor with a kick. It took awhile at the end of the night to get the food but I'll just say it's because they make it fresh. It seemed pretty fresh to me. I'll be back for more.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "82Micw6atbqgn8-r7oNRKg"
  },
  "-w_wZkdmH07MrKF-S63DPw": {
    "date": "6/2/2018",
    "text": "Very very bad customer service. People go in there to spend their money and should be treated well. These girls working here are very rude and act like they don't want you there.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rx65QHcAjyDd9Nh64bjSsg"
  },
  "N5EZ_apIKO4QxTr_hJvVww": {
    "date": "5/31/2016",
    "text": "Basis for my starred ratings (which skews heavily to the food or drink): 1 star:  Never again. 2 stars:  Poor food, poor experience, extraordinary measures in order for me to come back. 3 stars:  Average, nothing really special, nothing particularly bad. 4 stars:  Very good, would definitely return. 5 stars:  A favorite, one of the best.  It's called Poliberto's Taco Shop, so get the tacos.  They compare well to tacos around the Valley.  Street-style, simply done, well-seasoned without being too salty, good salsa, decent heat.  This place is legit.  A lot of places got rid of their cabeza tacos, not here, and they are great.  Stewed and soft but still with some chew.  Next time I go, I have to ask which parts of the head they use with the hope that they use all of it.  Eyeballs and all.  I've also had their carne asada, carnitas, and lengua.  The lengua is great, as is the carnitas.  I liked the carne asada the least of the three here, but their carne asada is better than Los Taquitos.  It's a solid carne asada, just not the best.  But, based on the quality of the their other tacos, coupled with the fact that they still serve cabeza, this taqueria still deserves its 4 stars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KBSFwLHntHwf0e28a94ckg"
  },
  "zIKiAaitvPxTV6efoZaOGg": {
    "date": "5/22/2018",
    "text": "As a Mexican, this is what I call authentic Mexican food!  It's absolutely delicious!  I had the 3 mini tacos made with carne asada and a side of rice and beans.  Paid $7.49 for all of that plus a drink.  Had the horchata!  Two thumbs up for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MIkl4mWZR0sRpMnYZXCS3Q"
  },
  "CmS8bxYrt-vdhj5pj3qCcw": {
    "date": "10/6/2016",
    "text": "Great homemade Mexican food! Tastes like home (Tucson, Az). The food is freshly made to order and the salsa is great. Enchiladas are pretty dang good too. We will be back! Can't wait to try the breakfast!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "A-GcqnluszLvO8FCAOttTA",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Barbacoa burro!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/A-GcqnluszLvO8FCAOttTA/o.jpg"
      }
    ],
    "user_id": "Ld59_S-w2gXtCsoX5Vuktw"
  },
  "qJXAYrt4y4HJ76uuRXU0rw": {
    "date": "9/26/2017",
    "text": "I got to know this small chain from another location so if is shocking to me to write this review. I love, love Polibertos. This location is terrible. Each time we have gone there (a total of three separate times) we have waited at least 30 minutes for our order. This last time I came by, the restaurant was filthy. If I had hadn't had the food before, I would have walked right out. We must have waited 45 minutes for two tacos and beans and couldn't find a place to sit because of how dirty it was. Never coming back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hinj6u-fh3usci0ptXu_ag"
  },
  "btDHI5v-lQens0BEGXou7Q": {
    "date": "7/9/2017",
    "text": "Free chip and salsa bar, what's not to like?! Came here on a Friday night at 9PM and there were a lot of people ordering food still. I took about 20 mins for a lengua and California burrito, which is kinda long, but they seemed to only have 2 people working there. Their prices are pretty affordable it was only $11 and  change for the 2 burritos and they were big and they didn't skimp on the meat. Will be back again when the Mexican food cravings hit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "il7OoZ9b8jPZqEp3H6aGrg"
  },
  "zxohNTP5__xaCdZVgBBRXA": {
    "date": "9/20/2017",
    "text": "I've been to 'the 'berto's all over the Southwest .. this is  One of THE BEST~!  The food is consistently Tasty.  Seems to be always Busy and you may think service is 'slow' but Hey.. they are Busy~! That's a good thing.. ~! Try it for yourself.. it's not fine dining.. it's not Hip or a millennial joint.. it's A Good Local Mexican Spot to grab some good Eats. Big Portions and the Carne Is really tender and moist.. It's worth the few minute wait you may have to endure for some really good Mexican food .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R2x0A7x7lUMqOlp8rk1Q6w"
  },
  "PVyrjCip7yTR1zoxCNa3Hg": {
    "date": "1/24/2014",
    "text": "The only negative I found was it took a little while to get the food.   Now on to the positives:  Great salsa bar. Good choices of salsa, pickled carrots and jalapenos, sliced cucumbers and free chips.   The food was delish. The rolled tacos were tasty with a huge amount of guacamole and cheese. I had the cabeza gigantico burrito, the meat had a great flavor and texture, I tried the pollo burrito as well, and I can say that it was some of the best tasting pollo I have had in a long time.   The prices are great too, burritos for under 5.  I will definitely be coming back the next time I come back to Phoenix.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cfx2CflJa3qbC5DIp5hHBw"
  },
  "LqfgdHUaKR-PKeEW5r-qQA": {
    "date": "5/31/2017",
    "text": "Great food at even better prices. Especially compared to all the competition around, their food is bomb. They don't have a drive thru but I've never had a problem getting out of the car. Also where most places only have red and green, they have 4 salsas to choose from. Which makes the experience even better. Plus Everytime I've been there, there has been the most beautiful and kind lady working the counter. And when someone greets you with a smile, it makes the food taste better. And I think that's been scientifically proven!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qw6ys5X-Ftb86PndasBFyg"
  },
  "fT8MuLb7KFOXT5ocTgsiBg": {
    "date": "2/16/2016",
    "text": "This is the closest place to my house that offers decent menudo. It's awesome and spicy and rich! They have a decent salsa bar, and chips which is a bonus. They're carne asada is delicious, but sometimes their portions are a little more sparser than others. All in all good Mexican food from someone that's picky about it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V4RfbIeXHlDs2xaFx5g29A"
  },
  "dSWrUjOBdN8C3_OE8XGC2w": {
    "date": "7/15/2017",
    "text": "Seriosuly good carne asada. Shredded beef and shrimp tacos were also very very <a href=\"/redir?url=http%3A%2F%2Fgood.my&s=4ded21117577234eac30db3e76c48cf47842dd9c0ea46438129d6db00ef0e841\" target=\"_blank\" rel=\"nofollow\">good.my</a> only issue is price... for 6 tacos and a side of beans, the bill was $22... I can spend 10 bucks at some other local taco spots and get just as good if not a bit better..",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PXv-RD8wxGCWT1ye9j5ebw"
  },
  "pnoO3pzpCoiKaqCOQGRAbw": {
    "date": "6/27/2016",
    "text": "Food here is so great always served hot when I order it and a good portion for your money. Can be packed around Friday evenings and Saturdays but it's worth it recommend it to anyone looking for some good food to cure the hangovers!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BNwoCur7YRCaMu-fAV9lFg"
  },
  "SfIb1UzgFGE1I9XK-Q7smw": {
    "date": "1/20/2016",
    "text": "Honestly I'm giving this restaurant 5 stars, because it has never disappointed me. My family and I come here every weekend to enjoy a delicious meal such as carne asada fries and we'll never cheat on this place. The staff is always friendly and they are always sure that you are both comfortable and satisfied with the service. It is obviously not Mexico street taco taste, but compared to filibertos and all these taco shops, I can definitely say that is if not the best, one of the best Mexican food places in the valley!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yfGgfB3BGXBvuCbIYqzZ3w"
  },
  "7edYlJ9cpWBERzd1jNrp3w": {
    "date": "2/19/2017",
    "text": "Pretty good food I thought as well as supported by its popularity--no available seating. But stars subtracted for the lack of cleanliness of the restaurant itself.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tobc8EFV_zbP8NY9pjZgog"
  },
  "F7EMmutJcPFtO4_EUPHGtQ": {
    "date": "3/18/2016",
    "text": "very popular place, not the fastest service but food is good, cheap and authentic Mexican. Free salsa/chips service yourself at the front - great salsa! Not in the nicest area of Phoenix but whose complaining? I'd say if you're in the mood for good, cheap Mexican food you can't go wrong here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GQSLx3N6KTBz42pQLY55Pg"
  },
  "T7OkA9apLOn7PXj5SsWbFw": {
    "date": "4/25/2017",
    "text": "This place is very dirty. The employees do a poor job of keeping the dining area clean. I ordered from the menu anyways and ended up getting food poisoning. I will never go back to this place. I think a health inspector should visit.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5PYJvxBjhCb1hjjnLZu0lw"
  },
  "VfaJ1JWGJKCS86WmepcgNw": {
    "date": "4/1/2015",
    "text": "fantastic food, oustanding prices, and one of the best salsa bars in town - realize that your eyes WILL be too big for your stomach, so be sure to tip when you get your to-go boxes!  The carne asada fries were legit, the chimichanga was out of this world and the shrimp quesadilla made me miss the beach it was so fresh.  This is by far my favorite 'berto in the valley!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "DlB7CLHWLHa_hYDrYVNDcA"
  },
  "q66SNvKuaWrG5mI5_IDr3A": {
    "date": "8/18/2015",
    "text": "I went to this restaurant to order a half order of super nachos. After I got through approximately half of them,  I found a black pubic hair with the root still attached. It indicated that it may have been placed in my food on purpose. Even if it wasn't, I'm so disgusted that I'll never eat there again. And I'm so disappointed because I really like their food. This happened on Tuesday, August 18, 2015. I don't know if a health inspector has visited, but after my bad experience, I have to question whether one should visit there. It's obvious that washing hands and wearing gloves aren't top priority. I just hope I don't get sick from this.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wSeZ6fHfESZ7AHBQdo_4Tg"
  },
  "Xs84K7jIexqdFY8xs9Z4hA": {
    "date": "6/1/2015",
    "text": "I love small taco shops like I'm used to in San Diego been here in Phoenix for 2 years and looking for the right taco shop. Well this is gotta be it. I don't see how they can make such good food for so small prices. Their chili rellenos are the best of any restaurant I've had here in Phoenix their shrimp cocktail is fantastic and the breakfast chorizo burrito is out of this world I live directly across from a taco shop on Southern but I come all the way over here now.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GhgluTHjgG0OOWxW1G1pdw"
  },
  "1bL94b9DURNuzpCbsOcgbQ": {
    "date": "8/31/2014",
    "text": "First time to eat there, experience was horrible. Casher had no flexibility at all, Cashier were  unable to change my order to cevichetwo minutes after placing it. Cashier added that she will provide a small sample to try. We received our order but the ceviche is still being worked on as the cashier indicated. I asked again after a good 20 minutes , she said \"they are still chopping it\". Ordered shrimp quesadilla, shrimp was very rubbery with half way cooked huge chunks of tomatoes, onions and green peppers just not pleasant to eat.  We left and the poor cook was still chopping the ceviche..",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ew_uDIf8zc3J4J_Lqh9v-g"
  },
  "wbDeBLGNkXzkiI941gjKmA": {
    "date": "11/26/2015",
    "text": "I love it. Great for vegans, great for raw foodists, great for raw vegans..   They make the salad just the way you want it....no meat, no cheese, not cooked. Fresh. Delicious. Fast. Friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GuqdiHisGgB42G8t6zU5MA"
  },
  "Yt4PAewPmus398OLXGVaeA": {
    "date": "12/22/2010",
    "text": "Totally agree with the rest of the reviewers about this being the usual greasy, meat-heavy Mexican restaurant with no frills, but soul-satisfying stomach-filling food. If you're on a diet or if you're the lettuce-eating, fat-free-everything types, you'd do best to steer clear of Poliberto's--everything is unabashedly huge and dripping in lard here. I wanted to get the three tacos combo, but since I'm a recent beef-eater, I couldn't stomach the description of tongue and beef head being included in the tacos. Though I figure it must be tasty :P  Anyway, I got the chicken taco and the carne asada taco and got plenty of lemon wedges and salsa. The tacos were huge. The asada was more delicious than the chicken. The chicken came topped with lettuce and shredded cheese and had a hard shell, which I was definitely not expecting, and didn't like. Other than that...Ok to eat at when you're hungry and want to save a buck.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "RfV4QE0tvcTWxaqwS5aLBg"
  },
  "Dfu-vEIYhrWRahRPsSvrXw": {
    "date": "11/10/2015",
    "text": "I went here due to the positive reviews on Yelp- I'm from out of town and walked here from my hotel. Great food! I waited about 10 minutes- which is great for made to order food! It's a bit of a hole in the wall, but don't let that stop you from going! Great prices too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KZVML54YLDctsU2zv3WuQw"
  },
  "9XIC3q6Rt2WVBvtMBq0BEw": {
    "date": "2/11/2016",
    "text": "Living in the apartment complex next to this place is the definition of convenience. Polibertos is a family Mexican shop that brings a little slice of Mexico to the States. Don't confuse them in relation to filibertos or any other Bertos. This shop does it right. Prices are great, takes a little time to get out to you, however the portion size is exceptional for the price. The taco bar is always stocked with free chips, salsa, limes, and lemons. The atmosphere is like a little slice of Mexico, very refreshing. Haven't been disappointed yet!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aGlRNzGikXa00JDkVFz33w"
  },
  "cn3_E62LbtFRvc9WEiEDnw": {
    "date": "9/11/2012",
    "text": "Appealing when you pull up,not so much.(THE BUILDING THAT IS) The food is awesome and plenty of fresh food for the price. Decent chips n salsa bar for free,when you order sumin. The salsa is very good. The atmosphere inside is o.k. but what do you expect this isn't the Ritz... Kinda an old school setting for a taco shop. There is plenty of items to order and you will certainly find sumin to your liking in this taco shop. The food is fresh and very good. If you have tryed it in the past and didn't like sumin, I suggest trying sumin else. The food is excellent and decent quantity for the price. I see sum people have given two stars,this is a four star or better in my book.              Maybe they had bad experience,who knows..I know, it's good food 4 shore! Price is right, location is good, food is excellent, large menu selection too choose from, unlike FiLLi B's... Way better menu selection to choose from then your typical FiLLi B's restaurant. Tell me, when is the last time you got a burger at FiLLi B's???? You can't! You can at Poliberto's taco shop,Mexican style burger of course. Good too!!             The funny thing is at: Poliberto's Taco Shop.. Next time you go in there watch all the free loaders, load up at the Salsa bar.. You would think they never ate or had Salsa&Chips for a long time. People always free loading on free chips,cucumbers,carrots and loading up, like there never gonna eat again. You pay for that kinda stuff at FiLLi B's...Comical to watch the leeches load up at the salsa bar..... I'm sure the free loaders are the ones that give two stars. The people I see loading up at the salsa bar n taking enough for 7 people is the other reason I like to go and people watch.... The nerve of sum people.... two stars and then loading up on free stuff. JaJaJaJaJaJa HaHaHa",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "FvUZuilVX2vmzErQzYmaKA"
  },
  "jkb9Ly0F_OcP_BMdK0Z3Ag": {
    "date": "9/21/2015",
    "text": "Pollo adobado is great. It may be a little dirty but it is great cheap Mexican and the food is always worth it. Plus they are open late",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Se2RMAUBdgWwQv3nswexvA"
  },
  "0QEQ656i7Qum2SCxwxojjw": {
    "date": "8/28/2013",
    "text": "I love poliburtos. Compared to filiburtos they are 100x better. Everything I've ever eaten There is amazing. I would recommend this place over any small Mexican food restaurant around. Yummmm",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dUQnj8AIR53iHU_quMyKGA"
  },
  "oIynY7dw-NzizjReQfGw6w": {
    "date": "7/24/2018",
    "text": "The food was good. I purchased the California burrito and it was delicious. It wasn't great but it was good enough to make me want to come back and try something different. I came with a buddy and he purchased the ranchero steak plate which looked good. Only reason I'm deducting two stars is because there are too many flies in the restaurant. We couldn't eat in peace without a swarm of flies harrasing us . And the men's restroom didn't have any soap to wash hands with. Yikes .",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KuVmrzsmYdue-sAQLTXLDg"
  },
  "gYSncl4Jqs6szGA-zsT4lg": {
    "date": "8/11/2018",
    "text": "The food is delicious and the servings are generous, just wished it had a drive through",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m5zYBpc3OMuCih3oZearvw"
  },
  "rZ-AUqiweOo5BNbRsDKZCQ": {
    "date": "7/7/2018",
    "text": "It was good, I ordered the chorizo tacos and they were good, but I also ordered horchata and that was the fake kind from a package, not so good... and I also ordered the",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "30wRyFfMr2A-ENybKUeITg"
  },
  "ldzDZh9CBxkXLGqGYxEtug": {
    "date": "12/26/2018",
    "text": "My husband and I have driven past this place a million times and have wanted to try it. So for our date afternoon we went here. We walked in and the place was disgusting filthy. There lil \"salad\"bar was covered in food there was trash and food all over the floor. It was nasty. Needless to say we didn't bother eating we turned and walked right back out the door.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tBe9oJbyRFsdhz5BjHIhyw"
  },
  "i_IHe3qw-dGxc3mFsTMi9g": {
    "date": "10/27/2016",
    "text": "Fantastic made to order food. Cheap and big plates. Salsa bar. Everything we ordered was really good and tasty.  It's filibertos but better.  -Only con was the parents who let their kids lay on the table top with his shoes and diaper at 10pm at night but it's not the restaurants fault that some of their customers should've been spaded and neutered before they could have kids.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4MeyfdyeJ38A_wOKLapRMQ"
  },
  "gg9nV4-r1Q2hH0OzbxW_wA": {
    "date": "3/18/2018",
    "text": "This place probably has good food, so I gave it 4 stars. I'm vegan and came here because some reviews said the beans were made with vegetable oil. This is not True. The beans are cooked with lard. Meat eaters, enjoy, but vegans should go elsewhere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "A6-e0tyCZ2YvyHV714RT1w"
  },
  "rvqISimYZpW-4oPlth0j6w": {
    "date": "1/25/2015",
    "text": "Polibertos is located on baseline just east of the 10. I don't know how I just recently found out about this place but it is incredibly affordable with a ton of extras. They have a full salsa bar with four different types of sauces and salsa as well as fresh cucumbers and peppers with carrots. Fresh chips keep people happy while their food is cooked. Order a combo and you get a free beverage. Hours are great... They open early and stay open very late!  Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "6R-0QEbJB3Lf5prNmLAyUQ",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6R-0QEbJB3Lf5prNmLAyUQ/o.jpg"
      }
    ],
    "user_id": "SsYDYuT792irBRoGpcOmrA"
  },
  "UeAD0Nq7IcOCSZ6ZaKEoNg": {
    "date": "6/24/2018",
    "text": "Just finished trying the cheese enchiladas, my husband had the chimichanga burrito enchilada style, and my daughter had the rolled tacos with beef and I must say, it was absolutely delicious! We also had the horchata which was equally amazing. Everything was right under 30 bucks and we even got 3 churros. We will be back. Looks like we found another place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DPfC5MHnx2rnBvXMe6CSYQ"
  },
  "6RnmwA4BG2cksGv-vRVW9Q": {
    "date": "1/23/2018",
    "text": "I've been to Polibertos once before as a dine-in customer and ordered a marinated grilled chicken burrito from the specials menu, it was a generous portion and well seasoned.  I worked up a craving for meat during a late night work out and made my way in maybe a little after 11:30. Despite there being only one person ahead of my order, I had to wait in the lobby for about 15 minutes. Not a problem, they probably had to take out a new piece of steak for my burrito supreme. I waited patiently and enjoyed their salsa bar and complimentary chips.  The take-out container seemed very heavy so I was optimistic that perhaps I got the late night hookup. I opened my container when I got home and was shocked. The burrito while generously filled was filled with 98% steak fat! Every piece of meat in the burrito was too fatty to eat. I heard some laughing in the kitchen during my prep time so perhaps they were playing a joke on me. That or they thought that because I put in a to-go order so late I wouldn't be back in to return it. They were wrong! I came back in with the receipt and the food to show them the disgusting mess they served me. The cashier quickly handed me $5.50 from the register and I went on my way.   After looking at the receipt my total with tax was $6.48. You can keep the 98cents I won't be back. I somewhat feel this was racially motivated as well but have no proof of that. I just had to get this review typed up before I go to bed. Hungry.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3-g8vRtLKa2-xIw25QTODg"
  },
  "qVwSYa-zbN5iKpVIUzET-A": {
    "date": "2/16/2015",
    "text": "You can't beat their prices and how much food you get. My eyes were bigger than my stomach   I got two items for under $10 with a tip",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "EU8q5Jv9j-5kb7yICN-a4A",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Chorizo torta and supreme burrito",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EU8q5Jv9j-5kb7yICN-a4A/o.jpg"
      }
    ],
    "user_id": "vs8-MdzPc4SPbwx5qsU7EA"
  },
  "HyMuNuAII1A7FPftTWJfVQ": {
    "date": "2/2/2018",
    "text": "I really enjoy this place! It's cheap authentic Mexican food that hits the spot! Staff are friendly and the place is alright inside kinda dingy. We usually bring the food home instead of eating there. The green chile carnitas meal is great with a large Horchata! The tortillas that come with the meal are warm and yummy! Their shrimp cocktail is great too (FYI: Mexican version is not just cocktail sauce and shrimp!). I'm getting hungry just writing this review ! All in all, great place to go when you want a cheap bite!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XPNfei7mrViyZPlFgq-oxw"
  },
  "cmnxCO9SZLAUrRa3vqC7MA": {
    "date": "11/1/2017",
    "text": "I have been here a multiple times and each time, I have to say the food is fresh and delicious.  They always make it exactly how I ask and have never had a mistake.  They have a few different salsa options and fresh chips sitting out for you to help yourself.  They are pretty reasonably priced for the quantity of food you get (which can be a lot).  And they stay pretty busy, so they are doing something right.  The only reason I did not give it five stars, is the customer service is very average. They are pretty transactional and don't really ask how you are doing or anything when you come in.  But to be honest, I don't care all that much.  I just like their food and they are close.  Also they stay open late which is very nice!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pkKKzB9jxPRgWCEywd-Txg"
  },
  "UrG1NonfBiPSxVsdhMIKzQ": {
    "date": "7/27/2014",
    "text": "Not much to look at, probably was a Wendy's or some other fast food restaurant in a former life.  The menu features lots of choices of burritos, tacos and combination plates.  Order from the not so flattering pictoral menu posted above the counter.  All the food is prepared fresh so grab some chips and salsa (three varieties) while you wait for your order to be called. Ours took about 10 minutes.    Food is fresh, hot and inexpensive. Lunch for the three of us was just under $20 total. I had a combination plate with a shredded chicken burrito, crispy chicken taco and it came with rice and beans -tons of food-only $6.99.  Lots of everyday people stopping in for lunch. Decent and filling chow.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "I0jRMGXjuKl3N9S5b3dvkw",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Simple inside",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/I0jRMGXjuKl3N9S5b3dvkw/o.jpg"
      }
    ],
    "user_id": "vL-7Z3rtMYLbY-L7Xd0JAw"
  },
  "AKRIxb3EjvfBzoDn6X01vg": {
    "date": "3/27/2016",
    "text": "This place goes in and out of being excessively busy all within 30 minute time slots. It's weird and I couldn't really understand why that was happening. When we arrived the line was very long and there was quite a few people helping themselves to a ridiculous amount of \"to go\" salsa, cucumbers, carrots, and limes. The tables were all dirty.  There were some gangster type cholos in the parking lot and some people inside we're a bit sketchy. The menu has a lot of variety and some great specials were written on a paper by the cashier. Very friendly staff. It took about 18 minutes from when we ordered to one we got our food. In the time that we were there they refilled the salsa bar and free chips. By the time we were leaving the place was completely clean, filled with Middle Eastern, black, Asian, and typical white guys....meaning this place appeals to all!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vZoe4KvSoJ3LPtmN7VaF_w",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Sonora style tacos &amp;amp; burrito. Free chips &amp;amp; salsa bar",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vZoe4KvSoJ3LPtmN7VaF_w/o.jpg"
      }
    ],
    "user_id": "jOu_vAZIT8VjiIYxCwPTow"
  },
  "rwxNdOfX_HRGqe2SK1wugg": {
    "date": "2/10/2018",
    "text": "Open for breakfast.. ordered tacos.. juicy barbacoa..quick service. Authentic spot near airport for quick bite .. numerous items to order",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8_5DCF9ffAQT62rpm8qsvQ"
  },
  "cf2FQ5SM3y-yiN1e5bUwZg": {
    "date": "2/16/2017",
    "text": "Mexican at its best! Large portions, good prices & tasty! We dined in and it was clean and I wasn't uncomfortable so that was a plus!! The chimichangas were huge, lots of meat. My daughter who is 3 ate the refried beans by itself. My 1 year old son ate the rice. Definitely would return!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "p7t4sqtOcVPK7W4yInAdcw",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Huge Chimichanga",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/p7t4sqtOcVPK7W4yInAdcw/o.jpg"
      }
    ],
    "user_id": "rf42XE4zApRJ2FDXbRtCLg"
  },
  "IzdfceQ1pVr6-e3mx1826A": {
    "date": "3/29/2018",
    "text": "Good specials , daily special for the rolled tacos you can't beat. Fresh tostadas and salsa. I love their tamales and their shredded beef tacos ! Would recommend for some Mexican food",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tO_Xp2iy61RIgLLWHLLlLQ"
  },
  "KRUfUUaBaM2b7Lv3Mx7fVA": {
    "date": "11/12/2016",
    "text": "Love this place! Prices are very reasonable, and the food is sooooooo good!!! Churros are the best in Phoenix! Service is great. Most authentic Mexican yet!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "0h3XyUKOE4SOrtnYrA0rJg",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0h3XyUKOE4SOrtnYrA0rJg/o.jpg"
      },
      {
        "img_id": "vLd5a539SHi2wHl46OJG2Q",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vLd5a539SHi2wHl46OJG2Q/o.jpg"
      }
    ],
    "user_id": "Ls8HPGKQGgIuEhaZKCKJLA"
  },
  "zj-RH81fIQ3SaXRGuYavxw": {
    "date": "5/15/2017",
    "text": "Every time I come I always get what I pay for. Nothing more nothing less. It is what it is. That's the culture of this place. The only one thing i would say to make this a far star review is to have the cashiers smile a little More. I really don't care if they do or don't however I would have rated this a 5 if they did. With all that being said I still find this place delicious and again you get what you pay for solid quality food for the price.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-xGA8IXQEDq15ElcuktupA"
  },
  "cQokBo9xj-mSsclU7lSe3w": {
    "date": "2/21/2018",
    "text": "2.5 stars acutally because it seems the meat is fresher if you go in before 3 pm after that you might get the shits or not . Service is not the best the cashiers seem like they hate the job and Just want to run out .",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z3Qwq-nVIm_QckdKRU2XiQ"
  },
  "rMBH5oLXtzXO-Q22_L1JnQ": {
    "date": "1/15/2019",
    "text": "I really wanted to like this place more than I did! The first thing I noticed after ordering and looking for a place to sit was that nearly every table was dirty with crumbs, sauce, straw wrappers, etc. The floor wasn't looking too hot either. It was near closing so I know people were in and out all day, but felt it should've been cleaner. I ordered the chicken chimichanga. The prices here can't be beat, and the portion size was insane. I wasn't expecting to get that much food for how little I spent so I was definitely stoked on that. However something just didn't taste right. The chicken had basically no flavor and it didn't sit right with me after I took a few bites. The rice and beans were good, and I enjoyed all the different salsas they offer. I plan on giving this place another shot, most likely with a different menu item.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qw71cK1R5oqja8-cdvcIoA"
  },
  "oTAVLEsXVMPmQ_WxNQbwcQ": {
    "date": "2/17/2018",
    "text": "Poliberto's is hard to miss, it's located on Baseline Road and has flashing neon lights. Their menu is huuuge - they have all sorts of different options for burritos, chimichangas, tacos, breakfasts, quesadillas, and more! Everything I've tried so far has been fantastic and I'm always looking forward to going back and trying more of their items. I also really like that they offer both regular tacos and street tacos (slightly smaller).   They have their own chips and salsa bar which is something really unique for this kind of restaurant and it is definitely appreciated! They have both plates and plastic sandwich bags so that you're able to take advantage of it whether you're dining in or taking to go.   The only downside is that sometimes you have to wait a bit to get your food, but it has yet to be bad enough where I won't want to return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "1JhkXMpH7-fd7S0C7rG6_A"
  },
  "6eBv4d7cTlWQmgKtS8frfg": {
    "date": "7/22/2018",
    "text": "I had previously bookmarked this taco shop.  We happened to drive nearby and decided to dive-in.  What a find!  Looking at the outside alone isn't inviting so l am thanful to our Yelp community for reviewing places such as Poliberto's.  This is an outstanding Mexican restaurant with an extensive menu sure to please all palates.  Of course l can rave all day about their enormous portions and modest prices because that's the truth! I had a veggie burrito enchilada style with a small horchata drink, Ron had two chicken tacos.  Our total bill was $11.40.  My veggie burrito was stuffed with rice, beans, cheese, avocado, cream and shredded lettuce. The tortilla tastes super fresh. It was absolutely simple and delicious.  Ron's chicken taco looked crispy and was filled all the way up. Their free salad includes tangy carrots, more lettuce, lemons, assorted salsa & sauces, warm chips and pickles. The locals eat here, families have their Sunday brunch to enjoy a quiet time together.  There is a TV rolling infomercials in Spanish as a mild background noise.  There were lots of kids and all were extremely well-behaved. All were eating nearly and there was no trash on  the tables or on the floor. It was refreshing to be at Poliberto's to see families sharing time together instead of cel phones. We had a great lunch and will be back for both the food and the humane experience.  Thank you Poliberto's!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 8,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "ZcawMu6FQLnToSv2ZDr63Q",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Let me know if you know of a better place!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZcawMu6FQLnToSv2ZDr63Q/o.jpg"
      },
      {
        "img_id": "qMkSHQ9I8vY0MYhY-gDgrA",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Best Mex food!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qMkSHQ9I8vY0MYhY-gDgrA/o.jpg"
      },
      {
        "img_id": "-KU-OOYSsvq-3lD1WGUldQ",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Salud!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-KU-OOYSsvq-3lD1WGUldQ/o.jpg"
      }
    ],
    "user_id": "ByNfFYaW544SRchjvAHscw"
  },
  "-B8VB6SleHOfxK3Kuq6Pgw": {
    "date": "5/10/2018",
    "text": "Best Mexican food west of the 60! Call ahead. Salsa is great! Mexicali Coca Cola! It's very good. Hole in the wall with great food",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CS0sc8F7C2CKR5YepsPeAg"
  },
  "Zhazs5zKKVBG1PmOhNzqcQ": {
    "date": "4/14/2019",
    "text": "Squeamish \"taqueriaphobes\" beware.  This place will scare most suburban wives away (but not mine!). Yes its sketchy but in the most beautiful way.   Cultures come together like you dream from your entitled homes looking for a food penance .  Food approaches the transcendent.    Good. Plentiful. Humble but complex.  Happy to recommend.   Try the carrots....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gfy4VBBTrbCwNT6ne3uABw"
  },
  "qT21_MexXK4wDioVWglRsg": {
    "date": "4/23/2019",
    "text": "Amazing food. Cheap, quick, and authentic. When i come back I'm going to be trying the chimichanga but i got a California burrito and an enchilada that comes with some refried beans and rice. The salsa that they have is also great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6pfEcPIno7a0qDHIHGDTmQ"
  },
  "pS2mmA8JEKKzbTHr236b6A": {
    "date": "1/3/2018",
    "text": "They have great chips and salsa which they do not mind if you take some to go. When I go we always get #24 and it feeds two people for a great price. I have been here multiple times and it has always been good.   They get super busy no matter the time of day so you almost always have to clean your own table, that is the only down fall.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "R8EPNABV3Xwhv2iCPMPxkw"
  },
  "DdfXU3mg5GSPfHCZJqECHQ": {
    "date": "3/8/2018",
    "text": "Chili verde was so tender it melted in my mouth. The place was packed, standing room only. When the worker bees start piling in, you know you picked a good place.  The menudo looked delicious, trying that next time for sure. Everything that I saw looked tasty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FKg4L9j8cKaZ-aRIp-c_JQ",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Chili verde plate",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FKg4L9j8cKaZ-aRIp-c_JQ/o.jpg"
      },
      {
        "img_id": "ela9jv-2fu0trBiTRtbgcQ",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Chili verde plate",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ela9jv-2fu0trBiTRtbgcQ/o.jpg"
      }
    ],
    "user_id": "VdfFkucdP-vFJJ8zxkA8xA"
  },
  "y--fRLjVcMIrK1LGwnNQ1A": {
    "date": "9/14/2018",
    "text": "The food is mediocre and the dining room needs cleaned. You get a lot of food for your money but I've had much better for similar prices.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bt_JDxE6aq0Ri28_yVxbew"
  },
  "Lb1Me9A1ksGBhZwrRfzzpg": {
    "date": "12/19/2017",
    "text": "Poliberto's is not easy to miss, it's all flashing neon lights in the windows. The parking lot is tiny, but I've never had trouble finding a place to park.  The chimichangas are delicious, the carne asada fries and rolled tacos are sooooo good, and everything else I've ever tried has been great.  The people at the counter are always incredibly friendly and patient, even when it's late and you have no idea what you want.  They always have a poppin' crowd late at night, but the food is always quick and delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "S5ucQRMLrspgfB8uEk8vvw"
  },
  "n83hyULq4TFpTldvL5ENTA": {
    "date": "2/28/2019",
    "text": "Very good. Go for the mini tacos over the regular size tacos as the tortilla taste if not home made then definitely bough from a great Mexican tortilla shop. Simple taco joint that packs lots of flavor. Love the spread of chips,salsas,edible radishes,cucumbers and spicy carrots and jalapenos. Gave it a 4 because unfortunately the carne asada taco was ok at best. It was chopped steamed beef and nothing asada about it. However the carnitas and carne adobada aka al pastor was fantastic. Great Jamaica (Hibiscus leaf drink)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jbfZfAxEIzLw0NENOm-aDw"
  },
  "-QrTs7cvGH_yW3sp3cUNOw": {
    "date": "8/26/2018",
    "text": "This place looks sketchy from the outside (and the inside tbh) but the food is WONDERFUL. They make the food fresh when you order it, so we prefer to call in our orders ahead of time and take it to-go. I have never ordered anything that wasn't good, but my personal favorite is the beef fajita plate. My husband's favorite is the steak and shrimp burrito. One of my all time favorite places to eat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QLXAsLFGxhshQoHpDrrBWA"
  },
  "0HlkNba1Anm_CRpGsZbH1Q": {
    "date": "2/17/2019",
    "text": "I think the food here is pretty much five stars. They have four different salsas and they are all really good. The only thing that kept me from posting this as five stars was the atmosphere is not the greatest. But their prices are inexpensive so I guess I'd rather save the money then spend it on atmosphere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QoeoNQlXtfaiiwTDYIYveQ"
  },
  "nG6EwNkxFD1gvQb85b22HQ": {
    "date": "11/9/2018",
    "text": "Well, the name makes it sound like about 1,000 other Mexican restaurants in the Valley.  But I had some friends in town and wanted to take them somewhere that had solid food so I listened to Yelp . . . and I was not disappointed.  Definitely worth a visit and the food is several notches above the average place that ends in some form of \"berto\"!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VIx5lXpz0NiGEG11jNiEFw"
  },
  "UfHDrNYHTJXocpEpSrF-fw": {
    "date": "8/23/2018",
    "text": "After reading the reviews for Poliberto's and trying it for myself I honestly cannot see what all the hype is about. My chicken burrito was unexciting in that it was only a massive amount of chicken wrapped in a flour tortilla, no toppings or sauce to speak of, and as if that weren't enough the chicken was borderline inedible. It was essentially like tasting a salt lick. And this is not just my disappointed opinion I had two of the people I live with try it for themselves and they agreed that it was gross. The steak tacos were somewhat redeeming but the steak was also slightly on the salty side and a little dry. Also the cheese that they were using to top the tacos tasted like shredded craft American cheese. With so many other options nearby I doubt that I will be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_NeKTw1CuFgJgAwoV6ay1g"
  },
  "Un48hfXnumZ7RpVscTiT1w": {
    "date": "11/7/2016",
    "text": "It was a late night while my bf and I were in Arizona. We decided to look up some Mexican food joints and came across this one on Yelp. The reason I wanted to go here was because the carne asada tacos look bomb! So we went and I ordered carne asada tacos and the New Sonoran Taquitos (2 for $3.99). The carne asada tacos were so good! The meat was just okay, but what really made this great were the toppings (guacamole, pico de gallo and a bit of cilantro). When ordering the Taquitos, I was expecting it to come rolled. It looked just like a taco but with a pan fried tortilla base. The Taquitos contained grilled onions, lettuce and guacamole; I really enjoyed this one! In addition to those items, we also ordered 2 breakfast burritos (although one was for the next morning). The steak and egg burritos with potatoes were on point; the chorizo wasn't. I would order everything I got again except for the chorizo breakfast burrito.   Loved the salsa and chips bar. The red sauce was better than the green, which was a bit bitter. If it wasn't for the slow service and the fact that everyone that ordered after us got their food first, I would have given 5 stars. Better luck next time .   Review 79/100 for 2016",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "2ItEz_EtCelSBqDRqS4qfw",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2ItEz_EtCelSBqDRqS4qfw/o.jpg"
      },
      {
        "img_id": "EU4b0M0dIaygFr0N7yBM3A",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EU4b0M0dIaygFr0N7yBM3A/o.jpg"
      },
      {
        "img_id": "lJAdiI6vPqfmMgJ0MRgBFQ",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Salsa and chips bar",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lJAdiI6vPqfmMgJ0MRgBFQ/o.jpg"
      }
    ],
    "user_id": "Zv11Okrpq5wEe61Vlzztpw"
  },
  "EsimDUn_nvcQAAGeea1ZAA": {
    "date": "9/13/2018",
    "text": "One of my favorite Bertos.  Customer service is good. This place is always busy which is a good thing",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E2ga5HPhFRp2BxwSmdt2lQ"
  },
  "clAsd6-MKVv8T7NhTiEpRg": {
    "date": "8/19/2018",
    "text": "I grew up on the north side of Phoenix and moved away for about 10 years and was back for a quick visit. Honestly priority #1 was to get an authentic carne asada burrito with guac and green salsa because they just aren't done right anywhere else. Anyway I was literally counting down the days until my trip to eat this burrito and when I landed Poliberto's was close and the style of food I was looking for. They did not disappoint. It was perfectly seasoned and every single bite was exactly what I'd remembered and I sat in that booth with that burrito making weird satisfied noises while I ate. I would have bought a case and shipped them back home if that was possible. They have chips and salsa at the counter for free too, I wasn't sad about that. Who cares about decor at a tiny burrito place like this? It's about the food not the pictures on the walls. A bit of a line and a wait but it was less than 5 min if I'm remembering correctly. Some tables were dirty but the cashier woman came and cleaned them when there wasn't a line so maybe they were understaffed that day. I've been back home for a while now and writing this review has made me really hungry and so sad I can't get this burrito.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "__DtWGPtSgfqlSW6ke5AbA",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/__DtWGPtSgfqlSW6ke5AbA/o.jpg"
      }
    ],
    "user_id": "jUHW-ktWZA_uQW1J3Oe_JA"
  },
  "GMMnFaeoQh-KFWLG4iEp-Q": {
    "date": "3/2/2018",
    "text": "I like to to express how much I love Poliberto's . Everytime I order take out . Everything is fresh & crispy . And Poliberto's is family owned . They are curteous & friendly & helpful . I will always go back there to take out orders . To me their #1 in mexican meals .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m8L0vNkwhDy0t7Z9-j6TfQ"
  },
  "rA_CSjsRWcnvFoRbZNwm0g": {
    "date": "2/17/2019",
    "text": "fast service, cool employees that are helpful, gigantic menu, good late hours. hard to go wrong here",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W5kPzOEQTMmDRJ0VUqmF-A"
  },
  "xSctE9i3w8VcFdxBbhv4fA": {
    "date": "9/7/2007",
    "text": "Most of the food consumed at a 'bertos is like bad sex.  It's cheap, dirty, and leaves you with a burning sensation the next day.  But fear not, gentle readers, I come bearing a message of hope. Not all 'bertos are created equal.  I used to live down the street from Poliberto's when it was Happy China Buffet, but never ventured into the dingy beige joint.  Then they went and added some electric yellow paint and garish red trim and for some reason it drew me in like a skeeter to a bug zapper.  There wasn't a drive-up here, only take out or dine-in, and the place was packed with my people.  Us poor unfortunates that work outside all day, covered in sweat, dirt, and godknowswhat.  So I figured it was a sign of some sort.  And I was right.  The carnitas were tender and crispy, the guacamole was flavorful and chunky and there were about five different types of salsa for me to measure the mettle of my taste buds against.  It's cheap as sin but doesn't leave me with that seedy, slightly used feeling the next morning.  Give it a whirl if you feel like your lard quotient for the week needs to be met.  It's a step up from Fili-B's fare.",
    "rating": 3,
    "rated": {
      "funny": 10,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "dyhTHLIf6eWBvU78Y3T06A"
  },
  "ZECDqob5YBLuXqsrHGiHdw": {
    "date": "12/19/2008",
    "text": "All 'berto's are, in fact, NOT created equal.  My ex-girlfriend and I used to be fans of Filiberto's, but the customer service was HORRIBLE.  The cashiers taking our food orders, got the order incorrect about 90% of the time.  My ex  was vegan (which made me vegan, by default, whenever I'm eating with her).  One of my ex's coworkers recommended Poliberto's to us, and we have loved it, ever since.  I am a very loyal fan and a frequent customer!  My ex loves to get the bean burrito, with guacamole, and cilantro.  The refried beans are made with vegetable oil (and NOT lard).  Plenty of free chips, and a great selection of different salsa's at the salsa bar.  It has the typical Coca-Cola selection of fountain drinks, and some other more traditional Mexican drinks too...  Poliberto's cashiers have NEVER gotten our food order wrong!  Unlike the 90% of the cashiers at Filiberto's who give the cooks the wrong order (typically with cheese), when we had specifically asked for NO cheese.  Be careful if you order the Guacamole and chips!  The Guacamole always come with cheese on it, unless you specifically ask for NO cheese, then Poliberto's cooks will just give you more Guacamole instead, with the chips.  Eating at Poliberto's has ALWAYS been an excellent experience!  5+ stars!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "I7SuGAW_WGOrPeasWo433Q"
  },
  "8EPJ8BbmQgEsNd8ip9GBcA": {
    "date": "6/10/2012",
    "text": "Everyone thinks im talking about the other abomination of a restaurant when I tell them about this place.  The only similarities are the menu and the name.  The food is very tasty and its super cheap on top of it.   I get the green chili burrito and its the best burrito I've had in this part of town.   For $4 you cant beat it.  They even have menudo on the weekends and the shrimp cocktail is great too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WrFfZ8YpciYqrtyh4aqhOg"
  },
  "sG9lNdO8Uvk8ZAhZVnKlBw": {
    "date": "10/25/2013",
    "text": "Ok, first off, they have probably some of the best Steak Ranchero I've ever tasted!!  So yummy!  The salsa is way better than any other \"berto's\" out there, infact they have a salsa bar.  It's good price for what you get.   Best part of it all is!  THEY SPEAK ENGLISH!!  I mean you can actually understand them.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8VNcFwoM2SYKjder2ovlWQ"
  },
  "OUSo_sFEU4RvHhN54p_tCQ": {
    "date": "1/20/2015",
    "text": "Food is greasy and not great.  Salsa is good though.  Has a dirty feeling to it.  Bring some hand sanitizer, lots of gross mitts on the salsa trough ladles.  On the upside you get a lot of food and it's cheap, just don't expect it to be good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tERIkFP5FuhrbShpBFQa8w"
  },
  "TAEEJfTXkZ6dLIMPSx7spA": {
    "date": "4/25/2011",
    "text": "Best fast food Mexican place I have been to in the Phoenix area.  Menu has great variety and their Salsa is damn good.  Go here instead of Fili B's!  So far I haven't ordered anything that I don't like.  The restaurant is fairly clean for a fast food establishment that is busy during all hours of the day/night.  Food takes a little while to cook but is well worth the wait.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ofznDNjZ6tdINXfWF3vTA"
  },
  "ax6QeNQL86-9Sq9WSLWxJw": {
    "date": "10/1/2009",
    "text": "Yes, I'm addicted to anything that ends in ***bertos, and although I'm not hispanic, I seem to have acquired a serious taste for this kind of food.   This was my first time here, and I was expecting a drive-thru as most of these places have but did not mind having to go inside to order.  It definitely has that cheap/fast/authentic mexican vibe with bright colors and a big picture menu.  The fact that I was the only white chick in the place made me feel confidant that I would not be disappointed.    I opted for the green chile burrito which was delicious...smaller chunks of pork than I'm used to with more of a kick than I was expecting and a perfectly hot and chewy tortilla.  Nice selections at the salsa bar and decent service.  Definitely a solid four stars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2NkH5JgebO9z4ZhsONtlTw"
  },
  "gmnPGu1g9qcBQUUxme-GtA": {
    "date": "5/27/2014",
    "text": "I went there couple of times and I loved the food. I love the bar where we get Salsa and Chips. Only was bad is the waiting which is something in Mexican food. They make awesome for us and I would wait.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Yc3H9_7oH4Bhpa-as9MOw"
  },
  "7qkBVirIzKRdT82PXcUbQQ": {
    "date": "5/3/2011",
    "text": "Decent rolled tacos.  Loved the salsa.  Pleasantly surprised.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XObVh8__kgp1imtsNyLezQ"
  },
  "yNkixOtvzq_BqcE_iFX81g": {
    "date": "9/10/2013",
    "text": "This place is entirely what you would expect: okay fast mexican food at a reasonable price and nothing more.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eLrIuxkpvdnr27rkQdEmPA"
  },
  "Lu7kfUszpVY6n8clX76dIA": {
    "date": "6/2/2013",
    "text": "i love the food here the beans and rice have amazing flavor. i've been going here for years i love this place. i use to live in phoenix and the drive here was always more than worth it. this is my top spot for the phoenix area for mexican food. the salsa is super super amazing in every way. if i could rate this place higher i would. prices here are great always. i now live in fresno,ca and great food like this is hard to find !! if you do find good food here it won't be consistent and cheap trust me been looking for two years now. anyways i highly recommend poliberto's to any and all who like great food. 5 stars isn't high enough..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "We7aldgan95lE5L39aXGIQ"
  },
  "vjtn0wmmE_AuqsOQc3Pylg": {
    "date": "3/7/2011",
    "text": "I absolutely love this place.  It beats filibertos hands down.  The prices are great and the food is excellent.  I usually get either the rolled tacos with guac & cheese, or the chili relleno burrito filled with carnitas.  The latter being a particular favorite.  I've also had the deluxe nachos with carne asada, which are also quite delicious.  They have a great salsa bar and a large bin of fresh tortilla chips.  Sometimes the chips are in low supply, but I usually go later at night.  The staff normally consists of a single girl working the counter, but she is very sweet.  I can't recommend this place enough.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T-eac81lEWCWOhdXRgg7AA"
  },
  "v3g02KZTRmoctQL56etMZA": {
    "date": "3/26/2012",
    "text": "Any place that ends in \"berto\" is good.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "TTKBpASAyrk69Jc8P7jCrw"
  },
  "1brTEwt2FwfHTbVxGb-e2A": {
    "date": "11/27/2009",
    "text": "Usually the food is pretty good. Probably been there about 10 times in the year. The supreme quesadilla is pretty good (especially if you order the sour cream and guaca on the side instead of inside the quesadilla), the burritos are average and so are the breakfast burritos, although you should not come here if you are starving, usually takes 15 mins or longer to cook.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ougu4S5ortMKCVYWLl49rw"
  },
  "ApEw5LGPrd3TB5Pqp49x9w": {
    "date": "9/29/2013",
    "text": "not sure if it's fair to compare it with Filiberto's, but it's much better and I believe a little cheaper",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "paGA5i3xWGPAK8IMu6JOZw"
  },
  "hg6lm6x1OHPJ8_b915E8hg": {
    "date": "3/28/2009",
    "text": "Ok....Lemme let you in on a little secret...If there are quite a bit of Mexicans grubbing down in Mexican food restaraunt...it's probably a good place....I should know...I'm Mexican. Now with that being said, being on vacation I thought this place was OK. First time I went in I had a Chorizo & Egg burrito. It was freaking huge. The eggs weren't all greasy & runny like some Mexican dive places and the chorizo was NOT greasy at all. Took it into the Giants game and people next to me were like, \" where did you get that?\" Not at the baseball game my friend! Second time took a Carne Asada burrito w/ me to the Dodger game, the meat was tender and tasted great. I don't know if they do this w/ all their meat burritos, but they threw in some guacamole (& with the salsa I threw in) made it slammin'. Nothing better than a good buritto and a cold beer @ the ball yard!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-O_W_wdiZBsVPfGEvivedg"
  },
  "A5FAbCtt4UoLR0oNHfCkmg": {
    "date": "11/24/2012",
    "text": "i do like the food but, today at 9 pm  the cashier gave the worst service. the sauce bar was empty and place was a mess. when we. asked for sauce the cashier rolled eyes . she acted like she hated her job. persons like that shouldnt work for resturants. there was other customers ther too that she ga additude. i normally go too poli's 3 times a week .but if this girl is not told how to treat customers it will probably be the last.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yHHYRQqvjXrCaDjEwXzY4A"
  },
  "neIJ2goXGm5qcp2myytg3g": {
    "date": "7/6/2019",
    "text": "This place is amazing. I was so impressed with the food on the first try that I decided to go back the next day. During the two day adventures the family and I tried the carne asada tacos which came with pico de gallo and guacamole, shrimp tacos which are huge, carne asada fries, super nachos, rolled tacos with cheese and guacamole on top , carne asada torta, and a steak burrito. The tacos are served on homemade tortillas which are super good. They have free chips and a salsa bar. We are so happy that we found this place on our visit to the Phoenix area.   FYI...If you go for lunch, the line can be long but the staff is really good at moving the line along.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hMOKAKF-W9ZkhOPilHeQtg"
  },
  "xdqHL_Z5mO4NLoxG1hPqEQ": {
    "date": "5/31/2019",
    "text": "Authentic.  Inexpensive.  Fast.  Nothing else needs to be said.  Mexican food perfection.  The kind of place I wish they had in Northern California.  Never know why people want to pay $20-30 entrees when a place like this is so much better.  Shredded beef tacos recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "JWYlU0a1pbUoF9FfMUgVVA"
  },
  "8XFyPG_OXVQ0UAeAs0VP_g": {
    "date": "9/16/2019",
    "text": "Was good caldo de res when I was theres, but the one i ordered to go came w no potatoes or corn just carrots.  Tried calling....no answer...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AeDNr8S-KP1G90_f34BqEQ"
  },
  "edudzdwxkSoTnQMcA--5YA": {
    "date": "10/2/2018",
    "text": "Prologue: My fiancee and I wanted to find some good Mexican food for our Saturday evening dinner date. I had recently read some good reviews about this restaurant and we decided we had to give it a try.  The Plot: We shared a Shrimp Cocktail, a Chimichanga Combination Plate (stuffed with shredded beef), and a Mini Taco Combination Plate (including a Chicken Taco, Fish Taco, and Steak Taco). We also helped ourselves to some of the customary self-serve condiments (sliced cucumbers, pickled jalapenos, onions, and carrots, and four different salsas) as well as some tortilla chips, of course.  The Scene: The overall appearance of this restaurant is completely consistent with your standard taqueria. However, the first important difference we noticed when we arrive is the relatively extensive menu, which offers nearly 30 different combination plates along with several a la carte items in each of the traditional categories.  The next important difference was the portion sizes relative to the price and the quality of the ingredients. The large goblet in which the Shrimp Cocktail was served was filled to the brim with shrimp that was very fresh tasting and garnished with chopped avocado. The Chimichanga was huge, plenty for two people, and filled with shredded beef that was tender, flavorful, and juicy. The Mini Tacos were made with two corn tortillas each and filled with more of the meats than regular size tacos along with the usual seasonings and toppings. The consistency of sides was perfect and the refried beans were exceptionally tasty.  The Rest of the Story: The staff were friendly and courteous, the prices were very reasonable (the Shrimp Cocktail, in particular, was a great deal). The wait was no more than about 10 minutes and we had no trouble getting a table right after we arrived at approximately 7pm on a Saturday evening.  Epilogue: This location is now our top choice for taquerias in our area.  Photo Design By: Billie Z.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "7Hrn6DfFimrBM9hrFj70og",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Shrimp Cocktail, Chimichanga Combination Plate, and Mini Taco Combination Plate",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7Hrn6DfFimrBM9hrFj70og/o.jpg"
      }
    ],
    "user_id": "lNDoRrMrdrK-Gd8Yllgpkg"
  },
  "Kcuu2_vBdzX8jo28mmt4qw": {
    "date": "7/2/2019",
    "text": "This is the Best Mexican food around! This is the Beef Chimichanga, and Chicken Flautas, complete with beans & rice, chips & salsa, veggies, and Horchata to drink.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vlUKYuUaNOeYYGyPo4Zkyw",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Chicken Flautas, Chimichanga with beans &amp;amp; rice, chips &amp;amp; salsas, veggies,  Horchata",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vlUKYuUaNOeYYGyPo4Zkyw/o.jpg"
      }
    ],
    "user_id": "sbAEQNTRdKKJFG-mrx4Hxw"
  },
  "LyGevkCX8UaLumioyrn-Yg": {
    "date": "5/18/2019",
    "text": "This place is great home style Mexican food will definitely keep coming back as much as possible. Their selection is fairly large and the customer service is good too. The portions are very large for the price. You definitely have to give them a try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rDI-AjJfrztBS1mW0w0new"
  },
  "AgZbggB15y-ihoAPVJGzBg": {
    "date": "4/15/2019",
    "text": "You get exactly what you pay for! Prices are reasonable and the portions are very filling and very generous! I recommend the beef tacos with guacamole!!! BEST IVE HAD SINCE I LIVED IN CALIFORNIA!!! Definitely coming back! Love the flavors. Everything is made to order and you can definitely taste it! The salsa bar is superb and their pickled carrots are OMG! And I'm not exaggerating! I have a complex and very Sophisticated pallet and this place is just perfect for that Rough Mexican/America antojitos.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "LcTbN0E72SnpbELrlaYSeg",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LcTbN0E72SnpbELrlaYSeg/o.jpg"
      },
      {
        "img_id": "9WWusUPIOZ06rN9Fvkfwxw",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9WWusUPIOZ06rN9Fvkfwxw/o.jpg"
      },
      {
        "img_id": "ND-uagHjWhtajvrgLz-q7Q",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ND-uagHjWhtajvrgLz-q7Q/o.jpg"
      }
    ],
    "user_id": "XgEFR3J1t7M4tgVelf-xaA"
  },
  "PDSs3NBJQoXMOCyLO8_S6g": {
    "date": "1/17/2018",
    "text": "Unexpected spot that I've driven by dozens of time but never thought to stop in and give a try. Postgame dinner we decided to head over as it was late (after 8pm). From the outside I thought another Filbertos but it's different.   If u can't park when u first pull in just follow it around like a drive-thru and parking is on the other side... ignore the houses if u can but they almost seem integrated into the lot!    The menu takes a minute to absorb just because they have a bunch of combos/platters all listed by numbers. It's nice they have some pictures so u get an easy of idea of what your getting. If u don't see a particular combo with the type of meat u want, just let them know and they will take care of it with no issue. Hence, that means the food is being prepared for you as fresh as possible.  While u wait a bit, help yourself to the chips and salsa bar. It gets messy with ease but that's because everyone is grabbing the chips and different salsas in those small containers. (Need to upgrade the station with some different containers and serving utensils that don't cause as much spillage. it can be a major turnoff if your walking in to see)  Food took a minute but we ordered fish tacos, mini tacos and a combo platter with carne asada taco and a burro along with rice & beans.   Unexpected goodness with the food for everyone. Looking forward to returning when in the area. Definitely a step up with different alternatives for combos the many of the chain locations in the valley. Realistically a 3.5 but I couldn't get over the mess people were leaving behind and no one was their to promptly clean it up. Actually no one came out for clean up.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "M2sl2KH__nWb3lIgFGTVlw",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/M2sl2KH__nWb3lIgFGTVlw/o.jpg"
      },
      {
        "img_id": "U14PsEoD0cleTwVGrIFaPw",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/U14PsEoD0cleTwVGrIFaPw/o.jpg"
      }
    ],
    "user_id": "fwasfCCwbxLjxLNhYLuF3Q"
  },
  "p-gwtil_VB05o3te1s4W8g": {
    "date": "1/23/2019",
    "text": "If you're in the mood for some great authentic mexican food this is definitely the place. My wife had a veggie burrito and I had two chicken tacos. Both were stuffed with great tasting food. They have a help yourself salsa bar with chips and other goodies that just adds to your meals. Best of all their prices are great. Can't wait to go back",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "P01E08uRmrwCG80D_OhjJA",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/P01E08uRmrwCG80D_OhjJA/o.jpg"
      },
      {
        "img_id": "cqGT6uqbXiHaMVUtlNkL2g",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cqGT6uqbXiHaMVUtlNkL2g/o.jpg"
      },
      {
        "img_id": "nV68iUX4yzqXpQoACVPiXA",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nV68iUX4yzqXpQoACVPiXA/o.jpg"
      }
    ],
    "user_id": "1S3NXAluUp5FB-YVSj3yOg"
  },
  "rgt8WLCilvuKT7HSA1baMQ": {
    "date": "7/10/2018",
    "text": "I was looking for a breakfast burrito close to my hotel as I was late for work.  I had an egg and chorizo which was big and really good.  The menu has all of the standards at reasonable prices.     I am a Los Dos Diablitos guy but this was quite tasty when in the Baseline Road area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kGeqWMyLs2ugKq4v_Fjo7A"
  },
  "Y4ZsQBaXLGKJ2eKkQLYtEw": {
    "date": "9/9/2017",
    "text": "Unbelievable value. Chips on standby to dine in or take a small bag for take out. Stocked salsa bar. Note my pic on the sizes of the tacos. One is a small meal on its own and for the price its amazing.   Carnitas. Nice crust without being dry. Tender.  Carne. Not fatty. Good spice and tender.   Cabeza. Good smoke flavor with the right amount of greasy. And guess what ..... TENDER",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "XMWZ26uXRRW85paHh6Svww",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. how big and stuffed they are.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XMWZ26uXRRW85paHh6Svww/o.jpg"
      }
    ],
    "user_id": "qG0MmHAuteQciXe6LERqTA"
  },
  "nIjh3cJmM1d7cghacFTAPQ": {
    "date": "9/7/2017",
    "text": "Finally found my Cali Mex in the A.Z # Outstanding!! It was pretty busy at lunch time too!  The greatest was the abundance of Hot Carrots offered - tastiest yet!   Beautiful salsa bar with three salsas. Sliced lime wedges, diced cucumber & sliced radishes.   Fresh homemade chips are filled often to the right of the station as well.  Carne Asada is flavorful and the perfect petite cuts that are sizzled / seasoned on that hot griddle to perfection.  Fresh guacamole is delish & the superb dip for those fresh tortilla chips!  The Chimichanga is gigantic. Well worth the price & you'll make two meals out of one!  Colorado burrito is enormous, was an added delight to have it \"wet\" with enchilada sauce on top!   Carne Asada Burrito is the True traditional authentic wrap- served with fresh guacamole & Pico De Gallo.   This is the SPOT! Please go see for yourself. You'll be glad you did!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ohxbHNBjAPSfuw9mvXL-Fg",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. #20 Steak Rancho Plate",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ohxbHNBjAPSfuw9mvXL-Fg/o.jpg"
      },
      {
        "img_id": "WE3E0aASf_wCFibNgLMEbQ",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Carne Asada Plate. Comes with a big fresh warm: Flour Tortilla on the side.  Delish Dish!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WE3E0aASf_wCFibNgLMEbQ/o.jpg"
      },
      {
        "img_id": "ivMfCgDbUbcbaLejpgcfOA",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Chimichanga Burrito ( Wet)  Insanely Gigantic &amp;amp; Great.  HUGE-Took half of it home for another meal.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ivMfCgDbUbcbaLejpgcfOA/o.jpg"
      }
    ],
    "user_id": "5jWaMozd4Ffi9YGwCC3QQw"
  },
  "b5Nf99mEf5AAlv-R0thg1A": {
    "date": "4/25/2017",
    "text": "I have driven by here for many years when coming to visit family nearby.  We've always kept on going because we eat at my family's house.  In this occasion, I was on my way to their house and had time to kill & hadn't eaten lunch.  When I walked in, I was a little discouraged to see it was needing a little sprucing up.  Anyways, I decided to try this place out.  I have been craving street tacos, but thought tacos of any kind would settle me.  What I liked a lot was the chips and salsa bar, where you help yourself.  I tried a red and a verde salsa.  Both were good with a little heat.  I got a pickled jalapeno and the last of the radishes.  They really needed to restock the chips & salsas, and condiments.  I decided to get a Fish Taco and an Adobada Taco.  The size of the tortillas was your regular sized corn tortillas, not the smaller street taco size.  At $2.49 a piece, I felt I got my money's worth.   I really enjoyed the fish taco.  The fish was hot and crispy.  It was topped with lettuce, pico de gallo & a white sauce.  The adobada taco was good, but was a little salty.  It was topped with guacamole & pico de gallo and enhanced the taco!  Don't judge the book by its' cover!  I would come back for a burrito or some other items that looked good, too!",
    "rating": 3,
    "rated": {
      "funny": 13,
      "useful": 13,
      "cool": 13
    },
    "photos": [
      {
        "img_id": "XhyKeeDG8YD7Sti6oGAcug",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XhyKeeDG8YD7Sti6oGAcug/o.jpg"
      },
      {
        "img_id": "G0Herw-YctAR95FESN75Qw",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Fish Taco and Adobada Taco",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/G0Herw-YctAR95FESN75Qw/o.jpg"
      },
      {
        "img_id": "fPVK4jTarEb_WdzBwnx3-g",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Seating",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fPVK4jTarEb_WdzBwnx3-g/o.jpg"
      }
    ],
    "user_id": "s_FAHFKUl4YqNofYZC1NYg"
  },
  "w5RsWtrcfD3OGxChws941g": {
    "date": "10/26/2018",
    "text": "I love this place, it has been my go to for 4 years now. Be prepared that it is not FAST food, if you are in a hurry, call in your order about 20 min before you get there... that being said, it is SO good!!! And, they have Coke products",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KLJRG8bN4rwmBV4NPP0eIg",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KLJRG8bN4rwmBV4NPP0eIg/o.jpg"
      },
      {
        "img_id": "2BJeuPFUPmRssLPKppTdnA",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2BJeuPFUPmRssLPKppTdnA/o.jpg"
      }
    ],
    "user_id": "JWs41novQ9x-TnTu21k6oQ"
  },
  "4J5FEAvETWJq4hbK18dtew": {
    "date": "8/29/2018",
    "text": "The pictures speak for themselves!! Poliberto's serves the most authentic, delicious, and flavorful Mexican food I've had in the Tempe area. It had been a long crazy day before we stopped by and the smells inside the shop rejuvenated us haha. We ordered the chicken enchilada plate, three tacos plate (2 carne, 1 pastor), carne asada quesadilla, and three rolled tacos (shredded beef) with guac and cheese. The total was under $25 (minus tips) and the meals came with rice, beans, and drinks PLUS the serve-yourself Mexican salad bar. The chunky red salsa was by far our favorite (a pico?) and we were sad we didn't stock up on it cause literally anything tasted 10X better with it on lol. The chicken enchiladas were my favorite - they're literally stuffed. with chicken and topped with simple lettuce and cheese cause it doesn't need more than that and a handful of limes :3 I also really enjoyed the rolled tacos; my tip is to let the guac sit for a bit so it softens up the tortilla. Then you get a good crunchy start and the flavor of the guac gets to mix with the meat. There was a ridiculous amount of guac on top which I enjoyed and used with tortilla chips (they're also free and on the salad bar!). We will definitely be back!! Both to try more menu items and to get more of that pico! It was literally like teleporting to a shop in SanLuis MX - so nostalgic and comforting :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OUHCiCje7bryvz61tTQsLw",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Carne asada quesadilla",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OUHCiCje7bryvz61tTQsLw/o.jpg"
      },
      {
        "img_id": "xRGAyYgbLQSVz2jDKx3KzA",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Chicken enchilada plate",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xRGAyYgbLQSVz2jDKx3KzA/o.jpg"
      },
      {
        "img_id": "YFrGvBiRIgebmfcnL4h7zw",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Chicken enchilada plate",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YFrGvBiRIgebmfcnL4h7zw/o.jpg"
      }
    ],
    "user_id": "g2mpm6dcJb_9CL8Ns_EPcQ"
  },
  "gIKMxCRIDarPkIyXKAqz8Q": {
    "date": "1/4/2019",
    "text": "I really, truly love this place. There are many \"-bertos\" in Phoenix but this one is different. Their bean and cheese burritos are excellent, their salsa and chip bar is delicious, and the hard shell tacos and taquitos are sooo good.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "hd3gaMxxMD5wzJoEQYPwew"
  },
  "xRBl6Evc6WaOxERnK_RMBA": {
    "date": "10/27/2018",
    "text": "Most amazing food I've ever had! Great price for huge portions. I got two meals out of my chimichanga. Will definitely be going back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KC_eLaE4mzEscoQjmda58w"
  },
  "r2vsn1A9pdPu3uxElIHCig": {
    "date": "1/20/2019",
    "text": "The food was pretty good and the salsas were nice, but the menu is overwhelming and the whole place felt a bit dirty.  Maybe I just need to go more hole-in-the-wall places that are \"come here for the food, don't be a snob about the floors\".  If I find myself in Tempe again I'd go back to Poliberto's, but not sure when I'll be in Tempe again so...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aPAqasEN2_kzQ1CkaM-haQ"
  },
  "iQDwDUwOj4HRnsa3T-fBSg": {
    "date": "12/4/2018",
    "text": "The best in town. I've been coming here since I moved to the state and their prices, quality, and size is the best I've had in this state. Plus the staff is nice  and they're always busy. So that tells you something.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YjLsB9to7HNUq_bs-_MPUg"
  },
  "S-lSLSM09sxeLmeBPDFldA": {
    "date": "11/17/2017",
    "text": "Since I'm not from Arizona, I could only visit when I'm in town. My last visit was a year ago. I haven't stopped thinking of the food since, especially the shrimp and steak quesadilla. I've tried searching for an equal all around the US but nothing could rival this. And now that I'm back one year later, the quesadilla was as good if not better!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mToMPG7tsQNrvXvPRMAUhw",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. BEST shrimp &amp;amp; steak quesadilla in the USA",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mToMPG7tsQNrvXvPRMAUhw/o.jpg"
      },
      {
        "img_id": "SwF01W3_tRQmPK9Dy-bFxQ",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Epic Chimichangas",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SwF01W3_tRQmPK9Dy-bFxQ/o.jpg"
      },
      {
        "img_id": "AEnKaUC06IomtOdxNck8gw",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Free chips and salsa",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AEnKaUC06IomtOdxNck8gw/o.jpg"
      }
    ],
    "user_id": "ry-AkPEIk5ot4OjoahhoSg"
  },
  "RigBZSeput2Y4D11CDWwaA": {
    "date": "12/31/2013",
    "text": "You MUST try the pollo adobado burrito !! The best thing I have eaten in a while !!!  Huge portions and great prices !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4771rvtgnU2pa8uH0pb2TQ"
  },
  "itPPvW1LUNF1Z8M_6ctG5w": {
    "date": "4/13/2014",
    "text": "I've been here a couple of times. The food is good and fresh. Yes your order takes a few minutes but I think it's because it's fresh and made to order. They provide self serve chips and you can try the salsas that were also very tasty. Prices were good and contrary to what I've read in a couple of the reviews it was clean. It's a hole in the wall and the place is old but the food is very good along with reasonable prices. Definitely try the carnitas tacos, lots of meat and very authentic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uzJTsDSzuQ-w4zxPH0oyrQ"
  },
  "uUhguObJi-CPkYlSgigOLQ": {
    "date": "12/13/2014",
    "text": "I'm so happy I moved to this area and discovered Polibertos.  Coming from Chandler Blvd, my old \"go to\" was Espinozas r.I.p.....but yeah what every other 4-5 star viewer said.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KGaBq2jps1U6OcjMuSnblg"
  },
  "7bhipqUfHK59njOwmXjFYg": {
    "date": "11/5/2013",
    "text": "The food was great! I enjoyed a chicken burrito and some awesome fries with basically everything on them. The horchata was phenomenal and filled my midnight cravings.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ewjJyJyo3gMpCQXbFLrTGQ"
  },
  "NTTeIe0DBy_1gQlVUMOTmg": {
    "date": "7/18/2011",
    "text": "I have lived next to this fine place for the last 2 years, but for over a year I had always thought of it as a seedy place full of roaches and tacos that would punish me for enjoying their delights. If I had a time machine I would go back in time and drop kick my face for even thinking that this was the case.   I had thought that all the ___berto's were the same, and having been to Filiberto's once, getting my order wrong, cold and dealing with the stench that was clouded around it gave my past self a bad image of all taco shops, but every day I would pass I would see Poliberto's full of people at all hours. I decided to take the plunge and try some of their tacos for myself, boy was that a good day!  I am a HUGE fan of getting the 3 mini taco plate combo, which is 3 double mini corn tortilla's pilled high with carne asada, lettuce, cheese, sour cream and guac with a side of beans and rice and a bottle of Coke. Fills you up for $6.50 - $7.00. The beef was tender, full of flavor and plentiful and they have several salsas to accompany your free freshly fried corn chips. I reccomend getting the chunky one, as it seems to be the best combo of flavor and spice.   The cleanliness of the place isn't sparkling, reflection in your face clean, but it isn't downright dirty either. The service for me is usually speedy and most days friendly, although sometimes the person at the front seems to not want to be there.  Overall the food is great, downright cheap, filling and they have Mexican Coke in the bottle!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cTe_EodjyobZjUD-Jt7Lrg"
  },
  "a8Og8FLdwd6HOBgDtVmOFw": {
    "date": "1/3/2011",
    "text": "I ordered the California burrito, Carne Asada, potatoes, cheese and pico. I added avocado and got it enchilada style.  Once I got home and looked in the to go box I was very impressed. The portion was enormous and looked and smelled so good.  The first bite is where it all went wrong...it was like eating a salt burrito. I have never eaten anything so salty!   Too bad....",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "jyz8-hAPGRjurBVp9DST9A"
  },
  "4zvk0UgW96k8FfhpJMKFPw": {
    "date": "12/31/2013",
    "text": "The family and I was on the lookout for some authentic Mexican food. We hit the jackpot! The portions are large at the right price. Some of the best food I've had in a long time!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-dJ69J3e0NvAzNUnm-okeQ"
  },
  "2M_17B6ooyLAyXpJoOKe9Q": {
    "date": "1/19/2011",
    "text": "I live right next to this place and I've always wanted to try it. I finally went in today and found it pleasantly packed. The restaurant smelled good--though a person could be turned off by the run-down condition of the restaurant.   I ordered the shredded beef burrito and it was quite good. The tortilla was firm, and delicious. The guac is clearly homemade. The beef was of good quality but not that 'shredded' it was more like chunks of easily pulled apart beef.  I enjoyed what I ate but I'm still left with the feeling that the food was missing something, I don't know what!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kBy2MAMpx9S4g-WV3gPsKg"
  },
  "ygmOZ-8hjtCepVEoDWF16Q": {
    "date": "1/18/2016",
    "text": "my boyfriend and i always come here! its the best mexican fast food restaurant out there! food is always up to our standards with fresh ingredients!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kVC-8X30_pUotJ4vJowogg"
  },
  "3rkh8NtbebWOUBW7ldCIVg": {
    "date": "1/10/2016",
    "text": "Great \"hole in the wall\" type Mexican place. Tons of menu choices and everything I have had is tasty, fresh and in portions too big to finish. My favs: the Carne asada, burrito, green Chile and my favorite breakfast - the green chilaquiles. Prices cannot be beat and impressively, the food is made to order.  Love this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UNH74vz5VX6-e4mWcdg-2A"
  },
  "kfoD43ikQS4SMJ4ltWer5g": {
    "date": "4/18/2013",
    "text": "Having this place in walking distance from your apartment is a dream come True.  Amazing, satisfying Mexican \"fast\" food (you may have to wait a bit but it's worth it).  THIS IS NOT YOUR AVERAGE BERTO'S.  Super affordable delicious food with sizable proportions and a delightful salsa bar.    My husband and I usually get the two burrito combo, one with carne asada and one with adobada.  OMG SO GOOD.  If you split a large drink, too, it comes out to about $8 for two people.  Miraculous when you are hung over.  And they are open at pretty much all hours so you can totally saunter over here at 9am and chill with an interesting assortment of early-risers.  This place does not have a drive-through so keep that in mind.  I have taken out-of-towners here on two separate occasions and it did not disappoint.  One more thing -- I always get a horchata and it is never bottom-of-the-barrel gritty like it can be at some places.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "50NAPO_xnxpaBxp6Clspcg"
  },
  "oyVaHdSnN7ZNIgPiVBZ1fg": {
    "date": "7/3/2010",
    "text": "Whenever we drive by here, the place is always packed.  Taking that to be a good sign, we decided to stop in for lunch.  Even though there were a number of people there, they took our order quickly and overall service was excellent.  The combo of the three mini tacos was delicious.  The refried beans were the best beans I've ever had, and everything was steaming hot and fresh.  Prices were very reasonable and atmosphere was good too.  Definitely going back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "fKvtHle5M4BMwX74uj1mbA"
  },
  "JfRe6PfMWWuQEJ0KSZ6ZQA": {
    "date": "10/18/2010",
    "text": "There isn't really anything for me to say about this place. It's not bad, but it isn't great either. The primary reason that my girlfriend and I keep going back is that it is literally right next to her apartment complex, so it is as convenient as it gets for us.   It's the same greasy, fast, mexican food that you get at all those other generic places around the valley. You know, the ones with the giant, colorful menus on the wall that all look the exact same? I won't mention any specific food that we had, because there wasn't anything really special, good or bad, worth mentioning.  The people that work there are just that, there. I've only ever seen the same girl, but she looks like she doesn't enjoy it there, as I have never seen her smile.  In conclusion, the only two things that really make it worth going here are that it is very inexpensive, and, for us, the location is unbeatable when we don't want to cook and don't want to go anywhere. I won't tell you not to go there, but don't expect anything special when you do.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "df_wr-hXaxeb1b_KCAX3BA"
  },
  "BTOtrzJMmvLYajVmkgQqLQ": {
    "date": "3/1/2010",
    "text": "Best place for cheap greasy tasty Mexican food. Every thing on the menu looks great but I usually only have the carne asada fries or Guacamole supremea.  Oh carne asada fries! They start out with a huge plate of fries then pile carne asada meat on top. Then next add on the sourcream, cheese, and guacamole. Oh so good. A little on the greasy side but still quite tasty.  Now even better the quesadilla supremea, so delicious!! Large flour tortilla filled with all the good stuff. Carne asada meat and cheese layered with sour cream and guacamole.  Everything on the menu is reasonable priced and they even have some specialty Mexican foods. But all at semi-fast food style.  I can't wait to get back to Phoenix for some more.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kilTiDMKMfGK5o12gbha9A"
  },
  "1gdyCmgjszGgXosN-Q8qFg": {
    "date": "5/27/2015",
    "text": "Huge tacos at a great price, although I wish I would have know the tacos came with pico on them. Free chips were great! Cheese Enchilada had way too much sauce on it. I'll definitely be back, but next time no pico & not a lot of sauce.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FFoFZtkj9WyDZgQDKG--Pw"
  },
  "HmuLQZewlzhKDrO1etjweQ": {
    "date": "1/11/2012",
    "text": "How can you not love this place? It's cheap. It's easy. They have menudo for crying out loud. Many are open 24/7, which is awesome if you work a weird shift or are drunk and coming home from the bar. I'll take this over taco bell any day of the week and twice on Sundays. Please expand to other states.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9po6Pvv5Yiw2ciRO-2iIMQ"
  },
  "K6apLZ8Hy2eojOpSnrGtMg": {
    "date": "1/21/2015",
    "text": "Great service. Huge menu. Food cooked fresh to order-not typical fast food restaurant. Three different types of salsa, limes, chips, and hot carrots.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AtzzRQ8dKXT4MXbkxcD0zg"
  },
  "OcnXeIMPRLeX_JUAhHnYjg": {
    "date": "7/22/2015",
    "text": "Come and get it! You can pass all the other Berto's, this one tops them all....including in portions and price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fmpbe7t121LMkpbbFxSVag"
  },
  "zd6SjuR8z1TzqthbfPIUyg": {
    "date": "7/11/2011",
    "text": "I live right across the street from this restaurant. It looks a little shabby from the outside, and the same goes for the inside as well. However, a True Mexican food fan like myself knows that it is usually the worst looking places that have the best food.  I ordered the Carne Asada Burrito plate, and it was wonderful. It tasted just like the food I was used to in Southern California, so I was glad to have a little taste of home. I will be coming back!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z8UU0OJ4dX2Ju4EAW6msYA"
  },
  "RBL9UM37dgiVyWBY1c8vPA": {
    "date": "8/31/2012",
    "text": "I dunno... I don't really get the rave reviews.  I got a chicken taco which was completely soggy by the time I got home (only about 5 minutes after I ordered it because I live down the road) and a cheese enchilada combo with rice and beans.  The beans do taste fresh.  The rice is decent.  The enchilada is ok but lukewarm and the cheese isn't even melted... it's still all shredded up inside.  The salsa at the bar is good though.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Z2k-Xeh3buAoB4mns0duw"
  },
  "XEbTA7KC-ERFp9uDrraMoQ": {
    "date": "9/20/2016",
    "text": "Excellent food, big portions and good prices. Original mexican taste, a wide variety on the menu and free carrots, cucumbers, chips and salsas! Became a regular already.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LCYaVj2pejGvpAP7seXNDQ"
  },
  "049N72ftCJ-YaZeox680zQ": {
    "date": "12/19/2016",
    "text": "Have visited this place twice during two visits to the Tempe area.... Food is amazing, you will NOT be disappointed....  The BEST mexican food I've tasted in a very long time...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KbCw5-WfHhhnZYGxky7EfQ"
  },
  "0N5hY9UVWKTRSM7gxALfEg": {
    "date": "9/7/2017",
    "text": "Great place for inexpensive and good Mexican food.  Not much on atmosphere, but the food is good and the price is right.  Love the carnitas here!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dc2Qf_b_1LLhmqvQfM_MVw"
  },
  "E4noaMatg7UG2t5j_4Pe6A": {
    "date": "4/28/2017",
    "text": "I live nearby and there are at least 6+ \"...berto\"-style Mexican fast food joints within a mile.  While I miss the former Chinese Buffet's fried chicken, this is THE GEM in Tempe for fast food! Huge menu, helpful staff. Poliberto's Tacos de Lengua are the best anywhere! Beef Enchiladas are so full of tender meat, onion, & chile (bell pepper). The \"Salsa Bar\" with sauces, cucumber, radish, limes, and Jalapenos/carrots en escabeche are such welcome condiments/sides. Everything I've ordered here over the years has been excellent, & the prices give the very best value. I just wish that they had (1) rajas of roasted poblano chile, not just mild bell pepper, (2) AZ-style green chile (for burros), & (3) Piquancy or \"Chilosity\" - nothing  - not even the salsa de molcajete - is picante, just mild. iPor favor! So, you may need to stand in line for a while to order, but do it... It's really worth the wait! .I may even head over there tonight ... again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Kz_0EBjYmqQDFR-O0IdFbg"
  },
  "MQP-FVUhlUS5apViP8-Zow": {
    "date": "5/18/2016",
    "text": "Coming from Tucson, I looked for a Mexican place that would equal Nico's taco shop. I love being able to grab a burrito and go about my life. I have tried their California burrito and a carne asada burrito and they were both good. The food is fresh but it does take time to get. I don't mind waiting though. I really like their salsas and appreciate the free chips. This has become my go to for a burrito on a day where I just don't care to cook.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BNhvyD2dQ2aj_Rh5nwME5g"
  },
  "eg8ls3FdG9Uld19yo9Pm9g": {
    "date": "9/22/2014",
    "text": "When I lived in CA, you couldn't throw a rock without finding a 24 Hour Mexican drive thru place that was literally the most delicious food you could ever imagine stuffing into your maw. Moving to AZ, I had a REALLY hard time finding one that was even passable within a five mile radius of my house.  Luckily, I went to Polibertos one day because it was there and I was hungry after a trip at Fry's, and it's mostly filled  that hole in my heart. I do wish there was a drive thru, but c'est la vie.  The food is pretty good, I always like the roll tacos and they give you a good amount of guacamole. I particularly like the Fajita burrito and the Ranchera burrito. It is really slow getting your food, in part because there are a decent amount of patrons (probably because the food is good), and in part because there are only like two people working here at any given time.   The hot sauce/other accouterments bar has a good variety, and I appreciate the little sandwich baggies for your jalapenos/limes/etc. I do wish people wouldn't constantly hover over this, and I will never forget seeing some ASU frat boy clean out 1/2 the bar even though he ordered one measly burrito, but that's nothing I can fault the restaurant for.  Four stars because it's good and satisfies my need when I want Mexican fast food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "z6_XQVwejlPmbio08n4KUg"
  },
  "I804JqhTUtL2ZGwpwpoW8Q": {
    "date": "6/6/2016",
    "text": "If you're in the Tempe area and need a good hearty breakfast at a great price, stop by here and get the Spanish Omlette w/machaca and you won't need to eat again the rest of the day!! For $6.58 (out the door w/tax) you get a giant omlette which looks like it must be 3-4 eggs, filled with at least 1/2lb of shredded beef & grilled veggies (peppers, onions, tomatoes), a giant scoop of grilled diced potatoes, and a huge side of rice & beans! Everything was cooked and seasoned perfectly, piping hot fresh off the grill. When topped with some of the their fresh homemade pico it is out of this world! I wanted to eat the entire thing so bad, but rather than do so and regret it for the rest of the morning I saved the other half for lunch.  Can't beat getting a delicious breakfast and lunch for under $7! They also have amazing breakfast burritos for $3-$4 which are just as hearty and filling, but today the Spanish Omlette grabbed my eye and did a very good job at filling my belly for the day. I think next time I'll add jalapenos though because it could have used a little extra kick, other than that it was perfect.   I still don't understand how this place isn't ranked as one of the top Mexican places in Phoenix. It may have to do with the \"berto's\" at the end of their name so everyone immediately associates them with the Filiberto's/Julioberto's/Eriberto's/etc. fast food/take-out places, but this is a totally different type of place and not related to those others in any way (in fact, none of them are even related to each other!). It is not \"Mexcian Fast Food\" at all, in fact it's not fast at all - I've waited as long as 20 minutes for an order before. Not because they're slow, but because everything is made 100% from scratch when you order it and they get pretty busy around the main meal times. I try to go either late morning to beat the lunch rush, or mid-afternoon for a late lunch, those are the times when it is the last crowded.   Do yourself a favor and check this place out! Or better yet, don't, and let it remain one of the best kept Mexican food secrets in the state. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3cUjvPO5m2DVm8z-sd02Gw"
  },
  "Fc28D6jnOtpgRuZQvjPx5w": {
    "date": "9/2/2016",
    "text": "Absolutely everything you could ask for of a taco shop north of the border! Complimentary chips and salsa bar with excellent salsas! My sister and I ordered the #24 with two carne asada burritos. Very generous portions and excellently marinaded crane asada! Gracias Polibertos por su excelente calidad y servicio!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uXNsDKsSffmF0YCk8y8MMw"
  },
  "WHRYgGU1TE2GJ5VqvX4LsQ": {
    "date": "5/9/2014",
    "text": "No pretension. This taqueria has excellent carnitas, low prices, free chips, and a variety of salsa. For about $14 the two of us got more food than we could eat, two mini taco plates. They let us choose different kinds of meats for the three tacos and we found chicken, carnitas, and steak to all be tasty! The food took a little while, as other reviewers warned, but we got to munch on chips while we waited and were very happy with the experience overall!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "pR69BWK7LUxvpB2r105gIw",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Mini Taco Plate. Yum!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pR69BWK7LUxvpB2r105gIw/o.jpg"
      }
    ],
    "user_id": "BjjFQtAEzU2qWSknC2MAsw"
  },
  "jwAcYwsw3niQvXIuZUiNPA": {
    "date": "2/23/2016",
    "text": "We stopped in on a weeknight evening around 9pm to pick up food to go.  Upon walking in you may consider turning around, but if you can get past the disheveled and untidy atmosphere you should try a taco!  Customers are invited to fill up a bag of complimentary chips and salsa, unfortunately when we arrived they were out.  They offer a wide variety of menu items and prompt service.  We ordered the shredded beef hard shell tacos and chicken flautas.  The meats were lacking seasoning and didn't add the most flavor to the dishes.  Overall, the food didn't quite satisfy my craving.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "NZgC4FA977feQfwSqZySXw"
  },
  "oxPWQEsNqGbNe9ejs4Adnw": {
    "date": "1/13/2014",
    "text": "Oooo me gusta Poliberto's!  At first, I wasn't sure why the tacos were $2.45 but once I saw how big they were I can say - the price is well justified...like Justin Timberlake.  I ordered four soft tacos: cabeza, lengua, pescado, and carnitas.  The lengua was pretty tasty & juicy, the cabeza was soft and tender, the pescado was almost on par with what I'm used to at Senor Fish back in Los Angeles, but what really got me was the carnitas.  The only way I can accurately describe eating them is, \"Carnitas be crispy like I ain't eva seen!  I ate one of them and I was like WHAAAAAT ARE YOU SERIOUS, POLIBERTO???\"  Best of all, I saved half of each taco for the next day, reheated them and they were STILL GOOD.  Winner, winner, carnitas dinner!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "iKvTAuDinBZM0Nioi_zA3Q"
  },
  "Iw-uwEmlPcctC2l0w1X4Hw": {
    "date": "4/15/2016",
    "text": "This place is too cool. Food is great and there are so many selections for you to chose from. I mean you get 4 chicken flautas for 2.99 what is there to complain about? There is a chips and salsa bar right in front so you don't have to ask. The best I had here was the chicken rellenos it is so delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5TNusg2UmO-7jI3mGNeK3w"
  },
  "MtQnKZvFVRUrHiGFZrRh3Q": {
    "date": "4/1/2014",
    "text": "Very good breakfast burrito. The salsa bar was fresh and tasty too. As Arnold would say....I will be back....",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "N6ZTMIue-2b30CJv2tyPGg"
  },
  "HYTQwRFrEDILPHvuHDBNeA": {
    "date": "6/2/2016",
    "text": "The food here is superb.  We had several selections and everything was excellent.  The service was quick and the portions were very generous.  The only reason they're getting 4 stars instead of 5 is that the dining area was not clean.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jamhA6Okv6K9fM90XjIl-w"
  },
  "7s1ISaCvFff17jhXjx4M-A": {
    "date": "9/3/2017",
    "text": "Disgusting.  Went at 10pm and every table and floor leading to registers dirty.  Ordered food to go to eat at the hotel and after taking a bite of a few different items we knew this was the worst Mexican food we have ever had.  Threw the food out and had to order a pizza.  Wasted $20..",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l_Tbxs82SJiqWaJxw2-p5w"
  },
  "MFjAHDTLjQZccFMeVw34Xw": {
    "date": "7/16/2017",
    "text": "Great, quality Mexican food at very reasonable prices. Will be returning to next time I'm in Phoenix.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qjg7tjfcB4w5Env759rnzA"
  },
  "tFDo6YPIHAOwhdknA_mNng": {
    "date": "12/7/2015",
    "text": "I don't understand why people would give this place 5 stars, as a matter of fact, I don't understand why people give mediocre places 5 stars.  5 stars is for the best thing you've ever eaten.  This place is no better than any of the other barf-o-berto's.  The parking lot smelled good and gave me hope, but as soon as we walked in, the smell instantly became something comparable to body order.  This place is pretty gross on the inside, about as gross as all the other berto's.  I ordered a #13 chimichanga with carne asada which is $1 extra.  They set the chimi on a bed of lettuce which, anyone with any sense would know, caused the lettuce to start weeping it's water out into the container.  So my chimi was going for a lettuce water swim.  We also got the two beef tacos, which were advertised as $5 on Monday special, but were charged full price anyway.  The cashier was not friendly, not unfriendly either, just kinda there.  We won't be coming back here.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zoZYbvNEjzcoSZGI0qVymQ"
  },
  "MzpAKbQWmIQHmepa1ujX5Q": {
    "date": "1/2/2014",
    "text": "After eating some of the worst Mexican food ever at F-berto's nearby, I decided to try Poliberto's after work....While it was overall better than my traumatic experience, I can't say this was that much better.   I made a huge mistake ordering the Carne Asada Torta...everything fell apart and the meat tasted really bad.  I'm used to a good, fulfilling, crunchy big torta like they make them in SF for the same exact price.  Unfortunately, this torta failed miserably in comparison.  I seriously have no clue where to get good Mexican food in Phoenix/Tempe/Scottsdale, but I won't give up without a fight.",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "wmBB4i0c-KuA4obI5x5Uxg"
  },
  "KTsmKnqKDJxrh3lCV3khmA": {
    "date": "5/21/2014",
    "text": "Being a native Californian (Los Angeles area) I'm always on the hunt for decent hole in the wall Mexican. I now live in TN where the mexicam is sad. Polibertos - I feel like I have come home!  I primarily judge a place on its carne asada burritos. I ordered one specifically basic to taste the quality of each component. Meat,  beans, rice, cheese. I must say I was impressed when I saw my roll waiting for my pickup at the counter. The tortilla was fresh and perfectly cooked. The carne asada was seasoned and chopped to perfection. The beans were real refried beans and the cheese was straight forward cheddar (which I expect). Even though this roll was sizable I actually contemplated getting another one because my taste buds were in heaven.   Everything about this place met and exceeded my expectations for a hole in the wall,  walk up counter joint. The salsa bar had great selection and all 4 salsas I tried were delish!   Take a pass on other trendy or restaurant places of you are craving some real tasty food!  I'll be back the next time I'm in town!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R3x6anTpeVtygaEkr3IUlg"
  },
  "zZwBCZMHT57PFnaYFTS2iA": {
    "date": "8/10/2014",
    "text": "Second time to visit and the veggie burrito was pretty tasty!  I like the salsa bar each of the salsas has a very unique flavor.  TVs up kind of loud and doesn't get very good reception so it breaks up quite a bit,  which can be irritating.  Overall for a Taqueria pretty good all-around: nice environment, nice staff, excellent food.  Will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zRgLMijOcICEqE1wetx5oQ",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Oh so happy!  Look at the size of that Burro!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zRgLMijOcICEqE1wetx5oQ/o.jpg"
      }
    ],
    "user_id": "zTBWQhuRZ_r7QxBcA09swQ"
  },
  "7fr0N-AK2LLdPkXabWGjrw": {
    "date": "12/7/2015",
    "text": "Absolutely delicious breakfast burritos! I've had both the chorizo and the potato, egg, and cheese. They are pretty large, so one is more than enough for me.   I will say that the inside of this shop looks a bit on the cheaper side. I would take your food to-go because there isn't really a great ambiance here for sitting to enjoy your food. They are pretty quick too with the burritos so there was not a long wait!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "itUUr5RsgrteJhoKaFYgOw"
  },
  "J6npR1XJRzFDhlmgOo86DQ": {
    "date": "5/24/2013",
    "text": "I decided to give this place a try since the reviews are so high...plus I was craving a breakfast burrito. I'm about to give a lot of information that you may think will contradict my rating but please, just bear with me.   After finding the eatery, I parked and got our of my car. Oh boy, I was getting nervous. The place looked run down and dirty. There was debris in the parking lot; containers, pieces of trash and such. Behind the restaurant was another unidentified building. Maybe it's the owners home..? The outside of the eatery didn't look appealing at all but I thought, \"Nope, Yelp says it's great. I can usually rely on my fellow Yelpers.\" Take a deep breath! As I walked inside, I purposely didn't look around. Instead I immediately looked at the menu chose my dish, ordered, and paid. I ordered a chorizo breakfast burrito with potato and cheese.  I ended up waiting about 10 minutes since there were a few orders ahead of mine. This, unfortunately, gave me time to look around. Old food stuck onto floors that looked like they hadn't been mopped in ages. There was some other dark smudges that I couldn't make out what it was...or had been. Large areas of paint peeling off the walls, bits of paper from straw sleeves laying around, clumps of dust and cob webs hanging around the air vents and upper corners of the building. There was a wooden bench that looks like a couple slates were missing from its seat. The place really needed to be thoroughly scrubbed.  While waiting I helped myself to two different kinds of salsa from the salsa bar. Finally my food was ready. I was surprised at how heavy the bag felt. I drove back to work and opened the yellow paper that contained my burrito. My god the thing was huge! It was like a small baby! Alright, so, the test! I took my fork and knife cut off a bite, put a little of the fresh red salsa on it and ate it. Wow, It was EXACTLY what I have been looking for in a breakfast burrito!!! The chorizo was spicy, the potatoes seasoned, the egg not dried out, the cheese gooey and melty, and the tortilla was the perfect texture. It had that, almost, transparent look to it, you know, the kind where you know it was handmade. Then I tried it with the green salsa verde! Omg!! So flavorful and delicious! I was in breakfast burrito heaven! However, the thing was so big that I could only eat half.  So! Now you understand my high rating despite my earlier comments.  This is a True \"hole in the wall\". Do I want to know what their kitchen looks like, HELL NO! But I will continue to go back because the food is THAT good. I'm so glad my Yelpers didn't let me down. ;)",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "oxh9uDMQb2JDW0FN6QaIsQ",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Breakfast burrito with chorizo, egg, potato, and cheese. Delicious!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oxh9uDMQb2JDW0FN6QaIsQ/o.jpg"
      }
    ],
    "user_id": "v8QnvfWXCf4651Bxg2vvIw"
  },
  "p8avHeCSt-nCgpYPZszOnA": {
    "date": "5/10/2015",
    "text": "I've been here a couple of times mainly getting breakfast burritos or a carne asana burrito but I must say that their food is excellent! It takes a bit for the food to come out but that is because it is all made to order. They provide a chips and salsa bar while you wait which is convenient. Their prices are very cheap and you get some quality food!  Don't be overwhelmed by the location though. It's technically located in Tempe, but just blocks away from the town of Guadalupe.  I definitely see myself coming here a lot more often!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "4UgCYM-rbqzukAJyAU_95Q"
  },
  "ed8WPYDfv4ujD6x7uaYiBA": {
    "date": "8/30/2015",
    "text": "Have to follow suit. On the out side and when you walk in there are two things you will either imeediately notice or will soon notice. One it looks and smells like any typical dingy taco stand in Phoenix. But do not let that dissuade you. There is obviously a reason why dispite the ambiance and spotlessness; or lack there of this place has 4 stars. That brings me to the second reason...  The line that are either there or soon will. This is because the food is pretty darn good. I will say for me it is better than any whole-in-the-wall taco stand Ive been too in the valley.  Realy good food, generous portions, salsa bar, good prices, and lots and lots of bustling happy customers. Eh smells funny and the tables are not kept up as much as we may want but yup a fair four star earn.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "e62a-9IVOE3ItuWt6G58CQ"
  },
  "w1GvCUU2qzWjcro5494_nw": {
    "date": "12/9/2016",
    "text": "I've ate at alot of Mexican restaurants and alot of different \"bertos\" establishments but this place and the food here is so authentic and delicious,  you might need your passport.  Good thing it's only on Baseline in Tempe! Right down the street from Arizona Mills.  The food is amazing and the lines are long but it is worth the wait! Just giving props where it's due.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HSZ65SfB2i7S0pCAeoxNFw"
  },
  "eKU7xgEQVnEoDcCzcuMpmw": {
    "date": "1/16/2017",
    "text": "This place was everything I was looking for in a Mexican place (aka authentic). Great value, excellent salsa, free chips, large selection. The carne asada fries brought me back to my college days and the churros were on point too. 10/10 would recommend and would visit again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "98FP3fd8u85GS_SkCMub4A"
  },
  "thpMA4wXU5Hy2BuXzhKFuQ": {
    "date": "4/12/2017",
    "text": "Hands down a favorite of mine!  We had just landed in Arizona, looking for a place to enjoy warm, quality food. Surprisingly to us, the price was affordable!  A must for those in this area!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UbL_aqZjYhqxPUfWRqgVPw"
  },
  "jPbqdKHP4DEGKICzyFO7CA": {
    "date": "5/15/2015",
    "text": "This little place is AMAZING! The food is cooked fresh as you order, I had the chicken adobada burrito, with guacamole and pico de gallo. Got to say the burrito not only tasted amazing, but the chicken was so tender and juicy that it left me begging for more.   Their salsa bar has 4 different types of salsa, pickled carrots and jalapenos, lemon and some othher stuff. I tried the green and chuncky red salsa, they were really good.   My only complaint is that I didn't find this place sooner...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "avCTRVCxd_jPo6lpWRRNuw"
  },
  "zAemxSTsTx835AxxMXaE8A": {
    "date": "11/14/2016",
    "text": "Not fancy, not even pretty, but great food at a great price! I had the Chili Verde with rice and beans. The flour tortilla was warm and soft. The CV was tender and just the right amount of spicy. The refried beans needed a little help but their complimentary roasted pepper salsa was the perfect spike. OK the rice was just kind of plain rice but 3 out of 4 ain't bad and all this plus a drink (soda) for under $10 is a great deal. Sorry no pictures this time. The food smelled so good I started eating before I remembered to take a shot. And a picture of the interior just wouldn't  live up to the food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tNm1Sbt3ysyxOkkQ7ZyarQ"
  },
  "jAK4JX7hZNeYJ_rATiKZ1w": {
    "date": "9/21/2015",
    "text": "Hands down the best breakfast burrito joint in the area. My boyfriend and I were slightly obsessed for a while, and still would be if we had not moved. He always ordered a ham breakfast burrito with potatoes, egg, sour cream and cheese. I'm a weirdo and would always order a breakfast burrito with bell peppers, potatoes, sour cream and cheese. Or maybe it's not a breakfast burrito since there's no egg? Oops.  Anyways, I think one of the most distinguishable things about this place is the salsa bar. I love my salsa. Mild, medium or spicy... Red or green... I will bathe my burrito in it and devour. They have some great salsas here, folks. They also offer chips so you can have some chips and salsa while you're waiting for your food. My boyfriend also likes munching on the cucumber and radish slices.   The parking is not the best around this joint, but I highly recommend the place overall.  Also, they do TO-GO orders! Always great since this place is always busy on weekend mornings!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o_omRoAfmXQmN-6wDUVtvg"
  },
  "Du9M9C5BpIutb-Dj7q7J2Q": {
    "date": "9/8/2016",
    "text": "I've been here more times than I care to admit but it's always good for a quick fresh meal. Pretty basic Mexican but the floutas are a great deal. The adobada pork is super flavorful and so are their beans. Much more white Mexican than I usually eat, but it's cheap and close and fresh, so I'll take it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XufTeRjGG3wqJUDl4yascw"
  },
  "UAbyfl-jHGf1GVprhg1Nbg": {
    "date": "3/27/2016",
    "text": "Got there at 8:00 am, doors were locked and I waited outside for at least 12 minutes before leaving. Couldn't see anyone inside but could smell food being cooked.  There were several people waiting. At least open the doors/let people know you're not ready yet and apologize.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pqoyQmQ5vJ-lajxHyt5Edg"
  },
  "HlowoX8B8wACjQDil9u-xw": {
    "date": "9/4/2016",
    "text": "I got the #10 carnitas plate and for 8 bucks holy smokes there was a ton of grubbing going down, the carnitas were off the hook! Crispy and tender and not too salty,  place is busy and tables were dirty if that's a problem for yah but that doesn't equate in my reviews only awesome food, totally going back for some cabeza tacos",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c5DwPN8vdH-Q1wid7xDD_w"
  },
  "4uG7HAdw-lVzXiCfRq3z2A": {
    "date": "3/21/2015",
    "text": "Went in and got a chicken chimichanga and the 2 beef taco combination. When I opened the boxes everything looked really good. Unfortunately the food didn't really taste like anything. The best part of the meal was the rice that came with the combination plate.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yGXKMV1omio1I_3qNLdtAA"
  },
  "jpDXpcKXpAgPcMcHuL4S_Q": {
    "date": "6/27/2016",
    "text": "Featured on local TV news recently for receiving multiple violations from the the local health department. Willing to chance it? Really? Then you're my kind of guy. Forget those silly food safely laws. They cook everything to death anyway. Just avoid the carne asada fries. Sounds like heaven. It isn't.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZyVxRA-DNco4E9RQfb5qhQ"
  },
  "5I1XFpzUfqpN9EcVypO7hQ": {
    "date": "4/26/2015",
    "text": "Omg visiting in phx saw,this place on yekp, don't expect fancy it's a taco shop in the hood. Which is prob why it was cheap but oh so goood. All I wanted this trip was a taco. ..so missed them they even had Cabeza and length street taco...hmmm",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cZmfoOnhbRtmFmDxpM8waA"
  },
  "r_Fd2QoTB9-hCg1nzwE8Iw": {
    "date": "11/29/2016",
    "text": "Poli b's!!!!! My friends and I love this place! It's definitely a bit of a dive and there are nicer filibertos but this place is great. The staff is super kind and friendly! Come enough and they remember you! I used to get the chicken burrito which was great but now I typically get the rice and bean burrito and it's delicious. The salsas are yummy and the flavor a are authentic!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e2aNmUnbuRVip5iXyzvBfQ"
  },
  "y3kjHrfNdUTN-DG2NfREJA": {
    "date": "5/6/2015",
    "text": "This place was amazing and the best Mexican I had in AZ.  It is very similar to a San Diego taco shop & the prices are excellent.  They have a salsa bar with hot carrots, a big plus for me.    I had rolled tacos with guacamole & cheese and a shredded beef hard shell taco.  They were all great.  The locals appeared to really like this place and told me they come at least once a week.    The inside was a little dirty (tables not clean) but when asked they did come clean them.  You could tell they had been and continued to be busy & the cashier did everything, but cook.   I am so glad I found this place on my trip, you must give it a try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kLg2RFgitqwt1_SKYBphUQ"
  },
  "2IYZ2ch7WTGkEfPFicSLQQ": {
    "date": "4/2/2013",
    "text": "Never miss no.21, it's awesome. I did tried other menu too! Always open until midnight.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5DuXvpavK1RE8TUxhPht5Q",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. No.7 pork steak without beans! Awesome!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5DuXvpavK1RE8TUxhPht5Q/o.jpg"
      }
    ],
    "user_id": "tM84r9rP7XTjX4SnRzviMA"
  },
  "Y1W9XzyE4HZsNyXhv3TjRw": {
    "date": "1/29/2016",
    "text": "Good cheese enchiladas and red chile burrito! Small place but definitely worth the visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Hh6oQg6OV4nsV9gE2mMZVg",
        "caption": "Photo of Poliberto's Taco Shop - Tempe, AZ, United States. Cheese Enchiladas, so good!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Hh6oQg6OV4nsV9gE2mMZVg/o.jpg"
      }
    ],
    "user_id": "5Wch7JEF4ASfXg5jPPGWIQ"
  }
}