{
  "L7gNwotYVswJlAZKkBq6EQ": {
    "date": "7/24/2019",
    "text": "Good bbq. Brisket was good. Mac and cheese was good. Reminded us of being back in the states. We were getting homesick for American food and this hit the spot. Service was good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2FoXDAv7tZyRNGbjt3zUEQ"
  },
  "rf_24lcDCDiaUoMljzUxFQ": {
    "date": "9/11/2019",
    "text": "From a born and raised Southerner, this place nails it. BubbaQ could hold its own in the US. Ribs and wings taste great even before you add one of their four sauces. Pork and brisket hit the spot. Pair with a BrewDog Punk IPA in draft.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zkq-YlB1kGOfIZsFtZGkiw"
  },
  "BTxLQdjobDSRM3JjVlbyGg": {
    "date": "7/25/2019",
    "text": "My friend and I stumbled into Bubba Q as it was close to the train station. The service was fine and the decor was acceptable, but, unfortunately, the food was disgusting! I had the pulled pork tacos - the meat was bone-dry and the tortillas were stone-cold. I would not recommend!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T5DNLeFULIqpQYVA7CcGbA"
  },
  "6ZfSNdVooTtcR9WLv02mGw": {
    "date": "3/5/2019",
    "text": "On the face of it, this place ticks all the boxes - barbecue, beers and all the hipster cliches. Dig a fraction deeper and you'll see it's not quite the whole package.   The staff were brusque and uninterested. I had the chicken waffle special, which turned out to be frozen breaded chicken strips. The seemingly large beer selection was surprisingly limited (a couple from Flying Dog and Goose Island (yawn) and some other standard offerings like Brooklyn Lager).   Pretty bloody expensive and not much to show for it. It seems this place is an unfortunate victim to the complacency that often comes with being in such a tourist trap hotspot.   If you want more genuine barbecue, best look elsewhere.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LcA7a0W8GHgWGhbaoP6HDg"
  },
  "d9v4FJFza6dRGNHaNTQQgg": {
    "date": "4/2/2018",
    "text": "A hidden gem! Great price, great food, great service. It's easy to walk past so please pay attention if you are trying to find it. I recommend any of the platters. This will be the first place I would want to come to eat if I ever come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qyo6pqeJ8sSc9bEwQ6g5kw",
        "caption": "Photo of Bubba Q - Edinburgh, United Kingdom. Another platter on the lighter side",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qyo6pqeJ8sSc9bEwQ6g5kw/o.jpg"
      },
      {
        "img_id": "dO4YUUwdczY9iy6X_NUHnQ",
        "caption": "Photo of Bubba Q - Edinburgh, United Kingdom. One of the platters",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dO4YUUwdczY9iy6X_NUHnQ/o.jpg"
      },
      {
        "img_id": "qFUT57QKQJChedy4GSFjDQ",
        "caption": "Photo of Bubba Q - Edinburgh, United Kingdom. Inside",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qFUT57QKQJChedy4GSFjDQ/o.jpg"
      }
    ],
    "user_id": "IQ_3a8K4hNd-__a_Q7lswg"
  },
  "2miNb1c5hYi8Ks8Wu7fnVg": {
    "date": "5/30/2017",
    "text": "I am, indeed, an american that loves BBQ.  And it's very obvious that the owners did their research.  Not just in the decor (chicken wire, sheet metal roofing,  and spray paint signs. Even the music, b sides of American bands that come right from the Rock band video game playlist), But the actual BBQ is excellent.  The spicy chicken nachos were fantastic, and my son declared them his favorite in the world.  Had a great time, only real negative was the brisket.  Way too much fat.  Not even close to a standard cut.... Almost 75% fat.  Good thing the nachos were filling.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UaLuRHBTAvKO6z1BVL_mCQ",
        "caption": "Photo of Bubba Q - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UaLuRHBTAvKO6z1BVL_mCQ/o.jpg"
      },
      {
        "img_id": "uVfro8mESX7Mo0onC5gNaw",
        "caption": "Photo of Bubba Q - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uVfro8mESX7Mo0onC5gNaw/o.jpg"
      },
      {
        "img_id": "L23W3NA36jKV4tmp-t5Wwg",
        "caption": "Photo of Bubba Q - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/L23W3NA36jKV4tmp-t5Wwg/o.jpg"
      }
    ],
    "user_id": "NyAfjJYmWx3g-wl6WZm1HA"
  },
  "Op0UeJqCIeaN5qDSg7q6iA": {
    "date": "11/20/2016",
    "text": "HUGE portions for an excellent price!   My friends got a large tray of food including meat and a bunch of side dishes. It will most definitely fill you up. I don't think I can even finish an entire meal to be honest.   I ordered a vegetarian burger called \"The V\". It had such a unique taste. The \"patty\" was a slice of sweet pepper, and the bread was spread with a chili jam which I liked. Not as large of a meal compared to what my friends got, but it was still enough for me.   Really neat that Edinburgh has American style BBQ. Wish I could go back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U20HG9oOWWYLqmg9JgsmVw"
  },
  "6BW55asJzSEYicHFxjXnDQ": {
    "date": "12/26/2017",
    "text": "I simply loved this place! The environment was great and the food was delicious! We had the lunch menu, I think it was around 6 pounds, a dish + side + drinks. Loved it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FEmjLkBOUNCMJtN1481TVw",
        "caption": "Photo of Bubba Q - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FEmjLkBOUNCMJtN1481TVw/o.jpg"
      }
    ],
    "user_id": "EUHYlGOwvRennxAyDlbTRw"
  },
  "NSAgTlLQMJ-J6SGgj7bhfQ": {
    "date": "5/23/2017",
    "text": "Ok me and the wife were looking for True BBG but unfortunately this place does not smoke it's meats, all meats tasted plain and it was the added BBQ sauce squirted on too that gave the meats their taste. We had the meat platter and all the meats were just warm. The only thing good about this place was the inferno wings that were covered in a super hot sauce and the music, Oh and the servers were great.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "apyooLm-NhMvPsPjRgiEQw",
        "caption": "Photo of Bubba Q - Edinburgh, United Kingdom. My reaction after eating the inferno wings",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/apyooLm-NhMvPsPjRgiEQw/o.jpg"
      }
    ],
    "user_id": "4GKa4VGcfdPsDRUFZJsTlg"
  },
  "CVafAVWkvO3aVKfWTmv2_g": {
    "date": "3/19/2017",
    "text": "Seemed like it would be great but the food was bland unfortunately. The brisket was chewy and dry and the mac and cheese was pretty weak.  The milkshakes were alright but still could have been better.  Overall was hoping for better - the menu promised so much but the basic flavours were disappointing. Here's hoping they step up their game - this place could be awesome but it's currently a diamond in the rough.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WbvSL090xo-8fU67L3IvGw"
  },
  "RPv6gDuPK0d8fWPyqQGa_w": {
    "date": "8/10/2016",
    "text": "Is this U.S. BBQ no, but that's hard to replicate.  It's a new place and the smoker probably isn't seasoned yet.  I spoke with the owner regarding the brisket and chicken.  I mentioned the the smoke ring was missing.  He told me that the people in the UK would think it's raw and would be turned off by it.  It's a whole different mindset of BBQ and meats in the UK by what was explained to me.   The decor is very cute.   Support this guy who is trying to bring BBQ to Scotland!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uiRHKk-dwVgRNJmDGIERHA"
  },
  "bbQP0f4gLqZ0pOZ_21wsQQ": {
    "date": "6/16/2017",
    "text": "We are on vacation from the US and this place is just across the street from us so we thought we would give it a try.  We were not disappointed.  Huge portions and sides.  The pulled pork was tasty, burgers are very flavorful, but the mac and cheese was a little mushy.  My friend tried the burger on a donut and loved it.  The decor was nice and music was awesome!  Nice job with BBQ.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qcqRrbADBx_KOmLwJktLuA"
  }
}