{
  "aruAkr_81a4pw3axvGKk0w": {
    "date": "1/3/2016",
    "text": "This is a new branch of Passorn (there's an older one in Cannonmills). The interior is modern and stylish. Service was good. Food was high quality, probably the nicest Thai we've had in Edinburgh. The Tom Kha soup was creamy and thick, with lots of fresh vegetables. The fried tofu was well-prepared and tasty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "YzaPQSyb8jRes-Rjs-3w-g",
        "caption": "Photo of Passorn - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YzaPQSyb8jRes-Rjs-3w-g/o.jpg"
      },
      {
        "img_id": "MfJpEXbQzAerZ3Taxp1_DQ",
        "caption": "Photo of Passorn - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MfJpEXbQzAerZ3Taxp1_DQ/o.jpg"
      }
    ],
    "user_id": "J_qpI2jCkwv7vPNz_9JeqA"
  },
  "qs0bpX5GhC_4zgKSjgnorw": {
    "date": "5/4/2016",
    "text": "Clearly popular when I visited with a friend on a Saturday evening in mid-January there was always a lot going on in the main area of the restaurant in terms of staff coming and going.  Arriving unbooked as we did we were sat at the table closest to the reception desk and therefore right beside the throughfare for every other customer, which in itself was fair enough but not somewhere you want to be if you're to get the best from the place.  Musically things were rather stuck in the soft rock of the '80s, rather than traditional Thai, which was a bit incongruous.  Overall the service was alright and my friend enjoyed whatever it was she had for her main course. I was less sure about the duck I ordered.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "txzOZrHK9EVY0kYjSuXkKg"
  },
  "5DFqGPcBC_t73bo1J5f2xw": {
    "date": "7/12/2017",
    "text": "Nice place. Lovely service and the food is decent. Not a bad price either. The staff were attentive and polite. Would definitely recommend it if someone was looking for a Thai. I'd honestly go back if I was coming back to the area. The king prawns were dope.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7ATP4XFKZm4_EgwPqlCmxA",
        "caption": "Photo of Passorn - Edinburgh, United Kingdom. Mr and mrs prawns and satay",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7ATP4XFKZm4_EgwPqlCmxA/o.jpg"
      }
    ],
    "user_id": "ro-Jh6AC-isDFJqvJGjb0g"
  }
}