{
  "NVc3Oqa_TMGeKmjIuomRpQ": {
    "date": "1/9/2016",
    "text": "I had a craving for ham and pineapple pizza, aka Hawaii. Usually I order pizzas from La Favorita, but I wanted to try something different as I was in a \"no frills\" mood and didn't care if the pizza was 'hand stretched and cooked in a log fire oven' or whatever. I just wanted a plain Hawaii pizza and fairly quickly as well.  And that is what I got at Pierinos. I paid 7.70 for a medium (12\") pizza and after about a 10 min wait, the pizza was ready and I strolled home to eat my dinner. Well, I wasn't disappointed. The pizza was tasty and just right - basic stuff but just what I needed then.  I'm definitely going to revisit Pierinos again.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yuFHrb8YQtVuzu0eEXvJtA"
  },
  "Yq9pkUq4UR9a8W_nIHeKhQ": {
    "date": "6/9/2017",
    "text": "First day in Scotland and I couldn't have asked for a better experience. The MEAT PIE is to die for!!! Very kind and welcoming, this place had a great feeling to it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pyLkpykTdliWginn3nC9Cg"
  },
  "drXFtnegZ6GIUcvuLPYAKA": {
    "date": "5/30/2017",
    "text": "The BEST fish and chips by far in Great Britain! The fish was tender and flaky, the chips perfectly salted. My daughter and her BF had the pizza. It was like NY style - lite sauce, floppy crust and slightly greasy Devious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4bkjj78NM9OnJ6hrO388zA"
  },
  "pYkW_rD4AMPSZN97G7-lqw": {
    "date": "9/2/2015",
    "text": "Always tasty here and the food is fresh. Staff are pleasant and, while the chips may not be the biggest portion in the world, there's enough - and they do a larger portion for days when you're hungry. Only downside is the mushy peas and gravy aren't quite the same as in Lancashire but that's my personal taste.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "pcltzPoM2nSAGecQyJWWPA"
  },
  "KqGMliaZRCdIMBNFj0Dr0g": {
    "date": "6/23/2011",
    "text": "Any chip shop can be a hit or a miss, depending on when you go in but this chippy is genrally OK although they are very skimpy on the chips...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZkmKyB9660N9d30GIrBGTQ"
  },
  "UBwMBpB6clkPRpD64i-GfA": {
    "date": "3/18/2011",
    "text": "Good food but service has gone downhill, I ordered a fish supper yesterday and got a fish on top of 'literally' 17 chips. They weren't big chips either. A bit annoyed. Ketchup was 20p a sashe as well, lame.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nHgsLeYsNuQcic1mzjvCbg"
  }
}