{
  "Xamkj-WjsUFoVX70NlmjyA": {
    "date": "6/1/2014",
    "text": "We ate here as part of our stay at the Bruntsfield Hotel (you can read my review here: <a href=\"http://www.yelp.co.uk/biz/best-western-plus-bruntsfield-hotel-edinburgh?hrid=vnqalsA-lH-AYzUO2P00dQ#src:self\">yelp.co.uk/biz/best-west...</a> )  The food here was the absolute height of decadence; to start, I had the shellfish bisque whilst Kris had the chicken liver pate (a favourite starter of his). My bisque was rich and suitably fishy; it wasn't too salty either which is sometimes a danger with a shellfish soup. Perfect! Kris thoroughly loved his pate as well, stating it was one of the best he'd tried.  For mains, Kris opted for the Alba Chicken (haggis-stuffed chicken) in a whisky sauce with mustard mash and I chose a pheasant, duck and venison red wine casserole. Kris' chicken was absolutely divine, cooked to perfection and the mustard mash was a delicious touch. My casserole was utterly gorgeous but I will warn you all, it is incredibly rich and it almost killed me; I was so full afterwards I could barely make it back to our hotel room!   Sadly I can't remember what I had for pudding; I do remember that I could barely eat it because I was so full from my casserole (my own fault)! I thoroughly enjoyed the meal, despite my own over-indulgence and found the staff to be brilliantly helpful and polite. Whether you happen to be nearby or are staying at the hotel, definitely go to Bisque!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fk_5HYLPXos2lzJJOu1dtg"
  },
  "637i4VJSbxVPC-tz4jA-hQ": {
    "date": "10/23/2015",
    "text": "We stayed at the Best Western Bruntsfield and decided ton\"stay in\" for dinner after a cold, blustery day of sightseeing. We were just too cold to go out again but we were hungry. Our expectations for dinner at a chain hotel were not high... We were pleasantly surprised. That wait staff was attentive and the meals were delicious and moderately priced. We ordered the Chicken Alba, the Escalope of Pork Fillet, & the Butternut Squash & Sage Risotto. The sauces were light and complemented the meats nicely. I would not hesitate to have dinner here again if our stay was longer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_e9O1t6yw4VuvE1_q8s1kw"
  },
  "vM1Zkts1ooiDAsxjsxf0xQ": {
    "date": "6/28/2017",
    "text": "Our family has been to Bisque on two occasions. Once for dinner and once for breakfast. After traveling over 22 hours, we decided to eat dinner at the conveniently located Bisque at the Best Western Bruntsfield Inn. The dinner was adequate, nothing special. The service was slow and lukewarm in the friendly department. A mistake on one of the dinners at the end wasn't worth mentioning as we wanted to get to our rooms to sleep rather than wait for another half hour or so until they got around to fixing it. I would have chalked our experience off as being \"tired\" and leave it at that.   However, our experience at breakfast this morning was disappointing mostly in the service department. The food was a classic, adequate continental breakfast offering with the option to order from a short selection of basic Scottish breakfasts. When the young waitress approached to ask if we would like to add any hot items to our meal, we all declined as the food was fine for what we needed. However, my dad and grandfather to my special needs son, asked out of curiosity if they happened to serve a pancake or waffle. He was being thoughtful of my son who hadn't had any real food in days due to his trouble adjusting to the travel. No big deal either way, just a thoughtful question.   The waitress was dismissive and somewhat snarky when she said \"no, we don't serve anything like that here. Maybe some other places in town do, but we don't.\" Something you might expect at a low end restaurant where the service doesn't matter. Again, not the end of the world and it answered the question.  This leads to the concern. My husband while refilling his coffee, overheard this same waitress laughing it up with the kitchen staff making fun of our accents (poorly by the way) and acting immaturely about our question (not order) about the availability of a pancake. No need to spill details, but was ridiculous considering it was a non-event. We all get staff need to vent with each other in the food service industry, but within hearing distance of your customers? Yah, no. Not professional.  Yes, we get it, we are in Scotland, and 99% of our party is game for trying all the wonderful things the country has to offer. Given a choice, based on her attitude and lack of oversight of service at Bisque, we would not be able to recommend the food, the place, or the service to anyone.  The food isn't worth it, the service is painfully slow (even for laid back Southern Californians), and it appears that service is not a priority and substandard quality staff are hired. And definitely, no consideration for anyone with special needs.   We came here to spend money and enjoy our vacation, every other establishment we have been to has been friendly and accommodating.  I would also say, for hotel guests, there is a diner close by for breakfast, a Thai food place for dinner, and a great golf tavern to hit up for a bar and pub food that were exceptional on this visit. All within 3 minutes walk from hotel.  I really want to give this place a one, but I can't because the food was edible. I would have loved to give it a 3, but the service was just blah.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VQbQI7bfShZWmr6DXu3QEw"
  },
  "Hlrg1ix3FgrBhqYdcMXsQw": {
    "date": "12/14/2011",
    "text": "It has been a couple of years since the last time I ate at Bisque (namely because the food was awful) and I'm under the impression that they have since had a bit of a re-vamp in the kitchen.  I would be tempted to give it another go, but there are just so many other good places to eat in the Bruntsfield area.  So, this review is really just about the drinks and ambiance.  Bisque is A-OK.  It's totally fine.  The staff are actually quite nice with a cheeky edge which is great, the drinks are completely fine if maybe a bit on the expensive side, and the ambiance... well it's reasonably beige but it's completely fine.  I hear that this used to be an old man's pub.  I really like old man's pubs.  Sure trendy places are good too, but I think ambiance tends to suffer when a place is neither quaint nor trendy... it just becomes... well as I said, beige.    Bisque is a completely acceptable place to go for a drink Friday after work, but it's not somewhere I would seek out for the fun of it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4UQfst9jve4GCSfWpWn2uA"
  },
  "HOQ76nP8dvo_LvTausKJiw": {
    "date": "8/23/2010",
    "text": "Whether you're after a drink, lunch, dinner, cakes, cocktails or teas and coffee you can find them all in Bisque. This is a recent discovery for me and it's definitely becoming one of my favourite watering holes in Edinburgh.   Bisque offers chilled out surroundings, comfy seats and an outdoor seating area too so excellent for those summer nights.   I haven't eaten here... yet, but I've had a shufti at fellow diners plates and the food looks top notch and it's very reasonably priced too.   Overall, an excellent bar/brasserie to while away an afternoon or evening.  Oh and it's worth noting that Bisque offers free Wifi. Hurrah!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CqkdpG2tkCPQA69umlAHsA"
  },
  "h4gfdAEaw98fjpNmpVx8KA": {
    "date": "6/14/2010",
    "text": "Hotel bars/bistros are well within the unknown band of watering holes and hangouts for students, at least they are to me anyway.   Discarding this preconception I found the garden terrace and top notch bar available at the Bisque great for an afternoons chill. The Bistro is apparently mighty fine too with the likes of confit duck and other modern dining fancies.  The garden terrace is worth the visit alone, not bad price wise either.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5SN8gQ_iY2G-R5ystcz2Jg",
        "caption": "Photo of Bisque Bar and Brasserie - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5SN8gQ_iY2G-R5ystcz2Jg/o.jpg"
      }
    ],
    "user_id": "UvIb5v3biEgcxWKnxf0ocg"
  },
  "14O7QHu9t05MBCekl1lbYA": {
    "date": "5/5/2008",
    "text": "A cool, lively and chic place to eat and drink in the bruntsfield area of Edinburgh. The interior is very stylish with a contemporary feel. There is a wonderful outside garden terrace to sit and enjoy a drink a meal or a coffee and sandwich. They serve all day food and drink and are open till late. The lunchtime menu offers salad buffets during the week and roast lunches on a weekend. They also have a very nice wine selection and there is also free internet access.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "25vWgsIA4HMx9Ep-TSbdOw"
  },
  "YXSzEj-umxXvOmZi-izirg": {
    "date": "6/1/2010",
    "text": "The food is not great here and is overpriced, wouldn't recommend it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ve44_TZjMKrjKauetKAEPw"
  },
  "x4uaB9yPmCfA5KhTz4zSaw": {
    "date": "8/13/2007",
    "text": "Bisque's best feature is the huge outdoor terrace on which you can enjoy your meal or drinks. The prices are very reasonable and food is served allday. The bar becomes more lively in the evening and is open until late.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vu2Y7kCTtxhNGmjzWMankw"
  }
}