{
  "mUv6O916r0CI0KzRav61nQ": {
    "date": "12/22/2011",
    "text": "I have to admit....I would not have normally contemplated a bar on Constitution St as a drinking option. Have to say this a cracking pub.  With a splinter cell of yelpers who had broken away from Victorias I foudn the decor to be really nice, staff seemed friendly enough. Nice seating areas and a \"dude on a guitar\" all good.  Importantly at this time of year for me they have a good malt selection so have to say while I am Leith resident I will be back!  JD = happy man!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "rl4hqDnywPJDCK4wfbXMzg"
  },
  "st9AvdJaqzyLnOz7Z3I42w": {
    "date": "4/8/2013",
    "text": "the plan was to go to brunch, but plans change and we ended up heading to nobles bar for a late lunch instead.  however, it was good to note that nobles serve their brunch menu until 4:30pm on sunday!! so anyone that wants some breakfast for lunch, this is definitely the place to go.    we entered the bar and it was comfortably busy for a sunday afternoon.  after checking with the bartender, we found our own seats and had menus brought over.  while brunch was on offer, i was more tempted by the awesome burgers they had on the menu.  i went for the black isle beef burger with blue cheese and mushrooms while the boy went for the rabbit burger with bacon and mushrooms.  it looked like they had a decent selection of beers on tap and in bottles along with a nice wine menu, however we just went for some soft drinks.  while waiting for our food, it was nice to sort of sit and observe the bar.  it's a cool layout, with a big main area in front of the bar, but then a nice little raised bit that has cosy tables and little stools. we were sat in the raised bit and i think this gave us a little extra privacy as there was only one other party there and we had a whole corner to ourselves.  the stained glass above the doorway to the toilets is also really nice and i liked the candles in empty spirits bottles as well.  food arrived and the burgers looks tremendous!!  a handmade beef patty encased in a nicely toasted bun with a good helping of tomato relish a whole portabello mushroom and melted blue cheese.  it was a very messy meal but the excellent burger was totally worth a well used napkin!!  the toppings combined perfectly and the beef patty was moist and very tasty.  and the hand cut chips...OMG!! these were actually some of the best chips i've had in awhile.  chunky with skins on and crispy, my glutton side wished there had been more on the plate!  my stomach thankful that there wasn't as this was a massive meal that certainly served as breakfast, lunch, and most of dinner.  my boyfriend was equally pleased with his rabbit burger which he throughly enjoyed although i did get to try a bite.  after paying, we managed to roll ourselves out the door but i think after this initial first impression we will be back.  hopefully to try their brunch offerings next time as if the burgers were this good, i'm sure the brunch will be equally as delicious!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z_xbO-Iaxbx-ZRPhLJK-Ew"
  },
  "BK8b8FIHG-mXEfF1_RcZ0Q": {
    "date": "10/24/2012",
    "text": "Very Nice Establishment. We enjoyed Dinner here which was simply a club sandwich and Duck sandwich, with bread and oil as a side, and we thoroughly enjoyed it. Great location too as not far from the shore. Service was good and very nice atmosphere. Loved the stained glass &  cosy, old fashioned interior.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "AnXbqBBa4tZ21RbPWpKoqg"
  },
  "SttFiAqDJPaicuOJvomG1Q": {
    "date": "8/28/2010",
    "text": "Headed down to Leith tonight with the aim of dinner and a quiet pint with friends. Saturday night and everywhere was full so worked our way round to Constitution Street and lo and behold Nobles Bar was open again and looking spick and span. Managed to get a table and order some food. Staff were really friendly and the atmosphere was very relaxed. Food was superb and very well priced and the beer was cold. Live music at 9pm had us sit longer than planned and a return visit is definitely on the cards. I hear they've revived the Sunday jazz brunch which is sure to be worth a visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "YOSGNjmUH1vSX9tScyVg_A"
  },
  "2eyzDlyTfGyWPuCUnZFKdQ": {
    "date": "10/4/2007",
    "text": "I really like this bar despite there being another 3 or 4 bars just on the same block! The first thing to strike me in this place was the decoration, they have gone for a maritime theme to keep in with the whole feel of the Leith Docks. It wouldnt be something I would imagine I'd like but its really beautiful to look at and the stained glass windows at the back are gorgeous.   There is a mix of people in this place but since its so well presented you dont tend to find any unsavoury characters in here and at the weekends the place can be quite busy but not so much that you feel claustraphobic.   They have live music every Thursday, Friday and Saturday night and its absolutely free. The layout of the pub means the band play from the raised floor area and you dont feel like they are intruding on your space or vice versa.   The bar also shows some live sporting events which isnt for me but they have the sound on at a suitable level so as not to disrupt other people in the bar.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ID4nZaOl74lYHL2ZHSAcQg"
  },
  "qisEHZ71yCYlP-t4rpI7KA": {
    "date": "2/2/2011",
    "text": "The food is good, the atmosphere is good, if you can get a seat on the big couches at the back then it's excellent. Although Nobles is a fairly large pub by Shore standards you can often struggle to find a seat as it's so popular.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xwJgGjg_GAMvd5HyO1Ajrg"
  },
  "5cHqCvLcBIxP775xTRd8EA": {
    "date": "3/20/2011",
    "text": "This was much more of a 'gastro' pub than I had expected! It was great to have so much activity and buzz going on, great staff and music and the food was stunning. What a stunning looking place too, I can really recommend it! Also try the Kings Wark or the Shore bar for something special!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g07XMQjXCCKhUzZ2LVQolw"
  },
  "_F5yRFLjwF-1MOQelYT08A": {
    "date": "7/27/2013",
    "text": "According to my mum, Nobles used to be a go-go dancing venue, so pretty dodgy! Suffice to say she was very impressed by how it looks today!  I've been to Nobles a few times (great eggs benedict) and so when last night my parents were through (bringing my sister to live with me for seven weeks...) and 'decent pub grub' was called for, Nobles seemed an obvious suggestion. My mum looked them up on Facebook and was surprised to see that Aberfeldy were playing there later (too late for us, but still very cool). And my dad's ears were pricked at the mention of \"rabbit burger\".  They didn't have any tables for 5, but we squeezed into a four near the back and managed to snag an extra table later when the couple next to us left. Gorgeous tables with 300 year old maps on them.   When it came to the menu, we were spoilt for choice. My pescetarian sister even commented that she almost never finds a menu where she wants nearly everything on it, but Noble's was ticking all the boxes. Scallops and a baked duck egg (served in a pot with creamed spinach, mmmmm) were ordered for starters and shared, and the 5 of us went for 2x tuna nicoise and 3x rabbit burgers for mains. Delicious, and such big portions! Big plus for the red onion coleslaw too (I LOVE COLESLAW). My dad said he wouldn't necessarily have been able to guess that it was rabbit, but that he did enjoy it nonetheless.  Oh, and the puddings were great too. The chocolate brownie was huge and frankly outstanding, and my lemon tart was a sweet treat too. Plus really good quality ice cream, which makes all the difference.  Nobles is brilliant, and the service was friendly and quick too. Suffice to say we'll definitely return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "Mqg4L8flJmg8pqeR-uYyRg"
  },
  "5LAPHbw2QWaKVRTpksVTGA": {
    "date": "7/29/2010",
    "text": "Nobles is a very classy pub, that much is obvious simply from its jet black exterior and the list of  upmarket bar food posted beside the door.  Inside, it lives up to this promise, as it is tastefully decorated with old-fashioned stained glass in the window, round tables and comfy sofas, a bar gleaming with expensive alcohols and careful details such as a frieze of ships around the ceiling.  When I went, there was an open mic night in full swing, and there was a lively crowd of people of all different ages and clearly all having a good time.  I'll definitely be coming here again, perhaps to check out their weekly folk night, or maybe just for a quiet pint in a mildly opulent setting.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "LIe-H70Dzb19O7sduu_2gQ",
        "caption": "Photo of Nobles Café, Bar &amp; Restaurant - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LIe-H70Dzb19O7sduu_2gQ/o.jpg"
      }
    ],
    "user_id": "N3J-41OHb87d-d395bMDmQ"
  },
  "lZuOhhRb6-M4R4YpOzoNaw": {
    "date": "4/1/2013",
    "text": "A visit to Nobles is worth it for the stunning interior alone. Gorgeous old Victorian building, tiled floor, stained glass, leather couches, brass, ceramic, beautiful.  They do a great job here of walking the line between cosy old pub and brunch destination du jour. They do a good list of brunch favourites with some more hearty and original dishes like shredded duck sandwiches and rabbit burgers. A couple of cask ales complement the decent on-tap beer selection. It's an excellent choice for a quiet drink or a stylish lunch.  My standard brunch of eggs benedict and Bloody Mary was excellent. Not quite able to knock Treacle off the top spot but very good nonetheless. I'll be back to try some of their other choices and will certainly include it on my list of staging posts during weekend afternoon rambles around Leith.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ixBoXpBL1JmKmcP1F2fTHA"
  },
  "tdSVDjhUGjs3Pm9nIq7MfQ": {
    "date": "2/10/2013",
    "text": "This is such a gorgeous pub, all cosy with dark wood, delicious-sounding menu choices, comfy sofas for drinks or tables with candles to eat. And good wifi! Yet it seems to have some sort of memory force-field at the door that means I leave and forget how much I like it, until the next time I stroll in and I think, \"oh, of course! This place is great!\" and then I leave and forget again.   So this is my Note To Self - Nobles is lovely! go there!  Not in the evening, though - unfortunately it suffers from the blight that is Live Music, and I can't be bothered shouting over some amateur guitar racket...   But in the afternoons, spot on! I'll be back soon. If I remember.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "g74l-c4UXDKTwHuScrO3sg"
  },
  "9N66yhatZ6VmzjOoAkiquA": {
    "date": "7/4/2013",
    "text": "I hadn't heard of Nobles until i reviewed it for Bite magazine earlier in the year and have to say, I've been back several times since.  The menu has a great selection of seasonal dishes and is clearly all made fresh and with care.  On a mission to find the best burgers in Edinburgh, i went for the Lothian rabbit burger with mustard mayo and gruyere (9.95)  (our waiter's recommendation) while Sarah went for the Black Isle beef with tomato chutney (8.95) option.  The rabbit was well cooked and seasoned and the buns used were truly excellent.  I liked the way they didn't just fall apart under a river of grease and added to the dish, rather than just be a vehicle for the meat element.  The gruyere added a slight nuttiness to the rabbit and the hand cut chips (you can also have fries) were equally as good as the burger.  Fluffy and light inside but nice and crisp on the outside, next time i'm in for a pint, I'll find it seriously hard to resist ordering a portion to nibble on.  Sarah's burger was just as well made and seasoned and great value for the price compared to some other places that charge slightly more but don't deliver on the quality as much.  Nobles is always spotlessly clean and a great place to sit and relax.  Toppling Nobles in my best burger quest will be no mean feat.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "lh1QIr8Bp8WOI1ws1tPZWA"
  },
  "s-qUD8ym0tUqk4cSe7sgsg": {
    "date": "5/6/2013",
    "text": "I had the eggs benny and my partner had the french toast. I would have given this place 4 stars but the french toast was hardly french toast. When you order french toast you expect a fluffy fat piece of bread with a coating of cinnamon, egg and nutmeg (or whatever other deliciousness). Nobles offered up a thinly sliced seeded piece of bread with hardly any coating at all. It seemed to me to be more like toast with a slight dusting of sugar.   Our friends both had full Scottish breakfasts which they loved, so if your going for that type of thing, this place does it good. The eggs bennedict were good but the bacon was so-so. I personally prefer canadian bacon or ham. Overall good stuff.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F0nFAY1Qi_7it_Q52n3nTw"
  },
  "v6XvrdeDGIvi0zj6a_4ghQ": {
    "date": "3/20/2013",
    "text": "I joined my fellow yelpers for Sunday brunch this week in nobles, which has been on my 'must try' list for a while. I'd heard how good their full Scottish brekkies are which is a favourite of mine! But...Damn! I had a lunch date to go to immediately after so I had to opt for a lighter brunch option. I felt greedy enough without shovelling a cooked breakfast in my face as well as lunch (which turned out to be a burger!) I watched with pure green-eyed jealously while David tucked into his full Scottish :(  My choice was the pancakes & bacon and I was disappointed. The bacon was lovely and crisp, just how I like it. No fatty bits! But the pancakes weren't good at all. Really tough texture, not fluffy at all, and I really hate to say it but they had a bit of a fishy taste...?!? Like they'd been cooked in a griddle that had some residual fish on it... Now i haven't eaten fish for over 20 years so this was particularly unpleasant for me. Not wanting to make a fuss I still ate the things, asking for a double helping of maple syrup to wash them down. I really don't know why I ate them really... I don't normally hesitate to send something back but i did give them honest feedback upon paying.   Anyway, there were lots of positives and I would go back. The atmosphere was nice, casual and a bit more up market than some of the other pubs serving breakfast at the shore. The Coffee was nice and strong and the service was pretty good considering we were a large group. It seems a great pub actually (fishy pancakes aside) and hopefully on my next visit I'll up the rating if my food choice is better.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S2islVfwCgNg3zfzxqty5g"
  },
  "n_xYw_EpEPsV6EynbbIS-A": {
    "date": "3/18/2013",
    "text": "Although I used to live a 20 minute walk from Nobles, I never actually visited it until I moved away from Leith.   I went for a drink one evening last year and it was packed but great fun. When we went for the Yelp brunch on Saturday I saw a very different side to it.   During the day it is very chilled and and nice to relax in. I would happily just go there for a coffee, their cappuccinos were surprisingly good. I had the Eggs Benedict to eat and it was great. It came with a really generous amount of bacon, the poached eggs were well cooked and the English muffins were fresh and soft.  The staff were also very friendly and helpful despite being faced with such a huge table of people, they coped just fine.  I will have to go back soon for lunch/dinner!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HV24bliLib6FuMW3bWBrpQ"
  },
  "DyxEzK3A4hG2Nkjr6Hmylg": {
    "date": "3/20/2013",
    "text": "So glad to be introduced to Nobles at a recent Yelp brunch. Gorgeous interior, inviting atmosphere. Will definitely keep it in mind next time I'm in Leith. It seemed like a great place to stop in for a drink, and brunch was definitely a hit, as well.   I had the full vegetarian breakfast, which was huge and very well done. I appreciated the big pile of spinach - a creative addition to the standard inclusions of veggie sausage, veggie haggis, mushrooms, tomatoes, potato scone, and eggs. (Did I leave anything out? I feel like I did. It was a lot of food.) Coffee was good, and the waitstaff kept the big carafes of ice water on our table full. I will never get tired of free ice water.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J_qpI2jCkwv7vPNz_9JeqA"
  },
  "Cfo429h0GVCDwPt1ClpbcQ": {
    "date": "11/23/2010",
    "text": "Having been in here on a night when I was off the ale I can't comment on the quality of the pints on offer but there is certainly a good number of taps providing a range of lagers & beers. The fridges looked to be holding an equally broad selection and the spirits gantry was similarly well endowed.   Neither can I comment on the food but I did make a point of looking over the menu and it looked good enough to make we want to remedy that issue in the near future. Service at the bar was good and the glass clearing, on what was a pretty busy night, was exemplary.   As mentioned below the interior is very nice (it has I think very recently been refurbished) and proudly displays aspects of Leith's heritage, maritime and otherwise.   The one negative note that was struck for me was that it is not an ideal place to have a band on if that is to be the centre of customers' attention. The \"stage\" area is barely big enough to hold a three-piece group so larger bands are forced out onto the floor somewhat which in turn can impede egress and exit from the building. A band as background accompaniment to a night in the pub rather than the focal point is possibly a better way to go.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "txzOZrHK9EVY0kYjSuXkKg"
  },
  "70-pYrUF_HrLfgh-FRV_tg": {
    "date": "9/9/2015",
    "text": "Had the lamb rump and two black porters. Delicious. Staff was very polite and on top of things as well. Good way to spend my first evening in Edinburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "VziRjUBWMQsLGMiaBczCQg"
  },
  "DEHCvzp0Hs8iALvkGD-Oqw": {
    "date": "1/10/2013",
    "text": "I've been a loyal fan of Nobles for a few years now. The bar is beautiful, with stained glass windows and original Victorian features and there's always a great atmosphere.  There's a wide selection of drinks, including many Scottish beers, ales & whiskies, and the food here is delicious. I headed along for New Year's brunch during Hogmanay and ordered their ENORMOUS full Scottish breakfast - it's a beast! The perfect fuel before a trek along the Water of Leith.  There's a pub quiz every Monday, but what I love most about Nobles are the regular live music nights, in particular The Jack o' Diamonds Scrimshaw Shanties night which currently runs every Wednesday.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AemMXa0hrlHWbp1oelDvnA"
  },
  "Fxaw8gEejumMMP2ZuCOkCg": {
    "date": "3/6/2011",
    "text": "After we finished our pint in The Constitution Bar, we headed over to Nobles Bar which The Man thought looked cool because of the big stained glass window in the front.  We walked in and it was MILES different from The Constitution.  Nobles Bar has gorgeous lofty ceilings, dark wood panelled walls, and a good number of tables dotted with the occasional comfy seat.  The stained glass window provides a wonderful focal point for the room.    Additionally, they have a great array of beers which the staff are more than happy to let you try.  I was trying a new beer whch I wasn't terribly keen on when a second staff member walked up and suggested a few others I might like.  Both members of staff were so lovely and seemed genuinely interested in my opinions of the beer and finding me one which I liked.    We liked the atmosphere, staff and decor of the pub so much that we decided to stay for dinner.  We each had a burger and I am happy to report that they were delicious, as were the hand cut chips and cole slaw which came with them.  We had all three members of staff ask us if we liked our meal, but not in an intrusive way, just in a genuine way.    Another nice plus with this place were the toilets.  The ladies, at least, was decorated with old framed post cards which are a hoot to read.    This place just wins so much I'm still smiling, and I am so jealous of the people who get to call this their local.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "4UQfst9jve4GCSfWpWn2uA"
  },
  "SAXGOkHwFFlRbrB1-rn5BA": {
    "date": "12/22/2011",
    "text": "Noble's Bar is an absolute find. I went there last night to a live music night which was fantastic. They have live music most days of the week, in fact. The atmosphere was great. I liked the fact people can be dressed up or casual in there.   The food menu looked really good but as we arrived about 9pm it was a bit too late to order anything. Lovely bar and good selection of drinks.  I really liked the stained glass windows, I think it has to be one of the nicest bar frontages I've seen down in Leith. I defintiely will be making more of an effort to go there.  They have an upcoming Hogmanay night which looks great for 15 entry, so would recommend that for anyone without plans for that time of year, as i'm sure it will be a great night!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eLdRbA_hHQUR6K3mqaB5yA"
  },
  "IsAe1a2KeZLY5SH7mrxZPg": {
    "date": "11/17/2011",
    "text": "The beer clip decoration suggests that this place likes to vary its real ale, despite only having a couple of pumps to play with. I had a nice pint of Red Mcgregor. There were also a couple of black isle organic keg beers that looked pretty interesting (so many beers, so little time). Child friendly can mean an ear violation and that was what was happening here. Only minus though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "89CBxRWFAaA1k2UufxVUCg"
  },
  "8KZiNG0pKD4MA09vx8iLrA": {
    "date": "12/22/2011",
    "text": "I had the pleasure of being introduced to Nobles last night for the first time, and what a treat I was in for.    It has been a good while since I ventured down Constitution Street and nobles has never really been on my radar, but once I entered I immediately seen what all the fuss was about.  This stunning Victorian Era bar doesn't look like much from the outside but it has a large bar area and plenty of seating - although the majority of it was taken when we arrived, despite being a Wednesday night, showing just how popular it is!  With so many of the original features intact and preserved, including staind-glass windows and carved wood everywhere, it has a massively authentic feel to it.  You can just tell that if you walked in 100 years ago, it would have been the exact same.  The bar had a great range of drafts beers and lagers, including many independent Scottish brewers which is always nice to see.    This place is all about its live music it seems, and with a great little stage at the front its well equipped to do this.  I believe they have live music every night, and last night was in the form of a solo artist with an acoustic guitar (with the occasional help of his pal, who provided light drumming on a box and washboard)  doing a range of covers that was a pleasure to watch but wasn't so loud that you couldn't talk over him if you just preferred background music.  I'm sure anyone living locally will already know and love this place but for anyone else, the decor, atmosphere, staff, music and drinks all make this place well worth venturing out the way for and one I will be making the effort to seek out again very soon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tQuEVOwokhp63Xl6wEvmqg"
  },
  "8Rmw3qSgjPjwx_eoh1-bOA": {
    "date": "9/18/2013",
    "text": "This is one of those mystery pubs that every says they've had an amazing time at, with fantastic music and a lively atmosphere. This is one of those pubs that every time I have been, have just been meh. The atmosphere has only once been what I classify as 'lively.' Every other time it's been incredibly quiet, especially given they have live music every night I believe. The music...well...has always been a bit dull. I'm sorry to say. I love melancholy music, and it's cool if I'm listening to it myself. But in a venue such as this it simply does not work. Firstly, it's quite big, and does an upside down 'L' shape, so anyone unfortunate enough to get stuck in the back, back, way back corner sees and hears nothing. Secondly, there seems to be some issue with the amps or voice projection or lord knows. They are never loud enough. Sometimes one can barely hear the lyrics. I'm no expert but perhaps the staff should sort that out for the musicians if they have no clue. Often times I could barely hear the what was being sung. I couldn't appreciate the musician and for that I felt bad for being bored. It was always such a disappointment as I'd often go in on a Sunday evening after having been at the Carrier's Quarters listening to the Jammy Devils, who are quite energetic and lively. It was always such a downer I'm sorry to say. I will say that the few times I have eaten the food has been really nice, and the staff are always really friendly when I go in. Of course I would go back, it's a nice enough pub...but this far I haven't been in about 5 months? I'm in no rush.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "GoJPBrs_xZmLiYPZrrzOkA"
  },
  "iJAh5YaMG9Pdmh6CkJfzbg": {
    "date": "6/10/2012",
    "text": "Visitors to Leith may only see The Shore, if so they are missing something...  Nobles is a bit eclectic (in a good way); on the outside it's dark, painted black with dark inset doorways and no clear windows to see inside, which at first glance makes the place look uninviting, but if you look again you will see the window is actually an impressive stained glass, the old fashioned looking pub sign hanging outside is actually a rather modern looking design of an octopus carrying a tray of glasses! Unfortunately if you step inside you'll not find any octopuses serving (at least I've yet to come across one) instead you'll be greeted by a cheerful, welcoming smile from one of the bar staff.  As you step inside you are likely to be pleasantly surprised at how large and airy the interior is, take a moment to look around the room. If it is bright outside you'll see the impressive stained glass window lets a lot of light in, more stained glass can be seen around the room. The high ceiling, ornate cornices and old wooden bar give an old fashioned Victorian feel, but looking again you'll see a mix of furniture and artwork around the room which adds to the eclectic impression of the outside.   The mix of patrons is also likely to be eclectic, depending on the time of day you may well see mothers and babies enjoying coffees and a light snack, office workers enjoying lunch or a post-work drink, \"bohemian\" students drinking modern bottled beers may be sitting at tables next to \"old pint drinkers\" or young ladies enjoying a glass of wine (NB. traditional stereotypes are used for descriptive purposes only ).   The range of drinks available will satisfy all tastes; including a wide range of whiskies and beers. Keep an eye out for the \"Black Isle Brewery; Nobles Pale Ale\" a lovely light ale brewed especially for Nobles Bar, if it is not available the chances are you'll likely find another gem of a Scottish ale in its place. Also look out for \"Fraoch Heather ale\" by \"Williams Bros. Brewing Co.\" a rare find \"brewed in Scotland since 2000 BC\". Whatever your taste; whether it be lager, ale, wine or spirits, draught or bottle you are likely to find something to suit behind the bar.  You are also likely to notice that at least half the patrons are eating. My latest visit was on a Saturday afternoon and glancing around the room I could see a variety of dishes being served including full cooked \"Scottish\" breakfast, burgers, fish and chips as well as bowls of olives and bread with oils. You'll find menus attached to small \"clipboards\" sitting on the bar and you'll see a mix of traditional dishes mixed in with less traditional and \"Nobles Specials\" (e.g. Chicken Ceaser Sandwich, Rabbit Burger or Nobles Beef Wellington). They serve a weekend \"brunch\" menu between 11am-5pm from which I chose the \"Eggs Nobles\", their own twist on traditional \"Eggs Benedict\" (which is also available); two muffin halves served with poached eggs on black pudding with a hollandaise sauce. The eggs were fresh and cooked to perfection, when my knife cut into them the bright yellow yolk melted out to mix with the delicious black pudding and soaked into the light fluffy muffin underneath, the hollandaise sauce tasted homemade and complemented the flavours nicely.  One last thing of note, Nobles is also a popular entertainment venue with a regular quiz night, \"open  mic night\", local regular bands and guest bands there is live entertainment available almost every night.  Well worth a visit for a quick drink, a light snack, a proper full meal or a good night out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jopbfOXmMI3GWcT4QCBXUA",
        "caption": "Photo of Nobles Café, Bar &amp; Restaurant - Edinburgh, United Kingdom. &amp;#34;Eggs Nobles&amp;#34; Muffin with poached eggs, stornoway black pudding &amp;amp; hollandaise sauce",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jopbfOXmMI3GWcT4QCBXUA/o.jpg"
      },
      {
        "img_id": "3V5L2_a0Hp6_6WvRCc8aGA",
        "caption": "Photo of Nobles Café, Bar &amp; Restaurant - Edinburgh, United Kingdom. Nobles Interior can get busy on a Saturday afternoon (or any other time too!)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3V5L2_a0Hp6_6WvRCc8aGA/o.jpg"
      }
    ],
    "user_id": "T_X-isv6-TBSoo-3t2vr6Q"
  },
  "BStchLSimW-i-L7nwpzX0w": {
    "date": "11/13/2011",
    "text": "Superb performance for Sunday brunch! Two massive fluffy pancakes, bacon cremated just the way I like it and a smothering of maple syrup. If it's socially unacceptable to lick a plate clean, then push me to the front of a post office queue and call me Roy Chubby Brown. The place itself is relaxed and has a strange old churchy smell about it. Tons of space and a huge bar that looks well stocked for a good night out. Coffee's good and service is reassuringly laid back. Prices are reasonable so all in all a pretty sound place to unwind after a hectic weekend. Would have gone all the way with 5 stars but it was a tad on the cold side heating-wise. Going to have to return for an evening meal and a couple of pints.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hpOJQWalhWC8Lp2tETE1dw"
  },
  "C-e-a18flgIDnm_N3rBTZQ": {
    "date": "4/16/2013",
    "text": "This is a fantastic bar, have yet to try the food and I cannot wait to try here again. There was such a relaxing feel about the place, which a bar should have. I've heard great things about the food (best brunch in town apparently) so I am really looking forward to get back here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "cji_twoHJv2uWz05Ade85A"
  },
  "4PFdw1bffyzNtjklygNGOA": {
    "date": "11/12/2018",
    "text": "We came here for dinner with reservations. We walked from Edinburgh center, which is a solid 30-minute walk.   First, the ambiance here is incredible. The interior has stained glass, dark wood furnishings, decorative ceiling moldings - it's incredibly British. Seating is very cozy with a warm atmosphere. I took a look at their beer list, and to my surprise, they had New England-style hazy IPAs on tap (currently the growing fad of craft beer in the U.S.). The beer list featured several local beers including some even from Leith!  For mains, our group ordered the fish & chips [A], picanha steak [A], and roasted cauliflower [A]. We all loved the food. The sauce for the picanha steak was exquisite. The plating for the roasted cauliflower was impressive as well.  Throughout the evening, we had excellent service. Overall, this was an incredible find!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "f271mv8bJzsk9TJVodV1Qg",
        "caption": "Photo of Nobles Café, Bar &amp; Restaurant - Edinburgh, United Kingdom. Hazy IPA on tap, Leith Juice, by local brewery Campervan",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/f271mv8bJzsk9TJVodV1Qg/o.jpg"
      }
    ],
    "user_id": "SUAFCKtkx8RrQ6EgJQIVrw"
  },
  "twZDxIi69xRJhr636ezf3A": {
    "date": "7/29/2018",
    "text": "We just spent a week driving around Ireland and a couple days now in Scotland. This is the best restaurant I've been to since we left home. Probably because it reminded me most of a hipster bar in Portland. They had a really good local IPA on tap (First World IPA). The bread they served was good, but the olive spread they provided with it made it a real treat. For dinner I had a rabbit and lentil salad. I haven't had rabbit in years and it took me right back to my childhood, but served on a bed of cold lentils and garbanzo beans, snow peas, fried baby corn and some greens, made it unique and delicious. If you're in town and want to get away from the crazy downtown area, give this place a shot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ANYMcZ_JbItlvFO6ZrKmtg",
        "caption": "Photo of Nobles Café, Bar &amp; Restaurant - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ANYMcZ_JbItlvFO6ZrKmtg/o.jpg"
      },
      {
        "img_id": "QVSTs1NnLWru5JG71JeaDg",
        "caption": "Photo of Nobles Café, Bar &amp; Restaurant - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QVSTs1NnLWru5JG71JeaDg/o.jpg"
      },
      {
        "img_id": "Up16egde64DbdJFPvc1iAw",
        "caption": "Photo of Nobles Café, Bar &amp; Restaurant - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Up16egde64DbdJFPvc1iAw/o.jpg"
      }
    ],
    "user_id": "_m9XJ2HpKyWV2Imth4VYHw"
  },
  "4SinCmuqDs4dwRTFRUGufg": {
    "date": "1/22/2018",
    "text": "Found this gem since I rented an Airbnb just around the block, and surely enough, their food were amazing and all their staff were pleasantly friendly!  Although their breakfast/brunch menu is top notch, was surprised by their burger. I thought I was generally spoiled with gourmet burgers in San Francisco, the Noble Burger was just next level! The beer cheese and bacon jam just makes it perfect. Their cocktails are pretty fun to try out too!  Personally I enjoyed my Irish coffee with their brunch menu. Just so good!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DR6kA7EWIiGIEMuXASJL2w"
  },
  "C2n8ZDNwRwVcfpWWOC81lg": {
    "date": "5/31/2016",
    "text": "Now this is what I'm talking about!  It's bad that I've only ever been here twice, but from now on this will be the place I suggest- if I get a choice!  They have a great selection of beers- my personal favourite is the inkie pinkie. And for only 2.30 per half pint I'd say that is a bargain worth having.  They have really gone that extra mile with the interior. From comfy cushions all the way to one-of paintings on the wall, there's something for everyone.  Definitely have to check this place out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cRnGUs9OhQ3biqVyVjZ6xw",
        "caption": "Photo of Nobles Café, Bar &amp; Restaurant - Edinburgh, United Kingdom. Having a casual Saturday night out with the girls, review of the night on its way",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cRnGUs9OhQ3biqVyVjZ6xw/o.jpg"
      }
    ],
    "user_id": "eXl0_ZA3kfL0MB2BKeDp0A"
  },
  "Y-YmPYO9M-BR9X0_rZdrLQ": {
    "date": "11/23/2015",
    "text": "A great pub in Leith. Fantastic scotch selection, great food, friendly staff. What's not to like :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2xeQSZfJvJ1fqcL6u-rBVg",
        "caption": "Photo of Nobles Café, Bar &amp; Restaurant - Edinburgh, United Kingdom. A great burger with a salmon nibble",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2xeQSZfJvJ1fqcL6u-rBVg/o.jpg"
      }
    ],
    "user_id": "eBVFtdxqTGdogezZ98HUsQ"
  },
  "SYWT5rxU3MWW4lGYZCwrQA": {
    "date": "8/9/2015",
    "text": "What a delightfully delicious little lounge! Stumbled upon this spot while in Leith and am so glad that I did. The atmosphere of the place is lovely and fresh right from the start - colorful chairs on the patio beckon you off the street, and then inside the bar manages to be bright, spacious and colorful while still retaining an old world feel, with beautiful wooden fixtures, intricate gold accents and stained glass windows. Lots of greenery adds to the chill and airy vibe. Plenty of cushions in loungy little corners ensure comfy and inviting seating, lending intimacy to any meal.   The menu and specials offer a variety of interesting options - something for everyone including even adventurous eaters. The rabbit rillette starter was an absolutely delicious standout - beautiful preparation and presentation, and the cherries atop were a delightful addition. Perfect order size for an appetizer and excellent proportioning of bread to content.   Staff were friendly and accommodating and food was speedy, which I especially appreciated as a lone eater. Was here around 17:30 so was more of a dinner and drinks spot than a bar at the time, but could certainly see it becoming good fun as night falls. Will definitely be coming back here to try more of the menu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "b_GEw7HWsKFsR-NwymmZsA",
        "caption": "Photo of Nobles Café, Bar &amp; Restaurant - Edinburgh, United Kingdom. Bright and comfy seating area :)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/b_GEw7HWsKFsR-NwymmZsA/o.jpg"
      },
      {
        "img_id": "FlSiPPvYiqqDbKb8E_lLNg",
        "caption": "Photo of Nobles Café, Bar &amp; Restaurant - Edinburgh, United Kingdom. Delicious Rabbit Rillette!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FlSiPPvYiqqDbKb8E_lLNg/o.jpg"
      }
    ],
    "user_id": "mY7AWgtA90KQXxKhFAhC5g"
  },
  "fhv4U2OCL5fQVx8KRwAuhA": {
    "date": "4/10/2016",
    "text": "Is it possible to lust after a restaurant? Because I absolutely love Nobles. I wish there was a special reserved 6th star to give restaurants in rare occasions when you need to express a superior level of 5-starness. I feel like I could eat at Nobles everyday and not get tired of the cuisine.   While on holiday in Leith/Edinburgh, we stayed almost outside the door from Nobles and I still think of this restaurant as my favorite part of the trip. Everything, from the staff to the service to the decor is truly exceptional. What looks like a quirky little pub from the outside will blow your tastebuds away. James Beard would slap his momma. It's that tasty.  On our first night in Leith, after having our first train cancelled, having to ride two hellish and long connecting trains up, and arriving an hour later than planned, we stumbled out of our rented flat and saw Nobles. We were tired, soggy, and famished. Nobles stepped in like magic. I ordered a seasonal menu item - a leek and brussel sprout gratin, served with a fresh tossed salad, and garlicky toast. The kitchen used fresh Arran cheese in the gratin, which is cooked in its own mini dutch oven until bubbling hot. The leeks and brussel sprouts were fresh and caramelized to perfection. I used my scrumptious toast points to literally wipe the pot clean. The salad was bright and beautifully acidic. A perfect complement to the cheesy gratin. I paired my meal with a unique Risling-Gewurtzaminer blended wine. It was heavenly.  A couple of days into our trip, we returned to Nobles for lunch. This time, we ordered lighter menu items to save room for dessert. Each day, Nobles offers a seasonal soup for 4.45. At this price we were expecting a small cup really. Wrong. It was a large bowl of incredible leek and potato soup. WOW. I've never had such a flavorsome leek soup. It was smokey, earthy, and spiced to perfection. The soup is served with two fresh sourdough toasts. After scarfing down our soups, we ordered dessert. I chose the carrot pudding, which is served with an orange fluff, grilled caramelized pineapple slices, cardamom gel, and CELERY SORBET. I am screaming celery sorbet because this is the stuff dreams are made of! Who the hell thought celery could taste like that?! My dessert was a True work of art. I can still taste it lingering in my mouth. I cry a lonely man tear thinking that Nobles is almost 5 hours away now.   Do yourself a favor and go (RUN) to Nobles.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "IV0bDIUKV9PtXUHMhG3djw",
        "caption": "Photo of Nobles Café, Bar &amp; Restaurant - Edinburgh, United Kingdom. Who knew celery (sorbet) could taste so good?! Carrot pudding",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IV0bDIUKV9PtXUHMhG3djw/o.jpg"
      },
      {
        "img_id": "kc9m-YTgRJZ980LRMhArZg",
        "caption": "Photo of Nobles Café, Bar &amp; Restaurant - Edinburgh, United Kingdom. This cat painting is everything",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kc9m-YTgRJZ980LRMhArZg/o.jpg"
      },
      {
        "img_id": "pMWFpfXg_NSqkC6uRiV54g",
        "caption": "Photo of Nobles Café, Bar &amp; Restaurant - Edinburgh, United Kingdom. Soup of the day: potato and leek. Incredible!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pMWFpfXg_NSqkC6uRiV54g/o.jpg"
      }
    ],
    "user_id": "6Yc5XlWj1F3dTckeTEQyIQ"
  },
  "RNcbjbGSXYmCKlKU17_dJA": {
    "date": "4/7/2016",
    "text": "It's a testament to the excellence of a restaurant when they earn my repeat business when I am only in town for a handful of days on holiday. Nobles Cafe Bar is such a place, where I was so happy with my dinner there that I stopped by for lunch the very next day.  Nobles is sited in an old victorian pub on Constitution Street in Leith. Many of the original features remain, and have been met with the addition of various paintings and nautical bric-a-brac recalling the heritage of the area. It's a decidedly old world feeling evoked from the inside and out. I can almost imagine a crew downing a few pints here back in the day before setting out to sea.  The cafe bar prides themselves on locally sourced ingredients. This means the freshest produce awaits with an ever changing line-up of specials. The ethos also extends beyond food, as this is the place that introduced me to Scotland born Inveralmond Brewery and their excellent Marzen, one of the best you can find outside of Munich in my opinion. My first time at Nobles was also my first night in Edinburgh. Brittany A. and I dined for a late dinner at 9PM. The menu is varied and clever, and there are many options for vegetarians. I ultimately settled on their falafel burger, which comes with a side of fries (not chips). It was crazy delicious, and reminded me of a falafel burger I used to get at a Mediterranean greasy spoon back home. If you haven't had one before, imagine a traditional falafel in patty form with burger accompaniments. The burger portion and fries are so large that despite a full day on foot I could only manage half of the burger.  The next time around I was able to try the impressive lunch menu. A giant bowl of vegetarian potato-leek soup with bread can be had for 4.50 and is more than enough for a quick meal. Overindulgence is a hobby for me, so of course I also opted for dessert, this time an affogato. In terms of presentation it was a deconstructed plate of gelato scoops, biscuits, and a shot of piping hot espresso. The coffee here is done with expertise, so this was a pudding worth the calories.  Nobles Cafe Bar is a triumph for the gastropub concept. My only complaint here is that I didn't have enough time on holiday to try their brunch menu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "W5FNm4c-eBcMSmZR-JGB4A",
        "caption": "Photo of Nobles Café, Bar &amp; Restaurant - Edinburgh, United Kingdom. Affogato, surprisingly splendid presentation.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/W5FNm4c-eBcMSmZR-JGB4A/o.jpg"
      },
      {
        "img_id": "r3kLa1GhbiiQrrdYAMKH8g",
        "caption": "Photo of Nobles Café, Bar &amp; Restaurant - Edinburgh, United Kingdom. Huge bowl of potato leek soup and bread for only £4.50.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/r3kLa1GhbiiQrrdYAMKH8g/o.jpg"
      },
      {
        "img_id": "6m-NTG5Dj2-3NX9rJtY24g",
        "caption": "Photo of Nobles Café, Bar &amp; Restaurant - Edinburgh, United Kingdom. View from the window table.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6m-NTG5Dj2-3NX9rJtY24g/o.jpg"
      }
    ],
    "user_id": "E5Ed11HJ5HvI8ZdtbFVzAQ"
  },
  "l6h7s0AX7Bo_9NRj9Oe2Mw": {
    "date": "2/14/2016",
    "text": "Great service,Great Staff, even better fish and chips!  Hella cool pub with cool decor and fireplace that sets the tone for a nice and cozy quaint evening not to mention a break away from the hustle and bustle of the city.  Needless to say that when I return to Scotland that this place is definitely on my itinerary.  As the locals say,  cheers",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "xqBHMhUHZ8S9FNXHdTcJlg"
  },
  "glLcp4nh3Rep_fh22T_09g": {
    "date": "4/7/2018",
    "text": "Good friendly service, pleasant mix of classic pub design with dark wood and stained glass alongside artistic new pieces, including some nice charcoal portraits, and fantastic food. The steak and eggs meal was excellent, the steak topped with pesto and served with fried tomatoes and potatoes. The hot chocolate was very enjoyable. Bathroom was cute and clean.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sZ7Yj68IqrPXVSs0hsfUJg"
  },
  "7M7R9QW0s4ulrJghaXxbJQ": {
    "date": "6/24/2017",
    "text": "Wow, what a great place! Cool decor, lovely staff and the food was stunning with delicious flavour combinations. We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gJ5RTpP-Psee4xLVnnzG8g"
  },
  "Z8N7gdUcPC3i72sdliB1dQ": {
    "date": "12/12/2015",
    "text": "I like this bar. Has the feel of somewhere traditional in terms of wood paneling and stained glass but with a contemporary twist with gastro food and beer.  It's an Edinburgh-wide favourite for brunch with an extensive range available all weekend. Full Scottish, Eggs Benedict, steak sandwich with chorizo and chili scrambled eggs a favourite of mine.   Improved beer selection in recent years with the mark of excellence being a Tempest tap (Long White Cloud etc) with good guest ales (Fallen, Cromarty etc).  Friendly enough staff. WiFi.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xRwovXww6hWhQWJg3WpdbA",
        "caption": "Photo of Nobles Café, Bar &amp; Restaurant - Edinburgh, United Kingdom. Great for food and coffee during day",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xRwovXww6hWhQWJg3WpdbA/o.jpg"
      },
      {
        "img_id": "XgTVWIafw2cwNpnNxAmBxg",
        "caption": "Photo of Nobles Café, Bar &amp; Restaurant - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XgTVWIafw2cwNpnNxAmBxg/o.jpg"
      }
    ],
    "user_id": "9y8q3wSNJKkk3zDj67w1WA"
  },
  "UpaiyL4YYRKcyQvg4E1vYg": {
    "date": "8/3/2015",
    "text": "Brilliant brunch menu!  Went for a breakfast hangover cure and Nobles definitely hit the mark! I opted for the Scottish breakfast, swayed by the Stornoway blackpudding and Findlays haggis this is a quality breakfast - cooked beautifully! My friends ate the steak sandwich (which looked lovely) and eggs Benedict & Florentine - poached eggs were amazing (something I am very fussy over!)   We also went for a cheeky little bloody Mary -  when asked if they served this they said 'oh yes! we do a very nice bloody Mary!' - they were not wrong!  All in all a great brunch! - friendly, obliging staff, pleasant interior with contemporary and traditional features, Nobles is a brilliant wee bar!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "8M2Ladv1AIAUVwoOzxX3VA"
  },
  "80o6RaRmkI4qLM_NR8FZ5g": {
    "date": "3/3/2015",
    "text": "Writing this review seems to be troubling me. I don't think I can actually find fault with Nobles in anyway, but I also can't bring myself to give it 5 stars...  It's a really cool bar, gorgeous stained glass everywhere. The bar serves a decent spread of everything, no claims of craft this or artisan that but definitely far from poorly stocked. The food here is bloody excellent. I was with my family a few weeks back and everyone loved their food. I had the pork burger and it was mad tasty.   Clearly I have mad high standards for bars these days, because I really can't find anything I dislike about Nobles, but I appear not to have a huge amount to say.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "U55y_61paae1f6r6vgITJw"
  },
  "ybOqOihv8aZhtcwi04tt5A": {
    "date": "7/28/2017",
    "text": "Excellent service, we were lucky enough to get Nat(the manager). Good selection of local beers, tasty menu!  We will be back!! Fun location and great all around vibe!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ucMvB9HQCIxncCJ1r0ZJYQ"
  },
  "CfnO5Z13vZLkJIAZuqNQEw": {
    "date": "3/17/2013",
    "text": "Awesome Glass Window and Bar - Centerpiece!  Today I enjoyed another brunch with my fellow Yelper's.  Nobles Bar is located in Leith, Constitution Street and easy accessible by public transport.  I really like the pub. It's cozy. There are couches, areas for groups, areas for dates! In the middle you can see a bar that seems to offer lots of drinks, even Symonds Cider from a pump.  As soon as you enter the place you will notice the massive colourful glass window. Just, WOW!  I ordered pancakes breakfast and did not particularly fancy the rough texture of the pancakes, such I did not eat much. My loss of appetite was noticed by the very attentive staff and it was decided that the food was taken off the bill. What a nice gesture.  It is such a lovely pub and I will definitely be back. You need to experience it yourself.  I was back and my Salmon Eggs Benedict and they were awesome. Upgraded to 5*!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZZ-LhDl3WJ9RhpnzM5Ijqg",
        "caption": "Photo of Nobles Café, Bar &amp; Restaurant - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZZ-LhDl3WJ9RhpnzM5Ijqg/o.jpg"
      },
      {
        "img_id": "Tblts6KMX56GVUDZw8exJg",
        "caption": "Photo of Nobles Café, Bar &amp; Restaurant - Edinburgh, United Kingdom. Super Bar",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Tblts6KMX56GVUDZw8exJg/o.jpg"
      },
      {
        "img_id": "9k7_tYjKgFmbYKC6mCkJhA",
        "caption": "Photo of Nobles Café, Bar &amp; Restaurant - Edinburgh, United Kingdom. Nice Glass Window",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9k7_tYjKgFmbYKC6mCkJhA/o.jpg"
      }
    ],
    "user_id": "s85sNAMlsrI0xCRvfj7Jrw"
  },
  "1Rph86AFi_JQDNlbmC8eYQ": {
    "date": "9/7/2015",
    "text": "Wonderful experience in all aspects.  A very charming, gastropub style, with terrific atmosphere.  We had several appetizers, and all had different mains.  We loved them all.  Service was very friendly, and terrific.   I would highly recommend, and certainly return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "Y0qhtu7hHefyYctCLpExTA"
  },
  "xhv0FhGbQ3CPAMk3oY7JGA": {
    "date": "10/24/2014",
    "text": "I don't visit here very often, even though it is close to where I live. I do tend to take visiting friends and family here for a spot of Breakfast / Brunch. We also had a brunch here with a couple of friends and I was not disappointed.   Their pancakes and frensch toast are not too bad, but I did have had better in quite a few other places.  The atmosphere here when going for a pint is not what I look for, a little too.. 'brown pubbish' - nothing wrong with that, but to me too old fashioned - and the only way I like that is when served as a cocktail.   People behind the bar are friendly, but sometimes a little slow in serving, but that could also be the kitchen in that aspect.   In all; not a bad pub, but not my cup of tea.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fKi8ZF3xpJJkgSusRubeMA"
  },
  "QQvbNltHfEN3wgYTKMCsKA": {
    "date": "6/19/2013",
    "text": "Amazing Leith bar, quite simply everything you could want from a local and thankfully it is mine! The beautiful interior is inspired by the maritime Victoriana in keeping with the location.  Look around a you'll see pretty stained glass windows, comfy large bar seats, ship murals up high, chesterfield sofas and eclectic vintage framed pictures clustered on the walls.   Nobles hold a pub quiz on Mondays, open mic night on Tusdays, live bands all week in the evenings, super friendly staff and customer alike. I've never eaten in here but always heard good things about it from friends.  Go and visit, you won't regret it.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "1-dmQknIfIwZ6rmXk5r0pA"
  },
  "viUuhljZ54CTWzujBxAq4w": {
    "date": "12/28/2016",
    "text": "This was our favorite restaurant in Edinburgh. We walked the Leith Walk from Calton Hilll and were hungry and cold and in search of a beer and a meal. We are so happy we found this place -- it checked all the boxes -- the casual but unique decor, the friendly wait staff and the outstanding food. Had the Cullen Skink, Moules-Frittes and fish & chips and they were all excellent. Kudos to our wonderful Canadian server and Hugh Jackman look-alike bartender.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4F8wanxS9ny3qGJDuSA38Q"
  }
}