{
  "YJWHQFybmyhZTGguXoISOA": {
    "date": "6/21/2019",
    "text": "Excellent food. Big portions. Friendly staff. Finally was able to get some spice in our food while visiting here (British food we have found is much too bland). Very convenient little place. Definitely recommend especially if you are staying at one of the B&B's nearby.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vip13qilhmLuBJhqLpnVhg"
  },
  "SD27b5AumxNCKqyT1ilhqA": {
    "date": "9/3/2019",
    "text": "There isn't any other competition in this stretch of B&B land, so this place does a roaring trade in both sit-in and takeaway.  We only had a couple of basic vegetable curries so I can't comment on the rest of the menu, but what we had was very good 'standard' curry fare. I would say that they were a bit mild compared to other places I've been to in Edinburgh, but maybe they are catering more for tourist tastes?  We did have to wait a bit for our meal as they were in full take-away mode, but that's to be expected at peak times I guess.  The decor is fresh and modern, the staff were cheery and helpful. What's not to like?",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8W-1w3jvjRQ2BGxaZ5FQhg"
  },
  "pHOIuLN_mw90eCKSW_H9HQ": {
    "date": "6/4/2018",
    "text": "Fantastic! I loved their lamb rogan josh, the best I've had in the UK. Nice decor, friendly staff, reasonable prices. My daughter said her chicken tikka masala was also very good. We all liked the music. The mango lassi was also very tasty!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dboQIdCtZuV4j7rTkmhNdA"
  },
  "HukAbfIlBEUYurvn5pegBw": {
    "date": "8/26/2016",
    "text": "Took a chance as this place is directly across from International Guest House and I was tired and hungry. The Silsyla Lamb was tender, rich, flavorful. Mild enough for my tender palate. Exquisite basmati rice pilau. And the essential Cobra lager.  Attentive service and a good range of beverages offered.  I was worried because I was the only diner at 7 o'clock on a Friday evening, but by the time I left, nearly half the tables were full and many delivery orders had gone out.  Perhaps a little expensive, as everything including rice and naan bread is priced separately, but extremely satisfying.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gQ0V-jQ-xoewC705B3VeTw"
  },
  "fjfBSh0g0pdIrnhC4Jhaqw": {
    "date": "8/28/2010",
    "text": "A couple of weeks ago, my friends from uni came back up to Edinburgh and we ordered a take away from here, before heading out for a night on the town and we all agreed that Delhi Diner offers a great selection of food and is very tasty. Even my vegetarian friend was able to find he had a good selection to choose from.  The food we ordered came very quick, although it was a Thursday night, and I'm sure the chefs wouldn't have been inundated with orders. I ordered a couple of papadums and a chicken Korma, although I normally go for something hot, I hadn't had a korma in a while and was pleasantly surprised at how flavoursome this one was. I ordered a plain naan to accompany my meal and this was good too, not too greasy unlike other restaurants that I have been to. The price for all of this was around 13, which is about average, so considering the portions you get and the quality, I would definitely order again from here.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ysiK5ANAY37Il0TdEQ-iJw",
        "caption": "Photo of Delhi Diner - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ysiK5ANAY37Il0TdEQ-iJw/o.jpg"
      }
    ],
    "user_id": "hutJzKEYHuVq6CP-XSARgg"
  },
  "cQGmdeWhOdhNKw0o9rTVOw": {
    "date": "5/7/2011",
    "text": "I've recently been back to the Delhi Diner and it was really good.  The service was attentive without being intrusive, the food was delicious and they have big bottles of Cobra beer! What else could you ask for???  Definitely will go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zF-hK3107dbCR9vW_kRTWg"
  },
  "HdCot_qz8umpb60k6Gaf4A": {
    "date": "8/24/2011",
    "text": "I have had a nice Biryani dish for dinner at this restaurant although the composition of the vegetable dish was not what I was expecting. Friendly and attentive personell and a ginger Nan made to my order (as it is not listed on the menu).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qqpRnzKXxyt490d1u5_E_w"
  }
}