{
  "ByrJxPFEN1FpdklxkUfVGQ": {
    "date": "9/17/2019",
    "text": "Great cafe with a lot of veggie/vegan options and fair prices. The interior is also cute! Not too crowded.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "taLvTjUgEosIB8hKuCungA"
  },
  "wIGcTwGQNgKIU1Ug0RZGWA": {
    "date": "7/21/2019",
    "text": "Yes - run don't walk here!  One of our favorite lunches (and dinner later in the week) during our stay in Edinburgh!  Fresh beautiful ingredients in a casual cafe atmosphere.  We had several of their incredible salads - so fresh, great combos and something for everyone in our group.  I want to recreate the falafel salad at home, but I know it won't compare.  Well worth going to if you are local or a tourist.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lfy-eyWCPADKx3QHx973XQ"
  },
  "x1kS6gvVfFtFWkklMonIHA": {
    "date": "9/8/2018",
    "text": "Had the coronation chicken panini (never had this flavor before -- try it, I liked it!) Good scotch broth soup, and a hot cup of tea. Definitely worth stopping by for a bite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9qe3g6wOL4qlanxjRYOcGQ",
        "caption": "Photo of Let Me Eat Too - Edinburgh, United Kingdom. Coronation chicken panini -- quite nice!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9qe3g6wOL4qlanxjRYOcGQ/o.jpg"
      },
      {
        "img_id": "5Xsb8qm0qdAgoHqI4_M3KA",
        "caption": "Photo of Let Me Eat Too - Edinburgh, United Kingdom. Scotch broth soup",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5Xsb8qm0qdAgoHqI4_M3KA/o.jpg"
      },
      {
        "img_id": "ezwPijXRGc66noNjB2Hfsg",
        "caption": "Photo of Let Me Eat Too - Edinburgh, United Kingdom. Stopped in for tea and some early dinner!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ezwPijXRGc66noNjB2Hfsg/o.jpg"
      }
    ],
    "user_id": "_xOdmTjFANEnXB75t2vhZQ"
  },
  "RLNoErA94F1X_hLTFI-K5A": {
    "date": "8/30/2019",
    "text": "Food was okay and service was meh. Hot sandwich was not heated all the way through. Milkshakes were good though. Convenient location.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_yW14n7WZxkTUbzC1aT3aQ"
  },
  "DcLBD37sRg0jVTs0JGpHkg": {
    "date": "7/19/2018",
    "text": "This wasn't where we planned to eat lunch, but I was glad our plans changed! The lentil soup was delicious. A nice coconut taste but not overpowering. The bread accompanying the soup was fresh and had the right soft/chew combo. I tried the roasted vegetables and pesto salad (vegan). The argula had a nice bite. The pesto was flavorful. Everything worked. My husband had the same but in panini form and licked every crumb from his plate. The final treat? Vegan haggis kettle chips! Our only bummer was requesting tap water and it never making its way out to our table. Too American? It wouldn't stop us from eating here again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "o9-3t3sAm2jfrVn1RnFI8g",
        "caption": "Photo of Let Me Eat Too - Edinburgh, United Kingdom. Roasted vegetable and green pesto salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/o9-3t3sAm2jfrVn1RnFI8g/o.jpg"
      },
      {
        "img_id": "F07eNLP8qDN8Lcm_ZmrNbA",
        "caption": "Photo of Let Me Eat Too - Edinburgh, United Kingdom. The vegan lentil soup",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/F07eNLP8qDN8Lcm_ZmrNbA/o.jpg"
      },
      {
        "img_id": "8GLrorffx-jsB8urdSYpuQ",
        "caption": "Photo of Let Me Eat Too - Edinburgh, United Kingdom. Yes, vegan haggis crisps! They were quite good.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8GLrorffx-jsB8urdSYpuQ/o.jpg"
      }
    ],
    "user_id": "heqTI8irYORwYrdwtOzYJQ"
  },
  "vmF4V4q8D8A0cQONtdaM4w": {
    "date": "3/10/2018",
    "text": "Second Latte of the day... great eats menu, staff cares about your enjoyment of the food, small space, big hearts, share a table with someone you wouldn't have met if you'd passed this place up.   Photos of half eaten food = eating trumps photoshoot",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HgfO4wzYtdh48uXzZtL3UA",
        "caption": "Photo of Let Me Eat Too - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HgfO4wzYtdh48uXzZtL3UA/o.jpg"
      }
    ],
    "user_id": "ccAlP6VmI7uK2EpbZgJpWg"
  },
  "JjL-QbB7tqmx5XGwl4fgRw": {
    "date": "5/15/2017",
    "text": "Delicious and affordable food and drink!!! Vibrant inside! Comfy seating! Funky music! Free wifi! Quick and friendly service! Hands down, this place is in my top three favourite cafes to visit in Edinburgh!!! HIGHLY RECOMMEND!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kFyahmzd8_J7Gws_m59liA",
        "caption": "Photo of Let Me Eat Too - Edinburgh, United Kingdom. Street view",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kFyahmzd8_J7Gws_m59liA/o.jpg"
      },
      {
        "img_id": "qEUef6NgYjg5i-nqe8ARBw",
        "caption": "Photo of Let Me Eat Too - Edinburgh, United Kingdom. Go in! You won&amp;#39;t regret it!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qEUef6NgYjg5i-nqe8ARBw/o.jpg"
      },
      {
        "img_id": "JB6RDIs2pQx_wGdtPcVNrg",
        "caption": "Photo of Let Me Eat Too - Edinburgh, United Kingdom. Cute inside!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JB6RDIs2pQx_wGdtPcVNrg/o.jpg"
      }
    ],
    "user_id": "1wgdfrsfieIl5OiZd1eHJw"
  },
  "PRQm10COQ2joIEv0EgmF7w": {
    "date": "9/23/2018",
    "text": "Found this little gem in Edinburgh on our first day here and loved it so much I've been back 3 times in my short 4 day visit to this beautiful city. The ambiance is quaint, the music is gives a chill vibe, and the food is incredible! If you're looking for a fresh hot bowl of soup this is the place to go! I had the meatball soup and it was to die for! They also have a wide menu selection of paninis, wraps, and salads...also all very good! Definitely worth checking out if you're looking for a good soup and sandwich combo.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0oD6EcSLKlisdkpinva-Xw"
  },
  "z1lYadW6AOlTULMEjT4zTg": {
    "date": "1/31/2017",
    "text": "Great cafe vibe and everything I ate was good.  Definitely would come back here again and again if I lived nearby.  I tried the haggis and chicken panini - I wanted to try something more \"Scottish\" and this was a weird combination I hadn't seen before.  I was actually disappointed when it arrived because I forgot I ordered a \"strange panini\".  But it turned out pretty tasty!  A bit too much haggis for my liking, but tasty!  I also had some of their soup - a mix of potato, corn, and other delicious things.  Also had an espresso shot to keep me going.  I don't often drink espresso, but it tasted good to me!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yLNefPP81SxLJb00WGoZSw",
        "caption": "Photo of Let Me Eat Too - Edinburgh, United Kingdom. Espresso shot",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yLNefPP81SxLJb00WGoZSw/o.jpg"
      },
      {
        "img_id": "DgusExHyFcaNE0kC5ZqDmQ",
        "caption": "Photo of Let Me Eat Too - Edinburgh, United Kingdom. Haggis and chicken panini.  Check out the crust with cheese!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DgusExHyFcaNE0kC5ZqDmQ/o.jpg"
      },
      {
        "img_id": "Tl0-0B81beGQHGtwlSuG1w",
        "caption": "Photo of Let Me Eat Too - Edinburgh, United Kingdom. Potato and corn soup",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Tl0-0B81beGQHGtwlSuG1w/o.jpg"
      }
    ],
    "user_id": "K-xjdtUCMmQPeAa5bBIj2Q"
  },
  "5SLfhqb5dDnyieTNSsPtkg": {
    "date": "3/23/2018",
    "text": "Love the location (right on the corner of Grassmarket) and the prices for a filling lunch. Food is about average. I had the panini with chicken and mozzarella. The chicken had zero seasoning; the panini sort of tasted like nothing. I think I just ordered the wrong thing, because everyone else's food looked much better. Lots of options on the menu. Staff and atmosphere are an A+. I'd recommend for a relaxed lunch or snack.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R9O3vnu_qW1NUHb8fHvyLA"
  },
  "NX_18RLmemEOIKW7WOp5Pw": {
    "date": "9/11/2017",
    "text": "Got the roast aubergine wrap and spinach/feta-triangles. It was really good, the wrap was warm and delicious, a bit greasy so make sure to eat it over the plate. The spinach triangle was very yummy, will get it again. The wrap was made fresh on the spot, you can see the kitchen where it's made. The place was nice, it had a good atmosphere. Very vegan friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rstyn2LjffqvKb3d9Z-YcQ"
  },
  "thUO0Hojv8WDjqg0wIfMrA": {
    "date": "6/3/2017",
    "text": "I came here with friends for a tea, great service & good music ! The atmosphere is cosy and the decor is really nice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1k7SwabcQHY6uKXDIbd-Sw"
  },
  "cuSWW2rzxpzulX6hoGsGeQ": {
    "date": "4/5/2017",
    "text": "Best Panini and Roast pepper wrap I've had. Super affordable and very customer friendly. I'm from the United States and I will come back to Scotland just for this restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IL6VMjXJGb6yO5u5OmcwWA"
  }
}