{
  "Y0GHLZQZlNsMenmaUHXJDw": {
    "date": "9/6/2019",
    "text": "This was a great choice. Nice ambiance and super friendly service.  The meat was great and they had different sauces to choose from.  Definitely a return to place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oMU0HtEICGeepytdEEWq5Q"
  },
  "d3jj8JqfYRDE-eMSWYstKg": {
    "date": "2/19/2018",
    "text": "A great steakhouse to come and have a burger, salmon, fish & chips, or a nicely cooked steak. My party enjoyed all of the above on our first night in Edinburgh. We walked in from the cold on a Monday evening and were promptly seated in a large, comfy booth. The booths that run along the back facing an open kitchen are a little bright, so if you're looking for an ambiance with dim settings, you might want to sit elsewhere... the atmosphere \"feels\" fancy but it's not stuffy and actually very casual.  In addition to the main entrees I mentioned, we also shared the cheesy garlic bread and sharing board, which is basically an appetizer sampler. The duck wings were surprisingly good (I generally don't like duck)! For my main entree, I had the 8 oz ribeye. The steaks all come with a wedge salad, onion loaf, fries, grilled tomato, and your choice of steak sauce (I chose peppercorn) and dressing for the wedge (Stilton blue cheese - always!). This was a GREAT tasting steak. And for 23 quid, it's a steal at a steakhouse.  They also have a kids menu which offers 2 courses for 6.95 or 3 for 7.95. My little one just had 2 and got the chicken lollipops (chicken nuggets - which was really quite good) w/ fries & coleslaw and dessert (ice cream).  Service was prompt and very friendly. Total for 2 starters, 5 entrees (including one kid's meal), a moderately priced bottle of wine, 2 beers, 2 desserts - 165 pounds BEFORE tip. Can't complain at all...",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "k12mb3FK_SPXHrCRgD1beg",
        "caption": "Photo of Miller &amp; Carter - Edinburgh, United Kingdom. Indulgent Tasting Board - Mini crème brulee, chocolate pot &amp;amp; a lemon &amp;amp; clotted cream posset tart. Served w/ vanilla bean ice cream",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/k12mb3FK_SPXHrCRgD1beg/o.jpg"
      },
      {
        "img_id": "E3dPD2thmm6A4SQio2QJCg",
        "caption": "Photo of Miller &amp; Carter - Edinburgh, United Kingdom. The Sharing Board - Beef meatballs, chilli-hoisin glazed chicken/duck wings, beef barbacoa mac &amp;amp; cheese, nachos, and garlic ciabatta",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/E3dPD2thmm6A4SQio2QJCg/o.jpg"
      },
      {
        "img_id": "g0605D_y0yZfEFppWv8mxQ",
        "caption": "Photo of Miller &amp; Carter - Edinburgh, United Kingdom. 8 oz ribeye, peppercorn sauce, onion loaf, fries, &amp;amp; a wedge salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/g0605D_y0yZfEFppWv8mxQ/o.jpg"
      }
    ],
    "user_id": "UH6RCH9K1o2VW3CU8PY5iQ"
  },
  "MuEKocdbq-a_004l1AO0NQ": {
    "date": "11/2/2018",
    "text": "Fancy looking restaurant. We tried to have dinner here 2 nights in a row but they were booked until 10pm. That's when we decided to make reservations.  The menu is very diverse and the food tasted great. Even when one of us ordered something what happened to have pork on it, they took it with no hesitation and came back with a new plate.  Child friendly also",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5hXmbOIZj46Oehz2GYfF3g",
        "caption": "Photo of Miller &amp; Carter - Edinburgh, United Kingdom. Absolutely delicious",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5hXmbOIZj46Oehz2GYfF3g/o.jpg"
      },
      {
        "img_id": "hFN0n24apBdvPNigBqWWVg",
        "caption": "Photo of Miller &amp; Carter - Edinburgh, United Kingdom. When the kids likes it, best believe it&amp;#39;s good!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hFN0n24apBdvPNigBqWWVg/o.jpg"
      },
      {
        "img_id": "n6Rz1fupJ36nCfkO0vSBZA",
        "caption": "Photo of Miller &amp; Carter - Edinburgh, United Kingdom. Yummy starters. Garlic bread and tortillas",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/n6Rz1fupJ36nCfkO0vSBZA/o.jpg"
      }
    ],
    "user_id": "xeyOJ274mqTRxNgaBigerw"
  },
  "0GO9yuZjSZMA92qsLn4hTw": {
    "date": "5/6/2019",
    "text": "Do not be lured inside thinking this is a True steakhouse!  If you're from the states then you will immediately get it when I say that this restaurant (defined loosely) is on par with a Sizzler or Red Lobster. Really hyped nonsense and if you get fooled into going as I did you will get a thin poor excuse for a steak that tasted like it was made last week and then thrown on the grill when I unfortunately ordered it.   Don't get me started around the craziness of ordering the sides. There really aren't any - for example I didn't want potatoes or rice so all I could get was iceberg lettuce wedge twice!  This amounted to a half a head of tasteless iceberg lettuce with small diced pieces of tasteless tomato on it. No bacon bits nothing that would make it a steakhouse wedge salad.   After spending lots of money for a horrible meal I hope this review keeps at least one unwary traveler from going to this restaurant.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VGqfIpK7_CQrZ4RtzLTWmg"
  },
  "8LBYnWEhCPsvCCVEP61ZMA": {
    "date": "3/28/2018",
    "text": "Oh my.  Nice atmosphere.  Servers didn't be care if we lived or died.  Salty food.  Men's room was cleanest I'd been in in Edinburgh....but I came for service.  YMMV.   I WOULD LOOK ELSEWHERE!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XlGL95QxAQqU2ZjWIZAotA",
        "caption": "Photo of Miller &amp; Carter - Edinburgh, United Kingdom. Notice it&amp;#39;s empty..buyer be ware.  YMMV!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XlGL95QxAQqU2ZjWIZAotA/o.jpg"
      }
    ],
    "user_id": "80ruaQuoC-E9CRBYAhNZtg"
  },
  "wnQYlfwl1juqPj83y24tTw": {
    "date": "10/20/2018",
    "text": "This was one of the better meals we had in Edinburgh.  The location is really large compared to most restaurants in the area and we went on a Thursday night which was \"date-night\" so the place was completely packed (we made reservations via their website the night prior so there was no issue).   On Thursday's they also have date-night menu offering 3-courses for a reduced price (my wife opted for that with an 8oz fillet and we just shared 2 of the 3 courses) and I got a 12oz Rib-eye on my own as well.  We enjoyed everything, the steaks were cooked the right away, everything was very tasty (even the lettuce wedges) and would go back there again in a hearbeat if we were in town.    There may be better steakhouses around in the U.S., but for Scotland, this was one of the best ones we found.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xpuu7gNTnJAYyWUVWZLNvw"
  },
  "MSm1P-Wu91qnM_cbjQ89xg": {
    "date": "8/14/2018",
    "text": "If you've been to a steak house in the USA or even had a steak at Denny's, don't go here. They have a nice atmosphere and decor but the meat is very tough and dry, absolutely no marbling. The place was pretty busy, I guess customers don't know any better, and they take forever to bring your food. This place needs a hands on manager to take charge and inject enthusiasm and sense of urgency to the associates. BIG MISTAKE GOING THERE. We live in Los Angeles CA",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H3K1orI-nt574c1u_3RHig"
  }
}