{
  "aUSUwkzkWzqnJtUYuyh8OA": {
    "date": "1/2/2016",
    "text": "Good service. Clean. Kid friendly. Tasty. Cheese naan is tops. Green tea is whole leaf too",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8FEUByB3L-F8ZKR0sG4Alw"
  },
  "fIsLyMs5oZFopzNDodzSQg": {
    "date": "1/4/2013",
    "text": "I came to Mother India a few weeks ago with a bunch of friends who frequent this place often! We had a table booked for 9pm on a Saturday night.  We walked in and it was like a party (in the best way possible!) It smelled amazing in the restaurant so I was very excited.  There were six of us so we ordered a variety of dishes. It's tapas style so we shared everything. The food arrived almost immediately which was great for us. A stand out dish for me was the prawns grilled in a chilli sauce. Our server was very kind and helpful.  I think that this would be a great date spot. Some colleagues from work often order the takeaway on a Friday night - they do larger portions for this. However, one thing to note is that I didn't find the food to be particularly spicy (this can be a good thing if you have a less spicy palette!) I'm definitely a fan and will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jY-M01vatSmfy-mK_g0h9A"
  },
  "CZ9XxT4np6s-LrHP-txzOg": {
    "date": "3/14/2014",
    "text": "Definitely worth a visit if you're in Edinburgh. The butter chicken wasn't my favorite but still good. I would choose a different chicken dish next time though. The vegetable pakoras and saag paneer were both delicious. The saag paneer was spicy but nothing overwhelming. It had the perfect amount if heat. For good Indian food in Edinburgh this is the place to go.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6WvrTcgpsmTgYREGhAdwdw"
  },
  "0XSemcoVLj77yYrKMj0BZA": {
    "date": "1/10/2012",
    "text": "Have frequently visited Mother India in Edinburgh and its Sister or Mother Ship in Glasgow. Both are Superb and glad to pay them a visit on a trip into town recently!!! Spicy Haddock is . lost for words!! It is scrumdidily umptuos!!!!!! Always on my list of to have dishes including the Lamb Saag and the Fish Pakoras including the pink accompanying sauce. Pleasure was all ours!! Many thanks to the Staff as always. Cheers J",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8F3JVoHX9Pb-akVRGB9wyQ"
  },
  "BQZWCaL96V-0pkRauPkxDg": {
    "date": "4/1/2011",
    "text": "When I heard it was a Tapas style Indian restaurant it almost put me off but I am soo Glad I went  Great food ,quick service and sensible price DO NOT MISS!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V2F29vm3s2S2ihDaV1k5hQ"
  },
  "JAQ0MzrVFW_ktT5mWyxwxg": {
    "date": "6/5/2012",
    "text": "Checked this out last night as i had a frined to meet in Edinburgh.   As good as it gets to be honest with regard to quality of food and authenticity of flavors.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_J_uKrM-pHiBVkdbRfL2EQ"
  },
  "5t07AoAH8CI01Ov8n8bUhw": {
    "date": "4/8/2010",
    "text": "Mother India had long been considered one of the best places to get a curry in Glasgow, so the decision to open a branch in Edinburgh was a good one. When the cafe opened in Edinburgh in 2008 the locals breathed a collective sigh of relief, finally an establishment had opened that put a new perspective on Indian food. The menu advises that you order 2 to 3 dishes per person and share everything tapas style; my favourite thing about going out for a curry is sampling what everyone else has ordered, and that's exactly what Mother India has capitalised upon. Everything is cooked to order and brought to your table as soon as it's ready. When dining with a large group of people, you easily forget how much you've ordered and the dishes just seem to keep on coming (which is no bad thing given how delicious it all is!). Highlights on the menu include the spiced haddock, which is cooked to perfection in tinfoil, and the butter chicken, a heavenly concoction that tastes so good it must be very very bad for you!  The food here is tasty, the prices are cheap and the atmosphere is convivial - just make sure you come with a few friends, so you can sample as many dishes as possible",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LLxXUyNlqamgaqGmNJxYnQ",
        "caption": "Photo of Mother India's Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LLxXUyNlqamgaqGmNJxYnQ/o.jpg"
      }
    ],
    "user_id": "mJJj_SZff6MEWG5Vx1r8Bg"
  },
  "0SHSAX1aN-VWhcdXwPhjOA": {
    "date": "8/19/2010",
    "text": "My first trip to this restaurant was a snap decision, one I'm extremely happy about. The moment I realized it serves Indian food, tapas style, I had a little bit of an epiphany.. sure they'd obviously already come up with the idea, but I still felt it was incredibly genius and worth having an epiphany over any how.  And yes, the food did rock my world! For the small amounts that each meal comes in (this is my only complaint, more PLEASE!) there's a lot of quality packed in. I had a wonderful chicken curry with nuts (giggle), spicy prawns, some pakoras which were surprisingly spicy and my one and only love, peshwari naan. I didn't feel incredibly full after the meal, which was less than 10 after splitting the bill; it's probably not great to be rolling out of the restaurant, but the glutton in me feels it's only right if you're paying for the food!  It's incredibly busy, and there was a 15 minute wait for a table. I triply recommend it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IY8cvV2SQuhJjKhRW68tFw"
  },
  "4zlr7myW_cEXpscsy5Uglw": {
    "date": "1/18/2014",
    "text": "Indian tapas is the future! We followed the menu advice and ordered 3 or 4 dishes between 2 and naan/rice. The food was reasonably priced at around 4 per dish and it was great being able to try new dishes. I'd recommend trying the delicious ice cream also if you can leave room for it. Definitely worth a visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "an8U16gLBUAT2S2Hlr8G2w"
  },
  "nS6vk3GA24frc8y9qjON9Q": {
    "date": "5/22/2010",
    "text": "I was really excited about visiting Mother India in Edinburgh, considering the repute of Mother India in Glasgow and the established knowledge that the group's food has blown away a lot of people, not least the competition. The restaurant has a cute little premises on Infirmary Street, small, but perfectly formed and set around two levels, and with a good bit of room on the downstairs floor too.  I appreciate the idea of Indian tapas is quite a novel one, or it certainly seems to be something you don't encounter often. Being a big fan of tapas and Spanish food, I do understand the attraction of having little snack size portions of quite a few dishes, and not limiting yourself to the one variety, which normally I would firmly approve of, considering my indecisive nature and food jealousy tendencies when other people are presented with their meal. As tasty as all the food here was, I found the tapas aspect a bit too much for me, with my palate unable to cope with the amount of different spices and Indian taste sensations it was being bombarded with. Perhaps I'm just inexperienced in this field, and need to give tapas Indian style more of a chance, but for now I'm sticking with my main Indian dish, rice, and naan. Feel free to call this boring, but it seems I'm old fashioned and stuck in my ways when it comes to certain types of food",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nE-JBSqnT0Dn28s-kKvxiw",
        "caption": "Photo of Mother India's Cafe - Edinburgh, United Kingdom. Photo from motherindiaglasgow.co.uk",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nE-JBSqnT0Dn28s-kKvxiw/o.jpg"
      }
    ],
    "user_id": "5Mujjzv-ZH6HhxT-hWCpVg"
  },
  "1hlHYZ8RXHTyApqnOpE9gQ": {
    "date": "12/15/2011",
    "text": "LOVE LOVE LOVE Mother India!! Try the butter chicken  so good! Love the concept and prices but above everything the food is outstanding!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GR5J2C2nhDZQuEsqycjntg"
  },
  "3kDejxdKsWFLILnwGZYKiw": {
    "date": "8/10/2010",
    "text": "Indian tapas?! Yes please. I've been for lunch and dinner, and Mother India is a great choice for both. If you're like me, you can stare at a menu of Indian cuisine for hours before you make up for mind, you'll know that you only have room for one main dish and a side - but with these portions you can just go for it!   Its also safe to say that the portion sizes have not jeopardised the quality thanks to some excellent chefs, everything I've tried on the menu so far (which is a great deal of it) has been a stack above the rest.   We'll be back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_aTB-LS7NqzRTljtJjlpew"
  },
  "cauMEuDCTxDqaB1PUPhv-g": {
    "date": "11/9/2010",
    "text": "I'm not usually a fan of 'tapas' for food other than 'tapas' - but in this instance I'll make an exception. The food at Mother India Cafe is top drawer - and having small, sharing plates means that you get to try more of it than you otherwise could!   Having been to the (original?) Mother India in Glasgow, I had high expectations of the Mother India Cafe. Whilst the decor is decidedly more modest, and the dining experience a little less refined, the food is easily as good.   Of particular note was the Garlic Chilli Chicken - which after an initial \"is this meant to be hot?!\" had us all reaching for the lassi - but in a very good way.   I suspect this place would be better in a group than as a couple (we were four) - but either way it's definitely worth a visit.   I've marked this down to four only because of the unmistakable 'cafe' feel - which means I wouldn't necessarily visit for a relaxed, lingering evening meal. Fantastic nonetheless.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LAxZQMY6LjBkGiiaIaLiHw"
  },
  "Nf33YkeZ15YXEoP12kkYHA": {
    "date": "2/22/2013",
    "text": "This is a very good place to eat.  Every time I have a meal here I enjoy it. The prices are very reasonable and there are a wide variety of dishes.  A meal for four people can be had for under 50.00 with wine included.  Start your meal with their wonderful coriander chutney and a bowl of raita and a few poppodoms to dip into these whilst waiting for your order.The dishes, although tapas, are big enough to share and six  different dishes with a couple of bowls of rice are easily sufficient for four.  The service is quick, efficient and very friendly. They do their utmost to find you a table even when you have not booked.  It is more like a restaurant than a cafe with a good range of nice wines too.  If you like Indian food you will love this place. There is a good atmosphere and I have never seen it empty.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0dVSqIPD8BBXEKF_BxmwRg"
  },
  "NaZVjLrXJ2d5IlhPkrmdiQ": {
    "date": "10/8/2014",
    "text": "Came here with four friends and split about 6 dishes, as recommended. I am used to getting massive portions when I get Indian and this tapas style was really nice because we were able to have a lot of variety, and there really is something for everyone. The food was overall nice enough that I recommended it to other friends, who also enjoyed their meals. Consider making a reservation as it can get quite busy all nights!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8XtPjxLxYiZv4KLLwuGtcg"
  },
  "5_Mjj8QE3IJMcoVlbRueKA": {
    "date": "2/9/2010",
    "text": "I had a very enjoyable lunch at Mother India last weekend. The idea of tapas-style Indian food is very appealing as you get to try a whole variety of dishes rather than just a couple of main courses.   We split our choices between vegetable sand meat. A crispy chilli chicken dosa, standard chicken curry, mushroom bhaji and okra and potatoes. Unlike some asain restaurants they didn't seem afraid to put a bit of a spice kick into their food which was appreciated.   As another reviewer points out ,you'll need at least one portion of rice per person as they are quite small but the great thijng about the tapas style is you can keep ordering until you've had your fill.   Service was very friendly and food delivered promptly. I'd have no hesitation about a return visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "glv-cXHGyV_ZMNr0ZeJNvA"
  },
  "wpt0R7xQn2ndcFpXYFo7WQ": {
    "date": "7/2/2014",
    "text": "Delicious bite sized portions, authentic Indian taste and good service. Enjoyed myself!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-_AGAtfpZsXu8xEBSWC1Fw"
  },
  "JN7XVLD8jrq7NgrVgWppvw": {
    "date": "4/15/2012",
    "text": "Very good and unique. We did takeaway on a Saturday night and service as prompt and friendly. Food was spicy, but not too hot and with great flavour.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DpJEomJCWtnZCccsTARPNQ"
  },
  "9l72LQWFBVnU6q47XDyj_A": {
    "date": "11/10/2011",
    "text": "Delicious and, as far as I know, typical Indian food. The idea of serving it as tapas is great: In a group you can share many dishes, but also as a single person you can try out different tastes. Quite crowded at times, but the servants are nice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PnPXAN7u0RpfsSTfgMI19Q"
  },
  "J6JCpYW7FQMS9h4ElK1tZw": {
    "date": "10/3/2013",
    "text": "One of the best Indians I've ever had, and I've had quite a few. The tapas idea is a great one as it allows you to try so much more without forking out for a whole dish",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YW1-rn1aq93boV66Vb-0eA"
  },
  "cZrCzEZxxgq1XuQULBMw4A": {
    "date": "3/16/2016",
    "text": "Awful awful place, it's always crowded so you'd think it was good! I was really expecting Scottish Indian to be better than London but I was disappointed! Put some salt in your food please! And if you're a brat like me and not a fan of chicken thighs then you're out of luck",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P89uw9XBEkKulDg8puibNg"
  },
  "5sKMq9ntupL6rRk6HBGhjw": {
    "date": "9/16/2016",
    "text": "Great Indian food. Though they serve in tapas style which is good as you get to eat multiple varieties. Chilli Chicken Dosa, Chicken Saag are specially very good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F_Y14sDBbcYz24PAIocO4w"
  },
  "skV2-7Gv6u5klv2puGFV1A": {
    "date": "11/29/2016",
    "text": "The best Indian food we have ever eaten. Seriously. Highly recommend. Quite a find in Edinburgh!  Dishes were larger than expected-- we actually ordered too much!  Reservations are needed if you don't go early.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ysiLx7Plmnn0Et8aPtNXYA"
  },
  "-IgNIllef4lRCVdjXv_a4w": {
    "date": "8/26/2014",
    "text": "I am Indian, I know Indian food. This place is NOT the real deal- it is white-tified Pakistani food masquerading as Indian under the name \"Mother India.\" I don't eat dairy, which is not an unusual custom in India. When we informed our waiter, he assured us he would be able to accommodate this. He went to the kitchen and came back to tell us that several dishes could be prepared dairy free and that he would take care of it. In the meantime, we trusted this and sat drinking our beers. 30 minutes later, another mysterious waiter tells us that actually only two dishes can be made without butter because almost everything at this restaurant is pre-made and sitting in the kitchen already (probably under heat lamps.) Had we known when we first sat down that they wouldn't be able to serve us a meal we would enjoy, we would have just left and understood --but by the time we were informed of their culinary incompetence, we were so starving and most other restaurants had closed- so we decided to see what they would prepare for us. What a mistake! We would have been better off leaving hungry.  Needless to say, the service was horrendous- the waitstaff we encountered were a bunch of incompetent fools without a sense of professional hierarchy or really a manager at the restaurant to oversee at all. One random waiter emerged after the other- none of them consistently understanding our requests or giving us what we ordered. When the food did finally arrive, it all tasted the same- a slough of mush covered up with shallow turmeric/tomato/garam masala flavoring (probably from a packet.) When we expressed our disappointment and frustration, the waitstaff was at first mildly apologetic then we saw them laughing at us behind the bar. When our bill arrived there were several errors that had to be accounted for- when I asked to speak to a manager, two different waiters pointed to other random waiters which clearly weren't supervisors so we never had the chance to address our experience at this establishment.  We will NEVER return, our stomachs ache and our wallets hurt. Mother India is a JOKE and is truly the kind of place that gringos that know nothing about Indian food eat at. It is also not a place you can eat at and trust- I assure you, even if you don't care about dairy in your food, what they are making in the kitchen isn't fresh- you would be much better off at your corner Indian deli. The concept of Indian \"tapas\" is just a way to serve you less and make more $. There are too many incredible dining options in Edinburgh to tolerate the mediocrity at \"Mother India.\"",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "JvGTmwEIVacjNIJ2ENOmMw"
  },
  "VVrL6hZins7bFpWonbKCNw": {
    "date": "1/24/2015",
    "text": "This place is great!!!  The menu is varied with a good selection of meat, fish and vegetarian. The tapas style is excellent and a table of four people means you get to try a little bit of loads of things. The usual curry house things such as cold Indian beer, poppadoms and nan bread all hit the spot. In the round, this is a great little find!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZOui7A-4S9DoMC85nLj8zA"
  },
  "WBzM37EFqBy0T3elJfeIPA": {
    "date": "2/12/2013",
    "text": "Indian tapas is most certainly a new concept, and works quite well for small appetites, or those who want to try a bit of everything.   Each mini dish costs between 3.50-6.50, and whilst a small plate would probably suffice for me for lunch, others may need two-three a head. I come here quite often with my parents, and usually get some poppadoms with chutney, a vegetarian dosa which comes with a fresh little salad, and something to share with my boyfriend, which is usually saag panner (Indian cheese which doesn't melt, is white, and cubes of it are cooked into sauces) or a mushroom dish which I don't remember the name of. We usually have a rice dish on the table too. The only naan I tried here was peshwari, and it was very sweet, stuffed with raisins and grated coconut. It was delicious, though to me more of a pudding/snack.   There are quite a few veggie options, which is good for me, my dad and my boyfriend, but my mum who eats fish was equally satisfied with her choices. There also a few specials everyday. I think they could do with more Indian pudding options though. Whilst they sell very good pistachio ice cream, it's just not kulfi!  Mother India is conveniently located near the national museum of Scotland and the University of Edinburgh, across the road from Blackwells book shop.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HvQ576LJm6i6QZuTwl7WVg"
  },
  "RglPeg4Q2yMm8Ggyp6uUCw": {
    "date": "2/17/2013",
    "text": "I'd passed by this place so many times but hadn't taken too much notice, but when a friend suggested going I was happy to try out a new place and I love tapas. I really enjoyed the food. There seemed to be a wide selection of food and the price was reasonable too.   We probably ordered too much food (we each ordered 2 tapas to share among six of us as well as rice and naan bread) but we gave it a good go of eating as much as we could. They did forget two dishes and I did remind them of one dish (as I really wanted to try it) and they brought it straight away so it wasn't an issue.   The food was fab, service was good and the food arrived quickly enough. I would definitely go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O6dMShJ-dIX_4Qsq6mvvqA"
  },
  "JLi340eK__tw0yDeKRMqjQ": {
    "date": "6/11/2015",
    "text": "As good as I remember from 2012. Everything is great and the KingFisher is ice cold :)...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7PMz_tjgUFOt4zj0R_E7gg"
  },
  "ZggEzEy05_-_CsKCiHlDmQ": {
    "date": "4/28/2010",
    "text": "An Indian style tapas restaurant which although quite new is very popular with the locals. I really like this place just because I can order a selection of Indian foods and try a bit of a variety. However, if it's crowded (which is usually is) it gets very noisy, as the sound seems to bounce of the walls and celling.  Our waiter was good, although if you have a small tolerance for very hot stuff do not go with their suggestions of medium- our was charmingly tearing up during my date.(so pretty with makeup down my cheeks- yes) On Friday's and Saturday evenings book in advance. It's reasonably priced as far as Edinburgh restaurants as well.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gVjnNBbLIGIye31RB_OR6Q",
        "caption": "Photo of Mother India's Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gVjnNBbLIGIye31RB_OR6Q/o.jpg"
      }
    ],
    "user_id": "nhVvcPyRGLw466qHVbUjrA"
  },
  "iX3EX8_TVB127RhUPrY97A": {
    "date": "12/29/2014",
    "text": "I came with a group of 4 and we ordered 6 dishes. It ended up costing about 9 pounds per person, which is certainly not bad for the quality of the food, but I wouldn't come here starving because we still weren't particularly full afterwards. I'm not sure Indian is really something to do tapas-style, but it still tasted amazing and I'd come back again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P4BE9HGvHuhH7liXnn8E2w"
  },
  "Klhh15eYsuEhNwNKCL-xAw": {
    "date": "5/28/2012",
    "text": "I visited here with three friends on Saturday afternoon when it was fairly quiet, it was a lovely sunny day and the interior was bright and airy, I did get the impression the tables were a little cramped (although the 4 of us were sat at a table set for 6), it is possible that if it was busier than it could be a problem.  I've never had an Indian Tapas before and was looking forward to trying it, normally when I go for an Indian meal I choose something I know I'll like and no doubt miss out on lots of interesting dishes. We each picked one dish we wanted and then selected two more, so we had 6 dishes between the four of us plus a couple bowls of rice and a couple Nan breads. This turned out to be about the right amount as there wasn't much left, perhaps one Nan bread would have been enough, those with \"healthy appetites\" might want to add more dishes (the menu suggests 3-4 dishes between 2 people).  I didn't take note of all the dishes that were ordered but we had a good selection with a couple lamb dishes (crispy lamb with mushrooms and lamb with spinach) , a couple chicken dishes and a couple vegetable dishes, my choice was a Garlic Chili Chicken dish in a pepper sauce which was delicious, although a too spicy/hot for some peoples tastes. All six different dishes we ordered were lovely and well cooked as were the rices & naans. Definitely worth a return visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "T_X-isv6-TBSoo-3t2vr6Q"
  },
  "FN-_BeyEwnSJ3YkmTUBuXQ": {
    "date": "7/13/2010",
    "text": "I first noticed Mother India's Cafe when sitting in cafe Nero across the road, looking out. It looked interesting so I had to try it.  This Indian Restaurant certainly is a bit different. As the others have suggested, it isn't just another takeaway or Indian buffet house, but a tapas style restaurant where you can sample many dishes. In this respect Mother India's Cafe earns points for being different.  I did enjoy the food here at Mother India's Cafe but I more enjoyed the tea. The latter was quite exciting, the former, for all its ingenuity, wasn't as great as I had hoped. I also have to agree with Fiona about the setting. Inside it is rather too bland and formal and I didn't feel overly relaxed.  At the same time the waiter was very friendly and the pricing was average. Not a bad Indian restaurant with a novel idea, but it could do with improving its atmosphere.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NPyOaJy98um2IrGS29XrNw",
        "caption": "Photo of Mother India's Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NPyOaJy98um2IrGS29XrNw/o.jpg"
      }
    ],
    "user_id": "PEN-Ttdt8r2MEk6Q5CnYbw"
  },
  "HwP5pg4QlgV-j0CHes-WxQ": {
    "date": "5/27/2010",
    "text": "Mother India is something different. Although at the time I didnt realsise there was a Mother India in Glasgow, when I was here recently, I knew I had found something a bit special.  Set aside in a tiny fronted building, inside Mother India spans two floors and is a lovely mixture or traditional and more modern concepts when it comes to the decor. It's actually rather pleasing on the eye, and if I were able to bring a few scatter cushions and a bean bag, I would have a perfect chill out space. Anyway...  The food here is something different - its kind of like the bastard love child of Spain and India - a selection of tiny portions designed to be eaten Tapas style, but from a very indian menu. The concept actually work very well - the food is not only excellent, but by ordering lots of dishes everybody gets a taste of what they fancy without suffering from food envy.  There is, depending on what combination of food you order, a overpowering sense of flavour which may be unpleasent to some peoples tastes, however, anything that manages to put a modern spin on Indian food is good with me. It also helps that I love tapas. So, \"Yay! I'm a fan.\"",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wtaWd_utSMoI55W_P8yMhA",
        "caption": "Photo of Mother India's Cafe - Edinburgh, United Kingdom. From Business website.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wtaWd_utSMoI55W_P8yMhA/o.jpg"
      },
      {
        "img_id": "BuYInh9jgohlNXXvFttoAQ",
        "caption": "Photo of Mother India's Cafe - Edinburgh, United Kingdom. From Business website.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BuYInh9jgohlNXXvFttoAQ/o.jpg"
      },
      {
        "img_id": "bweju_9YP7ejqhzjaj31xA",
        "caption": "Photo of Mother India's Cafe - Edinburgh, United Kingdom. From Business website.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bweju_9YP7ejqhzjaj31xA/o.jpg"
      }
    ],
    "user_id": "SxV1Jq7UANuSYpn42JXvOA"
  },
  "h3Nb32TI2kx5ChbUuz2crQ": {
    "date": "4/28/2010",
    "text": "A friend told me I should go and try this place, presumably because he was so sick of me banging on about In Delhi just up the road from here.   Maybe I didn't go in with an open mind, but I have to say there was nothing particularly special about this place. Yes, they do an amazing selection of spiced, herbal or green teas, and yes the nibbles-sized dishes on the food menu were tasty (the mushroom poori and chilli chicken dosa in particular), i thought the whole place lacked a bit of character that so many other indian eateries have.   The furniture/decor was very formal and serious, which is pretty much the opposite of what a restaurant with a tapas mentality should be in my opinion - I loved how we were constantly dipping into eachother's dishes sampling sharing them all, but sitting at those tables I felt as though I was doing something I shouldn't be every time I did.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "N6K8JaZl7siiRWdgqaUZ7w",
        "caption": "Photo of Mother India's Cafe - Edinburgh, United Kingdom. image courtesy of www.motherindia.co.uk",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/N6K8JaZl7siiRWdgqaUZ7w/o.jpg"
      },
      {
        "img_id": "StBwyW3sjWZK99Baq2xG_g",
        "caption": "Photo of Mother India's Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/StBwyW3sjWZK99Baq2xG_g/o.jpg"
      }
    ],
    "user_id": "oEshN5oq98_g23MvEnRc5A"
  },
  "aWP-gSLvAk7hCPB7Dex_5w": {
    "date": "10/1/2013",
    "text": "This is the only place in Edinburgh which reaches my expectations of home cooked food in the sub-continent. The place is very friendly, the staff is helpful and food is mesmerizing. I can not really criticize anything about this place. It is also relatively cheaper to a lot of nasty take away's in Edinburgh. The only thing I am confused about is how is this place cheap and nice at the same time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "K6nIVbNYLatXH5Ry_xc-7w"
  },
  "uuwQpA44cbD_QcM3OATP8Q": {
    "date": "10/24/2015",
    "text": "Fantastic food. Smaller dishes serving 1.5 people so we got 6 for 3 plus 3 rices, 2 naan and a bottle of wine for 60.  Great quality chicken breast in the tikka and butter chicken. Lamb was nice. Samosas were delicious. Fried okra was ok. Great service. Very busy on a Saturday night. Make reservations.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "d8Ae-GhayDaZ1s-eOl_Ywg"
  },
  "xnnxYF3vpNb-oBHJelTY8Q": {
    "date": "12/27/2015",
    "text": "Had high hopes for this since they claimed to be the best in all of scotland. Their tapas style allows you to try several dishes without wasting food or overeating. I have been here twice and they delivered food that just hit the spot both times! This is a keeper :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gVhtxVcu3z8t594APnQeRA"
  },
  "uEaDwehLI1aM9YmdC3VWhQ": {
    "date": "5/29/2011",
    "text": "I was here this afternoon for lunch. Service is very prompt, which I appreciate. The wall coverings are lovely, and lend the place a very upscale image.   Foodwise, myself and a friend ordered 4 dishes, 1 rice, and 1 garlic naan bread. Bill total: 22. Not bad, considering we walked away pleasantly full.   The spicy chili king prawns were DELICIOUS. Unfortunately there were only 4 prawns, and 1 potato. Definitely worth it though.   The mushrooms on a flake / puff pastry was good as well, more so for the pastry than the mushrooms.   Tikka chicken was well cooked, and came with an abundance of onions and peppers.   The thing with lamb and spinach was delicious as well, and was our only dish that came with some sort of \"gravy\" with which we could eat our naan bread.   Overall, a very good experience. I really liked the wallpapers that they used. It felt very chic, but the price tag wasn't super ridiculous.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "sKpXijbd_UpoDzVi30UlAA"
  },
  "1AF_KYXlslZLOsChEno_Tg": {
    "date": "1/21/2011",
    "text": "I was a bit leery of paying \"tapas plate prices\" for Indian food, but this was delicious and worth the small premium.  We did pay a wee bit more than we would've for a more traditional Indian menu.  The aubergine (eggplant) fritters were amazing, the samosas were some of the best we've had, and the chicken tikka mahkni sauce was creamy, rich and the perfect blend of spicy & sweet.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "gh1qaF_Kcd357CZU3j9nRA"
  },
  "lm3ESgHmogd2X-KYP6yLCg": {
    "date": "1/21/2012",
    "text": "food was delicious , even though I am not really into indian food! but i have to say it is really expensive for the size you get! I wish they'd have a set selection of tapas for a reasonable price! because to be honest if you re hungry it won't fill your stomach :( and since it is tasty you'd want to ask for more but it's pricey!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f0ODldmlswlM4YMSYZMB2g"
  },
  "sWgLOlxhboThFoI-gYwKbQ": {
    "date": "4/22/2015",
    "text": "Delicious food! Good service. Great prices.   We ordered the saag paneer, lemon cashew rice, minted lamb curry and spiced haddock, along with a garden salad. All of the dishes were fresh and fragrant! Very satisfied with this meal.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "3iyyROKyMeXD6v68AKC-_g"
  },
  "UKMNL1LMayf2AFOZDpwz-w": {
    "date": "7/13/2016",
    "text": "I went to Edinburgh for a conference and a local recommended this place, I'm so glad I went! The tapas idea for Indian food is great and everything we had (with two ppl) was super tasty. Prices adequate. Service quick and friendly. Serve local beer. Would absolutely recommend for a nice dinner! Make sure you book, though, we were just lucky to get a table spontaneously.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "S7ohW2WerV21b8qVtKFD0w"
  },
  "xhbwPTF11PA72kMznFrToA": {
    "date": "7/24/2015",
    "text": "The food is fantastic. One of the best Indian cafes in Edinburgh. Masala tea is my favourite and they are master of cooking fish. Service is good and serving food is quick. Strongly recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XHGsOuR7cqII7-QHEK_31g"
  },
  "F7LSz7_adm1UcPzFSjQXXw": {
    "date": "9/27/2016",
    "text": "We read reviews and thought why not. The next day they would be closed so we hurried along for lunch on this day. Well Indian food to perfection. The shrimp tandoori, lamb saag, naan, and a fish dish. All were served hot and delicious. I was very happy with the choice and after ran across the street for coffee. I would recommend for all to try this gem.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D224RQ9WRnWmndZJiQ-kAA"
  },
  "re3HtyOYrRBE98dzp2cP_Q": {
    "date": "3/15/2017",
    "text": "Best Indian food I have ever had. Very reasonable prices and a great place to bring friends or family. Just walking past the restaurant and smelling the spices emanating from the kitchen is enough to make you stop and demand entry. Would recommend putting in a reservation in the evenings to make sure you do not miss out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QdqQEBYBuYLR8ouTeUdbkg"
  },
  "FyaA8sxUNwAmuz0TA1J4FA": {
    "date": "3/4/2016",
    "text": "Flew in to Edinburg from Malaysia via London. As soon as I entered the Restaurant with my family, someone very rude entertained us, he was so arrogant and said that they don't accept customers today. I asked why, he said that Friday, Saturday & Sunday was dedicated for people who book in advance. I told him the least he could do is to put it up on the website or yelp. He was so rude and replied, we don't care.   The least you could do is share correct information, and not being rude.   Thank you",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KxfS0d7R3xp1hBUYvpMO4Q"
  },
  "dUDjnoa01zo783hj8bc7jg": {
    "date": "2/4/2016",
    "text": "Food: overall pretty good. Had chicken tikka makhni and fried garlic mushrooms. The chicken dish was very creamy and tasty, the only thing was that the chicken itself was bland. The fried mushrooms were well spiced.   Service: not rude yet could def be more friendly or welcoming. Ordered rice which did not come, so I had to ask again after having all other dishes on the table. Food came pretty fast yet they never refilled water. Had to wave down someone to get the bill.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9DT3bp7mBzM4Fe0cinoA1w"
  },
  "x93gedDFf9wmWCNbt8RxUQ": {
    "date": "9/16/2017",
    "text": "I don't write many reviews - unless it's exceptionally bad or exceptionally good. I was really looking forward to a good meal at Mother India's but their food and service was totally lacking. The whole tapas idea was nice but everything else falls short after that. First of all, their service is really bad. They had plenty of waitstaff but most of them were just standing around talking or staring off into space at the tables. It was later in the evening and not really busy anymore. It was hard for me to even get their attention. The dosas are thicker than what real dosas are supposed to be, almost like a thinner version of a naan. Also, the flavors of the food really aren't as good as most of the hole in the wall places I've been to. I went to a spot in Inverness called George's and was 10 times better than this, with great attentive service and much tastier food. I would suggest you to skip this place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KPDciFh03nDYAS-UZuKHGQ"
  },
  "H-g1u6pR-cy2zB4T6PSzpg": {
    "date": "6/25/2016",
    "text": "Very delicious food, authentic flavors! Great to find a True Indian restaurant (not Bangladeshi). Place gets very busy, so make reservations. Service us prompt and attentive. Highly recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z6GboCmj2w3N-qJMsQgTfw"
  },
  "1DXj85pWMOBM88vrcpO4Pw": {
    "date": "11/18/2016",
    "text": "Very average Indian cooking. You will taste cumin and pepper on most dishes. No interesting flavors. Service is not efficient or friendly. Disappointed.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hU3IOAa7Cu6L7EThN3CsWA"
  },
  "rYGJy6M0KyL59dViAgkGQQ": {
    "date": "11/4/2012",
    "text": "Traditional, yet  complex, a Tapas lover's  Indian delight",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eKc2gY6fPaQy3zNsbIYDvA"
  },
  "_bYznPRYmE-2FJ-UKVkgqg": {
    "date": "7/23/2014",
    "text": "When a place is packed for dinner on a Monday night, odds are the patrons are on to something.   They managed to accommodate our party of six with an hour's notice and we had a great meal. I think between all of us we shared probably 15-18 different dishes easily and nearly all of them were very good. Service was efficient but friendly.  Fish pakora, dal, aloo gobi, palak paneer, okra, garlic naan all delicious. Chicken curry dishes are delicious, anything but dull.  Great service and the price was a good value overall. Six of us stuffed ourselves full of delicious food and each had a Kingfisher for about 115.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cWzxqo5K69bI-xfWU1oEvA"
  },
  "Y9jUBeTe6kZZBo3N3jqdJg": {
    "date": "4/30/2014",
    "text": "3 of us came to the Mother India's Cafe for a well needed after work feed. I was quite intrigued about a tapas/small plate style Indian restaurant. Being one of my favorite cuisines I had been really looking forward to it all day; and it didn't disappoint!   The restaurant looks like a cafe from outside. In fact, if there wasn't the amazing smell of Indian food coming from the place, you'd be forgiven for thinking it was a coffee shop. The decor inside is a little basic but it looks nice and it works really well.   Between us we ordered 6 dishes and 2 rice. The stand out dishes for me were the Methi Keema Mutter which was delicious minces lamb with peas, and Aloo Gobi with Green Beans.   Advertised as small plates, I expected small plates, but they were a really decent size. There was a little bit left in a few of our bowls/plates as we were all completely full.   Mother India's Cafe do have some traditional curry dishes on the menu, but this isn't a tradition 'British' curry house; It is a brilliant adaptation of Indian cuisine.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "MOZypLq9wfsmIOE4k6vNEA"
  },
  "8Gr3WlBRHWObRIrzfHvQdg": {
    "date": "10/10/2016",
    "text": "Fantastic little restaurant in Edinburgh. The food is incredible.  I'd definitely recommend the garlic chicken...ask them to tone it down a notch if you don't want it super spicy. The only downside was that I thought it was a little too cramped for room.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fucZMwF09eopGXVhF50RIg"
  },
  "mRyg8hzRwhoz7sMc7WeFRg": {
    "date": "9/27/2016",
    "text": "One of the best Indian restaurants ever! The restaurant his a tapas style menu, which means smaller portions (much less expensive) about four pounds to five pounds per portion. We've had literally just about everything on the menu, it's all fantastic! Go with friends everyone gets two to three dishes, then share the smorgasbord! Never have had a better Indian meal anywhere in the United Kingdom. From super expensive, to cheap spots, this is by far the best! DO NOT MISS THIS PLACE!! And make reservations or you just might, fills up fast!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OVNGSmpBvgsTWOPh6D0hrw"
  },
  "1XRXu-2YvGgHnn_AGVD85A": {
    "date": "11/22/2013",
    "text": "Got to be a high five for Mother India. Myself and a few old workmates - having all four of us gone our separate ways from the Citi arena - now congregate monthly for a Tuesday Curry Club. The idea was to try a different place every month. We've been going for two months now.... this place both times. Now I'm worried we may never see another indian restaurant.  But in fairness if going to Mother India once a month is a worry, I don't know what I'm smoking! It's tremendous, setting itself up as an Indian Tapas deal, meaning you get to try a bunch of dishes at the same time, as opposed to the standard sit-down affair offered by other restaurants en masse.  Good thing about Tuesday Curry Club (besides the curry) is that it consists of 4 growing boys with healthy appetites. With so much on offer, it means we can get away with ordering a ridiculous amount of food, and with the tapas style we can order even more if we feel we've under-supplied ourselves.  What did we have, what did we have? There was....  - Lamb Karahi - Chilli Garlic Chicken - Chilli Chicken Dosa - Baby Aubergine and Potatoes - Vegetable Pakora - Chicken Breast Curry - Chilli King Prawns (so good we ordered 2 portions) - Mutton Curry (Daily special, of which there are 5.... daily!) - Peshwari Naan - Garlic Naan - Paratha - Rice  We had so much food we couldn't see the table. We had so much food we had to admit defeat, leaving some pakora and aubergine to be returned while we hung our heads in shame.  Considering we got all the above plus soft drinks for 25 a head (3 people; 1 of us had to work late sadly), shows what a bargain Mother India is.  Always busy so book ahead. Staff are delightful, chatty and happy to leave you to it once your food's down.  A must try for lovers of Indian cuisine.  Tuesday Curry Club, December location?..... you guessed it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9RGIvzCGHp8ELF_JgAlbZA"
  },
  "h9kIEYjFNAeEK4sLYfAYpw": {
    "date": "9/20/2014",
    "text": "Good food!! Try their special lamb curry and chicken curry. (railway masala or something !) Authentic food and spicy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LlxMXxgJUAlfz8TRj4DLgQ"
  },
  "caQB0vtJhI0-TsSRfZgoDA": {
    "date": "4/23/2017",
    "text": "We've always visited last minute without reservations but they have treated us amazingly. Tapas style gives you a chance to order a few things and try different things for those that can't settle on one. Butter chicken is a definite!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YH_AvdC6E0-Z0fObSyR3iQ"
  },
  "kE4llLTdGpUpXX1DxfiGUQ": {
    "date": "8/5/2015",
    "text": "Excellent indian food in the Heart of \"EMBRA\"! We went there to refute Mother India's food reputation. And definitely we did! All the dishes we order were excellent. The menu is quite long, and the place is designed to share small plates. The samosas were particularly good! Great choice if you want a taste of India in the cold Scotland. Nice service and average prices. Definitely we will be back before leaving the city!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qr7jfn-s1JFxsPsCIjQF9Q"
  },
  "ItxLkX4D-KiCHpFOkknM9Q": {
    "date": "8/1/2015",
    "text": "Fabulous. Their menu says to order 3-4 of their \"tapa style\" dishes, but we would've exploded if we had had more than 3 (plus papadams). All of the dishes were excellent. The vegetarian dosa was a sort of Indian fusion as it was stuffed with delicious saag. The chicken tikka variety we got came in a spicy sauce. Also fantastic were the potatoes and aubergine. The waitstaff was quick, friendly, and attentive. They take reservations , and we couldn't get in the first night but were so happy we went back (we went at 9 the second time and had no problem getting a table).  Highly recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jJYST1NOFxF34ztt43rOvg"
  },
  "bINm-00AMLBe646O4I5jjw": {
    "date": "10/12/2016",
    "text": "I had read about Mother India's in both Glasgow and Edinburgh.   It was mostly full for lunch, but we didn't have to wait to get a table. They do take reservations.   Wines are pretty cheap: I got a 250 ml Sangiovese for 6, and it went pretty well with the food. They also had beers. Surprisingly, I didn't see any lassis on the menu.   Food (family style): - Chana daal: not too greasy or salty  - Chili king prawns: a bit overcooked, strong on the cumin, better with a squeeze of lemon  - Chicken breast and mushroom curry: lighter, non cream based. I appreciate a healthier curry - Mutton railway curry: richer, good for dipping naan. Slightly gamey  - Garlic pita: not super garlicky, but it had the right amount of fluffiness and the right texture  - Cheese and coriander naan: thicker than the pita. I think I actually preferred the pita texture a bit more, but the naan was still good   Food came pretty quickly, and the bill ended up being just under 40 for two people with 2 glasses of wine.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "gfyW0vuJls8ARoHmogfcmw"
  },
  "B26AOgk3HiSK5NXByjY9ZA": {
    "date": "5/2/2017",
    "text": "The rating is due to the very rushed and poor service which ruined our night (on a weekday). We ordered and within an hour finished our meal (which tasted good). Then everything went so wrong: Our waiter came and repeatedly (5 times!) asked us if we wanted anything else. We didn't, we just wanted to relax a bit and enjoy the fact that we went out for dinner.   Please mind that that the table was not booked by anyone else later and had only stayed less than an hour. We should have probably taken our time to eat , as the people in nearby tables, but we weren't expecting being treated like we were in a fast food place.  We didn't have a reservation, which normally grants you about 2 hours sufficient to have a dinner out, however I believed that we could  stay as much time as the customers with reservation. Mother India treats walk in customers differently and tries to squeeze as many walk ins as possible by rushing the people out. When we left, I informed our waiter how his attitude affected our dinner and he apologized but confirmed that usually walk in people stay for 1-1.5 hour and they plan based on that. (Well, still more than the hour we stayed.)  I like indian food and going out for dinner, but I wont be returning back after that.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9X8XPJCTqrsiGwsiyuJBTg"
  },
  "EnTwEmICdqT4Y59LMlO40Q": {
    "date": "6/30/2018",
    "text": "I liked this restaurant as it was a tapas style menu, so you can order smaller portions of different dishes instead of one, allowing you to try new things. We got the chicken pakora, chicken curry, and chicken tikka masala. Best dishes were definitely chicken pakora and butter chicken. Garlic naan was also amazing, but that's pretty hard to mess up. While I've definitely had better Indian back home in NYC, this place was still great and would recommend trying!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xF-IMcmTtBTv-gpdNON1TA"
  },
  "ZlqRjlREUPObetcrvz6a0g": {
    "date": "5/16/2017",
    "text": "Mother India was our planned destination for Indian whilst we were in Edinburgh.  It was delicious and a nice change from other Indian restaurants since this was more of a tapas style where we ordered quite a few dishes to split.  I'm glad we went but would recommend reservations. The restaurant was crowded, as it should be, and we were placed in the basement for dining.   The basement was clean and had very nice decor but smelt strongly of pinesol or another cleaner, almost off putting in strength. We toughed it out and ate at the restaurant rather than carrying out.  It was delicious and the pashwari  naan was my favorite part.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jn4k_lhMJrBuf-4dpWs0VA"
  },
  "uXv9XMxv0edCCp9A5Ky-3g": {
    "date": "1/9/2018",
    "text": "Terrific Indian tapas for a great price, both the tikka and chili garlic chicken were amazing. Service was fine enough. Would definitely recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pu3EIhPoaQNxWYSe-6902A"
  },
  "k5UFkVdjyC7AE7MzdOYyHw": {
    "date": "7/5/2016",
    "text": "Edinburgh is as close as it gets to a city that vouches for my love more than Manchester. The old town, the new town, the hustle and bustle of the Calton hill steps and hearing 5 different languages on the walk from ciao Roma to the National museum gives it a delightful cosmopolitan je ne sais quoi factor. In fact if, on a cold blustery day sitting by the window in Elephant house sipping hot coco overlooking grey friar's creek/Edinburgh castle doesn't melt your heart...You're dead inside!   Anyway onto foodie business. There are so many delightful eateries small, large independent, not so independent in and around this magnificent city that only living here permanently will quench your foodie thirst. A day trip thus just doesn't cut it. What it does do is give you a chance to visit THIS gem of a place. I initially came here having read rave reviews including Jonny Q's in his early days as Manchester CM. Quick recap on my first visit: It was a dark and bitterly cold December evening and we were tired, desperately searching for a decent feed before retiring to our hotel. Thanks to the Yelp app and Jonny's review we not only found warm refuge but a blissfull, appetizing solitude. Without a reservation on a saturday night it only took 25 minutes for a party of 6 to be seated before being dined and watered in the best way possible.   That was then and this was now. Last weekend was my first time lunching at Mother India and it was just as satisfying. The tapas style menu is a genius idea, especially if your chefs are THIS exceptional. There are so many fantastic dishes on offer that going with a group of friends, ordering lots and sharing is definitely the way forward. Don't take my word for it, go check it out for yourself.   As for me the spontaneous trip last saturday has reaffirmed my dream of living here for a few years. Or at least strengthened the fervour to return sooner rather than later. Who fancies a spontaneous road trip on a Saturday? Seven am departure from the Deansgate bike... holler if interested. Maybe even go attend a yelp event in Edinburgh? Represent the Manchester massive? *Pensively scratches chin and hmmmmms*",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "rXMxtpN--c2WQS5s3hHijg"
  },
  "5c1RKHFX9uGirRRiR_O4uA": {
    "date": "2/18/2015",
    "text": "Location was key for me during my visit to Edinburgh and Mother India's cafe was right round the corner from out hotel.   We were taken to a lovely seat by the window and brought a selection of dips and sauces with lovely light popadoms to nibble on whilst we salivated over the menu. Both opting for a kingfisher pint we decided the we would go for the recommended amount of dishes between two, four. We ordered butter chicken, garlic mushroom pakora, lamb sag and a minced meat pancake.   All were tasty, filling and very well made but my favourite was the lamb. Tender and jam packed full of flavour.   For dessert we both opted for a gulab jammin with Porreli ice cream. Wow!   Now I've tried mother india's cafe I can't wait to go to the Glasgow branch to try more tasty treats.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Ostp0wn2K260jKviOMn9wg",
        "caption": "Photo of Mother India's Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Ostp0wn2K260jKviOMn9wg/o.jpg"
      },
      {
        "img_id": "H5IzDLwZFlBLfRm7vw7V1w",
        "caption": "Photo of Mother India's Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/H5IzDLwZFlBLfRm7vw7V1w/o.jpg"
      },
      {
        "img_id": "0V_tyEqJoT7cJ0ctKFqKXA",
        "caption": "Photo of Mother India's Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0V_tyEqJoT7cJ0ctKFqKXA/o.jpg"
      }
    ],
    "user_id": "J7jsia3LawrovYiELiAgBw"
  },
  "2JOjA9BewEt8J68BtvP3PA": {
    "date": "1/1/2015",
    "text": "We visited Mother India for dinner - thankfully you can make a booking at the Edinburgh Cafe which meant our table was ready and waiting as soon as we arrived. The menu is similar to the Glasgow cafe - tapas dishes to share, they recommend 3-4 between two people. As there was 4 of us we went for 8 dishes with rice, naan and poppadums.   For me, the stand out dishes were the daal makni - similar to the black daal I had recently at Mother India in Glasgow, it was SO delicious. This one had kidney beans in it as well. I also loved the chilli chicken dosa which was lovely and light, a really fresh dish to break up the curries. And the other dish I'd recommend was the baby aubergine and potato, a delicious veggie option.   I'm a huge Mother India fan so am delighted to say that the Edinburgh branch lived up to my very high expectations! The bill was about 20 pp which included drinks, so incredibly reasonable as we couldn't even finish all the food. So make a booking in advance, order loads of dishes to share and enjoy!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "P3-dsj0DWaKZ4J9N1WaUoA",
        "caption": "Photo of Mother India's Cafe - Edinburgh, United Kingdom. Delicious selection",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/P3-dsj0DWaKZ4J9N1WaUoA/o.jpg"
      }
    ],
    "user_id": "6EWIu6Ea04qcFAL3XSalvQ"
  },
  "55FmVA9-SenE24MLzXUq4Q": {
    "date": "10/8/2017",
    "text": "Great Indian Food. Great service. Good prices. Don't miss the Spicy Haddock, was best fish I ate in a while.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MkeP4UUoIOK1hfSl98IRiw"
  },
  "Nnj_wdyLDiWSOzRuPzoAXQ": {
    "date": "4/15/2016",
    "text": "Catching a glimpse into the Mother India kitchen is pure magic. I had prime spot and could see that everything worked like clockwork and everybody loves what they do. This is such well-executed True five star Indian food but in fresh tapas format. It was a full house but everything flowed. - We were never forgotten, always felt attended to and service was prompt.  I won't pick a favourite because I can't. - Everything is delightful! Go with some friends, share a few dishes and feast till you can't eat anymore.    The Mother India experience is memorable and delicious; a real treat and entirely worthy of its acclaim.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 6
    },
    "photos": [],
    "user_id": "8rI2CoS4ltQePbZceSOgow"
  },
  "Us1f5a3oLwz53WMK0qTlwQ": {
    "date": "7/24/2015",
    "text": "The food and hospitality are amazing! We took the nan garlic bread twice!  the chicken masala, lamb with curry and the dal were amazing! The haddock fish is not as good as the former dishes.   We really enjoyed the chai masala!  Highly recommended !",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CgkYVtMk8VSbQoE-AyqkTw",
        "caption": "Photo of Mother India's Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CgkYVtMk8VSbQoE-AyqkTw/o.jpg"
      },
      {
        "img_id": "o0yjT1Dl-SNYV7snybiMGg",
        "caption": "Photo of Mother India's Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/o0yjT1Dl-SNYV7snybiMGg/o.jpg"
      },
      {
        "img_id": "lkRg0vqAV0fjevZ9x6vHTA",
        "caption": "Photo of Mother India's Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lkRg0vqAV0fjevZ9x6vHTA/o.jpg"
      }
    ],
    "user_id": "vJEPaIvAQEOEv9DcSqzf5g"
  },
  "UHbN0GSGpach1-WsslEPkQ": {
    "date": "5/22/2017",
    "text": "That was nothing short of perfection. Flavor, balance, prep, were all there. Amazing meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LJum7IhE0OenolCzMJMzpA"
  },
  "unN-_O_NgMIr1L7vtEdCAA": {
    "date": "7/25/2017",
    "text": "I would have loved to have tried this restaurant but the maitre'd, with the restaurant half empty, sat us in the corner on a bench and walked away.  And then so did we.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LydZhUeiN1rT4RUaEBSTOQ"
  },
  "CS4M9zkvWwWDWf2HRkVmJg": {
    "date": "5/13/2017",
    "text": "Solid choice for tourist here. Tapas style Flavorful & good service. Make reservations on weekends. Loud but cozy enough at a decent price.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k2HZlrknumBfbBz4zG--9Q"
  },
  "KmkErvtO_7adBMq1zAka-w": {
    "date": "2/11/2016",
    "text": "Cool concept for eating Indian food - perfect for going with a couple of people and trying out a bunch of different dishes. Overall, everything I had was delicious and I will be going back - definitely recommend this to anyone in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fgJeX63H8D8lhX9lGUkvWw"
  },
  "cGZq_3p-OVtH_VB4gQR9Qw": {
    "date": "7/5/2017",
    "text": "Considering the reviews, I expected the customer service to be better than what I received... granted, I did not have a reservation, but that does make it okay for me to be treated as an inconvenience. The food, however was good but lacked the spice that I was described to me.   Will try this business again, BUT WITH RESERVATION.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hMppL4ppNRtEwRrDAT-XCg"
  },
  "zZSBIRBQz3x2RsaSee2oBg": {
    "date": "5/12/2016",
    "text": "Wish I could give this 4.5 stars really. Food was fantastic! Had the saag paneer, lamb with mint, butter chicken and another vegetarian dish. Wonderful blend of spice that adds so much delicious flavour. The butter chicken has a bit of kick to it, but not overpowering, just enough to make you sniffle while you eat.   For two people we ordered four dishes and it was a perfect amount. Plus I ordered the three scoop ice cream which was 3.75 and there was a ton of it!   The only knock was on the service. The server wasn't very attentive and we never had our water refilled. I'm also getting used to asking for the cheque and not waiting for the server to bring it over.   All in all, we'd definitely go back and would be regulars of we lived here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c8k3zJVAK0g8jdIlTrAYXw"
  },
  "CEKBfmuY1oPTKRQz_jORJw": {
    "date": "6/18/2017",
    "text": "Today was Father's Day and since my family are away on holiday thought I would treat myself, saw Mother INDIA had great reviews but I don't know who was writing them as the service was terrible, one waiter was even standing by my table yawning, the food was tasteless, I spent 20 and left still feeling very hungry. Not a good idea eating here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4GKa4VGcfdPsDRUFZJsTlg"
  },
  "LsRWpJVJF-69MvEY2MuQsA": {
    "date": "12/26/2017",
    "text": "One of the best indian food i've ever tasted ! If you ever come to edinburgh, this a restaurant that must do ! We had the butter chicken,king prawn and some other dishes and all is superb ! Price is affordable not so expensive.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-eoukBJkh4Yybkr-2-kKNQ"
  },
  "eCg0Kw867ysUXXSVbkrGVw": {
    "date": "8/13/2015",
    "text": "Back again and this place has now been designated my number two restaurant in the world. Always busy, but always fantastic!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "f7anTSho2VC6JuabmzGtmA"
  },
  "VhMTzoy-otdAl9-PapbAmA": {
    "date": "6/22/2019",
    "text": "Indian tapas place. I really like their small quantities. Gives an opportunity to try more things. Since we were with friends we tried quite a few things, and they were all good.  Dal makhni Chana Dal Saag paneer Pindi chole Crispy Chaat Pani Puri Mixed pakoras",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fvfw6LR4qdZk8-tpVqQDFQ"
  },
  "CLXD9zOnWT6iwDWrYfE2xA": {
    "date": "9/16/2019",
    "text": "Arrived on a Thursday at 7 p.m. after reading Yelp reviews. There was no seating so we waited a few minutes for a table to open. The staff seated us, gave us a few minutes to look at the menu and we ordered.  The dishes are tapas, but larger servings than some. We ordered nan and three other dishes, including chicken in a basil cream sauce, which was sweet compared the other spicy dishes. Our food was very good. The beer we ordered was Edinburgh  Gold.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8g_iMtfSiwikVnbP2etR0A"
  },
  "-vzB_6YTxSlctGbm39-piw": {
    "date": "8/25/2019",
    "text": "Very flavorful! Moderately expensive, it's 2ish pounds for some rice which I'm not used to paying for. The portions were a bit small too, about a mouthful for 6-7 pounds. They advertise the menu as a tapas style menu so I guess that's how they priced it..?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kVwWVsQ2ut8S4dCgLeLPkQ",
        "caption": "Photo of Mother India's Cafe - Edinburgh, United Kingdom. Chilli garlic chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kVwWVsQ2ut8S4dCgLeLPkQ/o.jpg"
      },
      {
        "img_id": "pEbWrXn0qrHtdT6ebVW6IA",
        "caption": "Photo of Mother India's Cafe - Edinburgh, United Kingdom. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pEbWrXn0qrHtdT6ebVW6IA/o.jpg"
      }
    ],
    "user_id": "Dhf5fD-d5yonwVTrD_HuTQ"
  },
  "TRA2PrF5qAOCRjB0eerpow": {
    "date": "8/18/2019",
    "text": "Wow, just wow. This was amazing Indian. The smaller portions were perfect (it's described as tapas but really not that small) to allow us to try a variety of things. Saag paneer, butter chicken, the aubergine and the haddack massala. Everything was amazing, we also had garlic and peshawari naan. If only I lived closer this would be my go-to place. It's bigger than it looks from the outside, there's also a downstairs seating area, so don't let lines discourage you!  They also carry a mango and lime Peacock cider which pairs perfectly with the food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OEq_I4vcRWbclAqxVDAruw"
  },
  "qE7EZpdLJHRTnYs96Ho8Xg": {
    "date": "8/7/2019",
    "text": "This place is the bomb! I've eaten at other great Indian and Bangladeshi places in Edinburgh, but this one remains a favorite. The food is freshly prepared, authentic and tasty, but the best part is the tapas sized portions, enabling you to sample several different dishes without ending up with too much food. Atmosphere is fun, usually pretty crowded, but service is friendly and quick. Yum!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_EL9kaxXp2T74jXlDVZ6ow"
  },
  "0cNt2HO-jJHh4STM1no0ew": {
    "date": "9/21/2018",
    "text": "Mother India's were doing breakfast during the festival and we all enjoyed our very different options - eggs, bread or fruit-based. I personally love having a (mostly) savoury rather than sweet, American-style breakfast. Based on the quality of the breakfast I'd like to try lunch or dinner too.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "BBe5pgczribMvQEWHdQ_NQ",
        "caption": "Photo of Mother India's Cafe - Edinburgh, United Kingdom. Breakfast during festival",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BBe5pgczribMvQEWHdQ_NQ/o.jpg"
      }
    ],
    "user_id": "iP9NCp6If6YnlOc2QeDqeQ"
  },
  "TMSdsPJa5SsVWOEoyyBtaA": {
    "date": "7/11/2018",
    "text": "A guidebook recommended Mother India's and Dishoom, but after reading the menus for both, we opted for another India's. I'm so glad we did!   We popped in right when they opened for dinner at 5 PM. The menu recommends 3-4 dishes for 2 and I would agree. We hadn't eaten since 7 am and we're pretty hungry from wandering around all day-- we cleared our dishes! Pricing was very reasonable: $22.50 for pitta/naan, basmati rice, butter chicken, saag paneer, and the chili garlic chicken for two.   Ambiance is casual but very modern and clean, with a hint of richness to it (textured wallpapers, warm colors, 1920's-esque lighting). Service was great and quite quick (thought that may be due to the time of day we ate).  I would definitely recommend!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "oosHvXzUmQvd5s6aGsZ1_A",
        "caption": "Photo of Mother India's Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oosHvXzUmQvd5s6aGsZ1_A/o.jpg"
      },
      {
        "img_id": "opymhNOAc6PWsV6Nlep88Q",
        "caption": "Photo of Mother India's Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/opymhNOAc6PWsV6Nlep88Q/o.jpg"
      }
    ],
    "user_id": "7JCi3i7aVuyYGP5N12jMvw"
  },
  "nrvseViuTOiSEfOFllChJw": {
    "date": "6/10/2019",
    "text": "I tried their butter chicken, naan, and mango lassi. The mango lassi was sour, the naan totally tasteless, and the butter chicken was the worst I've ever had. The tapas style is good since you get smaller portions. The naans are large, so two was a lot for me (& I LOVE naans!). The place was packed, and the service was bad if you hadn't made reservations.   So make reservations.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OaVmZancRa7Ngiuj99MdIg"
  },
  "31uEeLqKEjojwxJDZ7oXzQ": {
    "date": "9/6/2018",
    "text": "This is some great Indian food! Well-made and good service. We had a great tapas-style lunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6PGAwDgB7UbMGxnmviClpw",
        "caption": "Photo of Mother India's Cafe - Edinburgh, United Kingdom. The food is simply too delicious to take a photo before eating most of it.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6PGAwDgB7UbMGxnmviClpw/o.jpg"
      }
    ],
    "user_id": "WN1RxjwXI1xLy6ZeEZ7Vig"
  },
  "kuw7wo_GIRyB20uW9DQgUQ": {
    "date": "10/11/2018",
    "text": "Wonderful late night dinner food! We shared 4 dishes and 1 garlic pita between two people. This was a good amount to fill up on, but not too much. The food was excellent and extremely delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RkK1LbnkPE8kReRO6C9Q-w",
        "caption": "Photo of Mother India's Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RkK1LbnkPE8kReRO6C9Q-w/o.jpg"
      }
    ],
    "user_id": "3mGBuuZVPCLs0_0RTiLHGQ"
  },
  "08rOq20M7GEtMkCrW6DVJg": {
    "date": "11/13/2018",
    "text": "I love Indian food to death since having my first taste of it in London a few years ago and I'm so glad I came here for my first big meal in Edinburgh. I had the chicken curry and rice. Everything was delicious and the prices were reasonable. We (my mother and I) actually made two stops here for lunch. She also had this fruit smoothie with a combination of yogurt that was delicious. Unfortunately I don't remember the name of the drink. All in all, great service, great price, and pretty awesome atmosphere. I might prefer this to Dishoom!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "G9dvlIZph5vMu4FoA2jXOw"
  },
  "GnGEjUCAXw_VvQHmQZc9EA": {
    "date": "5/6/2017",
    "text": "We found this place on trip advisor and went in starving at ~5:45pm on a Friday night. We were pleased to get a table despite how busy they were. They advertise \"tapas\" style dishes to share, but they were pretty large portions for tapas. We had vegetable pakora, saag paneer, butter chicken, and Peshawar pitta bread. Omg it was all delicious and just they right amount of food for the two of us. Everything was perfectly seasoned and top quality. The staff and managers operate like a well oiled machine and do an amazing amount of business. They also offer 125ml glasses of wine so you can sample things- again brilliant! We loved our dinner and would definitely go back!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nZFj3vRWVXdRKc4kWe-y0A",
        "caption": "Photo of Mother India's Cafe - Edinburgh, United Kingdom. Vegetable pakora",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nZFj3vRWVXdRKc4kWe-y0A/o.jpg"
      },
      {
        "img_id": "MjHYtXieXlZbXDe3XDZsfA",
        "caption": "Photo of Mother India's Cafe - Edinburgh, United Kingdom. Butter chicken - so delicious!!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MjHYtXieXlZbXDe3XDZsfA/o.jpg"
      },
      {
        "img_id": "GyCfLU8bz2wAal5FXsOyAQ",
        "caption": "Photo of Mother India's Cafe - Edinburgh, United Kingdom. Peshawar pitta bread",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GyCfLU8bz2wAal5FXsOyAQ/o.jpg"
      }
    ],
    "user_id": "k1QPSFK2KMH4BvHcVd_rYw"
  },
  "9M4DbP8gAjrLuMGEwNGYfQ": {
    "date": "5/9/2017",
    "text": "Still one of my favourite places for Indian food in Edinburgh. Even on a Monday night it's busy. I really like the tapas style dishes which make for a great social experience.  The daal makni & the dosas are always a highlight.  Service is always really good too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "X0_h6DgEBMmS1Nfmbc0UWA",
        "caption": "Photo of Mother India's Cafe - Edinburgh, United Kingdom. Lamb Karachi, chicken saag, daal mackhi &amp;amp; raita",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/X0_h6DgEBMmS1Nfmbc0UWA/o.jpg"
      }
    ],
    "user_id": "R9UNH0rb3a_glQlk4ylKCw"
  },
  "MFl0sWfVmDm0n9NvxV6iSg": {
    "date": "8/3/2018",
    "text": "GREAT Indian food for a reasonable price! We loved it and ordering three of the smaller plates with naan is more than enough for a light lunch. We had a good time and the flavors here are really robust. Good service too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gMMRsLoYYxKRsv6ok1iqRA"
  },
  "aqKR78JEonKl1kugOYTOxw": {
    "date": "7/31/2018",
    "text": "So good. Had Spiced Haddock, Butter Chicken, Chicken Breast Curry, Auvergne Fritters, with basmati rice and regular pitta. We were starving and this hit the spot. Both my and my husband's favorite was the Butter Chicken.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Px7E234RCv8SMSNixQRSxw"
  },
  "QS8CivhfNULAhVR77IpY3Q": {
    "date": "4/19/2018",
    "text": "We were looking for great Indian food,small plates,chances to try new items,we found it.Food was amazing in taste,and served very hot.Beer from India,my hubby was happy.Even though we were full,we had to have glubjamin for dessert.Oh just absolutely hit the spot.Warm glubjamin,icecream,what could be better.Thankyou for a great meal,and impeccable service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9nW1WedI_F4im76hm65SHA"
  },
  "2bsJqn6Au5MLDNfP3XzN0Q": {
    "date": "3/13/2018",
    "text": "Delicious Indian food! Closest thing to my mom's cooking that I've had at a restaurant. The food was served hot and the customer service was amazing. I ended up coming back later that night to get take out and also went back today! lol. I will definitely be back next time I'm in Edinburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V5Z362MkCnAZS0e1zzsxbA"
  },
  "AHlqiYIIbmeMmpY2Qtzwiw": {
    "date": "5/5/2017",
    "text": "Unique idea (Indian tapas) but the food was very ordinary. I did not like the vegetarian samosas (too dry) or the mince dosa (actually one of the worse dosas I've eaten). The vegetable pakora and chicken curry were good as was the naan (which they call pitta), but nothing to rave about. The bill was only 23 for two without drinks and the atmosphere was nice. Ok for a casual midweek dinner but only if you are nearby (i.e, not worth going out of your way for).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nEfgsjRDRmxx7nNFVZi0jw"
  },
  "HkguyGSPYRZ7cf2Z3FveaQ": {
    "date": "3/14/2017",
    "text": "We split 3 tapas, garlic pitta (naan) and plain pitta (naan) between two people. The vegetable samosas came with salad and chickpeas and overall the food was very filling and nice. The other dishes arrived in metallic, cylindric bowls.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ik--IXyS20iqIOHltdkhFg"
  },
  "m7ccWjZCIro46gxENJ1Sig": {
    "date": "8/22/2018",
    "text": "This was my second time in Edinburgh and my second visit to Mother India.  I love the concept of the small dishes - so lovely to be able to try several dishes and share with your table mates.  Good service, comfortable setting.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4KtNl8oMui3Ie_xSgsrG3A"
  },
  "TuLQ3AlpqKadwyWjOStirQ": {
    "date": "1/17/2011",
    "text": "i think the concept of tapas style indian is a great idea, so everybody can share, good food, good service, will go again",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-K78Uw-3Z_Ph0JCx0FXNig"
  },
  "zSRVCihtJbxSDalJxcCKgQ": {
    "date": "8/17/2011",
    "text": "Good Indian! If your like me and feel a bit sick after a full Indian meal this is definately a great place to go. Dishes are small but enough if you have 2 or 3 :) The only thing about this place is you feel a bit rushed to order, eat and pay!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vbq-811-_beGtp-SSQhC5Q"
  },
  "_591hRRxMSbXaodfNI2VDg": {
    "date": "1/2/2009",
    "text": "Mother India serves Indian food in tapas style portions. Take a moment to think this through- is it not the BEST IDEA YOU HAVE EVER HEARD? Sorry to be so capitalised there, but think about it- you go for a curry with your friends, don't you want to taste a bit of everybody's food? Well here even if there are just two of you you get to sample a variety of curries and other tit bits, all beautifully prepared and delicious in their own way. The menu recommends that you select three dishes between two of you, so obviously my dining companion and I chose five. Plus rice. And garlic pitta. And wine. What was presented to us were little metal pots full of, amongst other delights, beautifully tender lamb saag, yummy daal and these brilliant baby aubergines which had been cooked with an incredible spice mix. I love curry. I particularly love curry that isn't just meat in generic yellow curry style sauce. This place understands that. We have a mutual love for real curry. It's not cheap, it's not expensive- each dish is around 4-5 and you really do only need three dishes between two although five is better because then you get to take home the leftovers and eat them cold the next day. Try it. It's great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GbrjLXBt14r_5QxJh25U_Q"
  },
  "pizUbGzjF0TzX5cr8bKQfg": {
    "date": "12/10/2009",
    "text": "My wife and I had lunch at this restaurant on the recommendation of a family member. We weren't disappointed. The staff were extremely friendly and chatty, they were proud of their restaurant and passionate about the food they cooked. The menu was fantastic. It is a tapas service, which gave us the opportunity to try food we wouldnt normally have. The food was authentic indian, delicious and the best naan bread I have ever tasted. The restaurant was clean and we will definately return when we next visit Edinburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hWQmN9kpP-Z23U05i_qbQQ"
  },
  "Ao5DJrfuSQPJryg3LPEjaA": {
    "date": "7/11/2008",
    "text": "been there twice. really very good, relaxed and friendly. Kids welcome. Excellent Indian food in tapas sized portions so you can order 3 or 4 between two. Very interesting small naans fitting the whole scheme of things. Plates come good and hot and the service is good",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kuHOfzksmWWzopefi92IjA"
  },
  "oubSJCJrQ19UVWdqcKQWAg": {
    "date": "6/10/2009",
    "text": "Went there a week ago having heard many good things. As it turns out, the service is good, the staff friendly and the food very tasty. My only moan is that while I get the tapas idea, this shouldn't apply to the rice - the portions were teeny-tiny. The individual dishes were overpriced by about a pound or so, but that's the tapas business for you.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LZr86Mk7R8dxkh2Jo2NGWw"
  }
}