{
  "oKlyOMHJE63t--aGdWzu0g": {
    "date": "3/1/2015",
    "text": "Never disappoints, whenever we come here we make sure we snapchat our friends to ensure the ritual tirade of envious rants.  The specials rotate semi regularly, keeping us coming anxiety wondering what they've got that's new.  I'm fond of the chicken katsu burger, a scrumptious and succulent burger you (probably) wouldnt find elsewhere in Edinburgh.  If that wasn't enough, there's the chilli cheese fries and the milkshakes . And the hotdogs, and the gluten free offerings.  I am filled with hate and love.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aR71p8x5-dGrbAdpVRJa_Q"
  },
  "2hoosJKWH2BEeriLd6g6YQ": {
    "date": "4/28/2014",
    "text": "So I ended up here totally by accident. I was popping into Loudons for a coffee and suddenly realised I was standing right outside Burger! So many people had said very excited things about this place so the coffee stop quickly turned into a lunch stop.  I came with my buddy Daniel, and we were both a little too taken in by the girl serving us. We were charmed/conned into getting chips, then upgraded to chilli chips, and i was also convinced to get peanut butter added to my vanilla milkshake. Don't get me wrong we welcomed all these additions! We didn't realise that chilli chips actually came with a load of DELICIOUS chilli on them, thank god Stevie was there to help out.  I opted for a double burger with bacon. Extremely tasty burger, although the bacon was  that chewy stringy crap, a timely reminder to why i never get bacon on my burgers! The beef was delicious, with just the right amount of toppings, and bun that held its structure until the end of the burger!  I think however the Milkshake was the highlight for me. You can tell an awful lot about a place by its milkshakes. These were thick and creamy, and ever so delicious, and not hideously overpriced. The peanut butter was a very good option to have with the vanilla shake. Frankly I might pop in here for milkshakes alone.  I didn't take in the menu to its fullest, but I'm definitely going to go and check it out again soon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "U55y_61paae1f6r6vgITJw"
  },
  "6PBT5uBGrg64DALRZPesXg": {
    "date": "8/9/2014",
    "text": "Genuinely surprised at the taste and quality given the price. The slaw is tangy and filling as was the classic Burger. This is perfect for vegetarians. There was great customer service, which I hope doesn't dissappear when this place gets as popular as u expect it will when everyone finds out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KTQvJRe0_ht6yY7YxiP9GA",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. Eco friendly fast food which tastes great. .",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KTQvJRe0_ht6yY7YxiP9GA/o.jpg"
      }
    ],
    "user_id": "17ET-QMUP9yQNE0HUa_zLg"
  },
  "V9LNrV52dGhEizdtNxxxAg": {
    "date": "3/9/2014",
    "text": "This place is awesome! Really well priced, quick & super tasty !!!!  I went or the 'Juicy Bluecy', highly recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "RQ-XhicY2_dG4qDbc4AoXg",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. So good !",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RQ-XhicY2_dG4qDbc4AoXg/o.jpg"
      }
    ],
    "user_id": "MJLxPW1PcKyP5iRM3dj5GA"
  },
  "BuFK9BA8nKK_7f0I8OvvQw": {
    "date": "2/16/2015",
    "text": "with the burger trend taking full hold of edinburgh, it's hard not to think that there may actually be a bit of a burger repeat.  however if hamburgers are on a constant loop than i have to say that Burger (as in the restaurant) is one of the places that is really doing the whole burger thing right.  i've sadly only graced the premises twice, but both times have left with a tummy full of seriously good burger nosh.  i managed my first visit back during the festival when i was on my way to a show nearby.  i went for a basic cheeseburger with some cheese fries which were outstanding (crispy and cheesy and loads of them!).  i also treated myself to an oreo milkshake that was probably one of the best i've had in ages.  i almost shed a tear when i finally came to the bottom of the cup.  my second visit was more recent where i indulged a bit and got one of their specials, fromage a tois.  besides totally loving the play on words i also totally loved the three cheese rarebit mixed with fried leeks that sat on top of a juicy hamburger in a delectable bun.  it was messy and glorious and delicious all at once.  i had plain fries which were still crisp and delicious and perfect for dipping into a portion of wasbai mayo.  sadly no milkshake this time, but two rekordling ciders to drink instead.  both visits to Burger were generally quite light on the wallet, both meals being under a tenner when you take out the drinks.  really good value for money since the taste is so good and the portions leave you full.  the only True downfall of this place is its location as it is miles from my flat meaning my visits are infrequent.  however perhaps that for the best as frequent trips to Burger may seriously ruin my waistline...",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "Z_xbO-Iaxbx-ZRPhLJK-Ew"
  },
  "Dnn0E4w1WV6khxqPVYrCkQ": {
    "date": "7/31/2014",
    "text": "There's no reason for me to give them less than 5 stars. I had a bacon cheeseburger and fries and it was delicious. The burger was messy but when it comes to burgers I think that's how they should be. The fries were a perfect combination of crispy yet soft and I must say I'm a fan. Yummy meal for about 7 sounds good to me. Right when I was starting to miss the burgers back home. Just what I needed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "StuNqEHnFreEjT8ZA24dZg",
        "caption": "Photo of Burger - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/StuNqEHnFreEjT8ZA24dZg/o.jpg"
      }
    ],
    "user_id": "PBhmUPZRSmzBgtyRVKGu2g"
  },
  "bRtiYeCwGtINn8wj2hZ-Ow": {
    "date": "10/15/2015",
    "text": "If you're in the mood for a delicious handmade burger, then this is the spot to hit. The bacon cheese burger was amazing. You could definitely tell the party was handmade by the amount of flavor. This was also one of the only places in Europe I was able to find American ranch for my fries.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_eiCCIlhlLcoxznCGrZsGw"
  },
  "v9qyKYm6s7Xuof1cuMU7bQ": {
    "date": "7/26/2014",
    "text": "First time in Edinburgh and was craving something low key and delicious for dinner. Read all of the amazing reviews for Burger so thought I should try it for myself.  I ordered the veggie chili cheese fries and a veggie burger with cheese. The vegetarian chili was delicious! Chunky with red beans and sweet potatoes, paired well with the shredded cheese and super crisp fries.   The veggie burger wasn't the best I've ever had, but had a unique flavor. Burger sauce was delicious and the bun was moist.  All in all, I would check this place out again next time I'm in town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sSwKWOzhfJTxVAce-lU3kA"
  },
  "wzNutsuMq6hCyc8HHS-0Qg": {
    "date": "3/13/2014",
    "text": "Atmosphere is a bit lacking so far although I was in on their opening day so can't really fault them too much!   Burger was solid, fries were a touch cold but still tasty, beer was boring.   I need to go back and investigate more thoroughly and hungrily.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lr22Y8AqhDdqLa3Wl0s_fw"
  },
  "VRASVSHLywvMi1N4zCUziw": {
    "date": "4/15/2014",
    "text": "Do not burger with Burger.   What a massive disappointment our first (and last) visit to Burger turned out to be; cold chips, not enough sauces in the restaurant, long wait for drinks and food and two tasteless and very greasy burgers. And we still don't know what their famous homemade special burger sauce tastes like.  On the plus side the chocolate milkshake was delish and the chipotle lime dip was tasty.   Maybe it was a bad night for Burger....",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g7yZeLDpLVY7knjNJLjtGg"
  },
  "gNtajlA-Zf8A3TJwr-DIGg": {
    "date": "8/15/2015",
    "text": "When a place calls themselves burger you expect them to deliver on that name. Unfortunately this place doesn't deliver. Burgers are average, small and pricey for what you get. Have had better in a pub. Disappointed is an understatement",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mzPMerkS6fpKyMFOcsvKyQ"
  },
  "iHOMAp6fBRbz4tzrD2-U2w": {
    "date": "3/19/2014",
    "text": "Here we go, another 5 star review for Burger! Because, folks, it really is that good.  Edinburgh is late to the burger party, so it's entirely possible that we're just all really excited that we no longer have to get on a train to Glasgow for good quality, reasonably priced (and most importantly, MEGA COOL) burgers, but hey, you can forgive us because Burger really does live up to the hype.  Burger isn't fancy, it definitely an upmarket fast food joint. There's no table service, you have to go and order at the counter, but you do get a buzzy, lighty up thing that signals when your food is ready. And the staff are friendly and happy to explain how the whole shindig works.  We went on a Friday evening, it was a little quiet but still had most tables occupied, though from what I gather it's lunchtimes when this place is really heaving (no doubt due to its proximity to many large offices).  There are specials on the board, and on the front page of the menu, as well as their standards.  My boyfriend went for the Reuben, one of that day's specials and like the name suggests, based on the famous sandwich. It took him a while to choose, as the special chicken burger (On the Bayou, bacon and avocado) sounded amazing too. For my part I decided to stick with the main menu, and was genuinely torn between a good old-fashioned cheese burger and the chicken katsu burger. I went for the latter, and oh it was good. I couldn't really detect the wasabi mayonnaise it was topped with, but it was delicious so who care. We also ordered chips (glorious, skins on, different sized, crispy chips), with burger sauce to dip, and milkshakes (for me, chocolate, for him, vanilla and peanut butter). The milkshakes were proper thick shakes, mmmm!  If I had to be critical, it would be that as chips have to be ordered separately it's not quite as good a deal as I first thought. The most expensive burgers were 6.45 - pretty good, right? Less good when you factor in the additional price of chips. But still a damn sight better (and tastier) than most other offerings in Edinburgh.  So come, come for the delicious burgers! They also do hot dogs, but eh, this is called Burger. So have a burger!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "Mqg4L8flJmg8pqeR-uYyRg"
  },
  "u2TrOQqGnlxJeeKe9_ZDyg": {
    "date": "7/14/2014",
    "text": "The fries were good without anything on them.  We originally went there for the Chicken Katsu Burger with cheese and bacon.  We also had a chocolate shake with raspberries.  The people working there were very nice.  We got a UFO table number, but it wasn't very busy, so she brought our food out to us,",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "auUzzG-CGiL07uM7vCY-XA"
  },
  "cPl9HltO1TlUmoo08Ur-vw": {
    "date": "5/25/2014",
    "text": "Well, I've gone past Burger on my way to the cinema a few times now, and it always piqued my interest...but I've always been in a hurry so never actually had the chance to go in before. However, my dining companion and I last night were entirely unsure of where to go for dinner, until I basically said \"hmm...why don't we try Burger?\"  We're both glad I did. Oh my god. This is basically the place I've wanted in Edinburgh for a while now.  So, we went in and were greeted by the friendly woman behind the counter, who basically showed us to our seats, brought along a couple of menus and explained how things worked. We had a quick look through the menu and daily specials, he had the chicken katsu burger (which was apparently fantastic) and I decided to try the bacon cheeseburger, which was truly top notch top nosh.  The sides? Well, we had a portion of chips (which were really good) and a portion of chilli cheese fries (which were better). The chilli was really tasty, a good mix of flavours and a subtle heat to it. Also, the burger relish was probably the best dip I have had in years and I'm now craving it again.  One last comment about the shakes. I had the special, which was a rhubarb and custard milkshake. I could do with another one of those right about now, and I'll be going back ASAP to see what else the menu has for me...  (My dining companion did have the complaint that there was no barbecue sauce available. I was happy with the burger sauce, but it would be a nice addition to the menu in future!)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "RBgpFyntVu4Iy6i0xoI5-g"
  },
  "djZC4w0b67HDgmlb_J0aMw": {
    "date": "8/13/2014",
    "text": "I've loved this place since day one and it had yet to disappoint. Amazing burgers, the specials are always very inventive and the staff are great. They've really nailed high quality fast food and is expect them to expand way beyond their two units based on the quality of the experience they offer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DdaPc_xbu6or0qcTPVd1bQ"
  },
  "gtksHWELVx4Tzy8D4pBK_Q": {
    "date": "9/2/2015",
    "text": "Food is pretty good and the milkshakes are lovely- however the service is shocking - had to ask for a refund when my drinks didn't turn up after 45 minutes. Slightly better at the Shandwick Place venue.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pcltzPoM2nSAGecQyJWWPA"
  },
  "T9DOUzEOOhZ0YMbKlS43rA": {
    "date": "1/27/2015",
    "text": "With a bit of time and fine-tuning this place may become good, but it's missing the mark on a few things as it is.  When you walk in, there's no host/ess's podium or 'wait here to be seated' sign (plus the furniture looks decidedly fast food-joint-ish, as does the food counter), so we just walked right in and sat ourselves down. A few seconds later a host (server? busser? not sure what he was exactly) walked up looking rather irritated and said, 'Well I see you've already found yourselves a table, so I guess I don't need to seat you.' We apologised for seating ourselves (in spite of there not being any indication anywhere that we weren't supposed to), and he explained to us that we were to order at the counter and then pick up our food there when it was ready. I'm still not sure why we needed to be seated by a host when there's no table service, but whatever.  We ordered at the counter, and were given a buzzer device that would go off when our food was ready for collection. The host/server/busser guy was just hanging around the food counter looking awkward and waiting for someone to walk in to be seated. We were given our drinks (a beer and a Diet Coke, both served in their cans - no glasses for either or ice for the soda) and we sat back down to wait for our food.  When the buzzer went off I got up to get our food at the counter, but the server was already bringing it over to our table. That was very nice of him, but it kind of continued the awkwardness and confusion for us. What is this place? Is it a sit-down restaurant with table service or a self-serve fast food joint? The furniture, order-at-counter arrangement, and drinks served from cans would suggest fast food, but the awkward dude trying to insert himself into everything you're doing makes it appear that they think they may want to be a full-blown sit-down restaurant, but can't bring themselves to commit.  The food was fine, but definitely nothing to write home about, plus the young man who took our order (who seemed to be new - he was struggling to find the right buttons on the register) pressed the wrong button for one of our burgers so we got the wrong thing. We got a beef chilli burger (which was supposed to be a bacon cheeseburger), a chicken burger, and an order of beef chilli cheese fries. The beef burger was pretty good, and less well-done than at most places (which was great - most places insist on cooking burgers too well-done), but the chilli was excessive, and while it tastes fairly good, the texture is a bit weird and not very chilli-like. The chicken burger was quite good, except that the wasabi mayo was a little heavy-handed and sinus-burningly intense. The chilli cheese fries were disappointing. The fries themselves were pretty lousy in both taste and texture, and there was just a tiny amount of cheese on them, which we had to shovel loads of chilli off of them to find.  All in all, I doubt we'll go here again, but if you want to try it, skip the chilli fries, double-check your receipt to make sure they've ordered you the right food, ask them to go light on the wasabi mayo if you get the chicken, and be sure to wait in the unmarked open space inside the entry door for the awkward kinda-sorta-server-dude to seat you.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jShUe-hkCGHyP3pbZYvAAQ"
  },
  "ISZozWVQwkm_TkCDABGcrQ": {
    "date": "7/10/2014",
    "text": "I'm going to try to write this in an unbiased way ... But to get it out of the way, I live in the city of great burgers (Glasgow) and Burger in Edinburgh wasn't able to steal the crown.   They have a good range of burgers on their usual menu, and a jumbled mix of specials. I opted for a cheeseburger on a gluten free bun with chips and burger sauce.   Good things were the amount of pickle on the burger, the chips (deliciously crunchy) and the burger sauce was out of this world.   Less than good things were the burger - overcooked patty, it wasn't particularly tasty and was topped with forgettable cheese. The gluten free bun wasn't pleasant so I ended up ditching it and just eating the burger.    I tried some of my friends chilli fries and thought they were pretty tasty. All up for me, Burger wasn't the burger epiphany I was hoping for in Edinburgh.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "So7jmPOkV3Xj7nhbkEE4FQ",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. Chips with burger sauce",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/So7jmPOkV3Xj7nhbkEE4FQ/o.jpg"
      },
      {
        "img_id": "GY1U8CJ4pqgSPP_tLaH0MQ",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. Cheeseburger with GF bun ... Skip the GF bun",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GY1U8CJ4pqgSPP_tLaH0MQ/o.jpg"
      }
    ],
    "user_id": "6EWIu6Ea04qcFAL3XSalvQ"
  },
  "1odzzvZKj2x8JxD5Tw-0qw": {
    "date": "9/14/2015",
    "text": "I have made it to Burger a couple of times and really enjoyed it. As you walk in, it has the feel of an American style burger cafe. The burgers are a bit smaller than what you would normally get at a gourmet burger restaurant, but are tasty nonetheless. Most recently I had the In Da Nile, which was a chicken burger on the special menu. SO GOOD! On a prior visit I had ordered the Chicken Katsu burger, which I was a little less impressed with but would be willing to give a second try at some point.  It's worth noting that you have to go up to a shelf by the ordering counter to get napkins, salt and pepper, and ketchup. I seem to think this is a bit more Nado's style more so than what I would normally expect at a burger restaurant. To be honest, I'm more 3.5 stars on Burger, but willing to go on the more positive side. Still one of the best places in the city for a more affordable hamburger.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "tXIN2tMOAiZH-lGwEaHOkg"
  },
  "3hliNXPLr8mn50imDXfs2g": {
    "date": "7/16/2014",
    "text": "I've been here twice now and I have to count myself a lucky devil for it. I like to think of myself as a burger connoisseur (doesn't every Yelper?!) and I'm a reyht picky so-and-so when it comes to me patties, so every time I find a jolly decent bite I'm delighted. Life is too short for crap burgers. (I may have high standards, but also, anything that oozes cow juice and melty cheese makes me happy.)  So that's where we are with these guys. I like the cut of their jib: why piss about with a fancy name? Burger is all one needs to know. They offer a range of specials, but I suggest going straight-up cheeseburger. (Call me a traditionalist, if you will, but who needs more than meat and cheese and bread and a pickle?)  The chilli fries are great. Don't think Americana: think actual minced meat chilli with a boat load of cheese and other niceness. Those, along with your I-don't-want-to-mess-about-with-a-solid-formula cheeseburger, should absolutely hit the spot for lunch. In fact, that's a little bit greedy of you.  What else? Free Wi-Fi (if you want to sit in all day and smell like cooked meats). Cool tunes. Drinks, obvs. Simple decor. Lovely, patient, accommodating staff.  Warning: On a sunny day that cushioned thing that lines the window becomes hotter than the earth's crust, covered in lava and actual hell fire. The blinds don't go any lower. Sweat it out or swap seats.  Je suis un FAN of this wee place.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "itw5t-iHS_gB-LjmHwx1MQ"
  },
  "Pk39K_uPe7X_fXkgR3mZDw": {
    "date": "8/2/2015",
    "text": "Meh. I did not have such a great experience with this place. The venue seemed a bit stale, and where we sat smelt very 'interesting'. Ok we can take a bit of rough and ready from places but for the price of the burgers I would ask for a little bit more wow factor.  Burgers themselves were ok, I had the Katsu chicken, and Ben a regular joe one. The Katsu burger did not seem to have enough taste and the normal burger was just very normal.  Not in a great urge to go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "rDacT7_YW2-geunGcmgeEw"
  },
  "oM93rdOnROhFGei2KvVHDA": {
    "date": "4/27/2014",
    "text": "After so many other yelper hailing this as a sucess, we had to give this a shot!  You get a seat, then a menu then order at the till then get a buzzer.  Buzzer goes off and hey presto you collect your shake and burger!  Simple service so far.  My shake consisted of vanilla and choc chunks - mmmm I tell ye F-a-b-u-l-o-u-s !!!  The fries were out of this world - crispy and potato like!  I choose the chicken patty which had goats cheese pesto and tomato - a fantastic combo and was one of the specials - i would have it again!  Just wish the portions were a little bigger for the price but all very TASTY!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lTls97vpMjH8-dVpfETqUw",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. Burger",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lTls97vpMjH8-dVpfETqUw/o.jpg"
      },
      {
        "img_id": "KLxqlAvKUOz1pRmu6M184w",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. Chilli n cheesiness chips",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KLxqlAvKUOz1pRmu6M184w/o.jpg"
      },
      {
        "img_id": "xsfNCk_O9fM6UHKeFXATsw",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. Menu for you",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xsfNCk_O9fM6UHKeFXATsw/o.jpg"
      }
    ],
    "user_id": "BhYROfCjIJsKUk22_IVHig"
  },
  "6hOl3Aeja8SuYLheikB68g": {
    "date": "8/16/2016",
    "text": "I was so disappointed. Their specialty burger is pretty much a burger drenched in an average-tasting chili with jalapenos, pickle, and bacon, but the average chili overpowers it. They do put their \"BURGER.\" sauce in it, but you can hardly taste it because of the average-tasting chili. The patty was not a nice medium like I prefer, nor was I asked how I wanted it. It was really nothing special at all. It wasn't particularly fatty, nor did it have a nice crust that would evidence an attempt to increase the Maillard reaction. Chips were solid. Price was meh.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "B7VzLfDEhEzIdjw7dsqOyA"
  },
  "eBq8jEpAI6B8hJnX2ViCdQ": {
    "date": "12/3/2016",
    "text": "Not bad for a cheapish burger but small milkshakes and soft fries let it down. Quiet for a weekend night though, so no stress there. Would come back if one or two initial choices proved too busy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jEZ8AvJCGoZ0fbaQZIxKKg"
  },
  "mkFPYrm5upm4__tAs7aaSg": {
    "date": "7/9/2014",
    "text": "So we went to check out burger this lunch time and what we had was a pretty damn fine meal if maybe not the best burger I've ever eaten. Saying that, with living in Manchester I really am spoilt for choice in terms of carnivore cafes!   A good general menu with main options offering normal, cheese, chicken and double options of all - there's also a daily specials board which showcased items such as Thai fish cake burgers - which 2 of out group had and enjoyed a lot.   I went for the double cheese burger and it was pretty damn good! Definitely from the in and out school of burgers - filling is what you get with the fries rustic and tasty! The vanilla milkshake was also pretty damn good.   Overall a good choice for lunch - nice!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "SdyaF3_mFMdCig_25qW7TQ"
  },
  "twNFbueLtBypEEtlXxQ1Kg": {
    "date": "3/23/2014",
    "text": "Chillitensity - Ooh burger, burger  This what exactly what I hoped for, top quality burger joint.  It's not five star because it didn't change my life, but it's solid four star quality product. And I am concerned that they are on my drive home every night, which could have a serious impact on my life....  The service is positive,engaging, straight forward order at the counter and get it when it's ready.   The food is great, really good home made burgers. With an excellent array of options and wieners available, though most of the specials are hot dogs.   I have to highlight the hot sauce, it's off the hook, and it is genuinely hot. A lot of places do standard hot sauce which panders to the lowest common denominator. Not these guys, it's chillitensity is fantastic !  Shakes and desserts, we didn't go for, but I will go back for it!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 4
    },
    "photos": [],
    "user_id": "lOZKlSyQa-jSv4HZ66okGg"
  },
  "e73ckjX4Y-UdbAgFs_UK2w": {
    "date": "3/16/2014",
    "text": "Yum, yum, yum!  Will try not to repeat other diners reviews so here goes:  Loved the burgers. Juicy, well cooked and good quality, home made burgers.  Loved the chips. Partly skin on, yummy, perfectly cooked, crispy where it counts and fluffy inside.  Fab gluten free buns (burger gf) - looks like brioche buns but held together really well and really impressed they do gf buns too!  Great ice cream - maple syrup and walnut home made on the premises. 1,75 for a decent sized scoop in a tub with toppings at 50p each. Yummy as were the toppings: honeycomb and I also asked for peanut butter. Proper US peanut butter.   Toilets - lovely and clean. Always a good point.  So, burger, chips, coke, ice cream and toppings, about 12.50. Went home in food coma and raved about the gf greatness of the burgers. Staff friendly and left us to chat. Love the environmental commitment with Vegware packaging being used. Can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "frthTngbBHgSdk4j85HmEQ"
  },
  "Ou-Ni4YovguEWr2lgTVANQ": {
    "date": "3/23/2014",
    "text": "Having walked past this place a few weeks ago before it had opened, I was keen to try it out. The positive Yelp reviews posted sealed the deal and I headed here on Friday night for a end-of-week supper. I was a bit worried we wouldn't get a table without booking, as this seems to be the case for many Edinburgh restaurants on weekend nights, but it wasn't that busy.   The menu was dominated by burgers, with a couple of specials available and a few hot dog dishes thrown in too. There's also a nice wee kids menu and  a good range of drinks and American-style milkshakes.   The order-at-the-till style service works well, and the food was served promptly. It's fast food done well. My burger, breadcrumbed chicken with avocado and lemon mayo, was delish. The bagel-style bun was fresh, and the fries blew MacDonalds' out of the water.   All in all, a really nice meal. The service was cheerful. Hopefully word gets out about how nice this place is. In my opinion it's better than competitors such as GBK (on price) and Wannaburger (on general quality of food).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "2b7AgGJbUgBKBGH2zOzH6A"
  },
  "vMQqb9yNuyLQ3S3nEluk9w": {
    "date": "7/23/2015",
    "text": "Except for being reasonably priced, there is nothing good about this burger. They seem to mix onions with the meat... Why not boil it? The rest is good, but they are missing the point... This place is ranked first in Edinburgh... What a disappointment.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YhkMLyEsQd2-nG4BLkUs6w"
  },
  "XLPtTgLXNeysH3cXPpoBLQ": {
    "date": "9/29/2014",
    "text": "I came here with a friend for a late lunch/early dinner. The interior was clean and minimalist. The setup was definitely that of a fast food joint, i.e. you go up to the cash desk to order, but it was definitely classier. The fonts were cooler, the lights not so blinding and the offerings a little more sophisticated. There was also a vibrating thing which lets you know when the food is ready.   I ordered the veggie burger. Seemingly cheap upon first inspection (4.95), by the time you have added your cheese and fries, the price is more like 7-8. The meaty options are more expensive.   Service was fast, sauces like ketchup and HP were available, as were jugs of water.  The veggie burger was interesting, made of beetroot (which I usually hate), chickpeas and tempeh. The burger came with a brioche bun which was nice but I would have preferred the classic sesame variety. The texture was pretty good though it was quite starchy and filling. My friend had the chicken katsu burger, and we both thought that our burgers lacked something. For me there was not enough (if any) relish to balance out the saltiness. My friend then rightfully pointed out the lack of lettuce... Yes, that was it! The lettuce would have made all the difference to this tasty but unbalanced burger. As would the relish.  The chips were obviously homemade, boasting the remaining slivers of potato skins. There were however a little bit on the dry and tasteless side. More salt or less frying? Not sure, but more work needs to be done. It would be better if the chips came with the burger too, considering the price.  I probably will be back, but not in an urgent hurry.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "HvQ576LJm6i6QZuTwl7WVg"
  },
  "OU_MPaIJ6pqIiUPp9VYI4A": {
    "date": "5/30/2014",
    "text": "After all of the crazy excited reviews I've been reading, I wanted to give Burger a try.  I came here last night with a fellow North American and we waxed poetic for a bit about how much Edinburgh has changed since we came here to study (nearly 8 years ago!) - now, you can get good sushi, there are Mexican joints popping up all over the place, bagels and cream cheese aren't a crazy weirdism, and burgers are done right.  For my first visit to Burger I decided to go basic - a standard burger with normal fries. The burger was a bit smaller than I'm used to (though admittedly it's probably just the right size), and the portion of fries was massive. Next time, I would definitely try to convince someone to split the fries with me, because there's no way I have enough self control to leave any uneaten.   I love the inclusion of pickles and \"burger\" sauce - it elevates the burger from being a meat sandwich to something tangy and delicious. The brioche bun was quite good, though I did find it a bit dry and could probably have scraped some of the innards out to get the meat to bread ratio a bit better.  The fries.... the fries that everyone else seemed to love, left me a bit flat. Skins on?  Great. Lukewarm?  Definitely not great.  They were good, but left the distinct impression that they had been cooked a little while before and kept warm somewhere, leaving them a little limp and a bit meh for my liking.  Twice fried are the best anyway, so why not do the second fry as they're ordered?    To sum  - I liked the food. The burger itself ranks as one of Edinburgh's best, if not THE best. The whole experience, though, fell a little short. In the short column I'll include the fries, the price (6 for posh fast food seems a little steep, but as I write this I feel like an old person reflecting on times of yore when a cow cost a tuppence), and the design/decoration of the place.  Burger is decorated in the currently hip fashion of industrial chic. It's not a warm place that makes you want to stay and enjoy a drink or two. You arrive, you order, you eat, you go. I don't eat food for the sole purpose of filling a hole in my belly. I like to enjoy myself.  There was nothing in the atmosphere that invited me to stay a while, that gave me a reason to pay 4 for a 330ml bottle of beer.    It's for this reason above all others that, while I'm sure I'll return to Burger at some point while I'm on a night out and looking for something better than chippy food, I'm not hugely likely to purposely plan a meal here in the future.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4UQfst9jve4GCSfWpWn2uA"
  },
  "Gdi8Qsw6C--664jEUpXocQ": {
    "date": "8/9/2014",
    "text": "Took refuge from the rain in Burger last night to catch up with fellow yelper Nichola c and to fill our bellies! Burger was cheap and cheerful and our food arrived super quickly which was perfect as we were starving! As I was expecting it to be a little more like a restaurant I was disappointed about the lack of side salad (but I'm a weirdo, who orders salad with burgers...) but for a fast food joint I really can't complain :) they cater for gf and veggies which is wonderful, and whilst the gf veggie burger maybe wasn't as pretty as the regular burgers it was still delicious! Bread was a little dry but at least there was a gf bun option, and didn't stop me nearly devouring a 2nd Burger! Giving Burger 4\\5 for a quick burger fix, you pay for what you get :)",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_fi4u5g9h1xETmVg6yex9Q",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. Cheap and cheerful wee burger bar, great for grabbing a quick meal! Cater for gluten free and veggie which is great :)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_fi4u5g9h1xETmVg6yex9Q/o.jpg"
      }
    ],
    "user_id": "Njr5qBXZ_RbWyXk7rLLQyA"
  },
  "mmKI1QlZjGlwRfl2xgI7Wg": {
    "date": "3/26/2014",
    "text": "There is a certain buzz which goes with a new place and while I think Burger is good, I don't think it is great... The burger I had, a basic beef burger was tasty enough, though the patty felt a little small. The fries which accompanied it were hand-cut style and perfectly crisp. So all good there, well sort of...  I hate to cast aspersions but the hand cut fries are near identical to those served with the burger in the Library Bar within Teviot Row House, I don't doubt they are hand cut, I'm just not convinced they are hand cut on premises, which is what one might assume, though to be fair it doesn't state that anywhere.  Next we have the burger, it is a decent burger, but it isn't really that much better than WannaBurger and the basic beef burger is a 1 more. Sticking on this vain, why does Burger only offer hotdogs at the weekend, in my opinion either they should be on the menu or not.  Now while this might seem negative I did enjoy the meal and I will likely return, however I am also a realist and realistically Burger is good, but I am not convinced it is much better than it's closest competitor located in the west end...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "GN3wBXDaLLmY6Oitfy3T8g"
  },
  "wmhD01_VgUVVOapSYR8plw": {
    "date": "5/13/2014",
    "text": "Om nom nom. After finishing exams a trip to Burger was just what the doctor ordered (well probably not actually) but it was the perfect end to my day!  I ordered the chicken katsu burger with scrummy wasabi mayo and  fries. The boy went for a coconutty/blackbean/mango chicken burger from the specials board. We also had some chilli cheesy fries and plain fries and both were crispy and delicious. Their milkshake was super tasty (and so thick you had to suck your cheeks in to get it up the straw). We had the chocolate one with peanut butter and it was lovely and ice-creamy!   The staff were friendly and it was nice and chilled out with a mixture of couples, work friends, families etc. Would definitely go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ybURek54OkDGsyqWhBmUjQ"
  },
  "-TLUyR89YJNBYJz8Ybs4JA": {
    "date": "3/15/2015",
    "text": "I have recently been slightly obsessed with the idea of dairyfree (and vegan) alcoholic milkshakes,  so when I read that Burger not only do dairyfree milkshakes with soy milk and sorbets,  but they also can put in alcohol too,  I had to visit asap.   I emailed the day before to double check vegan options from the menu,  and if we were allowed to bring our own unopened pack of cheese for the burger and the curry poutine. I received an email back with a very helpful outline of the regular menu items and the specials which could be veganised. This included the veggie burger (a patty made with beetroot,  quinoa,  and tempeh)  and the veggie dog,  and veggie chilli,  with chilli sauce or chipotle and lime sauce (not the burger sauce as it contains egg).  You have the option of paying 35p for a dairyfree bun,  but it isn't vegan as it contains egg. We could bring our own vegan cheese and also our own buns.   When I replied back and happened to mention that I was looking forward to trying their alcoholic milkshakes she offered suggestions of ingredient combinations,  and also to bring coconut,  apple,  and mango sorbets from their Shandwick Place branch across for us as the Fountainbridge branch only had pineapple.   We bought some Violife from Real Foods and some burger buns from a nearby Sainsburys,  and when we arrived we had absolutely fantastic service in going through our food and drink options (note: we had made reservations so they knew when to expect us).  We couldn't have had better service. The only niggle really was having to provide our own buns; problems with sourcing vegan rolls seems to be quite commonplace,  made especially difficult with the popularity of places these days to use brioche buns. For dairy cheese you have to pay extra anyway,  and some places don't even allow you to bring your own dairyfree version so that wasn't a big deal.  The burger was good,  I was so excited to have an oozy cheeseburger I can't really comment much more as I pretty much inhaled it and didn't stop to consider other flavours.  Also,  as we'd gotten the poutine with flavoursome curry sauce my normal chip-dar didn't really kick in. The cheese didn't melt in as well as it had done in the burger, but we enjoyed it nevertheless.   For the soy milk based drinks we got one apple sorbet,  vodka,  and caramel milkshake which delicious. Very appley. The other was Havana rum,  coconut sorbet,  Oreos (accidentally vegan,  may contain milk traces),  and honeycomb. The staff member who brought it over was a bit concerned at the perhaps unappetising greeny-brown colour of its combination, and brought us over a complimentary mango sorbet & peach schnapps mix, but as a former Vitamix owner who has created all sorts of coloured combination of drinks,  I was keen to keep my Oreo drink of heaven! It was absolutely delicious,  the colour didn't put me off at all!   The gray decor of the place isn't that appealing,  which is a shame as some colour would create a more pleasant environment,  in my opinion. It's a great place to go for an informal bite to eat before a gig,  or drinks and snacks after work,  but I would likely go elsewhere for a special occasion.  For me, the food menu is fairly average,  but the drinks and service are superb and if I was looking for a place to go with friends for a quick bite I would definitely go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zgVVI9Anzoy7b8pZdaHmXQ",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. Poutine!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zgVVI9Anzoy7b8pZdaHmXQ/o.jpg"
      },
      {
        "img_id": "ylrgQcy8fkILgOq32bniaQ",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. Veggie burger (vegan cheese and burger bun I brought with me)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ylrgQcy8fkILgOq32bniaQ/o.jpg"
      },
      {
        "img_id": "bvDHSzjyZLO4-Lno3SbcsQ",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. Apple/caramel/vodka milkshake,  and Oreo/honeycomb/coconut/rum milkshake. Delicious!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bvDHSzjyZLO4-Lno3SbcsQ/o.jpg"
      }
    ],
    "user_id": "RFxjYeLW_aYLdVW3PBwFNg"
  },
  "XxNXyAJzem3mqTsbERsC3Q": {
    "date": "10/3/2015",
    "text": "Perfect burger. The sauce on it is really tasty. The meat is never gristley nor dry and always perfectly cooked & seasoned. We get takeaway from here quite regularly and are never disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "F0nFAY1Qi_7it_Q52n3nTw"
  },
  "q4ft2564h5DehJTJ_F_G9A": {
    "date": "12/12/2015",
    "text": "Been to burger a couple if time as it is located very near to my office and i really do like their food and their menu. I  tried the normal burger and and the bacon cheese burger and both were really good and filling; once i tried to make it a double and it was really a lot and the chips went almost untouched as i was too full; i would definitely recommend a shake with your meal as they are very good; i had the apricot smoothie and it was fresh and delicious :) during lunch, the place is pretty crowded and service is not as fast as you would love for a burger place but overall still a great spot",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ThHJVG58S2pqc8vJU4fDkA"
  },
  "uLWpdiUjNuUgPnvR_Lv28A": {
    "date": "4/8/2016",
    "text": "What we got: Beef Chilli and bacon burger, cheese fries, vanilla shake.   Would highly recommend This place. I love how there are specials on the menu. The names for the dishes are great and they have boozy shakes which are well worth a try!   The burger tasted amazing. A very generous serving of beef chilli, well seasoned and had a fiery kick! The bacon went well for me, though it may be too much for some. The cheese fries were well cooked, the cheese was of a good quality and went down well! Definitely recommend the vanilla milkshake, but perhaps try the boozy shakes if you're in for something more adventurous!   Burger Review: Quality: 8/10 | Creativity: 9/10 | Value for : 7/10  Other wee things: Service: 9/10 | Ambience: 7.5/10",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "i3-hOhlVVVDLu6hiiGEvpQ",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. Beef chilli and bacon burger, cheese fries, vanilla milkshake.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/i3-hOhlVVVDLu6hiiGEvpQ/o.jpg"
      }
    ],
    "user_id": "-ZBReTMh4DEGjc9XtteCtg"
  },
  "dZjKdOgF29WzL_-A1n6Oww": {
    "date": "7/28/2018",
    "text": "Good burgers off the main tourist area of town. I had the bacon cheese burger which was a little salty for my taste. Everyone else loved their burgers and gave them 5 stars.  Staff was friendly and drink selection was unique.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1Rq2Q6p-M2EzEmRdG7heug",
        "caption": "Photo of Burger - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1Rq2Q6p-M2EzEmRdG7heug/o.jpg"
      },
      {
        "img_id": "nNdZyjs2cGipfvZ5vvs3yA",
        "caption": "Photo of Burger - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nNdZyjs2cGipfvZ5vvs3yA/o.jpg"
      }
    ],
    "user_id": "avbAP7ZQpDUgNcDywZtCsg"
  },
  "5NLpaS9szBgnQagVEDD4AQ": {
    "date": "8/20/2018",
    "text": "Kind of expensive, but absolutely delicious. My husband and I both got the bacon cheeseburger, fries, and drinks the total was about 30.   We stopped in while visiting from the states and I wish I could go back all the time! One of the best burgers I've ever had. The bread and butter pickles were amazing, and I'm not usually a fan. The restaurant was quiet on a Tuesday afternoon, even during the Fringe. It was nice to get a calm moment to sit and enjoy a fantastic burger.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zAoM6_ddbOCsO_Ea5a8iIw"
  },
  "luL9Sz9yFmRyBnqXHzpPgA": {
    "date": "9/18/2016",
    "text": "This was the first place we picked to eat during our 3 day trip to Edinburgh, it was close to our hotel in Haymarket and provided some well needed respite from the rain. Our waitress was really lovely, very helpful and polite.   I went for the cheese burger and my friend went for the double cheese burger, we got onion rings and cheesy fries to share. Stodge fest. The burgers came in brioche buns.   The burger was ok, it wasn't anything special and the meat tasted a little fatty. The onion rings were nice and crispy.. the cheesy fries were deadly, I only managed a few as I'm not a huge fan of really stodgy food. We couldn't finish the food, but the staff kindly packed it up for us.   I wouldn't choose to eat here again personally but in itself, it was ok.   Random note: The tap water in Edinburgh is SOOOO nice! I could have sworn it was mineral water. We just ordered tap water wherever we went.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "if-Rttm6ACqXVuklL6kpLQ",
        "caption": "Photo of Burger - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/if-Rttm6ACqXVuklL6kpLQ/o.jpg"
      },
      {
        "img_id": "2Pbkzlp6tfGS_n-TDFmM4Q",
        "caption": "Photo of Burger - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2Pbkzlp6tfGS_n-TDFmM4Q/o.jpg"
      },
      {
        "img_id": "50oPLoVrVXqdCxR66k90Zw",
        "caption": "Photo of Burger - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/50oPLoVrVXqdCxR66k90Zw/o.jpg"
      }
    ],
    "user_id": "M2_QQ2h2fGUbYk2BTpk-bA"
  },
  "i-YikjO_K0VBzH03OFP4Hw": {
    "date": "3/14/2016",
    "text": "This review is solely on the veggie dogs. I mean where else  can you get veggie dogs? Really where? If you know a place please tell me. Burger does right by us non-beef eaters, in supplying a tasty veggie tofu dog, with delicious and sometimes unique toppings depending on the special. Its one of the super long dogs, so you feel full and get your monies worth.  I have had their chicken burger and a falafel burger before, nothing to write home about, but their tofu dog stands out for me. One because you can't find them other places ( that I know) and 2nd because their really delicious and their toppings make them even better!  So THANK YOU Burger for not just being burgers ;)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "BpKuNkYgAuisCNZlSzfUAQ"
  },
  "CDAkVJkDiQ43c2iCi2XzKA": {
    "date": "7/24/2018",
    "text": "We ordered the vegetarian burger, the cheese burger, the grilled chicken burger, the bacon burger, sweet potato fries, and cheese fries. We also tried Irn Bru for the first time. Service, like all places in the U.K., is a little slow compared to the US. The vegetarian burger was probably the best I've had...big portions, loads of toppings, and great sauce. Cheese fries weren't great, and we likely wouldn't order again. Sweet potato fries were nice and crunchy. Irn Bru is probably just a one-time experience for us. Kids all finished their food...that's a first!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "I_Ow58lFAoprdxDHLxzfKQ"
  },
  "tdmUFLkKtxGft9YZ53XWnQ": {
    "date": "5/2/2014",
    "text": "Ooo wow, who doesn't love a good burger!   This space was right next to the yelp event next door, so I had to try the burger and fries.   I went for the special (beef with Stilton, port glaze and apple chutney), fries and wasabi mayo, and the stem ginger and Jamaica cake ice cream milkshake.   The burger will probably seem smaller than what you'd expect, but that's reflected in the price. Bigger isn't always better, as I think I do prefer a small burger like this so that I can have fries and be able to wash it down with a milkshake, and maybe even dessert.   The burger itself was really good, enough Stilton, soft bun. It was delicious. I liked that the shake is made with ice cream, and a good thickness. A lot of British shakes I've had are made with milk and more on the watery side. The only thing I wasn't happy with was the wasabi mayo. It didn't have any edge at all, in fact, tasted like 100% regular mayo. I wondered if maybe I was given a portion of regular mayo instead of the wasabi. I even ate a few globs on its own - no wasabi Flavor, zing, kick, or anything remotely close.  Maybe they need to look into redoing that dip?  It only cost 50p, but it was silly that it tasted nothing close to wasabi.   Anyway, make sure you check out their specials menu, they have a lot of interesting stuff! Unfortunately paddy didn't know there were specials, and missed out but I'm sure he'll be back again.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "t0_lfszOv627Ktv6Etuxkw",
        "caption": "Photo of Burger - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/t0_lfszOv627Ktv6Etuxkw/o.jpg"
      },
      {
        "img_id": "Ty3RkUpE13BOYCbtsPB6hg",
        "caption": "Photo of Burger - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ty3RkUpE13BOYCbtsPB6hg/o.jpg"
      },
      {
        "img_id": "3YiNjAtPhTUbTtf7CK9Mog",
        "caption": "Photo of Burger - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3YiNjAtPhTUbTtf7CK9Mog/o.jpg"
      }
    ],
    "user_id": "xJKnmUxpJfzPovCTsT1kLg"
  },
  "IgKn3zGp7GJI709hLlVB3Q": {
    "date": "9/23/2015",
    "text": "Loudons was closed, and we were hungry, and despite this being a former funeral home we decided to try a burger. I'm from California and I've had better backyard burgers than what I had here. From what it tasted like, it was a frozen burger heated up and served. It's thin, flat, and didn't taste like any beef I've had before.   They do have good sauces, and my husband, who had onions and enough sauce to marinate the whole cow, says his was fine. Ok, then why not just eat the sauce? I was there for a burger, and my first couple of bites are always of the burger itself to see what it's like. And I needed sauce. I could not eat what I was holding in my hand without drowning it in sauce. This is not the place for me.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "spfEhU7bSewvfbDt8kmuBg",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. Quiet, a bit sterile",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/spfEhU7bSewvfbDt8kmuBg/o.jpg"
      }
    ],
    "user_id": "tVrGBW6rj1uebWnqjY-iTQ"
  },
  "Ob_w8YTXDv19Vn9XJwIYnQ": {
    "date": "10/27/2014",
    "text": "So a couple visits, and a couple specials, later these guys have gone up in my estimations. My previous concerns around menu and costs still stand, however with the ever-increasing competition popping up around the place, each with even more inflated prices and precisely the same variety issues, Burger. has improved by comparison and, as a result, look to be better value compared to many of their peers.  Other reasons for the extra star include the website; they now include their temporary specials on there which is a big plus and saves me having to swing by just to have a nosey. And also their pending Christmas menu which will become available as of the 1st December. A great idea and one I'm looking forward to taking advantage of.  Hats off to them for expanding to the west end as well. Hopefully the next expansion will see them make it to Leith, perhaps as part of the continuous facelift of the Walk, and save me a ten min drive henceforth.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "P8yaitLgPk_60aJ1SdZNWg",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. Xmas 2014 specials. Available all through December. Ho Ho Ho!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/P8yaitLgPk_60aJ1SdZNWg/o.jpg"
      }
    ],
    "user_id": "9RGIvzCGHp8ELF_JgAlbZA"
  },
  "8xgrCr3nNXxx2usOSqA94g": {
    "date": "9/29/2014",
    "text": "Oh Burger, how I miss you. This was definitely a food highlight (one of many!) during a recent trip to Edinburgh .  I had a Thai fishcake burger here - something I'd never even seen on a menu before, let alone tried. If you love Thai fishcakes and you love burgers, chances are you'll love this little gem. It's a great size and pretty damn tasty, but beware - you will make a big old mess eating it! Perhaps not very date-friendly food, but great if you're just with your friends and have a hankering for a really good burger.  The chips, too, were amazing and we opted for a variety of different sauces and dips which I remember being very delicious - the spicy one in particular!!   The portions here are really good - you won't be left hungry, though you may be left craving more. The decor of the place is really cool and modern, which makes for a nice setting! Beware on a sunny day though - we were sat up against a huge big glass window and it was very warm indeed, so maybe avoid those seats in the sun if you're prone to over-heating.  All in all, a great experience! If I'm back in Edinburgh, I'll be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jARfiGEy-hSykIl2d5q6Xg",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. Thai fish cake burger- really great!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jARfiGEy-hSykIl2d5q6Xg/o.jpg"
      },
      {
        "img_id": "xN4UowW-Jt7w8GelCfvC5g",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. Chips.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xN4UowW-Jt7w8GelCfvC5g/o.jpg"
      }
    ],
    "user_id": "wK7unWb9i25ekCP37sWtfQ"
  },
  "zqcy2MGvKm2Lw-SpYHIk3Q": {
    "date": "4/28/2014",
    "text": "sda jio;das m,/ewa ijo'dsankfds[pw ...Oh dear. It looks like my fingers are too fat now to type. I am instead typing this laboriously using a paintbrush held between my teeth. I also fill my entire sofa, and hang over the sides. But if you seize the folds of my face and lift them to seek out the features underneath, you will see something that looks like a radiant beatific smile. Friends, I tried Burger.  I tried a chicken katsu burger with pickles in a soft glazed brioche bun with added cheese and bacon. I tried a bag of delicious fluffy skin-on fries. I tried a chocolate milkshake with raspberries, a milkshake so thick that I had to suck harder than a Dyson to get that stuff up the straw. I tried to find the words to describe my joy, and I found only sweet, viscose tears creeping down the creamy rolls of my cheek.  It might not be Michelin star, but I am a Michelin Man, and I am so very, very happy.",
    "rating": 5,
    "rated": {
      "funny": 12,
      "useful": 4,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "t_jYZ4F4Fb7FNgbzucbH9g",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. Buzzer of glory",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/t_jYZ4F4Fb7FNgbzucbH9g/o.jpg"
      },
      {
        "img_id": "7fxuycAeQXqDaRm8opQPbA",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. Oooooh it&amp;#39;s so niiiice",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7fxuycAeQXqDaRm8opQPbA/o.jpg"
      }
    ],
    "user_id": "bcxcQhp0sKYd9eUnEVUzPA"
  },
  "YmCbtB1_ZXDUiVZ2Hod3fw": {
    "date": "3/6/2014",
    "text": "They sell burgers (and hot dogs).. you go to the counter, you order, when your buzzer goes off, you go and collect your tray of goodies.. it's as simple as that..  Unpretentious and unassuming, this place does not pretend to be anything it's not.   The brioche buns and flavour combos are spot on. Chicken katsu burger served with wasabi mayo was an absolute delight. Panko crumbs were crunchy, the chicken was succulent and juicy with the richness offset by the tartness of a gherkin.  Earl grey custard ice cream is to die for, maple walnut ice cream borderlining too sweet for this lady but perfect for any sweet-tooth. Chilli candied walnuts on top needed a bit more heat to make them fun.  Service at the counter was super friendly and she offered a taster of the earl grey custard ice cream without hesitation.  Price point is fabulous for the quality you're getting. Would highly recommend and will definitely be back again soon!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "ye-8ezViLeUNglL9ks6GRA",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. Chicken katsu burger",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ye-8ezViLeUNglL9ks6GRA/o.jpg"
      },
      {
        "img_id": "NDAJXlpKtdqwkn18YncrVQ",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. Ice cream..",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NDAJXlpKtdqwkn18YncrVQ/o.jpg"
      }
    ],
    "user_id": "J6E6NSpJqMBib9ydbchicg"
  },
  "SLSMtaZfiK1V5YG7NBSUBA": {
    "date": "3/25/2014",
    "text": "Jenny L and Tom G eloquently expressed everything that I would say about Burger. It is amaazzzzzzzing. I am so happy to have a really tasty burger joint in Edinburgh.   The service is really good and super friendly. When my partner and I walked in we were warmly greeted and invited to take a seat.   I've only visited once (so far) but I definitely see myself become a regular. I had the cheeseburger. The meat is so flavourful and juicy. I am a big fan of the bun to meat ratio. And the cheese! It was better than typical 'American cheese' or mature cheddar (for a burger). The people here have fine tuned the American burger formula but have also made it their own. I also like their special sauce.  I had the chilli cheese fries that were on special. Pretty tasty. I was impressed with the amount of beef that was actually in the chilli.  I like that they keep the skin on their fries. It reminds me of New York Fries (a chain in Canada) but they are skinnier here and I think better.  I love Burger.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "akSdLFrAz9Y-73v5UZF4bQ",
        "caption": "Photo of Burger - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/akSdLFrAz9Y-73v5UZF4bQ/o.jpg"
      }
    ],
    "user_id": "jY-M01vatSmfy-mK_g0h9A"
  },
  "MxaaO-tTSq6HyNU3Ox0-QQ": {
    "date": "1/26/2015",
    "text": "Aw, Burger. First of all, a confession: I have a cultural bias.  In the states when you go to a \"burger joint\" similar to Burger, you typically go up to the counter, order your food, then are seated with a number. When we entered Burger for the first time we were right off the bat shown to a table. As it was a bit slow in there, and we'd never been before, we missed the glaringly huge \"Order Here\" sign at the front counter and hungrily awaited our order to be taken. Minutes crawled by before we realized our error: but then again, the way we'd been sat at a table made us both think table service. Again, maybe that's the burger-joint-trying-to-be-one-thing but also having the politeness of U.K. culture to confuse the issue. Needless to say, we felt rather dumb when we realized!  Eventually we did indeed get our burgers, which were lovely. BUT... but! I've been to so many burger joints in my lifetime. Big ones, greasy skeevy dive ones, fancy ones, tiny ones. And even off the top of my head most skeevy dive burger joints in the states would have blown this small-ish burger out of the water with size, price, and deliciousness. The fries were also good. But again. That bias doth creep in.  Four stars for taste. Three stars for confusing mixed atmosphere. Two stars for environment with no help to be found from the staff milling about for some length of time when we were looking around confusedly with hungry eyes.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6EZNSH8HF-SQcKIy7VzoYQ",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. Veggie burger!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6EZNSH8HF-SQcKIy7VzoYQ/o.jpg"
      }
    ],
    "user_id": "ZslMmrn4z4BMPRRDoaBtgA"
  },
  "BwXYBtdEOpkE486w3Wm4lg": {
    "date": "3/26/2014",
    "text": "Well, this place is full of contradictions for me!  First, despite everyone loving the burgers, I've had the Reuben Burger, the Classic Burger, and now the Chicken Katsu Burger... while I loved the size, buns, etc., I just couldn't get fully onboard with the burgers.  They were by no means bad, and I'm a fan of onions so the onions mixed in weren't off-putting, but the regular burgers didn't top the Sou'Wester Burger at The Huxley and the Chicken Katsu Burger didn't top the Panko Crumbed Chicken Burgers from GBK.  Specifically on the Chicken Katsu Burger, the overall flavour combination of the Chicken Katsu Burger was a winner, but I wish it had been a different type of Chicken \"Burger\"... this was like a burger patty, but chicken... I almost wondered if I had gotten the wrong thing based on another poster's picture.  That flavour, with the right piece of chicken, would definitely work for me.  Perhaps it's a downside to all of the rave reviews, but I did expect coming here to be a revelation of some sort which wasn't the case... at least for the burgers.  (I must also admit to not being on board with the whole burger craze, so maybe I'm not the best judge.)  Now, the fries... I LOVED the fries.  The first time I had them they were sadly a bit cold, but extra crispy, and it was near closing so I didn't fault the place.  On second attempt, while not as crispy as the previous order, they were hot and still crispy skin on deliciousness.  I'm not actually a \"skin on\" fries fan, I tend to love whatever fries/chips that are delicious regardless of what type they are, but these definitely worked for me.   The other thing that I loved here, sorbet shakes with soy milk!  Specifically I had the Passion Fruit Sorbet Shake with Raspberries and Chilli Walnuts... so happy to have had a \"shake\" as being lactose intolerant I don't get to choose from shakes very often... I'm sure the rest of the world has caught up and that soy shakes are an option at most places now, but it's nice to see it as an option here along with the Gluten Free Rolls that Jenny mentioned... if anything it will have me poking around similar places to see if they offer these as an option now.  Regardless, it was GOOD... in all honesty I can see myself coming here again just for the fries and sorbet shakes.  For the place itself, I pretty much like the design of the place... not too much, not too little.  One note for the ladies however, it looks like they are following the pseudo modern trend of shared bathrooms... not a problem for the gentlemen, but the poor ladies having to deal with how messy we are!  The buzzer after ordering doesn't bother me, I prefer it to having to stand waiting or listening out for a name/number, but it's odd there isn't an option to take your tray somewhere and dump your trash... I guess they're going for the higher class vibe on that part, and I know a lot of people don't bother taking their own trash when there is an option, but it feels weird to me given the order at the counter vibe.  Not a negative though, just a note.  The service has been awesome though, which is good given the aforementioned buzzer scenario where it's easy to zone out on that aspect... I know it's a new place, but if they keep up the current level of service then it should help them along.  One final note... the \"Chilli Hot Sauce\" dip is actually Sriracha... a plus in some ways, as that sauce is awesome, but I do wish they had a tangy type Buffalo Sauce to go along as an option... it's also a bit cheeky to see someone charge for Sriracha, .50 for a very small amount, when most places offer it as a free condiment.  It is what it is though, and at least it's the good kind of Sriracha.  So there it is, for whatever reason I'm not completely sold on the burgers themselves, but can see why others like them... that paired with the amazing fries, friendly service, and soy option shakes definitely earns four stars in my book... just wish I could've gone five stars like everyone else!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "7Z0g-qGNFt7eYlhJRTPqhQ",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. The Reuben Burger",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7Z0g-qGNFt7eYlhJRTPqhQ/o.jpg"
      }
    ],
    "user_id": "FSTZjd727upEKYE6lTQVwg"
  },
  "f3UFuouNPNpb-m8eupiPQg": {
    "date": "3/31/2015",
    "text": "I came here the other night for my last meal in Edinburgh and was sorely disappointed.  My wife and I split a Cheeseburger and a Chicken Katsu Burger.  I was expecting some gourmet burgers based on the reviews on Yelp and came away disappointed.  The cheeseburger seemed too mealy/chewy.  The chicken katsu burger was a major disappointment and missed on all levels for us.  I personally would have enjoyed a McDonald's Quarter Pounder with Cheese better.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GksgDgj09Zl8foywi_Egmw"
  },
  "k-dMJEWmJnTa3m1tMM8INQ": {
    "date": "5/27/2017",
    "text": "Had dinner here yesterday. Bacon cheeseburger was great. Very large slab of bacon. Sauce good too. Cheese fries were okay but a bit greasy for my taste. Caucasian booze shake was a tasty dessert.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "o-fdyH2qd4EPcCzmAf0ZcA"
  },
  "RrVOT5kU9HzYBg6h8qF1PQ": {
    "date": "3/13/2014",
    "text": "Flashy and brand spanking new, many have been eagerly awaiting the arrival of this newbie burger place in town. It surpassed my expectations and I was really impressed. They make their burger patties in house and I loved the sweet onions embedded into the burger (although non-oniony people may object) which made the patties extremely moist and delicious. I had the Juicy Bleucy with Stilton in between the two burger patties - it was incredibly delicious and I was so impressed with the burger but at the same time could have done with a tad more cheese.  I also loved the hand-cut fries with their uneven shapes, skin on and salty goodness. The relish was also tasty! I think these have been some of my favorite fries in Edinburgh!  After dinner, we were offered a sample of Tea for Two which is Burger's special dessert of earl grey ice cream with tea cakes. I wasn't blown away by the earl grey ice cream perhaps because I just don't fancy that flavor, but what I did fancy was one of their shakes! These aren't the British poor excuse for a shake that you usually find - these were proper ice cream shakes, with the ice cream made in house to boot!  I was well impressed with Burger and it didn't let me down. They have a small menu but they do just burgers, fries and ice cream and they do them extremely well! I'm tempted to say they could be some of the best burgers in Edinburgh, and some of the best fries too!   FYI - Burger sounds like an extremely popular lunch spot but is quieter at dinner time. They have reasonable prices for the high quality of what you get!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "TBToSqzEiouOh2IS-Fas6A",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. The Spaniard burger and the Espress Lane shake - yum!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TBToSqzEiouOh2IS-Fas6A/o.jpg"
      },
      {
        "img_id": "o5DbB-_WCV2sx2NYLM5M0A",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. Chilli dog, chilli cheese fries and burger to boot",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/o5DbB-_WCV2sx2NYLM5M0A/o.jpg"
      },
      {
        "img_id": "XijDcdn8Twi3oEbXY6X7Rg",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. Chocolate ice cream shake! Wahoo!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XijDcdn8Twi3oEbXY6X7Rg/o.jpg"
      }
    ],
    "user_id": "vvQhikDPjAzHfSLVgnFkPQ"
  },
  "RtXr5ZBOaU68yozl_rtyHQ": {
    "date": "3/22/2014",
    "text": "Does burgers well. Very well. Went for the classic burger, chips and choc shake. Fresh tasting and juicy beyond belief but not too oily or greasy. Buns well soft and briochey. Chips were light and fluffy and not a speck of grease anywhere. Impressive. Choc shake 'almost' as good as my favourite in Edinburgh (Wannaburger) but I don't believe this is possible to beat.   All in all service was great, smiling, friendly cashier. Table service during slow quiet times. When busy I'd imagine you have to rely on the UFO. Price not bad but no such thing as a meal deal so be prepared to spend around 9-10 per person for a square meal.   Location is right next to Loudons so think they will give them a run for their breakfast money.   Regular rolling specials and beers. Good start, Burger!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5Ztnfl115dhZDxPmedyn2w",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. Burger innards.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5Ztnfl115dhZDxPmedyn2w/o.jpg"
      },
      {
        "img_id": "p87YFBjPllEBj-ZBrQWYbg",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. A quiet afternoon.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/p87YFBjPllEBj-ZBrQWYbg/o.jpg"
      },
      {
        "img_id": "L59SZPcd2RcoZWnUGTQ9yQ",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. The basicist works.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/L59SZPcd2RcoZWnUGTQ9yQ/o.jpg"
      }
    ],
    "user_id": "JkP7WtmnqmGctb1QFulVcw"
  },
  "FiwOI7MhF2FOHPRJl2n58g": {
    "date": "5/3/2014",
    "text": "Hailing from Glasgow, the city of fast approaching burger-burnout, I was excited to try Edinburger's latest offering.  It's as simple as the name suggests. - You order at the till, you get a buzzer and when your buzzer lights up, it is time!   I liked a lot about Burger. I liked the fact that my bacon cheeseburger held itself together so well; a beautiful, perfectly formed bun-meat-bun rendition. - Almost cartoon-like, it looked too good to eat and I wanted to treasure it forever! I liked the sweetness of the glazed brioche bun. I liked the beef cheese chilli fries; the meat, the flavour, the crispness of the fries. A little more cheese would have been the real cherry on the cake but they were so very delicious and that's really me just being unnecessarily pernickety!  So, a burger of the finest kind, it really was. - Juicy and flavoursome and just the right size. Although, it's worth mentioning that if you like your burger on the pink-in-the-middle side, you'll need to specify this. Mine was cooked just about through, but not lacking anything, still juicy and succulent. I know a lot of people like their burger super juicy and pink and I'm partial to that too.   And so, with fast and friendly service to boot, I'm willing to say I'm a fan of Burger. If I'm in the area and the burger cravings come, as they so often do, then I'm sure I'll find myself returning.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5MG-v9LDKxnjPSjbIVXi6A",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. Beef chilli cheese fries! So much meat and beautiful crispy fries!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5MG-v9LDKxnjPSjbIVXi6A/o.jpg"
      },
      {
        "img_id": "Ik2zGDr57LkRn_cGNowYEA",
        "caption": "Photo of Burger - Edinburgh, United Kingdom. Bacon cheese burger with perfect brioche bun! Oh, wow!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ik2zGDr57LkRn_cGNowYEA/o.jpg"
      }
    ],
    "user_id": "8rI2CoS4ltQePbZceSOgow"
  }
}