{
  "BCmW7IPv5WkJoOsbQnXtMQ": {
    "date": "6/8/2019",
    "text": "Just had a great meal with my family here! Wonderful service and very good food. We ordered kebabs, tiki masala, Daal, naan, and more. Everything is shareable which is great! Wanted to post a review as the place was empty except for us and thought they could use a good word out there!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "My_OhJbw-slUmk36VcNHSg"
  },
  "Dq6Bq9BgLcFSCNgsF29bGw": {
    "date": "11/29/2016",
    "text": "I ordered food to go at Gucchi and I was really not impressed. I ordered the lamb tikka masala which is my go to dish every time I eat Indian food so I would like to think I have a good idea of what it should taste and look like. The sauce was completely liquid and not thick at all (more like a soup than a sauce) and the lamb was overcooked. The naan and rice were OK; the service was ok but I only picked up so not much to review on. I am not sure I would go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ThHJVG58S2pqc8vJU4fDkA"
  },
  "pGLDZ8kVWx9myN4MBo_IBQ": {
    "date": "7/18/2015",
    "text": "My friend and I visited Guchhi Indian after realizing it seems to have replaced Love India, which Yelp had recommended. Not expecting too much from Indian food in these touristy blocks, we were blown away by the service, quality, and price of the food here.  First off, this is one of the few Indian restaurants I've encountered that bills itself as a seafood restaurant. Apparently, the chef worked for a long time at a well known seafood place, and brings the skills he acquired there to bear on the food at this restaurant.  My friend and I both did their dinner special which was a starter, main and side (a ton of food!) for 13! We each started with a mussels dish - my Kerala Mussels were very fresh and the ginger and mild coconut sauce was so delicious I continued sipping it even after I'd finished with the mussels.   For the main, I had the chicken Jalfrezi which was exceptional and spiced to exactly the right level. My friend ordered an Indian dish not on their already extensive menu which they were happy to do, and turned out exactly what she wanted (while still having a bit of a unique twist to it).   Finally, I could eat their cheese naan forever. It was warm, buttery, cheese heaven.  Throughout, our waiter was very attentive and helpful with navigating all the different varieties of food, as well as informative about what we were ordering.   This has been my best dining experience in some time. HIGHLY recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dLwzucNGqZEhdws_ArQxhw"
  }
}