{
  "Wf36ngNKGpmHioKvfG240g": {
    "date": "12/12/2012",
    "text": "The Everest is a fantastic, family-run Nepalese restaurant that isn't too far from anything it seems, and is right next to the Cameo and King's Theatre so it has theatre menus and an excellent a la carte dinner menu. It also has lunch deals as well.   We came for dinner tonight and it was amazing. Despite the quiet turnout for this very cold, wintery evening, we had a lovely time because the food was stunning and the service was great as well. We had the chicken momo (dumplings) and 'special mixed starter' of excellent, sizzling meats to start. For our mains, we both chose curries and the lamb saag and honey lamb were each perfect, as well as the flaky and rich parata bread. The curries were some of the best I have had in Edinburgh and I was really in heaven when my date let me scrape the last drops of curry out of the dish!  The Everest is a little gem of a find and the prices are reasonable with only 3.95 for many of the starters, 9.95 for many of the mains, and less than 3 for naans. They also have a busy take away and delivery service with a cheaper menu and free deliver within three miles for orders over 15. That works for me and I'll look forward to delivery and also dining in person here again!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "vvQhikDPjAzHfSLVgnFkPQ"
  },
  "mFAC4nnDgaaR6nNbGGVJ2A": {
    "date": "7/28/2018",
    "text": "The service was excellent and the food was delicious. The butter chicken was a 10! Highly recommended!A super friendly staff and wonderful delicious food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "huoWaKIdrq_7KRdBBuyYgw"
  },
  "KjpdxB-n7JADvF4EWQyPMQ": {
    "date": "10/2/2016",
    "text": "I really enjoyed our meal at the Everest. We've decided to occasionally go out for dinner in Edinburgh since my partner now works there and, both being fans of a good curry, I took to Yelp to find a recommendation. Turned out to be a good plan.  We arrived at ~8pm on a Friday night and what surprised me most was how quiet it was. I'd booked ahead thinking this would be one of their busiest times but we definitely didn't need to. This is the only reason the place doesn't get five stars - it was almost awkwardly quiet. Perhaps it's one of those places that comes to life midweek?  Anyway, service was great. Prompt, friendly and helpful. Soon we were pouring over the menus trying to find something new to try. Although this is a Nepalese restaurant, they also have lots of classic dishes you'd expect to find in any good curry house. After some deliberation I opted for the lamb momo, thinking they looked like gyoza on the front of the menu, and the Sagarmatha Raksi Chicken. My partner went for the chicken pakora an the Kathmandu Lamb.  Everything was delicious. The momo were like gyoza, possibly a little softer and full of delicately spiced lamb. The chicken pakora were huge and tender. The curries were perfect as well and were just the right portion sizes.  I can't understand why this place is so quiet. The food is great and based on just one visit I already want to come back and try more.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "EyQbvzVbLs6cv_V9PUMpXg",
        "caption": "Photo of The Everest - Edinburgh, United Kingdom. Map of Nepal on the menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EyQbvzVbLs6cv_V9PUMpXg/o.jpg"
      },
      {
        "img_id": "FTEgwj8Ift6cH7lZsbWGPg",
        "caption": "Photo of The Everest - Edinburgh, United Kingdom. Lamb momo",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FTEgwj8Ift6cH7lZsbWGPg/o.jpg"
      },
      {
        "img_id": "ex9kw8NRahheHaEd3rpqNQ",
        "caption": "Photo of The Everest - Edinburgh, United Kingdom. Sagarmatha Raksi Chicken",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ex9kw8NRahheHaEd3rpqNQ/o.jpg"
      }
    ],
    "user_id": "3ybT68AhqUtaZ66BUNWwDA"
  },
  "x0bFn9gqKHC-1NTwRXoGeQ": {
    "date": "8/26/2017",
    "text": "Delicious Indian food! We went here with our 2 friends from Glasgow for a casual dinner. The portions were generous, the service was very good, the prices were very reasonable for both food & wine, and overall the meals and spices were just delicious. All 4 of us really loved our entrees. Good location near city center, so it's in a nice/fun neighborhood. Would definitely go back here next time we are in Edinburgh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wXNQa8Er2PoumGvUotdeRg"
  },
  "mhY9EjczPmAA9qurC3qpKA": {
    "date": "1/27/2013",
    "text": "Nice family-run place As fast or slow as you like Curry was spot on",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "56p5NiIxTRb0-9tzNkt4iw",
        "caption": "Photo of The Everest - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/56p5NiIxTRb0-9tzNkt4iw/o.jpg"
      },
      {
        "img_id": "TYOPwMF7bQLNXNB5cOufjQ",
        "caption": "Photo of The Everest - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TYOPwMF7bQLNXNB5cOufjQ/o.jpg"
      }
    ],
    "user_id": "eKc2gY6fPaQy3zNsbIYDvA"
  },
  "QuPdLr1YWumVmuWIQxI33g": {
    "date": "6/17/2016",
    "text": "I love curry, but for a while I have rested on my laurels and simply revisited the same old places. A few weeks ago I decided that was going to change, and so we come to my review of The Everest.   I have sat in at The Everest once and had a couple of takeaways, overall I have to say the food is of a good standard. I prefer the spicier side of life and so have tried a chilli garlic, madras and a biryani (less spicy, still tasty). The prices are fair, certainly on par with other establishments in the area. So the food is good and the prices are fair, that being said the restaurant itself is a little tired and dated.   In fairness I would whole heartedly recommend The Everest for a takeaway but less so as a place to sit in. Overall though it is a good shout as a place to get a curry.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GN3wBXDaLLmY6Oitfy3T8g"
  },
  "LnDrTDtjdm1cJOxa3O-R_w": {
    "date": "1/16/2017",
    "text": "High quality indian food. Period. My wife and I tried this place last night and it was delicious. Quality food is the main thing I want when I dine out, and The Everest does indian cuisine very well. Many indian restaurants have delicious sauces and curries, but they overcook the meat, especially when it is bite-sized in a curry. Everest's sauces jump out with flavor, and my lamb was still tender and juicy. My wife's chicken was moist. The fried starters were still moist and plump inside. Great job all around.  The restaurant seems to be empty when I go by, so if the vibe/atmostphere of a restaurant is a big deal to you, it's certainly not a popular place. The food? Delicious. Prices? Reasonable. We also brought our own bottle of wine, and they were happy to accommodate. Friendly service. I recommend you try it, as they deserve much more business than they seem to be getting.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "acbB_MzedCtV6HRl2EUbkQ"
  },
  "LZSCHK_WNkZKTyFjU2zKkg": {
    "date": "9/13/2015",
    "text": "Me and my friends are traveling in Edinburgh and wanted some good Indian food, and this was very close to us. I ordered the #33. Chicken Tiki Masala and it really hit the spot. Great portion size and delicious! The employees were all very kind and helpful as well. In terms of ambiance and environment, we were the only ones in the restaurant and it was quite, but it was a late Sunday night when we ate, so I can't fault them for that. All in all, if you are looking to eat some great food, I would recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GxPcWNfRZKIoV-lolN2yag",
        "caption": "Photo of The Everest - Edinburgh, United Kingdom. Chicken Tiki Masala, amazing!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GxPcWNfRZKIoV-lolN2yag/o.jpg"
      }
    ],
    "user_id": "W_CaMYC7YVBScHvShbWMmA"
  },
  "HmKVMX_2qMKYF3OcJSdG2A": {
    "date": "5/25/2011",
    "text": "Went here for curry - was lovely and just the right spices.   Services was awesome felt really welcome.   Will def be going back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MXdFKeqnoMDj180hlC7ttg"
  }
}