{
  "U44gx4HOn3hRTZh6TsCXGA": {
    "date": "4/29/2019",
    "text": "Trying to find a good Sunday brunch place for a sizable group, Otro is available to be reserved online. When we got there, they have tons of seating so there was not much to worry. Since we reserved vs walk ins, they tucked us away in the back room which is quite nice and enjoyable. The service is very patient as we are from NYC who capitalize on efficiency. So New Yorkers, note that service outside of NYC is typically slower than your usual comfort. They have a two or three course options. We at first wanted to go for three to include dessert, but were too stuffed and stuck with two. We did order one dessert to share. This is what we ordered  App - Chicken Pate with Duck: absolutely heavenly. Very dense, best to share -Sourdough bread: amazing dipping green sauce   Main -lamb shank: very flaky, could be cooked a little longer for more moisture. The chickpeas were a nice touch but would like to complement with some carrots -Roast: love the yorkshire pudding. The meat and carrot are a bit salty tho, typical of english food.  Dessert - chocolate and honeycomb: Absolutely delicious, so glad we at least tried one dessert. The icecream is velvety and a great ending to the rich brunch",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Mg_St29knL5Qvz0aIR27_A",
        "caption": "Photo of Otro - Edinburgh, United Kingdom. Chocolate Honeycomb",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Mg_St29knL5Qvz0aIR27_A/o.jpg"
      }
    ],
    "user_id": "rdpBFCsLS9oQbEwKlGpTFQ"
  },
  "GFqMczi8i4vH4nerqPeHMw": {
    "date": "4/7/2019",
    "text": "We had a lovely meal here our last night visiting Edinburgh. I had wanted mussels but they were off the menu. Had two starters for dinner - a simple but perfect rocket pear salad with Caraway and pecorino had a perfect complement of flavors. The scallops we're light and flavorful after a lot of heavy pub grub. My partner had the pork cheeks with risotto. That dish too was not overwhelmed with richness, but instead let the real flavors of the ingredients come through. We shared a lovely chocolate dessert with several textures - light and dense, sweet and salty all together. I will regret not trying the pavlova too. From the front door until leaving, everyone we interacted with was extremely pleasant and helpful. I'd recommend Otro highly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VFJgLCvvAM6eUW3hb215nA"
  },
  "5RegRGwYxYiRyBCnroiqKg": {
    "date": "7/4/2017",
    "text": "I would give this a 5 for breakfast and a 3 for dinner. The Scottish breakfast was fantastic, the Haggis was not to be missed! The black pudding was good and the service was friendly. Attractive inside. We came back for dinner a few days later, but alas, the food was not quite as good. Would certainly return for the breakfasts.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "COw5LaPrLkMc-ivOcgxzYQ"
  },
  "u3Mz3r-cdVSzwfb-avrCKA": {
    "date": "8/20/2017",
    "text": "Wonderful imaginative food.  Mussels best ever - cooked in Thai-style broth with coconut milk and lemon grass and served with lovely brown bread. 2 sizes available. Lemon posset dessert with lavender shortbread is divine.  Red wine selection could be better but still alright.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8JDUBm8nqCuTHNy9_OGkUA"
  },
  "ucFin2Bb0L4N6UX9o5EYfQ": {
    "date": "9/30/2017",
    "text": "Our hotel booked this for us. Dinner was good, not great. The restaurant was extremely loud.  The restaurant was also very busy so service was lacking. The wine list leaves much to be desired. We had beef checks and cod. Both served with the same plan mashed potatoes. Both too salty. Nothing personal about the experience and no character in the food. I would not recommend.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rVuM-Hs12lPmotswdkUBbg"
  }
}