{
  "bJB0BcBV5iMh_Enoxje0IQ": {
    "date": "2/12/2013",
    "text": "Y.U.M.   This is my favourite take away lunch place close to work. The salads are amazing - my favourites are the half & half (half salad, half couscous) Chicken & Falafal or Chicken & Cashew nuts. The soup is home-made & comes with a thick piece of bread. They normally have 3 soup options but you need to be really prompt as it's mega busy with the work lunch crowd and the soups go fast!!   The service is mega speedy and friendly - they acknowledge regulars which I like.  The only thing I'd like them to do more of is hot baked potato fillings - if they did a chili filling, I'd probably be here everyday, mixing it up with my salads, soups and baked potato depending on my level of hungriness.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "S2islVfwCgNg3zfzxqty5g"
  },
  "5MquIyGJetg1K3WPgfWbuw": {
    "date": "4/19/2010",
    "text": "Okay so there is a reason there is a huge queue here every lunch time.  First of all let me say that I kind of don't like sandwiches. I always find them boring, soggy and unappetizing. However after reading Emily's review of Thyme in Holyrood, I thought I would give it a bash.  I am so glad I did! The choice of fillings is amazing, and so much more exciting than ham and cheese/tuna mayo/chicken and sweetcorn. With fillings such as Sweet Chilli Tuna, Brie and Pinenuts, and Posh Cheddar I was spoiled for choice. There is a good selection of different rolls too as opposed to white or brown.   As you go into the shop you pick your roll up from the basket and when you get to the front of the queue hand it over to the assistant who happily packs your sandwich full of yummyness. I went for Brie and Apple which had a multitude of different bits going in, and it tasted delicious. The girl in front of me had a Caesar salad and it looked awesome, a huge bowl filled with chicken, cous cous and salad. The salad selection is pretty great too, I think I will have to return to sample those. My sandwich was 3.05 but with student discount it was 2.75 which was a great price for the top quality nosh.   The only thing was the writing on the menu on the wall was so darn small I couldn't read it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bW9dVvaENg82yGxFRio-Sw",
        "caption": "Photo of Thyme - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bW9dVvaENg82yGxFRio-Sw/o.jpg"
      }
    ],
    "user_id": "oKdygoDX5CfDJeXzv_EVaw"
  },
  "Nz6YkfQAtWSq-T7SGlx2KQ": {
    "date": "3/29/2011",
    "text": "I am fortunate enough to walk by Thyme on my way into work in the morning and have started popping in to grab my lunch on my way.  Their breakfast foods look outstanding, but I'm there to get the fuel which will keep me going in the afternoon.  Every time I stop in here the staff are SO nice.  They make up the roll quick as can be, and it is just packed full of goodness.  The fillings are so fresh and interesting, made on lovely fresh bread.    I've raved so much about my lunched recently that as I write this, my coworkers are on the Thyme website picking out fillings and getting excited for placing an order for delivery (which, by the way, is such a great service!).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4UQfst9jve4GCSfWpWn2uA"
  },
  "QAgHmvo2heGeXBUNyiwdLg": {
    "date": "8/4/2010",
    "text": "In the name of reviewing duties, I'm known to spread the net far and wide especially at lunchtimes, yet it was with almost a sense of disappointment that I stumbled across Thyme on my extended venture to this neck of the woods.  Disappointed because I hoped to find someplace new and untried, yet deep down I knew it was impossible to resist a Bacon and Brie on a poppyseed roll from here. Even if I'm not hungry, I literally find it impossible to walk past Thyme on Holyrood Road, and I expect the same effect every time I'm in the vicinity of this one.  The menu looks outstanding, but I just can't stop eating that same sarnie over and over. I genuinely believe that there can't be a better sandwich in the world.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "xXQTdJXPGOP-NUYctcQw8g"
  },
  "a9VOX8jXN09yPUjnP5UpuA": {
    "date": "2/13/2012",
    "text": "Great little place for lunch and breakfast. I always end up buying toast with peanut butter which is not so good for me so might change to the porridge with blueberries like the other person on here. The lunches are great with the salads amazing and cheaper than the shop along the road. they make everything there and then so the queue is sometimes quite long and their soup runs out quite quick so you have to be in relatively early but as they usually have 4 different types on there is always a suitable alternative. I love this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W1I3rO0-JG88ByIGXLeHiA"
  },
  "FvHWZkGULbNpYJzYYIBWuw": {
    "date": "10/7/2008",
    "text": "If I'm on the west side of town and it's time for lunch I'll usually find myself at Thyme. There's usually quite a queue at lunchtime - they make everything to order but the wait is always well worth it. The prices are great, as are the huge chunky brownies - always an essential accompaniment to a tasty smoked salmon roll.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cDR_WMmV9dp2LwW-w_KmUA"
  }
}