{
  "GbcTZWYssVenhWndxDU0Qg": {
    "date": "12/30/2016",
    "text": "An update about the hotpot... I've been told about the hotpot in the basement of this place by many friends. Today was the first time we were able to try it.  Assorted soup based and dipping sauces, crab, shrimp, thinly sliced beef/pork/lamb, standard Chinese veg, udon, ramen...for 15.99 per person all you can eat, and the quality is pretty good. Not the best I've had (which would probably be in Beijing), but pretty good indeed (especially for Edinburgh).  Good with friends and worth coming back! Bring cash - no credit cards accepted!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4FxADcoBgm_8xqTyfmTIug"
  },
  "vAghAs-6m8P8h-beIpNaVA": {
    "date": "9/14/2018",
    "text": "We waited for an hour for our food. The taro pork is extremely sweet. Very disappointed. Maybe the hotpot would have been better",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EwlNGyLHhLOtZoRv_po_ug",
        "caption": "Photo of Lian Pu - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EwlNGyLHhLOtZoRv_po_ug/o.jpg"
      },
      {
        "img_id": "Opi2z4BGxkQ-q6hZnypiSw",
        "caption": "Photo of Lian Pu - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Opi2z4BGxkQ-q6hZnypiSw/o.jpg"
      },
      {
        "img_id": "pLc90UOes7XSVZDWj-67gg",
        "caption": "Photo of Lian Pu - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pLc90UOes7XSVZDWj-67gg/o.jpg"
      }
    ],
    "user_id": "NXDQtwFSV5YnhfMn8X3luQ"
  },
  "8UriZQJ34ZUUL9mqroK1fw": {
    "date": "12/30/2018",
    "text": "Such a good steal! Hot pot and BBQ combo is just 20 per person! Waiters were very attentive and we had a great meal here. Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CDFSfTYUU6sbVpx9KctN7g",
        "caption": "Photo of Lian Pu - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CDFSfTYUU6sbVpx9KctN7g/o.jpg"
      }
    ],
    "user_id": "OBD9o3nDlVLTqppJb1T0iQ"
  },
  "jB8k4p6yZ5VpUPsbH8_MrQ": {
    "date": "8/21/2018",
    "text": "Last evening, I together with my family really enjoyed a hot pot at Lianpu. It is real Sichuan style hot pot. Seafood like crab is quite fresh. Love it! Their people are nice as well. Will visit again in next trip to Edingburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "G8mfIZtQ8bpv0K0pLjvrmA"
  },
  "1q2qqMyP8lcor4tlgN6BxA": {
    "date": "5/3/2018",
    "text": "This is my favorite restaurant in Edinburgh. It's a hidden gem with the best Chinese food in the city. We come here with friends twice a week but honestly wish I could afford to go every day. I very strongly recommend this place to everyone. Good prices, great food, you can't go wrong at Lian Pu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FFNn-yJ2NBDL2TIbMD4G-w"
  },
  "pDDqW4psuO_ZCyN5h_jzpg": {
    "date": "10/2/2017",
    "text": "The best best best authentic Chinese food in town.  The swing pot is so gorgeous and the same as those in China.  Love the food here and must 10 stars for it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zCW44tD3wn2riB00onY24w",
        "caption": "Photo of Lian Pu - Edinburgh, United Kingdom. Swing pot,  so yummy",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zCW44tD3wn2riB00onY24w/o.jpg"
      },
      {
        "img_id": "y4OilYsfu9f8a8kxkEL3JA",
        "caption": "Photo of Lian Pu - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/y4OilYsfu9f8a8kxkEL3JA/o.jpg"
      }
    ],
    "user_id": "Sk_NA-RmbU5EBqBcKHzZKg"
  },
  "OMma5h-AExHoNVBWcVCuEw": {
    "date": "9/10/2018",
    "text": "Great hot pot place to go with family/friends :) There were plenty of sauces to choose from and the price was okay too (16.99 per person for all you can eat hot pot). However, they only told me cash only when I got my card out to pay. Not a big deal though, & I still really liked the hot pot especially when it was cold outside.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JJvaSF92crzwWKaBXUiowA"
  },
  "mnhBQj_wasVOQnFlOUy3YQ": {
    "date": "3/12/2016",
    "text": "Lian Pu is decently priced yummy Chinese. Some people are fans and others are skeptical. Well it is a popular place for many Chinese students and has sizeable portions at decent prices.   Now quality of  food is standard quality but that more greasy goodness we all need occasionally. However, some of their dishes can be lighter and boast some of those home comfort feels, like their chicken and egg noodle soup.   It's also great if you want to get more traditional Chinese dishes, such as beef intestine. Yes, they have that. But if you want to get the more popular Chinese dishes they have that too. Mabo tofu is really good, nice and spicy yet light tofu. New favorite may be the beef ho fun which is so nice for the fried noodle cravings.   Also, they serve bubble tea! The bubble tea is yummy. Downstairs they have hot pot and little grills if anyone is thinking of a more all you can eat type experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VLqZove5E9SAo00LqLpfgw",
        "caption": "Photo of Lian Pu - Edinburgh, United Kingdom. Aubergine and pork",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VLqZove5E9SAo00LqLpfgw/o.jpg"
      },
      {
        "img_id": "kbvfdKs2-QdF6bQfL572Kg",
        "caption": "Photo of Lian Pu - Edinburgh, United Kingdom. Beef ho fun",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kbvfdKs2-QdF6bQfL572Kg/o.jpg"
      },
      {
        "img_id": "UKc_VpsZn1u2QCYGzmuhFw",
        "caption": "Photo of Lian Pu - Edinburgh, United Kingdom. Mabo tofu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UKc_VpsZn1u2QCYGzmuhFw/o.jpg"
      }
    ],
    "user_id": "eN2pCfT17EGokP9UWnoZUA"
  },
  "UiJSPG9rxEiVh-fUHcyHwg": {
    "date": "1/11/2017",
    "text": "Walked into this place on a whim, noticing the bubble tea. They hand you a menu, however you're supposed to go up to the counter to order and pay first, and you fetch your own water and glasses at the corner of same counter.  Friend and I ordered from the menu along with bubble drinks. Both were disappointing. Maybe not for UK standards, though? Because my experience just doesn't correlate with the reviews on here. The bubble tea was very watery. Didn't look or taste like it had any tea, just flavored powder mixed with room temperature water. Food is edible, but disappointing if you expect real Chinese fare. Probably better than regular UK Chinese takeaways, though.  Service is negligible since you only interact with service staff when ordering. It's pretty much self-serve without needing to clean up.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "e969b2MqLQFiIXlKa04tRw"
  },
  "dI3GlAa5SdSQwUxip1009A": {
    "date": "10/14/2015",
    "text": "Fast food seating and trappings with table-service food provision (you need to order at the counter though).  The food and drink is tasty and the menu has a great deal of choice on it. Price-wise things get a bit more expensive than you might expect once you include rice or noodles but the service is good.  It could do with a faster closing front door though, particularly as the weather is now getting colder.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "txzOZrHK9EVY0kYjSuXkKg"
  },
  "Epy_lTmnVu6KPwNr0aUBrw": {
    "date": "8/4/2018",
    "text": "The waiter there is awful. Not helpful and different waiters give different answers. I know it is busy time, but they give me a completely wrong dish from what I ordered. Never gonna come again!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YUn4pjAmCMP1U_YIqaEP_g"
  },
  "Bz7IiTtPBOgaXLYvx2A_Pw": {
    "date": "8/16/2016",
    "text": "Solid cafe food for when my wife and I need some Chinese cuisine in our life. Not as cheap as we'd like, but also not expensive. Kinda greasy, but still good flavor. We like the salt and pepper fried chicken, the mapo tofu, and the beef chow fun (though I hate how many beansprouts they put in there...) Can't seat big groups..  UPDATE: Just went downstairs and tried their hotpot. OMG, best hotpot I've ever had, and I'm from California. Their meats are high quality and fresh. Their broths are not watery, but flavorful. The variety is on point, ranging from red meats to chicken to seafood (they even have squid, crab, and razor claim!) to dumplings to 4-5 different kinds of noodles to an assortment of veggies. I'm going back with my wife again tomorrow, actually. The BBQ also looked amazing, by the way. I'll plan to try that some day too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "B7VzLfDEhEzIdjw7dsqOyA"
  },
  "JlR7LVdqBigV6Xl2gP0sZg": {
    "date": "1/7/2017",
    "text": "I learned about this place by asking a Chinese student off the street near University of Edinburgh. Thank you, stranger! The food and drinks are legit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "s1mD1PvJQrAYHfNG9UDYJw"
  },
  "GG3KrONMF18qoecigvjEAQ": {
    "date": "9/2/2014",
    "text": "A perfectly respectable fast food Asian spot. If we are being honest, the food deserves 2-3 stars, but they get an extra star for having good bubble tea, which is near impossible to find in Edinburgh.   The place is cute and a good location if you are in Old Town or near the University. You order from the counter, but the service is friendly and helpful and they keep the place clean. Menu options are pretty standard Asian fare and easy to figure out. Lots of options and easy two-step process for rice and noodles. Pick your noodle, pick your meat, and done. Menu has plenty of pictures if you are confused about what you want. So, flavor is pretty standard for fast food, but the food isnt always top quality. Our beef flank the other day was a bit soft and fatty and the sauces can get a bit sugary and overpowering. Even given these things, if you are craving some quick, cheap-ish Asian this is a good option. Also, get yourself a delicious milk or fruit boba (bubble) tea with tapioca or jellies added in. Awesome.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "A_dC3FJOqvlsDEiDyMrzlA"
  },
  "5Io0PQXFGBwtdj4koXEc5A": {
    "date": "3/8/2014",
    "text": "Was super excited to hear of a 'Taiwanese' cafe/restaurant opening up in town.. food from the motherland.. Yeeeesss~!!  Unforunately my excitement was premptive.. half the dishes aren't even 'Taiwanese' and a lot of the dishes have been 'Europeanised', which is to be expected but with the growing Asian population in Edinburgh, I really don't feel like it's necessary.  The sweet and sour really lacked any sweet or sour, my beef soup had good flavour but having two pieces of pak choy as the veg component was rather disappointing. The hong sau pork packed a lot of flavour and would probably be what I'd go for if I was to return.  I'd ordered cold taro bubble tea but it came warm.. overall, yes, it's affordable, it's quick and some of it is tasty, but I'm really not in a hurry to return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "J6E6NSpJqMBib9ydbchicg"
  },
  "AUMx8yQr4jL_hsMeBcDBsw": {
    "date": "9/16/2016",
    "text": "I think the hot pot is really nice. The restaurant is decorated into very Chinese way. The service is not really good as they are always pretty busy! If you like hot pot, then I recommend you go!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HtTw8ZNF_vjO3T5ELQG2AA"
  },
  "8Tkk4meeQ4z5izLt5Gm4ag": {
    "date": "9/24/2015",
    "text": "curry food just so so.. Besides that i recommend to go there ..which is really near George square.. We can address our lunch problem in quick way..",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "myWOvwyqehh1JeMbi5sDkg",
        "caption": "Photo of Lian Pu - Edinburgh, United Kingdom. bubble tea..",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/myWOvwyqehh1JeMbi5sDkg/o.jpg"
      },
      {
        "img_id": "iiudGPVUmTCr65Z8pmPx0w",
        "caption": "Photo of Lian Pu - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iiudGPVUmTCr65Z8pmPx0w/o.jpg"
      }
    ],
    "user_id": "4-3T3gi1bIRYynY5TV3sxQ"
  },
  "lJO_2CG9ATr-9vNwBxmIVA": {
    "date": "3/24/2015",
    "text": "Had Chinese takeout twice and boba (tapioca milk tea) once. The food is pretty good, though their fried rice was oily, and the milk tea was average. I would recommend the hong shao rou--braised pork belly if I'm correct in translating that. In general it's a bit on the pricey side for casual Chinese food, but I guess it's understandable since there appears to be little competition.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yO8_fwzeO0W3-kahJLF1pw"
  },
  "HDOZndsGmAi5TEv9XRKpIw": {
    "date": "3/11/2015",
    "text": "Lian Pu has been a frequent visit for me whenever I have urges for some \"Chinese\" cuisine. The food, at reasonable prices, offers a semi-nostalgic taste of Cantonese-with-an-attempt-of-Taiwanese flavours. There are surprisingly many choices on the menu, albeit most are just combinations of rice/topping or noodle (soup-based or wok-fried)/topping. The service, on the other hand, is quite astounding. An incident with my meal today has put Lian Pu on a blacklist for any visits in the near future. As usual, I went with a friend for a quick lunch after classes. After ordering our food (noodle dish, rice dish), we were given a peculiar egg and shrimp dish. Upon asking a staff member, he hurriedly dismissed the incorrect dish and went off serving another customer. A few moments later, we heard the manager yelling/cussing at the staff member who gave us the dish. (They didn't think I could understand Mandarin) That dish was supposed to be made for the manager and staff to eat, and because it contained \"expensive\" ingredients, they took away the dish with a, \"sorry there's something wrong with the dish\" remark. The overall meal experience was ruined after that point. Very poor service/professionalism of staff members (especially the manager). Would only recommend for take-out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "M2JZmQyg6iFiTVcjrE4CkA"
  },
  "dwM6_zxWWqp44He-DnSHng": {
    "date": "10/8/2014",
    "text": "Came here a few times during my few months in Edinburgh. Honestly, I was really excited because they advertised Taiwanese food. Unfortunately, I wouldn't say that this is Taiwanese food...even the website says \"Oriental\"...but it's easily the best Chinese express food place in Edinburgh. It's more akin to NY-style Chinese take-out food (which many expats will know is different than UK-style Chinese take-out food). However, it's good for sit down (just make reservations for larger parties, as it's fairly small). I usually sat in and I usually got the beef ramen, chicken with broccoli, or kung po chicken when I was there. The beef ramen was more like Taiwanese beef noodle soup and not Japanese ramen, but this and the chicken dishes were always very delicious...absolutely no complaints. The food servings are large enough for 2 meal portions and very reasonably priced. I always got matcha green tea or taro milk tea and sometimes got the tapioca bubbles. Very good standard of drinks.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8XtPjxLxYiZv4KLLwuGtcg"
  }
}