{
  "2H3HrloAL3qfkQDsyWG_rg": {
    "date": "5/1/2015",
    "text": "This place is part of the gentrification of Leith walk. Quite stylish without trying too hard. Serves food, all be it a limited menu. Staff very pleasant who try hard to impress the punters with bar tricks and cool music. Might put some of that energy into clearing the tables or serving the tables a wee bit quicker. All in all a great wee place for a drink and a bite.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wl-hIj2ZEevUPukvkZcang"
  },
  "UU-OoASIjWSpGPw4oXmXoA": {
    "date": "8/28/2019",
    "text": "Okay. I LOVED this place. The atmosphere is chill and has good vibes. We came in for drinks only and sat by the window. My wife had an alcoholic slushi and I had a beer.   I'll definitely be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "kCV-a-_G35eCy4PTA8lUMQ"
  },
  "uPuu7xeA5lSmzn1yr0AuEQ": {
    "date": "7/3/2019",
    "text": "We only stopped in for a round of drinks and man were they delicious. They have alcoholic slush machines! The music was good. There were a lot of people but it didn't seem that overwhelming. We were able to get seated rather quickly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_HaHKyjVWi9ULV26WDDrVA",
        "caption": "Photo of The Black Fox - Edinburgh, United Kingdom. Rose gin &amp;amp; lemonade in the foreground. Raspberry alcoholic slush in the background.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_HaHKyjVWi9ULV26WDDrVA/o.jpg"
      }
    ],
    "user_id": "SHztRa48vZFUdIYF0GxbKg"
  },
  "c5funDJ5XVKEDk4lPw0e1w": {
    "date": "4/2/2019",
    "text": "Would go as far to say that The Black Fox is the best place in Edinburgh for a burger. Big claim I know, but try it. I had the Foxy Burger which was bacon and cheese beef burger with pulled pork which was a mountain of food, but only order if hungry! The wife had the Veggie burger along with some haggis bons to share, which was a hell a lot of food, but very much enjoyed! Will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "X09N1c6Q_pWFh_f_BgbudQ",
        "caption": "Photo of The Black Fox - Edinburgh, United Kingdom. Foxy Burger!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/X09N1c6Q_pWFh_f_BgbudQ/o.jpg"
      }
    ],
    "user_id": "FNxM7Zl-ThbBe9VPHgZF-A"
  },
  "M4fLno8fBvVIeIe41K_rzA": {
    "date": "2/27/2019",
    "text": "Nice place for a pint, decent service but no WiFi neither 4G access for phone data, which is a real bummer. Hope they'll fix it any time soon.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ogbwMa7m2sg73a5ONL_CuQ",
        "caption": "Photo of The Black Fox - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ogbwMa7m2sg73a5ONL_CuQ/o.jpg"
      },
      {
        "img_id": "ePPk0pgaFC7dQIoKB8KCCA",
        "caption": "Photo of The Black Fox - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ePPk0pgaFC7dQIoKB8KCCA/o.jpg"
      },
      {
        "img_id": "Tt2DfZXl-mhLKVHtCN1DzA",
        "caption": "Photo of The Black Fox - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Tt2DfZXl-mhLKVHtCN1DzA/o.jpg"
      }
    ],
    "user_id": "RBvR8MoGAoxeLlm_ajTYgg"
  },
  "OKC9Kuprm-l5s0hQLHyGBg": {
    "date": "8/16/2018",
    "text": "A goo place for burgers and a drink. The beer list is local and reasonably varied. The place was busy (festival time), and the staff worked valiantly to keep up. The burger included both a tasty tossed salad and a coleslaw. Nice touch! The spicy chips were nicely spiced but lacked crunch.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JOrm7oFkJC0s4tqpNiqMbw",
        "caption": "Photo of The Black Fox - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JOrm7oFkJC0s4tqpNiqMbw/o.jpg"
      }
    ],
    "user_id": "tUUNK_CxfdFuFwznzqdj3A"
  },
  "r6KgiGOjXJnbLWyv5t3UbQ": {
    "date": "7/13/2016",
    "text": "The Black Fox has only opened about a couple of years I would say.  I am glad it took over that dingy bar it was before.  It really spruced up the place and attracted more decent crowd into the Leith.  The bar is has a good sized area and quite a small kitchen.  This place attracts mainly hippy young locals and it is usually crowded during the weekend evenings.  There are plenty of area to sit as well for food.  If you get a chance on a quiet afternoon, sit by the window with your food and drinks and gaze at the people that passes by.  I am not going to explain much about the drinks as they are quite standard.  However, the food here is amazing for a bar.  I am never a fan of pizza and burgers when I am out eating as I think they are just a waste of money.  However, I was extremely impressed with the pizza.  I think they have the best pizza in Edinburgh.  The toppings are by far the most I have seen in Edinburgh.  They are extremely generous with the toppings.  The base is also thin and cruncy just how I love them.  Please give the pizza here a try and I really hope someone agrees with me that they serve one of the best pizzas in town.    Another recommendation is the Pork and Chorizo burger.  I have always wanted to eat this again after The Holyrood 9A stopped serving them.  Bad decision.  They are actually the best burger I have eaten as the pork and chorizo combination makes the meat very juicy, tender and full of that chorizo oil flavour.  I was never a fan of the normal beef burger anyway.  The onion rings here are crunchy, deep fried well any never stingy on the portion.  I would happily come back here again to eat comfort western food.  The kitchen is so small and sometimes I wonder how they make such good food from such a small kitchen.  Really delicious and good portion.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ipsoB9XzbT5HCfIak_qjAw",
        "caption": "Photo of The Black Fox - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ipsoB9XzbT5HCfIak_qjAw/o.jpg"
      },
      {
        "img_id": "foVE4BpTlmj3k66H1K1Lwg",
        "caption": "Photo of The Black Fox - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/foVE4BpTlmj3k66H1K1Lwg/o.jpg"
      },
      {
        "img_id": "TLIfdim7WmBl9byYGCvMVQ",
        "caption": "Photo of The Black Fox - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TLIfdim7WmBl9byYGCvMVQ/o.jpg"
      }
    ],
    "user_id": "bJ5CG5cBguo09dqLFTyHjw"
  },
  "7sFkxw-eggfbSXoGZLtIPA": {
    "date": "7/11/2018",
    "text": "Very cute place and trendy. It was a busy evening and only one server. We asked what haggis was as I'd never tried it and the server couldn't describe it because he was vegetarian and never had it. Thus, he brought out a sample Haggis bonbon. It was pretty good so I ordered the Scotsman Burger. Our neighbours at the next table also recommended the Irn-Bru soda (tastes like cream soda). I always like to try local products!  Culture clash: Unfortunately, this experience wasn't all good as we were loudly reprimanded by our server for attempting to wave him down. He said that \"in this country, it's considered rude to wave a server down.\" He explained he knows we need his attention and he would get to us after serving the people ahead of us. We apologized and said we didn't know. We tried to explain we are not from here but he interrupted us and said, \"I know, but in this country, blah blah\".  We were disappointed with this conversation and at the end of the day, this is very disrespectful to the customer. We truly didn't know this and yet he was also rude enough to correct us loudly. In my experience, the customer satisfaction is still priority and he should not have treated us this way.   **I think the important take away from this is that it's important for all to consider one another's cultural behavior.  In N. America, it is normal to lift a hand to get the server's attention, but apparently, it is rude to do this in Scotland. We didn't mean to and we are learning. I hope the Black Fox server would realise this too. Our neighbour table left before us and each of them said something nice to us on their way out. They asked how the haggis was, wished us a great stay, and the last guy said, \"Don't worry about that guy, he was a dick.\"  I'm glad some locals have kindness.  Huge disappointment on the customer service side. Food was alright. Nothing spectacular.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LhdigOiNBsS1F3qbIY1sLQ"
  },
  "9qCt_r3DfToimW85eFqQxw": {
    "date": "6/23/2018",
    "text": "Delicious burgers and Cajun fries with a nice kick! Intimate and exciting eatery so get there on the early side or make a reservation- we got lucky on a Saturday around 6pm, but many parties were turned away after us. Hopping ambience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5jhaYZN_mLNEYIy63Won5Q"
  },
  "pYTIlWfKz65JU0jZC2hfKA": {
    "date": "7/31/2017",
    "text": "They were so nice and attentive here despite the busy time. We got a table near the kitchen and saw how the two chefs worked non-stop to churn out yummies. The burgers were good but the highlights are their wee bites. We highly recommend the haloumi or haggis, those were divine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZuxhS35JQ5ku5vEsFBm51g"
  },
  "It99fkzgfvHiHr_WRLDuMA": {
    "date": "8/11/2015",
    "text": "I visited The Black Fox on a Friday evening with a friend. We were looking for something simple and tasty to eat and wandered along Leith Walk. The sign outside the bar advertising cheeseburgers for a decent price drew us in. And I was happy we went in! The staff were so friendly and welcoming and our orders were taken quickly. The place was also buzzing and had a good vibe.   The Black Fox servers a good variety of beers, cocktails and wines and their food menu is more interesting than the usual 'pub grub' you see in most pubs.   The burger was delicious. It came with a side of coleslaw and fries. The coleslaw was homemade and not too creamy and I really enjoyed it. The burger was not too well cooked, which was also a bonus.   All in all, a positive experience and I will mostly likely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "yuFHrb8YQtVuzu0eEXvJtA"
  },
  "vGjvOpKyq4zgdXTVQj7Utg": {
    "date": "10/19/2015",
    "text": "They have one of the best burgers I've ever tried and friendly service. Do want to come back someday.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "oFeh-RGjODl5yLyH7xP0Ww",
        "caption": "Photo of The Black Fox - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oFeh-RGjODl5yLyH7xP0Ww/o.jpg"
      },
      {
        "img_id": "5WMTc07_Di6nUUzZct5eNQ",
        "caption": "Photo of The Black Fox - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5WMTc07_Di6nUUzZct5eNQ/o.jpg"
      }
    ],
    "user_id": "ElmR7f0ds9nMqXDqlfN35A"
  },
  "TuoECYBp7crHR5BsRw0zmQ": {
    "date": "5/30/2017",
    "text": "Food is very good . Bar staff are very friendly and helpful.  Not sure about the very old film but hey its different",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GaFTe2MjvMEYRZ04uL94HQ",
        "caption": "Photo of The Black Fox - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GaFTe2MjvMEYRZ04uL94HQ/o.jpg"
      },
      {
        "img_id": "sI1rEmxNK4hpTAWsuiaudA",
        "caption": "Photo of The Black Fox - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sI1rEmxNK4hpTAWsuiaudA/o.jpg"
      },
      {
        "img_id": "7hoPO8JKDLZz3_7PmEl7-w",
        "caption": "Photo of The Black Fox - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7hoPO8JKDLZz3_7PmEl7-w/o.jpg"
      }
    ],
    "user_id": "ax7NI_ym7AADaFa5z--P4Q"
  },
  "U9rruaiHAuzrblCZ6BVEzg": {
    "date": "9/2/2015",
    "text": "In what used to be a rather dodgy looking gay bar, suddenly The Black Fox popped up.  Not quite over night but the first few weeks when i walked past i wasn't sure if the bar was aiming for the same clientele or trying something new.  luckily though it was the latter and after a few weeks of planning i finally made it there for cocktails and dinner with some friends.  now i'm sure the place has had a re-vamp but i'm not sure what the inside of Priscilla's had looked like before Black Fox took over.  anyway it seems to have gone the theme of many new bars with that slightly industrial chic look.  it works mostly although some of the decorations do leave me wondering if someone happened to just place that empty bird cage there or if they actually meant to do it.  either way it's a perfectly pleasant atmosphere that has quite a buzz when the tables are full.  the menu is fairly concise with offerings of gastro-pub type food.  think gourmet pizzas, hotdogs, and burgers with a good mix of toppings available.  there is also a small starter and dessert section.  on it being friday, my friend and i decided to treat ourselves to a small version of the cheese board and i followed this with a 6in pizzette topped with pulled pork.  the cheese board came out quickly and for a small at 4.50 it had loads of cheese.  easily enough to split between three people and not just the two of us.  we got a massive side of bread with it as well although i would have preferred oatcakes as bread and cheese is just not really the best combination.  our mains arrived a wee bit latter and my pizzette was super tasty.  for 6 inches it was the perfect size for dinner without making myself feel stuffed.  the pulled pork had a good bbq-y sweetness to it and there was loads of melted mozarella to bring everything together.  i had a bit of my boyfriend's pork and chorizo burger that was also seriously tasty.  the chips i ordered on the side though while having a tasty spicy coating of them were not as crisp as i would normally like them.    the drinks list is quite good and not pricey.  cocktails start at 6 and the two i had were really well made and enjoyable.  the second being a bit more boozy than the first.  there's also a good selection of spirits on offer and the normal wine and beers.  while this place has a lot going for it, including really friendly service it is let down a bit by their tiny kitchen.  it's basically in a corner just off the bar so when it's crowded your food order can take awhile.  in fact when we sat down we were told that she couldn't take any food orders for 25 minutes to help the kitchen clear it's backlog.  which is fair enough and meant that we had more time to look at the menu.  however if you're super hungry you might not be happy to hear you'll have just a 25 minute wait to even order your food.  for the future i'll just keep that in mind and make sure i arrive just on the verge of being hungry!  overall a really great addition to leith walk and some place i'll be sure to head back to.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "icHV1jIYsIJMuU1jFpVqIA",
        "caption": "Photo of The Black Fox - Edinburgh, United Kingdom. Small sharing platter",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/icHV1jIYsIJMuU1jFpVqIA/o.jpg"
      },
      {
        "img_id": "Rq1Hhccp_0dJn90VtsVO6A",
        "caption": "Photo of The Black Fox - Edinburgh, United Kingdom. Rudolph the red nosed rum fiend cocktail",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Rq1Hhccp_0dJn90VtsVO6A/o.jpg"
      }
    ],
    "user_id": "Z_xbO-Iaxbx-ZRPhLJK-Ew"
  },
  "fBN8G-S_x2HFpIybNeYlCw": {
    "date": "12/17/2015",
    "text": "We hung out in this bar loads during a recent trip as it was near our Airbnb.  Great place for a drink - chill vibe, playing films on a TV in the corner, cozy booths, and friendly bartenders.  Food not bad either - their meat/cheese sharing board is MASSIVE and the one for \" one person\" can easily feed 2, maybe even 3 people.  Such big hunks of cheese!   Not as much meat as cheese, but it was all tasty at any rate.  We also had a 6 inch pizza, which was piping hot and had nice crispy slices of pepperoni on top.  AND the chicken wings - which were also served piping hot and were actually rather good, with the spicy flavor of the Cajun Spice dry rub.  Two of us shared this food - we meant it to be more of a snack, but it was a meal, and we were pretty stuffed!    If we lived around here, we'd totally make this place our local.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yaBIVHDxaUBN2YHQ8-YiuQ"
  },
  "f6snRWXMjweZ2oVPxYffcw": {
    "date": "2/14/2015",
    "text": "I came here for a night cap after exploring a couple of Leith Walk bars. There's a great variety of watering holes around Leith and I was eager to see what The Black Fox had in store, but was a bit disappointed. The decor is quite boring, grey tile wall, and the generic looking dangly exposed light bulbs which so many refurbs are incorporating these days. Nothing really grabbed me. The bar staff were very friendly and offered me a sample of their beer-cider, or was it cider-beer?? Either way it was nice, but I opted for a pint of Ceaser Augustus, which was over-priced. So I drank it with a face like I'd just opened my gas bill, then retired home for the night. I had higher hopes, but it didn't leave much of an impression.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "k_VkNVPou-CS1gyvN5AsUw"
  },
  "JlGbRn7qQ10od5zeQavjVQ": {
    "date": "11/19/2015",
    "text": "Once upon a time, this venue was the den of ill-repute known as Priscillas - a gay bar with a bad reputation.  It has now been transformed from dingy dive bar to trendy gastro-pub!  And conveniently located close to my sister's flat.  Happy days!  When last I visited, I was only supposed to be in for a couple of drinks but ended up being a great many beverages with food.  Barely made the last train to Glasgow that night!  I digress. We ordered the orange, apple & walnut salad and the gourmet cheese platter to share.  We also slowly worked our way through the cocktail menu, of which my favourite was probably the Iorek Byrnison (named for a literary character, and if you identify him you get a high five).  The food was tasty and reasonably priced, as were the cocktails.  Normally cocktails of this quality are a lot pricier in Edinburgh.  The staff are happy and chatty, and put up with our mass cocktail nonsense.  It is also a puppy friendly venue!  This may be my new favourite place on Leith Walk. :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y2BLJqGAtX3Eb-3PGBkeMw"
  },
  "LYocOEdOFauPGnLslr5Ekw": {
    "date": "2/8/2015",
    "text": "Nice addition to Leith Walk. The bar staff were really friendly and helped me choose an appropriate beer from the long list available. The drinks stocked aren't standard big-brewery fare so there are lots of different options. I got a Bitter and Twisted (yum) and then a caramelly porter that I've forgotten the name of, but it was really nice.   I visited the place when it was closed for a networking event. It was a great space to chat away to folk and mingle, and good location in the middle of Leith Walk. I didn't try and of the food but I spied some pizzas and they looked mighty fine.   Nice vibe, good decor. Lots of seats. Central. Good staff. What more could you ask for? Recommended!  Only negative for me was the lack of alcohol-free beer. Maybe the owners could consider stocking one of these? I would recommend Staropramen non-alcohol, which actually tastes almost like beer ;) Always good to have the option for those on the roads or just not too into getting half-cut.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "fcMTpwfLS9F5DWTqlp8ktQ"
  },
  "p4NQ3Qnne50X06hR_b-jcA": {
    "date": "10/17/2016",
    "text": "Tonight was the third time in a week my friend and I went to this bar for the \"London gintleman.\" Best gin and tonic I've ever had! Tonight unfortunately the drink was not the same. The waiter swore up and down that the drink was the same. It tasted like a mediocre margarita tonight instead of a perfect mix of cucumber, mint and gin. I will try again another night and fingers crossed, it was the bartender making the drink tonight and not a change in recipe! Atmosphere is great and drinks are a great price. Worth a visit for a cozy place for drinks.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1I8nGltdxZfRQzuN8TF2cw"
  },
  "pAwKhXs57WsfgM15hzhb3w": {
    "date": "9/24/2015",
    "text": "This is a great place, friendly service, nice selection of IPAs. We ducked in to get out of the rain and were pleasantly surprised. We got a nip of whisky and a couple beers. We shared a meat & cheese plate and left very, very happy! And Richard is lovely.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vp0QYHT7-bEDJBdRsZb-nQ"
  },
  "P02orbpi3nRGccOQTod5OQ": {
    "date": "2/17/2015",
    "text": "This is a cool little local place for sure, but the service was pretty rubbish. The staff seemed way to cool to actually do their jobs. The food was really good so it was a bit of a let down!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hvesQFKxkUtNqTkdrm-UIw"
  }
}