{
  "AOM7XKs6bsxuNzxv9a0yRg": {
    "date": "4/8/2015",
    "text": "Good, unpretentious French Caribbean fare served in a cosy and welcoming atmosphere by friendly folk. BYOB too so a visit here is never going to break the bank.  Everyone who was there on the night we visited could have done without the loud, drunk table of three blokes in the corner although they were at least just camply bothersome rather than actively offensive and you could have an issue like that anywhere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "txzOZrHK9EVY0kYjSuXkKg"
  },
  "fvRYmD9cFLFIeIFHsdGICw": {
    "date": "5/13/2013",
    "text": "Fresh, innovative...  Great service, amazing food... Well worth the commute!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "eTdzynCky7cO7qjrHPCrnw",
        "caption": "Photo of Riverlife - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eTdzynCky7cO7qjrHPCrnw/o.jpg"
      },
      {
        "img_id": "a75jBjltiDNV9rCuE1l5_w",
        "caption": "Photo of Riverlife - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/a75jBjltiDNV9rCuE1l5_w/o.jpg"
      }
    ],
    "user_id": "eKc2gY6fPaQy3zNsbIYDvA"
  },
  "QSPcT6h6nQwVeZui92XEdA": {
    "date": "5/12/2013",
    "text": "I was so happy to try this innovative, unique restaurant that is new to Edinburgh. I was pleasantly surprised to see such beautiful presentation of the food of each course that came out (see my pictures!) and also by how delicious each dish was.  I bought a Groupon for a two-course dinner here and last night my boyfriend and I came to try out Riverlife since I had been intrigued by the Caribbean-inspired French menu. The staff were extremely friendly and welcoming, and the menu hosted a great selection of dishes. We had figs wrapped in pancetta and mushrooms stuffed with blue cheese for starters. Each dish had an explosion of flavours and was fantastic (and beautiful!). My boyfriend had the delicious jerk chicken that had fantastic flavour but would have been a tad too spicy for me to have by myself, but I enjoyed a taste. I enjoyed the rack of lamb with potatoes provincale and ratatouille. The restaurant is BYOB which works well if you are suitably prepared. It was a fantastic meal and we also enjoyed delicious coffee to round it out. I enjoyed the fantastic menu and different items that you wouldn't find elsewhere in Edinburgh.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "4I5I4AfRBZaCbUQQemmsZQ",
        "caption": "Photo of Riverlife - Edinburgh, United Kingdom. Butter bean cassoulet. It&amp;#39;s huge!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4I5I4AfRBZaCbUQQemmsZQ/o.jpg"
      },
      {
        "img_id": "exYA6K-lYG8O814E-0xXkQ",
        "caption": "Photo of Riverlife - Edinburgh, United Kingdom. Jerk chicken the second time here",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/exYA6K-lYG8O814E-0xXkQ/o.jpg"
      },
      {
        "img_id": "mB0jdvij8vx7r5QaJB7Xsw",
        "caption": "Photo of Riverlife - Edinburgh, United Kingdom. Rack of lamb!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mB0jdvij8vx7r5QaJB7Xsw/o.jpg"
      }
    ],
    "user_id": "vvQhikDPjAzHfSLVgnFkPQ"
  },
  "jTqN_MqsxS8WFCm1TjkkuA": {
    "date": "11/17/2015",
    "text": "Food and service are great! The scallop is about to beat Gordon Ramsay's  will definitely return !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "aXhqEu6BusAi2Vf6hFlmQQ",
        "caption": "Photo of Riverlife - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aXhqEu6BusAi2Vf6hFlmQQ/o.jpg"
      },
      {
        "img_id": "L1jivHuxi-PcLC2gZMiC_Q",
        "caption": "Photo of Riverlife - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/L1jivHuxi-PcLC2gZMiC_Q/o.jpg"
      }
    ],
    "user_id": "Z8JVePakSkkBfxBlwyxujA"
  },
  "9m7FQOkM1TFd7e53fjbChg": {
    "date": "8/12/2013",
    "text": "I visited Riverlife a couple months ago for their nine (!) course French Provencale banquet on offer.  We booked mid-week and the restaurant was pretty dead.  There was only a family of 4 and us in the place, so there wasn't much atmosphere but I guess it is a bit off the beaten track (in Dalry) and relatively unknown. The interior was quite plain, cheap and a little dull so first impressions didn't fill me with excitement.    There was some confusion over the booking and the waitress said there maybe some wait between course as the chef was not prepared for the 9 course banquet, however it wasn't noticeable and the time waiting was filled while drinking our BYOB red wine, with free corkage!   Our starters included seafood bisque, which was very creamy and tasty, so far so good! Our second starter was warm goats cheese salad, also delicious and plate was scraped clean!  So far the starters had been served on separate plates so I expected the following courses to be the same, but instead next 5 courses were presented on one large long dish to share.  There was two of each seared fillet of sea bass, rib eye steak, rack of lamb, confit duck leg and pork scallops.  The sauces used on each meat were all very similar, a red wine gravy, however the seabass had a lovely garlic butter sauce in it's own small dish.  The other meats however were a bit gristly and of poor quality.  These meats were eaten along side a plate each of caramelised sun blush tomato, red onion tarte tatin, dauphinois potatoes and vegetables.    Then came our dessert, a lemon tart (very sickly sweet) and a selection of cheeses to share.  Although we were already full after the previous 7 course, the desserts portions were very small and uneventful.  So generally the meal was enjoyable and we rolled out of the restaurant will our bellies full, but I won't return for the 9 course banquet, maybe try something else from the menu instead.  The overall bill was very reasonable due to the BYOB.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wsX8-XIRYyBvFc_broIA8Q",
        "caption": "Photo of Riverlife - Edinburgh, United Kingdom. The 4 main course meats.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wsX8-XIRYyBvFc_broIA8Q/o.jpg"
      }
    ],
    "user_id": "1-dmQknIfIwZ6rmXk5r0pA"
  },
  "_eDJ8IPIMLRscVNVHMBLdg": {
    "date": "3/1/2014",
    "text": "A group of 7 of us went last night for a wonderful birthday dinner. As a vegetarian I was hesitant, because there aren't HEAPS of vegetarian options, to be precise, there are 2 vegi main course options.  The staff were wonderful, very friendly and helpful. They brought out fresh bread before our mains came, which was lovely, because we didn't order starters. Also we took great advantage of the BYOB with no corkage!  Our mains came, everyone ordered something different, but everything was beautifully presented! My mushroom and lentil fricassee was divine, everyone else seemed happy with theirs!  There was a hen do in at another table and a guy who worked there started playing guitar for a wee sing along with them at the end of the night. We thoroughly enjoyed this, especially when he then came over to us to sing happy birthday to my friend.  It's not in my end of town, and I wouldn't have considered going there before, but I am extremely keen to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "11j3zugM2dfAnHcPM2LD7w"
  },
  "ijuB-vEROUZLjyyO9W1CBA": {
    "date": "10/6/2013",
    "text": "We were her on an voucher for a French 3 course meal. The service was efficient, very friendly and welcoming. The meal however was more an hit and miss. The starter of warm goats cheese was not warm. The Blue cheese filled (button!) breaded mushrooms were not tasting of blue cheese.  The jerk chicken breast was a little dry but the sauce was excellent, however... it was all on my wife's plate, because I opted for the duck. The duck was tasty, but not very well prepared. No crispy skin and could have been less chewy. The cherries were very pleasant.  Dessert: creme brulee! And it was 'crack' (yeah!) and not too runny (yeah x 2!).. but not hot or even warm enough (booh..)  The coffee was so so.   I can only conclude that the chef is good, but missing refinement. The sauces and additions were spot on, the meats and the flavours need work.   We will be back to see if anything has changed",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "fKi8ZF3xpJJkgSusRubeMA"
  },
  "kFeB-jqqPfLLkpMFUB0aYQ": {
    "date": "6/11/2013",
    "text": "Reading the reviews here I almost feel like I visited Riverlife in a parallel universe instead of the French and Caribbean restaurant that everyone seems to be raving about.   I went here on a Saturday with a friend and we had a voucher.   What we were expecting to get with the voucher:    A Nine course French Provencale banquet for two including seafood bisque, warm goats cheese, seared fillet of sea bass, rib eye steak, rack of lamb, confit duck leg, caramelised sun blush tomato and red onion tarte tatin and pork scallop all served with dauphinois potatoes and vegetables plus a trio of cheeses served with assorted crackers plus tea and coffee to finish.  What we actually got served:   Massive bowl of bisque - I had a few spoonfuls but left the rest since I had 8 more courses to go  Warm goats cheese salad: Grilled goats cheese with leaves and a balsamic glaze. Nice but nothing to write home about. I again only ate half of it so I could leave room for the rest of the 7 courses.  We then had individual plates placed before us that contained the tarte tatin which had what Mary Berry would call a very soggy bottom, potatoes, boiled carrots and broccoli.   We were then presented with an elongated tray which had 5 different items on it.   Overcooked, grey and dry slices of steak with a red wine gravy  Overcooked, dry duck with a red wine gravy  Overcooked, dry lamb with a red wine gravy.   Overcooked, dry pork with a white tasteless sauce.  Grilled seabass - cooked to perfection with a garlic butter sauce  We ditched the meats after a valiant effort of trying to unsuccessfully chew them.   I ate the Sea Bass with the vegetables on my plate.   The waiter seemed unperturbed by the barely touched food on the tray. I looked around and noticed that a few other diners with the meat tray had left theirs untouched too.    We were then asked if we wanted the trio of cheese OR tea/coffee. Not AND as detailed on the voucher. OR.   I waited for my coffee wishing there had been a way to swap the unpalatable selection of meats for another bit of the Sea Bass.   Or have them bring my unfinished bowl of soup or salad back.   Or even the basket of bread that I had left untouched and had asked to be taken away :(  A group of 15 people arrived just as we were about to leave. They had the look of eager anticipation on their faces that I had entered the restaurant with..... I wanted to slide them a little note to say 'Run out of here, fast as you can, or least steer clear from the meats'   I then saw the vouchers for the 'banquet' being handed to the waiter. They were beyond saving.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "M9X9HpdWPGermFQLYiPCJw"
  }
}