{
  "r50m4D9mDflIVotxEnH5dw": {
    "date": "9/13/2016",
    "text": "This place is great! I've been here the past few days since I've been to lazy to make my own lunch.   Portion sizes are massive and super cheap, great selection of toppings for baked potatoes and there are also drinks and candy bars you can buy to accompany your lunch or dinner.   Service has been exceptionally friendly every time I've been in and you're guaranteed a good chat every time.   It's convenient, tasty and cheap. It's a lovely addition to the Stockbridge area the doesn't require you to sit in or break the bank.",
    "rating": 5,
    "rated": {
      "funny": 7,
      "useful": 17,
      "cool": 17
    },
    "photos": [
      {
        "img_id": "gALbnvwkidPTfxvh5m8Svw",
        "caption": "Photo of Take It Away Spud - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gALbnvwkidPTfxvh5m8Svw/o.jpg"
      },
      {
        "img_id": "AdyeUtek2tVnCZlq4Jg34g",
        "caption": "Photo of Take It Away Spud - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AdyeUtek2tVnCZlq4Jg34g/o.jpg"
      },
      {
        "img_id": "T823WRoqBXCdiOSU2Hgv8g",
        "caption": "Photo of Take It Away Spud - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/T823WRoqBXCdiOSU2Hgv8g/o.jpg"
      }
    ],
    "user_id": "NwVyki35xOcaxhMzHNtHDQ"
  },
  "-Pt7dGvLlSCj8qLwz8MjcA": {
    "date": "12/14/2015",
    "text": "I'm really grateful that this baked potato shop exists. I've recently taken on a temporary commute which is fairly exhausting and on those times when a home-cooked dinner is just too much to ask of my weary self, I'll pop by Take It Away Spud and let them do the work.   I've never had to wait very long and the potatoes are fresh and full of filling. Service is always very friendly too. And the shop front is pretty cool. Plus, hooray for no washing up!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "LVUrg_Jb58QwAd49yczYaA",
        "caption": "Photo of Take It Away Spud - Edinburgh, United Kingdom. Tuna &amp;amp; sweet corn tattie!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LVUrg_Jb58QwAd49yczYaA/o.jpg"
      }
    ],
    "user_id": "8rI2CoS4ltQePbZceSOgow"
  },
  "RYkJMN5ZfPySk5gYeitJZA": {
    "date": "4/22/2012",
    "text": "love this place! the portions are very good and the choice of fillings is great! my fav is haggis. great if you cant be bothered cooking! plus no washing up! yay!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kfW3ELL6t9QNL4T5VjQc5A"
  },
  "v6jDKqZ_y9NbMzD-YiPwuw": {
    "date": "2/3/2009",
    "text": "This takeaway baked potato shop is an institution, situated right across the road from St Stephen's Street and all the pubs there. They do a vast array of flavours and fillings. My favourite is the chilli beef, or vegetable chilli. The portions are very generous and, because they only sell baked potatoes, the fillings taste great and a lot of effort has gone into keeping them fresh and different. They always have a couple of fillings that change from week to week. There are one or two female staff who always put up with our taking ages to decide which filling to go for. It is open late at weekends, so makes an ideal change from the usual chip shops on the walk home from the pub!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l8gCfUNUdO64TtIv71UUaA"
  }
}