{
  "b5rpWbniQMOE8RJ7_25RxA": {
    "date": "7/14/2019",
    "text": "Good quality cafe with food selection. There's an Afternoon Tea service though I didn't try it. Apparently, it's rather nice.   Had mainly the salad and some tea and a scone. Counter service. Tasty food, and good and efficient service at the counter.   What really makes this great are the tall ceilings and windows that give it a nice airy feel. Acoustically, the space feels quiet; when I was here the cafe was about half full but people talked a little like they were in a library.   Bathrooms: Exit cafe to use the museum toilets but those are very close. Clean, functional, modern, and spacious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pjdbKi6CJFDdszNUmwK83w",
        "caption": "Photo of National Portrait Gallery Cafe - Edinburgh, United Kingdom. So many salad options!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pjdbKi6CJFDdszNUmwK83w/o.jpg"
      },
      {
        "img_id": "AFYZOctmBL8_9WguRgDteQ",
        "caption": "Photo of National Portrait Gallery Cafe - Edinburgh, United Kingdom. Sandwiches!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AFYZOctmBL8_9WguRgDteQ/o.jpg"
      },
      {
        "img_id": "vcvIpLGmw2B2Bn9NHPxI9g",
        "caption": "Photo of National Portrait Gallery Cafe - Edinburgh, United Kingdom. Savory things!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vcvIpLGmw2B2Bn9NHPxI9g/o.jpg"
      }
    ],
    "user_id": "LPVxp83hPPvp1eP96EIcSw"
  },
  "65KGCtW0V-DUN0Fkn2MXZg": {
    "date": "11/19/2017",
    "text": "I thought this cafe would be extortion but it was pretty decent especially for what you get which was chicken and sweet corn soup with big chunks of chicken. Expect lots of health food recipes in this cafe, butternut squash, kale, quinoa but also a great selection  of delicious cakes. Expect an abrupt cashier but apart from said cashier this place is pretty decent, its busy, big but a good place to eat before or after taking in the sights of the gallery which I highly recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hRrGkvMHHIB9R0gwkNlVPQ",
        "caption": "Photo of National Portrait Gallery Cafe - Edinburgh, United Kingdom. A small selection of the cakes on offer",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hRrGkvMHHIB9R0gwkNlVPQ/o.jpg"
      }
    ],
    "user_id": "GEgifgwsWxtihJ6u5OYfAw"
  },
  "TXl2dDQ6n_XKZxL8i_CnXg": {
    "date": "10/31/2017",
    "text": "The cafe in the National Portrait Gallery offers a wide range of tasty sweets as well as some dishes for lunch. Situated on the ground floor, it got a lot of space and tables. Passing by a couple of times, we always saw lot of people inside which is a good sign from our point of view.  As the cafe is part of the gallery which is free of charge to enter, we dropped in today and enjoyed some cake in between our tour around the gallery. The service was quick and friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "M-j0fuD5ZWoFNno51ePzJw",
        "caption": "Photo of National Portrait Gallery Cafe - Edinburgh, United Kingdom. Art is all around as the cafe is part of the gallery (free entry)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/M-j0fuD5ZWoFNno51ePzJw/o.jpg"
      },
      {
        "img_id": "Pk0DZQfMsbDjNbK0Bo4p1w",
        "caption": "Photo of National Portrait Gallery Cafe - Edinburgh, United Kingdom. Sweet treats in all flavors ;)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Pk0DZQfMsbDjNbK0Bo4p1w/o.jpg"
      }
    ],
    "user_id": "0jBMjSZJ8MBYgCEyaJpfPw"
  },
  "vnCjwyQ1_VVOwYHyWZ7-HA": {
    "date": "11/18/2016",
    "text": "What a surprise! Lunchtime in Edinburgh can be a bit hit-and-miss but after a couple of hours in the Portrait Gallery we sauntered into their cafe for a bite to eat. It was bustling, which augured well and at the self-service counter we could see why. A host of croissants with fresh looking fillings, tasty sounding soups and a couple of hot dishes as the daily choice. We chose a couple of croissants - one ham, one pastrami. Both delicious and accompanied by good coffee it filled the hole just as we wished. Definitely one to revisit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9vv8GzGUizl6Sefl2z8R9g"
  },
  "oa5O7PufWaIZxvkjXSp9hg": {
    "date": "11/16/2008",
    "text": "This is one of those strange cafe's that seems to have been in a time-warp for years and years. Most of the partons are of a certain age, shall we say, and it seems to cater mainly for soup, cake and tea lovers. It can get very busy at lunchtimes and, as it is situated at the end of the gallery through the shop getting access to it isn't so easy for either young families or those in wheelchairs.  It is a nice place to go if you are feeling nostalgic and don't mind sharing your table with a couple of strangers at busy times!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9pT2y3XKs0Iq9Wq_FWnnkA"
  },
  "pNZczCN64Si4IUbkOVE1iA": {
    "date": "11/30/2008",
    "text": "I suspect that most of the people here have not been to the gallery but come for the cafe. It has a long reputation for good quality food and baking and is always busy. The ingredients are fresh and good quality. The scones are particulary good, but my most lavish praise must go to the brownies which are absolutely deliciousl   As it can get very busy you sometimes have to share a table with strangers,but mostly that is not a problem. This is the place to see a real mix of Edinburgh locals, from little old ladies who lunch, to bank types who have just popped round the corner from St Andrews Square. Of course, while you are there, have a look at which exhibitions are on. There are usually some smaller free ones as well as a ticketed main exhibition. The shop is also a good source of presents for arty friends and family.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3LW_w3POTvwjl0gY-rHmmw"
  },
  "hPPQnG6awt--dp2DSZfepg": {
    "date": "10/2/2008",
    "text": "My only hesitation about writing this place up is that it might therefore get even more crowded than it already is. But there you go for the love of mankind, I will do my honest duty. And my honest duty is to say: This place is fabulous. The food is just soooo delicious! My all-time favourite was the smoked salmon pate, I was in grave danger of over-eating! But equally nice are the cakes, teas, and soups. It really is a great place with a cosy (well, when it's truly packed at lunchtime, too cosy!) atmosphere, lots of dark wood and beautiful windows.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0sGiC_VQubXxFEkg-OLqyw"
  },
  "u_m8-BZbYwzDZYvxpQ5q7g": {
    "date": "1/25/2009",
    "text": "Great place to go for a coffee/tea and snack! A real find and soem very tasty homemade cakes!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gA0Jg6RZ_Fn8cJVnAXOfwg"
  },
  "4nmddTpbvWoy3F1VAJuqvg": {
    "date": "11/11/2007",
    "text": "It's not supposed to be the main attraction, but the cafe of the Edinburgh portrait gallery is a wonderful place, and once you've looked round the rooms and feasted your eyes on the artwork, it is always nice to feast more literally on some of the lovely salads, home made cakes and whatnot in everyone's secretly favourite exhibit. I mention cakes because here are some of the most luscious looking you will see; caramel slices, marble-topped tiffin, flapjack; all huge and very rich. It is also nice for a general cafe-goer, having a nice, cultured collection of eaters.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x-xinceFIUsjPutqNBiAaQ"
  },
  "v5NTTUtmTy_Tl0gxVLvMkA": {
    "date": "2/24/2008",
    "text": "The National Portrait Gallery is almost as famous for its delightful wee cafe as it is its exhibitions. A splendid place to drop-in to enjoy a cup of tea and one of their excellent homemade scones or flapjacks (try the date oat flapjack). The decor is nicely traditional, with beautiful windows and interesting artwork. Great to visit before and after the gallery itself; very pleasant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "asf3NiIfdlbiCUUwCO4iWg"
  }
}