{
  "rhFg32pGyPuqzMF-LrmtcA": {
    "date": "3/25/2013",
    "text": "Steak pie supper around half the price of other more central establishments yet with no loss of quality in either the chips or the pie. A chipper to make more use of I think.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "txzOZrHK9EVY0kYjSuXkKg"
  },
  "HymcTBfLUzDtsLojzVujyA": {
    "date": "5/9/2010",
    "text": "I don't care how much chrome you put on the pillars, or how beautiful the mosaic tile work is, you can't be a classy establishment when you're encasing fish in a 3 inch tomb of batter. It's not happening.  At least The Mermaid is trying, although I wish they had spend less money on decor and invested in a better frying unit. The chips were piping hot on the outside, but stone cold on the inside.  The sausage was cooked very well and actually had a little bit of flavor to it.   Not a great chippy, just a good chippy.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SeJDbSCxu1LkNVlRx3tRmg",
        "caption": "Photo of Mermaid Fish Bar - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SeJDbSCxu1LkNVlRx3tRmg/o.jpg"
      }
    ],
    "user_id": "9nUtGoOnZMPlZdUQV_aqTA"
  },
  "ibYy32REY001KnQYTXIzAA": {
    "date": "7/15/2008",
    "text": "The worst fish and chips on Leith Walk by far- which is drastically poor since there are quite a few takeaways on Leith Walk that are tasteless disasters.   The fish is never battered nicely, always too thick and overpowering. The chips are pathetic and too salty even when you don't ask for extra salt. The kebabs should come with a health warning.   It stays open late but that it's only salvation and, in fact, its lifeblood, as it often crammed with late night drunkards.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T9QAj2joHCAbdKeUyzAZJw"
  },
  "jZVscocE3YG9H10VotgBjQ": {
    "date": "3/18/2009",
    "text": "excuse me, i would have to disagree with you there!! The mermaid is one of the best, if not THEE best chip shop in leith and possibly even edinburgh! How you can say that is beyond me and you clearly have some issues yeah? If the chip shop is so bad then why did leith's very own proclaimers rank it so highly and feature it in the evening news? And why would famous American cehf Anthony Bourdain feature it in his new tv programme No Reservations which was recommended by Ian Rankin? I suggest you get your facts right yeah? You're calling this chip shop bad, I have seen way way worse and the food is great! Video link: <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DJwTeHRLTuy4&s=760bc33ca5edc6eddd4f67bfe48a79bcd9b329ee6a80971479007fef20b36ed9\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=JwTe...</a>",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h-1bOMSbA9tl4z_yqY309A"
  }
}