{
  "SfmmY-pLim9p9G1CxR175w": {
    "date": "9/24/2013",
    "text": "I was hugely sceptical about Cosmo - it's a buffet restaurant specialising in Pan Asian food. Surely it'd be a case of jack of all trades, master of none?  My boyfriend had heard good things, and went along with his family - coming home with rave reviews. \"It's way better than Jimmy Chung's!\" he claimed. Hmm. It wouldn't be hard to be better than Jimmy Chung's, but still, I wasn't convinced. However, last night after the cinema we were both hungry and he managed to convince me to try out Cosmo. And you know what, it was pretty good.  In my head Cosmo was going to be another Red Hot Buffet (which also sells pan Asian food, as well as pizza) and in terms of what they offer it's similar, but it is better. Yes there are the obligatory fried Chinese starters, but they're less greasy than Jimmy Chung's. There are various stir fries and curries to choose from, as well as a decent selection of noodles and rice. I had a Mongolian Lamb which was fairly tasty, and I also enjoyed the broccoli so much that I took some on two different plates of food.  The real star is the hot plate where they will cook fresh seafood for you in front of your very eyes (or steak or dumplings if that's more your thing). I went for squid with a teriyaki sauce, which had a pleasant charcoally vaguely cocoay taste to it - probably due to whatever had been cooked before it. Freshly cooked food at a buffet, who'da thunk it? Oh, and the sushi is okay. There's only a few different types, but it tastes fine. I did decide against trying their Korean option though, as cold noodle soup doesn't sound terribly appealing...  Cosmo is far from fine dining, and I'm still biased against these world buffet type restaurants, but its one of the better of its ilk. And, given your other options for food in the Omni Centre, you could do a lot worse than pick Cosmo over Frankie & Bennys or The Slug and Lettuce!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 1
    },
    "photos": [],
    "user_id": "Mqg4L8flJmg8pqeR-uYyRg"
  },
  "oCKlWOCbQVwGXVcej3sdww": {
    "date": "4/15/2014",
    "text": "There's food and a ton of it.  So much choice and you can keep coming back and fill your plate up.    I had the thai green chicken, crispy prawns, spring rolls, prawn crackers, crispy pork on pancakes, slice of pizza, slice or two of bread.  All very ok - nothing wowsers but tasty and cooked.    The desserts were meh.  That's that said.  Synthetic cream in probably freezer cakes.  Also i was quite full from all the savoury crap and unlimited juice refills!  It's very busy, mainly because it's the easter holidays and this seems to be a cheap place to fill yourself up.  It's ok I guess but i know I'd go to a indie over this next time!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BhYROfCjIJsKUk22_IVHig"
  },
  "PTdlAjLBm7mM5trMM1SIdw": {
    "date": "12/27/2013",
    "text": "Probably the best buffet I've ever been to. They have a nice selection and everything is wonderfully delicious. The duck pancakes are a must for me.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "UE-46LEkPBBgESCF10xLIQ"
  },
  "40AQ6_TgEo3qLwpGFd13ow": {
    "date": "10/1/2013",
    "text": "Just had lunch at Cosmo after reading all of the high praise it gets on Tripadvisor.  It's curious to me that this restaurant has over a hundred reviews on that site, but only 1 review on Yelp. Maybe it's written up in the guidebooks but locals never come here?  What do you need to know if you're considering Cosmo? Basically this:  If you are hungry for Chinese, Thai, Indian, or Japanese, then go to a Chinese, Thai, Indian, or Japanese restaurant.  You will almost certainly have a better meal there than here.  If you and your mates can't decide on which Asian cuisine you'd like, then come to Cosmo and you will each get basically what you want.  The food isn't bad. Eating here is like eating on a cruise ship. You're in an enormous room with no windows surrounded by over a hundred diners who all mechanically move between the food galley and their tables. (My girlfriend and I did some triangulation and determined that it is better than a Carnival cruise line buffet, but not as good as a Holland America cruise buffet.) There's something for everyone, but no one will be really excited about anything. Surprisingly the meat is actually cooked pretty well, but most of the sauces and curries are runny and a little bland.  My advice is to steer towards the Thai area, avoid anything fried, and plan on having dessert somewhere else.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N0udGqfu8uh4Pa8OaV2ozQ"
  },
  "Ez-XFu_UVhxSIYfk0SPJuA": {
    "date": "1/4/2015",
    "text": "i really like cosmos despite having one let down when i went there for lunch with 3of my friends last year, when the staff were not very nice and the food was not fresh. however i would definitely recommend going for tea at night time as it is so much better. i have been 3 times to this place, and ive only had 1 bad experience with it- when i went to lunch. there is a huge range of foods, including:  roast beef & Yorkshire pudding (only at night, so nice!!) range of pizza lasagne  garlic bread duck &pancakes various currys , naan bread chicken nuggests rice soup  nachos/tacos  sea food (sushi etc) lots of chinnese food (spring rolls, beef chow mein, prawn crackers) and LOADS more.  they also have a huge range of deserts including a brilliant chocolate fountain which had marshmallows and others sweets to dip into. this is only on at night though, which is one of the reasons why i recommend going then! they also have chilled cakes and mini trifles, as well as ice cream&cones, a huge vary of fruits and fortune cookies!  the staff, apart from that one ocation were very helpful and came to collect your plate whenever you were done, then you could go back up and get more food.  altogether, i think the price is decent, for the amount you can eat!  the place is clean although just a little crammed, and another thing i like about this place is that you can see the cooks making the food in front of you.  recommend for all ages, and i would give it a 4/5",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jwl_Z1zF1Aa9GNE6BkrBZQ"
  },
  "eTcJZ9KBXAKdZe3VwjdieQ": {
    "date": "9/16/2019",
    "text": "Not generally a huge fan of buffets but this was really good.  Much better than your standard buffet in the States.  It was a nice change from the pub fare we had been enjoying while in Edinburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3PDNUgZhrqT5cI8__usGtA"
  },
  "NAORjBA5u6PWMehe_JereQ": {
    "date": "8/20/2019",
    "text": "We saw that this restaurant always had a line to get in; before we even wiggled up to the front and asked how long a wait and it was 45-60 minutes-so we passed . Tonight we got there before 6:30 pm on a Tuesday and were able to get right in! We THOUGHT this was an Asian restaurant and it was but also others... it is a buffet restaurant of Indian, Thai, Chinese, Teriyaki station, Italian and little American food (hamburgers, fries but fries are popular here). (I'm sure I missed some other nationality) Then a row of fruits and little desserts! I noticed there was a lot of nice shrimp... really everything seemed to be a cut above! We don't usually go the buffets but this one tasted good! They even had s chocolate fountain if one wanted it. Cost was 14.99 including a soda drink.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "AArez2Vhm4Jxr8lShA979Q",
        "caption": "Photo of Cosmo - Edinburgh, United Kingdom. Dessert?",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AArez2Vhm4Jxr8lShA979Q/o.jpg"
      },
      {
        "img_id": "WJvECypAjZ4vtAmOY-3aiw",
        "caption": "Photo of Cosmo - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WJvECypAjZ4vtAmOY-3aiw/o.jpg"
      },
      {
        "img_id": "k7SA2LfRHQHj948EFgy99w",
        "caption": "Photo of Cosmo - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/k7SA2LfRHQHj948EFgy99w/o.jpg"
      }
    ],
    "user_id": "2UkZKQBZVuroUBKYs9WzeQ"
  },
  "AbVQjOKl-QayaU8kGls4xA": {
    "date": "6/6/2019",
    "text": "Just coming up for air! Food overload from Italy, Japan, China and India. Incredible selection for all buffets and very reasonably priced. Very busy so not the best for an intimate dinner, but an experience to be sure. Only draw back is you're not going to get threw everything in one visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "14o6wQZMB5IoatTGctVQoQ",
        "caption": "Photo of Cosmo - Edinburgh, United Kingdom. Cosmo Bufets!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/14o6wQZMB5IoatTGctVQoQ/o.jpg"
      }
    ],
    "user_id": "R32xVwDrzctu5YrIiYH7jQ"
  },
  "MGVRotL2wt6hjzm6EvfNJg": {
    "date": "10/24/2018",
    "text": "This place is food poisoning eating to happen! Raw chicken scab check your food before eating here. I watched adults outing there fingers on the chocolate fountain as well Wtf?? Also don't let the staff tell you the drinks are included because there not almost 10 American $ for 2?????  On another note the food just sits around and gets dry and nasty this place need to be shut down Asap!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ix3tKMaiJXy9iPs04pbMJw"
  },
  "T7NNKaMUOLZkRvbyipK88A": {
    "date": "2/16/2017",
    "text": "Despite being turned away last time, I had faith in the Edinburgh branch of Cosmo and decided to go on to see if I could bag a table. Unsurprisingly, the place was packed and there was a huge queue to get your name on the waiting list. As we were in a party of four, we didn't have to wait long and within 20 minutes, we were at our table ready to eat.  I had a Diet Pepsi to drink and it was just as you would expect it to be - sweet with no calories.  I ended up going to refill my plate three or four times with their korma, rice, chips, pizza, chicken satays and sushi. I disliked the sushi, so I only ate half a piece. It is a bit too chewy for me.  The korma was lovely. Creamy, and not too spicy. Just the way I like it. The pizza wasn't really too great but it seemed popular because the chefs were constantly refilling it. The chicken satays were a bit chewy as well, so I probably wouldn't have them again.  For dessert, I tried the chocolate mousse with vanilla ice cream and the toffee apple cake with profiteroles. I was a little bit annoyed because the chocolate fountain was not turned on but it was quite near the end of lunch when we visited, so I guess they were getting ready to pack up.  The toilets were a bit gross. The floor in the gents was really sticky.  I would come back here - there was a good atmosphere. I just hope that they turn the chocolate fountain on and clean up the toilets. And I will be avoiding the sushi and chicken satays.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "DBQx5tzNZ55mjes5seFGOQ",
        "caption": "Photo of Cosmo - Edinburgh, United Kingdom. Soda machine",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DBQx5tzNZ55mjes5seFGOQ/o.jpg"
      },
      {
        "img_id": "TdWXfegCo2hrDfIXY3_HIQ",
        "caption": "Photo of Cosmo - Edinburgh, United Kingdom. Another huge seating area",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TdWXfegCo2hrDfIXY3_HIQ/o.jpg"
      },
      {
        "img_id": "UFEIyUNiBDraoWH-N0j5Lw",
        "caption": "Photo of Cosmo - Edinburgh, United Kingdom. Huge place - tables go back for miles!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UFEIyUNiBDraoWH-N0j5Lw/o.jpg"
      }
    ],
    "user_id": "bi9U1kSYSbo2kPh7Xxuayw"
  },
  "x8Q3v_QcWKY42jGt-7DszQ": {
    "date": "7/29/2018",
    "text": "Great place for a family. Everyone can find food they would like among different cuisines. Great tasting food and good service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1HUOE0jUi-kRxMUU9UdPiw"
  },
  "9s87vTbLPM_WKYUAm8CGIw": {
    "date": "5/9/2016",
    "text": "I want to start off my saying its one of the most aesthetically pleasing buffets I've been too. Service was fine, pretty irrelevant since it's a buffet.  I'd say no particular choices were super impressive. A lot of the meats have sat out a bit (it could depend on the time of day since we went late on a Monday night).  My favorite was the hibachi grill since food obviously is most fresh and is served to order. Something about the high temperatures of the grill gives meats and noodles a nice char flavor (the best).   I'm a big lamb guy, and the lamb is just so so. Once again, it was a bit dry having sat out for awhile. (I attached a picture)  Finally, dessert was probably the best. The banoffee cake was unlike anything I've ever had being from America. I really enjoyed this. I'm sure you could find it better at a fresh bakery, still good tho.  Overall, not quite as nice as it looks. Slightly pricy for dinner but lunch is a bargain. I think it's worth a try since this is my own personal account. I attached a few photos to help you make your decision.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fAbiUIvPvefXFQTqhMujBg",
        "caption": "Photo of Cosmo - Edinburgh, United Kingdom. banoffee cake and brownie (don&amp;#39;t be fooled, I went up for round two)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fAbiUIvPvefXFQTqhMujBg/o.jpg"
      },
      {
        "img_id": "Vclhn_7qin4wKQkkznyV4g",
        "caption": "Photo of Cosmo - Edinburgh, United Kingdom. dessert bar: even more aesthetic",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Vclhn_7qin4wKQkkznyV4g/o.jpg"
      },
      {
        "img_id": "HAtAHCHWUC4LANtxDPZzCw",
        "caption": "Photo of Cosmo - Edinburgh, United Kingdom. nice looking buffet area",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HAtAHCHWUC4LANtxDPZzCw/o.jpg"
      }
    ],
    "user_id": "tbjcds39O4I6R0UsAQGFlQ"
  },
  "Af7a7JtpISzzeAdqpxJwhw": {
    "date": "10/22/2016",
    "text": "Wow! What an amazing variety of dishes!! You can crash the buffet and also take something raw and let it cook on fire right in front of your eyes! There is a mix of Chinese, Japanese, Thai and Indian food as well as pasta and pizza. The dessert is already so much you can't eat in a week. Even a chocolate fountain! It's also kid friendly and I bet they love it!! The staff is friendly, nice atmosphere and good sitting space. The price is very good compared to the huge amount of dishes you can choose from, especially at lunch time.  It's probably a sin going there, but one should've done it at least once! Experience the \"all you can eat\" adventure to its fullest!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tUdyuqlMqd9Vvs4UuT0gHQ"
  },
  "Uz78qSTq1pWMsyoqqLOO8w": {
    "date": "1/6/2015",
    "text": "First off this is a buffet restaurant, despite any bells & whistles attached to it so that in itself should temper your expectations.  With that in mind I got exactly what I was expecting when in for lunch on Xmas Eve and have no complaints - there was plenty of food available (Italian, Indian, Chinese, Thai etc.) and a decent range of desserts should you still have room after two or three visits to the main dishes. Soft drinks are bottomless too.  The staff aren't massively evident, save to initially bring you glasses and take away dirty utensils so we'd a minor wait trying to attract attention so as to pay up & be advised - any non-eaters will still be charged 2 to sit with you (one way of avoiding folk trying it on I suppose).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "txzOZrHK9EVY0kYjSuXkKg"
  },
  "LjHRk92KcsB6XZ6Im9sZYw": {
    "date": "1/16/2016",
    "text": "I was a bit reluctant to give this a try considering it is a buffet restaurant and I'm not too keen on them. However I had some positive recommendations from family so gave it a try. It is definitely a step above the usual buffet and nice to see some dishes being cooked fresh in front of you.   There was some fairly nice dishes if I'm honest although I thought the deserts were a bit of a let down and they all looked a bit synthetic some how. Anyway for the price it's pretty reasonable if you like that kind of thing. Just book early or be prepared to wait. It was mobbed on a Saturday night.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "5y_4KmkywV9DMSFyoTcYdA"
  },
  "SoJdH8JQpEoytVtkrjh3Og": {
    "date": "7/6/2017",
    "text": "Oh this place is very very good. Best value for money in any Restaurant I have ever been in. Food was Brilliant and there Chicken and Pizzas are just simply great for a buffet. Another thing is that you can eat as much as you want all for 15 I think it was. They have so many types of food from all origins and all I can say is that I will be back here. Only reason it is a 4 Star as there was a few missing things from The Menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ealnUMsFGHRQKKuykUqI7A"
  },
  "BSaKjTb3sCwp7Ywu4fBirQ": {
    "date": "2/19/2018",
    "text": "Not a great experience. I have communicated it with the manager. Who had an undertone of condescension in his reply as I must have apparently been wrong despite my numerous visits to many cosmos as well as many of their style of restaurant. My complaint was in general, mainly about the heat of the food. The food was freezing. We weren't greeted on arrival and the staff were massivley sub-par. One of the beautiful things about any cosmos is the massive range of people from many cultures working there. However,  a basic requirement should be at a minimum to speak English. In no way should anyone have to be able to speak perfectly, as if it's their first language. However, when you can't order a drink. That becomes a problem.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "79pjqxPEyDTco0pxXHvPdA"
  },
  "0L_605kdwahozo8a29vAfw": {
    "date": "2/5/2018",
    "text": "Great price for tourist to have an all you can eat meal. Food is buffet food so you get what you pay for. It fills the tummy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g5JfY_x-3_-x9Wk9hzF-xQ"
  },
  "RC2F10X-eAdsC9owVzwMww": {
    "date": "2/1/2017",
    "text": "super popular buffet!!! I have been there twice and every time people started to line up long before it opened. The second time we had waited for 30mins to get in at noon. And they don't take reservations for below 10people which I am not happy about. Anyway, they serve great Asian food. I am from  China and the Chinese food there were not bad, better than China Red. Fresh ingredients and great taste. Do recommend to come in the evening with more choices of food although the price at noon is cheaper. Great place to hang out or celebrate with close friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c17s5z5V4_ppX4w6TZdFDg"
  },
  "1C612WYEdO8gKcnLUVV9Nw": {
    "date": "4/11/2015",
    "text": "Didn't know this buffet was so popular until I went there for the first time. It would always be a good idea to get there early because there are so many people waiting before it opens.  Basically it's a collection of different kinds of food, especially Asian food. Sushi was ok however they just serve vegetarian ones. Thai and India food are all right. Not authentic Chinese food though, except for the roasted duck (highly recommend).  Considering the price there, I think it worth the money. Some said dinner there would be better, although it's much more expensive.,",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "UqrBc-0rQViX_RW7dinkMg"
  },
  "9o4ZaqTn_Sus9cc4P6riQQ": {
    "date": "10/30/2014",
    "text": "Tried to get in on Tuesday but it was booked sold till Sunday and walk in was an hour and a half wait. Bummer",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1tmEGzdUN6dAqxiEF8OL3A",
        "caption": "Photo of Cosmo - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1tmEGzdUN6dAqxiEF8OL3A/o.jpg"
      },
      {
        "img_id": "3AiYl-4ygga9ru3TvaOKxA",
        "caption": "Photo of Cosmo - Edinburgh, United Kingdom. Best variety of foods for everyone at good prices. One tip get there early you want a seat.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3AiYl-4ygga9ru3TvaOKxA/o.jpg"
      }
    ],
    "user_id": "Gv6zmTxmhqTOI6iqML5xBw"
  },
  "rF5Q-VbETR07F8q1__wpGA": {
    "date": "6/12/2016",
    "text": "Boy did this place surprise me. I was skeptical at first to be honest, as our culinary journey in Edinburgh was disappointing so far. The atmosphere was nice, although on a Friday night it was quite noisy and was fully booked. We didn't book online, because we decided to go last minute and our 45 minute wait turned into a 30 minutes which was okay. I loved the variety here, as they have antipasto, a teppanyaki grill, sushi, lots of Chinese and Indian food as well as Pizzas and Pastas. Everything looked freshly made, and items were being refilled quite often. The food was mediocre, but the variety of desserts definitely made up for that. They had two chocolate foundations, as well as fresh cut fruit, pies, cakes, pastries, pancake station, as well as creme brulee and even macaroons! Kinda disappointed they had such a limited ice cream selection though. The staff were friendly, but they seemed to be overwhelmed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4BzFrXBu4CUkbYWT2GkVWg",
        "caption": "Photo of Cosmo - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4BzFrXBu4CUkbYWT2GkVWg/o.jpg"
      },
      {
        "img_id": "u6Hln5FHvqTPJv2hC3BBdQ",
        "caption": "Photo of Cosmo - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/u6Hln5FHvqTPJv2hC3BBdQ/o.jpg"
      },
      {
        "img_id": "tRXWvRlFThoVuyIubGRYDA",
        "caption": "Photo of Cosmo - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tRXWvRlFThoVuyIubGRYDA/o.jpg"
      }
    ],
    "user_id": "TrSM8ON_YdVASOJmMbwnGA"
  },
  "LmJj2KQ6JCNYZIH9H_mFdw": {
    "date": "5/12/2014",
    "text": "Sitting down to eat in Cosmo, memories came flooding back of the huge, sprawling, seemingly never-ending choice, buffets so abundant in the hotels of Vegas.   This truly is a global buffet, although it leans toward the Oriental.   If you can afford to wait, then just head on over, as it seems when you phone they are always fully booked. I didn't realise that you could just turn up, so missed out on a potential earlier visit.   We waited (next door in the Lloyds / Wetherspoons) for about 45 minutes for a table of 3.   Nearly all continents of the world are represented with Moroccan Lamb for Africa, but far more choice for Asia, Europe and the Americas.   I decided to try small portions of a LOT of dishes. I must confess, I did feel a little Roman Banquetesque . . .   I started with Thai Green Chicken Curry, Thai Pork, Mongolian Lamb & Shredded Beef.  All were decent, the Green Curry and Shredded Beef particularly tasty. Very crispy batter on the beef . . . nice!  I went on to sample the Sushi, which was surprisingly well prepared. I should've asked the type of fish they had on offer in large slices (it wasn't tuna) as it was perfectly filleted and very smoothly textured.  Plenty of Soy Sauce and Pickled Ginger as accompaniments.   I was also amazed to find Char Siu Bao there. If you've never tried them before and are a fan of sweet n' savoury tastes together - then grab them whilst they're hot!  It's a sweet tasting doughy bun with a filling of hot barbecued roast pork. I realise this combination probably sounds disgusting to many, it did to my fellow diner, but having been persuaded to reluctantly try, she eagerly sprinted up for more.   Other foods devoured by my companions included, Ying Yang Chicken (a kind of sweet n' sour affair), Peking BBQ Ribs, King Prawns in Garlic, Pizza, Freshly carved Roast Turkey, Roast Potatoes & Irish Stew and I've no doubt missed more than a few out here.   For dessert, no idea how we managed it, there were small (thankfully) slices of Raspberry Cheescake (ok) Chocolate Brownie with Walnut (delicious) and Carrot Cake (my personal favourite of the three).   This was followed by waffles and Eton Mess.   Overall this was an excellent buffet experience. There is literally something for everyone here and if, like any buffet, you go into it with balanced expectations of the quality of food, you will be pleasantly surprised.   I'd be happy to return sometime!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 5,
      "cool": 6
    },
    "photos": [],
    "user_id": "-ZM78Lp6guNOiE6yJNAJHw"
  },
  "_w2t_ERJLt9uIX39BazKqA": {
    "date": "1/10/2016",
    "text": "Hmmmm . . . it was going to be a 2* but my kids persuaded me that this place is worth a bit more.  Massively busy the whole time - booking (inc online) recommended - so clearly popular and you can see why.  It's a huge temple to over-indulgence, focusing on pan-asian (unusual options like Korean and Mongolian) but also pizza, pasta, mexican, BBQ, and sunday roast.  Single price (various depending on when you go), eat absolutely as much as you can and then pay.  The cook-stations are only operational in the evenings, so be careful if you are after some favourites like flash fried squid, scallops and sirloin steak. Despite the chocolate fountain, the puddings are poor (lots of synthetic cream cakes). The service is OK but really nothing special (lots of young bored looking staff). Overall not my thing but the kids love it and it's certainly value for money.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "9y8q3wSNJKkk3zDj67w1WA"
  },
  "dUtWQ8RIyC8JgWgyqzqofw": {
    "date": "4/30/2014",
    "text": "I've been to many Chinese buffets over the years but this place is of the radar it international. Prices are reasonable matching your average Chinese buffet and for all you can eat it works out better value for money than you'd pay for a main meal in any other edinburgh restaurant. I tried booking in advance as is suggested by everyone and the waiting list was a week long luckily we just chanced out luck and just turned up and got seated straight away. Tables are unfortunatly crammed in every direction just so everyone can get there fill. With such a selection of food it's difficult to sample it all but everything I did try was hot, fresh and bloody amazing. My favourite part was the chocolate fountain dessert. Honestly even if you've not booked try your luck it's totally worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "nHo2asD1Q2nwRfuUk4OzjQ"
  }
}