{
  "XkErQTNAYUJfqLLrj8YueQ": {
    "date": "6/27/2019",
    "text": "Heck yes! A whole Vegetarian AND vegan menu! What a delight! This was my first experience at a Wagamamas and I throughly enjoyed the food, atmosphere, service, and the options! Being a vegetarian can be difficult at chain restaurants, because the options are often limited. Not here! I had so many options and I could order with security. I had no worries of having to read the ingredients or the fine print to see what the base of the soup was. Or the dread of having to ask the server to take this or that off the dish. The nature of the food was great but the customization, and the service is what really shined at this specific location. Our server was very insightful, and she was able to help us make a decision by recommending honesty. We were served in a timely manner and I can honestly say I have no negative comments or complaints!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h7nLBQPg_uSFnPwPOBbZug"
  },
  "0BwB1JKiP8DhVFkvGD9F2A": {
    "date": "5/22/2019",
    "text": "Wandered into this restaurant by chance during my day one of Edinburgh trip. The atmosphere and interior is great! Pretty casual yet clean and slick.   I had the naked chicken curry bowl.  I'll rate this as 3/5 - about average - not great but not bad. It certainly tastes like chicken curry, but there wasn't anything that made it stand out.  I do suppose it is a healthier option - below 650 calories? Maybe that's why it was a bit lacking in the flavor...   Still, I think the curry could have had more POW but maybe I'm asking too much.  Again, I'm not saying it was bad- it's good ...but it leaves me with a sense of something is lacking.   I did enjoy the free green tea- it was warm and had nice mild flavor. Especially on a windy day!   Server was nice and friendly. Did not feel like I was treated differently for being a traveler/foreigner.   TLDR;  My review is 3/5 as food is the main factor for me.  Service staff was nice and friendly  Space was clean and casual",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "thjMC2sgR7J3OX_iqtlGOA"
  },
  "ps5FPcauGLiM57Yb9yrJOA": {
    "date": "4/7/2019",
    "text": "We really liked this place. We needed someplace to get out of the cold. We were also hungry and ready to take a break from the usual pub food. It was fun to find this place because we generally gravitate towards Japanese food on a weekly basis back home.   Although not authentic, this place still served up some yummy food. I ordered the miso cod ramen, one of their new items. I never had fish with ramen before, but it was done well. The fish was perfectly tender within the soup. We also ordered a donburi dish - can' t remember which one, but it was still really good. Also ordered the wok fried greens which were perfect. After eating a lot meat on our UK trip so far, it was nice to have an extra helping of something green. Service was perfect and fast.   Next time I'm in the UK, we will consider stopping at Wagamama.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ALgOtu3CNYAwM1GdWkaF8A"
  },
  "aUnXGZ1cdXI32lu6YWQQ-Q": {
    "date": "2/21/2018",
    "text": "Who knew I'd have some really good pork belly ramen and kimchi outside of SoCal?! I know Wagamama is a chain in the U.K. (and some parts of the U.S.?) so I was really curious to try out their Asian food (it seems to have everything from yakisoba to tonkatsu to bulgogi). It's casual dining but there is table service. We were seated right away and put in our orders.  It was a brisk, cold day and after walking all morning, I was looking forward to a hot bowl of ramen! Our entrees arrived within 10 mins of ordering: chicken & prawn yakisoba, steamed chicken dumplings, firecracker chicken, tonkatsu & curry, and my shirodashi pork ramen.  My ramen was hot, steaming, and delicious. It came w/ sliced pork belly, seaweed, micro greens, scallions, and half of a tea-stained boiled egg. The pork belly was cooked perfectly. The soup had rich, deep flavors. A couple things that could've improved this? Noodles that were cooked al dente and some ginger on top. I took the ginger off my husband's yakisoba and it tasted so good in my ramen. I also got a side of kimchi and the kimchi was at the perfect stage of fermentation!   Overall, a really satisfying meal and the rest of the group all enjoyed their food, too. My son liked his Dad's yakisoba so much, we ordered a kid's portion halfway through. While service was really friendly, it was extremely slow. Lots of servers standing around but almost impossible to lock eyes with any of them when I needed anything.   Prices are kind of steep for the ramen (10-15 quid) but overall not too bad. I would eat at a Wagamama again.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "5IDPaoj4XBJj0ML4rXbrVA",
        "caption": "Photo of Wagamama - Edinburgh, United Kingdom. Shirodashi pork ramen - DELICIOUS!!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5IDPaoj4XBJj0ML4rXbrVA/o.jpg"
      }
    ],
    "user_id": "UH6RCH9K1o2VW3CU8PY5iQ"
  },
  "t0ijiAyglmiSX1LRHvCKKw": {
    "date": "5/28/2018",
    "text": "Stumbled upon this place by accident and decided to give it a go.   Our daughter has a lot of food allergies so what really impressed us was the accessibility of their specialty menus (e.g. gluten free, etc.). They even gave us a binder that broke down the ingredients on these particular menus and our server offered for both her manager and chef to come have a quick chat with us regarding our daughter's allergies. I'm not sure if it's typical Wagamama protocol or more so the U.K.'s way of handling food allergies; however, we found all of the staff we encountered to be patient and accommodating without us even asking.   My daughter enjoyed her first bowl of ramen from a restaurant. We loved being able to eat ramen as a family together. Although my husband would argue that the flavor of his chicken ramen was more so pho than ramen. I enjoyed my shirodashi ramen; however, it is not the style of ramen I typically prefer.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "nCgl95FjcMFtdvJ0DnBtbw",
        "caption": "Photo of Wagamama - Edinburgh, United Kingdom. Gluten free chicken ramen",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nCgl95FjcMFtdvJ0DnBtbw/o.jpg"
      },
      {
        "img_id": "vs2zF6to28BoELqrtLffNA",
        "caption": "Photo of Wagamama - Edinburgh, United Kingdom. Chicken ramen",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vs2zF6to28BoELqrtLffNA/o.jpg"
      },
      {
        "img_id": "h9tsg_eHQYStO78m3-EJ_g",
        "caption": "Photo of Wagamama - Edinburgh, United Kingdom. Shirodashi ramen",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/h9tsg_eHQYStO78m3-EJ_g/o.jpg"
      }
    ],
    "user_id": "sxwVQcMZkiez3R_442GkAQ"
  },
  "cjRgGNSKbrMsZoKy9pXa5A": {
    "date": "7/12/2018",
    "text": "Wagamama appears to be a chain of Asian fusion restaurants. I stopped here on the 1st of June and the place was bustling. It was at lunch time and lots of tables were taken. We were taken to the back and sat at a table in a quiet corner. I scanned through the menu and I ordered peach iced tea which was good and very flavourful. I also ordered Shirodashi ramen which presented very well. It tasted good as well but the soup was light and somewhat bland. I enjoyed watching people use chopsticks in the most ridiculous/impossible ways. They should make a show called \"My first time with chopsticks ... but I'm trying really hard\". Our server, a lad from Greece, was polite and courteous. It was a good lunch. I give 4.5 stars because the overall experience was rather positive but the soup was bland.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ReeUpaEuvWw1S4onnEFmbA",
        "caption": "Photo of Wagamama - Edinburgh, United Kingdom. Shirodashi ramen and peach iced tea",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ReeUpaEuvWw1S4onnEFmbA/o.jpg"
      }
    ],
    "user_id": "d2QTo_z2wLSU4icmclU90g"
  },
  "KEzYb4rEkT9CnsUytCRkMQ": {
    "date": "7/21/2018",
    "text": "We ate there because there wasn't enough room in the next restaurant dishoom. I've eaten in Wagamama a few times around the world so I knew what I'll order. I ordered the wagamam ramen. It was okay- I didn't really liked it because the soup didn't really have a taste.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3ZJ0PNr0iLzy2b-cm911OQ"
  },
  "Y8OU6n2oZvIg9uSxqWycLg": {
    "date": "7/9/2019",
    "text": "Tonight's meal is my last one in Edinburgh and I unfortunately came here. This place is an abomination. Out waitress was terrible. She didn't welcome us, ask us if we had any questions about the menu or offer us any suggestions. She wrote down numbers on our placemat to indicate where our orders should go (we had a table of 9) but still auctioned off the food. When it came to the food it came out haphazardly. There was no rhyme or rhythm to when dishes came out and she didn't know if everyone got their food or not. When it came to the food there were an app or 2 that weren't bad but for the most part the food was terrible. I got the Wagamama ramen and it was hot garbage. The broth was basically water with ZERO flavor. It felt like something you would get in a grocery store, the kind you empty into a bowl and add water. The noodles weren't fully cooked to the point where some of them were still stuck together. The chicken was over cooked. My friend that was sitting next to me had the same dish with the same result. Others at the table had the same experience with their food as well. We had our ramen taken off the bill. DO NOT EAT HERE!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Li4sTl-QncpHwL4IFqr1Fg"
  },
  "P8tBYBW22DzbuDegUH3N0g": {
    "date": "10/9/2017",
    "text": "Wagamamas runs a fairly tried and tested formula and this venue is no different.  Great Japanese food and a reasonable cost.  I visited when in a city break with my wife and we both loved the food, although my wife is a bit of an old hand at wagamamas to my novice standing.    The service overall was great if a little slow however our server did seem to be working a rather large area of the restaurant which seemed odd given there was no shortage of staff evident.  Overall a great dining experience and I'll visit again when next in Edinburgh and would encourage others to visit.  It may not break the mold but it's certainly a very good wagamamas experience!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "SDYWM0ZwPBqAKlwkVfdsOw"
  },
  "R6R0YOWkYzrQHVL-hErhFA": {
    "date": "9/28/2017",
    "text": "This is a big, bright and beautiful new outpost of the chain. Waga's isn't one that I usually get too excited about - it serves a purpose and the food is just fine. But I had to give this new spot a shout out for making us solo business travellers feel so welcome and not the slightest bit sad for asking for dinner for one! They have a whole bunch of smaller high tables for exactly this purpose set up by the window for people-watching - though I took one by the kitchen for food-watching :) The chicken teriyaki donburi was a satisfying feed, though they mistakenly served me a lemongrass cocktail instead of the ginger and lemongrass tea I ordered (and had I not had a big meeting the next day I would totally have taken it!) but there were no issues with my irrepressibly bubbly waitress in correcting it.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "E9vrC2FpOYtY9OI8Azlchg"
  },
  "4Js6tsJOXb1qt4-5GFLyEA": {
    "date": "2/1/2018",
    "text": "Visited this place on Saturday Sept-30th. Very crowded. We were seated promptly and made to share the table with another couple. No personal space. Our orders taken promptly but they delivered the wrong dish. Served us meat when we ordered vegetarian dishes.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8haTgiTO6NjvhmHNl7PrwQ"
  }
}