{
  "MJVl--xIsZLop_mwVtZLWg": {
    "date": "8/28/2019",
    "text": "We were at Edinburgh for couple of days at end of Fringe festival and we found this place. It is a very cozy and comfortable sit down/ takeaway place. The food here is reasonable price compared to surrounding Indian place. We were lucky we got a Tuesday deal buy one get one free Curry special. The Chicken Chilli and Garlic was great. Right amount of heat and little kick on the back of your tongue that's what you want on a good spicy curry.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u8wr1QZT5k2maUB6_8ni-Q"
  },
  "SRdL3uB4-iQiuxEOYSAIkA": {
    "date": "10/4/2018",
    "text": "Unpreposseaing ahop, size of a small bedroom. You would never guess that they make the best curry plate on the planet: the Malayan. Al for them o to make it spicy and put it over rice.  Had this two years ago, and coming back in town I had to search for it again, just to see if my memory was not playing tricks on me. It wasn't and It is as good as ever.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mRGbP0Fl7LX9vcQaKGGl5A"
  },
  "4znN-BkOM-rJ96_P5NIVwg": {
    "date": "5/29/2016",
    "text": "A quick trip to Edinburgh, did not want to spend too much $$ for a late dinner. Walking on Leith Walk, came upon this place, took a chance.  Large Seekh Kebab with Naan was good, spicy, filling, for a good price. Staff were friendly,  asked if all was Good with a smile.  If you are looking for a basic restaurant with good prices, consider Curry House.  If in Edinburgh, will try again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "no3-Ov_Bh6XEW77oRihoNA"
  },
  "wesmDuzcQu12xNKABjWszg": {
    "date": "5/23/2014",
    "text": "I'm somewhat torn about what rating to give Curry Cafe. I feel that in truth it's more of a 3.5, but given we return time and time again it probably deserves that 4th star.  Curry Cafe isn't much to look at from the outside, it's not a classy or fancy restaurant at all, and we've never sat in, but for that Friday night carry out it's a solid option if you live in the Leith area.  Are they the best curries I've ever had? No. But they're fine. And they're reasonably priced. I'm a fan of a saag, and I find the Curry Cafe one to be a bit smooth for my liking, but on the whole I've been satisfied by everything I've ordered.  Plus, the poppadoms are good and the delivery man is the friendliest I've ever met.  It's a thumbs up for CC!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Mqg4L8flJmg8pqeR-uYyRg"
  }
}