{
  "-7Or0h32ybraieYmn4UwXw": {
    "date": "5/4/2019",
    "text": "Lovely dining room, fantastic staff and very good food. Get the paired wines and you'll have the additional pleasure of speaking with the very knowledgeable sommelier. Excellent meal from beginning to end and I can't wait to get back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OyMOGTwc0lyQDk1C8Wcptg"
  },
  "H6jJxng_fbeDKITQF1m6Lg": {
    "date": "8/15/2019",
    "text": "Worst dining experience I've had in Edinburgh. Can't get a salad here fish is way over salted. Do not try any deserts here yuck. So overpriced for the worst food ever. Do not eat here",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1s3WcfHtYGEoo4G2-oKrWA"
  },
  "7qHZIURGBEOaQi8CwD7-0Q": {
    "date": "10/18/2018",
    "text": "I can't say enough about this restaurant!  The food is amazing!!  And the chef came out and explained each dish which was a real treat. Perfect restaurant for a night out!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RNk31Suzsj3YnQgSOAgpKg"
  },
  "WmiShJ9f9Q0f8_qeH8qaKQ": {
    "date": "11/27/2014",
    "text": "This is my 100th review for 2014 - it's been a ride.  I so wanted to be impressed by this restaurant. I read Jay Rayner's review and the ones on Yelp and boy did I look forward to this.  Especially when we were able to use a voucher (well we ARE the King & Queen of vouchers). - The voucher was 29 - for a 3 course seasonal menu and a glass of Galvin Champagne.  Much to our surprise we found the menu to have that exact seasonal menu to be ..29. Huh?! - so we got a voucher and all we really got on this purchase was the glass of champagne.   Not to be disheartened we did realise that whether with or without the voucher we were still getting a fine dining meal for a reasonable price, but seriously a voucher should present a significant discount. Not just a free glass of bubbly.  *rant over*   The restaurant is on the first floor of the Waldorf-Astoria - The Caledonian at the west end of Princess Street. On arrival we had the concierge to bring us up and the Maitre D' took our reservation, vouchers and coats.   We were led to our table shoed in and we took a good look at the surroundings and the menu. The main feature is a massive rose quartz (I think) chandelier. The rest of the dining room is a little Wedgewood - pale blues and off whites.  Table decor is minimalist and functional. There are understated Christmas decorations, but not overly so.   The seasonal menu is 3 course affair with a choice of 2 Starter / 2 Mains / 2 Desserts.   We both took the same and I was impressed with the taste and craftsmanship of the dishes  Pressing of Confit Duck with Wild Mushrooms & Smoked Bacon * Loin & Braised Belly of Pork, Haricot Blanc, Roasted Artichoke * White Chocolate Pannacotta, Orange Sauce, Pistachio Biscotti  We also were presented with some hors d'oeuvres which were tasty, but I cannot recollect what they were. - As when tasting them I was looking at the wine list.  Mistake.  A decent glass of wine is 11 - yes, you read that right. ONE glass. I am sure there is a reason for this, there should be..    The service was impeccable, the waiters explained the dishes and (as a good restaurant does) crumbed the table between courses.   We even got a parting gift box with Edinburgh fudge when we left, now that is a nice touch!   In all I can actually recommend going here as you will be pleased with the dishes and if their seasonal menu prices hold you will be in for a treat!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "fKi8ZF3xpJJkgSusRubeMA"
  },
  "6fsUjQGdnBNRg-1f8rx2pA": {
    "date": "12/21/2016",
    "text": "Wow!!! Service was excellent, the food was fantastic and an overall fantastic dining experience. The staff were great and able to answer all questions regarding the food and wine. I even spent some time chatting to \"the cheese guy\"!!   If you are looking for a fine dining experience, well worth a visit. I had the cumbrian beef and my wife had the venison and both were cooked to perfection.   I'll definitely be back next time I'm in Edinburgh",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j1vE26cMVFps3JVzVVlvPg"
  },
  "Q4eaB5c7x7wfJX8LkLaCWQ": {
    "date": "11/27/2014",
    "text": "The Pompadour by Galvin is a restaurant I wouldn't normally have even noticed to be honest as it's situated in hotel Waldorf Astoria but a recent voucher deal brought this place to my attention and I wanted to try it out .  I had high expectations, and was I disappointed? No, I can't say I was but I perhaps expected some 'wow' factor that wasn't quite there foodwise, but it was still a great experience.  From start to finish the staff at Pompadour were extremely welcoming and polite. We started our dinner with canapes and a glass of champage. The waiter came round with a basket of bread and it was very tasty.  For starters I had pressed confit duck with wild mushrooms and smoked bacon. It was full of flavour and absolutely delicious.   Second course arrived: loin and braised belly of pork with haricot blanc and roasted artichokes. There was nothing wrong with it, but the pork wasn't amazing. The sauce was sticky, maybe too sticky for my taste. I'm not a massive fan of white beans. Having said that, it was all tasty and I cleared my plate.  Dessert was vanilla panna cotta with orange sauce and a pistachio biscotti. The panna cotta had the perfect 'wobble' and it was delicious.   Wines are very expensive at Pompadour. There were some bottles of wine costing over 300 which to me is ridiculous. We had a glass of wine 11 each.  On departure our lovely waiter handed me a little gift of scottish fudge. I thought it was a lovely gesture and really shows how they care of their customers.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "yuFHrb8YQtVuzu0eEXvJtA"
  },
  "NMy2Ne8CUZvog-1jPo--8A": {
    "date": "1/21/2013",
    "text": "The Where? By the Who? At Which Hotel?...... This was my reaction to randomly stumbling upon the website for the Pompadour whilst in search of somewhere nice for my compulsory 'fancy' meal when my best mate comes to visit. I booked a table here after briefly glancing at the menu even though I had never heard of it. Boy, am I glad I did.  The setting for this fantastic restaurant is rather old-school opulence rather than modern chic. Spot on if you ask me. Amazing views of the castle if you get the right seat too.  I started with a ravioli of rabbit with home made ricotta. YUM.  The main. Holy lord above. That main. I had beef fillet. Cooked to perfection. With Beef Shin and Foie Gras croquettes - tasty little things EVER.  Then for dessert we shared the tarte tatin with cinnamon ice cream. It. Was. Huge.  and utterly scrummy.   We had all this..... appetisers, pre-dessert, petit fours, a glass of champagne and a bottle of wine for about 65 each. AMAZING. Service was spot on. Pleasant, chatty and very efficient.  Dying to go back. Literally dying.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "j9AYnOtFC90VpDFbma8Q3A"
  },
  "cBLMU30HUyAV-bpdkg2iAg": {
    "date": "2/26/2013",
    "text": "Old school sumptuous setting. Great food.  Buuut the service was a let down.  I think Grace summed up the entire experience rather poignantly in her review (we had dinner there together). I, on the other hand, rather enjoyed the lengthy descriptions about the wine, if only because of the entertainment value. My wine palette is just not developed enough to appreciate whichever 'famous' wine grower grew the wine and in precisely what region of where it was grown. I treated it as like a little story telling although we'd forgotten the stuff he said at the beginning by the time he got to the end... ok.. maybe they DID go on a little long.  All of this not aided by the fact that he was so soft spoken, you couldn't hear him half the time.  Stand out dish was the rabbit ravioli, the rest of the food was good but I would expect nothing less from this calibre of restaurant. And to be honest I was expecting a little more 'WOW'... Having stolen tastes of G&S's wine pairing, I think D & I were glad we'd passed on the option and just chose a bottle of wine to go with dinner.  Also beware the after dinner drinks trolley as nothing is priced and imagine our surprise to find that our dram of whiskey cost the same as our bottle of wine!   All in all a fun night out but feel like I got a lot more bang for my buck at The Honours where we'd been the month before.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J6E6NSpJqMBib9ydbchicg"
  },
  "upCHCZ3cGD3YGmDDiPhKZw": {
    "date": "5/11/2014",
    "text": "We ate at Pompadour last night and can honestly say it was one of the best meals we have ever had. The restaurant itself is absolutely stunning. Classic elegance mixed with breathtaking views of Edinburgh Castle.   The quality of the staff was outstanding, led by the assistant manager Hamish. They were attentive to all of our needs and then some. Hamish did it all, and not just for us but for all the diners. We were amazed by how he seemed to be involved in every aspect of the restaurant and accomplished each task at a level of excellence. Will, who I believe was the sommelier, was also incredibly helpful. The overall professionalism displayed by the staff was incredible.   As for the food, it was simply amazing. My girlfriend started with the Stuffed Loin of Ayrshire Rabbit while I had the Cured Foie Gras. The dishes looked like pieces of art and tasted even better. For mains she had the Slow Cooked Sirloin of Beef and I had the Breast of Duck. These were without question two of the best dishes we have ever had. Everything from the temperature of the meat to the seasoning was perfect. Being a glutton, I selected cheese from the trolley prior to desert. I am convinced that Galvin restaurants have the finest selections of cheeses in the world, and Pompadour did not disappoint. For desert she had the Strawberry and Creamy Yoghurt and I had the Mango Souffle. This was the perfect end to a perfect meal.   I cannot say enough about how much the service from Hamish and his team added to the overall experience.  We have been to Galvin at Windows and Galvin La Chapelle and have had incredible service at each, but the job done by the entire staff at Pompadour was in a league of its own. We will certainly return!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "qqQmuNh0zGywsEQDNdbFvQ"
  },
  "TEPR-qvjkTlfvZ9WgEWQBQ": {
    "date": "6/23/2013",
    "text": "Went to The Pompadour with my folks.  Like the previous reviewers have mentioned the food was exquisite.  I too had the Rabbit Ravioli and it was mighty fine.  The decor is very high end but also a bit old school.  The views from the dining room are good.  The one thing that did feel a bit cold was the service, it did feel we were dining in the 1930's with way too many 'Sir's and Madame's'  it would do them a favour if they gauged their audience a bit better, however, I fear that they constantly expect the Michelin reviewer and act accordingly.  So, in summary the experience is as you would expect of this kind and price of restaurant.  The food is excellent but the atmosphere is a bit more stuffy then it needs to be.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cSH-FSFPlpU3jwZXj_6oXg"
  },
  "VFsY3hrHraf6_DtqPAsXZg": {
    "date": "9/20/2008",
    "text": "Stunning food in a stunning setting. This is the a la carte restaurant in the caledonian hilton in Edinburgh. The views look out over Edinburgh castle. This is a fabulous place for a truly special meal.   The dessert menu is truly outstanding! You have to save room!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l_n89Nfn1BSJENwHy9nt-A"
  }
}