{
  "j2-w44Xowx_KwC1iNny0vQ": {
    "date": "5/1/2018",
    "text": "We came upon this place while searching for the quintessential \"pub\" to eat at on our first night in Edinburgh. They were able to accommodate our group of 7 with a short wait. We thoroughly enjoyed the pub fare and the service was wonderful. Our servers were able to answer all of our questions about the food, as we were quite unfamiliar with it on our first night in Scotland. Some of our party ordered the Haggis and said it was great. Would highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rBHZxhzDiZR2gCFoEgGRpQ"
  },
  "Dzr0lITw8Lj45ioRWSr5GQ": {
    "date": "12/29/2016",
    "text": "If I could give a 0 I would. I ordered the Steak and Ale pie which was neither a pie nor with Ale...it was roast beef sitting on puffed pastry. Also the veggies were just the bagged cauliflower and broccoli steamed with no salt. My friend had burnt chicken and haggis. Also the Waitress paid no attention to us and we had to call her over. I would not return and am surprised it's actually in business with its poor food and service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1t0ubH4HhLtTxhjBPIiryg"
  },
  "K1f4geam2SeoxdypdGdnNA": {
    "date": "10/1/2018",
    "text": "Great spot on Rose St. in the middle of a bunch of bars.  This is a great spot to grab a quick pint among friends.  Good live music too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K6a3iRubPAxe7dv9AA_7BA"
  },
  "bGa1oIcl4rqGCZL4YSu3sw": {
    "date": "10/8/2017",
    "text": "Laid back pub. Friendly staff. Good prices. Don't miss the Haggis",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MkeP4UUoIOK1hfSl98IRiw"
  },
  "7BiHzNscbM33XZ60Oqrm6A": {
    "date": "8/18/2017",
    "text": "I don't understand the negative reviews! I had a wonderful meal there this evening. I wanted traditional Scottish fare and my hotel's staff recommended I go here. It's my first ever night in Scotland and I was eager to try the famous haggis, needs, and tattles with whisky sauce. I was a bit hesitant because I had heard stories about some people's aversion to this dish. But omg was it delicious. The flavor is difficult to describe, but entirely delicious, and rich and filling like an American Thanksgiving dinner. The restaurant was hopping when I got there . The hostess suggested I have a drink at the bar and that she'd find me when a table was ready, which she did True to her word. The wait staff were friendly, and pleased that I'd enjoyed my meal. The clientele were primarily Scottish, which I took as a good sign. This is a great place with a warm atmosphere and I would return in a heartbeat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xlx7i-s56Qnhv2holbFrYA",
        "caption": "Photo of Auld Hundred - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xlx7i-s56Qnhv2holbFrYA/o.jpg"
      },
      {
        "img_id": "nELCed_7iqe0kVkxNqdBdw",
        "caption": "Photo of Auld Hundred - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nELCed_7iqe0kVkxNqdBdw/o.jpg"
      },
      {
        "img_id": "UQSvW0St3-usaIzr_ZJmeA",
        "caption": "Photo of Auld Hundred - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UQSvW0St3-usaIzr_ZJmeA/o.jpg"
      }
    ],
    "user_id": "YcRTR1unfkW3vPYKLWg26Q"
  },
  "D535htxSfG-fu8pU-MK4PQ": {
    "date": "9/9/2017",
    "text": "Three of of from the US really enjoyed a great fish and chips dinner.  Staff if very friendly and accommodating.  Very good value.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3tchFYMk0wiETYLaoMPaDA"
  },
  "FvlmD7d39BmPMTtDC4C5Fg": {
    "date": "2/1/2013",
    "text": "Damn, but I have to say it, if not my stomach will be in pain, place is pretty average. Dont get me wrong, was Monday so what the hell I should have been expected? Exactly, on Monday every places look deadly quiet, like gas station in the middle of Arizona's desert. Place is OK. Im giving 4 stars because girl behind the counter was attractive... and that's good business way, worth to develop.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Y2jgc4_mYPrIhI7co8PA3Q",
        "caption": "Photo of Auld Hundred - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Y2jgc4_mYPrIhI7co8PA3Q/o.jpg"
      }
    ],
    "user_id": "5H8czpYIxeuScVmLqGt6dw"
  },
  "fhjt2MQGIsirYSfNnffp4A": {
    "date": "11/12/2012",
    "text": "This seemed to me to be a pub that wanted to be a restaurant or vice versa.  The decor was pretty and modernish, with light-toned woods and colorful, fancy art.  There were limited beer options though, and the menu was small and made up of things that tasted decent but didn't really stand out.  It just didn't win me over.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "oBhQMjrT0zdSLdlybWRA_w"
  },
  "_oRO-81zx0p1vIV9aRBjRQ": {
    "date": "7/21/2010",
    "text": "The Auld Hundred is yet another pub on Rose Street, but nothing about it makes stands it from the others. It is standard traditional pub serving a good selection of beers, ales, wines and the usual selection of spirits which are all very competitively priced with spirits and mixers costing about 2.50. The inside is really clean and cosy and it doesn't look downtrodden like some of the other pubs in the area. The Auld Hundred also serves the traditional and, best of all tasty, pub food including steak pie, haggis and fish and chips, along with more contemporary dishes such as curry and pasta meals. Most main dishes cost about 7 and the portion sizes are incredibly decent so it is good value for money.   There are a few tables and chairs outside the pub and so it is a good place to have a drunk in the summer and sit outside in the sun. Whether you are after the one drink, or if you are planning a big night out, the Auld Hundred is definitely worth a visit.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4N6x6NC59p1ChNZkAyg0cg",
        "caption": "Photo of Auld Hundred - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4N6x6NC59p1ChNZkAyg0cg/o.jpg"
      }
    ],
    "user_id": "OdUSlS-S6qfZFnDUCKzwEg"
  },
  "EjNWDyl-V9cgC6ujpqwcfQ": {
    "date": "5/15/2010",
    "text": "I would never open a pub on Rose Street, for one simple reason. There are so many along here that yours would have to be pretty amazing to stand out. And whilst there's nothing hugely wrong with the Auld Hundred, it doesn't really offer anything that you won't find in any of the other places along here.  It's in a gorgeous old building (hence the name Auld Hundred I guess, given its address!) so it's automatically got some of that olde worlde charm you'd expect t find, with the low ceilings and relaxed feel to it. And it does serve more than it's fair share of real ales. But it's also part of a chain, which definitely takes something away from the character side of things.  I didn't eat in here, although I did have a gander at the food menu, and it looked pretty samey and standard too. Pie and mash, baked potatoes etc etc... not exactly food that you won't find anywhere else.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ScXlHOj1SX6SD2-F_o9LvQ",
        "caption": "Photo of Auld Hundred - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ScXlHOj1SX6SD2-F_o9LvQ/o.jpg"
      }
    ],
    "user_id": "oEshN5oq98_g23MvEnRc5A"
  },
  "BPXA7nwDjl2c-yDClglhIQ": {
    "date": "5/4/2010",
    "text": "It was raining. No surprise there then. This pub looked warm and dry, and I had a thirst on. What more did I need?  Walking into the Auld Hundred, I was quite impressed. The sandstone walls added warmth,and the seating was cosy and plentiful. However, it was dead. Maybe that's because most folk are at work on a Monday afternoon at 1pm, or maybe it's because unlike myself, not many people hanker after a pint with their early lunch. Either way, dead.  I did have a pint, and it was a good pint at that. But other than that, me and Auld Hundred didn't have that spark I often find in pubs in Edinburgh. I hear the restaurant above is fantastic, so maybe I'll like that better next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RIG3m5SCTHShYyPUJ66tqQ",
        "caption": "Photo of Auld Hundred - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RIG3m5SCTHShYyPUJ66tqQ/o.jpg"
      }
    ],
    "user_id": "Cy1PV2TdYeDFA16mUOlr3Q"
  },
  "RDbXNvCO9VxFfbmKXp27-g": {
    "date": "10/26/2013",
    "text": "The food is plain terrible, the worst I experienced in a week travelling around Scotland. The service is OK.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4ehwrPxzaTh9MIOzk8LZ0A"
  },
  "MH2aWvo_wjIpc_8YpzI1dA": {
    "date": "11/14/2008",
    "text": "Have only ever been in here a couple of times for a meal, but I have found the food to be excellent each time. The restaurant is up a circular staircase and the bar is downstairs so you can enjoy a peaceful meal without all the noise from the bar. The food is always nice and very reasonably priced. The staff are attentive and helpful. There is a good varied choice on the menu, and they so specials every day too.   The place could do with toilets upstairs in the restaurant instead of having to go downstairs to the bar area if you need to use the loos.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "09_FFRjVsCc7pbqG7MxXyA"
  },
  "hucIQXYus8EZBiDnfCB7dg": {
    "date": "5/30/2010",
    "text": "Any pub on Rose St immediately has to compete with swathes of competitive drinking holes. As a result the Auld Hundred seems like another humdrum offering with nothing of particular attraction here. Then again, that may be exactly what the clientele like: a reliable and no frills establishment.  You'll find typically generous pub size portions with regards to food and a modest selection of ales, A- OK.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UvIb5v3biEgcxWKnxf0ocg"
  },
  "5kzjZHktjvbLc2EhkgQ_6w": {
    "date": "7/27/2008",
    "text": "The Auld Hundred is an unchanging institution, which has been around since the 1980s. It's right in the centre of the city. It has fairly typical bar food, with an upstairs area too.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EAXWjnCLv5l_rP6sszQNGA"
  },
  "53SXg9Wpi0PRk31hLLsH0Q": {
    "date": "2/8/2010",
    "text": "I was in this pub for the first time last week and if I'm honest, it was kinda average. Nice, but nothing special. I enjoyed my pint and the surroundings were pleasant but with the plethora of bars and pubs in the Rose St- George St area, I can't see myself making an effort to go back. I can't vouch for the restaurant though, I'll leave that one up to you.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cqecqnFK2eu88VtKJLHpiA"
  },
  "iglr51KunFod1NJCK5NvEA": {
    "date": "2/1/2010",
    "text": "Nice bar restaurant on Rose Street just up from Princess Street. Has restaurant area upstairs and food is goo although can be slow when it's busy. Bar downstairs is quite small but good selection of wines beers etc and reasonably priced given it's location.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yI4LI8-aYYUS9MmrfpidMQ"
  },
  "WBKAfdt-5YFaWwZXlcPDEA": {
    "date": "7/21/2012",
    "text": "Ate in the restaurant area upstairs reasonably priced food that was adequate  not great, not bad",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qv-N38AYAJjVbBBfO-wSfA"
  },
  "E8CuE6WuvR-4dIJgal7j7w": {
    "date": "8/31/2009",
    "text": "Lovely pub, have been here dozens of times and the service and quality of the food are very good. Reasonably priced, the steak pie is to die for, and the most expensive bottle of wine is 12.95, and it was jolly nice too! My only gripe would be the use of synthetic 'squirty' cream, which is nasty and should be banned. Definitely a gem in the centre of Edinburgh, where most places are overpriced and rubbish, knowing they are on the tourist drag and don't care because there will be no repeat business. At the Auld One Hundred they do care, and it shows",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pv6cJ0TQkh5Roa2k6yWgHw"
  },
  "FKNvMb51lZvqIpXkeAJTSg": {
    "date": "5/12/2011",
    "text": "I have been here for lunch many times and for dinner once. There always seems to be seats available in the small restaurant upstairs although I'm sure, like anywhere in Edinburgh, it would be more difficult to get seating when the festival is on in August. My colleagues and I are big fans of the macaroni and cheese, the steak pie and chips and the baked potatoes. The food is consistantly tasty and service is excellent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ccIa9Xj2r8lFnYB7seE5LA"
  }
}