{
  "xrP09Ma-vvtZ1I-5R86-yg": {
    "date": "12/11/2012",
    "text": "A really impressive new addition to Stockbridge's already well-stocked list of lunch and dining options, The Pantry seeks to showcase local produce in some innovative and flavour-packed dishes. Still with its fresh sheen of shiny newness about the place (at time of writing, it has been open for four days), the place is light-wood, white and minimalist, with some nice tweedy touches.  The dishes on the menu all sound great, so it was quite a choice to narrow down the options. The soup I had was first-rate, and the burger, although slightly on the lean side for my tastes, packed a good deal of meaty goodness. The chips were as good as I've been served for a long while.  Overall, we said: \"The Pantry is a really welcome new addition. They're still in their infancy, so in time they'll make their house more of a home, but they're starting from a really nice level, with welcoming staff, a well crafted menu, and a good, relaxed feel to the place. They have lots of nice presentational details, too, like little milk churn jugs. I look forward to further visits to the place, which will be frequent and often.\"",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LURC3E0DoXYgN9aYTF3XOg"
  },
  "GjJVceP822zPLl0u5P1XPw": {
    "date": "8/11/2016",
    "text": "Shared a few entrees, jucies & desserts amongst friends; really quite enjoyed it! The waiters were also darlings. Avocado toast w/ chipotle chicken was delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E_jBm2sIcsBaWz9jzvWN5Q"
  },
  "9oZz4z0m1Ou3pHQym5TPBA": {
    "date": "4/17/2014",
    "text": "Popped by for lunch earlier. Was a bit underwhelmed by (lack of) choice but settled on a beef toasted granary bread sandwich which was tasty enough. My two teenagers and their granny all had the same pulled pork ciabatta sandwich with red cabbage and a small poke of chips. Nice enough but not spectacular. Service was a bit pedestrian but pleasant enough. A bit more choice and a slightly more proactive service and I've have flipped to 4 stars. Will give it another go but there are better options within the whiff of a freshly made coffee around the new town/stockie border.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pwJDMksfg_xuV2HAFnDFyA"
  },
  "KUT-H1kW-IjgkN8AuP1JXA": {
    "date": "1/29/2013",
    "text": "Went to the pantry for coffee. First impressions was that it was a strange space with an overwhelming smell of cooking oil from what I guess is the all day breakfast? I had a latte and a brownie so can't review what appears to be an interesting menu.  The coffee was ok and brownie was good. But... the brownie was 3 which for the size was steep.  The pantry is in a super competitive area so I hope they sort out some of these teething issues.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "cSH-FSFPlpU3jwZXj_6oXg"
  },
  "LJwGKPFo_c4ABpWtaxL0zQ": {
    "date": "6/5/2013",
    "text": "Only been twice but I love breakfast here !  I had the eggs benedict with smoked salmon, and im not even a massive fan of salmon I'll only have it occasionally!  We also got the corn fritters with relish and my goodness they were delightful!  The waiter actually told us when we were leaving that they were his grandmothers recipie how quaint!   Its very light and airy in there and plenty of room for buggies they also have a mummioes hour i think its on tuesdays and thursdays between 3 - 4 and they provide colouring for children and you get a coffee or tea for 1.00 good deal and you dont have to worry about your children being too noisy cause i would assume its all children then ! They are great with kids and theres lots of room which is good, they dont servce alcohol yet but you can BYO which is ace !  Gorgeous selection of cakes, friendly and helpful staff and the food is actually divine!  couldnt love it more, the only bad thing is its packed on weekends so it will be hard to get a table there soon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SKhwZocAjV6Rc1auxKZ_2g"
  },
  "xtW42DQoNWYI_IZ0y1MSzA": {
    "date": "12/19/2013",
    "text": "The Pantry is one of our favourite places in Edinburgh. The breakfast and lunch is delicious and locally sourced. The chef has real skill and serves up comfort food with all the little details done right (eggs perfectly poached, the roast vegetables are always spectacularly done). The soups and stewps (soupy stews) are always wonderful and rotate constantly so you get a great variety. I'm a very big fan of the terrines as well which are wonderfully silky but always hearty. Great cappuccino also (and my wife loves their tea selection).   The dinners are a real treat. They do special 2 and 3 course menus that are some of the best food for the price I've ever had.   The service is absolutely wonderful. It's family run (and it shows). Everyone working is gracious, helpful, and knowledgeable about what they do. We've always been treated with complete kindness and hospitality, and like \"regulars\" from our second visit onwards. Really, the folks working there are just friendly and genuinely nice people, and are always an absolute pleasure.   Importantly for our family, they are also VERY family friendly. They are great with kids and have excellent child amenities (including a great changing room, child seating, and a children's area with lots of toys [which our daughter is too young to use just yet]).   I really could not recommend more highly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tv-ZVfvFMsIN0S1NROKNsg"
  },
  "J2PVPk-vsCOFjbeI31gLwg": {
    "date": "6/8/2019",
    "text": "Wonderful breakfast spot in Edinburgh!!!  We love the food and service here so much, that we made a point to eat here every morning that we stayed in Edinburgh.  Stumbled upon it while we were staying at the nearby Nira Caledonia hotel.   From the stellar and friendly service, from people like Hayley, to the delicious, original and fresh ingredients used, this place will go down as our favorite eating spot in Edinburgh, no matter the meal or time of day.  Some our favorite dishes included the USA (Ubiquitous Smashed Avocado), the eggs Benedict and the great smoked bacon and salmon.  If (when) we get back to Edinburgh, we will definitely go back to The Pantry.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "0UMg7m2oM8DS8MIL6zYGVA",
        "caption": "Photo of The Pantry - Edinburgh, Midlothian, United Kingdom. Busy on Saturdays",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0UMg7m2oM8DS8MIL6zYGVA/o.jpg"
      },
      {
        "img_id": "nMW_Yc6_Mvi9GNpmufceGg",
        "caption": "Photo of The Pantry - Edinburgh, Midlothian, United Kingdom. Hayley",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nMW_Yc6_Mvi9GNpmufceGg/o.jpg"
      }
    ],
    "user_id": "jUbdI4WPpHZawPFzMshDiA"
  },
  "nU998-I3x2Sdbbxy_d0JiQ": {
    "date": "9/29/2017",
    "text": "Divine.  Wish we had found it sooner.  Our last morning in Edinburgh, mid-week, we sat outside and enjoyed a huge breakfast.  Friendly service.  Kid friendly.  Waffles and bacon on a bed of house made currant jam.  Latte served up in mismatched china.  Suspect it gets pretty crowded here on the weekends.  Our Air B&B was just around the corner in this food lovers neighborhood.  Go.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kSLZ82Qa8NCvBUGwjjKhrw",
        "caption": "Photo of The Pantry - Edinburgh, Midlothian, United Kingdom. Lovely mismatched china",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kSLZ82Qa8NCvBUGwjjKhrw/o.jpg"
      },
      {
        "img_id": "LBDywCAFaDKrbX-Q9468tA",
        "caption": "Photo of The Pantry - Edinburgh, Midlothian, United Kingdom. Bacon waffles",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LBDywCAFaDKrbX-Q9468tA/o.jpg"
      }
    ],
    "user_id": "9M6qlCfVp4VeQ2lHbjQoBQ"
  },
  "HJCC8eeE48J7jpz1W8RxlQ": {
    "date": "9/20/2015",
    "text": "So I've been meaning to try this place for ages but its always so busy I've struggled to get a table.   But alas. My time had come. I made it through the door (technically I ate outside because it was a rare sun-shiny kinda day) but you get the idea.   I had the vegetarian breakfast with chorizo and a coffee. And I was not impressed. I mean, the coffee cups are super cute, the coffee itself was not impressive.   My breakfast almost felt like a breakfast for giants- and no, not because it was a huge serving (its actually pretty reasonable) but each item put on my plate was just LARGE. Like, two tomato halves, big chunks of mushroom, huge chorizo links sitting atop a mound of bread. I would have been happy with a slice of toast. Honestly, I spent so much time trying to cut my food into pieces I just quit.   Each item on its own was nice. Didn't reallyix well together and the dtrip of haloumi was my favourite part of the meal.   After eating here, I don't understand the appeal. Sure, the exterior is super funky and staff are lovely, but when I think of eating or drinking a coffee here again I just think 'why would I do this to myself?'  Sorry guys. Just not a fan on my end.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Y9fgpxY7vudHuHwVXLF3-Q",
        "caption": "Photo of The Pantry - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Y9fgpxY7vudHuHwVXLF3-Q/o.jpg"
      },
      {
        "img_id": "s_UNlj0CgAA07vwK_3t1ow",
        "caption": "Photo of The Pantry - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/s_UNlj0CgAA07vwK_3t1ow/o.jpg"
      },
      {
        "img_id": "lIEJ7h1G_yPuR_jdOOpEKw",
        "caption": "Photo of The Pantry - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lIEJ7h1G_yPuR_jdOOpEKw/o.jpg"
      }
    ],
    "user_id": "NwVyki35xOcaxhMzHNtHDQ"
  },
  "-NxXVaBI9ZsWMjHwBNBf7Q": {
    "date": "6/15/2015",
    "text": "Yo, you two Scottish chicks be slow as hell bringin me my Full Scottish Breakfast.  ::devours eggs, bacon rashers, tomato, beans, black pudding, Scottish sausage and toast.  I forgive you, it was hella deelish.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "okX1pf7ZhP5DSQh6g1iR2A",
        "caption": "Photo of The Pantry - Edinburgh, Midlothian, United Kingdom. Do it.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/okX1pf7ZhP5DSQh6g1iR2A/o.jpg"
      }
    ],
    "user_id": "Yjer78RnYr7OCzirgdcOaw"
  },
  "dovchecQpVYH3aRVpE3Rpg": {
    "date": "10/23/2013",
    "text": "Service was rather hit and miss as we had to ask for the bill twice at the end of the quick lunch we'd stopped in for but no complaints about the food itself.  Like a lot of places in Edinburgh that offer on-street seating there's really not enough room between you and the road which in the case is cobbled thereby making it doubly loud when cars pass so beware of that as, due to its deserved popularity, there's a good chance you'll have to plump for one of those tables as the inside's invariably full.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "txzOZrHK9EVY0kYjSuXkKg"
  },
  "HA5Dh1EU8T9VNKGn4in9yA": {
    "date": "7/6/2018",
    "text": "Ate here 3 times and every time was excellent - tastiest food on our 2week holiday in Scotland",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gy7Ss1uTpCjbbGsghTvNsw"
  },
  "A2A_DRGcyarEy1DxXGxgCg": {
    "date": "12/5/2015",
    "text": "Every time I have walked past the Pantry I have always thought that I must try it. It's the kind of place that looks appealing for a lazy weekend brunch/lunch.  I ventured in today hoping to grab a small breakfast although not feeling like anything too heavy. Aside from the various cooked offerings they also do a granola or porridge although they didn't appear to be on the menu. I settled for some porridge and a flat white.   The coffee was passable and the porridge served with some fruit compote and a little honey was exactly what I was after. The interior is nice; spacious, homely and quite relaxed. It has a play area in the back so it's probably idea for families.   I'd definitely be tempted to come back and try out their cooked offerings. I wouldn't go out of my way to come here for coffee but provided it doesn't get too busy it feels like an idea spot to grab to chill on a lazy day.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JF29zyuFAzIs9zTTSi69Rg",
        "caption": "Photo of The Pantry - Edinburgh, Midlothian, United Kingdom. Some festive touches.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JF29zyuFAzIs9zTTSi69Rg/o.jpg"
      },
      {
        "img_id": "1nslj3SPk-7oPGeriPV2eg",
        "caption": "Photo of The Pantry - Edinburgh, Midlothian, United Kingdom. Flat White.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1nslj3SPk-7oPGeriPV2eg/o.jpg"
      },
      {
        "img_id": "glcxlluc2TP1sbpv1xOr1g",
        "caption": "Photo of The Pantry - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/glcxlluc2TP1sbpv1xOr1g/o.jpg"
      }
    ],
    "user_id": "eFqg1qaOBHq_Od6fRlMcWA"
  },
  "jzyptT1UYQyXsCQDMAhfBw": {
    "date": "9/28/2017",
    "text": "Right around the corner from our Airbnb in Stockbridge. What a sweet place! Sat outside because it's our last morning and we have way too much luggage. Huge breakfast, delicious waffles, mine was bacon ( about 6 rashers) and 2 perfectly poached eggs. Nice pot of tea. Thick  sourdough wheat bread. Friendly & excellent service. Wish we'd found it sooner. Reccomend highly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vLeO7YbzNz1KDY2LE_qV8w"
  },
  "EnKgvO91J-lQdsI9seaXPw": {
    "date": "3/13/2016",
    "text": "The Pantry ticks all the boxes of a good brunch spot; an interesting, hearty menu; plump, iced cakes atop the counter; a wondrous, tempting smell rising from the kitchen. When I arrived, the Pantry was very nearly a full house. Nobody welcomed us straight away and we did have a wee wait. I'd noticed that this happened quite a few times and even resulted in a few lost customers. A 'Hey! How you doing? I'll be with you in a second' makes all the difference.  We sat at a table which was promptly cleared but, despite the evident crumbs from the last diners, nobody gave the table a wipe down. I'm an optimist, especially when brunch is involved, so I was excited to see if The Pantry's food would be the redeeming factor.   I had the Sunshine on Stockbridge which sounded delicious. What arrived was a piece of toasted sourdough, two poached eggs, a small portion of their chunky homemade guacamole and a few slices of roasted sweet potato. The dish sure did look like a foodie work of art; the chilli garnish for dipping had been carefully drawn around the toast centrepiece. It was an interesting and tasty dish. But when you're going for brunch you want something substantial; something memorable. This dish costs 8.50 and I just couldn't help but think of all the other local spots offering up wonderfully delicious platefuls for round about the same price. Although, I do have to commend The Pantry's beautiful, bursting yolks!  We paid up and were on our way. We had to have a second glance back before staff wished us goodbye. I didn't find the customer service at The Pantry to be welcoming or sincere and, in my opinion, there's so many other local spots consistently delivering amazing five-star service. Unfortunately, I came away from The Pantry feeling like it was very much a case of style over substance.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "8rI2CoS4ltQePbZceSOgow"
  },
  "cPxy1HzZwftN2t5iK4-EGQ": {
    "date": "8/19/2017",
    "text": "Great little place! We came on a Saturday morning and it was a little crowded but thankfully there was a table outside and since it was sunny we sat there. Service was great and everyone was very friendly. I had the \"Pimp my fry\" breakfast, my wife had the porridge and my daughter the \"LA eggs.\" Food was very tasty and service was prompt.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gf-z_toDWbuSVnT98fpS-g"
  },
  "swYaYPXd9yn8a7njzDBKYQ": {
    "date": "6/28/2017",
    "text": "Heavenly.  Salt beef hash is the dish by which all breakfasts are judged, and this one -- adding sauerkraut, for a nice change -- was a winner.  Also, yeasty waffles!  And smoked salmon!  My only quibble:  if you're going to put a \"flat white\" on the menu, learn to make it without foam, otherwise what's the point?  Still, the coffee was excellent for all that, which is a rare thing in the U.K., so all is forgiven.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vbQc62ip-wbMPDRbdy_gXw"
  },
  "VqrFF-OKOysW4jTA3bxWZA": {
    "date": "2/10/2014",
    "text": "I gushed on about this place when I came here first and having come back for brunch I still have to say I think the food is exceptional.  Why the loss of a star? Well to be honest its down to service and a general lack of organisation.  Like many places the Pantry is listed on <a href=\"/redir?url=http%3A%2F%2FTopTable.co.uk&s=61596195c2cce7eef417bf52e6832ca52c750c6092ceb2d339ea21c898f761f8\" target=\"_blank\" rel=\"nofollow\">TopTable.co.uk</a>, so when looking for a place for brunch for Lucie.M and I this seemed like the perfect option. Having booked a day before we walked in to the crowded restaurant bang on the time of our booking, 6/7 people were already waiting to be seated.  As some people were being turned away, I explained I had made a booking, one quick check of their bookings and it was clear they didnt have us down - credit to him - he told us to wait and our table would be ready in just a minute. When we did sit down the table was really sticky - the very flustered waitress immediately came over and asked if we had ordered - not having seen a menu and having just sat down we said well no. This seemed to frustrate her a little.  Lucie.M opted for the build your own fry-up and I went for the East Lothian foraged mushrooms with pancetta and poached eggs.  When the food came I got a waft of one of my favourite things in the gastronomic world TRUFFLE. These lovely mushrooms has been doused in truffle oil. Oh my.........!  It was delicious, I well near licked the plate clean, Lucie was I think equally surprised and impressed by her meal, especially the veg table hash.  All in all the kitchen are knocking it out the park, front of house....get things in order and you have a real winning place!  The Pantry still comes Highly Jd Recommended.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "uwAkd7ueAeBGrwVfW8Xh3A",
        "caption": "Photo of The Pantry - Edinburgh, Midlothian, United Kingdom. Mushrooms, pancetta, poached eggs and truffle oil! Yuuuuuuuum",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uwAkd7ueAeBGrwVfW8Xh3A/o.jpg"
      }
    ],
    "user_id": "rl4hqDnywPJDCK4wfbXMzg"
  },
  "g9xuFr63i_hZn1NQ4Xjdww": {
    "date": "4/27/2017",
    "text": "Love this restaurant! We were visiting our son, daughter-in-law, and granddaughter and The Pantry is on the corner of their block. I love the play area for children. Everyone who works there is very friendly. The coffees and food were excellent. Loved the brisket quesadilla! Hope we get to go back some day!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nXAT0kSbi19QeEnhmb0rlA"
  },
  "QuokehZ19_99NQx1ohgjaw": {
    "date": "1/1/2017",
    "text": "Awesome breakfast. I had the Stockbridge with chorizo and my boyfriend had the quesadilla. Both were very good. We also had fresh squeezed orange juice and a scone which were both very good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Y86WOHSQfW1FelkC6aUrSg",
        "caption": "Photo of The Pantry - Edinburgh, Midlothian, United Kingdom. The Stockbridge with chorizo",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Y86WOHSQfW1FelkC6aUrSg/o.jpg"
      },
      {
        "img_id": "DzyMEvJf5cetueaxgW-oKg",
        "caption": "Photo of The Pantry - Edinburgh, Midlothian, United Kingdom. Quesadilla",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DzyMEvJf5cetueaxgW-oKg/o.jpg"
      }
    ],
    "user_id": "dFe7Y0_6G5c-3VjWLfIcRQ"
  },
  "UWnYzeSbF88K4yVGrQyh7w": {
    "date": "3/22/2015",
    "text": "Its been a while since I've been here.  I've never tried the brunch, so I am pleased to say it was good.  I had eggs Benedict with Welch's hot smoked salmon, San pellegrino blood orange and flat white.  The poached eggs were so good, Ozzy and perfect. The hot smoked salmon was cold, so not sure if it was meant to be warm or not but it tasted nice.  I love the sourdough toast, a nice thick slice too.  The flat white was perfect too.   Will I be back? For sure I will! There are a few more dishes I wanna try out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BhYROfCjIJsKUk22_IVHig"
  },
  "npt2yqkTed_g3L5hSJ3omg": {
    "date": "8/17/2013",
    "text": "Was hoping for more out of The Pantry when we wandered in for a meal around noontime the other day. They were no longer serving breakfast, and we were informed that certain items on the lunch menu wouldn't be available until after 12:30. Left with a small selection of not-particularly-interesting choices, I opted for a cheese sandwich. Which was fine for a cheese sandwich, I suppose, but secretly I wanted to be eating something more exciting than a cheese sandwich.   Service was friendly enough, and the outdoor seating area looks quite appealing. I'd go back for a coffee or maybe to give their breakfast a try, but I wouldn't bother with lunch there again - too many better choices in the neighborhood.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "J_qpI2jCkwv7vPNz_9JeqA"
  },
  "QhvUz86ie4_hJ2Cqo8TYJQ": {
    "date": "2/16/2017",
    "text": "Delicious food in a cool and quirky setting - there just wasn't enough of it. We came to The Pantry on a Saturday afternoon - prime brunching time so as expected, this place was packed.  When we came in we weren't greeted by anyone and a waitress even walked by and looked at us without even saying that she'll get to us in a minute. The waiter who then spoke to us and told us a table wouldn't be too long was really friendly so that made up for the initial encounter. Onto the food - I got the L.A Eggs, basically toast with roasted peppers, avocado, pico de gallo and a poached egg. My boyfriend opted for the S.F eggs which was the same thing but with bacon. Now don't get me wrong, this was one of the best poached eggs/avo/toast combos I've ever had - the egg was perfectly done, the avo was just the right amount of saltiness and the salsa was delicious. The only problem was there wasn't enough of it! The both of us were still hungry afterwards so ordered a slice of vanilla sponge cake (delicious also) which sorted the problem. Perhaps that is their grand plan! Overall, really delicious food but not on the cheap side, portions aren't massive and you will most likely have to wait for a table if you go on the weekend.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UROkCgA18uG7WXg1X2vIdA"
  },
  "0YeQfsG4SBBrG_sXcYPv7g": {
    "date": "12/29/2015",
    "text": "This was my first breakfast in Edinburgh while traveling with a friend who is very familiar with the city. We had a bit of a slow morning so we arrived right before the breakfast service ended (14:00) so, as to be expected, some things had run out (sausage and hollandaise). Fortunately, the rich and strong Americano we ordered were both available and prompt to arrive at our table. That being said, my friend and I ordered both of the fry-ups and we're pleased by our portions and the quality of our food. Despite it likely nearing the end of the morning waitstaff shift, our table service was hospitable and accommodating without being condescending. I truly enjoyed my fry-up and hope to go back before my trip ends!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "anb1A5KUZYV0GK5NE3lf4g"
  },
  "OQsvLIxGwZ8QwXCPRx0bbA": {
    "date": "2/27/2013",
    "text": "I want to like this place, I really do, sadly my lunch today (The Stewp on the menu which was just a very average soup with some pasta in it ) didn't live up to expectations.   The Pantry is in a super competitive area, the staff are very friendly and welcoming, the coffee is from illy and they have a great selection of fresh cake and local produce but so do most new places in this area. A big plus is that this place gets a lot of sun and there are a few tables outside, we had lunch al fresco there today, in February, in just our shirts.  I do hope to get back and give it another try soon.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yhsGx56jGWf2tG7YA834Gg"
  },
  "ybeXiYTjk_DM_kEgDQF2Qw": {
    "date": "5/28/2013",
    "text": "Not incredibly impressed. We had our breakfast here and the pancakes were not nice at all. The eggs benedict were satisfactory at best. The hollandaise sauce was hardly there and actually pretty dry.  Overall pretty Meh. Won't be going back in a hurry.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F0nFAY1Qi_7it_Q52n3nTw"
  }
}