{
  "jAoysxXklwe5LMFSYvIt_Q": {
    "date": "6/25/2013",
    "text": "The seafood and service were perfect. I had tempura squid then baked scallops. Just far enough away from the tourists to be peaceful. May go again this trip.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V9_GnjkZmPdWJarLSjvYxQ"
  },
  "69HJ42U5i2JDbD-X7Gflnw": {
    "date": "4/8/2011",
    "text": "I really enjoyed my meal at Ondine (although they didn't have what I wanted off the menu).  I was with work colleagues and the atmosphere was probably louder than usual because of us.  Quite pricey, but worth going to if you want somewhere a little bit special.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zF-hK3107dbCR9vW_kRTWg"
  },
  "HqFe3n7u5HZcCwXtX0HMOw": {
    "date": "7/15/2013",
    "text": "Excellent place for great seafood near Edinburgh castle. I started with a lovely salad of fried goat cheese, beets, figs, and frisee.  My husband enjoyed a variety of oysters on the half shell. For entrees we had crab risotto, mussels and the sea bass. Portions were very generous and all around delicious. The service was prompt and courteous. The lemon posset was heavenly--tart, creamy, and finished with fresh berries and shortbread on the side. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-mUYnIEzT24d2jO29cAnRw"
  },
  "FPmE2pbPRbZIirJjM94nCA": {
    "date": "5/16/2012",
    "text": "Me & my boyfriend go here for special occasions. We are both fairly scruffy/poor student types, so only come when the pre theatre/lunch menu is on (can't afford that 25 main just yet!)... I think its around 18-20 each for 2-3 courses?   Usually I wouldn't feel comfortable going in a nice restaurant like this when I wasn't all dressed up or with family, but they treat us really lovely,... not snobby or looking down on us like I have been treated like in the past by some places. It is always very quiet around the 3pm time we go, but as soon as it hits 6pm everyone turns up & we are the only ones in jeans and a t-shirt!  Anyway,... the food! Its amazing! The staff are attentive & explain the menu to you well. They also bring out these little cheese things before the starter... I could just eat a whole plate of those!! The portions are surprisingly big but well decorated too. I almost always go for the mussels, which are simply amazing. My only criticism of the food would be that on once or twice its been very very salty, but this is rare. Desserts are to die for too. Just wanted to leave a review from a very non-suited customer who feels valued here too!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "dM9WWt-uMcSdAYBglSrbkw"
  },
  "JHrIkGwwc12nVLhqdqbLRA": {
    "date": "7/20/2010",
    "text": "This restaurant rightly deserves its title of 'Seafood Restaurant of the Year' and The List's 2010 'Newcomer of the Year' award. This was a total lunch time treat for me, taken by a family friend it was great to be able to enjoy such great food, fantastic service and not have to pick up the bill at the end!  The beautiful decor is complimented by the beautiful view of the sandstone buildings along George IV Bridge. I highly recommend you request a window seat so you can take advatage of the prime people watching location! My advice is this would be a great date place if you really want to impress, there is lots going on to talk about if there are any awkward moments. The other option specific to students is getting parents to take you when they are up for a visit and worrying that you are living on pot noodles!  The menu is short and sweet with a good range of fish and seafood but they also serve steak for anyone in your party who doesn't like seafood.  One of my favourite touches was the little cheesy pastry rounds of heaven that came with bread to start. We then shared the moules mariniere and smoked haddock chowder. Both of which were delicious, defintately share starters, then you get to try more and everyone's a winner! For mains we splashed out on the hot, roasted seafood platter which at 32 to for two was really very reasonable given the much higher prices you can pay for seafood elsewhere. There was lobster, langoustines, scallops, cockles, mussels and it was all delicious, the sauce was yummy so remember to keep some bread for mopping up!  So, in conclusion, tasty food, gorgeous surroundings.This is a must visit restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3XDGNCH155seEXyEQPMi_w"
  },
  "7wUADjhSrFhvlgiblfowhg": {
    "date": "8/3/2010",
    "text": "My parents were visiting me in Edinburgh and were looking for somewhere special to eat. Edinburgh being a seaside town, we decided we'd go somewhere that specialised in seafood. I'm not great at being in places that make me feel really shabby (where everything is so much cleaner than I am), but this place, despite being pristine and having silver service, still conveyed a relaxed enough feel that I didn't freak out.   The food was awesome. The oysters were particularly spectacular. And I'm a bit suspicious of oysters. They taste too much like the sea, like a mouthful of salt water, and their texture is a bit snotty. But these were spot on. The service was generally really good, though they lost our order Armagnac at one point. It's a really modern space, all based around a central bar. A bit like a spiral. There are good views over Victoria Street, George the IVth Bridge and the Royal Mile.   It's just a really good place to go, if you get the chance, though a bit pricey. But the price definitely reflects the quality of the produce.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SJHZlBsy0GF_HYRN7wG-6A"
  },
  "Xfqr_7qt_IbtzSxVRSep3A": {
    "date": "10/13/2010",
    "text": "Excellent food and atmosphere. The staff are very attentive and friendly, which made for lovely lunch. I had a selection of the four different kinds of oysters they had for the day (Donegal, Cornish, Loch Ryan, and Carlingford), as well as two starters (enough food for me). The brown crab and duck egg starters were delicious and they made sure they timed the dishes the way I wanted since it wasn't a normal starter/main sort of meal. Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GgoGMSyHauJtgPhP1Md-vA",
        "caption": "Photo of Ondine - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GgoGMSyHauJtgPhP1Md-vA/o.jpg"
      }
    ],
    "user_id": "E23QcHf97ZwcYvkrSZaayw"
  },
  "ygHenQg_ZCPvKFHHWpL9SA": {
    "date": "1/13/2011",
    "text": "The setting, the service, oh the service, the menu, the presentation ,the produce, the delivery, everything, they are getting it right. This restaurant is relatively new, and can be confused with Missoni as it occupies the same building. I am particular about service, and it is notable here. One of the best in Edinburgh. I want to go back now! If Fish is your thing (and even if it isn't, there are meat/veg options) then try this restaurant out!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "TJ4fDlxi3oPXSqmFuBu3kQ"
  },
  "esBjq0YbYONIjIV4cYwvsg": {
    "date": "4/17/2014",
    "text": "Like the good old saying about buses, I hadn't been here for some 4 years and have been back twice in the last week. So this is a blended review. I love seafood which is probably as well as I had the lobster seafood platter both times. The second with a work colleague we doubled up and shared the larger platter which was a great call. A decent chunk of lobster accompanied by all the usual products of the sea. Lots of mussels, a few cockles, some lovely oysters, bits of crab and all served with citrus fruits, green and red tabascos and on a bed of ice. The larger platter comes in on a double decker stand which adds to the theatre of it all. We had a simply ridiculously quaffable white chateaneuf du pape (in fact we had two) and popped into divino round the corner for more wine because we just hadn't had enough! Service both times very professional. Will be back, perhaps not imminently but I'll be surprised if it's 4 years again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pwJDMksfg_xuV2HAFnDFyA"
  },
  "5f4n14nxRvsnt0DUZVas_w": {
    "date": "10/22/2010",
    "text": "This is fine dining. Amazing food. I had a tempura starter which was absolutely delicious, followed by the fish curry, which in fact is fish cooked and served with a layer of aromatic curry spices just under the flesh, not a \"curry stew\". Fabulous! The pudding I chose was the syrup tart which was again mouth wateringly delicious.   Fellow diners chose oysters, smoked fish and red mullet, each proclaiming they must have the best dish on the menu! The variety of puddings chosen proved how beautifully and exquisitely this restaurant can present the food.   There were even places set around the bar which would be perfect if you wanted to dine alone although I would recommend this is an experience to share!   Beautiful and unpretentious surroundings with excellent service and lovely wine. A definite sense of space, calm, cleanliness and freshness.   I really can't recommend this restaurant enough. It will definitely be my choice for any special celebrations.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z6seE9p3lI4__RSVPuIqyg"
  },
  "yVY6W32tnVUvqp9j2oY8gw": {
    "date": "6/6/2011",
    "text": "We had the most amazing dinner at Ondine.  The food is out of this world and every dish we had was exceptional.  The waiter made perfect wine and food pairing suggestions.  The service was perfect in every regard.  Definitely a \"must visit\" restaurant.  Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "M5uzEx5w8KaWFLHS3XYg2g"
  },
  "ZXDoWjvFFsg8QN--bH28yA": {
    "date": "5/4/2011",
    "text": "Really lovelt decor, swish and classy. Attentive staff, not too in your face, but there when you want them. Great menu and wine list. I have to say I was a wee bit dissapointed by the food - I have had better. It wasnt bad but it wasnt amazing either. The price matched the surroundings, but the taste of the food didn't quite make it for us.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RrkhHk2lrP729zw_lwBHrA"
  },
  "qPlI0sUTSNK2-1cyloi--A": {
    "date": "4/6/2011",
    "text": "Wonderful atmosphere, food and service. Can't believe they even brought me my own basket of warmed gluten free bread after i just subtly enquired if a dish on the menu was gluten free and then the chef even made up special g-f oyster and scallop tempura - amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NIKbxzp3xu0fOTsZSvMfaA"
  },
  "2McTHBH1HjyT2Do70NH5-Q": {
    "date": "1/31/2013",
    "text": "Joe A very kindly took me here for my birthday  in December and it was amazing. Seafood is my favourite genre of food and I have wanted to visit this place for years.  When we walked in they wished me a happy birthday, seated us and then brought us both over a complimentary glass of champagne. The environment was very relaxing and the staff were happy and keen to help without being over the top.  To start with I had tempura squid. Squid is my favourite dish and this did not disappoint. The portion was a really decent size and it was nice and light. For my main I chose a half lobster thermidor. This was heaven on a plate, beautifully cooked, melt in the mouth cheesy lobster. It was served with a generous portion of chips.  There was so much riding on this restaurant as I had wanted to go for so long, but they did not disappoint. I would eat here every night if I had the money. They even wished me a happy birthday on my way out and had tweeted me before I went and after to ask if I'd enjoyed myself. Excellent customer service on Twitter goes a long way in my book! :) Thank you Ondne, you are awesome!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "HV24bliLib6FuMW3bWBrpQ"
  },
  "7ftlELBkIxmDUQLbmVbaZw": {
    "date": "12/31/2012",
    "text": "Wow this place is up there. Organised a dinner for two for the missus on her birthday, admittedly had it been my own, I wouldn't have went for seafood but Jennie has an - at times unhealthy - obsession with be-tentacled sea-dwellers (she clearly hasn't seen Oldboy!) and on this occasion it was to both our benefits.  Seated at a lovely viewpoint by the windows on the corner of George IV and Victoria, we were able to indulge in a spot of one of our (and everyone's) favourite past-times: people watching, while being presented with some complimentary bubbly to celebrate the occasion (an ace touch).   The restaurant itself is immaculate, lighting perfectly intimate and the staff absolutely stellar in manner, not coming over as stuffy or imposing, the waiter would pop round every now and then to have a neb and make sure we were fine but didn't feel the need to ask us every five minutes.... points for that!  For starters we both went for the Tempura Squid with Vietnamese Chilli dipping sauce..... oh the sauce! Some of the tastiest sauce I've ever encountered. Even the bread got dipped in that badboy, it was unstoppable. The squid itself was also amazing, on par with say the Sheep's Heid Inn. The batter was light and crisp and the squid succulent and crumbly. Lovely.  For mains Jennie cleverly chose the Lobster Thermadore with Fries, while I foolishly opted for the Crab Meat Risotto. Don't get me wrong it was great, but filling. And after tasting the lobster, it was obvious I had failed epically.... cue return visit!  At first glance the prices made me wince a little, but Ondine are producing some of the best seafood in Edinburgh (okay I don't have much experience to go on with that one but it was all bloody good!) so when the bill came along in no way did I feel cheated. Would gladly go again if only to indulge in that Thermadore again!  Another great touch is Ondine's social media presence, almost immediately thanking Jennie for our visit and kind comments. Well played, Ondine.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 4
    },
    "photos": [],
    "user_id": "9RGIvzCGHp8ELF_JgAlbZA"
  },
  "ZkmFNezGUzj0EnGaFiJi9Q": {
    "date": "7/13/2013",
    "text": "Hidden away between Hotel Missoni and Pizza Express on George IV Bridge is a fabulous seafood restaurant and oyster bar. The prices aren't huge but the quality is. Started with the Asparagus with poached egg, wonderfully cooked and a light entrance followed by Scallops served with spiced sausage which I added a side salad of wild tomatoes and greens to and then ended with Chocolate Mousse. Each course was beautifully presented and tasted marvellous.   I can highly recommend this restaurant and can see it being one that I shall return to whenever I want to take friends for a treat meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CD-cuKfj2wybw2DDQbp5Wg"
  },
  "5Rmvi1G13QlqRSVCQgNjVw": {
    "date": "5/27/2015",
    "text": "Go for the pre-theater 3 course menu, which is the best value in town!   Food is excellent, ambiance is nice, staff is friendly, and most of all the value is incredible!! For 20 pp for dinner, is really great. We had Fish and Chips at Deacons across the street for about the same price, and the food was much better at Ondine. I would pay at least 2x more for quality for food it served.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qD3Ci1cmXMIRrulGtZiy1Q"
  },
  "56v43gaucGfQEUO7eWkSIw": {
    "date": "4/15/2013",
    "text": "When my husband said he was taking me to a sefood restaurant on a rare evening out i was a little apprehensive, i do like fish and seafood but usually in a restaurant it tends to be not cooked that well and over priced.  Wow what a restaurant !It is a classy up market restaurant and the staff certainly make you feel special and are very informative about the dishes. What i liked is they first bring a taster dish complimentary for you to taste and bread. The menu is quite varied and the food is first class. What i would say is the dessert menu wasn't that appealing to the eye and don't go there if you are really hungry as the portions are fairly small but saying that most fine dining restaurants are probably the same.  Both my husband and i started with razor clams with chorizo, broad beans and pea shoots it looked beautiful to start with and tasted even better. I had squid ink risotto with a layer of chilli infused squid for my main and my husband had lobster.  We went on a Wednesday evening and it was pretty busy so i would recommend that you book.  We would definetly go back again, the food was first class, the service was impeccable and the price wasn't too bad.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KVzcPnrigbaQbfKhVBmp0w"
  },
  "an9b5GWhlPdZR765cd-fiQ": {
    "date": "9/5/2013",
    "text": "Nice seafood restaurant in the heart of Old Town with nice windows overlooking the street. We were very happy with the service here. Sometimes at more upscale places the service is decidedly stuffy. It was more relaxed here, which we really liked. The atmosphere is nice and the location is great, though if you are a local youll probably be surrounded by a lot of tourists.   We thought the food was good, but Im not convinced that the sizing portions were worth the price. Boyfriends 1/2 lobster thermidor was very small (a few large bites), which the server suggested was due to bad local weather making the lobsters smaller. Sort of a bummer. Have to say the apps, the smoked salmon and ceviche, were very nice. They do a very good, tangy ceviche. My scallops were OK. There were three served in-shell with a small piece of sausage with each. Though good, at 21.50 for the dish that made each scallop cost over 7 quid. Seems a bit much. I also wasnt convinced that the sausage was the right pairing for the scallop. The scallop was delicate and lovely and the sausage was very strong, very spicy - it almost killed all flavor of the scallop.   Overall, it is a nice place. Good quality seafood. Their sustainable seafood practices should be highly commended. The service is relaxed and unobtrusive and the atmosphere is nice. Only fault I would say is the portion size/price ratio.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A_dC3FJOqvlsDEiDyMrzlA"
  },
  "C0NuDIidUu5olfClqG9-hw": {
    "date": "5/19/2013",
    "text": "Seafood here is pretty good. I like the steak tartare as well. They fry the chips in dripping to give them more taste and I normally end up getting a main course size of this as a starter.  Good selection of oysters, disappointed that they are normally Pacific's but the supply of natives is quite small I think. Perhaps they are on the menu when I am not there.  I think this is likely the best place for seafood in Edinburgh, but as Edinburgh is no longer a port city I can only give it 4 stars.  Good attentive service, decent wine list. Definite recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hbRDTyoHgeqUC-NLVlXR_w"
  },
  "FDMWT4YcEi609te7cDH9wA": {
    "date": "5/16/2012",
    "text": "So I have been back and again they did not disppoint!!  Was a Monday lunch time and I was keen to spoil my better half. A long lunch beckoned!  We started with a bottle of prosecco - great taste and well priced at 22. To our order  - as shellfish fans we were torn between the fruit du mer and the roast shellfish platter. After some deliberation we went for the roast shellfish.  For starters I had their tempura calamari and she had razor clams with chorizo. Both were fresh and delicious!!! The calamari was tender and the batter crispy - she pointed out it maybe wasnt quite as good as Kanpais...... controversial but I think its close! :o)  The greatest thing to me about eating shellfish in a restaurant is the food theatre aspect! before it arrived we were presented with no fewer than 5 different 'instruments'! When it came it looked stunning: lobster, crab, clams, mussels, scallops......all doused in garlic butter!!  Not the easiest/neatest thing to eat by dear god was it tasty!!  Jd = happy man!!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "rl4hqDnywPJDCK4wfbXMzg"
  },
  "tYNWC8UGXb5WpkC3naJIbg": {
    "date": "6/15/2015",
    "text": "Really could not have asked for better. Fantastic service, ambiance and food. Had oysters to start followed by sole meuniere with potato. Delicious. Expensive, but worth it. If you are in the mood to treat yourself, please do so and enjoy Ondine for dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OPH2RgulCPfuUdqR5gYzqQ"
  },
  "ruTuHKBRpuLSscGUv4fxCA": {
    "date": "6/4/2010",
    "text": "To give you an idea about how popular and in demand this restaurant is at the moment, I called up last week at the start of the week to try and get a Saturday night table, and was told that the restaurant was fully booked, and had been for five weeks in advance. So my first piece of advice would be to get in there quick if you want to book a table for dinner here, but I would also add that if you enjoy amazingly tasty fresh seafood, of super fantastic quality, then Ondine is well worth the wait.  I was lucky enough to get a lunch time table here, which could be a good alternative call if all the dinner sittings are booked up. This is really awesome dining, and has some ornately maritime decor going on, which is classic, but also very stylish. The bar is also super hot, get your date thing going on in here, and then if by the book romance is your thing, order some oysters.  I went for the crispy squid with garlic mayonnaise to start, followed by the fish curry, with basmati rice and raita. The menu is simple and unpretentious, but really modern, and undeniably tasty, plus the staff were lovely too. Highly and absolutely recommended.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-uhArmB9XqKuehYbpcdsKA",
        "caption": "Photo of Ondine - Edinburgh, United Kingdom. Photo from ondinerestaurant.co.uk",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-uhArmB9XqKuehYbpcdsKA/o.jpg"
      },
      {
        "img_id": "3XR9JH2yi7T_pCaH7lpBvg",
        "caption": "Photo of Ondine - Edinburgh, United Kingdom. Photo from ondinerestaurant.co.uk",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3XR9JH2yi7T_pCaH7lpBvg/o.jpg"
      }
    ],
    "user_id": "5Mujjzv-ZH6HhxT-hWCpVg"
  },
  "BqxLS_Z69FIIh04Fcl_OPw": {
    "date": "1/6/2011",
    "text": "I'm a stereotypical New York snob.  I don't mean that I'm a snob who lives in New York, I mean I'm a snob *about* New York.  I think New York does everything best.  It's unusual for me to proclaim something as \"best\" outside of NY (that includes, say, gelato or pizza in Italy).  We're just awesome, what can I say?  But not only did I have the best scallops I've EVER had at Ondine, I also had the very best lobster.  Ondine just took these familiar items to a new level.  Also, the chorizo that came with the scallops was the best ever too.  So that's three items, at one restaurant outside NY, that do things better than my beloved NY.  Amazing!  Ondine is exceptional, and worth a visit (and the money) if you're in Edinburgh.  I want to go back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "X8mIprwgZFdlKG0LwDAaaQ",
        "caption": "Photo of Ondine - Edinburgh, United Kingdom. The best scallops, and the best chorizo, I&amp;#39;ve ever had.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/X8mIprwgZFdlKG0LwDAaaQ/o.jpg"
      },
      {
        "img_id": "9_0WraJlsY8gobjrOiuBuA",
        "caption": "Photo of Ondine - Edinburgh, United Kingdom. I think this was a duck egg on toast with mushrooms.  It was delicious.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9_0WraJlsY8gobjrOiuBuA/o.jpg"
      }
    ],
    "user_id": "tkXqjDH2_3SvEn8QVaJavA"
  },
  "9KTmPmd7nf_PcR9OUuWOpg": {
    "date": "5/10/2012",
    "text": "I really enjoyed my experience here.   I was here last week with a large group (little note, on booking, because there was 10 of us we had to book about 2 weeks in advance and could only have a table on selected dates.) I think...correction know...that everyone had a wonderful meal.  Personally I had the duck liver pate to start, it was glorious. You know when every time you take a bite you wait, just a little bit and let yourself melt? It was like that for every single bite. Probably the best duck liver pate I've ever had, and I'm a bit of a fiend for pate.  For mains, I shared a fruits of the sea platter. A mound (a literal mound) of shellfish on ice. Again, it was top notch. Not the most graceful of meals I'd admit, as cracking open crab claws and sucking meat out of various shells is rarely ladylike. I've never had seafood this good. Elsewhere on our table, there was a similar platter but in this case served in garlic butter which just smelled heavenly (and tasted even better than that if accounts are to be believed). they even let my friend keep her shells, which they washed and vacuum packed for her.  Dessert wasn't intended when we arrived but everyone was having such a good time we decided to stick around. I had rum and raisin ice cream served with a shot of a delicious caramel sherry. Divine. The coffee smelled amazing too.  The restaurant itself is very plush, and not only has comfy chairs at tables, but stools at the 'bar' where people can dine if they're alone. There was at least 5 people over the course of the evening who came in for oysters and sat at the bar. The service was very professional from start to finish and everyone was friendly. the only negative I have is that the toilets are a bit pokey.  As we were celebrating this was the perfect choice! I'll definitely go again...if I can afford it!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "KPY6FvT6h-r0W0HAC1Buag"
  },
  "-vALLFvHlTRLNilDc3rRLw": {
    "date": "7/22/2015",
    "text": "the bread was nice, they have great view and cleaness. The seafood was not suprisingly good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y0sx9T4IBTaGszqlvgrsNA"
  },
  "jEEcMHmMUzMQf6FZhpnSrg": {
    "date": "12/30/2014",
    "text": "Went for lunch today based on the reviews. Overall was ok nothing too exciting pretty outdated food presentations   Was just ok IMHO service was good and friendly. Food was a bit over salted the monkfish wrapped in pancetta could have used with less salt. Outside of that completely adequate",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XP_vxDI5ZOYjSDPIEZLeDQ"
  },
  "b3raitSKnzixhuWvOmOmrA": {
    "date": "2/1/2012",
    "text": "The five stars for this place is largely because the service is the best we've encountered in Edinburgh on our quests, so far.  Overall, we said: \"we'd have no hesitation in recommending Ondine for the seafood lover in your life. They'll need to pack a few extra quid to gain access to the real fireworks on the menu, but we having a feeling they'll be nicely rewarded. For us, we think the service, which was outstanding and as good as we've experienced anywhere in Edinburgh, was the really outstanding thing. The food wasn't quite to that level, so we don't think we'll be beating a path to their door with quite the vigour we would with some other places, but there's little doubting that Ondine is a high-quality establishment, and well worth a visit\"",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "LURC3E0DoXYgN9aYTF3XOg"
  },
  "ycYP4WtJER0MzSS8RcPn_A": {
    "date": "3/13/2012",
    "text": "Recently visited here twice within the space of 2 weeks and it's one of the best restaurants in Edinburgh. The restaurant itself is stylish, modern and elegant with a warm and relaxed atmosphere and the staff are first class. Very friendly, efficient, attentive and knowledgable.  The first time I went was for lunch on a Saturday with my seriously seafoodie Uncles and another person who doesn't actually like seafood. However, even the non-fish lover was seriously impressed (there are a fine array of steaks and other bits and pieces).  We were given a selection of breads to begin with and some delightful little cheesy profiterole type things. I didn't have a starter but for main course I had the Grilled Hand Dived Scallops which come with chorizo and I ordered a side of winter greens (which is basically kale but so beautifully cooked & it went well with scallops).  My uncles had the Grilled Tobermory Langoustines, Steak Tartare, Haddock Chowder and Smoked Haddock Rarebit - all of which looked delicious and given that there wasn't a scrap left on either of their plates I can assume they tasted delicious too.  My second visit a few weeks later was with my Mum and we went for dinner.  I wouldn't usually frequent the same restaurant twice in a short space of time but I enjoyed it so much I just had to take my Mum. Again, a wonderful reception from the staff and the restaurant was busy and ambient. We were again treated to the selection of breads but after these chose not to have starters and instead save room for mains. For main course, I had the Grilled Half-Lobster which comes with herb butter and salad . The lobster was perfection (is it a bit sad to use that term in this context? Whatever, it happened, I'm using it). My Mum had Lobster Thermidor and I'm pretty sure she'd use the same superlative.  Both visits we received 5 star service with 5 star food in a 5 star venue.  Great place whatever the occasion - casual lunch, fancy dinner, birthdays, romantic dates (probably a good first date venue too if you don't mind the price), anything really. They also have a lovely private dining area/room which would be a nice thing to do for a special birthday!   Overall, a great addition to the Edinburgh restaurant scene and a must for lovers of seafood!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q6TLziIppypeczNx8_u80Q"
  },
  "MaOs7t22BgSpLh-UMhQx_w": {
    "date": "8/1/2013",
    "text": "Very nice restaurant. The sea food the serving is pretty good, especially the oysters and the lobsters.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "nr3S8p-lpf7K9W58eo_mLQ"
  },
  "PRw9RgVG0c8ZfoV4whhdRg": {
    "date": "7/22/2012",
    "text": "Four adults and a child for dinner at 1800 on a Friday. Oysters, lobsters, razor clams, plaice and haddock. All but the plaice were excellent. The plaice was wet and squidgy. But that might just be the nature of plaice. If that's so then I'll have to have more oysters instead. There were three types of oysters on offer. The Carlingford were so good that we ordered more.   The service was excellent. We had Riesling and Rioja at good prices for the style of restaurant. It is a classy restaurants with beautifully napery. Light and airy with a pleasant buzz. It's not too stuffy. Just right when only a slap up,meal in a fine environment will do.   An example of the excellence of service was my mother's dish of tempura langoustine. Tempura  squid was on the menu as was grilled langoustine. The kitchen was happy to meet her desire for tempura langoustine. Succulent and crisp. Brilliant.   I don't give five stars. So four again for Ondine",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QyP254XCNlI7DvPsze5LQw"
  },
  "n8ZEhkGKAXVYNdcM_XlmeQ": {
    "date": "4/8/2015",
    "text": "We ate here and enjoyed the pre-theater 3 course menu for 20 pp. It was a great value. The service was good and ambience was very good. Highly recommended. Especially enjoyed the Mussels entree (a very large portion), fried oysters and rice pudding dessert.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "uBHRgjD2xy77JCVm7CwmOA"
  },
  "i-WwBWQc5jHLKtTReA3yGw": {
    "date": "5/14/2013",
    "text": "I haven't enjoyed a restaurant this much in ages, and I was slinging superlatives about all the way home after dinner here last week. Ondine is the real deal and it goes straight to the top of my list for places to go for a fine meal, celebration, birthday, whatever.  For starters, the interior is stunning. Its location on the corner of George IV Bridge and Victoria St provides gorgeous wraparound views of one of the best locations in Edinburgh. Every table has a great view, even sitting at the \"oyster bar\". I was a bit concerned that sitting there would be second-rate (no one wants to be that annoying person sitting at the bar when you're trying to reach the bartender), but it was actually great fun.   Casual elegance is where Ondine really hits its straps. Being served (both food and drink) by the barman lent the occasion a casual, intimate vibe, while retaining top-notch service quality. The bartender knew all the food and drink options and executed everything with aplomb, from serving oysters to pouring champagne to mixing an excellent margarita.  We shared a selection of oysters to start, and my main of pan-fried lemon sole with asparagus and peas was superb. It could have used some carbs somewhere, but it was delicious and an ample portion. Their menu is interesting as, for such as flash establishment, it errs on the simple side. As well as the traditional seafood platters, they offer curried cod, fish suppers and linguine alle vongole, rather than Michelin-starred extravagance. That means you don't need to spend a fortune here if you don't want to. But if you fancy pushing the boat out, Ondine will provide the bubbly and everything else required to christen its maiden voyage. They just do everything right, with good service and the most beautiful setting you could wish for. Ondine is a textbook case of how to design and operate a restaurant, so it's no surprise that it's one of only a small handful of Edinburgh restaurants that's known across the UK.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ixBoXpBL1JmKmcP1F2fTHA"
  },
  "cUeTZNc1TCewxoV07ET8iA": {
    "date": "9/27/2016",
    "text": "Bummer... Was good not great and I feel like I did my research. I only have 3 dinners here in Edinburgh and this one was the let down.  I feel bad but honestly Ondine doesn't live up to the article I read.  Service is mediocre.  Friendly service but not really paying attention... I think they don't train the waiters very well.  The waiters mostly looked like college students ...   They made many mistakes and I wouldn't usually notice one or two.... But 30 pounds was mistakenly added to our bill by accident... They forgot to replace my fork so I had to ask for one. They kept forgetting to refill our tap water (we drank slowly I promise) ... Embarrassing to ask twice for a refill.  Anyhow, there were more mistakes.  I saw the young (& very well meaning) waiter spill soup on another table.... Oh dear.    Anyhow... Go to \"The One\" even though it's slightly expensive they have a 3 course option that is actually comparable to 3 courses at Ondine.  The One was phenomenal.  Amazingly friendly and attentive service. Fantastic flavors without it being 'weird' food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2wdhN8Y2EJRswvkduFxnOQ"
  },
  "mfHUgJBlJ0kRq-QGjbMX-Q": {
    "date": "6/19/2018",
    "text": "This place has such a great reputation. Maybe it was good in the past, but we were disappointed from beginning to end. The service was terrible, one surly person after another coming by to ask what someone else had already asked, like if we want to order a drink. Everyone seemed like they hated working there. The food was not bad, but nothing special and certainly not worth the exorbitant prices. The overall feeling from the unexciting food to the black and white decor to the icy staff was that of a cold lifeless place. Maybe the past success went to their heads and they just don't care anymore. Many other places we went to in Scotland had so much heart, but this place just doesn't. Best avoided.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DCdZvfo2TZi3JM8Vce0ExQ"
  },
  "drKs6YU5g1h_wJUckLPmHw": {
    "date": "3/27/2018",
    "text": "We came here from Los Angeles in June of 2017 and had the most amazing meal. Now we have returned - my daughter is going to University here next fall. Appetizers:ok. Entree: crab risotto - really awful. No crab I could taste. Restaurant had only tourists. What happened?",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W33G4AFsCIXEh1haMuplAw"
  },
  "SC1hJLmt2JtVxz-ubjNORw": {
    "date": "4/5/2018",
    "text": "The mussels is excellent, the blue crab fry rice is very tasty too. Service is very good too",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zPzRJZtL0df7kS6rb_DfMw"
  },
  "KTk0A4_01H-q-R9Jvl5iEg": {
    "date": "1/19/2016",
    "text": "We haven't been to Ondine for a good six years so I had made up my mind for my birthday dinner to come back and revisit!   I was really pleased with the window seat as it overlooked Victoria Street and on this particular night it was snowing, so you can just imagine it was picturesque!!  The OH choose the wine and it was a French white. It was very dry but went well with the dishes we choose.  For starters the OH choose the potted crab and I choose the tempura squid. Both dishes were exquisite.  The tempera was deviously crispy!   Mains were just as delicious, lemon sole for OH and Isle of Mull Scallops with sausages for me!   Desserts were a pretty picture - they look so fragile and such ashame  to cut into with a spoon. Ok by this point we are both getting quite full but you can't miss on dessert.   Chocolate & Praline parfait was his choice and the mango passion cheesecake was mine. Both came with superb sorbets.  Ondine has a lovely chilled dinning experience yet still has that sophisticated edge.   We shouldn't leave it for too long again!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "BhYROfCjIJsKUk22_IVHig"
  },
  "5iMIvkHuAf35l4PoLxbVrQ": {
    "date": "9/13/2018",
    "text": "Recently we traveled to Edinburgh and spent quite a bit of time researching excellent dining options, especially seafood. We made a reservation at Ondine and were very impressed with the menu. Upon arrival the hostess was great and upbeat with a smile. The food was excellent however the service from the gentleman was terrible. He was unfriendly, rude and dismissive. He never filled our drinks once not even our water or asked if we wanted additional cocktails.  He would walk by our table and look the other way. We chose not to say anything but rather enjoy the seafood platter and additional entres.  Strangely he did not even return to bring our check but rather another man in a suit brought it, he too never asked about he meal or said anything. We ate the entire meal with no communication from the restaurant. For a meal of this caliber and cost we were very disappointed with the service and don't think we would return again.  I want to mention we have both worked in the service industry and have quite an understanding of the position and patience for a  busy time.  This however was insulting and puzzling.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HGXqA4Yvt5CI4aBQxS885w"
  },
  "e1UAQcF3CW-ojhI8Okjf9Q": {
    "date": "3/29/2018",
    "text": "Dined here because we wanted seafood.  Food was very good and portions were good.  Ambiance was very nice and fairly quiet.  Service was friendly but average.  Overpriced.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M4p1iVoQkJcFoMtyj9hhyg"
  },
  "OYs7ak-EP2yJPlHP3Qsgfg": {
    "date": "9/3/2015",
    "text": "Latest contender for my fave restaurant in Edinburgh - this is a great spot for an upmarket seafood-oriented dinner. My companion was taking me for a special treat so had booked a few weeks in advance which I'd recommend - the tables around us only seemed to be empty for a matter of seconds before the next party arrived!  The setting is simple, modern and elegant in the dining room, with tables mostly for two around a central bar with some raised bar seating. I slid into my seat enjoying all the smooth dark wood and clean lines, and large windows looking out over the old town. The service was very good at striking that tone that's both professional yet down-to-earth - so let's you know you're somewhere quite posh but at the same time gives you convincingly good advice.   We started with some oysters which our waitress confided in us that she couldn't really taste much difference between the different areas, and assured us she'd just choose us some big ones. To me they just tasted of the sea anyway. We followed with salt and pepper tempura squid which was very moreish so thankfully came in a good-sized portion with vietnamese dipping sauce, that had a sharpness that I wasn't sure I liked but was strangely addictive nevertheless!  Our waitress also helped me decide what to do for main - I asked her how the lobster was grilled and what it came with, and in the end she offered to do the dish half grilled, half thermidor as I couldn't decide. I'm a newbie to lobster but I thought it was delicious - the thermidor half was tasty but I couldn't have had a whole one with all that sauce. The grilled half was good fun if slightly hazardous as they gave me the proper heavy duty crackers for the shell and claws. Also tasty and a nice complement to the other half, being simply cooked in a little garlic butter. Served with thin-cut chips which got a thumbs up from me. My buddy seemed to enjoy his lemon sole, which also looked perfectly cooked, and we made our way through a nice bottle of Viognier alongside it.  We enjoyed seeing some of the shellfish platters arriving for people on nearby tables, but were a bit wary of them being piled high with ice and perhaps a little unfulfilling. Nice to look at, but I'm glad we made the choices we did! It was nice to know they try and source everything as locally as possible too - my lobster was from Newhaven for example, and you could taste the freshness of the oysters. All in all it was a gorgeous meal and a nicely satisfying evening all round - would recommend to any seafood fans who are after a swish meal with family, friends or colleagues (though look out for the naughty painting on the wall by the entrance!).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "E9vrC2FpOYtY9OI8Azlchg"
  },
  "vdxL0nK2Nl_Da1Oacux8PQ": {
    "date": "4/29/2016",
    "text": "Really fresh seafood. Definitely world class. The seafood platter and the potted crab are out of this world. Oh and service is very good. One of the best restaurants in Edinburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YdA3Gzl5UvEp8Wkdmfj2pw"
  },
  "FCi041PPzFHt-AC-3r7aWQ": {
    "date": "10/30/2015",
    "text": "Yay I can write a 5 star review! FINALLY!! It's been a while. So... The food here is simply fantastic. I had the scallops... The fish soup, the crustatin (what the f was that???) and folks... This was a 5 star meal. I can also say based on experience, this would likely be 5 star all the time... It did NOT seem to be a fluke that my meal was so delicious. So... Hell yeah get here folks!!  Ambiance? Nice... Upscale but not annoyingly quiet (you can converse). Service? Great! Food... Read above!!  Great find!!!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ltRp9UX2yV4MwHGQLhJkUQ"
  },
  "alMCJ7Bx33HvujQmc3AzIw": {
    "date": "9/27/2016",
    "text": "After hunting down and researching for a good place to eat oysters in Edinburgh, ondine came on top of all the reviews I was reading online. Jersey oysters, Loch fine oysters, carlingford oysters, etc, who knew there was so many to choose from! Not me but luckily you can mix and match and taste as many as you fancy for a mere some 3 each.  The ones we tried were fresh and nicely accompanied with pomegranate vinegar dressing.  As a starter we tried the beetroot and goat curd salad and the fish and shellfish soup. The salad was colourful and had a nice hazelnuty taste to it, the soup also very nice was maybe to overpowering for my taste buds and a bit on the large side. For our main we opted for half a lobster which were cooked to perfection. We had a lot of fun using the lobster tools provided to us, it got very messy that goes without saying.  Overall this restaurant deserves top marks for the quality of its food, I'm being picky and only giving 4 stars because the service was somewhat inattentive and I really had to probe to get some guidance on the different type of oysters, which felt like more hard work it had to be.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "FmbduNxDfGN7TiHrY2UewA"
  },
  "nq4QZyjo8eYx1Ooi788lag": {
    "date": "8/2/2015",
    "text": "Ondine is now open for Sunday lunch from 12noon. The service and food were really flawless. I was able to make a booking online the day before for four people (check), they happily accommodated two changes to that reservation as our friends kept changing their plans, the service was friendly and the food delicious. What more could one ask for?   I had the mussels, which were incredibly plump and sweet and honestly not a bad deal at only 15. The fried calamari appetiser was fabulous as well... it comes with a Thai chilli/fish dipping sauce, and I seriously wanted to lick the bowel. Definitely not your usual canned Thai chilli sauce.   All in all, some of the best seafood I've had in a long, long time. Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ieg1z6bc94U_RfS-OGxQ_A"
  },
  "WXGNDnU4BmMRelpgNbm6tA": {
    "date": "5/29/2016",
    "text": "A must! Reasonably priced, expect dishes to be $30-50. Definitely white table, be dressed to impress. Lemon sole was perfectly cooked, scallops were served at a great temperature with light charring and delicate in texture. Highlight meal of our trip.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "zPa50lfJ80JXQlj8WHoQVA"
  },
  "kUmnTPm96K4TQ1XIiz27hg": {
    "date": "1/22/2016",
    "text": "It was out first night in Edinbrugh and we wanted to have a fancy seafood dinner. The beetroot and goat cheese salad wasn't that great. But everything else was superb. My mouth fell in love with the lemon sole...I wanted to have it the next day. The grilled lobster was perfectly cooked and great portion (1/2 lobster) for one. The desert was also delish. The ambiance is very relaxing and the staff is very helpful informing us about the dishes which contained pork or alcohol. I would recommend this resuarunt even if it is above average prices.. The food is worth it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "71BKWVgnfHCRZxOulggu3A"
  },
  "hTMlmgLYkG2fofQiIGbjoQ": {
    "date": "6/19/2017",
    "text": "We found this place overrated and overpriced. Admittedly we don't go in for shellfish, so the oysters, mussels etc were beside the point. But my husband's halibut was mediocre and my so called sole was really flounder. We were disappointed.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o_mEvUUNRVEmuZ427-DnGA"
  },
  "SP_yYYZu9HQ2RxHSPDry7g": {
    "date": "2/17/2016",
    "text": "Went to Ondine for lunch. Their oysters were very fresh and delicious! The duck and chicken liver parfait is recommended. The mussels were average. The desserts were not noteworthy. I would return for the oysters but it is not on the top of my list for seafood restaurants in Edinburgh.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JwLgaFivbSO0prsju8H9KQ"
  },
  "ycgbz8Bu5Qa8xcRDIREglA": {
    "date": "6/8/2016",
    "text": "A great spot. Very nice dinning room. Service was excellent as was the food. Don't miss this spot",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pddRVpCEpKnMhiAWbkxBmw"
  },
  "gx93Wo6Tg06glTIGGdsMbA": {
    "date": "8/3/2015",
    "text": "Trendy and contemporary Seafood restaurant. Food was fresh and prepared well. Service was excellent.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "eS43VFL0VWGcf3KkkOq_KA"
  },
  "__c9Qhl0JQ-CqEwN1mmM2A": {
    "date": "11/6/2013",
    "text": "Booked late and was worried about getting shafted with a shite table or being chased out early so chose to sit at the bar and it was perfect for what we were aiming for.   People watching galore, and we got to chat away to the staff when we wanted too, however when we were chatting between ourselves we were left entirely alone. Sitting at the bar means that you don't have to worry about the timings set on the sit down tables.   We had langoustines and scallops and bread and STUFF. It was amazing. Great food that tasted amazing. The white wine recommended to us was spot on too!   Really can't help but recommend this place to any couples looking for somewhere casual yet posh and exclusive feeling!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "lr22Y8AqhDdqLa3Wl0s_fw"
  },
  "3GyfEydxSnHeERb5exKvuw": {
    "date": "8/2/2011",
    "text": "The boy brought me here for a birthday dinner, and since the reviews on Yelp were so favorable I was really expecting something special. Unfortunately, Ondine fell far short and our experience was rather less than stellar.   The evening started off on the wrong foot when we were seated next to the only table in the otherwise empty restaurant. Why? It was a bit awkward. Service throughout the meal was aloof and our server was a bit haughty and distant, which, combined with the swish decor, made us feel a bit out of place (and this is far from my first fine dining experience).   The real letdown, however, was the food. Ondine's seafood mastery is touted far and wide, but we didn't glimpse it. My 'potato and leek soup, poached oysters' had oyster, singular, and generally lacked variety in texture and flavor. It wasn't bad, but I only ate a third of the bowl before I got bored. The boy's smoked haddock on toast was good, just good. My main, mixed shellfish with white wine and garlic, was unforgivably gritty and several of the clams were overcooked, giving them an awful, snot-like texture. The white wine and garlic broth was overpowered by a generous helping of parsley. The boy's brown shrimp risotto got the same treatment as the soup - boring, and should have been listed on the menu as 'risotto with brown shrimp' considering the quantity of the shrimp in the dish. The best part of the meal was the strawberry Pavlova.   I really don't know what went wrong. Maybe it was because we ordered off of the pre-theatre menu and the kitchen didn't want to bother with small spenders. Maybe we chose the wrong dishes. Maybe the kitchen was having an off night. Maybe my expectations were just too damn high. Still, sandy, mushy oysters and bland flavors make for a disappointing meal.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UTr4PU6YlsaywlAR1afdlg"
  },
  "tsp9muM6L7d4NZUPgLeVIA": {
    "date": "6/3/2019",
    "text": "We were in town for our honeymoon and did some research on best seafood in Edinburgh and found this spot. The food was delicious and we were treated like royalty by the staff. Honestly, we couldn't have asked for a better dining experience. It's definitely a fine dining spot but if you are in town visiting or you live in Edinburgh and you want good seafood you can't miss Ondine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q3SZYCHE_akWHnet7dl0fg"
  },
  "CruYlwRhX6Jnj2a1rY3PMQ": {
    "date": "6/11/2019",
    "text": "Places don't open up in Edinburgh until noon. If you want lunch at 11:30 a.m., forget about it. You're going to have to wait the half hour, and sometimes more because the UK is on island time.    We arrived at Ondine at 12:05 pm and was asked if we had reservations. I said, no, as we didn't know we'd be coming here. The maitre'd was a little exasperated that we were coming in unannounced without making a reservation. Despite this, we were seated. The prices are a little crazy for lunch. For dinner, I could see paying what they were asking, but I ordered the fish and chips and that was 18.95 in pounds. I saw a lot cheaper fish and chips options, but of course you are paying for the ambiance and mediocre service.  The mushy peas were fantastic, with a little hint of mint in them, but I can't compare them to any other mushy peas because they were the only ones I tried. The chips were great too. The fish I knew I wasn't going to love because I'm not a big fan of battered fish, and had actually asked for breaded. The waiter asked me if I wanted it battered or breaded, and I got battered anyway. I peeled off the batter and ate the fish, which was good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "E9xUuywtEnHDq_ZyUz4gyA",
        "caption": "Photo of Ondine - Edinburgh, United Kingdom. The deep fried haddock. The mushy peas were fabulous.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/E9xUuywtEnHDq_ZyUz4gyA/o.jpg"
      }
    ],
    "user_id": "1xzasDUywrmNg9ONlk1rRA"
  },
  "HDEGLo_BRid6ZwnT8oUHNg": {
    "date": "3/25/2019",
    "text": "Since this place served me the worst meal I've had in my entire life, I feel obligated to give them the worst review and rating I've given in my entire life. Walking in, the decor was outdated, the host was missing, and another couple tried to retrieve their own coats from the coat room after finding no one available to help them. These should have been the first warning signs. Regardless, due to the high ratings on Yelp, and the note we got saying our card would be charged if we cancelled our reservation, we decided to keep our table.   If you're reading this after making a reservation at Ondine: RUN! Now! Whatever cancellation fee they may charge you is far better than the kind of food and service you'll get here!  We arrived for an 8 PM reservation, and our table wasn't ready for nearly 10 minutes after, though the restaurant was almost half empty. We ordered drinks and starters, and our mains. The drinks came quickly, the starters took a while. And this is where things really went south. After our starters, we ordered a second round of drinks... and then waited... and waited some more. Finally, a little after 9 PM, we flagged down our server and asked about our main course. It finally came out, more than an hour after we had placed our initial order. The food was terrible. My boyfriend's langoustine was just ok, and was 30 for 6 pieces. I'm visiting, so I don't know if that is the standard price, but it seems expensive for just \"okay.\" I also had a 20 risotto, and the rice was underdone and still crunchy in the center. The whole thing was pretty inedible, and the portion was small and poorly plated given the cost.   What made the experience 10x worse is that the entire wait staff seemed to be ignoring us. Nobody stopped to ask how our meal was, or offer a refill of water. Honestly, most of the staff seemed to be avoiding eye contact or talking to us as they walked by. By this point, there were as many staff as diners in the restaurant, so there was no excuse for the inattentive service.   Finally, once we flagged down our server and asked for the check, he asked if my meal was okay after seeing half the risotto on the plate-- I said it was good. Because what else are you supposed to say at the end of your meal, after you've already wasted over an hour and a half at the worst restaurant you've ever been to? We were ready to get out of there. I even tipped like an idiot because I'm American and do so out of habit. Our bill was over 100 before tip, and I regret every pound I spent here.   I'm only spending 3 nights in this city, and I'm pretty sad that this dump took up a dinner slot on my itinerary when there are so many more amazing restaurants here. Either way, it's a story to tell, and I hope everyone reading this will be warned of the poor quality.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f-1tbz8d7nqQUsmaB8YyAg"
  },
  "76SG19RaueLgj5Q85rY6ug": {
    "date": "6/10/2018",
    "text": "VERY disappointing experience, from food to staff to pricing. Just overall one of the worst meals in two weeks of travel, and *of course* this was our anniversary dinner.  We did our research, as always. A handful of restaurants kept popping to the top of our lists, but we didn't actually knuckle down and make a reservation until much later.  I made it a point of adding that we were celebrating our 20th wedding anniversary in our request. I mean, *we* thought it was something worth celebrating, and though we weren't expecting balloons and confetti and champagne by the buckets, it would've been nice to have been acknowledged by someone other than the hostess (who was the only bright spot to the night, by the way.)  We were seated at a table overlooking Victoria Street, and our hostess congratulated us on our anniversary, wishing us a good night as she departed. It all went downhill from there.  Our waiter - who is also apparently the wine guy (he's the one who's pictured in a gigantic frame by the kitchen, leaning over a glass and mugging for the camera as wine is being poured in) never bothered introducing himself, asking if we had any questions, or offering to share the night's specials.   He came over, stood by the table for a half minute without talking, and then finally muttered something along the lines of, \"what'll you have?\" My husband ordered a bottle of wine, and the waiter guy walked away without a word. We were going to place an order for appetizers but didn't get that chance.  The waiter, meanwhile, was having a grand time laughing with others behind the bar and making it a point to fawn over another couple at a table not far from us. Again - not looking for the fawning-type attention, but come ON! At least crack a smile when we smile at you!  Our second interaction with the guy was just as unpleasant. He brought the wine to the table, made a big production out of pouring a spot for my husband to sip and approve (all the while looking like he was so incredibly bored out of his mind), poured our wine and walked away - again, without asking if we were ready to order.  Third encounter only came because my husband flagged him down. We told him we were ready to place our orders and didn't even acknowledge that. He just stood there, staring at a space just to the side of our faces, immobile as a statue.  Thoroughly annoyed by then, I decided to play that game. So I sat there staring right back at him, wondering how long he'd continue to play a pillar of salt before acknowledging he had a paying guest in front of him.  Almost 90 seconds. I kid you not. When he finally deigned to make eye contact, he bit out a curt, \"You said you were ready to order. So...\" and he made this hand gesture like, \"spit it out, already!\"  I don't know why we didn't just pay for our wine and get the heck out. I really wish we had. I was shocked to run into someone so rude in the city, and even more pissed off to see that he didn't treat any other table this way. We did nothing to get this sort of treatment, and really shouldn't have stood for it.  But, we didn't get up. We didn't let him know we were annoyed by his haughty attitude. We ordered our starters (asparagus and a soft poached egg for me; fish and shellfish soup for him), and lest we never see the waiter again, hastily ordered our meals, as well (Lemon Sole Meuniere for me; Brown Crab Risotto for him).  At least I know my husband enjoyed his soup. It was hot and had good flavor, served with small bowls of cheese and bread crisps. My appetizer wasn't at all what I had hoped for - the egg was overcooked (soft poached is one of the trickier things to achieve when working with a heat lamp, I'm finding) and the asparagus was limp. I didn't even finish half of that plate.  Our food was delivered to the table by the only other friendly person we encountered: an overworked but still friendly waitress. The best thing about my main was the chips - they were perfectly cooked so that they were crispy on the outside and fluffy on the inside. Much as I wanted to, I didn't finish them. About halfway through the fish (it was a large serving, I'll give them that), my stomach started to cramp up.   I'm definitely NOT saying that there was anything wrong with the fish - I was fine all night and for the rest of our stay in Edinburgh - but I did start to feel queasy at the table, and didn't want to push to eat more than necessary. So, that plate went to waste, as well.  My husband and I had decided early on that we were going to forgo dessert at this place in order to find a sweet shop that was more welcoming and inviting. And yet, when we once again flagged the absent waiter down to ask him to clear our plates, my husband surprised me by ordering the tart to share. Again, I wasn't feeling so hot, so I took one bite, but my husband did enjoy it.  Really surprised by our evening, given all the love this place gets on Yelp and TripAdivsor. It was just a waste of good money.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Cad2ANoipZr9cAeNvjr_zg",
        "caption": "Photo of Ondine - Edinburgh, United Kingdom. Treacle Tart slice",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Cad2ANoipZr9cAeNvjr_zg/o.jpg"
      },
      {
        "img_id": "FXTiFnZko79LZQZUiaA7vA",
        "caption": "Photo of Ondine - Edinburgh, United Kingdom. Brown Crab Risotto",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FXTiFnZko79LZQZUiaA7vA/o.jpg"
      },
      {
        "img_id": "2bFI8z7VidPc5cH75P7oQA",
        "caption": "Photo of Ondine - Edinburgh, United Kingdom. Lemon Sole Meuniere and chips",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2bFI8z7VidPc5cH75P7oQA/o.jpg"
      }
    ],
    "user_id": "-ZqPTpx9TyyvdAWbajdilA"
  },
  "6lYqykOR1zSn1JKBE6wqzA": {
    "date": "9/25/2018",
    "text": "Ondine serves up mouthwatering fresh and innovative seafood dishes in a chic, modern atmosphere right in Old Town. We started with 6 oysters (18 GBP), and all of them were unique -- some robust and briney, others fresh and tangy. For mains, we got the brown crab risotto (19 GBP) which was funky and stuffed full with crab, and the monkfish (26 or 28 GBP). Both were tasty, although the presentation of the risotto was a bit subpar (looked a bit like oatmeal) and the portions were on the small side (but hey, I'm American!). We rounded out the meal with the cheese plate (11 GBP) and the treacle tart. The tart was lovely, not overly sweet, although the cheese plate was a bit of the miss for me -- the brie and one of the hard cheeses were both completely devoid of character.  Overall, Ondine was a great fine dining experience for our last night in Edinburgh. I was a bit disappointed with our service -- our waiter seemed quite aloof and brusque that evening (not just with us but seemingly with all the tables in our vicinity) but everyone else we interacted with was quite nice!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-0ryDHRHIl3n6_NHvgF17g"
  },
  "FcovwXaP0ZVSvY3GjUfDGQ": {
    "date": "5/29/2019",
    "text": "Did our research and were pretty excited. Extremely over rated. This may also be first negative review I ever left. The risotto was pretty nasty and rice under cooked. The squid tempura tasted no better than a late night fried fast food take out spot. Our waiter, who I guess was also one of the managers, should not be \"serving\" people. Nothing about this place justifies the cost or the category of fine dining",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nXvbNcW6H5-W-hnhlMcHjA"
  },
  "crbHLjLU4p2g8jZzPZlyZQ": {
    "date": "7/13/2019",
    "text": "Kind of average, I have to say, which is disappointing because this is the one restaurant that we researched and booked in advanced prior to our trip to the U.K. It's located right in the middle of the Old Town, which is exciting, but appears to be part of the Radisson Hotel, which is not so exciting. Walking it the decor was somewhat strange. While I liked the floor to ceiling windows, which gave a nice, second level view of the street below, the interior was dominated by a curved bar area that was decorated with black and white tiles and a huge neon sign on one end. It was very reminiscent of a 1950's American diner. As for the food.. it was okay with the exception of their fish soup, which, to their credit, was excellent. The other dishes were just sort of middling. For starter we got brown crab crumpets, which can be described as shredded brown crap piled on top of a crumpet with a dollop of aioli on top. It was just okay, but much less interesting than a well executed Maryland crab cake. For an entree, I got the sea scallops, which was literally two scallops and nothing else; no vegetable, no starch, nada, 14. Seriously? And finally the service was kind of stuffy. Not that impressed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YFZLBlnojAFjdii1ufdNXA"
  },
  "LG0K-JR_hOK3zoldNvE2Ew": {
    "date": "5/8/2018",
    "text": "A place I've been wanting to try for ages. It seems you have to book several days/couple of weeks in advance for the weekend. A good sign I guess.   The food was top notch. Lovely oysters and scallops to start with and amazingly fresh tasting. I don't know if I had built my expectations up too high beforehand but was a little underwhelmed. But on saying that can't criticise any point really. Lovely setting/atmosphere. Good service and great food. The table next to ours had ordered the fish platter which looked stunning. Maybe I just left feeling just a bit jealous. A little pricier than others but would probably rate the quality of food to match the cost.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5y_4KmkywV9DMSFyoTcYdA"
  },
  "-n0lQqndKTYcrQDiWWceLg": {
    "date": "6/5/2018",
    "text": "Great restaurant, great atmosphere, great food.  The oysters here are so fresh with a bit of sweet taste, grilled scallop is awesome, though a bit too much for me with sausages. I really really want to try the fruit of the sea, basically a full rack of different kinds of seafood, looks like there is another cooked version, also looks delicious! If I bring my friends to this place one day, I will definitely order one of the two, or both!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fWM3omRSe5N4zqrCGZVPMw"
  },
  "65p-rR7gaVOEeXhNAgkUqg": {
    "date": "8/24/2018",
    "text": "Went to this restaurant tonight. My friends had been before recommended it. We were sat at the \"oyster bar\" which was really just a fancy word for the bar.   However the side we sat in contained the dishwasher so all we saw were dirty glasses and servers and what appeared to be managers drying clean ones. Our waiter was not helpful and at times just rude. He never asked if we wanted more drinks. We had to track him down and ask him. Water as well.   Our meal took over 1 1/2 hrs. When inquired what took so long, the \"manager\" basically blamed us for ordering a side as a starter and that thru off the server while putting in the food order.   When it finally came, the food was good but couldn't get over the other negatives. One star because of food but otherwise would have given zero if it was a possibility.   Maybe they didn't care because they knew we were visiting but I would never come back or recommend to anyone",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "bdVcavX_zCku5512pp5g7Q"
  },
  "32p-fVdjHv_TetorLigx8A": {
    "date": "12/6/2017",
    "text": "It's hard to pinpoint with some restaurants why they don't hit the spot. Some, it's alarmingly obvious - the service is surly and the food is poor. But with Ondine, that feels a little unfair.  The service wasn't surly, it was dutiful and prompt, but just lacked warmth and sincerity; and the food wasn't poor, just average and underwhelming. I don't particularly like to write negatively about a restaurant and it's not easy contradicting the opinion of a great chef like Tom Kitchin, who recommended Ondine in 'Where Chefs Eat - The Ultimate Insiders Guide'. The irony is, I couldn't get a table in his restaurant, so settled for one of his favourites instead. There you have it. If there's a waiting list, it's for a good reason.  Ondine has built a reputation for its fresh shellfish which was a huge draw for me. I can't imagine ever not starting with oysters if they are featured on the menu; and if they're on a menu that states Oyster Bar Happy Hour, then that's even more of a draw; happy days indeed. Such a pity they limit you to a dozen each.  As with most aquatic entities like bivalves, they speak for themselves - or should do at least if sourced well - with only subtle enhancements necessary so as not to divert from their natural properties. Oysters ceviche packed just enough of a punch to lift this little 'Loch Fyne' up without drowning out its sea breeze nuttiness. Crispy oysters in panko breadcrumbs were also very good - the breadcrumbs light and golden and the oyster mayo dip, silky and subtle. But, tasty as they were, cooked oysters can never retain that immediate impact for me; the breadcrumbs are an unnecessary distraction and I long for that initial odour of the ocean. The young twenty-somethings on a date, perched next to me at the Oyster Bar however, couldn't get enough of them. I suspect their palettes were not quite ready for 'au natural' but the joy of eating oysters together in a smart restaurant obviously felt sophisticated and sexy. It is, of course, both of those things, whichever way you decide to eat them.  A 2 course pre theatre menu at 19.00 represented good value for the dishes featured so we opted for that, although our server didn't seem overly impressed when we ordered it at 6.20pm, just before the 6.30pm cut-off. It then crossed my mind .....Happy Hour, Set Menu, House Wine......perhaps we weren't his favourite kind of customers. In retrospect, we should have gone off the a la carte, because if Tom Kitchin is right, 'the shellfish is of fantastic quality' and our oysters had already hinted at that.   Starters on the set-menu may have sounded appealing, but duck and chicken liver parfait was too sweet to sit alongside apple jelly and brioche, the sweetness needed toning down, not bumping up. And smoked haddock chowder was all smoke and no haddock; it lacked refinement and was way too thick and starchy, grateful no doubt for the support of the accompanying cornbread which was contrastingly delicate and light.  Mains were equally disappointing. A small portion of risotto makes no sense on a set menu. It's an inexpensive dish and set menu restrictions or not, a restaurateur can afford to offer more than a starter size portion. However, it would have sufficed had it been a good risotto. The brown crab was in hiding, and the butternut squash was hard and on guard. In contrast to this, the size of my 'fish of the day' was almost intimidating. A huge filleted plaice in burnt (as in not browned burnt, but burnt burnt) brown shrimp & nutmeg butter, looked like it had been slapped on the wrong size plate. There wasn't any room for manoeuvre, let alone garnish, but that didn't matter because there wasn't any; not even a smear or shred of anything, just this big old slab of fish. Strange how it never occurred to them how unattractive this looked or where a side dish would sit if their clever avoidance of any garnish did have the desired effect. If I was working on the pass I think I'd have to flag this with the chef, even if he is Roy Brett. How odd it must sound, me griping about the size of the plate, not the portion! Sadly, the portion, however large, didn't deliver either. The fish was watery and bland and the burnt burnt butter, with no hint of brown shrimp, did nothing to lift it. I felt my heart sink a little; I so wanted to enjoy it to erase any judgements of its initial appearance, but it wasn't to be.   I'm not going to go there with the decor, I'm quite sure most people would love it. The sleek, chic, monotone interiors and elevated position gives the place a sense of drama I suppose. Would I go back? No. But if you do, perhaps heed Tom's advice - stick with the shellfish. And my advice, for what it's worth, don't stray from the a la carte path.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kQcs4rjv1Dvqy4Kg3Xrh0A",
        "caption": "Photo of Ondine - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kQcs4rjv1Dvqy4Kg3Xrh0A/o.jpg"
      },
      {
        "img_id": "Di7TuZQ2Ud29Dd9hsTmvVg",
        "caption": "Photo of Ondine - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Di7TuZQ2Ud29Dd9hsTmvVg/o.jpg"
      },
      {
        "img_id": "86-x8WC2buXJ1Patmzyk-Q",
        "caption": "Photo of Ondine - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/86-x8WC2buXJ1Patmzyk-Q/o.jpg"
      }
    ],
    "user_id": "TH2-tnqMKgr3Cylx4VIxuQ"
  },
  "HVETaw-UKKRpKk-K-_Jq4Q": {
    "date": "9/29/2015",
    "text": "At Ondine, when you see food, eat it.  One of Edinburgh's top seafood restaurants.   Elegant setting, properly appointed, pressed linens, and well-dressed patrons ready to get their hands dirty diving in to piles of Scotland's best seafood.  Straight to it, uber fresh cold water oysters are to die for. 4 to 6 different species, each with its well-defined salinity and incredible creamy texture like nothing available in the States. All show a very clean oceanic finish. It's liquor like sea water accented with just a squeeze of lemon.  Do not pass on the roasted shellfish platter. New Haven lobster claws, barely warmed through oysters, roasted Dunbar crab (similar to Florida stone crab), Mull scallop in shell, piles of east coast cockles, sweet, succulent razor clams, plump, fatty creamy Shetland muscles, and tender Tarber Langostines all cooked in rich creamy Scottish butter, a splash of wine, and parsley.  A mountain of seafood for 2 to 4 to share. Simply put, outstanding.  Each item is cooked separately to proper doneness then assembled together for serving. The simple preparation brings out the best flavor of each shellfish.  Still craving more? A plate of grilled scallops. Presented and still attached to their own shells. A broad bean puree adding a vegetal touch that heightens the sweetness. Sausages of pork and offal adds a subtle metallic flavor that accentuates further the clean oceanic characteristic of the scallop.  The lemon sole, gently crusted with breadcrumbs lemon peel capers and parsley then fried. Crisp on the outside, moist on the inside. Sauteed brown trim adds a deep \"shrimpy\" flavor that greatly enhances the flavor of the fish.  Finally a Scottish classic, haddock and chips. What to say. Perfectly cooked. The classic minted pea puree further enhancing the mild flavor of the fish.  Very well chosen selection of European, old world wines at very reasonable prices.   Average bottle price 40.  Extremely friendly, proper, efficient and accommodating service.  Reservations two months in advance required.  In a word, wow!",
    "rating": 5,
    "rated": {
      "funny": 12,
      "useful": 13,
      "cool": 14
    },
    "photos": [
      {
        "img_id": "umrxiiSebcHXuA_HK2PdcQ",
        "caption": "Photo of Ondine - Edinburgh, United Kingdom. Port hilly oysters from Cornwall.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/umrxiiSebcHXuA_HK2PdcQ/o.jpg"
      },
      {
        "img_id": "FrSOAvJ8ft_vPBDfLuYIig",
        "caption": "Photo of Ondine - Edinburgh, United Kingdom. Roasted shellfish platter (lobster, oysters, crab, scallop, cockles, razor clams, mussels, langoustines)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FrSOAvJ8ft_vPBDfLuYIig/o.jpg"
      },
      {
        "img_id": "NPkZ7Sl91TrBXWksFY-fvg",
        "caption": "Photo of Ondine - Edinburgh, United Kingdom. Grilled day boat diver scallops in shell charentaise with pork liver sausage and broad bean sauce",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NPkZ7Sl91TrBXWksFY-fvg/o.jpg"
      }
    ],
    "user_id": "oeAhRa8yFa9jtrhaHnOyxQ"
  },
  "cLGkOaznzCSrMVN9psY9bg": {
    "date": "11/5/2017",
    "text": "I had the set menu with baby grill shrimp on the fish, the soup, and blueberry cake.  The fried calamari was good also.  My friend had each of the oysters which he enjoyed a lot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aBGwL88bX41_o63ppmwbQA"
  },
  "KxfbpyGN_ql4d06uMThXBA": {
    "date": "7/5/2016",
    "text": "Ondine was just what we were looking for dinner - seafood! I'd booked about a week before and could only get a quite early time (5.45) but that actually worked perfectly for us so that wasn't an issue. The restaurant is upstairs next to the G&V and is a bit smaller than I expected but really nice decor - classy but not too over the top, so you don't need to worry about dressing up to go here.   They offered us the a la carte menu as well as a pre theatre which I didn't realise was available - it had nice offerings on it but we ended up opting for the a la carte just because there was so many more options. The waiter was really helpful when I asked for some advice as I was torn between four dishes - he told me which would work best together for starters & mains and I have to say, he was totally right!   I had potted dressed brown crab which came with mini crumpets and was beautifully presented in a little jar. There was actually a tonne of crab as well, a very generous portion and just delicious.   For main I had a fillet of sea bass with asparagus and beans. Again, heavenly - a perfect sized fillet with lovely skin and really tasty. A side of baby new potatoes was perfect and I was perfectly stuffed after this! We didn't have dessert and just headed elsewhere for some beers but this was such a lovely meal that I'm sure I'll be back soon.   It is on the pricer side but it IS Edinburgh and this restaurant is right in the heart of it all, plus the food was amazing. So it's totally worth it.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "6gDc1L-5oKeqhHmk4korZw",
        "caption": "Photo of Ondine - Edinburgh, United Kingdom. Side of broccoli and potatoes",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6gDc1L-5oKeqhHmk4korZw/o.jpg"
      },
      {
        "img_id": "f3b3WI0eA9WFrR6_MoRZiQ",
        "caption": "Photo of Ondine - Edinburgh, United Kingdom. Sea bass",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/f3b3WI0eA9WFrR6_MoRZiQ/o.jpg"
      },
      {
        "img_id": "1ZPwMTCBVPd_5L-3KG2_Ig",
        "caption": "Photo of Ondine - Edinburgh, United Kingdom. Potted crab",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1ZPwMTCBVPd_5L-3KG2_Ig/o.jpg"
      }
    ],
    "user_id": "6EWIu6Ea04qcFAL3XSalvQ"
  },
  "zJdL7PJoA9XMkPDNxYEivQ": {
    "date": "7/5/2016",
    "text": "Well this place was a bit special. A seafood joint with a real hint (actually a full on hoof) of class through their entire operation. Having only been able to get a 530pm reservation it made sense to dine at this time (I'm getting old...) so as the night was full ours head.   First things first a warning - this place is expensive and things quick add up. Without looking too much into it when booking the starters are all 10 and up with mains more. Sides are a fiver each and even the cheapest wines by the glass are on the pricey side. So yeah make sure it's a special occasion kick of place but you'll be well rewarded for the cost.   Highlights were the tempura squid to start, which were followed by the scallops and sausage (a strange combo to me anyway but something that I enjoyed)  The only downside was that at 7ish they brought our bill over without us asking as if to rush us out (although we were still thinking they maybe got it wrong and meant it for another table...) - but by this time we were so stuffed that dessert was never going to be a goer anyway.   Very impressive, a great find!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "iOKLICySxmBqQOLFg5UCfw",
        "caption": "Photo of Ondine - Edinburgh, United Kingdom. Scallops and sausage - yum!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iOKLICySxmBqQOLFg5UCfw/o.jpg"
      },
      {
        "img_id": "eUeFEmYAE2_iSu99vjG69Q",
        "caption": "Photo of Ondine - Edinburgh, United Kingdom. Tasty tempura squid to start",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eUeFEmYAE2_iSu99vjG69Q/o.jpg"
      }
    ],
    "user_id": "SdyaF3_mFMdCig_25qW7TQ"
  },
  "_rBYR9F6M7IfpnhiwFwHTw": {
    "date": "11/27/2018",
    "text": "To start, the service was incredible. They are very attentive and personable. The food is well worth the price. The wine selection is great and the g&t was will mixed. Would go again in a heart beat",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dsSBfbw4MmJqC_y_Amtm-g"
  },
  "SlqfA24X-Ule-SzwBLHc0w": {
    "date": "9/18/2018",
    "text": "This restaurant is another over rated seafood restaurant. My smoked salmon appetizer would have been tasteless except for the capers. I had the fried haddock as an entree. It was ok, but greasy and had not been filleted properly. If any restaurant in Gloucester, Massachusetts had served this, they would have been out of business in a year. The wine was very good as were the French fries. Sad state of affairs when the best thing you can say about a $75 dinner is that the French Fries were good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pg7AeHiE3FeBn2yxptZQKA"
  },
  "Pw5TiVHm-SQa672gsaLEgQ": {
    "date": "12/28/2017",
    "text": "Wonderful place for a seafood dinner. Great selection, cooked to perfection. Plus they have a good wine list.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9uRP6mDiKj2eGyd5gN1iWg"
  },
  "FcZEHWW8xCx4LEVYA8QVYg": {
    "date": "9/27/2016",
    "text": "Omg went there for happy hour and thought we would take a seat at the bar, PLEASE NOTE EVEN BAR SEATS NEED RESERVATIONS OR YOU MAY NOT GET ONE.       the drinks were delicious and the crab risotto might have been the best one I've ever had. The service was stellar. I had fried oysters that were sinful and I usually don't like oysters. My husband ordered beet and goat cheese salad. The beets we're golden and red and the goat cheese was whipped. I don't usually like this combination either but if all salads tasted like this....id eat beets. Dessert was so worth it.       I hope to be back in Scotland and I will eat here again. Just magnificent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "D224RQ9WRnWmndZJiQ-kAA"
  },
  "3Mu17JyTfbKut19H41_6oQ": {
    "date": "6/16/2015",
    "text": "I'd booked Ondine based on on-line reviews and, as it was my girlfriend's birthday, I was hopeful that we'd have a similar experience.   Thankfully, there was no need for any concern as the restaurant more than lived up to expectation.   We opted for the lunchtime set menu (19.95 - 2 courses, 23.95 - 3 courses), both choosing Seaside Gin Cured Salmon with pickled cucumber & wasabi mayo, followed by Monkfish Tempura & then we shared a portion of Brie with oatcakes & quince jelly. To accompany this feast we had a lovely white Rioja (the name of which escapes me as we've just consumed said bottle...)  The food was fabulous. The flavours in the salmon were stunning and the subtle warmth coming through from the wasabi complemented it perfectly. The colours on the plate were also a wonder to behold.   The next course, the monkfish tempura, was the real standout. I love monkfish and its meaty texture and it was ideal in this dish. Crisp and light tempura batter surrounded it and the fish was beautifully cooked. Those flavours added to the ones in the Vietnamese salad accompanying proved to be a stunning combination that had my mouth watering throughout.   To finish, we shared a lovely Brie with oatcakes & quince jelly. Sometimes eating an oatcake is like trying to swallow a dry coaster but these were lovely. The Brie was also a fitting way to round things off. (I realise I haven't mentioned the lovely bread to start or the post meal chocolates...!)  A wonderful meal that was enhanced by great service. I'll definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "hnQacQsSOeWp5epf9WB_7w",
        "caption": "Photo of Ondine - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hnQacQsSOeWp5epf9WB_7w/o.jpg"
      },
      {
        "img_id": "aTO1_dXhb1w74npmxBspjg",
        "caption": "Photo of Ondine - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/aTO1_dXhb1w74npmxBspjg/o.jpg"
      },
      {
        "img_id": "RwgdwQ7zyXhfNCU0V6VfXg",
        "caption": "Photo of Ondine - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RwgdwQ7zyXhfNCU0V6VfXg/o.jpg"
      }
    ],
    "user_id": "Du5AG-x2cS41WysUpiCc1w"
  }
}