{
  "-tuI-Y8gwlS-3Vj97wEi2g": {
    "date": "5/27/2016",
    "text": "Go here for the beer not for the food. The fish and tartar sauce was really bland, we were disappointed. The women's toilets were nearly out of paper, only one out of four stalls had paper. However the server was good. Overall there are much better places to eat in this city.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UqR5ike8TR6gQTwYdyuwkQ"
  },
  "E_AnqP5VbnTLu8Wf3GV3VQ": {
    "date": "5/7/2016",
    "text": "We had soooo much fun at The Beer Kitchen. We sat at the bar, and the woman tending was such a hoot. She REALLY knows her beer. We got lots of expert commentary. But she's also really funny. I am hooked on the rum finish..or, at least, i would be if I could get it here in California. I asked about The Macallan ice ball maker, so she made us one. That was fun to watch. Of course, I had her pour a Macallan over it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "odwGU9-F9ZMl1XBz9Pwg4g"
  },
  "4Li4t1ZPJ2oM7bAq4woB0A": {
    "date": "8/10/2015",
    "text": "Was walking around town looking for a light lunch with the boyfriend and his parents a few weeks ago. Being the eagle-eyed eater that I am I noticed a new joint on Lothian Road as I walked by and thought we should give it a whirl. It was lunch on a Sunday and only their second day open.  As others have mentioned, the interior is quite nice. A very nice design with open spaces and a sort of warm-yet-industrial feel about it. I loved to see so many Innis and Gunn beers because it is definitely one of my absolute favorites.   I had the hot smoked salmon sandwich with a cup of roasted red pepper and tomato soup which was just lovely. I thought it was a great light lunch on super tasty bread. The soup was also great which is hard to come by! A good soup is tricky to make.   Walked by on Saturday during first weekend of Fringe and it was jam packed with people so even though they've only been open a few weeks people have already flocked there in great numbers which is a good sign! I am excited to go back and try brunch and more Innis and Gunn definitely.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "h7kFt1px7Z5A5e92X6aMvQ"
  },
  "ZcFzCsWqS-FqTIjK8-FyVw": {
    "date": "9/20/2015",
    "text": "I finally made it to the Innis & Gunn Beer Kitchen on Lothian Road a couple of months after it had initially opened. The place is nicely decorated and me and Rayan D. sat on the leather chairs in the front area. A waitress approached to get my drinks order, so I tried the first beer on the list: a lager with a description of fresh from the brewery, unpasteurised and bursting full of flavour. I personally didn't think there was a massive amount of flavour, but I was glad to have tried this one as a half pint size 2.40 (you can also get full pints or 3/4 pints).   My initial impressions were good - extensive list of great beers, ciders, wines - perhaps a beer cocktail next time?  The Beer Kitchen serves food as well: breakfast, lunch and dinner are served and the menus looked good.  My next visit will probably be quite soon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "yuFHrb8YQtVuzu0eEXvJtA"
  },
  "6y07HxdBOGao8aIgtLXJ9Q": {
    "date": "6/1/2017",
    "text": "Excellent beer selection. The fish and chips was fantastic. Very fresh. Brown sauce great with the fries.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o-fdyH2qd4EPcCzmAf0ZcA"
  },
  "_ct-2a7K85vvhEFGUWv_PQ": {
    "date": "10/24/2015",
    "text": "I've been a long-term lover of their beer and was when I heard they were opening a venue on the street I live in, well, I was very chuffed! I've been in for drinks twice and one meal. The selection of beer is just alright. Of course, I&G features prominently, but I feel they could have a wider selection of beers on tap (compared to Red Squirrel or Hanging Bat for example).   Something that really bugged me on a Thursday late afternoon - I was meeting two people for a beer at 4pm and when we arrived we were told we couldn't have a booth as they were for eating only. They were all empty. I fought our corner and got one in the end, however, it was reluctantly given.   Positive time - the food is very nice. I went with my Mum and there was one fault - the carrot and coriander soup had enough coriander in it to flavour 30 thai curries! We sent it back and they were very apologetic and admitted it was a wee bit strong. Anyway, that aside, my burger was spot-on and Mother-dear likes hers too.   The staff are generally very helpful (despite the booth thing) and keen to have a chat if you want it.   There's one over-riding thing for me though. The place is soul-less. I don't actually want to go there for a drink. I've been on two occasions just for drink with pals now and won't be rushing back. Very little atmosphere. It's all a bit clinical. Some may say too corporate.   Anyway, it's perfectly pleasant, I think I was just hoping for more.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "DdaPc_xbu6or0qcTPVd1bQ"
  },
  "d-20JJ7r5YR2JdNIw-KJbg": {
    "date": "9/14/2015",
    "text": "A nice new addition to Lothian Road!  The Beer Kitchen is a great spot for a Friday evening drink. I've yet to try the food but the bar menu was absolutely mouthwatering (something about crab on chips? I'm sorry I couldn't concentrate once I started reading...) We just sat by the window on a Sunday afternoon with a pint and the paper.  There's obviously quite a bit of I&G served...no surprise there.  Overall we liked it. The food area looks swish, I can't wait to try it out. While the drinking area is less formal and a bit more mish mash, it tends to fill up on a Friday night so you have to push your way through the crowd. The wooden look to the place is nice and there seems to be a bit of a rustic feel to it, though modern, clean and reasonably sophisticated.  When I was in and it was quiet the staff seemed a bit all over place, but that was early days and they seem to have improved since then.  Overalll a nice addition, I'll have to give it a proper look!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "KPY6FvT6h-r0W0HAC1Buag"
  },
  "QYdkMPaGgKllHtsvMqcOgg": {
    "date": "7/27/2015",
    "text": "Hard to give proper review as a) it was opening night, so it was packed to rafters with people keen to check it out & b) we didn't have a chance to eat.  Great to have so many I&G beers on tap, but not a huge amount of seating and although there were lots of people serving, it was quite hard to get to the bar to get served!   Food is only served in the upstairs seated area so we couldn't just grab a bite but not sure if this will change once they're more established.  Decor is really lovely, lots of wood paneling and leather seating with lots of barrel accents throughout. My little stool had a handle made from and old barrel.  We found a little alcove in front of the fireplace to sit which was great and felt like we were away from the bustle.  Look forward to heading back to try the food!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "J6E6NSpJqMBib9ydbchicg"
  },
  "41HbDzSuoXz4uMmKoZQ6BQ": {
    "date": "10/24/2015",
    "text": "First time I have been here. Friends suggested it for lunch and booked a table as it was Saturday lunch time, glad we did as it was full for food otherwise.  It was a nice venue with a lot of wood that made it have a very homely natural feel. Seemed to have a slightly older crowd that I was expecting. I thought it would be more hipster than from what I had heard so was pleasantly surprised.  The menu was quite limited but had enough choice for me. Unfortunately my friend can't eat gluten or dairy and there were very few things she could have. As the menu want marked up we asked the staff what she could have who was happy to give us the low down. Having been told the salad was ok with the sauce on the top she ordered that. When it arrived there was mayonnaise through which was very disappointing. What I would say is that the staff without prompting saw she hadn't really eaten it and asked what was wrong to which she explained, she was offered alternatives but declined and again without prompting they took her good off the bill which was very good of them. It turned what could have been a downer onto the meal into an error that was fixed with no fuss.  For the rest of us, or food was delicious. The chips where crispy on the outside and fluffy on the inside which was perfect. The burger was very tasty, would recommend it if you go.  Beer selection as you would expect (being owned by Innis and Gunn) was very good. They also serve a selection of sizes so I was able to have a schooner (2/3 pint) which is a better size for me.  Overall I would go there again although I imagine in the evening it could get very busy with limited seating, but I will have to try it and see!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "-XIjDFAkT8NoHWeqBLlUhw",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom. Cool artwork of Edinburgh",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-XIjDFAkT8NoHWeqBLlUhw/o.jpg"
      }
    ],
    "user_id": "QvE5C4vVJ4R6o54bf9oYVQ"
  },
  "8DF0O-5sI3w9Ta9OOK25gw": {
    "date": "10/24/2015",
    "text": "Sat at the bar...the bartender from Australia, she was just the perfect person to experience this new place for us! Recommended the perfect beers...and the food was pretty good too!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VVGQAjBpnB5NASW9N82rJA",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom. Innis &amp;amp;Gunn...this is their stout, and it&amp;#39;s made from whisky barrels. Bottom line...DAMN GOOD BEER!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VVGQAjBpnB5NASW9N82rJA/o.jpg"
      }
    ],
    "user_id": "QUe4gTuam3hka6MSG7G5Ww"
  },
  "nme3qs-7nj_Cvd0JinFImg": {
    "date": "7/30/2016",
    "text": "Came across this place by accident - great selection of beers as the name would suggest! They even let you try before you buy which is brilliant, as long as it's on draught. Staff were friendly and informative and the space was clean and modern. They even do gluten free beers which are hard to come by, so brownie points there!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "p0k5gG4mpo7JMWozbp4z1A",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/p0k5gG4mpo7JMWozbp4z1A/o.jpg"
      }
    ],
    "user_id": "3u3pn0yilsgGJkzrThc5yQ"
  },
  "EAG7-iT-BU9P6NxVdhwL1Q": {
    "date": "12/13/2016",
    "text": "Great burger! Awesome selection on the drinks menu, friendly staff, cool decor! Will definitely revisit!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AOzWGRajSYJX12N6BRR-hQ"
  },
  "3vUje--J-EWL7JBDXcr8Tg": {
    "date": "5/26/2016",
    "text": "Most gastro pubs aren't actually gastro pubs. It's almost as if they use the name to pretend they have good food and drink. But the Beer Kitchen is a True gastropub and the beer from Innis & Gunn is truly spectacular. It is one of the only places in town you can find the beer on tap and you can sample the top beers like the Original Oak aged Stout, the Toasted Oak IPA, Whiskey Finish and Rum Finish. Take it from me, a beer sampler - these are some of the finest beers I've ever had. Innis & Gunn doesn't do a ton of beers but the ones they do are fantastic and one par with beers 4-5 times their price in the states. The ambiance and menu is also solid, but that's not what we are here to talk about. Only beer. Which is tremendous beer, there's no doubt about it. It almost has a Donald Trump confidence to it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZakXMnPmK6GESBS-zC_eAg"
  },
  "2hv-w0RRNBE9CSGgl85k-g": {
    "date": "5/7/2016",
    "text": "Fabulous!  I don't even like beer, but this beer was fantastic!  Our server was a friendly (and adorable) scotsman, who made us feel right at home.  The food was great, open late... Just a really fun place to have some drinks.  Only downside is that i may never go back to drinking american beer again.   Definitely worth checking out the next time you're in edinborough",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wcI4Z_4dLqtbJ7OJzIIB2g"
  },
  "90qktSUu5ZKoCVViS_cixw": {
    "date": "6/24/2016",
    "text": "Love coming here! Best place we went to in Edinburgh. Their lager was straight from a fresh keg and outstanding. Best lager in town by far. Loved their Scottish egg! Definitely recommend coming here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZSQj-hg06mUHAc9_mBZexw",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZSQj-hg06mUHAc9_mBZexw/o.jpg"
      }
    ],
    "user_id": "Vi6Pu3WIeX2H2zQNOkJWdg"
  },
  "cjJZ0qK_IEH3CsgVxqbduw": {
    "date": "10/15/2015",
    "text": "Poor-to-average food in tiny portions at a vastly inflated price. Seriously,  who wants to pay 12 pound for okay steak and not even get chips? Beer is good,  though similarly extortionate.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "7F6hIwrbnqrULp22lSLW6Q"
  },
  "hFlnyYMftElB53TwX5vWXw": {
    "date": "3/12/2016",
    "text": "Loved the Lamb shank! It was very tender and smooth! I also really enjoyed the idea to have not too many dishes, and focus on the beer pairing with food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gCi47MWqCvfFD9U0dFQ3FQ"
  },
  "LYTpmqt2h0NK7BtpHNmvkA": {
    "date": "9/24/2015",
    "text": "Excellent breakfast!  Had the Innis & Gunn sausages with 2 fried eggs on a perfectly toasted Brioche roll.  The sausage was so good.  My girlfriend had eggs your way on toast. She enjoyed it almost as much as  her Bloody Mary!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "GZAF6urvbxFezJCsEWXBFg"
  },
  "-ggBVGT0ZyVpp8y5ec-Yyg": {
    "date": "9/24/2015",
    "text": "Pure class. Good cocktails, the beer speaks for itself. Staff are well-trained. Try the \"popcorn mussels\" from the bar bites menu. Yummy & great value.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KvFQ5iAir60bO-ZyaXwb-w"
  },
  "aEMb5RCtAcQfTJRLzkoFJw": {
    "date": "11/16/2015",
    "text": "I&G lover already so was happy when my Brother said we were going here before a gig! Great food and drink, surprised to see other Brewers ale and beer which is great. The only thing I can't stomach is the price! I love a pint of draught I&G but 6.80 or thereabouts?! All the drinks seemed very expensive but I've been told that's just what you pay in Edinburgh centre now. The pub next to Usher Hall was day light robbery!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QkHW5pT9aMMDU4Nv4I9kkA"
  },
  "jl_nRemeQtQo5UviYStoMA": {
    "date": "1/26/2017",
    "text": "Eight of us from California went there last night to dinner. The best thing we all  agreed on was the shepherds pie. Took a while to get our orders out. Atmosphere was relaxed. Will go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6id107ijdYzlXs-HrcLN2g"
  },
  "5yMa0nzH2Kvi7RA74m_ORA": {
    "date": "6/5/2016",
    "text": "Excellent scotch eggs and haggis donuts. Lamb was also excellent, bangers and mash or fish pie are also good. Large beer selection and a fun looking bar.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yNfxkpTl00hpfcLYLlkp3A"
  },
  "GLOhRSxOhg3gBSsEGuQElw": {
    "date": "9/20/2015",
    "text": "I LOVE Innis and Gunn beer. So when I found out they opened a bar and resturant I was so excited! And I was right to be! I have been here 4 times now in the last month and cant wait to go back again.  They have all their beers on draght and if you can believe it , their even BETTER!  I love their Irish Whiskey Porter and their rum cask finish! SO GOOD!  They also have other local beer companies on draght too. 6North and some other great breweries.  The food is good too! A bit more expensive then I feel it should be. Dont get me wrong its tasty  food, and some of the dishes on the dinner menu are special. But theres also a lot of 'normal' pub food which is a fit pricey.   The lunch time we went there I got a smoked salmon sandwhich and a cup of soup. It was good but the chiken burger which I got the next time was even better! And I loved their thick chips. For dinner I got the veggie steak and it was really unique dish with tampura fried veggies and loads of other roasted veggies. It was so good!   Really if you need a bite to eat its good food! BUT dontcome here and not get the beers! Thats the really heart of the place!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "f3NDSdVRiUnnr7-GvC1eCA",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom. Rib bye steak",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/f3NDSdVRiUnnr7-GvC1eCA/o.jpg"
      },
      {
        "img_id": "-9Gro1kt3SyI4N2MZ_UeAg",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom. Carrot soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-9Gro1kt3SyI4N2MZ_UeAg/o.jpg"
      },
      {
        "img_id": "ODCFA3uLSPBAtf3J9xkppg",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom. Side pickle cold slaw",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ODCFA3uLSPBAtf3J9xkppg/o.jpg"
      }
    ],
    "user_id": "BpKuNkYgAuisCNZlSzfUAQ"
  },
  "OHM5NGf-85ShvSOhkcgakA": {
    "date": "9/4/2015",
    "text": "I've been a few times now however every damn time I've been Jarl has been off! I love Jarl! That's my only gripe.  This place can be busy post-work and on weekends. There's a restaurant section in the back and then quite a big bar section at the front.   I came for dinner one evening before seeing a Fringe show. Our waitress was really friendly especially considering how busy it was. They had a slider special on for 'National Burger Day' that was paired with three mini Innis and Gunn beers. There was a chorizo burger (which was soooo good), along with a regular burger and poached salmon burger. A few of us ordered this special so we got a bunch of sides to share: chunky chips, vegetables deep fried in batter, and a blue cheese and walnut salad. I'd highly recommend the salad and if the chorizo burger is ever a special on menu - go for that! The beers that were paired included the Innis and Gunn IPA, rum finish and the original. They make good beer but be careful as the alcohol percentage is higher than most!   Good bar just sort the Jarl out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "nd3IQva-LYRALpjO6nbQBQ",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom. Deliciously spicy Bloody Mary from the Bloody Mary bar!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nd3IQva-LYRALpjO6nbQBQ/o.jpg"
      },
      {
        "img_id": "xFrMGi47gr9l8zfAbkg0iQ",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom. Full fry!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xFrMGi47gr9l8zfAbkg0iQ/o.jpg"
      },
      {
        "img_id": "pir0R8N0SZlCWzlWIPTOsA",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom. Scotch egg",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pir0R8N0SZlCWzlWIPTOsA/o.jpg"
      }
    ],
    "user_id": "jY-M01vatSmfy-mK_g0h9A"
  },
  "LyVB4_6AOA6S_qGYb_3Rag": {
    "date": "8/10/2015",
    "text": "Went here yesterday with my brother & our girlfriends. I'll admit, me & him were always going to be easy sells - anything titled \"The Beer Kitchen\" was always going to be a winner for us, and the fact it was done by our favourite beer, even more so!!  The place looks very cool when you go in - bright, open, exposed brick, etc. There's plenty of seating in there too, with the added bonus of not cramming you in like sardines too! We all noticed on the way in, a stool section set up for quick working lunches - very clever!  But onto the big bit, the food.... I'm always dubious about steak sandwiches anywhere - you always end up with the thinnest, toughest cuts of steak, and spend most of your time trying to chew through! Not so here - thick, juicy cuts, red in the middle, and full of flavour. Easily the best steak sandwich I've ever had. My brother went for the fish & chips - the batter was very crisp and full of Innis & Gunn flavour! The mushy peas were epic too!! Both the girls went with the chicken burger - which again, looked amazing. We all had food envy, which is a first!  Of course, drinks are covered by an extensive choice of their best beers (and a selection of others too). There's also wine, gin... all your usual other bits! I went for their \"beer flights\" which is essentially a taster of 4 varieties. Soon as it came out, my brothers bottom lip began to pertrude, and so began 10 minutes of \"I should have got that...\" Being the nice older brother that I am, I let him have a (small) taste of each.  I think we have a new contender for my favourite place in Edinburgh!!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "HnbL6PhgKYiC2USHg9jG-Q",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom. Our table - 4 very happy diners!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HnbL6PhgKYiC2USHg9jG-Q/o.jpg"
      },
      {
        "img_id": "EkjAubf4OEqhKrL1yDGxmQ",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom. Greatest steak sandwich ever. The battered veg was pretty epic too!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EkjAubf4OEqhKrL1yDGxmQ/o.jpg"
      },
      {
        "img_id": "kNEsLJeCJI2Tmc6X8UiySg",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom. Beer Flight - genius idea!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kNEsLJeCJI2Tmc6X8UiySg/o.jpg"
      }
    ],
    "user_id": "SlSpryqL91enzQTEnIQ4yQ"
  },
  "Ax2MX4Lmp9xJZu0er1TBiA": {
    "date": "9/1/2015",
    "text": "Obviously biased as I work for Innis & Gunn (but not The Beer Kitchen!).  You've just got to try the Tank Lager! Our tanks take deliveries directly from the brewery every week of our lager, fresh from the brew line. It's unpasteurised giving it a delicious crisp finish and full malty flavour.  Burgers are all made fresh on site every morning and are hard to beat. Dripping with tasty juice, full of rich spice with a zingy herbal quality, they are my menu go to. And in a city with as many great burger joints as Edinburgh - this is a massive compliment!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "WQeXjk8XpmcX2FLSIw1lEQ",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom. The Beer Kitchen - logo",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WQeXjk8XpmcX2FLSIw1lEQ/o.jpg"
      }
    ],
    "user_id": "kUSvk0HUX5OFavCIboBZuw"
  },
  "Ii02XbHBkK-ui1NRmgzd4w": {
    "date": "6/17/2017",
    "text": "Delicious and low key. A little loud but that's what you go for is atmosphere... Atmosphere and food and brews that will not disappoint. Wife enjoyed the cocktails ashamed she had cocktails at a beer joint! Jk highly recommend this place to anyone local or traveler!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dexy_oMOGFypR8hujdmpzA",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dexy_oMOGFypR8hujdmpzA/o.jpg"
      }
    ],
    "user_id": "VbR-yk1cclu5HxwDlutHpw"
  },
  "Icek8Pn_H2G40O1kDUpqng": {
    "date": "9/25/2015",
    "text": "Innis & Gunn, reassuringly expensive.  They have transformed a place on Lothian Road into a Bar/Restaurant warehouse kind a place.   The wood, the smells, the ambiance.. all of it screams \"authentically crafted\".   It took me to some places I used to visit in France, where they sold wine and beer close to the vineyard or brewery and used an old barn for this.  The Beer Kitchen channels all that tasty rusticness and adds some class to it. Tasty but expensive class mind you.   My personal favourite in this bar is the 'cosy corner'  enough space for about 8 people around a fire.  The beers are a mixture between craft drafts and bottles, not all from Innis & Gunn.  It is an eclectic, but well thought out drinks selection of Scottish and European beers and wines.   They do offer a range of bar snacks too, but I think it is best to try their food in the restaurant.   I did not eat this time, but it looked and smelled delicious!  I am going again today!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ur14z9dAzkpMU2RZ5uH9zA",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom. Fireplace",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ur14z9dAzkpMU2RZ5uH9zA/o.jpg"
      }
    ],
    "user_id": "fKi8ZF3xpJJkgSusRubeMA"
  },
  "XXLJot4hRnjWrhvKhqBKIw": {
    "date": "6/3/2017",
    "text": "It's a long way to come from California, but I'm a native Brit and so when the opportunity came my way to visit Edinburgh it was only natural that I also made time to visit anything to do with Innis and Gunn.   I love Innis and a Gunn beer, and it's a shame it's so hard to get hold of in California.  So it was a special treat to enjoy the beers on tap rather than in bottles that had traveled a long, long way. But back to the review.  Nice decor, great service (thank you Liadh!!), beautifully plated and tasty food. It may be 8 time zones for me to visit, but I'll be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Du5rTWFQehKuayYzw-Mmfw",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom. Scotch Egg and Rum Finish beer.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Du5rTWFQehKuayYzw-Mmfw/o.jpg"
      },
      {
        "img_id": "cJevRIpszWyf_ANDGp8zWg",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom. The Works.  Tasty Traditional Scottish fare.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cJevRIpszWyf_ANDGp8zWg/o.jpg"
      },
      {
        "img_id": "ohs4iia2-5T3BTA4ubMaYg",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom. The flight of lager, IPA, original and rum finish (yummy!)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ohs4iia2-5T3BTA4ubMaYg/o.jpg"
      }
    ],
    "user_id": "U6TiEQozhOIWsJRinDSpyQ"
  },
  "s-G9iXets39bWbSpoVp5Jg": {
    "date": "10/9/2016",
    "text": "On our first night in Edinburgh, after a horrible reception at piries hotel, we took a stroll to city center and walked into this place.  A specialty beer place as we know and love. We started with the whiskey finish stout, a very dark, sweet -ish stout beer. Getting peckish, we had Scottisch eggs which we thoroughly enjoyed and had an entree next. The rib eye was well cooked and the sauce spicy. I had a pint of saison with the entree, which i didn't like, bet that's personal taste. it was too much on the citrusy side for me. She had 'out of the sea', a ceasar salad with shrimp. Also quite tasty. They had forgotten our fries, but that was corrected swiftly and our fries with mayo and ketchup were awesome.  Friendly people, good food and great beer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Aj_5_KyUTpQnCbO0Q0pfNQ"
  },
  "Hbqc0_fFBFesl9OnDurSRQ": {
    "date": "12/29/2016",
    "text": "Went in on a Thursday afternoon and got a table for four right away, although it looked like they were filling up. Had fish and chips, scotch egg, and the cheesie toastie to share as a table, and ALL were exceptional. Seriously good food!! Merchandise and canned beer available for sale as well. My fav is their lager, but I had the session IPA today. Stick with the lager, in my opinion. Can't go wrong with the food though!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pfZj1LiwDtKFh8UxjP8Acg",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom. Scotch egg was great!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pfZj1LiwDtKFh8UxjP8Acg/o.jpg"
      }
    ],
    "user_id": "84lcucCIEIv3Xp74zrCzZA"
  },
  "ny1r1rupTx6pLLP1HbaYpw": {
    "date": "12/23/2016",
    "text": "Came here for breakfast before my Christmas show. Attentive server, great ambiance. Would turn the spotlights down a bit, though, on this dark, rainy morning! :). Full Scottish breakfast clearly made to order and delicious. Loved the touch of grilled buttered toast. Well worth the visit!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4johU5qnUvOuN87Wz0npJw",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4johU5qnUvOuN87Wz0npJw/o.jpg"
      }
    ],
    "user_id": "ae91IRdSc1jUlOq5dKITVA"
  },
  "bEzN0OqipHi3y72FD0FBTQ": {
    "date": "11/9/2017",
    "text": "Great beer and food. Can't really say anymore about it. If you are looking for vegetarian options, this is also the place for you. Their mushroom and broccoli tart was amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6b4l5J2deR-y5gPsP4LDLg"
  },
  "POLrwnTOMgILn788ILzuRQ": {
    "date": "3/23/2016",
    "text": "I'd been wanting to try The Beer Kitchen since it opened, and bleary eyed one early Saturday afternoon I managed to get myself in for Brunch. I have been too many places that stop the brunch menu at noon - proving they don't understand the concept of the meal. Happily The Beer Kitchen keep their menu open until a much more respectable 2pm.  It's very chilled inside, and probably would feel a little too cool for me, but the staff were instantly welcoming. Plus I love anywhere that brings water to your table from the off. There's some lovely Edinburgh themed mural on the wall. I couldn't resist ordering the baked ham & eggs in a skillet pan, after seeing it at the next table. I wish I'd ordered the cider to wash mine down same as my neighbour, but it felt too early for booze for my stomach - I'll learn for next time!  For 6 I got plenty of brunch, and tasty too! 3 nicely cooked eggs nestled in a ham, tomato & mushroom mix with some bread to mop it all up. I tried valiantly to finish it, but that was a proper mountain of food.  Looking forward to going back to The Beer Kitchen for drinks & maybe evening food.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "97JTwCnKnyTHpr6fp-sNdA"
  },
  "3Zwv859z97IIRyC86Z8u8Q": {
    "date": "4/25/2016",
    "text": "Great atmosphere and music. The perfect chill destination after a busy day at work. If I am honest the menu was a bit pricey, but the food was very good.  A great selection of beers available- even for someone like me who doesn't normally like beer.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "eXl0_ZA3kfL0MB2BKeDp0A"
  },
  "g3zaHw9yv8HczhLrJePskQ": {
    "date": "7/15/2017",
    "text": "Went here for fish and chips. Pretty tasty fish and thick cut fries (chips). They had a delicious dark beer that went down pretty well. I'd go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8QI4qchsTlH7IBU7DHKPCQ"
  },
  "HmDEtfaCwebahL1E87EDUg": {
    "date": "7/1/2017",
    "text": "Great beer, great ambience & great service! Chchcheck it out if you're in St. Andrews.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u5e94ukfwamJASuQXaee5Q"
  },
  "yKPegUYb3T_K33673vAtWA": {
    "date": "6/26/2016",
    "text": "I rarely give bad reviews, and maybe on another night I'd have a different story, but this was my experience:  I came in on a Sunday evening. The entire bar was empty, and about half of the restaurant was open (not very busy, is my point). I wanted food, and I was told by the bartender that I couldn't order food, and that they were slammed, and the current wait was over an hour. I've never been told I simply can't order food.  Bizarre. So I'd love to give a some thoughts on the food, but I can't. I had the Innis & Gunn intro flight--four beers (the lager, original, rum finish, and toasted oak). Depending on your tastes, they were okay. The lager was my favorite; wasn't a fan of the others, and I don't often dislike a beer.  The bartender told me not to bother with the drinks menu because an entire page of drinks was not available. Overall, it seems like the place is disorganized.  Additionally, the bar was sticky and gross (and again, completely empty).  The vibe was cool, the space is fun.  Take it for what it's worth--I'm sure if you're able to get food, your night will be much better.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ocWRxYT1Vu-pKgxqKBkAaw"
  },
  "USxPpU6ELaTLfblT2RDhyg": {
    "date": "3/30/2016",
    "text": "Forgot to review from two nights ago. Very nice meal. The fish in my fish and chips was humongous. Moist and tasty too. Lovely local beat to pair. The chips were not as spectacular as the fish but good enough. Very accommodating with my 8-year too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iYiqK9ICsQ77tfvx2dyE2A",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iYiqK9ICsQ77tfvx2dyE2A/o.jpg"
      }
    ],
    "user_id": "Rsta1i7le8aEHrywfIl6JA"
  },
  "Orlm0dbxAoy4w-F0smzNyw": {
    "date": "11/21/2015",
    "text": "I went to the Beer Kitchen for dinner with a group for a celebration dinner. The bar has been done up nicely and is well fitted out with interesting decor.  They have a massive selection of beer, which as others have said is quite expensive but strong. The wine selection is quite extensive and the 'small' glasses are 175ml and start at 4.   As there were more than ten of us we had the set menu which was 18.50 per person. The dealt well with allergies and putting the fish from one of the sharing platters on a separate platter without any fuss. The veggie steak was a bit lacking in carbs as a dish to be filling but luckily there were more than enough spare chips from others to make up for it.  The options on the set menu were as follows,   SHARING STARTER  A selection of cauliflower croquettes, ribs, chicken liver pate, popcorn mussels, veggie fries with a selection of Innis & Gunn ketchups, sweet chilli jam and pickles.  MAINS  BURGER   8oz Scottish beef burger, mature Scottish cheddar cheese, red onion and bacon jam, crispy pickles, toasted brioche bun, chunky chips.   FISH & CHIPS  'Toasted oak IPA' beer battered North Atlantic haddock and chunky chips, mushy peas                      and tartar sauce.  VEGGIE STEAK   Marinated charred aubergine steaks, crisp tenderstem broccoli, beetroot and oregano salsa, honey whipped goat's cheese.  FLAT IRON STEAK (4 SUPPLEMENT)  8oz Flat Iron steak, marinated in olive oil, garlic and rosemary, watercress salad, chunky chips and a  peppercorn sauce  PORK BELLY   'Innis & Gunn Original' pulled and rolled pork belly, black pudding and apple rosti, wholegrain mustard sauce",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "uTRWF_Hd-Sbc164ixIP8ng"
  },
  "xHd9OFzFUsdlvlmPvpJtoQ": {
    "date": "9/20/2015",
    "text": "You had me at Rum Finish on tap...  Fun fact: Canadians are cuckoo for Innis & Gunn. In fact, we Canucks drink more I&G than the Scottish (that wasn't a challenge, it's True) so it's no surprise that this little Canadian expat was a fast fan of their newest endeavor on Lothian Road.   But beyond the fact that I would have a bathtub full of the stuff, this pub is quite a nice place to share a pint. However, because of that fact, I can't tell you ANYTHING else about the menu... I have no idea if they carry other beer or have cocktails. They have Rum Finish on tap people, I had my priorities!  What I can comment on is that I went in on a busy Friday evening, during the rugby and actually still managed to find a seat. Though it seems to always be full, it's a well laid out space and never felt crowded. Plus, service was quick and cheerful. Yes, the pints are more expensive than your run of the mill spots, but so is Innis & Gunn at the supermarkets. I will happily pay a 1 more here and there for something I truly enjoy.  I'm saving that last star for the food, which I have high hopes for and probably could have used more of after four pints... but until then, consider this a prologue to total fangirl mode.",
    "rating": 4,
    "rated": {
      "funny": 8,
      "useful": 7,
      "cool": 7
    },
    "photos": [],
    "user_id": "H5TEwR-OD0XxILGNaewohA"
  },
  "kfh6P1VYLfRezeHu-eWCrQ": {
    "date": "9/29/2015",
    "text": "Ouch!  Now, I know that Innis & Gunn has a higher ABV than most beers, and therefore costs more, but 6.60 for a pint?! Perhaps they should serve schooners as standard (they do do them if you ask), and that way we can be lured into thinking it's cheaper.  I came here recently with colleagues for a leaving night, and everyone was shocked by the price, to the extent that bar the lager, no-one was drinking Innis & Gunn in their own pub. I actually had a couple of pints of the delicious, seasonal White Oak Wheat Beer, but there's no way I could have afforded to drink that all night so switched to Drygate's Bear Faced Lager instead.  I may come back to try the food, and to be fair to Innis & Gunn it's a really nice looking place (you'd never have guessed it's a former strip club), but I'm poor so... probably not.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "Mqg4L8flJmg8pqeR-uYyRg"
  },
  "lka5PK8DUXIqxPyMJXEW9A": {
    "date": "7/27/2019",
    "text": "Great tap room. The beer is great and the food matches. We the fish and chips, burger, ch chicken and chili dog. All were awesome. My fish and chips were exactly what you hope for. A big piece of flaky, well breaded fish, paired with crispy chips and creamy \"mushy\" peas. The beers were good too, with the mango ipa and the b.a. dark ale my favorites. Beware, it's a pub atmosphere, so pretty loud, but that's not necessarily a negative.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "sAhg0H_-UhcKCv3T09jT1g"
  },
  "gb7b4ipeuo3vY7Yre46odw": {
    "date": "8/10/2019",
    "text": "One of our local brewery owners gave us a list of must visits in Edinburgh, and Innis and Gun was top of the list! The beers were dynamite with a very long list of brews to try, which we gladly did. Their food was seriously standout, everyone in my family loved their dishes. We dappled with their veggie burger, chili dog, ox cheek pie, and their falafel pita. Totally random food but all delicious! The service was great and friendly and we even eavesdropped on the beer class. Would definitely come back if we didn't live 3,000 miles away!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8y1wk5VhENY8BV2nauzUZw"
  },
  "vC0DmqbJOTPi_pCRsv4zeQ": {
    "date": "11/5/2018",
    "text": "Honestly really pleased with the Beer Kitchen in general. Except we did have slow service when we dined here at an off-peak time (not that many parties in the restaurant at that time either...).  Food was not bad. The halloumi fries were delicious. I've never had them and was pleasantly surprised. They reminded me of paneer a little and were fried perfectly. Wish you got more for your money though. Portion could've been a wee bit better. The fish and chips I got were good (despite a little bone inside the fillet that freaked me out a little). Otherwise, cooked well and batter was on point. Fries were basic and thicker but I liked them (no seasoning).  Boyfriend got the pastrami sandwich lunch special and the steak salad too. He liked both a lot. Overall, this is a good spot for a more casual lunch or dinner (make sure you have some time though because service might not be the quickest).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SU681R2xV5KiKXAuWAuHmA",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SU681R2xV5KiKXAuWAuHmA/o.jpg"
      },
      {
        "img_id": "J7xFW6u7qgsd_FpiMQImSg",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/J7xFW6u7qgsd_FpiMQImSg/o.jpg"
      },
      {
        "img_id": "bo9Tl0Y4uHvUj3-baIQd8g",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bo9Tl0Y4uHvUj3-baIQd8g/o.jpg"
      }
    ],
    "user_id": "Dl8UzehqTZNMfuGksnvoRQ"
  },
  "y8hB48tdskSe1f1YGE_e6g": {
    "date": "9/7/2018",
    "text": "We got into Edinburgh late one night and was so glad to find this place open!   The beer is fantastic! My fiance and I both really enjoyed it. I had a scotch egg that was insanely delicious!  The portion sizes are very reasonable and the food is VERY good! Prices are great and the service was good as well!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LXml8hLDLK3Icf_fhiNF4A",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LXml8hLDLK3Icf_fhiNF4A/o.jpg"
      },
      {
        "img_id": "WLnr1zBl_WHhRaMFpEz9aQ",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WLnr1zBl_WHhRaMFpEz9aQ/o.jpg"
      }
    ],
    "user_id": "8XvVGMyHlP4UIsD9nfE0EQ"
  },
  "X49ZHg00zYR5HP6ADKgGKA": {
    "date": "6/13/2019",
    "text": "After trying a bottle of \"The Original\" beer from a market, I was instantly hooked and took a long walk to the Innis and Gunn Beer Kitchen in order to try it on draft. They were out of their flagship beer, which seemed really odd. With reservation, I drank an alternative, which was just okay.  As for food, I shared the classic burger and chicken burger, and both were pretty bland. Although the employees were nice, the place was understaffed, so the service was slow. Even if I were in town longer, I wouldn't consider going back at all.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7Xig5jox65AdAV8kgwRiRQ"
  },
  "qwbUItfDMxsPjmn1O00Y_A": {
    "date": "4/24/2018",
    "text": "Great restaurant with convenient location. We were greeted right away and service was friendly. Large variety of beer, wine and cocktails. Comfortable booths in the dining area. Thursdays are steak night and great deal on 2 steaks with wine. I ordered the haddock and chips: good portion of fish and crisp batter. Fries came out hot.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "VtSErHmdhSVAn6_AdnaA4w",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VtSErHmdhSVAn6_AdnaA4w/o.jpg"
      },
      {
        "img_id": "ICjO80d9sBAB2DZxmVYd8A",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ICjO80d9sBAB2DZxmVYd8A/o.jpg"
      },
      {
        "img_id": "HEzM_MydZfeJygaol8Tb9g",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HEzM_MydZfeJygaol8Tb9g/o.jpg"
      }
    ],
    "user_id": "hw6NN-0nM0ZlM9eb7IL05Q"
  },
  "XHL5RSeTNxiyUGFpxg8mHg": {
    "date": "11/25/2018",
    "text": "I've been to this place 3 times and will not be returning. The first time after a pretty long wait my Scotch Eggs arrived & were delicious but the service is soooo slowwww.   Next trip a month later after a 15 minute wait I was told they were out of Scotch eggs. Then on another trip this November I went in and stood by the sign that says \"please wait to be seated\". Well I waited while the server looked at me & another employee cleaning a mirror looked at me...and I waited...and waited. Then another party came in behind me. And they waited...and waited. The server looked at us both again & went back to talking with another employee & just ignored both parties.   I left after what seemed like an eternity but was likely 5-10 minutes & the place was not busy. I counted 3 tables in the place. Too many other choices in town to put up w such disinterested staff. I'm guessing this place has an absentee owner because the staff was out to lunch.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "DhDODkgkaiD-lmjDYu5_jQ"
  },
  "-EXe1Xvu5GpWYAXJZDJUAg": {
    "date": "8/28/2017",
    "text": "I started this morning here for breakfast, and got the smoked haddock omelette. Holy hell, it was freaking awesome. Softly cooked eggs, spinach, and perfectly smoked haddock, with some toasted bread on the side....delicious. The only downside was the spinach salad...it tasted bland, and possibly unwashed.  The bartender was delightful, kept our drinks full, and gave great tips on what to do. When in Scotland, why not have breakfast at a bar? Here's a great choice!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "GUaSi-yG5P8Ij0yPGrlcjw"
  },
  "P0k8BYf4Re_RQ7I6nLt4hg": {
    "date": "5/18/2016",
    "text": "During our recent visit to Edinburgh we visited The Beer Kitchen twice since we were staying just down the road...once for dinner, and once for breakfast. They have a decent beer selection, several of the beers are their own (Innis & Gunn). The un-pasturized lager is really good and cheap we had several of those. I also had their barrel aged IPA which claimed to be hop forward blah blah blah. Let's just say as an IPA it's an epic fail. No aroma or taste of hop, none, seriously. Not to mentioned it finished metallic... good thing I am not judging the establishment on the failure of one beer!   We ordered an appetizer of ham terrin, which was a special of the say item, not typically on the menu. I will remember it fondly long into the future, it was porky goodness.... I drool thinking of it now. For dinner I chose the pork pie, and the husband got the beef curry. The pie wasn't what I was expecting, I was thinking pot pie, whith a bottom crust... but that is probably just because being an American I didn't understand exactly what it was. Either way, it was quite yummy!!! I would get it again, it had large chunks of meat in it. It was perhaps a bit watery, but I think it was just broth and a little grease that materialized while cooking. The veg that came on the side was legit! The husband really liked his beef curry, I took a bite and the beef was tender and it was nicely spiced.  Our next visit we had a traditional english breakfast of haggis, black pudding, sausages, bacon/ham, tatty scone, egg, toast, tomato, mushroom. This was a ridiculous amount of protein on a plate, LOL. I wasn't anywhere near to eating it all but all of it was super yummy, especially the black pudding. The husband ate all of his, and was quite satisfied.  So all in all The Beer Kitchen is a solid stop.... Not my top pick for beer in the area but the food is good. For beer we loved The Hanging Bat just up the road.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "TXMgs2fiZtIhJ41Z_t0O4w",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom. Scotch egg",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TXMgs2fiZtIhJ41Z_t0O4w/o.jpg"
      },
      {
        "img_id": "Sc-GjLkAFnagI_tBmyBJyw",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom. Amazing ham hock terrine",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Sc-GjLkAFnagI_tBmyBJyw/o.jpg"
      }
    ],
    "user_id": "_1SciRXzQ3tH31geMXe3RQ"
  },
  "Zbwkov1Ekq_Iv2F0II8dxw": {
    "date": "9/11/2017",
    "text": "We came to this bar honestly for the beer, but saw that the food reviews were good too, so decided to stop in. Today is a Monday, so we figured seating wouldn't be an issue, but turned out the problem was that the restaurant was understaffed. With two waitresses and one bartender, they were overwhelmed with honestly not that busy of a restaurant.   I ordered the KFC (Korean fried cauliflower) along with the fish and chips and the pork belly. Like I said, the waitresses seemed very busy, and it took over an hour for our food to come out. We tried to order drinks to pass the time, but that also took a very long time. When we finally received our main dishes, mine was COLD. My boyfriends fish and chips were hot because they seemed to be freshly fried, but my pork belly was so cold that the gravy had started to congeal. I had to give it back as the pork was also cold, and no one wants to eat cold pork fat.   I would say this place has good beer, and the food has the potential to be tasty, but make sure they're not busy because it can take forever.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cdt7YslPTnExdeFIP800OA",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom. Decor",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cdt7YslPTnExdeFIP800OA/o.jpg"
      },
      {
        "img_id": "5D7Ok0us_pHuq_2gEhYBow",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom. Beer menu of the week",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5D7Ok0us_pHuq_2gEhYBow/o.jpg"
      },
      {
        "img_id": "WDsq8W3K-gQTo43dQeygUg",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom. Restaurant decor",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WDsq8W3K-gQTo43dQeygUg/o.jpg"
      }
    ],
    "user_id": "mBcFST0p0wFnqYUGjtZ4lg"
  },
  "ZbmPcc9AZQ344QH-Eidkbw": {
    "date": "7/20/2017",
    "text": "If you're coming here for fish and chips, then I think you're in the clear, and this is a great spot to try that popular menu item; however, everything else seems kind of bland.  Tried the \"savoury donut,\" which is a crispy donut filled with Macsween Haggis, bone marrow aioli and crispy onion.  It was less than appetizing and very much lacking in flavor, but nonetheless, the fish and chips were the saving grace for this locale.  The fish was battered lightly, which was in my opinion, perfect as I'm not a huge fan of fried foods.  Could potentially be a fun place to grab a beer as well given their extensive selection.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "XT0nKP20HHrQRy-K8I5hbQ",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom. Savoury doughnut.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XT0nKP20HHrQRy-K8I5hbQ/o.jpg"
      },
      {
        "img_id": "HOgo8FglroROXNZcX1OLvw",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom. Fish and chips.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HOgo8FglroROXNZcX1OLvw/o.jpg"
      }
    ],
    "user_id": "nF5jMQ2CUIiQG7U-yvFq7g"
  },
  "ir9b65ksSOKOns4S8K9b0g": {
    "date": "9/13/2018",
    "text": "The atmosphere is pleasant and the staff helpful and friendly. We enjoyed our beer and the bar bites we were served. Unfortunately, for our midweek late lunch, there were several entrees and starters the place had run out of. Disappointing and probably a reason to hesitate before returning.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GsRpoC2EGS52c6-VfHHKbw"
  },
  "Fnr3VDaY7RlXttP5rLz1Gg": {
    "date": "8/1/2018",
    "text": "Place that has potential but is let down by the wait staff.  They just don't seem to care and really let the place down as the food is not too bad. Best to save your money and head to one of the other places around here that will make you feel welcome",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "x9rt42hqutYldl1H6ooFdQ"
  },
  "PLO0I_5TNjMJUDTctpJ4yw": {
    "date": "10/6/2018",
    "text": "We only went there because it seemed to be the only place that still serves scotch egg.   Stood in the entryway waiting to be seated for about 10min in a near empty restaurant (on a Saturday, no less, should have taken that as a sign) and was about to walk out when they finally came over to seat us, only to say \"sit wherever you want.\" Then don't have a sign that says \"please wait to be seated\"??  Our waitress also seemed to be sick... Don't come into work if you're sick and work at a restaurant!!!  Place was a mess too and needed a thorough cleaning.   Food was alright. Not much to comment on there. Steak was well cooked.  Edit to add: I did catch that waitress's cold!! What a great bonus!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sYYuvZPEFX0T0KvLVS9RjA"
  },
  "FMIcxlE4MSlC3ROyVdGFPQ": {
    "date": "12/17/2016",
    "text": "We only went there for drinks and it was a nice little corner we got. Actually, considering its Christmas time and a Saturday evening,  we were pretty lucky for a group of 6.  Anyway, the bar has a big beer brand name to it and you pay the price for their beers.  There is plenty of space to sit and have a meal as well as space at the bar area for a quick one. The music can be a bit loud, so it's hard to have a conversation of sorts.  I have not tried the food. Can't comment on that.  Would I recommend this bar for a night out? Yes, I would. Dinner earlier in the night and drinks thereafter with a group. Much more fun. Less ideal for dates!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "CnwDRr6vrT_Omz4l8FmAiQ",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CnwDRr6vrT_Omz4l8FmAiQ/o.jpg"
      }
    ],
    "user_id": "s85sNAMlsrI0xCRvfj7Jrw"
  },
  "Zv9RWiiFftlv_drsDv7N5A": {
    "date": "5/25/2018",
    "text": "I am only writing this review because we came in and ordered food. You can't have lunch until noon even though their menu says all day menu we ordered our food at noon because we wanted lunch not brunch at 1:00 pm the food was not there we just left however we did pay for our meal that never showed up.  Also I just want to say I realize people in the Uk don't use ice except in a cocktails but as Americans are a lot of the tourist you'd think you could get some ice.  When you ask for ice you get two cubes. The beer is good and my review is based only because we paid for something we never received.  Other patrons came in way after us and received food that was on their \"all day Menu\". The menu should say \"from noon on menu\".  Some Americans eat lunch at 11 or 11:30 am.  We had to leave as we were catching a flight.  I think our food never got ordered so we left.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fCzQ1PpH1XX_Qjvaa1fevA"
  },
  "PRh8250K509s-K7Fmd7fAw": {
    "date": "1/12/2018",
    "text": "Rather disappointed by the food, the atmosphere and most of all the service. The fish and chips was rather dry and lacking flavor. The chickpea curry was WAY too hot! At first seated in the dark corner and after numerous requests to change seats, a lack of communication between waitresses made this an almost impossible task. Further miscommunication about the bill regarding previously ordered drinks at the bar (which was also not brought to the table after numerous requests).  All in all - not what I had expected. Shame for such a lovely location and also nice interior. But service and food needs a rerun.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xux7pwny7edNxhUmPPpFkg"
  },
  "XyMO-o-pusJ5Iexy5HsxyQ": {
    "date": "8/10/2015",
    "text": "Good, friendly service and fairly reasonably priced food (with a decent range of things on offer). Take a seat at the window if in during the day as, being on Lothian Road, it's a great people watching spot.  The milkshakes are a bit on the weak side and the price of a pint is eyewatering but at least they sell beer in that size rather than two thirds.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "d_bKJ3DkDBZT2uvp0d4Hmg",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom. Beef brisket sandwich w/ chips, blueberry, green tea, honey &amp;amp; almond milk shake.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/d_bKJ3DkDBZT2uvp0d4Hmg/o.jpg"
      }
    ],
    "user_id": "txzOZrHK9EVY0kYjSuXkKg"
  },
  "q5aAy_m-ShBuIzlQlQFQdg": {
    "date": "1/16/2016",
    "text": "There's very little to dislike about Beer Kitchen other than their prices. If you're looking for quality over quantity when it comes to beer, then this is one of your top options in the city. Forget the naysayers. Beer Kitchen is a priority for experiencing the breweries and beers Scotland has to offer.    They serve most of their I&G drinks on tap; this gives you a different take on what would normally come in a bottle in most pubs. Do yourself a favour and get the rum finish or Irish whisky finish. The servers are helpful in describing the drinks if you're at all overwhelmed with the extensive menu. They may often recommend getting a schooner rather than a pint because of the ABV (and price). If you can't decide on which beer to try, then why not go for a flight? It has samples of four different ones.   The food is standard gastropub fair that you might get at any of a number of places around the city. My favourite is the chicken burger, which is only available on the lunch menu. I wouldn't recommend getting the overpriced fish and chips, which aren't as good as what you would get half the price elsewhere. For the food they have available, it may be worth going across the street for Bread Meats Bread first and saving a few quid, then stop in here for smaller plates with your drinks, or vice a versa. But if you're short on time and/or have a more flexible budget, then by all means get dinner a some drinks here for sure... I would hardly think you would regret it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "eXZ5v4OBPzUf0TmLmOlqpw",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom. Seared Seabass",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eXZ5v4OBPzUf0TmLmOlqpw/o.jpg"
      },
      {
        "img_id": "ikEMCghuopfzkFhwkbE4yg",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ikEMCghuopfzkFhwkbE4yg/o.jpg"
      },
      {
        "img_id": "tWjQo4We8_ltbFSCFDmQoQ",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom. Irish Whisky finish boiler maker",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tWjQo4We8_ltbFSCFDmQoQ/o.jpg"
      }
    ],
    "user_id": "tXIN2tMOAiZH-lGwEaHOkg"
  },
  "xVqpqE3bLv7zgvWnIrZ5zg": {
    "date": "6/7/2017",
    "text": "Wow, just wow.  That was an incredible experience.  Unbelievable food variety, quality, and choices.  And the beer....oh, the beer....I was thoroughly satisfied with the selection and really enjoyed all the types.  Even the prices were appropriate for what you got.  Well done, I will return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MKPNB04J1Pi08OHgKVIZRQ",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MKPNB04J1Pi08OHgKVIZRQ/o.jpg"
      },
      {
        "img_id": "c5UhcaPsUv06NfSWqcrBiQ",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/c5UhcaPsUv06NfSWqcrBiQ/o.jpg"
      },
      {
        "img_id": "umaBwGhbeZkMUfcZh1H_5w",
        "caption": "Photo of The Beer Kitchen By Innis &amp; Gunn - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/umaBwGhbeZkMUfcZh1H_5w/o.jpg"
      }
    ],
    "user_id": "oplWgjTUMVyIohDvtF_Hcw"
  }
}