{
  "mRImofAkRCE9TVcRsHoF9A": {
    "date": "4/4/2015",
    "text": "This is not a fancy place but a very nice Cafe that offers excellent hot coffee beverages and homemade breakfast, rolls/sandwiches, salads and some hot homemade meals. The service is awesome.   We went for breakfast 3 days in sequence when we were in town and the lady that takes care of the business was consistently professional and kind, remembering our choices, given great advices about the neighborhood as well and kindly asking how it worked in the next visit.  Price is very honest, with a full Scottish breakfast for only 3.95 (in general, the most expensive item in the board menu).  They have free daily newspaper available to read at the premises and comfortable seats to read them, if one wish.   Quality is taking very much in consideration here. Their latte and their cappuccino are top and they serve Twinngs tea.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "HSXMOJcBQaxURtAippv7DA",
        "caption": "Photo of Cafe Marmalade - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HSXMOJcBQaxURtAippv7DA/o.jpg"
      },
      {
        "img_id": "i-LZ2BbOhU8vWAl6Wu1plw",
        "caption": "Photo of Cafe Marmalade - Edinburgh, Midlothian, United Kingdom. Cappuccino",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/i-LZ2BbOhU8vWAl6Wu1plw/o.jpg"
      }
    ],
    "user_id": "QtwcxQ8Uez29iIziMSf3Sw"
  },
  "ZVHQPsgFfxfj8LrARfQncg": {
    "date": "7/23/2018",
    "text": "Great food, great service, and great ambiance for a great price.  Visited Scotland from USA and found this great little gem around the corner from where we were staying.  I wish I had more stomachs to try their other dishes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Tp262G1h0K7LwZ5U7RNq8g",
        "caption": "Photo of Cafe Marmalade - Edinburgh, Midlothian, United Kingdom. The menu at Cafe Marmalade",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Tp262G1h0K7LwZ5U7RNq8g/o.jpg"
      }
    ],
    "user_id": "927TIz3WE6srUTNU7NjsMQ"
  },
  "rh2PDsBrUHubxZ4zFB-RWg": {
    "date": "4/19/2013",
    "text": "I love Cafe Marmalade for various reasons.   First of all, it produces amazing flavourful soups which tempt you to come back day after day... Every day they have 3 varieties of soups and you get a large hunk of baguette to go with it as well. So for example a large cup of tomato & bean soup to takeaway is 1.70.  One day I was hesitating between two flavours and the lady kindly offered a wee sample for me to taste which I thought was a nice touch. In fact all the staff there are super friendly and always smiling, which is another reason to go there.   Cafe Marmalade also does nice salads, wraps, sandwiches and cakes. They also sell portions of home made foods, e.g. lasagne so I would say pretty much all your lunch time needs are satisfied here :)",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RgS0SsQhkCJ9t-V7sinmQg",
        "caption": "Photo of Cafe Marmalade - Edinburgh, Midlothian, United Kingdom. Caesar salad - romaine lettuce, egg mayo &amp;amp; loads of manchego (?) cheese, croutons",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RgS0SsQhkCJ9t-V7sinmQg/o.jpg"
      },
      {
        "img_id": "H7ZjzKVREmx04sIyZZWcTQ",
        "caption": "Photo of Cafe Marmalade - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/H7ZjzKVREmx04sIyZZWcTQ/o.jpg"
      }
    ],
    "user_id": "yuFHrb8YQtVuzu0eEXvJtA"
  },
  "tk7JOhSOCTjtlRFNjzTPkQ": {
    "date": "8/23/2012",
    "text": "I've been visiting Marmalade on and off since I started my new job, and have been here a few times before too. Every time food has been quick, yummy and a good price.   Today I had the Ploughman's Salad, which I thought would arrive in a small plastic container and I'd have to eat with those horrendous plastic forks. But no, a big plate of ham, cheese, egg, two kinds of pickle, lettuce and tomatoes landed on my table and I was mighty impressed. All for a paltry sum of 2.60! I think I will be a regular here from now on.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0B-S8ySqfZNr30DdyuX3SA",
        "caption": "Photo of Cafe Marmalade - Edinburgh, Midlothian, United Kingdom. Ploughman&amp;#39;s salad - £2.60!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0B-S8ySqfZNr30DdyuX3SA/o.jpg"
      }
    ],
    "user_id": "fcMTpwfLS9F5DWTqlp8ktQ"
  },
  "RY3uPGrmGY3_fpwRscj38A": {
    "date": "7/5/2013",
    "text": "Cafe Marmalade is a great way to start the day. I give this lovely little eaterie five stars, which is nothing less than it deserves. Initially, Cafe Marmalade had me sold as it does skinny lattes - and good ones at that. Skinny lattes seem to be hard to come by down at The Shore, so finding somewhere nearby that did them was a godsend.  To accompany the delicious coffee, you'll be hard pressed to avoid the delicious pastries in the morning - I swear I have eaten a cinnamon wheel the size of my head from Cafe Marmalade. There are also traditional breakfast rolls on offer, as well as healthier options by the way of granola and smoothies.  I've lunched at Cafe Marmalade a number of times, sampling everything from paninis to salad pots. They also do chicken schnitzel, which is very tasty alongside some salad, and if you're feeling really hungry, Marmalade's homemade lasagne is a real treat, and a very healthy portion considering the price.  But the thing that really gives Cafe Marmalade the edge - alongside the lovely food and coffee - is the service. The staff are always cheerful and eager to help. Cafe Marmalade is somewhere I thoroughly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "AD5-3gEjii09vG3ZqonoCA"
  },
  "uEzeDntoXVuxzltiPDkHxQ": {
    "date": "9/17/2013",
    "text": "When my love asks: \"Go on have some breakfast with me at my favourite cafe?!\" How can I say no?! I like a good crafty soup, a bite of a fresh roll and a quick 'n easy choice. Especially if it is only a 10 min walk from home.  She brought me down to Bernard Street. The sun was out, but a seasonal chill was setting in. We entered into a 'Caf'.    A lovely lady (the owner?) greeted us warmly and let us take in the place a bit.  They have a big counter, with all the toastie & pannini makers, the veg, cheese & meat glass counter and a prep area the size of a decent kitchen. 5 Tables and a breakfast bar and alu street furniture.  All available fares were chalked upon the big blackboard.   The Tables were occupied but we took a seat outside. Our breakfast rolls and tea arrived quickly after ordering. They tasted fresh. The tea, served in a big pot, was warming against the autumn chill.   This is a good place for the neighbourhood, good, fresh and tasty. No pretence of trying to be smart or funky. I like its honesty. I will visit again.   Thank you to the lovely lady from Marmalade. Thank you to Anita for showing me this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fKi8ZF3xpJJkgSusRubeMA"
  },
  "b3O6b6JEHW5Ap9kd452gtg": {
    "date": "10/13/2014",
    "text": "A great cafe that serves great food without the pretences prices. They have a huge selection of sandwich fillings and homemade meals such as Mac cheese,lasagne, chilli to sit in or takeaway. Highly recommend cafe with excellent food and really good friendly service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RAfapsPQplOQXqdgBiOO-w"
  }
}