{
  "SxR3wwFRmFxtP_DyRzav3g": {
    "date": "4/25/2017",
    "text": "We dropped in here exhausted after a long day in the city where we ended up missing lunch. We were plenty hungry and ordered for chicken bhuna, chapati, daal tarka and steamed rice. The food was good and the service was quick. I am not giving them a 4-star rating cause the service could have been improved and the guy who greeted us could have been friendlier.  My partner tried to use the Yelp checkin offer for 10% menu ( we both unlock and use Yelp offers which work pretty great) but the guy refused it by saying it is only on the takeout menu while as the offer says main menu which is what we ordered. We didn't argue but still as I mentioned before, the service could have been better and friendlier.  Three star for the food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dvsMjUdVv-ECaxAzCQ7zxw"
  },
  "FLfg5hnsXEbS2xt6zzYxFQ": {
    "date": "2/21/2017",
    "text": "One of the most disappointing places I have ever had the displeasure to dine in. The server was rude - he rolled his eyes at us when we asked questions about the menu and was very impatient when taking our order, the restaurant did not have the heat on, the food was over priced: spent 60/$72 (!!) on two curry dishes, one naan bread, one order of plain basmati rice, and two beverages.   For curry, we got butter chicken and lamb tikka masala. Both were sickeningly sweet. I had to add salt just to cut the sugar. I just couldn't finish my food. The naan bread and rice were acceptable (not much of an achievement to that end).  Oh, and the obligatory 10% service charge really rounds things out. Avoid this place. I'd rather eat raw haggis.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Fy6yipWL2VaBGdhItH14w"
  },
  "ydFk-R83PkfM40J-iQV83Q": {
    "date": "5/29/2016",
    "text": "Just went there today. The quality and quantity of food and service you receive isn't worth their very high prices. I got chicken kurma which came with barely any chicken and it was tasteless. Also I had to pay an extra 3.60 for rice and 3.65 for naan on top of 13 for the chicken. I've gotten much better Indian food at other places for half the price and I definitely felt ripped off.  Also the server took 10 minutes to even say hi to us and never looked in on us but decided cleaning empty tables was more important than current customers. Would definitely not recommend, there are much better options available.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "i6ECTam4orP09R_HoVWv4Q"
  },
  "Yfvl68j_nISMGZVZmVwGPQ": {
    "date": "8/2/2016",
    "text": "Nice dishes in a rainy day. In Royal Mile st. Has budget meal consist of 3 course 12.90. Plain Nan bread was v delicious , crispy on top, soft inside. Waiter was friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5Q6iwinIlKhReH1JOlBTKg",
        "caption": "Photo of Bay Of Bengal - Edinburgh, United Kingdom. VG bakorah apetizer",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5Q6iwinIlKhReH1JOlBTKg/o.jpg"
      },
      {
        "img_id": "LEbG2fKaWVgIH8ToJP2lVQ",
        "caption": "Photo of Bay Of Bengal - Edinburgh, United Kingdom. Delicious Indian plate",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LEbG2fKaWVgIH8ToJP2lVQ/o.jpg"
      },
      {
        "img_id": "5P8hvye0O0FBz8euZnbpZQ",
        "caption": "Photo of Bay Of Bengal - Edinburgh, United Kingdom. Best Naaa",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5P8hvye0O0FBz8euZnbpZQ/o.jpg"
      }
    ],
    "user_id": "83dQT1vPMJqAsqlnXxaiOA"
  },
  "zy5-fC9MELdamJRYYryj7A": {
    "date": "7/25/2016",
    "text": "Popped in for a late lunch and thought it was empty because they were about to start a dinner service. Turned out it was a sign. No one wanted to be there. The chicken my boyfriend ate was reheated and covered in sauce. Being that we were the only customers it should have been freshly made, but we realized why when the 69 bill came with service charge and overpriced drinks, when no water was offered and cans of soda were kept at the bar, not given to us at the table. I should have realized the way the waiter had spoken to an Indian female who came to inquire about making a group reservation, was indicative of how they treat customers. As we told  two couples looking in.. DONT BOTHER. Expensive, for crap food and crap service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hIuVEqZ80zkc9HP_RWp-3Q",
        "caption": "Photo of Bay Of Bengal - Edinburgh, United Kingdom. Overpriced, low quality, compulsory service charge even with rude staff.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hIuVEqZ80zkc9HP_RWp-3Q/o.jpg"
      }
    ],
    "user_id": "9mQ1t9icB6oxellA9ASgpA"
  },
  "5btW3HvBrZ63Sf_T8fGrbA": {
    "date": "8/3/2013",
    "text": "I had a surprisingly good time here. I say surprisingly cause we wanted Indian and picked the closest place to the hotel. I thought it would be touristy and expensive and crap and it wasn't.   The food was better than good and it was reasonable enough prices. The food also came with this mint dipping sauce which was divine!   Next time I'm in Edinburgh I will definitely try and make it back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W0Qnn7H_-q9t9gIF4d1zpQ"
  },
  "l5nJ35HoTqRgYFHEXxvc9g": {
    "date": "7/20/2010",
    "text": "Really not great. I would probably go as to far to say the worst Indian restaurant I have ever eaten at, and I have been to some truly horrendous ones!   I came here last month with a couple of friends, against our better judgement as it was completely empty at about 7 in the evening, but we still dined here. The food was really not tasty, I had onion bhaji's to start which were dry and tasteless, and my friends had a selection of kebabs which they said were chewy, and they really looked unappealing. The curries were equally awful. I had the chicken bhuna, which had a super watery sauce, and the chicken was really chewy and stringy, and there was a layer of oil on the whole thing making it taste rank to be honest. The rice was also over cooked and was pretty soggy. To their credit though, the nan bread was tasty was was the best part of the meal - but it would be pretty difficult to mess that up!   The meal was really expensive too, with two courses coming to about 17 - really not worth it. I found the staff rude and unhelpful, and overall had a pretty nasty experience. Don't be fooled - just because a restaurant is on the Royal Mile does not mean it is good, I learnt the hard way!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0WEosR8k7Nmd_-cIcaxlwA",
        "caption": "Photo of Bay Of Bengal - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0WEosR8k7Nmd_-cIcaxlwA/o.jpg"
      }
    ],
    "user_id": "OdUSlS-S6qfZFnDUCKzwEg"
  },
  "Apim2FBsMCwr0oIbBQP_Vw": {
    "date": "10/24/2015",
    "text": "Not bad... I've had better food elsewhere but it's definitely decent.  My wife and I ordered the tikka curry and the mixed grill with basmati rice and naan.  The food came out quickly and the service was very good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Rvituj17RJoz3wtzBlG4g"
  },
  "9mX6Z0v0b-edVvtllTHsOA": {
    "date": "3/4/2016",
    "text": "Terrible food and ridiculously overpriced plus a 10% compulsory service charge.  They should be wearing balaclavas.   A total rip off",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4nY4Ebn6lVRh2vbBIedzwA"
  },
  "qoVoo5_a84ACbYS4_IPp1A": {
    "date": "3/28/2013",
    "text": "I had a great meal in this restaurant. Service was good. I think it's  been redecorated recently.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "55LR1Tcz_NUb9aJg7QJK5Q"
  },
  "HzoWm4k6Fqz6ROxKypwQWA": {
    "date": "5/14/2010",
    "text": "This is probably Edinburgh's longest serving Indian and Bangladeshi restaurant, situated on the Royal Mile for almost 30 years.  It was recommended to me by a relative who lived in Edinburgh for many years before moving to Glasgow. She had been going here for most of her life, and said she had never found anywhere that came close to it in Glasgow, so I had to try it out.  To be honest, the decor isn't very impressive at all; minimalistic and very red and gold. It isn't a huge place, so I was glad that we were only one of three couples in at the time. The waiter was very hospitable and took us to our table. We perused the menu and finally decided to share a chicken Masalam and rice with a garlic nann. The meal took absolutely ages to come, around 25 minutes, and by the time it did, it was cold.  I have to say, it wasn't good. It sort of resembled a boil in the bag rice and microwave curry, which was not what I had expected due to the way my Aunt described it! We finished it and asked for desert menus, but were told there were none and that they only served vanilla ice cream! Gutting!  We left pretty unhappy with the overall experience really, and they even surcharged us because we shared a curry! I was outraged. I most certainly won't be back, I don't know what my Auntie was thinking!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cy1PV2TdYeDFA16mUOlr3Q"
  },
  "AGOWcmwWaCukTCR2koytfg": {
    "date": "5/19/2011",
    "text": "Went here after passing it in the street and really surprised that more people dont know about this place. It was brilliant! Really reccomend the chef's specials as both me and my partner had them - both very very good! Would reccomend going to any lovers of curry...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_W6wGlxTJeSyuPhi4A_6Vg"
  },
  "395dKXiQk5-9gRTbxDnixg": {
    "date": "5/23/2011",
    "text": "Had a great night in here last night after seeing the advert. Well worth another visit! Curries were so full of flavour and did not leave an empty plate! Highly recommend!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SU-lfCpPCCit7LHq8qvERA"
  }
}