{
  "7QHOasjLPPGP_Fy9-8_dUw": {
    "date": "7/27/2018",
    "text": "Short version: crazy good korma, try the sir Walter Scott lamb, and if you leave room for dessert then they'll fill a citrus with sorbet for you.   Longer version: my date and I were having trouble finding a place that would seat us without reservations in St Andrew's Square in a Friday night (hour long waits everywhere), and we finally just went to opentable to look for anything nearby. That might have happened to you. That might be the sort of situation that leads you to read something like this.   We've done Dishoom. It was good. It's not an everyday place, but Zest is. It was empty when we walked in, which is something we usually find worrisome. Looks like it is being run by a family, and each of them takes special pride in every dish, every plate, and certainly both of their guests.   Get the pickles. They're excellent to start with. Get the sir Walter Scott lamb. It's not something you've have, most likely, but it's what you're going to replace you takeaway tikka masala with starting the day after you try it. Get the chicken Korma. Get the korma because you deserve to give yourself something nice and rich and golden. Get it because you have something you always get and maybe trying something new is better than waiting in a queue for an hour one the square.   Also, they will fill a lemon with sorbet for you. That's really considerate, don't you think? Here, I've taken a picture and attached it to the review.   Look, if you're local, you've probably been everywhere else. Give it a shot. These are nice people who make good food. If you're a tourist, do the haggis the first night, then try this on the second night because you hadn't planned for what you would eat before hitting the pubs.   Finally, they have vegetarian and celiac options. See, good people making good food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1stwGoP5eDIE3nZsxxedGw",
        "caption": "Photo of Zest - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1stwGoP5eDIE3nZsxxedGw/o.jpg"
      }
    ],
    "user_id": "5dyl1O0ICNDKwbj81_YFpQ"
  },
  "8bOnKKk_2WX50hKwNaNDGQ": {
    "date": "5/23/2019",
    "text": "We just finished out dinner. We had a pleasant meal. I took one star down because it's a bit expensive.  To start, the host offered some sort of cracker ( .95 pound) which I recommend because this giant cracker comes with 3 sauces. It was entertaining and yummy while we wait for the meal. (sweet, spicy and onions)   Main dishes, we ordered Garlic king prawn. It was good! but there were only 5 medium size shrimps in it for 16.95 pounds which is really expensive. Then we ordered Sak paneer. We like the fact the spinach wasn't chopped up into little pieces, we could still see the spinach. The taste is really mild. The plain naan was great and puffy. Well, we went to Dishoom the other night and the bill came like 50 pounds. Maybe it's just pricey allover the town for restaurant with 2 pound signs. Overall, we had a good time!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fGFjwclTocAXSQlR8L4psA"
  },
  "Z4a6nJ4WP2cXYUsFkIzzFA": {
    "date": "8/20/2013",
    "text": "While visiting St. Andrews Cathedral and Castle, hubby and I wanted a simple quick hot lunch (50s in June is still cold for Americans). Zest served that exact purpose. We ordered at the counter and was informed when the food was ready. Our lunch consisted of lentil soup and sandwiches. My curry sandwich was especially yummy without the overpowering taste of the curry spice. The big windows brought a lot of light into the restaurant which is somehow the perfect setting for a light lunch.  I noticed the sign said Zest juicing & coffee bar, sadly I didn't have room left for any juice, but if you are visiting Zest, at least you know that option is available for you.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-dw8f7FLaUmWR7bfJ_Yf0w"
  },
  "Rmv1OZgVlQtfOHjB1P5NNw": {
    "date": "12/26/2017",
    "text": "Good that they have a delivery service to george street with min speed of 15. However the chicken biryani is tasteless but the garlic naan is good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-eoukBJkh4Yybkr-2-kKNQ"
  },
  "Q0xcPlHt3-wvZ5J0k9aPhA": {
    "date": "7/13/2017",
    "text": "Absolutely one of the best Indian restaurants I have eaten at.  We are from San Francisco and I have yet to find a restaurant that compares in quality of food!  Service is excellent as well.  Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5UKu9eXhIDTjkXkefkZKwA"
  },
  "Kfw6iHpjuF4UE2okfk7G4Q": {
    "date": "8/3/2015",
    "text": "Fantastic curry and the staff were super friendly!! We were starving in Edinburgh and suddenly Zest caught our sight, so we went in. The staff greeted us with warm welcome and let us sit in the window area, which surprised us, but it was perfect. The curry was absolutely a delicacy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UToW2rE8tIU3H1p7Z87vpg",
        "caption": "Photo of Zest - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UToW2rE8tIU3H1p7Z87vpg/o.jpg"
      },
      {
        "img_id": "auS76Le8SZBH1Lq8juLNKg",
        "caption": "Photo of Zest - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/auS76Le8SZBH1Lq8juLNKg/o.jpg"
      },
      {
        "img_id": "4HlocnyI5vlTY7r-3MphLQ",
        "caption": "Photo of Zest - Edinburgh, United Kingdom. starter",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4HlocnyI5vlTY7r-3MphLQ/o.jpg"
      }
    ],
    "user_id": "fm0W2wgqmriycWoGMaO4VQ"
  },
  "YvPeGpx6j_gLFF2EDWHe3Q": {
    "date": "7/27/2016",
    "text": "Very friendly staff and superb food! We booked a table at the window with very nice view, owner used to be a taxi driver and his special very tasty  curry P297 on the menu was named after his taxi car number, overall very good dinner",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j40o6-_n6sDdaAG3mfDrHA"
  },
  "x8l5-WNFrqmkJKFS_zLC8g": {
    "date": "12/20/2015",
    "text": "Just happened to run across this gem which is two blocks aways from Andrew Square. Took one of the two table overlooking the street. Really prompt service especially since we were very hungry after a walking tour of the town. Entrees came super quick so as to not let us starving. The curry base in every dish was great. Loved the food so much we ended up eating every meal for 2 days we stayed in Edinburgh",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FAUnKHm-0r4jaHU2knNVSw"
  },
  "p3xWaM3pCOIFRIvGBEHYIA": {
    "date": "3/24/2013",
    "text": "If you're looking for a lunchtime curry, Zest may fit your requirements quite nicely. Their lunchtime deal is pretty good value, and their food quite tasty. I didn't find it particularly \"zesty\" though, so one for the long list, rather than a must-visit essential.  Overall, we said: \"I enjoyed the food in Zest very much. For 7.95, this was a well-executed and filling lunch. Even the filter coffee to round things off was pretty decent. The whole place could use a big squeeze of the zesty goodness that the name of the place implies, though, as it's slightly in the \"solid and reliable\" mould, at the moment, rather than offering something bold and fresh.\"",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LURC3E0DoXYgN9aYTF3XOg"
  },
  "Ic7r38x2xosCjQVSmBgDhg": {
    "date": "8/16/2013",
    "text": "The people working there were so nice, I feel badly giving it only 3 stars - but the wine was undrinkable (gewurztraminer) and our vegetarian dishes were not the best I've had.  We ordered the aubergines, which were differently prepared than I've eaten before but pretty good, and the lentils that had the consistency of split pea soup & lacked flavor.  I almost fell out of my chair at how expensive our meal was, but I'm not from around here & am not accustomed to UK prices yet.   I appreciated that they were open late, otherwise we would have gone hungry!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NDYI_evbpw0asmpBR365eg"
  },
  "OhNQ_ZlDrh0kBn2ri5OV9g": {
    "date": "10/12/2009",
    "text": "Amazed this has no reviews on here already as it's been open for business for as long as I've been aware that Indian food exists I reckon. That said, for such a centrally located restaurant, my visit here a couple of months ago was the first time I've ever been in, although I did make a point of sending colleagues there earlier in the year and they liked it.   There's nothing major about the place to set it aside from much of the competition - prices are what you'd expect (reasonable and not astronomical), service was efficient and good natured and the waiting time between ordering and the food making it onto the table was negligible. The staff were though more than happy to make us \"the hottest thing going\" when asked and so we ended up all giving our tastebuds a roasting with a very hot, though not unpleasant, dish which we may have christened \"Satan's Ashes\" although my memory's hazy on that point. The rest of the normally spiced dishes were very tasty and the wine list was of a decent size and price, considering most folk probably opt for lager anyway.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "txzOZrHK9EVY0kYjSuXkKg"
  },
  "QJwQsIjbEy45-m2Q9WTrUQ": {
    "date": "12/27/2012",
    "text": "For a christmas meal out with friends I booked Zest due to location really rather than any form of recommendation. I am glad to say it was a great choice - the interior had been recently freshened up with the slight smell of paint still lingering. It was pleasant atmosphere and the food was even better. We had a selection of dishes and mixed them between us. Great flavours, service and price really respectable at about 25 pp for 2 courses and couple of drinks each. Would easily recommend and will be returning again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5y_4KmkywV9DMSFyoTcYdA"
  },
  "mkbipSpjNhgwUv5CxUKA2w": {
    "date": "7/10/2015",
    "text": "We came across this restaurant towards the end of our stay in Edinburgh, and I am very happy we did. For a very reasonable price, we got a fantastic meal with some of the best service I have ever encountered. On a prior day, we went to a crowded fancy restaurant, where I left just as hungry as I arrived. This was not the case tonight. My wife and highly recommend it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TSTSuCBA_Osh-TW3ROz0lg"
  },
  "P30qJ4lMXLZTHhG-zPHxdg": {
    "date": "6/24/2010",
    "text": "I came here in mid February, shortly after the restuarant had had its makeover under new ownership.  The interior feels light, spacious and the creamy decor helps to give a nice, relaxed atmosphere.  It tries to give a fine dining impression, but the spindly metal chairs and tables kind of let this look down.  The waiters are pleasant, and the service is about what you would expect in any restaurant. The food is by far this place's key feature.  The menu has a good range of authentic Indian dishes with plenty of meat and vegetarian starters and main courses to choose from.  Further, it tries to incorporate local history with its Indian cuisine.  For example, I had the Sir Walter Scott curry which was lamb in a really rich, tasty mustard sauce.  I'm not sure what the link between this dish and the author is precisely, but you can see what they're trying to do. Zest is also reasonably priced, making it a great option for lunch of dinner if you're in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RRFQLzm5q9cL2OFzjtoiCg",
        "caption": "Photo of Zest - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RRFQLzm5q9cL2OFzjtoiCg/o.jpg"
      },
      {
        "img_id": "_icitwYT9DkQtHpBWwtmQA",
        "caption": "Photo of Zest - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_icitwYT9DkQtHpBWwtmQA/o.jpg"
      }
    ],
    "user_id": "yfXqZkU5iXE07GSHzdsQBA"
  },
  "pC2B1TQztmqaZt-r3spXNQ": {
    "date": "5/1/2010",
    "text": "I love the idea of Zest, take some of the East's finest flavours and combine them with old Scottish Favourites.  The restaurant itself is a decent size, you only really feel cramped when it fills up (which seems to be alot).  Last time I was here I had the Salmon Tikka, which was made with freshly caught fish from that day. To say I was blown away is an understatement, the flavours explode in your mouth.  Staff made sure I had what I needed and prices overall were ok. Don't eat breakfast and go at lunchtime and get the group special. You'll be there for hours.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NVltxCAefelr6x0ZNYhZaQ",
        "caption": "Photo of Zest - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NVltxCAefelr6x0ZNYhZaQ/o.jpg"
      }
    ],
    "user_id": "9nUtGoOnZMPlZdUQV_aqTA"
  },
  "XgnKW4wEkS8073_HkR-O1A": {
    "date": "8/10/2014",
    "text": "BEST. CURRY. EVER. I Love the food here, it's all prepared wonderfully, and delicious. The staff is kind and quick too, always with a smile on there face! Definitely recommend it to anyone looking for a nice and affordable place to eat with great food! Try the Tikka Masala with Nan bread!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iwGFi4eGegYoztpysL0R1Q"
  },
  "Xdk0F5tI_mk1xWwtsvX5Lg": {
    "date": "7/25/2010",
    "text": "After a beautifull sunday in the town we dropped in at Zest. The service was good, the food from mild to really hot: great. We had a starter, two main courses and only one desert because then we were full. The bill was not as high as we feared after all the high prices we saw in the city.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e7mqQNIkE8OwaWIw5_iGLA"
  }
}