{
  "ew-zTWTuvCh0MGO56Acuig": {
    "date": "5/10/2012",
    "text": "If you are looking for the most expensive espresso macchiato in town, look no further - 2.45. I had balked when Peters Yard raised their macchiato prices to 2.20, but now I can see theirs is actually a steal. I have to say that the prices made it a bit hard to enjoy this cafe, which is a very pleasant space - wood floors, high ceilings, pleasantly and simply decorated. But I am just not convinced that the high prices are worth a trip across town - I did say most expensive macchiato, not the best I have had. There is table service, which makes a nice change from most cafes around town, but the service itself was a bit inconsistent. I was not greeted by any of the three servers behind the deli counter when I walked into the shop. Nor was I greeted by the two employees behind the register as I entered the cafe. We were served by two waitresses, for some reason. One was very pleasant, but the other one was not. I think that this could be a cafe that warrants a trip across town if the prices were more reasonable and the wait staff a bit more consistently pleasant and attentive.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rQSw2bmPyf0uAc3mueMTqw"
  },
  "GxWqcyIdp_4PbZtbbritLA": {
    "date": "8/17/2012",
    "text": "Once upon a time this flag ship store had unrivalled customer service and great customer service. The deli remains very wonderful with an amazing selection at dizzying prices but yesterday I wanted to show my husband the vin cafe situated at the back of the deli. A waiter said we could sit anywhere. It was not busy with only four other tables taken. Four waiting staff. After a few mins a waitress gave us the menus and five mins later came back to take our order for two cappuccinos , no breakfast. It was not busy. Other tables had ordered breakfast but after ten to fifteen minutes still not sign of the order we made. I turned around as people who came in after us had been served with coffees so I glared at the waitress. She said the coffees was on the way So what for an apology. After five more minutes I turned around again and looked at the barista who had completed our drinks waiting to be given to us. She obviously go the hint and brought the coffees. Small cups inadequate handles for people with rheumatism  you cant get your fingers in the handle. Coffee was weak and very cool. I asked for a glass of water and extra sugar as none are found on the table and she forgot the sugar so once again I had to find a way to get it myself. Just don't buy anything big here as it is a real ripoff. I did not tip. I even sent the official website my feedback. They got back in touch and gave me 30 compensation and an apology from the MD. So I am changing my star from one star to four as they admitted there had been a problem.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OEuPTkrcEdaOjGfXFVuFRg"
  },
  "FdJHtnmFheV8OKcTf-AzWQ": {
    "date": "8/6/2010",
    "text": "I love this shop! There's not much else I can say... I just love it!! It is exciting and fun to shop there - I always find something new to try. It's beautiful!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jo7r2YHS_-mqutpB2k1nPA"
  },
  "N9DZ681yhPG0uklXCvjggQ": {
    "date": "11/19/2008",
    "text": "If you like eating Italian then this is the place for you. More so if you like browsing Italian, then get right down here. What a range of food and wine. If you cant find what you are looking for here then forget it. Apart from Rome airport, I have not been able to find my favourite desert wine anywhere but here. they were selling imported Polish vodka before all the local polish shops opened. bread with rosemary and sun dried tomatoes topped with an excellent olive oil and accompanied by antipasta and cheese from the deli counter. Just one of the treats I look forward to after a visit to this institution.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "awto1-gW36q0avBVDGf_1g"
  },
  "S32xRQZ3wM1H-bjEwZdttw": {
    "date": "2/2/2012",
    "text": "A truly astonishing range of groceries, cheese and wine. At rather astonishing prices. The quality is great just about across the board here and for my money it's the cheese and wine that are the stars of the show  an incredible selection of both with great Italian favourites. But the prices really pack a punch. I'm all for supporting local specialist shops, so this place gets my special foodie treat money when I can afford it. The vegetables are wonderful too  flown direct from Italy (first class I think looking at the prices) but are just out of my league; but the bread is strangely disappointing. The cafe is a great visitor spot  I always come with my Mum when she visits  but the prices reflect those in the rest of the shop so be warned!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v25t0v4J_zTflOUkeXwAJg"
  },
  "HKDpa8bvimKPMRexCX8Fbw": {
    "date": "4/29/2008",
    "text": "V&C is a lovely italian, family run, delicatessen. The branch at Leith walk has a large selection of food and drink, as well as a bright, comfortable coffee shop. I believe that they also serve food in the evening. Freshly made bread and sandwiches can be taken away, and there is a counter with a selection of meat, olives, cheese and baked goods. The other outlet at Multrees walk also has a smaller shop and a coffee shop with an outdoor seating area for the summer months.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DzCwPmHIz0KaTYGuR6gs-Q"
  },
  "EdHj8unjClHbc9c9YB8NtA": {
    "date": "6/6/2008",
    "text": "Valvona & Crolla is an absolute delight, it's a throwback to the past in quality and variety of products including freshly made breads and sweet baked goods, organic veg, an impressive wines and spirits selection, specialist cheeses and home made take away food such as soups and ravioli. There's also a lovely cafe (with stunning carrot cake) and a gift shop selling a variety of luxury and kitchen and household goods as well as a book section. V&C is a very pleasant assault on the senses, the best deli in town and it also doubles as a Fringe venue in the Festival, it's well worth a visit for any visitors to town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lO5LwtjeGx6IdKxXKvzTiA"
  },
  "nYU4_bT5ZK2uXqta8qxzKw": {
    "date": "11/19/2008",
    "text": "I am originally from Edinburgh and when I visit Scotland it's almost essential that I visit Valvona and Crolla. It's a tradition. This place has been around longer than I, and I have a great respect for Italian produce because if the upmarket V&C. The selection of olive oils, the selection of coffee, the selection of red wine, the selection of quality pastas, the fresh counter with the most mouth-watering anti-pasti's, cheeses, fine Italian hams.I could and do spend a small fortune when visiting, but one thing I'm always sure of is quality and pure delight! Do visit if you're in town, it's a True gem and a magnificient piece of culture within Edinburgh. They also do wonderful hampers - great Christmas gifts and you can order online!!!....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W-lYhvYHboN3qAU-MyaOWg"
  },
  "o_w-43GD47dkizMayaIukg": {
    "date": "11/22/2008",
    "text": "This is a definitve Edinburgh experience, and if your a foodie, absolute heaven. Old fashioned, expensive, passionate. I love it, it's pointless writing a long review- just go, but go early, the closer it gets to Christmas, the busier it gets.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QD0oHlPEgoeDrAeiNNPUUw"
  },
  "1P-Pyu8wr0XP-3Znoa2JNQ": {
    "date": "11/2/2007",
    "text": "As The unimpressive Leaky Cauldron in Harry Potter hides a magnificent and bustling street of magical activity, so a small, unobtrusive shop front in Leith Walk can conceal an Italian cavern of such wonders that even Rowling would be hard pressed to dream up.  Valvona and Crolla is a huge, cavernous shop with walls lined to the ceiling with Giant pasta, herbs, sauces and everything imaginable relating to Italian cuisine. Now, cooking for me is a simple, economic exercise. I have only ever once bought brie, and that was because, weirdly, it was cheaper than the cheddar. The cheese counter in this lovely shop, however, is enchanting, and does not need to be seen by a hungry or culinary adventurous eye. It just needs to be seen.  Winding deep into the shop, you will come across baskets of succulent muffins and pastries, glistening with divinity, and a cafe, whose hot chocolate is exactly that: chocolate warmed and melted, served with milk. Heaven.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x-xinceFIUsjPutqNBiAaQ"
  },
  "ctMIugoz_zn5T0GlBrfiEw": {
    "date": "11/26/2008",
    "text": "Valvona & Crolla has two stores in Edinburgh I think  1 is at the top of Leith Walk and the other is next to Harvey Nicols. I have only been to the one at the top of Leith Walk and love the selection of Italian goods on offer in their deli section. It also has a cafe however I don't think this offers good value. While I love the selection of stuff in their deli, I have to say the prices they charge are way over the top. All in all it is a great delicatessen but FAR too expensive for what you get.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CA2Bnb04pIIE8tVveMDdfQ"
  },
  "364Fa0OSdgBMZiF19z4hMg": {
    "date": "11/4/2011",
    "text": "I have fond memories of visiting this shop as a child. My mother went to school with the owner Gloria who was lovely. I went with another italian friend a few years ago and did not find the younger generation friendly at all. The shop is now vastly overpriced and i never met an italian who could not make good coffee. Disappointing",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qcJB2izHbb17WzJKRh23lw"
  },
  "bCB8Gkgzcn8rrpcArhjrqw": {
    "date": "1/4/2011",
    "text": "What a great selection of Italian specialty goods. Being Italian, there is nothing more frustrating that not being able to find things like polenta flour in an entire city of grocery stores. If it's Italian, chances are they'll have it. Valvona's baked goods are RIDICULOUSLY good, and their cheese selection is quite impressive. Whenever I throw a dinner party, this is my go-to place for things like wine, cut meats, cheese, and other hard to find specialty packaged goods. My ONLY complaint (if you can call it that) is that they don't have a wider selection of cut meats....But what they DO carry is top notch quality. It also helps that Mary (the owner) is as sweet as their flourless chocolate torte (a must try for anyone who loves chocolate).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gRSV1IS-Ymqg1g10Q-09bg"
  },
  "J001v8-TShDfhPpqEL3vww": {
    "date": "9/22/2010",
    "text": "Wonderful shop with a fantastic selection of food and wine. Great for Italian Christmas hampers. The one in Leith has a really good cafe.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KptRg8Hdt8AqApGfR0c-NA"
  },
  "4vP19rV65cl8ddaZMKP3Nw": {
    "date": "10/17/2007",
    "text": "Valvona and Crolla is just one of those Edinburgh places you have to visit. It's one of the oldest delis in the UK and is still family owned. Long and thin, the whole places is an absolute assault on the senses - the moment you walk in you can smell the cheeses and sausages and bread and biscuits and coffee all piled on shelves that reach right up to the high ceilings. There's a giant wine section; gifts; fresh produce; a bakery section; shelf upon shelf of pasta Really good-quality stuff, with staff who miraculously seem to know everything about the place, despite its size and complexity. Things for students to look out for: free bread samples, so that you can try the delicious balsamic vinegar and olive oil. There's also a rather posh cafe right at the back, which I've only been to once and long ago, but I can still remember the mouthwatering pastry I had. A word of warning - for Christmas presents go now - the narrow walkway just gets too busy in December!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WlEmCagvi8Oqf0vjtv21vw"
  },
  "SPcRNxqk05T2TzNErRK4HQ": {
    "date": "11/2/2007",
    "text": "Valvona & Crolla is the French cartoon of a deli come to life. You enter and immediately feel as though you are on a film set- there's no way all that beautiful food can be real, can it? Yes it can! Let's get this bit right out of the way first, before you fall in love: it will cost you dearly. This place is not for the budget conscious. It is, however, for the gourmet chef, the afficonados, and the people who choose one day to splurge. The cheese counter alone is legendary- and contains my favourite chevre of all time. It sets me back 4 quid for about 80g- so its unfortunate that it is so so so good as I rarely have that kind of money to spend. The alcohol selection ranks among the best in Edinburgh, easily, the bottles displayed like a parfumerie, and the olive oil and balsmatic vinegar (with free bread and tasting bowls to sample!) are mouthwatering. The range of pasta- as you'd expect of an Italian owned shop, go beyond your expectation I mean we've all heard of squid ink noodles but- blue curacao fettucini? Sublime to the point of ridiculousness. The bread is made by flour stone ground in Canada, the produce shipped in from Italy, the wines are from everywhere (but it must be mentioned, the company does import the most Italian wine than any other Edinburgh shop). The service can be a bit slow and I found some shop attendants, alternately, snobbish and more worrying, unknowledgeble about the products they were serving. But if you already have an inkling about these things or are willing to go out on the limb (and with the pocket book), this is the place for you. The one sour note that hit, occured (twice) with the quiche, so I would steer clear of that in the future- and my suggestion to the budget conscious is to purchase obscure items there, a la cheese in particular, then head three minutes away to Tattie Shaw's for the produce (as two garlic bulbs cost me over three pounds at V & C). If money is no object and you're a devout foodie, you've found heaven. Truly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pmTK1ccGVZLlC1GXRewlDQ"
  },
  "tNl1Ex3zrPEfGdEPgjkQZA": {
    "date": "11/10/2008",
    "text": "Arrived tired and harassed, pregnant and with a toddler and buggy in tow so did not appreciate the several steps up to the cafe, especially with a young male bystander doing nothing and waitresses in abundance staying well out of customer reach.   Waited with starving toddler in a very cramped queue in the half empty restaurant while a waitress looking and acting like a young Anne Widdecombe took well over 5 minutes to seat the group of 3 in front of me at one of the 11 empty and unreserved tables. Toddler, understandably couldn't fathom the delay and kept trying to drag me into the restaurant. Eventually, i was commanded to leave my buggy at the back, and marched to a table. I asked for the loos to wash our hands. Said waitress directed me and small toddler down (and back up) 20 steps. Some 10 minutes later we returned only to wait overly-long for the menu. It arrived without a childrens version, which i had to enquire about for them to bring it. I then asked for bread to keep toddler quiet which took ages to come. Meanwhile a very helpful, pleasant and smiley young blonde waitress appeared and brought us a plastic cup and extra napkins which i had asked for.   I ordered, distractedly, an oily mushroom pasta which i think was about 10.00 and worth about a fifth of that. Kids options were limited and unexciting so i chose a tomato gnocchi which was in fact surprisingly good and good value at 3.00 for ample portions. Toddlers seat was dangerous - it kept falling off. Did not bother to try to attract attention for the bill, but went up to the register to pay. As we left i noticed a disabled loo and I think babychange(?) at the back of the resturant which we could have been directed to in the first place. This place trades on its name and the look of its shop. Do not go here unless you are both monied and foolish!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8t6Z7K56-4gqoclGCUBlJQ"
  },
  "VXLK3llfIj1__LSs6qU0yw": {
    "date": "11/30/2008",
    "text": "I love this place!! Everything they sell is absolutely delicious. Lots of specialty food that you cant find anywhere else.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ySM2hhVvRKlEfgw9480yng"
  },
  "rVcFkPHF7b49eRcdO5AsCg": {
    "date": "8/25/2008",
    "text": "I was very disappointed by my visit to Valvona & Crolla after what I had heard and read about the place. Being Italian I was looking forward to it so the opportunity arose when I visited the Edinburgh festival. I have to admit that it is very difficult to find a proper Italian deli in the UK. I am used to buy my wines and a few more products online but no more than that so this time I made sure I had plenty of space in the car, I was hoping to come back with plenty of Italian food and wine, the one I drink and eat when visiting my family, and set off to my Italian discovery shopping experience. All my hopes disappeared when I entered the Valvona & Crolla shop, when I started reading the label and found that the product on sale were all average Italian supermarkets products with a very dear price, and not the one I would buy. The Valvona & Crolla branded products were made by big Italian companies and the only few good wines they had, but nothing more than the ones available from supermarkets, had an excessive high price. As this was not enough, we decided to stay for a coffee, it was 4pm and when reading the menu we found the affogato and ordered it. Again, another big disappointment.. The affogato we received and we paid 3.95 was not more than a ball of vanilla lost in a poor espresso I left the place empty handed and promised myself I would never be back, at least to buy Italian food and wine or for an affogato, and will keep ordering my wine online. I have recently come across a website called <a href=\"/redir?url=http%3A%2F%2FItalyabroad.com&s=0898958bf4a867cdbe66173f57b476b2c27d8b8f73f1d6c6a5d675554a6a4beb\" target=\"_blank\" rel=\"nofollow\">Italyabroad.com</a>, specialised in Italian food and wine made by small producers and so far I haven't been disappointed yet, they offer fantastic Italian wines and food made by small and real producers at a good price.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oRuZEmdGw5ELwnaGcCNStg"
  },
  "Sy9yH0uVekKO2ybvF7wuTw": {
    "date": "6/13/2012",
    "text": "Fancy a treat? Get yourself in here and indulge! The deli is a True feast for the senses ... then go round the corner for the fresh bakery and the bottle shop, then up some steps for the kitchenware shop and the cafe. My Grandma shopped here in the 1930s and always sang its praises - and I can see why!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0S2KCUzFvnWvlRWaDMz7Ng"
  },
  "ZG-956a9S8Rfz-HhDGiSww": {
    "date": "1/12/2011",
    "text": "I went there for brunch on Sunday and it was really rather good.   In fact, I don't think I can really say anything that hasn't already been covered in the other reviews so I won't waffle on!   4 badger stars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JA6uRiy32Dj2Lppq597wxg"
  },
  "yzB3xe-yJ9T3FW6l-mpXMw": {
    "date": "1/18/2011",
    "text": "On first glance it looks like a delicatessen. However if you walk all the way through there is a hidden cafe at the back.   Went there for brunch and it was lovely. The coffee was delicious and they come in really large cups which is always a winner for me. Food is a bit pricey but was lovely. Service was also really good, they made my own type of continental breakfast for me!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oaCyww7fGQOzvbSFT07Wrw"
  },
  "4L3sbz8Nq-WBhJJtSLXEAw": {
    "date": "3/1/2010",
    "text": "My wonderful Grandmother often hops on the train to Edinburgh to take her poor student granddaughter (me) out for lunch. Valvona and Crolla is the top of our list for an afternoon of playing ladies who lunch.  The menu covers a range of Italian dishes that are far more exciting than your average pizza and pasta affair, the range is so vast that it will satisfy even the pickiest of eaters. The food is fresh, delicious and well priced. But the real icing on the cake at Valvona and Crolla is the desserts. You must save room in that already satisfied belly as you will not be disappointed. I insist you try the Chocolate Torte, which is in fact a little slice of heaven served beautifully on your plate. The last time we visited my dear old Grandmother charmed the young waiter into giving us the most gigantic slices of Chocolate Torte I've ever seen, I swear my thighs are still carrying it around.    But it is so worth it. The combination of the great service and fantastic food make Valvona and Crolla well worth the visit (and the calories).",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oKdygoDX5CfDJeXzv_EVaw"
  },
  "mNVu0iaMxhUd7DMTSEMQ0g": {
    "date": "6/3/2010",
    "text": "I used to come in here when I was but a small slip of a thing (and I'm still vertically challenged to this day), and survey with roving, greedy, wee eyes all the delightful edible Italian delicacies. Valvona & Crolla seemed neverendingly big and full of everything then, and I think to an extent it still feels that way now. My family still come here to buy their pasta and parmesan, and have been doing so for more years than they probably want to be reminded of. To summarise all my nostalgic warbling, this Italian deli is absolutely legendary, and has that comforting, family run atmosphere to it that makes you come back again and again.  The tall shelves behind the long counter display a vision boggling array of goodies, and give V&C that feel of tradition and a long history of successful business. Choose from every pasta under the sun, amazing bread, cheese galore, coffee, salamis and meats, and of course, a brilliant selection of wine. Friendly Italian banter, plus every Italian culinary product you could wish for, make this deli just awesome.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Mujjzv-ZH6HhxT-hWCpVg"
  },
  "EbO3DMYai8_XGMb_1EGzHw": {
    "date": "7/30/2010",
    "text": "This has to be Edinburgh's number one deli. This little place is absolutely packed with sauces, wines, cheeses and meats.   The front of the shop is quite narrow and is filled with Italian foods and has fresh meats and cheeses on offer at the deli. Behind the deli the high wall is dominated by a whole range of bottles. Indeed, it is so high that the staff don't use a ladder to get a bottle down, but instead use a gripping device....I would be very nervous indeed using that, many bottles would end up smashed on the floor if it was me!   The shop is full of tempting smells and the smell of fresh bread always leads you to the back of the shop. And there you find a large selection of Italian wines, a lot of very good red wines.   A good bottle of red, with some fresh bread and cheese...I would say that's a good shop!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0-wo7wKN_Rp0Xs6cBMEDJQ"
  },
  "TUEW8lcDLBzvmGEvMB6luA": {
    "date": "7/22/2010",
    "text": "An absolutely outstanding deli, I would go as far to say probably the best I have been to in Edinburgh (and even Glasgow), and I just wish that I lived closer so I could eat from here every day.  Every meat and cheese variety you can imagine packed into this wee treasure trove of a store. I particularly love the front window which is covered in miniature bottles of alcohol, every single thing you can think of, it's so cute.   You could spend an hour in here picking and choosing food, but you would maybe have to have a few extra quid in the back pocket to fund your meat and cheese habit!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iFRMcdjGCvFPVlc6qXRCCA",
        "caption": "Photo of Valvona And Crolla - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iFRMcdjGCvFPVlc6qXRCCA/o.jpg"
      }
    ],
    "user_id": "Cy1PV2TdYeDFA16mUOlr3Q"
  },
  "5wlDl1mLIZOQR8HqEMkOcw": {
    "date": "1/7/2009",
    "text": "Watch out for the low flying cheeses and sausages.  Im not sure Health & Safety would approve !!!  ;-P",
    "rating": 4,
    "rated": {
      "funny": 10,
      "useful": 9,
      "cool": 9
    },
    "photos": [],
    "user_id": "ZeiM3Uspn6CUThUBt03JSw"
  },
  "yOALaZlbiMpvFyiyx_6e_A": {
    "date": "7/27/2008",
    "text": "A longstanding Edinburgh tradition, Valvona and Crolla is an awesome delicatessen, with an amazing array of food and drink.   From gorgeous cheeses and cold meats to rare Greek brandies that you can't buy anywhere else in Edinburgh, the experience of V&C is one to savour, slowly. And keep your eye on how much you're spending - you get what you pay for, which is reliable quality in every purchase.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EAXWjnCLv5l_rP6sszQNGA"
  },
  "V3o-tYrGl2EDe6pFYSZRsw": {
    "date": "5/19/2008",
    "text": "Walking into Valvona & Crolla is like walking into the Tardis: the store looks tiny from the outside, and I'm sure there are thousands of people who walk past without even noticing the place.   Once inside it's you'll be amazed at the quantity and quality of fare on offer. The shelves are packed from floor to (very high) ceiling with delights from all over Italy. Be careful at the deli counter, the very reasonably priced meats are right next to the very expensive fresh pastas.   Try to get in early if you're visiting at Festival time or around Christmas as the store becomes almost as packed with customers as it is with goods.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TSeMWiOcZwafXWeENOUVCQ"
  },
  "794ovzUPJmByVZpvQZrRwQ": {
    "date": "2/13/2013",
    "text": "Love the rosetta rolls and the bombolini. Some of the food is very pricey but you get what you pay for, I suppose. I tend to buy one or two very special things to accompany other bits and pieces from the supermarket. It is somewhere that quality matters.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hbapKIUn5fxSmsqATcMo7Q"
  },
  "oQG7S5lNV8iEJ6d5IEflKw": {
    "date": "11/30/2008",
    "text": "One of the must visit places of the city. It's about a 20min walk from mid-point of Princes Street. An old favourite, it's popular with tourists and locals alike. Not the cheapest of places but you are paying for quality and authentic Italian products.   Full of atmosphere with a great selection of foodstuff and a delicounter with amazing selection of cheeses, not just Italian, but from all over Scotland. It's like an aladdin's cave for foodies/gourmets!   There's a cafe which isnt massive so expect to queue when it get's busy. Of course it does fantastic coffee and cake!   If you are a first time visitor to Edinburgh I recommend you make this one of your stop offs.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ELmQNfR_oGEcecj8Wmh4zQ"
  },
  "8QVBxakKVn-G_SmC_IDyJQ": {
    "date": "1/19/2009",
    "text": "Valvona and Crolla is a real Edinburgh institution. I can remember visiting with my parents when I was little and being fascinated with the sites and smells inside this place.   This a a real old school delicatessan selling a huge variety of stock and anything you could possibly want from Italy. Their cured meats and cheeses are mouth watering stuff, but do expect to pay for the priviliege. They also do freshly baked breads and rolls which are so lovely. Then there's their fantastic selection of alcohols and liqueurs, if you're looking for something obscure you'll definitely find it here.   I can understand other posters when they suggest it's crampt and busy, but i think this adds to it's charm and makes it a perfect place for people watching.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mu6xEHThck91bAyD38XuZQ"
  },
  "1o0g0ymmHl6HRgrg3KEM5w": {
    "date": "7/23/2011",
    "text": "valvona & crolla on elm row (top of leith walk) is the flagship shop for this long-established, edinburgh-based italian family business. they have one of edinburgh's finest selections of italian groceries, cheeses, antipasto, oils and wines. plus a whole lot more yummy stuff too long to list. there is no doubt that shopping here will bring you great foodie joy (including great wine joy). sadly this passion doesn't seem to extend to coffee. at the back of the store is quite a large and pleasant cafe that does alcohol as well as food. i had a flat white which was too hot and weak. you know this also means that the milk texture was non-existent. i've had this same experience several times  such a shame when the food and wine is so great. i continue to be amazed by folk who clearly know what they're doing with food and wine but who don't consider coffee with the same rigour. this isn't confined to v&c by any means. plenty of excellent, well-reviewed and highly regarded restaurants are the same. much coffee evolution yet to occur in our tea-loving part of the world! <a href=\"/redir?url=http%3A%2F%2Fedinburghcoffeelovers.blogspot.com%2F&s=47cb50a04dcbf1685d7e5617e7d2ff7d74789e9d1b9310e46ae725be053e7eb6\" target=\"_blank\" rel=\"nofollow\">edinburghcoffeelovers.bl...</a> twitter: @edinburghcoffee",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NvIqUNTjN5N_7cbHWCJwRw"
  },
  "-dpxGvl3yo5cu8AYsgwedg": {
    "date": "11/18/2008",
    "text": "This was one place I wanted to visit on my trip to Edinburgh so that I could compare it with my local Deli's. Whilst it is impressive it wasn't as bit as I'd imagined so didn't stock the range of goods I'd expected.   The bread was very fresh so we treated ourselves to a mini packed lunch to take ont he train home, this we managed to do for less than 8 for two people which wasn't bad.   One thing I did notice was that the brand of cream they sell is the same as my local Lidl's.   I'm sure while we were in there Clarissa Dickson Wright was there too so nice to see the owners pop in.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YwNFelgaoG7DvPShWzuwIA"
  },
  "vfz_rQjYiFgETfwPK00XAw": {
    "date": "12/12/2009",
    "text": "One of the oldest Italian Delis in Edinburgh, if not the oldest, Valvona and Crolla hides a pleasant surprise if you walk through to the back of the shop. Tucked away at the rear is a surprisingly large bright and modern looking cafe. All light wood and roof windows, it's a very pleasant space that seems popular with locals and savvy visitors; it's a bit off the beaten track tourist wise, but just a few minutes walk down the road from the Omni Centre which is itself just beyond Princes Street down.   Had a pleasant enough brunch in the cafei. Lovely croissant, great breads, good bacon butty, and tasty vegetarian breakfast which included grilled polenta, roasted and grilled italian veggies topped off with a fried egg. Mmmmm. Bit more expensive than the usual cafe fare, but a nice treat.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_urJB4LxxxZmUfo00HptQA"
  },
  "RF6KptElbXT1HnCDm9isCw": {
    "date": "11/30/2008",
    "text": "This deli is really a very special place in the hearts of many in Edinburgh. Going since around 1934 , it is a little island of Italy in the capital.   It has an outstanding range of all kinds of italian produce, olive oils, vinegars, wines , pastas , chocolates at the rear. A section with delicious italian bread and bakery including italian doughnuts and fabulous meringues. Also a section for fresh fruit and veg including some otherwise hard to find items. At the front of the shop a very extensive deli counter with all kinds of cheeses and salamis. Also a range of ready prepared sauces and things like mini quiches to take away. Very delicious. ! In season a christmas shop at the back with is a good place for foodie presents, including cookery books, some written by one of the owners. Also a cafe/resaurant at the back. Not the cheapest place but with great quality and attention to detail. I have always enjoyed what I have eaten there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3LW_w3POTvwjl0gY-rHmmw"
  },
  "wCMJIchR_5AN85PcP-2sfg": {
    "date": "1/8/2009",
    "text": "If the house in Hansel and Gretal really existed and it was made out of Italian meat and cheese rather than sweets and chocolate- Valvona and Crolla would be it. I bet you even the wallpaper in this place tastes good. Valvona and Crolla deserves its reputation as a landmark in Edinburgh with produce this good. The cafe area upstairs is great if you're looking for some crostini or a nice salad but I'd recommend you just spend your money on tasty treats to take home. More than just a deli, this place is really special. Just read 'Dear Olivia' if you're looking to be sucked in even more. I love it here.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "F7o19Xwgh-Qtg-8zgkFNiw"
  },
  "MZZIVqwHVEp_vd_5vYrKQA": {
    "date": "11/15/2010",
    "text": "Located at the 2nd floor of Jenners. This place is massive! There are lots of different wines and spirits, chocolates, health food, organic food, spices and herbs, and lots, lots more! You can find some of Nando's sauces there, too. There is a coffee shop facing Princes Street and the Restaurant (well, serving breakfast at the time we were there) on the other end. There were also lots of food from different countries available. We tasted the fruitcake and it was splendid. Good shopping for christmas prezzies. It's on the pricey side but the quality is superb. One thing though, there was no one really available to ask about some stuff. Had to ask help from the lady behind the coffee counter who went searching for the one in charge. After which, she did help us with our questions. I'll come back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kcmnNN6PhjwDoyZ6SFVuTQ"
  },
  "BA3_hkOOg5PW-zXF-3LO7Q": {
    "date": "10/25/2009",
    "text": "I really like this place. Great variety of cheese and deli meats. A little pricey but good quality foods!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6gMVDCeUJsJ_X6_R4tg0UQ"
  },
  "qcHYjS0rZ0xTN6295SuueA": {
    "date": "3/15/2016",
    "text": "The service here is always impeccable, meaning I was happy to wait 10 mins for a table, as they worked through their busy lunch rush.   On this occasion I went for their special 'Taliere di Formaggi' with a glass of the recommended white. After getting over the initial shock that this wasn't tagliatelle but a cheese board (I misread the menu, in what can only be described as an extreme, post-yoga, hunger frenzy!!), I tucked in and it was delicious! So good in fact that I was prompted to buy some cheese from their deli counter on the way out.   Once again visiting here was a resounding success, I would definitely rate it with 5 stars!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9bX2EZimy16NvYHiQoRY5Q",
        "caption": "Photo of Valvona And Crolla - Edinburgh, United Kingdom. Tagliere not tagliatelle!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9bX2EZimy16NvYHiQoRY5Q/o.jpg"
      }
    ],
    "user_id": "j8FLszyM98srKnasj86mdw"
  },
  "hdGU0RUJA_Wt5V_QMo6RVg": {
    "date": "6/3/2017",
    "text": "What a great find. It's a traditional Italian deli in front and a restaurant in back. On our second visit in two days, today we shared the eggplant Parmesan and bruschetta. Both were soooo good. My wife said it was best meal of our four week trip so far. Prices are fair. Yesterday we shared the cheese plate and loved it because our favorite (and expensive) cheese was included as one of three. Definitely consider this one if near The Playhouse.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zG70VGOHDl6DDv5_TmjF4Q"
  },
  "kjHEZDydShbHg9g6Qy6WZw": {
    "date": "10/17/2017",
    "text": "The first time I entered in the shop, I did not expect to find all these products and such a big space. Outside, it seems like a regular Italian grocery shop. Inside, it is a shop full of products from Italy, a bit from France and Spain, which seems so delicious. The cafe in the bottom is quite pleasant, with some organic drinks. Their breakfast is really good, the toasted bread and the scone with the jam were delicious ! I recommend that place, full of promises !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tPfrpaCzBeE6tqKq6FniYw"
  },
  "nAMekTXhhsCybPwp8SjxzA": {
    "date": "9/2/2015",
    "text": "It's so nice to walk through their amazing shop on the way to the cafe as it gets you really excited about good food in general.   Went there on a recommendation of a friend and it did not disappoint. Delicious wine too... and courgette flowers in a starter is cool :)  Loved the olive oil and balsamic so you should def get bread if you're eating there- it doesn't come automatically, but is delicious",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "36uUEnzBM52pjB7hDlPSmA"
  },
  "d8G_XamqsCny6LT6kYqkjA": {
    "date": "8/10/2015",
    "text": "Recently had a lunch there, I ordered the scallops which was brilliant! Since I took a late lunch at six o'clock, I didn't try other dishes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Hd4cjsIH_xFjEFqLjwG_9w",
        "caption": "Photo of Valvona And Crolla - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Hd4cjsIH_xFjEFqLjwG_9w/o.jpg"
      },
      {
        "img_id": "TcVy3U4BwBbpDEbyXct2dw",
        "caption": "Photo of Valvona And Crolla - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TcVy3U4BwBbpDEbyXct2dw/o.jpg"
      }
    ],
    "user_id": "nVgS5-Lmgoz4MJU06RpuBA"
  },
  "PqHpyqzWTRrakSN1JA4bnw": {
    "date": "12/31/2014",
    "text": "Had a lovely lunch today at Elm Row.  Really impressed with the aftercare.   Had two waiters who had style and grace. They both had well groomed breads.  I was hungry after my mains and had a roast potatoes side at the end of the meals! Completely back to front! They didn't skip a beat. They were delicious as was the polenta, rocket and pine nuts mains I had before. The sauce on my dish was gorgeous. Can't place it, love the mystery. It didn't matter as I nearly wanted to lick the plate!  My friend had a aubergine dish. She loved hers.   Thankyou. Happy New Year!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 5,
      "cool": 5
    },
    "photos": [],
    "user_id": "VSQyBAZyifo1kxA-ChkP9Q"
  },
  "oyDBv6OHRiEx8aWulK-lDQ": {
    "date": "4/3/2014",
    "text": "Valvona and Crolla is definitely all about the space - or lack thereof. As you walk through the door, you gasp with surprise as you take in the shelves stuffed up to the ceiling, and everything else that is suspended from the sky. Deli counters about, and after winding your way around the counters, looking at frou frou oil, frou frou jam, frou frou chutney, frou frou... you get the picture, you find yourself in a lighter, brighter space, ready for eating. It's perfect, you have been lured into the lair of the coffee woman.   It's not cheap, but it's delicious, we shared an antipasti dish complete with char grilled vegetables, mozzarella and olives, fat and juicy. We drank from Italian soda cans. We ate some lovely orange semolina cake. We paid the high prices, and didn't regret it. So it's not an every day kinda place, and the setting in the cafe is spartan, we did still have a lovely time there, so I'm perfectly happy to recommend it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "X2uF3C3YBD24xcgKA104Sw"
  },
  "kCsKjpfjHpOHWAB21hSQgw": {
    "date": "2/12/2014",
    "text": "Extensive. That's the word I would use here.  Expensive would be another one...  The shop reaches all the way down and around the corner. The walls are laden, fit to burst with all manner of things from cheese to cakes to whisky to chocolates. There's sausages hanging from the ceiling and a wonderful selection of those fancy Italian cakey things!  I came in here recently, needing decorative edible flowers (aw yeah, dinner parties in my gaff are all about class) and  fully expecting not to find any. Low and behold, there they were, in the exact shade of blue I needed.  5 stars for serendipity!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "KPY6FvT6h-r0W0HAC1Buag"
  },
  "4b3yrFWMoy8DO6-0N23hcg": {
    "date": "7/14/2014",
    "text": "A cute little Italian gourmet shop. Totally unexpected to find in Scotland. Good variety of wines and beer too. Cheeses, meets, pasta, sauces. They have it all. With a little bistro in the back. Outside of the more touristy areas and not as easy to find but definitely worth a visit!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dXQJ_OM2aLwejWRlfE9Vbg",
        "caption": "Photo of Valvona And Crolla - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dXQJ_OM2aLwejWRlfE9Vbg/o.jpg"
      }
    ],
    "user_id": "B3DNjsZ3gRRsWYro4auztg"
  },
  "-p5aSMaymqZRAIqWyzaIrA": {
    "date": "3/17/2014",
    "text": "AMERICANS and ITALIANS who appreciate lasagne that has not been pre-cooked... this is your savior. Not even Lupe Pinto's my favorite little shop in the universe has lasagne that has not been pre-cooked.   I will not explain myself to you UKers who say \"But who cares if it's pre-cooked\"? \"It's the meat and cheese that matter\"\"What is the difference?\" or my favorite, \"I can't taste any difference\". You and your bad opinions are wrong. You know what? I feel the same way about instant mashed potatoes (not True, but using for effect) - how do you like THAT?   Valvona and Crolla has many, many good attributes, which everyone else has already written about. So I am here to tell you about Valvona and Crolla... the only place in Edinburgh to get un-pre-cooked lasagne.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WrMDMbEt9ap0VbmNsnKvKA"
  },
  "5l3GrTJgXapg0ZTPfQf9Rw": {
    "date": "6/10/2015",
    "text": "An amazing find!  It was clearly our favorite place to eat while on vacation in Edinburgh for a few days.  I did not realize how much of an institution Valvona & Crolla was.  We were so excited to see , that we ended up visiting two other locations and ended up eating at Valvona & Crolla 4 times in 8 days!    I had a meat and cheese plate for breakfast and it was incredible.  I also had the Papardelle Ragu (at the Multrees location) which was also very good.  The service at all locations was outstanding.  I've seen some notes about the service being slow and I don't know if that's an American thing.  Most times I've visited Europe, every restaurant let's you sit and enjoy rather than having you feel like they're pushing you out the door to seat the next set of patrons.  Similar to other restaurants, the only time it is \"slow\" is when it comes to the check.  I would highly recommend Valvona & Crolla to anyone visitng Edinburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FHinaw7EorzsRO0AYcgjzA"
  },
  "53vR-6QAkoUEeROB3914Cg": {
    "date": "2/10/2013",
    "text": "Was delighted to get gift vouchers for here for my birthday and had so much fun spending them :0)  I bought their own brand prosecco which is delicious and highly recommended. Also stocked up on pasta, olive oil and chocolate.   The shop is so nice to just have a wander around.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "rVEQ7nG4Bo7utMcqURxaIQ"
  },
  "3jgTLRLwvQ-72S6SGwQg5A": {
    "date": "5/19/2013",
    "text": "Overpriced but interesting shop.  Things to buy here   - chocolate donuts, they use a real ganache and they are only 1.25, rest of the pastries are crappy italian versions of french things.  - some of the fresh vegetable can be a real steal, sometimes they have purple sprouting broccoli for like 2.50 a kilo!  Edinburgh institution so probably worth a visit. I feel lucky Edinburgh has this but hardly shop here apart from the aforementioned products.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hbRDTyoHgeqUC-NLVlXR_w"
  },
  "hJ3x6MWM2OOluKLn2rX3WQ": {
    "date": "10/1/2012",
    "text": "Mortadella, arancini, pecorino ... boy, this shop is amazing. Don't go when you're feeling skint, though - its pretty expensive! Fabulous, and worth the money, but I have come out a bit shell shocked after everything got added up at the till... There's every type of pasta, meat, cheese or Italian liqueur you could ask for, and some nice pre-made quiches and sandwiches too. And if you're peckish there's always a range of olive oils out for tasting, with little bits of bread to dip. That's where you'll find me, oil dribbling down my chin...",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "g74l-c4UXDKTwHuScrO3sg"
  },
  "gblH7G-x3FaYm1f4kI5COQ": {
    "date": "2/18/2013",
    "text": "I had a pasta dish in the caffe bar for lunch when I met an old friend with whom I used to work in San Francisco before she moved back to Edinburgh. Valvona & Crolla was someplace I had on my Edinburgh food list to try not only for its caffe bar, and wonderous selection of deli meats, cheeses, and wines but because it was mentioned in one of Andrew McCall Smith's Isabel Dahousie novels. The fact that it was 2 blocks from the B&B I was staying in was also a factor.  Good meal, good company, and I'll have to return one day to pick up some picnic supplies.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b-DA7VhnYRLg6q5jIK3RNw"
  },
  "OnbPNa4h3QGCVnbQQJdFUw": {
    "date": "2/21/2012",
    "text": "I went here with a couple of Italians (they're like accessories, you should always bring them to a deli), and had an absolutely amazing time. The cafe, all the way in the back of the deli serves delicious sweets and cafe. No, not coffee, vero cafe, espresso, cappuccino and all the way they should be.  The deli-meats were delicious. I miss my mortadela something awful when I'm not in Italy (unfortunately that's most of the year) so coming here and seeing this beautiful meat displayed, well, I simply couldn't resist. I batted my eyes at the meat-counter man a couple of times and hey presto, mortadela slices to taste for me and my friends. (Italians, I love them).  This is the type of deli that I've come to know and love back in the Northern part of Italy. I've missed it, as we don't really have that many of them in the Netherlands, but finding one here was like finding the One Ring. (Only, maybe a little less .. orcy).  I highly recommend you go here, I also highly recommend you leave your credit card at home. Otherwise your rent-money may just end up as mortadele-meat.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6YW-IEZzzVaIYpteJlgy9g"
  },
  "ZhVZxstnsfHboC6dg-eeOw": {
    "date": "7/16/2010",
    "text": "Foodgasm is all I can say about this deli, which I've discovered is just across the street from where I live!  In business since 1934, this is by far the most impressive Italian deli I've ever been to! It was quite busy when I ventured in, after having walked past several times over the last few weeks. I have the feeling valvona and crolla has a loyal clientele, which would explain the lack of an interesting exterior; if I stocked half of what they did, I would be advertising in every corner of Edinburgh!   My friend and I were bamboozled by the amount of cheese, pasta, cold meat, desserts, chocolate, oil, wine, and many other fantastic things. For the free samples of olive oil and parmesan we picked up to taste, we held a moment of silence. I'd rejoiced, bitter-sweetly, about not having a Peckhams nearby to drain my bank account, but I think this place is even worse!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vrJM8rDBKXyi8QjKcYBNPg",
        "caption": "Photo of Valvona And Crolla - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vrJM8rDBKXyi8QjKcYBNPg/o.jpg"
      },
      {
        "img_id": "x_5C2lwn_2mCLMRTWwQSSQ",
        "caption": "Photo of Valvona And Crolla - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/x_5C2lwn_2mCLMRTWwQSSQ/o.jpg"
      },
      {
        "img_id": "vaI_kiGSSbMbrg3MxcPuzg",
        "caption": "Photo of Valvona And Crolla - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vaI_kiGSSbMbrg3MxcPuzg/o.jpg"
      }
    ],
    "user_id": "IY8cvV2SQuhJjKhRW68tFw"
  },
  "yoBZsIqzY4ntSkUhuoj_Ig": {
    "date": "5/18/2010",
    "text": "WOW.  Now this is what I call a deli!   They have so much on offer, I can barely contain myself. All I can say is, cheese of the week, shit hot salami, anchovy paste, homebaked bread, Italian biscuits and chocolate; fine wines and beers from around the world. The shelves in here are tall and packed full of food that's rich, fresh, delicious but also really good for you!  Kicks Peckhams in the butt, and I never thought I'd say that. It feels like a betrayal, but it has to be said. Never seen a deli like this. The biggest dill pickles I've ever seen, and the chocolate treats! There are no words. Just go and see for yourself. As good as the food is, it's so healthy you'll probably win back ten years of your lifespan.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lOqtnTF5V85EW8Mmqe6j0Q",
        "caption": "Photo of Valvona And Crolla - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lOqtnTF5V85EW8Mmqe6j0Q/o.jpg"
      }
    ],
    "user_id": "5iRCT4uAsyP1UoEUoxbylA"
  },
  "igNgklFeB2SxNZsI4HjtkQ": {
    "date": "3/2/2012",
    "text": "I have only been here about 2 times in a year and a half, but it's not hard to tell that Valvona and Crolla have something special and different than other stores don't have.   Thumbs up for providing good produce that is nearly impossible to find elsewhere in Edinburgh. There is a range of different wines in the back, and more meats/cheeses type thing in the front. Not to mention, baskets full of delicious pastries and breads. So, I obviously had to get an Almond Croissant.   ...It was delicious.   If I lived closer, I know I would have a peek in more often, but it's great to go into, especially if you love cooking and italian food. You might find that special ingredient you're looking for!   I know that there is an upstairs caffe as well, but so far I haven't managed to eat there. Next time!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F9nMHS70LBqEwKYFFuJ_0Q"
  },
  "o1fNSoQlhPibcOVoYoqrMA": {
    "date": "12/14/2015",
    "text": "Amazing customer service! My wife and I are big fans of Alexander McCall Smith's 44 Scotland Street series of comic novels in which V&C is featured as part of the setting in Edinburgh. The characters pop in to Valvona & Crolla for their sun-dried tomatoes, olive oils, wines and other delicacies. Angus' dog Cyril once surreptitiously ate a small salami that was knocked of a shelf. Having never been to Scotland, I didn't know if V&C was a creation of the author's imagination or a real shop. I Googled and discovered that it is indeed, real. Next, I found a perfect gift for my wife, a Valvona and Crolla shopping bag. After setting up an online account, I began to input my PayPal and shipping info, only to discover that there is no provision for shipping outside the UK. Alastair and the Despatch Team to the rescue! He answered my questions, got me a shipping quote, and gave instructions on filling out the forms. My order is now on the way to Texas via Royal Mail. Hooray and it occurs to me that Mr McCall Smith is also a fan of this fine establishment, since he features it in the novels. Thanks again and Happy Christmas!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GRM_zXZrr8gSGkIxfkr2bg"
  }
}