{
  "sJaGfY3loTvtTqakJAFlEg": {
    "date": "2/28/2009",
    "text": "Rocksalt is a very fine addition to Leith's lunch options.   To be found in what is possibly a converted bank, judging from some very fine cornicing, this is bright and airy but suitably cosy for a February lunchtime cafe.   They offer a fine array of sandwiches which come complete with salad and posh crisps, soups, fancy schmanzy salads, a selection of hot dishes and a very impressive array of cakes. Thursday's selection included gooey chocolate brownies, custard tarts, healthy looking muffins and cookies.   The coffee is great. And they also offer a impressive collection of chilled Fentimans, herbal and fruity waters, regular fizzy pop and the all important jug of free water with glasses.   So add it to your list of lunchtime options. It's very reasonably priced. You can sit in or take away. So try it. I don't think you will be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SXTh-cBuiwUAaaI4hw-bcA"
  },
  "HkH4uyhiofX-um3SEB-W8w": {
    "date": "10/11/2017",
    "text": "What a lovely place. I was in Leith to meet a colleague and I stumbled upon this place. The ambiance has a nice trendy vibe. Great menu. Great variety of drinks and sweets, too! On this brisk day in Edinburgh, I had the spicy lentil soup and Veggie Platter! Service was superb as well - thrilled I happened upon it! And to top it off great WiFi!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MPXsTErDs54F0ueNk21Pvg",
        "caption": "Photo of Rocksalt - Edinburgh, United Kingdom. RockSalt",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MPXsTErDs54F0ueNk21Pvg/o.jpg"
      }
    ],
    "user_id": "hBZpJtsss5gEoHylqa8pZA"
  },
  "Xzt_bMaUfK-_hKd-JRtRsg": {
    "date": "4/8/2016",
    "text": "Rocksalt is yet another good cafe on Constitution Street in Leith. The cafe is one part coffee and brunch bar, and another part deli. While one can purchase a number of goods, either fresh or baked, it's best to drop in when you have a moment to sit down and dine. The interior is tasteful, not too hipster nor trying too hard. Breakfast is served all day until closing at 5PM. You'll also find brunch specials on the weekend like their eggs florentine or pancakes.  I dined here for a late breakfast with Brittany A. and I was surprised at how busy Rocksalt was at 10AM on a Tuesday. None the less service was very quick. You'll need to order at the till, and then pay at the till again after you are done eating. I ordered the scrambled eggs on toast for my breakfast with a flat white to drink. I haven't had a bad cup of coffee in Leith yet, and Rocksalt delivers with their espresso based drinks. The scrambled eggs with my toast were prepared with a lot of whisking and butter. It leads to eggs that are slick and sinewy, not necessarily my cup of tea. However this old school preparation, usually with a cast iron skillet, is a favourite of some, my spouse included. The locally sourced bread used for the toast was toasted perfectly and full of flavour.   Rocksalt occupies a middle of the road place in the culinary scene of Constitution Street. With a stripped down menu, you'll find competent takes on breakfast and lunch essentials without much fluff.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "fX1-3ueCYfTb_eIZYyb9pg",
        "caption": "Photo of Rocksalt - Edinburgh, United Kingdom. Outside.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fX1-3ueCYfTb_eIZYyb9pg/o.jpg"
      },
      {
        "img_id": "bSxeUbF7KV4BWAQjcltIEw",
        "caption": "Photo of Rocksalt - Edinburgh, United Kingdom. Grade A organic Canadian maple syrup, OMG!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bSxeUbF7KV4BWAQjcltIEw/o.jpg"
      },
      {
        "img_id": "KsZMe19qkUuPI50WGjHApA",
        "caption": "Photo of Rocksalt - Edinburgh, United Kingdom. Scrambled eggs and toast.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KsZMe19qkUuPI50WGjHApA/o.jpg"
      }
    ],
    "user_id": "E5Ed11HJ5HvI8ZdtbFVzAQ"
  },
  "QPAWSI1Gd9rmBvBsawHovg": {
    "date": "5/21/2016",
    "text": "One of my favourite cafes in Leith due to its sunny location, coffee, comfy seat options, and healthy foods.  Plus, you can do work with access to WiFi. Many afternoons have flown by here..  Too bad they close at 3pm every day!  For their limited hours I didn't have a full rating.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "c0tMsAMYS9Jpzx09vZxbcw",
        "caption": "Photo of Rocksalt - Edinburgh, United Kingdom. Vegetarian Mezze platter",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/c0tMsAMYS9Jpzx09vZxbcw/o.jpg"
      }
    ],
    "user_id": "PbgqvUdjTRh-HoJUqRvlmg"
  },
  "80ThCVfhFNGU3leyJF04Pg": {
    "date": "2/15/2015",
    "text": "Rocksalt is one of my regular lunch time haunts and at around 1pm the place is very busy and usually there is a queue as well.  I can understand why it's busy. They do some good food, though my only experience from Rocksalt is a takeaway cup of soup  (medium soup is 1.80). They rotate a couple of different soups such as spicy lentil soup, broccoli and potato soup, butternut squash and parmesan. Occasionally something different is on offer e.g. on Thursday I had a cup of turlu soup, which is a turkish vegetable and meat soup / stew. It was delicious.  If you don't want soup, fear not. Rocksalt also does sandwiches and salads and their cake counter is pretty impressive. Not to mention the magnificent tray of home made baklava that is their pride and joy. Based on this and the turlu, I reckon the owner is Turkish.  Recommend this place if you are in Leith and in need of some lunch!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yuFHrb8YQtVuzu0eEXvJtA"
  },
  "lDZi9tEzItTF4_I95kW3iA": {
    "date": "12/18/2014",
    "text": "I've only been to Rocksalt once for lunch.  I am rarely in that part of town but was doing a training course at the weekend so decided to try it for lunch.   Comfy sofas, decent coffee, nice food.   The place is quite big and seems to be family-friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "V5U4-iDA2FeO2AlkUrATsg"
  },
  "g5yjq-sFeN_AOfWZn6WxbQ": {
    "date": "1/21/2013",
    "text": "Rocksalt is a very nice cafe on the way to the Shore. Sitting next to a clutch of lunchtime haunts, this place stands out as quietly superior due to its excellent grub, decent prices and relaxed atmosphere.   I think I might be obsessed with mezze platters at the moment, and this is my favourite choice from Rocksalt. For less than 6 quid, you'll get a genuinely monstrous plate of food featuring stuffed vine leaves, couscous, marinated green beans, feta cheese, olives, salad, tzatziki, marinated aubergines and a massive wrap to...erm... wrap it all up in. It's SO frickin' good.   My only bone of contention? It's quite cold in there sometimes - huge floor to ceiling windows and customers coming in and out do nothing for my internal heating system.   This is also a favoured stop for yummy mummy with small child in tow. If you're not into the sprogs, then steer well clear... But if you are a yummy mummy, then put this on the top of your kid-friendly list!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fcMTpwfLS9F5DWTqlp8ktQ"
  },
  "YT6ejNUrKZF_lu6O3aVkVg": {
    "date": "2/14/2013",
    "text": "My mate just moved to Western Harbour and asked me if I'd like to join her in finding some good eateries near her new place.  Never one to turn down an invitation for food, we walked into Rock Salt for lunch.  What a delightful cafe!  Tucked away from the hustle and bustle of Leith on Constitution St., Rock Salt is open, bright, and full of amazing fresh sandwiches and soup.  It's two pounds more to eat in, but unlike other places who offer cheap take aways Rock Salt provides freshly made sandwiches already wrapped up so you can just grab-and-go.  Along with salads, smoothies, and bread it's the perfect place to grab lunch.  My mate and I decided to sit in in their large eating area, and I ordered the chicken Caesar sandwich.  I was so hungry when I sat down, but the food was so big and delicious I couldn't finish my plate!  For a fiver I received a massive sandwich on fresh bread, a side salad, slaw, and crisps.  Seriously so god and couldn't finish.  Needless to say my friend has a new lunch place, and if I lived closer I would visit Rock Salt frequently!  Definitely recommend when you're in the Leith area",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zTzIyjPmGn6gaUiJp2Y7-Q"
  },
  "vNH5Upurr09k2FcsePLgTA": {
    "date": "8/3/2010",
    "text": "Another day, another overpriced cafe selling artisan coffee, gourmet sandwiches and Fentiman's Lemonade.  Rocksalt, on Constitution Street in Leith, with its glass shop front, goat's cheese paninis and slightly minimalist decor, may not stand out from the crowd, but it is a nice enough place to come for your daily caffeine hit or a bowl of soup at lunchtime.  Inside, it is spacious and airy, with comfy sofas and large round tables where you can recline with a newspaper and a cup of tea.  The people who come here seem to be mostly young professionals on their lunch break, and the staff are pleasant, although appeared a little overworked and hassled when I was here.  Overall, this is a fairly classy establishment, although lacking in real character and trying a little too hard to be stylish and edgy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N3J-41OHb87d-d395bMDmQ"
  },
  "dGMIR84wC7GKhrBwwdd77Q": {
    "date": "3/18/2009",
    "text": "The eggs Benedict and pancakes with bacon and syrup at Rocksalt are amazing - can't recommend enough.   Only complaint is that service and sometimes be very slow - fine when you whiling away a couple of hrs on a sunday - not so good if you in a rush.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dIAHvx0I8T1OVNlgt2paVA"
  },
  "JxFRShgIdPG-ArgGklrW1A": {
    "date": "11/20/2010",
    "text": "Rocksalt is great. Very chilled atmosphere with great coffee and food. If you're looking for a great late breakfast this is the place to stop.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DprJbp9xeq1fSkSQI5S5LA"
  },
  "X7w98hg8XDdzLhHcl2Ae_A": {
    "date": "4/2/2010",
    "text": "Any time I think of Constitution street I remember the peace and warmth of Rocksalt cafe where I used to take my lunches a year ago. My work place was not too far away from the cafe. I liked going there because the staff were very friendly. Besides, the dishes were freshly cooked, not very pricey and also if you didn't feel like having a full portion you could always opt for a half portion. The cafe is happy to host any type of parties from business to birthday ones, so if you live somehwere near and want to have a good meal just drop in Rocksalt.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hqZiOnwZ3J1s7piCBUN6Ow"
  },
  "UG5MHKYiBY_X0VeM40Fubg": {
    "date": "6/9/2009",
    "text": "Lovely all round - yummy food, happy staff, relaxing atmosphere, decent prices . . . It's just a shame the tramworks could put punters off. Give it a try, the bean casserole is especially good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LZr86Mk7R8dxkh2Jo2NGWw"
  }
}