{
  "8hsSEhBY10Ke2hACajYhSQ": {
    "date": "5/15/2010",
    "text": "I have this incredibly rude habit of walking past restaurants with large windows and glaring at the people eating. This is exactly what I did with Omar Khayyam and promptly told my boyfriend we had to try it.   The restaurant is quite bright and spacious due to the large windows. Most Indians seem to feel dark and dingy, but not this one. The staff were very friendly and service prompt. The menu lists the usual Indian dishes you would expect, and there is a good selection. The price ranges up to around a tenner for a main, so it could get costly if you order a lot. I had a Biryani which came as a huge portion, it was so delicious I felt bad leaving half of it. The other half had a lamb Rogan Josh which he wolfed down as men do. I enjoyed the Poppadums, rice and naan bread that we had alongside it. I literally felt like if I was wearing a belt I would have to loosen to it.  This restaurant is only two minutes walk from Haymarket Station so ideal if you are going to and from the station. They offer a set lunch meal also which would bring the price done significantly and definitely fill you up until tea time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rQdtxc45gIsOBVMOCkQY6g",
        "caption": "Photo of Omar Khayyam - Edinburgh, United Kingdom. Omar Khayyam website",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rQdtxc45gIsOBVMOCkQY6g/o.jpg"
      }
    ],
    "user_id": "oKdygoDX5CfDJeXzv_EVaw"
  },
  "fSAhbCnZ6pLLbs6zoa5vrg": {
    "date": "2/2/2010",
    "text": "I'm back in Edinburgh again for work.  I knew there were some pretty good Indian restaurants in Edinburgh, but never truly got a recommendation, so this was my first time at an Indian restaurant here.  This is a Punjabi restaurant, right off the Haymarket bus stop.  I took the bus from hotel to Haymarket stop, walked about 5 minutes, and found myself at this restaurant.  I had the Chicken Tikki Masala and the curried okra (Bhindhi).  One word: marvelous.  Served it with some rice and garlic naan.  Of course, this is basically the only dishes that I order at any Indian restaurant.  The portions were enough to fill me up...I had maybe a little leftover.  I have to admit that the okra was so good that no matter how full I was, I had to finish the dish because it was that great.  The interior of the restaurant was pretty nice.  It was a large restaurant, clean, with new furniture.  As soon as we entered, we were led to our table, chairs pulled out to sit down in.    The only thing is, I smelled like the food when I left.  But, I've run into that with many different restaurants so it was not a big deal.   So if you find yourself in Edinburgh one day, Indian food is pretty common and good.  I would definitely recommend this restaurant.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Oq8KlrcNg1mAWymZJYX_Zw"
  },
  "DW5k4Fmobz5wb-VPOFgZXw": {
    "date": "7/3/2010",
    "text": "I'm a bit of a spice pussy, so a korma will do me nicely thank you. But this korma is really good!! You can just tell it's going straight to your hips though, it's too creamy to be good for you. My dad had a somewhat adventurous Bhuna, and loved it. He said the meat was cooked well (which is a surprise ) and the sauce was really tasty.  All in all it was a good experience!! However the price was a but hefty, albeit with a bottle of wine!! It was a good experience though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o0WGr8L3BWfH2Bslpnqw6g"
  },
  "k2IkNH8x3aOhfxZNHLIqsA": {
    "date": "7/13/2011",
    "text": "wow. I personally think that this is by far the best authentic curry house in Edinburgh and their portions are generous,service is excellent and prices are very fair. I WOULD RECOMMEND THIS PLACE HIGHLY",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_7KKAJm0tr99QQgTx-wLqQ"
  },
  "0E4ZtZIxXjgAajk6Lg5fTA": {
    "date": "4/17/2012",
    "text": "We are not the most at experienced Indian food but we were impressed with the taste and quality of Omar's food as well as the good service and value.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bHrfOlDJX-sU7dxfESXG4Q"
  },
  "vx6Kz04dYqmvBdQzXjtdYw": {
    "date": "4/20/2009",
    "text": "I seem to eat a lot of lunches out. This is a favorite non vegetarian curry place.   We go for the set menu at lunch time. I challenge anyone to finish the lentil soup and chicken biriyani and still be able to work in the afternoon.   I have never been in the evening so can't comment on the full menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ou4BjdfuERdzcRN_tMhq4Q"
  },
  "eeKMlZ8XgPZe-Pl0PzRrWg": {
    "date": "3/10/2010",
    "text": "Looks pricey, but not too bad.  Great location, right in the Haymarket Area (look for the corner with the big \"#1\") About 10-12 GBP per plate.  They have a pretty average selection of Indian Punjabi cuisine and a lackluster selection of desserts (and booze).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mZokz37TaR5jFgMrx4WyFw"
  },
  "OHAqyCUO9S9egwirqSXDOg": {
    "date": "5/27/2009",
    "text": "This is one of my favourite places to eat. The staff are always very friendly and the restaurant has a nice atmosphere.   The evening menu has a huge selection of food and it's specialities are wonderful. We try go to Omar Khayyam's whenever we are in Edinburgh and have never had the same meals twice.   The prices are average restarant prices at around 10 per main but the portions are large and the food is lovely so worth the money.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5tO98iPm9OxLtN-KVZjCug"
  },
  "t4UqvjMZLJMDRrDMk6UB5w": {
    "date": "8/26/2019",
    "text": "I LOVE this place!  My family and I are here on holiday from Los Angeles and I stumbled upon this restaurant as we were walking around and thought we must give it a try. First and foremost, the food is AMAZING. So much so, that I'm here at 11pm waiting for my take away order the night before we fly back to the states at 6am :)  The ambiance is lovely, the staff are quick on their feet and are very kind, and the owner Omar, was especially welcoming and kind to us as well.  A True example of the way a proper restaurant should be run. You want incredible Indian food and a very kind staff? Definitely come here.  It's really too bad I can't order take away from here all the way to Los Angeles!  Omar and all, thank you for the lovely and quite delicious experience :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yuc76uAnfQ9vSe7Hd274Hw"
  },
  "e780iCFncTcSTejV42y2qg": {
    "date": "7/12/2019",
    "text": "During any European visit you are going to be in the mood for something other than dish & chips.  The restaurant was, clean, welcoming and served delicious food.  I was with my aunt who is older and I really appreciated the respect and patience the staff gave to her.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5A8vJ5qMmAYwEKoLEMyMJA"
  },
  "d4jUqT-CNf2CVWahopywvw": {
    "date": "6/5/2019",
    "text": "I was reading reviews about this place, and noticed that someone named April X commented about they trick you into buying extra food. The do. The host/manager, I'm guessing sat me down and asked mi if a wanted popodil, (not sure of the spelling). I asked him what it was, and he he just said, psssh, waved his hand and said don't worry about it. A server comes back with the thin crispy rounds with a plate of 5 relishes, which appeared on the bill as 2 different items, about $7. The chicken chili dish I ordered was very good, good naan, good rice, nice cold beer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7m-i4BaXeM9DI--gj5OZ1w"
  },
  "C8b3kaTOrhlyfvz160-6vQ": {
    "date": "4/8/2019",
    "text": "Delicious food and attentive service. We were very happy with our meal. It was a bit pricey, but portions were generous. Three of us shared an order of lamb vindaloo, an order of chicken tikka, rice, and naan, and had plenty of food. We would definitely go back for special occasions.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5FQw1Z7j9k6B-0yMi-7vfw"
  },
  "uZfM4kKDUPAx7qanR8deVw": {
    "date": "9/26/2018",
    "text": "OMG this is best Punjabi Restaurant we have been to. And we are from San Francisco and the Bay-area in California. We do know food and pricing. There were 6 of us arriving at 7 pm, the entire restaurant was totally packed but the staff was excellent, able to fit us in after 5 minutes without reservations. The food portions were huge, there was 3 orders of Garlic Nan, one Chicken Tandoori, two Tandoori Mix Grill and three Special of the day which was lamb and their special sauce. The prices were reasonable, we couldn't finish all of the dishes. The Staff was wonderful ( can I take you home) . Such gentlemen, opened the doors for us, help us with our jackets. What service haven't seen this in ages. They explain their menu to us. WHY, no pictures we were so busy eating we forgot to take photos. Must return soon before we leave Edinburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rE5TPBydaGzRg89ZMXjH1A"
  },
  "nykRFcW87FW-uR2pxjJ7-A": {
    "date": "8/16/2017",
    "text": "We went here for dinner while visiting Edinburgh. We were greeted when we walked in and it was pretty busy. We were able to get a table and found the service the entire time to be excellent. The food was great and we both enjoyed the meal. I would say the naan was large and we ordered 2 we would have been fine with 1. However both were excellent. I would defiantly return to enjoy other dishes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "I_CBniPJ0irdWnFQlMqn8w",
        "caption": "Photo of Omar Khayyam - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/I_CBniPJ0irdWnFQlMqn8w/o.jpg"
      },
      {
        "img_id": "rEKJVr1n8lN0miPtf960zA",
        "caption": "Photo of Omar Khayyam - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rEKJVr1n8lN0miPtf960zA/o.jpg"
      },
      {
        "img_id": "OKashAVyu5394LCAPdEZng",
        "caption": "Photo of Omar Khayyam - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OKashAVyu5394LCAPdEZng/o.jpg"
      }
    ],
    "user_id": "0EE_wIv6HPnK2CkYsOwS0A"
  },
  "7bCSOmSit5x4aHXRtmzyXQ": {
    "date": "5/9/2017",
    "text": "We first visited here 17 years ago. It remained in our memory as the best Indian food we have had internationally. Yes, I visited India and have enjoyed their food in multiple countries. Most of my Indian palate has been satisfied in California.  Each region has its own seasonings and this version tops them all, in our opinion.  Thus we return here again today.  As we approached the entry someone opened the door and we were immediately seated. Within moments the waiter came to take our order for drinks and brought us four chutneys. OMG!  There are good chutneys at most every restaurant we go to and some are rather unremarkable. Here these have a variety of non-spicy to mildly spicy. And the other seasonings, I am sorry to say, are beyond my description and delicious! It took perhaps 10 minutes to receive our food. (By the way, they do not ask you if you want spiciness at the mild, medium or hot levels. One gets what one gets.  I rate it as \"Mild+\".   Ahhh . . . !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0ZC617HTEPjftX0hea_wKw",
        "caption": "Photo of Omar Khayyam - Edinburgh, United Kingdom. Entrance on the corner",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0ZC617HTEPjftX0hea_wKw/o.jpg"
      },
      {
        "img_id": "rf7EXmJ-NrmlopwNy-lH8g",
        "caption": "Photo of Omar Khayyam - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rf7EXmJ-NrmlopwNy-lH8g/o.jpg"
      },
      {
        "img_id": "_fAMOCiJY0iehQMCBcFPRQ",
        "caption": "Photo of Omar Khayyam - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_fAMOCiJY0iehQMCBcFPRQ/o.jpg"
      }
    ],
    "user_id": "nnn5Geb3HNxrh-oi-uip_w"
  },
  "Dl13eQ-_zLdNVhQEPED0MQ": {
    "date": "5/5/2016",
    "text": "Excellent food and service in an attractive setting. Prices are very reasonable.   Spicing on chicken tikka masala was different than many Indian restaurants we've been to, but very tasty. Pashwari naan nicely done. Our server was super attentive to our needs.   Acoustics are conducive to conversation. On a Thursday night, there were two big groups seated nearby but still no problem hearing my dinner companion.   Definitely recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wYC93Q06vtLBR7Gosc8SjQ",
        "caption": "Photo of Omar Khayyam - Edinburgh, United Kingdom. Peshwari naan, chicken tikka masala, saag paneer and basmati rice, Kingfisher beer. Nicely spiced.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wYC93Q06vtLBR7Gosc8SjQ/o.jpg"
      }
    ],
    "user_id": "uaQAFWM9mEKPvITb1sLSKA"
  },
  "8ZQ9k0vnvhiY1BkqTAgfMA": {
    "date": "10/1/2016",
    "text": "I came here with my co-worker on a business trip since it was right next to our hotel (the Hilton). We came here pretty late (9pm ish), but we got seated pretty fast. It took a while for the waiter to come and take our order (20 minutes), but once we ordered our food it came super fast (10 minutes). I got the lamb vindaloo and some garlic naan. The food was rather spicy, spicier than the other Indian placed I tried in the UK but this place had better flavor. The naan was also pretty good, but the garlic flavor was rather light. Food was reasonably priced. Overall not a bad meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "I6YARR1VloAua-buFULo1Q"
  },
  "eEq-DhZseVBcs9jfc6JkpA": {
    "date": "5/6/2018",
    "text": "They kind of trick visitors into ordering more food. Unpleasant experience. I won't come back!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8sbOMvSjvq7zLRhYnAfuew"
  },
  "HWTbcTCoVh64mJjB3eDRFA": {
    "date": "8/3/2016",
    "text": "Great food and great service we had the chicken tiki masala, rice, beer, samosa, garlic naan, and yogurt sauce. Everything was fabulous with just the right amount of spice. It seemed like the servers were there exactly when we needed them without being bothersome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "STV6xFmK8DYjjxyXm0ePtw"
  },
  "dt7avR07aiQpYljRDyesLg": {
    "date": "5/13/2016",
    "text": "Kindly greeted at the door. Quickly seated and serviced the waitstaff was impeccable and the food was far beyond any expectations I could have had. Highly recommend it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EODjWgwAcaWQS7r-noOk7g"
  },
  "CLbQmNrV_97gWTUzAIF6KA": {
    "date": "7/26/2015",
    "text": "The best Indian food I ever had. It's tasty and a more refined type of Indian food. I was full, but had to try the dessert and see if it was as good as my main dish. Smart decision!! It not so cheap, but it definitely worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VTY6fhD3DQ49ZWGHl3iAgA",
        "caption": "Photo of Omar Khayyam - Edinburgh, United Kingdom. Gulab jaman",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VTY6fhD3DQ49ZWGHl3iAgA/o.jpg"
      },
      {
        "img_id": "G-q5bNnJ-bKtqMR1vepMBA",
        "caption": "Photo of Omar Khayyam - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/G-q5bNnJ-bKtqMR1vepMBA/o.jpg"
      }
    ],
    "user_id": "YtmtIOl7dSHYl_II-4jAMA"
  },
  "wOfbX4KT8BSrCccOYp2n9w": {
    "date": "11/26/2015",
    "text": "I decided to stop in here for dinner while visiting Edinburgh based on the Yelp reviews and the Hilton's recommendation. In short, the customer service was outstanding. The staff was very friendly and accommodating. I don't remember the name of the dish with the crisp bread and four sauces at the very beginning but the combination was delicious.  I really enjoyed the garlic naan bread. It went very well with the Punjabi Karahi w/chicken.  The lentil was little peppery but tasty nonetheless.  I would definitely visit them again before going back home.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DA9h6cIS3-88ejmOoswmVw"
  },
  "2Y9lsNC7rhaSzMVZ30_KlA": {
    "date": "7/24/2017",
    "text": "Food was amazing. We all ordered 1 dish with rice each and 2 naan for the 4 of us to share and left full! The service is as good as the food. If you want Indian look no further. Great finish to the trip.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Je6Ex6YWGsaDKd3a7yDLg"
  },
  "rN9JLGfLP7CwHKlGrQbdag": {
    "date": "4/14/2017",
    "text": "Very good Indian food in Edinburgh. The service was excellent and the inside is quite fancy. I had naan and matter paneer, which were both delicious. And, their naan is huge!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7snaibW6DSSebkO9gv3kdA"
  },
  "r8A_gbz449_0Bh74A_Bn-g": {
    "date": "2/16/2013",
    "text": "Looks are deceiving. The restaurant looks quite expensive from the outside, and sitting smack bang in the centre of town you'd think prices would reflect its location. However, a decent meal will set you back less than 15 per head. The restaurant is large and well-kept; my last visit saw the tables packed.   Varied selection of favourite curries on offer. All dishes ordered were destroyed in about fifteen minutes with lots of head nodding, so the grub definitely hits the spot.   I suspect the desserts are bought in so I steered clear of them and opted for a mango lassi instead - delicious!   Good option if you are looking for a half-decent curry that won't break the bank.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "fcMTpwfLS9F5DWTqlp8ktQ"
  },
  "0LqXqxQo6DHODmFGNJ-XmA": {
    "date": "10/18/2012",
    "text": "having left a rather atmosphere lacking whighams wine cellar, i made the short journey to the crossroads at haymarket where i was off to treat myself to a curry.  the crossroads are more a massive mess of ugly tram works, but omar khayyam is a beacon of chic and stylish light at what used to be a very busy traffic point.  on approaching the front door to the restaurant, i was warmly greeted by one of the servers who opened the inner door for me and showed me to a big table where i choose the comfy booth seat over the chair.  he also offered to hang my coat up, which i declined as i just folded it neatly and placed it on the bench beside me.  i arrived early, my date still on his way, but this didn't stop the waiter bringing me water, a glass of red wine, and poppadums with dips.  once my date had arrived and taken his seat, he was quickly approached by the ever efficient waiter and asked if he wanted a drink, to which he order a pint of kingfisher (they don't appear to have cobra here...) and was brought this seconds later.  we had a look at the menu, opting to just go for main dishes and add a side, using the poppadoms as our starter.    after ordering our mains, we started in on the poppadums that were nice and crispy and accompained with three very tasty dips.  there was the regular mango chutney, which was a bit to sweet for me, a spicy raita, and the best spicy onions i've ever had!!  the onions were fresh, mixed with bits of tomato in a zesty and spicy sauce that made them the perfect topping for the crisp poppadums!    our food arrived so quickly that we hadn't even finished the poppadums yet, but the waiter solved that problem by putting the remaining poppadum on top of the naan bread and leaving use with the dips.  now the main dishes...omg hello flavour explosion!!!  i ordered the punjabi karahi with chicken and this dish was the perfect blend of spices and curry and a chilli kick.  there was a really warming taste of cinnamon mixed in which just brought the dish to a five star review rating!  it was so good i ate all of it, even though i felt like i'd have to roll myself home!!  my date had the black pepper chicken, which i used some naan bread to dip in the sauce, i also found this dish very tasty and would be happy to order it next time i go.  we shared pilau rice, an onion naan, and a very tasty side of aloo palak (spinach and curried potatoes).  the only thing left after we devoured this incredibly delicious meal was a bit of naan that neither of us could fit into our overly full tummies.  so the food was outstandingly delish, but the service was also something to compete with!  the waiters seem to always be there with what you needed and everything was served so quickly, but they made us feel comfortable to linger over our meal and not be rushed out the door.  i also liked the hot towels they brought after clearing away the plates, these were proper hot towels not the lame wet tissue like ones you get in other places.  the restaurant also looks like it's recently been done up and the decor is all sumptious dark colours and clean lines.  clearly, i loved this place!!  i will definitely be making the extra journey to come here again for some more delicious curry delights!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gWMjl9MAsd8lhj1ndZd9-w",
        "caption": "Photo of Omar Khayyam - Edinburgh, United Kingdom. Main dining room",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gWMjl9MAsd8lhj1ndZd9-w/o.jpg"
      }
    ],
    "user_id": "Z_xbO-Iaxbx-ZRPhLJK-Ew"
  },
  "rrfHvs2ixO7WyA12CZYzjg": {
    "date": "8/16/2015",
    "text": "Flavorful and perfectly cooked.  We had the Frontier Chicken Masala, and the saag paneer, and samosas.  The samosas were just ok, but everything else was cooked to perfection.  A great tip- our 12 year old son won't eat Indian food, so he was able to order chicken nuggets.  Great service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WooY7yKHssQV1pf_I_gKpg"
  },
  "SVDufWDtcPI2TdhcccvxYQ": {
    "date": "7/22/2010",
    "text": "Omar Khayyam is a great Indian restaurant and although the prices are pretty steep, the food and service is excellent.  I came here with my parents last year and we all thought it was amazing with authentic Indian dishes ranging from marinated sea bass to chicken Tikka Masala.  I went for the Shami Kebab starter followed by the lamb Tikka.  They didn't take long at all to arrive and tasted great when they did.  All the meat which they use is of the highest quality and the lamb was tender with no chunks of fat or sinew whatsoever.   Most mains cost at least 10 and side orders of rice or vegetables are about 3-4 each.  It's not a cheap meal, but the food, service and general ambiance all make the cost well worth it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "rjWsBIL6pD5ZMZP9q9CXAQ",
        "caption": "Photo of Omar Khayyam - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rjWsBIL6pD5ZMZP9q9CXAQ/o.jpg"
      }
    ],
    "user_id": "yfXqZkU5iXE07GSHzdsQBA"
  }
}