{
  "hYTI99cRrCBfx4W_1I_Llw": {
    "date": "11/21/2007",
    "text": "A good indian take away. Appears to be a family run business. Prompt service. This is definitely one of my favourite \"can't be bothered to cook\" options. Good value. A curry ranges between 5-6 pounds and (for the avereage person) is more than plenty for one. I highly recommend the Kashi Pasanda! This place definitely hits the spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "amc0ZeuFXVQtHDGgesK9dA"
  },
  "6Rb2b157PlJKvQgziIPCJA": {
    "date": "7/6/2010",
    "text": "My flatmates and I ordered from Shanaz a few months ago whilst fancying an Indian early one evening.  It delivers authentic Indian and Bangladeshi food straight to your door for a virtually negligible charge.  Their menu, although not huge, has a good range of biryani, tandoori and vegetable dishes, most of which cost about 8.  I opted for the Kingfisher lamb which is one of their house specialities and this, as well as a portion of boiled rice and a bag of poppadoms came to about 10.   The food seemed to take a while to arrive, but that probably just because we were ravenous.  At any rate the food was certainly worth waiting for.  There was plenty of lamb in the sauce and it was delicious and tender.  My flatmates and I all agreed that it was a tasty, filling meal, well worth a look again in the future.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0trobqeJel4w3Pcof5wIsA",
        "caption": "Photo of The Shanaz - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0trobqeJel4w3Pcof5wIsA/o.jpg"
      }
    ],
    "user_id": "yfXqZkU5iXE07GSHzdsQBA"
  },
  "4xexR1CTc2eDQ8gqNk4yNA": {
    "date": "1/28/2014",
    "text": "I ordered a takeaway from here via Just Eat and have to say it's quickly propelled it's way to being my favourite Indian in Edinburgh.  Chicken within the curry was delightfully tender and had the correct meat/sauce ratio, bread arrived warm and not soggy and the rice was fine and fell apart when served.  Top marks only avoided by the 1 hour wait for delivery but I can live with that!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZJGIuKgian8XE4g2ZFDL-Q"
  }
}