{
  "DzqL1e1XT33q6eiqR4_oiQ": {
    "date": "11/26/2015",
    "text": "I'm a big fan of Central. Many a time I've frequented this place, both at lunchtime for the excellent lunch deals, and very late at night after dancing for hours. The staff are friendly, the food is greasy and good, and the prices are kind to your wallet/purse as well. :)  If you like fried food, Central is the place for you- pizza, haggis, mars bar, chips. It can all be deep fried. nom nom nom.  (they do proper oven-baked pizzas as well, by the way!)",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "RMOJLdLHdFai_ksWCMDOoA"
  },
  "RG4aEGxzUDitTpVMxcWQIw": {
    "date": "6/6/2017",
    "text": "Thank goodness we found a Munchy Box! As is the case with these boxes, quantity over quality. The pizza at Central is really good. The rest of the Munchy box components are pretty standard: fried chicken (chicken pakora), chips, salad, donner meat (gyro).   I appreciate that they have some seating and you can get beer/wine with your fast food. The chips were piping hot and very tasty. Top that off with their chili sauce and salad dressing, and we had a wonderfully tasty, fast meal.   The Munchy Box was a real treat. Again, quantity over quality, and we enjoyed making our way through the various components. It's more than enough to share with 2-3 people.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CQyN3l8KelnpsV5r8D3__g"
  },
  "pFkdu-a4ATL7xfkdgMPyyQ": {
    "date": "8/24/2014",
    "text": "Nothing beats going to a cool chippie like this at 2am after a great night out and having a fried pizza summer. I miss living in Scotland for that meal alone. My waist thanks me though. There is nothing better than that greasy, crispy taste of a fried pizza. BOSS.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Hzt2Rv6SHaZZEb-4peqEPg"
  },
  "B4BWp0Hf0Xaa_4Xpp3aI4w": {
    "date": "11/19/2012",
    "text": "Average chippie, but is a well above average location.Only ever tried their Suppers, never their pizza, which are nice but nothing to write home about.   What really sells this place is it's location, as has been mentioned before, it's on the way home to a lot of Edinburgh and in my case by car back to Glasgow.  Cost wise it is quite reasonable.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8ErrXbfvm9vv5mKl2OBd-Q"
  },
  "EgOkbMs62xoXb4zRIxse4A": {
    "date": "2/6/2014",
    "text": "I got chips here once and I enjoyed it. Kind of your run of the mill chippie. I wouldn't go out of my way to recommend it but if you have a craving for chips and you're there, why not?",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "8PXbCnUQiaZYqYZ_c0RfxQ"
  },
  "949BA6bX9iLEje790f1jfA": {
    "date": "6/28/2010",
    "text": "I live dangerously close to Central Takeaway and frequently go there for my lunch or dinner several times a week!  When I first saw Central I assumed it was a fish and chip shop but it has a wide menu.   It serves pizzas, pasta dishes and burgers as well as the other traditional chip shop type food such as battered sausages.  The food tastes delicious and the chips are some of the best I have tasted.  It is fairly reasonably priced, with a fish supper just under 6.  The staff are friendly and always seem to remember which sauces I like on my chips - clearly a sign I have been there far too much!  It stays open till the early morning so it is an ideal place to stop by on your back from a night out to grab a bag of chips.  In addition to it being a takeaway, Central also has a few indoor tables and chairs for people to eat inside.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "hu_ukaEYUZk8RrBBXBbmrA",
        "caption": "Photo of Central Takeaway and Pizzeria - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hu_ukaEYUZk8RrBBXBbmrA/o.jpg"
      }
    ],
    "user_id": "OdUSlS-S6qfZFnDUCKzwEg"
  },
  "cnHTkchYfCTqGLC-yZHvQw": {
    "date": "6/30/2010",
    "text": "Central is on everyone's way home from a night out. By everyone I mean everyone who lives in Marchmont, Bruntsfield and Morningside. It seems my world is really quite small, if you think of it.   Anyway, it's standard. You've got your range of pizzas, which are actually pretty tasty for how incredibly cheap they are, your chips with cheese, chips without cheese, chips with your uniquely (and kinda bizarre) Scottish chip sauce (I really have no idea what they put in it). There's also your range of deep-fried unappetising-looking sausages and blood sausages and fish. I only say unappetising because the thought of deep-frying everything kinda gives me miniature hypochondriac heart attacks. This may be an exaggeration. They will deep-fry your pizza at request. Yes. Your pizza. I may have been living here for a while now, but I still just don't get it.   They also serve the strangest of desserts. Well, strangest I've ever encountered anyway: Scotland's best. Deep-fried Mars bars. They're a force to be reckoned with.   So, if you find you can't quite walk straight and should probably line your stomach with grease, Central is a decent, cheap option.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "SJHZlBsy0GF_HYRN7wG-6A"
  },
  "uEWoebnIDV1Mza7Lhteogg": {
    "date": "4/14/2010",
    "text": "The Central Chippy is a fantastic family run chippy just south of the city centre. It's perfectly located for picking up a bag of chips or homemade pizza on your way home from a sunny day spent in the Meadows or a night spent in a sweaty club. The lunchtime deals are pretty good and you can pick up a slice and some chips for only a couple of quid, I always ask for extra chippy sauce (something I advise you try, but only Edinburgh people seem to Truely love it). This is one of the few establishments where the food tastes as good at 2pm as it does at 2am.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "mJJj_SZff6MEWG5Vx1r8Bg"
  }
}