{
  "RAd0fmU9Ifcrjy3TJZB2sQ": {
    "date": "8/1/2015",
    "text": "I've been traveling to Edinburgh several times a year and always make it a point to have at least one meal here per trip.  The food is delicious.  The menu is varied and the prices are reasonable.  Delicious all around. Haven't had a dish here I haven't liked!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-x9B0q0_qkP08_muhsmrpA"
  },
  "NGSJlsDSjEixecZ6pD9r4Q": {
    "date": "4/5/2010",
    "text": "Eastern Spices is my local Indian takeaway place in Canonmills. It's big claim to fame is that it's featured in Peter Irvine's book 'Scotland The Best' and is one of the only Indian takeaways in Edinburgh mentioned, because of this I think my expectations are always a bit too high. The food is good, but can be a little hit or miss. Tonight I ordered a lamb madras, vegetable pakora, puree and gulab jamon. My order arrived within half an hour and everything was piping hot. The madras wasn't too oily and had a good kick to it, the pakora was crispy and delicious (I wolfed down two before they made it on to a plate), the puree was light and fluffy and the gulab jamon (fried milk dough balls doused in syrup) finished off my meal perfectly. This was definitely a good experience, however I've had meals that haven't been nearly as good because of orders taking ages to arrive, or the food being lukewarm and nothing particularly special. Give it a try though, you might catch them on a good day!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WUlosg9j5yHzcVYPwrjhnw",
        "caption": "Photo of Eastern Spices - Edinburgh, United Kingdom. www.easternspices.co.uk",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WUlosg9j5yHzcVYPwrjhnw/o.jpg"
      }
    ],
    "user_id": "mJJj_SZff6MEWG5Vx1r8Bg"
  },
  "PXExcWhVEO-59fzOekrtAw": {
    "date": "2/15/2013",
    "text": "I have just had my third takeaway from here and I'm quite impressed. I like my food spicy and the hot dishes here have pleasantly blended but hot spices rather than the taste of an extra dollop of chilli powder added at the last minute that you get elsewhere. A varied menu, pleasant staff and really busy, you can see the cooks preparing the food in the bustling kitchen. As good if not better than most sit down Indian restaurants in Edinburgh and large portions. Recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OQKx_Xd4s3yrzNUWkdybYQ"
  }
}