{
  "K8CxGV7VENyeGhykJychiQ": {
    "date": "8/5/2015",
    "text": "Best bar, meeting and watering joint in Lothian Road. Good choice of beers, lagers, wheat beers, whiskies and an unpretentious food menu divided into Starters & Small Plates and Larger Plates. A small but all-bases-covered wine menu is available too. The Traverse Bar is usually quiet till 5pm for those who want to avoid the more commercially busy Lothian Road bars and enjoy a good book and a pint or two or get some work done on your laptop, as its WiFi is pretty strong.  After 5pm an interesting & eclectic mix of City workers, artists, theatre technicians, performers and musicians start populating the premises bringing it to life, getting packed during performances' breaks and the Edinburgh Fringe Festival season.  Being hitting that place for 15 years I've always come across with friendly, polite and very happy staff. Good job Traverse crew!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3wyo7kDB0DdSY-82xxR2VA",
        "caption": "Photo of Traverse Bar Café - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3wyo7kDB0DdSY-82xxR2VA/o.jpg"
      },
      {
        "img_id": "YJoNrbJQyn3r0_Yf2geAtQ",
        "caption": "Photo of Traverse Bar Café - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YJoNrbJQyn3r0_Yf2geAtQ/o.jpg"
      },
      {
        "img_id": "ltbxSRubYWbGeAptR0jpxQ",
        "caption": "Photo of Traverse Bar Café - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ltbxSRubYWbGeAptR0jpxQ/o.jpg"
      }
    ],
    "user_id": "RBvR8MoGAoxeLlm_ajTYgg"
  },
  "kCfONKjxnQ9yI-ae2d_Flw": {
    "date": "12/9/2015",
    "text": "If I'd to sum up the Traverse in as few words as possible, I'd be inclined to say: nice wee venue. And that really would sum it up. Seeing a band in the Traverse bar makes for an intimate and atmospheric affair. Bad staff are friendly and the support slot will most likely be a local offering, which I'm all for.   I curled up with a gin and tonic and let The Wiyos' blissful Americana entertain me for the evening. I love how relaxed the venue is, but not so much that it's a pub gig. - It's just that little bit more chilled out which had me feeling perfectly at ease.  I don't have much experience of live music in Edinburgh but the Traverse is right up my street and very much akin to Glasgow's beloved citizen theatre. - I'll definitely be checking out the programme regularly.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "8rI2CoS4ltQePbZceSOgow"
  },
  "8MtJoyxnfQkJcnTRc2Y1Bw": {
    "date": "1/14/2016",
    "text": "I used to come in here quite a lot but then stopped for no definable reason. The main reason I chose the Traverse Bar Cafe in the first place was to get away from the rampant fakery which is rapidly dominating the pub scene in Edinburgh and to get away from tourists. This place was the antidote to all that and it decent prices and menus too (though the Festival menu they forced on us was a load of balls and I hated it).  In the past year I have only been back twice and I must say I am not keen on this \"a pie, a play, and a pint\" crap that they are promoting now. This seems like a very dated, disrespectful, and dumb way to generate business. Pushing this underclass fad onto us by tying it to art and expression is completely incongruous.  Some might consider the decor to be cold and unwelcoming, but I've never had a problem with the \"naked ceiling\", I think it's quite original. Seating is usually comfortable, service is usually good, and there's plenty of posters on the wall to draw your attention. The noise level has never been intolerable and it is a nice place to have a conversation with people. It won't be to everyone's taste but it is a nice alternative if you are sick of the local pub scene.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "iLq7PFxHTq9cr33jKRNgRw"
  },
  "E5mmkHHy-URnhFUUZipYEA": {
    "date": "8/10/2010",
    "text": "I popped into the Traverse because it's got WiFi access and I needed to do a wee bit of work and check the ol' emails.  This is a fairly good looking bar and it was comfy and welcoming enough to sit down and grab a cup of tea. It's a vibrant red with lots of sleek metal.  I had a read of the menu when I was in and seen a fantastic offer that they run in the cafe between half three and half six. Basically, you pay whatever time it is, if you order at half three, you pay 3.30. If you order at six thirty, you pay 6.30.   I'll definitely be back to try out the food - I'm thinking it might be around half three in the afternoon...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "Cy1PV2TdYeDFA16mUOlr3Q"
  },
  "d-c-TQRirsvdM-57QadtlQ": {
    "date": "4/14/2010",
    "text": "I recently rediscovered the Traverse Bar after an absence of around eight years, eek I'm getting old.... It's a place I know exists, but always forget about because of the Usher Hall refurbishment (the street outside has been dug up and covered in scaffolding and metal fences for what seems like an eternity). Anyways, I was looking for a chilled place to do a spot of writing the other night and thought I'd head on down - I was pleasantly surprised. It doesn't seem to have changed very much since I was last in and this is no bad thing: the decor still looks befitting of a contemporary theatre's cafe bar (exposed pipes, wooden floor, modern bar furniture), the staff were friendly and the menu was full of tempting choices. I ordered a portion of Traverse nachos and was suitably impressed, I may even go so far as to say that they're better than those at the Filmhouse (controversial). A large glass of nice red wine will only set you back 4.30 and if you order selected dishes between 3.30pm and 6.30pm, you pay the price of the time (e.g. at 3.30pm you pay 3.30). It's a great place to go for a drink or bite to eat and I've promised myself to not to forget about it for another eight years.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iG_sxh_GR_GsYBx95peCow",
        "caption": "Photo of Traverse Bar Café - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iG_sxh_GR_GsYBx95peCow/o.jpg"
      },
      {
        "img_id": "c85exZr_rsuN2mNqj3vlbQ",
        "caption": "Photo of Traverse Bar Café - Edinburgh, United Kingdom. http://www.traverse.co.uk/barcafe.htm",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/c85exZr_rsuN2mNqj3vlbQ/o.jpg"
      }
    ],
    "user_id": "mJJj_SZff6MEWG5Vx1r8Bg"
  }
}