{
  "SykBWomUj4Me39pmoCRA4g": {
    "date": "4/14/2015",
    "text": "Bonnington Brunch does everything it says on the tin and does it well, cheap, and in a friendly manner.  We got rolls here the other morning - they came out FAR faster than we would have expected (almost too fast, admittedly making me wonder about a microwave) and they were ENORMOUS. We also got tea, which was served in proper mugs.   With this, the staff were incredibly chatty and lovely.   Eating for two, I capped off my enormous roll with a peppermint slice (I shared it!) - at 80p it was a very tasty bargain.   I just wish I had somewhere like Bonnington Brunch on my end of town, though maybe it's actually best that we can only come here as an occasional treat!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4UQfst9jve4GCSfWpWn2uA"
  },
  "BqQyiWzHh__zBI0GJjb8yg": {
    "date": "12/12/2016",
    "text": "Popped in here for some lunch with my boyfriend. We had a hankering for chips n cheese. Got home and sat down to eat and satisfy our cravings... had to throw it away! Tasted like they had re-cooked the chips which were hard/ stale tasting. We won't be back!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gqTgdy72sH76WjlIP_68wQ"
  },
  "75aPy76ePvyZXsO4Cr0g6g": {
    "date": "11/10/2013",
    "text": "Three words: Big. Breakfast. Wrap.  Lorne sausage, bacon, hash brown, egg (fried or scrambled) and cheese encased in a wrap and folded square. Not oblong so all the food will squish to either end with every bite; square, so the contents are evenly distributed from start to finish.  If that isn't the best 2.70 you'll ever spend.... you're probably vegan. Or something else weird.   Worth the five stars alone.",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "9RGIvzCGHp8ELF_JgAlbZA"
  },
  "bTWN-FO4D8hWd_RaHYasUA": {
    "date": "4/22/2013",
    "text": "We love the Bonnington Brunch - a fab wee place on Bonnington Road that serves freshly made sandwiches, hot breakfast rolls (a variety of fillings to choose from), cooked breakfasts and things like burgers and chips.  Our weekend morning routine has been to pop round the corner for a hot roll (current favourite is black pudding and hash brown), occasionally venturing for one of the many cooked breakfasts instead. Prices are all very reasonable, and a variety of sweets, crisps and soft drinks are sold too.  It's always busy with local workies and hungry local residents.  I only wish it were open later than 2pm!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "Mqg4L8flJmg8pqeR-uYyRg"
  },
  "6DJKsEYRfu7_U7PdGFyRkw": {
    "date": "9/1/2013",
    "text": "everyone needs a wee corner cafe/takeaway and the Bonnington Brunch is mine.  it's a short two minute walk from my flat to this shop, where when i'm feeling the effects from the night before i can go to get a hearty breakfast roll to make everything better.  there are loads of breakfast roll options available and also the option to get a full breakfast or veggie breakfast and even a breakfast wrap that looks pretty tasty!  i usually opt for a scrambled egg roll with a potato scone (don't judge, it's awesome!) which is made up fresh for me.  add to that a bottle of water for some re-hydration and less than 10 minutes later i'm headed back to my flat with a tasty roll and only about 3 less well off.  i've also gotten lunch from here a few times and i can confirm it's the same tasty quality at a low price with lots of salad, sandwich, and hot entree options.  definitely a great wee place that i'm happy is so close to my flat :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z_xbO-Iaxbx-ZRPhLJK-Ew"
  }
}