{
  "nNBJrO09Lfk9tGMTn1fp1A": {
    "date": "7/23/2010",
    "text": "I have to admit, Esha's is a guilty pleasure of mine. Edinburgh offer few fried chicken shops, and many of the ones is does contain close early. Not this fine establishment though; Esha's is one for you drunkards out there. Open until 1, and 2 on the weekends, it is handily situated along the road probably frequented the most by students, South Clerk Street and they undeniably make up a large part of its clientele, being much busier late at night than at any other time.  Esha's does not just limit itself to chicken though, there is a plethora of late night goodies. Also purveyed are curries, pizzas, burgers and on occasions kebabs. The chicken is the star of the show though, with loads of different types and deals. The fillet burger with included hash brown is a particular favourite, especially with the spicy sauce. Generally the chicken does have a tendency to be a wee bit dried out and make sure you invest in a drink as well, as it saps all the moisture out of your mouth. However to counter this niggle, if you time it right and get there just as it is closing often you will be regaled with free chicken or massively reduced prices. My flatmate came home last week with glee written all over his face as he proudly thrust a ludicrous amount of chicken at me to share. '15 pieces for 2!!' he proceeded to brag, 'you cannot argue with that'. And to be fair, he's got a point.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jY_-RYvnEgoTBQwIzUhOEg",
        "caption": "Photo of Esha's - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jY_-RYvnEgoTBQwIzUhOEg/o.jpg"
      }
    ],
    "user_id": "Ga9DnmdmhE0Zzs_jRtmrfA"
  },
  "gTSo7dhMyqlAZHncqKKwbg": {
    "date": "7/9/2010",
    "text": "Esha's is not the best takeaway shop I have expereinced in Edinburgh, thats for sure.    Esha's is situated in the centre of the busy and bustling Nicolson Street, just a short walk from the University and so it is a handy place for students to pop into to buy their dinner on their home from classes, however, Esha's is not the best takeaway shop on Nicolson street to go into.   Esha's menu is incredibly diverse, offering dishes such as pizzas, burgers, curries and baked potatoes. I came to Esha's for dinner several months ago with a friend to buy a pizza and we had the ham and mushroom which was absolutely nothing to rave about. The mushrooms were really soft and appeared to have dissolved into the topping mixture, and the pizza base was quite soggy and burnt in places - not nice. My friend also ordered a portion of chips which were a far cry from the traditional Scottish chips we were expecting - these looked as though they had come from a frozen packet, and not a good one at that.   The prices are very reasonable and a 15% student discount is available. You are able to order your meals online at Esha's website and they also offer a home delivery service which is convenient.   The staff are friendly, and perhaps some of their other dishes are tastier than the pizza which I had.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HRSqPEy-mD08TWGfqSPObg",
        "caption": "Photo of Esha's - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HRSqPEy-mD08TWGfqSPObg/o.jpg"
      }
    ],
    "user_id": "OdUSlS-S6qfZFnDUCKzwEg"
  },
  "B1-ps__VlPtw1fidy9IJIQ": {
    "date": "7/6/2010",
    "text": "While offering a wide range of fast food besides their speciality chicken, Eshas leaves a little bit to be desired...  Personally, I would advise caution when venturing away from the chicken, as you are not assured of what you may actually get. Upon ordering a fish supper, I was provided with a thin morsel reminiscent with what I expect to find dished out during school dinners or to be found in the frozen section of Farmfoods. To rub salt into the wound, the chips were very thin and undercooked.   Perhaps I am being unfair given the price range.  Eshas offers a number of deals, presented on their front window, including at one point a 10 inch margarita pizza for 1.99! (although I believe this deal has since ceased).  Overall, this place is perfect for the hungry student venturing back from a booze up seeking something with a high grease content, but if your seeking something with a bit more quality to constitute as an actual meal, it may be best to look elsewhere.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vy7cOFFiuueQaSIeM6Ygkw",
        "caption": "Photo of Esha's - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vy7cOFFiuueQaSIeM6Ygkw/o.jpg"
      },
      {
        "img_id": "uOuZ5toJduxZ5KFKTbqEUw",
        "caption": "Photo of Esha's - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uOuZ5toJduxZ5KFKTbqEUw/o.jpg"
      }
    ],
    "user_id": "XXqfjl1w2QolT4_r_XRiwA"
  }
}