{
  "jARdUr-RqHmUPrfkI153HA": {
    "date": "7/8/2018",
    "text": "We came very late, 30 minutes before closing, and they were kind enough to let us order the main dishes.   I ordered the massaman red curry, which is one of their signature dishes. Lamb leg was pretty large and fall off the bone topped with some crispy noodles. Curry itself was extremely flavorful and mild at level 2. Order of steamed rice was plenty for the curry. Huge fan of massaman curry and they did it exceptionally well here.   Interior decor was fancy and upscale. Service was excellent.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "P4Td3m5oMGZGTfDVZzgztg"
  },
  "dtb9wShRjsis77UOX7vZ0g": {
    "date": "3/31/2018",
    "text": "This is a really nice Thai restaurant with very helpful & friendly staff and really authentic Thai food, the meat, fish & poultry are local but the vegetables and spices come from Thailand and you can taste that in the food you eat here.  Everything we ate was wonderfully tasty and enjoyable from the starters: spring rolls, scallops and sea bass salad through to our mains: sirloin steak \"angel\" curry - yum! Lamb shank curry - delicious and monkfish curry - also yummy!  It's a great place to enjoy Thai food in Edinburgh",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WC6gQ0eDwv6wz1KO8WiPHQ",
        "caption": "Photo of Passorn - Edinburgh, United Kingdom. Sea bass salad starter",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WC6gQ0eDwv6wz1KO8WiPHQ/o.jpg"
      },
      {
        "img_id": "MbcATXAYX6twlQzVZwPWBQ",
        "caption": "Photo of Passorn - Edinburgh, United Kingdom. Scallops starter",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MbcATXAYX6twlQzVZwPWBQ/o.jpg"
      }
    ],
    "user_id": "UDm_mrM67g-U-TxfFdrLew"
  },
  "71qsl1v8NJDRGGZoaRiKPg": {
    "date": "7/7/2017",
    "text": "The wonderful food and outstanding service at Passorn gave us a truly wonderful evening. Anything with the jumbo king prawns is superb -- as is everything else.   This is a terrific place for Thai !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "clsl0RhS8LIRk1kTstPqPQ",
        "caption": "Photo of Passorn - Edinburgh, United Kingdom. The sorbet was delicious",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/clsl0RhS8LIRk1kTstPqPQ/o.jpg"
      },
      {
        "img_id": "ga6mQmEaXSyhI0FwjRI3hA",
        "caption": "Photo of Passorn - Edinburgh, United Kingdom. jumbo king prawns were superb -- as was everything else.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ga6mQmEaXSyhI0FwjRI3hA/o.jpg"
      }
    ],
    "user_id": "-C_lAB18GP2mOdl3E3o-9Q"
  },
  "rPe6_-5bWNn4PNb46vxq8A": {
    "date": "5/14/2015",
    "text": "Went with a friend for a lunch date, as we were craving Thai. All in all, it was a \"meh\" experience (definitely not bad, but meh).  Maybe I'm spoiled, but I found the food to be on the mild end. It was definitely the right tastes, but none of the flavors were quite nearly as strong as what I expect from Thai food. The portions were also on the smaller side--I feel like we paid for a little more. To top that off, the music playing was Western (like Southern US country music), which really didn't go with the food. The guy waiting on us was also doing literally just that--WAITING on us, watching us... it was a slightly uncomfortable experience.  My friend seemed to feel the same about the food and the place, but it seems that the place is pretty popular by other reviews. I just know that we went for spice, and we didn't get much.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uI6fI4oZnt__2gUQNMVVcQ"
  },
  "xQ8vTJ7oHKREx4ef1w4qDw": {
    "date": "10/21/2014",
    "text": "Kanpai was closed, so my friend and I had to make a last minute decision to go to Passorn tonight. This wasn't such a problem for me as I love Thai food.  We are both vegan and so it was relieving to see a clear indication on the menu that the vegetarian options were cookied with vegetable oil. Sometime shrimp paste is sneaked into veggie food, but here this was no an issue. I went for a medium hot curry with tofu and vegetable, with some rice on the side. I can't remember the name of the curry. My friend went for the pad thai minus the egg, and we scared the fried taro with thai sweet chilli dipping sauce.  Everything was fresh, well spiced and tasted quite unique in comparison to many of other Thai restaurants in town which clearly buy in the same curry paste. Presentation was good, water was topped up regularly and the waitors were very attentive in general. We shared a bottle of nero d'avola. The prices are a little on the high end (11.25 for a main), but overall the food was delicious.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "HvQ576LJm6i6QZuTwl7WVg"
  },
  "sbUqBWYVjx2G2QLstCpTbg": {
    "date": "10/2/2013",
    "text": "What a fantastic place. This was my second visit and like the first, it didn't disappoint.   Let's start with the food. We decided to share some starters between the two of is and opted for the Thai spring rolls and the Golden taro fritters. Both were beautifully presented, decent portions and above all delicious!  Similar results for the main course; I went for a chicken stir fry with black pepper, ginger, garlic and coriander while my partner went for the chicken chilli cashew stir fry. Both dishes were beautiful, exploding with taste but yet nothing overpowering. Again portion sizes were perfect and we went for some coconut rice and noodles to accompany the mains. We were quite full after all of this and decided to give the deserts a skip.  Occasionally I have seen the wine list at some Asian restaurants being underwhelming, but passhorn got the perfect mix. A perfect blend of new and old world, while also being responsibly priced.  The service was good and attentive, but maybe a tad bit rushed in the time between placing the order to getting the first course - the same between finishing the starter and receiving the main. I like to relax and enjoy a meal so I probably should of let the waiter know up front.  Food overall was faultless.   5 stars - deducting one for feeling a bit rushed would be a bit harsh. I am sure if I said something at the time it wouldn't of been an issue. Can't wait to return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "uHHOBFkqZXQNXc-Tm8OqMQ"
  },
  "CVVUtkg4F69bgZ9BHYIH1A": {
    "date": "9/4/2016",
    "text": "Still one of Edinburgh's best Thai meals. A little bit more expensive than the rest, but that's rewarded with great service from the Thai staff, and impeccable preparation of the dishes. However, it's the quality of the food itself that it's the real talking point. Outstanding. Really like the way they ask you about spice, allowing you to score how much heat you'd like (from 1 to 5).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4s2DH7dmhgZRYQGs5JcGzg"
  },
  "FSvMgQ0w5pyzRDw0VyX5KQ": {
    "date": "9/2/2016",
    "text": "Very fancy restaurant with service and pricing appropriately. The food is a western interpretation of Thai flavours. Not what I was expecting nor what I was looking for.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fx3YkOE_W89LqxPFlKXigw"
  },
  "YWKEX76eVKlm3NHmtzBBOQ": {
    "date": "7/11/2010",
    "text": "Passorn - yet another Edinburgh Thai restaurant. Although this one is definitely worth a visit as the food is truly outstanding.   Located in the Tollcross area of Edinburgh, Passorn is just a short walk from the city centre so it is a convenient place to reach.   The menu is fairly substantial and offers a range of authentic Thai cuisine. I came here several months ago with a friend and ordered fishcakes for a starter which were tasty and made with fresh chilies, but quite pricey at about seven pounds. This was followed by a chicken stir fry which was also delicious and made with fresh ingredients. I got a massive case of food envy here though as my friend ordered marinated duck breast which looked amazing and tasted divine - I will most definitely be ordering that next time.   Most main meals are priced between eight and twelve pounds and Passorn have a good variety of vegetarian dishes available too. Set menus are also available which cost eight pounds for a three course meal - what a bargain!   'Passorn' means 'angel' in Thai, and this place truly is angelic.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "ti-SD7Sf4wUJB3aEn_x2vw",
        "caption": "Photo of Passorn - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ti-SD7Sf4wUJB3aEn_x2vw/o.jpg"
      }
    ],
    "user_id": "OdUSlS-S6qfZFnDUCKzwEg"
  },
  "fGO6JNtIvEpLSTHNKCc-PQ": {
    "date": "6/1/2012",
    "text": "This is one of the best restaurants I have been to ever. Period.  We walked in and asked for a table for three. The cozy dining room was full of guests so the gentleman who greeted us (we later found out that he is a partner in the outfit), Ian, told us that we could go down the street and grab a pint and he would come and fetch us. About ten minutes passed and sure enough, Ian peeked his head in the door of the pub and told us our table was ready.   The service from the moment we entered the door was amazing. Our coats were taken at the door and our drink orders were taken as soon as we sat down. The food was served very quickly and the presentation was an A+. I ordered the spiciest dish on the menu and when I was asked how spicy on a scale of 1-5 I wanted it, I replied \"a 6.\" They acted like I was crazy but I explained to them that I am from Texas and I eat raw habeneros from the garden. They understood. The food was amazing. The right amount of heat for this Longhorn. The prawns were a bit over cooked but that is the ONLY negative thing I can say about this place. When they found out we were from Austin, magically the music changed to Willie Nelson, George Jones and Johnny Cash.   Overall, this is one of the best experiences I have had in a dining setting. My brother and father agreed that this is one of the best meals they have eaten as well. Whenever we are back in Edinburgh, we will definitely be back and I will send any of my friends who are visiting the city this way.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1TkOTFjSWNuOQRrqkpvyJQ"
  },
  "l83YJevzDpbSPrlamZfCow": {
    "date": "10/8/2014",
    "text": "A friend and I walked by this place after seeing a film at the Cameo and decided to head in for dinner. It was so cute and cosy with a nice ambiance and the staff was kind, polite, and super attentive from the moment we walked in! We split the chicken satay and I had the chicken Pad Thai but it was all cooked to perfection with amazing flavours and beautiful presentation. Portion sizes were perfect. They have a rather extensive drinks menu and I got a very delicious cocktail. A little pricey for Edinburgh but an absolutely wonderful and worthwhile experience. Perfect for date night or as part of a nice evening out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8XtPjxLxYiZv4KLLwuGtcg"
  },
  "ewzjYY0YNamoLhuRQPPX2g": {
    "date": "10/28/2011",
    "text": "Wow such good food, tasty nice spices, perfect meat.  The Thai food is traditional but with a touch of fusion  We had alot of disches to share, everything was excellent.  My only concern is the location(for a tourist) its close to the city but a boring area in town, but just take a taxi or walk from Grasmarket 5 min.  Decor: clean  Stuff: excellent, really friendly  Go there!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-GwqsPQ2WC-dNkjOyJ_FcA"
  },
  "2IMb1t2O-x3z0UEHWtpNmQ": {
    "date": "9/5/2013",
    "text": "A very nice place, that obviously has a good reputation.  Had to call to make a reservation after our walk up attempt was unsuccessful.  The dinners of Pad Thai and Curry were excellent.  We hadn't had Thai in a long time, so we may be a bit skewed to approve, but we really liked it.  The place was very nice, staff attentive.  Only downside, a bit pricey.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GuAxBy_9TqmXDOPksJKiJg"
  },
  "pFpGxWgVGMVEA4c85lBhfA": {
    "date": "12/3/2011",
    "text": "I was pretty disappointed. I definitely wouldn't go back and I wouldn't recommend it. The sizes were excessively small for the price and the would matter less if what I had really impressed me, but the flavours seemed confused and unappetising. I didn't even finish my dish, which is pretty darn shocking for me in a Thai restaurant. Pros? It's pretty and chic looking. Wtvr.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y0mXSJKOi_1y3ZQyXnFGFg"
  },
  "qwAMMW8wd5Tj7gqiI4FsLw": {
    "date": "9/10/2010",
    "text": "As a Yank who has just moved to Edinburgh, I found myself sopping wet and in need of a cozy restaurant with an enticing menu.  Like an angel as its name means in Thai, Passorn is a beautiful little restaurant located in the Tollcross area on Brougham St, just a wee bit north of the Meadows.  While its cold gray-and-white exterior might not grab you in, you should look past this and enter, just as the saying goes about judging a book about its cover.    My friend and I were warmly greeted by the owner/manager, who even helped take our coats and hung them on the wall.  Not something I'd expect for lunch-time service, but nonetheless welcomed.  The restaurant consists of 2 main areas, the front room is a bit smaller which fits about 3 tables and the bar/register and the adjacent room which is a bit larger and tastefully decorated with silver and grey wallpaper.  High ceilings and original  crown moulding details add to the ambience.  There were a couple of diners already there when we came, and as the lunch hour wore on there was a nice trickle of elderly locals and businessmen.  I ordered the lunch special, which is a 3-course meal which gives one the opportunity to choose from one item from their selection of appetizers, main entrees, and dessert (ice cream or tea).  7.95 pounds which seems to be the going rate for pre-fix lunch menus in the area.  I went for the chicken balls which is 2 skewers (chicken ball + green and red peppers on each) served beautifully on a plate with a sweet siracha chili / pepper flake dip.  The colors are bold, the produce super fresh, and the chicken was nicely grilled.  Continuing on, I had the pad chili dish which is a spicy dish consisting of chicken, mushrooms, onions, peppers, in a savory brown sauce, scallions, and a sculpted tower of white rice.  Home run - I loved it, even if it challenged my well-seasoned spicy pallet range.  I would have loved to have more, but then again, I'm from a country that is home of lumberjack helpings.    For 90 pence, you can get your afternoon tea served beautifully in white china and at least 3 cups full.  The art of tea - yes indeed they have mastered and the service was attentive and courteous.  I'll be back for sure, with more friends and family, and look forward to sampling the rest of their menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gui44CqZIbPkrn9BEopQcA"
  },
  "iBImmSUmxgipu93v3iqQlA": {
    "date": "10/8/2012",
    "text": "Absolutely fantastic. So good I added the restaurant myself.  Really good blend of modern and traditional Thai food. Thoroughly recommended, great friendly service for any occasion. Book first as restaurant size is slightly small.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "txuNeX2O5z5kwlrRKj4C7w"
  },
  "ohpZvNTyT9cqcWqeaSe9vQ": {
    "date": "10/10/2011",
    "text": "The food here was unbelievable and certainly the Tom Yum was the best I'd ever had (I had it with King Prawns!) I then had a creamy red curry with sliced beef for my main course! The service was a bit strange and I ordered a cranberry juice, then \"we don't have any cranberry\" then I ordered a pineapple juice instead, they came back a minute later \"I'm really sorry we also don't have any pineapple juice now, we just have orange and apple juice\" and then I was like 'Well if your sure you definitely have apple juice then i'll have that!\" .......you know whats coming next in this story......\"sorry its just orange juice we have now\" ......so I got tap water in the end!!! But if you want AMAZING Thai food in Edinburgh go here....",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hzt2Rv6SHaZZEb-4peqEPg"
  },
  "geGSjgxu2rOVFU8lxR-pHw": {
    "date": "12/28/2010",
    "text": "Jennifer D, I'm afraid I can't agree with you that the prices at Passorn make it plain bad as your review seems to imply. Firstly, what's the soup? I presume you mean Tom Yum or Tom Kah. Tom Yum/Kah is meant to be warming and zingy, but not filling, which perhaps was what you expected?   As someone who's been to Passorn a few times, I'm loyal to it because the owner/manager is a really kind woman and I can see she's put a lot into the business and genuinely wants her customers to leave satisfied, and I always have. I'd agree it's not the cheapest but it's the best I've had in Edinburgh and in other countries, but I prefer quality over quantity. It's also a lovely, polished space with an intimate ambiance, which isn't everyone's thing.   Of course there are places more basic, but in my opinion the quality of the food won't be as good. I'd rather pay more, for a beautiful, zingy soup, and get a smaller serving, than get large portions of something generic.   I actually think the portions at Passorn are ideal. I leave full, but not bloated.  They also do a pre-theatre dinner menu (two courses for 11.95) and set lunch menu - (two courses for 7.95).   So you're not disappointed and left feeling misled about prices again, why not check to see if the restaurant you're going to has a website. Passorn's menu and prices are on its website. Failing that, just leave politely if you don't like the prices on the printed menu.   There's also nothing stopping you speaking to the management directly about the prices. I've done this myself before when I feel it's not fair to go straight to the online arena to absolutely rubbish a place, and I've been glad I've done that because the response and reasons I've been given have explained some things.   By the way, isn't Yak and Yeti a Nepalese restaurant? The prices sound brilliant but it's not really the most helpful suggestion for people in pursuit of Thai food? Do you know of another Thai restaurant that is well-priced, with generous servings and genuinely good food?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pnNaaQpFw9OxpRPccndrkg"
  },
  "bXuJg7AP10cEYg6i9xIdjg": {
    "date": "8/26/2010",
    "text": "The food is decent quality, but not worth the huge price tag. You are better suited to find another thai restaurant. I ordered a bowl of soup. I thought it should be a very good bowl of soup because it was expensive. I expected a decent portion as well, and was very very disappointed, IT WAS HARDLY A BOWL OF SOUP, MORE LIKE HALF OF A VERY TINY CUP! The other review for this place made mention that the fish cakes were 7.00. I've been willing to shell out for very decent food in the past as well, but when the portions that are served here are more like a diet suggestion for a 300 kilo fat cow, I don't know whether to be offended, or ripped off. Every single item is way overpriced. I don't know how they have managed to stay in business this long. Don't be like the other sheep that poor through these doors, just because they see a nice thai restaurant with high prices. it doesn't mean it's better quality food. Go to Yak and Yeti restaurant instead, where you pay just under 6 for a huge tray of food with a huge pile of rice or naan, and several other dishes. Just a suggestion, as I was very impressed with the quality of restaurant, the service, the portions, and the price there. PASSORN, SHAME ON YOU FOR RIPPING OFF PEOPLE. YOU DISGUST ME. YOUR SOUP ISN'T WORTH THE PRICE TAG. I'M SURPRISED YOU DON'T CHARGE JUST FOR LOOKING AT THE MENU.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZkKLMfiLYiUdVt8H1qEzYQ"
  },
  "bnujh5LW6IDqe3-qfCYRJw": {
    "date": "5/7/2011",
    "text": "Bland food, inadequate portions - sadly disappointed. At least it was only 7.95 for a 2 course set lunch so didn't throw too much money down the drain.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IBKyt2_fw_GtF9t_EknOSg"
  }
}