{
  "qu7g8rJjoYqh90vh_7sa3w": {
    "date": "9/29/2018",
    "text": "Summary: A great find in Edinburgh. The prices are great during lunch and the food isn't too bad. It's not as good as the tacos you find in Los Angeles--but it's easily one of the best taco joints in Edinburgh.   Service: The service is very good--the staff is attentive and very kind. They are informed of what their menu has to offer and are genuinely excited to give recommendations to first timers.   Food: I had the daily special fish tacos--flavor was quite mild but the spice levels were just right. The fish was slightly over-fried and the breading was too crunchy for my preferences. My friends ordered the burritos and constantly complained that there were way too many beans inside it. Keep note of these things when ordering.   Cheers.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LKleHBnJouNjiEdh6ebpeA"
  },
  "SbCtyU5oF6DdOiJSH9aYFQ": {
    "date": "7/2/2018",
    "text": "This is my last night in Edinburgh, and when I saw Mexican food in Scotland, I thought: Take a chance.  I was immediately brought an entire bottle of Jose Cuervo 1800 and a water glass.  I thought, \"wow, these are my kind of scoundrels!\"   As it turns out, it was a bottle of water. : )  I like the street food/tapas format, but I wish I had the option of ordering each item ala cart (like a real Tapas bar).  I ordered Carne Asada tacos.  Three small corn tortilla tacos per 6.25 order.  They offer 6 taco options, and I would have preferred to mix and match.  If you order taquitos, they are two to an order.  Again, I would appreciate the ability to buy '1' ala cart since there were 5 choices.  You have a tapas 'vibe', but not the customer choice.  I ordered the Roasted Salsa Brava (4-chile warning) & chips (1.50).  The salsa had a nice heat that is slow-build.  It was like a thinned-down tomato paste.  Nice tomato flavor, but one-dimensional.  With some chopped onions and fresh Cilantro, this could really shine.    I spoke with one woman here a couple days ago that thought Haggis was \"too spicy\", so maybe the 4-chile warning was appropriate for the local market.  I would rate it 1-chile spicy.  The thin corn tortillas fell apart quickly, making for a \"messy Marvin\" eating experience.  If they used two tortillas (like El Pollo Loco in the US), it would have held together better.  The Carne Asada had good flavor, but was cooked well done.  I was seated immediately, but I would describe the pace of service as \"relaxed\". And I don't mean that as a pejorative.  Just plan on relaxing and enjoying your meal.  I did.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sHcBVKkexlmDs1SIsaN8lA"
  },
  "yp1uJzjMPQebRS2rLH_hyw": {
    "date": "9/9/2018",
    "text": "This isn't owned by Rick Bayless like in the US.  And It isn't very good .. super  greasy & they use feta cheese on the taquitos which I've never seen before and is NOT Mexican.  However the Service was great and very friendly.  ended up leaving and looking for dessert elsewhere to wash down the grease .... The queso fundido was really  good",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lDbC13TkaoB2UYkW7oesRA"
  },
  "Yfqv98oXjbyiCJ0IkX0mFw": {
    "date": "10/17/2016",
    "text": "Super friendly staff & super speedy service even though it was really busy for a Monday night. The place has a great atmosphere, the decor is nice although our corner was a little dark for reading the menu.   The dishes were tasty, full of flavour & very fresh.  We shared the pork, corn & crumbly cheese tostadas - which we wolfed down before I had a chance to grab a pic, the smoked chicken quesadillas, the pasilla king prawn tacos & the albondigas con casabel.  The food is good value, the portion sizes are generous. Great tapas sizes for sharing if you want to try a few things. Will definitely be back to try some more dishes. & the el borracho lager isn't bad either. Margaritas next time - but not on a school night ;-)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Qm3yDbNLz-44GIfKIOfckA",
        "caption": "Photo of Topolabamba - Edinburgh, United Kingdom. Menu - it was about too dark at our table to read",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Qm3yDbNLz-44GIfKIOfckA/o.jpg"
      },
      {
        "img_id": "ldnhOmPlgbjRceo5ysDDvg",
        "caption": "Photo of Topolabamba - Edinburgh, United Kingdom. Cute decorations",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ldnhOmPlgbjRceo5ysDDvg/o.jpg"
      },
      {
        "img_id": "P3gWZe2uiUeVUS5F9DtclQ",
        "caption": "Photo of Topolabamba - Edinburgh, United Kingdom. Repurposed tequila bottles used for water",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/P3gWZe2uiUeVUS5F9DtclQ/o.jpg"
      }
    ],
    "user_id": "R9UNH0rb3a_glQlk4ylKCw"
  },
  "eWplp6ZiFTRaGXyBv1YytA": {
    "date": "8/3/2016",
    "text": "I have to be honest, I love Topolabamba.   I came here with no real expectations - other than that it would be good. And it was. Knowing (and being known in) the Glasgow location,   The food is flavourful, the staff is friendly. You can tell that the place has just opened up as there are still some hiccups (like the frozen marg machines being out of order) here and there, but that does not detract from the ultimate feel of Topolabamba.   What you can expect when you come here includes incredible music (the staff is still dancing to it themselves), favourful and delicious food: a definite recommendation remains to be the Queso Fundido, the crispy fish tacos if you like some spice, the beef tostadas, the chicken tacos (be advised there is some cilantro in there!), and alcoholic margaritas. A new found favourite of mine is the unfrozen watermelon margarita which is definitely worth a recommendation.   I had never paid much attention to the desert menu, however this time around, I decided to order the Chocolate chilli ice cream. Warning: Eat with care because boy, does the heat kick you in the throat after about 5 minutes. If you like living on the edge and enjoy chocolate with heat, this is for you! Definitely an amazing desert!   The restaurant is decorated to the same standards as the Glasgow one; it's colourful, it's vibrant, it's a happy place. It might be a little smaller, but it has a cosy and welcoming feel to it. I love the attention to detail and the little touches. The two person booths have coat hooks, which is brilliant.   All I can say, is wake-up Edinburgh and go to Topolabamba!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "UBlInsLfxSoY-7ncoex_EA",
        "caption": "Photo of Topolabamba - Edinburgh, United Kingdom. Chocolate chilli ice cream. That&amp;#39;s a chilli seed, just be aware.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UBlInsLfxSoY-7ncoex_EA/o.jpg"
      },
      {
        "img_id": "it5o4zlpaDaFzQZhumtgjg",
        "caption": "Photo of Topolabamba - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/it5o4zlpaDaFzQZhumtgjg/o.jpg"
      },
      {
        "img_id": "6CnXKnkaEHjWsvy773xeUA",
        "caption": "Photo of Topolabamba - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6CnXKnkaEHjWsvy773xeUA/o.jpg"
      }
    ],
    "user_id": "7c6TSHHKVeB8lngF7XWalA"
  },
  "dza-wktRaqmDeGNbJ1kegQ": {
    "date": "9/8/2016",
    "text": "Excellent restaurant with tasty tapas. Went here on a Saturday night with my boyfriend and it was great. Every dish was full of flavour and even though they look small, six dishes between the two of us left us stuffed. I also had the Golden Apple margarita which isn't as good as a 'real' margarita but for the price was really good. Overall this place is really reasonable and has a great atmosphere. The only negative I had was that the food came out so fast (because it's tapas and a couple of our dishes were dips) that I felt we had finished our meal within about half an hour. Will definitely be back though!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Isie3BNDGKTe_gCTyk_6cg",
        "caption": "Photo of Topolabamba - Edinburgh, United Kingdom. Topolabamba",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Isie3BNDGKTe_gCTyk_6cg/o.jpg"
      }
    ],
    "user_id": "UROkCgA18uG7WXg1X2vIdA"
  },
  "5hJhGsMV3V5OjmodIoA2Xg": {
    "date": "12/1/2016",
    "text": "I have been here three times since it opened - it's a good choice for dining with pals as the format is tapas and there are loads of dishes to share. Each tapas dish is around 4 - 5, and there are also main courses on offer from about the tenner mark.   I am useless with spicy food, and at least half of the options on the menu are out of my palate level sadly. However, what remains is tasty and varied - there is a reasonable selection of vegetarian grub up for grabs too.  Must admit I am a fan of the cheese fondue thing. It comes with a stack of homemade tortilla chips to dip. Yum.   Downside? No teapots (oh, the rage!). Plus the loos are not accessible as they are down a flight of stairs.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fcMTpwfLS9F5DWTqlp8ktQ"
  },
  "kBcFnLcKFcKpYSdyKzLJCA": {
    "date": "11/29/2016",
    "text": "I am not the biggest fan of Topalabamba. I understand the concept of tapas size but I think the place is quite overpriced for what they served.. Tapas should be outstanding food and I just found the food quite mediocre. Ordered some nachos and burritos but the burritos were not that good and the nachos were not well assorted. I might try this place again but nothing really to crave for.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ThHJVG58S2pqc8vJU4fDkA"
  },
  "IqtehRsPtg8MEcZZA6MGTA": {
    "date": "10/9/2016",
    "text": "Poor quality food, bad service, weak and small margaritas. Food was cold, and worst of all nothing near authentic Mexican.  Don't waste your money. There are many other new Mexican branded restaurants in Edinburgh and some close to this one.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DU_DRHEb27CF6OGEdl8S0g"
  },
  "RkPq3fxaa994DzNXL3bjLw": {
    "date": "10/17/2016",
    "text": "Seriously spiced, seriously delicious food. A good opportunity for your taste buds, that I advice you don't pass on. Great experience",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AUPd8BKUuPt-1GwQhlbDpA"
  },
  "9nK0utrUh0w4daZ2i6pl9Q": {
    "date": "10/4/2016",
    "text": "We ordered two chimichangas,  one beef and one chicken. They were both absolutely perfect!! We also had an order of queso fundido which was very good and perfectly proportioned. After dinner, we were feeling something sweet and got some churros which were the best churros I've ever had in my life.  Great portion size,  crispy yet soft,  coated with cinnamon and served with a side of chocolate sauce. The prices were very affordable. I highly recommend this superb restaurant and will definitely be going back in the near future.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VQwCc8z_anJ-fXg-TLxC2g"
  }
}