{
  "eUSn1v5-VgpZgtRgP2avXQ": {
    "date": "7/26/2011",
    "text": "this place seems to be getting a couple a bad of reviews but I went here last night due to location and it was lovely. We had two courses for a tenner, plenty of choice and it was really tasty food. Only thing I will say is that the staff looked over stretched and it took a good while to get our drinks but they were really busy. Would go again. Great price, good food",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MXdFKeqnoMDj180hlC7ttg"
  },
  "EuxRqO4aOVbB20y6vo2hRQ": {
    "date": "3/9/2011",
    "text": "Good atmosphere. Good service. Great beer selection and interesting cocktails on half price mid week deal. Slightly overfull of posh students spending daddy's money.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MK-B-xPoul68xlbusfD-Ew"
  },
  "xtubQwwkOX8_EGLyavwC7A": {
    "date": "4/22/2010",
    "text": "With heaters and seating outside and a plush interior, Montpeliers is a reliable choice for a casual drink. Having a swanky bar in the middle of Bruntsfield (an area in the outskirts of the city) is something of a luxury and for that you'll pay extra. Regardless of this, the lager selection is great and judging by the raspberry mojito my friend had they do good cocktails too. You'll often see a group of casual drinkers underneath its exterior canopy, sharing the warmth of the heaters on one of Edinburgh's chilly nights.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KWd3wiWPANgCmd3WRzoY5g",
        "caption": "Photo of Montpeliers - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KWd3wiWPANgCmd3WRzoY5g/o.jpg"
      }
    ],
    "user_id": "UvIb5v3biEgcxWKnxf0ocg"
  },
  "Uvru9RCJGvPUwEhhaNkPZQ": {
    "date": "1/15/2009",
    "text": "A truly nasty place. Bad food I can forgive. Bad service too. But a place which deliberately treats its customers like ignorant dross?   True story: I once met one of the partners behind this local chain of equally rip-off outlets at a social event. He proudly described to me his philosophy of catering. Give them cheap crap but dress it up to look and sound pretentious and they'll be happy, because the people we cater to have no real taste at all and will swallow anything if it's in trendy surroundings, and sounds a bit fancy without being too unusual, and costs a lot. And the sad thing is that he's pretty much spot-on about the nouveau riche middle agers who gag for his formula.   Even the name of the place is appropriately pompous, since the local streets opposite from which they take their name are in fact traditionally pronounced 'Mont-peel-ee-urs'. Yet the owners of course insist on making it sound like the Mediterranean town renowned for thieves and pickpockets. Come to think of it, maybe that's not so inappropriate after all",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9u1iRrHtgpgXqpR6Mp-_Xw"
  },
  "W2jVW0ZytT-kjU22uPijyw": {
    "date": "10/8/2007",
    "text": "Montpeliers is a great place for food and drink, the menu is reasonable and the drinks menu is great, the thing that lets down this place though is the service. You could die of dehydration before getting served a drink and the staff are really friendly but for the majority of the time you are in there they miss every opportunity to serve you! So if you're in a rush give it a miss, but otherwise it is a good night out especially if your local.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OvZ7cVhTcJ55yb_mtUhC1Q"
  },
  "RPinP5JOCQ0n93fusu0o0g": {
    "date": "11/18/2008",
    "text": "Nice local bar in Bruntsfield area , serves good selection of beers/lagers but expensive for both food and drinks. Bar is usually well staffed so not waiting too long to get served or you can have table service if you can get a table.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yI4LI8-aYYUS9MmrfpidMQ"
  },
  "0_0R5Fsv7cDLhaTEDCYBnw": {
    "date": "11/25/2008",
    "text": "A great place to go for a drink and a light bite any time of day. With tables outside, this is an ideal place for a refreshing drink in the summertime (although the tables are generally not in the sun, and are shaded), or a cosy hot drink in the winter. Extremely popular for brunch at the weekends, Montpeliers is often full so get there early! The staff are very friendly and helpful, capable of dealing with a range of customers from groups through to small children through to Morningside ladies. There is a good range of cocktails and some excellent deals on drinks, making it a good after-work stop.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "clcemNTSlJs3O7iv_Q7BFw"
  },
  "pjZd4og8-dmxYZE8GgUw0A": {
    "date": "10/12/2007",
    "text": "This is a good place to go in a group, as the menu is varied enough for different tastes, a good place to choose if you have a hangover, it has all the comfort food you are looking for: fish and chips, bangers and mash and steak pie...Try the steak - it's delicious! If you just fancy a drink, the bar is quite nice to hang out in.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GZ4tNqBOZnj0YYULdvThkg"
  },
  "HU7kZyM9pn3znvi6IOz0kQ": {
    "date": "11/21/2007",
    "text": "This trendy restaurant/bar offers good two for ones on wine and coronas on both a wednesday and a friday night before 8pm. I haven't eaten at the restaurant so I can't comment on that, but as far as bars goes this is a nice classy one. Good older crowd. Nothing super special about the decor just your typical modern styled bar. There is a large screen on one of the walls, so perhaps it might be a nice place to watch a game. A small place, but offers a good atmosphere. People seemed to be quite friendly when I was there and the service was good. I would describe this bar as a good first stop after work on a friday kind of place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "amc0ZeuFXVQtHDGgesK9dA"
  },
  "90t4aEPRsOWMqCS5Yhuhwg": {
    "date": "3/16/2008",
    "text": "Went back here at the weekend and want to give an update since my earlier reveiw - even more crap ! Had food and it was simply awful, wilted rocket, chicken tiny and rubbery, a spoonful of potatoes, mushroom sauce did not pour and just stuck to the bowl like mushroom ketchup - steaks cold. blah blah music so loud it was like a nightclub and so dark could hardly read the menu Only good thing was the waitress who was so sweet and good at her job, we felt sorry for her as just everything was so awful - avoid like the plague - a truly crap bar and never eat there simply too awful for words.   Just been done up recently and I preferred it they way it was, new seats are too big and bulky and flowery wallpaper awfully garish. Always busy however and good for the 2 for 1 offers but everywhere you look they are advertising their perfect serve of 25ml of standard spirit and a draught mixer for 4 - is it just me but who else thinks this is a pure rip-off? I can understand paying this in George Street but in Bruntsfield, no way! Oh, and you can double up for 6 !!! - no thank you.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M6EkAFfIpIgonH3pbJ6KDQ"
  },
  "IAzlh7U82IPFBLhZ9641Mg": {
    "date": "11/26/2008",
    "text": "Very cool place. Well designed and nice atmosphere. Always prety crowded though as it is obviously popular so sometimes makes it a bit un-comfortable inside and can be a little pricey. Great menu and the sharing platters are delicious!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n_rSCsfU2M3tGcEfFp1q6w"
  },
  "TFL5g1seuKxGXw_4Xv1A0w": {
    "date": "5/7/2011",
    "text": "Dirty, over priced, pretentious, sticky tables, soiled forks and knifes, sticky floors, student staff who clearly haven't got a clue, needs a refurb. Make your own mind up.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yxplUTyzTXGz0Fj1doXWcA"
  },
  "QcB9sJsC9qKRz_Yu0TZprg": {
    "date": "5/2/2010",
    "text": "Montpelier's in Bruntsfield seems to have all the ingredients necessary to be a stylish local bar and eatery, and to be fair, it is quite a stylish venue for a drink or something to eat. Unfortunately, it is yet another place to fall into the all style and no substance trap. Having had a few enjoyable evenings here sampling the bar's wares, I thought it would be a good place to go for dinner. I was wrong. On paper the food does sound really tasty, unfortunately the tastiness doesn't seem to transfer onto the plate; more than half of the party were unhappy with their meals - complaints ranged from soggy batter on the fish to a veggie burger that was tasteless and stodgy. The service was overtly intrusive, barely five minutes would pass before a wait person would be interrupting us and asking if everything was ok or if we were ok for drinks and when we confronted our waiter with the sorry state of our food he didn't seem to know what to do. I'm pretty sure Montpelier's can do better than this.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mJJj_SZff6MEWG5Vx1r8Bg"
  },
  "Oz1hKLUgQt1mx-gbEKxQeA": {
    "date": "12/10/2009",
    "text": "It's ok...sometimes it's nice to go there for a change and the coffee can be excellent (if you haven't had to wait 10 minutes for it) but as far as service goes it's slow and not that good! You can be standing ages at the bar whilst the lonely bartender makes coffees/drink checks/tries to serve everyone else before you, and even then you'll be lucky to have your drinks poured with no interruptions. The pint glasses they use need replacing or Renovating - every time I go in there I have to ask for another glass as my pint has gone flat as a pancake between the bar and the table. I'll give it one thing though - it's always a comfortable temperature!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "metqnUI1CEG72ubR7R7s9w"
  },
  "Lefm-fC_0Im8ow8LPjTTeA": {
    "date": "12/30/2009",
    "text": "Horrible. So many things to dislike. The bosses must be real toss artists to create a place that is so cynically nasty on so many levels. But I guess the sort of makeup caked clients they attract don't care as long as it has enough trendy style cues to reassure them that the massive overpricing of massively ordinary stuff is money well squandered. Are you a taste-free herd-trained brain-dead fashion victim? If so hurry along. You'll love it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mTH7-QA2H9auoUi9no10Ww"
  },
  "RGi_hDLv1MoAZsVYZImdPA": {
    "date": "6/6/2009",
    "text": "Lost most of it's old friendlyness and is all too often frequented by desperate and slightly agressive divorcees workaholics. Food is still good though and a decent bloody Mary.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mAc9rRjPSJiDCXFeR3EetA"
  },
  "ppGoAun8ybJJ-FlNHzHFhw": {
    "date": "5/6/2013",
    "text": "Great mid week drink offers cheap cocktails and wine yay!  If you're looking for a quiet pint or a cheeky vino in Bruntsfield then Montpeliers is the place to visit. This well-stocked bar and restaurant is very stylish and comfortable, especially if you can snag one of the gigantic sofas. It's a cozy, laid-back, and welcoming place, just like a good bar should be. They have midweek happy hour specials on the drinks making it really good value. The food is alright though quality can vary a bit. I had a stirfry that had no veg and looked rather like dog food recently but have had much nicer things before so will put that down to being one of those things and hope it doesn't happen next time I go in! Montpeliers is probably one of the most popular pubs in Bruntsfield and it's always lively. Plus If the sun is shining you can sit at the tables on the street and watch the world passing by.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "neMi0e3dZaUtX7Sg-3Qytw"
  },
  "8bgrhbLBT-LvfUCANXeFLg": {
    "date": "5/3/2013",
    "text": "I've been here three times. Once for a Christmas dinner, once for lunch and more recently another night coerced by friends to go for a drink after our exercise class, which felt really uncomfortable as it was a Thursday night and everyone was really dressed up apart from us in our running gear, and cycling helmets with us! To be fair no one even looked at us but I don't normally go to bars looking like this so I felt a bit weird.   For the christmas dinner they were able to cater well for a big group of people (around 20 of us), and the food was great both times I ate here. The decor is really nice and I like the low lighting.   I'd never thought of Montpeliers as a bar to just go into for a drink but there were lots of people in there for just drinks and though it's not necessarily a big bar there's plenty of seating. I probably wouldn't choose to go there for drinks on a night out as I'm more likely to head into town, but for food I would definitely go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "O6dMShJ-dIX_4Qsq6mvvqA"
  },
  "0IT3IDUeWm4kpAElFZabDA": {
    "date": "3/14/2013",
    "text": "Well priced.  The truffle wild mushroom pasta on the 2 or 3 course menu is good.  The 2 course for 10 pounds is great.  Almost too good the be True.    Don't skimp on wine.  The cheap wine here is indeed cheap wine. We ordered both and couldn't finish the other.  But the food and the atmosphere are great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-0MQ4webH2uc1ZAsGsNENg"
  },
  "MwRttZE1b52WF6eKVSYmOg": {
    "date": "4/21/2012",
    "text": "At a friend's suggestion we came here for lunch. Had looked at it before and thought the bar list looked pricey  so probably not one to loiter in over endless rounds of drinks but not bad for a cheap lunch. There appear to be regular deals going on so will check out in future.  Two mains for 10 from a choice of Thai Green currys (chicken and veggie), pasta and burgers. Opted for the Thai Green curry which was reasonable enough - sauce could have been thicker (but I did get a gluten free version), but good chunks of chicken and vegetables in a lightly spiced sauce which was enjoyable. 3 stars for the meantime. This may change in the future though I wasn't wowed their choice of puds so hopped over to Cafe Grande for take-out gluten free cheesecake which is fab :)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "frthTngbBHgSdk4j85HmEQ"
  },
  "FWCWwKMraG4tS9gCcwpahg": {
    "date": "7/17/2010",
    "text": "I've since broken up with that no-good, sleaze of a boyfriend that took me here on a first date. Twat.  I've not realised that Mont Peliers isn't as great as I once thought! It's really really expensive, it's difficult to get to if you just want a drink - if you come here for a drink then you can't really go anywhere else without a taxi or a 25 minute walk. pfft.  It's small too, there are never enough seats and the outside ones are full of smokers! It's alright though, not great, just alright. If you want to go here then it's not a bad place to be. Although the food takes AGES to come.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o0WGr8L3BWfH2Bslpnqw6g"
  },
  "bt4lXIh7uW3NtDPCploj5A": {
    "date": "5/9/2012",
    "text": "In my never ending search for the citys best burger I found myself hear last night.  Part of the group that includes Tiger Lilly, Ricks and Indigo Yard you have the surroudnings you can come to expect from those guys.  As well as their full menu they also have a 2 courses for 10 option, in todays world not only is that sensible its a bloody bargain.  I started with the mackerel fish cakes served with a lemon hollandaise. Nice soft fish cakes with a slightly too runny sauce but a tasty dish. I would prefer more fish to the potato ratio but for the price really good.  To the burger, called a buccleuch burger its served with bacon cheese on top and a side of tomato relish and fries. Decend fries, tasty relish...the burger itself was well carmaelised and had decent flavour. The texture/density left a bit to be desired, was too compact. The bacon was fatty, undercooked and not so great. if it has been nice and crispy that would have been a winner for me.  All in all for the price a great meal and washed down with a pint of schiehallion. Jd = happy man!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rl4hqDnywPJDCK4wfbXMzg"
  },
  "L2-2ZDDGGOmwTECRAegDCA": {
    "date": "4/1/2010",
    "text": "This Bruntsfield brasserie is the original establishment belonging to the Montpeliers chain. As a result, you would expect it to come with all the other trimmings as other Montpeliers venues (such as Tigerlily), and for the most part it does.  My only criticism of it would be the fact that the service was quite slow, however the lunchtime I was there was an extremely busy one, which has to say something about the popularity of this place.  Their mantra plastered across menus, posters and their website is \"A bar? A brasserie? Why Choose?\", and you have to hand it to them - this place is great for a soup-and-sandwich style lunch and late night drinks with friends in equal measure. Avoid this place at the very beginning and end of academic terms though, as it will be packed full of parents dropping off/picked up by their student kids.  The recent overhaul means that whilst enjoying your drinks with friends, you can do so whilst relaxing on the luxurious leather sofas. Great for relaxation but bad for the bank balance, as it often means that 'a quick drink' turns into several more!  During the summer months there are tables outside, and the location of this bar-brasserie on the main street of fashionable Brunstfield makes the ultimate spot for people-watching.  Don't miss... the Pear & Cucumber Gin Fizz from the cocktail menu. Yes, at 7.50 it costs nearly as much as a main course, but it's worth every penny.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "O4Mp30IJzEmNXdhUPCu2og",
        "caption": "Photo of Montpeliers - Edinburgh, United Kingdom. image courtesy of www.montpeliersedinburgh.co.uk",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/O4Mp30IJzEmNXdhUPCu2og/o.jpg"
      }
    ],
    "user_id": "oEshN5oq98_g23MvEnRc5A"
  },
  "iWu6Rhr5LiAZQe4eN2n6Yw": {
    "date": "12/27/2012",
    "text": "I really liked the vibe here but was disappointed with the food. It nicely decorated and the lighting is perfect, verging on dark which is quite relaxing for some reason. I had the pan fried halloumi salad but was not impressed. the cheese was cold and it shouldn't have been. maybe it had been sitting in the kitchen for a while before it came out, which is a shame because this place is fairly elegant and I reckon their other food is good. I'd go back as like I say, its a nice place to hang out. I sat and head the Hunger Games for over an hour and couldn't believe a whole hour had passed...",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Hzt2Rv6SHaZZEb-4peqEPg"
  },
  "TfpQUpj8-x9MUqr22lRTdQ": {
    "date": "3/20/2013",
    "text": "I had been wanting to try this place for a while as I had heard it had an amazing brunch (I'm slightly obsessed with eggs benny). So I decided to pop in for lunch. I tried the chicken and avocado sandwich with chips. It was good, the bread was quite big but tasted fresh and good. The chicken itself was nothing spectacular but overall I ate it quite happily. Its a nice place to go with the wee one. We sat on this huge couch where my daughter had a great time bouncing around. Very comfortable with child and we met other mama's with children there too!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "F0nFAY1Qi_7it_Q52n3nTw"
  },
  "xXYBS_Z2-3VSNPAoq40fuQ": {
    "date": "1/14/2013",
    "text": "bruntsfield is a corner of edinburgh that houses a number of lovely places, from shops to cafes to restaurants and a theatre.  although i am sad that the peckahms has been closed and turned into a sainsburys!  however,nestled among all the rest is montpeliers offering breakfast, lunch, and dinner in classy but cosy surroundings.  i often find myself headed to montpeliers when i'm in the bruntsfield area (most likely to see a movie at the dominion) and this place just hits the spot for me.  on sunday, the boyfriend and i went for sunday brunch before trying to get tickets to les miserables (the dominion was sold out :( so we had to resort to cineworld).  while the place wasn't overly busy, for some reason all the tables were reserved and when i asked to sit away from the door we were told that the only option was the bar.  to be honest, i didn't mind as the bar is a perfectly nice place to sit but i didn't see any customers enter the restaurant to be seated at those empty tables we were denied....  anyway, we were handed menus and while i did ponder the more lunch options of the menu, when i saw the description of the vegetarian breakfast i knew that was what i was having.  eggs (scrambled, poached, or fried), veggie sausage, baked beans, potato scones, grilled tomato and mushrooms, and a spring onion and potato rosti.  this enormous plate also came with a side of toast!  everything on my plate was fresh and made to order, the eggs being creamy and not over cooked, the potato rosti having a nice crisp outside with a soft tasty inside, and potato scones just lightly fried.  i know it's breakfast and rather difficult to mess up, but it just really hit the spot for me :)  i also like that instead of squeezing the toast on the side of the plate they brought it over in a nice basket with plently of butter to share between us.  the price for this breakfast also included a tea or coffee and a cup of orange juice.  apparently though you can't subsitute the orange for another juice, which sort of annoyed me as i wanted cranberry and had to pay extra for that.  my boyfriend got the extra orange juice so he was happy though.  after many visits i remain a fan of montpeliers.  it's not fine dining, but it's good quality food in nice surroundings with friendly service.  there is also a nice cocktail list that i will have to try out one day if i ever make it for an evening visit!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z_xbO-Iaxbx-ZRPhLJK-Ew"
  },
  "_2r68wqZjZHkxNoCy8mgjg": {
    "date": "10/19/2013",
    "text": "During our week long stay up the street at the Best Western Bruntsfield, Montpeliers became our \"go to\" place. Great breakfasts with a broad selection. The two mains for 10 before 5 pm had us working our way through the menu. Never a bad experience. Great staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DP_LDz4rqDO_j6ZRahjqcQ"
  },
  "CKi8419YWPBGYhLZUGAW9w": {
    "date": "9/23/2011",
    "text": "I went with a party of 6 to Montpelliers last night specifically because of their great deal of Dine for 10 (starter/dessert and a main). Turned out to be excellent value. I went for the (recommended by a friend) fish cakes and a special of spicy chicken and mash. Great comfort food, although the spicy sauce on the chicken was strangely cold. Only blip in a great pub meal. Staff were lovely, the place was buzzing on a Thursday night. Recommended!  P.s after reading the other reviews I must add that the drinks were rather expensive, but luckily I wasn't paying.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "31TAWsE-rzkBOMes7fmTYA"
  },
  "9nrDJTJu-DPdI0YpjUK5dw": {
    "date": "11/25/2012",
    "text": "We booked this place without knowing about their \"2 Courses for 10\" offer, so that was a welcome surprise. We were really impressed with the Mussels starter, and both ate the duck confit which was outstanding. We finished by sharing the cheese board, which was the perfect end to a delicious meal.   It's one of the best meals we ate during our stay in Edinburgh, and I would happily have paid full price for everything we ate. That it only cost 10 for both courses was too good to be True!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w_4skmTUvOFPSAbikRYcSg"
  },
  "ZJrQcWT6qeFu7XX8Ow2V5g": {
    "date": "5/9/2010",
    "text": "I popped in here for lunch with a friend the other day, and I was sadly disappointed. Montpeliers looks like it has everything you need for a perfect lunch, but it failed to deliver.   The waitress should quit her day job and become a sales woman as she can managed to make everything so much better than it was. She sold the special to me as homemade pitta bread with brie and carried on to describe such a delicious meal that I couldn't resist. I ended up with pitta bread from Tesco, a few slabs of Brie and some rocket. Talk about bland and unfilling. My friend had a burger which she was more than happy with and I was stupidly jealous of.   Luckily there was a buy one get one free on mains so it only came to around a tenner. Otherwise I would have had a problem paying 9 pound for that pretty shoddy lunch. Sad to say I doubt I will be back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oKdygoDX5CfDJeXzv_EVaw"
  },
  "dm40I9aIpQUgPO9W-dvHmw": {
    "date": "3/20/2012",
    "text": "Went here earlier tonight with my dad, we're in Scotland on holiday for a few days.  He had the leg of lamb, I had the seared tuna steak.  A delicious dinner (and a few rounds of drinks) at a reasonable price.  Waitstaff was friendly and pleasantly talkative.  I will go again when I am able and am already singing this restaurant's praises to my friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xAK0gHcA0xoep3nT7pMq1A"
  },
  "0TuoYD-rjdU-BJPm-OMyFQ": {
    "date": "9/3/2011",
    "text": "Considering I spend most weekends only 2 minutes walk from this place, the fact I've only been in a handful of times tells it's own story.  Yes it's fine for a glass of wine or a beer, but it's full of those 'big fish in a small pond' types and subsequently prices are a bit on the steep side. You can get decent deals on meals and that's the only only reason I'd return now.  The menu and food are pretty good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hpOJQWalhWC8Lp2tETE1dw"
  },
  "yUQQ8JIuhN8dBzGPkKkalg": {
    "date": "10/23/2008",
    "text": "Don't know about the drinking but the food here is nice. Dropped in for hangover brunch a few times and the french toast with bacon and maple syrup sorts you right out. My mouth is watering just thinking about it   Service can be a bit hit and miss, but the vibe is relaxed so it's no great shakes if the food takes a bit of time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-58CWJ48is4duXgpvsWEGA"
  },
  "PIZMAqLJFI-TxstIgiBnug": {
    "date": "11/16/2008",
    "text": "Spent many a late night in Monties and enjoyed the atmosphere on a weekday evening. One of the few bars in Bruntsfield, they have a good selection of lager on tap and in bottle. They do an excellent Gin and tonic with very special tonic.   The prices are steep but not too bad. The cocktails are good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xL8TPB74FH44MNc3cokrFA"
  },
  "itYzybRKxurnhaQtF7UxvA": {
    "date": "12/13/2007",
    "text": "This is the bar that started it all. Monty's success spawned Edinburgh institutions like Opal Lounge, Rick's, Lulu, The Living Room etc. Whether that's a good or bad thing is up to you really. Cocktails or a pint?   This bar does both well. There's an emphasis on quality with nice, crisps European lagers on tap and posh spirits all around. Fancy a gin & tonic? You can be confronted with the choice of 5 or 6 gins and 3 tonics, not to mention bitters. Be prepared to know what you're ordering, because it can be like ordering a Subway sandwich.   The staff are friendly and well trained the service isn't always quick - it's more about justifying the large price tag of a cocktail with attentive service and presentation.   If you're not on a budget and know exactly how you like a drink however, this could be the place for you!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uop7sZaxJEQInWQTrQCplA"
  },
  "7B9LdkKxPB8gjiXtDGirYA": {
    "date": "11/5/2007",
    "text": "159-161 Bruntsfield Place Edinburgh EH10 4DG tel: 0131 229 3115 fax: 0131 221 0809 <a href=\"/redir?url=http%3A%2F%2Fwww.montpeliersedinburgh.co.uk&s=a5dc6115e64258d60caefd9feb0376fc563601f459a649f153ef5610f172615e\" target=\"_blank\" rel=\"nofollow\">montpeliersedinburgh.co....</a> Great atmosphere and very comfy. The food is a bit tasteless but the friendly staff and relaxing establishment makes up for it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g7XMbtrjPXU8y19yQV7Dkg"
  },
  "805edudR9ZPqukrLtpBdbA": {
    "date": "5/27/2019",
    "text": "I came here for Brunch and dinner and my review is based on those two experiences. Also I have to eat gluten free as I have celiacs.  Brunch was not planned and thus we didnt have a reservation. But the hostess/waitress accommodated us at the bar top on the left even though it was quite busy. Breakfast was decent. I got the gluten free eggs Benedict with spinach. When I tasted it, I knew something was different so I broke down the dish to its individual components and discovered it was the hollandaise sauce. More specifically it tasted like the Tabasco sauce was left out. Also it needed a bit more salt. The dish normally has a small amount of this for the salt and vinegar contents more so than spice as is not at all spicy in these small amounts. Though I personally dont mind adding a bit of salt to a dish instead of getting a dish that is too salty it was not my favorite meal.  The desert I got saved brunch. It was a cheese board with red onion marmalade and served with thickish potato unsweet cookies is the best description I can give. I did include the menu so you can read the list as well.   Next, we came back for dinner. I had the nachos with chili. Very similar to the USA and the chili was very flavorful. The notable differences are: 1) it is served in a bowl so you have to eat it with a fork. 2) the cheese is only on the top. My boyfriend asked me what I had ordered and, when I told him, he was shocked. I do not want people to think this was bad or good, just different. But it was quite tasty and flavorful.  My wheat eating boyfriend got the fish and chips and liked it. Per him, chips were better here than London, fish was better in London. But keep in mind I'm conveying this without experiencing it because it is not gluten free.  Please note nothing they fry is actually gluten free as they do not always keep a gluten free fryer. This is fine for people who are intolerant but dangerous for people with celiacs so I was very grateful when I was told this by the waitstaff.   No to-go/takeaway containers so if you arent sure you can finish your food, be prepared to share or leave it.   Good bar, good staff, and very knowledgable",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xzImzze6ID4vHAvvdDCxhA",
        "caption": "Photo of Montpeliers - Edinburgh, United Kingdom. Gluten free menus",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xzImzze6ID4vHAvvdDCxhA/o.jpg"
      },
      {
        "img_id": "Rno7a834rTxxQrzFVTfEPw",
        "caption": "Photo of Montpeliers - Edinburgh, United Kingdom. Gluten free menus",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Rno7a834rTxxQrzFVTfEPw/o.jpg"
      }
    ],
    "user_id": "Kc0dgLCeO0PzG5J2mKsRwg"
  },
  "i98B7UQSe71v_4h3jgWUtA": {
    "date": "3/13/2019",
    "text": "If you're going here for a Sunday breakfast/lunch/brunch, MAKE A RESERVATION. I waited for over an hour for a table for two until I was finally seated for what was a pretty good meal. It gets crowded, people, plan ahead.   The Mexican tortilla was only okay, but the TRUFFLE MAC N CHEESE was amazing!! Unfortunately, the truffle mac n cheese is only served as a small side and not a bucket. I swear it's that good...you'll want a bucket full.  Also, the wait staff is friendly and attentive.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MbulS5k9kKQ-KpzuC9ZQNw"
  },
  "AoPtgdnEioVCZHBgCAsr-Q": {
    "date": "3/30/2018",
    "text": "Nice decoration and atmosphere. The plates look really good but they didnt taste that good. It did not meet our expectations, specially the caramelized banana pancakes",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GYfUCn5m7CDVaw-PyiSERw",
        "caption": "Photo of Montpeliers - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GYfUCn5m7CDVaw-PyiSERw/o.jpg"
      }
    ],
    "user_id": "CHX7b9MuBXEpR5Tr9566Qg"
  },
  "1cI7_4yBUS5iR-YPQgjyQA": {
    "date": "3/23/2017",
    "text": "Quite a few years since I was last in here (mainly due to its location but also the prices) but one of our party suggested it was we were passing last Saturday so in we went.  First off the obvious refurbishment has greatly improved the immediate area around the bar. Previously there was just enough space for one person to either be served or walk through on the way to the toilets, which made it a nightmare to attempt either when people with drinks decided to stay around rather than thin out and get a seat or stand in a less awkward spot. That issue has been well dealt with and you can now happily sit or stand at the bar causing no more inconvenience to other customers than anywhere else.  This weekend there was a schoolboy error behind the bar - one blackboard had not been updated with the 5p price rise & so was behind the till and the other board. The barman advised it would be sorted \"at some point\".  Staying on the subject of prices things haven't changed since my last visit so you're paying the best part of 5 for a pint each time, whether of ale or premium lager. The range of ales is though very good (possibly into double figures) so, if money's no problem, you could do very well in that regard. For the home-based drinker there is also a Growler service now but I've no idea how much cheaper that makes things.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "txzOZrHK9EVY0kYjSuXkKg"
  },
  "Nfi4KSkLV95Bnscun-7TDQ": {
    "date": "12/12/2015",
    "text": "I would very happily set up here with a coffee and my laptop and watch the world go by. It's absolutely charming, if not a bit on the expensive side.  I very rarely get into Bruntsfield, so when the resurrected Yelp Brunch Club landed here, I was tickled pink (thanks John & Alisa!). The space is like a little Parisian fairytale with its fairy lights and sweet little cafe seating. I wish the inside held a bit more of the whimsicality of their entrance, but its clean lines and simple place settings are still lovely... bonus points for the proper tea cups.  I usually can't pass up an Eggs Benny but much to my surprise, I ended up going with the pancakes. When they arrived, I immediately regretted the decision, thinking they were a bit too small and oogling the bennies across the table. However, they ended up being surprisingly tasty... if not really pancakey. They're closer to a fried bread/bannock type dish than pancakes but they were still worth getting - it was a nice, buttery start to the afternoon. On the other side of the spectrum, the eggs that accompanied them were a bit of a write off (mushy!) and look silly plopped on the plate.  My meal came out to 25... which seems excessive but I also ordered a Mimosa/Buck Fizz without remembering the brunch cocktails aren't really a thing in Edinburgh. Back home in Canadiana, mimosas are such a regular staple that most restaurants stock a more reasonable bubbly option - you're putting orange juice in it afterall, no need to be very fancy. Here, they made the Buck Fizz with Moet... which is beautiful but a little over the top for a mimosa and a staggering 10 per flute. Though I rolled my eyes a bit, I also know better and should have check prior to ordering, so I won't give too much fuss. Though with the Bloody Marys also being in the 8 range, I would pass on brunchy drinks in the future.  It's a lovely spot and if I lived in the area, I could see it easily becoming a safe go-to in the area. Is it enough to trek from Stockbridge to on the regular? No. But I definitely wouldn't turn my nose up at another brunch opportunity here.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "RanFdusnrHqaYVbRtLZSLg",
        "caption": "Photo of Montpeliers - Edinburgh, United Kingdom. Pancakes with bacon",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RanFdusnrHqaYVbRtLZSLg/o.jpg"
      },
      {
        "img_id": "p6uRkU1HNFGv_fhyTbrhQw",
        "caption": "Photo of Montpeliers - Edinburgh, United Kingdom. The world&amp;#39;s most expensive mimosa...",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/p6uRkU1HNFGv_fhyTbrhQw/o.jpg"
      },
      {
        "img_id": "hj0wW8oSVaJkZAuDA8077g",
        "caption": "Photo of Montpeliers - Edinburgh, United Kingdom. Pancakes with bacon",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hj0wW8oSVaJkZAuDA8077g/o.jpg"
      }
    ],
    "user_id": "H5TEwR-OD0XxILGNaewohA"
  },
  "L6SNNpPTA_RFeqMQ7ZK3rA": {
    "date": "11/21/2015",
    "text": "After moving to the area a couple of months ago, the wife and I have been determined to have brunch in one of the many possible choices in Brunchfield. Montpeliers is our first stop on finding the best brunch in the south of Edinburgh.   Montpeliers is so inviting from the outside, that I have wanted to come in here for a long time. They are often busy in the evening for drinks, and they have a good lunch deal. On hearing about their brunch through another friend, I couldn't help but come here for something that included eggs :)   I had the scrambled eggs with smoked salmon and brown toast. The eggs were good, but a bit on the cooling-down side... not quite warm enough for me, but still tasty. The brown bread was good, but not quite to the chunky granary standard that I have come to expect from places such as Blue Bear. The best part of the meal was the smoked salmon... SO good!   I'm looking forward to raise my review to 4 stars in the future after trying dinner, the lunch special or drinks... fingers crossed to my being a bit more impressed :)",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "Ez0me39tDbQmAYOPc9AK3A",
        "caption": "Photo of Montpeliers - Edinburgh, United Kingdom. Franciscan Well stout",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ez0me39tDbQmAYOPc9AK3A/o.jpg"
      },
      {
        "img_id": "gXZ6ZZfrSfNz_AnC8G1l9Q",
        "caption": "Photo of Montpeliers - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gXZ6ZZfrSfNz_AnC8G1l9Q/o.jpg"
      }
    ],
    "user_id": "tXIN2tMOAiZH-lGwEaHOkg"
  },
  "DmdqWQqOG2JJ88DhYD7W5A": {
    "date": "11/18/2015",
    "text": "I've been here twice before - once for a large group dinner and again for a morning breakfast break. Dinner, if I recall correctly, was deeee-lish. Breakfast, was glorious - and I'm about to tell you why.  The new trend these days should be caramelised banana pancakes. Fluffy stacks of warmth and comfort, drizzled with a lovely sweet syrup and the flavour of bananas coating every corner of your mouth.  I recon homemade pancakes would taste wonderful but the pancakes that Montpelier's comes up with were just heavenly. Topped with a lovely English breakfast, these two dishes were the perfect combination to share.  The place can be a bit pricey and some have called it over-rated, but to me, the food has definitely convinced me to go back for more. Even if it's just to indulge a little.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "NPeQPm2DPTeLx1cUWT66Vg",
        "caption": "Photo of Montpeliers - Edinburgh, United Kingdom. Breakfast for champions",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NPeQPm2DPTeLx1cUWT66Vg/o.jpg"
      }
    ],
    "user_id": "2hMR2Rm75LbvP2lkBzZCeQ"
  },
  "bkF9_OJkeOSFeKW1yugSAw": {
    "date": "12/15/2015",
    "text": "Very cozy place. Can be busy for brunch/lunch so a reservation is recommended.  The cappuccino is really really good! I even had two, something I normally never do.  The eggs benny were ok, good thick sauce. I had them with salmon and spinach, but the contrast between cold and hot elements I found not ideal. I realise the salmon is of course cold, but maybe they should have toasted the bun a bit.   Still, for coziness, friendly service, nice place, and amazing cappuccino, they deserve 4 stars for sure!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "6mKN6Zg4RtdRF49fjoV1fw",
        "caption": "Photo of Montpeliers - Edinburgh, United Kingdom. Really yummy cappuccino",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6mKN6Zg4RtdRF49fjoV1fw/o.jpg"
      },
      {
        "img_id": "jta6SVnhILZAP2DWxwWVHg",
        "caption": "Photo of Montpeliers - Edinburgh, United Kingdom. Three in a row eggs benny salmon with spinach",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jta6SVnhILZAP2DWxwWVHg/o.jpg"
      }
    ],
    "user_id": "QpnH7JOjbMAAaYw0IIt_Xg"
  },
  "JMwz8Us7UgECjbDbN9uIRQ": {
    "date": "12/14/2015",
    "text": "I have been to Montpeliers for drinks, brunch and most recently dinner and on all occasions, I have had a great experience. Montpeliers has modern decor and a bustling atmosphere - always busy, no matter the time of day! They have a varied menu, mainly what I would call British dishes, including the usual options, but often with a twist or different accompaniment. They use local suppliers, so it is nice produce cooked well. I was particularly impressed by my recent dinner experience, where the food was delicious all-round, the wine was excellent and the service fantastic. There are also a million fairy lights up for Christmas, which makes it a really magical setting.  The food is a little on the pricey side, but that reflects the fact that the quality and setting are better than a comparable bistro-type restaurant in my opinion. For a cheaper option, they have mid-week dining specials, different on each day of the week.  I would highly recommend Montpeliers for a group meal, but maybe not the best if you're looking for a quiet dinner for 2.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "FAwYmeCkpPI_0FH5eWtkgA",
        "caption": "Photo of Montpeliers - Edinburgh, United Kingdom. Sea bass, crushed potatoes wih watercress and saffron sauce",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FAwYmeCkpPI_0FH5eWtkgA/o.jpg"
      }
    ],
    "user_id": "CiEcf2sST7Ow1dP_RKb22w"
  },
  "-RhQ_97Kgn-ARITNEM9SgA": {
    "date": "12/14/2015",
    "text": "Came across to Bruntsfield as part of a brunch event with other Yelpers. I've never lived on this part of town and I have always wanted to explore what it had to offer in the way of food.  I think Montpelliers looks good. Everything has a very modern, desginer-y, hipster look. I like a good use of font so I appreciate that. I'm not totally sure if this aesthetic reflects the DNA of the place or if it is just a fresh coat of paint, but either way I liked it.  The coffee looked like it was more towards italian style where a cappacuino has an airy foam and chocolate sprinkles. That's not really my thing so I went for the pot of Artisan Roast coffee which came in a little cafetiere ready for me to plunge.This annoys me a bit because I have no idea how long it's been brewing for and it ends up being guesswork on my part.  I went for the mexican tortialla because I love mexican food, and I love it at breakfast time even more so. It looked pretty good served cast-iron dish and on a wooden board. There was a little side pot of avocado and spring onions but these didn't seem particularly fresh. The eggs were good, but the kidney beans in tomato sauce could have done with a bit more flavour and spice.  I'd probably want to check out other places in the area for brunch before rushing back here, and if I did I'd go for something a bit more conservative like eggs and toast. I would definitely consider coming back for a drink in the evening as I feel like it could have a great ambiance.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "phrFayc1PgReAeY-9wLR3A",
        "caption": "Photo of Montpeliers - Edinburgh, United Kingdom. Mexican tortilla.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/phrFayc1PgReAeY-9wLR3A/o.jpg"
      }
    ],
    "user_id": "eFqg1qaOBHq_Od6fRlMcWA"
  },
  "87CZeuNxA5-a6uJ28Qxa_Q": {
    "date": "7/27/2015",
    "text": "Great place with a cool atmosphere, but I suppose I wasn't lucky with my choice of the menu. If I will come back, I will go for the normal menu instead..  FOOD - We had a deal: starter and main dinner for 10. But my burger wasn't one of the nicest ones I've had, quite dry and tasteless. For the starter I had a Whitebait with lemon & caper creme fraiche - I am not sure if it was just my personal preference, but for me it was just very salty and oily. However girls seemed to be quite fine with their fish. The presentation of the food was lovely SERVICE - great and attentive TIMING - Good for busy night  ATMOSPHERE - cool design, pleasant tunes and full of people, but still quiet place enough to hide with my friends and talk VALUE - I suppose for the deal it was ok, however I wouldn't choose the same one again. I think better food might be without the deals they have.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wgsv6jGtdwrhbQSso2GPqg",
        "caption": "Photo of Montpeliers - Edinburgh, United Kingdom. Whitebait with lemon &amp;amp; caper crème fraîche Starter and main for £10",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wgsv6jGtdwrhbQSso2GPqg/o.jpg"
      },
      {
        "img_id": "k9rkE4JW10BZidd1a9N9Zw",
        "caption": "Photo of Montpeliers - Edinburgh, United Kingdom. Orkney beef burger, fries &amp;amp; tomato chutney",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/k9rkE4JW10BZidd1a9N9Zw/o.jpg"
      }
    ],
    "user_id": "-bfKZtGlIGklj3OzEqyTeA"
  },
  "9C_oHiI-l_-Ksbg6_KisqA": {
    "date": "5/2/2016",
    "text": "Custard instead of bernaise sauce. On steak. Custard on steak.  Was the meal comped? Yes. Did anyone make a move to make any sort of apology? Actually no. One star, thanks.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4UQfst9jve4GCSfWpWn2uA"
  },
  "7LOumBfEmqGIG-8ZwBC2RQ": {
    "date": "1/10/2014",
    "text": "I like Montpeliers, it's a solid option along Bruntsfield. The food is usually decent and arrives in reasonable time. It's a typical gastro-pub option with a varied menu and good burgers.   It's never particularly impressed me though; it's more an old reliable option when you're not sure where to take someone and want to make sure everything's hunky dory.   It's usually extremely busy when I make an appearance and the packed feel of the restaurant doesn't bring anything to the party. Still, table service is quick and efficient and the staff are friendly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Zssl-8FTE-BCwtOR7eUsmw",
        "caption": "Photo of Montpeliers - Edinburgh, United Kingdom. Pulled pork sandwich",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Zssl-8FTE-BCwtOR7eUsmw/o.jpg"
      }
    ],
    "user_id": "fcMTpwfLS9F5DWTqlp8ktQ"
  },
  "j4dmIqcs7iDQ5E3cN851yA": {
    "date": "12/3/2015",
    "text": "Very nice bar and restaurant in Bruntsfield. I popped in for the excellent 10 deal for two main courses at lunch time. Service was good- friendly and efficient (I feel I always use these two words, but they are important!). Food was also tasty. There is a nice choice at lunchtime- burger, salmon, sausages, chicken ciabatta, and penne. I want to go back to try more of the options. There is also a 10 deal at dinnertime, and I've heard the brunch is good too, so I'll definitely be back for that. Nice selection of craft beers and wine too.  Location is good on Bruntsfield Place. I'm sad I don't live in this area any more, as it's a bit of a trek for me to get here now. I recommend Montpeliers.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "RMOJLdLHdFai_ksWCMDOoA"
  },
  "Egq4ry78MWQXMqqIhxE6kg": {
    "date": "10/20/2015",
    "text": "\"The Original\" - that is what's know as.  They have many branches and even some copycats, but Montpeliers in Bruntsfield is the original incarnation.   It feels like taking a mini holiday away from home. Even if it is only for a couple of hours, you'll feel suitably refreshed.   Drinks, service and food are of a good standard and you know you are being taken care of.  I highly recommend going here to satisfy your cravings for \"getting away from it all\".   Sure it is a little pricey, but look at how they treat the place and the customers. This is how you decorate and run a place when you are in the business of pleasing your customers.   Many more visits to follow",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "fKi8ZF3xpJJkgSusRubeMA"
  },
  "zTdbnnBhpyVy2e9PKKP-uw": {
    "date": "10/5/2014",
    "text": "Expensive but nice.  I had a burger here recently and found it delicious, in fact it had one of the best onion rings I've ever had in my life on it (disclaimer 1: I don't like onion rings and this one was more batter than onion, disclaimer 2: I love batter!)  Montpeliers seems constantly full and our 4pm stop in was over-shadowed by the fact that every table seems to be booked from 5:30.   The menu is decent, I had the burger with Isle of Mull cheddar and The OH went for the pulled pork roll. Both were pretty delicious and I washed mine down with the Ginger Grouse - a decent drink if ever there was one.  The place seems to run quite smoothly and the staff had everything in control. They were attentive but not overly so, a big win.   The decor is very modern meets old French country house. The ceiling is black which weirdly works quite well. The front area (inside) is similar to a wee terrace with a tiled floor while areas near the back have book cases and lush curtains. the outside seating area is probably the most eye catching as it's filled with flowers - which the staff pain-stakingly put out every morning and take in every night!   Overall a nice, casual dinner but not quite me. It suits the older crowd in the area quite well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "KPY6FvT6h-r0W0HAC1Buag"
  },
  "9S7Ya1RQ3xEYg5N_AHlsxg": {
    "date": "3/28/2015",
    "text": "The atmosphere and service at this Bruntsfield favorite were excellent today. My boyfriend and I were seated quickly around 13:15, without a reservation. We each had Bloody Mary's, which were excellent. He had the Full Monty and really enjoyed it, and I had the Eggs Benedict with smoked salmon. I would rate 5 on the atmosphere and 'cool factor,' but am giving 4 stars since the salmon flavor was overpowered by too much Hollandaise sauce. Will return and will take friends for sure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2LdjE2-cIV8c66KVZ2KoLA",
        "caption": "Photo of Montpeliers - Edinburgh, United Kingdom. Yum!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2LdjE2-cIV8c66KVZ2KoLA/o.jpg"
      },
      {
        "img_id": "_6FH5hOyt73MFtZwDmJxaQ",
        "caption": "Photo of Montpeliers - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_6FH5hOyt73MFtZwDmJxaQ/o.jpg"
      },
      {
        "img_id": "yqjg3zl5CuIYDTz5Dp5h4g",
        "caption": "Photo of Montpeliers - Edinburgh, United Kingdom. Excellent window seat.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yqjg3zl5CuIYDTz5Dp5h4g/o.jpg"
      }
    ],
    "user_id": "-2EcIDIDnA8H7N81jwYpcQ"
  },
  "gUvfrvmrKRdsP0gsYAwlpg": {
    "date": "8/7/2013",
    "text": "A last minute decision on a Tuesday evening without booking went superbly. The waiter could not have been more suave and helpful rolled into one. Having shown us to a leather buttoned couch on the 'bar' side of the restaurant we promptly listened to the specials of the day, ordered crisp wine and buried noses into menus.   Mouth watering goats cheese and artichoke salad perfectly poised next to haddock fishcakes with a buttery tartar sauce could not have been devoured any quicker. Greed, and pace of consumption, is a fine measure at times. Summer lamb burger juiced with a cool mint sauce was jaw achingly awesome. The gnocchi; plump and inviting among an array of blue cheese, spinach and cherry tomatoes was near enough perfect. At ten schmackers for two courses per person, Montpeliers is a sure enough place to consume, converse and corroborate.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 4
    },
    "photos": [],
    "user_id": "2Pa_GYN72ug7DK4Jo-_uFg"
  },
  "WBv8ffKElbA0REr7zDvyHQ": {
    "date": "5/23/2017",
    "text": "PLEASE GO HERE! We went for breakfast on our vacation to Edinburgh, and it was perfect. we have severe gluten allergies and they had a whole menu to compensate our needs! We got the eggs Benedict, GF french toast, nachos, scrambled eggs, and the best bacon I've ever had. Waitress was so lovely and sweet. She even brought cream out to tend to a burn on one of our hands (a burn that occurred even outside the restaurant!). Food was delicious and reasonably priced. Interior was so cute and comfy! If I wasn't leaving tomorrow, I'd go back in a heart beat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KdWPL1mo_KbQq5Q9iBsTjA"
  },
  "MwAFGicTyAIOQbXs2Ttq3w": {
    "date": "6/2/2014",
    "text": "I've been in Montepliers a few times and, regardless of the slightly pricey drinks list, I quite like the restaurant/pub. I've never had any food here but know that there are a few excellent offers to be found here. The most famous one being 2 courses for 10 which in the Bruntsfield area isn't too shabby.  Along with a slightly larger priced drinks list, comes a slightly high class of staff, which is True and can be said for Montpeliers, falling under the same group as Indigo Yard, Tiger Lilly and Ricks as Jurgen has kindly said (thanks for being the recommended reviews and saving me endless Google searches).  The bar staff in here can pour a good pint and are usually friendly enough to be polite but not overly friendly that you can't get peace to enjoy your pint.  Good to have a pint after work or a drink with a few mates but I wouldn't recommend it for a night out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1cGu1Ml-NXDOT1kqvdG8sg"
  }
}