{
  "h_tioQPKX0H0fq5nA1mexg": {
    "date": "2/17/2011",
    "text": "The service here is excellent; very friendly and very punctual. However, my food was sooo hot. This is not necessarily a bad thing, but so hot, that it seemed like it had to have been microwaved or something. Made me think that it could have been sitting for a bit and then reheated. Maybe not though and they are just super fast at delivery the food to the table as soon as it comes out of the oven. The food on the whole is good but the starters, wine and after limoncello is excellent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "psHTikQaM3rLRiMtq1gZeg"
  },
  "WxFfti8wvoBJzdnMbJ7bAw": {
    "date": "9/21/2008",
    "text": "I went here for my birthday and it was great. It's a small little place and has a really friendly atmosphere, plus they do my favourite pasta dish: penne al salmone - mmmmm! My brother even said the steak was good. I've seen on their sign they also do a set lunch in the week, that really should be my next thing to try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d_ey4ni1O2smjKeFlgu3RQ"
  },
  "QkIKkvKNEY8OWI_bMU0eEA": {
    "date": "4/18/2009",
    "text": "Great place, food tasted fresh, everything had an authentic italian feel including the music, which if I'm honest was a little loud for a romantic evening, but I can think of nothing else to say against the place. Quite large portions, so we'll have to go back sometime to try the deserts!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8JGqs4-WtU1jMYcdFKEKGg"
  },
  "sCygRRJ_NCfQAAvvHBjxhg": {
    "date": "12/9/2011",
    "text": "delightful place, great service and great food every time we've visited",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DMqg_WsADZfNZh4BMly3Mw"
  },
  "-rNIyPzCSZGl4kzb_gXFAw": {
    "date": "8/30/2019",
    "text": "Lovely place for dinner. We had an Italian craving and this fixed it. The owner is from southern Italy and very kind. We had a large group and they were more than accommodating. We had the mixed fish, spaghetti carbonara, special pasta, soup of the day, and the mussels pasta. All delicious! House wine was 16 p for a bottle so you can't say no, it was lovely. Highly recommend this place to friends or for a date night.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_rTm3pe9uCbN9fi10aR0nQ"
  },
  "13CdHf0D6hrv_YrxSncU_Q": {
    "date": "9/11/2019",
    "text": "Food was good and our waiter was pleasant. The issue for my review is based on customer service. Not sure if he was a manager/ owner / or bar-back. But after immediately serving us our coffee and pastry (after our dinner) we were told that we need to hurry up and leave because they had a reservation coming in. Even though there was an identical empty table right next to us. WTF so tired of RUDE people",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EvyHdpy21z0lzmLKHzjxXg"
  },
  "wyuj-9ns-YsjGWfVGmKBvQ": {
    "date": "2/12/2018",
    "text": "Homemade pasta and pizzas. The calzone and the ravioli are a must! Very friendly staff but always very busy - so booking is a must for this restaurant!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-n7rMCr_RoZDfMYt0ROAMQ"
  },
  "ytkj7D2Ac6SRyKSadY_pOQ": {
    "date": "9/29/2015",
    "text": "I will definitely be returning to Papilio. The food was great, the atmosphere was cosy and friendly, and the service was ridiculously good. Like \"instantly at my side the moment I considered asking for something\" good. Yet they did it without hovering, thus proving their mastery of the fine art of restaurant service.   My girlfriend and I both ordered pasta dishes. I got the Tagliatelle Papilio. I laughed when I saw that the menu said \"Very special - please try it!\", but I took their advice and didn't look back. So worth it - I highly recommend you do the same. Also, we both agreed that the noodles were the perfect consistency. They were either made in-house or at the very least brought to the restaurant fresh.   The staff was friendly and chatty (just the right amount of chatty), and made us feel welcome the moment we sat down. This is the kind of restaurant I could picture myself getting to know the staff at, ya know? Friendly guys making excellent food - my kinda people. The food here was great, a rock solid 4 stars. But the service was 5 stars.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "L5DPhZAKCsbu4ENYAI6UIA"
  },
  "MBg0jy_5NyfnrZgdDU4kmA": {
    "date": "3/5/2014",
    "text": "With less than a hour to scoff what delights Papilio's offered the clock was ticking. So great that they have walk-in tables even though the place was booked solid for later. Met at the door by the manager and with a polite request that there is a table for you and your party but we will need it back for less than an hours time for guests whom booked it for 7pm. No problem it shall be done, we said to the manager.  Service very friendly, chatty staff but service was quick, as they needed the table it was like service for us was in rush mode, enabling the food to be prepared, delivered and scoffed. That being said undue care was slightly at play with the texture and taste of some dishes.  Calamari was slightly rubbery but otherwise ok and came with a salad, Tagliatelle Papilio was their special so obviously I had to give it a go since it was our first visit. Other members of our party had chicken stuffed with spinach, with accompanied veggies and a very very heavy balsamic vinegary sauce. As we were sharing samples, for me it kind of spoilt the dish that veggies with the chooks were drowning in salt, so sharing meant it kind of spoiled that dish for me and didn't eat a lot of it. A fine pizza-margarita completed the quadrant of plates.  Ambience and friendliness of staff were second to none, fussing over us not just because someone else required the table, but what I witnessed was their manner with all guests. If Papilio's was the trend at the moment then I guess more folks would venture out to experience the face yoga that comes with the sounds made when the food arrives.   Fans of Italian restaurants in Edinburgh should be happy that I would recommend coming here even if it's just for an afternoon coffee with a group of friends, but especially for evening meal make sure you book and leave enough time for coffee or finishing that bottle of wine.  To get a healthy glow from smiling at the happiness inside a room, even with its slight flaw we experienced, I can't wait for the next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "iJzETbNXKHWvOxEHjsocgw",
        "caption": "Photo of Papilio - Edinburgh, United Kingdom. Calamari et salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iJzETbNXKHWvOxEHjsocgw/o.jpg"
      }
    ],
    "user_id": "IpLZ7RevQrFPJWYc9Gxymg"
  },
  "Vkpz56yT_exqO_MBf8N4jQ": {
    "date": "3/27/2014",
    "text": "I am a regular in Papilio and truly believe it is one of the best Italian Restaurants in Edinburgh.   As usual the last time we visited our meal was excellent.  I would absolutely recommend Papilio, and think that it would be fine for a couple as well as a small group.  Typical meal for two with starter, main course and a couple of drinks is 50. Papilio has a lot of competition in Bruntsfield/Morningside but does offer a special and affordable dining experience that is difficult to match.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "WTBRGw61hMi0ot94AeQGcQ"
  },
  "iMhbtWNBYEw4GotAVn0cuQ": {
    "date": "11/29/2015",
    "text": "My dad was in town and we decided at 5 to go out for dinner. WE figures since it was so early it wouldn't be hard to find a place, boy were we wrong everything was booked. My husband got a hold o Papillo (called) and they were wonderful enough to squeeze us in!  We don't eat Italian a lot, as it doesn't always do some well with my stomach, but we really loved the food we got at this place! I had a delicious fresh pasta dish with seafood and marinara sauce. It said on the menu \" chill and marinara sauce\" and when I asked how spicy it was they said 'because its all freshly prepared' they can just make it without the chills for me!  Fresh and great service!  The waiters were very friendly.  Cute and homely atmosphere, felt like I was in an Italian Families home for dinner, and it tasted like it too. We had a bottle of the red house wine which was nice , mellow  and super fruity! ( I don't like strong tannin wines). Really great resultant! Will be back forsure!   Also I loved that it was a restaurant that we could have conversation in and laugh without feeling like everyone else was quite or listening!   They have a bunch special of 2 course for 9! will be back for that!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BpKuNkYgAuisCNZlSzfUAQ"
  },
  "F2eWsJJVH9herv-yrzVjjw": {
    "date": "8/19/2016",
    "text": "I appreciate these guys, they not only make great Italian food they are gracious to their guests.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PHbC-ngRn78spoSFl_v8kw"
  },
  "8sob3XJhnGnM1EffDvpqqg": {
    "date": "3/17/2013",
    "text": "I ate melanzane and pizza at Papilio, in Bruntsfield. Both were decent dishes, without setting the heather alight. Their lunchtime deal of three courses for 8.95 sounds like pretty good value, so perhaps it's better for a lunch visit.  Overall, we said: \"Papilio was decent, without being earth-shattering. Both courses were good, and hinted at promise, without excelling. If you happen to be passing, do pop in, but there are better opportunities to explore, if you're looking for Italian food in Edinburgh.\"",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LURC3E0DoXYgN9aYTF3XOg"
  },
  "h98DfsqvDX5S37FSx8RcEw": {
    "date": "7/19/2012",
    "text": "Papilio's is a really lovely italian restaurant, It is small but the moment you staep foot into the restaurant the atmosphere is great whether theres a full house or just one table occupied!The staff instantly make you feel welcome and the service is throughout is off high standard. I have been visiting Papilio's with my family since we moved to Edinburgh last December and each time the food has been amazing i highly recommend the lobster and prawn ravioli it is just first class and the profiterols are just to die for. I have recently come back from Sardinia and i would say that the food at Papilio's is as good as we had on holiday.  This restaurant is great for familes, couples and large groups, I would recommend you book a table at the weekend but the staff will try and accomodate you if they can if you haven't booked a table.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "KVzcPnrigbaQbfKhVBmp0w"
  },
  "JEqqtc3rN-bYFGdRV9_Zpg": {
    "date": "10/2/2012",
    "text": "Stopped here for early dinner with the kids, nice menu, well prepared food and very welcoming atmosphere. It was about 6pm on a Saturday night and they squeezed us in before they got busy.   It may be \"just another Italian\" but it is one that didn't dissapoint.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-4dmE_9lhLi7MOWGI72YhA"
  },
  "vogDswskbk9rS1kl5BVeYw": {
    "date": "5/6/2010",
    "text": "When my friend suggested we go and try this place, I decided to do a bit of stalking first and look at their website - partly because I didn't know anyone who'd ever been here before, and partly because it was a distraction from revising for my finals.  Their website looked really upmarket, with promises of amazing service and dedication to preparing the best and freshest food etc etc, so I was expecting it to be quite pricey.  I wouldn't have minded paying twice as much as we did for the food, if not more; our meal was that good. We went for their 3 Course Set Lunch offer which will set you back a grand total of 6.50 a head (?!) and this place is now my favourite Italian restaurant in Edinburgh.  It's nothing fancy, but then it doesn't try to be: from the second you walk in you immediately pick up on the family-run, authentic vibe and it makes you feel really relaxed. I love italian food and I've been searching all over Edinburgh for that perfect little local Italian place, the one you go to when you can't be bothered to cook but still want to go somewhere you know will be good yet cheap. I've lived here for 4 years now, and I think I can stop looking.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IDe-xmJk8E49u-AuQJaUpw",
        "caption": "Photo of Papilio - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IDe-xmJk8E49u-AuQJaUpw/o.jpg"
      }
    ],
    "user_id": "oEshN5oq98_g23MvEnRc5A"
  },
  "Nd3VrYVtdaTtKxYI6Uk-SQ": {
    "date": "7/8/2010",
    "text": "Papilio is one of the finest Italian restaurants which I have come across in Edinburgh. Located in the centre of the Bruntsfield area of Edinburgh, it is a great place for students to go to for their lunch or dinner.  The place is quite small inside the restaurant, but it gives it a cosy rather than a cramped feel, and the decor is very authentically Italian with a Italian music playing in the background. The atmosphere is really friendly and lively inside and the waiters were lovely and highly efficient in their service.   Papilio offer a wide range of authentic Italian cuisine on their menu including Pizzas, pastas and risotto, as well as steak and chicken dishes. I had the pizza pescatora with shellfish which was delicious, there didn't skimp on the topping which was good and there was lots of cheese too - yum!  My friend had the spaghetti carbonara which looked amazing and she said it was lovely.   The prices are also excelled in Papilio and I think you would be hard pushed to another Italian restaurant in Edinburgh with the same high quality of service and delicious tasting food. Papilio is now my first port of call when I fancy an Italian meal in Edinburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FNlSalsnLdxWZDDcY1Tr3g",
        "caption": "Photo of Papilio - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FNlSalsnLdxWZDDcY1Tr3g/o.jpg"
      }
    ],
    "user_id": "OdUSlS-S6qfZFnDUCKzwEg"
  },
  "l4wiSe5mUrSxbzZujgV66A": {
    "date": "4/22/2010",
    "text": "I've never understood why Papilio is never busy! They do great lunch and dinner offers, and is in one of the main student areas. Cheap food + students = perfect! But whenever I'm in here there's never an atmosphere. But that doesn't put me off!  This Italian restaurant is really traditional in style and taste. You can tell that everything they make is made on premises and tastes really fresh. As a consequence the service is a bit on the slow side, but the food is delicious. Hearty food. Ever since my first visit I've always gone for the Spaghetti Carbonara (I know, adventurous) and I always have it because it is so delicious! Their portion sizes are just right, and everything looks delicious. My mum highly recommends the Smoked Salmon pasta, and she has good taste!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "X0Okqfsdm71f8sNTyGhMMA",
        "caption": "Photo of Papilio - Edinburgh, United Kingdom. Papilio",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/X0Okqfsdm71f8sNTyGhMMA/o.jpg"
      }
    ],
    "user_id": "o0WGr8L3BWfH2Bslpnqw6g"
  },
  "k06fOnEZ5Zdzb3Wq7Dd9OA": {
    "date": "10/19/2013",
    "text": "Caught in the rain walking back to our hotel we stepped into Papilio. We were greeted warmly, given time to dry and then served great pasta. Who could ask for more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DP_LDz4rqDO_j6ZRahjqcQ"
  },
  "iPmnnOlQEvS7RuxLeUQ15g": {
    "date": "4/8/2011",
    "text": "Excellent food and friendly service in this unpretentious Italian restaurant.   I had a delicious melanzane al parmigiano to start followed by a pizza with asparagus and prawns; my companion had garlic mushrooms and chicken with a blue cheese sauce. Couldn't quite manage a dessert each after all that! Coffee was nothing special, but then, I don't go to restaurants for the coffee.   Their lunch menu is an especially good deal, and from the chatter I overheard between waiters and patrons they clearly have a lot of customers who keep coming back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EbR2otqoLrhDME91hX7VWg"
  },
  "ig2aslkFpA6QqxKiu0b2eA": {
    "date": "6/9/2010",
    "text": "Papilio is one of several Italian restaurants located on Bruntsfield Place and fairs well in comparison especially in terms of value for money.  The service is friendly and inviting from the moment you walk in the front door and cater for your every need with making you feel encroached.  The majority of the food is cooked to order and it takes a while to arrive as a result but is worth the wait without a doubt.  I have only tried their dinner menu but I noticed that they serve a three course lunch throughout the week for less than 7 which looks an excellent deal. Their menu has an unually wide selection of dishes.  There are different pizzas as well as pastas ranging from gnochi to ravioli, but they also serve veal, steak and fish cooked in a variety of sauces.  Further, they give an assurance of the freshness and quality of their ingredients which is backed up by the amazing flavour of the food. I chose and would definitely recommend the Penne Della Cassa which had spicy sausage in a creamy tomato sauce.   Papilio certainly deserves a look as it offers great food and service at surprisingly low prices.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "q03LXXxfpsenaz_ZLumwtA",
        "caption": "Photo of Papilio - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/q03LXXxfpsenaz_ZLumwtA/o.jpg"
      }
    ],
    "user_id": "yfXqZkU5iXE07GSHzdsQBA"
  },
  "AaP60gyvz2Y0KFakkghxUw": {
    "date": "7/25/2014",
    "text": "Didn't make a reservation, but they were able to slip us in. It was a busy Friday night!  Food and service was outstanding!!  I recommend you reserve a table for dinner just so you're not disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fSBNyMBcIWk2YBzDiLLbnw"
  },
  "MU7HQtrT3llhkso4NRe7ng": {
    "date": "4/23/2011",
    "text": "Papilio served great food, has a cosy atmosphere and friendly staff enthusiastic about their job and proud of their restaurant.    We ordered the marinated olives to enjoy with the house wine and beer - we had been given the head's up that the Calzone Ripieno would take 15-20 minutes as it is such a thick folded pizza.  It was well worth the wait.  Generously stuffed with mozarella, spicy sausage, ham, mushrooms and tomatoes, it was a perfect match to the Italian beer and red wine.    We also ordered the Gnocchi Al Gorgonzola e Spinaci which is as good as I have ever tasted.  I would go back to Papilio for the Gnocchi alone.    To finish we had a double expresso each and were given a small bowl of bite sized ameretto biscottis.  They were so good that we cheekily asked for a few more and the waiter generously filled another bowl for us.    When we arrived for lunch, there was a family group of 14 people that were comfortably accommodated so it seems to be a great place for couples, families and groups.    Our total was just under 40 for three drinks, starter, two mains and two coffees which was well worth it.  We will definitely be returning to Papilio.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uh-FpNh4a3gxZWS37rjMFw"
  },
  "4DynTmQvcXaulA3Ks4MJMw": {
    "date": "4/25/2008",
    "text": "A lovely little Italian place that has a very friendly team of waiters and other staff who provide an excellent service and serve very good food, the prices are very good also and you would be very hard pushed to find a place in Edinburgh with the same quality of service and food for the same price,   I've been twice now and probably will be back again sometime in future!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n0FSYxOyMgNZ8GFTP1pStw"
  }
}