{
  "ODv8ntexFegYD_bQthfA3Q": {
    "date": "1/21/2014",
    "text": "My lovely boyfriend to me to dinner here in December for my birthday and it was amazing!   For years I had been meaning to go to Port of Siam in Newhaven but just never got around to it. So now there is one on Broughton Road that is much more convenient.  The food is just divine. The portions are pretty big and worth every penny. It is all beautifully presented and full of flavour authentic Thai food. I tried their seafood dumpling green curry and it was huge but so tasty.  The attached Bangkok Bar is also lovely. They have a delicious cocktail menu and are always keen to make bespoke cocktails depending on what you like.  I can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "HV24bliLib6FuMW3bWBrpQ"
  },
  "6lpMekPl2q_iPwkjK52S3g": {
    "date": "8/12/2013",
    "text": "This place has newly opened on Broughton street and is the sister restaurant of The Port of Siam in Newhaven. For those familiar with original place, you'll know the food is top notch quality and yummy! They've also opened up an adjoining bar called The Bangkok bar which serves Thai street food. V handy if you're down that end of town for drinks and fancy a tasty small bite alternative. Sometimes Thai food just hits the boozing spot like nothing else!! I've not tried the cocktails but I'm assured by a friend they're worth a trip.   I tried the main restaurant on Saturday night as part of a big group celebrating a friends birthday. They were more than happy to accommodate large groups, balloons and birthday cake. Nothing was an issue at all. Wine wasn't overpriced.  Instead of my normal go-to Thai options I mixed it up a bit with a starter of Marinated quail and a main of Osso Bucco Massaman. The quail was delish! Crispy, salty, tasty. I would have sucked the bones dry if I wasn't trying to be a lady in front of the group! Ha ha. A really nice alternative to chicken. I'm not sure i was entirely sold on the main though which is probably my aversion to hunks of meat and bone, not a reflection of the quality of the dish. The meat was slow cooked and tender, but I was put off a bit with the sliced bit of bone marrow in the centre. I guess I'm not an Osso Bucco kinda gal really. Its definitely in a \"man food\" category. The sauce was amaaaaazing though! I had a few spoons waved my way for a taste.  This place is well worth a visit!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "UXm4gt7ERqbnuSclRFM7rQ",
        "caption": "Photo of Port of Siam - Edinburgh, United Kingdom. Work of art!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UXm4gt7ERqbnuSclRFM7rQ/o.jpg"
      },
      {
        "img_id": "yCVrVNy1zU7trVl6J8YUfQ",
        "caption": "Photo of Port of Siam - Edinburgh, United Kingdom. Seafood laksa",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yCVrVNy1zU7trVl6J8YUfQ/o.jpg"
      }
    ],
    "user_id": "S2islVfwCgNg3zfzxqty5g"
  },
  "SPqwOtHOxX7JAPUobjzK7w": {
    "date": "5/20/2015",
    "text": "The food here was great. The highlight was the Laksa. I wouldn't recommend the black rice pudding. I'm an adventurous eater, so I'll always go for something I've never tried before. There are very few things I don't like, but that was one of them! Ick.   The decor and ambience felt odd to me. It felt like walking into an office. We also sat near to a table they'd set up to hold cutlery, which would have been more than fine in a cheap restaurant in Bangkok, but not so much here given the prices.   One of the waitresses was very friendly and smiley. The other was very surly. A table opposite us was playing loud music on their phone throughout dinner, which was clashing with the music in the restaurant. None of the staff asked them to stop despite most diners looking irritated. I think they may have even been employees of the bar downstairs.   Additionally, my friend and I had ordered three courses each, so we were at the table for just over two hours. We paid our bill and stayed for around ten minutes to finish our drinks. One of the waitresses then told us to leave as they had someone else waiting.  I completely understand that restaurants don't want people to hog tables if they are busy, but it would have been much better if we'd been given a time limit when booking/being seated, or if the waitress had delivered this request with warmth and discretion. Instead, the manager hovered and cleaned the table next to us, then the waitress ordered us out quite rudely from across the table.   Overall, if there is a great modern Thai restaurant in Edinburgh with warmer service and a more intimate ambience, I'd go there. Otherwise, the food was great but I'd love to see them improve their service and atmosphere.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pdk94rKm9e-4737emT11vA"
  },
  "3V2IPgGHsDY4_RIzgVKZGg": {
    "date": "1/19/2014",
    "text": "We came in for lunch today and was pleasantly surprised by the flavourful dishes that we had. My husband and I both ordered from their winter lunch specials menu, 9.95 for a starter and a main. I had the chicken satay and a red prawn curry. Both dishes were cooked beautifully with both the chicken and prawn cooked just right, not overdone as sometimes it can be. The red curry was especially tasty. My husband had the Thai mussels starter and chicken pad thai. The mussels were delicious, a bit on the spicy side but we liked it. I'd recommend this place and I hope it thrives because it sure was empty today when we were there!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "o1eXNUKkdLRuWmIKbG8YJQ"
  }
}