{
  "oOvgnTgLVKB-eYWhCExTKg": {
    "date": "8/14/2010",
    "text": "This review is purely from a delivery stand-point, because unlike the branch in Newington, I haven't actually been or seen it. It's the store for my post code, and could just be up the street, but the word \"Leith\" makes me think it's a little too far to bother.  Their usually quite prompt, and the last time I tried to be cheeky and get a free pizza (my pizza was at least two minutes later than delivery time!) my door bell rang and foiled my clever plan. Domino's is a nationwide chain, so the pizza's are pretty much uniform from one branch to another. My favourite things about Domino's is being make my own pizza when I'm in the mood, and the great of any pizza any size for 8.99 with my Pizza Heroes card. The fact that I had Dominoes for dinner last night and the remnants for breakfast proves my dedication!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IY8cvV2SQuhJjKhRW68tFw"
  },
  "mcutGdOiV9Z-GVgxEJF9yw": {
    "date": "4/12/2018",
    "text": "Ordered pizza at 11:45pm. Told 30 minutes for delivery. Called to check order at 12:15, assured it's on its way for delivery. Called again at 12:53 \"in the car for delivery\". Never showed up and now they won't answer their phone. AWESOME service. Don't waste your time.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oXzTzHVv8f3Y8Y_bAvY1_w"
  },
  "_-sxIQZ_D2aJGKeNwp8lVg": {
    "date": "6/18/2015",
    "text": "Great pizza, i ordered the other day. It arrived on time, it was peeping hot. Loved it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zCAtVD9PCNkud9nW-V1Buw"
  },
  "DUmVbB5iIWcXSHqYUVBfiw": {
    "date": "8/19/2012",
    "text": "We ordered pizza from here this weekend during a stay in Edinburgh. The pizza arrived quickly and was yummy although it was of course greasy and also quite expensive (like 15 a pizza) but I guess that's because of the Dominos brand. Friendly staff on the phone and delivering.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JIaRKMllnRX22LE_kS9g4g"
  }
}