{
  "FPrFFRUnVo1mqVyfOatM-A": {
    "date": "6/17/2018",
    "text": "Fish was fresh and chef was very accomodating. Don't be afraid to ask questions. A bit \"extra cozy\" depending on your personality.   Don't forget to get Mochi ice cream for dessert!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SJJIoWrrXbl8e5OU-UTUGA"
  },
  "o7b1nhAQCLtfxAT21bI9wg": {
    "date": "1/16/2019",
    "text": "This is a mixed review as 1 on the items eaten was decent-good but the other was really bad.  - I ordered a tonkotsu ramen and I have to say it was really bad. The broth had a bit of pork taste but was mainly water taste. It was as if I was eaten my noodles in tap water. Probably one of the worst ramen I've had SCORE OF 0/5. I love them (in Xmas back home I visited 3 times in 1 week one of my favourite ramen)  - dragon roll. This was nice and fresh. There are probably better rolls but good enough to repeat without a doubt. SCORE 3.5-4/5",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y8UeaAEH4d7m78NE5xNE9A"
  },
  "Ri4fO3-T1esYizk28PxznA": {
    "date": "7/17/2018",
    "text": "Great sushi at this place, fast service. Also has an interesting soft drink I hadn't tried before, Ramune, it's quite refreshing. I like that the sushi is made right in front of you too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dI4C_CPQPR4eLTZsANKBXQ"
  },
  "pe3CgIuAh8WMKKbjZmSQ7w": {
    "date": "6/17/2018",
    "text": "The restaurant itself is small and doesn't seat very many people, but the atmosphere is very welcoming and the staff was great. The chef even made me a hand roll, which wasn't on the menu--and it was so good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CNujx4iB1u6L4wWIMUN7hg"
  },
  "Rq_91SixlTNQoIoDqymNtg": {
    "date": "3/5/2017",
    "text": "Friendly owner. Had the lunch omakase. Nice splurge. Not life-changing, but good value for omakase. The omakase is cheaper because they don't have anything super unique or special.  We also ordered a chirashi from here before, and it was incredibly small. I would highly recommend that they at least increase the amount of rice they give. The way it is now, a chirashi is definitely not enough food for one meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B7VzLfDEhEzIdjw7dsqOyA"
  },
  "Whwoa2XlDiWdaLB1ByV5hw": {
    "date": "8/25/2017",
    "text": "Maki Maki has become our go-to sushi restaurant and we have never been let down. The rolls are always fresh, the service friendly, and the atmosphere cosy. We like having a more limited sushi menu, because it means every option on the list has been chosen with care. My favorite has become the salmon teriyaki, but always ask what the special is. If you're not into sushi they also serve a variety of appetizers and ramen. It is a small place (seats only 10), but if they're full you can venture down the way to their sister restaurant Maki & Ramen (or just book ahead by phone or online).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V71CNhx2lAIEop3lboSBHA"
  },
  "DVTvzH1xgbyfQs_0DFAewA": {
    "date": "1/14/2017",
    "text": "Stopped by and tried their Hell's Ramen! This was quite spicy, yet delicious. I would say maybe a 7/8 on a scale of 1-10 (10 being the spiciest). Super cold day so this ramen warmed me right up! My friends got soyu and tonkatsu, but my tongue was already on fire to taste their soups, but this ramen is decent!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mHQZx2t_YqslA-p0MuOLHg"
  },
  "71za0e77pUGeIb9xRkSSiw": {
    "date": "6/23/2017",
    "text": "Very small sushi and ramen bar. The food is literally made in front of you. Definitely recomended if you like the fresh stuff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "19vLsxRHjcDLKCt84K3GTQ"
  }
}