{
  "X9TFuEFESBn-PsU0tx1Vyg": {
    "date": "11/3/2007",
    "text": "Four words: best steak in Scotland. Seriouslythey have framed reviews hung all over the walls to prove it (a bit tacky? C'est possible)   Service is formal and efficient, but not too snobbish. We got the giggles, as the maitre d' swished around so quickly that his breeze kept blowing out the candle on our table.   Normally I prefer to purchase of bottle of wine for a nice dinner; however, I'd read that No. 3 carries lovely house wine, and the cabernet by the glass was indeed smooth and lovely.   We ordered the mussels and smoked fish trio to start, the latter of which was tasty, though a bit uninspired. The mussels were large and fresh, though the broth was a bit watery. For a main, the 8 oz. Scottish beef fillet was grilled to absolute perfection, and came with a delicious green peppercorn and brandy sauce. Accompanied by caramelized mixed vegetables and sweet potato mash (which we requested in place of the hand-cut chips) was a combination that left us full to the brink of discomfort.   Our bill for two, including 4 glasses of wine, two starters, two fillet steaks with sides, and a coffee came to 70 pounds. Not bad, for a lovely, satisfying meal in a romantic setting, just minutes walk from the city center. Well worth a visit!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SrUdc2DcFphyqk4X5CKbLA"
  },
  "QN0G0MnDSeLv6HZvf9Cqaw": {
    "date": "1/3/2009",
    "text": "Had dinner here last night with 2 friends and was very impressed. How they manage to produce 3 courses of such quality for 14.95 is a wonder. Service was always efficient and polite and mostly timely. The occasional cobweb in view and the misspelling of California on the wine list were minor quibbles. All 3 of us began with the Goats Cheese Crumble w/ Beetroot. For main I had the Turkey Fillet (ordering a side-dish of veg with this might be a good idea for some), whilst the girls enjoyed the sirloin on one hand and the Pea Risotto on the other. To finish I plumped for the Banana & Peanut Cheesecake which was an acquired taste but I certainly got what I asked for and the portion size rivals Howie's famous Banoffe Pie. The Chilean Cab. Sauv. I washed my food down with was a decent little number too (half bottle 12). Definitely one to go back to. Stopped back in here for Afternoon Tea at the end of last week. Good vfm at 14.95 (like most hotels the bar prices are steeper than average though) but could have done with jam to go with the scones & cream and I imagine there are probably other places in town that have an edge over it for this sort of thing. If you go though take the option of having it in the garden at the rear as it's much more chilled than the bar or lobby.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "txzOZrHK9EVY0kYjSuXkKg"
  },
  "k8iNA3apJossYWn4aewEVQ": {
    "date": "4/25/2008",
    "text": "I hadn't even heard of this place before i went on valentines day, the wine was nice and for valentines day they had a special set menu, priced at 35 pounds for 3 courses, which was a very good deal for good quality food. The service was good, helpful vut not to intrusive, although at some point I thought our wine glasses must've got topped up about once a minute. To start I had the homemade soup then the steak for my main course, both were lovely and i would definately recommend this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n0FSYxOyMgNZ8GFTP1pStw"
  },
  "U03QwlWIriFOQHNNAyTgcg": {
    "date": "6/6/2008",
    "text": "For a four star hotel this was really disappointing. Some of the staff were friendly and helpful, some not so much. The shower pressure died every morning during the morning rush and at times I was stood there without any water coming out of it at all. It was noisy and the room was tiny. There are far superior hotels for a similar price. However, the location is good, central while quiet, close to Princes St, Calton Hill, Omni Centre and Broughton St.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lO5LwtjeGx6IdKxXKvzTiA"
  },
  "zMBJ0_cCEa8VuE-UmTGTuA": {
    "date": "5/12/2008",
    "text": "We booked a table to celebrate our 20th wedding anniversary while visiting Edingburgh. We had read other reviews regarding this venue, so decided to give it a try as it was close to our hotel. We were shown to our table by the head waiter who was polite, if a little lacking in the charm department, but that aside did an ok job. My wife orderd a Salmon starter and i had the filo pastry haggis parcels, both were fine. We both orderd fillet steak for our main meal with pepper sauce, which was a good choice but i have to admit that part of my steak was a little stringy to cut. For our puddings we both had the toffee creme which was again fine. We enjoyed our meal and visit to No.3 but must admit that i expected a little more considering the prices and after reading other reviews, but we enjoyed the evening and would give No.3 a polite 3 out of 5, pity really becaues the score should had been a more charming 4.. !!   Mr & Mrs G [Bristol u.k.]",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o1uh0_h6PD2DT3Z1W8Rvgg"
  }
}