{
  "RQqnqUX5fG53J_2BUY2iQA": {
    "date": "1/28/2013",
    "text": "I have been a customer of Cafe Truva on the Shore for a few years now. It is a firm weekend breakfast favourite, especially on those weary mornings following a late night...   Cafe Truva has a menu of various breakfast choices, salads, paninis, sandwiches, kebabs, falafel etc. There is something for everyone, I think.  I am most familiar with the ham & cheese croissant which comes with a side salad, little bit of cous cous and hot peppers. I have also tried the delicious turkish breakfast: cheeses, meats, cucumber, tomato, egg and toast. After you have had this and a cup of coffee, you feel you can conquer almost anything :)  Last week I sampled the lentil soup and it came with a toasted large roll. Takeaway price for this lunchtime favourite was only  1.60 which is very reasonable.   The cafe is fairly small but cosy. There are a few outside spaces as well and on sunny days they get quickly snapped up by locals.  I recommend this place - a little bit of Turkey on the Shore :)",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "yuFHrb8YQtVuzu0eEXvJtA"
  },
  "Jwbb6Z6rpKUQfZ9Z-IzhNQ": {
    "date": "5/27/2018",
    "text": "Popped in here to grab a quick cuppa, the location is great and the food and cakes looked lovely and the tea hit the spot but the staff, especially the lady in charge was a bit intimidating, no service with a smile from her, I kind of felt like I was an inconvenience, why I stayed I do not know, the young lads seemed hardworking and pleasant though so good job lads, shame about the big bad boss lady.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GEgifgwsWxtihJ6u5OYfAw"
  },
  "RxhwF9c15qAO6exR3it1pQ": {
    "date": "11/8/2012",
    "text": "Cafe Truva on the Shore. This is one of the places that only get better and better! It has been there for years (in effect since 1998!) It went from small Turkish offerings to the full well placed Eastern Med  restaurant chain (3 restaurant and counting)   I like this original shop. Cosy, clean and very friendly. They are frequented by locals as well as day trippers to the shore. It is well placed on the edge of the Shore over looking the water and it is a sun trap! Winter or Summer - if the sun is out - Truva will be in it. - The food is definatly Turkish with added burgers and panini's - the whole day breakfast (Turkish or Scottish) is a treat and a feast. Not too expensive.   They offer free WiFi, take-away and also do outside Catering",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8bRRv33vG9gWjUot19iOtQ",
        "caption": "Photo of Café Truva - Edinburgh, United Kingdom. side",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8bRRv33vG9gWjUot19iOtQ/o.jpg"
      },
      {
        "img_id": "oGfxjRAVwWTheLWdlne3DA",
        "caption": "Photo of Café Truva - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oGfxjRAVwWTheLWdlne3DA/o.jpg"
      },
      {
        "img_id": "kY7CSGg5w6ufb7fWFMIIXA",
        "caption": "Photo of Café Truva - Edinburgh, United Kingdom. Ali",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kY7CSGg5w6ufb7fWFMIIXA/o.jpg"
      }
    ],
    "user_id": "fKi8ZF3xpJJkgSusRubeMA"
  },
  "sWHcRgK1KiK4mOP6Bznoow": {
    "date": "9/21/2011",
    "text": "This is a brilliant place to come for visit wether you are a local or a visitor- very friendly and helpful people and fantastic food on offer. I am a big fan of the Truva on the Shore. Tiny  cosy and I just love the people who work there.  Breakfast  Lunch and takeaway foods from the baltic and mediterranean.  And now WiFi!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "co7eoVr7I50u3ZW4Pd9Tcw",
        "caption": "Photo of Café Truva - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/co7eoVr7I50u3ZW4Pd9Tcw/o.jpg"
      },
      {
        "img_id": "O0__8iG0CmYhvBcbhSWYDg",
        "caption": "Photo of Café Truva - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/O0__8iG0CmYhvBcbhSWYDg/o.jpg"
      },
      {
        "img_id": "vSJn4z_qY4FHyukHuaZ4Bg",
        "caption": "Photo of Café Truva - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vSJn4z_qY4FHyukHuaZ4Bg/o.jpg"
      }
    ],
    "user_id": "jhPrEZShHtyGjSGMNObVmw"
  },
  "2jqTIXhoYpebIYpjwhPJEQ": {
    "date": "7/31/2010",
    "text": "I'd walked past the other branch of this turkish cafe, which is at the Royal Mile, and was surprised to see it again on a day trip to Leith!  In Edinburgh, one's got the option to eat foods from so many different cuisines of the world, but I was still very excited to try the food here, as it's the only turkish restaurant I've come across so far. If you're not that much of an adventurous eater, there's the traditional fry-up breakfast as well as sandwiches, but the really exciting stuff is the array of mediterranean food they serve!  It's possible to have stuffed vine leaves, moussaka, and mezze platters, and there're some delicious desserts such as baklava available.   The cafe's location at the shore means that you'll get some nice sea breeze and a great view to go with your food. It's good to keep in mind that they are a little bit pricier than a couple of other cafe's though!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DvxE01xoBwUHSHSy52k1xA",
        "caption": "Photo of Café Truva - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DvxE01xoBwUHSHSy52k1xA/o.jpg"
      }
    ],
    "user_id": "IY8cvV2SQuhJjKhRW68tFw"
  },
  "6_w9qE9_AbErc1xcyl7q9A": {
    "date": "8/4/2010",
    "text": "If someone pushed me to choose my favourite cuisine, I might well pick Mediterranean, or, more specifically, Turkish food.  When I visited Istanbul as a child, I fell in love with the subtle flavourings, the hot and cold salads, the meltingly stewed vegetables and the honey-drenched sweets.  So, discovering Cafe Truva on the Shore was a real treat for me.  It's a fairly casual little establishment, where you can drop in for lunch or coffee, or else pick out some items to take away.  They offer competent versions of favourite dishes, such as stuffed vine leaves, green bean salad, and, of course, gloriously sticky baklava, which are all tasty, if not as absolutely stunning as this kind of food has the potential to be.    I haven't had a chance to try any of their sandwiches, but I was pleased to see that they have a good selection of vegetarian options - too many Turkish places offer kebab, kebab, or kebab.  Overall, this brightly-painted cafe is an inviting place to stop by for a light meal, and, while the Waters of Leith don't quite measure up to the Bosphorus, with a little imagination you might be able to conjure up an image of Turkey here.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "N3J-41OHb87d-d395bMDmQ"
  },
  "nweD5hvsrU7JG_oyrVeLAw": {
    "date": "7/18/2011",
    "text": "Cafe truva is a fit and healthy 3 if ever i saw one. Big portions, delicious pita (OK so not really supposed to eat pita bread at the moment but the temptation was too much) and generous nice salads. The chicken panini was bit tough for the boy's liking. Stuffed vine leaves were nice, the green olives that came with the salad were drop dead delicious with this buttery overtone that I didn't expect. Artichoke salad wasn't drained properly (artichokes from a can) so there was a lot of water combined with dressing that sadly soggi-fied my pita. Definitely nice, and a generous menu fit for most dietary needs. Baklava and assorted sweets looked appetizing. It's not a must visit, but it's definitely a good place to go if you need a lunch spot in Leith.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X2uF3C3YBD24xcgKA104Sw"
  },
  "DHek0XcZzHOCExObf_M_IQ": {
    "date": "1/28/2010",
    "text": "Cafe truva is a favoured lunch spot for mother and I (she bloody loves the place.) Serving all kinds of turkish delights (see what i did there?) throughout the day (but not late evening) Cafe truva is well worth a visit in my book.   The portions are pretty good for the money you spend, which isn't outrageous, and its damned tasty! The service is just how i like it (always within eyeshot but not instrusive) and the food arrives prety quickly (very hand for lunch!)   If you're in leith around lunch time, check it out",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "17FrHEd0jNJn7-FhjKs-kQ"
  },
  "navRuyWXPw7J45E3jaAu6w": {
    "date": "7/23/2008",
    "text": "A wonderful little cafe. Either for sitting in or taking away. I'd frequently pop in here for my lunch to take back to the office and leave with a big cup of hearty delicious soup, and the most gigantic baked potato imaginable.   And the fillings for the baked potato were deliciousheaps upon heaps of roasted vegetables, spoonfuls of sloppy hummus, aubergines, and plenty of choice for the meat eaters too. Every time I walked back into the office I'd have people salivating at what I was eating (although thankfully not all over me!).   For the amount that I'd end up with (and believe me, I was stuffed every time I finished eating), the prices were incredibly reasonable. I'd have paid that much for a small sandwich and a small soup elsewhere, and have nothing anywhere near as tasty.   The staff are friendly warm and accommodating. A lovely cafe in an ideal location on The Shore.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UzinZcZEaJKc07hBuHTcQw"
  },
  "0vO0p7wFu57fLdVM-WQ4OQ": {
    "date": "7/4/2011",
    "text": "Although it has a sister coffee shop on the Royal Mile, I didnt get the same experience in this one.  The staff were a little rude, although it did supply some lovely goodies.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PjHsq6UY2NMxUOem-oy3tg"
  },
  "KGDFILk_EnN3qXy10D6tlA": {
    "date": "11/24/2008",
    "text": "A huge range of sandwich shops have sprung up around The Shore in recent years so it is becoming harder and harder to find something unique but Cafe Truva has achieved this spectacularly. The range of choice, whether sitting in or taking out, is absolutely staggering and it's a lot more than just soup and sandwiches. I've mainly been in here for lunch but the breakfast menu looks very attractive too. I recommend taking some time to sit down and sample the delicious mezze plates. Or on a cold day, the moussaka will really warm you up. For vegetarians this might just be the best place on The Shore; with all the roasted vegetables and couscous on offer, even the carnivores like me are likely to go for veggie options.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p8UfcEN8S0gDsf4JJMag2w"
  },
  "doRYi1-6-h_3SbUeqVflLg": {
    "date": "11/9/2011",
    "text": "Have eaten at Cafe Truva for past 15 years. It never changes. The food is good and plentiful and reasonably priced. Always newspapers around to have a browse if you are on your own. Staff remain unchanged and are always helpful. You can sit outside in the summer and now they are making Shore car free, it will be more peaceful. Good ambience. Turkish coffee is very strong. Beers are good. Deserts to die for.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Mq2l6Kd8Eu3-HOEUCC54Q"
  },
  "Zhf2WLSQgxHRVajUGxEYWg": {
    "date": "2/6/2009",
    "text": "Lovely little cafe atmosphere-wise but problems with service and price. Staff alright but they tended to concentrate on serving their friends ahead of anyone else.   Small portions, and high prices made for poor value for money.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fwv_g4WY0mli0ajvRYzx5g"
  },
  "hFLMuNREf5OK8BfV-bvz5g": {
    "date": "11/7/2007",
    "text": "Cafe Truva is wonderful. The Turkish wall hangings, ornaments, lamps and warm colours give a really cosy feel and staff are always really friendly and welcoming. The menu is just wonderful with my particular favourite being the mixed mezze which allows you to sample lots of different dishes. I find it hard to tear myself away from this dish but am never disappointed when I try something new. The hummus and aubergines are particularly good and the sticky, sweet baklava is absolutely delicious! Everyone should give this place a visit!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bk0g8mHZh45Tbrmd25bK0w"
  },
  "wrTRY3K6f5FpLd5rnhaFww": {
    "date": "11/24/2008",
    "text": "When I'm in the capital this is where I'll be hanging out on a Sunday, reading a paper drinking strong Turkish coffee and sampling the delights of the mezze to share with my better half. The food here is very good, the coffee is STRONG and the staff are super friendly. This is a small cafe, with great views, out-door tables and chairs and a very laid-back friendly atmosphere. It's reasonably priced too",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W-lYhvYHboN3qAU-MyaOWg"
  }
}