{
  "okDQpjPu16gFBog1A4StsA": {
    "date": "5/14/2019",
    "text": "Outstanding! We are here visiting from the states. The five of us all had 3 or 4 course meals. We all got different things and shared a few bites. We wiped our plates clean. We spent a few hours chatting, laughing, telling stories and raving about the meal. This one is for the books. Great service and the food was phenomenal!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JiUuQDz33dkbPGX523iVRg",
        "caption": "Photo of Restaurant At The Bonham - Edinburgh, United Kingdom. Chocolate cylinder! Wow",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JiUuQDz33dkbPGX523iVRg/o.jpg"
      }
    ],
    "user_id": "8DzSrlrilVNPkvER5pDgTA"
  },
  "HBPNEEoOXZBX6YmCdUigUQ": {
    "date": "1/9/2017",
    "text": "Very average steak.  Salmon was well cooked but lacked flavour.  The terrine tasted like I would imagine cat food to taste.   Smoked cod scotch egg was really nice.  A very pretentious feel to the place considering the food was positively average.   Poor value for money.  Would not recommend. Although the breakfast we had the next morning was lovely. I would say come for breakfast, not for dinner.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vpracVfD128LqvjjBRYdSg",
        "caption": "Photo of Restaurant At The Bonham - Edinburgh, United Kingdom. Cat food terrine",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vpracVfD128LqvjjBRYdSg/o.jpg"
      },
      {
        "img_id": "AYDLvK7oHko9JQylqe6ZjQ",
        "caption": "Photo of Restaurant At The Bonham - Edinburgh, United Kingdom. Boring salmon",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AYDLvK7oHko9JQylqe6ZjQ/o.jpg"
      },
      {
        "img_id": "i8-xwRNzAINTKiLNExZ8wQ",
        "caption": "Photo of Restaurant At The Bonham - Edinburgh, United Kingdom. Sirloin steak",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/i8-xwRNzAINTKiLNExZ8wQ/o.jpg"
      }
    ],
    "user_id": "3dfPVi5oJRBvH92O39WlbA"
  },
  "fQfHXpv0WShhPvpRBRaZEg": {
    "date": "9/22/2015",
    "text": "I came last Saturday with my partner for lunch with a voucher. I hadn't been recently to a \"heavy-style\" decorated restaurant, tall ceiling, old style, wood everywhere and it was a welcomed change. The photographs on the wall of this building from a professional photographer were giving me tips for my future style :-)   Now, to the important bits: food! The service was very friendly and quick, attentive.   We started with smoked salmon, and pumkin ravioli, so pleasant and rich to the palette. Proper bread was served earlier on with the butter in the right room temperature.   Our mains followed not long after: the glazed pork belly was divine! It melted in your mouth! It was combined great with coconut and chilli rice.   My partner opted in for the sea bass: they had added some mild spicy seasoning which tasted really great.   I did like the house wine.   I am not that experienced with this style of restaurants in Edinburgh, this is definitely though one I would recommend!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "lLsV3Fpqfc4yn5wHqFdOHQ",
        "caption": "Photo of Restaurant At The Bonham - Edinburgh, United Kingdom. Tasty sea bass!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lLsV3Fpqfc4yn5wHqFdOHQ/o.jpg"
      },
      {
        "img_id": "AhdjAEs4WfjYBoWvKc8TXg",
        "caption": "Photo of Restaurant At The Bonham - Edinburgh, United Kingdom. Glazed pork, chilli and coconut rice",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AhdjAEs4WfjYBoWvKc8TXg/o.jpg"
      },
      {
        "img_id": "XIBDt6ehbyULnx1KWCgDoQ",
        "caption": "Photo of Restaurant At The Bonham - Edinburgh, United Kingdom. Smoked salmon",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XIBDt6ehbyULnx1KWCgDoQ/o.jpg"
      }
    ],
    "user_id": "VPZ0UYhVW2ZkdT-mMQ4KLQ"
  },
  "2xw9-rdTzmfKYhPyLJvciQ": {
    "date": "1/18/2014",
    "text": "I had heard good things, so when I saw they were running a deal on toptable, I was excited to finally check this place out...  Sadly I was nothing but underwhelmed.. The food was nothing spectacular.. the service was about the same.. they completely forgot about our side of vegetables and when we asked they came up with some poor excuse before producing a plate of pretty sad looking veg..   The entire experience was just lacklustre..  With so many other options around town.. I won't be hurrying back..",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "J6E6NSpJqMBib9ydbchicg"
  },
  "xaYsf5ksVbHoS5rd9vr5qA": {
    "date": "8/14/2014",
    "text": "We visited during the week, on a Wednesday. The Hotel and Restaurant are easy to find. The restaurant is a large spacious area. It could easily double up as a decent ballroom.  On arrival we guided to our table and our coats were taken. As we were on a voucher the particulars were explained to us and they supplied a menu for us to look over if we wanted some starters. We took on the offer and ordered Roe Deer Carpaccio and a couple of champagne kir aperitifs. The kirs were decent, not outstandingly nice, but having some interesting taste. The Roe Deer was served with what can only describe as \"breaded haggis balls\" - quite tasty.   The main was a steak chateaubriand, cooked medium rare and served with a very nice jus. We had some chunky chips and peppery rocket salad leafs.  Very well executed and great flavour.   The 2008 Rioja was a welcome wine accompaniment.   The service was efficient, friendly, non intrusive and discreet.   We shall certainly return at some point",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fKi8ZF3xpJJkgSusRubeMA"
  },
  "MDNun9tLlvNDP8t7tq4nIw": {
    "date": "7/17/2010",
    "text": "The restaurant at The Bonham inhabits some really classic and traditional West End space at Drumsheugh Gardens. Most of the properties here form part of big, imposing buildings, with dramatic front doors and windows. The restaurant at The Bonham is part of the four star Bonham hotel, which is really beautiful inside.  I came here for lunch with the family, and although it wasn't super busy, with only what looked like a few business lunches on the go, the atmosphere was still great, and felt very elegant, spacious and refined. Despite the menu and some of the decor having a modern edge to it, the actual dining space still feels quite formal and traditional, but I like a bit of a tradition, so that suits me. You can get some pretty good set menu lunch deals here, and it's a nice change to come to this part of the west end, rather than just opting for right in the centre of town all the time. Maybe not the place for a big, raucous party dinner, but great for more of a classy, you can safely take the parents here, event.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1XJcpvWF8h7mg51y0JmbPg",
        "caption": "Photo of Restaurant At The Bonham - Edinburgh, United Kingdom. Photo from townhousecompany.com/thebonham",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1XJcpvWF8h7mg51y0JmbPg/o.jpg"
      },
      {
        "img_id": "yQJuSaotyxTtrAZgkmo4dQ",
        "caption": "Photo of Restaurant At The Bonham - Edinburgh, United Kingdom. Photo from townhousecompany.com/thebonham",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yQJuSaotyxTtrAZgkmo4dQ/o.jpg"
      },
      {
        "img_id": "oUROfOrSlNPyn7z5YsPEPQ",
        "caption": "Photo of Restaurant At The Bonham - Edinburgh, United Kingdom. Photo from townhousecompany.com/thebonham",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oUROfOrSlNPyn7z5YsPEPQ/o.jpg"
      }
    ],
    "user_id": "5Mujjzv-ZH6HhxT-hWCpVg"
  },
  "pMvC6UM7ITWBB214rI1RNg": {
    "date": "9/27/2014",
    "text": "Classic hotel restaurant decor; walking in you expect this to be a great experience. But  reality proved different. Unattentive service; chaotic staff. Ordered a glass of wine; it did not show up until I asked when it would be served then it came five seconds before the food arrived. The food was good, at least mine but my companion said her's was tepid. Atmosphere was 8; food 7; service 2.  Ask for check and they had to re do it as the left off some items. Then we had to hunt for my wife's coat.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DSPRVUEo0fAWpgO6LyKJsg"
  },
  "To62epKWA7394XzO224d2g": {
    "date": "9/8/2012",
    "text": "We went there based on Yelp's reviews because we were staying across the road at a beautiful luxury holiday apartment.   The food was good, not cheap but ridiculously small portions. Like they served at the height of the silly nouvelle cuisine movement in the early 90's.  I had a good hamburger down the road at Wannaburgers afterwards and I am not a big eater.   We were served good sized portions at all the other Edinburgh restaurants we went to, while staying there.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0YLiJdFIvRFaSLpIHC3p9A"
  },
  "vlQgPXgPFpGtulBmzEmJBw": {
    "date": "6/6/2012",
    "text": "I went to the Bonham for the first time recently to partake in their Afternoon Tea - what can I say?! Truly scrumptious!! Everything was 'mini', fresh and homemade - well worth a visit. This, along with The Prestonfield hotel, was the best Afternoon Tea I've ever had. Yummy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "S2islVfwCgNg3zfzxqty5g"
  },
  "IBIsphJpXXIJC-_gIBFK9w": {
    "date": "10/21/2011",
    "text": "Top quality, locally sourced produce, turned into beautifully executed dishes. The Boozy Snoozy is a fabulous deal on Thursday evenings and Saturday/Sunday lunchtime. We summed it up: \"The Bonham has shown itself to be an excellent venue, consistently producing dishes of True imagination, boldness, and balance. It's another gem of the West End, and one you should consider visiting, at your earliest convenience.\"",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LURC3E0DoXYgN9aYTF3XOg"
  }
}