{
  "VEGWKIrQBKgA3ALsZE1WNw": {
    "date": "4/4/2011",
    "text": "I love this place! Live music every weekend and it's always different bands. Main bar is on the ground floor and they have a DJ as well up the stairs so it's like a club up there if you feel like a dance. All different age ranges in here and the staff are friendly. I've not eaten here yet but I will after seeing some of the food - it looks fab! Easily my new favorite place!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q3jcf7RDW9V_Kt5L33mJAg"
  },
  "P_2fbuw7wi1Oj0NujNVTBA": {
    "date": "7/21/2010",
    "text": "Gorgeous bar. Very tastefully decorater, clean and ample toilets. Bar staff are efficient and knowledgable and drinks a decent price for the west end. Their own malt and ale is a must!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hPZxFcidKszuI1ZzOxMOMw"
  },
  "V1pcJwqbnCZZeDmQvnykjA": {
    "date": "3/27/2010",
    "text": "Very basic bar downstairs with pub grub to match - nothing to write home about and the sponge pudding for dessert was overly microwaved and horrible. No views outside so for me, The Rutland next door is better by far however the upstairs is impressive. Seems to be aimed at large groups and ceildhs at the weekend - there were certainly no tables for 2 or even 4 for that matter.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M6EkAFfIpIgonH3pbJ6KDQ"
  },
  "plxUl9UCa_dTpY0QiDF8vQ": {
    "date": "3/24/2013",
    "text": "Neither myself or my 2 Irish flatmates had any plans for St Patrick's Day, so the day before, we decided it would be nice to do something.  The Ghillie Dhu was advertising Irish stew, Guinness, Irish dancing and music - all for 15, so I rang up and booked in for it. However, we got none of what was advertised!  When we got there, they sat us in a nice cosy booth, but that seemed odd since we were expecting to be able to see some entertainment.  When they brought us a 3 course menu, we said that we were there for the St Patrick's Day Irish Stew, Guinness etc.  We were told there was a muck up with the marketing.  Apparently they were going to have it in the upstairs function room, but it got canned as not enough people booked.  Would have been nice of them to update their website, especially when I only phoned to book in the night before!  However we instead ordered 2 courses for 8.95.  We all ordered the Salmon.  I enjoyed the veges and the sauce, and the salmon itself was just OK; could have done with a splash of lemon juice or something.  For dessert, my flatmates just ordered ice-cream, but I ordered the vanilla and chocolate cheesecake with berry compote.  When it arrived, it was 2 big triangles, so a substantial helping.  However the chocolate part of the cheesecake was obviously white chocolate, which I would not have ordered if it had said that on the menu as you would expect!  I could not taste either vanilla or white chocolate anyway, so it was very bland.  At least the biscuit base and berry compote was nice.  The service was laid back, but satisfactory  Enjoyed several glasses of red wine and some good chat with flatmates, But overall, very disappointed with the situation and my dessert.  I would not go back for dinner.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CiEcf2sST7Ow1dP_RKb22w"
  },
  "XPXQrNHCGOgOsCYSMLvm0A": {
    "date": "6/30/2013",
    "text": "One of the things I've liked most about Edinburgh so far is how nice all the people are. With all the tourists (me included) wandering around bring stupid, you'd really think they had an excuse to be mean. But no, and the staff at Ghillie Dhu are no exception. We had a fixed menu for our large tour group - choices of soup, chicken liver, or haggis for an app; plaice, chicken, or a veggie Wellington for entree; and several types of dessert. The tomato and lentil soup was perfectly ok, although not terribly distinctive. We sampled my uncle's brave haggis choice, which was surprisingly tasty, especially the whiskey gravy - mmmm. The entrees were alright - the plaice surrounded a smoked salmon interior and had a cream sauce, but it lacked oomph and spices. The mashed potatoes were pretty delicious, though. We had a Drambuie soaked sponge cake and a clotted cream thing with raspberries for dessert. The sponge was served in a fun little chocolate shell, and the raspberries were very fresh. However, I don't know how anybody could seriously eat what amounted to a whole cupful of clotted cream. Even me, and I love that stuff. Anyhow, the food was a little slow in coming out, but the servers were very nice and accommodating.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UAvHIpbXzQqJAXePDTJkZw"
  },
  "SWW4DLZot9HFtLaE0VqttA": {
    "date": "4/13/2012",
    "text": "Question time:  -Are you a visitor to this fine city and thought you'd check the Yelp pages for something fun and possibly 'traditional' to do?  -Are you a local looking to be twirled around pleasantly on a night of light drinking and ceilidh?    -Do you prefer to end a night with a smile instead of wanting to head-butt your own face?  If you answered yes to any of these simple questions, Ghillie Dhu is not for you.  I was lured in with a group for dinner and ceilidh dancing and had been warned previously by my local friends this place was rubbish. Advice not heeded!   The space itself is KINDA impressive, though I thought the fluro-pink lighting cheapened everything and gave a very 'George-st' vibe. Lame. The food: completely meh. 2 stars. Out of a possible 6. The food was approximately 33% good. The service wasn't absolutely nasty but one of the waiters did drop a dirty fork on my slacks when she cleared the table. Orders were taken wrong. Shit was a bit unorganised. At least it was all done with a smile. Also, drinks are expensive mon frere.  The ceilidh was UNBELIEVABLY HORRIBLE. Shoulder to shoulder, stilettos driving into the ground on all sides, large drunken men crashing through groups of small tourists, and the most overwhelming stench of cheap cologne and fart I've EVER encountered. I felt sick, bruised and angry after about 5 minutes on that disgusting DF.  Ghillie Dhu is not worth the money or effort. It does look ok, but underneath that imposing medieval smile is a lusty, money-grubbing whore of a sleaze-pit, thirsting for your tourist/curiosity pounds without putting out the expected amount of enjoyment. Definitely a one-star place.  *BONUS STORY!!!!!!!!*  The VERY next night after this depressing experience, I was out with some girls for a birthday. The BD girl wanted to go dancing and told us we were heading to (you guessed it) Ghillie Dhu.   Thank my lucky stars, praise flying-spaghetti-monster, oh, brave new world etc etc.  Now, this group was 7 girls and 2 guys (me and a comrade), we'd had maybe two (2) drinks at the traverse theatre bar and we were dressed smart casual. The bouncer let all the girls in (including my fiancee), then before I could even open my mouth, make an impression, do ANYTHING, I was told my pal and I were too drunk and to piss off. So we all left.  And THAT is why I give this place 2 stars. Because I didn't have to go a second time.",
    "rating": 2,
    "rated": {
      "funny": 11,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "KcfGrudzTcML2md1gwP53g"
  },
  "Rt1hcoawn9wpqCHizy24JA": {
    "date": "12/29/2010",
    "text": "Visited here for the first time last night and due to the timing and possibly the time of year the upper floor was shut so I can only comment on the main bar and the toilets. The bar itself is nicely made and well stocked but the room, other than a pleasing frosted window by the entrance, lacks atmosphere and looks on closer inspection quite cheap. It's a very large space and I can't imagine it being pleasant when rammed full and it was very empty on this occasion with only some of the Fantasy Palace employees occupying a table along with a few lucky punters. Having a working piano available to people under the influence when there is also piped music struck me as showing a lack of foresight too. Initially I was going to award the place 3 stars but having remembered the state of the toilets I've opted for two. One cubicle was in need of a replacement lightbulb and two of the buckets used as urinals (thankfully plumbed in and not relying on customers slopping out) were blocked and therefore rather deeply filled and consequently disgusting. I cannot imagine why it was though to be a good idea to have these installed  what's wrong with some Armitage Shanks porcelain? It will be some time before I venture back here, if at all. Having in fact been here again a couple of times since the above review was written I was thawing a bit towards it (they've got round the toilet issue somewhat by leaving the door to the gents open) but last night they were charging 5.05 for a bottle of Kopparberg in the upstairs bar (where you also pay for entry after 11) and that just takes the biscuit. If ever persuaded to return I'll be taking my own supplies.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RMf7xGw7inHImOo3Lp_faQ",
        "caption": "Photo of Ghillie Dhu - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RMf7xGw7inHImOo3Lp_faQ/o.jpg"
      },
      {
        "img_id": "cNNZ7_2yuD1aVAv_X23dIQ",
        "caption": "Photo of Ghillie Dhu - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cNNZ7_2yuD1aVAv_X23dIQ/o.jpg"
      },
      {
        "img_id": "7aB5uOmAO07lnhuMvUGtgw",
        "caption": "Photo of Ghillie Dhu - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7aB5uOmAO07lnhuMvUGtgw/o.jpg"
      }
    ],
    "user_id": "txzOZrHK9EVY0kYjSuXkKg"
  },
  "R9UVfhoL0XZ9I89HyFi0bQ": {
    "date": "3/24/2011",
    "text": "Dominated by suits after work on a Thursday and Friday, it's provides exactly what you would expect...a great meeting up and staging venue for a good night out.   Decor downstairs is modern and allows plenty of people seated and standing. A nice big bar allows you to see what's on offer and even when crowded, you shouldn't find yourself waiting too long to be served.  I believe upstairs offers a reasonable ceilidh, but as I'm a guy (& sober most of the time) I'm unable to comment on how good it is...but I'm sure at some point one night I will have had enough Amber Nectar to convince myself that its a great idea to go upstairs and shake a leg!   Watch this space...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W1Nl6_R7amuZ6NStXI3uBA"
  },
  "I33TpTcGpDQf-K9KLScGeg": {
    "date": "8/31/2013",
    "text": "Another good Scottish pub that is hidden out of the way but if you know where to look WOW its massive! Been here a few times to see how it always turns out and so far so good. The bar is your basic bar, with all the normal drinks and beers . Prices are reasonable I think. What gets me about this place is the vastness and style and architecture of the place. First off I thought I was walking into King Arthurs castle or something. Theres a downstairs , mid-floor where the bar is , and another dance hall upstairs with another bar and tons of space! Seriously this has to be the biggest pub ever! The space is great it leaves room for air flow so your not dying from heat exhaustion or feel like your working in the mines . I didnt get to try any of the food yet so I can comment on that, but the service is good. I have never had a rude or grumpy employee yet so thats good. The crowd that comes in is a good mix. Middle aged and younger all come here. I think its nice to have a good mix of the generations sometimes, its refreshing. Next time I go I will try the food and update this review but as it stands this is a decent pub and I will be coming back",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VdAFcSPJgMvCAmp869X2gQ"
  },
  "D96BtoYmDhixFhQLyqrAcw": {
    "date": "1/7/2012",
    "text": "This place was awesome, our first dinner in Edinburgh.  The server was amazingly helpful and nice.  The food was better than we've had on most of our Europe trip.. Better risotto than in Italy!  The beans and toast was amazing and the best fish and chips to date.  The band was \"cute\" playing American music with their Scottish accents, it was an experience.  The ambience was good even though it was a little crowded.  There was a private party taking up a lot of space so I can't imagine it would be as bad any other night.  This was a Friday by the way :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JzSRlENHS-WpaprCY5Jr7g"
  },
  "8VVBDPKkbSs2oYyUFO2DEw": {
    "date": "6/1/2012",
    "text": "I was very impressed with the level of service I received here. We went on a work night out for a meal, which was ordered beforehand. Me being awkward and allergic to dairy made things a bit complex but the waitress came and explained to me what was in all the dishes, what I could and couldn't eat and because all of the desserts were out of the question they made up a fresh fruit salad for me, which wasn't on the menu. I have to say this is one of the only times I've eaten out feeling confident that the person serving me actually helped me figure out what I could eat. Would definitely recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VMGBoRpjgwB0uEWdG-nZ9Q"
  },
  "Sb7PmqWYeM2kn9_NdNj3_w": {
    "date": "2/13/2011",
    "text": "I LOVE Ghillie Dhu. I've been here on a work night out and a first date and both were fun so it definately has versatility. The central location makes it easy to get to and I think it is appealingly Scottish without being Irn Bru bar tacky. The lower floor is always packed, it's got a brilliant atmosphere for after work drinks and seems to attract professionals rather than students or the 'Yah Yahs'. I like the big medieval banquet style tables - they make me want to request a goblet for my wine and don some sort of velvet wench-like dress. The live music on this floor is great aswell or you can head to the spacious upper floor and get a bit of ceidlidh action on the go (apologies if you were there on Friday and I stood on your toes). The staff are also really friendly and kindly got chairs for me and my date on Friday so we could sit at a quieter bit of the long tables on the upper floor.   I haven't had food here yet but will do soon, it will definately be a regular haunt for me.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "HMzeor8uK8ro7mms13UFCg"
  },
  "cw-VgjtH2UferyA4onhz6g": {
    "date": "3/24/2010",
    "text": "For a Scottish theme bar, Ghillie Dhu is actually quite tasteful. The wooden beams and paneling is reminiscent of a garden centre, but the comfy leather upholstery makes the place seem cosy.   There are loads of booths, which can be reserved. There's also a screened off section which can be reserved for larger private parties. The booths backing on to the bar have a call button, and drinks can be served direct in to your booth by a hatch!   We didn't have any food, but the menu looked pretty decent with some interesting items.   There were some minor issues - the G&T we ordered was made with soda water instead of tonic, and the draught lager selection is pretty rubbish. However, the G&T was replaced quickly and without quibble.   The ladies loos were huge, and very nicely done out. The male loos featured plumbed in buckets instead of standard urinals. An original idea but possibly could get a bit messy...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EHN4rgxDzw8Mn8wYMkadVQ"
  },
  "p7xZ62z0HF4sIWqKQKh0KA": {
    "date": "4/24/2010",
    "text": "came here last week and quite enjoyed it. Although the service was a bit chaotic, all of the staff seemed sound enough. It was a rather busy Saturday as well, so this was somewhat to be expected.   I shared a cheese and tomato tart for a starter, which was miniscule to begin with, though tasty (all one bite of it!); but the main course made up for it. I had the mushroom stroganoff, which was really fantastic. It was so creamy and filling, I loved it!   This is a Scottish-themed restaurant, and I would recommend it to visitors to this country who want to try some 'traditional' cuisine. These guys will accommodate all of your haggis needs.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WLE_sZQm2k0yE1rmStp_Eg"
  },
  "XWoEY7HC3la5vEN81O3X9A": {
    "date": "12/14/2011",
    "text": "Really disappointed with here.  Heard mixed stories about this place and to be quite honest they were all True.  Its a lovely place, thats where it ends really. Live band were average, with a fairly poor sound system. DJ was as bad, with many people just standing about chatting. Didn't really get the place.  Won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F5_iRtLHvbNcc84AGQxT3A"
  },
  "R8wkgyKtmwyB-eZvo6L59g": {
    "date": "9/8/2010",
    "text": "We dropped in for dinner the night before we left Scotland after the British Open. The place is a bit off the beaten track, which I like. It didn't appear to be the Scottish version of the Hard Rock Cafe, for instance.  The interior is spacious and clean. The long bar, with the white backlighting, is pretty spectacular. I ordered a Black Velvet, but they did not know what that was (half Guinness / half cider). Ok, that is technically a Poor Man's Black Velvet, but does anyone really bother to add the first part? My request was met with a lot of staring (politely though, from a distance), gesturing, and at one point, the loud crash of a lot of glass-based items behind the bar, although I'm not certain that was directly related to having confused the staff. Speaking of the staff, our waiter was awesome. Hands down the best we had our whole trip, and there were a lot, since we ate out every meal. I can't remember his name now, but he was very tall, very knowledgeable about Scotch Whisky, and exceptionally patient with me. Thanks, friend! I had the mac & cheese, which was DELICIOUS. Really good. Almost \"can-I-have-the-recipe\" good. Guy had the rib eye, and he really enjoyed it as well.  There was a live musician that evening who played Scottish music and his own interpretations thereof. I wish I could remember his name, because I'd probably order one of his cds if I could. The prices seemed reasonable, but as we are foreigners, and using foreign currencies always seems a bit like playing with gaming chips, not *really* real, and further were fresh off a week in St. Andrews, where everything is ungodly expensive, who knows? We may have been fools! To sum up: Very good solid Scottish traditional food in a great location that is not overrun by tourists (like me!) with exceptional service and arguably reasonable prices. I'd recommend it to you, and I'd go back again myself.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZCZonMEWoTrMPGmkla1w3w"
  },
  "X87LTX0MtWlU_aLKMvSi9w": {
    "date": "3/14/2011",
    "text": "The bloke pretending to be a manager here has the worst attitude, completely out his depth. Another G1 dissappointment. Tourists may buy into the palce, but there are far better places to drink in the west end.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w6T9G6r1QtPRoOYrFVEM1w"
  },
  "BdRnCeJ-4MBIk11xiiH7Yg": {
    "date": "7/30/2010",
    "text": "A group of us 1decided to celebrate my birthday at Ghillie Dhu, it was a first time for all of us. The building is beautiful and in a great location. We were impressed with the great choices on the menu and the waitress was very helpful.We all had a superb time and will be returning soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ymlR5XHcA7Np2_7spwiyVg"
  },
  "e9_TOMNC5ry7mtA5TqzyCQ": {
    "date": "6/7/2012",
    "text": "Great bar. Gets really busy, but well worth a visit. If you get one of the booths behind the bar you get a buzzer & a hatch  no need to get up! Has live music/ ceilidh at the weekend. A fantastic atmosphere with a mix of locals and holiday makers alike",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h27kVQQaejp53UUkj_TC-w"
  },
  "x9Ju9OGsRu_r93HXd59iAg": {
    "date": "4/18/2012",
    "text": "Nice building- shame about the terrible food, rude staff, and Neanderthal doormen.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EWennyVQ-MBTUsBXStFa_g"
  },
  "ySUY7OJjXhH1wnarXadXVw": {
    "date": "3/24/2010",
    "text": "So me and my mates got to Edinburgh and were looking for somewhere fast as the Rugby started in about an hour... enter Ghillie Dhu. We were told it's a new place but it was amazing! There are booths and huge screens you can get a good view no matter where u sit in there. The workers are all in kilts and rubgy tops. Loved every minute of and we will be going back next time I'm in Edinburgh! Ohh and great steak pie too!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e1qBCTJLbFym-x_Vldibtw"
  },
  "1_cMiPQVLNs_amQkFMG4pw": {
    "date": "6/18/2011",
    "text": "An amazing venue but DO NOT go here for the food. A beautiful church-like venue and I love going here for the regular 'ooh la la' vintage fair. Would be an awesome venue for an unusual wedding reception. Well stocked bar with some brill spirit options. HOWEVER, we found the food beyond crap. We ordered 2 open sandwiches and a burger. They took over 45mins to arrive. When they did come they were cold and badly presented. I had a mozzarella sandwich which contained partially melted kraft-slice-style mozzarella and stale bread. The service was pants with poor customer service. Staff looked bored and acted like they didn't care. To be honest they were pretty stroppy and seemed to have an attitude issue. They took 15mins to get tomato sauce for my friend's bacon roll. The prices of food and drink are shocking and are nowhere near worth it. The place was dead and now I know why. Next time 'ooh la la' is on we'll get food elsewhere.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YE3F5cZTR_xBGZC1VdRy2g"
  },
  "OdUin4qprmTyseBnHC1tjQ": {
    "date": "8/2/2011",
    "text": "I go to Ghillie Dhu for lunch quite regularly as I work near by. I always enjoy the food, and the staff are happy to help. There is a lovely atmosphere and the venue is just stunning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hU_6EmERv3RhlsQUrz1sFA"
  },
  "eg9SS6ztQNmviAENXr1LEw": {
    "date": "2/17/2013",
    "text": "This place is just so gosh-darn expensive. I like the way it looks, but at the end of a night, my pocket is always empty!   Also, the DJs on weekends are pretty sucky for 4 pound entry..   However, if you do pop in for a coffee during the day, they do have free wifi which is a positive!  fin.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "F9nMHS70LBqEwKYFFuJ_0Q"
  },
  "y1BSaUxXQ58lEcTC0P8K0Q": {
    "date": "9/23/2011",
    "text": "I first came here for a Fringe show in the spacious upstairs hall. It was the perfect venue for it (The Strange Undoing of Prudencia Hart, anyone?) and I thought the space was gorgeous - long dark wood tables, high ceilings, friendly bartenders - and apparently it's a ceilidh hall.   Naturally, we went back the following Friday to try it out. It was a good time, although they packed the dance floor far too tightly and I wish they'd have moved the tables back further so there was more room to dance. Unsurprisingly, there are a lot of ceilidh enthusiasts in Edinburgh and there were a lot of elbows swinging! Still, the emcee (?) gave great directions for ceilidh newbies like me, and it was great fun. After midnight, it turned into a regular club night, but being sweaty and tired we got out.  There's a nice, big and modern bar downstairs with lots of TV screens (they even pipe the games into the loos so you don't miss a thing) and a decent menu, so if you need to fortify yourself before ceilidh madness, Ghille Dhu's got you covered.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UTr4PU6YlsaywlAR1afdlg"
  },
  "v3tQ7F1mlfUDp1pv_SylbA": {
    "date": "8/25/2013",
    "text": "Food was good, service was a bit slow but that may have been the tour's idea and not the restaurant.  Bathroom only had one functioning sink out of six which if you follow baseball, is a crap batting average.  Bar had decent prices and the dancing was quite entertaining. That being said, I don't think I would have gone here unless it had been included in the tour itinerary.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fq13EVI1qZw9r9qsJoSRdg"
  },
  "ehnaXL2swTUbQ7uKPDEFsQ": {
    "date": "5/17/2013",
    "text": "This place is almost hidden from the out side but is actually really big inside.   The bar area is very rustic and has lots of space for large groups to chill out. Food looks alright with lots of pub staples like Steak Pie, Fish and Chips and Sausage and Mash. They also have a large veggie selection too. Now everyone knows I am a pretty big pie fan and I have tried a few in my time but I have to say their steak Pie was to die for seriously you should try it now. My friends veggie pastry thing was a bit disappointing though so I am going to go for 3 stars based on that and a slightly offputting toilet smell on the day.   They also have after work deals with prosecco for 15 which was rather a nice treat indeed!  Up a windy candlelit staircase they have a lovely events space for weddings and gigs. It has a really high vaulted ceiling with purple lighting, lots of sparkly mirrors and an old church organ which makes it look really amazing when it is done up for an evening. There are long benches to sit on and they hold regular ceilidhs too.  Good for a drink and a dance and I would recommend it for a fun night out learning your strip the willow!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "neMi0e3dZaUtX7Sg-3Qytw"
  },
  "TLFZt5zWash9DmKMMSFDJg": {
    "date": "1/7/2015",
    "text": "Real coil looking spot, vibe and decor is nice... but the food selection is not that great. The bartender wasn't that helpful either. Not sure if I'd make it a point to go back if I'm in the area again.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "QaAghY5AUGi5rUWiIOR7NA"
  },
  "hFFEf6AwZVEB7mOVTiMwBg": {
    "date": "1/26/2014",
    "text": "This rating is overall, based on all the times I've been to Ghillie Dhu. Because based on today, it would only be one or two. The quality of the food itself is great and the drinks are tasty and reasonably-priced, but it's the service that varies a lot. Today I went in to have a drink and a snack with a friend before catching my train. We each has a glass of wine and two sides just to munch while we drank and chatted. The mac and cheese side was delicious albeit smaller than expected, but we didn't quite get the other side that we ordered.  We asked for chips with garlic mayo, the server took our order, and eventually came back with chips and a coleslaw. I asked where the garlic mayo was and was told 'Oh I'm sorry, we are out of mayo today'. Excuse me? Then tell me that when I order because I hate coleslaw. We might have ordered something else had we known.   Then later on we asked for the bill right as another server cleared the plates because it was starting to cut close to my train time...12 minutes passed and no bill. I had to go up to the bar to ask for it. It wasn't a super busy time, I was there late Sunday afternoon. Maybe it was just a bad day.   This is not to deter you from going to Ghillie Dhu. The place inside is gorgeous, especially the upstairs hall. And it's always fun for a dinner or after work drink. Just don't expect consistency with the service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "In46Vl71LOiXa0Pwj0UHAA"
  },
  "QkYq-KCTVlCMu8w8zpO6_g": {
    "date": "7/25/2013",
    "text": "I suppose it entirely depends on what you want. As an event location, the upstairs makes a fantastic conference room. It's a stunningly beautiful building, both inside and out. The problem is at night when it turns in to just another bar and upstairs becomes a dance floor. The type of people who show up are obnoxious and I couldn't wait to leave. Loud music and seems to be couger town!  So I'm giving it 3 stars for what it normally is but I will add that as a conference location, it's hard to not give it 5 stars!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0gUhkwIMFCrQ59eX0sgZGA"
  },
  "eE5xqLwYpCRxvJBP2aQmxg": {
    "date": "1/31/2013",
    "text": "Ok so my only experience here was for a Christmas night out with work, so not exactly your standard Ghillie Dhu night out.  First impressions - the upstairs is very impressive.. until you realise there are no toilets upstairs and you need to go out into the baltic and drunkenly dangerous stairway to go into the hot, smelly, cramped downstairs bar to find a toilet.  Boo.  Despite the number of Christmas parties being hosted upstairs, the bar was surprisingly wide open, though it amazingly still took ages to get served (a Staropramen costing over 4)... and of course then we discovered that drinks downstairs are cheaper.    Skint by the end of the meal, I left just as the ceilidh was starting.  To be exact, we were punted off our table before we finished our desserts so they could setup the ceilidh, so I left then.    All in all, not an experience I will be jumping to replicate any time soon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4UQfst9jve4GCSfWpWn2uA"
  },
  "qJBYeJTqtaVTcG30ZfoEqA": {
    "date": "11/1/2016",
    "text": "What a disappointment! We were visiting Edinburgh for Halloween week and saw the advertisement for a Halloween party at Ghillie Dhu, in the hall, with special dishes & drinks. When we got there the place was empty. It was such False advertising. Only the upstairs bar area was open. They said the party was over the weekend, not ON Halloween. That was not written in their ad. But we stayed since we invited several friends. The food wasn't too good either. Overall, it was a very anti-climatic halloween night, in a rather mediocre place. I DO  NOT RECOMMEND AT ALL.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lMKv1Wsj_VtQ3CWpNi48xQ"
  },
  "Z6tO0QnN1aANnCEMbsqj1Q": {
    "date": "6/26/2014",
    "text": "Here on vacation.  Not real friendly...I guess we where the tourists.  Beers too expensive compared to the pubs.  Food too salty. Not a great experience.  They out a reserved sign on the table at 6:30 to reserve the table for 7:30. Did not tell us we had to move.  1/2 the table showed at 7:44. Not really sure what that was about.  Will not visit next round.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4VdgSEKq3aoA564tW9hSAg"
  },
  "A9T64PRYj-6Eq7tnJLJXow": {
    "date": "2/23/2013",
    "text": "Loads of space during a schoolday or evening. At all other times it is packed. Apart from the free wifi this place doesn't work for me. It is not the cheapest place. I think it is mostly suitable for large groups. (with a massive kitty between them ). Somehow this place is very loud! Can't find anything really wrong nor good so 3 stars from me.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NtCNffKVfvcmoNM82iLvQA",
        "caption": "Photo of Ghillie Dhu - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NtCNffKVfvcmoNM82iLvQA/o.jpg"
      }
    ],
    "user_id": "fKi8ZF3xpJJkgSusRubeMA"
  },
  "QHNYJzFtABbZbTWb5T9XMA": {
    "date": "3/15/2013",
    "text": "I've only been here once, so I don't know if this is a common problem or they were having a particularly off night, but the service was ridiculously, unacceptably slow. It was not a big crowd; several of the tables around us were empty, even. Drinks took so long that we began to doubt whether we had ordered them at all. Drinks ordered at the same time sometimes arrived 10 minutes apart (and these were not complicated, umbrellaed drinks - just beers and ciders and sodas).  The cheese plate I ordered was fine. I'm guessing it consisted of young, fresh cheeses when my order went in, but by the time it arrived at the table they were all nicely aged. The person sitting next to me (who shall remain nameless) ordered the fishiest fish pie that I ever did smell.   The waiter, when we did see him, was friendly enough. Plus I think he was the first kilted waiter we've had in Edinburgh, which seems like some sort of important cultural milestone, right? Or maybe not.  I feel like Ghillie Dhu has the potential to be much better than 2 stars, but not for the experience we had last night.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J_qpI2jCkwv7vPNz_9JeqA"
  },
  "m7hzV_XbzufjAN1tI3NS-g": {
    "date": "6/17/2012",
    "text": "The Ghillie Dhu is a proper pub which just happens to have a 3am license (though they don't always stay open until 3) and sometimes that is exactly what you want. The bar staff will normally be able to hear you as the music (live or otherwise) isn't overly loud and this means you can actually take advantage of the extensive range of beverages available.  Thats all really, if you reach 12-1 in the morning but want to stay out in a \"normal\" pub environment give the Ghillie Dhu a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GN3wBXDaLLmY6Oitfy3T8g"
  },
  "QM_D6ojbK-LbfnCByxkbew": {
    "date": "7/14/2010",
    "text": "The place hasn't been open very long, but I think it's going to be around for a while if it carries on the way it's been going!  It's unashamedly Scottish but not in a tacky way: they promise \"hearty scottish fare\" and \"premium drams\", and yet rather than being a cheap tourist trap this place still retains an upmarket feel.  Which brings me to my one grumble: the price. With such a great location just at the west end of Princes Street, and offering service to such a high standard, inevitably the drinks aren't cheap. But it's definitely worth it; this has fast become one of my favourite drinking spots in the city centre.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QXuigOXkn8hi4Fbg4E9Bmw",
        "caption": "Photo of Ghillie Dhu - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QXuigOXkn8hi4Fbg4E9Bmw/o.jpg"
      }
    ],
    "user_id": "oEshN5oq98_g23MvEnRc5A"
  },
  "dx-3kcRHg3kCKKLDu31fTg": {
    "date": "5/31/2012",
    "text": "For a number of months, every time i left the office (Rutland Square) to go for lunch, i was thrust a flyer for discounted food at the Ghillie Dhu. I'm not going to lie, i was sceptical about how this would be... the result was that i was pleasantly surprised.  One day a couple of weeks ago, a group of us in the office decided yto go out for lunch, so due to my previous experience of the GD promotion, i suggested here.   I ordered a chicken and leek pie and it was delicious. Served in the dish it was cooked in, on a wooden board, with chips served in a little mock deep fat fryer cage/net/basket, and a tiny little dish of peas. It was all very tasty, but i didn't eat all the peas as my fork wouldn't fit in the dish, so what was i going to do, pour them out on the wooden board so they fall off onto the table? A minor detail but silly none the less.   All in all, i was very pleasantly surprised. If anything it may have been a bit over priced for what it was, but i would go back again. They also often post offers on Facebook which seem pretty reasonable!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HV24bliLib6FuMW3bWBrpQ"
  },
  "s7TFhrj3YF31tBVH-uI1NQ": {
    "date": "6/18/2012",
    "text": "I would like to give a detailed review of this place but all I can review are the front steps, there's five of them and I got as far as the third leading up to the door and then there was the doorman at the top As we approached, the doorman told my friend she couldn't enter because she had a bottle of mineral water in her hands, so my friend offered to put it in her bag. He still refused entry and didn't really give a reason. So, we decided to leave the water outside. Perhaps they have strict security measures like airports do and dont allow anything above 200ml. It was at this stage my girlfriend told him that she had a bottle of vodka in her bag (750 ml) and that we were just stopping by for one before going home. The game was up at this stage. Front steps rating: 3/5  Doorman rating: 0/10",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZkmKyB9660N9d30GIrBGTQ"
  },
  "GGK96CgPVYdtc1rCTOMFkQ": {
    "date": "11/16/2013",
    "text": "I have been here for some events and just for drinks. Nice venue for events upstairs, good bar area on ground floor. Quirky toilets in the basement. They have the usual drinks and decent bar food. They have  some nice booths you can sit in and some of these (the ones behind the bar) allow you to get drinks directly from the bar. Can get busy so make sure to book a table if going for food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "duI9-_L6Sz7yh7nMVGJqLw"
  },
  "vTFdYAVPKsuz6WWPqjUFGg": {
    "date": "5/18/2012",
    "text": "After a morning of exertion and no breakfast it was time for lunch.   The Ghillie Ale, whilst not strictly necessary, washed away the morning's strains and stresses quite sufficiently, not to mention tastily. And, no, it is not available to buy elsewhere, or indeed as a carry out. Shame, it's very quaffable.   The burger was served in a timely fashion, by a fusion waitress. The staff seem to all be of the kilted, thus traditional, and pierced / tattooed, thus conforming to the non-conformist zeitgeist. Very tribal.  The burger was served on a wooden board with the chips in a wee faux deep fat frier basket. There was yet another receptacle on the board reserved for coleslaw. How very trendy.   The booth we were sat in featured a hatch to the bar with a little, retro lightswitch which is wired to a light at the bar. Handily, our voices worked, as this light was largely ignored.   The burgers were great, well, my one was, and, I assume that my companions were genuine in their appreciation of the food. They're an honest bunch whom I have no reason to disbelieve.   The burgers were not cheap mind, almost a tenner and that was before the addition of bacon and jalapenos, at a further cost of 2.50. Still, with all those boards, baskets, ramekinesque coleslaw vessels to buy, fill and wash in order to serve a burger... well, it just couldn't be cheap, could it?  You may think there's an air of sarcasm in this review, you're wrong. It's merely an unnecessary overhead in honour of the over complicated presentation of a lunchtime burger and chips. The comments about piercing and tattoos is more a commentary on the cult like necessity to express one's individuality by subscribing wholesale to cultural conventions of indigenous peoples from other shores with no relevance whatsoever to one's own bland middle of the road background whatsoever.   The food was great, the staff were polite and attentive, except when summoned by lightswitch. Nice place for food and drink, just don't analyse contemporary 'culture' too much and you should enjoy it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1WmU68ihBaUAiDQn8GPGBg"
  },
  "1mJSFiYi3kmEsUPUgK72cw": {
    "date": "7/5/2011",
    "text": "And with trepidation I stepped through the medieval doors that lead into the Ghillie Dhu. After all I had many reasons to fear the unknown: located at the west end of Princes Street, on the cusp of the dreaded Lothian Road, an area not uncommon to the odd bout of weekend violence; the Haye/Klitschko match had just that minute ended in defeat for the cocky Briton, again another excuse for the drunken, pumped-up chavs of the west end to exert some aggressive testosterone on some unwitting strangers; and of course, my company, a close circle of friends from out of town who, whenever they grace Edinburgh's nightlife scene, choose the cheesiest, most unusually bizarre venues for their escapades, their only criteria seemingly wherever will let them away with the most drunken banter without being asked to leave (see: Jam House, Walkabout and/or Mood!).  So going in, high hopes I did not have. We first started upstairs. The ceilidh hall or, as I call it, the Medieval Jam House, where after parting with the required 3 entry, we were greeted with the bustling populace and the cheesiest of cheesy live bands. Cheesier than a Kingsize Happy Meal. So cheesy they made Aqua look credible. You get the gist. I've been told on occasion there will are ceilidhs instead of the band, so sounds like I got there on a GOOD night...!  In fairness, the clientele did make the hall more bearable. A spacious bar area meant less heaving crowds and more social space. Tables a bit crammed together meant it was difficult to manoeuvre in between but the outskirts were fine. And I suppose the band would be tolerable if you were into that kinda thing... or were completely sozzled!  I, however, was not and so sought something more downstairs... and found it.  Perhaps one of the best social bars in Edinburgh. Definitely worth a look. The music was also live, but an acoustic set of rock and indie classics (gotta hand it to young male guitarists in the area... they have no idea what cheese is!) that wasn't overpowering, so there was no struggle to make yourself heard. The space was immense, enough tables and chairs not to let the floor become overcrowded and enough standing room even if all seats were taken, therefore no barging to and from the bar.  The atmosphere lively, an even ratio of male to female (probably the only bar I can think of in recent weeks where this was the case), a good standard of customer (ie. no chavs, ponces, et al) and attentive bar staff. Didn't notice much price difference between here and anywhere else around the town centre, and no idea if they serve food.  All in all a well-maintained, clean and chav-free bar with a busy, lively and albeit cheesy club atmosphere above. Hats off to the bouncers, I will no doubt step through your doors once more and next time that's where I'll leave my trepidation!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "9RGIvzCGHp8ELF_JgAlbZA"
  },
  "TBqks9ZlgU3bhT9qJ1UsnA": {
    "date": "6/30/2011",
    "text": "Oh how the mighty fall. After perusing online around Christmas to arrange to take the boy to one of the Ghillie Dhu gigs, I sent an enquiry to Ghillie Dhu as to availability. Online, I discovered that the privacy policy which states basically once they have your information, they'll take it and have a small party with it.  Now, I get emails from them. Having been in ye olde email marketing industry for years, I despise spam with a passion - it made legal mailers lives so much harder, and it's invasive. I think I would be preaching to the choir if I continued on that one.   Well, Ghillie Dhu spam. They send out unsolicited emails without any form of unsubscribe - contacting to have details removed are ignored and the spam continues - well, until I report them to ICO. I don't consort with people who force their marketing on me so Ghillie Dhu (and <a href=\"/redir?url=http%3A%2F%2Fg1group.com&s=c0e17c19d0ee0803878a7a8660fe4d15faa33985fc4b250ead0d58097b4ea427\" target=\"_blank\" rel=\"nofollow\">g1group.com</a>), you are dead to me.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "X2uF3C3YBD24xcgKA104Sw"
  },
  "_W7Zkoye3DZP4FlrMUq9Hw": {
    "date": "7/14/2019",
    "text": "Came for the Ceilidh dancing in the big upper hall (7, 9:30-11:30pm, Fri/Sat), and was lots of fun. A good amount of beginners and first-timers made easier to try this dance. Dance instructions at the beginning of each thing could have been better, was my only complaint. There's a bar up there and there's even a set dinner menu if you call to reserve that starts at 7:30pm.   Bathrooms: Down in the basement. Lots of stalls and mostly clean.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UcKlK5kZJsxj7fYFcVwSUw",
        "caption": "Photo of Ghillie Dhu - Edinburgh, United Kingdom. Upper hall",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UcKlK5kZJsxj7fYFcVwSUw/o.jpg"
      }
    ],
    "user_id": "LPVxp83hPPvp1eP96EIcSw"
  },
  "xAKQZWihI6fXpHdKzoL0cw": {
    "date": "4/20/2019",
    "text": "Great pub food, great service, very cool ambience. Glad we found this place! Seems to be quite popular...I think we got lucky, but call for a reservation. A great place to eat and be merry!   Thank you to Marta!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "auhvAPaEWrk2T5mybb3FSA",
        "caption": "Photo of Ghillie Dhu - Edinburgh, United Kingdom. Ghillie Burger",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/auhvAPaEWrk2T5mybb3FSA/o.jpg"
      },
      {
        "img_id": "P3pMGZLOOY-fmxi8t26D6g",
        "caption": "Photo of Ghillie Dhu - Edinburgh, United Kingdom. Narcella olives",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/P3pMGZLOOY-fmxi8t26D6g/o.jpg"
      },
      {
        "img_id": "s-peMaMcYBz2QNRKeEMbIA",
        "caption": "Photo of Ghillie Dhu - Edinburgh, United Kingdom. Exterior",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/s-peMaMcYBz2QNRKeEMbIA/o.jpg"
      }
    ],
    "user_id": "fxGCG_a1e-kKndEjdNZ7CA"
  },
  "2M88ZoW-Yd9YmGuVo9xqsw": {
    "date": "9/19/2018",
    "text": "Bartender recommended the smoothest whisky's for our whiskey flight. We had a great time! Really cool place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6ErRoLidcbvv3p_MdE3Q5A",
        "caption": "Photo of Ghillie Dhu - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6ErRoLidcbvv3p_MdE3Q5A/o.jpg"
      }
    ],
    "user_id": "zXHqIiSQvrLnSspbKPpbwA"
  },
  "QtKvZ5lasTXETGwwNJGkog": {
    "date": "9/8/2018",
    "text": "Absolutely amazing food! Fantastic service. Great presentation and lovely open split floor atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VubNR8Lmq-zbdoFcSJi9ug"
  },
  "Y9PFTX4fGgNlB8udB1iEug": {
    "date": "12/18/2017",
    "text": "After dinner came to Ghillie Dhu for an after dinner dram. Ghillie Dhu is a converted church building. That's the type of proselytizing I heartily support.   As usual a huge selection of whiskey at a very reasonable price. Most less than $5 ( pounds).  Beautiful architecture and bathrooms are worth a visit.  Taxi's right outside door.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VSK14AR9VDQ34-jnS5UjFQ"
  },
  "ekPHobqO6A0KJccYEqTR6g": {
    "date": "1/31/2018",
    "text": "The bar is fine if you're just partying and do not care about customer service, quality of drinks or pricing. The upside is they play loud music and drunk people dance together. The downside is everything else. If you're in the neighborhood, I would recommend going to the basement bar next-door which has much better cocktails, much friendlier staff and a nicer environment.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XlyyrUikLH5BXzZ09rZgHQ"
  },
  "OOnqFWYLfbZuZEr4QbbHWw": {
    "date": "5/19/2015",
    "text": "Huge.  This fukin spot is huge.  And all glam'd out.  You have to stop in here to grab a pint and just soak in the ambiance.  Huge.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "495AfU0vDjmnC-MS_byCYQ",
        "caption": "Photo of Ghillie Dhu - Edinburgh, United Kingdom. I gotta piss in those things?",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/495AfU0vDjmnC-MS_byCYQ/o.jpg"
      },
      {
        "img_id": "XfMBTSPLQxW4rsVptdIBoQ",
        "caption": "Photo of Ghillie Dhu - Edinburgh, United Kingdom. Dope",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XfMBTSPLQxW4rsVptdIBoQ/o.jpg"
      },
      {
        "img_id": "lcQY2Cj9HfZk2hxgdySHSg",
        "caption": "Photo of Ghillie Dhu - Edinburgh, United Kingdom. Huge spot. Huuuuge, mate.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lcQY2Cj9HfZk2hxgdySHSg/o.jpg"
      }
    ],
    "user_id": "Yjer78RnYr7OCzirgdcOaw"
  },
  "dAzMcsVStLiGYtrNs0f5FQ": {
    "date": "11/22/2015",
    "text": "I feel like I completely missed 99.9% of this place...  I met a few fellow social media hounds for a whisky here a few weeks back. The public bar is pretty standard really but they had Auchentoshan Three Wood at a reasonable price, so I tip the hat to that. The service was a little lacking, considering that we were one of three tables at the start of the evening and it was full to the brim by the time we left, so it meant a little awkward dancing at the end of the bar to get attention and our bill.  I'll save the next two stars for when I try the food and the second I get to set food into that spectacular event space. For now, it's simply a standard sort of bar with a standard sort of bar list - nothing to snub your nose at but nothing spectacular either.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "H5TEwR-OD0XxILGNaewohA"
  },
  "oGuJsEdZ8nHk5CjXVWLsPA": {
    "date": "4/3/2016",
    "text": "I was a little disappointed with Ghillie Dhu, going in with such high expectations. We were attending for a university department ball, involving a three course meal and a ceilidh. Our group was based upstairs, in the very ornate hall, with beautiful round tables, and lovely decoration. It really looked quite nice. However, the food disappointed. The soup was bland, and served with clearly not fresh bread. Main course tasted fine, but portion size was small, and even the dessert chocolate mousse failed to impress. All in all, I was definitely quite disappointed with the food offerings.  After dinner, we were all forced to crowd around the bar so the staff could set up the dancefloor for the ceilidh. This was more fun, with decent acoustics and a good amount of space for dancing. Drinks at the bar were very expensive indeed, costing more than 4 for a very bland beer such as Tennents. I heard rumours that drinks were cheapers downstairs away from the event hall, but I don't know if this is True (and would be quite annoyed if so).  Overall, although the building is really nice and it definitely feels like a nice place to have a ball/party, the food was definitely below par, and drinks are too expensive. Probably won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RMOJLdLHdFai_ksWCMDOoA"
  },
  "G_ug9uM6eJLsxHTToTYPQQ": {
    "date": "4/7/2014",
    "text": "I had a voucher for 2 brunches for 7 instead of 14.  We called ahead and booked a table and got the cutest wee booth with a little hatch to the bar which we got drinks passed through.   I really like the feel of the place.  I have been to events upstairs but this was my first experience of the public bar.  We have friends in the USA who are planning a trip to Scotland and this is definitely somewhere we will be bringing them.  It is full of charm and decent food and surroundings.   I had the veggie breakfast which had veggie haggis, beans, potato scone, mushrooms, scrambled eggs, fried bread and toast. My husband had a regular Scottish breakfast which had haggis and bacon too.    The latte was very smooth and had a little design in the foam on top.   I really liked it here and I will certainly be back.    Make sure your not in a rush as not the quickest but very tasty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9WfWI46mJfNOjqjbgqbtrQ",
        "caption": "Photo of Ghillie Dhu - Edinburgh, United Kingdom. Little hatch to the bar from our booth",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9WfWI46mJfNOjqjbgqbtrQ/o.jpg"
      },
      {
        "img_id": "oXXQOynjr805TXIgDpUWzw",
        "caption": "Photo of Ghillie Dhu - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oXXQOynjr805TXIgDpUWzw/o.jpg"
      }
    ],
    "user_id": "rVEQ7nG4Bo7utMcqURxaIQ"
  },
  "jxVKkH9Bc5tMFHAQFElJHg": {
    "date": "11/18/2013",
    "text": "Solid 3 stars for the moment. I was here during the day for an event which was paid upfront so there was no buying drinks at the bar (there were plenty of free ones). Staff I did speak to for clean glasses, etc were friendly and helpful. Toilets - clean and perfectly ok, though appeared to be at least two flights down so any drunker/in heels, this might be more than just a little bit of an issue.  So, all in all, ok and will review again next time I'm there...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "frthTngbBHgSdk4j85HmEQ"
  },
  "Fonc0zcv3-e1WXD-IMMM_w": {
    "date": "11/8/2013",
    "text": "We were there because of a wine tasting event and it was one of a kind. The coordinator for the Wine with a View event was Nikki from Convivium wine.  The establishment is very old, mystic and therefore intriguing for somebody who likes the old. You needed to go up a spiral staircase to reach the first floor landing. There we entered a hall which had the interior features of a church. Lovely layout.  Over 60 bottles made their way into the \"wine with a view \" selection. You got it all. Sparkling champagne, prosecco, whisky, port, cocktails, the red and the white wine selection. Prices ranged from a tenner up to hundreds..... Make a pick and buy what you fancy.  If you leave a star on a bottle you indicate what you fancy and might have gotten a bit more to taste.  NIKKI is arranging these types of events at least ones a month and the canapes that come with it are amazing. They really bring out the taste of either the red or the white wine.  Can't wait for another wine tube map event at the Bon Vivant Companion.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "cR8Em-brgbN5ZeaGenh3yQ",
        "caption": "Photo of Ghillie Dhu - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cR8Em-brgbN5ZeaGenh3yQ/o.jpg"
      },
      {
        "img_id": "_35wPUNy9LzXnNcc5w4oEQ",
        "caption": "Photo of Ghillie Dhu - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_35wPUNy9LzXnNcc5w4oEQ/o.jpg"
      }
    ],
    "user_id": "s85sNAMlsrI0xCRvfj7Jrw"
  },
  "AdWZgpy48vU1bMmul6kR-w": {
    "date": "12/13/2017",
    "text": "Amazing building, a very elegant place to dine that later becomes an ideal place to have a few drinks. Obligatory to join the ceilidh. You will have a lot of fun and you will feel within the Scottish culture.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SK1Rd54749HqLWdusMq4dA"
  },
  "gb3gL9HmKLNm3V7e9tPJXw": {
    "date": "7/13/2013",
    "text": "We were anxious to only eat authentic British/Scotish foods while visiting Edinburgh. At one time, fish and chips were as popular as hamburgers in the USA .So I figured with limited time/meals at our disposal, go for the best.  I asked a Scotish tour guide for her recommendation and she said \"Ghillie Dhu.\" After eating here, I suspect a payoff was involved...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3Gggu-RGcvfKX3L3DRUQiQ",
        "caption": "Photo of Ghillie Dhu - Edinburgh, United Kingdom. Fish and chips, a pickled onion and...smashed peas",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3Gggu-RGcvfKX3L3DRUQiQ/o.jpg"
      }
    ],
    "user_id": "n9GaZ_kxv03a86UrRtm1LA"
  },
  "meEootfWcXQWOevDL7FFCg": {
    "date": "1/4/2015",
    "text": "Our regular steak & ale pub was out so we stopped in here for Sunday lunch. Their steak and ale pie was great. Two light eaters could share it. Its also a good place to nip in for a pint with friends. Its a pretty good sized pub. Bon Appetit!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_qBL5Wo9v2E-Bb4FbzgXGg",
        "caption": "Photo of Ghillie Dhu - Edinburgh, United Kingdom. Delicious Steak and Ale pie",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_qBL5Wo9v2E-Bb4FbzgXGg/o.jpg"
      },
      {
        "img_id": "ngLjkv-RiitgHhz7iqh10g",
        "caption": "Photo of Ghillie Dhu - Edinburgh, United Kingdom. Vegetable soup - nice on a cold Edinburgh afternoon",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ngLjkv-RiitgHhz7iqh10g/o.jpg"
      }
    ],
    "user_id": "PWaCUSVZMiXi91RO8c_e-g"
  },
  "WNzJvqxeKbhibGIpue8z6Q": {
    "date": "10/9/2012",
    "text": "The Ghillie Dhu meets all sorts of requirements for me.......Saturday night out, Wednesday night meal with Mum.....Sunday fry up.......all under one roof.  They have done so well since opening to cover a whole range of clientel in the guise of a Scottish bar, a weirdly novel idea!  The fry ups are gooood, the fish and chips are goood and the Saturday night band is gooood! All in all I am a huge fan of the GD.   Also worth mention is there Sunday night live music, they have some great regular acts that come in.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "rl4hqDnywPJDCK4wfbXMzg"
  },
  "hB-Fcq63tYzu-svevFqL3w": {
    "date": "10/22/2016",
    "text": "The Ghillie Dhu looks like a fancy place. I went there for Ceilidh which was good fun, but the prices are quite high and with lots of people it can happen you have to wait for quite a time until someones serves you.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tUdyuqlMqd9Vvs4UuT0gHQ"
  },
  "IOPk6rhGonogHbPYibG-DQ": {
    "date": "6/8/2016",
    "text": "We came for dinner after a recommendation from a local we spoke to and were interested in checking out the repurposed church. They have a nifty idea of using confession doors at the booth to deliver bar drinks and a light to use if you need a refill. Unfortunately, when we visited we kept getting swarmed by gnats. We counted about five that kept flying around our booth. I had the fish and chips. Like so many other places around town, the food was woefully under-seasoned. But on top of that, the batter on the fish was undercooked and doughy. The burger my husband ordered was overcooked and charred and the bun was extremely dry. He ended up eating it open faced to avoid the extra dry bun. The service wasn't much better. It was extremely slow and often times the servers seemed annoyed we even bothered them. The dessert was pretty good and the appetizer (though dripping in grease) was decent. The novelty of the location is nice for a drink maybe, but definitely not for the food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DAI-HFw7odNDZW9dRgZaDw",
        "caption": "Photo of Ghillie Dhu - Edinburgh, United Kingdom. Rillettes of lobster and roast smoke salmon with preserved lemon, remoulade, and tattie scone",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DAI-HFw7odNDZW9dRgZaDw/o.jpg"
      },
      {
        "img_id": "mN3atr60F47gyqW-WSYd9A",
        "caption": "Photo of Ghillie Dhu - Edinburgh, United Kingdom. Ghillie Ale battered single cut Haddock with hand it chips, Tatar sauce and mashed peas",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mN3atr60F47gyqW-WSYd9A/o.jpg"
      },
      {
        "img_id": "0NKl_ZPkXPiJ27P4uawdnw",
        "caption": "Photo of Ghillie Dhu - Edinburgh, United Kingdom. Grilled short rib and biscuit burger with tomato chutney and cheese on a brioche bun and fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0NKl_ZPkXPiJ27P4uawdnw/o.jpg"
      }
    ],
    "user_id": "BBtrTa6xxqwOIeBEehg8Pw"
  },
  "XySMWjJO6c-fwt3JxT8mlg": {
    "date": "7/29/2013",
    "text": "I wish I was writing a positive review for this place, as our fantastic LOCAL tour guide said it was a nice, local pub.  However, my husband and I were completely snubbed.  There were lots of empty tables and yet we sat and sat.  I finally went to the bar and asked the bartender (there were 3 staff hanging out there) if the kitchen was open and if we needed to order at the bar?  He said, \"no, I'll get someone to be right with you\".  Ten minutes later...we were still waiting when a decent enough looking couple sat at the table next to us and were immediately waited upon.  Huh?  OK, so I wasn't decked out as I had just returned from a 12 hour tour (dropping plenty of cash in this city and beyond), but I was clean and presentable, as was my husband, whose conference had just completed for the day.  We were flat out snubbed.  We'll be sure to let our fellow conference goers know it's not the place to leave our money.  I'm also going to catch our tour guide and let him know he shouldn't be recommending this place (I'll do that in a nice way, as I think he'll feel awful).  With 5 days left in this city, we were hoping to find a place that could be a meeting spot for our group.  Oh, and I'm a fabulous tipper, too.    Way to judge poorly, Ghillie Dhu.  UPDATE: I contacted the manager via website after our visit, simply to let them know of the poor service.  In their defense, he invited my husband and I back for a complimentary meal.  However, we opted to visit some other places with the time we had left.  I don't think I could have written an impartial review after our first visit.  I do, however, appreciate that they extended the offer and wanted to to try make it right.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "W4WWy7o0vy4mgeqtq0N1kg"
  },
  "dyJk5cGsPwBv9hcvikCbSg": {
    "date": "10/13/2013",
    "text": "hmm i think Ghillie Dhu is a bit of a mixed bag for me.  I've been here a handful of times and while each time it's been fine, i don't find that it stands out much compared to the other bars in this area.  on a friday night, i arrived after midnight with the girls looking for a wee boogie and some more drinks.  the bar downstairs was rather sparse, which surprised me because it was friday night!  we managed to easily grab a big round table to sit down at and order a round of drinks.  there was some live music, but this ended shortly after we arrived.  after a round of drinks a few of us headed upstairs to go for a dance.  while the actual space upstairs is seriously nice (very gothic and such) i felt like the whole disco was almost like a high school dance.  there was a good number of people, but loads of young boys (sorry maybe i'm getting old!!) which made me feel a bit out of place.  think there was loads of students as well, which just so is not my scene anymore!  my friends and i enjoyed a bit of a dance, but after finishing another round of drinks we decided it would be best to call it a night.  so A-OK is probably the best way i'd sum of Ghillie Dhu.  the drinks are reasonably priced and it's nice to be able to find a seat on a friday night, but i don't think this place is anything special really.  i'd probably look for some place next time i'm out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z_xbO-Iaxbx-ZRPhLJK-Ew"
  }
}