{
  "ND_X975_GKerRIXqMehObw": {
    "date": "3/7/2010",
    "text": "After reading all the good reviews here, I decided to try it. There is a vast selection of curries and you can see the chefs in the back preparing them. I must say the taste lived up to the reputation. I liked the fact that they don't used too much artificial colourings and the different curries taste and look different. If there is one suggestion I would make is for them to use less oil. It's by no means bad, but could be better.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oLQClp0j3Z4B2vKk1vIyDw"
  },
  "bA0xIALMdIVaXmMgWVj47A": {
    "date": "1/2/2009",
    "text": "Noor is my local Indian takeaway and I feel pretty lucky to have it there, for as Indian takeaway restaurants go this one is up there with the best. Long have I struggled with curry houses that serve food in generic 'curry' sauces that all taste the same and have 'meat' in with no real flavour. From Noor one very rarely gets this problem- I normally go for the Chicken Bhuna or Tikka Jalfrezi, or the Lamb Rogan Josht, and all have meat that tastes real, with sauces that contain actual chunks of vegetables. I must admit that once I tried a Chicken Tikka Jaipuri from here and it was reminiscent of lumps of chicken in tomato ketchup- not pleasant- but I cried and my flatmate shared her Bhuna with me [the portions are huge] and I got over it. The vegetable side dishes are really tasty, as are the sundries, and aside from the aforementioned Jaipuri incident of doom I have always enjoyed my meals from here and never had too dicky a tummy the next day which is always a concern. They also do online ordering which I like as I am a 21st century kind of girl and would order everything off of the internet if I could, including friends and cigarettes.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GbrjLXBt14r_5QxJh25U_Q"
  },
  "8M7DZhiY9mWO8YJQdqzhVg": {
    "date": "6/14/2008",
    "text": "I tried Chicken Bryani at Noor yesterday and it was out of this world. Portion was big and enough for two people. Staff is well dressed, clean and very welcoming. I am impressed. Highly recomended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nkl2UlX1DWQS78M8ytJf5w"
  },
  "c1mx03_r7-0Uh1gce4xF-Q": {
    "date": "3/27/2014",
    "text": "The food was tasty and good. We had the lamb rogan josh (highly recommended) and the chicken Madras with ginger naan (the only place I've found making this variety of naan) with onion bhaji, papadom and pilau rice. Service was fast, portions were big (the meal was meant for two but we were so full after a while that we kept the rest for breakfast the next day). If you're craving good Indian food where portions are generous and prices are okay, this is the place to go.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "tDbT_zMUsFvtMnQ44j64aQ"
  },
  "t0fFDSeUwf7F1rJTbCzKFw": {
    "date": "7/2/2010",
    "text": "Noor is definitely up there as one of my favourite takeaways. They serve really traditional and authentic Indian dishes which are of excellent quality.  Noor's menu has a vast selection of fine Indian food which are very well priced at around six pounds for a main meal and you can see the chef's preparing your meal in the back. I love their Chicken Tikka Buhna which is full of flavour and spices.  They also have met menu's available which include starters, a main and rice for just under seven pounds per person. They also have a wide variety of vegetarian meals which are priced at under five pounds for a main course.   Noor offer a home delivery service which I have always found to be extremely efficient and you can order either on-line, by phone, text or by popping into the shop itself. The food is cooked fresh on the premises and it only takes about 10 minutes after ordering for your food to be ready. They are open until midnight seven days a week so it is great place to stop buy for decent meal on your way back from a night out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cOqmyE2PzbTFQhI-T60EYA",
        "caption": "Photo of Noor Indian Takeaway - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cOqmyE2PzbTFQhI-T60EYA/o.jpg"
      }
    ],
    "user_id": "OdUSlS-S6qfZFnDUCKzwEg"
  },
  "1UoXaB1F3SK3G2W9Wnt4dw": {
    "date": "8/8/2011",
    "text": "Just discovered this place, extraordinarily good food and very friendly staff.  Even though it is a Take away, we sat at one of the tables and enjoyed our curries.  Highly recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XDA-O3hLLDiYJOX90dbV0Q"
  },
  "dfXw9NX9xLaYNth72kohJg": {
    "date": "7/24/2010",
    "text": "You simply cannot beat Noor Indian Takeaway.  The food is delicious enough to make you rejoice for being human and having the ability to appreciate such things.   Noor is located just a few doors down the road from my flat, and as such, I have quickly become a regular. My friends and I always get the set meals, which include a choice of \"golden oldies\" curries (all the classics such as Korma, Rogan Josh, Dopiaza, Madras, Bhuna and, my personal favourite, Dhansak) along with rice or naan, five vegetable pakoras along with some salad and sauces.  What more could you want? All for six to seven pounds per person, depending on how many of you there are.   The absolute beauty of Noor is that the food tastes great AND the portions are very generous.  One portion of curry usually lasts me for my tea that night as well as a very satisfying lunch the next day. As it provides at least two meals, it certainly offers great value for money.  The pakoras are wonderfully crispy also, and for an extra 2 you can order a bag of ten that are worth every penny.  Due to my close vicinity, I have always collected my orders in person and I have never been kept waiting for than 15 minutes. If you prefer it to be delivered to your door, they will do so for only 1, although I cannot comment on the speed of delivery.   Overall, if it's an Indian you're after, look no further, you have found something heavenly.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "XXqfjl1w2QolT4_r_XRiwA"
  },
  "qw-m7OTHZlz39sWS5VUNcg": {
    "date": "8/18/2010",
    "text": "Me and my mate ordered from Noor takeaway last Firday, I was advised from a couple of friends that it was a great place to go to and the reviews on here looked great too so I though that I would go for it. We ordered online, where we were able to choose the time for which we wanted it to be delivered and they were on time which was a good start. I ordered a chicken ceylon, which I had never had before and tasted a spicy korma, the only criticism of it that I could find was that there wasn't enough chicken although it was lovely and tender. The portions that you get are great and me and my friend couldn't finish it all so we put what we couldn't finish into the fridge and ate it the next day. We also ordered papadums and naans, and both were delicious, this is definitely one of the best curry restaurants in Edinburgh and the prices are pretty reasonable too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hutJzKEYHuVq6CP-XSARgg"
  },
  "xc-l8hBENaPb12iku7MNOQ": {
    "date": "6/4/2010",
    "text": "The food at Noor is pretty great - and as already explained by Emily T. the portions are perfect for if you want a guilt free pig out of delicious indian food in a one person banquet.  Anyway, the food here is great - if a little over priced in my opinion, especially in comparison to other indian take aways in the area. Dont write it off yet though - while other places are cheaper, they lack the authenticity and generaly very hight quality food that Noor offers.   Choose wisely.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SxV1Jq7UANuSYpn42JXvOA"
  },
  "yYfjYQsFXtj2ay6Pt4IKUQ": {
    "date": "11/9/2010",
    "text": "Noor is brilliant! The food is excellent, the staff are really friendly, and the prices are great. Top Tip - Set Meal for 1 will feed 2! Want Indian or Pakistani food, go to Noor!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BrHv3vgG6NpZRwKpF67SOA",
        "caption": "Photo of Noor Indian Takeaway - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BrHv3vgG6NpZRwKpF67SOA/o.jpg"
      }
    ],
    "user_id": "DprJbp9xeq1fSkSQI5S5LA"
  },
  "iLrPPa_aa956qtbLsm41yA": {
    "date": "5/2/2010",
    "text": "Not my favourite Indian takeaway, but Noor is definitely right up there with the Clay Oven.   There is a tremendous amount of choice in Noor's menu, but all of their old classics are recommended. It's also really cheap, and great value for money.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WLE_sZQm2k0yE1rmStp_Eg"
  },
  "dAA57exXsrHc7pyTnW1ESA": {
    "date": "7/5/2010",
    "text": "I stayed in Edinburgh a couple of years ago and discovered Noor's Chicken Shajani dish. It's the best curry I've ever had and whenever I go to an Indian restaurant I look out for it but haven't seen it anywhere else. Luckily I'm back in Edinburgh now so I know where I'll be heading when I want Indian food.   As other people have mentioned, the portions are a good size and the taste is amazing. The staff are also very friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PKRzxijUkVZ4Gg3jZZfTYg"
  },
  "kFtTQFWRGFqAKW0MV5RD_A": {
    "date": "6/4/2012",
    "text": "I really love it here  very cheap, the best meal deals, and certainly the best pakora in Edinburgh. The staff are extremely friendly and the curries are delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B-edcZUr01jugv_B29plDw"
  },
  "R4QyYfvEC2rMkZHgUcPLqQ": {
    "date": "6/4/2012",
    "text": "I really like it here - very cheap, the best meal deals, and certainly the best pakora in Edinburgh. The staff are extremely friendly and the curries are delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rW6Pkgi1MKI5MFXqHb6ycQ"
  },
  "UZDLwtR22IYKCo-8OFOtOA": {
    "date": "11/6/2007",
    "text": "I used to live around the corner from Noor, and we frequently ordered takeaway from the friendly bunch working there. Their naan bread is huge, and they offer the best onion bhaji's ever. Their food is a bit spicier than other places, which I prefer, but if you're sensitive they can tame the dishes for you.   Their menu is very extensive and prices are really cheap. For authentic Indian takeaway (even according to my Indian friends), Noor is the place you have been looking for.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SrUdc2DcFphyqk4X5CKbLA"
  },
  "-MqOhg5hrELx_Vo1KB65ZQ": {
    "date": "11/16/2007",
    "text": "Noor's food is genuinely genuine, and genuinely great. I just keep forgetting that the portions are quite so enormous, so my girlfriend and i still seem to order two of the menu deal, where one would probably feed the five thousand.   Their deliveries are generally swift too, so no need to order before you're even hungry, like so many places. I recomend most of the menu, but the last thing i ate was the saag aloo - honestly out of this world. Or at least out of this continent...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kQdRlZboAib-5TOy8_cRUA"
  },
  "aKAhPkQ0HQLdUzMu54IJxg": {
    "date": "7/14/2012",
    "text": "Though named Takeaway, there are three tables inside to eat at as well.  We tried the set meal for two and were very happy with the choices - all of the items were very tasty and fresh.  The only \"complaint\" we could have is that it was simply way too much food!  Very friendly staff and great food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "H-6DoAWlQYZs6f4iN1bnhQ"
  },
  "UC94hWLIVfc0QvaB3Nv0Pg": {
    "date": "4/8/2011",
    "text": "Dont judge a book by it's cover. It's not much from the outside but the Noor produces the most flavourful, aromatic curries. The quality is amazing and if you're looking for value for money it's the place to go and better than the surrounding Indian take outs. It's dishes are pretty spicey and even the mild dishes are pretty nippy. So it's not ideal for those who dislike spice. We recommend lamb bhuna!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YE3F5cZTR_xBGZC1VdRy2g"
  },
  "D4hNk8wxzn64q_NGV2oFCQ": {
    "date": "3/30/2013",
    "text": "Noor is a great option if you are after some tasty Indian food. I ordered the set meal for two, the Lamb dishes were both well cooked, nicely spiced and very tasty. The amount of food which arrived was more than advertised, myself and my flatmate struggled to finish it, which is unusual for us!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4ioroUS2FVggvon9N2fwNA"
  },
  "88BQRDrX8fBiuk-FQt8yow": {
    "date": "12/17/2007",
    "text": "One portion at Noor really is enough for two very hungry people! It's delicious, the service is good and they just keep filling your bag with free extras - watch out for the spicy onions though, my friend LOVES spice and always wolfs them down before remembering a stand-by fire-quenching glass of milk is necessary! Much to my amusement, of course...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WlEmCagvi8Oqf0vjtv21vw"
  },
  "ULJZZuU0XQZKRUcvIzNL8A": {
    "date": "4/28/2008",
    "text": "Best chicken korma in Edinburgh In my opinion anyway, i reckon i could drink a gallon of Noor's korma sauce in one go, its just so creamy and tasty I quite fancy one now actually! The prices are very good and the portions are huge! One chicken korma and pilau rice is enough for two people. The staff are nice and friendly, you really can't go wrong with Noor if you fancy a curry!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n0FSYxOyMgNZ8GFTP1pStw"
  },
  "BhHa4p3o-qIJyjstRwivBg": {
    "date": "11/22/2008",
    "text": "Another great Edinburgh indian. Their delivery service is particularly good and they do a great student discount on their already cheap prices. I'd reccommend the meal deal for one to feed at least two people!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QD0oHlPEgoeDrAeiNNPUUw"
  },
  "0HJVuYdfmdMqhIT_KRhpJQ": {
    "date": "5/29/2009",
    "text": "A great Indian take away. There are not any facilities for eating in here, just a sofa to sit on whilst waiting for your order.   They have a big menu, and the prices are really good. They also have a set menu for one which I normally get at around 6, and this is more than enough food for one person (there'll probably be some left over for breakfast!)   The food is cooked quickly and it only takes around 10 minutes after ordering until the food is ready.   The staff are friendly and the food is absolutely delicious.   They also offer a delivery service which is prompt and efficient.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8kWbwEqdgDjSogg56e6PnA"
  },
  "0Rl_fDBzt0-WgwfCH1NOoA": {
    "date": "5/30/2019",
    "text": "I've been traveling Europe for 3 weeks, and have made it my priority to sample Indian food in each country. This is by far my favorite Indian style food I've eaten in Edinburgh. I almost ate everything. The cook even came out to chat when I explained to the waitstaff of my journey. Would recommend for sure if you're into Indian style cuisine. Even if you're not...give this place a try. Reasonable pricing and great food. What more is there to ask for.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lwpv6ivDOlweHfdC_fAHTQ",
        "caption": "Photo of Noor Indian Takeaway - Edinburgh, United Kingdom. Punjabi Rice",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lwpv6ivDOlweHfdC_fAHTQ/o.jpg"
      },
      {
        "img_id": "ZFcdvz9Dv6bjHkO-FgqKbw",
        "caption": "Photo of Noor Indian Takeaway - Edinburgh, United Kingdom. Samosa",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZFcdvz9Dv6bjHkO-FgqKbw/o.jpg"
      },
      {
        "img_id": "r98VbzOdZU8mPUL920j60Q",
        "caption": "Photo of Noor Indian Takeaway - Edinburgh, United Kingdom. Garlic Naan",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/r98VbzOdZU8mPUL920j60Q/o.jpg"
      }
    ],
    "user_id": "Lnu4NXXQDFv1F66ZvXsW1g"
  },
  "KkR0UdfuJvhkA4cguTBo-w": {
    "date": "1/23/2019",
    "text": "I am usually not a fan of Indian food, but this restaurant completely changed my mind. I fell in love with their food. (Definitely get the garlic naan.)  The food is definitely prepared fresh and comes in large portions. I stuck with curries and saffron rice while some of my friends were more adventurous. Each dish left everyone satisfied and completely stuffed.  It is a charming restaurant that seems to predominantly get it's business from carry out. The actual dining area is relatively small, so not ideal for large groups. (We managed to fit 10 of us at one point.) Don't judge it by its outward appearance - it it a hidden gem.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1qNYmp8mKu1W_uyXb8_Wpw",
        "caption": "Photo of Noor Indian Takeaway - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1qNYmp8mKu1W_uyXb8_Wpw/o.jpg"
      }
    ],
    "user_id": "1tVuONXBVHiqgg1SjxkNvA"
  },
  "ncMc6YbsEL2UxsDKaLRmMQ": {
    "date": "11/24/2018",
    "text": "I'm no fan of Indian food, but Mrs. M loves it. No feeling like going out after a long day of tourism around Edinburgh I relented and we ordered delivery from Noor.   Ordered at 6:20 PM on a Saturday night and delivered in a reasonable 65 minutes, our food arrived hot and as ordered. It was delicious, good enough that this could make me look closer at Indian food.  Vegetable Pakora - enjoyed these! Bindi Bhaji - enjoyed this! Aubergine Bhaji - Amazing! Tikka Massala Chicken - Mrs. M reports \"Great!\" Shajani Chicken Tika - Amazing! The garlic Nan and Pilau Rice were very good too.  As I said I'm no Indian expert but I really enjoyed this meal. Mrs. M, who loves this stuff, liked this enough to have seconds before we put the leftovers away.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v-RoKqtrHeerEtaeIWTXcQ"
  },
  "umlVOyc3CCj_wJyaSLpWog": {
    "date": "10/24/2016",
    "text": "We ordered carry out BIG MISTAKE the food arrived cold and was the onion bhaji was refried  and at least a day old swimming in fat the only palatable item in our order was the bottle of Iron Brew  DO Not order food to go and repeat our mistake",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E87Rdmc-AzPOtZhG3QG_uw"
  },
  "DLZ_mmFwgC1x_wmOjIJEaQ": {
    "date": "11/29/2015",
    "text": "I ordered delivery here for friends one day. It came quite quickly and piping hot. Probably because it was a week day.   The food was great. Delicious sit in quality for much less. It was though a bit pricey for delivery but it was tons of food. I was absolutely stuffed and one of the best Indian restaurants I ever had.   So a huge recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "eN2pCfT17EGokP9UWnoZUA"
  },
  "rBP1Y2VnZe2W9FC4qmvLKQ": {
    "date": "8/19/2015",
    "text": "Noor is without a doubt the best Indian takeaway in Edinburgh. I discovered it while a student & have continued to be a regular customer for over three years.  The combination of great quality food (I love their Chicken Korma), very reasonable prices (with some great deals), & huge serving sizes makes it a real winner.  I've never been to the actual restaurant but the online ordering system & delivery service are both very efficient.   Overall, a top notch takeaway!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0l9OanUo7tnqBfLCzpw1Dw"
  },
  "Q-VeWy-CzjF_454mWjaQqQ": {
    "date": "8/30/2017",
    "text": "I ordered delivery last minute and they were so kind and accommodating on the phone. Fast delivery as well! Thank you Noor Indian for the lovely customer service! Xoxo",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KNq7pVRGdB--BUzb_co-Og"
  },
  "28qbA5EOIG4Z30LIcwq2_A": {
    "date": "4/11/2013",
    "text": "This is a very tasty and convenient option for Indian takeaway in Edinburgh. You can order online and get it straight to your door for a reasonable price and very quickly. They stay open quite late, too.  The portions were all large. All of their varieties of nan were especially tasty, although also huge. Yum.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MQTF8C-3xd5tcTAwPPXZyQ"
  },
  "W4giBLjmxfFhdKNNgx19xQ": {
    "date": "9/27/2016",
    "text": "Came by got dinner to go one day. The service is good (took about 15 mins) and set dinner is a great value. Surprised there is no indian pickles but the pickled onions are very good. For the curry I got (I think it is called north india special) it is more like a 3 star. It appears to be the spiciest item on the menu (with 3 chills next to it) but I cannot taste the spice (It just taste sweet to me). I like my food very spicy and this is just not what i expected. But objectively speaking the curry is delicious and makes great dinner for cold weather.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XRG-ptGAkSVEwZL0ehHP4w"
  },
  "XiIft853Xv14MT2Hpq9jgw": {
    "date": "1/3/2014",
    "text": "Noor is in my opinion, the best Indian take away EVER! I was a regular here when I was in Edinburgh - first for the good price but they I realised how delicious the food was!  I always recommend it to friends travelling through as well!   The portions and amount of condiments are generous and the ceylon curry is my absolute favourite. I eat here every time I'm back in Edinburgh and always find it just as amazing as before!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "PD3-yRfF3dji_wpZ-AaNGg"
  },
  "7CdAWJyiNC-Qkd02mJjG6Q": {
    "date": "2/15/2014",
    "text": "I don't often give 5 stars, however Noor has earned them. This is my go to takeaway when it comes to curry, the only better curry is from Kismot (which is a restaurant) IMO. Not only is it great curry, it is great value as the portions, particularly with the set meal, are large. I have worked my way through half the menu and am yet to find a curry which isn't fresh and tasty...  I have even bought the set meal for two occasionally, so I can eat curry for two days as the food easily tastes as good re-heated the next day. The chicken madras, vindaloo or hurri mirchi are my favourites however this is one of the few places I have enjoyed the milder creamier curries from.  In short if you fancy an Indian takeaway then Noor is highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "GN3wBXDaLLmY6Oitfy3T8g"
  },
  "Vxim3aXxBLHVHYMcMVHMvw": {
    "date": "7/24/2015",
    "text": "My partner and I love Noor. The food is delicious and their service is great. Spices are used in the foods are amazing. Sag panir and Pishvari naan are my favourites. Strongly recommended!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "XHGsOuR7cqII7-QHEK_31g"
  },
  "kNKutqMAh3mT5KQvaS_81Q": {
    "date": "3/27/2013",
    "text": "This is now my favourite take away and has overtaken the mighty kasbah for me. I left this a while before reviewing as I often ended up in here on the wrong side of a night out and everything is great when you are half cut. Food goggles I guess ha :D .... Anyway fast forward a few months and I have popped in here a half dozen times or so and the food is consistently amazing. The staff are really fiendly and the delivery service is quick. The restaurants decor is functional and the seating area is quite comfy with some leather sofas or an area to sit in and dine. Often while waiting we recieve complimentary poppadoms and pickles while we wait.   There are a few stand out curries on the menu for me from what I have tried - Sabzi Chilli Dal, Hurri Mirchi Vegetables and the Vegetable Persian were great and get reordered each time we go. The veg pakoras are worth a mention in that they are great quality and there are loads of them, also served in a brown paper bag (first time i had pakora it was presented this way so in my head its how they should be served). Lastly try the Roti Boti, tandoori chicken wrapped in roti bread. These are amazing!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "PQq5JGWvr0u_IKDXZyDAgA"
  },
  "v8I8f0tQI9eqRJe8doo1tw": {
    "date": "8/31/2015",
    "text": "Does not honor allergy requests when they've explicitly said they would, and you find it after you've paid and they deliver.  Ordered three times from this restaurant. We were clear we had medically-ordered dietary restrictions and wouldn't be able to have the food if they couldn't preparer accordingly. We were ok leaving if they couldn't. We just needed to know.  First time, ordered saag paneer. No problem. Dietary restrictions were respected. Dish was overly spicy when we had asked for mild (too much what seemed to be pepper) and not the best Indian we had, but that's ok. At least, they had respected dietary needs.  Second time, we ordered four dishes. Two of of them did not respect dietary restrictions. Saag was oiler than the day before (a bad thing) and not at spicy (a good thing). We thought we couldn't trust them that much but at least the saag paneer could be repeated.  Third time: ordered two orders of saag paneer because they wouldn't honor just one for delivery. They said they knew me and could prepare order as requested, but dietary needs were this time not respected at all. We had to throw food in the rubbish causing a significant waste of money.  Service is nice, but if they do not honor special dietary needs and you find out after you've opened your dish, what's the point? Do not recommend.  <a href=\"/redir?url=http%3A%2F%2Fwww.tripadvisor.co.uk%2FShowUserReviews-g186525-d5817705-r304835124-Noor-Edinburgh_Scotland.html&s=dd872bb2f192b7e0061639fd414b6bde00e2e414a99de81305e0f19641cd79df\" target=\"_blank\" rel=\"nofollow\">tripadvisor.co.uk/ShowUs...</a>",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hDEENk4fjAc2rMtLqI5e4g"
  },
  "SU4rRKzmSZrdKodey0hueQ": {
    "date": "9/23/2012",
    "text": "My new favorite takeaway.  We've lived on the the southside of Edinburgh for nearly two years and somehow had overlooked Noor.  Our loss!  Noor provides an outstanding product, with good customer service, at very reasonable prices.  Saag paneer is my very fave curry, so that's how I judge most Indian places.  Their's is superb -- just spicy enough and the spinach not pureed.   Great pakora and naan.  The chicken korma is very mild.  Working our way through  the menu.  On the last visit I had placed a large order that was not ready when I arrived to collect it.  A tech glitch had prevented the order from being uploaded and I had to wait about 20-30 minutes.  Without asking, 20% was deducted from the total and a 2 litre of coke added.  Very thoughtful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "gh1qaF_Kcd357CZU3j9nRA"
  },
  "7WpkVSz7l-RYRdBPn-2bmw": {
    "date": "6/30/2010",
    "text": "Noor is totally deserving of my first 5 star review, and you'll now see why.  Whenever I want an Indian takeaway, there is only one word on my lips - Noor.  For the past few years, it has stood out for me as a purveyor of some of Edinburgh's finest takeaway food.  I totally agree with what Jonathan said: there are cheaper places, but they don't quite measure up.  All of the food I have ordered from Noor has been top notch.  I tend to go for the less spicy end of the spectrum, so stick with kormas and bhunas, occasionally stepping up to a tikka masala or rogan josh.  All of the food has been tasty and flavoursome, something which can be lacking in some takeaways.  The menu has a good variety, and the online ordering service means that you don't even have to leave the comfort of your sofa.  Delivery has always been on time, and the food has been piping hot.  It's so difficult to communicate the warm feeling that Noor gives in my stomach (before eating!).  Even the mention of a Noor curry starts the saliva production.  I command everyone to enjoy the awesomeness that is Noor!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WAbvUb51JwnX5wTqMgR5Mg",
        "caption": "Photo of Noor Indian Takeaway - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WAbvUb51JwnX5wTqMgR5Mg/o.jpg"
      }
    ],
    "user_id": "v_lWueG7V_vul4E8rCEdjQ"
  },
  "znrByIaww0ZtIxX_dXLqvA": {
    "date": "12/14/2012",
    "text": "I love Noor! The chicken Shajani is the best curry I have ever had and I used to go in there at least once per week. Unfortunately, I am no longer in Edinburgh so I can not get my Noor fix. I have been searching for something even half as good as their Shajani but I've not been successful in my search so far. I kind of wish I had never found this place but I guess it's better to have loved and lost than to have never loved, or something like that...  The portion sizes are good, the staff are friendly and the food is really tasty!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ynJM_xXreXrYpyYhAv8y_g"
  },
  "OPIJg03PaBMHl6uPxNh4og": {
    "date": "6/2/2010",
    "text": "As a student living alone, I get take-aways regularly. Then I get annoyed because my bum isn't getting any smaller. Probably something to do with the take-aways that I don't stop eating until a)It's finished and b) i feel sick.  But Noor seem to have the solution! Their portions are quite small - perfect for one person! When I first got food from here (Chicken Korma, really creamy and delicious) I was kind of disappointed by what seemed like little amount of food I was given, but turns out it was perfect!!  They have a really extensive menu, it all looks delicious. I'm a spice pussy though, so I don't tend to go for the spice, but I'm told it's really good too!  They deliver too, which is great. They are even part of <a href=\"/redir?url=http%3A%2F%2Fjust-eat.co.uk&s=2caf34c647f904d4e89c528adf9937ec991854875dadc3edd89a9e10f0acd87e\" target=\"_blank\" rel=\"nofollow\">just-eat.co.uk</a> so you don't even have to pick up the phone, order online!  I really like Noor!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5AnUKg1RRFD4I9GtQ6bcWw",
        "caption": "Photo of Noor Indian Takeaway - Edinburgh, United Kingdom. Courtesy of Website",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5AnUKg1RRFD4I9GtQ6bcWw/o.jpg"
      },
      {
        "img_id": "3fBzYbT50BFLbcGALdDRZw",
        "caption": "Photo of Noor Indian Takeaway - Edinburgh, United Kingdom. Courtesy of Website",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3fBzYbT50BFLbcGALdDRZw/o.jpg"
      }
    ],
    "user_id": "o0WGr8L3BWfH2Bslpnqw6g"
  },
  "9hqK1cVNxN5NYKZCFhTNxg": {
    "date": "8/5/2010",
    "text": "Noor was my Indian of choice for the first two years of my uni life, and while now I will occasionally stray from it, I'll always end up crawling back. The curries are huge, well cooked and really cheap. Although they are arguably not as sophisticated as many other curry houses, they still make a mean Dopiaza and friends.  Found on Nicholson street it clearly caters to students and the prices reflect this. You can get a meal deal with a curry and rice or nan for 6.95, and one will more than fill all but but the fattest of fatties. As well as this they and a la carte menu, with all the normal curries and a few specialities. The sauces are great, really creamy and rich without being over the top. All the traditional curries are done exceptionally, and whilst I am yet to sample their specialities I look forward to it.   They also do all the sides you could want, with a variety of nan breads, and pakoras, bhajis, samosas etc for vvery reasonable prices. The staff are really nice, and the service is very quick; combine this with excellent food and that's a winner in my book.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gKysbu4G43incbc51t9spg",
        "caption": "Photo of Noor Indian Takeaway - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gKysbu4G43incbc51t9spg/o.jpg"
      }
    ],
    "user_id": "Ga9DnmdmhE0Zzs_jRtmrfA"
  },
  "gSPOKT26i1iZ_Sb5GS77cg": {
    "date": "7/14/2010",
    "text": "Noor is an excellent Indian takeaway which offers quick, friendly service and excellent food.  I've eaten from here twice with my flatmates and on both occassions we were far from disappointed.  The menu is extensive with a huge range of authentic Indian dishes taken from all over the country.  I had the lamb Rogan Josh the first time and it was amazing with a delicious blend of flavours and a good amount of heat running through it.  The portion size wasn't huge, but certainly hit the spot. We delivered the second time and I went for the Tandoori chicken kebabs which were seriously spicy, yet also tender.  The delivery time was almost negligible it was so fast and the whole meal between four of us came to under 40.  I'd definitely recommend Noor if you're in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zOHDxR8wt8W8RCOWn9koxA",
        "caption": "Photo of Noor Indian Takeaway - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zOHDxR8wt8W8RCOWn9koxA/o.jpg"
      }
    ],
    "user_id": "yfXqZkU5iXE07GSHzdsQBA"
  }
}