{
  "J0cSBcBLmjjzuHyHKiCa9g": {
    "date": "3/29/2014",
    "text": "Scorring Broughton Street for a cheap bite to eat on a Saturday at lunch time is no easy task.  We just wanted something quick and easy to eat - basically a sandwich.  We came across this place and decided to sit in.  My OH made a comment about the high stools on many circumstances I struggle with because my height and the comfort issue!  These stools were comfortable and I was able not to fall of them.  I opted to have one of the pre-made panino - mozzerella, sugo and meatballs.  It was tasty and filling but lacked seasoning - a little more herb and pepper wouldn't go a miss.  I added pepeer from a sachet and it did seem to help but only just.  The OH half a roll made up of salami, blue cheese, lettuce and tomato and seem to enjoy it.  Tasty sandwiches at the regular deli price.  Staff were nice and brought out my panino when it had been toasted.  Just under 10 for two rolls and drinks it seemed reasonable for a quick bite for two.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BhYROfCjIJsKUk22_IVHig"
  },
  "IExAKHAYkxtvItIUtaj5Pw": {
    "date": "2/21/2015",
    "text": "I was in New Town doing some food shopping and decided to stop by the New Town Deli for some lunch. I had the toasted vegetarian wrap (4) (falafel, hummus, roasted peppers). It was alright - reasonably tasty but nothing spectacular. It did fill the gap though and I was happy to have tried this place.  They also do soups, smoothies, sandwiches - a good selection overall but with a slightly higher price tag perhaps.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "dbk3eONuuCUMzWDfUBeYfg",
        "caption": "Photo of New Town Deli - Edinburgh, United Kingdom. toasted falafel wrap",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dbk3eONuuCUMzWDfUBeYfg/o.jpg"
      }
    ],
    "user_id": "yuFHrb8YQtVuzu0eEXvJtA"
  },
  "9urbxeBbZtKiqO4A6YSIhg": {
    "date": "5/4/2012",
    "text": "Uptown girl, that's how I feel when lunching at New Town Deli - it's more upmarket than your traditional sandwich shop... but oh, so much more tasty!    Food is delicious, they obviously use high quality ingredients, and wide selection of goodies. Their smoothies are really good - though not at Hula's level...   What I like about this wee spot is how bright it is, if there is 1 thing I love it's light (probably because Scotland is so dark a lot of the time!) - nice big windows, and a really cool big wooden table in the middle so you can lunch & make friends!  Outdoor seating for those days when the sun is out.  Always playing good music, and today seeing as it is Friday they have it nice and loud... (but not too loud for those more sensitive eardrums)  Def worth checking out if you are after a quick bite, bit too cramped if you are wanting a more leisurely sunday brunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GnFsut1uTm5CXxmCLve5gA"
  },
  "48FRCdl_uhexAfmkEWBihw": {
    "date": "12/14/2011",
    "text": "The New Town Deli offers excellent soup and good quality sandwiches, but at a price.  Overall, we said: \"we'd heartily recommend the New Town Deli to you. It is more expensive than its neighbours, but the quality is very high. We'd think of this more as a \"one-in-a-while\" place, as it's a considerable treat for your palette, but we can imagine how others would get very attached to regularly sampling from its pleasing selection of goodness.\"",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LURC3E0DoXYgN9aYTF3XOg"
  },
  "P8O9USG_nrrUkjAc-s0-_g": {
    "date": "8/4/2010",
    "text": "I thought I was going to be on for a coveted first review of this place but Terry's nicked the prize from under my nose. His review is pretty much spot on, it's alright but not as good as you'd think it would be, given an upmarket location and fairly high prices.  Like much of Broughton Street, it takes itself a bit too seriously and feels like it's trying too hard to fit in with the general ambiance. The minimalist nature of the place coupled with the ear splittingly dull acid-jazz soundtrack may impress some, but it left me cold.  The ciabatta was alright, but it's hard to mess up a chorizo and mozzarella sarnie, and in a city where lunch-based voyages of discovery seem neverending, it's not one of the best.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "xXQTdJXPGOP-NUYctcQw8g"
  },
  "tlclm0Ok5Jg1n-XAFiRsyw": {
    "date": "9/30/2010",
    "text": "In the hunt for some free Wifi I happened upon the New Town Deli.  Not because it has free Wifi, but because I was about to pass out from hunger and needed to eat post-haste.    It's a pretty standard deli - sandwiches, crisps, paninis, salads - not really much I can say that stood out as particularly exciting.  It's mostly takeaway service, with a few seats available along the counters at the windows.  It's definitely the type of place that has it's regular crowd.  I tried to read the menu over, but the girl behind the counter kept asking what I wanted...feeling the pressure of the other customers, I just grabbed an egg mayo roll (2.60) from the cold counter.    The chat I overheard while pretending to read the paper was amazing, though.  Guy, probably early 30s: looking to be set up by a friend of his. Girl, about the same age: went on at length about how women who are 30 and haven't settled down yet are 'quite sad' and are so baby desperate that no one will date them anyways.  Luckily for everyone involved, she had married early.  As a non-baby-desperate, nearing 30 young woman, I found this all a bit hilarious.  If also a bit disconcerting.  The guy was quite cute, though, I may be back to suggest we mate...oops, I mean date.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vd33nGvaqenjCLvxntw27g"
  },
  "y5lonbrWxH4X8zTPnQ6Xyw": {
    "date": "9/30/2010",
    "text": "I don't *think* my negative view of this place is being coloured by just how hungover I was when I went here, but I guess it could be the case...  I stopped by here a few weeks ago when I felt I needed to fill my belly with a bread encrusted substance or I wouldn't be able to go on.    First of all, the customer is meant to select their bread and hand it to someone behind the counter to make the sandwich.  Whereas this sounds like a reasonable idea, I couldn't help but think of just how many people had touched my bread before I selected it.  I don't really know what's wrong with keeping the bread behind the counter and having the workers get it themselves...  Second, whenever I order a hot sandwich I continue to be surprised when that means that the fillings are heated in the microwave.  I know I should really see this coming, but I seem to be forgetful.  When I order \"flame grilled chicken with a spicy tomato salsa\" I don't expect that the \"flame\" is coming from the microwave.  Microwaved chicken is rubbery and gross and does not belong in a deli trying to pass itself off as upmarket.    My sandwich was little pieces of diced chicken microwaved in some sauce and put on bread.  That was it.  I know that it was technically what I ordered so I shouldn't complain that much, it was just so... blah.  Plus, when I picked it up to take a bite half of the little pieces fell out onto my plate, and that was just annoying.  All in all, one star for being not cheap enough for what it was, and leaving my hangover belly even more unhappy than it was before lunch.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4UQfst9jve4GCSfWpWn2uA"
  },
  "Js0XSH1nIBFmqYciWbtEQA": {
    "date": "8/27/2010",
    "text": "Well the question on everybody's lips: Where is this place and what kind of a business establishment is it?! Come on guys, you can come up with a better name than that.  As for the food, it's all pretty standard fare. Given that it's in New Town the bread is usually ciabatta  or foccacia, but that's OK I suppose. There's nothing wrong with this place but there's nothing that great about it either. Hence the 3*. Just feels like it's trying a bit hard. It's OK for a quick lunch but if you're on the wrong side of town don't bother making the trip.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U5XTWZj3Pgf730kOmL6qyA"
  },
  "sosBrGpwdqTcEZ-srxinxg": {
    "date": "8/3/2010",
    "text": "Situated in New Town, the shops name is pretty unoriginal but it does provide a pretty decent place to get some lunch. It was formally called the Globe Deli and they offer pretty much the same range of sandwiches, paninis, baguettes and rolls that they used to. The prices are however quite expensive and I generally tend to venture elsewhere for my lunch. There are a good range of pre-made rolls and there is always a filling you can choose that will pick your fancy. However, considering that the rolls aren't that big, it will set you back 2.75 for a cheese and tomato sandwich, which is a bit hefty, but this I suppose is to be expected in this area of town. I came in here at lunchtime earlier in the year and it was pretty busy and the service was quite slow. There are a few areas in the deli where you can sit, but most, like myself, tend to get it to takeaway, which is a shame because it actually did look pretty cosy inside.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dY1pkINdb1qHn6NScmID9g",
        "caption": "Photo of New Town Deli - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dY1pkINdb1qHn6NScmID9g/o.jpg"
      }
    ],
    "user_id": "hutJzKEYHuVq6CP-XSARgg"
  },
  "oTLVlS_jMjIyG2awx7lH-g": {
    "date": "2/3/2009",
    "text": "Handmade sandwiches and paninis. you choose what goes into them so if you don't like it whose fault is it anyway. Good coffee and lovely staff. Just a great sandwich bar/cafe. They are all over edinburgh so a lot of people love thier product as do i",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0CptBiovyRGXJDQxKL-aww"
  }
}