{
  "2vAZkm7GlqBHRyhv86BekA": {
    "date": "2/16/2015",
    "text": "Finally a day off with nothing planned and we remembered about trying out Civerinos. Off we set for a wander round town to end up at Civerinos for some half way sustenance.  On entering we were greet by some very friendly staff members, who instructed us they are cash only. I use my card for everything so hey ho off to the cash machine first. On my return I noted that the shop has great light from the large glass windows that make the place seem airy, and the stylish decor really helps give the place a very unique feel.   Drinks ordered, Italian Cider for the better half and a diet coke for me. Coke comes in a glass bottle bonus, and the cider was given the nod of approval. We ordered starters and slices.   The food arrived promptly and lots of contaminants appeared. I clocked the portion size for the starter and was surprised at the price point. The deep fried cheese starter was tiny. Okay I guess it not always about portion size and on my first bite there was hardly any cheese and the shell was burnt. The next 2 were inedible due to them having no cheese in them and all you are eating is burnt batter.....urrrghh! We both had the same experience. For 4.50 each we expected a little better. The pizza slice was nice and reminded me of pizza from Rome with a little more parmesan it also started tasting similar. Nothing great on the pizza just good I guess.   Overall it's okay, almost there in many ways it all seemed a little expensive for what it is. The starters were bad and the drinks expensive, but nice. Staff were excellent... and the pizza pretty good.  I will be back just not rushing back.  Plus points - nice pizza slice - decor is great - friendly staff - Italian cider  Minus points - the pricing of the starters - the starter itself, there was no cheese in the cheese starter - the pricing of a bottle of juice - no card machine - I was hungry 15 minutes later",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "PQq5JGWvr0u_IKDXZyDAgA"
  },
  "oGdGB-WCEvu-95-oUDK3WQ": {
    "date": "3/16/2016",
    "text": "The pizzas in this place are huge! We made the mistake of getting one each! The staff are adorable and the starters are delicious! The restaurant is also very spacious so it's a welcoming place out of the rain. We ordered the four cheese which was yum, but the vegan meat is murder wasn't so good",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "D1EViC7SZOjqSv6hyqqI4w",
        "caption": "Photo of Civerinos - Edinburgh, Midlothian, United Kingdom. Four cheese pizza  and meat is murder",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/D1EViC7SZOjqSv6hyqqI4w/o.jpg"
      }
    ],
    "user_id": "P89uw9XBEkKulDg8puibNg"
  },
  "FaiJgxi1jXljlr3ilG2aLg": {
    "date": "3/30/2016",
    "text": "Neapolitan street food place with bench seating indoors and out. Decent pizza - big and reasonably authentic Italian style (no wood oven?). Margarita slice to go 4 (generous 1/3 of a pizza size). Selection of pastas with fresh Ragu etc. Penne Carbonara we had was OK.  I wasn't mad keen on service - found it a bit brusque and felt my custom was being taken for granted. TBF absolutely not looking for obsequious singing Italian waiters but still could do with a bit more of a welcome. Turns into more of a bar in the evening.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9y8q3wSNJKkk3zDj67w1WA"
  },
  "C5FsEGaNtZaE3szSXIVQDQ": {
    "date": "3/28/2016",
    "text": "I went here after work on a Friday night, it was busy, but we managed to get a table. The service is quick and nice, wine runs about 4 a glass, and beer is around the same. They have a large menu with many options - including a vegan pizza for those interested. I ordered the vegetarian roasted veggie pizza, which was 13 (to share with a friend) and the calamari 6. The pizza was a good size and tasted nice, the only fault being that it was soggy in the middle! It could have been cooked longer, but the toppings were nice and the crust was very tasty, a good sized pizza and not too thick. The calamari was amazing, crisp, smaller pieces, very well cooked and tasty. Overall I'd say, a good stop for a bit - nice interior, newer and very hip, long bench style community seating, fair prices and good service. Good location as well. They offer desserts, but I didn't have room!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dPA1RBX8-pF54IQGvwpyRA"
  },
  "icgl4AeCW3dkWPlObKnDfw": {
    "date": "12/25/2015",
    "text": "Was really looking forward to trying the pizza from here after the reviewed and pictures. We had tickets for the light show just around the corner so was very handy too. The place has a cool vibe, good music and decor. The staff are really friendly and welcoming, couldn't fault them at all. The food was nice but not wow. They only had one portion of meatballs left which turned out to be half a portion (which they asked me if I still wanted them @ half price) and then I didn't get mine until the other had finished their started so they kindly took them off the bill. Pizzas are huge, one between two would have been enough as we had a lot left. It would be good to do different sized pizza instead of the standard size or a slice. We all liked the pizza but wouldn't say it was the best we have had and was a bit salty. The fries are lovely and you get a big bowl to share. We took our leftover pizza away which was basically a full pizza between the three pizzas we got and have it to a homeless man. Hopefully he had a warm full belly for Xmas eve. I would recommend but wouldn't rush back, really loved the staff and relaxed vibe.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pxspA49jdI2Z9RD_UD1A_A"
  },
  "4vEtdNkQQgymtGgvKF5GFg": {
    "date": "7/11/2019",
    "text": "Great great pizza. Crispy with a wonderful sauce. I loved the spicy Italian sausage pizza. We did not care for the pasta but the pizza was great. The service was extremely slow but that might be an Edinburgh thing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RN5lwE44Ya26JQFITuo8RQ"
  },
  "ZB8BcZtVIqmy-gK67GTLpQ": {
    "date": "7/31/2019",
    "text": "Got the Civerinos slice. It was okay, but quite literally had a pool of grease on it. Server was nice and fast and the portion was big but I wouldn't hurry back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3GUeDU9t2-tyWQa--4PQfA"
  },
  "F6JLw6TUXdpSLwocMjF1ew": {
    "date": "5/4/2018",
    "text": "Ate our first dinner in Edinburgh here.  The pizza was among the best I've ever had. Highly recommended! I had the four cheese. Service was great and prices were reasonable as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oiFsSnLmvsqmH8mkcUHbFg",
        "caption": "Photo of Civerinos - Edinburgh, Midlothian, United Kingdom. Four cheese ppizza - delish!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oiFsSnLmvsqmH8mkcUHbFg/o.jpg"
      }
    ],
    "user_id": "3zlOpHC-59y_L895SiSahw"
  },
  "_bNW3z0gPFCZ4NAvbwtBHQ": {
    "date": "8/6/2018",
    "text": "Our go to spot for pizza in Edinburgh! Great casual vibe, tasty negronis, and delicious pizza.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8b5H6tG1riOQw2mEVrO--A"
  },
  "0A9S_PNA2txtcvE-UsO78w": {
    "date": "11/20/2017",
    "text": "I do a lot of restaurant research before I visit a city, and I'd been looking forward to a pizza at Civerinos for months... as in, four or five months. It didn't disappoint.   I travel alone for both work and pleasure pretty frequently, but dining out solo (for dinner) still makes me a little nervous. Lucky for me, Civerinos has a take away option. I stopped in around 8pm on a Monday night, and was immediately greeted by a friendly face behind the counter. I verified that take away was available, and tried to decide on two slices - turns out slices are only available at their other location, but no worries - my airbnb has a microwave. Let's do a full pizza. I went with the Hot Hot Sausage, and it was wonderful. The sausage and all the veg were incredibly fresh, and the crust was perfectly cooked.   Every staff member I encountered was friendly and the food was wonderful - couldn't be happier. Thanks for making a solo traveler feel welcome, and thanks for the awesome pizza, Civ!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DeMB9AsAoUMskzRStGnZmg"
  },
  "WI8f9Ku-MC-PQKYKKM14-g": {
    "date": "2/18/2019",
    "text": "Lovely unassuming atmosphere. Fun ! Intimate and casual vibe! Authentic flavors. Loved how they cracked a fresh egg on the carbonara",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3yrV8QgCuS14J7HuYdPIxg"
  },
  "TfdX6MFjYn6Fn3xWj4M-WQ": {
    "date": "12/5/2016",
    "text": "Best vegan pizza ever  Even my very non vegan meet loving boyfriend was in love with my pizza!  I even came twice in two days to try my way through the sides which all were incredibly delicious.  My bf who had the chorizo pizza was verrry happy here...  honestly can't wait to get back to Edinburgh to eat more pizza here",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_Y1_3ns-FcV-Aw9vi9duTQ",
        "caption": "Photo of Civerinos - Edinburgh, Midlothian, United Kingdom. A super delicious (and vegan) &amp;#39;meat is murder&amp;#39; On the side zucchini fritters",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_Y1_3ns-FcV-Aw9vi9duTQ/o.jpg"
      },
      {
        "img_id": "uiq0pXsOnKIHJQUgMiQxNw",
        "caption": "Photo of Civerinos - Edinburgh, Midlothian, United Kingdom. Great interior",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uiq0pXsOnKIHJQUgMiQxNw/o.jpg"
      }
    ],
    "user_id": "L92WKloeYNCFHsUkhbnb2A"
  },
  "uD6pKWSrwgTx83k63OiBoQ": {
    "date": "7/29/2016",
    "text": "Civerinos is awesome !! It's one of the coolest looking places I've been in, with brick walls, tiles, wooden benches and pressed tin ceilings   The service was friendly and they have free bread sticks.  The vegan Meat Is Murder pizza was delicious, great thin base, lots of yummy onions. It would have been even better with a bit of tomato sauce or fresh tomatoes.  Apparently the Hot Hot Sausage pizza was amazing too. The only not awesome thing was that It's just a little bit expensive, All the pizzas were 14.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "EJKE_AB7EMBDCqFDy__Y8w",
        "caption": "Photo of Civerinos - Edinburgh, Midlothian, United Kingdom. Menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EJKE_AB7EMBDCqFDy__Y8w/o.jpg"
      },
      {
        "img_id": "rlr-_bYxXG1oNpEzeol9eQ",
        "caption": "Photo of Civerinos - Edinburgh, Midlothian, United Kingdom. Cider",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rlr-_bYxXG1oNpEzeol9eQ/o.jpg"
      },
      {
        "img_id": "BCYDEWJNlVGPdMoWyqvzWg",
        "caption": "Photo of Civerinos - Edinburgh, Midlothian, United Kingdom. Meat is murder pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BCYDEWJNlVGPdMoWyqvzWg/o.jpg"
      }
    ],
    "user_id": "VHzJ_vOA-IOVX_4CoL7SLg"
  },
  "QUQtf044n-7ygAFuAbPD_g": {
    "date": "4/25/2016",
    "text": "I've been to NYC twice in the last 10 months. I'm not gonna lie, one of the reasons I went back was solely for NY style pizza. I love it. I can't get enough of it and there is just nowhere like it in Edinburgh. Most of the deluxe pizza places stick with the more traditional Italian style.   Civerinos is no different. It does a pretty good job and making a good pizza although it is pretty damn pricey. 15 for a four cheese pizza is quite a lot of money when you think about it. They have a kickass royal mile location and their rent must be sky high but 15 quid is just to much for a pizza.   They're also doing nothing particularly special. The pizza is good but it's just that. There's a number of other pizza places in the city cooking the exact same style of pizza, at a similar price point and it tastes just as good as each other.   I'd recommend you pop in if you're passing by but it's not worth a special trip.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xdcfCygUiCyR28hNrE8Xeg",
        "caption": "Photo of Civerinos - Edinburgh, Midlothian, United Kingdom. Four cheese feast.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xdcfCygUiCyR28hNrE8Xeg/o.jpg"
      },
      {
        "img_id": "vMbSVAueITDycJw0NgCorQ",
        "caption": "Photo of Civerinos - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vMbSVAueITDycJw0NgCorQ/o.jpg"
      },
      {
        "img_id": "LMcgz4BzqoYYjIaG2LrgcA",
        "caption": "Photo of Civerinos - Edinburgh, Midlothian, United Kingdom. Unlimited breadsticks. #olivegarden",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LMcgz4BzqoYYjIaG2LrgcA/o.jpg"
      }
    ],
    "user_id": "UCOgYSDaoo0wt9STTiA_SQ"
  },
  "ToXB7SFlPJFqe2aj6DeaWQ": {
    "date": "8/3/2017",
    "text": "The four of us went there on a lazy Sunday afternoon and were greeted by our friendly waitress.  We ordered some starters, Calamari & Salsiccia Siciliana followed by my sourdough Pizza Burrata, a Pizza Genovese and a Pizza Margarita slice. And as a closing act an espresso coffee & a chocolate ice cream. On the positive side: The interiors were pretty cool with its big and long wooden tables plus tiles and brick walls. Deco was cool and matching the clientele's vibe too. About the service, both waitresses were friendly, professional and efficient, so kudos to them. Improvement needed: Naked wooden tables were very sticky (aka dirty) so you lean on them at your own peril... as your jacket sleeves may get glued on them... it reminded me the old Port O' Leith filthy tables after a midnight weekend drinking session... If I paid  16 for a pizza I expect a proper plate and not a bendy paper one. Pizzas arrived lukewarm on icy aluminum trays, a definite no-no as they were cold after 3-4 minutes of eating them. It looked that the pizzaiolo made them with the starters and left them to cool down on the kitchen pass whilst we were eating our starters... with the obvious consequence of a cold meal which was a real shame. I'd give an extra star if only pizzas were hot... food for thought.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vyO2R6IW6zZ1Maw2q-FQbA",
        "caption": "Photo of Civerinos - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vyO2R6IW6zZ1Maw2q-FQbA/o.jpg"
      },
      {
        "img_id": "i6jF3ySylmcqpVegu_eZyg",
        "caption": "Photo of Civerinos - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/i6jF3ySylmcqpVegu_eZyg/o.jpg"
      },
      {
        "img_id": "_e8W7S-caeFq8rnc8boNsg",
        "caption": "Photo of Civerinos - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_e8W7S-caeFq8rnc8boNsg/o.jpg"
      }
    ],
    "user_id": "RBvR8MoGAoxeLlm_ajTYgg"
  },
  "z8fLnTDfyiXK06kYaTEf4g": {
    "date": "1/13/2019",
    "text": "what kind of pizzia establishment doesn't cut their pizza?? on top of that, they give me a bottle of coke that requires a bottle opener!!! smh very disappointing to see where our scotland pizzas restaurants are headed!!!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pLXT-vRJKKyS-SiNg7B8-A"
  },
  "lN-WFKW4RmHkrmIV_dsiNw": {
    "date": "3/12/2017",
    "text": "Thougjt we wouldn't finish two big pizzas but in fact managed it. Really good and don't feel bloated. Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_0kyPjppqRl30ZO_cOBBMw",
        "caption": "Photo of Civerinos - Edinburgh, Midlothian, United Kingdom. Starters and pizza",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_0kyPjppqRl30ZO_cOBBMw/o.jpg"
      }
    ],
    "user_id": "xA78hV3BVAycTmVIm3pU-w"
  },
  "qEQEOC4LsMyRDErKhm2YvQ": {
    "date": "5/23/2017",
    "text": "I was extremely disappointed in the food here. I had two different starters and a pizza and none of them had any flavor. We didn't finish anything that we ordered because it was not satisfying. The only good part about this experience for us was the free breadsticks offered at the table. Would not recommend this place to anyone coming to Edinburgh, there are much better places to eat for cheaper prices.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "EFq_H5rSP_3aYlMM6oEXwA"
  },
  "J6J-daL4m669zcgep4MhNA": {
    "date": "5/23/2017",
    "text": "This meal was absolutely awful. We heard great things about it on trip advisor and other platforms so we thought we'd give it a try. Everyone around us who came in after us got their food before us. We ordered 2 appetizers, both greasy, gross, and flavorless. The pizza was also flavorless and sitting in a pool of grease. Definitely would not recommend",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2mINRT7Po-OOQvnurvoPeg"
  },
  "EmpkWpNXjbZ408Z306TVfA": {
    "date": "1/30/2015",
    "text": "I love the decor, I'm ok with the service and I like the food well enough, but I'm not so crazy about the price point. Having once got a 4 slice to go and now having eaten in.. I just don't feel like I got much bang for my buck.  The food is good but wasn't anything to write home about. The pizzas I've had felt a little scarce for topping and needed a healthy sprinkling of parmesan to lift its flavour. The pasta was well cooked but the ragu could have been punchier. The coating on the calamari needed just that little more crunch.  As much as I love supporting local business, they need to up their game to compete with the chains around the corner!  Oh, and cash only saw me venturing out into the cold to pay for my dinner.. Don't get caught out!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qdwGltM3WUkdMX5o0U47oA",
        "caption": "Photo of Civerinos - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qdwGltM3WUkdMX5o0U47oA/o.jpg"
      }
    ],
    "user_id": "J6E6NSpJqMBib9ydbchicg"
  },
  "Do7EOsXI7tt44kaUhD-Yhg": {
    "date": "12/4/2015",
    "text": "I've been here twice.  The first time I was here I was with a friend and we met for lunch.  It was quiet and service was quick and friendly.  We both had pizzas and some blood orange fizzy drink.  The pizzas were huge and tasty.  Just the right thickness/thinness!  Flavoursome with the topping and the crust. Saying that we both were stuffed and couldn't finish them.    The price for the pizzas is round about right but the cans of juice are on the pricey side, saying that most of the drinks are.  Because I had a good time the first and I kinda rated the place 4 stars before I commenced the first review, I opted to come back again.  The second time was for dinner and I had booked a table.  This time, the place was actually quite busy and I'm putting that (not entirely tho!) down to the street of light event nearby as people kept coming, in search of a table and food.  The four of us shared two starters, both were quite big - meatballs and arancini.  Both were really tasty.  Mains took a wee while longer.  I'm sure if it was Mum's fish or the pizza both there was defo a hold up in the kitchen.  When it finally came out the Pizza was tasty but a tad under crispy as it was hard to lift a slice up without the whole thing collapsing.  Mum's fish was undercooked but that got taken off the bill and she just ate the veg that came in the steamed bag.  It's ashame because it looked really nice.  Bro's steak was polish off, but polenta and rosemary chips were replaced with fries without prior warning.  So a bit of a mixed review here and that's why I gave it 3 stars.  See, I love italian food and good bits would get me back but the bad bits are just awkward.  Saying that, I'd probably just give it another shot and hopefully it'll be third time lucky.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "BhYROfCjIJsKUk22_IVHig"
  },
  "934cMBHILOFgAqOEw9h2Hg": {
    "date": "5/10/2017",
    "text": "Stopped for lunch after walking all day, we tried the pepperoni and meatball pizzas. They are large enough to share. The pizza crust was light and had great flavor. The pizzas were not greasy or overly sauced. Prices are not bad. Great beer too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hK8BkqzFy9FQ4jnTWtHWQw"
  },
  "F7dGSBJv4a1Xj-dwqNtIVQ": {
    "date": "8/21/2015",
    "text": "I have been eager to try Civerinos since it opened earlier this year. Hearing tales of it's enormous sourdough pizzas and frozen Negronis at every turn.  In contrast to the overpriced Royal Mile tourist restaurants offering, as a general rule, fairly low quality food, Civerinos is the real deal and very competitively priced. Civerino's is located just off the Royal Mile near the Tron Kirk in Hunter Square and serves a fanatastic selection of family recipes handed down through Michele's family, featuring Italian street food and of course Pizza by the slice or whole.  The beautiful glass door way opens into a minimalist style canteen with long tables and an open kitchen where the smell of food drifts tantalizingly from. The staff are super welcoming giving a real easy going family feel to the place. The owner Michele is often sat at the bar and came to talk to us about his plans for the restaurant, the food and his plans for the upcoming Festival season.  It is easy to see why the food at Civerino's food is so good when you meet Michele. His enthusiasm and passion for Italian food and the business is inspiring and infectious! He is so excited by the fresh produce, especially after a recent trip with the kitchen team to source new products and try out new ideas resulting in some fabulous new gorgonzola croquettes, Italian salamis and porcini mushroom sauce to mention a few of the tasty new treats. He certainly loves his food and takes pride in his family's heritage. Civerino's is an expression of this passion - great food from the heart; timeless, classic recipes using exceptional fresh ingredients that would last forever.  A long term Edinburgh resident and foodie Michele loves eating at many of the local establishments and is very complementary about many of his neighbours including fellow street food success Ting Thai Caravan where he loves to go for his dinner and Ninja buns, who are now providing the food at Paradise Palms.  With the restaurant's first festival season approaching fast they are keen to ensure they still manage to save some space for their regular followers and will be keeping a table at the back for bookings from those who have booked before. They will also be open late so you can head over after your shift or show too. Seating outside should help them to catch the eye of the passing traffic as will their new Gelato bike set to appear very soon!  On to the food - having tried the fabulous pizzas on a different occasion we decided to embark on trying out the rest of the menu. Mix and match home made pasta varieties and sauces featuring pig cheek carbonara and slow cooked beef ragu are sure to be a crowd pleaser and there are some really exciting antipasti dishes if you can draw your gaze away from the pizza menu that is.  We decided on the parsley and chilli calamari, beef meatballs in mushroom sugo, Steak tagliata with wild rocket salad and Zuccini fritti. The food is served on sharing style boards with individual paper plates, so you can get stuck in and help your self in unpretentious communal dining style. We were very impressed with all our dishes, light crispy battered zucchini was really tasty, well-cooked steak with roast tomatoes and rocket was the stuff of dreams believe me, and of course crispy calamari with aioli was just about perfect, but the rich tasty porcini sauce with the meatballs was a stand out winner at our table. We were dipping everything in it!  The wine and beers are all really well priced and they have a frozen cocktail too! Featuring popular Italian favorites including Negroni and Aperol Spritz. Desserts are also pretty awesome - we were recommended to try the Tiramisu but didn't have space after our feast so it will have to be saved for our next visit.  I am so pleased to have discovered this exciting gem of a restaurant right in the centre of all the festival action and cant wait to go back for more. Especially for their late night pizza and great music on until the early hours throughout the summer of Edinburgh's festivals, and the terrace set in Hunter Square where you can sit and watch the crazy world of the Royal Mile go by!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "neMi0e3dZaUtX7Sg-3Qytw"
  },
  "JJMWmJSwfY1GQTKwlxmYFA": {
    "date": "9/25/2015",
    "text": "Atmosphere: The staff and decor were fantastic, we felt very welcome and couldn't fault the atmosphere.   Drinks and starters: The starters we ordered were fantastic, calamari and polenta fries. The carafe of house wine was very quaffable.  Main: The smoked pancetta and white mushroom pizza was overpoweringly salty. I gave up after 2 slices. The pasta was overdone and too rich. Very disappointing after such a good first impression.   Conclusion: The atmosphere is great but you can get a better bang for your buck elsewhere.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "nESNDtnAhPVTJ61DrEg3xA"
  },
  "oLzMkfD_HRuiZAINFA3zzQ": {
    "date": "1/8/2016",
    "text": "We went here while in Edinburgh and had a great time! Really cool atmosphere, small but cool community seating available. The pizza was to die for and huge!! We also got some fried zucchini which was good, but the breading was a little heavy. I would definitely go back! Great location to walk around afterwards and go to shops!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8oul4ZbX055xCWTyQx-deA",
        "caption": "Photo of Civerinos - Edinburgh, Midlothian, United Kingdom. Fries Zucchini",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8oul4ZbX055xCWTyQx-deA/o.jpg"
      },
      {
        "img_id": "A1nvvKtsQe5a_0PaZ0Xcbg",
        "caption": "Photo of Civerinos - Edinburgh, Midlothian, United Kingdom. Pizza, pizza, pizza!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/A1nvvKtsQe5a_0PaZ0Xcbg/o.jpg"
      }
    ],
    "user_id": "ewk2Iapn2SGjJImHFtNotQ"
  }
}