{
  "xrfLfs8cS0tsxqf1wYSjCg": {
    "date": "2/8/2013",
    "text": "Turkish feasts, they are small and wonderful! the owners take full pride and their own hands in baking and serving. just what this area needed. they have wonderful breakfasts with a Mediterranean / Turkish twist if so required. lovely and tasty cakes, snacks and drinks.  Located on London Road on the way from town to Meadowbank Shopping or Leisure, this is a great pit stop for the thirsty & peckish.  I personally enjoy the whole day breakfast offers and they have really good coffee (thick and strong!).   Sitting inside is about looking out on London Road - people watching, see the rain falling when staying dry. It is that kind of  ' caf ' and I like it! I hope they are going to be there for a long time to come.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fKi8ZF3xpJJkgSusRubeMA"
  },
  "fVgYyNceV59vJ_lbmGmzJQ": {
    "date": "7/2/2017",
    "text": "Nice little cafe. Service was great but scones were average. Cappuccino was nice. Prices reasonable.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "20awmIbQCLkcJDmEiLMPkg"
  },
  "-hnV9rm1NdA2w5fwgbby3A": {
    "date": "1/20/2013",
    "text": "Cherry's Cafe looks like a fairly standard greasy spoon, on London Road, on the way towards Meadowbank. That's only half the story, though, as while it does a good line in all-day breakfasts, it also serves some really good home-style Turkish cooking. I had the borek, and also sampled their dolma. Both were freshly made and very good. Their Turkish coffee, served in traditional Ottoman style in a little copper pot, was as good as I've had outside Istanbul. This tiny little place is well worth a visit, I'd say.  Overall, we said: \"Cherry's Cafe was a wonderful surprise. The surroundings are inauspicious, but in terms of the quality on offer, it was enjoyable, home-style Turkish fare, cooked to a really good standard. I'd happily go back, and would encourage you to do so, too.\"",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "LURC3E0DoXYgN9aYTF3XOg"
  }
}