{
  "SK7qgBDsw3eBoBOECX8-GA": {
    "date": "4/23/2008",
    "text": "The Chesser fish bar does a delivery and in shop service.   Delivery service normally takes a while and isn't as hot as you would like it but when you buy direct from the shop it is fantastic.   They have an extensive list of chip shop food, pizzas and kebabs, with average prices. Childrens meals get a bottle of juice and a sweet.   The food tastes great and the chips are heavenly.   This is definately a chip shop I would recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QtmAB9XA5XJYCbTiVAKrRA"
  },
  "Em-J-ssJm0aiZELYnPNwtA": {
    "date": "11/6/2007",
    "text": "This is quite a good local pub if you live in the area. It has recently been taken over and is called the Sports Bar and I have to say they are doing a good job. The interior has been replaced, a pool tabel installed and new tvs put in everywhere, which makes it an ideal place to catch a game. On big match days it does get very busy so be prepared to stand if you have to. The also do a pub grub menu which is very cheap and quite good food aswell. In the morning they are open as a kind of sandwich shop which serves sandwiches and soups etc at a kind of seperate bit divided from the pub, which the keep up until lunch and then take awa the divider to have the pub as one big place in the afternoons/evenings. The pub has a great atmosphere and since its name change has many more younger people in it, the prices for drinks are great too. At weekends you can also catch the Kareoke or disco!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6QcNJ32uL1FPdCpaZceepA"
  },
  "FzDSB_SjTNXt5PcVVSNGDQ": {
    "date": "4/18/2008",
    "text": "The Chesser Sports Bar is a great local pub, recently refurbished and under new management the pub boasts a great food menu and entertainment. Poker, discos and kareoke are amongst the things on offer here. It is open quite late till about midnihgt at the weekend and has a great atmosphere, there are no local cliques associated with local pubs here! Great for a good night out on a budget!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TqbSA-djveQQOJ3n1o-GaQ"
  },
  "fjN4MM9FuKfPhgjvaQbDlA": {
    "date": "3/28/2011",
    "text": "The Chesser reopened as The Chesser Inn Sports Bar promising, and originally delivering, much. Gone were the old seats and grotty carpets, in came new fitted seating, comfortable booths, and a bright, modern bar. The upstairs room remained as did an excellently appointed/equipped kitchen on the first floor. A strict policy of zero tolerance on drugs and antisocial behaviour were implemented and rigorously applied, making it amenable to all age groups. Since then it has seemed unsure as to its True identity, seemingly constantly reinventing itself - sadly, and all too often, not to the better. The owners and staff are extremely warm and welcoming and the potential is there. But regrettably it has seen an influx of younger drinkers unable or unwilling to fit in with the Chesser's hard won (and all too easily lost)reputation as a community pub. These days The Chesser tries hard to maintain its standing and gives one the feeling of a dear family member or close friend struggling to keep up appearances. Judging by comments made and faces missing at the bar, there are many of us, previously patrons of The Chesser and still fond of the place, its owners and staff, but no longer comfortable drinking there, who crave its resurgence as the brilliant community pub it can still be.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ds25ilokMkRR03Up--rTVQ"
  }
}