{
  "vz6ozp45JIajdhe4bUKwjw": {
    "date": "11/16/2008",
    "text": "Love the Patio.   The service here is really good - they main lady and chap are so welcoming and friendly - treat you like old friends each time you come in.   I have brought lots of visitors to Edinburgh here over the years and all have liked.   I have to say that I have never eaten of the printed menu - always go for one of the specials that the head waiter reels off on demand. Their fish dishes are very good as is the venison dish they often have on.   Decor is now rather old and jaded - probably over due a bit of a refurb but does add to it's old world charm.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dIAHvx0I8T1OVNlgt2paVA"
  },
  "fzA2YLzRHZXyVDV6HbmxwQ": {
    "date": "7/26/2010",
    "text": "The Patio Restaurant is definitely not the best restaurant in Edinburgh. It doesn't look much on the outside, and to be honest, it is isn't up to much inside either. Situated in Hanover Street, The Patio Restaurant is in the heart of the New Town area of Edinburgh and so it should be hot spot for people going for lunch and dinner, but its not - because it is awful!  The inside of The Patio Restaurant is really drab and dull and could definitely do with a revamp. I came here for lunch one day and I was really disappointed with my whole experience. This is an Italian restaurant, serving pizzas and pastas, but not that well. I ordered a peperoni pizza which hardly had any topping or cheese, and it was literally dripping in grease - it is something which I would only normally eat on my way home for a night out, not for a nice lunch. The prices were very reasonable here though, with most main courses costing under six pounds. The staff were friendly enough and the portion sizes were fairly decent.   There are much better Italian restaurants in Edinburgh which are more deserving of your custom.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7Kb756KGQIbD508tPHCXow",
        "caption": "Photo of The Patio Restaurant - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7Kb756KGQIbD508tPHCXow/o.jpg"
      }
    ],
    "user_id": "OdUSlS-S6qfZFnDUCKzwEg"
  },
  "37cizuSIhavEu1aeHHjlJw": {
    "date": "7/25/2010",
    "text": "TERRIBLE AND RUDE SERVICE!!  The star rating on Qype and Google are deceiving as most of the ratings are over three years old and this establishment has had a change of management for the worse.  We stopped off here after a day of exploring (and tasting) much that Edinburgh has to offer.  The front of the restaurant has smaller tables which looked like a nice area to get drinks and appetizers while there is a full restaurant in the lower level.  We sat down and informed the waiter that we were just interested in wine and a light bite and would not be ordering a full dinner.  He literally sulked and told us we must order a full meal.  We thought he was joking and informed him we would love to try a full meal another night, but that we were not hungry enough right now.  He then asked us to leave.  Seriously?!?  At this point it became obvious he was not joking and so we left.    How is the food?  No idea, as we could not get past Cerberus the waiter from the underworld, but while we were waiting, we were given prepackaged \"italian\" breadsticks.  A good restaurant would provide fresh bread IMHO!!  There are much better choices in the area.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mSxXYciUcB-BHhqHAR7JDQ"
  },
  "bddpvnuhTcDQD_je9UtOtg": {
    "date": "11/7/2007",
    "text": "What a charming little restaurant. Situated in the centre of the Edinburgh new town, The Patio may not have the glitz and glamour of some of its swanky neighbours, but it more than makes up for that in character, food and service! The owners make sure everyone feels like part of the family and serve up delicious pizzas, pasta and seafood dishes. An Edinburgh GEM!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "deJ8rnTplJnklOrKYgo7Bw"
  },
  "Lq3XyivnGwJ3HWy0ItRR8g": {
    "date": "10/10/2007",
    "text": "This is the one of those restaurants that you will visit and remember for all the good points. The lively atmosphere and helpful staff make sure you have everything you need, from taking your coat to going over the specials with you. Prices kind on the wallet, making it a good choice for families. Go on, try the seafood!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GZ4tNqBOZnj0YYULdvThkg"
  },
  "lKuld5l-eigRaA01pUTRsQ": {
    "date": "11/13/2007",
    "text": "Patio is indeed a friendly, welcoming Italian restuarant and the 'Mama' maitre' D ensures you are served promptly. I experienced their 3 courses for 6.95 lunch time menu which is quite a bargain, but saying that the quality of the food really varies. The pizzas were greasy and certainly didn't evoke memories of Italy, rather a visit to a chip shop on a saturday night. The desserts were all from the land of cardboard box catering, so although I was indeed full after my meal, I didn't really feel I had eaten particularly nice food. However for a feast on a budget you can't go much wrong and with such a variety of dishes I'm sure some are cooked with some real italian flare.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J_G91ktvy_kCarckD91u3Q"
  },
  "gOVpgjJAT2h7XmU7haK0Qw": {
    "date": "11/17/2009",
    "text": "For 22 years the Patio was an Edinburgh institution, serving both locals and tourist from around the globe. I understand that after being closed for some time from June 2008 due to a failed buy out of the property it has now been purchased by another famliy who have reopened and who have attempted to do everything they can to pass it off as the authentic Patio Restaurant.   Poor show, I hope the people from the PAtio return some day and open a place that captured our hearts and taste-buds as this place once did.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OWbt6-uRDmCynuC3CjAFFg"
  },
  "DY-S8PgEru-e2vy6GOd8QA": {
    "date": "8/13/2007",
    "text": "The Patio Restauarant is lovely. It has a really cosy atmosphere and the staff are always so friendly and helpful. It is an Italian restaurant but they do fantastic seafood dishes. The prices are reasonable and there are quite often families in there.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vu2Y7kCTtxhNGmjzWMankw"
  }
}