{
  "HU-JcZyJ9vuOkTynt4XSVg": {
    "date": "7/27/2010",
    "text": "I did not have a good experience at the Ricebox. I came here after a Hibs game with a friend and got a meal to take away. The price was about standard, but the quality of the food was lacking. The shop was full with supporters looking for a post-match bite to eat, so I would like to give it another chance on a non-match day when the workers have more time on the hands. I ordered the sweet and sour pork with rice and found that the flavours were really bland and the meal was generally very greasy On the positive you do get a cool fortune cookie with every meal! Furthermore, the decor of the restaurant is very good and looks modern.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3w_782IwuwtLvBUkE4cxlA",
        "caption": "Photo of Ricebox - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3w_782IwuwtLvBUkE4cxlA/o.jpg"
      }
    ],
    "user_id": "hutJzKEYHuVq6CP-XSARgg"
  },
  "5Ja75Chtp5gI585wYrrelg": {
    "date": "6/16/2019",
    "text": "Ordered a side of orange chicken. It was basically a fried chicken tenderloin that was chopped up and soaked in a weird orange flavored goo.  No thank you.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8qdZi8L_TSqAnmP9w9dW-w"
  },
  "3ytLZKDk773jjWYZcdfnBw": {
    "date": "9/29/2016",
    "text": "Had a meal recently on a Monday. Chips were pre cooked from Sunday night my rice was hard and crispy, my wife's lemon chicken was soggy. Went in the bucket after a few mouthfuls never again.  We put a pizza in oven. At least it got rid of the taste from the crap Chinese meal. Waste of 16.80. AVOID AVOID!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8TmB7dJ4gSXi_XWwM_Z29w"
  },
  "UcxJ-fHs-ROxBu2Y6RQtXg": {
    "date": "6/30/2014",
    "text": "The worst take away I've had in years...  I ordered chicken noodle soup that literally had no chicken in it, (seriously, not one tiny bit) no spring onion or any other garnish. It was literally a bowl of weak stock and noodles. I also ordered ribs that had no meat on them and what meat there was was dry and hard.   When I called to complain (it has to be really bad for me to do this) the attitude was defensive and unapologetic.   Just avoid; If a place tries hard and its just not good enough then fair enough but the corners cut by these guys and their general disregard for customer satisfaction makes it feel like you've been robbed.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZkmKyB9660N9d30GIrBGTQ"
  },
  "YkqxG_raYwJe_qTnPuNTTA": {
    "date": "7/16/2013",
    "text": "Used to be good. I find if you order a meal around 5pm it ( to me ) feels re heated from the night before. Last one was hard greasy chips ,the fried rice was greasy too. As they say Once bitten  Sorry its a toilet!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qsNd3x3Aatc61xEOViXFsQ"
  },
  "74PMA_22HQqS_jx9N3xeFA": {
    "date": "4/26/2010",
    "text": "This was the worst take away I have ever had, it was last year sometime but the memory is still ripe.   I was lured by the online ordering and fancy packaging (why don't more people do this?) but completely disappointed in the results.   Unless you like your Chinese food overpriced, dripping in grease accompanied by dry tasteless fried rice, and wannabe dirty tasting dimsum then seriously PASS on Ricebox. I sent them an email to this extent after the meal, but never received a reply.   Less money on Marketing and more attention to fresh, great tasting food.   See my review on Chop Chop if you're looking for great Chinese in Edinburgh",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GR5J2C2nhDZQuEsqycjntg"
  },
  "BxFYE2gBLGAbOlyIRagoSg": {
    "date": "11/16/2008",
    "text": "This is our chinese takeaway of choice too.   They have a handy online ordering site where you can save your usual order and directions to your house.   The food is good, solid, chinese fare. All the dishes you would expect from a chinese. It's not too full of MSG and it does taste good. They will also deliver extras like drinks and sauces.   The fortune cookies are a nice touch - you get a little packet with chopsticks, fortune cookies and a serviette. You can also collect vouchers for ricebox products like bowls and plates.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dIAHvx0I8T1OVNlgt2paVA"
  },
  "zxqn5WGhlIWPNMzq7iQZIQ": {
    "date": "4/9/2013",
    "text": "Last night I was feeling lazy so my boyfriend and I decided to order from Rice Box - we'd heard good things from a friend and who can resist a cheeky Chinese carryout?  Now I wish I'd just cooked instead as the food was really disappointing.  Boyfriend thought his chicken satay and noodles were fine, but I barely touched my 'deep-fried shredded beef with chilli' and fried rice.  Shredded beef is one of those standard Chinese takeaway dishes, you'd have thought it'd be hard to do wrong but it turns out it is. The beef itself was chewy, and rather than being nice and crispy the batter was soggy - the chilli sauce itself is marketed as 'spicy' but isn't remotely. The fried rice wasn't great either - not awful, I ate most of it, but the rice itself was slightly undercooked. As a side note too, whilst I appreciate that they offer online ordering through their website, I didn't find it to be hugely user-friendly and signing up to a website such as Just Eat would probably be a better idea. Safe to say we won't be ordering from here again!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mqg4L8flJmg8pqeR-uYyRg"
  },
  "UkirMzEY2FR9pVH5WIjI0A": {
    "date": "4/24/2008",
    "text": "A pretty average Chinese takeaway on Easter road, Ricebox is good if you live nearby and have a craving for Chinese, but I wouldnt really recommend ordering in, there's much better places in Leith! I ordered from Ricebox and picked the order up myself. By the time I got home (about 3 mins walk away) my hands were soaking in grease and the food was so soggy I barely ate any of it. We all know we shouldnt really eat too many take aways, but when the food's that greasy the guilt just wont go away! Not bad for a quick fix but I'd suggest looking elsewhere for a nice meal!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YZtT78f32jBlkpZRBQ_Hig"
  },
  "qyudR1CFHtJOz_zsrQRwZw": {
    "date": "12/31/2010",
    "text": "You do hear a lot of bad things about Ricebox (someone getting a shoe lace in their noodles is a classic story!), but my husband and I love it. We've been ordering from them ever since we moved to Edinburgh five years ago. Their salt and chilli tofu is my favourite food ever.   My only criticisms would be that the staff on the phone could be nicer, and a couple of times our food has been very late and I've had to fight to get any kind of compensation. Once it had been 90 minutes since we ordered and the food still wasn't here, and they had the attitude of 'Not our problem.' This is particularly galling considering we order from them roughly once a fortnight! Occasionally it will take so long to arrive that it's soggy from condensation. But, we love the food so much we keep on going back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qNtaTeRQ7BATPQVwXCi17g"
  },
  "MdBi3RO1xnBs8voyfWs4lQ": {
    "date": "9/30/2008",
    "text": "Our order took ages to arrive - the delivery guy couldn't find us and went back to the shop (twice) before they got around to calling us. The food was pretty disgusting when we finally got it, and it's none too cheap, either. We haven't been back. I had to add one star to post this review but I wouldn't give it any at all.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ai-lb1pt586HE6qcpUidPA"
  },
  "Cr9aigxJwQKI9p0naYeRIg": {
    "date": "4/26/2010",
    "text": "Was surprised how poor this was. I'd heard a lot of good things about it but was left under-awed. Only good thing about it was the modern decor, struggling to think of anything else.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7lwFE-rYydZJRpcPJk-loQ"
  }
}