{
  "OC5GqV06gj2QbPPVqP82ow": {
    "date": "5/2/2010",
    "text": "Baguette Express once formed the core of my staple diet. I went through a phase of getting one oevery single day, so much that now I can't even look at Baguette Express.   Whether this is a sign of it being really good or something to avoid at all costs is left to the reader's discretion.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WLE_sZQm2k0yE1rmStp_Eg"
  },
  "3cRxVFB6ecKCPNRhw3BFMQ": {
    "date": "3/17/2011",
    "text": "I've been to this Baguette Express once and I got a baked potato. The potato itself was good, although they put the cheese on top of the beans meaning it doesn't melt as quickly. I probably won't go back, as I've found the one on Rose Street far better.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xwJgGjg_GAMvd5HyO1Ajrg"
  },
  "0sYkJEhkajGuAnYYiOn1KA": {
    "date": "5/2/2010",
    "text": "Wasn't overly impressed with this Baguette Express. My bread didn't seem fresh and the staff were not particularly helpful or patient with m indecisiveness!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cqecqnFK2eu88VtKJLHpiA"
  },
  "ovnCefiEqWHEaQAYSwTssw": {
    "date": "11/19/2008",
    "text": "Tried this earlier this year when working nearby and must admit very impressed both with quality of food and service. Not many places i go to can rustle up a toastie that quickly , bit similar to subways but very well staffed and very reasonably priced.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yI4LI8-aYYUS9MmrfpidMQ"
  },
  "7nrJ6Wqayl7MLZwhPrTmFg": {
    "date": "4/19/2008",
    "text": "For those that have read my previous reviews you'll know how much I love my food and it's even better when I'm not paying over the odds for it.Well..Baguette Express has recently opened up near my work and I'm now a regular visitor. Baked Potatoes and filled baguettes are 2.20 regardless of the filling (or fillings as is usually the case for me) The service is friendly and they live up to the title of Express as I'm usually in and out in a couple of minutes. they've also got a loyalty card scheme on the go at the moment so you get a free lunch after collecting enough stamps. The clincher for me was I asked for a prawn baked potato the other week (which is usually the most espensive option in other outlets) and I was given so much filling they were struggling to close the box.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dqji5fRROkLc3eNMMQOI_Q"
  },
  "RAuH9tGYgIAc4WbZA8DYJg": {
    "date": "1/29/2010",
    "text": "SHANDWICK PLACE The shandwick place baguette express is a let down to other baguette expresses in and around Edinburgh. More often than not the bread does not have the fresh taste that it should and the egg slices can taste progressively off depending how late in the week you visit. At 2.70 the shandwick place baguette express is slightly more pricey than usual and when asking whether they have any meal deals, as others in Edinburgh usually have a baguette, drink and crisp combo, i was told \"this is baguette express not meal express.\" Shandwick Place have also seemed to have adopted a 3 filling rule that changes from 3 meat fillings + vegetables to 3 fillings max overall depending who serves you. If they serve you 4 your made to feel like they are doing you a big favour.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qHoI3TV_f35nlmfZ-iMIXA"
  },
  "8WtmzSxP68jpYtZ_BP4JrA": {
    "date": "1/26/2010",
    "text": "BAGUETTE EXPRESS, EDINBURGH   Springing up in numerous locations over the city is apparently the UK's fastest growing franchise phenomenon, also known as Baguette Express, with their tag line; fresh, healthier food. It does what it says on the tin  all food is prepared freshly, in front of the customer, with a vast choice of fillings for your chosen baguette, sandwich, roll, pannini or baked potato with an easy to understand price structure ,which, will by no means, break the bank. The gentleman in front of me asked for a baguette with chicken, olives, cheese, ham and cranberry; not to everyone's taste but that is the delight of BE  he will pay no more than the customer requesting a baguette with cheese  all at one low price and served up by accommodating and welcoming staff (good job considering some of the requests). Freshly made soup is available each day and in some outlets; stovies or macaroni cheese is served to customers trying to combat the cold; an array of cakes and drinks, completes the deal to what has become, exactly what Edinburgh needed  an unpretentious, quick, non-expensive food stop, where you get what you ask for!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RIiaxSi8t4NXZ-kA8o9nPg"
  }
}