{
  "pfP8SXESKLjosrp0ufivlQ": {
    "date": "10/29/2017",
    "text": "A nice little coffee shop around the corner. They are serving fulll range of coffees and some home bakery among other which are brought in.   The nicely decorated place got it's charm. The service is friendly and quick. The pricing is very reasonable.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uFmLBiG8_0mST5BtEgeEtA",
        "caption": "Photo of Coffee Magic - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uFmLBiG8_0mST5BtEgeEtA/o.jpg"
      },
      {
        "img_id": "jmNiazI12ypyMjsHauBa_Q",
        "caption": "Photo of Coffee Magic - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jmNiazI12ypyMjsHauBa_Q/o.jpg"
      }
    ],
    "user_id": "0jBMjSZJ8MBYgCEyaJpfPw"
  },
  "1rUxcrGBKPCmXB_quMcjrA": {
    "date": "8/29/2017",
    "text": "This place filled up my heart and soul with a rare kind of happiness! It was as if I had entered the coffee shop of my dreams where coffee tastes like magic and you want to stay in that moment. The woman who served me was brilliant! She made my day with her smile and kindness. This is no doubt a place where happiness and coffee are combined in a beautiful mix. Thank you Coffee Magic...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nTueALMvXa9TZzzZZgZCRA",
        "caption": "Photo of Coffee Magic - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nTueALMvXa9TZzzZZgZCRA/o.jpg"
      }
    ],
    "user_id": "EnkK5TfLM8-KErN0R2gTHQ"
  },
  "TwNWvUWc2m1HQ7Cf3tVifg": {
    "date": "10/21/2015",
    "text": "edinburgh has not shortage of coffee places so when a new one opens up it already faces some serious competition.  add to that it's opened within a mile radius of some of the best coffee shops in edinburgh, it was always going to be hard to rate this place.  however Coffee Magic is worth rating.  it's a wee place nestled in between a flower shop and a take away just a step away from The Other Place.  the interior is cute, i think they're going for an alice in wonderland theme but i wasn't quite sure.  there's a few seats in the front part of the cafe and a small back room with tables as well.  we sat in the front right next to the window which was great for people watching but if this place was to get quite crowded it would be hard to get a seat.  on offer is your usual coffees and cakes that you'd expect in a cafe.  we had two flat whites and a slice of red velvet cake which my boyfriend claimed he was too full to share but then ate half of it anyway... *sigh* men....  the coffees were probably what gives this place it's solid three star rating.  they were just ok, nothing amazing but i've definitely had worse.  i'd probably go for tea next time i came here but if you fancy an average coffee than this place is totally fine.  they also have a wide options of sugars and sweetners which is always handy.  the cake however was definitely super tasty and is probably what would bring me back here.  red velvet cake can often have a sickly sweet frosting that makes it a bit hard to eat.  however this cake was super moist and the frosting was just on the right side of sweet and the whole thing was super enjoyable.  the staff are friendly and there appeared to be loads of sandwiches on offer for lunch or a non savory snack.  the prices are quite reasonable, just over 8 for two coffees and the cake not sure how much the sandwiches are though.  it's definitely a nice wee place and if they improve their coffee i'm sure they'll do well as there is a fair bit of footfall in that area.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "Z_xbO-Iaxbx-ZRPhLJK-Ew"
  },
  "AfkFaciD8OTlhn29IS6qDQ": {
    "date": "12/9/2015",
    "text": "Coffee tastes good and service is friendly. They also have a decent range of herbal teas. Small but seating for one small group or few individuals to sit inside. Deals most days when you buy coffee and a pastry.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "t0lb4ZHHAAt1K10bjXIATg"
  }
}