{
  "DXDEhTrigzY-wWUV1neP1g": {
    "date": "6/21/2015",
    "text": "The decor is fun, especially if you like skulls! Had 3 margaritas: 1 frozen, 1 clear and 1 with grapefruit bitters and forget. They were small by my standards. The frozen was the most like a margarita. The other two were very strong, and not that interesting or...well tasty. Prices a bit high for what you get. The menu was small. Had the guacamole with plantain chips as other reviewers raved. The guacamole was very good as were the chips, and the two work together. Had the jalapenos bombers, too. They were also excellent. However, the portion of guacamole was very small. Had pork shoulder tacos and fish tacos. Tasted good, but batter on fish not great. Again, portions were extremely small. The boozy beans and street corn were had also. Beans okay, not great, small portion. Corn was on the cob and covered in sauce...not fun to eat, taste lacking, too. The staff let you seat yourself. They were very casual and sat around at the empty tables chatting. Our waiter's girlfriend visited for a while and they hugged and kissed right there. (lovely, just not while I am in your restaurant serving me. Felt like we were in their house visiting. Lastly, the music was hip-hop, and if you don't like sexually explicit music, you might ask for, I don't know, maybe some Mexican, ya know? Anyway, All things considered, I wouldn't go back...but I am fussy as have had authentic Mexican, and it is my preference. Adios, muchachas!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DU_DRHEb27CF6OGEdl8S0g"
  },
  "pf9QUZqLD3P0ZzM35zYhIg": {
    "date": "3/31/2016",
    "text": "Nice environment, innovative food, solid drinks.  I had the duck tacos, which were flavorful and filling. I also shared two sides with a friend and was very satisfied at the end.  For sides, I suggest the quesadilla and the guacamole, which is served with plantain chips.  Everything was delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "bwS0UtV5XH-5BnkKdflyIg"
  },
  "JtiNrWzpWvcv3UX52NbjDA": {
    "date": "4/12/2016",
    "text": "Being from the states I eat great Mexican food quite often. We were on vacation in Edinburgh and our apartment rental was literally right across the street from El Cartel. After reading reviews, seeing it packed daily, and eventually craving Mexican, we decided to try it out.  It did not disappoint. Probably the best guacamole I've ever had. The waitress informed me on how scarce and difficult Mexican restaurants are in the UK and after hearing this, I was that much more impressed. Keep up the good work El Cartel.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "A42FMmvQQwtkj0wq_bSobg"
  },
  "RKXYjR8Ns-7vzzp0Iy3BGw": {
    "date": "12/30/2014",
    "text": "when i saw that the doors of Tex Mex II were closed for good, i'll admit i was a bit heartbroken.  it had been one of my favourite mexican restaurants in edinburgh and to see that it was gone left me both nacho-less and with a small burrito sized hole in my heart.  but then, as the restaurant world turns, El Cartel opened its doors full of mexican goodness.  El Cartel is conveniently owned by the Bon Vivant (which appears to be building a small edinburgh empire) that is basically across the street.  but instead of the cocktails and bistro food this is very much tequila and tacos.  i went for lunch time between christmas and new year and at 1pm found the place completely empty.  i was a bit surprised as there is always a bit of hype around a new restaurant but this suited me fine as it meant i had my pick of tables.  the layout remains very similar to Tex Mex but has a more rustic feel with some exposed brick walls and dark wood furniture match with purple hues.  it's cosy enough although was bloody freezing when i went for lunch!  when my friend arrived we decided to order a few tacos to spilt between us and the guacamole.  as some have mentioned previously the guacamole with plantain chips is the True standout dish.  it was simple and delicious and i wish they had it in a to go option to take home.  between us we had the fish tacos, duck tacos, and plantain tacos.  they were all good, i particularly enjoyed the plantain ones but found the portions to be tiny.  this was good for lunch as you probably don't want a massive portion but may leave you hungry after dinner.  we didn't try any drinks (it was lunchtime afterall) but they have a few varieties of margaritas on offer that would be good to try another time.  i do plan to go back, but not in a rush.  i thought the price was a bit high for what was on offer and while the quality was good there was just something lacking.  i know a new restaurant takes time to bed in so i'll make a point to visit again in another few months for the guacamole if nothing else.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6Qs013wImgViOG-6WcCAcw",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom. Plantain tacos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6Qs013wImgViOG-6WcCAcw/o.jpg"
      },
      {
        "img_id": "UKguQPqfOY9NnvYj0SAHLw",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom. Guacamole with plantain chips",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UKguQPqfOY9NnvYj0SAHLw/o.jpg"
      }
    ],
    "user_id": "Z_xbO-Iaxbx-ZRPhLJK-Ew"
  },
  "5_s_YgfShqcTMbBv07muLg": {
    "date": "6/19/2017",
    "text": "Really good, fresh, creative Mexican food. The welcome could have been warmer and we were not happy to be charged  4 pounds apiece for Mexican soft drinks, but this place is well worth a visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o_mEvUUNRVEmuZ427-DnGA"
  },
  "8XzZC4Rm8GqAQ6mikIAMCA": {
    "date": "9/28/2016",
    "text": "This place is amazing, such tasty food and a really relaxed vibe. It's small so you normally need to get lucky with a table - great place and a great addition to the city!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t__8TcfKdsBBYH6dayg7sg"
  },
  "JvGM8oou1R6dBINuF1dS7A": {
    "date": "7/1/2017",
    "text": "Really liked the food.   This is what I would call a high end Mexican restaurant.   Two tacos for 6.50, worth the experience and very nice.    Definitely worth visiting.   The staff was great and super friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6FSJU6PhE-mpVj9mAOZgTQ"
  },
  "-WBferNUbioWlt_Pwb3t2w": {
    "date": "10/7/2015",
    "text": "A friend from Edinburgh told us to go here. It was perfect. Good mezcal. Amazing tacos. And really nice staff. If you're in Edinburgh and you want some Mexican, this is the place to come.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "C30wIpKwGi5C6EGS8WoRVQ"
  },
  "69Oyn0i0gQ56IkCpA86D1w": {
    "date": "6/29/2016",
    "text": "Can't say enough about how awesome the food, services and atmosphere are here, we were on holiday in Edinburgh and ate here two times in one week!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tVQ_3TlFoj5TmMPWvgMCkQ"
  },
  "26JfPwxYLN2smXBc4QbWIQ": {
    "date": "8/16/2015",
    "text": "Mexican in Scotland!  This place is amazing!!  First off, Adam seated our party of 9 in a place that fits about 40.   The drinks were awesome and the food rocked... Small plates, mescal, beer, spicy!  Duck, fish, and sweet potato tacos are highly recommended, and the guacamole with plantain chips are a must!! Service was great!  Anna was on it, and they came to get us from the bar across the street when our table was ready.  Well done all around!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZZNICdxIKvK0mqhiVru_Yg"
  },
  "usJ62y8z7Hl4YgL3a2FmTA": {
    "date": "12/21/2014",
    "text": "Lots of flavour in small dishes and tasty margaritas! - Don't be tricked by the $'s on the menu as you pay like for like in 's, not the $ equivalent, e.g. It's a small 5 frozen margarita, and you'll want 3 of them, plus two orders of 6 tacos.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "zUXTdPXno9-V_LVXOGa2sw"
  },
  "j8OfCYPXRMxtKO7wQjk0UQ": {
    "date": "12/29/2015",
    "text": "Amazing tacos, great service, and fantastic music! Very fun and cute and very vegetarian friendly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P15ltS4kwpQD-MEnD1n0Ow"
  },
  "633johq_ZQUFm0-nfG9QAw": {
    "date": "8/16/2015",
    "text": "Food was fresh and delicious.  We had the steak fajitas which were small, but packed with delicious goodness.  The guacamole was as good as previous reviews have stated.  A True gem- nice and relaxed vibe with reggae music playing in the background.  Will return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WooY7yKHssQV1pf_I_gKpg"
  },
  "jwJDI7JT2NNWV3ypLyf3tg": {
    "date": "5/17/2015",
    "text": "When in Scotland...have Mexican food?   Well it can't be any worse than Minnesota, I reasoned, and it says they make all their food from scratch....  It was great! Small and cozy, great, quick, informative service. I had the guac, which was an excellent and fresh rendition topped with pomegranate and queso fresco. it was lovely! The plantain chips were a bit uneven, some greasy and crisp, some a bit thicker and underdone. but overall very tasty. The pork tacos were fantastic. A very hefty serving of rich, tender pork shoulder inside a divine homemade tortilla and topped with some pickled onions. personally I could have used a bit more acid/veggie crunch to counter the very rich meat, but really that is just personal preference. they were hot, fresh, and perfectly spiced.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BCZtC2SL1RmmwqAC-YnnCw"
  },
  "sMyvpRMK56DyDHo_2eKXpQ": {
    "date": "9/13/2016",
    "text": "Good food. Cool atmosphere. Friendly staff. A little overpriced but glad we went there while we were visiting.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5fSsXSAMGAwEUwc4lnGsVQ"
  },
  "21tm-ZVG--U6WDOGaWcd1Q": {
    "date": "4/6/2016",
    "text": "Wow what a find,  brilliant little place tucked away in one of the many back streets.  Simple menu but focus on quality over quantity.  The tacos were to die for along with the quesadilla.  The staff were helpful and friendly and would recommend to friends and family.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NHjlNxg9wvEk52PtkfX5qg"
  },
  "ydVe1LRcAtrjHTSNCxlcGQ": {
    "date": "8/6/2016",
    "text": "We were looking for good Mexican in Edinburgh, so we thought we'd give this place a try.  I tried the carne asada, duck carnitas, and the ox tongue. The duck carnitas isn't particularly authentic, but don't let that hold you back. They were all good, but the ox tongue in particular was shockingly tasty.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YwSiUkXKYyhofK9h0XOITg"
  },
  "MONwLCvyPi4gy4TatLJjKg": {
    "date": "7/14/2015",
    "text": "It's not often that you can find good Mexican food out as far as Edinburgh, but this place hit the spot. Get a few of the starters in addition to the normal 2 taco meal if you're looking to be filled, as the tacos are a little small.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zP2l6tOcxo3usAzy6MSJVA"
  },
  "MJlaGA9H1fIfWqAD7pzSkA": {
    "date": "5/10/2016",
    "text": "Loved it. Hip-Hop from the speakers, tacos galore and Mescal-Tequila-Beer to wash the delicious food down. Rather small place, best to visit with 2-4 people. Waiting times unavoidable (no reservations), but defo worth the wait. The refried beans with melted cheese, the guacamole, my duck tacos, everything was super tasty. Relaxed atmosphere on the hipster side of things. I really loved the playlist (all Hip-Hop), a great evening.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZrSxxFu8TivP-ORbO-MnLQ"
  },
  "Pl2NogVYuTgkvyk0kKZI9w": {
    "date": "9/4/2015",
    "text": "Fantastic Tacos and great Guacamole. One of the best Mexican places I have tried in Edinburgh so far.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DbdFL01Kl_NoRKXCxF81Kg"
  },
  "X79DOKgbKgy-hyBFqDoGzQ": {
    "date": "2/18/2016",
    "text": "GreAt little restaurant recommended by a bartender. Food was excellent!  Only problem is that we had to wait because it is so popular. Went to bar across the street in the meantime.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gOgLg4-PMpcuHjoJkh8EEA"
  },
  "dGgx2GuacLtlnguo0VIuMg": {
    "date": "10/25/2016",
    "text": "We just landed in Edinburgh and were looking for something quick and different. Popped in El Cartel on a side street. Amazing frozen margaritas, the carne asada tacos, frijoles and chicken wings were all perfect.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QuannmV5lZSJzrbi-neitg",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QuannmV5lZSJzrbi-neitg/o.jpg"
      },
      {
        "img_id": "Qthjns9NU_VRfBRHyLSkeQ",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Qthjns9NU_VRfBRHyLSkeQ/o.jpg"
      },
      {
        "img_id": "h7JOHsIjKFbqEqyYDQgluA",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/h7JOHsIjKFbqEqyYDQgluA/o.jpg"
      }
    ],
    "user_id": "mrAEFPNQhKs-XKNOKOhFaQ"
  },
  "JHAhkStRdimrMUZkJknRVw": {
    "date": "3/8/2016",
    "text": "So.... Yeah. This was good, really good.  I took myself here for Mothers' Day - just me, a book, fantastic food and delicious margaritas. I opted for the duck carnitas tacos and guacamole with plantain crisps. The tacos were generously heaped and the guac lasted beyond the crisps and was a delicious accompaniment to a few bites of duck.  Honestly it blew me away. I left feeling satisfied (and a bit tipsy!) and while I coule have eaten more that was really just because it was so incredibly delicious.   Huge props to the people behind the Bon Vivant here, El Cartel is a gem.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "4UQfst9jve4GCSfWpWn2uA"
  },
  "32EDMUgTpz6-p-9IrZlpgw": {
    "date": "12/14/2016",
    "text": "Haven't had much experience with Mexican food myself and my friend was a complete newbie but we loved everything about this place. The food was amazing, my friend being vegetarian had plenty to choose from. The decor is also very attractive, with quite an urban atmosphere and the staff being dressed casually. I will definitely visit again when I'm next in Edinburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6gU8eVwinIclTfg8Hlb8qw",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6gU8eVwinIclTfg8Hlb8qw/o.jpg"
      }
    ],
    "user_id": "cW57TKgl7r-SxElG02NHJg"
  },
  "cYL3VOx3e367lR6oAEGsVQ": {
    "date": "2/26/2016",
    "text": "El Cartel is all casual and cool, with dim lights and hip Mexican interior. I came here with two friends with margaritas and tacos on the agenda and left positively unwound at the end of a working day. Staff were such a pleasure and made our visit a fun, memorable one.   The mixed berry frozen margarita packed a punch. This grown up slushee made for one delicious cocktail. We'd all ordered different flavours so, after trying the mango, peach and apricot and also the original margarita, I can confirm that they're all pretty damn tasty. I'm not a tequila drinker and I don't like my drinks too strong, but this was just perfect; strong but not overpoweringly so.   The food? Outstanding! We ordered just about every taco option on the menu and one from the specials board; a total of ten tacos. This meant we got to try as much of the menu as possible and also satisfy our insatiable post work hunger. I tried duck, beef, pork and cod and, whilst I'd normally have preference over certain kinds of meat, I genuinely can't pick a favourite because they were all so delicious. Every dish was a standout; every taco a winner; every bite a pleasure.  Tacos, anyone?",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "8rI2CoS4ltQePbZceSOgow"
  },
  "dbzmbi19evsVWOFP574-7A": {
    "date": "3/8/2016",
    "text": "Cute small restaurant but be prepared for a long wait. Definitely worth it but I recommend showing up around 6 to put a name down and then going to a pub in the area while waiting. The food was delicious, but the plates were a little small so order a couple plates. The margaritas were good & strong.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "fgJeX63H8D8lhX9lGUkvWw"
  },
  "K50imynfQ2IeJj_ENIGNGQ": {
    "date": "4/16/2017",
    "text": "El Centro serves quintessentially delicious Mexican fare. The restaurant is fairly small with about 10 tables and no waiting room. But the food is definitely worth the outdoor wait. The guacamole topped with pomegranate is served with plantain chips and hits the sweet spot. The tacos are par excellence. We had the fish and pastor tacos and would love to get them again. Although we didn't try it, the pork ribs looked divine. The chocolate chili ice cream is the perfect end to the meal. Reminded me of the great Mexican cuisine I've grown to love in Texas.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FiCR7moMbwPHZOvuby9JHw"
  },
  "3hxtXIHUSNBGvNVeZzmyrA": {
    "date": "11/30/2015",
    "text": "Man, what can I say about this place except: what a find!  My guy and I were in Edinburgh for the day and were actually looking for a pub off the beaten track when I spotted two huge Mexican flags flying off the side of a building.  Being half Mexican and missing some good Mexican food here in Scotland, you know I b-lined it over to the flags to figure out what we had just discovered.  I peered in the windows to see tops about 10 tables packed in to this wee cafe.  It looked full up, so we kept walking and I looked them up online.  First things first, it's a first come first served type cafe.  No reservations taken.  They have a website, but there's not much on it, only directions to check out their facebook page for a menu.  After searching around a bit, I finally found their menu.  Prices were pretty decent, so we walked back to see about a table.  There was one two seater available, but we were told it was taken and that we could be put on the wait list, which was 45 mins to an hour.  No worries, we could just go hit up a pub around the corner while we waited (which is exactly what we did).  The interior of this place is pretty typical Mexican.  Sombreros on the walls, day of the dead skulls everywhere and a view straight back in to the kitchen as soon as you walk in.  There are also a few frozen margarita machines and a fridge (hidden behind a blackboard) stocked full of beverages.  There menu is pretty awesome, with something for everyone (there are even veg options)  Tacos (come 2 to an order), quesadillas (come three slices to an order), jalapeno poppers (come three balls to an order), beans, rice, slaw, etc.  We ended up going for the lamb tacos, the beef tacos, the chorizo quesadilla, and the mexican slaw.  The beef tacos came first and they were delicious.  The beef was cut in bite size thick slices, so tender and amazingly seasoned.  The corn tortillas were home made and perfect.  The jalapeno poppers (they're actually called bombers on the menu) came out next.  Not exactly my idea of a jalapeno popper, but they were deep friend balls of feta type cheese (salty and chunky) with jalapeno mixed through it.  They were served with a chipotle cream based sauce which went very well with them.  Next up were the Mexican slaw and the lamb tacos.  The slaw was a perfect mixture of cabbage, carrot, onion, pomagranate seeds and the chipotle cream based sauce that came with the bombers  Deeeeeeeelicious!  Seriously, so much tastier than I could imagine.  Lastly, the lamb tacos.  Holy mole' mother of pearl, they were amazing.  The lamb was tender and shredded, topped with mint and these slices of cucumber that reminded me of a NYC deli pickle, crisp and salty.  We agreed that these tacos were the best thing about the meal, even though everything as a whole was amazing.  We looked around and noticed so many more things we could have ordered that people were eating, but were pleased with the amount of food we ordered and how full we actually were when we were done.  To top off the meal, we also ordered up some mezcal and ginger beer.  I absolutely hate tequila (unless it's mixed in to a sweet frozen margarita), so I took about two sips of my drink and passed it over to my guy who gladly finished his and then mine.  Yick! (but very tasty according to my guy- and the other people around us who were happily drinking tequila or mezcal or beers or margaritas off their pretty extensive booze menu).  This place is a hidden gem and it was a great time had!  The music was amazing (I love me some hip hop beats) and the staff were friendly and attentive.  The toilets could have done with a bit of scrubbing as both men and women were using the women's toilet, but that didn't put me off in the slightest.    We will be back for sure, and I recommend you give this place a go, asap.  Just make sure you give yourself some time to wait as this place is hopping!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "kKPUbPiq5HXpY5TfeQYswA",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom. Yummy lamb tacos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kKPUbPiq5HXpY5TfeQYswA/o.jpg"
      },
      {
        "img_id": "IgnuEWgThe-ecB6Cemppew",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom. Mexican slaw",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IgnuEWgThe-ecB6Cemppew/o.jpg"
      },
      {
        "img_id": "OoGGFqeUlq3O7Y6V1yrL2w",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom. Bombers and mezcal and ginger beer",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OoGGFqeUlq3O7Y6V1yrL2w/o.jpg"
      }
    ],
    "user_id": "t5wQJpxD_8tGusq98hIW1w"
  },
  "T2l6E3C2qoYXsNCr4V1PFQ": {
    "date": "10/25/2015",
    "text": "Call me a philistine, but I'm not the kind of guy who much goes in for 'trendy' restaurants or that style of food or eating experience. I'm talking about this sort of thing:  <a href=\"/redir?url=https%3A%2F%2Fyoutu.be%2FJvsWibR_nsk&s=0ca7626ae6cebc286688990afc75370a432206f15c4ff0538159a6ff3843ea49\" target=\"_blank\" rel=\"nofollow\">youtu.be/JvsWibR_nsk</a>  There are some cuisines for which that is absolutely appropriate and, in such instances, you would set your expectations accordingly. Mexican food, however, is not the type of thing that I want to order tiny \"tapas-style\" servings of from a bemusing and expensive menu.   My first clue that I was not to enjoy El Cartel should have been when our waiter told us that the menu is \"Mexican street-food\". Well guess what, buddy: this isn't a street stall, it's a restaurant and you're charging me restaurant prices!  The menu itself is a single, sparse page with two columns: one for tacos, one for other things. The selection of tacos is pretty varied and imaginative. Between the wife and I, we ordered three pairs of tacos (they come in pairs) and one bowl of guacamole.  The guacamole, as others have noted on here, was really excellently tasty but also amazingly small. Like maybe one tea-cup in size. That might be fine if it was an amuse bouche, but this costs almost as much as an entire burrito from Los Cardos. It was served with about a dozen plantain chips. Sure, that's more exciting than some tortilla chips from a bag, but they were extremely greasy (actually leaving pools of oil on the chopping board on which they were served), tasteless and so brittle that it is virtually impossible to actually scoop any guacamole with them.  As others have noted, the tacos are tiny. TINY. And you pay 6.50 for a pair. They were mostly quite tasty, although not well thought out practically. I don't know if there's some sort of special technique to eating them, but I couldn't take a single bite without the whole thing disintegrating. There was also a thick leaf of kale running though one and, given how fibrous kale stalks are, it was impossible to bite through, leading to the entire taco being turned inside out and plopping onto my plate with the first bite.  The flavours are interesting, though. Everything seemed very well prepared and the ingredients harmonised together. I don't know about authentic 'street food'... do street tacos in Mexico really come topped with crumbled sheep's cheese, pomegranate and toasted pumpkin seeds?  I want to emphasise that the ambiance and decor inside is *not* that of a fancy restaurant; it's very casual just like the service, incongruously with the pretentious menu and lofty prices. A number of very hipster-looking people were wandering in and out while we were eating, greeting the waiting staff with hugs and kisses right in the middle of the restaurant. This is run by hipsters, for hipsters and it felt a lot like I was sitting in a stranger's living room rather than in a restaurant.  After the wife and I ate three diminutive tacos, half a small bowl of guacamole, half a thimbleful of beans and drank one bottle of beer each, our bill was just shy of 40. I left hungry, unsatisfied and irritated.  Don't get me wrong, the food is great quality in here and tastes pretty good. But decide what you are, guys: a fancy restaurant or a Mexican street-food dive. You can't charge the prices of the former with the presentation of the latter. The ingredients of Mexican food is largely tortilla bread, rice, beans and vegetables. These are seriously cheap ingredients and there's no reason to be so stingy with portion sizes.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "gHFoIL1HxfJ7NTV414b0zQ"
  },
  "5QasNC3v5itMxm6uuS5xhQ": {
    "date": "5/20/2017",
    "text": "THE GOOD: Great atmosphere.  Handmade tortillas.  Well prepared and varied taco selections. We highly recommend the pork tacos. Extremely flavorful.  Unique take on guacamole with the addition of pomegranate adding a juicy and slightly sweet flare with dried Plaintain chips. Highly recommend.  Fair tequila selection.  THE BAD: Would benefit from a traditional salsa choice with mixture of tomatoes, onions, jalapeno, cilantro, etc... that being said their guacamole is a wonderful substitute.  Margarita machines?  We don't drink margaritas though they had two separate margarita machines. I'll leave that up to your own decision making.  THE UGLY: Nothing of mention.  OVERALL IMPRESSION: Though we were visiting Scotland for the first time and wanted to focus solely on the home country foods, the yearning for traditional Mexican was too great. Luckily we were able to find this fantastic restaurant off of one of the side streets. Yelp did not disappoint as this is definitely the number one Mexican restaurant in Edinburgh. There is a sister restaurant we visited serving more traditional Scottish dishes called \"Devils Advocate\" which also deserves a visit. Make sure you come early or make a reservation as this place books up quickly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sbdzqZwlWc4WXQ4FA0hVgQ"
  },
  "eIsT7lXMvXU_nDmN49KjQw": {
    "date": "4/16/2016",
    "text": "I went for lunch one Saturday. I would rate the food and experience as average.   The serving style is a tapas approach but I found the portions quite small. The quality seemed good but it wasn't particularly tasty.   The service was slow but polite and friendly.   Surprisingly my biggest annoyance was the sweary hip hop playing and no wine available to drink. I didn't hate it but I wouldn't go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aB3N2z0XsnPepbt9Cgziwg"
  },
  "F85pc1c8Tm10LathZRSXcQ": {
    "date": "8/27/2015",
    "text": "Yes. This place has the best tacos I've had this side of the Atlantic Ocean.   Everything about this tiny restaurant is cute, from the decor (sugar skull fabric cushions, slightly glam turquoise wallpaper with gold skulls, rustic wood tables), to the Day of the Dead beer and the counter which is also a display case for a ridiculous range of tequila.   The menu is short but perfectly formed,  it has a selection of tacos, sides and small dishes that were all excellent. The server explained to us that the food was tapas style and that everything would come out when it was ready. Myself and two friends ordered three types of taco, three small plates and all the sides, and every single thing was fantastic. I highly recommend the steak tacos and the guacamole with plantain chips was really great too! Lucky we had a large table because it was covered in food but we finished every scrap.   The whole lot of that plus five drinks came to less than 70! We were so happy with the whole experience we've all vowed to come back with others.   A word to the wise: because the restaurant is small and they don't take reservations it can get busy, but if they don't have a table when you arrive then you can nip across the road to the Bon Vivant for a beverage and they will come to get you when they have one free. Top service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "0BwtLdG8MCHEVZp018LnCw"
  },
  "ssnrTS29QKlGKdtWkPDM-A": {
    "date": "1/12/2017",
    "text": "Local Scots, please stop recommending this place to anyone who's ever had real Mexican food or even modern, fancy-fide Mexican food. This place doesn't serve either.   It serves over-thought  (too many ingredients), ill-proportioned (tacos are top heavy making them unable to be eaten like a TACO) and overpriced (8  for pinto bean side..whhhaaaat? Unless they're adding gold flakes they are making about 800% profit on this beans). Guacamole is tasteless (add salt or anything to make better).   I grew up on homemade Mexican food but also enjoy the fancier, non-traditional type too. I'm open to all types of interpretations but found El Cartel to be disappointing - especially for how much we paid.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hCBpZ9K3jdBnLQQGALzQeA"
  },
  "CqnP1DF4hWWE7Bhh0uydxg": {
    "date": "9/25/2015",
    "text": "Lets have a for real talk about Mexican food for a minute: what it is, what it isn't, and why it's amazing.   Tex-Mex, as good as it can be, is not authentic Mexican food. Burritos are God status, but they're a Texican creation. Mexican food is not nachos. It is not salsa from a jar. It is not gummy flour tortillas. It is not smoking mountains of ganja and then going to Taco Bell.  Mexican food IS: colorful, textured, vibrant, bold, harmonious, spicy, and emotional. El Cartel is Mexican food! Mexican food is El Cartel! As good as any high-end restaurant you'll find in DF, but found, weirdly enough, in Edinburgh.  I thought I was going to go to this place to get barely passable Mexican grub. Just enough to cure any homesickness I may have been feeling. After all, I'm in the UK... how could I expect more? My first clue I was wrong happened when I stepped in the door. It looked like I had rolled into Boyle Heights or Huntington Park. They were bumping Gangstarr. Everyone had neck tats. There was no way in fuck I was in Scotland.  They made platanos amarillos to go with their epic guacamole. It was an amazing textural substitute for tortilla chips, and healthier. Their Mexican slaw used pepino seeds to make an incredible crunch. Pomegranate was used liberally. Their duck tacos were just.... stupid. They were so good that I scored seconds. My boyfriend (a lifelong Angelino) said they were the best tacos he's ever had. I concur.  I also bought a bottle of their hot sauce, I'm cheating on my girl, Cholula, so you know that ish is the bomb.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "mmPEgnf2sMe18jAhSmDn4w"
  },
  "kueKeZcZ0xmS4hGZkd771g": {
    "date": "5/24/2016",
    "text": "We are here from California visiting.  We all like mexican a great deal and we know good mexican food.   We were looking for something different eat that was nearby the apartment we are renting.  El Cartel came up second and we thought it would be fun to try mexican food in Edinburgh. We didn't have high hopes, but the reviews were good so we decided to give them a shot.   They were busy (on a Tuesday night) and we had to wait 1/2 hour to be seated.  When we returned they were ready and we got right to ordering.   The food came out quickly and hot.  We found the food to be delicious, the spice palette was spot on and the idea of small plates is brilliant.  The drinks were wonderful and we really enjoyed the concept.    I wish we could pack them up and take them home with us.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YwQn8XzWrx12dkGZMjpCBQ"
  },
  "mZ8k-gWtS-8zjMFJ8b1KZg": {
    "date": "4/23/2017",
    "text": "Damn good food and the margaritas, dios mio! Popped in with some friends gif a late lunch and we all agreed every item in the table was amazing. My favourites?  The Street  and the Sweet Potato taco were immense.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2gmmRsPK2CUTkNZsTLFksg"
  },
  "3sFDITwRsVzRZKARWM8dLw": {
    "date": "12/13/2014",
    "text": "I was on a mission to try this new restaurant. After having spoken with a fellow foodie I had learnt that El Cartel make everything fresh by hand. Which meant they make fresh tortillas by hand !! This is a big deal. They also don't use the usual, masa harina but blue corn which is much more flavoursome. I was sold. It's been practically impossible to find this level of freshness with Mexican food in Edinburgh, I had to try it ASAP!  We trucked along, to the old tex mex 2 location and were sat in a lovely booth. I was very impressed with the music selection, it's not everyday (or ever) that you hear souls of mischief in public these days.    The menu is very minimal but everything is cooked fresh, prepared to order. We ordered the guacamole & plantains, which were light and crispy. The guacamole had a little spice but nothing my toddler couldn't stand and was topped with fresh and sweet pomegranate seeds. Very lovely with the avocado pieces, and chunks of Mexican cheese (maybe cotija? A crumbly and light not very overpowering cheese) everything very fresh and tasty. And spot on taste wise.  The tacos were very good, each pair comprising of many different toppings. The steak had salsa verde some kind of cabbage and spring onions . The tortillas were very tasty, they had this nice earthy corn taste that you  don't get from the store bought ones. Very authentic indeed.   The carnitas pibil was spicier but also very tasty. The pork is roasted with ancho chilies  and quite literally smothered in a red onion escabeche but seemed more pickeled to me. Either way very flavourful and delightful.  We all enjoyed every bite.  Really impressed and hope that this place does really well as the food is excellent and it is quite nice to eat homemade tortillas!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 4
    },
    "photos": [],
    "user_id": "F0nFAY1Qi_7it_Q52n3nTw"
  },
  "ktViSi41PqfPfNYtNcNmXA": {
    "date": "9/30/2015",
    "text": "What can I say, the other 4-5 star reviews are as what it is. Defiantly recommended restaurant as a must try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lB8-lyRGiPO8ebtOkyJfIg"
  },
  "eHFKprb0w2RFylZZX6dfdg": {
    "date": "11/22/2017",
    "text": "I'm from New Mexico, a state in the southwestern US, so I've been dying to find a good Mexican restaurant. Most of the ones in Scotland are mediocre at best and usually just disappoint me. However, this place is pretty close to the real thing. I had a random margarita that looked good, but it was okay. However, alcohol is alcohol and I won't throw out or send back anything with tequila in it, so I drank it. We got the duck carnitas tacos, carne asada tacos, and street corn. I wasn't a fan of the duck so much, but I loved the carne asada tacos. My partner loved both of them. The asada were so close to ones from home. I was also a huge fan of the street corn. It wasn't like traditional street corn but it was good. The taco portions could do with one more taco, I think. The service was also really bad, especially considering there's only maybe 10 tables in the place. The two working seemed really annoyed at having to do their jobs and just had attitudes the entire time we were there. I hated asking for anything. It also took a really long time to get my margarita out, even though they have them premade in machines and literally just had to pour it. The service is the main reason this place didn't get 5 stars. I know it's different over here in the UK, but there service was really terrible.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DhbExwYDt5zckqXi9wfnuw"
  },
  "2JMUW9Me9J5ie6B4XWQedw": {
    "date": "7/4/2016",
    "text": "Probably the best Mexican food i've ever had. Food was amazing and very funky. Ox Tongue taco blew my mind and was very impressed with the food taste and the friendly staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "atqqCJk1VdGsl8BegUKcjw"
  },
  "paH_2xtOdtbSF76XkURrpg": {
    "date": "8/8/2016",
    "text": "The best Mexican fusion food I've had, and I grew up in California. Everything I tried was good -- three different types of tacos and a couple of the appetizers. The only menu item I wouldn't recommend is the Horchata. It tastes more like Bailey's than anything else.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3zo5ZXMbZPBkC6JM0Br8kA"
  },
  "KJHLtMld8CuClKfjHYTOOQ": {
    "date": "10/1/2018",
    "text": "It was odd to think Scotland would have incredible mexican food, but this place is hands down the best food we had in Scotland.  I'm not a vegetarian, but the mushroom quesadilla was maybe one of the best items I've ever had.  The blood orange margarita was amazing, and the tacos can't be beat.  You MUST go!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K6a3iRubPAxe7dv9AA_7BA"
  },
  "2UM6_VopimKHB_NDi8NkwQ": {
    "date": "12/23/2018",
    "text": "It was really good! The service was a little slow though and had to wait for our order to come a while. Otherwise, the food was delicious!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LIIhJmjCgVEy8AA6YjVQ_w"
  },
  "0bhs230gPJJelQijCqjVTA": {
    "date": "4/22/2018",
    "text": "We found this place almost by chance as a recommendation from the hotel we're staying at.  This is our first time in Edinburgh and after a bit of a whirlwind through lower Britain, El Cartel was a bright reminder of home in Los Angeles. Super brief context cuz anyone who brags about their superior ethnic cuisine palate should get eye-rolls instead of \"elite\" statuses on Yelp, so I felt compelled to write after we ate here and read reviews to see how other people's takes were. If you're from Cali or profess a need to have \"authentic\" Mexican anywhere other than SoCal, you're delusional. Moving on... First thing's first, it's walk-ins only, maybe seats 20 people, and has the atmosphere of a small college town pop-up housed in a typically dank old Edinburgh building. I imagine since there really isn't anything else like it around, it may be on the busy side, so don't be pissed if you have to wait a tad to be seated. The wait staff were friendly and conversational for a bustling little eatery. What El Cartel with their spin on what we're normally used to was damn tasty. For starters we ordered the guacamole and quesadillas. The guac came with sheep's cheese and pomegranate seeds which were surprisingly refreshing, offering a dash of sweet to compliment the cheese. Could we have pined for cotija? Sure, but the fact that they played with a different (and more locally sourced / familiar cheese offering) made sense.  The quesadilla had sweet potato mixed in with the \"soft\" cheese to change up the texture and thicken up the offering, with crema and a green sauce that we thought worked.  For the mains we had the duck carnitas tacos and the cochinitas pibil tacos. Definitely order the pibil in all its savory glory, you won't regret it.  If you're curious about the drink menu, these guys go nuts for mezcal. I think our big takeaway from El Cartel was that they  built a menu that honors what makes Mexican cuisine as we know it familiar, while doing what any young restaurant with balls should do, which is adding their own spin and owning it. After all, this isn't paint by numbers French dining in a European country, this is a fun, small bonkers Mexican joint in Scotland that loves habanero peppers. Put that combination of concepts together in your mind and let it simmer your curiosity. You won't regret it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4f5ufE-D59duqyVWAj-fgA"
  },
  "SZV-sS-gWo18FT3N7k_9rw": {
    "date": "1/2/2015",
    "text": "Considering it's only been open for a month or so,  I consider myself VERY lucky to have stumbled across this absolute gem whilst on a long weekend in Edinburgh.    The food is absolutely amazing with the combination of flavours in the tacos that blow your mind. Fresh, flavoursome and fabulous to say the least.   We opted for the salmon cerviche and guacamole for starters.  Both very fresh and immediately showed us that we were dealing with high standard food.  The tacos (at a reasonable 6.50 for two) are incredible.  We visited this place twice because we loved it so much so got to sample a few of them.  Our favourite was the fish tacos, but the pork and duck were also both excellent.   The staff were really friendly but not overbearing and the margarita's were refreshing and a perfect accompaniment to the food.    They've kitted the place out with dark colours and bright Mexican skulls which match the rugged rap music which pumps the ambience of the entire place with an edgy (yet not pretentious)  hipster feel.   Highly highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4fYVFlntFi0YIFiYhEaQXQ"
  },
  "Q2JvvnYScvJWVSGEWHlb6A": {
    "date": "8/21/2017",
    "text": "Having enjoyed meals at this restaurant group's other places in the city,  we decided to give this a shot (and wait the consistent day-over-day 90 minute wait for a table).   The restaurant is very small and is not conducive for large groups. The staff seemed to be friendly and helpful. A nod to them for having nice mezcal options! Rey Campero is one of my faves from Mexico and it was nice to see it in the UK.   We ordered the guac, street corn, plantain tacos and duck carnitas tacos. I will preface this with the following - if you are trying to find authentic Mexican street food, this isn't the place for you. The guac has pomegranate seeds & the tacos have pumpkin seeds, and I can see some folks getting upset about this.    Overall the food was good, but not great. If there isn't a long wait and you want to explore a new take on tacos, this is the place to go.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8v7G0-276LGTtEtDZWymnQ"
  },
  "GOfbdNpJZaahZ_LbcGQxsQ": {
    "date": "7/29/2018",
    "text": "Being from California we didn't know what to expect from a Mexican restaurant in Scotland but we were pleasantly surprised. The food is Amazing. We ordered the chips and guacamole, bombers, corn, and tacos and I couldnt pick a favorite cause they were all great. I could see that this place could get pretty packed at night cause it is on the small side but I highly recommend it for lunch.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ac0SUDg6QOlq_d1-rCQ_vA"
  },
  "mzTc4OzhIjIl5x8yy2PQcQ": {
    "date": "4/28/2016",
    "text": "El Cartel has shot up the list to one of my top eateries in Edinburgh.   Firstly, I love Mexican food. It's my favourite cuisine. I cook it a lot and I will never say no to something that comes with guacamole. El Cartel has great food. It's in the street food style - order a bunch of little dishes that will arrive at different points.   It's brilliantly manages to stay casual but also quite classy. This isn't like getting a burrito from a fast-food tex-mex joint. Everything has been made with a lot of care and looks fantastic. Flavours are interesting and sometimes a bit different. The guacamole with feta, pomegranate and plantain sounds weird on paper but is fantastic. I loved the corn on the cob.   Secondly this place is hipster-cool in the best possible way. The love a bit of hip-hop here and they even have their own Spotify list. They have an extensive selection of Mezcal. It's relaxed and fun and has a bit of a buzz. The often hour-long wait to get a table is an indication that it's a trendy place to be.  It's not somewhere to go for a budget dinner, because you should try a few different dishes. I've never felt it was overpriced though.  Immediately after my first visit I wanted to come back. And bring friends. I love it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "l9UE4e_7htdgEpqZpFlkeg",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom. Sweet potato quesadillas.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/l9UE4e_7htdgEpqZpFlkeg/o.jpg"
      },
      {
        "img_id": "6xEiRmtEj79DVM1mgJTJgw",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom. Squid tacos (special of the day)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6xEiRmtEj79DVM1mgJTJgw/o.jpg"
      },
      {
        "img_id": "dLobpbGwEnfYDJD0_RTcow",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom. Sweet potato tacos.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dLobpbGwEnfYDJD0_RTcow/o.jpg"
      }
    ],
    "user_id": "eFqg1qaOBHq_Od6fRlMcWA"
  },
  "37drTsqWmJvoEgiieYYWPg": {
    "date": "4/13/2016",
    "text": "So many reasons yes! Great food, warm atmosphere, helpful staff, tasty drinks and did I say great food??  Some friends were visiting for the weekend and told me about this place. I personally hadn't heard about it but looked it up and found some good reviews so we went for it and so worth it. To start a mango margarita is right up there as a great brunch drink followed by a nice selection of mexican beers, but the food- yum! We could all just keep going. The waitress recommended 2 or 3 dishes each and I think we ended up with 3 or 4 each and if I had more room I would have gone for more! The ceviche and plantain chips I could eat all day!  The specials were delicious and I want to go back to see what other new exciting dishes come out of that small kitchen! I like how the menu is simple enough that you don't get too lost and the sweet potato taco had a perfect bite mixed with crunch and flavour!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "P_Zuhs6Cr-Cf_q7X6t4Iqw",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom. ox tail special!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/P_Zuhs6Cr-Cf_q7X6t4Iqw/o.jpg"
      }
    ],
    "user_id": "BcvtWhc5-1S_Dr0A3Esimg"
  },
  "7mHLBcrxqvuxvmM7urih1A": {
    "date": "6/11/2017",
    "text": "On Saturday early afternoon we took a trip to this delightful Mexican food. There was three of us and we got served straight away. It small and great for conversations with friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VcZhY420gOcRvwC5Z6RyFw",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom. Quesadillas",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VcZhY420gOcRvwC5Z6RyFw/o.jpg"
      },
      {
        "img_id": "r9iSKkswi_YnMbdyngkp-Q",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom. Tacos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/r9iSKkswi_YnMbdyngkp-Q/o.jpg"
      },
      {
        "img_id": "jX1awxtjY3FUtubGKTJVqQ",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom. Guacamole  dip!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jX1awxtjY3FUtubGKTJVqQ/o.jpg"
      }
    ],
    "user_id": "-0wDYXGaz2mrHd6fQUvPHQ"
  },
  "DmzXQLUZQXVGwZoX_u8t_A": {
    "date": "9/26/2015",
    "text": "I was beginning to think that maybe I didn't like Mexican Food.  I've tried many 'Mexican' restaurants and was getting fed up (literally) of stodgy food served with cheap mass produced tortilla chips.    After reading the reviews I decided to give El Cartel a go.  First attempts at getting a table at this tiny, popular restaurant that doesn't take reservations all failed.  But today, after skipping lunch to cram in as many Doors Open Day venues as possible, we found ourselves starving at the awkward time of 5pm.  Well awkward quickly turned to awesome!!  We got a table at El Cartel!  First glance at the menu left me bemused.  A couple starters and a selection of tacos.  No buritos, enchiladas, fajitas, nachos...... I was hungry.  Would there be much I wanted?  Well,  it didn't take long to realise we wanted EVERYTHING!  The flavor and texture combinations of the dozen or so tacos all sound fantastic.  And the starters were just as 'appetising'.  For the 2 of us we decided to get the Sweet Potato quesadilla and the guacamole (with plantain chips - NOT bagged tortilla chips).  We somehow managed to narrow it down to just 3 tacos (you get 2 of each; perfect for sharing).  We went for pumpkin, steak and the battered cod.    The food came as it was ready - which was fine for us - didn't want it all in one go.  We started with the guacamole - and it was perfect; really tasted the avocado and the plaintain chips are a new fave.  Also loved the smoky flavor the chorizo added to the sweet potato quesadillas - these I will be trying at home!  The tacos were all great.  The perfect size and a great mix of flavours and so full of veggies.  We easily got our 5 a day with the lettuce, tomatoes, radishes, courgette, kale, pumpkin, avocado, pomegranate seeds.... I think this may qualify as 'health food'!!    So, for restoring my faith in Mexican food (and not a cheap tortilla chip in sight) I give El Cartel 5 stars!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "GuINQiupQa5bUee7et3xyw",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom. Fish Tacos - my fave. Crispy batter, soft fish, crunchy veg",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GuINQiupQa5bUee7et3xyw/o.jpg"
      },
      {
        "img_id": "f7dh_tdrczO5fPA9Iwu1jg",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom. Sweet potato quesadilla",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/f7dh_tdrczO5fPA9Iwu1jg/o.jpg"
      },
      {
        "img_id": "6AmEJSi6tUTX0-6IFrohuw",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom. The third person at our table....",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6AmEJSi6tUTX0-6IFrohuw/o.jpg"
      }
    ],
    "user_id": "ptj5uhi0bNaUotgEmaRzrA"
  },
  "kn6WCIQNiww8VBZllzhbRA": {
    "date": "8/30/2016",
    "text": "Good place for Mexican food! Tried the baja cod tacos as it was recommended but it was not up to the expectation. But the sweet potato tacos was just awesome! Didn't like their tacos bread tho. A must try for the sweet potato tacos and the plantain chips with guacamole! They also have awesome frozen margaritas! Such a refreshing one :)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6_aKZG5b_n_7BAae6NgqgQ",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom. Frozen mango margarita",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6_aKZG5b_n_7BAae6NgqgQ/o.jpg"
      },
      {
        "img_id": "OAQKepDlzNrLLkWMYu7I_A",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom. Baja cod tapas",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OAQKepDlzNrLLkWMYu7I_A/o.jpg"
      },
      {
        "img_id": "76svbExZgqXdJgdHgKc3wQ",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom. Plantain chips with guacamole and cheese",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/76svbExZgqXdJgdHgKc3wQ/o.jpg"
      }
    ],
    "user_id": "PSzK38F2lazBtixEi0o1hQ"
  },
  "zT7_H-5sjjHDwMMp1zdnYw": {
    "date": "8/20/2016",
    "text": "Found our way to El Cartel after a long day of driving to Edinburgh. We were wrapping up a few weeks driving around the country and as much as we loved the seafood, haggis, etc. we were really craving something with a little...spice.  Walked into El Cartel exhausted and nearing high levels of hanger...we were immediately swept over to a table and the waitress grabbed our incredibly heavy luggage and put it in the back for us, no questions asked. SO THOUGHTFUL and unexpected.   The vibe was really cool, fast service and truly delicious tacos...we tried the sweet potato, hanger steak (incredible) and chicken. Even living in the states where we have access to pretty incredible Mexican food, we were very impressed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kzbIPm-wQRRcz9PoFzUiDA"
  },
  "7pw0cIHFUfiATr273ab_zg": {
    "date": "11/22/2014",
    "text": "Yum, yum, yum and apart from Jalapeno poppers, it is all gluten free!  El Cartel has been open for about two weeks (if that) and replaces the much missed (and good for gluten free) Tex Mex 2.  Owned by The Bon Vivant and situated on Thistle St across from TBV and the companion, it is a great addition!  A tequila list as long as my arm, a mescal  list and three types of margarita (clear, frozen blood orange and frozen blueberry and rose), plus beers then you can be well 'hydrated'.  I loved all the food we had - starters around 5 so we had plantain and chorizo fritters and guacamole with plantain chips and pork scratchings. For me the sign of great Mexican food is the guac and with pomegranate, it was perfectly seasoned.  Tacos were fab - good range of fillings (we had fish, steak and duck) and I loved them all as they were all sufficiently different with salad, veggie or spicy accompaniments!  The place is well staffed, food came quickly and good service. It's all dark wood, dark decor and rap music so more menacing Mexican rather than what you'd normally find in a chain. I loved it and can't wait to go back.  So, prices: margaritas - 7.50, starters 5, tacos (2 in serving) 6.50 and chilli chocolate ice-cream 2. We had 2 drinks, 2 starters, 3 x 2 tacos and ice cream = 43.50! Brilliant :-)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 1
    },
    "photos": [],
    "user_id": "frthTngbBHgSdk4j85HmEQ"
  },
  "axyB51RUhAkghszf7xLjCw": {
    "date": "12/5/2014",
    "text": "Oy, listen up, don't go here. Seriously, stay away, if you know what's good for you.  Because if you show up, and I'm there, I'll pummel you.  (How's my drug lord impression coming across?)   But seriously, this place is small, too small for us all to partake, and if everyone knows how absolutely amazing it is, they will all come buzzing around like flies to a carcass. Ok, ok, enough of the violent gang imagery. They invited it, though. And they're all men who work here. The owner, who was eating there when my friend and I were, is young. A bit too young, if you catch my meaning.   So the food. Yep, it's spicy as hell, delicious, with combinations I haven't seen since getting tapas in San Francisco. Good tequila menu. The ceviche and guac starters got us whet, and the tacos finished the job. So, yes, bravo.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "tVrGBW6rj1uebWnqjY-iTQ"
  },
  "jrDXwbH3pBkUBoogkdhMzg": {
    "date": "12/28/2014",
    "text": "El Cartel is exactly what you'd expect from the team behind The Bon Vivant - slick service, bangin' food and dangerously delectable cocktails.  My favourite thing about it is that these guys are consistent, putting them a mile above many other Edinburgh hotspots which can elate quite as often as they deflate. Everyone I've raved to about this place has raved straight back at me, which screams out that El Cartel is a winner. Nothing worse than recommending a spot to pals only for them to have a totally average experience.  They have a pretty small space, but a bit of clever table arranging means that there are lots of cosy corner tables to be had. Decor is minimalistic, with plenty of skull art provides a welcome pop of colour. Baby cacti are dotted around, but beware a lot of them sit at ass-height.  And the food. Every time I go I face the same dilemma - I want it all. Roughly 5 'starters' and 6 tacos, of which I think 2 flavours tend to rotate. The guacamole is wildly good - topped with feta & pomegranate, so you get the creamy avo, salty cheese, then a burst of fresh & fruity pom. These flavours dance across the tongue as if a Mariachi band were serenading the lucky diner (please note: ECM does not do Mariachi, it does hiphop). Served with pork cracklin' and/or plantain chips for dunking. I never go without it.  Tacos all come in pairs making them easy to share. Again with the flavour dance: there is so much going on in each bite, in a very good way. Bang coriander! Bang chilli! Bang delicious meaty goodness! Everything is fantastically fresh, with brilliant texture and interesting combinations - so far removed from the stereotypical fajita/burrito/nacho situation which Edinburgh's Mexican scene has been guilty of for a long time. Not that there's anything wrong with that, it's just brilliant to see the team here showcasing an alternative to Tex-Mex.  And now, the drinks. As if you needed another reason to hit this place up. El Cartel offers a rainbow of frozen margaritas, with flavours changing daily. Again, they avoid the stereotype and focus on seasonally flavours alongside classic margaritas such a the Tommy's. All tart & tasty with a good kick of Tequila. Speaking of Tequila, on the last count their menu boasted more than 50, and the knowledgeable team are more than happy to chat you through the options.  With food service running until midnight at the weekends, it's a great place to satisfy a booze induced hunger. Alternatively, the homemade sangrita would make a dynamite hair of the dog when charged with Mezcal. And the food comes fast which is exactly what you need the afternoon-after (doors open at midday meaning there's no reason to get out of bed earlier).  Every time I leave I'm already thinking about when I can next go back, and who I can show this little gem off to. A definite contender for best casual dining in Edinburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "bkb2mKYTIOupZlr73w9h3Q",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom. Guac with pork cracklin &amp;amp; plantain chips. Blueberry margarita. Jalapeño bombers.  Cactus.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bkb2mKYTIOupZlr73w9h3Q/o.jpg"
      }
    ],
    "user_id": "kUSvk0HUX5OFavCIboBZuw"
  },
  "Byrl-5_k-zSiilc1QO8EYA": {
    "date": "7/16/2016",
    "text": "By far one of the best taco places I've ever been. Seating is limited and location is cozy. The decor is hip and has a weird flair I like.   But the best part is the tacos!! I had the duck carnitas and they were amazing. I tried the avocado ones and it was so perfect and creamy. The avocado was fried and crispy melting in your mouth. We ordered the guac which did not come with plantain chips as I had seen in other yelp reviews but was still very good none the less. The chicken wings were succulent and were falling off the bone. Ox tail tacos were cooked very well too.   I live quite far from Edinburgh but if I was able given the opportunity to return I would!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7df6i8JgX80yxRBRD-r8YQ",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7df6i8JgX80yxRBRD-r8YQ/o.jpg"
      },
      {
        "img_id": "YCHTT7r8qt3m24sLT5MrWQ",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom. So good!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YCHTT7r8qt3m24sLT5MrWQ/o.jpg"
      },
      {
        "img_id": "K2ugExv3_7AXg3M1Y9zcbg",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom. Mexican corn!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/K2ugExv3_7AXg3M1Y9zcbg/o.jpg"
      }
    ],
    "user_id": "1KUhMZ2Dlbr9GVpT3DDTRA"
  },
  "nKDgShjejrKTcje8k5rTTA": {
    "date": "10/4/2017",
    "text": "I don't get it... This place was highly recommend to us, so we decided to visit it on a Tuesday. The place is very small, and unfortunately so are their portions. Tasted ok, nothing memorable but rather expensive for what it is (2 tacos for 6.5 pounds). Definitely doesn't worth the price and the usually long wait time.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9X8XPJCTqrsiGwsiyuJBTg"
  },
  "Jm_SCkN6uqgpnhxBHn7OGQ": {
    "date": "9/20/2017",
    "text": "The Broccoli and Black bean tacos were great! The corn tortillas are so soft and delicious.  Loved the guacamole with feta, pomegranate and best part--served with warm plantain chips.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ufRPrHFVMT0j4g_Qx0LWLg"
  },
  "S9c-pZm0My2Xgj8s6qlJmw": {
    "date": "5/13/2015",
    "text": "EPIC. First time here and my his place is now going to be a regular place.   Stopped by for lunch with my partner. The atmosphere is good, fairly small place so I imagine it'd be pretty packed on a Friday night.   Our server was really helpful when we ordered. We got the guacamole with plantain chips after reading previous reviews and were not disappointed. The guac was DELICIOUS.   Next up the carne asada and pork shoulder tacos. Both delicious, but the carne asada is a MUST. The steak was cooked beautifully, smoky and spicy.  After this we were still a bit hungry so also ordered a serve or the quesadilla. I'm pretty sure I could drown in a tub of these. The whole 'goats cheese with Mexican food' thing works beautifully.  Serves are pretty small, however you can just keep ordering as you eat until you get full. They also serve these amazing garlic roasted peanuts which is a lovely touch.   I'm already excited for my next visit which will certainly include a margarita :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "U1RcRAUe9rLBpdLySXCiNA",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/U1RcRAUe9rLBpdLySXCiNA/o.jpg"
      }
    ],
    "user_id": "NwVyki35xOcaxhMzHNtHDQ"
  },
  "RdsgB8iOHvQPZ1BpeYgv-g": {
    "date": "4/19/2016",
    "text": "Probably the best place to have a date in Edinburgh. Sophisticated, cool and just the right amount of lighting to make your partners eyes sparkle.  Aside from my smooshy romantic vibes, the food and drinks were tip top and highly recommended. I had a strawberry frozen margarita, which was just devine and looked scrumptious as heck. Tacos were a great size and came in twos, which was perfect to share between us. We had a variety and they were all super amazing.  Just writing this I am making myself hungry and I can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "rDacT7_YW2-geunGcmgeEw"
  },
  "ARC_2TYqTp7ngBIMTbhPpw": {
    "date": "9/12/2019",
    "text": "Fantastic! I never thought we would be enjoying an authentic tasting Mexican meal in Edinburgh, I'm so glad we found this little gem.  We're from Scottsdale AZ so we have a lot of Mexican food options.    It's not easy to find good food here in Edinburgh besides Fish & chips and even that can be a bit challenging.    The tortillas were fresh & warm.  The carne Asana was so delicious! Very fresh and definitely had an authentic flare to it.    The #1. Complaint SMALL SPACE!  Very small tables almost feels like your sitting with your neighbor which is not a comfy feeling.    Nice list of Tequilas & Mezcal's I personally had the Patron Anjeo x 2 ! To keep me warm since it's so chill here.   Try the popper they remind me of jalapeno poppers without the jalapeno, they are round crispy & come in 3, filled with cream cheese & jalapeno.  Comes with a creamy chipotle sauce.    Table of 3 each having an order of two tacos two beers and 3 shots of tequila for a total of 60 or $60 USA",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "j1SYOWoyMsukyLG5glEyHA",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/j1SYOWoyMsukyLG5glEyHA/o.jpg"
      },
      {
        "img_id": "gOpy9tSnsdv4YwqUV9420g",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gOpy9tSnsdv4YwqUV9420g/o.jpg"
      },
      {
        "img_id": "-DyUt_uIRkYE16bT26ma6w",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-DyUt_uIRkYE16bT26ma6w/o.jpg"
      }
    ],
    "user_id": "8R-yPVsE2bHDrY6xORQ5-A"
  },
  "_Ppz8P-bcezV3pnP7CSzPw": {
    "date": "6/7/2019",
    "text": "LOVED this place. The food was amazing and the vibe was youthful, upbeat, and fun. It's a causal dress place and staff didn't seem to have a set uniform. Their music mix had me humming and singing obnoxiously at my boyfriend the whole night.  My guy and I had three orders of tacos and an order of corn on the cob. They were phenomenal and filled us up. We also both ordered frozen margaritas which were also great. I'm not a huge fan of the giant margs you get at other restaurants; these sizes were perfect.  I strongly recommend this place to all couples and groups. Seating is somewhat limited and packed but it fits the atmosphere and we didn't mind at all.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fIN5iIQdvMBKbXZzCpRhRw"
  },
  "cMlyU5wRILkaZ91UBijt6g": {
    "date": "9/12/2019",
    "text": "Not bad, but a long wait, and service without a smile. When we arrived, the small space was packed so we put our names down for a table and were told it would be 30-40 minutes for a party of two. An hour later, we called the restaurant for an update and were told it would be another 10-15 minutes. 20+ minutes later, we headed over, and were told the next table was ours. They didn't exactly seem welcoming. They have a good selection of tequila and mescal and we enjoyed our tacos and guacamole (with plantain chips). The ceviche was underwhelming. The servers were neither friendly nor attentive, and seemed disorganised with respect to seating people based on the names on the list. Nonetheless, a good spot for Mexican food in Scotland, especially if you can get in without a wait.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2QTpk-gYv5OTKXtOOE1HnA"
  },
  "qKf60sx6tuXCZJJcC3DhQg": {
    "date": "7/22/2019",
    "text": "We dined at El Cartel on Saturday night and the food was very good.  The service was very good, and the margaritas were very good.  We were told there would be an hour wait, but we only waited about 1/2 hour.  The food was unique in a good way.  Very fresh and it all arrived really quickly.   I only have one BIG complaint!  The music!!!  We all hated it!  It was really loud hiphop and as we were seated in a corner, I think there must have been a speaker right over our heads.  But, the fact that hiphop was playing in a Mexican restaurant made no sense and it actually created a unsettling anxious mood.  Two of us are over 60, but the other two were 26 and 30 and whilst they like that kind of music sometimes, we all felt it was so wrong for the restaurant.  There must be modern Mexican music that isn't rap or hiphop!  It really ruined the experience for us.  I really really liked the food and would like to go back, but if that is the music that is always playing, there is no way.  There is another location, but I don't know if they play the same music or not.  Please change the music so we can come back!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1Be-xNQObaeO1qV-kH8AvA"
  },
  "MdCeleQdG2nlFrEwwJj72g": {
    "date": "8/26/2019",
    "text": "Small restaurant but absolutely amazing. Staff is friendly, the music is good and the food is great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xp4CfWECrKEv_xAgKfUmaw"
  },
  "7rmj8i2nk_46-iJj1AKwww": {
    "date": "8/14/2019",
    "text": "Stumbled upon this place the first night we got into Edinburgh and immediately knew we had struck gold!  It's hard to find authentic Mexican food and had been craving it for the past few days. El Cartel hit the spot, so much so that we came back the next night. I would highly recommend this place while in Edinburgh.  If there's a wait, pop on over to Bon Vivant for a cocktail and they'll come get you when your table is ready.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nwGJWBdcbeOpTpgIOoWyJg"
  },
  "BYaLpMR-bqatBln2XoRQKA": {
    "date": "8/20/2018",
    "text": "This place was really delicious. We went around noon and it wasn't very busy. We ordered the Pibil tacos, duck tacos, bombers (jalapeno poppers), and street corn to share. We especially enjoyed the duck tacos and street corn. It all was good. The only reason it wasn't a 5 star visit is because of the value. Two very small tacos for 7 is quite steep. Also, they seemed to forget the street corn. Not sure their process for deciding which table gets their food when, but the brought everything out within minutes, except the corn. Once we were finished and a substantial amount of time passed I inquired to the whereabouts of the corn and it appeared they still had the ticket in a queue of sorts...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6mOHNaIPhjYC5FQP1O9Hpw",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6mOHNaIPhjYC5FQP1O9Hpw/o.jpg"
      },
      {
        "img_id": "TAVZyrHy8Gm3DEfVAcBs8g",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TAVZyrHy8Gm3DEfVAcBs8g/o.jpg"
      },
      {
        "img_id": "fLJq4v2ri1DV0MK_V4-aLg",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fLJq4v2ri1DV0MK_V4-aLg/o.jpg"
      }
    ],
    "user_id": "VbUHCOtm94rmoPIoXA0yMg"
  },
  "nlnacwNHDwuFHUk01xR3tQ": {
    "date": "5/12/2019",
    "text": "Mexican food in the heart of Haggis country? You have to try El Cartel. Flavors are layered so expertly..the depth of deliciousness is hard to explain. There is no reason to skip El Cartel in your culinary adventures in Edinburgh. Enjoy, Amigo!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XgjMc2zc5RWEujeMJ0PhKA"
  },
  "mw3gX5d-kmXHFa140RvQhQ": {
    "date": "10/7/2018",
    "text": "Best tacos of my life. I got the duck confit ones and the duck was cooked so freakin well and was crispy finished. The corn tortilla was so authentic and soft and real and ugghhhhh. My friends got the carne Asada and quesadillas and loved them. Also got the guacamole and it was such a different twist on guac!   Go here!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6woSVfqdfY8NsDEFNhFDPA",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom. Duck confit tacos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6woSVfqdfY8NsDEFNhFDPA/o.jpg"
      },
      {
        "img_id": "kCQhBeYMgMMDpGQxNPa2mQ",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom. Guacamole National",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kCQhBeYMgMMDpGQxNPa2mQ/o.jpg"
      }
    ],
    "user_id": "gCP7jwzBCuCjVGFD1bRkYA"
  },
  "vTFR8OUHIKo8xZjhnWgkGg": {
    "date": "3/14/2019",
    "text": "Our first time in Edinburgh. For \"Mexican\" food, I gotta say not bad. The carne asada tacos did not taste like what it's supposed to taste like our of a BBQ grill, it tastes like it was done on a stove, the meat wasn't cut into small little pieces like tacos are supposed to be but rather chunks and my taco fell apart. The tortilla on the other hand very close to hand made tortillas (yay). Aside from that it has amazing flavor. The duck, which I've Never had, tasted like chicharron  so that was good for me. The quesadillas yummy! I think they were made out of sweet potatoes. Their drinks are awesome, especially the Tommy. I would definitely be coming back in the future.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "E0dJc1LtSkZ19VDrn65h9A",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom. Tommy",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/E0dJc1LtSkZ19VDrn65h9A/o.jpg"
      },
      {
        "img_id": "td_3I79U-1OWBZmixukXbQ",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom. Carne asada",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/td_3I79U-1OWBZmixukXbQ/o.jpg"
      }
    ],
    "user_id": "cz70sTy6A14KU9b4KAze3g"
  },
  "KdHIIHH_raRB_Aq_YE409w": {
    "date": "5/13/2019",
    "text": "Amazing food. Good drinks. Good service. Like the music. Nicely done! Tried the veggie tacos. Incredible!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eFoSMXidXvnCcMU2c96NRA"
  },
  "18pyVfssooyTR7ky25gGrA": {
    "date": "4/16/2019",
    "text": "This was our last dinner while in Edinburgh and it was unforgettable! It is tiny so you have to be prepared to wait somewhere outside of the restaurant. They do take your phone number so we were able to take a walk and go to a local pub while waiting. They do not take reservations so you have to time this so they don't close if the wait is too long. We went by at 9:30 on a Saturday evening and sat by 11:00. the tacos and guacamole were really delicious. I would highly recommend this for something casual and very fun in Edinburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "icsKqtfjENqIjhdWx9nOQA"
  },
  "HKVUDJn5YTGEb77OlTgtHA": {
    "date": "7/29/2018",
    "text": "Impressive Mexican found in the heart of Edinburgh. Tucked around the corner from our flat, El Cartel is a small but cozy spot. We went just after 8pm and there was a small group waiting outside. We were told that it would be a 10 minute wait but we were seated a lot quicker. We started with the guacamole which was served with plantains. It was fantastic and the guacamole was topped with pomegranate seeds which was surprisingly yummy in the guacamole. Next up we had the street corn which is dipped in crema and spiced cheese. So delicious! My husband had the Carne Asada taco and really enjoyed it. The only disappointment was the cod taco, as I found it lacked the flavour of the other dishes.  Even so, this was still one of our favourite meals on this trip. They also had four different daily margaritas which you can have frozen or on the rocks. I tried the frozen mango and it was perfect. One tip, there is a tiny bowl of hot sauce on the table, be sure to try a small taste before spooning a large dollop on your food. My hubby's mouth was on fire for half the meal!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rQ_Xx2845eed7sKQP0p6DQ",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rQ_Xx2845eed7sKQP0p6DQ/o.jpg"
      },
      {
        "img_id": "VcZoojgOv6p4Qsk20qXiVQ",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VcZoojgOv6p4Qsk20qXiVQ/o.jpg"
      },
      {
        "img_id": "j_8BLbKU5nI48nv53cdrMQ",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/j_8BLbKU5nI48nv53cdrMQ/o.jpg"
      }
    ],
    "user_id": "hihNuqYNKDwAwHeGNURE_g"
  },
  "dOoKtWrup2VpQLKER_DqMQ": {
    "date": "2/28/2019",
    "text": "Eclectic setting, hip different approach to this cuisine, Worth a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N0I25SdS44Dgut3dPCm05Q"
  },
  "jnystLoT9obd5LwYhV_xMA": {
    "date": "1/13/2019",
    "text": "I still cannot get over this place. As a native Southern Californian, I know good Mexican food. I just didn't think I would travel to Edinburgh to find it! A quaint little hole in the wall, El Cartel's staff are awesome, and the food... the FOOD! So fresh, flavorful, AUTHENTIC. I would go back just to eat their fresh tortillas alone. You must go if you're craving wonderful Mexican food. Just be prepared for a bit of a wait if you dine during normal peak hours. Worth the wait!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "07L1lvXe3are2o-7f6z1vg"
  },
  "cuIJhSFzk3EDdCggB47ksg": {
    "date": "5/10/2019",
    "text": "So far the best meal I've had in Scotland. The menu was small but diverse, and everything we ordered was absolutely wonderful. Great margaritas too. It's small, but very cute inside. Staff is helpful and diligent, and service is quick. Would give six stars if I could.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a9pHYiXvXTmNMpUUL8N1dQ"
  },
  "xPQf5m0dqbN2dlarI4caGw": {
    "date": "12/8/2016",
    "text": "I had one of my worst European dining experiences here, so unfortunately everything good about it was diminished.  It was pouring rain the night I came here (from a highly recommended review from a local), so I had extremely high expectations... coming from Los Angeles, I take Lating/Mexican food very seriously.  The shop is very small. No more than seats for 15 people and is like a small obstacle course just to get to your seat. The bathroom is even smaller and more awkward.  When I walked in, I was told by the host that I could not sit anywhere as a party of 1 & that I could go across the walkway in their sister bar and have a drink while I wait - 30-40 minutes. Considering it was pouring outside, I decided to just deal with this and go over next door.  I waited over 45 minutes and still no one came by - I therefore called them and asked. They basically replied with \"We will come get you. It will be a few more minutes.\"  Finally, she appeared, so we walked back inside... only to find that I was SHARING a table with a party of two! If I could share tables, why was I not able to sit at that same table 45 minutes before?  At this point, I was irritated beyond belief and decided to expedite my experience here. I ordered duck tacos and their \"supposedly amazing guacamole.\" Look, this food is definitely a Scottish interpretation of Mexican/Latin food... The duck tacos had pumpkin seeds and some other ingredients I couldn't decipher. The guacamole had pomegranate seeds (?) & some random cheese on top. And instead of chips, there were plantain chips... which Mexican people don't usally consume. That's more Latin America.  Service was very cold. I felt like I was being profiled. I did not enjoy a single thing about this place. I do not recommend it at all.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "bNbSy8RGHf8BE4P9K1_IHg"
  },
  "ZunmAK2Otkg6yD8-dssnsA": {
    "date": "1/3/2017",
    "text": "Great Mexican place! Cheap and cheerful.  Went a while back and had the daily special and the corn on the cobb.  Special was great but smothered in sauce, made a mental note to ask for it on the side next time. The corn was fantastic though, covered in Mayo and paprika - they only way to eat it if you ask me.  They also have flavoured frozen margaritas. I'm not a big cocktail drinker but that stops when there are frozen margaritas.   If I lived in Edinburgh (sigh) I know I'd be a regular. Impressive place considering how far Mexico is from Scotland",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DDUVHSuLTC_RevoxF6Y7Kg",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom. Corn on the cobb",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DDUVHSuLTC_RevoxF6Y7Kg/o.jpg"
      },
      {
        "img_id": "ZtS9Uh9Hnxjm1hxTbCPurA",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom. Today&amp;#39;s special: tacos al pastor with sala roja",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZtS9Uh9Hnxjm1hxTbCPurA/o.jpg"
      },
      {
        "img_id": "IgkYaKFLSZ6bo3WHq72meg",
        "caption": "Photo of El Cartel - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IgkYaKFLSZ6bo3WHq72meg/o.jpg"
      }
    ],
    "user_id": "vN740jaTqpOOZd47PqkkSA"
  },
  "R63A87xehQHJqoPABcKGmw": {
    "date": "6/26/2018",
    "text": "We were amazed at the wonderful flavors. Our waitress suggested that we share several selections and we did just that.  We started with the Bombers: what a tasty sauce that was spicy and perfectly complemented the jalapenos in those balls.  We followed with the pork ribs: tender and tasty.  Next we enjoyed the carne Asada   tacos and the special of the day: steak tacos with several Mexican seasonings.  Good that I had a margarita to balance the flavors.    We definitely recommend this place. It is small but it is wonderful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cf97En0gsYMhjTS9Gguk3Q"
  },
  "bteC_QspxE08FJ1GqB83GQ": {
    "date": "7/31/2018",
    "text": "We are from Southern California and were not disappointed. We had the quesadilla,  street corn and the sweet potato tacos.  Very tasty and we liked the vibe.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uoou8Tcot-mujbgrkKEYfA"
  }
}