{
  "8xE6f4lVIEaA1LayPSpisA": {
    "date": "9/27/2018",
    "text": "Small and cozy place, great place to go for Hotpot!! Great food and great choice of sauces! Only CASH. Reasonable price and great choice of menu!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yBIX-ajoRefbWOaW8Ya3sg"
  },
  "ZOP4ciqDfo05Q2BHgMD0DQ": {
    "date": "7/21/2019",
    "text": "Very unorganised. I made a reservation for my MUM's BIRTHDAY a couple days ago.  They said they took my name and phone number down. When I called to confirm reservation on the day they said they do NOT have my name on the list, now we are stuck with nowhere to go and having difficulty to book other restaurants at this time.  Very disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MfMcWWqgNfY_pNQUg49Frw"
  },
  "H2cRs-ccWyrBRwLUbsGWnA": {
    "date": "6/3/2018",
    "text": "Amazing food, good service, always packed! Definitely worth trying for a traditional Chinese experience. It's also a very social place, so bring friends or family!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VmNPtOscqp5TMsHARn5NbQ"
  },
  "Brc-x7O418RxrOXYjv2Nug": {
    "date": "8/24/2016",
    "text": "Exactly as I expected. Awesome hot pot! The place was smaller than I expected however the staff did not hesitate to try fit large groups around tables. Eating hot pot to me, is the kinda of thing you can do that. It's a fun activity and it doesn't bother me if you're squished up a bit. I didn't know they had a licence so I brought my own beer, but they do sell 3 types of beer. If I recall I think it was peroni, tennents and kirin. They also have a good range of hot pot options. They had a selection of soup bases that wasn't the usual clear or spicy. And they also do bowls for one soup, 2 or 3. Extras they had available at the time were the cute hedgehog steamed buns and melon slices. I was really happy with my experience and will eat here again if I'm ever in the Haymarket area.  Word of warning: we did make a reservation, however I don't think it was noted or understood. Luckily there was a table available. Also it is cash only.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "UrSVZlSxyhbH9ftlQJdvGg"
  },
  "8bPE6Qg5McswDcuOzAGA-Q": {
    "date": "12/3/2015",
    "text": "Love the concept of hot pot - you pick your broth, you pick your items, then you pop said items in to the broth until they're cooked, at which point you fish them out and deposit them in your mouth.  This place was great fun. Don't go with people you're not happy to share food with as you'll be fishing out of the same broth. Also, go with an open mind and prepared to try new foods - who knew rice cakes were so good? Or tofu skins!  15.99 gets you all you can eat over 2 hours. The service is friendly and enthusiastic, if sometimes a little disjointed. Everything we had was tasty and fresh - what more can you ask for?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xQwt4sQj_FjNL15b1vlEVg",
        "caption": "Photo of Xiang Bala Hot Pot - Edinburgh, United Kingdom. That plate was very full before we started",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xQwt4sQj_FjNL15b1vlEVg/o.jpg"
      },
      {
        "img_id": "ntUC39i4x1U-u18Afh8bzw",
        "caption": "Photo of Xiang Bala Hot Pot - Edinburgh, United Kingdom. All of the hot pot goodies bubbling away",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ntUC39i4x1U-u18Afh8bzw/o.jpg"
      }
    ],
    "user_id": "97JTwCnKnyTHpr6fp-sNdA"
  },
  "siIEXFBsmwIcmha2pq82Xg": {
    "date": "12/1/2015",
    "text": "Went to xiang bala hot pot for a uue and i think our party of 8 was pretty happy with our food overall; we ordered two hot pot with 4 different broth; 2 spicy and two non spicy and then we simply ordered 90%of the menu! There was a lot of food and i liked most of it! I enjoyed the sauces bar and the diversity available; one of my only downsize was for service; we reordered a few items and the waitresses either did not bring us what we asked for or brought us something that we did not ask for and we had to ask again to get it; i also wished they had a few more selections for dessert even if the red beans buns were pretty good, a sweet touch to a 16 menu would have been nice; i would definitely go back to xiang bala!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "t63S2RPY6auYP7orcSycfw",
        "caption": "Photo of Xiang Bala Hot Pot - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/t63S2RPY6auYP7orcSycfw/o.jpg"
      },
      {
        "img_id": "PH7XmMWTA_U80Hn4JE9nUw",
        "caption": "Photo of Xiang Bala Hot Pot - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PH7XmMWTA_U80Hn4JE9nUw/o.jpg"
      },
      {
        "img_id": "zW_vaqnqBVPvsN7wteVnUg",
        "caption": "Photo of Xiang Bala Hot Pot - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zW_vaqnqBVPvsN7wteVnUg/o.jpg"
      }
    ],
    "user_id": "ThHJVG58S2pqc8vJU4fDkA"
  },
  "9eYlafsYXLdB_CDmCbS9kA": {
    "date": "9/24/2016",
    "text": "The cold dishes were delicious and the service was good!So many kinds of food you can choose from and fresh seafood!But the soup of the hot pot and the sauces were just not as good as those back in China.Anyway,we did feast ourselves and it totally worth it.Must be great to come here on a cold cold day.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "c17s5z5V4_ppX4w6TZdFDg"
  },
  "BX5pKrfxKCx4KyF960Wd2w": {
    "date": "9/16/2016",
    "text": "Should be the best hot pot in Edinburgh! The restaurant is really tiny. Always full of people, should book in advance. The food is really delicious, the service is good too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HtTw8ZNF_vjO3T5ELQG2AA"
  },
  "Sj0RXTD8sNu-bnvm1-3JlA": {
    "date": "11/12/2013",
    "text": "My husband and I love going to Hot Pot places and only get the opportunity when we are in a big city like Edinburgh or London. Xiang Bala had a decent selection for the all-you-can-eat menu and had a nice choice of broths, although we saw the special board after we ordered.    I give it 4 stars considering all restaurant experiences in Edinburgh, but only 3 stars as a Hot Pot venue.  I like the buffet of sauces, but I didn't like the inconsistency of portion size.  The first time we ordered 2 meats, they shared a plate, the next time we ordered 2 meats we received two full plates, twice as much!  I felt bad that we didn't eat it all and wasted food.    I'd definitely go again, but wouldn't be my main hot pot spot if I were in NYC Chinatown or even London.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "5vEsBpiQLLDTapOghPy5Ww"
  },
  "I7P5LYRms0kIGCU4jpR6yQ": {
    "date": "9/4/2014",
    "text": "To be honest, the food there is not very clean, all the food you ordered is in one big plate, no matter it is seafood or vegetables. In addition, the tables are greasy. They still charged 2 pounds for 2 person's set. I felt sick in half eating but continued to finish. The waiter was nice, but the hot pot was really not tasty. I will give it 40 out of 100.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_BBkZ8lbI5o6xeIxvCyTyQ",
        "caption": "Photo of Xiang Bala Hot Pot - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_BBkZ8lbI5o6xeIxvCyTyQ/o.jpg"
      },
      {
        "img_id": "e2VMNWIbZnFwqrouXNsOgw",
        "caption": "Photo of Xiang Bala Hot Pot - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/e2VMNWIbZnFwqrouXNsOgw/o.jpg"
      }
    ],
    "user_id": "dtHbCVmeeCbT4gYZaPkfYA"
  },
  "HzNwxwgzCyZCTU-Fjj1RIg": {
    "date": "2/12/2013",
    "text": "It's close , it's handy, and as such a no brainer to quickly check out what Xiangbala Hotpot is all about.  The deal is: You pay 15 and eat as much as you can.  In all fairness, we tried that technique, innocently, as we did not know what we were doing and did not realize how much food we had actually ordered, until it arrived. We looked at each other, gobsmacked!  Its a small place, mostly filled with Chinese Locals. This normally means that its a popular place and worth visiting :-)  How to explain:  There is a pot with boiling water (on a cooker) and lots of fresh meat, noodles and vegetables that you firstly order. In the beginning a waitress will take your order and the rest you pretty much have to do yourself, like putting all the meat, noodles and veggies into the pot until the food is boiled and you take it out.  There is a side table with many varieties of spices and sauces. Well, I would not recommend putting that HOT chilly into the pot until you are absolutely sure you and your friend can eat it!  Luckily the pain was half shared in our case :-)  And because I am a bit adventurous I also tried the pickled chicken claws. Well, well, I still remember them well........  TIP (shared by a frequent visitor) : Mix the sauces and the spices in a separate bowl and dip your meat......into it. This enables you and your friend to try different tastes.   Personally it's not my cup of tea, but definitely worth recommending. Try it!  You might be surprised.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "s85sNAMlsrI0xCRvfj7Jrw"
  },
  "vI7agy_xUqTNyU0gsm2g8A": {
    "date": "3/5/2013",
    "text": "After looking forward to hot pot for a long time, I finally got around to going to Xiang Bala. I left with mixed impressions.  First, my dining companion was pretty much terrified of the whole situation and didnt really seem up for it. This place is definitely authentic and the Asian community has taken to it in droves. We made a reservation for a Friday night, but there was no point in having a reservation because it was pretty much first come, first served.   Thankfully I had read about the ordering process here on Yelp otherwise it would have been very difficult to figure out. English and instructions were in short supply. When we finally ordered everything came quickly and the servers were quite friendly. Sadly, we didnt get the broths we had ordered and the ones we did get were a bit bland and flavorless. At this point any hope I had of my wary dining companion enjoying himself went out the window.  We sat in a cramped table, very crowded with lots of loud voices and people pushing past us. The ingredients were OK, but obviously not top quality. The majority of the meat and seafood were frozen, which was fine, but the veg didnt really look at its best. At 15 quid each it was a bit disappointing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "A_dC3FJOqvlsDEiDyMrzlA"
  },
  "sv_BN21TwF1Ts7uO_N0gwA": {
    "date": "6/15/2016",
    "text": "Pros: the quality of the food is decent, good variety of sauces. Cons: too small, bad ventilation, service is hectic, but especially: the hot pot broth is tasteless. Your food need to cook in that broth to get tasty. This broth made our food tasteless.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N-lvb4QYUAzZZU_1sVhbMA"
  },
  "lEiuIHDrBf-Zdb1vyK8O3A": {
    "date": "1/14/2012",
    "text": "My friends and I had such a fun night at the Xiangbala Hotpot and I feel a little stingy to award an a-ok 3 stars, but although there's no doubt that we enjoyed our evening, we were all in agreement that the ingredients and the restaurant's facilities could be improved.  We opted for the 15 menu and we were given a tick-sheet of broths / foods that we'd like to try. We selected almost everything on the list, including edible fungus, pickled chicken claws and tea-leaf eggs! There were lots of lovely fresh veggies and the king prawns were delicious, but the cooked meats were quite dry and some of the other items weren't the best.  For sauces & dips there's a single table, so that customers can help themselves and for us it was quite tricky to work out what was what (other than the large carton marked MSG - we avoided that one!). It would be nice if the restaurant could provide each table with their own selection of condiments instead.  Cooking our own food was great and I'd recommend the experience to other friends who have no fear of trying new things. I'll definitely try hotpot restaurants again, but will probably not return to Xiangbala.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AemMXa0hrlHWbp1oelDvnA"
  },
  "khLlV05Kvbj1FOUbwD0Aag": {
    "date": "7/22/2010",
    "text": "This is easily my favourite Chinese restaurant in Edinburgh.  It's hugely popular with the local Chinese community who flock here every night of the week because the food is just so authentic.  When I first came here it was unlike any other dining experience I've had.  The reason it's got 'Hotpot' in the name is because they stick a steaming cauldron of salted broth in front of you and you then order raw ingredients which you then cook inside it.   Now, surely this defeats the point of going out for a meal, but it's actually a great concept.  It's a lot easier than it sounds and you just stick in whatever you think might work (they offer recommendations)  and then eat it when you think it's ready.  I went for chicken with lemongrass, chilli and coriander which was actually really tasty and didn't take as long as I expected for it to cook.   They have a very plush wine list and some seriously stylish decor inside.  However, it certainly isn't pretensious and it's a great place to come for a meal off the beaten track.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "YtVVVnkEY9kFH6-MMlu_mg",
        "caption": "Photo of Xiang Bala Hot Pot - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YtVVVnkEY9kFH6-MMlu_mg/o.jpg"
      }
    ],
    "user_id": "yfXqZkU5iXE07GSHzdsQBA"
  },
  "eQvAm5ZZQes7Mn_gjRd-6Q": {
    "date": "8/8/2010",
    "text": "This is a cool restaurant where you get a big cooking pot and you cook the meat for however or as short as you want. You sit at a table where you put the pot on a big hob and a member of staff fills your pot up with hot boiling water. The pot is partitioned meaning that you can have your own meats being cooked separately from your companions. The concept is really cool, and I have never experienced it before, and I think it worked really well.  The restaurant is really great, the choice of food is huge and you can get an all you can eat within 2 hours for 15, which is pretty decent, however, bear in mind that you have to cook your food, meaning you don't et 2 hours straight of all you can eat. The staff are more than happy to help you order and there are set ingredients that you can order if you don't feel like creating your own dish. I would love to give this place five stars, but I can't as I can't help but feel that you are some how getting ripped off by having to cook your own dinner, even though that's the whole concept!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TObFzFa-fAHVJ-oO4r6U3A",
        "caption": "Photo of Xiang Bala Hot Pot - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TObFzFa-fAHVJ-oO4r6U3A/o.jpg"
      }
    ],
    "user_id": "hutJzKEYHuVq6CP-XSARgg"
  },
  "9fFKu9Oh0SNqWz3Sd8oqpg": {
    "date": "6/24/2011",
    "text": "This restaurant had friendly staff but horrible food.   15 per person for unlimited food for 2 hours. 2 for a soft drink with free refills.   Staff was nice and suggested we try a bit of everything. After having brought chicken feet advertised as sweet chilli chicken, and eaten raw crabe (tasked very bad), my tummy started to hurt. I went to the toilet that was dirty.   The concept is good where you can cook your own food in a hot pot but the food is very cheap quality. We weren't sure what we were eating most of the time.   Very overpriced for what it was offering. We always thought that seeing Chinese people eating in a Chinese restaurant was a good sign but not in this case. I guess it is the cultural differences in taste.   Would certainly not recommend and almost threw up in their toilets + in the car.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s805ROleHQGX-_tXjwtyZQ"
  }
}