{
  "pFKcKd9LcMytj2VSdXJReQ": {
    "date": "2/14/2011",
    "text": "Visited on a Friday night, when my friend was one of the first DJ's to play a set at the newly refurbished cafe.  We were welcomed warmly on arrival and before we had taken a seat they had taken a drinks order and offered to bring them over to our table. When our drinks arrived we were given a free bowl of Popcorn which was refilled throughout the night, which was probably just as well as it didn't last long! We didn't sample any the food but the Menu and the overall theme of the bar is distinctly 'American' I am glad to say however that unlike some restaurants that are share the same theme no fake american accents were used! The staff were really friendly and totally sincere.  They do an all day breakfast, and the menu has something to please everyone. The best thing on the menu for me was the fact that you could colour it in!! Ok probably meant for children as its family friendly but me and my friend still had a colour off!! I had a really good night here, as did my friends and I am going back soon to try the food so maybe I can give it 5 stars like I wanted to.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WVVydVWc_Ksp1KDBUKettA"
  },
  "4LQiH8wrRNcsf4GaXE-G6Q": {
    "date": "4/28/2010",
    "text": "This is my kind of bar. Modern, contemporary, unpretentious and it played good music. Admittedly it was quite (it was a Sunday after all) however I've been told this place hots up on other nights. I'll be sure to be back to see for myself!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cqecqnFK2eu88VtKJLHpiA"
  },
  "TNvIxlc_jZJkiQnhZDzcBw": {
    "date": "12/27/2010",
    "text": "its cute... but a bit divey... the food was decent but nothing to write home about... too much food, as well.  the beer was flat, too.  the people were nice and so was the music, i suppose a must see, but don't expect much.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "x6_8-SBS55EU4xNIjS2rrA"
  },
  "tqEMNKAtbKLat0pbDdcozA": {
    "date": "1/8/2009",
    "text": "Pool tables? Check. Cheap drinks? Check. Decent food? Check. Great location? In case you hadn't realised, that one's going to be a check too. City Cafe is a great bar for a few pre-game drinks or a chilled out first date, with a few premium seats in the booths by the pool tables and some less attractive seating options up at the front, a downstairs bar that is normally closed but occasionally plays host to live music events, and a good buzzy atmosphere. You can find out about club nights happening in town thanks to the wealth of flyers scattered around the bar and the influx of flyerers at about nine o'clock looking to shelter from the Edinburgh cold and drum up some business for their night. The food is fine, if on the deep-fried side, but they do have a good selection of spirits and beers and the prices are very reasonable. Definitely a step up from its nearest competitors.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GbrjLXBt14r_5QxJh25U_Q"
  },
  "e0t0FIDon8ggu-MYK5KO6Q": {
    "date": "12/7/2011",
    "text": "Refurbishment in 2010 led to good enhancement of the American retro theme. My only regret is that the sweetie shelves at the end of the bar gantry have gone, so no more dolly mixtures to go with my pint of lager! Food-wise, the hotdogs are AWESOME! Eat your heart out, Fonz.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tju7LgV5IorxUT-rCVwTdg"
  },
  "CSS3U9_e3WTlIcfgDqZ-Vg": {
    "date": "11/22/2008",
    "text": "I first went to the city cafe in the early 90's and loved it. It is now like an old friend. We visit Edinburgh every year and always go to the city cafe for a drink and some nachos. It has a 50's style decor and is relaxed and cool! If I know that friends are visiting,it is a place I always recommend. We saw Joan Rivers in there this year,during the festival",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ej3wu-Cvz5S5XMzgPY4w9Q"
  },
  "YL5yMLPhzsGfbox9mIsrAg": {
    "date": "10/31/2007",
    "text": "Nice pub with 2 pool tables and some booths at the back. Could probably do with more table space as it is one of those places that feels awkward to stand in. Decent food too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1g9_rAfoKieVn64my3Awbg"
  },
  "zda4UJqhoRRP6dMNZcXQQQ": {
    "date": "7/4/2008",
    "text": "always a good night, whether its a meeting place before a club, or just a stop off on the way home, i guarantee you can't have 'just the one' in here. there are invariably about three people you haven't seen in ages sitting just inside the door, the music will captivate you without interupting your conversations and if you've missed dinner the nacho's are everything you could wish for! during the festival its a popular hang out for the famous and infamousi bought johnny vegas a pint here last year",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mJM9uvrQ0q1nrSn1xRbHQQ"
  },
  "dlk7drXRAFHIJSKudn40nA": {
    "date": "11/18/2012",
    "text": "Had brunch here with fellow yelpers and I'm surprised how often I've walked pass this place without noticing it.  It has an American dinner look to with black and while tiles, serving shakes and burgers  Service speed is ok but I must say I enjoyed myself tremendously with its burger meal. The chips are huge and crispy, the vegetables on the burger was fresh and the others were also raving about the sausage rolls and shakes.  Price range is affordable. There's even a pool table.  Perhaps not very suitable for large groups, as the seating arrangements we had was slightly awkward to socialise in.  I'm definitely going back again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VkOrDn_QYoq0x5E1OuqarA"
  },
  "U8W-H0CfXqpyZ3iSweWOJA": {
    "date": "1/30/2012",
    "text": "My boyfriend and I came here on Saturday lunch time, on a quick Edinburgh stop over on our way to Glasgow from London. Edinburgh is where I have spent the past eight years, but I still hadn't got round to checking out the revamped City Cafe before I moved away, so since it's pretty close to Waverley we decided to come here for some lunch.  I loved the kitsch 1950s diner style, and the variety of food on the menu, which made choosing my lunch quite difficult. The girls serving us were very sweet and friendly. I went for the chilli chicken burger and my boyfriend went for the apache burger. To be honest, having ate in City Cafe before (but waaaay back when), I wasn't expecting great things, but I was very pleasantly surprised.  My chicken burger was real chicken breast, salad, pickles (oh pickles!), shredded beetroot, grilled pineapple and some chilli sauce, which actually did provide a great kick. It also came with thick cut chunky \"home fries\" which were piping hot and delicious. My boyfriend was equally pleased with his choice, and the burger was definitely home made. I didn't try it because I don't eat pig, but it looked good. I thought that 8.50 for a burger of that quality was very fairly priced, and it more than filled us up - we both struggled to finish (I left the bun, the cheats way to eating burgers!)  My boyfriend was GUTTED because he LOVES milkshakes, and he didn't realise that they had any on the menu because it was on the very back page. I am sure that he will be requesting that we come back here so that he can try them out the next time we are in Edinburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "WW3uGfrqB4tTDlQMKCiDbA"
  },
  "uhVlcHy9pC4QRwzt8M-7IA": {
    "date": "6/19/2012",
    "text": "What can I say? Not. Impressed. Slow and messy service.  Food is just OK.  American dining theme is fine although I'm not a huge fan. On the plus side, they have a room with a bar downstairs which you can hire for private events, and a pool table at the back of the main bar.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V5U4-iDA2FeO2AlkUrATsg"
  },
  "tX56n4qf1vvpCjLpWNSLxg": {
    "date": "1/23/2013",
    "text": "I could see that this place could be great at night. I was her in the am for breakfast was alright (I had been up for over 24hours, so nothing would have satisfied me but sleep really). Free wifi, outside seating and that 50s feel.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kwllhyTDMrMWycoiR8IwVA",
        "caption": "Photo of The City Cafe - Edinburgh, United Kingdom. Small Veggie Breakfast",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kwllhyTDMrMWycoiR8IwVA/o.jpg"
      }
    ],
    "user_id": "LP4q71xyKo_DDZYjlepOug"
  },
  "X-4gO7WFm-H5Jue1AGplHg": {
    "date": "10/22/2011",
    "text": "So far so average.  First time in here. The 50's diner decor has been done very well. I felt like Marty McFly entering the Hill Valley diner in 1955. They don't have Tab or Pepsi Free either. They may have Pepsi Max, but I didn't ask.  Nothing really special on the food and drink front though. There is the usual selection of fizzy amber on draught, Heini, Carlsy, Kronny and, er, Tennantsy.  The food isn't expensive, but it's still not cheap enough or good enough to make it cheap and cheerful. I wasn't impressed by the Apache Burger (smoked bacon, cheese and BBQ sauce), with bland, home cut fries for 8.50. There was nothing happening in that burger. I've tasted much better at BK, and I hate saying things like that. Maybe I picked the wrong thing, but a 50's style American diner should have outstanding burgers.  It was supporting the recent Oxjam Takeover by hosting some excellent acts, this earns it the 3rd star up there.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "a1HsLsqwOZffFo2sXvhMww"
  },
  "KxXVVVMhcsD9c3X7a43Btw": {
    "date": "8/3/2014",
    "text": "Good food. Good price and great service. Took me back to my roots with the decent bacon. Definitely recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yxNYLAWeqW6BKUPMujnl4Q"
  },
  "Ndng5ks53noE7LJViHPo2Q": {
    "date": "10/5/2011",
    "text": "The food is not great, but it's not expensive either, so you get what you pay for. Great place to have a pint of beer and some fries while you sit outside on their patio and people watch.  Typical diner fare, and I love the 50s style decor.  But vegetarians beware - the veggie burger was a black bean patty (yum) which they for some reason decided to deep fry (yuck). Could not finish it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tJvy5BkQTZ_si1XvD-luuw"
  },
  "vi4jz-i5tgdPum_A2SKosA": {
    "date": "6/12/2010",
    "text": "City Cafe has got that kind of underground, we are not part of the mainstream atmosphere to it, having long been established on the scene as a prior to going clubbing venue for dance aficionados and other alternative genre lovers. It's pretty no frills in here, with the relative simplicity of the interior giving the bar a no nonsense, get a drink down you and don't make a fuss edge to it.  The drinks here are always pretty cheap as far as I can recall, obviously a bonus when you're about to go to a club and pay club prices, and you can also play pool, also a bonus if that's your activity of choice, and also great if you're in an awkward, banterless situation, where you can substitute physical activity for chat.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Mujjzv-ZH6HhxT-hWCpVg"
  },
  "vkeBcx7eKsykc51mNyONFg": {
    "date": "12/6/2010",
    "text": "Went in for food twice over the weekend. First time i've been in since it had its 50's Diner Overhaul.  Anyway the food is great not a huge selection but well worth the money. They also do the best breakfast i think i've ever had. Superb fry up for only 6.50  nom nom nom. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZKK4qsj--F_qM1zXYHSoOw"
  },
  "7Jl0FMe6voz85bcsR4seVg": {
    "date": "7/3/2010",
    "text": "I totally agree with everything that;s been said before me. It just reeks cool, and it's sort of a place to be seen but to push aside mainstream George Street bars. Make sure you're looking cool when you're in here, maybe come here after a hair-cut or after a few cocktails!!  It's a really nice place to be in general. I love sitting here no matter the weather, it's a nice experience with a lovely atmosphere!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o0WGr8L3BWfH2Bslpnqw6g"
  },
  "WQjmInEwyC2EJHRuErfGmA": {
    "date": "10/23/2011",
    "text": "A friend told us to meet her here and i was expecting a lame, sticky-floored, uninspiring tourist hole...   ...but it was actually one of the coolest places we'd been to in Edinburgh. A 50's diner! Awesome! They have a jukebox, black and white checked floors, chrome fixtures and the swellest darn uniforms you ever did see. The drinks menu isn't spectacular, but the food totally makes up for it. I had my regular cheeseburger and while it wasn't the best I've ever had (In-n-out in Barstow CA, you have that trophy) or the best even in Edinburgh (Golf tavern, this one's for you), it ticked most of the boxes in my brutal cheeseburger checklist. The patty was really juicy and delicious and there was plenty of pickle, just the bun let it down. But only a little. It was a 3.5 bun around a 4.8 burger. I highly recommend dropping into this place at least once. The theme is so cool! I'm sure it would lose it's lustre eventually, and the waitresses probably want to self-terminate, but if you've never been you should give it a whirl.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "KcfGrudzTcML2md1gwP53g"
  },
  "kNEuz6hGhaN1Fygf1XQ53g": {
    "date": "8/10/2012",
    "text": "good black currant lemonade (carbonated & sweet). the chicken strips weren't that good. fries looked good but were just average. The burger, however, was really juicy and tasty! fringe venue downstairs-sits quite a few people",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aAVaN6Zw6-cRm5nftmOVJQ"
  },
  "ABjbT4Qj-gzYlAc6VOsD3g": {
    "date": "5/19/2010",
    "text": "Back in my days as a slave to a certain trendy High Street Store, this is where most of the work night outs would commence.  It is full of scene kids who think they are uber unique and carry around satchels filled with Shakespeare because they think they are being different. Despite that element, there is quite a relaxed atmosphere and it is an okay point for starting a night out. It gets annoyingly busy on the weekends so go during the week to avoid the crowds, then head down to Cab Vol as that is where the cool kids go afterwards.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oKdygoDX5CfDJeXzv_EVaw"
  },
  "HI_H0Cyu0cvyyxMXkfFKtg": {
    "date": "11/19/2012",
    "text": "I like the City Cafe.  I don't love it, but I like it well enough.  It doesn't live up to the American Diner experience it appears to promise - the food isn't authentic enough and the music is terrible most of the time but it had a chilled-out atmosphere and is always good for a place to go for a coffee/drink and a catch up with friends.    I love that you get free coffee refills, and there's a good selection of drinks both alcoholic and non-, and they also do some amazing milkshakes - the banana and nutella is out-of-this-world good!  The food is a bit hit and miss, I've had some decent, if not amazing, burgers and sandwiches but I've also had some soggy vegetables served as crudites with dips.  The chips are ok, but I can't help wishing for some skinny fries with my burger rather than the thick cut chips on offer.  But the music! Oh, the music.  Often too loud, and often not in-keeping with the vibe of the place, it grates on my nerves.  I don't want to hear generic pop crap when I go to a self-styled 'diner', I want something a bit different.    Good space though, and they have a room downstairs you can hire for events, gigs etc.  Staff are all nice, and service is good..",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ISvpnCyQO_vIlWve-3ZuHA"
  },
  "LWgHubxXVqElyWLpHbnIIA": {
    "date": "4/27/2010",
    "text": "Although City Cafe is rather expensive and also a bit trendy, I still quite like it. I enjoy the atmosphere, and they sometimes play some good tunes; the staff are all pretty cool and have good taste in music.   Sometimes there are good gigs here as well.   My one major criticism is of the bouncers, who, one afternoon in August, randomly came downstairs during my first and only pint of the day, and roughly escorted me off the premises. Totally inexplicable.   So actually you know what? One star.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WLE_sZQm2k0yE1rmStp_Eg"
  },
  "oHlZh6OsLTefIj-hS1upMQ": {
    "date": "6/11/2008",
    "text": "I've seen the City Cafe hailed as Edinburghs original style bar which I think does the place a disservice as it has much more character than most of the style bars that sprung up around town in recent years.   The place looks vaguely like a 50's style diner complete with pool tables. There's a few booths and other seating but it tends to be standing room only when the weekend evening come around.   Food at the City Cafe is of good quality and served in generous portions. They doe the standard burgers, wraps, club sandwiches along witha few more interesting options.   If only they had a juke box as good as Nice N Sleazy in Glasgow!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "glv-cXHGyV_ZMNr0ZeJNvA"
  },
  "OxDhqjZJyhQizkDeezhLdw": {
    "date": "1/19/2009",
    "text": "Opinion on the City Cafe is always finely split, though it certainly has found its audience and is a popular watering hole - though if your face don't fit, don't expect you'll be welcomed with open arms - as the bar staff are notoriously hostile and regulars (including many of my friends) fiercly loyal - particularly when it comes to the pool tables at the rear.   I've always found the simple pub grub here very poor and have eaten burnt nachos, greesy burgers, undercooked chips & the abominable disclaimer on the menu refusing to cater to fussy eaters (which pretty much rules out allowances for allegy sufferers or strict vegetarians - naughty!!) sums the place up.   New management have taken over the City Cafe and rumour has it some of the bar & kitchen staff have also moved on, so changes may be afoot, but rather than wait on that, I'll stick to frequenting places a little friendlier and will eventually tempt my friends elsewhere- I suggest you do the same!   Ess",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vQnR9L9HILjw4PgWB8q1cQ"
  },
  "a60CtE4SKD4ChBp0owezwA": {
    "date": "11/1/2007",
    "text": "This joint ticks most boxes with free wi-fi, good food, pool tables, function room downstairs and (sometimes) decent tunes. It is such a good space but I feel like so much more could be done to improve the way City Cafe is run and promoted.   Don't expect to get drink promos outside of happy hour, and although most staff are friendly, mself and other mates have had a number of not so good experiences. I feel like it's missing some direction and ownership somewhere along the line.   For example, no one could put their hands on a music-setup for a function we had booked one time so we went without music to back our party for at least half an hour. In the end, it was up to us to get this running.   Despite all this, it is a quality place to get a good coffee, bite to eat, check emails, pre-club hang out or pool place. City Cafe really is a generally reliable all rounder, located in a central Old Town location.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cljlsSH1sJTY5td74WY3Ng"
  },
  "bILtxsHhVndQFmxrMW5RBQ": {
    "date": "3/30/2010",
    "text": "If you were to throw a dart on a map of Edinburgh and aim for the bullseye, this is where City Cafe is. It's a refuge for perhaps the more relaxed drinker and it's a no-frills kind of affair but something about the fish tanks and the pool tables make it feel homely/like a bar from an art film, and I spent hours in a booth laughing and feeling completely at ease. The staff are always friendly and I can't think of a time when I've felt out of place, under or over dressed. Probably would avoid a Friday or Saturday night though, because that's when everyone else wants in on the action.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "rJi2YPK6uj4FtE8R7OFQcA"
  },
  "t0cUXzM30R70q0qqsvD1IQ": {
    "date": "2/6/2011",
    "text": "The City Cafe has had a complete refit as of Dec 2010 (we visited Feb 2011 on a quiet Sunday night). The diner aesthetic has completely taken over with the space split into booths, bar chrome shined up, a Wurlitzer juke box moved to the front and the venue downstairs becoming hire-only. There is much more focus on food and the diner feel (menus at every table, staff in bowling-style shirts) and the food looks pretty good. We'll be back to sample it for sure. The ever-so-slightly cooler-than-thou feel of the place is gone, although I have no idea what the Fri/Sat crowd is like. Free wifi and comfy seats. Win.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zZtSF9uCvA4-z_-j1RiyAA"
  },
  "7NmBWvzUguU4RgvojAd4hg": {
    "date": "10/13/2014",
    "text": "Like Natalie Imbruglia I'm torn.  I've been in the City Cafe a couple of times in the past and I love the vibe of the place, the retro/Americana feel, and it's always busy. The last time I was here with a group of friends we spent several hours playing pool, whilst the rain fell outside.  Thankfully there was no rain on Saturday and despite being busy, Kirsty, Clare and I managed to get a wee booth in the corner. I've had a breakfast here in the past but never anything from the evening menu, on first glance it's nothing out of the ordinary but there are some intriguing items, most notably the meatloaf, served with mash and creamed corn.  It's not clear if it's table service or not, some people seemed to have people taking their orders, but as we hadn't even had a hello I wandered up to the bar and ordered, after some deliberation, the Hawaiian Burger for me, Clare ordered the Mac Cheese and Kirsty opted for the meatloaf.  The food arrived pretty quickly and first impressions were mixed. The Mac Cheese looked a bit anaemic (and quite a small portion), my burger looked ok, and the meatloaf looked a bit amateurish. Whilst I wasn't expecting beautifully presented food they could at least have made a bit more of an effort I think.  We were all hungry so dived in sharpish! My burger came with some chunky, fluffy chips which may, or may not, have been reheated rather than cooked fresh, the bacon on the burger was pretty flavourless, the patty thin and on the dry side with the grilled pineapple the start of the show. Disappointing and so unappealing I didn't finish my meal (which is largely unheard of!).  Tellingly no-one else finished their food either. I got to try both the other dishes, the Mac Cheese wasn't up to much, and the meatloaf was an odd, dry, yet familiar flavour... had the cooked it on the same grill as my burger perhaps? The creamed corn and mash weren't anything special either.  Not massively impressed. It wasn't inedible by any means and perhaps it was just a bad night in the kitchen. However, between that, the oddly removed staff who were all really busy yet despite being the only person at the bar at one point it still took about 5 minutes for any of the 4 people behind it to notice and serve me.  I love the interior, I love the Americana vibe and from memory the breakfasts are pretty damn good! But I don't think I'll be rushing back for food any time soon. I'm all out of faith. I'm torn.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "7_lCUJN3MObQvNDxIiE2kA"
  },
  "Wm_r65KTDbrui0m2UTO6uQ": {
    "date": "3/24/2013",
    "text": "Great for brunch or lunch... American style diner... Huge burger challenge!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eKc2gY6fPaQy3zNsbIYDvA"
  },
  "vMrbxlE1ntfZpdeYQWeLkg": {
    "date": "8/16/2015",
    "text": "It was rammed when we came for dinner, though likely related to Fringe frenzy. We squeezed onto some bar stools with a ledge next to them that we thought we could use as a table.  We shared a pulled pork hot dog and chips between us. We decided to do this because we weren't terribly hungry but it was an excellent decision as the hot dog is massive! The sausages are more like sausages than frankfurters, the traditional hot dog filling, but that was fine, and the pulled pork combined well. The chips were all crisp and delicious, if a bit chunkier than my ideal.  The toilets smelt vile.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1IpZks_GTP79WPbO7OvPow"
  },
  "TJ64MjEGYsSZUtb-qgyTmQ": {
    "date": "10/14/2015",
    "text": "Had a solo quiet breakfast here before catching my train. Ordered a full English breakfast, and it was okay. Did not realize this was established to be an \"American\" restaurant. I think it meant leaving a tip was expected. No problem as the food came out fast and was was cooked to order. Sausages were kind of fatty, but bacon, tomato, beans and hash browns were all very good. It was a Friday morning about 9 am, and I had the whole place pretty much to myself. Good and friendly service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MUXiKJhX_PlDtoghYNmAkQ",
        "caption": "Photo of The City Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MUXiKJhX_PlDtoghYNmAkQ/o.jpg"
      }
    ],
    "user_id": "-bxc5acRAYiDbRbB1_JIGA"
  },
  "gc75szxmB7MnNSId9ARsoA": {
    "date": "3/4/2014",
    "text": "Amidst the panic-writing of my final year report, I almost forgot that it was pancake day today. Almost. At midday I called my sister and arranged to go for a pancake date later that afternoon. A quick Google search of 'pancakes in Edinburgh' yielded numerous matches, but the most convenient meet-up place for us both was City Cafe, just off the Royal Mile in town.   I had heard of this place before, mostly because of the burger challenge that it has (if you can eat the mega burger, you get it for free, but if you're defeated then you have to cough up 30 quid). Sure enough, the menu online showed there was a pancake option and so the deal was sealed.   The interior is a bit faded, it's trying to be All-American diner style but just is a bit more A9 than Route 66. Our table was also a bit dirty but that's being picky. The waitress was very attentive at the start, collecting drinks orders and promising to come back 'in a few minutes' for our food order. That turned into maybe ten minutes, which is excessive considering this was a Tuesday afternoon and the place wasn't jumping.   Anyways, I opted for the pancakes with Nutella while my sis went for the Belgian waffle equivalent. It might be down to a lack of reading the menu properly on our behalf, but I was a bit surprised when both desserts came out in a sea of maple syrup as well as having Nutella in wee pots at the side. It was enough sugar to induce early onset Diabetes, and I struggled to finish it (admittedly, I did finish it, so it wasn't *that* bad).  It wasn't particularly cheap, 14 quid for the two dishes and a coke and OJ. It satisfied my Pancake Day craving, but I'm not sure I'll be rushing back for the burger challenge.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "2b7AgGJbUgBKBGH2zOzH6A"
  },
  "ZRjbFw5mwizU7tC4jPsK_g": {
    "date": "8/24/2014",
    "text": "The good things about City Cafe: their breakfasts, their pool table, their beer pitchers (which save you a few quid), their nice atmosphere which has the American diner feel down. Their big burger challenge, though it is painful to watch let alone attempt. Their chips which come in their own little wire fry baskets.  The bad things: their cocktail pitchers are very, very weak. You could drink from them all evening and only get mildly buzzed (this was my experience with their elderflower one, their long island iced tea, and their Pimms). Their food is odd. Their nachos would be OK, except that their guacamole tastes exactly like mayonnaise. I once had their veggie burger as well, and something in the way the cheese on top of the patty stuck to the upper bun made said bun go extremely soggy and frothy in an extremely unappetising way. It was liquid bun by the time I neared the end. This burger inspired me to make a yelp account.  That being said, I go there a lot and will probably continue to do so. But I will stick to pints and chips.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bgC7I8dw-6Q2R3f4gkTeSA"
  },
  "sUOGnRvvET4GsR0tlhStng": {
    "date": "3/8/2015",
    "text": "The food is good but the service is lousy. They didn't help us find a seat and it took them close to ten minutes to come and greet us. Not the best first impression.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "azjIBBTzpcB42uwKJSRe4g",
        "caption": "Photo of The City Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/azjIBBTzpcB42uwKJSRe4g/o.jpg"
      }
    ],
    "user_id": "1MYGoJpOk69fExIQm_I08w"
  },
  "O8H-LVHELAR5UweroLhCbQ": {
    "date": "10/6/2014",
    "text": "I only *just* settled on 4 stars for this place. Its drinks selection is pretty limited...  BUT!  It's actually a really cool place to hang out, grab some food, admire the staff, HAVE A SWEET MILKSHAKE.  I was here for a staff do on friday there and had forgotten how good the food is, big chunky chips, juicy burger. A pretty solid shout. Can't quite vouch for value for money as boss man bought the food, I think it's about a tenner for a burger with some chips.  The vibe is very american diner, although the staff uniform isn't to type so it's not over bearing as an idea. The music is pretty varied, and largely to my taste from what I can remember. There's a pool table! Remember when bars had those?  all in all I like this place. I don't find myself going to it that often but i'm quick to recommend it if drinks and food in town are on the cards.  definitely worth a try :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U55y_61paae1f6r6vgITJw"
  },
  "SApQ0s6xyDVS27U2ipJjlA": {
    "date": "7/11/2013",
    "text": "I remember when City Cafe was much more utilitarian, starker, all metal, and allegedly a favourite of 'cool' types... and then it had a makeover and was transformed into an homage to American diners (without going quite the full hog into a full-on theme). I liked that you used to get a sundae glass of popcorn when you ordered, alas this detail has gone by the wayside.  I've eaten here a few times, and always been happy - burgers good, fajitas good etc. I would criticise the children's menu though - I came during the Fringe last year with a friend and her two young children aged 18 months and 5. Despite doing a children's menu (and the website having an example of a colouring in sheet you are supposed to be supplied with, we weren't) they didn't have any highchairs so the toddler was climbing up and fidgeting the whole time at our booth. And the kid portioned burger is tiny - one little slider sized patty, which definitely wouldn't fill up a 5 year old...  Most recently I was here last night with two friends who are up from London. Their journey up had been delayed so we didn't arrive til half 9 and were glad the kitchen was still open (the same couldn't be said for The Tron, where we'd gone first). One had nachos, which were fine - although a very small serving, and the other had the Apache burger. The chips that came with this were lovely - big, chunky, crispy and floury.  So it's fine, and I'll almost definitely be back, if only because it's one of the nicer pubs in the area (they also serve Stowford Press, a plus), but the portion sizes are small and my (admittedly rare) experience of coming here with children was a real disappointment.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mqg4L8flJmg8pqeR-uYyRg"
  },
  "fd2pk0J3qZ03WkCpWacZLQ": {
    "date": "4/10/2013",
    "text": "I'm ashamed to admit that before the Yelp is the word event here a few weeks ago I have never tasted the food at the City Cafe, I've only ever visited for drinks. After tasting the mini hotdogs they served us as tasters (and some of the ultimate burger challenge) I vowed to come back and enjoy a full portion of something from the menu.   Cue Graeme F out of the blue deciding he'd quite like to go to the City Cafe for a hotdog last Saturday. A great idea in theory but trying to get a table for food in a place that is essentially a bar on a Saturday evening is tricky. We managed to get seats at the counter after politely asking a couple of girls if they would mind scooting up a seat. To me, eating at the counter just added to the American Diner experience (though people ordering drinks at the bar over your head or in the gap between you and your friend is rather annoying when you're trying to eat.)   We took a bit of time deciding what to order, there are lots of really tasting sounding things to keep you umming and ahhhing, eventually coming back to where we started ordering the hotdogs. The hotdogs were lovely, covered in shredded smoked bacon, caramelised onions and a wholegrain mustard dressing. It was just the right balance between sweet and tart and the hot dog sausage was also very tasty. It also comes with a teeny little bucket of skinny fries, they were lovely but I could have easily eaten more, I regret not adding on a side of home fries. (Small warning a side of coleslaw in this place could easily feed 4 people, HUGE portion. Honestly, who eats that much coleslaw??)   The atmosphere was really great; they had some oldies tunes playing that had me swaying about in my seat and singing along. I also got laughed at by the bar staff for loudly booing when the shifted to more modern music. (I think Graeme F may have left me for another table if there were any chairs available.)  Visiting this place makes me want to go more often. Can't say better than that.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "wk-QmrbyCtGD23oIhMP44w"
  },
  "Zp1e8UHw4qq7mEiVaFxQCw": {
    "date": "3/25/2013",
    "text": "John Travolta to Uma Thurman, Pulp Ficition:  'Did you just order a $5 shake?....that's a shake, that's milk and ice-cream, that's $5?' Shake arrives....'I gotta know what a $5 shake tastes like....God damn that's a pretty f*****g good milkshake..I don't know if it was worth $5 dollars but it was pretty f*****g good!'   The milkshakes at The City Cafe cost roughly from 5 and come with or without alcohol and can be plain flavoured or a delightful concoction, for e.g. forerro rocher milkshake - god damn and even cocktail milkshakes, I said god damn! These shakes are yummy and worth every penny!  Also at The City Cafe I have enjoyed a brunch of stacked pancakes with berries, cream and maple syrup - mmmmmmmmm, and a pretty good burger too!  The service here is great. I love that from the outside, the cafe looks like any other cafe but as soon as you walk through the door, you are transported to another era with this American Diner theme and can it be a warm welcome from the grey streets of Edinburgh.   The events put on sound pretty good too and I hope to attend one some time.   I'm just missing James Dean or Marlon Brando when I look around the place :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "RNIQdiN2RHamTGwdq6PXqg"
  },
  "uTdTqobrY4UxAdODfIX8nw": {
    "date": "9/23/2013",
    "text": "Every time I'm in Edinburgh I end up here at some point. The food's great and the staff are a pretty cool-but-nice bunch. Whilst its changed over the years, now got the whole American Diner thing going on, it's still a bar so you'll feel just at home coming for a few beers or a meal. But don't expect intimate dining, particularly at the weekend or during the festival in August. Get a couple of craft beer taps on the go and I'd never leave the City Cafe!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Oh0ieTBFzLR7jnKELgzMQ"
  },
  "xhm69_BNsq7d93abTUyM4A": {
    "date": "6/24/2013",
    "text": "The City Cafe is great fun with a 50s diner theme throughout,   the space is split into booths, the bar looks straight out of Greese with the bar chrome shined up, a Wurlitzer juke box is at the front too and the venue downstairs is hire-only.  I went to the Elite event here and really enjoyed it so when we were caught in a sudden down pour on the Royal Mile this weekend we dashed in for some shelter. A couple of Bloody Mary's and we felt a lot better. They did have capers in which I wasn't overly keen on, the bacon vodka option was interesting and tasty plus the spice level and flavor were good too. We ordered nachos with chilli beef which were nice but not as good as good as they could have been. I think I will stick to the burgers next time though not the Ultimate burger challenge which I fear would be the end of me.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "neMi0e3dZaUtX7Sg-3Qytw"
  },
  "f85qF-KqBN22Xk_tDNgKMQ": {
    "date": "10/29/2012",
    "text": "I had an alcoholic shake and it was warm and watery. Exactly the opposite of what a milkshake should be. It was potent but that hardly makes up for it.  The three-stack of waffles practically melted my teeth it was so sweet and I put sugar on my Frosties in the mornings.  The waffles were pretty tough as well. Not soft and fluffy like a syrup drenched kitten as good waffles should be.  So in summary....Meh.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "UfLGgjd6UExBVZb6JRJiQA"
  },
  "3a2MeLiVDPNy95HXP3GUZA": {
    "date": "10/27/2012",
    "text": "In a former life I used to visit this establishment from time to time, I worked around the corner and there were few more welcoming sites than the stylised facade onto Blair Street. Back in those days there were sweets for sale over the bar (True) and fish tanks near the door (I think that's True). They both seem to have gone, replaced by alcoholic milkshakes - this is the debauched age we live in people, where the innocent pleasures of old just done cut it.  They also did a nice line in free postcards. Not the sort advertising another club night, or a brand name from some faceless multinational, these were postcards for the sheer hell of it. Pieces of art; items of cultural; cartoons of note and photographs of integrity.  Maybe they're still there? Maybe I tried too much milkshake from my neighbour at this morning's brunch.  What else has changed... well it's refreshing to be able to see through the windows at the back - there's a whole world out there, though to be honest it's better looking from the other side: between the flats of Tron Square* you can peer through into the warm and cosy glow of this establishment.  *That's not the square outside the Tron pub, for that is Hunter Square at the top of Blair Street. The one with the gold double postbox to celebrate Chris Hoy's Olympic success. But you knew that.  There's just the one pool table now, but it's probably still over priced and doubly popular. For all I know the downstairs bar could probably still do with a bit of a facelift, but this morning the glass doors were covered over to shield unsuspecting eyes from whatever the ladies on the other side were getting up to and making lots of noise in the process. A dance class perhaps? It's certainly part of the community.  I had a very nice plate of scrambled eggs (tasty, colourful and not in the slightest bit runny), salmon (fresh and succulent) and toast (toast). Followed it up with a Malteser milkshake (non-alcoholic, tasty).  It was really nice to be back in this place. The City Cafe has a different feel depending on the time of day, so try it at your leisure and see what gives. If you see them selling sweets from behind the bar you will let me know, aye?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "EgauZamsAjYo7BQMSr3srg"
  },
  "5iCE6gWnsPz0eiM1FYqOSA": {
    "date": "7/22/2011",
    "text": "I really like what they've done with the place. The new menu is fantastic bar food  we got two platters, one veggie and one meaty (see pics) and it was all cooked to perfection and well presented.  We sat next to the Wurlitzer jukebox which was free to use and had some cracking golden oldies on it. Unlike TGI's or the Filling Station the new 'theme' didn't cross the line into parody or feel contrived. The City Caff is the City Caff after all.   Although, I have to say, sitting in the booth listening to 50's music with a burger defo made me bagsy Fonzie, there's no way I'm being Ritchie Cunningham.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "blFvmNe6QjTyzZv9fasQaA",
        "caption": "Photo of The City Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/blFvmNe6QjTyzZv9fasQaA/o.jpg"
      },
      {
        "img_id": "BfiRSFaeOeep03c5gxwRSg",
        "caption": "Photo of The City Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BfiRSFaeOeep03c5gxwRSg/o.jpg"
      },
      {
        "img_id": "pLW0EvnWx_0mboiKKgP2XA",
        "caption": "Photo of The City Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pLW0EvnWx_0mboiKKgP2XA/o.jpg"
      }
    ],
    "user_id": "ZkmKyB9660N9d30GIrBGTQ"
  },
  "yW2k75F0YuGDUDXCi9KxkA": {
    "date": "10/28/2012",
    "text": "brunch is quickly becoming my favourite meal of the day!  the options of eggs and toast or a burger with chips for the first food consumed of the day is a foodie's dream and it was for this meal that i headed to the city cafe with some other lovely yelpers to start my saturday!  the city cafe portrays itself as an american diner, with chrome and red leather detailing and the stereotypical black and white tiled floor.  on entering i was given a warm welcome and pointed in the direction of a large table reserved for us partaking in brunch.  i have to say the seating area was my first let down of the day as it was in the middle of the restaurant which was rather dark and didn't allow too much natural light from the windows at the front or back.  not overly pleasant when dining on a rare sunny day in edinburgh.  seat taken and chatting commenced, i looked over the menu and decided it was a breakfast brunch and opted for the eggs florentine along with a ferrero rocher milkshare that i shared with the lovely Lou V.  the milkshake arrived shortly with a mound of whipped cream and a ferrero rocher chocolate adoring the side.  i was very kindly given the chocolate to eat and we both took a sip of the milkshake.  it was very very good, thick but not so thick you couldn't drink it through a straw and tasted exactly like the chocolate it was named after.  however, the milkshake was most definitely the high point as food started to arrive and my dish was one of the first out.  it looked very nice (i've posted a picture) and i was very much looking forward to it.  but after everyone had received their dishes and i finally dug into mine it was more on the luke warm side.  i don't know if this was from sitting for a few minutes while everyone got their food or if it had come out of the kitchen this way.    i don't know if you've ever eaten luke warm poached eggs, but it's not really the best way to eat them.  the wilted spinach lacked its promise of having been wilted in butter and the toasted muffin was just that....a dry toasted muffin.  the only thing that really saved this dish was the hollandaise sauce which was really tasty (probably full of the butter my spinach lacked!) and i wish there had been more of it.    so overall city cafe was really just A-OK, the milkshake was great, the actual meal was sort of lacking and i didn't leave feeling as excited about brunch as when i had walked in...  will i be back, maybe for a milkshake but i'll probably get my food from somewhere else.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "A8sqJBmXgTcQKO3h0pcbWQ",
        "caption": "Photo of The City Cafe - Edinburgh, United Kingdom. Eggs florentine yum!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/A8sqJBmXgTcQKO3h0pcbWQ/o.jpg"
      }
    ],
    "user_id": "Z_xbO-Iaxbx-ZRPhLJK-Ew"
  },
  "5gNMnpxz6ktywhQ_e04HvQ": {
    "date": "6/30/2012",
    "text": "MaHOOsive breakfasts (served all day) make this spot a gem.  The place is decked out like a 50s diner and the staff dress to match. The menu has a really wide selection and ranges from the aforementioned breakfasts and main meal dinners to milkshakes and a full bar list.   Morning/afternoon the clientele is usually some of the Hunter Square kids shooting pool and some families. Evening and onwards this place seems to become a cross between a 'girls night with chats' and people lining their tummys before a big night, which may or may not involve actually leaving The City Cafe.  Sometimes they have Groupon deals for the breakfasts, of which I wholeheartedly approve!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "KPY6FvT6h-r0W0HAC1Buag"
  },
  "2TnvenrvU_0Bsht2pEziXw": {
    "date": "12/10/2012",
    "text": "BEWARE: Tourist review.  As much as I want to hate myself for going to an American diner themed place, I remember how much I enjoyed the veggie Scottish breakfast here when I was in town four years ago.  Returned with my brother and boyfriend while we were in town, and we wound up returning twice in two days.  (Granted, the second time was due to me leaving my gloves there the first time.  But coffee was consumed.)    The menu is huge.  The breakfast was as satisfying as I remembered.  Nutella shake was bangin.  Coffee was solid.  Wifi was free.  The horde of Scottish hipsters at the pool table was adorable.  The restrooms were really cold.  The bill was very cheap.  It should be noted that after a few hours after our last meal there, my boyfriend felt a little lousy and my brother broke out in hives (very unusual for him).  They blamed the mayonaise left sitting on the tables, and since I skipped on the mayo for that meal, that could very well be the case - but the reactions could also have been to one of our beers after dinner as well.  At any rate, Americans keep mayo in the refrigerator, so City Cafe should consider staying authentic and doing the same.  I'll be back next time I'm in town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "roHr_kyKT8-_Sq5rmYRXOw"
  },
  "7o8XHyHH40Jg7DgzP5Xf9w": {
    "date": "4/26/2010",
    "text": "The City Cafe has hipster written all over it, and it's not a bad thing.   It looks like a typical 50s diner from the outside, and you can imagine girls swinging in their big skirts while guys lean over the jukebox looking smouldering with a James Dean quiff. Not that any of these attributes are bad -  I love that sort of thing.  There's seating outside and lounging smokers are posted there on a sunny day. If you choose to go over the threshold you can expect a functional amount of booze, some food offerings and a variety of people socialising of all ages. During the day you can nab yourself some grub (including spicy burgers which always go down well), and have some quiet drinks accompanied by house music playing unobtrusively in the background.  During the evening, The City Cafe is transformed into a different animal. It's a gig venue, and popular with local bands. During the Fringe it particularly comes alive and ususally hosts a number of in-house comedy and dramatic artists for the duration of August.  My friends and I envisaged the worst comedy act I've ever seen in the City Cafe, but not even that deterred from my otherwise great impression of the place. With its checkered floors and low-fi appeal, I love that it looks a bit left of the dial and is laid back enough to trawl in wearing some baggies for a few beers. One of the better bars in Edinburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "r5NLm7hvYAGEKFJ9k9fMIg",
        "caption": "Photo of The City Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/r5NLm7hvYAGEKFJ9k9fMIg/o.jpg"
      }
    ],
    "user_id": "5iRCT4uAsyP1UoEUoxbylA"
  },
  "SzUNKKCYkSY6ugqud4A13Q": {
    "date": "5/2/2019",
    "text": "Came here for breakfast as they serve it all day. Walking into here was like walking back in time to the 80's. I couldn't believe how much character this place shown and it was amazing. Every where you look there is so much history and detail you could spend all day staring at their walls. Even their menu exploded this restaurants personality with quirky names and images. They also can provide a vegan/gf menu if needed. I went for the Castro - named after Fidel Castro, which was poached eggs with smoked salmon and hollandaise sauce served on a toasted muffin. This was 8 which is amazing value! The food came pretty quickly and tasted good. The salmon wasn't very fresh - it was one of the saltiest I've ever had but wasn't bad. The coffee was also really yummy and strong. It was a great spot overall and couldn't have been happier.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fUdDwbcIl0BWySCaW2o07g",
        "caption": "Photo of The City Cafe - Edinburgh, United Kingdom. The Castro",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fUdDwbcIl0BWySCaW2o07g/o.jpg"
      }
    ],
    "user_id": "cYJ6Qq85p1hJ1BbcaNH4Kg"
  },
  "itSTLDo7b4EdmdHjGQhqrA": {
    "date": "10/21/2018",
    "text": "The aesthetic is 1950s American diner with chrome finishing, Elvis records, and sock hop checkered floors.   We went for a morning and ordered the large breakfast with coffee and ginger ale. The portion was very large, and enough to share! Even though it's an 'American' themed diner, they had a good mix of Scottish comfort food favorites like baked beans, black pudding, and haggis. I loved the runny eggs and the hash browns.   The joe was pretty good and comes with free refills. The waitresses were really nice and knew we needed a lot of coffee to trek through rainy Edinburgh.   Definitely recommend if you want a hearty warm breakfast to start your day in Edinburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "oLaX_SVFxZSNz1fFDHNy2w",
        "caption": "Photo of The City Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oLaX_SVFxZSNz1fFDHNy2w/o.jpg"
      }
    ],
    "user_id": "Si4k5RiTmm6bRELuqaqzvw"
  },
  "YW9KCyD260IaV3Xcz0n9YA": {
    "date": "10/11/2018",
    "text": "Favorite place in Scotland to eat late night Scottish vegan breakfast. The staff are wonderful, Leon and Toby had a wealth of recommendations of what to do on my visit to Edinburgh! The beer and drinks were great, cool atmosphere and a fun crowd of fellow eaters.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "UfTSXxDGA0U4XJYMECZDRw",
        "caption": "Photo of The City Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UfTSXxDGA0U4XJYMECZDRw/o.jpg"
      }
    ],
    "user_id": "ukPxChGGBe9iQcz0JYcrCg"
  },
  "Ili25vBVEtEQq29eTuQC3A": {
    "date": "5/14/2018",
    "text": "The city cafe has a wonderful atmosphere and great food.  The kitschy American diner theme is delightful and the girls that were working when I was there were attentive and pleasant. Coming in as someone who's been traveling for 3 days and had not eaten in as much time, it was a much needed stop and I'm glad I did.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "xwHQucHpqhFNK2pEUtP9Zg",
        "caption": "Photo of The City Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xwHQucHpqhFNK2pEUtP9Zg/o.jpg"
      }
    ],
    "user_id": "gqkCfs11wtGGFIu1xFDCBQ"
  },
  "h2iVOHg7oteS73_7YM7eAA": {
    "date": "7/7/2018",
    "text": "Have only been here for breakfast, which has been consistently great on the half dozen visits made.    Interesting eclectic room in that inimitable UK-interpretation-of-an-american-diner style.  Good tunes, with a varied playlist.  Staff is friendly and helpful and the service is good.   Decent coffee with free refills.  Food is quite good and prices are reasonable especially considering the portions.  The 'small' cooked breakfast is plenty big, I can only imagine the large size would be truly substantial. Gluten free options available.  Scrambled eggs on toast very good, even better with salmon!  Recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "-EFC5OY77pnhKwlZoqOpJA"
  },
  "TPTXAIKjfWD6cUCCeTFnZg": {
    "date": "7/22/2016",
    "text": "Cool diner vibe with loud disco music. At night becomes drinks venue. Friendly service. Chicken fajitas were generous. Our group also enjoyed tomato basil Mozzarella sandwich.  Jumbo hot dog with pulled pork. Waffles. Good beer list. Great pots of tea. Enjoyable.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "44MsSi-FOHCQJxeQtlqbjA"
  },
  "bGGgluO-cSofJIO1QWMW6A": {
    "date": "9/8/2017",
    "text": "Just to give you the heads up, this review tackles the mid-morning service and food on a week day during Festival time (August). The place was full but with no queues or waiting lines and it was fully staffed. I met my friends at 10 am sharp for a coffee and a stack of pancakes with maple syrup. On the other hand, they order from the all-day breakfast menu The Castro (softly poached eggs with smoked salmon & hollandaise sauce on a toasted muffin) plus a couple of cappuccini.  Unfortunately for me, the (5 stack) Vanilla Pancakes American style with maple syrup & Nutella were a massive disappointment as were not made on the premises but bought from a chain supermarket (The Coop, Tesco, Lidl... who knows) and microwaved... Anyway, to open a gastro-bar business and buy microwave ready meals to be reheated and resold... that's called corporate cheating... needless to say that their quality was down south decadent as you can expect from a product bought from a discount chain supermarket... Paragraph apart for the service or shall I say the lack of it:  On the plus side: I was promptly seated and the random front of house person was a friendly dude. On the negative side: Friendly dude pulled the Harry Houdini disappearance routine and left us to rot with no menus on the table. My friend volunteered and started menu hunting, bringing 3 menus to the table. The young lady who took our order looked all doom & gloom. Again, the same friend went to chase and get a waitress so we can place the order. As cutlery/napkins/brown sugar had been used, we didn't get any replacements. When the third comrade joined us, friend number 1 repeated the Chasing the Waitress routine, passing the order update to her on the other side of the restaurant.  I forgot to tip my friend who was far more efficient than all the floor staff put together.  And that's why I give it 2 stars.  Must clarify that if you are just stopping by for a couple of drinks with your mates at the bar everything changes for the better, as bartenders here are pretty cool... as long as you don't order pancakes...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EcjDxqhvs8KmU2A0CH0PMQ",
        "caption": "Photo of The City Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EcjDxqhvs8KmU2A0CH0PMQ/o.jpg"
      },
      {
        "img_id": "OB1sNH6BJZyb4Jc4w5d9OQ",
        "caption": "Photo of The City Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OB1sNH6BJZyb4Jc4w5d9OQ/o.jpg"
      },
      {
        "img_id": "_zFnbep2SUyc1foM6ZtSwg",
        "caption": "Photo of The City Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_zFnbep2SUyc1foM6ZtSwg/o.jpg"
      }
    ],
    "user_id": "RBvR8MoGAoxeLlm_ajTYgg"
  },
  "1ga1C7CLpYTiU9COXkhLaw": {
    "date": "1/13/2016",
    "text": "I have been here a few times and I found that the service tended to be a bit slow. This occasion we did not have any problems, although it was quite quiet.  I ordered a whopper of a Bloody Mary. It was 10.50 and it included a skewer stick of smoked salmon, 2 large prawns, a stick of celery and cucumber. It was also damn spicy. So all in- a bloody good, Bloody Mary!  I also had the 3 stack of pancakes at 4 and added bacon for a 1. This was good. I was pleased and I was filled up. What was great is that it is a breakfast dish, but I was eating it late at night. They do lots of breakfast items all day and night. Which was perfect for us lot.  Good music, dark lighting, a pool table and breakfast at night. Wonderful!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cQMqOub1NTuPNaEZ5NORBQ",
        "caption": "Photo of The City Cafe - Edinburgh, United Kingdom. A Bloody Mary with celery, prawns, cucumber and smoked salmon! Yum",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cQMqOub1NTuPNaEZ5NORBQ/o.jpg"
      }
    ],
    "user_id": "dHgtMr3HyF7CyGUS03xU1w"
  },
  "LUco14e1GpRt6ax83mXXag": {
    "date": "11/21/2015",
    "text": "We stumbled upon this place whilst finding somewhere to eat close to our hotel.  We wanted something that was going to fill our tummies but not break the bank - this place fit the bill. We both ordered variations of burger and chips, great portion sizes and the food was bang on. We accompanied this with a beer each - the bill came to 23 odd and we left feeling satisfied. The menu was really good.  My only complaint is the service. Nobody acknowledged that we had entered the restaurant and nobody came to our table to take orders. I wasn't (and still am not) sure whether you are supposed to order at the till - but this is what I did cause I was hungry and not wanting to wait around.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "fH3gfSXqbd8-iKxDsODJwg",
        "caption": "Photo of The City Cafe - Edinburgh, United Kingdom. Burger meals",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fH3gfSXqbd8-iKxDsODJwg/o.jpg"
      }
    ],
    "user_id": "ZW08feFLVnmoqpUfYzS0jw"
  },
  "t1bh1O2BNHkrcdbKM4ALeQ": {
    "date": "10/25/2015",
    "text": "This establishment is a great place for lunch and the decor is set up like an American Diner.  I ordered the milkshake and the ribs for my main.  They have by far the best rack of ribs I have ever eaten in Edinburgh.  Tender, fall of the bone and I have yet to see such good ribs in Edinburgh yet.  They also provide extra sauce to go together with your ribs.  I am also a fan of their milkshake which is thick in texture compared to other establishment which is slightly on the runnier side.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "wRKEsNgEQ0yrZ82KjAXXSA",
        "caption": "Photo of The City Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wRKEsNgEQ0yrZ82KjAXXSA/o.jpg"
      },
      {
        "img_id": "BauS5kWNXbBZdra8y1uN3Q",
        "caption": "Photo of The City Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BauS5kWNXbBZdra8y1uN3Q/o.jpg"
      },
      {
        "img_id": "FSxUI7tvPTm2uVChogKR-w",
        "caption": "Photo of The City Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FSxUI7tvPTm2uVChogKR-w/o.jpg"
      }
    ],
    "user_id": "bJ5CG5cBguo09dqLFTyHjw"
  },
  "F8YTwDJvI918KgxMUb634Q": {
    "date": "3/14/2017",
    "text": "Great spot for breakfast. Fast service, good food for the price. Started hear on our way to the Castle and glad we did. Waffles, porridge & coffee were what was ordered.  Eclectic setting but easily accessible by foot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uxSEMctBJ7YLwIt2gIOWPg"
  },
  "HoUxI6UCL2kRzbR89T35RQ": {
    "date": "5/12/2017",
    "text": "All around awesome lunch! I had the piri piri chicken , and my friend got the chicken bacon sandwich. Really cool American diner vibes, cheap drinks, and great wait staff! For two Americans studying abroad in Spain, it was nice to eat some American style foods :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DbQmlhC34mJK47xRNvvdZg",
        "caption": "Photo of The City Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DbQmlhC34mJK47xRNvvdZg/o.jpg"
      },
      {
        "img_id": "-ZUl_DMhBz44njKxeCKTOw",
        "caption": "Photo of The City Cafe - Edinburgh, United Kingdom. Piri piri chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-ZUl_DMhBz44njKxeCKTOw/o.jpg"
      }
    ],
    "user_id": "_IVamCaiGivpKm96PcTuiQ"
  },
  "a1a3gGpPIyzKPWig_2ay1A": {
    "date": "1/20/2015",
    "text": "I love lots of things about the City Cafe.   I love its sort of run down but still clean and shiny feel. The chrome and cushioning says it all.  I love the hat tip to the American diners of old. It feels transplanted from the 1950s mid-west right into the heart of the Old Town.   I love its menu, with a solid breakfast section and plenty of other options. I can highly recommend the stack of five pancakes, which arrive absolutely swimming in  maple syrup. No stingy portions here.  I love its burger challenge, which contains so much food it's beyond understanding how anyone - let alone 20 odd people - have managed to finish the plate.   I love its booths and pool table, where you can chill out with a couple of friends, enjoy a drink and catch up.   So, basically. I pretty much love it here. The only thing keeping the fifth star off the place is the loos, which are awkwardly downstairs, a bit cold and need some TLC. But other than that, we're onto a winner here.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "tTiMixykHhQRAIBaRc3AQg",
        "caption": "Photo of The City Cafe - Edinburgh, United Kingdom. Pancakes swimming in maple syrup!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tTiMixykHhQRAIBaRc3AQg/o.jpg"
      }
    ],
    "user_id": "fcMTpwfLS9F5DWTqlp8ktQ"
  },
  "UEgUPrKz15jzQppPyOj-hw": {
    "date": "4/19/2016",
    "text": "Its possible to spend a whole day here. Proper chill, proper milkshakes, reasonably priced food and drinks. Service can be a tad slow, but totally fits the laid back attitude of the place.  Where I feel city cafe shines though is at nighttime. Its always full to the rafters, with a great pre club vibe. Plus slightly tipsy pool is always a winner.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "rDacT7_YW2-geunGcmgeEw"
  },
  "4bCaaW0yjuT9c-n0xnwtPQ": {
    "date": "1/16/2016",
    "text": "I was missing some good ole American breakfast so I looked for places that served American type breakfast meals. After a quick yelp search... I found this place so grabbed my friend and went! I was excited to see some of the typical breakfast you can find in the US- I was extremely excited to see they had pancakes. Of course I had to get the pancakes! I mean don't get me wrong, I love crepes, but sometimes this boy just need a big round fluffy soft American style pancakes drenched with warm maple syrup and topped with melted butter.   I was so excited to get my pancakes, but when I got it...I was like WTF is this? Hahaha...the 3 pancakes were not as big as the 9\" round plate, more like the size of a mini tea plate...totally destroyed my grand expectation to satisfy my cravings. To be fair it was soft and was good with with the syrup, but still....if you're going to advertise it as American pancakes, it better come in American servings, just saying.   What I will say I do like about this place is their milkshakes. If you have cravings for milk shakes and cat be bothered making em yourself, then come to this place cause they a long list of different types. On another occasion I went to this place just to try out their milkshake, I got a Ferrerro Rocher milkshake and it was YUM. A bit steep with the pricing, but was well worth every calories for it. On Friday nights they also have a live band playing so that was a cool treat. It can get a bit busy on a Friday and probably Saturday night, but pretty good atmosphere. If you're looking for an American type diner, this place is ok... and they definitely don't serve American servings.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LMkFulPXQHRGMAaJSPUyVg"
  },
  "xURuWHFSKy4ofIbqBcqmDw": {
    "date": "3/2/2016",
    "text": "We had the waffles and the pancakes. Both were good! The maple syrup was especially good! The prices are pretty decent as well, definitely recommend going if you're in the mood for a sweet breakfast!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CPT9uImfhxGPiPEwvysudg"
  },
  "tw5oh9ekjf1k18KMdyhiuQ": {
    "date": "2/13/2018",
    "text": "One of the worst waffles in the history of the world. The fact they had the AUDACITY to try and serve me the waffle with a straight face is mind-boggling. Was going to Brussels for the weekend for one reason. To eat my body weight in waffles. Unfortunately, I missed my flight and was forced to stay in Edinburgh for a few more days instead of going back home, Glasgow, and telling everyone how much of a stupid idiot I am. So anyway, all i wanted was an effing Belgian Waffle to save myself from climbing Arthur's Seat and jumping to my death, but this place instead insulted me with the worst excuse for a waffle I've ever heard. This place should be criminally investigated and shut down immediately. I did take a picture of the waffle to send all my friends to hoodwink them into thinking I was in Brussels. Also the waitress was your classic Swipe Right on Tinder.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eOaBhl76aBeXac8cbygV7Q"
  },
  "2z_3YnB8KHjQ8zhMZb3wPA": {
    "date": "3/18/2016",
    "text": "After spending more time here than is possibly healthy, I felt it only right to pen a few words, extol the virtues of this fine Edinburgh institution.  A large veggie breakfast was ample to see me through the day.  Polite friendly service & a bowl of water for the dog.  City Cafe is dog friendly as long as your pet remains likewise.      10/10! 5 Stars. Look forward to our next visit!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SYtqTewDw7Bi8eqkZCQblA"
  },
  "rZs4xXkWSjWcNUlTg36ZuA": {
    "date": "3/30/2013",
    "text": "So American and the Milkshakes!  I really like this place. It reminds me of the America's in the 50's from the Grease movie.  The seats could be more comfy, but overall its a nice place to have breakfast or lunch.  Dinner time is more of a drinking time. Lots of people there on a FRI night, drinking and celebrating. Very loud, and you can't really get a table nor a chair.  In the back there is a pool table. That's cool!  They serve all sorts of Milkshakes (Choco, Strawberry, Vanilla, Toffee....) and they taste really nice. If you try to loose weight then the Shakes are not a good choice :-) I like American Pancakes and they got them. Yummy: Pancakes with Maple Syrup.   Here I come again.....Soon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "s85sNAMlsrI0xCRvfj7Jrw"
  },
  "keBtEWAvr5mbBK0g4RMdDg": {
    "date": "10/5/2011",
    "text": "Surprised I've not reviewed this place before, having been a customer over a number of years. Probably best to be writing it up now though as since its takeover (& small makeover) last year the food has thankfully returned to the level of quality I'd come to expect so if you are in the market for a good burger this is a good choice. The eggs benedict is decent too. There's now a single pool table upstairs after a few months of there being none. By the looks of things it allows for better cue positioning than the two tables that were here in the past but I've yet to play on it myself.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Fn1qY1Fm73rhz6Hepj19yA",
        "caption": "Photo of The City Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Fn1qY1Fm73rhz6Hepj19yA/o.jpg"
      },
      {
        "img_id": "mxizk8tx8Jz_1NhlQ5ux9Q",
        "caption": "Photo of The City Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mxizk8tx8Jz_1NhlQ5ux9Q/o.jpg"
      }
    ],
    "user_id": "txzOZrHK9EVY0kYjSuXkKg"
  }
}