{
  "dzRD3K7R-il8BjLdUE1weQ": {
    "date": "10/12/2017",
    "text": "Tried to get there. Took a cab to the location at 7 pm on Wednesday night. Door was locked, no lights and it looked like it had been closed for a long period of time. Was pretty disappointed",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QoGKik9NuJQS5u_ha1Y3_A"
  },
  "V9hndJ6YIq7qkB2wpf7O2A": {
    "date": "7/1/2016",
    "text": "Good, solid choice for authentic Italian. Ambiance: A little crowded and fills up quickly after noon. But clean and appealing. Service: Considering the amount of people it was very fast, but the staff were clearly a little stressed out. Food: Nice flavours while being more traditional in the sense that most dished only have a few fresh ingredients and it's not hidden under loads of garlic. I had the pasta nonna which had tender pieces of steak and fresh pasta. My friend had a pizza which was done in the Neapolitan style. It was huge and very tasty without being greasy or over the top with the toppings. Price: A little more than the other Italian joints nearby but better quality. I would go back if given the chance.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LaGysanTNxMYRr7ecBy_zA"
  },
  "dbJeOB026pY99eb-gWFvag": {
    "date": "12/2/2015",
    "text": "This was recommended to m by the hotel staff at the Hilton I was staying at and it's a small restaurant that you've probably passed a millions times and never thought twice. Think again! it was such a delicious meal. One of the better Italian restaurants I've eaten at. Homemade noodles. Homemade sauce. HOMEMADE ICECREAM. They have many awards for their ice cream and I strongly suggest on savings some room for something sweet.   The menu is overwhelming so I would ask the server's to help you narrow down to what you're in the mood for. They are a wide variety of items; pizza, pastas, calzones, starters and salads.   It's perfect for a family night out or something smaller or more intimate. I would suggest a table away from the door.  I hope you enjoy it as much as I did!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "70owtRdRpBTJ9cRKDohg8A"
  },
  "fjE0-avDKR2cj9oYmxwHkw": {
    "date": "9/22/2016",
    "text": "Amazing food, the pasta dishes looked delicious and tasted even better. Service was very quick too! Loved it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "j41ZbtBzWpKGtnvC4c479w"
  },
  "v-4HuZNTDhzMuSwDvW_c4A": {
    "date": "6/7/2017",
    "text": "Lovely inner city Italian restaurant with excellent service and a sweets menu to die for. Food was outstanding and well priced also.  Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-uL3dOQ5OeZ2yBwvkG5Kjg"
  },
  "33xC03mP2C7VWI-fL8ofKw": {
    "date": "7/10/2016",
    "text": "A perfect find in Edinburgh. This little spot has all the charms of a great Italian restaurant: traditional, romantic decor; professional and welcoming service; an excellent wine selection; and fantastic food. We had the arugula salad, a small plate of spaghetti with tomato sauce, a margarita pizza, and a scoop of stracciatella ice cream. Everything came out fresh and flavorful. We were given a home made chili oil to put on our pizza and we absolutely loved it! We are already planning to return again just to try their extensive dessert menu. Don't miss this great find. It's perfect for a drink, a full meal, or even a late night dessert!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SlCchmq2d_QKWbFwc8TEyw"
  },
  "yDuwuNgWh-6FxhP4nD7tGg": {
    "date": "7/18/2015",
    "text": "Just ordered from deliveroo. Yes late in day. But still fairly horrid. Wrong sauce with calamari ( not a problem ) calamari was ok, nice and crispy. Pasta was mezze rigatoni allo zafferano, alright, fairly tasteless and undercooked. Pizza however was terrible, completely raw, soggy and had a few dodgy mussels. Arrived at least 15 mins before expected and no mre than 15 mins after ordering so no chance of it actually being cooked as we were 5 mins away maximum. Dissapointed",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1otkilxTrHF6Z1vdrrlZrQ"
  },
  "b0zKJMMxoH6pzYyNy0hkGA": {
    "date": "5/10/2014",
    "text": "With a pre-theater menu, apparently they're a popular place to go right before then! A mid-range price menu for a uni student, they had some lovely dishes, from of course, pasta, to pizza to rizotto... But if you're not sure what you're ordering, ask! The names are in Italian and although the ingredients / components are listed below, some of them I didn't fully recognize!  The best part though is their ice cream--I got the classic strawberry, and it was very smooth and creamy, and it was obvious it was not artificial flavouring at all. They advertise their ice cream, which they definitely should! So make sure you save room for that--particularly if you get the pizza. It's bigger than the whole plate for one person!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2UGVS83gei9c21CoH5nTKQ"
  },
  "AKc0fFV7LALWbT4_Mj6SmA": {
    "date": "6/28/2015",
    "text": "This was my families second night dining here and I just have to say, its amazing. Their Gluten-Free pasta is incredible, their service is impeccible and it reminded us all of when we dined on the Almalfi coast in Italy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-3gCtrp6npN0OGyivOWYuw"
  },
  "z1zD110K9nXV5Sn7qqwAFQ": {
    "date": "4/14/2014",
    "text": "We walked down the street looking for a place to eat. Saw the place was packed and looked at the menu. Decided it must be good because it's so busy. We were right!  The waiters are the best and the foods is very tasty!   To top it off we ended with desserts. Ohhhhh sticky toffee pudding. So yummy!    This is definitely a place to visit in your travels!  Would become a regular if we lived here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X2SJ3wbnYLavsXBNS2FXig"
  },
  "ovXqrxpdgFgpx8HXkDlJ5A": {
    "date": "11/2/2012",
    "text": "This is a bright and airy bit of Italy in Edinburgh, filled with somewhat stereotypical (although nice) Italian country designs.  Plenty of yellow contrasts with dark wood furnishings, and large windows look out on the street.  The food is very good, and the primary menu is large, as are the dessert and drink menus.  Many of the entree options allow half orders, which are excellent for lunch or for smaller appetites.  The staff is warm and friendly.  An enjoyable place for lunch, especially.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "oBhQMjrT0zdSLdlybWRA_w"
  },
  "EPIoMcy8b2JF5mQbkgCAGA": {
    "date": "4/5/2013",
    "text": "This is one of those places you pass a zillion times and never even realise it's there. I've passed this Italian endless times over the past few years and instantly forgotten its existence.   It will be on my radar going forward though, because boy is the food here good. I came for a family meal and all six of us had a really enjoyable meal. The restaurant was also packed, which just reinforces the idea in my head that this place is a bit of a gem.   I went for the calzone. Worried that it might be quite small, I was more than pleasantly surprised to discover that my plate of food arrived looking like a pizza mountain. It was enormous! And really tasty too.   Desserts are something else. The menu runs to two pages and all the puds seem to be made in-house. The ice cream was amazing. I'd come back here as a place for desserts alone. My banana split was excellent, and the items that came in knickerbocker glasses looked immense.   Will definitely be back. Great little restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fcMTpwfLS9F5DWTqlp8ktQ"
  },
  "-TNYuj14ZKV5FE8IE7gLnA": {
    "date": "12/24/2012",
    "text": "A random Italian place with great service. If they have it do the frutti di mare. Comes with A TON of seafood. We were pleasantly weirded out by the quantity.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xj0O2l0bp633ebmG468aZw"
  },
  "m1ZuZDfxAiIGZbJlDUtDkw": {
    "date": "6/4/2012",
    "text": "The most AMAZING ice cream in the whole world!! - Award winning in fact, I'm surprised there is only one other review because I feel as though I'll be raving about this for a while.  The food here was great, all 5 of us enjoyed different meat and vegetarian meals and all agreed that we would go back here again in future for a good Italian.   The staff are genuine Italians and very friendly. Decor is a bit tired but that was irrelevant once we tucked into the Bruschetta starter and it only got better from there on in.  I'm almost considering going again tomorrow just for Ice cream, seriously.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "J1iZnGC5MVIZvUye4U8Z6w"
  },
  "b7RdXTUfvB_MLSvDhxJZNA": {
    "date": "9/30/2015",
    "text": "Saw the great reviews and thought to give Bar Italia a try.  The home made fresh pasta was terrific - although not al dente- it was flavorful and really fresh.  My friend ordered the mussels - entree was a generous size and the sauce was really good.  Don't forget to have dessert- we had the lemon sorbet and meringue dessert - presentation was unique and it was terrific",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XH9gtcrOZgt8tRfwfJKM7w"
  },
  "33qUR7zPNj7yb85cV1DQFA": {
    "date": "3/20/2011",
    "text": "Great food, staff welcoming and tend to every need great place to eat. also selling traditional Scottish drinks etc.   Possibly could be my new regular restaurant!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qslDggl42fjpzWgFmz6TFA"
  },
  "dD0FfCZw6mQ86epk9JhVIw": {
    "date": "9/5/2019",
    "text": "After a long cold day of sightseeing, we were more than ready for a good meal and this ristorante certainly did not disappoint.  Everything is excellent here from appetizers, dinner and dessert.  We had the bruschetta with balsamic vinegar.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DZFrj0W_secXs0-vrvHYOg"
  },
  "FqYrOjXXZrFAIXAs4eO_qQ": {
    "date": "6/29/2019",
    "text": "This restaurant certainly does not waste space. Tables are very tight packed amongst each other, and it's totally navigable if you are able bodied, but if you have a disability that requires a walker, etc. it might be tough. The staff are very accommodating however, and they will try to make it the best experience for you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eQcyH1nS7ruNJo5cmHNUJw"
  },
  "o3hwAFQtCg_f_HYzxlrf6Q": {
    "date": "8/9/2019",
    "text": "Most wonderful Italian food.  We had Dover sole and Lasagne.  Both were excellent.   The server did a brilliant job of deboning my fish which I appreciated.   The lasagne was meaty and the pasta melted in your mouth.  Their award winning ice cream is a must for a great finish.  Great atmosphere and service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DO6lihUNc39qeua4s_TfPg"
  },
  "bnYpzrMi0woCgOsaCi6YiQ": {
    "date": "6/10/2018",
    "text": "Excellent food made by Italians, accompanied by great service. The pizza I had hit the spot as did the appetizer I ordered. Pizza was thin, yet crispy enough to hold firm when the slice was picked up, with the perfect blend of sauce & cheese. The ambiance was nice and it was open late, whereas many of the local businesses were closed on Sunday.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PbjNbVcHw4vbLjI6EzG9eA",
        "caption": "Photo of Bar Italia - Edinburgh, United Kingdom. Margarita pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PbjNbVcHw4vbLjI6EzG9eA/o.jpg"
      },
      {
        "img_id": "CPEHfhyDP8chNgkMQHRi7A",
        "caption": "Photo of Bar Italia - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CPEHfhyDP8chNgkMQHRi7A/o.jpg"
      }
    ],
    "user_id": "CwtSfxxOupTW4wFR0dLnew"
  },
  "ms-o6fZvI64uklk7MvjufA": {
    "date": "5/24/2019",
    "text": "We had the pizza and it was very good and authentic. You can't skip dessert, the ice cream is amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WFou1ZnuR7wV9E23LpMJxA"
  },
  "C3Ejmviky61XlMBDz2y3-g": {
    "date": "3/20/2019",
    "text": "Great little place, that's more authentic than it seems at first glance. My wife and I had nice pasta dishes that we both enjoyed and my daughter had a great little pizza. Service was efficient and pleasant. If you are looking for a good Italian place that won't break the bank, this place is definitely worth consideration.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fmGvxarrBoDy1_dMiUJQRQ"
  },
  "S9QGAhYfjvX1QcYvlHEE7Q": {
    "date": "11/5/2017",
    "text": "I came here on a Sunday night after a day of flying. Tired and cold, I just wanted some hot satisfying Italian food. This was closest to my hotel so I gave it a shot.   The mixed salad was very traditional, and by that I mean iceberg lettuce, hot house tomatoes, oil and vinegar dressing. Meh, but exactly the kind you find all over Italy.   Next, I had the lasagna. This was quite possibly the best lasagna I've ever had. When I finished, I wanted it all over again. Get the big portion.   Bar Italia claims to have award winning desserts. They don't lie. I had their champion ice cream, Belgian chocolate and cappuccino. I could make a meal of just desserts.   I would definitely go back.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AMZZ581cL5-pxy5G0odjWA",
        "caption": "Photo of Bar Italia - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AMZZ581cL5-pxy5G0odjWA/o.jpg"
      }
    ],
    "user_id": "7RLD1Bk44QeaM8wAABXH0A"
  },
  "4-VAx9tbSmSFR5xARTkhUA": {
    "date": "6/17/2017",
    "text": "Modern eatery with good Italian food, nice decor and lovely service. Everything you'd expect from an Italian restaurant, absolutely something for everyone. Pastas, risotto, fish, meat, prepared numerous ways. We enjoyed a number of homemade pasta dishes, the crab filled ravioli with mint was quite good, as was the rigatoni in tomato sauce. Presentation was lovely and the ambiance made the meal most enjoyable. Bruschetta was fresh and garlicky good. I would have enjoyed more peas in the fettuccine dish, but truthfully that didn't inhibit my enjoying the dish. Easy walk from our apartment in a fantastic part of Edinburgh. I would return again, even if only to get my fix of Italian food.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "83tdxFUx3UvtkxU6Ex0Gkg",
        "caption": "Photo of Bar Italia - Edinburgh, United Kingdom. Can&amp;#39;t forget dessert! Chocolate souffle with Martone ice cream. Delicious!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/83tdxFUx3UvtkxU6Ex0Gkg/o.jpg"
      },
      {
        "img_id": "t6zEwHqNLPVxg-o0en4Ocg",
        "caption": "Photo of Bar Italia - Edinburgh, United Kingdom. Rigatoni noodles Italian sausage, mushrooms, basil in a tomato based sauce.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/t6zEwHqNLPVxg-o0en4Ocg/o.jpg"
      },
      {
        "img_id": "_ZD8IKseYgzowg0sXB2dIQ",
        "caption": "Photo of Bar Italia - Edinburgh, United Kingdom. Ravioli filled with crab in a tomato and mint sauce.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_ZD8IKseYgzowg0sXB2dIQ/o.jpg"
      }
    ],
    "user_id": "fzL5-AA6lzfxDe317rIIBQ"
  },
  "Sg3xSYi3ndm35NKBUmuU3Q": {
    "date": "2/22/2016",
    "text": "I yelp everything I can in the USA but ended up finding this place with Tripadvisor.  We walked about 1 1/2 miles to get here from the city's center attractions and it is just beyond Edinburgh castle and had a most enjoyable evening.   First off, the staff was friendly and gracious and almost all were armed with a strong Italian accent. They paid special attention to the pint sized customer of 6 years and she delighted in her minestrone soup, spaghetti and especially their homemade ice cream that was cutely decorated.   I have never had a better prepared Dover Sole entree ever! It was done with a lightly lemony almond based sauce and it was super fresh and I even enjoyed to roe! The arugula salad was a very small portion for the price but fresh and herbal.   My friends ordered the Cavatelli al sapore di Mare with seafood pasta in squid ink sauce that was scrumptous and the Trofie Al Pesto was delicioso, with walnuts, prosciutto and a cream sauced pasta. All the pasta was homemade as well.   I rarely give restaurants a 5 star rating, but this place easily placed on the 5 star list by me!!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "VWeVZTX4daxzmZcEIq6adA",
        "caption": "Photo of Bar Italia - Edinburgh, United Kingdom. Crepe Dulce",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VWeVZTX4daxzmZcEIq6adA/o.jpg"
      },
      {
        "img_id": "dsGQ5vLqtaVLoQjpTGvo_Q",
        "caption": "Photo of Bar Italia - Edinburgh, United Kingdom. Seafood pasta in squid ink sauce",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dsGQ5vLqtaVLoQjpTGvo_Q/o.jpg"
      },
      {
        "img_id": "rKFNxAwOZ9JJZSCqHWqvOA",
        "caption": "Photo of Bar Italia - Edinburgh, United Kingdom. Trofie el pesto",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rKFNxAwOZ9JJZSCqHWqvOA/o.jpg"
      }
    ],
    "user_id": "S6TvDZGLWHXjjCbGufE1QQ"
  },
  "NPhxzrfA_GPVxGEg_rRBTA": {
    "date": "1/3/2017",
    "text": "This place is legit. It's well priced and it's super cosy.   We arrived in the area quite late from a flight and hadn't booked a table for dinner bc we were overly optimistic. After trying a couple places down the road which were rammed we took our Airbnb hosts' recommendation and came here.  We enjoyed the Italian waiters, there was a birthday on the table next to us - it was fun an lively.  I had a veal parmigiana with a side of spinach and my friend had chicken with a side of peas.  The peas were sauteed with delicious pancetta and reminded me so much of my childhood that I ate more than half her portion :/.  Great neighbourhood restaurant, authentic and local!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "gesO9WPIQqfe8cka8jte2A",
        "caption": "Photo of Bar Italia - Edinburgh, United Kingdom. Small antipasti",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gesO9WPIQqfe8cka8jte2A/o.jpg"
      },
      {
        "img_id": "rpjmPNGXfxW4uam19A9Uzw",
        "caption": "Photo of Bar Italia - Edinburgh, United Kingdom. Veal parmigiana",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rpjmPNGXfxW4uam19A9Uzw/o.jpg"
      },
      {
        "img_id": "ZjCptajxIf1e8hlX07FC5Q",
        "caption": "Photo of Bar Italia - Edinburgh, United Kingdom. Sides - garlic spinach and peas with pancetta",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZjCptajxIf1e8hlX07FC5Q/o.jpg"
      }
    ],
    "user_id": "vN740jaTqpOOZd47PqkkSA"
  },
  "sLgUF-THqdIUCc53btr5cQ": {
    "date": "6/20/2018",
    "text": "Everything our party of 4 ordered was excellent.  I highly recommend this great Italian restaurant with great service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6-1MM_zPlgwUzdxuixJJWg"
  },
  "uY-iq0R27x2GvjcH0epfVA": {
    "date": "7/29/2018",
    "text": "Whoever is writing all the 4 and 5 star reviews has never eaten good Italian food.  Went here after reading reviews on yelp and trip advisor. Maybe we hit on a bad night, but this was mediocre from start to finish. Ordered the garlic bread to start and the bread was stale. Knew right away that if they cant get the simple stuff right the rest of the meal was not going to be any better. We were not wrong. Lasagne was just about better than the frozen lasagne you buy in a supermarket. Steak at 24  pounds was burnt and comparable to what you would get at a mid level chain restaurant.  On a positive note Im so glad I did not order seafood.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "77uxFHAtIVzZTTjLuEFmjA"
  },
  "7LPyaFX8L8onLhW5sCoUsw": {
    "date": "6/27/2018",
    "text": "First time here! Great service! Helpful waiters and food to die for! Had a great salad with walnuts, arugula, large pieces of parmesan, and crispy slices of apples, all drizzled with balsamic reduction! What a great start! Simple pizza, and dessert of homemade ice creams, pans gotta, banana splits and much more! Pastas looked great too! Our full meal with glasses of wine was less than lunch at the museum!! LOVE BAR ITALIA!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Nd6GTDtd1_7D2JXDSR6aQ"
  },
  "sNiK4cMSE63CEbS1UjAoCA": {
    "date": "11/13/2016",
    "text": "A few days in Edinburgh and felt like I stepped into Italy in this amazing little resturant! food was like being in Napoli!! i read some of the posts before going and every positive one was on target. the Sauce was perfect. pasta cooked just right and the veal was perfectly cooked.and could cut it with a fork... so good! and if you have room for the dessert... you must try the homemade Mascarpone raspberry and chocolate powder.. out of this world!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xHiUWRWncEqcDU0WEr6n3A",
        "caption": "Photo of Bar Italia - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xHiUWRWncEqcDU0WEr6n3A/o.jpg"
      },
      {
        "img_id": "SgpEeRWlMv3_X4X-yskOjw",
        "caption": "Photo of Bar Italia - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SgpEeRWlMv3_X4X-yskOjw/o.jpg"
      }
    ],
    "user_id": "bxNF0eU_yKHKcSmnWG9riQ"
  },
  "KbxvDZlxdd08Fi5741KMrQ": {
    "date": "3/4/2016",
    "text": "When my go-to Italian joint in Edinburgh was closed on a night I'd promised a friend some birthday carbs, I had to quickly spring into action and suss out nearby Italian option #2 . Bar Italia fit the bill just perfectly!  First of all, upon entering Bar Italia you'll notice not only how spacious it is, but how comfy-cozy. I totally dig the vibe of it all--it's sort of old school charming with gingham red-and-white tablecloths and rustic wood paneling. The tables have plenty of space between them, so you won't feel like you're exhaling garlic fumes down your neighbor's neck (super perk, as a girl gotta eat all that garlic without worrying). Our waiter for the evening was a friendly young chap who was happy to explain the specials of the day several times for my indecisive sake--he even went the extra mile by proffering a wee business card with the joint's wifi passcode on it without us even asking. Super brilliant, especially if you're a tourist passing through!   Bar Italia has a sizeable menu to choose from, with enough veggie options for me to hem and haw over. In the end, my friend and I split some balsamic drizzled bruschetta as a starter, I got a stuffed ravioli dish, and my birthdaying-partner-in-crime got a substantial portion of pizza pie. Nom!!! Seriously, I ate every bite, and relished in the mildly spicy decanter of chili oil that our waiter provided for the table. After sopping up our leftover sauces and packing away my partner's pizza, we paid (after some True \"relax!\" style service in which it did take us a wee while to procure the bill despite it being a quiet night) and headed off with Italian baby bellies. Delicious, and the bill didn't break the bank either, even with some house wine split between us.  In the end, Bar Italia is such a stinking cute joint, and the food is darned tasty, so you bet I'd head back again especially if hankering for Italian food near Lothian Road!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "m699J6tY4vZ64mbPExzgBw",
        "caption": "Photo of Bar Italia - Edinburgh, United Kingdom. I love me some gingham tablecloths. Feels like a different time. :)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/m699J6tY4vZ64mbPExzgBw/o.jpg"
      },
      {
        "img_id": "9jtQEA_gJHDOWtFGsYBF2A",
        "caption": "Photo of Bar Italia - Edinburgh, United Kingdom. A sizeable pizza for one might be a challenge to eat in one sitting--they&amp;#39;ll pack it up for you if you can&amp;#39;t finish it!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9jtQEA_gJHDOWtFGsYBF2A/o.jpg"
      },
      {
        "img_id": "9rm4RmmprG8WJ5whv-Tpmw",
        "caption": "Photo of Bar Italia - Edinburgh, United Kingdom. Some sort of veggie-stuffed ravioli--delicious!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9rm4RmmprG8WJ5whv-Tpmw/o.jpg"
      }
    ],
    "user_id": "ZslMmrn4z4BMPRRDoaBtgA"
  },
  "k96HKy62jdJdcshDzhkzwQ": {
    "date": "4/1/2018",
    "text": "We hadn't read any reviews of Bar Italia and were just walking by and decided to give it a go. What a pleasant surprise! We had the pizza as an appetizer which was made in their wood burning pizza oven and delicious. They have a great selection of pastas. They offer kids meals too, which can include minestrone soup and gelato. The staff was friendly and attentive throughout our meal. I'd definitely eat here again if visiting Edinburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-yuMOhINrnvb-HXUdW3Agg"
  },
  "riui_82nk8cgiN8LjFh4Nw": {
    "date": "7/2/2017",
    "text": "We all had seafood for dinner. The fish was fresh and everyone enjoyed their meal. The servers we attentive.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "QGEmh813B5rO2yhBi7_zrg",
        "caption": "Photo of Bar Italia - Edinburgh, United Kingdom. Dessert",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QGEmh813B5rO2yhBi7_zrg/o.jpg"
      }
    ],
    "user_id": "OX9vrdn2NX5c0hLM8mBG0w"
  },
  "4qafu2LmBTRbTA8sFMI-IA": {
    "date": "7/13/2016",
    "text": "Frankly I'd give it more stars if Yelp let me.  This is exactly the kind of Italian restaurant a foodie like me appreciates. Not too fancy, great vibe, awesome food, and above all, great staff.  My girlfriend and I went in there hungry. You tend to over order when you're hungry you know. So we wanted to start off with a large size Antipasto and a small Calamari. Our server, Christian, was kind enough to let us know that the large size Antipasto is pretty substantial and getting that and the Calamari would be a bit too much. So we listened to him and went for the small size Antipasto and Calamari. Sure enough, the portion size was great. Not to mention how delicious they were.   For the main course we had squid ink pasta (Cavatelli Al Sapore di Mare) and my girlfriend had the Cavatelli con Nduja. They were both very tasty. Pasta was cooked al dante, and the seasoning in the sauces is just on point. I'm guessing all the other pastas should be great as well, so really no matter what you get there, it's going to be great.  What I want to emphasize on tho, is their ice cream. Man do they have good ice cream! They make their ice cream in house so that's a good start. They've made their ice cream into all kinds of fancy sundaes large or small. But we went for the simple choice, just one scoop of vanilla ice cream with a shot of espresso on the side. When they arrive, just pour the espresso over the ice cream, and enjoy the rich flavors melt together. This way it's never overly sweet and there's just this hint of rich bitterness in the sweet and velvety ice cream. Perfection it is!  The meal totaled around 50 pounds, which is not cheap by any means. But if you ask me, a high quality meal like this for 50 pounds, that's as good of a deal as you can get just about anywhere. (We had two draft beers as well btw, without them it should be just a bit over 40)  Chris even gave us some post cards from Italy. I've been to a good amount of Italian restaurants all over the places, and this is a first. I know it's not much really, but the feeling you get when treated this friendly is just beyond words.   If I get a chance to go back to Edinburgh, Bar Italia would undoubtedly be my first and last meal there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dvVhQ1-S3wdtVWoviSQVdg",
        "caption": "Photo of Bar Italia - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dvVhQ1-S3wdtVWoviSQVdg/o.jpg"
      },
      {
        "img_id": "FZcwWmoteOTbBVTZRAdIDg",
        "caption": "Photo of Bar Italia - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FZcwWmoteOTbBVTZRAdIDg/o.jpg"
      },
      {
        "img_id": "oWOi6oXtFaU_3NCLx8O9Yw",
        "caption": "Photo of Bar Italia - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oWOi6oXtFaU_3NCLx8O9Yw/o.jpg"
      }
    ],
    "user_id": "yt_sovSdW1UgDCwjElq1-Q"
  },
  "W7PTGBoW3d6dKFzR623zcQ": {
    "date": "3/5/2016",
    "text": "I have been to bar Italia twice for lunch and I am a little in term of the number of stars i should give this place but due to the fantastic service we had both time, my vote is balancing toward the 4 instead of three; my first experience there was great; my friend ordered a pizza and i ordered pasta and it was all so delicious! However the second time i came.. It was really not as good; my friend and I ordered the seafood risotto and we both agree this was not cooked as a risotto but marely as rice in sauce; it was not bad overall but not a risotto; my other friend ordered the raviolo and some garlic bread; the raviolis apparently were good but i found 3 for  4 small slices of garlic bread a little steep;  I will go back to bar italia but might not try their risotto again",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OnBQL5LXxcr47feHF_fPHg",
        "caption": "Photo of Bar Italia - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OnBQL5LXxcr47feHF_fPHg/o.jpg"
      }
    ],
    "user_id": "ThHJVG58S2pqc8vJU4fDkA"
  },
  "Vp92_KMGRl5hvMi2DPGJpQ": {
    "date": "9/22/2016",
    "text": "This place was so amazing! We didn't know what to expect when we entered because we were hungry and trying to escape rain. And we weren't disappointed! Everyone was so friendly and the food was so delicious! Definitely the best meal we had in Edinburgh! I recommend ordering any of their homemade pasta. I had one with seafood and it had some of the best shrimp I've ever had!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "v8wupOsA4Espfp_tOQ3_2A",
        "caption": "Photo of Bar Italia - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/v8wupOsA4Espfp_tOQ3_2A/o.jpg"
      }
    ],
    "user_id": "9KaHrsewlt-0jTQrGTQgTg"
  }
}