{
  "q3x7a7zW5brqyWkNcGNhNw": {
    "date": "6/6/2016",
    "text": "Today we popped into the capital for the a look around. Came in for like lunch. Living in Sydney we are a bit spoiled for choice  of sushi. So wasn't sure if this would be any good. No Japanese sushi chefs on display. But it was actually pretty good and the choice was good also. Was it best Japanese food I've had? No. Was it close? No. Would I come back? Yes. There was nothing wrong with it. It's decent enough. Haven't paid the bill yet though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ppwI9g62O8hYzLn2RvV0Hg"
  },
  "XZkAbR-kezb2BhHRw8UQVg": {
    "date": "1/19/2015",
    "text": "I went to Yo Sushi down in Oxford and was dying for them to put one here! I love Sushi and it is difficult to find quick, take-away sushi. Downstairs they have a case full of small things and ready made rolls for take away, which includes some snacks and drinks, which would be perfect if I worked in New Town.  Upstairs is more of a fast-food style restaurant with a conveyor belt that circles around to every table. It was a Saturday afternoon, and their was a line, but it was cold and I was wanting to eat something healthy. The staff was really lovely and kept letting us know it wouldn't be too long, as people generally take longer to linger on the weekends, they were mindful we didn't become discouraged. The manager even brought around some Japanese nibbles for us to munch on while we waited.  When we sat down we were told about how to order things, or to just start taking things of the belt. There are 7 different colored plates, which vary in price. Since I am trying Veganuary, I was a bit worried I might not get my sushi fill, but luckily they had a delicious bean curd roll, as well as vegetable tempura, cucumber rolls, eggplant salad, and something pumpkin I can't remember. All of which were delicious, with unlimited ginger, wasabi and soy sauce on your table, you are not left wanting for more condiments! And you simply stack your plates for them to tally at the end.  To order hot food you press the button and your table and someone comes by to take your order. Otherwise, along with the condiments, there are two water taps, one still and one sparking that you can use to refill your glasses, no waiting necessary! The staff was again, really lovely, and the manager came by to check on us during our meal. Despite how busy it was, the staff seemed relaxed and like they were enjoying being there, which was very nice to be around.  I don't remember it being particularly noisy, but it isn't a massively big space and when it's full, I don't think you can expect to hear piano music. But I don't think the idea is to be a quiet, sit-down restaurant. I think it is suppose to be a fun place to share some yummy food with your friends, as it is a neat dinning experience with the food going by you constantly, I had to use so much restraint not to keep pulling dishes off!  When I am done trying out vegan-ism I will certainly be back for the salmon rolls!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dPA1RBX8-pF54IQGvwpyRA"
  },
  "UKnbwN9JnNuKwevGTdqIjA": {
    "date": "5/29/2015",
    "text": "I'm fairly new to sushi, having only been convinced to give it a go whilst my brother came to visit me. Trying to keep exploring this delicious food, we decided to meet some friends at Yo! Sushi.   To say I was disappointed would be an understatement. The katsu curry was delicious, but everything else was an overpriced let-down. After being spoilt by $3(~1.50) plates of deliciousness in Sydney, this was a rude awakening and my first experience of overpriced sushi.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EMDDtVFPed6njplpZNwUdg"
  },
  "9EW6DCtMRrZXr1FdF7c4ow": {
    "date": "10/23/2015",
    "text": "Went in hungry, left hungry. If it wasn't for the student discount I found, I would have pulled my hair out. The food is good but it is very over priced. Two pieces of a roll with chicken and greens was 3.60. The selection on the belt was VERY limited. Unlimited miso soup was good so we would go back for that, but will not return to eat. Atmosphere was cool. The service took forever. We ordered a glass of wine and never got it after waiting for 20 minutes. We also never had a chance to order hot food because of the slow service. If you want to have fun with rotating plates, China Red is a much better value (although it is Chinese).",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "kBmu3HF-KOv45hSRc_yERg"
  },
  "XoiTn_AJmVkAARzLbe12Wg": {
    "date": "1/18/2017",
    "text": "We ate at this Yo Sushi location in late December. We've eaten at different Yo Sushi locations in the past and enjoyed the experience. The Sushi was fine. The issue occurred when we reviewed our credit card statement. On the night that we are here, their credit card machines were apparently down, so they had to do each credit card transaction manually- the old fashioned way with the imprint and carbon copy. I do not remember the exact amount of our meal, but we had a light \"snack\" edamame, and maybe a handful of plates from the conveyor belt (in total.) We did not purchase any alcohol. In total, I believe our bill was in the 20 - 30 range. There were only 2 of us there. This evening my fiance checked his credit card statement and saw that he was charged $327.43 USD by Yo Sushi! The transaction was posted on 1/6/17 over a week after we had left Edinburgh. I assume they were backed up in entering the manual transactions. I HOPE this was an honest mistake and somebody just keyed in the amount incorrectly, otherwise this was egregious fraud. Either way, now we have to deal with the credit card dispute process.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wdAG94kQv3h04Ezz46FaZA"
  },
  "y3XXsQMoMj2zeszDL-8Msw": {
    "date": "1/30/2017",
    "text": "I love Sushi and was wandering around Princes street when I stumbled upon Yo! Sushi. I went in alone on a Sunday night and received horrid service. The Sushi was very low quality and fairly expensive. They even charge you for a glass of water. Definitely would NOT recommend to anyone who enjoys sushi and will never be returning.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u06n1yvFwTdk4N5-QLGUsw"
  },
  "kMHF7xZTjZAlob0j3LWf0w": {
    "date": "9/23/2015",
    "text": "Nothing spectacular as with chain sushi places but MUCH better than bonsai on broughton street.  I specified I had a shrimp allergy and still had my sushi contaminate!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PbgqvUdjTRh-HoJUqRvlmg"
  },
  "Ir4MS6JgHqDDI121tqtv3A": {
    "date": "1/16/2015",
    "text": "I am a sushi enthusiast and was excited to try yo sushi. Unfortunately, it was not a pleasant experience. Today my friends and I \"ate dinner\" at yo sushi. It is an understatement to say that we left displeased and hungry. For starters, the portions are small and overpriced. The quality of the fish is mediocre to say the least. The restaurant is more about the gimmick than the actual food. The waitress also failed to mention that they charge 1.10 for a glass of tap water that you fill yourself. We will not be returning and would recommend that you avoid this place at all costs. Don't be fooled by the pretty department store and the average yelp rating. It is far below average.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_2aUbDP0Z9QPm8Bz_m6Ong"
  },
  "nxZoJvpAK971Ya5wC9VHEQ": {
    "date": "4/25/2019",
    "text": "I think this place is just super fun so it gets 5 stars! I'm not a sushi snob, it was decent food, but the experience is what I loved! I was sat at the bar with a nice window view, and you just grab whatever dish goes by on the belt that you want! The menu shows the prices and details. Or you can order something else from the menu. You press a button for a server to come over. Water does have a charge, but you serve it yourself. A great location by the National Gallery as well. A bit more pricey, but I was able to get a California roll, the cheesecake, and water and was satisfied.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7NxV69OfT2KpWkPNniumAQ",
        "caption": "Photo of Yo! Sushi - Edinburgh, United Kingdom. Menu shows the price based on bowl color on the belt",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7NxV69OfT2KpWkPNniumAQ/o.jpg"
      },
      {
        "img_id": "nA8eHgkm0is4tFSTci0fUw",
        "caption": "Photo of Yo! Sushi - Edinburgh, United Kingdom. Menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nA8eHgkm0is4tFSTci0fUw/o.jpg"
      },
      {
        "img_id": "1Dn81UGggp5d4qB0odTNJA",
        "caption": "Photo of Yo! Sushi - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1Dn81UGggp5d4qB0odTNJA/o.jpg"
      }
    ],
    "user_id": "yguD0RPkytW0wYebIV2W1Q"
  },
  "7u9moW7JC4F8R5PVek30FA": {
    "date": "6/29/2019",
    "text": "Well, not so satisfied with food here.  Expensive but not tasty.  Have no other comments.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L8pzXm8S4scf0KstcKfEgA"
  },
  "SL3saDbpHqys9wjODUVsHg": {
    "date": "6/30/2019",
    "text": "Food was quite good, but this was by far the most expensive meal I had in Edinburgh. I'd give 3 stars but for the cost.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Uu62Qw_nArCwgssttC8YTA"
  },
  "LyPL6_HV2d3lUO7NNzl7oA": {
    "date": "6/8/2017",
    "text": "OK you know how it works.  There is a conveyor belt.  There are Japanese dishes on the conveyor belt.  You take what you want and pay based on the colour of the plate.  I have to say they are average sushi's.  However, from time to time, I need that Japanese fix which is priced averagely and quick.  I would say, sign up for the Newsletter email and look out for cheap nights and promotions.  Then go on those nights.  Probably the best way to save even more money.  That way you won't regret eating even more plates.  Sometimes they had a promotion where the more you eat the less you pay.  We tried to eat 50 plates I think.  Failed between 2 people lol.  But good fun!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_slkjT1Keq_8DxszZ2gpww",
        "caption": "Photo of Yo! Sushi - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_slkjT1Keq_8DxszZ2gpww/o.jpg"
      },
      {
        "img_id": "22WHzdpVfCQgLUjjxsIfmw",
        "caption": "Photo of Yo! Sushi - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/22WHzdpVfCQgLUjjxsIfmw/o.jpg"
      },
      {
        "img_id": "iD8L-73FYooli5XK0MFP6A",
        "caption": "Photo of Yo! Sushi - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iD8L-73FYooli5XK0MFP6A/o.jpg"
      }
    ],
    "user_id": "bJ5CG5cBguo09dqLFTyHjw"
  },
  "Ybjjxz3Z6xBT334ixjIghg": {
    "date": "7/5/2018",
    "text": "Yo sushi is a place to go only occasionally as it is expensive but it's worth it in my opinion as it offers something a little bit different and it was a very pleasant experience. This was my first time at yo sushi and I was struck by the views of the castle and then by the little dishes passing by on a conveyor belt and I thought 'This is cool'. Yo sushi offers a good range of different sushi dishes and I had a spicy squid dish and a seaweed dish which was flavoursome and delicious. The staff were  very friendly and helpful too, so all in all I had a great time at yo sushi and will return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GEgifgwsWxtihJ6u5OYfAw"
  },
  "9yvvFlhvV2-AapEEwhLu2w": {
    "date": "2/15/2016",
    "text": "I always try to be fair with my reviews, and very rarely say anything negative unless it's constructive...  So I'll make this constructive.   First of all, I love sushi and am fully aware that yo sushi isn't of the highest quality, but it serves a purpose.  Quick,  easy and reliable. Unfortunately I didn't get any of those things at this branch in Edinburgh.    As a single diner,  it took quite a while to be seated, longer to be served and even longer to actually receive my food. I will say that when it did arrive, the food was the usual yo sushi standard (which is good in my eye), but everything just took such a long time!  I also grabbed a waitress to ask for some more soup as she was clearing the seat next to me, and she seemed aggravated that I'd not pressed the button?!  really?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "4fYVFlntFi0YIFiYhEaQXQ"
  },
  "fWBrYTb4HE_pZEqvPnYKLg": {
    "date": "3/20/2016",
    "text": "First off, the staff here were great. Very helpful, polite, and attentive. It was the food I found sub-par.   My octopus balls were lukewarm by the time I got them, and lacked flavour. There were lots of plates on the belt that the time stamp had experienced on, and lots of very sad looking sashimi.   My salmon skin hand-roll contained some very limp and brown edged lettuce, and even the cucumber maki I ordered were falling apart and badly cut.   I usually eat at the Manchester Piccadilly branch, where although the menu options are smaller the food is superior.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JQ_HsLa6bP38Cu391zMO6w",
        "caption": "Photo of Yo! Sushi - Edinburgh, United Kingdom. Definitely the best view in any Yo Sushi I&amp;#39;ve been to",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JQ_HsLa6bP38Cu391zMO6w/o.jpg"
      },
      {
        "img_id": "Lq-ezeIj_6LPXiPAtP-U_g",
        "caption": "Photo of Yo! Sushi - Edinburgh, United Kingdom. Spicy pepper squid and octopus balls",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Lq-ezeIj_6LPXiPAtP-U_g/o.jpg"
      }
    ],
    "user_id": "8tJWenog7o0M3SrmqNTgBQ"
  },
  "Zza4pLCeIoFnlTfWsc8vbA": {
    "date": "7/10/2015",
    "text": "Went there 3 times now.... You need to go with the right expectations. This is not a high class Japanese restaurant. It's just a fun large sushi train. All 3 times the conveyor belt transporting dishes to choose from had 'trends' going. With which I politely say the variety was a bit limited. However, you could always just press the button at your table to special order a specific dish. If you are with only 2 or  3 the window seats are great. Its really a-ok, I find it fun to be able to pick, of course it is surprising how fast the cost adds up this way. The plates are color coded so in the end they just add up the total for you. The chocolate mochi balls are to die for. And I am a Belgian so quite picky chocolate wise ;) Will be going back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "16HGKEw8l062Ng9o8SpJFg",
        "caption": "Photo of Yo! Sushi - Edinburgh, United Kingdom. Every plate is colour coded based on the price of the dish",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/16HGKEw8l062Ng9o8SpJFg/o.jpg"
      }
    ],
    "user_id": "QpnH7JOjbMAAaYw0IIt_Xg"
  },
  "AyPA1AUOT3dpPLzIRGhf0A": {
    "date": "5/18/2016",
    "text": "I recently went there with a friend on a Tue evening in May.  The place was half full and still we got a fantastic window view seat with the conveyer belt passing by and continuous supply of Sushi peaces in different colour plates. I must confess that compared to other Yo Sushi places I was not very impressed by the assortment of Sushi passing by for the price you pay. If you have never been before, just to let you know that each plate has its own colour and for each colour you pay a certain price (example: for food in a yellow plate you might pay 3). Prices can be found in the menu.  You can either take the food from the conveyer belt that holds starters, mains and desserts or you ask the staff for help. They brought me my Miso soup. The staff is very friendly. The food on the belt is continously prepared by the chefs with a best before date on it. I loved the salmon sashimi dish, but it's about 6. Some of the plates have hardly anything on them :-(  This place is perfectly located on Princess Street with marvellous views towards Edinburgh castle. It's the perfect tourist trap.  Will I be back? Maybe for the views, yes. However, there seems to be another Yo Sushi nearby. Will try this one first!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "EtLxI15IF2jm6ZY5bh_2gg",
        "caption": "Photo of Yo! Sushi - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EtLxI15IF2jm6ZY5bh_2gg/o.jpg"
      },
      {
        "img_id": "zJhIbrs7fDzyGadBe3yrMA",
        "caption": "Photo of Yo! Sushi - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zJhIbrs7fDzyGadBe3yrMA/o.jpg"
      },
      {
        "img_id": "8zR6iFXb-VkVk8Hi_Z9JtQ",
        "caption": "Photo of Yo! Sushi - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8zR6iFXb-VkVk8Hi_Z9JtQ/o.jpg"
      }
    ],
    "user_id": "s85sNAMlsrI0xCRvfj7Jrw"
  },
  "EerizQ3fMCfMmAQwTR6CAA": {
    "date": "12/4/2014",
    "text": "Finally Edinburgh has a proper branch of Yo! No more cramming in to a tiny space on the top floor of Harvey Nicks.  Being slap bang in the middle of Princes Street I'm sure this branch will prove popular, if just for convenience. It follows the tried and tested Yo! formula - sushi and other assorted bites on colour coded plates whizzing past you on a conveyor belt. It's nice to sit by the bar and gawp at the talent of the sushi chefs (seriously, how good must their knife skills be to slice fish that precisely?) but in this branch it would be worth napping a booth in the window and enjoying the view of the castle, gardens and shoppers below.  Staff fairly friendly (and hopefully this won't wear off with time) and nothing to fault it. I'll definitely be back",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NOJ6QAC13U-19wkNIruZWg",
        "caption": "Photo of Yo! Sushi - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NOJ6QAC13U-19wkNIruZWg/o.jpg"
      }
    ],
    "user_id": "97JTwCnKnyTHpr6fp-sNdA"
  },
  "_dC4cOpcmu_tExJ_xYCTUw": {
    "date": "1/12/2018",
    "text": "We were really underwhelmed with our experience at Yo! Sushi. For Edinburgh, it was very expensive for a not-so-filling meal. If you don't eat raw fish or are vegetarian, VERY few options go around the circulating belt that will suit your needs. You can, of course, order off the menu but I feel that really takes away from the restaurant experience. Also, they charge you for tap water, which is bizarre. Overall, we'd say save your money and head somewhere else for dinner.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2K44SciqMMJK_Jk8qcFBvQ"
  },
  "MObUFxPPJZJLq08G2PcKAA": {
    "date": "10/29/2015",
    "text": "Scrumptious!!!  Love the conveyer belt  Loved choice of hot or cold food   Hot sake--stunning   Good prices  Got a window seat spectacular view of the theology buildings.   Chirpy music   Brilliant. Will go again.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "VSQyBAZyifo1kxA-ChkP9Q"
  },
  "8alwxME7voyqwwRaqtwB9g": {
    "date": "2/17/2015",
    "text": "If you've ever been to one of this chain's establishments before then you know what to expect. What set's this branch apart is the excellent views of Edinburgh castle and Princes Street that it enjoys - factors that may soon see it become a bigger earner than the branch in Harvey Nichols which is pretty much stuck in the dark on the top floor. The staff's obvious enjoyment at working here is another plus point.  Whilst there are none of the drink robots that the chain's original Rose Street site had many years ago the staff make up for that by being keen and attentive to your needs (which is what the 4th star's for).   Food-wise they've added a few new items since I was last in a Yo! outlet and the prices don't seem to have risen much, if at all (no doubt they're still cheaper than their concession at Edinburgh airport) but if you want good value for money there are better sushi restaurants elsewhere in the city. The option to sit all day and have unlimited miso soup is still a possibility though.  It's a fun and centrally located place to go for your first try of sushi or as a good and healthy option for some elevated people watching but once you've a taste for the food you should branch out and see what else Edinburgh has to offer in that regard.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "txzOZrHK9EVY0kYjSuXkKg"
  },
  "FKgtJkTOF4464tbxVP3tMQ": {
    "date": "12/24/2015",
    "text": "I just had my very first experience of Yo! Sushi, and I have to echo the current average three star rating.   There was nothing that made the sushi great; no beautiful zingy flavours, and the two lettuce leaves that topped it were limp and dry. I wanted something light to eat on the train home and it was totally fit for this purpose, but I could have bought a lovely sandwich elsewhere for a fraction of the price. Great sushi doesn't leave room for such thoughts, and that's why I'd be inclined to pass straight by next time.  On a positive note, the service was nice and chirpy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8rI2CoS4ltQePbZceSOgow"
  },
  "3Mtq82TzukcIAAsXoiCIuA": {
    "date": "3/27/2017",
    "text": "Still think it's ridiculous that that charge for tap water but oh well, the food was pretty good my friends and i got some sushi and ramen good mix of food and decently priced. Love sushi trains!",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4a7y9WOKYJmx5Hk_aUhmgg"
  },
  "rlJKnrVPTCWJXQ5FY9TxsQ": {
    "date": "9/4/2015",
    "text": "This is probably the worst Yo Sushi concession I've ever been in (twice), and I ate in loads of them when I lived in London.  The reason there's two stars rather than one is a) the view over Princes Street to the Castle, and b) Yo Sushi's food is generally excellent.  The poor dining experience is a combination of the bizarrely early closing times, ridiculous queue management and very dodgy cleanliness levels. I've witnessed people putting empty plates back on the conveyor (not cool guys), and watching them whizz past staff once, twice, three times...  I'll be sticking to Yo Sushi in Harvey Nichols for my Edinburgh conveyor fish fix.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "prZz2ZcVhJZZgswQaT8iuw"
  },
  "KuzlOVOe665mzO_4GIP2vA": {
    "date": "6/18/2015",
    "text": "The worst Japanese cuisine experience I've ever had...I hate to say this, but frankly I won't recommend this to my friends.  First of all it's not authentic Japanese food. Although I'd admit that it's the first time for me to eat sashimi here in Edinburgh, and it was all right, other Japanese food is not satisfactory at all. My friend ordered a seafood soup, which in our opinion, was just different kinds of precious fish (salmon, tuna, etc...) in spicy hot water. It's a waste of food!!!  Further, most of the cuisine there are all in small portion while quite expensive. Not worth the money at all.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "UqrBc-0rQViX_RW7dinkMg"
  },
  "Kp0kRWI7Ig8oszH1QZncYA": {
    "date": "12/8/2014",
    "text": "I really wanted to give this place 4 stars but just couldn't, we'll get to that later. Starting from the beginning, this was my first time visiting Yo Sushi. I had heard about the conveyer belt and thought it would be a fun place to take my daughter for our lunch. We were sat in a corner booth with views of the Wallace monument and all the Christmas attractions and on our other side, the Edinburgh castle. Really really great location with stunning views. Great big star for views.   I started off with the bottomless miso soup, yes indeed, they offer unlimited refills of their very lovely miso. This earns them another star right off the bat. My daughter loves Japanese food and the waiters were all very sweet and playful with her, which was super nice of them.   The food was good, we happened to go there on a Monday which has a special \"blue Monday\" deal. This means that certain plates are 2.50. It was really easy to order off of the blue Monday menu as it had a really large variety of plates. The gyozas were really tasty and crispy, the tempura was okay, a bit sparse but this is the first place that I have seen have avocado tempura here in Edinburgh which was really lovely. My daughter literally inhaled her chicken katsu and the  noodle dish I had was delicious. All the food was well prepared and very tasty, my only gripe would be the portions, they are tiny!  But still, big shiny star for really tasty fare.  Ok, so now onto why I gave this place 3 and not 4 stars, the music. The music was way too loud!! I don't mind music and I don't mind any genre  but if you blast music really loudly, it will turn off your guests, unless they are wasted or getting there. Honestly I left with a bit of a headache and the loudness of the music distressed my daughter a bit at first.  If they turned down the music a few notches the whole experience would be way better. Just shows how important music/ambience is to eating.    So there you have it. Dependable quality food, small portions a bottomless miso but really freaking loud music.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 4
    },
    "photos": [],
    "user_id": "F0nFAY1Qi_7it_Q52n3nTw"
  },
  "dOWbPz4etMTIxtbATcz53w": {
    "date": "8/23/2015",
    "text": "You know what you're getting with Yo Sushi, and really, you go for the fun experience of grabbing dishes from the conveyor belt and then trying to identify them!   At peak times there can be a bit of a queue, but once you're in and seated then the format means you can eat quickly, so it's a great place to pop in for dinner or lunch if you're pushed for time.  What makes this Yo Sushi stand out though is the view. If you go as a two then you can sit at the window, giving you a stunning view of Edinburgh Castle as you eat.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "brpOnxaRsg56LK7OverL0A"
  },
  "oNGylNftg3a99jaq7_qHkQ": {
    "date": "12/2/2014",
    "text": "Four friends and I came along to the VIP preview tasting meal this evening. We were each allowed unlimited green tea and miso soup, in addition to any four dishes from the menu. Only one of our ordered dishes could be hot but we were able to take anything from the conveyor belt.  Yo sushi is part of a national chain, but this particular location is really fantastic in that it offers a beautiful view onto Princes street gardens and Edinburgh castle. The seating, as in all Yo Sushi restaurants, is a little cramped and finding a place to put your bags/coats is kind of awkward. That said, this restaurant is more spacious than many other branches.  Despite being busy on opening night the staff were very professional and approachable. I ordered the tofu katsu curry, a dish I know from other yo sushi restaurants. I took the aubergine salad, the Kaiso salad and the strawberry cheesecake mochi from the conveyor belt.   The refillable green tea and miso soup is a quite convenient idea. Had we not had so much too eat I would have surely refilled my miso soup several times. It took a while to receive my tofu katsu curry and it wasn't really up to the same standard as I have had it in other Yo Sushi locations. There was not enough sauce and one of the chefs happily added more for me when I requested it, but it was somehow more watery than it should have been. The panko breadcrumbs were faultless. Perhaps this dish could have done with less rice and more tofu? The aubergine dish was a highlight, the sweet miso sauce was delicious and the aubergine itself melt-in-the-mouth. The kaiso salad was less adventurous, an easy-to-assemble dish combining edamame beans, wakame seaweed, carrot and a sweet miso dressing. It was nonetheless very enjoyable. Another star of the meal, as I agreed with a friend who took the same, was the strawberry cheesecake. The texture and appearance was rather odd, but imagine sweet rice balls with a warm cheesecake filling... Okay, no description can give this pudding justice, just try it. Or maybe don't, at 4.30 the price tag is a little exaggerated.   Overall my friends seemed happy with their choices. The pumpkin korroke (fried breadcrumb encrusted pumpkin) seemed a popular choice whilst the katsu dishes seem to need a little work.  I would definitely come back here to make use of the Blue Monday deal whilst gazing out at the castle.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "FnhEfctdZjFKux3TGlGwUw",
        "caption": "Photo of Yo! Sushi - Edinburgh, United Kingdom. Restaurant interior",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FnhEfctdZjFKux3TGlGwUw/o.jpg"
      },
      {
        "img_id": "X3VCWHBQunUt66TCYL_ULg",
        "caption": "Photo of Yo! Sushi - Edinburgh, United Kingdom. Tofu katsu curry",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/X3VCWHBQunUt66TCYL_ULg/o.jpg"
      },
      {
        "img_id": "eqzajF2wjoztXcvz7jGrnw",
        "caption": "Photo of Yo! Sushi - Edinburgh, United Kingdom. Kaiso salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eqzajF2wjoztXcvz7jGrnw/o.jpg"
      }
    ],
    "user_id": "HvQ576LJm6i6QZuTwl7WVg"
  }
}