{
  "SdTrkOgq6smssCUL37BMfQ": {
    "date": "2/12/2009",
    "text": "This was actually where I got my first meal after arriving in Edinburgh - it was the first place (besides McDonald's ugh) that I found to be open. They also deliver for quite reasonable prices.   Food was really good and they will grill right before you and adjust the food to your liking - instead of one generic one meal serves all sort of approach that some places seem to take. Prices are fairly average for the city of Edinburgh - although I haven't had one yet, the pizzas looked pretty cheap for how good they looked.   Would definately advise stopping by this Kebab shop if you're in the area - however beware that there's virtually nowhere to eat inside so best to plan on takeout.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yoUk3LhiE-isbRh6OMAPLw"
  },
  "GGxg4WMDGO4T9IZ8kysNRA": {
    "date": "4/18/2010",
    "text": "For my first experience of a kebab, I was suitably impressed. And I wasn't even drunk! This takeaway just looks like your average takeaway, and even has a fruit machine. That makes me chuckle.  After never having a kebab we went here one Saturday night because it always smells so good when you walk past. We both had the special which was about 8 each. Quite expensive! But it turned out to be on of those silver dishes with pita bread filled with every type of meat imaginable. Chicken, lamb, beef and that weird stuff they shave. I'm not sure what meat that is? With lashings of sauce and salad, it was a huge meal. Neither of us finished it but it was pretty damn good.  The meat was tasty and tender, not the chewy, tasteless crap I was expecting.   The menu also offers pizzas and chips too, and it seems quite popular as there was a constant stream of people going in and out while we waited. I would think the True test of a kebab is if it is edible when sober. Therefore, this place passes with flying colours.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oKdygoDX5CfDJeXzv_EVaw"
  },
  "8ZbHH_EO-wsn89SjasyrAg": {
    "date": "4/26/2008",
    "text": "This side of Edinburgh this has to be the best all round kebab shop. Although the place is small its always spotless and the staff are polite and friendly. They had a fire about a year ago but it still hasnt stopped them from making quality food",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nZ0q9O_u07tQ6vdVvSqRsQ"
  },
  "n0PQvl5TFC3RgjsWMPAN5A": {
    "date": "9/19/2010",
    "text": "Super pizzas and kebabs, very nice place, fast delivery and quality grub",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K765Q_R9MNjXTKNwzIgiOQ"
  }
}