{
  "WoCMHxdBorLqq7JN-AClWw": {
    "date": "7/8/2010",
    "text": "I've been to Lagermans for lunch after lectures in George Square plenty of times and it always offers a tasty lunch at a reasonable price.  It feels like a delicatessen inside with plenty of continetal breads, fillings and some inspiring decor.  The staff are welcoming, friendly and know about all of the good foor which they sell.   My personal favourite is a turkey panini with loads of salad and salad cream - tastes amazing.  Further, it's all served in generous portions with plenty of exactly what you ask for.  You can get a delicious sandwich with a drink for just 3 which is a decent deal.  Lagermans is ideal for a cheap, filling and tasty lunch if your in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9UGPPlturxYr07A_spbrug",
        "caption": "Photo of Lagermans Takeaway Sandwich Bar - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9UGPPlturxYr07A_spbrug/o.jpg"
      }
    ],
    "user_id": "yfXqZkU5iXE07GSHzdsQBA"
  },
  "6D1Fj86DFUT2hqVuTaOCTw": {
    "date": "3/27/2009",
    "text": "I loved this shop so much when I was studying abroad in Edinburgh that when I saw that Yelp was in the UK, I immediately looked up this place to review it.   A million wonderful things to say: - Just about the only place to get American-style (not Canadian-style) bacon in Edinburgh - My introduction to fresh mozz cheese--OMG so good when paninied! - Friendly staff--a must when you're studying abroad so far from home!  Drool--just thinking about a chicken-bacon-mozzarella panini with tomatoes, lettuce, cucumbers and pepper from this place is making me miss Edinburgh. A lot.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "J9Ka0DGmqitPjPLptcEk7w"
  },
  "F7zyMNOMKyeLYIJ8m6D13w": {
    "date": "12/9/2009",
    "text": "Best place around Ed Uni's central campus for a quick bite and some friendly banter. Always have a great selection of fresh continental breads/rolls, generous fillings at an excellent price. The main attraction are the fantastic soups (best in the city!), made daily by owner Rob.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_aTB-LS7NqzRTljtJjlpew"
  }
}