{
  "PNSbeag3onYoaKVQXggcQA": {
    "date": "9/12/2017",
    "text": "Perhaps if I actually spoke French I would have enough superlatives to describe this place. By getting off one bus stop early I get to stop at this local bakery and walk home with some of the most delicious warm treats I've ever had. After more than 20 visits, here are some favorites:  Sourdough: I know, there are multiple kinds of sourdough. Try them all.   Chocolate croissants: I have spent two weeks in my life in France and I have eaten 2 croissants a day every time I've been there. These croissants are just as good- flaky, chocolatey, and filled with buttery flavor.   Almond croissant: I don't know what these magical things are. Creamy? Soft on the inside with a flaky outside? Hints of almond but something else sweeter? Whatever witchcraft it takes to make these, I support it.   Chocolate rolls: We mostly love this for the aesthetic, and the spiky tops have been a hit with all our family members.   Country loaf: Our go-to bread when we just need a little splurge. Offers a refreshing upgrade from our standard budget sandwich bread at the local Tesco.   Whether you stop in for a quick cup of tea and a pastry or make this a regular place, Wee Boulangerie is sure to greet you with a smile and something delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MWkLDZ07W3jIsK-lyQeiGw",
        "caption": "Photo of The Wee Boulangerie - Edinburgh, Midlothian, United Kingdom. Country loaf and a chocolate croissant (ignore my homemade shortbread in the corner, which did not compare with these treats).",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MWkLDZ07W3jIsK-lyQeiGw/o.jpg"
      }
    ],
    "user_id": "V71CNhx2lAIEop3lboSBHA"
  },
  "lVEH7aJUZp8fZ6mpLaPYfA": {
    "date": "10/26/2015",
    "text": "Popped in for their dessert but got pastries instead after seeing the reviews raving about the shop's authenticity. I was still hesitant to try their croissant for fear of disappointment (croissants just aren't the same after experiencing the ones in Paris). Friend got pain au chocolat and I got chocolate filled brioche. Friend's pain au chocolat was enough to convince me to come back and try their croissant. The pastries were indeed amazing! They both had the perfect level of flakiness and chewiness. Indeed the best French bakery I have tried outside of Paris!   The cashier was also super friendly and knowledgable and didn't mind us sitting in to do some readings. There were just 3 tables so the sitting area is quite small but lovely still.  One star taken off because the coffee was meh. But we're definitely coming back for the pastries!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "De97W4qM6efPh8OV0o41Rw",
        "caption": "Photo of The Wee Boulangerie - Edinburgh, Midlothian, United Kingdom. Wee afternoon coffee with pain au chocolat et brioche",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/De97W4qM6efPh8OV0o41Rw/o.jpg"
      }
    ],
    "user_id": "zUuqiib4c1gtftJs4MWjvw"
  },
  "n__VOTp-_xSeEvWe7f30vA": {
    "date": "9/25/2016",
    "text": "I was super excited to try this teeny-weeny bakery after reading all the amazing reviews.However, I was a bit underwhelmed -- I came in for their famous almond croissant and  some coffee. Now , the almond croissant was unlike any croissant I had ever tasted -- it had the texture of a madeleine  (soft, cakey) and some outer flakiness associated with a croissant. I found the filling was very good but wanted there to be a bit more in the croissant. The outer crust was delicious! I really did like the texture and flavors of the croissant but it was nothing extraordinary. My low rating is mostly due to the TRAGIC latte I received. It was literally watered down coffee with milk. No froth. no strong espresso. Just really sad, and too overpriced for the quality!   I would recommend trying the pastries for sure, and stopping by for the cuteness of the cafe, but the coffee is disappointing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fE7UsxL-lNBo3YMP3n4Umg",
        "caption": "Photo of The Wee Boulangerie - Edinburgh, Midlothian, United Kingdom. Almond Croissant // Bad latte",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fE7UsxL-lNBo3YMP3n4Umg/o.jpg"
      }
    ],
    "user_id": "eQw2VBQX0P71q_DLKMegaA"
  },
  "Wi_M6gMPTDE-vvuwC7Xw6A": {
    "date": "1/21/2016",
    "text": "This bakery has been on my 'to do' list for ages - but I'm rarely in that part of town and I have been cutting back on bread - and by that I mean - I've traded quantity for quality.  I won't eat much, but when I do - it has to be good!    I was making my famous seafood chowder for Christmas Eve and I needed a good quality bread to serve with it.  As I don't buy bread often, I wasn't sure where to go for something really good.  I did a bit of yelp research and tried to find a place that fit with our crazy schedule for the day, some place we could park the car.  We got to our first choice and.... SOLD OUT!  Back to phone for more research - this time I noticed a friend had checked into The Wee Boulangerie on facebook - I quickly messaged her \" do they have any bread left\". \"yes - but come quick!\".  So we did.  Parking on a week day is not easy so we had to cheat.  The hubby parked on a side street and stayed in the car while I ran like a woman possessed to the Wee Boulangerie.  Phew - there was bread!  I even had a choice but bypassed the whites for the slightly healthier multigrain sourdough; paid and dashed back to the car.   We instantly opened the bag and poked our noses in - smells great;  *tap, tap*.  Sounds crusty and light!    I didn't have time to check out the other baked goods on offer - but can confirm that yes, it is 'WEE'.  A couple places to sit but mostly good for taking away.  They post pics on facebook of great looking savoury, lunch type breads, so if you're in the area - definitly worth a try.    And how was our bread?  Tasted as good as it looked and smelled!  Crusty on the outside, deep sourdough flavour,  light and airy inside with little nooks and crannies, perfect for soaking up soup.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "ptj5uhi0bNaUotgEmaRzrA"
  },
  "F2aMtTZxqBset7hphig9zA": {
    "date": "8/10/2014",
    "text": "Amazing artisan baguettes, crispy, chewy crust, soft inside. Skip Natural Foods inc nearby and Peckams, the bread at this shop is fresh, and often warm. There's a couple of tables so you can sit in and have your bread served with butter and jam along with coffee. About to try sourdough, but so hard to choose, everything looks and smells delicious. The bread is so good you could have it alone for a meal with or without condiments. The white bloomers are the best value at 1.90 a loaf and are way better than what you would get elsewhere. I have since learned that the loyalty cards is if you spend over 5.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "giwoTn-tA8QAyA2PnRiTvg",
        "caption": "Photo of The Wee Boulangerie - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/giwoTn-tA8QAyA2PnRiTvg/o.jpg"
      }
    ],
    "user_id": "xan14G_7IU66GtQPAA2cKw"
  },
  "Kh28_mR6ev1WZgGZpls9Pw": {
    "date": "2/21/2015",
    "text": "Best bakery ever!!! One of my favourite bakery in Edinburgh so far. After Peckham was closed, I was always trying to find a good bakery near Newington. One day I didn't had my breakfast and I spotted this small bakery and luckily I walked in and bought a brioche. OH MY GOD. That was so delicious. After that I bought brioche once in tesco, and I decided not to buy bread in supermarket anymore haha. Also, I worked for an NGO in Shanghai before. They will send their graduate to EFBPA in France to learn French bakery. Surprisingly, after looking at Wee Boulangeris's website, I found that one of their bakers graduated from there. I know that EFBPA is a professional Frency bakery school, so I completely trust and believe why the bread tastes so good in Wee Boulangerie. And the bread there is very fresh as well. They even have a timetable for every kind of bread!!! Amazing!!!  I would highly recommend this bakery to all of my friends.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "UqrBc-0rQViX_RW7dinkMg"
  },
  "QCrHlgDJk3ZtkqBxnBY6uA": {
    "date": "9/17/2012",
    "text": "The Wee Boulangerie is cutely and aptly named - small and perfectly formed.   Katia's breads are just gorgeous - the country style loaf had a deliciously light sourdough flavour, and the raisin bread is seriously amazing. Katia recommends the raisin with a strong, sharp Cheddar - and what a perfect match that would be. I had it plain with salted butter and it is fabulously moist, with beautiful fragrance and flavour. Loads of raisins. Utterly gorgeous.   We also sampled an artichoke and anchovy fougasse, and a chorizo and cheese fougasse - the strong flavours of the filling matched the Provence-style bread perfectly.  I also tried a blueberry tart - so many blueberries, and what IS it about French baking that lends itself to those effortlessly delicious not-too-sweet tartlets? This is beautiful baking!  The Wee Boulangerie is a fabulous new business and I wish them every success.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "wsdArZfswIeFCqbXWRcorQ"
  },
  "7B79Na3C43QtJeuMRMK64Q": {
    "date": "12/28/2012",
    "text": "The Wee Boulangerie is a little gem in Newington.  Lovely bread, lovely fougasses, croissants and almond croissants that I totally must try!  I believe they sell soup too, although I don't tend to be in that part of town around lunch time.  Highly recommended and worth a stop if you are in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "V5U4-iDA2FeO2AlkUrATsg"
  },
  "NiT1SyUUD6s-k4IJn4qTQQ": {
    "date": "1/27/2013",
    "text": "Just passed this place and my wife was going all gooey. So we went in and I was very pleased. I don't generally review bakeries - I buy bread - but here they were so helpful and willing to get  you the bread you deserve. She explained all about the baking process, for example that rye bread is only made late in the week. She also explained every day they taste their latest batch. Their sour dough is really nice and bouncy! - Gosh look at me getting lyrical about bread, but it has to said - they are pretty good as far as bakeries go!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "7SJZSjfTSmULJk_DRWUKtw",
        "caption": "Photo of The Wee Boulangerie - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7SJZSjfTSmULJk_DRWUKtw/o.jpg"
      }
    ],
    "user_id": "fKi8ZF3xpJJkgSusRubeMA"
  },
  "FgkxeAC7vpApMIcjkQQANQ": {
    "date": "2/8/2013",
    "text": "I'm always on the look out for new continental bakeries; as a modern european languages student, I need to act the part! This place is extremely authentic in terms of simple, quality French bread and pastries. The smell that greeted me as I entered the building was absolutely incredible, the staff were friendly, and I knew I had to order something quickly!  Though the bread looked amazing, I ended up getting an almond croissant and a cappuccino. The croissant was fantastic, and the filling tasted homemade, unlike those processed fillings found so often in supermarkets.  The only downside to this place is the size: it's really tiny! There are two tables, and I would kind of feel awkward about staying too long and hogging them. That's a shame, because I love buying a coffee and then hanging out to read or study in a place for hours. For this reason, maybe this would be a better place to take away.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HvQ576LJm6i6QZuTwl7WVg"
  },
  "kyrkc8RbH-zU7KHmoqoH-Q": {
    "date": "11/20/2013",
    "text": "I had the most delicious baguette yesterday, Devoured within half an hour of getting home.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "frzPgDUNAU4nuw19I8--QA"
  },
  "SoijqwJ6fhgdqOrEts9xRA": {
    "date": "9/2/2013",
    "text": "This was one of those times where I walked out, defiantly, thinking I WILL NOT BE JUDGED. Yet later on, when the SR asked me, where was mine? I had to hang my head in shame. For I, yer honour, I did walk past, and it was like a magnet pulling me in, for I did indeed see me some delightful looking almond croissants.   Let me take you back to a time when once I feasted on almond croissants, in the balmy summer of the South of France. I've never tasted anything like those croissants in all my days since I left that town, not that I have ever stopped trying. Every one I have tried has paled in comparison, dry, dusty, overly sweet, not butterly melt in the almondy mouth. I'm not going to lie - The Wee Boulangerie didn't succeed either, but it gave it a damn good try. Where most almond croissants are almond paste basted in the heart of a pastry fold, and carry the body of a normal looking croissant, The Wee Boulangerie was like a Picasso impression, with crispy almond sponge oozing out everywhere. It didn't even really look like a croissant. But it tasted light, not dry, not too sweet, and the crispy light edges made a delightful contrast to the heaviness of the croissant itself. I enjoyed every, single, mouthful.   A note as well - I'm on a diet. Almond croissants are pretty much verboten. The SR is on a diet. He is sick with jealousy at my hedonism... I'm going to have to get more to appease him. Thanks The Wee Boulangerie, you destroyed my diet, but in oh so such a beautiful way....",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "X2uF3C3YBD24xcgKA104Sw"
  },
  "1dyR_JWAt7TWTbKsuTYK2g": {
    "date": "2/23/2014",
    "text": "This French bakery has delicious croissants (chocolate, plain, almond) and generally really high standard baking. Glad to see a proper French bakery in Edinburgh / Newington! Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "UJ_gb0uPXkqZtXbd8AQu9Q"
  },
  "GrW2QhSVngQMUDbkB59Teg": {
    "date": "2/2/2013",
    "text": "what a lovely little place!!  after reading a review on yelp i was desperate to pop by.  however, being in newington this wasn't exactly a place i could just pop by, so happy chance saw me partaking in a run at the meadows this morning allowing me to stop here on my way home.  this place is small, really just a takeaway but they have loads on offer!  lots of bread, assorted pastries, coffees, teas, and soup from union of genius.  i had come in mind with one thing though, to get a fougasse.  i opted for the goats cheese and red pepper option and then indulged my sweet side by getting some macaroons.  i waited approximately two seconds after i sat down on the bus to try one of the macaroons.  it was like heaven in my mouth!!  sweet and just that slight crunch with the perfect chewy texture all at the same time.  the macaroon was divine and i'm now going to have to stop myself from eating the remaining five i bought before the end of today.  i had a bit more patience for the fougasse and waited til i got home.  i heated it up for a few seconds in the microwave since it had cooled during my bus ride home.  after it's quick warming up i took a massive bit of bready, cheesy, peppery goodness!  mmmmmmm!!  it was so delicious and a lovely lunch after a morning run!  my only tiny complaint is that there was a lot of bread and i could have done with just a bit more peppers and cheese in the filling.  but it was seriously yummy and just hit the spot.  i'll be back here, especially after i finish off the macaroons!  the food was lovely and the staff were so friendly as well.  it did feel a wee bit pricey, but since my food was so good i'm happy to pay the extra cost.  definitely looking forward to what delights will be on offer next time :)",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z_xbO-Iaxbx-ZRPhLJK-Ew"
  },
  "ifEMR_Y8wwu5KFTAkj6W_Q": {
    "date": "1/26/2014",
    "text": "The BEST bread, especially the sour dough in Edinburgh. The rest of their treats are fabulous also. Coffee is also nice.   You can sit in for coffee and a cake, before going home with the other items you purchased! Super!   Owner and staff are also welcoming, friendly and professional! Great service, too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DU_DRHEb27CF6OGEdl8S0g"
  }
}