{
  "TmfMx0XN4zT83ufGnQC3VA": {
    "date": "3/6/2016",
    "text": "I really enjoyed the food at 1505, nice selection and it's well made. At 10.20 for a large serving of pie with two sides and a double shot cappuccino I don't think it was overly expensive. I would spend the same in a pub for a drink, fries and burger. Perhaps it's more of a restaurant style cafe rather than a typical cafe and that's reflected in the pricing. The chicken pie was pretty damn good and I couldn't fault the quinoa and salad sides. Perhaps not the place to go to purchase lunch every day, but a nice place to meet friends and eat decent food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "XuPM8tcbbFtOz3chZtAMXQ",
        "caption": "Photo of Cafe 1505 - Edinburgh, United Kingdom. Chicken and leek pie",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XuPM8tcbbFtOz3chZtAMXQ/o.jpg"
      }
    ],
    "user_id": "xan14G_7IU66GtQPAA2cKw"
  },
  "98n4uHQFHLyETKJC4RHVmQ": {
    "date": "10/17/2015",
    "text": "A great little cafe in the centre of the University area. I had a hot chocolate, and my girlfriend had coffee and cake. The hot chocolate was just fine, but the coffee and victoria sponge were tremendous, really top class. The place extends quite a bit from the street, so there are quite a lot of seats available. And although we were only there for some cake, there is also an excellent variety of soups, sandwiches, and main courses. Well worth a stop. :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "y0su6UnfPPAt-urZDsw-1w",
        "caption": "Photo of Cafe 1505 - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/y0su6UnfPPAt-urZDsw-1w/o.jpg"
      },
      {
        "img_id": "ya_CiC1t_HVH8D0mmLEYIA",
        "caption": "Photo of Cafe 1505 - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ya_CiC1t_HVH8D0mmLEYIA/o.jpg"
      }
    ],
    "user_id": "RMOJLdLHdFai_ksWCMDOoA"
  },
  "PZmba2we4LwS5K74RdN3Gw": {
    "date": "1/11/2016",
    "text": "Cafe 1505 offers freshly made soups, salads, sandwiches and generally a few things like frittata's or curry or some sort of more hearty dish. They also offer coffee and a selection of pastries, although I have yet to try the coffee it is fair trade. I generally go for soups, as with winter, there isn't much around the area that offer good soup. I have never been disappointed with what they have, particularly enjoying the spicy sweet potato and even better, the French onion! The service is quick and although it is slightly more expensive compared to some cafes with similar food, but I've always had a nice lunch when going there. They have lots of seating, but it does cut the cost to take away!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "dPA1RBX8-pF54IQGvwpyRA"
  },
  "LKMlvdkfOqgUl2-qhtjyAQ": {
    "date": "11/27/2015",
    "text": "I like the interior of this cafe a lot, nice decor, not overdone. I went for a latte and a slice of the Victoria sponge, both excellent - the cakes all looked very appealing, actually, and I'd like to return in particular to try some of the sandwiches. Lots of seating too :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "R6VzpLz-WdXhN7fUOSxHsg"
  },
  "DCyOs5TV20-gw3l8gYU79g": {
    "date": "8/28/2015",
    "text": "Buyer Beware:  Cafe 1505 charges a 3.5% added commission for non- credit card currency conversions on top of whatever charge your credit card may take. Rip off for \"meh\" food.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gY34XSVZMmCbsYGZvKJCEw"
  }
}