{
  "zp0Mi5mnM6JQoObW3NmltQ": {
    "date": "7/27/2010",
    "text": "If you enjoy Mexican food, you will love Plaza Garibaldi's!   Situated on Hanover Street, Plaza Garibaldi's is right in the centre of the New Town area of Edinburgh, and is just around the corner from the main shopping street, Princes Street, and so it is a convenient place to reach.  It would be so easy to walk straight past this restaurant as it is absolutely tiny from the outside, but it produces the biggest flavours in its meals inside. Plaza Garibaldi's offers a wide range of authentic Mexican dishes including tacos, enchiladas, nachos and dips. I have been here several times for my dinner and I absolutely love their sizzling chicken fajita - just thinking about them is making my mouth water! The chicken is always perfectly cooked and full of flavour and there is platy of guacamole, sour cream and cheese to go with it - they are so yummy! All of their dishes are cooked with really fresh ingredients and they are all full of flavour and pretty spicy. Plaza Garibaldi's make their own corn tortillas which are amazing with the salsa.   The staff in this restaurant are always incredibly warm and welcoming and are very attentive to the customers. The prices are super reasonable here too, with most main dishes costing under ten pounds. A truly great Mexican restaurant which is definitely worth a visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Y4ApAwOG9fTBPOBo-QVJ5g",
        "caption": "Photo of Garibaldi's - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Y4ApAwOG9fTBPOBo-QVJ5g/o.jpg"
      }
    ],
    "user_id": "OdUSlS-S6qfZFnDUCKzwEg"
  },
  "sdqIp6vzKc58Nx1P4uOtBg": {
    "date": "5/20/2014",
    "text": "The bouncer here when I came to the club at night was probably the coolest and friendliest bouuncer I've ever encountered. The music is cheesy and they have a pole in the middle of the dancefloor but if you fancy a fun time, come here!",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Hzt2Rv6SHaZZEb-4peqEPg"
  },
  "QEQPEDm-4C8ZszyZRIHFjA": {
    "date": "3/29/2011",
    "text": "Again a restaurant I would never ever think of eating in but as a place to let loose its rather famous!  Key point to be aware   - the only measures they have are double - their mojitos have three shots of rum (dark, gold, white) - a jacket left lying around will grow feet and walk away  The music is awesome for letting go of a Friday and welcoming the weekend. The pole at the back of the dance floor is something to be visited for sure for amusement!  Be ware of the bouncers..... they arent that bright and can be heavy handed!  Good times!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "rl4hqDnywPJDCK4wfbXMzg"
  },
  "AVtrH0ZbZWGZBP9Og7XafA": {
    "date": "5/22/2010",
    "text": "This place has to be amongst my favourites in Edinburgh, purely because it's just so random!! It's a ski bar, essentially. It's the sort of place I would fully expect to find in a French ski resort, and it has the same atmosphere - fun!! The wooden interior and ski memrobellia make it one of the cooler places to be in Edinburgh.  The best thing is it has amazing cocktails .... Who knew! The raspberry mojoto in particular is a killer. I don't think they measure their alcohol legally, they are so so strong.  They have quite a small dancefloor too, so you can boogie on down till the wee hours. During the festival it's open till 5, like most of the clubs.  My favourite thing about garibaldis is the reaction of my friends when I bring them here. You totally wouldn't expect it to be in Edinburgh!  Although I must admit the entrance fee is a bit hefty - I think it was around 8 each. But of you can look past that then it's billiant!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "o0WGr8L3BWfH2Bslpnqw6g"
  },
  "LaFRRLmZTIFXx1z--64tOA": {
    "date": "5/7/2010",
    "text": "A visit to Garibaldi's club requires you take note of the following points:  1: Its best , on entry, to neck at least 5 tequilas and wash this all down with a Corona or eight.  2: Don't get there too early, you'll begin to notice the place is too bright and a bit tacky.  Taking heed of these points will ensure a fun night of liberally boozy cocktails and sizeable jugs of alcoholic concoctions. When its busy the club is a fun place to be, although its best to avoid the odd bruiser swinging on the dance floor's pole. Cheap entry fees and cheery tunes amass to an average club night. A-OK.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JzSof55MJPIrqp29_coJmQ",
        "caption": "Photo of Garibaldi's - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JzSof55MJPIrqp29_coJmQ/o.jpg"
      }
    ],
    "user_id": "UvIb5v3biEgcxWKnxf0ocg"
  },
  "mSKFqOb8hUNiFwlvdIA2Mg": {
    "date": "4/12/2010",
    "text": "It is a restaurant.. I think? Has anyone been in to eat food? Instead of dancing on the square light-up dancefloor that looks like something out of an 80's film. Let's face it, we go here because it's the hottest place in Scotland, it's got it's own law when it comes to closing times and bucket-esque booze measurements.. You only go in when you're too drunk to go in anywhere else. That's why we love it...  Sort of love it, hate it... I hate it, no I love it, no...",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rJi2YPK6uj4FtE8R7OFQcA"
  },
  "Wgh_28Uh4aok5xy5_2AtxQ": {
    "date": "11/7/2007",
    "text": "My memories of Garibaldi's seem to swish into a blur, as I have always been pretty intoxicated by closing time. That could be the fault of the flirty bartenders who like to give us free shotshmm   The beauty of Garibaldi's can be easily summed upbig servings of mock-Mexican food and, after hours, LOTS of drunk people dancing like mad. The DJ takes requests, but wear tons of deodorant (and wash behind your ears) as the dance floor gets PACKED and there is little ventilation. This is a GREAT place to go for munchie-type food (go for the fajitas or the nachos, if you know what's good for you) and then indulging in rounds of tequila shots, and then making a spectacle of yourself on the dance floor. Just say, 'Hey, Paco, that's how I roll.'",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SrUdc2DcFphyqk4X5CKbLA"
  },
  "g1tPhTPyHzsVGeOZZuTsyQ": {
    "date": "11/14/2007",
    "text": "In Garibaldi you can have a nice dinner and then dance with your friends. Really nice, worm and friendly place to have a complete evening. I suggest this place to have birthday party, etc.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iZE1J4HZ7CQdiL76w6vsJw"
  },
  "4OR-UM5QXhgXASj7yur95g": {
    "date": "2/22/2010",
    "text": "A fun restaurant/bar on Hanover street. The food here is great, mostly Mexican with food such as Fajitas, Nachos, Tacos and Enchiladas, but does have some other food too. The food is quite an average price for an Edinburgh restaurant and costs around 10 for a main course and the food is yummy!   In the late evening it is mostly known as being a great cocktail bar. They have so many different cocktails to choose from and have deals on if you buy more than one. The lighting is quite dark in here and there is a dance floor with a dance pole if you're feeling confident! This bar never seems to be overly busy, and you won't have to wait long to get served. The staff are very friendly and do tend to flirt! A fun bar to go for some girly cocktails and a good night out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8kWbwEqdgDjSogg56e6PnA"
  },
  "rlkKf122MhH6KNjrYZrRGA": {
    "date": "11/1/2007",
    "text": "A lovely, small bar/nightclub just a few steps from george street. I used to go to Garibaldi's when queue's were too long for places on George Street but now i go there instead of places on George Street. Its really friendly with good music for a boogie. The drinks are well priced and the food is great. Its full of sombero's and tequilla, that combination usually means a good night out!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "juIwKQV2Hg0pzyqyWpIAKQ"
  },
  "Uj5UylamU3xgP1_k8TjdiA": {
    "date": "8/29/2008",
    "text": "I've never eaten in Garibaldis so can't comment on that, I've only ever been in at night when the place is extremely, extremely, extremely busy! Be warned - this plays get packed! Having said that, it is a fun place to grab a few coronas and boogie with friends, and there is a pole on the dance floor for all those who are adventurous enough to try a bit of pole dancing!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0rMkjnsRm82lOhyQH_3enQ"
  },
  "U5K-9hTOfs0258r0P8whDA": {
    "date": "6/9/2010",
    "text": "I can't recommend this restaurant/bar highly enough. I myself am from a Mexican background and have sampled all of the other mexican restaurants in town. Garibaldi's is without a doubt one of only 2 mexican restaurants (Viva Mexico being the other) that I would recommend personally. If it is no-nonsense authentic tasting mexican food&drinks that you're after then this is THE best place to come. Friendly service, delicious food (ok so the menu isn't that extensive but it's quality over quantity) and some generous measures of alcohol in your cocktails. Do yourself a favour and if you want to enjoy a genuine taste of mexico then get yourself down there!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WglkuNhuVz9aiapDpMVzvQ"
  },
  "9Hiu6zwoKGaMEHkzNII2ig": {
    "date": "12/9/2008",
    "text": "one of the best bartenders in the UK  u will find him in garis,   and he is mexican so   have a look",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uYU-SwmT0TkwwIYDzgPMJQ"
  }
}