{
  "jupUtGw9dWBLOfZ6rHMKvg": {
    "date": "4/18/2017",
    "text": "Great food, great ambient. They accommodated my vegan diet chancing a couple of ingredients in the main dish Curry. Espresso was great too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uj87Yftxvd3Jq0TJShunwA"
  },
  "2VO7JV40JbXM3fbVbDT5hw": {
    "date": "8/5/2012",
    "text": "This location of Howie's lies just at the base of Carlton Hill in an old restored building.  We went with a larger sized group for dinner and they did a nice job of accommodating us although the service was pretty slow due to the fact that they had a number of large groups in there at the same time.  There had to be about 60 children at two long tables (looked like a mess hall) while we were there and the noise was unbelievable.  But the staff took it all in stride getting us our drinks and our food with smiles on their faces.  I had a simple chicken breast served with potatoes and vegetables and others around me had the bream (a fish).  One in our group ordered a burger and was told it only came \"well done\" due to the kind of meat . . .which left us wondering just what that meant?   For dessert, the banana cream pie was a hit but I kept wondering all night what made this dinner \"Scottish\"??  After all- that is their claim to fame.  Doubt I would head back to this location if I was on my own, but for a large group they did a good job.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZYZNcugF3xUEGyLOVGiZ0Q"
  },
  "Jz2A8OaBpvsy3WKv6xcrPQ": {
    "date": "6/7/2016",
    "text": "Both my husband's and my meal were pretty bland.  I went to salt mine, and salt streamed out of the shaker in huge amounts.  I noticed a woman at a neighboring table having the same problem. The dessert, strawberries with Chantilly cream, came in a little bowl with barely enough cream.  To be fair, the place was lovely, and the noise level wasn't too bad, but I wouldn't recommend it to anyone who wants flavorful food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DKV5SFFLda19uIYjSX1HeA"
  },
  "xIb9cpOmLLvtRXgbcaLi4g": {
    "date": "6/11/2015",
    "text": "Good food, great staff and an unique atmosphere.  We were at the end of a very long vacation and Howie's was just what we needed.  We didn't have a reservation and the staff was very accommodating.  The food was great and we weren't rushed through our meal but they let us take time to just relax and enjoy it.  We ended up eating two meals there.  I had the vegetarian entree - a butternut squash tagine and my husband had a stuffed chicken breast which was incredibly moist and delicious.  And of course the best dessert is the chocolate beetroot torte.  Sounds funny but it is yummy.  On the second visit, I had a unique salad with quinoa and my husband had the lobster.  Both were fantastic and of course the choco. torte again.   And the staff put up with our silly questions about Scotland and Braveheart the movie!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "avjMmywlhVAVH8W5DFuOYA"
  },
  "VXM43AthCyQUujHvEb89Ow": {
    "date": "4/3/2017",
    "text": "Had our first lunch in Scotland today here. Placed was packed but they found a spot for us at front. Service was good and everyone super friendly. FYI, It was tad bit slower then than US though. Menu was great with a ton of options. I had the pea soup which was real tasty. Had a real farm to table feel. Main course was the spinach and cheese ravioli. Very tasty and past was perfectly cooked and stuffed just right. My wife had the vegetable curry dish that was very incredibly full of flavor. Overall we were very pleased with the food and the price was spot on",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nnWya27aC_3_HqEJ0MwkRQ"
  },
  "54CE_zIBVC3kggiuQRV1-A": {
    "date": "8/16/2013",
    "text": "Overall:  A solid 4.  Good, well prepared food with some subtle flavors, though one dish could have been better seasoned.  Very good service.  (Caveat:  We only had starters, a drink, and dessert--no main dishes.)  We'd return.  Service (4.5):  Very nice staff; attentive without hovering.  Liked having a single waitress rather than a medley of servers.  Would have preferred for her to come by the table once or twice during the meal to see if everything was fine or if we needed anything, but her suggestions were good, the orders correct, and her attitude great overall.  Food (4):  Well prepared & well plated.  The cullen skink soup was excellent, with a subtle smoke flavor.  However, one of our dishes--the haggis, neeps, & tatties starter (very good with ginger beer)--did not seem sufficiently seasoned (particularly the vegetables and gravy, which was a little bland).  Ambience (3.5):  Nicely renovated older building with somewhat sparse decor (white walls, contemporary furniture, & a few sets of stag antlers on the walls), which makes me wonder if the place gets a bit loud when slightly busy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2VnVncKBn6KcSB3wRiLR_w",
        "caption": "Photo of Howies - Edinburgh, United Kingdom. Entrance at night",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2VnVncKBn6KcSB3wRiLR_w/o.jpg"
      },
      {
        "img_id": "lfWCpjp-rl5yhxwS4ZD-Xg",
        "caption": "Photo of Howies - Edinburgh, United Kingdom. Organic cheese plate:  brie, blue, &amp;amp; cheddar w/ oat cakes, quince jelly, grapes, &amp;amp; celery (dessert)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lfWCpjp-rl5yhxwS4ZD-Xg/o.jpg"
      },
      {
        "img_id": "AzvSRekOPvNNdg27vxJF6A",
        "caption": "Photo of Howies - Edinburgh, United Kingdom. Cullen skink soup (starter)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AzvSRekOPvNNdg27vxJF6A/o.jpg"
      }
    ],
    "user_id": "OFk-Hl3HEU_aSMV3HlEMeg"
  },
  "aaJ5OxIBoLNSz9No2dEoCA": {
    "date": "8/26/2010",
    "text": "Disappointing compared to its sister restaurants in the city.   The Festival custom may have contributed to the gaps in the wine cellar but to run out of white bread seemed rather lax. The well done steak ordered by one of our party was still noticeably bloody and whilst the wait for that to arrive on the table will have contributed to the other meals' cooling I maintain that my risotto was much less hot than it should have been.   No complaints about the service (indeed my companions were rather demanding at times but this was handled admirably) but I think I'll be sticking to Victoria Street when it comes to suggesting one of the four establishments to patronise.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "txzOZrHK9EVY0kYjSuXkKg"
  },
  "g54bWdBorq0uDlIXWuXVXg": {
    "date": "4/7/2010",
    "text": "Howies is a local chain with a number of restaurants in Edinburgh, it specialises in modern British/Scottish cuisine and proves itself to be popular with both locals and tourists.  This branch on Waterloo Place is my favourite to visit for a boozy lunch. It is situated just beneath Calton Hill, so there's always the option to take a stroll up there if you're not too stuffed afterwards. The restaurant is bright and airy, due to the wonderfully high ceilings and tall windows, which drown the place with light (hence why it's good to visit during the day). The service is always impeccable and the food is of a high standard. I'd recommend that you end your meal with the cheeseboard, you get a great selection of delicious Scottish cheeses and oatcakes - don't be afraid to ask the waitress for a few extra, I always find myself with far too much cheese for too few oatcakes!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uNwUDd3e9b0PXXerPMYcRg",
        "caption": "Photo of Howies - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uNwUDd3e9b0PXXerPMYcRg/o.jpg"
      },
      {
        "img_id": "wScU8bvnMDZYQaH6ZTCbfw",
        "caption": "Photo of Howies - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wScU8bvnMDZYQaH6ZTCbfw/o.jpg"
      }
    ],
    "user_id": "mJJj_SZff6MEWG5Vx1r8Bg"
  },
  "ZnUc1OY7syddLoFxiw8TMA": {
    "date": "10/2/2010",
    "text": "Our last night in town & 11 of us ate here on a Sat. nite - the place was packed to the roof.  So incredibly noisy that it was difficult to talk to one another. Dinner itself was so so. The mackerel starter too salty. Sea bass  drowned in a watery mix of veg. Got the wrong dessert.  Sad we left Edinburgh with literally  a bad taste in our mouths.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "B-s-8VUnuBjGTP3d01jsyw"
  },
  "4Lv4mTMIm59o8Zu5YfIP8g": {
    "date": "6/15/2010",
    "text": "I had been to the other Howies on Victoria Street and was quite looking forward to trying out this one. It's located just underneath Carlton hill, inside a beautiful old building.   Despite the great setting the food was a bit of let down. I came here about 3 months ago and ordered the vennison stew with chocolate. Very excited to try this exotic sounding dish we were presented with food, which tasted like it had just been microwaved. Have you ever smelt meat and potatoes that have been microwaved? They have that distinct smell and taste. To add to this, the bread pudding with custard I had, although delicious to start with, was dry in the middle.  The girl serving our table was very friendly, although you could she was new on the job. She couldn't understand the order of wine we wanted and kept getting mixed up. Also it took them ages to come take our order in the first place and there weren't that many other customers.   I know Howies can do a lot better and I hope this was a one-off thing. Their menu is always impressive and I hope I can write a positive update to this review in the near future.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "nhVvcPyRGLw466qHVbUjrA"
  },
  "3uyxl6ADy74DWGZA7cTqJA": {
    "date": "8/16/2015",
    "text": "Excellent food in an beautiful setting.  Yes we tried the haggis and were pleasantly surprised.   Everything we ordered was excellent and reasonably priced.  Highly recommended.  My only minor complaint is that service was on the slow side.  It's a wonderful place to explore modern Scottish cuisine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LqDOi4MZCImSzwYwN7OvdQ"
  },
  "t8uYVd8pt_OIxfy1EDt9lg": {
    "date": "10/19/2015",
    "text": "Great atmosphere. Good food. Love the haggis. Great services. Can't complained about the presentation of the food either. Can't beat the price for the quality of food and atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z5OMah3niRoIS4aBcU5ggA"
  },
  "O4F0B0U35JNYTcrcpQ9P-Q": {
    "date": "6/24/2010",
    "text": "I have to say, despite the grandeur and frills that come with this Howie's restaurant (which I was calling Hovvies for a good year or so) is a bit of a facade for sub standard food. I was quite disappointed with my visit there.  Right beneath beautiful Calton Hill, Howie's is set in an architecturally stunning building, which gives it a really regal air. The place is lovely inside too, with nice large windows and high ceilings, and a lovely mezzanine which makes the place a bit less formal and more relaxed.   I had visited one of the other branches of Howie's a while before, and it was always quite good, but this one was a little disappointing. I had the haggis spring rolls, which were soggy, really off-putting and the haggis had loads of fat in it which was minging to be honest. I moved onto the fishcakes, which were far far better, and actually really tasty and crispy on the outside, fluffy on the inside, with plenty of fish in them. They came with a chutney style sauce, sort of mangoey, which I really didn't like!  I left kind of disheartened, and disappointed with my meal as a whole. I really like this place and I think they might be letting their quality of food slip a bit, but I probably will come back and try again because when it's good, its damn good!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-PNsCalq3mp64clfZxi3mg",
        "caption": "Photo of Howies - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-PNsCalq3mp64clfZxi3mg/o.jpg"
      }
    ],
    "user_id": "Cy1PV2TdYeDFA16mUOlr3Q"
  },
  "EMxf_9sdPk86DHxeL6dKAg": {
    "date": "7/28/2014",
    "text": "Excellent food. Great atmosphere. Best margaritas we had in the UK. I had the sea bass with samphire and my husband had the macaroni and cheese. Both were delicious! Lots of local produce on the menu. Wait staff were very friendly and efficient. Highly recommend - especially if you like history - used to be the old guild meeting place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DV4NcHPPTxHosauOrTIZ-g"
  },
  "udMO5BrZV0FAqdDJqon-Pw": {
    "date": "11/24/2007",
    "text": "Howies restaurant on Waterloo Place is a stylishly decorated establishment, serving a good variety of food. I came here for my 21st birthday dinner, and found that is was very pleasant, if not outstanding.   The menu features a good selection of cuisine, including a large Scottish element to the menu. It is quite pricey, with their wine prices adding to the overall expense quite considerably. Nevertheless, it offers a relaxed environment, friendly service and enjoyable food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8p6SjSOQDDAwSysEDeW4NQ"
  },
  "d7LuSEmvRjA9Jkvikcwf5Q": {
    "date": "7/20/2008",
    "text": "A Scottish restaurant in a very grand setting in the centre of town. The food is lovely, but it can be a little rich at times, and the service can be a little slow. A good place to take someonne you'd like to impress, though, and it's not ridiculously expensive.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EAXWjnCLv5l_rP6sszQNGA"
  },
  "HyrF0qmJLVqclbM40ggYQg": {
    "date": "8/9/2007",
    "text": "Howies is a really nice restaurant. There are a few in Edinburgh but I have only visited this one. It's location is great as it's surrounded by other places to go after your meal. It is sometimes quite expensive but the food is worth the price.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vu2Y7kCTtxhNGmjzWMankw"
  },
  "cAPaEk32HPBWGvQk0Mbzpg": {
    "date": "6/23/2019",
    "text": "Stumbled upon as I went for an evening walk on Carlton Hill.  Great room.  Food is wonderful, service very meh.  I had mussels and a garden salad.  Best house salad I've had in two weeks of being in Edinburgh.    Ordered the Scottish lobster special.  Waitress came back that they were out of it. ( was 8 pm). Besides mussels and salad, ordered the home made focaccia and hummus. Waitress brought me the olive tapenade, not hummus.  Pointed out to her, she said it was hummus.  I thought maybe I was wrong.  Tasted it, was olive tapenade.  Called her over, she took away returning with hummus.  Didn't apologized, oh well  Will go back for the food, not the service. Great prices too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Uoufiq55p1dcvB9ReJ6KbA",
        "caption": "Photo of Howies - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Uoufiq55p1dcvB9ReJ6KbA/o.jpg"
      },
      {
        "img_id": "ep96ZJEf6uTPm_8LXUEj4Q",
        "caption": "Photo of Howies - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ep96ZJEf6uTPm_8LXUEj4Q/o.jpg"
      }
    ],
    "user_id": "rgOS2IlZ37ED2_WHqpdybA"
  },
  "pfinMIuNH6sRj0IY5emp-g": {
    "date": "6/25/2019",
    "text": "We lucked out to get a table here for supper on a Sunday, and service was excellent all through our meal. This place prides itself on utilizing Scottish ingredients and I could taste that difference in quality and freshness. The portions are not large--not like American standards--but the amounts were completely satisfactory. We started with an appetizer of ciabatta, just a , that gave us 4 pieces of luscious bread. My entree was Shetland salmon on potatoes and peas, cooked to perfection, and in a sauce that complemented everything. My husband had the Scottish ribeye, which came with fries and a small frisee salad. For this, our last day in Scotland, we sprung for a quintessential dessert as well: sticky toffee pudding, complete with a scoop of Scottish ice cream. The sauce was so good I was tempted to lick the bowl clean.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1BzMn2P6_BNz3dDjOLHgUQ",
        "caption": "Photo of Howies - Edinburgh, United Kingdom. sticky toffee pudding",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1BzMn2P6_BNz3dDjOLHgUQ/o.jpg"
      },
      {
        "img_id": "StYpv5VlcRiBwkG7yz1H4g",
        "caption": "Photo of Howies - Edinburgh, United Kingdom. Ribeye",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/StYpv5VlcRiBwkG7yz1H4g/o.jpg"
      },
      {
        "img_id": "L8TRApvURPfhn0AlBTDnKQ",
        "caption": "Photo of Howies - Edinburgh, United Kingdom. Shetland salmon",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/L8TRApvURPfhn0AlBTDnKQ/o.jpg"
      }
    ],
    "user_id": "B0muVEQdT02pR7no_JmzOw"
  },
  "kkvc0QWFCGyQdvIBqhHLOw": {
    "date": "8/12/2019",
    "text": "This place is right around the corner from our hotel so we decided on an early dinner. Their starters are the perfect size for us so we ordered the focaccia bread, heirloom tomatoes and mozzarella salad and a salmon salad plate. We also got lemonade coolers and hubs ordered a sticky toffee pudding with vanilla ice cream. I know it's a chain but everything was still delicious, the vegetables were fresh and portions were just the perfect size for us.  Service was outstanding. It wasn't too busy at 6pm but difficult to get a prime table due to reservations. We were seated closer to the front entrance but still had a nice time and we enjoyed the food and atmosphere. We plan to return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qejXjXMN_QPOIkfk9Rd05A"
  },
  "YwicG6O7QHNN_s1ZMOMuqQ": {
    "date": "11/18/2018",
    "text": "Everything was light and fresh fare.  When you first walk in, you get the feeling it's a fancy restaurant, but the food is moderately priced, and if you order before 6:30pm, Sunday thru Thursday they have some 'early dinner' specials that will save you some money (good value).  It is low light there and that made it a little bit challenging to read the menu.  The venison, beef stew (they call it casserole), creamy mashed potatoes, and fresh focaccia bread were all out standing.  The deserts were also really good, especially Sticky Toffee Pudding (our favorite).  The only knock I'd give them is the servers weren't overly helpful explaining things on the menu when we asked questions and what was what. I do think there were some language barriers. Also there seemed to be a bit of abruptness and attitude from some of the non-Scottish workers.  I would recommend this place, and especially before 6:30pm Sunday thru Thursday for their early dinner specials.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HprviNtz7td9M6THt7J0KA",
        "caption": "Photo of Howies - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HprviNtz7td9M6THt7J0KA/o.jpg"
      },
      {
        "img_id": "2ie7IdrAK4hCTdHxEvEK6g",
        "caption": "Photo of Howies - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2ie7IdrAK4hCTdHxEvEK6g/o.jpg"
      },
      {
        "img_id": "fpjquxSc-LMfXpnI3gyMWA",
        "caption": "Photo of Howies - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fpjquxSc-LMfXpnI3gyMWA/o.jpg"
      }
    ],
    "user_id": "QRash3nVtsQul658ekntTA"
  },
  "QLq2VvwAUsBNx4e4rRXw1A": {
    "date": "3/19/2019",
    "text": "Had a wonderful experience at this restaurant last year. I was traveling and it didn't feel weird to be dining alone by myself. The fish I had was cooked perfectly, the skin crispy and white meat juicy. The haggis, oh the haggis, I fell in love. If you're adamant about offals, I encourage you to have a taste of their dish here and wait it change your perspective. The banoffee pie is something I can eat every snack, dessert, breakfast?  I'll be sure to come back here when I go visit again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ifRXuBYPRLmrXMbkiZ3J2Q",
        "caption": "Photo of Howies - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ifRXuBYPRLmrXMbkiZ3J2Q/o.jpg"
      },
      {
        "img_id": "3xbtfs0ppK0MK5tfD5SoHw",
        "caption": "Photo of Howies - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3xbtfs0ppK0MK5tfD5SoHw/o.jpg"
      },
      {
        "img_id": "c8Ysbii7_2TNZ5ZrTFLhdQ",
        "caption": "Photo of Howies - Edinburgh, United Kingdom. Haggis",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/c8Ysbii7_2TNZ5ZrTFLhdQ/o.jpg"
      }
    ],
    "user_id": "RT-vIfGncbXc3ID0dMD4KQ"
  },
  "2r7RrvkG8EJ0vqleJixMNA": {
    "date": "7/4/2018",
    "text": "First timer. I was part of a 3-hour Food Tasting Tour in Edinburgh, Scotland (<a href=\"/redir?url=http%3A%2F%2Fsecretfoodtours.com&s=e00ab9eff7c7ad7938f0b4a7868dda71a0c5e034285d59a5cdd4c0e926c3877c\" target=\"_blank\" rel=\"nofollow\">secretfoodtours.com</a>).  I ordered the Pork and Smoked Ham Hough Terrine. I love pork but for me this does not do any justice to the pork. The dish has a type of gelatinous texture which I think is what threw me off the most :(",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oFKtOgx-CIEJHWLtkV7ihA",
        "caption": "Photo of Howies - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oFKtOgx-CIEJHWLtkV7ihA/o.jpg"
      }
    ],
    "user_id": "jd9p-rk4z1hDGu8zcN2v9w"
  },
  "1oPU8jstPAGPWyXf81Jbng": {
    "date": "11/18/2018",
    "text": "Food 5 stars. Wait staff 3. As Americans in Scotland we needed a little guidance in understanding local culinary vernacular. Staff not so helpful on this front. Food was awesome. Highly recommend the daily specials. We tried both the stew and the cod and they were both awesome. The stew was so rich and flavorful, the beef literally melted on my fork it was so soft. The fish could have used so lemon but dealt with it bc that's could be an America thing. So worth getting desert. The sticky toffee pudding won our groups top accolades. Howies banaffoe (sp?) pie was a close runner up.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HKsXB_PKdlj8zLSpLHHd7Q",
        "caption": "Photo of Howies - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HKsXB_PKdlj8zLSpLHHd7Q/o.jpg"
      },
      {
        "img_id": "9qJ_j0u3RKqLroapS6L3Jw",
        "caption": "Photo of Howies - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9qJ_j0u3RKqLroapS6L3Jw/o.jpg"
      },
      {
        "img_id": "UPaH8xNxlKLVXO9PZMAlUA",
        "caption": "Photo of Howies - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UPaH8xNxlKLVXO9PZMAlUA/o.jpg"
      }
    ],
    "user_id": "OY1PwbIbNvm_rALKna9noA"
  },
  "QMkWaQgN1SPsW_elqSf-sw": {
    "date": "6/5/2019",
    "text": "We took our French guests here for dinner hoping for some Scottish flavours that they wouldn't get back home and we weren't disappointed.  Fresh starters and a decent choice of mains on the menu including non-meat options.  Our guests went for the hake main course and seemed to enjoy it.  Puddings were delicious.  Wine sold by the glass, carafe and bottle.  Local beers too.  I'd advise booking in advance as all the tables were full pretty early on.  Friendly service; mainly overseas staff.  Occasionally difficult to understand our server but it really wasn't a problem.  Hope to have reason to eat here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o5dVp4UmzD0eXyJQ3TtRxg"
  },
  "5s86UPZqDu4VZyb8GWY8KA": {
    "date": "5/19/2018",
    "text": "During my stay in Edinburgh, this was one of my favourite places to go. The food was absolutely delicious, and our server was quite funny which made the experience even better. The calamari was good, the catch of the day was great, and the dessert + wine made it a 5 stars for me. The server was helpful and had a lot of knowledge in the menu, the restaurant was clean, overall was a great experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ie1DrLYvrJHcIQv9gxo7UA",
        "caption": "Photo of Howies - Edinburgh, United Kingdom. Catch of the day, varies each day I believe.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ie1DrLYvrJHcIQv9gxo7UA/o.jpg"
      },
      {
        "img_id": "I2KA_bGBjfLOAEFLbxnkyA",
        "caption": "Photo of Howies - Edinburgh, United Kingdom. Dessert, forgot what it was called. It had stewed pears with pumpkin seeds and ice cream. Delicious.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/I2KA_bGBjfLOAEFLbxnkyA/o.jpg"
      },
      {
        "img_id": "lfXFLjAruTYxqHUuw33UTw",
        "caption": "Photo of Howies - Edinburgh, United Kingdom. Calamari was great, could&amp;#39;ve gone for another round.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lfXFLjAruTYxqHUuw33UTw/o.jpg"
      }
    ],
    "user_id": "Q3g85BwtAKeT_nkH3eJKfQ"
  },
  "8r3TStCKUBKAmQIwL9puCA": {
    "date": "8/4/2018",
    "text": "My family and I had a fantastic experience at Howie's! This was our first night in Edinburgh and the restaurant was recommended to us by our tour company.   I ordered the ribeye steak and thought that it was delicious. It came with a great side of fries and also a small salad. The service was also exceptional and our server made some fantastic wine recommendations.   Only negative would be that it was really hot! Nothing they can control though as the weather has just been abnormally hot this summer. If I'm in the area again I will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9QGa3cfVvzPYRr83V1WDaA",
        "caption": "Photo of Howies - Edinburgh, United Kingdom. The ribeye steak which came with roasted tomatoes, salad greens, and fries! Delicious!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9QGa3cfVvzPYRr83V1WDaA/o.jpg"
      }
    ],
    "user_id": "3EKq--HzJascc9uuTdzGYg"
  },
  "zzAVcGl5gR98Rvfcw0-tIw": {
    "date": "5/7/2019",
    "text": "The wait staff was wonderful. They have been the nicest I've encountered in Edinburgh!  The location is beautiful and the historic building gives quite an ambience.   The food was very good. We both had the lamb dish and highly recommend it. It was very tender with great flavor. It is al carte so the bill can get pricey.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "phxOu2EAUrlEBlWR8H46_w"
  },
  "2crg_91GIVCr1U6zflPJAg": {
    "date": "10/9/2018",
    "text": "The restaurant looked great.  Nice menu.  The kitchen was really slow.  The watress tried to help by putting our kids' orders in ahead is the adult meals but without asking.  So they are and we sat for an hour.  By the time our food arrived the evening was pretty much ruined.  Most tables had very slow food delivery and the body language told a similar story to our experience.  The manager did take our meals off the bill so I'm happy they took responsibility.  I wanted to like the restaurant especially since it was our last night in Edinburgh but it didn't meet expectation.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wcvxcvIm-m0Y7gyPRCImKA"
  },
  "oHHIdFIWILWv2hc3hjFFjw": {
    "date": "8/31/2018",
    "text": "I had their goat cheese starter and their catch of the day. The food was excellent, but their service was exceptional!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v3tc7PUi_E3ogHkXY3glHg"
  },
  "Z2Zeown6DYv2WEkt9UbADA": {
    "date": "8/16/2017",
    "text": "We were walking around the area and just happened to walk into this spot. They were extremely busy as it was mid day. We were greeted and taken to a table for 2. They had a set menu for lunch, but also a full menu. We had the sweet potato soup and fish cakes. We then had sticky toffee pudding that was great. Service was excellent and the food was a week, I would definitely go back and they had a great wine and beer selection!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0EE_wIv6HPnK2CkYsOwS0A"
  },
  "2VWzZySRxOZGu8e_jiu_3Q": {
    "date": "9/12/2017",
    "text": "I wish I could've given Howie's a proper chance. Unfortunately, they were so incredibly rude that I had to leave before dining here.  After a long walk, my partner and I wanted to find a place to sit to wine and snack. We stumbled into Howie's and had to first use the restroom. While walking up the stairs, a staff member followed us because she was upset that we didn't first go into the dining hall. We told her we were going to the dining hall after. She then rudely responded, \"Well then you could've asked me where the toilets were.\"  Why would I? There was a huge sign that said \"toilets.\" Her freak out on us was uncalled for and embarrassing quite frankly.  Needless to say, we decided not to dine there.   Edinburgh is filled with amazing restaurants with excellent customer service. We didn't need this negative, pretentious energy.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BfPrx-qMPgbbhTPox6kMkg"
  },
  "lHVTlWCvc0-UxYlZzmQfig": {
    "date": "7/3/2016",
    "text": "I had a lamb casserole and grilled asparagus. Very good food with a reasonable price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qt5XxkuXhU5D2Tl060RAwQ",
        "caption": "Photo of Howies - Edinburgh, United Kingdom. Nice food and ambience.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qt5XxkuXhU5D2Tl060RAwQ/o.jpg"
      },
      {
        "img_id": "p7S5KTIN11s1fjhkCopnGA",
        "caption": "Photo of Howies - Edinburgh, United Kingdom. Went to Howies. Very nice food and ambience.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/p7S5KTIN11s1fjhkCopnGA/o.jpg"
      }
    ],
    "user_id": "itlN0algxv9jXOJqbDSUkg"
  },
  "OydqCNzk-Z4SufmgVUe40w": {
    "date": "5/18/2016",
    "text": "There are more than one Howie's in Edinburgh, but the newest one at Calton Hill is large, elegant and worthy of special occasions. It is next door to the Carlton Place hotels so there is a mixture of tourists and locals. The tourists are the ones ordering the haggis. There was a good selection of appetizers but a surprisingly small number of main dishes. I had roast lamb with scalloped potatoes, carrots and beans in a light jus. The lab was lean, pink, and tender with a wonderful char.   The haggis was delicious (did I mention that I am a tourist), with a touch of pepper for heat. The neeps still had texture and the tatties were sweet.  They offered three flights of whiskies, each a sample of three. I had flight one, a lowland, Pitlochery, and Skye.  Desserts featured chocolate puddings, ice cream, and cheesecake. I had a trio of Scottish cheeses.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tPYBKcyPVqsRuM1-NkG_xQ"
  },
  "cnQ1Uy46E0IAVyMaAeDWIw": {
    "date": "7/14/2017",
    "text": "Great location . Good ambience and service . Great dessert . Came here on recommendation and Not disappointed at all",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6EWaD3ZAt_N92ohmdbw7WA"
  },
  "aDkT_Q3Z_cN59q2IBhMZDg": {
    "date": "5/8/2017",
    "text": "Went to Howies on Waterloo on a recommendation from the Marriot Courtyard desk. We ordered the salmon and the ravioli. My ravioli was not a lot of food. Flavor was fine. The salmon was tasteless and not much food on the plate. If you want bread you pay extra. Service was inattentive and the waiters wear tee shirts. Maybe we ordered the wrong food, but we were disappointed.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SAYnnAF3_0UNsP-sWCYkSg"
  },
  "aaqUR6uySyHuDq_AdlQRtg": {
    "date": "6/22/2017",
    "text": "The service is fantastic. Well oiled machine indeed. The staff is attentive, responsive, and quick. The environment inside is absolutely gorgeous. The food is lack luster to say the least. Not completely terrible, but not terribly good either. Mediocre. Conveniently located if you must have a bite, but would suggest another place for a good meal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UIjBrqqKs2E963ir5XE22Q"
  }
}