{
  "jl85-RxUzUeByuzC_KCFSw": {
    "date": "2/21/2010",
    "text": "It looked crammed from outside with its windows blurred from the heat inside and the cold breath outside. I entered the restaurant and the waitress asked for my coat. It was pretty unexpected as the interior of the restaurant didn't leave the impression of posh on me. On the contrary, I was grabbed by the feeling that I am entering a local cafe/restaurant with an astute Scottish traits. The menu offered Scottish dishes, indeed, but the choice was not that big. However, the service and the food I tried were excellent. The rooms inside are a bit tiny, you can feel slightly claustrophobic if too many clients come in. On leaving the place you are left to rake over the piles of coats in the wardrobe section until you find yours.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hqZiOnwZ3J1s7piCBUN6Ow"
  },
  "2_rmICX7QcfAUTUgO_otdw": {
    "date": "11/14/2007",
    "text": "Hip yet relaxing, sophisticated yet brimming with a laid back cool, Blonde offers a modern Scottish menu with a twist of the European. It's clientele stretches unsurprisingly straight across the board appetizing dishes, reasonably priced in a nifty little setting all looked after by a team of friendly and competent staff. Careful it doesn't become a home from home.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bp6bMTGC8qUxT2A8DC37Cg"
  },
  "9hZPAu-0ewLnyKQO85Eg5g": {
    "date": "4/27/2008",
    "text": "A very nice little restaurant that is friendly and relaxing but also very sophisticated, the food was excellent from the small changing seasonal menu, the prices were very good, great value for top quality food and the staff are very nice and friendly. I'd recommend this restaurant to anyone really, it has a great balance and a solid customer base. oh, and the poached pear dessert = a winner!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n0FSYxOyMgNZ8GFTP1pStw"
  },
  "2twVZY1gdH5P2O6hVn4x6g": {
    "date": "4/20/2009",
    "text": "I'm very surprised that I'm the first person to review this restaurant. It was recommeded to me by some friends as a nice restaurant that serves good food at very reasonable prices, the wine list is also very reasonably priced.  The restaurant certainly didn't disappoint. There is a good menu offering steaks, seafood and other Scottish specialities.  To sum it up its a good restaurant serving ggod food at very reasonable prices.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XqqmYmSIFX_TJZ6A2KOOig"
  },
  "LgxBNWHfsFr55L2o54ctXQ": {
    "date": "5/25/2009",
    "text": "Great little restaurant/bistro   Friendly staff and great choice of wines.food is excellent but not menu is very limited.   Would definately book again !",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l-tXPpDNcnLQ322uqSNPjw"
  },
  "jc-Ge4DJI53XWkc6Atv3aA": {
    "date": "9/16/2011",
    "text": "I've only had good things to say about the Bonde. Where else can you have a beautiful three-course lunch for under 11 (and two courses for under 9)? I have to say the quality of their food is very good although I was a bit disappointed of their spinach risotto last time when I was there. Having said that, the Blonde is still very good value for money. The food is beautifully done. Highly recommend!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DVu9x-0LrA3VfJjVE4ovVw"
  },
  "PcV8uWnI5C1JSTiMyEOYBQ": {
    "date": "5/26/2009",
    "text": "Great place to eat if you like excellent food, nice prices and pleasant surroundings. Staff are very friendly too in the best possible way.   My favourite meal during a recent short break in Edinburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kS2K5YgP361n62TO_bLxSw"
  },
  "c9OiYsDltx3BmnfN55eI6A": {
    "date": "10/21/2008",
    "text": "A small subtle restaurant, perfect for both a quick lunch and a relaxing dinner. Menu offers seasonal scottish delights with fantastic price for the quality of food. Great:)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jLV4d-_HaxCB0LlB_WBblA"
  },
  "1FQ7bPHWarLjdl2VdPIMxQ": {
    "date": "12/20/2015",
    "text": "A few Yelpers and I came to Blonde for their 3 course Christmas menu and I was firstly impressed with the number of choices of each course (6-7). It was so hard to choose as there were so many good options, however I started with the spiced chickpea and almond croquettes with green leaves and relish, as it sounded a bit different. It was delicious and an extremely generous portion for a starter.  For my main, I went for the slow-cooked venison, red wine, root vegetables, nutmeg and chocolate, buttered mash and parsnip crisps - talk about putting all of my favourite things in one dish! It delivered about what I expected from it too. The sauce was rather sweet, so might not be loved by all.  And if I wasn't already full (I was), I still had steamed cranberry and pecan pudding to come. It was supposed to come with brandy butter, but I asked to switch it for hazelnut ice cream, which I saw accompanied another pudding. I'm glad I did, as it was one of the best ice creams I have ever had and the steamed pudding was moist and full of the fruit and nuts too.  3 courses was definitely way more food than I needed, but it was such an amazing 3 courses, so worth the pain of a very full stomach! Highly recommended for a special dinner out, as the quality of food is superb and I would say the price is fair considering.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "CiEcf2sST7Ow1dP_RKb22w"
  },
  "Av1s2QL-qj8w2RUuD0lvxA": {
    "date": "3/13/2017",
    "text": "Came here through our Airbnb host's recommendation. They offer 2 or 3 course meals for lunch. There are many options for each course, so there is something for everyone.   The service was excellent! We originally wanted to do the 3 course, but since the portion sizes were so generous, we were too full for dessert. The waitress had no issues with us downgrading to the 2 course.  We did get one dessert to share, which was the rhubard creme brulee. It was your standard creme brulee until you hit the bottom, where the rhubard kicks in as a surprise, bringing in a nice fruity tartness that cuts into the heaviness of the traditional creme brulee. It was so good after a heavy meal!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VgnXjNsC0-ze0IGLMM2sjA",
        "caption": "Photo of Blonde Restaurants - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VgnXjNsC0-ze0IGLMM2sjA/o.jpg"
      },
      {
        "img_id": "oW_2FFXB7xBevcxYo_EKEw",
        "caption": "Photo of Blonde Restaurants - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oW_2FFXB7xBevcxYo_EKEw/o.jpg"
      },
      {
        "img_id": "aJP30Ze7kW_jLoR-6QGwUA",
        "caption": "Photo of Blonde Restaurants - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aJP30Ze7kW_jLoR-6QGwUA/o.jpg"
      }
    ],
    "user_id": "fVnS3wVUGCqTdb6Hzm9UFQ"
  },
  "ivfXQ_0l-5Z9k8Q1OwUHDg": {
    "date": "12/20/2015",
    "text": "Dropped in for the UYE Yelp Christmas party.  A fixed menu for 23 was a reasonable deal.  The food was a bit hit and miss. Duck parfait was an ok pate with fig chutney. Beef cheek main was very good. And the desert - a steamed pudding was woefully short on sauce.  Still probably worth trying though",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "eBVFtdxqTGdogezZ98HUsQ"
  },
  "rAr0XbXpsqO4_jl8R7B0pA": {
    "date": "12/21/2015",
    "text": "Sunday night, prime Christmas party season.  This place should have been PACKED!  An absolute hidden gem, any time of the year, but a great option at Christmas with their great value, great choice and great service.  I'm so grateful that the UYE Christmas dinner introduced the hubby and I to this great restaurant.  We loved EVERYTHING!  Comfortable setting with a clean, fresh, yet cosy interior.  The staff were efficient, relaxed and fun.  The menu was fantastic.  When I first asked my husband if he wanted to come along, he hesitated.  Most restaurants put on a stripped down Christmas menu, and often replace their signature dishes for turkey and stuffing.  When we checked the Blonde holiday menu we were really excited by the wide variety of options which stayed True to their regular menu - but for a great price of 23.50 for 3 courses.  Other restaurants should learn from Blonde - use the Christmas menu as a way to introduce diners to the best you have to offer - not as an excuse to pass off mass produced roasts at an inflated price.   But, back to our meal.  It was hard to choose but we started with the Black Pudding on a spelt salad and the spinach filo parcels.  I know my hubby loves anything with Black pudding but we were both surprised by how much he loved the healthier portions of his starter - the spelt and especially the dollop of eggplant cream.  I'd never get him to try anything like that at home!  My filo parcels were delectable.  Loads of spinach inside, crispy on the outside, and on a bed of a light caponata-like sauce that I practically licked off the plate.  A big portion of potato salad made this starter feel more like a meal.  I would easily have been satisfied with just that, but I'm glad there was more to come.  Our venison and oxcheek mains were both well cooked, presented and well balanced with the side vegetables.  Only a small niggle with the ox cheek.  I was immersed in the soft, tender meat - which didn't need a knife as it just fell apart, when I was suddenly brought back to reality by a bitter blast as I bit down on a whole pink peppercorn.  I use whole peppercorns in my sauces, but I strain them out before returning the stock to the pan for the final thickening.  Not a major issue as once I realised they were there, it was easy to pick them out.  Dessert was a very rich, moist flourless chocolate cake, drowned in a salted caramel sauce.  This sauce was just to my taste - not super sweet with a strong caramel flavour similar to the top of a creme brulee. Another plate lickingly good sauce.  Only other niggle was the wine/beer selection.  Not many whites by the glass and the beers were all lagers, light ales.  I would have loved a dark or amber option, especially when venison and ox were on the menu.  Overall a great night out with great company and a new restaurant to add to our hidden gem list.  Blonde, we will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FgIOesjkqkxCLyTM7gP36A",
        "caption": "Photo of Blonde Restaurants - Edinburgh, United Kingdom. Ox cheek.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FgIOesjkqkxCLyTM7gP36A/o.jpg"
      },
      {
        "img_id": "-YJjnF1oat4_Cu0_ntwFeA",
        "caption": "Photo of Blonde Restaurants - Edinburgh, United Kingdom. Set fir christmas",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-YJjnF1oat4_Cu0_ntwFeA/o.jpg"
      }
    ],
    "user_id": "ptj5uhi0bNaUotgEmaRzrA"
  },
  "TZVbikFDKOKiefPOLpkp8A": {
    "date": "12/20/2015",
    "text": "Met with other Yelpers for the UYE Christmas Dinner.  Giving the place has lots of 5-stars I was looking forward to it however, I feel a little letdown.  Like Hamish S, I'd say the food was hit and miss.  I'd did enjoy the Duck Parfait with the fig and calvados chutney and toasted brioche, the Ox cheeks were lovely - so melt in the mouth but the sauce for me wasn't hitting the spot.  To finish off, I had the Flourless chocolate cake with salted caramel sauce which was lovely and light but full on chocolate flavour.  23 for three courses from a fixed menu is a pretty good deal.  I opted for a sparkling water as I was driving and had a double espresso to finish off the meal.  The service was spot on and friendly, plus there weren't long waits for the food either, considering there were 10 of us.  Kudos for a Gluten free options too, as we had a GF diner at our table.  Bread was substituted with oatcakes. But do offer separate butter with them!  The Atmosphere is casual, so like Alexandria M. says you could go all glam or wear jeans and just go casual.  Give it a shot, just don't build your hopes up from all the 5-star reviews!  Just enjoy yourself.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ow-5icIQMlljjV7thJMBtA",
        "caption": "Photo of Blonde Restaurants - Edinburgh, United Kingdom. UYE Christmas dinner!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ow-5icIQMlljjV7thJMBtA/o.jpg"
      }
    ],
    "user_id": "BhYROfCjIJsKUk22_IVHig"
  },
  "LSA6J7-C2YTAtk_d7RYv6w": {
    "date": "12/30/2015",
    "text": "Came here for the Yelp Christmas dinner and it was lovely.  Three courses were a reasonable 23.50 and good value. I started with duck pate - this was ok, didn't blow me away but I appreciated getting gluten free oatcakes with this.  The venison in red wine with mash was a lovely dish. The perfect winter warmer with a lovely thick gravy with perfectly cooked venison and great mash (creamy and no lumps).  Dessert was flourless chocolate cake which was also very good. Wine is by the glass or bottle - don't be fooled the medium sized glass, its a big glass!   Service was efficient - we were a table of ten and everything worked well.   I'll definitely return to Blonde - its a wee gem and good value for money :-)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "frthTngbBHgSdk4j85HmEQ"
  },
  "WG9XnoKLORriP9BLBWvmVA": {
    "date": "5/7/2015",
    "text": "This place is such a well-kept secret, and I hope it stays that way. I've eaten here a dozen times, and every meal has been wonderful. I love the intimate yet casual atmosphere; you will feel comfortable here whether in jeans or gussied up. They are a vegetarian and vegan friendly establishment- YAY- and the staff are super friendly and well informed about the menu.  It's a wee place and some the tables are very close together, so leave your hoop skirt and playground voice at home. On the other hand, the fewer covers mean the kitchen staff can put extra care into each dish they make. You can tell that the dishes are very thoughtfully planned and prepared, and that's why I keep going back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "HJQUikI7arFymAclOEx4Mw"
  },
  "nZmwfkZqMbCjFJ0qRU9VaA": {
    "date": "3/9/2012",
    "text": "Had dinner here on Monday this week. Not a busy night by any means  one duo in when we arrived and no-one else in between them and us leaving. 3 very well made and presented courses for 17 though was good vfm, particularly my fish cakes starter and the main course of trout. I didn't personally have wine but the list looked pretty comprehensive. Pleased to have finally made it inside here and would certainly go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TnaQZRE-3jiBCkngKY6Epw",
        "caption": "Photo of Blonde Restaurants - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TnaQZRE-3jiBCkngKY6Epw/o.jpg"
      }
    ],
    "user_id": "txzOZrHK9EVY0kYjSuXkKg"
  },
  "fWZEnlT50Een6e-akRSdkw": {
    "date": "3/24/2013",
    "text": "I thought the food on offer at Blonde was smart and flavour-packed, with a nicely balanced menu featuring a good range of local produce. I went in the evening and boy was it dark! Seriously, the \"mood lighting\" was so dim that people were struggling to read the menu, and it did impair the appreciation of some of the presentational touches that been applied to the dishes.   It made me think that this would be the ideal dining venue for a \"first date\" with someone that you'd met in a dimly lit pub or club, taken something of a shine to, exchanged numbers, then arranged to meet when less sozzled. If you didn't happen to have perfect recall of what they looked like, but vaguely remembered their size and shape, this place could cut through any \"cold light of day\" embarrassments ;-)  Overall, we said: \"I did enjoy my visit to Blonde. The service was a real strength, and the food was quite impressive, without quite unifying in to overwhelmingly convincing dishes. The price tag was very reasonable for the fare on offer, though, so I'd happily go back, and take friends, as I'd be confident that the broad appeal that Blonde delivers would please many different tastes.\"",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LURC3E0DoXYgN9aYTF3XOg"
  },
  "M4gUhPelUbJDP-2TH7yxWg": {
    "date": "9/4/2014",
    "text": "In town for a holiday and had a wonderful meal there. In fact, it was the best restaurant meal I have eaten. I am a vegan (vegetarian non-dairy) and started out thinking there would be nothing on the menu for me to eat. But the helpful wait staff contacted the chef, who pointed out what was vegan (but not marked as such on the menu) and also offered to modify some of the items so they would be vegan. Wow, wonderful!   The vegetarian haggis was so tasty and served with delicious watercress. For the main entree I had a vegan version of filo dough leaves stuffed with roasted vegetables. So delicious and with a savory sauce. There was also a vegan dessert--apple sorbet in a brandy bucket and with poached fruit on the side. Yummy.  Portions were generous for the sort of restaurant it is (and I am saying this as an American where portions are sometimes overly generous).  The waiters were wonderfully helpful and attentive and the atmosphere low key--not a busy night since we went after the festivals had ended in August. If you are vegan or if you are not a vegan (this is everyone!) I highly recommend this restaurant!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xx19yCRB5KT7O1wbDUc7LA"
  },
  "X1OgHl2zvySa5TR3XkQKRQ": {
    "date": "3/21/2015",
    "text": "Very good restaurant! Staff is very friendly, atmosphere is great, especially for romantic evening with your significant other and, of-course, food is delicious! Our favorite place in Edinburgh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kRPG_hT8qNAYARFD2A9xvA"
  },
  "G0oEwCSHp97yUiGdOvpUQw": {
    "date": "8/19/2015",
    "text": "We had a delicious meal! Even a dish that sounded mundane, the lentil soup, was very tasty. Interesting flavors that you don't find everywhere else. Good service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4oJvSYriaTH7hhD6j7BhsA"
  },
  "pzt2Tosfq9mexmqhJ3dpBw": {
    "date": "4/19/2010",
    "text": "This place would be perfect, if it were up in the Grassmarket or on George Street. Unfortunately, for Newington, the prices are a little excessive.  I started with the fresh mussels cooked with coconut milk, fresh lime and coriander. Although it was tasty, given that it cost almost 6 the portion size was pretty mean to say the least. If there had just been a little more to it, I wouldn't have minded paying this much but given that in other restaurants in the area this price could get you a main course, I did feel a little robbed.  The main course was a similar story: Although the grilled swordfish with the various accompaniments was delicious, at 13.95 I felt as though I should be in a much fancier restaurant than I was.  That said, this place is always full... not only when I was there having dinner but also every time I walk past. If you're the kind of person who is seduced by any menu full of words like \"bisque\" and \"terrine\" etc then you'll love Blonde. If you're the kind of person that will happily pay these prices when it's in an exclusive upmarket city-centre location that can justify these amounts, then this is probably not your type of place.  To sum up, although the food is tasty it's the kind of place where you'll have a 3-course meal and still leave feeling hungry.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CiHNt4fNQxcqgnK1rGlDoQ",
        "caption": "Photo of Blonde Restaurants - Edinburgh, United Kingdom. image courtesy of www.blonderestaurant.co.uk",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CiHNt4fNQxcqgnK1rGlDoQ/o.jpg"
      }
    ],
    "user_id": "oEshN5oq98_g23MvEnRc5A"
  },
  "qXgw4vG0rDiAJFIWPHY_7w": {
    "date": "8/25/2015",
    "text": "Stopped in for dinner after fringe festing at Summerhall. We were walking by and saw a restaurant full of happy people, an unassuming menu, and good vibes. Food is quality, service is friendly -- a really nice place to have dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2qNzQDt7mhRARbXQXMEbTQ"
  },
  "uH7IU05I5ANrL_IQkMZBug": {
    "date": "8/19/2011",
    "text": "Visited last Sunday afte a festival show with 5 other hungry folks. Waiting staff were friendly, welcoming and attentive. Out of all the starters no one was disappointed. I had the Rabbit Terrine and it was Truely delicious. Again the Mains were a big hit.I opted for the Veggie Haggis, which is not like me, and it was great. A friend had the Venison and the juis was out of this world. Great place, Great food and i will be back before too long.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i2yF69bYLH3kLfK9BK1UDg"
  },
  "4_z6ZtAbESaOdVIC-IFX6Q": {
    "date": "10/8/2010",
    "text": "The food is very good, but I found their menu to be a little bit pretentious -- hasn't Gordon Ramsay shouted at enough people for putting random fruit into savoury dishes? Portions a smidgen on the small side too, though desserts were excellent.   Probably wouldn't go again, but nor would I advise against it: try it and see if it's your style.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EbR2otqoLrhDME91hX7VWg"
  },
  "gfuKQjtKwyKkmvHS4U-jNA": {
    "date": "6/23/2010",
    "text": "I agree with Fiona, this place is a little too swanky for this part of town.  The decor of the place is a little basic, but they claim it's styish all over the website. The food is alright, nothing fancier than you can pick up in the tesco finest range. It leaves alot to be desired.  If your mum opened a trendy resturant, this is what it would be like.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GYSd77BpjSQTsEGQz6XLbg",
        "caption": "Photo of Blonde Restaurants - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GYSd77BpjSQTsEGQz6XLbg/o.jpg"
      }
    ],
    "user_id": "9nUtGoOnZMPlZdUQV_aqTA"
  },
  "-7LUiINI73xMViKblGsYCQ": {
    "date": "10/4/2011",
    "text": "Feeling puzzled.  The place was recommended and I think I'm going to try regardless of the couple of reviews (Stuart and Fiona) that have misspellings and an illogical statement (Fiona).  Wish me luck : )",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QHFQvyUkAji7VobNP4W3GA"
  },
  "5ZLkkYU0nwmPzDS4Np9ARA": {
    "date": "6/9/2011",
    "text": "The place is small but the food is really really good. I would recommend it and would eat there again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "foQcZac-Z0SboUd8AUvhjA"
  },
  "tn-sps7oS1b4AcZfVNQvUA": {
    "date": "9/27/2008",
    "text": "Had lunch here, lovely atmosphere, and food tasted great, very fresh. Only minus point for me was the portion size which to me seemed a bit small and arty tv chef.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8JGqs4-WtU1jMYcdFKEKGg"
  }
}