{
  "XBySCsMqt6MnXxxVQ1jVDQ": {
    "date": "2/9/2012",
    "text": "Cocoa is actually savoury; in the 16th and 17th centuries, when it was first being introduced to the UK, sugar was very expensive, so it was only the wealthy who could afford \"chocolate\" as we would recognise it today.   This is why we think of chocolate as a luxury item.  Hotel Chocolat does nothing to dispel the view of chocolate as a luxury item - although its prices mean it's a luxury most of us will be able to afford!  After a wonderful event last night, I can't see anyone who goes into Hotel Chocolat giving it less than 5 stars.    The cafe is at the back of the chocolate shop itself - and when I say \"chocolate shop\" I mean chocolate heaven.  Or hell, if you have to actually make a choice.  It was almost overwhelming, the walls of wonderful varieties and old favourites (but all with a far better standard of chocolate), but eventually the inspired thought hit me....I could always come back next week.   ....Or sign up for their monthly tastings...  Mental note:  must renew gym membership!  Actually, on that note, I tried their cocoa infusion, which was like chocolate tea, only not like tea at all (thank goodness!) - but it wasn't as rich as some of the other items on the menu and, as such, it didn't feel like too much of a marvellous thing.   I'm dying to know how Jurgen's chocolate rubbing concoction goes, and I'm tempted to try out the cocoa pasta.  Whatever the recipe in our own kitchens, I'm looking forward to making my way through the Hotel Chocolat menu.  The variety, the price, the friendly staff all make an experience guaranteed to be sweet.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kfZJXSI7W2H4N6Nou680cQ"
  },
  "lFxwFbQXKNDsDY7L-Z1zmg": {
    "date": "7/22/2012",
    "text": "Take-away coffee. Great taste, lovingly prepared but smaller than I'm used to. Perhaps that's because I need a pint mug of latte to function in the morning.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hpOJQWalhWC8Lp2tETE1dw"
  },
  "uP6LceWtxbWPhPBA2mAfAQ": {
    "date": "2/11/2013",
    "text": "How can I cell myself a chocolate lover and yet I've never been to Hotel Chocolat?!  Thankfully this issue was solved last week when I attended the Yelp event, and I cannot wait to return.  WALLS OF CHOCOLATE.  A CHOCOLATE CAFE.  WALLS OF CHOCOLATE.  It was fantastic.  I gave myself a ten pound limit and was still able to get out with three boxes of deliciousness.  There's something there for everyone, and I cannot wait to give out the little boxes as gifts.  We tried some of the hot chocolate and the chili hot chocolate was divine.  As if it couldn't get any better, the staff were fantastic, the prices great and reasonable, and this wee little shop is just phenomenal.  I've been seduced by Hotel Chocolate and I'm perfectly ok with it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zTzIyjPmGn6gaUiJp2Y7-Q"
  },
  "AuXh15mbXmIzQzKE_cbU6A": {
    "date": "2/10/2012",
    "text": "I first discovered Hotel Chocolat on a trip to Newcastle last year and thinking it was something a bit exotic, left with a bag full of goodies and spread some chocolate love around on my return home to Scotland. I am delighted it has now opened in Edinburgh and once again left with a bag of goodies after Yelp's event here with the intention of sharing more chocolatey love. However after much consideration I have decided I will be keeping these ones for love to myself - afterall I will be making plenty trips back here = plenty opportunity for sharing in the future, ok?! My delight, along with everyone elses, was ehibited through Oooohhhhhs, aahhhs, ohs, nom, Nom, NOM's, hmms, head nods, heads cocking to one side pondering conclusions, bulging eyes, raised eyebrows, maybe some crinkles of the forehead, sharing love of chocolate and sharing the chocolate with 'have you tried this one?' and 'you know what I mean' and 'there it is, that hit the spot!' So much thrill and excitement all round!  This chocolatier has truly evolved chocolate past the traditional pralines, milk, dark, white and supermarket options. There are cocoa varieties and infusions of flavourings I have never heard of or seen before (even chocolate pasta!), chocs with personality, for different personalities, moods and dietry requirements and enough to keep you going until the sun comes up! Also, in keeping with current times - offers reasonably priced luxury. And for those who don't like chocolate, how could you not find something you like after a visit here! Give it a try!  This shop and event exceeded my expectations with big hearty helpings of chocolate samples laid out on trays and mini doses of chocolate cake drizzled in more chocolate. These were washed down with a delicious cocoa/coffee drink of your own choice and prosecco in a nice little seated area at the back where you can sit back and savour it. I was so caught up in these yummy sexy moments, a friend of mine laughed when I pointed out that the canvas prints, to me, flaunted The Cocoa Bean.  The big helpings were matched by the big heartedness of the staff who were friendly, chocolate fountains of knowledge and attentive to near empty glasses with a general interest in our thoughts on these scrummies. Thanks Liam for helping me to decide on my third purchase! I came home with Fruity Threesome (cherry, coconut and blueberry truffles - 3 of 5 a day, no?!), Billionaire Shortbread praline and Kir Royal (champagne truffles with blackcurrent liqueur) and would have to say that the delight voiced above extended to a squeek of an orgasm.   The only thing that was missing was a big comfy bed complete with cushions for pure indulgent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "RNIQdiN2RHamTGwdq6PXqg"
  },
  "BIclpszhDxCFYMq89tH4TQ": {
    "date": "2/15/2013",
    "text": "There was life before Hotel Chocolat and now there's life with Hotel Chocolat! I am very fussy about chocolate and before Hotel Chocolat I never found any chocolate I liked in the UK (OK apart from maybe some Green & Black in the supermarket...) Hotel Chocolat have stuff for everybody,  for every occasion. Actually they are very good at that.  Birthday boxes, lovers boxer, Christmas boxes, kids boxes, they have thought about everything and everybody! And if you are on a budget like me, you can also buy the small little packets that are just wrapped in plastic.  They allow you to taste lots of different chocolates for a very reasonable price. And, very important too, the staff are very friendly. One minus point = their hot chocolate is rather thin and disappointing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V5U4-iDA2FeO2AlkUrATsg"
  },
  "gLYaRgzUqTk0Qqwz6wJkmg": {
    "date": "2/10/2012",
    "text": "Chocolate is a frame of mind. Few days go by where I don't indulge, but it's not an indulgence. Hotel Chocolat reminds me of what it should be like, sensual, glorious, seductive, delicious, amazing.   Chocolate tends to be the after. Anything that is an after isn't always so good - afterthought, aftermath, afternoon (and the long wait to the end of day...). With chocolate from Hotel Chocolate, it's any thing but. It's a reminder on why you should indulge, and not gorge. One or two pieces, go on, just roll them around in your mouth, appreciate all those flavours that are going on. Then put the packet down. Stimulate your imagination. Come back for more tomorrow.   Hotel Chocolat can almost rescue me from my junkie-like addiction to the sugar and fat concoctions that draw me in from the high street. Fruit truffles that have a much greater connection to fruit than your average bonbon. Liqueur truffles that pack a heavyweight punch. Chocolate in all various forms - polished, rough, smooth, dark, white, milk, savoury and sweet. It's chocolate you want to savour. You can eat, marinade, drink (roasted, like coffee, or in a more traditional form) or rub. Hotel Chocolat promises to return us to a point where chocolate held promise, and not that of a lifetime on the hips.   Hotel Chocolat: je t'adore.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "X2uF3C3YBD24xcgKA104Sw"
  },
  "QbOJBxKfZAL4t2kcvvj5iA": {
    "date": "2/9/2012",
    "text": "So it seems that 2012 has been bringing Yelp Edinburgh the most enthusiastic event hosts! From the last Elite Event with happy Ben who served us healthy chocolate, to Liam at Hotel Chocolate who serves us.. well scrumptious and decadent chocolates!   I'm convinced, this enthusiasm exuding from these people MUST come from the chocolate! It looks like we all need to eat more to be happy! Saying this, I don't think I saw any sad faces last night.    My happiness that was a result from this event shall continue, when I indulge in my Cinnamon rum soaked sultanas covered in white chocolate (oh yes.) and experiment with my cocoa penne!    Good work to Hotel Chocolat for putting on such a great event. Gotta say I loved the half-half coffees (half cocoa beans half coffee beans). Delicious combo and I hope to see it around town soon! I definitely will pop in for one. Might be my new hidden coffee shop local when I'm shopping on princes st!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "F9nMHS70LBqEwKYFFuJ_0Q"
  },
  "KlPwMUwBDA8EuGD1FIR-Lg": {
    "date": "2/9/2012",
    "text": "Well no one else seems to know what to say. But I do - AWESOME.  It was a delight to enter such a well designed shop. It delighted the senses with walls of chocolate, of all shapes and sizes. Just fantastic for someone who likes to see all the wares on offer and browse through what a shop has to offer.   I had a cocoa/coffee bean mixed cappuccino, which was a very nice new experience. Not something I'd have regularly but certainly something that I'd recommend everyone try for something different. I was in fact so distracted by all that was on offer that I accidentally ordered the cappuccino in some sort of panic rather than the Flat White I wanted.  I also tried the molten chili chocolate that was quite the experience!  Onto the chocolate - We had chili chocolate that had a slow burn, we had caramel that was thoroughly super sweet, we had coconut truffles which were ridiculously tasty and RUM truffles which had a glorious rosy glowing rummy punch. I loved them all.  I ended up buying a set of 3x6 mini chocolate packs - these came in at around 8 for all three boxes which was a great deal. I was lucky enough to be going to a dinner later that night and pulled these out for everyone to share afterwards. Responses (not these are not the real names I can't remember that and we ate them all so no wrappers or anything - whoops) :  Bison Grass Vodka Truffles: The mans favourite. The guys around the table loved these.  Caramel Cheesecakes: The girls were almost fighting over these by the time we got to the last one!  Rum Truffles: For myself and the other Rum Fiend around the table these were the winners. So much Rum.   Anyway. All in all a fantastic evening and I would recommend anyone popping in for a nice cup of (reasonably priced) coffee/chocolate and also buying yourselves some tasty treats.   Only reason it's not 5 stars? Well I would have liked to have seen some chocolate beer perhaps. Also some of the larger items made the eyes boggle and I could never bring myself to buy them unless for a very special someone/special occasion. Maybe when I meet that person I'll be able to change the rating!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "lr22Y8AqhDdqLa3Wl0s_fw"
  },
  "PLxZq0fPBgkTZ-TY3ybcbw": {
    "date": "5/18/2012",
    "text": "Nomnomnomnomnomnom.  I desperately love chocolate, but due to its location, I don't get to Hotel Chocolat much.  My first visit here was the day after my wedding when my head was pounding and my stomach roiling from the excesses of the night before.  When the kind sales assistant offered me a sample, I just couldn't bring myself to eat it.  So, I had to limit myself to buying a box for my fabulous makeup artist.    It wasn't until my return the other day that I actually got to try the deliciousness myself.  This time I was able to try the sample on offer, and bought myself a little package of six chocolates that were recommended by the sales assistant.  They were SOOOO tasty.  The best thing about good chocolate is that you don't want to stuff yourself with it, and the 6 chocolates were eaten by the two of us over two days.    My only wee complaint about Hotel Chocolat is that I didn't see any of their boxes of chocolate that were alcohol-free.  When wanting to buy a gift for a Muslim friend I ended up having to go elsewhere as I didn't just want to buy her a few packages of chocolates.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4UQfst9jve4GCSfWpWn2uA"
  },
  "-Ip1HHKKZt133OchsZ3q1Q": {
    "date": "4/13/2013",
    "text": "This is not any old chocolate... It's Chocolate Heaven!! Believe me once you've checked out Hotel Chocolat once you will find plenty of reasons to return! Having first tasted their sumptious chocolate in Birmingham its great to see it open up in Edinburgh - though might not be good for the diet!  Whilst it's a little on the pricey side it's worth every penny! Only problem is there's too much to choose from.... The truffles are devine and soo many fantastic varietes...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9A6gPXhZd4UhbU5_S3eUfw"
  },
  "q0dpEucl7GvkXLK0evY6RQ": {
    "date": "2/6/2014",
    "text": "How I love thee, let me try to express in too concrete a form for the bliss I feel. Coming in, the amazing chocolate man Logan offered me a piece of chocolate and asked if I had anything in mind. Having read that there was a cafe here with particularly good hot chocolate, I mentioned I had heard sumptin about it.  Enthusiastically he offered to make me whatever I wanted, and walking into the den of bitter and sweet heaven I asked what eh would recommend. He gave me a suggestion, his own creation, which I  opted for. Waiting for me to try it I alerted him that I would have an honest reaction, not one based on his eyes fixed on me.  It was amazing, thick, sweet, with two complementary tastes suited to the medium they were infused into. I had to make a call and taking sips apparently I made a face of extreme pleasure, since he remarked that he could tell I was really enjoying the drink.  I wanted to pass this on, and say that this is actual chocolate melted in milk. It is as good as you could ever imagine hc to be. It is almost too much, but being a glutton for happiness, I keep d",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tVrGBW6rj1uebWnqjY-iTQ"
  },
  "wdiYazLCROIWP8BUxOivFg": {
    "date": "2/13/2012",
    "text": "The chocolate here is amazing. I was lucky enough to go to a tasting event where I was spoilt for choice. They had fantastic combinations for us to try such as the caramel chocolate hearts with a kick of chilli at the end and the gorgeous champagne truffles.   I would recommend the melted chocolate drink to anyone who loves tasty a tasty hot chocolate!   There's a great offer at the minute when you buy 3 or more packets for 2.95 each. I ended up leaving with a handful of treats including the eton mess slab, which didn't last long as it tasted ridiculously good.    The staff here are outgoing and overall have a passion for what they are selling. They we happy to recommend and talk about the chocolate, which is helpful from the wide range they offer.   I will definitely be back, after all I've eaten all the chocolates I bought now!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1Xm4Nea4ikRokE0Nlt-dwg"
  },
  "uNOH0Q3OxUewGi3SKiOKnw": {
    "date": "3/20/2012",
    "text": "Remember when you watched the first Matrix and Neo did that whole bending-over-backwards-dodging-bullets-thing? Yeah, that's what the coconut-balls will do to you. I'm not kidding, they're insane. I mean, it's been over a month and I can still *taste* them.  You know how they say that some women even prefer chocolate over sex? Well, if it's this kind of chocolate, I'm more than willing to commit myself to the coco-bean. Just colour me oompaloompa. Oh wait, no I saw the Only Way is Essex, perhaps not quite oompaloompa.  Awkward.  Did I tell you about the champagne truffles yet? No? OH MAN. They are so good, I want to hug them and then ask them to marry me. You know what, I'm not going to tell you about all of these things, mainly because that might deprive you of the opportunity to go see for yourself.  Seriously. Why are you still reading this? Get going! That staff will love on you with all the chocolate you'll ever want.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "6YW-IEZzzVaIYpteJlgy9g"
  },
  "_YX-nwrtwdBguabHSw6MKQ": {
    "date": "2/9/2012",
    "text": "I'm not quite sure what to say about this place other than it is AMAZING! My chocolate knowledge has expanded and my new favourite is chilli chocolate.   The chilli hot chocolate is also divine (just don't wear white when you drink it, yes i dribbled). There are seats through the back so you can drink this chocolate goodness and admire the library of chocolate and decide what to devour next. I can't wait to go back and try something else new :)  Also, my theory (i'm sure you will all agree) is that chilli chocolate obviously counts as one of your five a day as it has veg in it. So yes, chocolate is good for you and healthy!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "HV24bliLib6FuMW3bWBrpQ"
  },
  "vVnfXBxa6Amreax1jBFnDg": {
    "date": "2/9/2012",
    "text": "OMG, what can I say?!   I have a reluctant sweet tooth but that's not a problem here where you can have the most delicious kick-arse hot chocolate with chilli ever, I'm still thinking about it this morning!   The only problem here is trying to decide which chocolates to buy and not wanting to buy them for everyone you know!   As Arnie said, I'll be back....",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "fVOENJCPDoQst-Bk5u9Qkg"
  },
  "nP-K1Lh83azb1xHJ1nQLPg": {
    "date": "3/11/2012",
    "text": "Just a pity this place doesn't offer rooms for the night, because if they did, I'd be staying over!!!!!  If you don't love this place, I don't think we can be friends - sorry!  :o(  I'd been a fan of their goodies for a few years now and so to hear they were finally opening a shop up in Edinburgh was a huge WOO HOO from me!!  I love good chocolate with a high cocoa content and the choices, well, you won't be disappointed, there has to be something for everyone in here.   Their hot drinks are lovely, in particular the liquid chocolate which I tried at the recent Yelp Event here, its probably one of the best hot chocs I've had and it didn't need any extras like cream or marshmallows, just as it comes, rich, velvety hot chocolate. Yum  Sampling other chocs I hadn't tried before was great, often you don't want to buy a whole packet unless you know its what you like so after this,  I even managed to come away with some new chocs I hadn't tried before.  Their hot choccie pudding, hmmm, how good was that, really really good. To finish, wee tipple of Prosecco.  Fabby night and the staff were all very helpful and friendly.   If you need a gift for anyone who loves chocolates, GO HERE!   Prices suit all budgets and its FAB!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1Y9L_kvLgzLmd7po_B56Cg"
  },
  "fn1MJBmx_NoMGs96Y8qSuA": {
    "date": "8/28/2013",
    "text": "All you need is love. But a little chocolate now and then doesn't hurt.  - Charles M. Schulz  Pretty much sums my feelings up for this place. Love going here for the hot chocolate during the winter. Has lots of variety my favorite is anything with chili in it. Reminds me of the way the ancient Aztecs used to drink there cocoa. They also sell some wines that pair nicely with the chocolate they sell. The staff are also always great! They walk around with samples for everyone to try. Sometimes I buy whatever I just sampled! They answer any questions you might have and will help you pair a wine up with a particulate chocolate. I feel like the place rotates stock to which is nice. I mean when I go back I always see something I did not see last time I was in which makes me think they change up the store stock from time to time which is a positive thing. It entices people to become regulars and keeps customers coming back just out of sheer curiosity of what they might find that is new. So stop on in( maybe Johnney Depps movie Chocolat was based off this place) sample some goodies and go to the little cafe in the back for some of that Willy Wonka chocolate river drink that they sell because it really is the best hot chocolate drink I have ever had!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VdAFcSPJgMvCAmp869X2gQ"
  },
  "DNRD65wgz_iln68N0mT6ow": {
    "date": "7/30/2012",
    "text": "Damn fine chocolates. The only flaw is you can't pick and choose individual pieces; instead you're encouraged to purchase three or more packages of six to save a few pence.  The blueberry white chocolate truffles are by far the best I've tasted.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ctrp5IoEKHkixDSIyYHDpw"
  },
  "pxvqU9-qpUvWkrhjwwaD6A": {
    "date": "2/20/2012",
    "text": "So i have already been back - had me a wee cocoa espresso - bitter coffee cocoa goodness!!! very happy Jd.  Also acquired the cocoa chilli oil..........this stuff is incredible - as a salad dressing, on fish.....on meat......for dunking bread in......its just awesome!!!  Foodie winner!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rl4hqDnywPJDCK4wfbXMzg"
  },
  "_QSA-y3YrGmpaiRgbfsDNg": {
    "date": "2/9/2012",
    "text": "I really like what they've done with the place: stripped-back wood, stone, metal and glass keep the focus on the racks of chocolate. There's far too much variety for me here! It was all lovely though and of the highest quality. As others have said, the staff were excellent on the night we went along - very engaging when you had questions then letting everyone mooch about and see what's on offer. I decided against the 'Large Dipping Adventure', but maybe next time.  I also had my first (ever) espresso, one of my dozen hot drinks for the year. This one was made with cocoa beans, which I'm told have to be blasted and scolded to break them down, hotter than a coffee bean requires. It took about half an hour to drink, so rich was the resulting blend! Very nice as well.  I've some dark chocolate brownies sitting in the fridge, waiting for a special occasion to break open the packet. Any suggestions?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EgauZamsAjYo7BQMSr3srg"
  },
  "J-GIfzQ5HNC4T7VynCpnjA": {
    "date": "2/9/2012",
    "text": "Holy Creme De Cacao, Hotel Chocolat is phenomenal, like in that amazingly Scottish Irn Bru advert....... but better. You will have to excuse the nonsense, I am still on a sugar high!  The staff here was delightful, personable and the whole event was unbelievably generous! I expected chocolate yes. But not THAT much chocolate!! Empty trays of samples were constantly being refilled, a free taster of the coffee/chocolate..... I mean guys, way to spoil us!!   This shop seems to have everything any chocolate fiend could ever possibly need, I kept oooohhh-ing and aaahhh-ing at all the things people were showing me they had bought! The chilli caramel chocolates were different, but good with a nice kick..... then there were those rum ones..... I lost count of how many I had. Buy them, you will not be disappointed!  So I basically ended up leaving here with a huge grin, 3 boxes of chocolates (Billionaires shortbread, pink champagne truffles and Chambord Truffles) which I am excited to try tonight! This place is my new achilles heel..... heaven.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j9AYnOtFC90VpDFbma8Q3A"
  },
  "mP7-1rXTbtXt9KxHLAYKeA": {
    "date": "2/9/2012",
    "text": "Wow these guys really know their chocolate!  It really is chocolate heaven with sumptuous coconut bombes, chilli chocolate caramel hearts, rum chocolate cups, salted caramel cups. (I'm sorry I had to stop to mop up the drool.)  The staff are incredibly knowledgeable and give excellent advice on what kind of chocolate would suit your tastes. The charming and enthusiastic Liam was amazingly helpful and also full of the kind of knowledge (such as, did you know chocolate was actually a savoury dish??)  that I lap up. He also let me taste some of his home made chocolate cake which made him my favourite person yesterday.   If you buy a gift of chocolate and need some help choosing this place is perfect and there's nothing to stop you buying some treats for yourself when you're in there!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wk-QmrbyCtGD23oIhMP44w"
  },
  "9odOKe_cx_wdJxeSeG-bpA": {
    "date": "2/9/2012",
    "text": "Great product, great shop, friendly staff.  I was never really a big chocolate person until I got into Hotel Chocolat's stuff, but then they don't really do your 'usual' chocolate.  They're not cheap, so if you're looking for this then don't even bother, but you certainly get what you pay for. They have a massive range in store from your basic pure chocolate right through to random chocolate pasta and suchlike!  The store also has a coffee counter. I tried a tea made from cocoa husks, which was nice, but on hindsight I wish I'd tried the 'liquid chocolate' which looked great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gJmnj8zDHvvpCjbl3qmdtg"
  },
  "TLyHeDbRmgUbnp1OVbfPWQ": {
    "date": "2/9/2012",
    "text": "Having heard lots of Hotel Chocolat, I still wasn't sure what to expect from a visit.  Ok, ok I was invited to an event and everything I drank and ate was free - but I and other yelpers really enjoyed ourselves and the price list too was completely reasonable.  The front end of the shop is piled high with as many different types of chocolate as you could imagine - not overpoweringly valentines related either which was nice.  The back half is a wee cafe, with the most reaonably priced coffees, teas and of course hot chocolate!  The chili chocolate, like Nadine was my absolute favourite and like Nadine, I am still thinking about it now and regretting not buying a tin to take home with me!  Also after lovely sampling, picked out some chocolates for gifts and was delighted at the reasonable prices.  Would recommend for a pop in during shopping to grab a drink and also for pickng up nice wee/ amazing presents for mates.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z1STeIy0AqI86F4UyFwScA"
  },
  "4zvdyLiKc69RMaKpnVpsDg": {
    "date": "5/31/2015",
    "text": "Such good chocolate.  Like actually, I didn't go and sit down at their cafe to drink any chocolate beverages or anything, but the chocolate that I bought was incredible. They have so many different kinds of chocolate to choose from in all sorts of different shapes and sizes, and everything that I tried was incredible. Really, this store is on my top chocolate stores ever list. I love it.  The prices are pretty fair, not too expensive.  The people at the shop are so so nice and really helpful.  This store is also in a great location in Edinborough, right near everything.  Wish I could come here every day.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "E4IU8wF7DsJwWuqpFS0Ylw"
  },
  "yGqEGQgRU4HGbZSvieumzg": {
    "date": "12/20/2016",
    "text": "Service was very nice here. Good shop with an eclectic mix of specialty chocolate. Their cafe is small but d ohhh seatings. I got their traditional hot chocolate with whipped cream. Holy monkey it was indulgently sweet. It's not my cuppa tea but I guess the chocolate was good. Go here if you love chocolate. I should've ordered something less chocolatey since I don't love choco that much. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-cJiZY_vQR6iQcpagSHLNQ",
        "caption": "Photo of Hotel Chocolat Cafe - Edinburgh, Midlothian, United Kingdom. Traditional hot chocolate",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-cJiZY_vQR6iQcpagSHLNQ/o.jpg"
      }
    ],
    "user_id": "2dg0QkY_d4sG9gbsHsCvwQ"
  },
  "tuEPYKNvL4BjVLyQdvSHBA": {
    "date": "11/30/2015",
    "text": "If you want to go to chocolate central, this is the place to go! Right smack in city centre is an awesome chocolate store called Hotel Chocolat!   They sell loads of different types of chocolates. You can buy chocolate bars, chocolate filled with fruits, ganache, and cream, as well as assorted chocolate boxes. They also have seasonal flavours which I appreciate because at least I know the company stays with the changing trends of chocolates.   Other products they sell are things you won't normal expect up find in a chocolate shop such as body products with cacao, perfume, and even pasta!   In the back of the store is a small stylish cafe that sells many different types of hot chocolate. They offer different types of flavour based on the season as well.   The staff are friendly and helpful, always cheerful and offer free samples! Who can turn down free chocolates, while buying some?! Check out the store's discount offers especially during special occasions like the holidays!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "F4s0ktwMOp3TpbbWkSOU9A",
        "caption": "Photo of Hotel Chocolat Cafe - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/F4s0ktwMOp3TpbbWkSOU9A/o.jpg"
      },
      {
        "img_id": "JmfNL1iZEpgxg9xilUrAdg",
        "caption": "Photo of Hotel Chocolat Cafe - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JmfNL1iZEpgxg9xilUrAdg/o.jpg"
      },
      {
        "img_id": "ZlZp5OX7VZCeKk_4p-HojQ",
        "caption": "Photo of Hotel Chocolat Cafe - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZlZp5OX7VZCeKk_4p-HojQ/o.jpg"
      }
    ],
    "user_id": "LMkFulPXQHRGMAaJSPUyVg"
  },
  "LUVURtoLjnm97wUmiySPBQ": {
    "date": "8/18/2016",
    "text": "I had no idea that Hotel Chocolat had their own cafes, until I was in Edinburgh back in July and went on Yelp to look for a coffee place nearby... and found Hotel Chocolat Cafe.  The cafe is really tiny and located at the back of the actual shop. It's not the cosiest of places, but it's alright, and the staff were really lovely and helpful.  I had one of the classic chocolate coffee latte with coconut milk, and oh my days, it was incredible. So so chocolatey, but still with a nice coffee taste to it, and not at all too sweet. I also love that their go-to plant based milk is coconut milk, rather than soy. it works really well with the chocolate.  They also have a few pre-packed small brownies and cakes, but from what I saw the only vegan alternatives were the nut/seed bars. Their chocolate drinks are very filling though, so you don't really need anything to eat with it!  I loved the chocolate coffee latte so much that I went two times to their cafe in London when I was there... Crossing my fingers they'll open a cafe in Glasgow as well!  As for the shop itself, I'm a big fan of Hotel Chocolat's chocolate. They have plenty of vegan options, and they're all incredibly delicious. It's expensive, yes, but you get what you pay for.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DQG1sM5G0NuDgTmmpMtaTQ"
  },
  "Y6OlpL9I_8MO2JxxM9uB0w": {
    "date": "3/9/2014",
    "text": "As a teen I overcame my bizarre chocolate allergy in dire circumstances* and have honestly never been converted to a chocolate lover.  That said, I can see what Hotel Chocolat is doing and I definitely approve.  I like the fancy range of treats on offer, they're perfect for sending home as part of a gift or as a valentine's day treat for my friends. The price is a little steep, but it's a quality product and from what I hear the quality is worth the price tag. They've also got some savoury chocolate food (pasta and pesto being the most notable) and, if I'm not mistaken, some cocoa based beauty products! It's all about the chocolate!  I went here to try the hot chocolate as part of Yelp's Hot Chocolate Quest and was won over. I had a cup of Jasmine and White Chocolate and woaaaahhhh. Just Woooooaaaah. That stuff is mad good.  Mad. Good.  It was quite sweet, so I would never be able to drink more than a cup but it was deliciously moreish and had a delicate flavour that I have already told quite a number of people about.  Our server, in the cafe area, was all about the bants and they must pump some kind of happy gas in there because he was so cheerful and lovely I refuse to belive he's real.  Overall, give yourself a chance to try the hot chocolate here - or at least get some chocolates for a friend. This stuff is fancy and worth it.  *They wouldn't give me anything but hot chocolate (and mucky soup) after countless hours in the freezing sea - no seriously - and when you're that cold and all your body wants is sweet sweet sugar you'll take anything to warm up ALLERGY BE DAMNED!",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "_PQUBfldi-N1QgmHV-YbJw",
        "caption": "Photo of Hotel Chocolat Cafe - Edinburgh, Midlothian, United Kingdom. It&amp;#39;s actually glowing with deliciousness! (Nah...my camera is just weird)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_PQUBfldi-N1QgmHV-YbJw/o.jpg"
      }
    ],
    "user_id": "KPY6FvT6h-r0W0HAC1Buag"
  },
  "p3sV2Pu57EX4FepW1zepBQ": {
    "date": "3/23/2014",
    "text": "This review is purely for the coffee/tea shop attached to Hotel Chocolat and relating to a HOT chocolate quest, finding the best hot chocolate in the city.  There s no doubt that for me the chocolate variations are a 5*, however, when it comes to the coffee shop I must confess I am less intrigued.  The service and the cleanliness are a 5*. We had a lovely girl serving us the hot chocolate and coffee. The interior and taste of their hot chocolate are ok, nothing special. There is not much space in the shop, but plenty of seats available for a small group of people. No windows, except the one on the roof, letting some light in. Brown leather seats are on either side of the walls. I believe they only have one toilet.  I ordered the normal white chocolate in a medium cup and paid 3.50, which I personally thought is extortionate, simply said - a bit over-priced.  Overall, it is a nice little shop attached to the Chocolate Shop and convinient during winter months to enjoy a cuppa.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "igjo-ATGNGeUeQm6cdhezA",
        "caption": "Photo of Hotel Chocolat Cafe - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/igjo-ATGNGeUeQm6cdhezA/o.jpg"
      },
      {
        "img_id": "ELN7rUTdgJ9ZyaGwieNUoQ",
        "caption": "Photo of Hotel Chocolat Cafe - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ELN7rUTdgJ9ZyaGwieNUoQ/o.jpg"
      },
      {
        "img_id": "D9NuFrVyoIlMzC4tplscYQ",
        "caption": "Photo of Hotel Chocolat Cafe - Edinburgh, Midlothian, United Kingdom. Interior",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/D9NuFrVyoIlMzC4tplscYQ/o.jpg"
      }
    ],
    "user_id": "s85sNAMlsrI0xCRvfj7Jrw"
  },
  "HcGZ_GqbNjuDgRdRYuOr0A": {
    "date": "12/26/2015",
    "text": "The best of the best! Their hot chocolate with whipped cream is to dream about. We don't have this decadent enjoyment in California. I will miss you! When in UK search Hotel Chocolat and experience this special treat.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Gyy6op83UqtcVmWlPDqrXw",
        "caption": "Photo of Hotel Chocolat Cafe - Edinburgh, Midlothian, United Kingdom. Classic Hot Chocolate... My favorite!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Gyy6op83UqtcVmWlPDqrXw/o.jpg"
      }
    ],
    "user_id": "ygHyFYbNq_GLaPrVADj6HQ"
  },
  "1qAbwuBp0P2JeUslYTv_kQ": {
    "date": "7/6/2013",
    "text": "What I love about Hotel Chocolat is the huge variety, as well as the super friendly staff who tend to be very generous with the samples! They have such an innovative range of chocolate combining really interesting flavours. Today, for instance, I had the gin, elderflower and cucumber chocolate! Their chocolates cone in all shapes and sizes (and prices) and they also have wines and ports that pair well with chocolates. Their port that goes with milk chocolate was delicious! They also have a neat home cooking items and I bought some chocolate pasta that I am excited about trying!  The best-kept secret about this place is that they have an amazing cafe area in the back. Their drinkable chocolate is to die for! I was surprised by how good the chili drinkable chocolate was, too, but I think the classic one is my favourite. I need to come back to try their mocha and other coffees!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "UDYA3KhHn-OdTbDdEkn2mg",
        "caption": "Photo of Hotel Chocolat Cafe - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UDYA3KhHn-OdTbDdEkn2mg/o.jpg"
      }
    ],
    "user_id": "vvQhikDPjAzHfSLVgnFkPQ"
  },
  "r7LKJREVs5OuJLubJYhJ5g": {
    "date": "3/29/2015",
    "text": "The best part about this place is how innovative their flavor combinations are, because although the quality is great, there are lots of places to get quality chocolate. The prices are high, but in this case, I think justified. It's a great place for gifts because everything is packaged well, and there are a few sales if you buy multiples.   There is also a cafe in the back, as many people here have mentioned, which is clean and tiny. The wi-fi didn't work when I went, but it was okay, as I didn't plan on staying long. Trying to be healthy this week, I got one of the cocao infused teas (tea leaves & cacao nibs) which, at 2.20 is very reasonable. The hot chocolate was 3.50, but when something is unique and high quality, it will be expensive. The flavors change, and specials are posted on the board.   The staff is great as well, attentive without being all over you.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nZu4D6PNQYTe39ggeNPfvQ",
        "caption": "Photo of Hotel Chocolat Cafe - Edinburgh, Midlothian, United Kingdom. Peppermint and Cacao Nib Tea £2.20",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nZu4D6PNQYTe39ggeNPfvQ/o.jpg"
      },
      {
        "img_id": "8DQLpf6lb15grwqzzF0gMw",
        "caption": "Photo of Hotel Chocolat Cafe - Edinburgh, Midlothian, United Kingdom. Hot Chocholate flavors and Specials Board",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8DQLpf6lb15grwqzzF0gMw/o.jpg"
      }
    ],
    "user_id": "03p8zXkWRammSu76kGzb6g"
  },
  "uPm71uKpToiCFIcADfLDBw": {
    "date": "1/14/2017",
    "text": "The hot chocolate was lovely and cozy for the winter season. However it's a bit too sweet and I would prefer a more bitter taste of the coco.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pWbwWora4fugDkSWMupqUw"
  },
  "odMD7YkVs8YLkGPBz_m8LA": {
    "date": "3/10/2015",
    "text": "Impressive chocolate menus, many interesting chocolates and I highly recommend their white chocolate drinks( delicious!!)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CE1j0DAn7CeZBDu3lPAqYQ",
        "caption": "Photo of Hotel Chocolat Cafe - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CE1j0DAn7CeZBDu3lPAqYQ/o.jpg"
      },
      {
        "img_id": "E2BlPXWaTsKcF7BFJlkQDw",
        "caption": "Photo of Hotel Chocolat Cafe - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/E2BlPXWaTsKcF7BFJlkQDw/o.jpg"
      },
      {
        "img_id": "wl6Zd8Sdmm1Vdsl_KCrzzg",
        "caption": "Photo of Hotel Chocolat Cafe - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wl6Zd8Sdmm1Vdsl_KCrzzg/o.jpg"
      }
    ],
    "user_id": "Icx1wlmGL9T-X4Oab1hW_Q"
  },
  "B89AYnk4FCtA1uD96IEi_g": {
    "date": "4/14/2014",
    "text": "This is one of the few places in town that, when you feel like you want to pig out and have a huge sugar hit, you can go to and be safe in the knowledge that everyone else in the store is feeling the exact same way.  Very nice touches include seasonal designs on their chocolates and offers and the staff are usually walking around offering free samples, which is always a winner in my book. For dark chocolate lovers, this little shop of high blood sugar levels offers 100% dark chocolate. 3 different types in fact!  The cafe is a lot more spacious than it looks which is always good because it looks tiny. I went for the salted caramel hot chocolate which was amazing. I'm not a hot chocolate connoisseur but I would say that a company that specialise in making chocolate that isn't mass produced crap are probably going to be one of the top dogs in the hot chocolate world.  Friendly staff, delicious smells and a huge abundance of sweet brown sugary goodness all around. Enjoy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "1cGu1Ml-NXDOT1kqvdG8sg"
  },
  "BZ4kcTxHUESCKdZSabswxg": {
    "date": "2/8/2013",
    "text": "Really friendly staff... Love their drinking chocolate... Several deals too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "eKc2gY6fPaQy3zNsbIYDvA"
  },
  "-hPHzSCezZOVmN5SpMqUoA": {
    "date": "2/10/2013",
    "text": "So glad that Yelp picks places like Hotel Chocolat for their event evenings!  We were able to sample praline hearts and peach and champagne chocolates, delicious. The gingerbread hot chocolate was very tasty indeed but the chilli was too spicy for me.   We got a hand massage trying out the new hand wash, scrub and lotion, makes me want to go to StLucia to go to their Spa!  I can see why it was a max of 20 people, any more and it would have been too busy.  The manager Mark Joyce is very knowledgeable and happy to help.  Been here a few times and really like the chocolates, my current favourite are the mojito truffles, I have to ration them to stop me eating them all at once!  This is top end of the market quality and it is worth it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rVEQ7nG4Bo7utMcqURxaIQ"
  },
  "PNrV_WVoOOwkmyz3WtUf9g": {
    "date": "7/24/2016",
    "text": "AMAZING coffee here, and the chocolate is incredible! Be prepared to pay a little extra for quality, but it is definitely worth it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JXkkd91ob2yIpSmUW9y9YA"
  },
  "Fx2wsd3c-TGnd8rgBk7mKQ": {
    "date": "2/8/2013",
    "text": "i don't even know where to start this review.  Hotel Chocolat is a magical place like a store version of Willy Wonka's chocolate factory but slightly classier and minus the oompa loompas.  but the chocolate....wow is pretty much the only way to describe it.  my first encounter with Hotel Chocolat was stumbling upon a shop during a trip to York.  i was so excited to see so many varieties of chocolate truffles available in addition to great big slabs of chocolate with various flavours.  i couldn't help myself and bought up about 30 worth of the selector boxes :)  my boyfriend was less than pleased with my lack of self control, until i offered him some....  when this wonderful shop opened in Edinburgh i was super excited!  the shop had all the amazing chocolates plus a little cafe to get chocolate based drinks!!  hello lover :)  i try to limit my visits as when i go into this place i tend to come out with a bag full of chocolate treats and a rather empty wallet.  but it's so worth it!  the salted caramel truffles are a favourite, but i've also enjoyed the purely praline truffles, and the bellini truffles with a hint of champange and a kick of peach, and the lemon berry truffles, and the millionaires shortbread, and well the list goes on and on.  my boyfriend says the whiskey truffles are marvelous and we both enjoyed the chilli ones.  i also have to say the gingerbread hot chocolate is maginificent!!  oh this shop, i can't stop singing its praises!  not only is the chocolate a delicious treat, but the staff could not be friendlier or more helpful.  i'm sooooo glad we have this lovely little haven in Edinburgh :)  when i've managed to demolish my latest supply of chocolates i will definitely be back for more.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Z_xbO-Iaxbx-ZRPhLJK-Ew"
  },
  "sygEdBWELEsIiSSr-V0nFg": {
    "date": "2/11/2013",
    "text": "Hotel Chocolat is a chocoholic's dream come True.  I'm not sure how this happened, but I have only been here once before, so when a Yelp event was organised, I promptly signed up!  We had the store to ourselves after shopping hours, and got a chance to sample some delicious hot chocolate with cardamom and another one with chili. Also there was a selection of chocolates to be tasted.  Hotel Chocolate makes the most of its space. There are wall to wall displays of chocolates with various fillings and flavourings on offer. It was so difficult to make a choice.. but I ended up buying a 250g variety box.  In the back of the shop there is a small cafe area where you can have coffee, tea, cakes etc.   The staff were very friendly and helpful. If you are buying a gift, this place is great as the chocolate is of high quality and the packaging is very elegant.  They offer something for everyone! e.g. if you are concerned about eating too much sugar, fear not - there is a 'Less Sugar more Cocoa' selection available.   I will be back... :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "yuFHrb8YQtVuzu0eEXvJtA"
  },
  "MvV-Mh3Zdl9ZEJyW0snBjQ": {
    "date": "2/8/2013",
    "text": "Admittedly, I am somewhat of a self-professed food snob. I walked in to a tasting even here last night, and was excited to see so much chocolate, presented in such a minimalist, classy manner. The service at this event was superb, with extremely attentive staff, complimentary prosecco and a soothing hand massage using cocoa butter and cocoa nibs.  I have come in here previously and bought the pistachio pralines for myself, and the eaton mess slab for my boyfriend (he's more of a white chocolate kinda guy). They were both nice, especially the pistachio pralines, though the actual chocolate was not perfect. Looking at the ingredients, there are just as many mysterious ingredients in this chocolate as there are in well known brands like cadburies, if not more! Hotel chocolat still find it acceptable however, to sell a box of chocolates for 58.   The chocolates we tasted at the event were good, though I wouldn't describe them as luxurious. I particularly like the lemon one and the heart stuffed with cashew nut butter. The hot chocolate, I must admit, was a let down. I am used to thick Italian or Spanish hot chocolate, or at least hot chocolate with more of a rich kick. The hot chocolate here felt quite watery in comparison.   Though I felt as though there were quite a few gimmicks which used cheap ingredients dressed in fancy packaging (reassurances to those who have more money than sense, maybe), the dark chocolate at the end was serious stuff, was made of very natural ingredients and had a very strong taste. This is the kind of stuff which is worth good money. I especially liked the dark chocolate with a touch of chili.  All in all, the service here is wonderful, the staff are extremely pleasant, but the chocolate (for the most part), I feel, has a lot of pretensions to live up to. If I really had to spend a lot of money on good chocolate, I think I would go to the chocolate tree in Bruntsfield, where the ingredients are very natural and made on the premise. If I had a really bad sugar craving, I would go to buy an unpretentious bar of good quality milk chocolate, instead of buying commercial chocolates in disguise at hotel chocolat.  That said, do try it and I especially recommend the dark chocolate. Hotel chocolat also offer some quite unusual goods, like chocolate pasta and cocoa infused balsamic vinegar. I didn't try these but it's tempting, just for the novelty!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "HvQ576LJm6i6QZuTwl7WVg"
  },
  "XJgiHATXBM2u5Ja3D19NmQ": {
    "date": "2/8/2013",
    "text": "Hotel Chocolat is easily my favourite Chocolatier in Edinburgh!!  I have been in numerous times before, either for some delicious chocolates or for a coffee, and ive been a fan for quite a while, so when i saw their was a Yelp evening, I thought yaaaayyy!!! .......What a great evening! We were allowed to have a nosey around the shop after hours and, i am not joking when i say i could have bought everything! We were treated to a selection of chocolates, ginger hot chocolate and chilli hot chocolate that was just divine! I was then treated to a luxurious hand massage with their new range beauty range! ****happy carolann***** The staff were fantastic and Mark the manager was very helpful, when picking special chocolates for a gift!! I love love all the Yelp events, but I think this could be one of my favourites!!  Thank you Jenny and Hotel Chocolat for a srummy, wonderful evening :)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AnXbqBBa4tZ21RbPWpKoqg"
  },
  "_3Xm_17UQvVesL3744z8Xg": {
    "date": "12/31/2012",
    "text": "I've become slightly addicted to Hotel Chocolat. It is pricey but the great quality products are addicted and they do great truffles - I love the Kir Royale truffles.   There are usually samples of sorts to try, there are GF and vegetarians chocs and sweets and students - flash your card to get 5% off your purchase.  There is a little cafe at the back - the hot chocolate (real melted hot chocolate!) is pure luxury and delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "frthTngbBHgSdk4j85HmEQ"
  }
}