{
  "QNf5g0MZo6JMUNfmD5R88g": {
    "date": "9/9/2015",
    "text": "Had diner there last night........short walk from our hotel. Wonderful place, people and food. Not overpriced. We will be back while in town. I had a dark chocolate sponge cake with a caramel type sauce that was incredible. Looks and feels like a very old traditional Scottish pub. Everything we had was the highest quality served by nice Scottish young people.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RbhHdnU8Uf681agToIjIuw"
  },
  "Jg-z-3r4iQ1vRbhtK5tCIQ": {
    "date": "6/28/2015",
    "text": "Amazing atmosphere. Amazing food. Amazing live Scottish music. Amazing drinks. Came in with no reservation, made a reservation there & only waited 30 minutes. No problem, because downstairs was a full bar with seating & live local music. Had the Haggis & natties, was amazing. As well as the Shepard's pie. You won't be dissapointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "njOIf2fBkdUJDaC0-LgB0g"
  },
  "W3oyes6VexnV2LV152dfxQ": {
    "date": "5/14/2010",
    "text": "My dad is obsessed with his Good Food Guides and Good Pub Guides etc, and so he'd read about this place and was always banging on about going next time he was up here visiting me.   I'm not going to lie, from the outside it just looks like any other 'old man' pub, and from glimpsing into the downstairs bar area on my way up to the bistro, that's pretty much exactly what it looked like on the inside too. The bistro bit though was a vast improvement, and the food was surprisingly good despite the stuffy atmosphere, and the set menu was really good value for money.  I'd definitely go back here for food again, but for drinks there are so many other places for drinks less than two minutes' walk away.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oEshN5oq98_g23MvEnRc5A"
  },
  "Jed3KR4wu3fFvocGcwtLNQ": {
    "date": "10/28/2012",
    "text": "Took a friend from Europe here to experience Scottish food. The food was FANTASTIC. The best venison I have ever tasted. Haggis, neeps n tatties great. It was everything I hoped it would be. Much more reasonably priced than most other comparable places in Edinburgh. Atmosphere, worn slipper. The reason they get 4 stars, not 5 I hear you ask. No friendly banter. The staff were dour and a bit humorless. This is not the Scottish Way. Cheer the staff up, get a 5. They get much more down A 3. The food. Fantastic.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2nzHJ0TaSsQX6lYuPlVjsw"
  },
  "9ZePpntHEln8DZJlpfyl5A": {
    "date": "9/14/2013",
    "text": "Really good food at the bar, friendly service and a good selection of malt whisky! Not too busy because it's off the main tourist route. It's Edinburgh's oldest gastro pub  all in all well worth a visit! Five stars from me!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hlR0ilgmVljKRU6aqkymUA"
  },
  "K2hC0EBwcvFmxgW1ZguZ6g": {
    "date": "5/2/2010",
    "text": "Whenever the train I'm meant to be getting in the evening is delayed I usually end up in here - it's very handy for the station and never very busy, those are probably it's only two discerning features though. The bar is the kind of faux traditional that a large percentage of Edinburgh's pubs are, it's cosy enough but not particularly welcoming or friendly. The aussie barman generally looks like he can't be arsed and would rather be somewhere else (Sydney perhaps, with a schooner of Toohy's New), to be fair I don't blame him as this place seems to attract more than its fair share of confused tourists. Mostly though I am irritated by the price of the ginger beer: it costs near enough the same as a pint of ale, which in this day and age of responsible drinking is wrong wrong wrong.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mJJj_SZff6MEWG5Vx1r8Bg"
  },
  "sXAzHP1hiOuymUrrnV5Faw": {
    "date": "11/14/2009",
    "text": "I had a pretty good experience at the Doric.  Yes, the restaurant is upstairs and you have to do a little exploring to find the staircase.  The food was decently priced and the beer was pretty good.  Service was fast and helpful.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "mZokz37TaR5jFgMrx4WyFw"
  },
  "a6IV4TYHDXG3-MH7HYn9yw": {
    "date": "5/2/2010",
    "text": "I didn't find this pub particularly appealing from the onset- to me it seemed like most other pubs in the area- traditional, touristy and over-priced all in one.. I was pleasantly surprised though- this is not your usual tourist haunt. The food was great, the service was speedy and the atmosphere was lively. I'd go back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cqecqnFK2eu88VtKJLHpiA"
  },
  "xjYldkD9AutvowYZDwYHQQ": {
    "date": "12/7/2009",
    "text": "Best Pub meal I have had in a long time and with great service. Great price on their set price 3 course menu. Very highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oLJkRRTmQl8pUZQi_6VzsQ"
  },
  "AZ4a2j6mVLpO2FyTV4recQ": {
    "date": "1/17/2009",
    "text": "This is a classic Scottish pub situated near the Royal Mile. They have an excellent food menu. I first went here for a work Christmas meal and have been back a few times since. Their food is properly cooked not microwaved processed stuff you get at many pubs these days. They have a great range of ales which change often, along with all the lagers and wines you'd expect. There is a lot of history to the pub and you can see that in the decor, with the old wooden look. They have a restaurant with tableclothes and richer food but i prefer the pub area with the pub meals on offer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "l8gCfUNUdO64TtIv71UUaA"
  },
  "GZSh6REdcwYkx9cYxLOTPw": {
    "date": "12/9/2009",
    "text": "Best Scottish food in Edinburgh. Not your usual tourist trap.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9R7WCc8LIhQ1Ju1gK7CSgA"
  },
  "eW1BMC2rEi2rstvHFEgUqA": {
    "date": "10/31/2007",
    "text": "Traditional food but not much beyond what you'd get in any pub in the centre of town, only everywhere else tends to be cheaper!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1g9_rAfoKieVn64my3Awbg"
  },
  "hQrSuv0iRYBUxJR80Y0neQ": {
    "date": "10/28/2015",
    "text": "Love The Doric!   We came upon this restaurant after a day of walking in Edinburgh. Sat upstairs in the bistro, which was full of charm.   Started of with the cullen skink soup, which was amazing.  It was so good, I ordered this soup all over Scotland but never did find one as wonderful as this.  The fish and chips with mushy peas were just perfect.  The only problem was I was full from the soup so couldn't finish the fish and chips - not a bad problem to have.   My companion had the upscale version of bangers and mash - it was very tasty, and one of her favorite meals throughout the UK.   Next time we are in Edinburgh we will make the trip to The Doric - well worth it.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "z43-j_c9CnnARuULB7REqw"
  },
  "uKNBB3WiE3Nx0UZZkBj5og": {
    "date": "6/29/2017",
    "text": "Went to this place with my sister once we got off the Airlink from the airport in the afternoon so it was really quiet. The staff was really nice and let us put our luggage in a corner so we'd have more room. I had the shepherd's pie and it was really good. We also had their toffee pudding, which I highly recommend. It gave me warm fuzzies especially on a cold rainy day. Would love to come again if I had the chance as they have live music on some nights.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uszpPrliyRFubQ4TYXeqtQ"
  },
  "jfhs_3DnZpcHkxhRPdSuiA": {
    "date": "6/29/2017",
    "text": "We loved this place. The dining room is so cute, the food is very good, and the service was awesome. The dessert is worth it, sticky toffee pudding. I wish I could go back but we were in town only for a couple days before we had to leave to our next destination. Best food I have had so far on our 10 day vacation.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_QcptefEYUOk5kXxjokQsw"
  },
  "aj1S9e3KFJ3HkfLO-Op6HA": {
    "date": "7/21/2016",
    "text": "Perfectly mediocre. The stained menus and laminated wine list were cues. Filled with tourists and no locals, seems indicative.  The servers were kind and lovely, the food is an absolute meh, and the odor inside is off putting.  Our meal at Holyrood Palace and Edinburgh Castle were much finer and cost 1/2 less.  Pass on this.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "74Uu0igVLFtJ6lqUtsK5xA"
  },
  "NdUaJk7LD5PMVqpTkaKq_w": {
    "date": "8/6/2015",
    "text": "While traveling through Edinburgh on our honeymoon, we jumped into this little place before a show. Wow..really, really great food. We had been ordering fish and chips all over the UK but this place was the absolute BEST! My husband went for the shepherds pie and it was just as amazing. They also let me make my chips \"fancy\", which just meant truffle oil, but it was seriously good. I am jealous of the locals who get to have this place nearby. When we come back to Scotland, we will definitely stop here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "QgHd6NqcX19ViqUwiszRpQ"
  },
  "dYdGcknF0Q98_kNcCkjJHA": {
    "date": "3/23/2017",
    "text": "Exceptional experience. Food and service was stellar. Everyone in our party raved about their dishes. The slow roasted lamb shank was among the most delicious meals I've ever been served.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fK0NmMyfma2FPwSV47nAiQ"
  },
  "yAJYsA3Lp-fvX0zV8ZrhMA": {
    "date": "5/4/2016",
    "text": "Wonderful classic pub! Came here for dinner on our first night in Edinburgh. After a quick (but cold) walk from our hotel on the royal mile it was wonderful to settle in in a cozy pub. We did not have a reservation, but they were able to find a table for us and had a seat at the bar upstairs and ordered a pint and a glass of wine while we waited. The beer was delicious (theme for me in Edinburgh) and the people working there were very welcoming. The food was classic pub food and was top notch, we ordered fish and chips and shepards pie and it was perfect.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CDdF8GpNIjgZ19ofpcBswg"
  },
  "EOE5V44bKPuWc1lKNXujhw": {
    "date": "5/28/2013",
    "text": "This is a good alternative to the fast food/snack joints in the station if you have more time - the upstairs has a bistro with a somewhat random range of food from traditional Scottish options to burgers to tiger prawn linguine (which actually did contain a decent amount of prawns). It's all a little bit on the expensive side (seriously, when did it become ok to charge over 10 for a burger? Especially a pretty average burger like this one) - I'd probably be more inclined to go back if everything was 2 cheaper.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iP9NCp6If6YnlOc2QeDqeQ"
  },
  "PtCFMtBGt-ULrSpMhLmhBQ": {
    "date": "6/22/2015",
    "text": "Excellent Shepherds Pie.  The downstairs pub area is great for a drink and listening to their live music.  If you are wanting to sit down and have a meal the upstairs dining area can fit larger parties. (Ours was nine people) Their Malt Whisky Truffles desert is excellent.  Service was excellent as well as all the food we had.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hn4pHmGftnz5DECUmzqYZg"
  },
  "hT6fhszqFpcNhr2JlniJlg": {
    "date": "1/25/2015",
    "text": "it's a birthday, and he wants to party like it's his birthday. So where do you take 11 people in the depth of Christmas party-season when this should have been booked back in May?  Well, hurrah for Yelp, hurrah for online bookings (taking the painfullest of painful 'room for 11 people? No? Ok. Next! discussions out of the pain) and helped me narrow down the available restaurants according to the Silent Reviewer's specifications down to um, The Doric. So, our options were relatively limited, but it was such a good thing, in this case. It was a cold, miserable December night, the pub downstairs was heaving, the restaurant upstairs the same. But, all the meals were great, service was pretty damn prompt, with nary a person left without a drink too long, and our meals were all served together. With a big group, it's often that this fails, especially in the catering style poor quality party food that makes an appearance. Not here, and in fact, there was a non-festive menu still available to choose from that just made my heart sing - all too often the Silent Reviewer is left with turkey as his birthday meal option year after year. The fact he chose it anyway made it his choice rather than mandatory.   So good we're going back with another big birthday group - see you soon The Doric, see you soon.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "X2uF3C3YBD24xcgKA104Sw"
  },
  "UPdRGmLXVSjORtrzqdpeOA": {
    "date": "7/15/2013",
    "text": "Great Haggis, Sheperd's Pie, single malt Whiskey.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LPS3YJZik6UURsnTTYkhXw"
  },
  "vYbDnHbb_LXQbM69L-jCcg": {
    "date": "7/12/2014",
    "text": "I was in Scotland on vacation, doing some last minute souvenir shopping on the Royal Mile and I was at a loss. I was starving and I didn't think I had a whole lot of options for a decent meal. I figured that all of the restaurants in the area catered to tourists and would be overpriced and underwhelming.  My mom and I turned a corner and found the Doric. We glanced at the menu and decided to give it a try. It was worth it! The atmosphere was charming! The service was great! But the food... It was amazing! I had the Cullen skink for a starter. It was amazingly creamy, hot and delicious. My mother had fresh cut chips and a garlic aioli sauce which was great. I had originally wanted to start with the mussels but they were out of them that evening.  I had the shepherd's pie for my main and it was steaming hot and great! I highly recommend it. My mother had the vegetarian lasagna which she said was great as well.  If I'm ever in Edinburgh again, I will definitely return to the Doric!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "b_Q9tgADdmp2vGUSVnsecg"
  },
  "U5ETkPTT6_gpG8xQqjusFw": {
    "date": "4/16/2014",
    "text": "Amazing Sunday Roast dinner!  I saw The Doric listed in The Times 36 hours in Edinburgh and wanted to give it a try. We walked past and I noticed the Sunday Roast Dinner being advertised so we made plans to do just that and I couldn't be happier!  The bistro is upstairs and was quite quiet, but we did arrive as they were opening (at noon). The roast beef was cooked perfectly and the accompaniments were lovely. The staff were all also very friendly, kind and patient.  It's on my list of places to recommend in Edinburgh for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "3dH1t53lWCnyK8fvbdg_Qw"
  },
  "lD-sjxckXz9W0QYnO3zofg": {
    "date": "7/4/2016",
    "text": "Excellent pub restaurant.  Food was amazing and service was fantastic. We had mussels and salmon and it was delicious.  Leave room for a fabulous dessert.  Very reasonable",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F2UgrRPAFUXFCdpainc3qQ"
  },
  "dnLHlkZZzUi9pahWehP_wQ": {
    "date": "8/2/2016",
    "text": "Nice atmosphere (I did not expect to hear Sinatra) with reasonably priced food and beer, including many gluten free options. Generous portions. Service was a bit spotty, but a solid meal near Waverley station.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fEo1C7GJlK8HlfRfNouLbw"
  },
  "ACNvhujfTBfTbIZCTt_O0g": {
    "date": "5/1/2010",
    "text": "This bar made me laugh a bit, being so close to all sorts of \"young\" stuff, like Emo's and polar opposite City nightclub it's filled entirely with a very middle aged crowd who look like they've been in there for many, many years. Not rough, just look like people's Mas and Pas and you half expect everyone to have a scruffy dog by their heels.  When me and a friend walked in it was like we had intruded on someone's personal party and everyone standing at the bar and sitting in the windows turned round and stared.. Who are these people and what do they want?  Needless to say, after the excitement of the idea of strangers being within the walls, we did have a jolly nice pint and left before the overwhelming heating system melted our young faces off.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eG0RhxR41jKsLJ6y3OQrwA",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eG0RhxR41jKsLJ6y3OQrwA/o.jpg"
      }
    ],
    "user_id": "rJi2YPK6uj4FtE8R7OFQcA"
  },
  "rXpexldoIrIM0-rwb3eDew": {
    "date": "8/22/2016",
    "text": "Excellent food, service and location.  This unassuming restaurant delivered on all aspects of being a great place to meet, eat and socialize. I really enjoyed the deserts and coffee beer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ADl2y1QKlZgSNI6B4wRvCQ"
  },
  "fitCI0wWHtL8jJ8KfdXNig": {
    "date": "6/23/2012",
    "text": "The Doric markets itself as Edinburgh's oldest Gastro Pub and it may very well be True but what one finds there today is at least not what I would call a Gastro Pub.  We started the evening in the downstairs pub part and it can't say we enjoyed it that much. Went up to the bar to order- asked for the selection of ales on tap. Did talk a bit to the bartender about the different ones and I asked for a recommendation with the response that she does not like beer so they all taste bad to her. Honest but not very helpful, we did however go for a pint of some local ale that was alright. The bar downstairs did however not really feel as if it had anything to do with a place that even tries to call itself a Gastro Pub (slightly worn, both guests and the chairs and tables and not very clean)  After the first pint we went upstairs instead and there it looked more like a traditional pub dining room. We were quickly shown our table be our waiter and given menus. Started looking at the selection and I was getting my hopes up. Some of the dishes did sound very nice. Wine list was a bit disappointing as I struggled to find anything by the glass that I wanted. Eventually went for a Shiraz that was not bad but still not what I had in mind. In general I would expect better from a Gastro Pub.  Back to the food - I went for the soup of the day. The day in question it was some sort of carrot soup. It was fairly good, a bit too sweet for my taste but not bad at all. The others in the group went for the Haggis spring rolls and the Confit of Duck Leg. The Haggis spring rolls were disappointing, nothing made better by putting Haggis in a spring roll. The Confit of Duck Leg was good but the marmalade and brioche accompanying it did not really match it.  For mains we also went for a few different choices. I went for the pork chops and the others went for burger and the Fillet of Sole. It was clear that I made the winning choice - the pork chops had been well-prepared and they were flavorful and grilled just the way they should be. The side of mash and vegetables were  however not given the same expert attention. Vegetables were not fresh and the mash did not feel as if it had been made recently. Still the pork chops were good. The burger was your standard pub burger so the type served anywhere - not bad but not anything different than what one can get at most pubs. The Fillet of Sole was ok, small piece of fish but it came with nice spinach and potatoes but it did not really have a lot of flavor and taste.  All in all it was ok but not great. Still give it a 3 rating since the food was above average but it is a bit misleading to call themselves a Gastro Pub.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sZ3mumX9WjJqp6qrjPPUBQ"
  },
  "-KebELj4029XNJSKA58OAA": {
    "date": "5/12/2010",
    "text": "The Doric is apparently \"Edinburgh's oldest gastro pub\", and it sells its legacy to the local tourists. Within, it's a nice warm tavern, complete with ales aplenty and stodgy food on the menu.  It's always been quiet enough when I've visited but that's usually when I'm waiting on an early evening train. I'm unsure what this place is like at the weekend but I can imagine it being a lot busier, with functions and whatnot. Seems to attract an older crowd who seek out its own brand of peace and quiet.  They offer homemade pies, Sunday roasts, 2 courses for a tenner, and the food is good nosh. Along with catering for my gastro belly, they have a couple of pasta dishes available on their A la Carte menu which will be suitable for vegetarians.  Traditional in a modern, pub grub kind of way and certainly more serene than the sometimes uptight Edinburgh cocktail scene, the Doric is great for a meal and a catch up over a few cold ones.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "W1Yq4OiwPsCmGFN6K8oJMA",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/W1Yq4OiwPsCmGFN6K8oJMA/o.jpg"
      }
    ],
    "user_id": "5iRCT4uAsyP1UoEUoxbylA"
  },
  "q3vgwT2-EKUGZxLQoSeA-A": {
    "date": "4/2/2012",
    "text": "For the start of a friend's Stag Event in Edinburgh, we met at The Doric. Mostly because it was right next to the station and people were arriving before check-in at the hotel. Since we arrived the night before, we were in charge of being first here.  It's clearly a pub that people go to because of its proximity to the station. After I got in, got a drink, and sat down, a huge group of guys on another stag event came in with their bags. It was about 1:30 pm, so clearly they just got off the train and couldn't check in either, so hit up The Doric for beer.  They did have a tasty selection of beers. The best in my opinion was the coconut porter, which wasn't overly coconut flavored, but did give a nice hint of coconut after you had a sip.  Once more people arrived, about four of us went upstairs to grab a bite. The restaurant seemed nice, and the menu looked interesting. Two of us had the cheeseburgers, one the haloumi stack, and one the macaroni and cheese. We also split some haggis spring rolls, because when you're in Scotland, you eat haggis.  The food was a major disappointment. The haggis spring rolls were literally just haggis inside of a spring roll wrapper and deep fried. No Asian influence at all. Maybe some cabbage or sprouts or something would have been nice, but no, just haggis in a wrapper. The burger was a major letdown. They made it seem so spectacular on the menu, but it was just a boring burger with boring chips. The other half asked for some of my ketchup with his macaroni and cheese, which is clearly a bad sign. Bland on bland.   But the pub was good, the beer was good, and a good time was to be had by all. It was a nice kick-off to our night of drinking.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t8aJIHxkutRlWMRNSvpq6w"
  },
  "NJu3IMMbCb21veGOc6JQzA": {
    "date": "3/14/2017",
    "text": "The oldest pub in Edinburgh! Like the ambiance and the vibe from the restaurant. The haggis Bon bons were a great introduction to the Scottish comfort food. I had the fish and chips and my husband had the shepherd's pie...it was ok. It wasn't the best but on par with the run of the mill ones I had in England. Don't forget children are not allowed in pubs after 9 pm! The dessert toffee pudding was ok.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "C7j1t1mRiTuuzRi6mFsmVQ"
  },
  "blSnsJzv1s1yIX_hX-4hHw": {
    "date": "8/23/2017",
    "text": "The Doric is a great place to eat.  Best fish and chips!  First time trying Haddock and loved it!  Great atmosphere!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bYCmcrv08cHiCtQx8OpSpw"
  },
  "3XhHM8vUGTJmDuss0S52yw": {
    "date": "7/14/2017",
    "text": "Got a table right away, the lamb shepherds pie was just delicious but very very warm! Just enough seasoning. They were pretty busy so service was a little spotty but we weren't in a rush at all. The bartender when we arrived was a very friendly guy and talked us into eating upstairs. So glad we did because that lamb was just absolutely delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n0mz-2k7GZl65Djtmcqz7Q"
  },
  "18cru5ek2w2tx_zB1p_Icg": {
    "date": "2/8/2018",
    "text": "Do not miss this spot.  One of the greatest steaks ever and Shepard's pie....incredible!!  Only here for 3 days in Edinburgh and so many great options, but may just revisit!!!  Lovely, amazing, cozy, delicious!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aGNR9vP-aNxrO_ur0vHe1g"
  },
  "-79ZDeESIZNNiy0_pjWv3w": {
    "date": "5/6/2017",
    "text": "Emma was our waiter. She was kind, resposive, friendly. I had fish and chips, really tasty, will repeat in a heartbeat. My boyfriend got pheasant which was ok. Beer was really good, Edinburgh gold.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UYeaYB5jsRTQe3D3fulgeQ"
  },
  "ck-vs3kk7UU4DlK6qmCy7A": {
    "date": "10/8/2013",
    "text": "Servers are uber friendly here. Very nice! Here's the quick and dirty.  Pros- Delicious haggis bon bons, yummy side salads, the beer and cider selection was GREAT (hello kopparberg!), and the pig's nose whisky was fantastic! Great service. Responsive and chatty servers that can put a smile on your face.  Cons- Why was my table so sticky? It needed a good wipe down. Macaroni and cheese was kinda oily...as in the oil wasn't blended well into a creamy cheese. It was kinda separated from the rest. Asparagus was overcooked.  Bottom line: I'd come for the drinks and haggis bon bons!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "K5UHLEadijlcXeT1NQ0V4g"
  },
  "dWrDyIWgrhb-n-bSnvqgpg": {
    "date": "8/3/2016",
    "text": "Cousin who travels to Edinburgh several times a year for past 25 years said this is the BEST fish and chips in town.  I agree.  The batter is thick, golden, and delicious.  Large pieces too.  The waiter asked if we wanted to try their haggis as they were well known for that.  So we also tried their haggis.  Delicious!!  I am a haggis snob and this haggis was near to the best I have ever had (no one can beat homemade from the St. Andrew's Society Ladies from St. Louis).  The potatoes and mashed turnips were very tasty too.    This is a pricey place.  Nearly 12 pounds for each dish for lunch.  Beer 5 pounds.  There is a children's menu.    Pub is ground floor.    Restaurant 2d floor with no lift.  Toilets on second floor.    Waiter super friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sfR0DIqIacM3YIyiFyKN4A"
  },
  "UkgezU-nwpuXtgP3VDg8Pw": {
    "date": "7/16/2017",
    "text": "Had a three course meal and would recommend them all! Had shepherds pie as a main and it was delicious! Would definitely go back! :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I1ZKRqw7dP3SfV6gbdqXZQ"
  },
  "ZEVlnqDeWVnVMmTFWR-Jvg": {
    "date": "12/11/2015",
    "text": "Great pub near the train station. They had yummy food and an awesome extensive beer list. I had the fish and chips then used the beer list to start exploring Scottish craft beer. Will come again when using the Edinburgh train station.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LWtuGXaFOyAHuhrj1yH25Q"
  },
  "ve0WnLwzKrfo-fdtmg8NCg": {
    "date": "11/3/2016",
    "text": "First stop on our week long journey, everything else will have to compete with this place! The haggis was rich and tasty! Will most likely be coming back before we leave!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BmnDFxQ0RIJm7qrJ9MMwKA"
  },
  "CUPjq1qhwus3uJOmyAzfVw": {
    "date": "1/24/2016",
    "text": "I had the venison, my wife the tiger linguini and our son the kid menu for lunch. Everything was great, though I would say that the venison is a little bit pricey. The service was very friendly and quick. We also had white and red wine by the glass which were also quite good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uq3K0bSe2_uRAnhHGrdNJQ",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. Bar upsrairs",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uq3K0bSe2_uRAnhHGrdNJQ/o.jpg"
      }
    ],
    "user_id": "iTrAqc836rxTS3NBwrk-rQ"
  },
  "BLivXkiZxSN2xSYVHddk8w": {
    "date": "1/20/2017",
    "text": "Great pub in old town Edinburgh! I'd make a reservation. The shepherds pie was absolutely delicious - quite possibly the best I've ever had. My husband tried the haggis & it didn't disappoint!! Reasonable priced, cute atmosphere. Totally recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "31tEgeWsx4DyQ7Ze0sN40Q"
  },
  "wcOVoCY10N2YCa_OHf8HFQ": {
    "date": "12/21/2017",
    "text": "Such a great place with amazing staff. Quaint, historic atmosphere and wide selection of beers. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4UDuCy3ubOA6iVgIdyG13A"
  },
  "Ws5r9I_vtFvreYhH2sZbiA": {
    "date": "1/16/2015",
    "text": "I ate a delicious hot smoked Scottish salmon pasta dish here. I really enjoyed it as a lovely way to taste some Scottish cuisine!   The dish included asparagus and artichokes, drizzled with a rich tasting balsamic vinegar. It was sprinkled with cheese too which was nice but would have been handy to know in advance as I'm not supposed to be eating dairy.   Overall a delicious, huge portion that id recommend!   The staff were friendly but the service was a little slow and we had to seek their assistance twice to hurry up our order and pay for our food as we were under a bit of time pressure.  A nice pub with a good bistro located closed to Waverly train station, so very handy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "t9LzSA-PN9FF0hiUwCafVg"
  },
  "T0W77NlJW7XMYX-zHG4UjA": {
    "date": "8/23/2016",
    "text": "Quick drink here! Good red wine and whisky here! Nice place for a quick bite too. Come here before the military tattoo. Right near the Royal Mile.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8mRouyd7M_5nUI0vyeyzbA"
  },
  "e6uN_aqqhmEBuxipWmj87w": {
    "date": "12/15/2015",
    "text": "This was my favorite place to eat/drink on our 2 week long honeymoon. The food was absolutely incredible, and I wanted to come here every day after.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "i3J3BR_umPat-Yo_9vwgMQ"
  },
  "DXztZLZSOpjKuA8AF3EUVg": {
    "date": "7/29/2014",
    "text": "Great fish and chips and shepards pie.  Nice dining room upstairs.  Woulda received five stars if they had malt vinegar for the fish",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cdczZe-kpbGPII6F9NfTmA",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. Upstairs dining room.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cdczZe-kpbGPII6F9NfTmA/o.jpg"
      },
      {
        "img_id": "UHDH1Oi86vJrX6thmmAsaA",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. After devouring fish and onion rings.  Tartar sauce is da bomb.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UHDH1Oi86vJrX6thmmAsaA/o.jpg"
      }
    ],
    "user_id": "2WRt4Nyl3t7MXSlVvKSRag"
  },
  "7YpPs55IEGoHAiuwTCgiPg": {
    "date": "7/27/2016",
    "text": "Came here on a recommendation from our hotel for a pub dinner night with my 4 kids.  I had the shepherd's pie which was excellent, and the kids had cheeseburgers.  The staff was extra friendly, made us feel welcome, and everyone enjoyed their meals.  The beer selection is decent and there appears to be a wide selection of Scotch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YpO_9YiHpKr0loxY2g211A"
  },
  "X7LEnmWzrs50Yxp0rKBPRg": {
    "date": "6/27/2017",
    "text": "Great friendly service on both levels and great food upstairs. Downstairs is more of a pub with great beer selections and a casual vibe. Upstairs, the veg gratin was stunning and just the healthy dish I was in the mood for. I'm not a vegetarian, but do have an appreciation for well executed veg dishes. This one is among the best. I'd go back for it again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nVhBK1RAYk8JMhbOUNfnqw"
  },
  "XBtN9duaPLMJBfwctO6OQg": {
    "date": "7/14/2017",
    "text": "First time having Haggis and I loved it! Also paired the meal with a \"whiskey beer\" which was to die for. Quite a nice place. Only downside was the cleanliness of the bathrooms.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gg2_3zjNzU1ZrXf6ueVb2A"
  },
  "DlnBOEJdQvfL6zVDi-vh6A": {
    "date": "6/25/2017",
    "text": "Best fish and chips hands down!!! It was lightly battered and the fries were crispy (my fav) as well!  My husband ordered the haggis & mashed and he said it was pretty good as well. He wasn't a fan of the orange mashed? I personally think it needed some vegetables   We also shared there famous toffee pudding and the cake wasn't as soft as expected but it was still delicious.   Everything was pretty good except for the service. I think they were all huddling around the bar area and we constantly need to flag them down.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4uiNerV37nZKwz3uly8MDw",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. Haggis",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4uiNerV37nZKwz3uly8MDw/o.jpg"
      },
      {
        "img_id": "yllXfevohTDRDuf_lHChFA",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. Fish &amp;amp; chips",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yllXfevohTDRDuf_lHChFA/o.jpg"
      }
    ],
    "user_id": "cBKEROUF8HFeO7rPBKb4Og"
  },
  "sxC4s4QHN8Zy1irkZCnWdA": {
    "date": "9/4/2018",
    "text": "I would absolutely concur with what was said. The service was crap. But if you go in expecting no service you can be a bit forgiving. The food... amazing. We had fish and chips and the fish was huge, the chips were more wedges   The beer not the usual warm beer that we had gotten at other places. In short, expect a couple of hours and hit this one. Be prepared to flag the wait staff a couple of times but give your mouth a treat.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0tuicLSSRM8eCyVhIG5QeQ"
  },
  "X2VxBA293SejCAcCSTHbgA": {
    "date": "5/16/2017",
    "text": "Tried The Doric based on Yelp reviews.  Wasn't disappointed.  The food is really good and the beer and ale selection is first rate.  I had, for the first time ever, an unfiltered cask ale.  That means they draw your pint right from the wooden cask. It was the most complex and interesting tasting ale I've ever had.  That bring said, I think all the unfiltered yeast, hops,  etc. kept fermenting with the rest of my dinner all night. Do be forewarned!  Other reviewers are right about the Shepard's pie.  It was great.  Only down side is that the service is uneven.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kp5lS_tgBMjAmDdr-JtcsQ",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kp5lS_tgBMjAmDdr-JtcsQ/o.jpg"
      },
      {
        "img_id": "jhVp7W9yk6s6RGAssKcesg",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jhVp7W9yk6s6RGAssKcesg/o.jpg"
      }
    ],
    "user_id": "cuoJmRVPK2zLYxLuw9foog"
  },
  "TGgkZUkWUsZYBJCxgBdJ-w": {
    "date": "10/28/2015",
    "text": "Came here on a rainy day in Edinburgh with three friends on a day trip. Very close to the Castle (down a lot of steps on a side street off Royal Mile).  Welcoming, cosy atmosphere, the bistro restaurant is upstairs.  I ordered the Salmon and capers (8) to start and the Haggis, Neeps and Tatties (10) for main. The salmon was great quality and fresh, although a little simple and unfussy (just a lemon wedge and buttered bread on the side). The haggis was lovely, well favoured with creamy mash and parsnips balanced the saltiness of the haggis well.  In all, a solid choice for a very hearty and wholesome lunch or dinner, right in the centre of Edinburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MAjISQUFBYS_8cFPpEas0A",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. Salmon capers and bread starter £8",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MAjISQUFBYS_8cFPpEas0A/o.jpg"
      },
      {
        "img_id": "E-gB3yMlkiLckiJEp5fuLw",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. Haggis neeps and tatties £10",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/E-gB3yMlkiLckiJEp5fuLw/o.jpg"
      }
    ],
    "user_id": "7Ro3UwVc4m264CckiwZLgA"
  },
  "K98RZuEah9bbKfdrziVuAw": {
    "date": "9/7/2018",
    "text": "Great locally grown food prepared in simple but tasty ways.  Beer menu is outstanding and service has is efficient and friendly.  Totally exceeded my expectations for pub food.  Must stop for visiting Edinburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bv1BoU66mPn-u5x5uzehUg"
  },
  "RXutzOyZboUQvRFkvESNAg": {
    "date": "10/13/2016",
    "text": "Had a lovely experience at the Doric our first night in Edinburgh.  Downstairs is a more traditional pub, upstairs a wine tavern and bistro. We sat upstairs and split a fairly priced bottle of Sangiovese.  We tried the Haggis Bon Bons to start and they were great! Traditional Haggis, balled up and fried, and served with Creme Fraishe sauce- a dressed up introduction to Haggis! I really enjoyed it.  Mum had the Fish 'N' Chips which were huge and beautiful! She said it was some of the best she ever had!  I had the Shepherds Pie which was divine! Pungent lamb and veggies, topped with superbly creamy mashed potatoes and lots of cheddar. Absolute heaven.  We had the Sticky Toffee Pudding for dessert which was another fantastic experience with this British dish. Definitely get it!  Servers were friendly and attentive, atmosphere cozy and classy, food divine, and prices fairly.  Definitely come here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "75d6uyKuLLXihkbmg6Tx4g",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. Fish &amp;#39;N&amp;#39; Chips",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/75d6uyKuLLXihkbmg6Tx4g/o.jpg"
      },
      {
        "img_id": "Gy0XtIbYBLCq5_05x3Czpg",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. Haggis Bon Bons",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Gy0XtIbYBLCq5_05x3Czpg/o.jpg"
      },
      {
        "img_id": "eNfCEoX80vH0Z-p5-1fKIA",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. Shepherd&amp;#39;s Pie",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eNfCEoX80vH0Z-p5-1fKIA/o.jpg"
      }
    ],
    "user_id": "ytt8UjH-gvH50GnNmXNokA"
  },
  "5odeLgxrgOe5qsltw4Mkog": {
    "date": "7/13/2018",
    "text": "So good! My wife had the shepherds pie which was very good!  I had the fish and chips which was amazing. Everyone serves it but it was some of the best I've had.  Good beer too! Good service as well and located easily at the end of the hop on and off bus tours.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ihhw6kQRiMJTMh1B7yrw3A"
  },
  "UtMZdPdXKFhSpZEB6_prdA": {
    "date": "10/23/2017",
    "text": "I had the shepherd's pie & the OH had the chicken with chorizo & butter bean mash. Really good sized portions & both very tasty.  Share a cranachan cheesecake for dessert. Delicious.  Friendly, efficient staff/service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R9UNH0rb3a_glQlk4ylKCw"
  },
  "PREGuIX25cFrRX_d731IEw": {
    "date": "4/20/2017",
    "text": "Rolled up at ~6pm without a reservation for food and drinks. Were seated straight away by friendly staff.   Shepherds pie was the best I've ever had and the fish & chips cured a traveling ex-pat of home sickness!   Be sure to start with the haggis bon bon and wash the whole experience down with the delicious ice cream dessert!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hGqaZo3a9JIT8ACDUtYvhQ",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. Perfect Shepard&amp;#39;s pie!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hGqaZo3a9JIT8ACDUtYvhQ/o.jpg"
      }
    ],
    "user_id": "o5DYuCAnMODVoedJ9eDO8w"
  },
  "nUkOOepxsHbL0bMhownKfg": {
    "date": "4/2/2018",
    "text": "We visited the Doric on our final night in Edinburgh. Cozy and delicious with a comfortable spot by a window, this restaurant delivered in both service and character. I ate the biggest portion of fish and chips ever and I loved every bite. I hope to visit again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5v6A0J40h4pxTBgoXSfQnw"
  },
  "n6beBpVyBF44_zwRRb2yCQ": {
    "date": "7/30/2017",
    "text": "I had bookmarked The Doric as a place to check out while I was planning our first trip to Scotland. It just happened to be across the street from Waverly....meaning easy to find, and convenient. I did not realize that you had to have reservations to eat there. I had not seen anything mentioning that online, but they were very accommodating and seated us as soon as was possible I think we waited 10-15 minutes for a table. No big deal.   Our meal was fantastic! 9 months later and we still talk about the shrimp and chorizo starter we had. It was one of the best bites we had in Scotland. If I could recreate that dish stateside I would...and have tried. But it was really the bread they served with it that was incredible. Thick crusty bread to sop up the delicious broth of the dish. Hubs had the haggis which was a first, and it was delicious. My fish and chips were tasty...but that shrimp and chorizo dish. I could have just had that for dinner.   We shared the sticky toffee pudding for dessert, and again....delicious. In fact, that started a love affair we now have with sticky toffee pudding. The only reason I deducted a star is because at times our server went missing, and even though they accommodated us without a reservation, it took forever to get our food. As though without a reservation you go to the back of the line for everything. Which, may be the case...but it just made for a long drawn out dinner after a day of traveling.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gz7rz4s7eNPZx2mqaFZjow"
  },
  "FGGrRV5GvgTFuUHtuj3j8g": {
    "date": "9/25/2017",
    "text": "Came here with my dad on a monday night, but they were full and we were told that there was a better chance of getting a table if we made a reservation. No problem, came back tuesday night!  I got the tiger prawn linguine and my dad got the shepherds's pie. Linguini was great, and I was glad to see that it came with plenty of prawns. Also sampled some of the shepherd's pie which was just as good  The real winner, however, was the sticky toffee pudding for dessert. I have had several, and none came close to the quality of the one offered by The Doric. Make sure you ask for a scoop of ice cream on the side as it is not normally served with it, maybe even two as a scoop was quite small. The ice cream itself had the consistency of butter, I wish I had ordered 3 more scoops...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2fTZKdtFoaPZxy0lkPj9KQ"
  },
  "_VGWgLtc3WG1NpDSfs092g": {
    "date": "12/9/2015",
    "text": "Just had a surprisingly delightful dinner here tonight and I didn't even know this is actually the oldest gastropub in Edinburgh! So it's also a place of historical significance!  FOOD/DRINKS- haggis Bon bons: crispy and steaming hot when cut open, served nicely with mashed turnips, straw potatoes, cream fraiche and a light salad. It was delicious. Prawns & chorizo: served with fresh bread, prawns taste shrimpy and fresh while chorizo bits are spicy with a kick. The chorizo was a bit salty, but was perfect with the bread. Mulled wine was delicious and warmed my soul.  AMBIANCE/DECOR- small restaurant with some bar counter seating, dimly lit, but not loud. Good for romantic date, casual dinner, and even an interview over dinner (like the two men to the table next of me tonight). The room was decorated with paintings and tables with candles.   SERVICE/STAFF- hit or miss. One staff was super friendly/helpful while the other one was only average and seemed a bit anxious/stressed out. When I entered the place downstairs into the bar section, the bartender saw me but ignored me. Good thing I figured it out soon enough...when I saw the door to the 'bistro' that I just walk upstairs!   Overall, I had a very pleasant experience and the food/mulled wine that I had was very enjoyable. I like the atmosphere and want to go back to try their other drinks and food items. Would recommend!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "h_w52oajEbnUNs-QVmGjsw",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. Dining table",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/h_w52oajEbnUNs-QVmGjsw/o.jpg"
      },
      {
        "img_id": "WSaaj7Iynl4LdtLgPoH42g",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. 1/2 pt mulled wine",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WSaaj7Iynl4LdtLgPoH42g/o.jpg"
      },
      {
        "img_id": "0IpOeOMcYe80_8eywl9TJw",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. Haggis Bon bons",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0IpOeOMcYe80_8eywl9TJw/o.jpg"
      }
    ],
    "user_id": "25EV693IB3n1q6hqshgALA"
  },
  "lwvQVmIC-aoV9wOdCpGYgg": {
    "date": "2/18/2016",
    "text": "Great location near the station, but you do kind of need to stumble upon it or know where you are going as it is just outside the touristy hustle and bustle of the Royal Mile. We went with a group of 10 and had to prepay 5 each to make a reservation, which then was taken off our bill. I just had the salmon started which was really delicious, although the bread was not toasted and quite dry which was a bummer!  My friends had many different dishes and all said it was great! Good place to know and I'll almost certainly go back, you can get some real typical Scottish dishes here when you have non-local visitors over that would like to try them.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BQIf844NQh3KURHS8Kpx7w",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. Filet of salmon",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BQIf844NQh3KURHS8Kpx7w/o.jpg"
      },
      {
        "img_id": "HoybkFUbyb3775GWB8oPGw",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HoybkFUbyb3775GWB8oPGw/o.jpg"
      },
      {
        "img_id": "aAKP8KxjDYXAYHpXIORp4A",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aAKP8KxjDYXAYHpXIORp4A/o.jpg"
      }
    ],
    "user_id": "QpnH7JOjbMAAaYw0IIt_Xg"
  },
  "PAhhHIwCTy2BQhlLx_7EUQ": {
    "date": "5/26/2017",
    "text": "Went solo, the location is nice, mixed crowd young and older, everything about the menu looked nice. I gave 3 stars because of the service and recommendations that were constantly out of sync and incorrect.  I wanted 3.5 stars but no option here   Beside this, the hot appetizer was well executed but not to my taste mainly due to an incorrect recommendation as outlined, the main course was excellent and again perfectly executed.   Overall an OK dining experience but nothing special for me.   Still, try it out, you might have a different opinion",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KQHb8qtX82EEqjx5Ytg57A"
  },
  "92sNIi0JJbpIGyqAiHc-dA": {
    "date": "9/16/2016",
    "text": "I had some excellent fish and chips when I was here recently.  I know it's not a very high quality type of food, but when it's done right, I really enjoy it.  They used beer batter for their fish (yes!) and it was crispy and cooked perfectly.  Plus  the chips were not too greasy.  And the tartar sauce was homemade and it was delicious.   A good selection of beers too.  I didn't get to try any of the other dishes but they all looked quite good.  If you're close to the railway station and want to duck in for a bite, you can't go wrong here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hwbBTEwHbR2k6kk-TNDQfA"
  },
  "DsAR3_hfwCEYuBS4uhZlNA": {
    "date": "5/13/2015",
    "text": "Passed a delightful evening forking away at my Haggis, Neeps, and Tatties. The Scottish national dish, as I was told, did not disappoint! The term that comes to mind is \"(Scottish) comfort food\". It was quite flavorful without going overboard in any direction. (Over salting is a big turn off for me)  Atmosphere was warm and friendly. I quite enjoy the upstairs-dining gastropub vibes~",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "GwGlMkbg6PjWlFIV0Y0L2g",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. Haggis, Neeps, and Tatties!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GwGlMkbg6PjWlFIV0Y0L2g/o.jpg"
      }
    ],
    "user_id": "MFDFghJuvERxE3HUa0eQjA"
  },
  "Tr6oJ3SnIl5OOlG1DH_Xzw": {
    "date": "7/27/2017",
    "text": "Really good place. The fries are so good and my bf really enjoyed their haggis. The service was on point. I would definitely recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "xAu9ixTFshx3hhbCDgZ67Q"
  },
  "i3tlQ2-OTUcxtYzEvINTPQ": {
    "date": "8/30/2015",
    "text": "The Doric is claimed to be the oldest traditional gastro pub in Edinburgh offering authentic Scottish food. I went for a pint of local Three Hop Lager served in a big mug with a handle. While in Scotland I decided to try  the traditional Cullen Skink soup served with a nice tomato foccacha and Haggis Bon Bons. I took those two starters as mains instead, and that was enough to satisfy my hunger.   Deep fried haggis balls are worth a try. I've tried haggis before somewhere else, but it wasn't particularly amazing, as the dish is normally served with potato mash and feels quite heavy, whereas here the haggis balls starter portion is just the right size to get the taste and feel you up.  The service is nice, I really needed to charge my phone and the bartender was happy to help charge it at the bar. It gets quite busy, therefore better to book in advance to avoid disappointment.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jt3w-gEVyfKUzfFdCrziTg",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. The view on The Edinburgh Dungeon",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jt3w-gEVyfKUzfFdCrziTg/o.jpg"
      },
      {
        "img_id": "kPjCz1OIFF28835vwKxE6Q",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. Scottish pints",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kPjCz1OIFF28835vwKxE6Q/o.jpg"
      },
      {
        "img_id": "EtvKsFzjA3Lmp6EwqKD9Yw",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. The traditional Cullen Skink soup",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EtvKsFzjA3Lmp6EwqKD9Yw/o.jpg"
      }
    ],
    "user_id": "yNz6YWwxNUI_ekxZvk3Hdg"
  },
  "iNmWMaH9fFOkmF6QhW6A_w": {
    "date": "9/13/2015",
    "text": "We came to this place for something to eat some Scottish good after the Edinburgh Castle and this place came up with good reviews...and it did not disappoint!   My friends and I split the haggis, the shepherds pie, and the fish and chips and I really enjoyed them all. I would have to say I think the haggis may have been my favorite, and it was my first time ever having it, but the shepherds pie was a close second. The service was great and everyone we interacted with working there were very friendly. Definitely worth a try!j",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-Ga_GM1Hz47U_-aK_kFk5Q",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. Shepherds pie",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-Ga_GM1Hz47U_-aK_kFk5Q/o.jpg"
      },
      {
        "img_id": "H8W_VT0FPZhiq0pAEy6OTw",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. Fish and chips",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/H8W_VT0FPZhiq0pAEy6OTw/o.jpg"
      }
    ],
    "user_id": "W_CaMYC7YVBScHvShbWMmA"
  },
  "YVh8XVVFmEmHfCkKWtz4Dw": {
    "date": "6/26/2019",
    "text": "Delicious entry into the magical food world of Edinburgh.  I am so thankful for the delicious food and beer.  My first taste of Scotland and will not be my last.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-YNY954juJGKYR_wT_pSIA"
  },
  "Ngi17P3ud9_q7KqRAQ2Vgw": {
    "date": "2/1/2019",
    "text": "Dan's boss brought us here - \"the oldest gastro pub\". This was a very nice establishment. The bar is beautiful. The service was excellent. I really enjoyed the Baked Vegetable Gratin. In the US, it may have been called Vegetable Lasagna. I loved the baked cheese on the top. Very delicious! The desserts were so good! We had the Malt Whisky Truffles and the Chocolate & Almond Torte. The black currant cider was fantastic.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9lYzPpZmoFOoQz6QkHjxNQ",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. Baked Vegetable Gratin",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9lYzPpZmoFOoQz6QkHjxNQ/o.jpg"
      },
      {
        "img_id": "7AXoM2RIAMeSWD7YmysWBA",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. Chocolate &amp;amp; Almond Torte",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7AXoM2RIAMeSWD7YmysWBA/o.jpg"
      },
      {
        "img_id": "ydXgNbbE9iByHlZzqG4hpw",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. Black Currant Cider",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ydXgNbbE9iByHlZzqG4hpw/o.jpg"
      }
    ],
    "user_id": "pmwCD7hH_7CTVX9lZKFz7g"
  },
  "CeGShK6Ne9-Dg583EngmAw": {
    "date": "3/28/2019",
    "text": "Omg the food was so deliciius, my husband ordered the Cullen skink(which he's still talking about) and the shepherds pie and he loved all of it. I ordered the fish and chips and wow, not only was it delicious but it was huge. We loved the place, only regret is we were too full to get some dessert. Great service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P_QpmY8Eql-5pYkUCrUGPQ"
  },
  "LVayf0B5jUv7_H6HHs98Ww": {
    "date": "4/6/2019",
    "text": "Y'all. This place. I had legitimately the best meal I've ever eaten here. The mussels were incredibly fresh and light and the trout was to die for. And don't even get me started on that mouth watering dessert! The staff were attentive and helpful. I'll be coming here again and again and again....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yOOnGW3_Ddl1m2D0OuAyVg",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. Almond torte",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yOOnGW3_Ddl1m2D0OuAyVg/o.jpg"
      },
      {
        "img_id": "vsE3F_GM4rz1RAnUJn157g",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. Wine",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vsE3F_GM4rz1RAnUJn157g/o.jpg"
      },
      {
        "img_id": "WxNuySSW1pidYf1HKJdxaw",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. Mussels",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WxNuySSW1pidYf1HKJdxaw/o.jpg"
      }
    ],
    "user_id": "bBfYco7v5-diPLJJ1NMwcg"
  },
  "rm1MBzh4S2FfVM6i7gRnGA": {
    "date": "6/5/2018",
    "text": "I read about this place in the NYT 36 hours column. Following instructions I came here for a beer and crisps. It as pretty enjoyable so I had a second Guinness and more crisps. The bartender was super friendly, and brought the beers over to me in a window seat after the proper Guinness pouring time. It was all it was billed to be.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xRQ2J90nmGNZZPmoMu3JHA",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xRQ2J90nmGNZZPmoMu3JHA/o.jpg"
      }
    ],
    "user_id": "TYl-kBZ7-1Ge1i_I-9idZg"
  },
  "5-lad2OHItAqx-b56WUTIQ": {
    "date": "3/12/2019",
    "text": "Delicious food, terrible service.  We would have loved to try the toffee pudding or even get a drink refill... but no such luck.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SzY8lGSlqjPIAFXMgsnExg",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. Fish and Chips",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SzY8lGSlqjPIAFXMgsnExg/o.jpg"
      }
    ],
    "user_id": "8ITPC-A97Vt3sV75CRZ_lA"
  },
  "HAujtCFmcz4uhG77ELsiyw": {
    "date": "5/7/2018",
    "text": "After an entire week of pubs, we were ready for a True meal at a non pub. This place was amazing! It is the oldest Gastropub in Edinburgh. My husband started with the cullen soup which was fabulous and the fish Iordered was cooked perfectly. The service was impeccable and the staff was super attentive. To finish it off, was a decadent sticky toffee pudding. We are still talking about our meal there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ah0grn3RVk2SH5qInEDBcQ",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ah0grn3RVk2SH5qInEDBcQ/o.jpg"
      }
    ],
    "user_id": "7bjqeUYnnwabXmjDBqzl6A"
  },
  "NkpmuiuyBKXrrNi-69ZG-A": {
    "date": "4/18/2019",
    "text": "Happened in on a Sunday for a drink.  Food served upstairs, so there we went.  Sunday offers include \"roast dinner\", which we ordered; and added on the soup of the day (apple/parsnip) and sticky toffee pudding. We also had the Traditional Cullen Shink and roasted trout. Everything was delicious.  Service was divine too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CQw5vEU0O93f66CAtP1Yxg"
  },
  "MKoQwGPLab-e4VVaeREeDQ": {
    "date": "3/1/2019",
    "text": "Really good. Bar downstairs, restaurant upstairs. Good beer selection. Food was very good! Friendly service. Clean. Charming. If your looking for classic Scottish food, try it. You won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qNEnzIuq3clHHThHQf8qrg"
  },
  "SiZxnxa0O_7Z1JAjOyG3pA": {
    "date": "6/5/2018",
    "text": "My first experience with Scottish food and I wasn't disappointed. I had the national dish - haggis neeps and tatties (like meatloaf and mashed potatoes)and enjoyed it. The plate came with regular and sweet potatoes and I wish there was a vegetable option instead. Haggis is more tender than meatloaf so I had to get used to the texture, but the seasoning was good. The pub has a couple different eating areas, but the one as you walk up does not allow children and the other goes by reservations first; so it may be wise to set one up - especially if traveling with kids.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DvMG8w8dM0MCrQV0pfAA5g"
  },
  "3tMkMq5RNWmaC9Gt1q1JBQ": {
    "date": "6/14/2018",
    "text": "Based on other reviews, I had really high hopes and was pretty disappointed.  We attempted to come for dinner the previous day, but were turned away since we didn't have a reservation - even though the seats were 1/2 empty - so we returned for lunch the next day.  We ordered haggis bon-bons, salmon, a burger, and mussels.  The mussels tasted \"off\" and we never got the bread we ordered.  The meal was OK, but we were dying for sticky toffee pudding at the end. . .which arrived burned.    On top of so-so food, the service was TERRIBLE.  We arrived and ordered well before the tables next to and behind us, but we had to flag our waiter several times to check our food, order dessert and even get the check.  When we finally did get the check, the total was over by about 10 pounds for food that we didn't even order - be sure to check your bill.  We stopped for lunch and had plans to walk the city for the day, but by the time lunch was over it was nearly 3pm.  I understand the folks move at different speeds, but there were only about 8 tables and we were struggling to get any attention - and we indicated a few times that we were in a hurry.  The Doric had great reviews, and perhaps we got them on an off day, but there are far better places to eat in Edinburgh for the cost and time it took.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AD3GI2lI6ZSjvB2nQe297g"
  },
  "gFQCXj3_cBeZYxY2K3WiBQ": {
    "date": "5/27/2019",
    "text": "Bar smells like urine and tbe staff is rude.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8KHqRwKr3fTMR4SLSTky7Q"
  },
  "4X5ReqOp3waovTVRCN3LTA": {
    "date": "6/11/2019",
    "text": "Great dinner. We had the smoked salmon pasta and chicken. Very delicious. The waiter was helpful in describing options and the bartender made a great Hot Toddy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_99jeQlG9ZiYBLBFEmyy1Q"
  },
  "FDor7RGveEJmtEZO_gMsXA": {
    "date": "11/6/2017",
    "text": "The three course meal is a nice deal, the food was overall solid, but service was lacking. We were hoping to do some more things around the city but the wait time between courses meant we spent over two hours there - almost an hour just waiting for dessert. Flagged a waitress who checked on the dessert but then went on break, so had to check with another waiter, while we watched many parties sit down, eat, and leave. Soup and vegetable gratin were good, fish and chips was meh, and the sticky toffee pudding was pretty amazing...would have been the highlight if we weren't just ready to get up and leave. Would have appreciated if they comped the desserts, or at least ...apologized for the delay?",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_B8ezs_5NHIZ7GkFjQGD7w",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. sticky toffee pudding",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_B8ezs_5NHIZ7GkFjQGD7w/o.jpg"
      },
      {
        "img_id": "LJT1t1NzX0tAzETFosy5yA",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom. fish and chips and vegetable gratin",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LJT1t1NzX0tAzETFosy5yA/o.jpg"
      },
      {
        "img_id": "ZORaahFGXrZ4U9_SJGCfug",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZORaahFGXrZ4U9_SJGCfug/o.jpg"
      }
    ],
    "user_id": "TYBH3yHMM320H7LdV9GPvw"
  },
  "Ff8IRKdBii9MHfL9ufWISw": {
    "date": "11/1/2017",
    "text": "Nice old iconic Scottish bar. It's right next to the Edinburgh Waverly Station and in an area of pubs & shops. We stopped in for a beer & enjoyed the environment. It's nothing spectacular but it's great if you want a pint or two with someone.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4kSgKtNZAlsuuS-EJtJevQ",
        "caption": "Photo of The Doric - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4kSgKtNZAlsuuS-EJtJevQ/o.jpg"
      }
    ],
    "user_id": "p2cjkfkpjf3LUu-ZLphF_g"
  },
  "tufTGEwSncM9qba5ydpucQ": {
    "date": "10/5/2017",
    "text": "We had our first lunch in Edinburgh here in The Doric. I must say it was a good meal.  I ordered the lunch menu, consisting of cullen skink, followed by the haggis. Cullen skink is an interesting creamy soup, which contains fish and leeks. I actually loved it, even though I forgot that I actually am lactose intolerant (I suppose it wasn't described as a creamy soup, and given that everyone in Scotland probably know what it is, there was no need for a description), and therefore headed to the restroom a few times after that. Nevertheless, I loved the soup, and would repeat it assuming there are close facilities nearby.  The haggis was interesting, to say the least. I didn't know what neeps and tatties were, which came with it, and turned out to be turnips and potatoes. Of course, everyone from Scotland knows what they are. The savory flavor was definitely interesting, and I would try it again if I had the chance.  The best part perhaps is the double espresso beer I ordered. Living in Germany, beers tend to be on the conservative side. So I definitely enjoyed this beer as an accompaniment to my interesting cultural meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uL-3W26bfqP54fENoj7b8g"
  },
  "KrdnCvjgwupl9XKjtd13oA": {
    "date": "10/14/2018",
    "text": "Charming place!  Shepherd's Pie was as delicious as my own homemade version!  Vegetarian lentil option was also delicious!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2xW5AyTYXkQ2Mlip0_2Cfw"
  },
  "ub1pyTdsixzkTlYHNBJ7Wg": {
    "date": "4/26/2019",
    "text": "Terrific food .Good burger ,kids had pasta .Steak very nice .Haggis good.Lovely meal for 3 adults two kids.Service good and friendly.Felt great value for meals and drinks .Thumbs up for pub food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zMZi7pMPaerGceQr-IDWgA"
  },
  "leu-ET9Ru5828v9IBssKdw": {
    "date": "7/31/2018",
    "text": "We started with a cider and gin and tonic. Both were great. The Shepherd's Pie was delicious, and my husband's Haggis Neeps and Tatties was great. We added mixed salads to have some veggies. We finished everything off with the Sticky Toffee Pudding and added a scoop of ice cream. It was decadent, but I loved it. You should stop in.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Px7E234RCv8SMSNixQRSxw"
  },
  "EjHAwt-pAffEXIOoOgfu6g": {
    "date": "4/15/2019",
    "text": "The strong smell of disinfectant, the view from the second floor of construction and garbage cans, and  the really unappealing location looking into boarded up buildings by Waverly Station made this restaurant a poor choice. Food wasn't bad overall -- I liked the chicken though my companion found the burger inedible. With so many great options, though, I would not come here!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KuyC5kex6m1BT9gpVa_0bQ"
  }
}