{
  "wBcEz0ZE7L60iTLjuiZa2w": {
    "date": "7/21/2010",
    "text": "This is something of a hidden gem. It wouldn't fare well if you were to judge on looks alone. It is run by a slightly grumpy Italian man who I assume is Marcella, he is never to be rushed so if you are eating in it may seem he has forgotten your order but he hasn't! The interior is decorated in plastic flowers, plastic fruit and blue tiling. However, I urge you to look past this as it all adds to the unique experience of Marcella and, if you are anything like me, you will learn to love the quirks of this establishment.   Serving big plates of hot, tasty, filling food at budget prices is my go to place after a long, cold, grey Edinburgh day. A huge plate of pasta, garlic bread and a drink will set you back 5. If you want to splash out on a three course feast you won't be out of pocket by more than around 12.  As well as great pizza and pasta you should also try one of the many sweet pies and pastries he erves. Rather than going to one of the many coffee shop chains around, head to Marcella and get yourself a pie and cappucino for the same price as a skinny latte in a certan multi national coffee chain that shall remain nameless!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 11,
      "cool": 1
    },
    "photos": [],
    "user_id": "3XDGNCH155seEXyEQPMi_w"
  },
  "8TZCFBOrQtkDhIettM-VWw": {
    "date": "4/21/2016",
    "text": "This is a hidden gem, in an excellent location between Lothian Road and the Meadows. Angelo (not sure if Marcella is a surname, or somebody else's name) runs the place by himself, so you might be waiting a while for your order, depending on how busy it is, but you won't be disappointed. The food is authentic, delicious, and extremely good value!  We visited for a meal before a concert on Lothian Road, and were one of only two couples at the place initially. (A much larger group arrived just as we finished, so I'm glad that timing worked out!) I wanted pasta, so ordered a simple spaghetti bolognese. Mary ordered a pizza with a variety of vegetables. We brought our own bottle of wine, after reading previous reviews that suggested free corkage. BYOB is absolutely fine, but the corkage is NOT free. It cost 2 for the bottle of wine. However, it's fine, because the rest of the meal was very good value. That said, I am a little confused about the corkage cost, because I did not see any alcohol for sale on the menu...  The food, when it arrived, was excellent. The portions were generous, everything tasted great. We also had garlic bread as a starter and apple pie for dessert.  The decor of the place is very simple, nothing fancy here. There are nice pictures from Italy (mostly Sicily), and some AC Milan decor. Angelo certainly isn't very talkative, but he's welcoming, and makes good food. Recommended.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gKJUTFb6OlLYD-D0Lguvyg",
        "caption": "Photo of Marcella's Italian Bakery - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gKJUTFb6OlLYD-D0Lguvyg/o.jpg"
      },
      {
        "img_id": "ipHMJ8r15DLFWjaRC7Uhfw",
        "caption": "Photo of Marcella's Italian Bakery - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ipHMJ8r15DLFWjaRC7Uhfw/o.jpg"
      }
    ],
    "user_id": "RMOJLdLHdFai_ksWCMDOoA"
  },
  "chB388oi3T8_q2EHv2YX6w": {
    "date": "4/19/2012",
    "text": "This gem is quite a find. While I wouldn't neccessarily recommend the cakes and pastries, the hot food is divine and really cheap. I especially like the spinach and cheese pasta, (probably cheaper and more delicious than if you made it from scratch) my friend who ate the 'well known' lasagne said it was amazing. It's got kind of a kitsch and eccentric style but it's totally worth eating in here if you enjoy dining under a string of fake onions.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "1XAhcVNRi6CQOfM_0bCbng"
  }
}