{
  "po-_rt7fSsd1jzH_xXyIzA": {
    "date": "2/21/2016",
    "text": "On our first visit to Salt Cafe they were unfortunately fully booked with a few walk ins waiting at the bar before us as well. This tells you how great the place is before you've even visited, so we were adamant on coming back as soon as we were back in Edinburgh.   Ringing a few days before, we booked a midday spot for brunch on a Friday. And you know what, it's a good job we did, as it was still super busy when we arrived.   The menu consists of breakfast (served till mid afternoon so we'll call it brunch), and other lunch items with a range of specials available.   As part of the specials, there are regularly changing smoothie flavours. I had a blueberry, oaty, gingery thingy, and it was delicious. For food my boyfriend had a full Scottish with extra haggis, and I had eggs benedict with a sausage on the side. The food was absolutely amazing, and a special shout out goes to that sausage! Yummy with a capital y! Really good standard of food, good service and a cosy atmosphere inside. It's the kind of place you could take the parents to, whilst also being suitable for a hungover breakfast with your mates.   Just make sure you book in advance, but it'll be worth it I promise.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SXJIEMIvj4YCq1uivKwP_Q",
        "caption": "Photo of Salt Cafe - Edinburgh, United Kingdom. Eggs Benedict (with a sausage extra)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SXJIEMIvj4YCq1uivKwP_Q/o.jpg"
      }
    ],
    "user_id": "4fYVFlntFi0YIFiYhEaQXQ"
  },
  "pvP27PUvSh6oMabasoQiqQ": {
    "date": "3/30/2018",
    "text": "Salt Cafe isn't bad. Very hipster, but the interior decor was interesting and unique. The waitstaff is extremely friendly and helpful. The food, however, is mediocre. My Eggs Benedict was overcooked, and the center was practically hard-boiled. The rest of the food was decent, but not something I couldn't make better at home. The portions were on the smaller side, though there was a generous amount of porridge, and the garnish was flavorless and just there to fill the plate. Far overpriced for what we got.  In conclusion, Salt Cafe is ok in a pinch, but not somewhere I'd go to again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xT00YR_cianCNXwv8FwvAw"
  },
  "CFt5-XNVAbiY4KCyTb1T-Q": {
    "date": "5/8/2016",
    "text": "Dropped in on Sunday morning for a quiet brunch and wasn't disappointed. Great food, well cooked, with good coffee. Highly recommended:)",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "6mIL7WFU0Gg_HmpVEYCtQg",
        "caption": "Photo of Salt Cafe - Edinburgh, United Kingdom. The day&amp;#39;s specials",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6mIL7WFU0Gg_HmpVEYCtQg/o.jpg"
      },
      {
        "img_id": "kY4m3Dsp4MDSF7rOPGv2Ug",
        "caption": "Photo of Salt Cafe - Edinburgh, United Kingdom. The Menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kY4m3Dsp4MDSF7rOPGv2Ug/o.jpg"
      }
    ],
    "user_id": "eBVFtdxqTGdogezZ98HUsQ"
  },
  "1vkEeYvkklkklr7DxDNEow": {
    "date": "10/21/2014",
    "text": "Whilst shopping locally with the bro, I spotted this whilst passing and made a note of going back once we had the goodies that we were seeking.  the interior is simply decorated with wooden tables and benches with a bar area in the center.  The have a group of mirrors on the wall which has a nice touch.  I ordered the flat white and bro ordered the latte to sit in.  Both were nice.  I think bro was struggling as he couldn't spot any sugar nearby and so had to drink the latte without.  The flat white was nice but was missing any artistic milk jazz.  Two drinks total:5.05, which looks like the normal price for two coffees.    4 stars as a star taken for no arty farty on the flatwhite and no sugar on table, but other than that a really nice experience!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "BhYROfCjIJsKUk22_IVHig"
  },
  "lEmZyBjxUqfnylNJLMOjbQ": {
    "date": "11/11/2016",
    "text": "Lovely and stylish place.  Waiters are very nice and thoughful.  We were very pleased with the scallops, the pork cheeks and the pumpkin raviolis as starters. Lamb was particularly good. The sole and venison too. Globally very inventive (with tastes not usually togeither) cooking! A good place. Prices are a bit high though. Don't hesitate :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KV8-gQOIyT4aRYy3JmaQpg"
  },
  "xpf8lnfmhMsP3BrPorB9IA": {
    "date": "12/8/2015",
    "text": "Delicious restaurant. Im not sure what the difference is better a cafe and a restaurant, because in my mind I guess this could be either. And maybe thats what makes it a cafe... anywho We came in for cake and tea  week or so ago, just a stop on a walking date. I had a gluten-free almond plum cake that was delicious! Im always impressed when places do a really good alternative cake. The icing was delicious, sweet, smooth and just the right amount!  The food looked great, but we had already had lunch.   So we came back for a date night two weeks later! This place is small and fills up fast so you HAVE to make reservations for weekend nights... not sure about week nights.  I could say somethings about the space and its lack of functionality , but I wont because overall its not too big a deal and the place looks cool...( just try to not sit in the booths- which is the only place we've sat both times! HA ). Obviously it didn't stop us  from coming back!   For dinner I got a small plate and a starter. I was worried that my small plate might be too small... but it was perfect. I had ordered the steamed mussels in a curry butter sauce! yes interesting too. They were delicious and I would say a \"normal\" size portion if you went to another resultant. Definitely not small.  For my started I had a olive paste and toasted bread .. it wasn't called that but I forgot the name , but it was good and tons of ground olives! I shared it with John since it was way too much salt and olives for one person! 1/2 was perfect for a starter .  We loved our dinner and our cake experience and plan on making it back for lunch in the near future!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "udsr4_AKx53XkMaEljwG-Q",
        "caption": "Photo of Salt Cafe - Edinburgh, United Kingdom. Fig and vanilla GF cake ! Really yummy",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/udsr4_AKx53XkMaEljwG-Q/o.jpg"
      },
      {
        "img_id": "75ug3utquGHag_Hv5Gq7wQ",
        "caption": "Photo of Salt Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/75ug3utquGHag_Hv5Gq7wQ/o.jpg"
      }
    ],
    "user_id": "BpKuNkYgAuisCNZlSzfUAQ"
  },
  "lsgdHjssC57Ni9iqNY2uVw": {
    "date": "8/18/2014",
    "text": "Stopped in here for a late breakfast yesterday. Excellently poached eggs on the eggs benedict, a hefty sized bowl of fries and a decently spicy bloody mary did the trick.  Good, competent service and a pleasant atmosphere in pleasing surroundings.  Just over two years later I've made it back for dinner. Whilst my parents wouldn't like the artfully presented food (& I've no idea of the size of the main course portions) the starters and desserts we had were all very good. Service was a bit slow but then again you don't want to be rushed and the atmosphere was condusive to taking ones time. Also a good & varied choice of background music at an acceptable level of volume.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "txzOZrHK9EVY0kYjSuXkKg"
  },
  "ZByxfuvYB81gLkljuhHmGw": {
    "date": "7/18/2014",
    "text": "Passing through Morningside each morning Salt Cafe had caught my eye. In retrospect, it's surprising, the exterior is fairly unassuming, but those golden stenciled letters intrigued me.   We headed here on a Sunday night with some friends for a meal. I arrived a bit earlier an got some bread with oil and balsamic vinegar, being ravenous at the time I was probably not the best judge but the bread was delicious and the olive oil was fantastic (balsamic vinegar is always a winner).  I was seated in a window seat which was nice, bright and airy. There was a bit of a draught though...and later we realised the lack of blinds made the setting sun a bit of an issue.  The menus are interesting, I hope you've been working out if you want to carry more than one!  When everyone else arrive we settled into the drinks. I was pleasantly surprised to find a new cider on the menu, as Manuel ha mentioned below the drinks menu is a bit if alright. Most of the group went with wine and everyone was quite pleased.  For starter we shared calamari. It was nicely cooked and had a good soft texture -not rubber!   For the main I had the burger. Wowzer. That was a good hunka meat. I couldn't finish the whole thing as it was massive and I had accidentally filled up on bread. That meat was so good though, I pushed my half eaten burger on my dining companions. I don't know where they get their meat but it want to know.  The number of mains on the menu is 'limited' -it's a small place. The range of dishes, however, is excellent. There's something for everyone. As there was six of us we managed to order every available main and everyone was pleased with their choice (though I think I won with the burger!)  When it came to dessert we were stuffed but were more than intrigued by the rooibos panda cotta. Tea panna cotta! How could we not! We ordered one to share. Another Wowzer! That stuff was delish. I don't know how they did it but it tasted like creamy sunshine.   The staff were charming throughout. Casual, but attentive and professional. Meanwhile, the decor is interesting. There's a definite 'sea' theme mixed with bright airiness and cushions. Lotsa cushions. It strikes me as Nordic-esque.   Overall, I hope I'll be back. I have a feeling a casual drink, a decent dinner or a morning take away coffee would all be very welcome here. A definite all rounder!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1fZ51WWRQL1YvqVxzrYD6A",
        "caption": "Photo of Salt Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1fZ51WWRQL1YvqVxzrYD6A/o.jpg"
      },
      {
        "img_id": "tPL7SEV866FPIIAt8Yla3w",
        "caption": "Photo of Salt Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tPL7SEV866FPIIAt8Yla3w/o.jpg"
      }
    ],
    "user_id": "KPY6FvT6h-r0W0HAC1Buag"
  },
  "TNn0-zOFnRMZUppmUTm18w": {
    "date": "7/5/2015",
    "text": "Saturday brunch here was absolutely divine from beginning to end. The service was impeccable, the food delicious and the atmosphere chilled.  I had scrambled eggs on toast which was absolutely delicious, but the star of the show had to be the eggs royale my friend had which was absolutely DELICIOUS.  Coffee was very tasty too, can't wait to return for dinner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "TmGJxkq6WbRW_HdIIxhfLQ"
  },
  "2OGMBirkvSeGmNkrXZoBWQ": {
    "date": "12/22/2017",
    "text": "Fantastic brunch spot: great atmosphere and vibe with some seriously tasty food. I had what was essentially a shakshuka by other name that was delicious. Next time will try the house Bloody Mary! Very welcoming and well located -- can't go wrong with this one!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fac2ymxeYW7tu6ysUGzaNw"
  },
  "bfZhzlLmJZxUcyxOBH5vMQ": {
    "date": "2/8/2017",
    "text": "If you are thinking of a typical place to brunch that is stylish, cosy and cool then Salt Cafe hits the mark. We went on a bustling Saturday around 11am, the place was very busy but we managed to get some good seats through the back. The decor of this place is very cool and so are the customers - it's typically students and young couples which gives this place a very relaxed and mellow vibe. I ordered the baked duck eggs with feta, roasted peppers and beans - it was delicious, albeit not what I'm used to as I've never tried duck eggs before. My boyfriend had, essentially, beans on toast. However, these were no ordinary baked beans - they were huge, spicy and full of flavour. This is a restaurant that takes simple dishes and fancies them up a bit to make your food truly Instagram-worthy. All in all, this is a safe and delicious option for brunching on the weekend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UROkCgA18uG7WXg1X2vIdA"
  },
  "aYlxbjj67r1QwCnGBsZgGQ": {
    "date": "8/2/2015",
    "text": "Came to Salt twice on our visit to Edinburgh. The first, my husband and I were famished and looking for late breakfast. We stumbled in to Salt and we're delighted to find a small but eclectic menu. Delicious green tea, excellently brewed (not scalding hot), accompanied a sausage and poached eggs plate. My husband had the eggs royals and the salmon was amazing.  After such a great breakfast and several referrals, we decided to come back for dinner a couple of nights later. I had a light and refreshing rose wine and my husband had a cider. We ordered oysters, which were large, fresh and very tasty. I had their soup of the day, bean and bacon which was wonderful. I had a scallops dish that had a very different set of sauces than what I'm used to. There was an avocado sauce and a tomato mango chutney. Both were excellent and complimented the fresh scallops. My husband also had the soup and the mackerel dish. Seasoned with curry, a little spicy, with potatoes and a cucumber tzatiki sauce. Everything was very tasty.  We would definitely recommend and will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Z-Hb0aA27vCqz6ZlZJSOzg"
  },
  "qpEbjL82YslXo2hoOCEgvA": {
    "date": "6/23/2014",
    "text": "For some reason this is one of those locations where businesses seem to be in constant rotation. In my time here there has been the funky little Italian take away place, the cafe which opened and shut in a heartbeat, and now after sitting empty for a long time, Salt Cafe has arrived.  The decor is industrial chic. As my friend said, the minute you see tungsten light bulbs and distressed wood in Morningside/Bruntsfield, you know it's definitely not cool anymore. I wonder what the next trend will be?  Brunch/lunch menu is small but arguably very well formed. Unlike previous offerings at this location, they serve alcohol and I think that will take them a long way. I would absolutely stop in for a few starters and a cocktail on a Friday after work, and I think that this fills a gap in the market for this area which is otherwise served by Montpelliers and The Merlin.   My friend and I both opted for the BLT (5.50) which arrived on slate (the hip version of a wooden board -ugh) and open faced (UGH!). Neither of us recalled seeing the menu state that the sandwich would be open faced, and while it certainly looked much more attractive this way, eating was definitely NOT a dainty procedure.  That being said, damn those were good BLTs. Like, really really good BLTs that would only have been improved by avocado, at which point I could possibly have argued that it was the best BLT I'd ever had.  The bacon was meaty and the fat was crispy.  I'm normally removing long strands of chewy fat from any sandwich containing bacon, and that was definitely not necessary here. The tomatoes were fresh, bread was thick and toasty crunchy (sourdough?). The sandwich had some kind of hidden garlic, possibly in the mayo.   Despite totally ripping into the open faced idea, I'm actually a little torn. Each plate had two slices of bread, with enough toppings for two sandwiches.  So, it's like we each got two sandwiches but didn't have to fill up on bread. Kind of a great idea, but also a very messy one.   Friday afternoon lunch and the place was packed which is a very good sign.  As I said, I would definitely come back and give their drinks and evening menus a go. If they know how to do a proper BLT, I have high hopes for the rest of the menu.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "4UQfst9jve4GCSfWpWn2uA"
  },
  "zaXR4v5t6i8Z7225fWjydA": {
    "date": "12/6/2015",
    "text": "I went for lunch yesterday, table of 3. I decided to have the special 'plaice', it was sublime! Highly recommend if it's on the board again.   Eggs were awesome & the coffee was great as well!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uHuaMePUdpGrYd_dOTQhKg",
        "caption": "Photo of Salt Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uHuaMePUdpGrYd_dOTQhKg/o.jpg"
      }
    ],
    "user_id": "MJLxPW1PcKyP5iRM3dj5GA"
  },
  "ScZFzSacWh5DZenGFqk1qg": {
    "date": "8/24/2014",
    "text": "*the boyfriend would like to say that he would give Salt Cafe 2 stars*  I really wanted to love Salt Cafe, like really. We passed by it a few times and it looked cute, its in a good location with the proper hip decor. Sadly, it was a bit of a let down.   Pros: nice decor, good location, good-looking menu, nice drink options (Fentiman's ginger beer for the win!), and the best 'tempura Scottish squid' (read: calamari) I have had in a very long time. Seriously, that calamari is five stars alone.   Cons: The service was just... weird. Confused. We walked in an it was totally full and a girl at front told us all the tables were taken and just sort of walked away. We had to flag her down again to ask if we could wait or there was some kind of list of something. We ended up just standing around the front until another girl asked if we were waiting on something and then told us there was a window seat available on the other side. We were then told we could order drinks, but we have to 'wait 5 minutes to order food'. It was super weird, but OK.   So, after the amazing calamari we got our food - two burgers with fries. Maybe its just because Im American (?), but I am so tired of ordering burgers and getting this half beef/half pork business. So, the patty itself was clearly a mix of meats with some other bits and bobs added in and then formed into roughly the shape of a baseball. It is then put on a sort of dry, crumbly flat bun which fell apart after the first bite. We asked for ketchup and mayo because it was all a bit dry without some sauce. The strangest thing was that it was served with a side of cole slaw (?) which was hot red cabbage with mayo. I feel like it goes without saying that red cabbage that is served hot and covered with mayo is not so appetizing. At all. Strange.  Anyway, we left sort of bummed and thinking, 'Come on, Salt Cafe! Step up your game!'. That calamari suggests it could be great, but the food and service really need some tweaking. Probably wont return until its had some time to sort out the kinks.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "A_dC3FJOqvlsDEiDyMrzlA"
  },
  "mvDjUyLrqcYZa-GIIVmtvg": {
    "date": "11/7/2014",
    "text": "I'd passed by a few times, and decided to make an outing of Salt with a friend.  For starters, the staff are charming and adorable. And when doesn't that sell a place? I smiled and was chatty, perhaps that influenced them to be nice to me (not saying those other reviewers who said poor service deserved it, but...)   I began with a cappuccino, and it was hairy and pungent, just the right thing for the wake-me-up I expect when I order coffee. Bit of a coffee lame-o? Get juice.   I ordered a burger, and my friend requested soup.  I love burgers. I make a mean one, from scratch, so I'm not very nice when a chef botches the job. It's not that hard. The secret is spit...ok, not seriously, but I'm not giving away the secret. Point is, a chef should know. And this chef has the goods. My burger was slightly done on the outside, bit of pink on the inside, with tons of juice and flavor. Perfect. This burger is a reason I will stop making my own.   They also had a great playlist going, which they said was a spotify one they created. It was like a normal cool coffeehouse array, but a bit more upbeat.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tVrGBW6rj1uebWnqjY-iTQ"
  },
  "IV8Yf6PLJ4kDepSs6Odv6g": {
    "date": "10/13/2015",
    "text": "I was invited here for Sunday brunch by a friend who was soon to be leaving the country (she's a massive fan). It's in Morningside which is a good start as it's a lovely part of town. My friend enjoys this place as it has great options for people with intolerances, be that gluten, dairy or whatever, they're very accommodating. I was very happy with this place because the previous night I was craving mussels. And loan behold on the menu were moules frites and very reasonably priced at around 8.75 if I remember correctly. The mussels and the skinny fries were wonderful and washed down with a smoky green tea. The place was very busy so I would recommend getting down early at the weekend if you're after some brunch!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "OWFcHwB6AWEDA5nb9bFRZQ"
  },
  "wQgboV1oHl2eGoBt6siNyA": {
    "date": "3/2/2015",
    "text": "I'd passed by Salt Cafe on my way to the Dominon a few times and always thought it looked like a pretty cool 'foodie' place to get some grub, so when a friend at work was searching for a venue for her leaving brunch I suggested we head here. A large party of 8 can be rather overwhelming but when we called ahead to book they said that'd be no problem as they have a room for groups in the back, however they had another booking in at 12.30 so we'd have to be gone by 12.15. We'd booked the table for 10.45 so thought this would be fine. We arrived a few at a time and ordered some drinks (coffees/teas) while we waited for most of the party to arrive. They did take a little longer than I thought they would to come through. I got a latte, which arrived in quite a small glass (something which, personally, I'm not a fan of) and which I didn't find to be very hot. I don't like my coffees mouth-burningly hot but I could've drank the whole thing as soon as it was served to me so thought it was a little cool.  Food wise we got a mix of eggs royales/florentines and granolas. This may sound nit picky but the eggs royal/florentines were served on bread instead of an english muffin which isn't how one would usually expect it. The bread was very nice though. My egg had a good runny yolk to it but some others weren't quite so runny. One of the granola eaters noted how she had come at the weekend and had the exact same dish, but instead of being presented with the fruits, granola, and honey already in the bowl and a (really rather) small jug of yoghurt on the side, they had all come separately on the slate with a larger serving of yoghurt - inconsistent! We also ordered a round of belinis which arrived with the peach puree and prosecco separated in the glass. Once we gave them a little stir the were lovely though. I found service to be good, we were served by a nice chap who was very good at making sure we all had ordered what we wanted, even though we were arriving in our dribs and drabs. SO overall, food is nice and not overly pricey and service was nice. Four stars for no muffin and small and not very warm coffee.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "5Y0dS4PkOVQqKWd--rSUew"
  },
  "npBB3dd214ZPIPdVeCg2mw": {
    "date": "7/10/2014",
    "text": "Finally, Morningside gets a bar/bistro place where you can enjoy drinks but also opt for dining that isn't your-standard-pub-grub. Drinks on offer are of a nice variety, definitely a great place to stop for an after-work pint/wine or before a night out in the centre. As for the food, we were a large table, so pretty much ordered everything on the menu, from the burger to veal to chorizo/squid. Sorry to sound generic but it all tasted great, with a very good quality/price ratio. I am quite excited that such a place has now arrived in Morningside and the combination of quality food and relaxed, slightly \"industrial chic\" bar has worked for me!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZrSxxFu8TivP-ORbO-MnLQ"
  }
}