{
  "3FKI2zC5T1UZT-0biZoaCQ": {
    "date": "9/9/2019",
    "text": "Went for Breakfast fantastic Eggs and Sausages one of best breakfasts around great service!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aRuA-S3rKPzwuCBY6AEzFg"
  },
  "c3BmunIwznW9I_NncGkcWQ": {
    "date": "8/14/2010",
    "text": "How novel. An Italian greasy spoon? But then is it a greasy spoon? Or a cheap Italian? Oh I don't know, but what matters is The Montgomery, just off Leith walk, is a great little unpretentious spot for a cheap and cheerful bit of pizza.  They also do other Scottish 'delicacies'. You know, deep fried offal and the like. Burgers, chips those kind of things. It's owned by a really friendly Italian guy who's probably worth the visit alone. He's one of those 'character' types. \"You gotta meet my friend, he's such a 'character'\".   I've lost my way a bit. Great for cheap food, drunk food and unpretentious food. Done.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wpOEMtRW_n5bkEk7c2R8ig",
        "caption": "Photo of The Montgomery - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wpOEMtRW_n5bkEk7c2R8ig/o.jpg"
      }
    ],
    "user_id": "U5XTWZj3Pgf730kOmL6qyA"
  },
  "G3V749SgFV2Jrkbi4M0wVQ": {
    "date": "7/17/2010",
    "text": "The Italian man who worked at this predominantly take-out restaurant was quite amusing! He claimed to be just as old as the restaurant, which incidentally is over forty years old! Which is astonishing (and he was at least fifty five).   The Montgomery is a place I would definitely like to eat at after a night out, and that's just they occasion they seem to cater to! Sure they have a few tables where one could sit and dine, but the menu offers fish, chips, burgers and several Scottish favourites which would make it quite popular with the night crowd!  As it is an Italian restaurant, there are, quite dutifully, several kinds of pizza available as well. The place isn't too pricey either, which is just how a take-out should be.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bfKNBXyaiB_FsS7ZYVuFsQ",
        "caption": "Photo of The Montgomery - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bfKNBXyaiB_FsS7ZYVuFsQ/o.jpg"
      }
    ],
    "user_id": "IY8cvV2SQuhJjKhRW68tFw"
  },
  "KP8lMiitthvQZ6QPTGHdOw": {
    "date": "7/22/2010",
    "text": "A classic greasy spoon style cafe which does exactly what it says on the tin; great homely food, not the healthiest in the world, but tasty and stick to the ribs type stuff which reminds you why we love living in Scotland!  Fish and chips, burgers, pizzas, the list is endless and everything is very affordable. The staff are lovely and friendly, and I believe the cafe is owned by an Italian family, so it has that sort of family feel about it that I absolutely love.  It puts me in mind of the University Cafe in Glasgow's West End. Fabulous, and ideal for a bit of classic greasy Scot's grub!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aHspWRmL9-s6cKkJurUtQg",
        "caption": "Photo of The Montgomery - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aHspWRmL9-s6cKkJurUtQg/o.jpg"
      }
    ],
    "user_id": "Cy1PV2TdYeDFA16mUOlr3Q"
  }
}