{
  "q4Pi9QM6R5QQ6T53x5W11g": {
    "date": "1/17/2009",
    "text": "This is my favourite Pizza Express in Edinburgh. It has the most interesting and atmospheric buidling. It overlooks the water of Leith, which on a summers evening, or lunchtime (i.e. when it's still light out) looks stunning. There are even outside tables right alongside the river, but you need to get lucky on the weather to be able to use one of those! The restaurant is always busy but the staff are always helpful and pleasant. The drinks are expensive if you're drinking lager but the food is always excellent and the ambience in the restaurant, with original art from local artists on display, is first rate.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l8gCfUNUdO64TtIv71UUaA"
  },
  "5uzy5BxPlnVAHuazCelcxg": {
    "date": "6/29/2009",
    "text": "this pizza express is lovely- situated on the water of leith, there are two conservatory type areas which allows for an almost private dining feel, with the many vouchers available at Pizza Express dinner can be pretty cheap (we downloaded 2 4 1 voucher form website.) service is great, attentive and knowledgeable staff. for main course I had the Pollo Pancetta, on a larger (14inch?) base and it was amazing, would definitely go back. Wine lise is also preety impressive, wide range of reds, whites and rose- starting at around 4 per glass which is pretty decent..",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GOFxMimjetwCpK0fXZICnA"
  },
  "FSdSpxZJvkw_Www7AYldGw": {
    "date": "7/4/2019",
    "text": "We had the Funghi Di Bosco - pizza and it was amazing. We would definitely come back. Prices we good as well, service was good and quick.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2xmThTDyYP9uuFOKvVINUg"
  },
  "89brsZcvezhxze1ZnigF0A": {
    "date": "9/2/2019",
    "text": "Beautiful location here right on the Waters of Leith.   Sit outside and it's a million dollar view.   Pizza was good, salad was good, wine was good, service was friendly.   Don't let the name fool you -- this is a full service Italian restaurant with a very pretty setup.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KUPi4QQao6NVOMs6irde8A"
  },
  "pkXt1MVdHgiEipQdHHWLuw": {
    "date": "10/24/2016",
    "text": "Impromptu lunch cravings sent us to Pizza Express at Stockbridge. At 1pm the place was moderately busy and we were greeted by a friendly and efficient waitress/front of house lady who sat us downstairs with a lovely view of the Water of Leith. We were served by waiter Dawid a very polite and cool dude.  Our order comprised:  Calamari as a starter, a Calzone Classico, a Pizza La Reine (sic), a kinder/small Margherita and a Pizza Romana Basilicata. My Calzone Classico was perfectly \"formed\" and its crunchy dough was delicious and properly baked. Its filling, even though tasty (with Coppa, Finnochiona, salami Milano, spinach & Milano cheese) was rather scarce as only occupied 50% of it being the rest just expensive \"hot air\". My mates' pizzas were tempting and yummy but the pizza base was wafer (too) thin even for Neapolitan standards which mean that they got cold really fast if you don't take action \"presto\".  Minor cons: a bit overpriced and there's room for improvement in the food department. On the pro side: the good service & front of house, families and kids friendly, the flavoursome meal and the Pizza Express food consistency as you will get the same decent level of food and service irrespective of the branch that you're visiting. I wouldn't mind to pay an extra visit in the future.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iaIX8lHPY3l7CrB4QxIVmg",
        "caption": "Photo of Pizza Express - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iaIX8lHPY3l7CrB4QxIVmg/o.jpg"
      },
      {
        "img_id": "BzwfJEhLKxqzZXxXSAzCjg",
        "caption": "Photo of Pizza Express - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BzwfJEhLKxqzZXxXSAzCjg/o.jpg"
      },
      {
        "img_id": "KpeadnzVozsvyxzc9c8Y_A",
        "caption": "Photo of Pizza Express - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KpeadnzVozsvyxzc9c8Y_A/o.jpg"
      }
    ],
    "user_id": "RBvR8MoGAoxeLlm_ajTYgg"
  },
  "6KLrgsnfPy7Y4__oSrAbDQ": {
    "date": "5/13/2015",
    "text": "First time here and I'm really happy with the service, will most definitely be back!  Came here to try out my new tastecard allowing a 2 for 1 meal with my partner. Our server was friendly, attentive, and treated us like old friends.  We ordered the dough balls and bruschetta to start, both came out within a reasonable time, and were hot and fresh.   Mains were the american hot pizza and chicken ceaser salad. This was certainly the best ceaser salad I've had in quite some time!   Desserts- cheesecake and the chocolate glory. Probably more chocolate than one person needs but it was delicious. The cheesecake was even better.   With a few drinks and use of the tastecard, 20 came off the bill. A great meal given the price, and I'm so impressed with the service we received from the staff.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VNGVoxKoPdoN1EKmP_FsnQ",
        "caption": "Photo of Pizza Express - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VNGVoxKoPdoN1EKmP_FsnQ/o.jpg"
      },
      {
        "img_id": "SGmcJ08MUnaS-TYYdtFMvg",
        "caption": "Photo of Pizza Express - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SGmcJ08MUnaS-TYYdtFMvg/o.jpg"
      }
    ],
    "user_id": "NwVyki35xOcaxhMzHNtHDQ"
  },
  "d1MB-QfVeLMO72OfBl9Avw": {
    "date": "3/24/2018",
    "text": "Adorbs little place on the Water of Leith for three starving, jet lagged Americans to get a quick pizza! Didn't know it was going to be so delicious! We had the calabrese pizza, which comes piled high with arugula. The crust is crispy and thin. We shared the honeycomb dessert and the chocolate toffee cake, and both were yummy. With wine and elderflower fizzy water (whaaaa? A divine drink!), total was just over 40. Service was attentive, and the atmosphere was relaxed and casual. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k3mZRTqfd3Ku8GBoPseQVQ"
  },
  "UgCMrSjtvIRYvLDuzyFV_Q": {
    "date": "12/27/2015",
    "text": "There's a waiter here who sings 'Happy Birthday' in a hugely theatrical and very loud operatic style. I commend him for his vocal abilities but this can't be up everyone's alley, and if you're hoping for a quiet, relaxed meal then this might not be the place, as it does seem to attract larger, louder parties.  Food-wise, I can't complain. Pizza here was pleasant and filling, and we were all satisfied. I love love love polenta fries and the serving here was delicious. Afterwards, I went for the festive mulled sloe gin which was lovely, and had a nice kick to it. I'm a big sloe gin fan and it was nice to see a nod to the traditional mulled wine option, whilst offering something new. Mmm mmm mmm, I may just have to conjure my own at home before the festive season is through!  Service was fine too. But, other than that, I'd say there's far more interesting places to go for dinner. I'd go back to this Pizza Express, for sure, but only once I was all out of other options. - It's certainly not a bad spot for dinner!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8rI2CoS4ltQePbZceSOgow"
  },
  "sUZDRKMa7ue3Z1aGsYAzZg": {
    "date": "10/25/2015",
    "text": "Normally, I don't really bother reviewing chain places. They're all largely the same and we've probably all been to one.  I'm making an exception for this place for the following reason:  The staff here are super lovely. The majority of customers here were families with youngish kids, and the staff were all super playful and kind and lovely.   It's not much recognition, but these guys are top.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "U55y_61paae1f6r6vgITJw"
  },
  "U3nW_uru5Vw3zJJfPUiDag": {
    "date": "3/23/2014",
    "text": "The food here is the same decent quality stuff that you expect from the chain. By now, you probably know whether you like their food and drink or not. Whatever decision you reached, this branch is not going to change your mind.  A couple of things to note though. As the pictures posted by other reviewers show, this particular restaurant sits on a river called the Water of Leith. If weather permits, pizza by the water would probably be lovely. If not, the window seats will still give you  nice view out onto the water.  It's more cramped in here than in most pizza express restaurants. It's a great place to eavesdrop, if that's what you're after, but I bringing children in here would be stressful.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YouqwNy4biRGtow7h7IfPA"
  },
  "qyn2tDtUryBBLDpMd62rQA": {
    "date": "7/10/2010",
    "text": "Normally when I go for pizza I don't usually go to Pizza Express, however on a Wednesday (mainly due to Orange Wednesday offers) I do like to pay it a visit. However, I just don't go to any Pizza Express! Oh no, I go to the one in Stockbridge!   The reason is not just due to the good service but due to its building and setting! Spread over two floors there are plenty of seats indoors, however on a hot Summer's day there is also a terrace where one can eat pizza and drink a nice glass of white wine! And this seating area has views over the river of Leith. Doesn't sound very glamour's, but at times it can be quite nice!   One of the better places to go for a bite to eat in the area, you will be eating in, not your average Pizza Express but Stockbridge's pizza Express!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ofQZpZ4yKFNx4om95qfGnQ",
        "caption": "Photo of Pizza Express - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ofQZpZ4yKFNx4om95qfGnQ/o.jpg"
      },
      {
        "img_id": "nFSrvgLjNegPz5XlP8zNSg",
        "caption": "Photo of Pizza Express - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nFSrvgLjNegPz5XlP8zNSg/o.jpg"
      }
    ],
    "user_id": "0-wo7wKN_Rp0Xs6cBMEDJQ"
  },
  "bM8Bi9DBcGlz2on4qZ_YAQ": {
    "date": "4/27/2010",
    "text": "Get some imagination.  They're NOT the best pizzas in Edinburgh despite what any smug friend has to say, they're not. Instead of reading this use Yelp to find something new and exciting - Pizza Express thrives on this safey-safey attitude and it's the people of Britain who are feeding the beast.  Every drink, regardless of what it is comes to your table lukewarm and everyone knows that's the worst temperature for everything other than baby's baths.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "L8U0P0ScIK4ikf25P8Sx9g",
        "caption": "Photo of Pizza Express - Edinburgh, United Kingdom. photo from official website",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/L8U0P0ScIK4ikf25P8Sx9g/o.jpg"
      }
    ],
    "user_id": "rJi2YPK6uj4FtE8R7OFQcA"
  },
  "YOE1ZxzEIOWXjfH7TRBD_Q": {
    "date": "7/23/2014",
    "text": "Although the place is quite nice the service was just awful. When we had our drinks they gave us a very dirty glass. Who couldn't they notice? We waited for almost 30 minutes to have our food and to be honest it's too expensive for what you have. I'm definitely not trying again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SRNT-NN6OtGhFWSBijobcg"
  },
  "_C2BjWzSBrHoeR_Omw3LZw": {
    "date": "2/20/2011",
    "text": "Standard Pizza Express, so expect no surprises from the menu or decor.   Can be very cramped as tables are small & it's a popular place (often queuing at the door for tables).   Service is very hit & miss. Today, service was polite but unbelievably inefficient. Even though it was busy, there is no excuse for the delays, failure to serve drinks until after we'd eaten, for getting the order wrong or for labouring over taking our very simple order.   Truth is in my experience, service has never been better than passable at this particular restaurant.   In summary: It's okay. Nothing special; rarely disappointing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3UaPUwqam3mVT25ZV5eNpQ"
  },
  "7CNXXTGdwtoMICYoMluRkg": {
    "date": "9/6/2008",
    "text": "The general rules of Pizza Express as thus:   Delicious simple italian style pizzas that all taste fairly similar.   Salads that are actually filling and fresh.   Good value but less so these days - a Veneziana used to be about 5.50, it's now over 6 and the most expensive pizzas cost nearly 10.   You can usually see the chefs getting everything prepared and cooked.   Simple decor and clean, airy ambience.   This restaurant has an incredible spot to eat - a table set in its own sort of conservatory suspended over a river. It's beautiful and we got to sit there one of the two times that I have been there. If you can get that spot then this is definitely a five star restaurant (as long as you like Italian food).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8unLlv-UgMcasYJr21_9kg"
  },
  "91W8L4Y0JnvXJDoXBLGUSA": {
    "date": "11/20/2008",
    "text": "Pizza Express is one of the few chain restaurants that i'd happily go back to again and again. Unusually they have got the formula of good food, at reasonable prices in simple surroundings spot on.   The Pizza Express branch in Stockbridge is situtated in a beautiful building that looks out over the Water of Leith. If you're there in the summer, then it's lovely to eat outside on the patio, otherwise request the window booth that looks straight out over the water.   The food served at pizza express is so good. Starters that are light, yet enjoyable and pizzas that are thin, crispy and with just the right amount of topping. The selection of pizzas available is excellent, with a decent variety for all the choose from.   Staff in the restaurant are as helpful as can be, but it does get very busy at times, so be patient!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mu6xEHThck91bAyD38XuZQ"
  },
  "0A3L9KzBmiFQxdxkg1w3bw": {
    "date": "11/9/2007",
    "text": "Can you ever go wrong with these restaurants? Well, yes and no.   Good value tasty food, good service and pleasant surroundings are Pizza Express staples and this branch is no different. However, if you're not a fan of kids or \"child-friendly restaurants\" then I'd stay away from Deanhaugh Street - at least during lunch times and early evenings.   During the aforementioned periods the restaurant is often extremely loud as roughly 80% of the seats are occupied by screeching under-12s and their long-suffering parents.   On the plus side, the food is fabulous here and I can thoroughly recommend the Caprese salad and a Romana-base Pollo ad Astra pizza!   Anyway, this Pizza Express is the perfect family venue, but think twice if you aren't a parent!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "deJ8rnTplJnklOrKYgo7Bw"
  },
  "M0XhF8xFBhirPf1wPTPrlQ": {
    "date": "11/16/2010",
    "text": "Great pizzas and starters, pity the beer is so expensive, blatant rip off",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K765Q_R9MNjXTKNwzIgiOQ"
  },
  "ZhEKOVu5I5u1dFmA6JzDhQ": {
    "date": "11/1/2007",
    "text": "Although I don't usually go for chain resteraunts, this one breaks the mould. The main thing that makes it so individual is the setting- it's in an old bank with a tower overlooking the water of leith with a great outdoors area. The food is wonderful and well priced and the music relaxing. The only real problem with this place is the service- it took over an hour for our starters to come last time we came.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QD0oHlPEgoeDrAeiNNPUUw"
  },
  "QQDyT2ItkyfzUvg5tVAsoA": {
    "date": "11/17/2008",
    "text": "I have to admit - I was always a bit snobbish about Pizza Express, thinking it would just be fiull of screaming kids, and the pizza would be boring and tasteless. So I haven't been for a long long time. Then one cold November evening, I found myself in Deanhaugh Street (as you do) and decided to go to Pizza Express there. AND: I was pleasantly surprised - yes there were a few kids running around, but the pizza (I had the Soho) was extremely tasty! This particular branch is very nice, service is prompt, wine is drinkable - what more do you want? Just stay clear of the over-lit basement.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0sGiC_VQubXxFEkg-OLqyw"
  },
  "AJMAO7IhXCHp2rJ0W_YJbA": {
    "date": "4/23/2011",
    "text": "Would actually be verging on 4 stars if they tidied the bit up a bit! The toilet was horrible, I had dirty cutlery and we had to wait for ages to get seated! The food was good as usual for Pizza Express and service was prompt and nice once seated! I really really love the dough balls! Very good value for money for Edinburgh!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eCUAG7L_ToChxEqfjDZ0hg"
  },
  "GkUalYN5IgT71kKiy_NfAA": {
    "date": "3/14/2009",
    "text": "This Pizza Express is in a beautiful building, the seating is well spaced out and if you can get a seat by the window it's lovely! Staff often seem reluctant to seat small parties by the windows though, prefering to keep them free for bigger groups, which is a shame as it'd be a lovely place to eat.   Pizza is always good, although a little expensive. Drinks are again a little on the pricey side. Staff have been helpful although have been in for lunch once or twice with friends and they didn't have certain sauces or toppings ready as it was earlier in the day (around 2pm?!) This was a little disappointing as by the time you have been waiting with a drink, choosing what to eat, it's a bit late to go somewhere else when they don't have what you want!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QcwinI60dFY5nd7ZwXZphA"
  }
}