{
  "eDYKn1COuDzZ6F4Cu6s8vw": {
    "date": "7/1/2012",
    "text": "Best Indian food I've EVER had.  This is straight takeaway. You order, you wait, you get your food, you leave. Or you could have it delivered. Whichever you prefer.  They give you a ton of food. One dish could feed a family! Inexpensive, flavorful, and well worth the walk to go get it. I tried three different dishes, two different types of rice, two types of nan bread, and the fried bananas. All of it was good, spicy, and chalk full of flavor.   All of the Indian food I've had and rated now seem second best. I guess I'll have to go to Edinburgh again to get some.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VnXusxGA4yU_N8wEriGDrQ"
  },
  "zAfslXWCfq3BXBSJqbQEHQ": {
    "date": "7/14/2016",
    "text": "Fast and delicious, that's all you really need to know about this place.  I had the tandoori chicken and it was as good and tender as anything I've had a a sit down restaurant.  The prices were great and they really make good food here.   It's in the name, but you should know it's to go only.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GonBj1P_PwX5ealOT8SOhQ",
        "caption": "Photo of Shapla Takeaway - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GonBj1P_PwX5ealOT8SOhQ/o.jpg"
      }
    ],
    "user_id": "M0OD0dGES7t0pIHiRK6Cuw"
  },
  "IW4H_C4ytaDoxfIccEnHAw": {
    "date": "12/11/2015",
    "text": "Took food out from this place yesterday and I definitely think it was very good. We had bhindi (okra or ladies finger), daal and a Chana masala curry their rotis and naans were awesome! The rice was a tad undercooked but somehow most Indian restaurants do that. The bhindi was delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0zKvetIPJd-cpATQevVgZw"
  },
  "G1lui-Oq8CEnpT6Ok0vcwA": {
    "date": "2/15/2015",
    "text": "I live above an Indian restauran, but go out of my way to go to Shapla instead to get a good takeaway. I've ordered from there a couple of times and it's always been tasty.  Last Friday I went over to get some chicken tikka and the gentleman confirmed I was after this and not chicken tikka masala. I'm not big on sauces so minus the masala for me please.  After about 10 min wait the takeaway was ready and I unloaded the goodies at home. A small addition of iceberg lettuce with yoghurt sauce came with the chicken - so good, lemony and refreshing. The chicken was very good too, big chunks of tender meat cooked nicely.  I had that with some plain boiled rice. Simple but delicious.  Happy with this takeaway and if Shapla would operate as a sit in resturant, I would probably have dinner there :)",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yuFHrb8YQtVuzu0eEXvJtA"
  },
  "2kzGI--5ZrHjw7wlxaw_Xg": {
    "date": "1/3/2015",
    "text": "I've ordered from Shapla a few times recently via <a href=\"/redir?url=http%3A%2F%2FJustEat.com&s=6c14c31fd50794c20b10a590fa776c43c96fdcdd6d58df86f1a1103fe1ebfc91\" target=\"_blank\" rel=\"nofollow\">JustEat.com</a>. Last night my boyfriend and I ordered two curries: chicken pathia and king prawn jalfrezi along with the usual rice and naan accompaniments. Within 35 mins of placing our order it had arrived (and we live about two miles from the place so good on them). The servings are large. The largest for any curry take away I've had in Edinburgh! had the king prawn jalfrezi. It had about seven large prawns in the curry and it was hot (tasty hot). It was so flavourful and not runny and soup like. It was one of the best curries I have had in a while! My boyfriend's pathia curry was loaded with chicken that was fairly tender. It was both sweet and spicy. The only down part was the naan wasn't as warm as I would have preferred but we just stuck it in the oven for a few mins!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "jY-M01vatSmfy-mK_g0h9A"
  },
  "--PUgyU8nTm-9AEuARMUBA": {
    "date": "7/27/2010",
    "text": "This is one of my favourite restaurants in Edinburgh, the food here really is delicious. I first heard about it when I was in first year and on the last day of living in halls we decided to treat ourselves to some decent food. Ever since, we have always ordered from Shapla to celebrate- birthdays, end of term or any little event good enough to get an excuse to get one! Although the restaurant describes itself as serving Bangladeshi cuisine, you will also find Indian and other Asian dishes being served up here. You can order online via their website and the delivery time was about half an hour, which is pretty good. I have been trying to work my way through their menu and there hasn't been one meal where I had finished it feeling dissatisfied, all the meals are full of flavour and are well portioned to ensure that you are full by the end of them.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0Br7G41pbHWMTbhWskJakg",
        "caption": "Photo of Shapla Takeaway - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0Br7G41pbHWMTbhWskJakg/o.jpg"
      }
    ],
    "user_id": "hutJzKEYHuVq6CP-XSARgg"
  },
  "iBpWpc6VAsB4NJZOL8F1bQ": {
    "date": "7/15/2013",
    "text": "This was such a disappointment.  Firstly, the curry itself was average at best - my tikka massalam was distinctly nippy, much spicier than it ought to have been. Now I'm fine with heat but a lot of people aren't and you don't expect a tikka massalam to be hot. My boyfriend's passanda was so so. It wasn't just the sauce, the chicken was dry too. Just not nice. And, worst of all for a poppadom lover like me, I received fewer than I'd ordered - so I'd been shortchanged.  When I phoned to complain I was fobbed off with the explanation that the kitchen doesn't get told how many poppadoms people have ordered... They said to mention next time and I'll get what I ordered but I won't be ordering again. I actually think I ordered from here a few months ago and the same thing happened then. So much for being one of the best Indian takeaways in Edinburgh.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mqg4L8flJmg8pqeR-uYyRg"
  },
  "dkQe-APZwnOukziSfNHLnw": {
    "date": "4/11/2013",
    "text": "Consistent quality and service. Love in all the details. Big portions. Complex flavour that is made by someone who really understands cooking. I'm vegetarian and they always make me extremely happy. Even going so far as to make special dishes for my fussy 4-year-old. Love me some Shapla.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C2oXAYS4H6uOf7CWLywUYQ"
  },
  "0483QJfU6vgSjvOoqBQsaw": {
    "date": "4/17/2012",
    "text": "The best there is. Great food, especially vegetarian. Real, fresh spices. Great breads. Fast delivery. Love them.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kKzUSuPd0mYvaTbqbrHV4g"
  },
  "qFF1ft2EIcT10eHBjOewhQ": {
    "date": "9/30/2008",
    "text": "We've got loads of Indian takeaways nearer to us than this, but we always go here. It's worth the trip. The food is great, what more do you need to know? Oh all right, the chicken puri is excellent - it's a starter, but if you don't have a huge appetite it's a big enough portion to qualify as a main. I like their lamb Bhuna, spicy enough to have a kick without making your eyes water, and nice tender chunks of lamb.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ai-lb1pt586HE6qcpUidPA"
  },
  "jj3cqdAMCNIEnDamrBYZjQ": {
    "date": "7/7/2011",
    "text": "I've been going to this indian for years and compare all other curries to theirs!get the green herb chicken;tandoori chicken orrr the prawn bhuna!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0fhbBSdU5naK3_7E2MCsUg"
  },
  "w5PX2y9MOK57d73cNGQUpw": {
    "date": "11/20/2007",
    "text": "Your taste buds will thank you for getting a delivery from Shapla. This quiet wee place on Easter road has a distinctly chilli flavour to it- the hot dishes are HOT so only order the Vindaloo if your tongue is prepped and you don't share a toilet with anyone else. The food is gorgeous, full of flavour and depth, the creamy sauces are mild but not bland, the mediums are bursting with flavour and the hots are, well hot. The menu is varied and with detailed explanations about the ingredients and the level of heat, so you can't go wrong. It is affordabel, quality food. And try the Chicken Puri, my flatmate guarantees it is the best he has ever had.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L0LokwGK2UzqLm8vys6Vhg"
  }
}