{
  "Gz8kEFY3uX0cbE6HfbfXRA": {
    "date": "3/23/2013",
    "text": "I love their pad Thai Great for a quick pop-in lunch... Have student discount...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "eKc2gY6fPaQy3zNsbIYDvA"
  },
  "PjtUDXh88pwlUoMcHcnkLw": {
    "date": "8/29/2017",
    "text": "First of all I feel like more people should be here because the curry is divine. We had the Thai red curry and it was very flavorful and it was the perfect amount of spicy. The waiter was kind though not the fastest but obviously with low numbers of customers it will delay the service so it didn't affect my overall experience. Price was good and maybe a bit generous for the quality. Very tasty, would definitely go again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IYJOhM39Ao-xaC373cfWqg"
  },
  "Us7zu7XXeLzL9S2mquqg6A": {
    "date": "8/15/2011",
    "text": "I wavered between two and three stars and finally settled on two because I wouldn't recommend this restaurant to people, and a two-star rating seems good enough to warn them off, but not one-star harsh.  It was just an odd experience. The place was fairly busy for lunch, but very quiet, to the point where we felt like we had to whisper. It was so awkward. There was only one girl working the front, which wouldn't have been bad as the place was quite small, except she was excruciatingly slow and didn't seem to have any idea on what she was doing. We were there for nearly an hour and several tables stood dirty and un-cleared the entire time. Due to this we were seated right next to another couple at a four-top table, next to us a table still holding 75% of someone's meal that remained thus for the duration of our lunch. What the girl did when she was not bringing out food I have no clue.  The food was just mediocre, really bland. The soups were good, except the portions were tiny and my vegetarian soup had a bit of chicken in it. Good thing I'm not actually a vegetarian. The pad thai and veggie stir-fry had very little taste, and even the soy sauce and chili flakes brought out upon request did little to spice it up. The only good thing was the price - 7 for two courses - but I would have gladly paid more for more flavour. It seemed like they were trying, but really just had no clue what they were doing.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UTr4PU6YlsaywlAR1afdlg"
  },
  "1un9icKtjUpb73OaU4tgnQ": {
    "date": "7/29/2010",
    "text": "When I ate here last night I realised that the initial 4 stars I gave this place might have been a bit generous. I even toyed with the idea of only giving it 2.  Mainly, the atmosphere was awful. There was only one other table occupied when we went in at around 7pm, and it the whole place was so deathly quiet it gave it a really awkward feel to it. We were practically whispering at our table because talking in normal voices felt like we were standing on the table and shouting.  The food wasn't as great as it had been last time, either. I got the chicken, chilli and coconut milk soup to start, abut it didn't really taste of anything and the chicken was quite rubbery. And it's not like the kitchen staff were exactly rushed off their feet either. My main wasn't much better; the noodles in my Pad Thai were really over-cooked which meant they were all slimey and soggy. But the thing that annoyed me the most was that the food came so quickly that I find it hard to believe that it was freshly prepared.  In fact, I am going to change it to 2 stars.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oEshN5oq98_g23MvEnRc5A"
  },
  "mKP7KLNJcu-1hm_durFO9Q": {
    "date": "7/29/2010",
    "text": "Thai Basil is one of the better restaurants that litter Clerk Street. Situated just opposite the Festival Theatre, it targets this crowd, with the pre-theatre menu always seeming very popular whenever I've been in there. Also due to the fact that they are used to dealing with high numbers of people in a short space of time, the service is excellent. The staff are polite, efficient and really speedy, exactly what you want.   Don't be put off by the looks, although it appears tiny, there is a great atmosphere inside and the food is great. The full menu has a huge variety of Thai dishes, with good curries and stir fries. If however, you are on a budget, the lunch or pre theatre menu offer excellent food for a reduced price, two courses for 6 and 12 respectively, and three courses for only a pound more. The pad thai is great, as is the hot and sour chicken soup.   Thai food is normally expensive in Edinburgh so it is nice to find a place that doesn't break the bank. With good service and great food at affordable prices, Thai Basil is a good find. Whilst not the best quality dishes around it is certainly a pleasant experience and I would definitely recommend it for a cheaper alternative",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9HtMuPioIhVVKWbJOxt2UQ",
        "caption": "Photo of Thai Basil - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9HtMuPioIhVVKWbJOxt2UQ/o.jpg"
      },
      {
        "img_id": "INEVGGKXUBQRFliv--5i0w",
        "caption": "Photo of Thai Basil - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/INEVGGKXUBQRFliv--5i0w/o.jpg"
      },
      {
        "img_id": "P6MDow_ctKHJcng_TPwetg",
        "caption": "Photo of Thai Basil - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/P6MDow_ctKHJcng_TPwetg/o.jpg"
      }
    ],
    "user_id": "Ga9DnmdmhE0Zzs_jRtmrfA"
  },
  "FniEZEECXWKeD-zd0-fc9A": {
    "date": "7/26/2010",
    "text": "Thai Basil is a brilliant place to come if you're looking for delicious, authentic Thai food at very reasonable prices. Further, their service is some of the fastest I've witnessed with meals taking no longer than ten minutes to arrive.  It doesn't look like much from the outside, being crammed in between other restaurants, but it's got far more to offer once you get inside. The menu has a good range of authentic Thai dishes, all of which use a wide range of fresh ingredients.  I opted for the salt and pepper squid followed by their special green curry.  Both were delicious and served in generous portions.  The meal only cost about 12 per person which we all thought was excellent value for money.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AI8OMy_OhgOukFTNPZC58A",
        "caption": "Photo of Thai Basil - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AI8OMy_OhgOukFTNPZC58A/o.jpg"
      }
    ],
    "user_id": "yfXqZkU5iXE07GSHzdsQBA"
  },
  "WylZd5wgQx_6RMD_9blJqA": {
    "date": "7/19/2010",
    "text": "To my regret, my closest experience with Thai culture is Thai kickboxing. Thus I have to say that I am not an expert on Thai food. That can change though!  As one of my few Thai food experiences, Thai Basil was quite lovely. One of a few good independent far east Asian restaurants in the area, Thai Basil has stood out to me. From what I gather it sells traditional Thai restaurant food, including a good range of Thai soup and curry. I tried one such curry and thoroughly enjoyed it!  Restaurants like this one can be a bit pricey for the novelty of offering food not found commonly elsewhere in the city. Thai Basil however is reasonably priced and main courses won't cost anymore than an Edinburgh average (6-10ish).  I look forward to revisiting Thai Basil and expanding my Thai food horizon. Watch this space!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xI4Xjog3QnoSNb4FTVV74A",
        "caption": "Photo of Thai Basil - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xI4Xjog3QnoSNb4FTVV74A/o.jpg"
      }
    ],
    "user_id": "PEN-Ttdt8r2MEk6Q5CnYbw"
  },
  "aFUsik2EY3ZuOEvhSZ8rTw": {
    "date": "7/16/2010",
    "text": "If you are in the mood for a good Thai meal, Thai Basil is the place to go.   Situated in the centre of the busy and bustling Nicolson Street, Thai Basil is just around the corner from the main University campus, George Square and it is a short walk from the city centre and so it is a convenient place to reach.   The decor inside the restaurant and the soft music playing in the background gives the place a very authentic oriental atmosphere. It is pretty small inside, but inside of feeling cramped and crowded, it feels lovely and cosy instead.   Thai Basil's menu offers an expansive selection of authentic Thai dishes, including Thai curry's, soups and salads. I came here for lunch one day with a friend and had the most amazing Tom Kha soup. It was chicken soups with coconut milk, lemongrass, ginger and a whole range of Thai herbs and spices and it was absolutely delicious. The soup was made with the freshest ingredients and was full of flavour, without being too spicy - yummy! My friend had the Thai red curry with chicken which smelled amazing and my friend loved it. I tried some and it was super, but pretty spicy so I didn't really get a case of food envy here!   The staff at the Thai Basil are highly friendly and welcoming and the prices are very reasonable here, with most main courses costing about six pounds. A really great restaurant with beautiful tasting food, definitely worth a visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oJZ9tA20I8DsqFDSVLRXFw",
        "caption": "Photo of Thai Basil - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oJZ9tA20I8DsqFDSVLRXFw/o.jpg"
      }
    ],
    "user_id": "OdUSlS-S6qfZFnDUCKzwEg"
  },
  "cqERwbTVqRcJGXxHhQej9Q": {
    "date": "7/19/2011",
    "text": "It's easy to miss Thai Basil as you walk past it, but it's definitely worth a look.  I went with my sister and brother-in-law for a later dinner, around 8pm.  The restaurant was far from busy, which is a shame, because it's a lot better than some busier restaurants I've been.  We shared Vegetable Green Curry, Duck Panaeng, Lemongrass Chicken Salad, and steamed Jasmine rice.  All were quite tasty, although the curries did not quite have the zing I have experienced from some other Thai restaurants around Edinburgh.  The duck was nicely cooked though, and both curries were plenty spicy, which was good!  The Lemongrass Chicken salad on the other hand, (note that this is a served warm) was delicious.  Loads of fresh flavours from the Lemongrass, fish sauce, and red onions.  The chicken itself was finely diced, so gave a nice textural contrast to the other dishes.    A few things prevented Thai Basil getting a higher rating:  We also ordered Gai Yang, but it never came.  Unfortunately, the waitress didn't notice, and we didn't really need the extra food, so didn't mention it, but it was still added to the bill.  We pointed this out and so we were not charged for it.  The waitress was very polite, but I felt service was not as slick as it might have been, given that there were only 5 other people in the restaurant.  The lack of diners also contributed to a very low-key atmosphere, so if you're a loud talker, you might need to turn the volume down a little!  So it's worth a look if you are looking for a new Thai restaurant, and the food is certainly tasty.  So if you haven't found a favourite Thai yet, I suggest you check out Thai Basil.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KPj-qeb6-sOeYpCCxTTXTQ"
  },
  "rbyTUzC8pB0bdg9uOqKakA": {
    "date": "5/29/2011",
    "text": "Well it was ok. We (2 persons) went in on a Sunday evening for some dinner, at about 8:00. Between us we ordered: Pad Thai; Green Curry; some chicken/cashew thing; 6 appetizer chicken skewers; and rice. Everything tasted good. There were more than enough prawns between the curry and the pad thai, which was nice. Curry was well spiced, and came with a hefty amount of bamboo shoots. The pad thai could have been more zesty, but it wasn't bad.  Total came to about 40, which is definitely on the pricey side.   The appetizer chicken skewers were delicious. They came with a really lovely sauce.   SUPER slow. The restaurant wasn't very busy (there were about 3 other occupied tables), so food probably should have been much faster. We left after about 1.5 hr, which is a long dining experience here in Scotland.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sKpXijbd_UpoDzVi30UlAA"
  },
  "5y0kjxhZbXaH3KTbh7TyiA": {
    "date": "12/27/2011",
    "text": "The staff here deserve 5 stars! They were so friendly, polite and efficient! My starter of fish cakes with chilli dip was gorgeous! I had the thai red curry with beef, The beef and veg were good and it was a big portion but it had quite a strange taste! not bad...just strange...but I reckon it would be worth a few more shots to see what the other dishes are like!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hzt2Rv6SHaZZEb-4peqEPg"
  },
  "1Y0KfitPQOSJ0ZCU950kdw": {
    "date": "7/22/2011",
    "text": "Pleasant staff, good atmosphere.  But the pad Thai was the blandest and most mediocre instance of its kind I've tasted.  At least the prawns in the pad Thai weren't too bad.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MC9zTLiwddY4JMVWyDlSIg"
  }
}