{
  "GhfIM0O0VYV03r2spL2uCA": {
    "date": "4/3/2013",
    "text": "i've long been a fan of the vittoria group of restaurants, so when i was in search of a pasta laden dinner i knew where to go.  well actually i had planned to go to la favourita until i realised they had redone the menu and now only offer about 6 pasta dishes.... so vittoria, whose menu offers many pasta options, was the new destination.  the boyfriend and i arrived about 7:30pm on a tuesday and the place was buzzing.  loads of people enjoying dinner which meant we had about a ten or so minute wait to get a table.  not a problem though as this branch has a nice bar area (it is a bit small though) so we sat at one of the hi-top tables and ordered drinks.  i went with a bramble, which was a lovely gin conocotion with blackberry and lemon.  very tasty and a nice way to start my dinner.  after a small wait we were shown to a table and given menus.  i had a serious debate over what to get as sooooooo many of their pastas looked delicious!!  we agreed to share a starter and try the aracini which is a breaded risotto ball.  it was good, not great and to be honest fell a bit short of expectations.  however the arrabiata sauce they served on the side was awesome!  i had to shout at the boy to stop trying to spoon it up while i still had some of the risotto ball to dip in it haha.  mains arrived a suitable time after finishing out starters and i was well pleased with my spaghetti siciliana (minus the peppers as i'm not a fan).  lots of pasta in a rich tomato sauce with olive, capers, and aubergine mixed through out and then topped with freshly grated parmesan.  my boyfriend was equally happy with his seafood tagilatelle which had a good number of prawns, clams, mussels, and squid mixed through it.  we added a tasty side of garlic bread so i made sure to really enjoy bread and pasta after a week of not eating it.  we declined dessert as i was satisfyingly full and didn't want to put myself into a food coma.  but they do offer a number of flavours of ice cream and sundaes in addition to traditional italian classics like tiramisu.    overall an incredibly enjoyable night!  the staff were very friendly and efficient although they seemed a wee bit slow taking our order.  i think it was down to the restaurant being busy though.  the food was very tasty and i felt it was reasonably priced as well.  definitely one of my prefered italians if i'm in need of a pasta fix!!  my only suggestion would be to book a table as they seem to always be busy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z_xbO-Iaxbx-ZRPhLJK-Ew"
  },
  "anCP96fn7g4N8VNNh59XJw": {
    "date": "4/2/2012",
    "text": "Vittoria's staff are super friendly and will work hard to slot in your party even if you call only a few hours in advance. They do get very busy, though, so plan ahead if you want to eat at a particular time.   The service is excellent and the atmosphere somehow manages to be both bustling and chill at the same time. Occasionally the wait staff might seem rushed but with a full house that can be overlooked -- they consistently deliver in all other areas.  The food is good. I can't say AMAZING because having I constantly compare Italian restaurants to a place in Florence and a place in New York and never have any other Italian places come close...But taking away those two stellar exceptions, Vittoria's food is probably the best Italian in Edinburgh -- if not Scotland. Really lovely pastas and starters, only to be improved by increased portion size (please?).  This is a great place for a birthday or to start a night out. Highly recommended.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OtJOScVN2GBvW7gkDexirg"
  },
  "K_l-87ueQzB70b4q4KrhAg": {
    "date": "11/28/2011",
    "text": "Vittoria is a very reliable Italian on George IV Bridge. We've visited on numerous occasions.  Overall, we said: \"we enjoyed Vittoria. It served us good dishes, in a lively environment, to a good standard. Next time you feel the need for Italian, particularly if you're in a medium sized group, head to Vittoria. They will serve your needs, very nicely.\"",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LURC3E0DoXYgN9aYTF3XOg"
  },
  "OJB30TzetyysdkGAE15AOw": {
    "date": "8/12/2014",
    "text": "Good food, good service. There's a little bit of a \"serve and move you along\" vibe, but it's a good spot that I've often returned to during my Fringe visits.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q0FRCcBTWJu8a6GLddF5Nw"
  },
  "GHCRudeI47bwhUnZGL6t-w": {
    "date": "12/27/2011",
    "text": "Enjoyed an absolutely delightful meal here with several friends.  Staff were amazing, we had no reservations and they were able to accommodate 6 of us on a Saturday night. They were also extremely pleasant during service.   The food was tasty and the portions massive!  But the best part was dessert. Their ice cream selection was amazing, about 20 choices, each one more tempting than the last. They should sell that stuff by the tub to take home!  Worth a visit, but book, I wouldnt imagine everyone would be as lucky as us.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lbTUf9khst8OHCpG0A3jMA"
  },
  "em2rp_wmkfRFrzl2FL5o_g": {
    "date": "7/24/2010",
    "text": "Over the years Vittoria has became a very popular place for my Friend's birthdays and end of term meals. With it being a small walk away from Bristo Square it is very convenient.   Every time I have eaten there, I have eaten well and thoroughly enjoyed the food! Prices are not too expensive either. Furthermore, I have even sat at a table next to one of the members of the Proclaimers! Every time I have ventured to this restaurant I have always had various kinds of pizza, which always have a nice crisped base!   The only downside to this place, like it's near neighbour the Elephant House is that it is always busy and as it has become more popular it has lost that little something. Service is still not bad, but does suffer under the weight of the amount of customers.   It is worth a visit, and it most be pretty good if the Proclaimers eat there!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "0-wo7wKN_Rp0Xs6cBMEDJQ"
  },
  "2oaJGLKdroMEjybeHkwq_w": {
    "date": "4/14/2013",
    "text": "Whats great about this traditional Italian establishment, well it has to be tackling catering to large groups of noisy foodies, such as the party of folks I joined for a pre-booked weekend evening meal, but such a busy place - it was full to the brim!  With an abundance of dishes such as toasted bread tomato type veggie option a kind of mushroomy version of a Beef Wellington, and various chickeny dishes, this moderate sized Italian restaurant in the city named Vittoria, kind of made me feel like I was in Rome again.  Situated in central new town, on George IV bridge, there was certainly a madness of king sized portions, as after scoffing the starter and mains some were stuffed.   With the table booked for another party, meals running a little late(1/2 hour) also another venue booked we couldn't stay all night, just as well we wouldn't have managed dessert anyhow! However once the food started to arrive the pace stepped up, time just flew by and before we knew it was vacate the premises, but did get a discount due to not enough time left for dessert.  Apologies to the couple who were seated next to us- the exhalment of merry laughter meant for the duration, hope our bunch didn't spoil their night too much? To summarise, in large groups expect slight delays in food service, but overall service was very good once it got going, but if going for a romantic meal on a Saturday expect noisy parties next door. Would go again but would try mid-week.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IpLZ7RevQrFPJWYc9Gxymg"
  },
  "wQBHJ5wIzKFXQZmA_aGHmg": {
    "date": "2/18/2014",
    "text": "Suggested by the hotel Missoni to go here. Great food and great service. The BEST lasagna I have had in years. If you are here you must try this place. You will not be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cPvGivUI4Q4DXGmOBoeDKA"
  },
  "QjEizUhJrBPeYDskaMRS6g": {
    "date": "1/30/2013",
    "text": "I really enjoyed meeting a friend at Vittoria on the Bridge for lunch yesterday. The ambiance is great and the staff are very attentive and friendly. The lunch menu was really good, too, with paninis for 4.95 and pastas for 5.95. My friend and I each had paninis and they were delicious. My Parma ham panini was fantastic with excellent mozzarella and tomatoes inside really good bread, but I was expecting slightly larger paninis or maybe a tad more salad on the side for the price. That said, it was delicious and I really liked the overall feel of the place. The coffees were also excellent and I'd really like to go back for a pasta dish there sometime, too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vvQhikDPjAzHfSLVgnFkPQ"
  },
  "zIOYznxkPd075grHXK0P3Q": {
    "date": "8/15/2010",
    "text": "Had a fantastic meal here with a couple of friends while up in Edinburgh.  They didn't really have any available tables however they managed to accommodate us which was much appreciated and after our meal, I'm so glad they did!  The selection of food on offer is very overwhelming and it took us quite a while to chose from the extensive and very tempting menu. To start we just had garlic bread to share which was good, garlicky and wonderfully crunchy. I then had the Diavola pizza which was fantastically spicy, my two friends had Paolo pizza and the penne with chicken and red pesto. Both friends were suitably impressed.  Unfortunately we didn't have time to sample their lovely looking ice cream but we came away feeling very contended. Good food, good value for money and a good atmosphere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VAkL2rl1rhDxDEU2YdLtkw"
  },
  "4Z-yCsQlUzr5422v-mT0Bw": {
    "date": "4/19/2011",
    "text": "Amazng food with huge portions so great value for money.   The menu is so vast that you will find it hard to chose from, my friend and I did it took us forever to decide. The dessert was gorgeous.  Service is good but a little to in your face, the waiter was never away from our table and when he wasn't you still felt his presence around.   It still wouldn't put me off going back as the food is devine and right up my street.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WVVydVWc_Ksp1KDBUKettA"
  },
  "-70-WMcKIfXm4ZKFWoE9pg": {
    "date": "6/5/2010",
    "text": "With regards to lunchtime voyages of discovery, the last two weeks have been very kind to me. Several establishments on George IV Bridge have found a permanent place in my heart, and having just scoffed one of the tastiest tortilla-based treats on the planet across the street, rounding my feast off with what has to be one of the best ice-creams I've ever had at Vittoria provided a fairytale ending to my hour of freedom.  They had shitloads of flavours, but I decided to play it safe with the vanilla. Superlatives can't really do it justice, and despite being quite expensive for an ice-cream cone at 2.50, I'd say it was easily worth double, perhaps treble that.  They only seem to open the ice-cream takeaway bit on sunny days, so next time it's not pissing down, make a beeline for Vittoria. You'll thank me later.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "xXQTdJXPGOP-NUYctcQw8g"
  },
  "RMqgYKHQQFeNjRwG1q5X1Q": {
    "date": "5/2/2010",
    "text": "Always bustling with diners, providing rapid and friendly service, and easily affordable, Vittoria is simply a great Italian restaurant. I've been here loads with family and friends and have not once left dissatisfied.   The problem with Vittoria's menu is that there's too many tempting pasta and pizza dishes. Not to worry, Vittoria address this dilemma by offering half of your chosen pizza with a smaller portion of your preferred pasta. Simple yet affective this idea has brought me back to dine on many occasions. Quick tip, keep an eye out for the bin end wines as occasionally you'll bag a top quality bottle for a heavily discounted price.  Aside from having things well covered in the restaurant department, throughout the day you may spot the mini ice cream parlour (beside the entrance) as you pass by.  Discovering their delicious Tiramisu flavoured ice cream on one of Edinburgh's sparse sunny days my opinion of Vittoria was yet again boosted.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "yXMlNb1VpUSa0HPM2EyYdg",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yXMlNb1VpUSa0HPM2EyYdg/o.jpg"
      },
      {
        "img_id": "al-V0_kTJ9SF5qEdtcI0pg",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/al-V0_kTJ9SF5qEdtcI0pg/o.jpg"
      }
    ],
    "user_id": "UvIb5v3biEgcxWKnxf0ocg"
  },
  "ZfMfKg7VZwj--YJ4J_fdXA": {
    "date": "5/12/2010",
    "text": "Vittoria seems to get bigged up quite a lot by people in Edinburgh, but I don't buy it; I suspect the people that rave about this place also consider the works of Andrew Lloyd Webber to be the epitome of culture, more fool them. I have eaten here a few times and although the food is tasty, it is not exciting and I have never eaten anything that I didn't think I could prepare myself at home (I'm not a great cook by any stretch of the imagination). If you need a standard Italian to bring some culinary luddites to, then Vittoria ticks all the boxes; if you're looking for exciting Italian cuisine to take you back to a sun drenched terrace in Tuscany, this is not the place for you.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gRA-plF0LiZAE31BNQap_g",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom. http://www.vittoriarestaurant.com/onthebridge",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gRA-plF0LiZAE31BNQap_g/o.jpg"
      },
      {
        "img_id": "WSxm6H7eDj1F8BIeyrfFuw",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom. http://www.vittoriarestaurant.com/onthebridge",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WSxm6H7eDj1F8BIeyrfFuw/o.jpg"
      },
      {
        "img_id": "K8K1hZkl9SUFOGF27mXK9g",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom. http://www.vittoriarestaurant.com/onthebridge",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/K8K1hZkl9SUFOGF27mXK9g/o.jpg"
      }
    ],
    "user_id": "mJJj_SZff6MEWG5Vx1r8Bg"
  },
  "Jvw1uQPPw7iJZ3jbVaRxBg": {
    "date": "9/11/2011",
    "text": "I have been to Vittoria's on the Bridge numerous times and must say I have never been let down. I decided to take a group of friends that I had visiting from both Canada and the Netherlands there for a nice meal a few weeks ago.  We made a reservation on-line, which is a handy feature for many restaurants these days.  It was great that they were even accepting them in early August despite the very beginning of festival.  We were greeted by friendly staff at the door and shown promptly to our table. There is an upstairs and a downstairs in this restaurant and both are equally pleasant atmospheres. On this occasion we were in the basement.  We had a very friendly group of waiters who were quick to take our drink orders while we waited for our two dutch guests.  We ordered a bottle of Valpolicella which is a bit pricier but very nice.    While Vittoria's isn't outrageously priced, I like to not have a specific budget in mind when going there.  Most starters are around 5ish, most mains between 10-15 pounds and I would definitely recommend leaving room for dessert because their gelato is amazing! They also have the usual chocolate cake, tiramisu and banoffee pie.  When our final guests arrived we all decided to get starters, mains and desserts.  I had the Ruccola salad, which is rocket with parmesan shavings, although they threw in some other tasty tidbits like cucumber and olives and it was delightful!  For my main I decided to get a pizza and went with the Saporito which has aubergine, courgette, potatoes and peppers. All I can say is it was spectacular. They didn't skimp on any of the toppings and the crust was nice and crispy.  For dessert I always lean towards two scoops of gelato, which comes with a little wafer in it. I had peanut butter crunch and banoffee pie flavours and they were both delicious.  Everyone else in our group were chuffed with their meals.  My partner had the calzone, which I tried a bite of. It was massive and also delicious and chock full of fresh ingredients.  My gluten intolerant friend had a lovely looking pasta as they fully cater to those with gluten allergies.  Any pasta or pizza is available in gluten-free form, and she informed me that it was delicious.  The service here has always been excellent. The staff are friendly, attentive and are able to make honest and decent suggestions if you have questions about the menu.  And I don't find them overbearing which I think can be easy to do if you are trying to please your guests too much.    Overall for 6 of us, with starters, mains, desserts, wine, beer and after dinner spirits the bill came to roughly 180.  It's not somewhere you can necessarily afford to go to all the time, or I should clarify, afford to have a starter, main, dessert and alcohol all the time if you aren't getting one of their deals, but it is more than worth it for a special treat. I adore this place and will definitely be going back again and again.  Plus as an added bonus, they are on the High Life Diner's card if you have one, which means 2 for 1 main meals!  Definitely some of the best Italian I've had in Edinburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kPSVsffSbqpP8qYhgDT0ag"
  },
  "p_0uP2GZBwRnuJsP3kUpcQ": {
    "date": "6/1/2011",
    "text": "I went to Vittoria on the bridge with a large group on a very busy saturday night - I'd booked a good while in advance so it was good to skip the queue-age that was building up at the door when we arrived (always a good sign when a restaurant is queued out the door!). Service was really good - I had increased from 11 to 12 people the day before and was told it would be a tight squeeze but actually it was absolutely perfect, we had our own wee corner down the stairs. When I booked I had been told that 11 was a 'small' enough group to still order off the A La Carte menu so when we sat down and were brought a set menu I protested but as it transpired there was another large group there and they had mixed us up. Massive amounts of selection on the menu - one of my friends spent a very long time deliberating! I had the bruschetta to start which, be warned, is a rather generous portion but very tasty nonetheless. I followed it up with a penne amatriciana, one of my favourite Italian pasta dishes and was not disappointed. I'll add here that I had a taste of my sister's pizza and it was simply amazing - the base is usually my least favourite part of a pizza (the bit I choose to leave when I start to get full!) but this was very light and tasty. All in all, a brilliant meal!  As an aside, there was a hen party in there at the same time and the hen was brought a strategically shaped ice cream, one can imagine how she was to eat it. I'm not sure if that was unprompted or on request though!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "gGeqx4F2oQNeAxaUb2IpcA"
  },
  "fbWfuah17gvAN7om5HbQ6g": {
    "date": "6/7/2008",
    "text": "We had a really wonderful time here. We were able to book a table for eight at short notice, were early, greeted in an extremely friendly fashion and shown to our table punctually. The waiters, especially Raphael, were helpful and fun. The food came with little delay, was very tasty as was the wine. We were entertained by the hen-parties and a tremendous time was had by all.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NDqWYhYRgzP3CM9Ob75jpA"
  },
  "MymkIIshpW7yyHcPaqkcng": {
    "date": "2/9/2010",
    "text": "This is a lovely Italian with a good menu, good food and a good atmosphere. What impressed me most however on my visit was the quality of service- it couldn't have been better.   As a part of a hen party of 20 (nightmare for the waiting staff), we received our drinks and three-course-meal with army precision. No one was left wating, our water glasses were contnuously filled up and or meals all arrived to the correct people at the same time. And all with a smile.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cqecqnFK2eu88VtKJLHpiA"
  },
  "mo16uzEjw_4f-y5SmB5LGg": {
    "date": "1/7/2009",
    "text": "A wonderfully friendly family run traditional Italian resturant . This new addition to the Vittoria family chain (the family also run Vittoria and La Favourita on Leith Walk) is much more centrally located and has a modern decor and nice atmosphere.   The restaurant is large with additional seating in a large downstairs restaurant. The menu is extensive with no stone left unturned, great Pizza and Pastas and traditional Italian meat & Fish dishes leave you spoilt for choice and the wine list is a delight.   Well worth a visit",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vQnR9L9HILjw4PgWB8q1cQ"
  },
  "mTo0I0h3mBsE95kqWqHJnw": {
    "date": "8/7/2012",
    "text": "Very busy but the food is great and staff have are funny.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wLNbwYZLqP4KlHDFEgdL4g"
  },
  "oyGs57h0Aj4L-ZV9n4BIiQ": {
    "date": "9/26/2013",
    "text": "The great thing about italian is that it is done decently well in most countries in the world.  Scotland is no different...which is why Vittoria came in relatively average in my book.  The menu is moderately priced and the food is moderately good.  Two nights previously in St. Andrews we had italian that blew this out of the water in terms of food and ambiance.  I give it three stars because it really wasn't bad, so a lower rating would be unfair.  Definitely an fine spot for bigger parties as they have a lot of space.  Not intimate though...wouldn't go here on a date.  I think Edinburgh has more to offer if you try harder to find a place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3RqYAJfEJDxIpX3xjnCmLw"
  },
  "unuQQu8x_QhaoG7F2Ojf-g": {
    "date": "6/27/2013",
    "text": "Popped in for a quick lunch today.  The menu is quite extensive.  I ordered a mushroom brie wellington, not because I am a vegetarian - because I'm not - but because it sounded awesome.  It was.  Inventive and extremely tasty!  Servers were all smiles.  The atmosphere was a little noisy.  We were a bit underdressed, but no one seemed to mind.  My five year old loved the place, too!  I just realized that in the commotion of trying to get a business card to leave at the B&B for future guests that I may have stiffed the staff on the tip!!  If you work here and are reading this, contact me!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yfc3AejF58wxQv6qWRi9kw"
  },
  "vF5peD2hziyi1wX2t3f-4Q": {
    "date": "3/27/2015",
    "text": "Craving spaghetti and meatballs...and Vittoria satisfies! The marinara sauce was perfectly spiced and meatballs weren't too dry. Fantastic Italian food in Edinburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "stHAj4YnbLl3EIYsI5TrWA"
  },
  "8KWIBC3cWkH3sq9_0d3frA": {
    "date": "10/8/2012",
    "text": "Vittoria on the Bridge is another restaurant owned by the Crolla family, who are now forming a formidable empire spanning Edinburgh, Glasgow and beyond, so I think they should be able to handle a wee 2 star review without the fear that the business will suffer.  This was my first visit to Vittoria's, as I somehow managed to pry myself away from the sister restaurant, 'La Favorita' on Leith Walk. As with all the Crolla establishments, the place looks great, service was good and the staff were friendly and knowledgeable. Unfortunately, unlike my trusty old favourite, the food just wasn't as good and the pizza didn't even come close.  Our starter, a large mixed antipasto was faultless, the ingredients were all high quality and we had a nice mix of cured meats (prosciutto, bresaola, mortadella, milano etc), cheeses, olives and picked / marinated vegetables.    The mains not so good, my veal was pretty tough, overdone and incredibly heavy, seriously why so much cheese?  Melted cheese really gets me, this is so unItalian, (probably a bad habit picked up from America). In Italy less is more, the food is really simple hence why its delicious. Also, the 'grilled' tuna turned out to be coated in breadcrumbs and fried, surely this is sacrilege?   So all in all a mixed bag but a star for the great service and one for the huge and tasty antipasto and delicious espresso.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mqj9KWq5qGIqoVONjAFLHA"
  },
  "kusFkCZGAx6fBcx-sopbFw": {
    "date": "2/14/2015",
    "text": "The best way of enjoying an Italian meal is from Italians. All staff at Vittoria is from Italy. Good meals, excellent desserts. All for a good price. And also an excellent service, kind and attentive.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7QHOUortaDKoLeqNg5uA5Q"
  },
  "-JjLdK4I0RREMDLG9zJz5Q": {
    "date": "11/15/2014",
    "text": "We pretty much can't get enough of this place. The servers always remember us, even if we haven't been there in a while, and the food is always consistently good. We've never had a meal miss the mark here. Especially delicious are the polpetti and the bruschetta, though we've tried many other items on the menu and they've all been great.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "a674ORwS4waTSyES1tQB3g"
  },
  "USpfkU6dpXMH24clOtWiTw": {
    "date": "9/18/2012",
    "text": "My last name is Italian, so with years of grandma trying to fatten me up with lasagne and antipastos, I have been tried and tested on the pizza and Italian food in this city.   Vittoria makes me happy. My favorite professor is Italian... like from Italy. My parents (Italian last name too) came to visit, my friend who just arrived home from Italy, my Spanish friend whose wife is Italian... etc. etc.   All of them loved this place.   I don't care if it's generic Italian food. It's exactly what you want when you want Italian food. CHEESE, TOMATOES, BALSAMIC, OLIVE OIL, OLIVES, FRESH PARMESAN, HOMEMADE PASTA, THIN CRUST, SALMON, ALFREDO, PESTO, GARLIC, FRESH BREAD...   No, it's not weird fusion shit. It's not over-the-top local ingredients which some of the fancy Italian places have (NO OLIVES IN SCOTLAND...).   It's about 20 actual off the boat/plane Italian people running the show, and you can see that, on their lunch and dinner breaks they EAT THE FOOD... What else do you need to know?",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "WrMDMbEt9ap0VbmNsnKvKA"
  },
  "g2UKswm4GEfzdEIsRX7srw": {
    "date": "6/15/2012",
    "text": "I came here full of excitement. It was my first date with Vittoria and I thought it would have been the start of a long beautiful relationship. Having been to the sibling, La Favorita and sampled their 5* proper Italian and GF pizza, I had been told Vittoria's did the same pizza's. I had consumed minimal amounts of food so I could do Vittoria's justice. It was to be the highlight of my day and a reward after six hours of interview transcription. Oh dear.   Not the smartest idea I've had. No lovely La Favorita, thin and crispy bases but a.n.other generic GF base (small GF size too). Ok, so I was disappointed but hey, it could have still been good, but no. The pizza itself was served at best lukewarm (I suspected cooked from frozen and not cooked properly) and very quickly was cold and I was regretting not getting pasta. Once I admitted to my friend how disappointed I was, she fessed up to a strange tasting Carbonara so I would have lucked out with the pasta too. Once the spaghetti had been consumed, we saw the scrambled egg at the bottom of the plate as the egg had been added to the pasta and then over cooked - ick :-(  I did have a Vittoria card so we weren't paying full price. We did highlight the issues with our meal (we weren't requesting a replacement as we wanted to escape) and credit to the staff (who were lovely so no complaints about the service) we were offered limoncello or free coffee's but we had already decided to make our escape. Had it been a real date, this would have been an escape out of the bathroom window time...  I have to admit, I can't remember the last time I had such a bad meal and as you'll see from my reviews, I'm pretty good at giving credit with the stars. I was wishing we had travelled further to go to La Favorita (part of the same group) but I can't imagine that I'll be returning to Vittoria anytime soon which I'm sad about, especially as so many work colleagues had raved about it :-(",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "frthTngbBHgSdk4j85HmEQ"
  },
  "O4R_HgL-Nj54Mat2S9bRbg": {
    "date": "8/18/2012",
    "text": "I think this has to be the best Italian restaurant I've ever been to.  All their dishes seem to be faultless and the Tiramisu in particular is off the freaking hook.  They do get busy so be sure to book a table.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UfLGgjd6UExBVZb6JRJiQA"
  },
  "rMKAc38EIoodX3-ZAlT9Lg": {
    "date": "12/29/2013",
    "text": "This smart-looking yet not too pricey restaurant near to the centre of Edinburgh certainly knows what it is doing when it comes to both food and appearances.   An expansive menu with many options suiting vegetarians and many gluten-free options contains a variety of familiar Italian dishes and some more personal ones. The serving staff were quick, friendly and extremely polite.   Personally, I opted for the half-pizza-half-pasta (something I've only seen here). I chose the Capricciosa Pizza and the Spaghetti Carbonara originale. Both were very well cooked and seasoned.   The spaghetti carbonara was a little creamier than most 'traditional' carbonara dishes that I am used to - a person with me who ordered the in-house carbonara complained it was far too creamy (it looked it) - but all the more was full of taste.   The pizza was thin, crispy and had a delicious balance between pizza sauce and cheese, which was pleasing. All very authentic and True to Italian food. The drinks throughout the night were delicious, as was the selection of wines (though the waiter should brush up on his knowledge of the wines served - \"I don't know\" to a question of the recommended white wine was disappointing)  The one gripe I had with the restaurant (and one reason I am withholding giving it a five star review) was, after being seated and waiting for 15 minutes, our party had to remind the host to assign us a server, to which he hastily beckoned a waitress to serve us.   All in all a good place to eat in a group, as a family, or even on a date.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PuJjoQnzlIdL1vfnxKdUZQ"
  },
  "fMFkn_ru1y4IGkPeTVhOxw": {
    "date": "11/26/2012",
    "text": "With the help of our trusty Yelp app, some friends and I ended up taking in dinner at Vittoria on the Bridge when visiting Edinburgh a few weeks back. We found ourselves comfortably tucked around a big table downstairs, and proceeded to attack the menu with a combination of foodie fervor and downright carb craving. Luckily, Vittoria was able to satisfy both.  All around, they offer a wonderful variety of classic Italian options, excellently prepared and ready to warm you up after a cold day of touring the city and castle. Their pizza was crispy and flavorful, the calzone I had was excellent and unlike any I've found in the UK so far, and their ravioli was perfect (I was trying others' food too...). Their halfsies option for pizza and pasta is a great choice when struggling to make up one's mind.  Additionally, they had a great variety of less traditional Italian dishes which were well-done. With two Yelp elites and an additional self-proclaimed foodie at the table, we might have been a tough bunch, but instead we found ourselves struggling to choose among many delicious-sounding options on the menu.  From that point, we had nowhere to be but pleased, well fed and warm. Vittoria on the Bridge was all too happy to oblige.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BvIIvQqPJ2cKC8eaSxOFpw"
  },
  "Wz7HroHmg9UviQ56z2InmQ": {
    "date": "6/15/2010",
    "text": "Vittoria on the Bridge is the newest bambino on the block from this Italian, family run business. Right in amongst the hub of tourists, night time revellers, and locals that is George IV Bridge, Vittoria is in prime position for enticing people wandering past to venture in and get some hearty and traditional Italian classics wrapped around their forks. The menu is huge, and is different for breakfast , lunch and dinner, with an extensive choice of pasta, pizza, risotto and meat and fish dishes.  Although I don't think this branch of Vittoria has as much character as the original Vittoria on Leith Walk, or the chic La Favorita, it's certainly a reasonably priced and reliably decent restaurant to attend for quality Italian food, and you can't really go wrong with anything on the menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1uqTfcwaDUukhBXeGr9mlg",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom. Photo from vittoriarestaurat.com",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1uqTfcwaDUukhBXeGr9mlg/o.jpg"
      },
      {
        "img_id": "HS1SqkGfXotLgTThgL7pfQ",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom. Photo from vittoriarestaurant.com",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HS1SqkGfXotLgTThgL7pfQ/o.jpg"
      }
    ],
    "user_id": "5Mujjzv-ZH6HhxT-hWCpVg"
  },
  "14Sb54M0pG6lWkQIB4tGIw": {
    "date": "4/21/2014",
    "text": "Not worth a visit. Lots of entree options but it felt like an Applebee's - with plastic menu's, oversized portions and overcooked food. Food is inexpensive but you get what you pay for. Service was good and atmosphere was average.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "fL35Nuk-Nde5BJfOD0W_EQ"
  },
  "HZpG2fyws2C72QJ_9heZGA": {
    "date": "4/19/2010",
    "text": "Split across two levels, and very rarely empty, Vittoria on the bridge is a family owned Itaian restaurant which is great for a friendly family evening meal.  Indeed, my family and I dined here recently and the experience was a great one - from the moment we arrived we felt welcome and cozy, with our waiter (whose name escapes me) showing nothing but helpfulness and friendlyness. It was only after our orders had been taken (from a vast and very tempting menu) that I realised how full Vittorias was. Despite this, the service was impecable, and the food was on our tables very quickly. The carbanara that I had ordered was sublime, rich and tasty. Each of us exclaimed that our own food was amazing, and indeed it was.  Vittoria is a great place for you and your family to go for a beautiful Italian meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QJOBOklqkx9me7rdF6u9ZQ",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QJOBOklqkx9me7rdF6u9ZQ/o.jpg"
      }
    ],
    "user_id": "SxV1Jq7UANuSYpn42JXvOA"
  },
  "mhygh6DrTeMVBp5Ir3oiTw": {
    "date": "4/1/2010",
    "text": "One of the three restaurants in this family-run chain, Vittoria On The Bridge is always busy and it's easy to see why.  They claim to be \"Edinburgh's happiest Italian family-owned restaurants\", and when I ate there with a friend lately our waiter was no exception. Despite the fact that there was not an empty table on either of the two levels in the restaurant, staff were attentive and yet efficient, particularly given the number of large groups to attend to.  This would be my only criticism of Vittoria - being so popular with hen nights and birthdays of various ages, this is not the place to go for a quiet pizza and glass of wine or two.  Nevertheless, my Tuscan Bean salad (7.95) looked and tasted amazing, not only due to the huge variety of flavours and ingredients but also the generosity of the portion size. Having opted for a healthier choice from the menu, I couldn't help but feel jealous of my friend's pizza loaded up with roasted vegetables and 3 types of gooey cheese.  Even if you can't stomach a full italian dinner portion, you should go just for the home-made ice cream on display by the entrance; my personal recommendation would be Peanut Butter Crunch and i will definitely be heading back soon for some more...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ks1cvjSEwSYkH-4MbyozSA",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom. image courtesy of www.vittoriarestaurant.com",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ks1cvjSEwSYkH-4MbyozSA/o.jpg"
      }
    ],
    "user_id": "oEshN5oq98_g23MvEnRc5A"
  },
  "snTqcqFcoV0CdQw2VHBf1A": {
    "date": "6/30/2013",
    "text": "This was some of the best Italian food I have experienced. Tried both the \"Lasagna di Mamma\" and the Vittoria Pasta. The Vittoria Pasta was out of control good... The ambiance is hip with a modern feel but the service and food feels homestyle and comforting. They have a great list of wines for amazing prices and a large selection of gelato flavors for dessert.  While in town, we stayed on the Royal Mile, walked to the restaurant for dinner, and then hopped a good number of nearby pubs to end the night. I would absolutely go here again, even two nights in a row.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0rSHOgzAxkT67ZlDAgFJww"
  },
  "RYK6LoILvjCt4BoVhWT1gQ": {
    "date": "7/29/2016",
    "text": "Amazing food and fun change from the pubs. Wine was great too and staff very friendly and helpful. Nice atmosphere too",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fpJ9L4yJVZskxTFNCdELuQ"
  },
  "5icVwTJhTFoSWs-ZSU2hXg": {
    "date": "6/7/2015",
    "text": "One of the best Italian restaurants I've been to! Brilliant customer service, amazing atmosphere, delicious food! Ideal for a lovely dinner in the heart of Edinburgh Highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t7GO2ONK4zhaRS8tZj8EJw"
  },
  "yRjlhYz-xSLG3VqzPwXzMw": {
    "date": "5/30/2016",
    "text": "One star not because of the food but just plain business sense. Don't tell us you close at 11PM only to arrive and be closed at 10PM. Im sure the food is amazing and the ambience was great but this is very disappointing.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oezSIUtBTvxIu1n2UoxXPA"
  },
  "CLJJoWltX39OQjeg6tHvVA": {
    "date": "5/6/2012",
    "text": "Oh, wow.  This experience was just that: an experience. The food was absolutely lovely, I had the salmon, my friend the tonno and her son had the pizza margherita for children. Now I want it noted that this place is incredibly child-friendly in a non-pandering type of way.  The staff, after we were seated, came over with a balloon for my friend's son and they continually treated him very well. He got a lot of attention and was treated like an actual person instead of a child (which in restaurants makes all the difference).   Of course this won me and my friend over immediately. Now, the whole experience was just very pleasant. Attentive, but not overbearing, present but pleasant. It was a dining experience the way it *should* be. Something that actually left me refreshed instead of exhausted. And that never happens.  Go here, eat, rejoice!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6YW-IEZzzVaIYpteJlgy9g"
  },
  "U6wmAMnFjysp5FO-1ZNH0g": {
    "date": "12/31/2017",
    "text": "Amazing food. I'm from Texas and when looking for good Italian food this place is awesome. Fantastic taste. Traveling with a Gluten Free person and this place does it right. Any pizza or pasta you want can be made gluten free. Looking for good Italian...stop in here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k8BThB11SS-DQDTl--kG8Q"
  },
  "ep7c9vpDqblp7U0_8h--Dg": {
    "date": "11/6/2015",
    "text": "The excellent reviews inspired us to try it for lunch with a veggie cousin. Enough options for her and the lunch menu is superb value -  starter and main for 10.  A calamari starter could have been crisper and the batter lighter, but wasn't chewy which is always my  worry.   For main, egg parpadelle with mushrooms in truffle oil was so lush that my sister kept helping herself to it. Oi.   Peanut butter ice-cream was pleasing, esp with the tasty textural addition of chopped peanuts. Service was speedy and attentive and the place was buzzing. Overall, molto bene.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wVXje5_qclPCKXlJcy-ysQ"
  },
  "rNi0jOKsh04MWDcAhySuBw": {
    "date": "8/16/2016",
    "text": "Excellent Italian food all around. From the calamari to the pizzas to the pastas to the foccacias to the veal and eggplant parmesans. Great service, good wine, and nice ambience too. Highly recommended. Fair price, but not cheap.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "B7VzLfDEhEzIdjw7dsqOyA"
  },
  "VdaxyKVT5-CVaqWlKSaoMA": {
    "date": "7/20/2015",
    "text": "Great food and service.  And 2 for 1 Monday's and Tuesday's in July when you reserve online",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rtbmvKFk-YynAyotim7LEw",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom. Dessert",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rtbmvKFk-YynAyotim7LEw/o.jpg"
      }
    ],
    "user_id": "L69ot4p6L9LTdY0PaTGxCA"
  },
  "Rwh67TuJGdC_HdbBVsNkDQ": {
    "date": "1/10/2015",
    "text": "Saturday lunchtime deal was brilliant. Half price deal sale was a bargain with amazing food. Service was great and quick, a delightful dining experience.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "K85OW-nCBPbI5TRmQFJw3A",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/K85OW-nCBPbI5TRmQFJw3A/o.jpg"
      }
    ],
    "user_id": "-0wDYXGaz2mrHd6fQUvPHQ"
  },
  "GoWVhcxvai61ObO9XMWggQ": {
    "date": "11/20/2016",
    "text": "Very inviting environment with very good food. Has the feel of a family owned and run Italian restaurant (Vittoria is one of four owned restaurants). Staff is super friendly and on top of taking care of all aspects of your experience. Not overly pricey, with just the right touch of classiness.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zftRUotk055KecZpZ9nz-w"
  },
  "vpX4j2eVCLaQGRbXagT4JQ": {
    "date": "2/8/2015",
    "text": "Despite the issues with their sound system (music kept going on and off), we had a good and reasonably priced dinner that comprised of calamari, focaccia and spaghetti and meatballs. The wine was also reasonably priced, so we just bought a bottle!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ArdBetF-pM3Y4eP1pgNPA"
  },
  "NH1VGE1_IWEGVi6qyzoHIg": {
    "date": "5/5/2016",
    "text": "Great little place.  I sat on the cafe side of the restaurant for a nice front window seat.  The pizza was fab and the Moretti was fresh and tasty!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GX47N3e3RmEB85M_jIQgVw"
  },
  "Ysy149nMOAG11tq_Dv0WNg": {
    "date": "7/19/2017",
    "text": "I wish we had found this place earlier in our visit, but once we did we went twice on the same day!   Phenomenal service and fantastic food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s_jKjogcriDDzjX0UdQCPw"
  },
  "LhXzxPZ3D3tNMEJauE4OJg": {
    "date": "5/23/2016",
    "text": "Extensive menu fantastic food great location fantastic service, a 6 page drink menu, a 9 page food menu",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XGkvbGM2fgA3Az-JpqWAiA"
  },
  "4OXuEDUUNJubGrArBUIa7Q": {
    "date": "12/29/2013",
    "text": "Met a friend here for lunch and we were both well impressed. Service was good and fast, so fast they also cleared my chai before I was done drinking it!  Pasta was perfectly cooked and well seasoned. Though you'd expect nothing less from this Italian 'chain'. I've been to La Favourita a few times, but this was my first visit to Vittoria and I wouldn't hesitate to return.   Prices are reasonable for center of town and portions weren't too bad, tho it was definitely a 2 course lunch. Think I would have left slightly hungry if I hadn't had dessert.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "J6E6NSpJqMBib9ydbchicg"
  },
  "q3TuuOAwTjHhqCCCvEMNJQ": {
    "date": "11/6/2013",
    "text": "When my friend suggested Vittorias for dinner, I automatically went to their website to check out if they had a mailing list and they do. I joined this and got a discount email sent to me for 50% off main courses.  The restaurant was nice although when we were shown to our table, it was wedged Inbetween two other tables and I asked if we could have another table less crowded and we did get one which had a great view to the kitchen so we could see our food bring made.   It's nice to see Italian waiting staff and they were very polite and smiled. My problem was that they didn't know about the ingredients of their dishes. As I am vegetarian I don't eat Parmesan cheese as it has rennet in it (calves stomach lining) but the dishes labeled with a \"v\" pretty much all had Parmesan in them. I ended up playing it safe with a pizza as they couldn't conform some ingredients. The same trouble came with desert and the ice cream had animal fat in it do I ended up with a liqueur coffee instead. Now my food was lovely but it seemed a great effort for pizza and a coffee!  My friend I was with had no complaints at all (but she eats anything)   I have given 4 stars as what I had was nice but the staff need to get a better knowledge of the ingredients",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "rVEQ7nG4Bo7utMcqURxaIQ"
  },
  "aCYxRvrq4dSHwsrzGqmcbA": {
    "date": "9/15/2013",
    "text": "Go for the pasta but return again (and again and again) for the gelato!  Best salted caramel gelato ever!  My dear friend and travel companion had been trying to get me to Scotland for years, but this bonafide Francophile had serious doubts about the ability to obtain non-fried sustenance while in the land of William Wallace.    No, haggis does not count!  Sheep's liver and heart stewed in blood and shoved into the stomach lining of a slaughtered animal is NOT adequate sustenance - unless you're Hannibal Lecter *cue creepy inhalation and pour the Chianti*  I know!  I know!  It's not fried, but it looks like a swollen, hairless testicle and I've never been the sort who enjoyed the sensation of sweaty, swollen, hairless testicles in my mouth.  Not that there's anything wrong with that sort of predilection.  No judgement here.  If you're Scottish or a haggis aficionado, silence the lambs, pour the Chianti, and carry on.  Sorry, but I sometimes digress.  Especially when I've forgotten to take my ADD medication - ooo, look at the pretty butterfly...  Back to my visit to Vittoria's.  After multiple trips to France and one failed brief sojourn into the borders of Scotland I decided to yield to my friend's suggestion and visit Edinburgh.    Day one -  both of our meals were consumed at Benny's Fish and Chips off High Street.  The fish was light and flaky, the chips were... Wait!  I'm supposed to be reviewing Vittorios, aren't I?  Sorry, another digression.  Where is my ADD medication?  By day two, I needed something more than deep fried fish and potatoes swimming in vinegar.  I needed real brain food: pasta and chocolate (Not together.  That would be gross. Wouldn't it?  Hmmm, let me ponder that coupling).  I pulled out my iPhone an Yelped restaurants. Vittoria's came up first - higher rating, closest proximity.  I scanned the reviews and...SCORE!  Pasta!  The facade was sleek and modern.  The hostess friendly and welcoming.  The atmosphere hip and arty.  My friend ordered chicken Parmesan (chicken pounded thin, breaded, and coaxed into a bath of bubbling oil - she's more Scottish than me and likes her food fried, even her Italian food).  She said it was  delicious.  I believe her.  I had their special - pasta tossed in a red sauce of vegetables and spices and lovely, odiferous garlic.  It was divine.  I washed it down with a glass of Chianti (feel free to make the creepy Hannibal Lechter inhalation noise) and then took a moment to appreciate the shaft of golden sunlight streaming in through the sparkling front windows.  Sunlight in Edinburgh in the middle of Spring? I took it as a blessing from the Gods of Gastronomy.  (Wahhhhhh.  Cue celestial voices singing).   Obviously the unseen forces of food were pleased with our decision to abandon the fried food and swollen testicles.    And like any beneficent, generous god, Gastronomy just kept giving.  For, after appreciating the shaft of celestial light, my gaze fell upon an even more heavenly site: Vittoria's Gelato Stand (conveniently located beside the pasta bar).   As giddy as someone entering the pearly gates, I sauntered (Don't laugh - sauntered is a highly under-appreciated word that should be widely embraced by the English speaking populace.  Think how much more you would respect Kim Kardashian if you heard her utter, \"I think I shall saunter to Rodeo Drive and drop several thousand Gs at Versace.\")  ...I sauntered over to the gelato stand and pressed my greedy little face to the glass.  Cherry.  Chocolate. Coconut.  Which flavor to choose?  I opted for Carmelita - creamy vanilla bean flecked gelato swirled with ribbons of caramel and sprinkled with bits of melt-in-your-mouth caramel.    Random awkward confession:  I was a shameless glutton. I visited Vittoria's Gelateria several times over the next few days and consumed an unsightly and embarrassing amount of caramel gelato.  I even skipped breakfast and lunch in favor of a gelato brunch.    There.  I said it.  Judge me if you will.  Call me a glutton.  Call me a sugar addict.  People have said worse things about me, and I'm okay with that because at least nobody can accuse me of seeking orgasmic culinary delight by mouthing hairless testicles.  That's a legacy I can be proud of.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "cFh-Ga9ETgA6l5Df46U0TQ"
  },
  "xmB9U29DXuN8Q9dCHWS_Fw": {
    "date": "3/24/2014",
    "text": "Nice friendly welcome, maybe too many choices on the menu! Choices for gluten/ wheat free diners.  Nice early evening dinner",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "c5yp5hxwC1N98MjbV2LyWQ"
  },
  "ANAJsDS5IeAmWCQ0fQOnqw": {
    "date": "9/5/2013",
    "text": "LOVE my Yelp app especially when I'm looking for food in foreign places.  My friends and I were about everywhere during the Fringe and wanted to have dinner that didn't involve standing on the street corner.  I did a quick search and luckily this Italian place was nearby.  We put our name down, decided to get a few drinks across the street.  I think most places in Edinburgh were really busy so waiting was expected.  I LOVE that they give you the option of having half portion of pizza and pasta if you can't decide.  I'm always struggling between the two so it was great to have the best of both worlds.  I had the Ortolana pizza (Yum!) and veggie lasagne (was more like a lump of cheese with veggies... probably wouldn't order this again).  I think the pizza was definitely better than the lasagne but maybe I should've tried the meat one.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "C1WsGwpZzMxKJSKsDwlDPw"
  },
  "63TjQY8v1_56Ipcaoby0bw": {
    "date": "10/31/2013",
    "text": "This place is a regular go-to for office lunches when people join, leave or even just because.  Service is usually prompt, the quality of food is consistent & the price for the lunch menu is spot on.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "R9UNH0rb3a_glQlk4ylKCw"
  },
  "MVfTygtUw7FAL-h-x2w5CA": {
    "date": "10/23/2015",
    "text": "Much better than expected. After disappointing pub food, we figured we'd try Italian, and we're pleasantly surprised.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EhWNPZy0Q2VoCM25nS2liw"
  },
  "4mncSuh_XTZHN_yUDaAfRA": {
    "date": "1/25/2016",
    "text": "Great Italian restaurant. The lunch menus offer great food at very decent prices and they also offer a kids' menu. I had the calamari as the starter, which was ordinary, and salmon pasta dish which was good. My wife had the mussels, which were great and the meat ( I am not sure which specific dish she ordered) but it was cooked to perfection, tender, soft and so tasty. Including the three menus, one desert for our son and one for us, two glasses of wine and an espresso, 40 pounds is a deal. Good and fast service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iTrAqc836rxTS3NBwrk-rQ"
  },
  "CPE-kWy7ZsFtqIVHQXjPlg": {
    "date": "5/1/2015",
    "text": "Since our army buddy was in town, we booked a table for 13 to get together again. Our 'last supper' could not have gone better! I often find that a group booking can be hit and miss in restaurants, which is probably why many restaurants opt for the 'group menu'. Not Vittoria! We were placed at a lovely long table at the back of the busy restaurant, and were all presented with the menus. The waiter came by various times to ask if we wanted a drink, whilst waiting for our friends to arrive, which was very attentive! After settling in, we ordered some wine which arrived promptly, and ordered our starters and mains. The food came fast, and all in one go, which is really quite difficult to do for such a big table! Kudos! We never had to wait to order, water was replenished, wine was poured, empty plates were cleared in time - excellent service! The food was very good, better than I expected to be honest! There was a great choice, and I had the seafood pasta. The portion size was quite large for me. The dishes are simple, Italian food, and the presentation of the food is fine. I will definitely recommend this restaurant to anyone who wants a good group experience.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8ER44ODdYnmWtX8eOTOcdw"
  },
  "aVBpONjjR2hCRxyN1WVFWA": {
    "date": "3/31/2013",
    "text": "Haven't been here since giving up gluten, though I came here a few times in the last few years. The first time was very much a motivated visit, the other times I just ended up coming here as a part of a group.  The location is fantastic, the interior is very smart and comfortable, the ambiance is quite nice. The menu is pretty exciting, offering plenty of seemingly authentic Italian dishes. I saw focaccia, caponata, homemade ravioli, risotto, pizzas, salads and pastas, calzone, polenta chips, and much more... The prices came as the first shock. 9.45 for a mushroom risotto? 8.50 for spaghetti aglio e olio. 9.95 for a calzone??? I realize that Italian restaurants can get away with such high prices in this country, but I don't understand why. Flour is cheap, tomatoes are relatively inexpensive, and pizza requires very little cooking time.  The food is rather disappointing, considering the prices and pretensions. On one occasion I had a pizza here. It was small, the toppings were sparse, and the base wasn't that crispy. I had the vegetarian lasagne, which was just two layers of lasagne sheets swimming in a dense creamy cheesy sauce, which was quite nice, but not really what I was after. The ice cream here is extremely disappointing, the pistachio is very green and obviously artificial. It's a world away from the extremely creamy nutty, earth coloured pistachio gelato in Italy. I once took a tiramisu away, and found that it was just a creamy pile of... sweetness. I couldn't taste the coffee or the marsala wine. It cost 4.95. I'd rather have Robbie's mother's recipe, thanks.   Though they offer gluten free pasta and pizza, I don't think I would be inclined to return, having read Claire L's review.    It's only worth trying out this place if you have the Vittoria card which offers a 50% discount on certain days.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "HvQ576LJm6i6QZuTwl7WVg"
  },
  "4Wkk3uyu5TeJtClCE2f7Jg": {
    "date": "9/9/2018",
    "text": "In Edinburg for a couple of days from the US.  Looking for a good Italian restaurant and followed Yelp's suggestion here at Vittoria.   Wonderful meal, service was ok.  But do recommend if you are in town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YiGd5DEbR33aOdAXhZNzuA"
  },
  "etkQ30wib7sk8I6lBRLnyA": {
    "date": "5/8/2017",
    "text": "Delicious food and a good atmosphere   I ordered a yummy cosmopolitan cocktail, polenta fries with Parmesan and truffle oil, Arancini al Ragu and the dinner special of Lobster ravioli with prawns and mussles in a white wine sauce for my main. The arancini was a tad crumbly and could have used a little more cheese or sauce to bind it a bit better. The polenta fries were delicious especially with the white wine sauce from my lobster ravioli!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tn1rR8dgV42mUbUw_22soQ",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom. Lobster ravioli with prawns, mussles and a white wine sauce",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tn1rR8dgV42mUbUw_22soQ/o.jpg"
      },
      {
        "img_id": "Di10LrYAYjzjCkDqV0hf5g",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom. Polenta fries with Parmesan and truffle oil",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Di10LrYAYjzjCkDqV0hf5g/o.jpg"
      },
      {
        "img_id": "6NlzzvYFKhA_xYTEASGSnA",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom. Arancini al Ragu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6NlzzvYFKhA_xYTEASGSnA/o.jpg"
      }
    ],
    "user_id": "Tdpy6EfMl3RrlEwyAk2j6g"
  },
  "nYIpMkMGkemLx13m9pib7A": {
    "date": "7/10/2016",
    "text": "This place was amazing! The hubs and I visited Edinburgh on holiday and came to this place on a whim. Per my husband, this was some of the best Italian he ever had.  The restaurant is quite large and is also a little loud. So if you would like a quiet intimate dinner this is not the place. However, if you would like delicious Italian food, you need to go here.  We split a pizza and pasta in addition to a few starters and everything was amazing. The pizza dough was so good and the toppings were fresh. We ordered a slightly spicy pasta and it was wonderful. I love when there is a bit of heat to my food.  The servers were delightful. Continually checking up to see if we needed more bread or water - especially as the pasta was a little spicy. They provided a phenomenal experience and if we are ever back, I am sure we will come here to eat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "y_LdP8n1VcwEzoNLndbYxA"
  },
  "TPGRCMhNcPhRXKCVrbJNDQ": {
    "date": "5/20/2018",
    "text": "A great experience throughout. Ambiance was fun, the calamari and fried zucchini appetizers were a bit small but delicious. Carbonara was excellent, tortellinis homemade and perfectly flavored. Our waitress, Katrina, was attentive and very friendly. Great Montepulciano. Would highly recommend this restaurant!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QOm3znl0a3fw_u0wDkz4zw"
  },
  "11iQ6JFkVd2Y1qUncAnmyA": {
    "date": "9/29/2017",
    "text": "Decided to check out this place based on yelp reviews. They offered many different pizza options so went with the calabrese. My waitress was great and gave me her food and wine suggestions. Pizza was fantastic! Also got an order of tiramisu which was really good too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PTUtZPxGrAdPcACxGnKZyA",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PTUtZPxGrAdPcACxGnKZyA/o.jpg"
      }
    ],
    "user_id": "p8QnLOOnUGCjGyqz5JsLpg"
  },
  "8eUUf2qrZub8zISPeszP1A": {
    "date": "12/29/2017",
    "text": "Was in a bad mood. Went to Vittoria. Left happy. Found a tenner on the street, probably unrelated but it was lucky anyway. That was a good day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xdbIflUE981IHH-ZKToGHA"
  },
  "oJk278x1nNYVYI5pHBYUYw": {
    "date": "4/7/2018",
    "text": "We went last night for dinner and were back again today for lunch.  After 10 days in the Highlands, my son was happy to find some fantastic pizza to enjoy.  I had the gnocchi last night and it was really delicious.  My aunt had the chicken in cream sauce which was amazing.  Definitely worth a go.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XICAPr1QNWSeMd6Wsog4iw"
  },
  "aNO61hPoSrqWDDrVvOKdCw": {
    "date": "8/1/2018",
    "text": "This was a decent attempt at Italian food.  It was interesting that when any clearly tourist asked for \"still\" water they were given a 5 bottle Acqua Panna, however when a local or near local asked for the same they were given a bottle of free tap water, seemed opportunism at best.  The food was okay not off the charts but they did have gluten free options which some of us needed.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DnwKQUaouQYs4yg1vbm10A"
  },
  "MWszQP9lEKcbJG_ddTgngA": {
    "date": "7/29/2018",
    "text": "Best gelato ever!  Stopped in for a quick break for gelato. It was the smoothest, creamiest gelato I have ever had. From now on all gelato will be compared to the pistachio at Vittoria!!  Grazie!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KQqUCJds4n9J92uAImXlUg"
  },
  "nmINoXansjPzWvAN2vayBg": {
    "date": "2/19/2018",
    "text": "It is very hard to find somewhere that perfectly can mark an occasion, as well as this place does. If you're trying to impress on a first date or celebrate an anniversary it is the perfect place to do so. On arrival we were brought to our seats very quickly, after having been greeted directly at the door, we quickly got a drink and relaxed. Our server was expedient and really was attentive. The managers or possibly owners frequented to make sure we had everything and seemed actively involved in everything. To top it all off.....They were actually Italian.   On to the food... I had the macaroni croquetes which are incredibly  and the sauce with which the paired it was amazing. For a main I had lasagne, of which is a relatively common and mostly messed up dish.....it was phenomenal. And that's an under statement. We also had some beautiful pasta and many many lovely cocktails.   Service -10  Food - 10  Drinks -10  Restaurant itself- 9",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "79pjqxPEyDTco0pxXHvPdA"
  },
  "2NdHrnElsqWMeZQ0WY1sNQ": {
    "date": "6/30/2018",
    "text": "This food is mediocre, it has a mass produced vibe with bland flavors. Also overpriced for what you get. I understand there really isn't great Italian in Edinburgh, but recommend going elsewhere.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xF-IMcmTtBTv-gpdNON1TA"
  },
  "vKTi_dc9-DQ9ImZlvvGPJw": {
    "date": "9/11/2016",
    "text": "I don't understand why people think this is legit Italian food. The first red flag was the staff REALLY wanting us to eat there and assuring us they had a table. The second red flag was low quality grocery store olive oil and vinegar that came with bread you had to pay for. The gnocchi fungi and spaghetti carbonara were swimming in butter and salt. The pasta was not fresh and the sauces tasted pre made. It was just so heavy it was almost inedible. When we said we did not want to take the leftovers home (no place to keep in hotel anyway) the waiter tried to make us feel guilty. I can't say for sure, but I bet there is better Italian in Edinburgh.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_0SMKt29nvE8jVdOn6ZkhA"
  },
  "3kJDk-4BaynxtHvXCjCI0A": {
    "date": "11/16/2015",
    "text": "What a gorgeous little Italian restaurant. I can be a bit of a tough critic - but I really could find no fault with this place.  The food here is amazing! I'm a big Italian food fan and this was up there with some of the best I've had. My fiance and I ate 'meta meta' style; half pizza and half pasta (such an amazing idea). The food was so delicious! Perfect seasoning, cooked to perfection ahhh my mouth is watering just thinking about it. The portion sizes were huge! You won't leave this place hungry! My only regret? Not having enough room for the yummy sounding ice cream.  We accompanied our gorgeous food with cocktails. These too were on point. The whole experience was fab - lovely staff and service alongside wonderful food. Just what you want! And better yet it was all very reasonably priced.  As I say - I rarely give 5 stars but the evening was perfect and exceeded all expectations. Thanks Vittoria for a wonderful meal to celebrate our anniversary!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QAEzMm-CVw3dvuWTP3FEHA",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom. Meta Meta (pizza and pasta)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QAEzMm-CVw3dvuWTP3FEHA/o.jpg"
      },
      {
        "img_id": "U9-7URjQ1iw0DBMLQlP1_g",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom. Cocktails",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/U9-7URjQ1iw0DBMLQlP1_g/o.jpg"
      }
    ],
    "user_id": "ZW08feFLVnmoqpUfYzS0jw"
  },
  "Lk2k8SHqsGSNWzGse5UVqA": {
    "date": "12/23/2017",
    "text": "My girlfriends and I decided to stop in for some Italian food. We walked into the restaurant and it was empty except for one family and a group of guys that were leaving.   As soon as we sat down our waiter was quite rude to us. He asked if we wanted drinks and we said that we wanted water. He asked if we wanted any other drinks and we said that we needed to look at the menu. He seemed annoyed about this and would not leave until we ordered drinks. He asked us if we wanted still or sparking and we said still (assuming that it was tap water). Our waiter continued to patronize us throughout our meal.   I asked for the check and saw that we had been charged 4 pounds for water. I asked the waiter what this was about. He continued to argue with me about the water. I said that I would pay for it, but I'm the future they should give tap water as an option and avoid tricking us into paying for water. The waiter and the manager spoke about us behind the table in Italian (which my friend speaks so she understood them). Eventually the water was taken off the bill.   Despite all of this, the food was delicious. They need a major staff change. If you want Italian food, keep walking.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rK4JJ01HigYLxYCFQ_u8Qw"
  },
  "8l-RIhAf8TTqc2j6QSXbLA": {
    "date": "11/22/2016",
    "text": "Highly recommend this!!! We ordered the lunch special, the spaghetti and mussels and ketchup for the onion rings are really good!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fG1RDfDz239S52Txsw5jww",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom. Highly recommend! We ordered lunch special. The spaghetti and steamed muscle and ketch up for the onion ring are really good!!!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fG1RDfDz239S52Txsw5jww/o.jpg"
      }
    ],
    "user_id": "sPyy-TQT3mW1H1CfMrNOdw"
  },
  "A277DMhuJHVjRCNpsT0x7w": {
    "date": "9/14/2017",
    "text": "Amazing Italian, excellent staff. Highly recommend.  We started with the bread and carpaccio, and had the spaghetti and gnocchi for the main.  We would definitely come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6zz6PJInxl7W8LuNODrzZg"
  },
  "0J6a-5wi-iII7_SyibnRJA": {
    "date": "1/16/2016",
    "text": "Desperately racking my mind for somewhere to go on Saturday night for dinner with a group of friends, I settled on choosing an old favourite - Vittoria's. Having been out of the Edinburgh circuit for a few months now, I'm already seeing new places popping up that I don't recognise, which look exciting - but sometimes you just need to go somewhere you know you'll get a good meal. And this is one of those places.  The menu is extensive and will cater for all tastes - I'm pretty sure most of their pizzas and pastas are available GF too. My favourite bit about this place though is that they offer a half-pizza, half-pasta dish for when you just can't make that decision. On Saturday I had a half-Hawaiian and half-carbonara which was delicious.   The desserts list is equally impressive, with a wide selection of ice creams and sundaes.   It's normally busy here (a good sign!) so I'd advise anyone going to book in advance. Lovely atmosphere too, and the staff are always very efficient and attentive.   Up there with my favourite Italians in Edinburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "2b7AgGJbUgBKBGH2zOzH6A"
  },
  "ZRaUvIQ9Kx3TpOpcwKMhSA": {
    "date": "5/17/2016",
    "text": "Hubby's carbonara w/mushrooms was very good. My Pesto w/chicken was good but it was sort of a light red sauce Pesto which was very unexpected and not the taste I was looking for. The red lighting is a bit distracting as you can't really see your dinner in True light. Good portions and good prices. Garlic bread was too thinly sliced, too oily and not toasted enough IMO. 4 stars for Carbonara & Service. 3 stars for the rest",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "F8hL6oaSOOhKPhKewKhF2Q",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom. Red lights are not very good if you want to see you dinner ingredients",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/F8hL6oaSOOhKPhKewKhF2Q/o.jpg"
      },
      {
        "img_id": "0M6h77jznePq5pCCwqrT8w",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom. Carbonara w/mushroom. Very good!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0M6h77jznePq5pCCwqrT8w/o.jpg"
      },
      {
        "img_id": "D7ceF_lsI_xbnzXujxXLhg",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom. Pesto",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/D7ceF_lsI_xbnzXujxXLhg/o.jpg"
      }
    ],
    "user_id": "_w-ebdXf59sdH7f8u6JIXA"
  },
  "zLVZNYnuaBKJELMvjPpysg": {
    "date": "6/21/2017",
    "text": "Went to dinner here tonight while on vacation. The waitress was friendly & the food was excellent. We had the bruschetta, mac and cheese, pizza, & gluten free pasta Milanese. We all enjoyed our meals, the portions were generous & the pizza was large enough to split with two people. My son said the mac and cheese was excellent some of the best he's ever had. We finished the meal with the caramel ice cream. It was very rich and sweet. Would definitely come back for dinner here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6BWeoC5wvzT4m1Mz4jn8mw",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6BWeoC5wvzT4m1Mz4jn8mw/o.jpg"
      },
      {
        "img_id": "Mfw_WSaKP221jyOijNtduw",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Mfw_WSaKP221jyOijNtduw/o.jpg"
      },
      {
        "img_id": "se0lQ1yC0k0rAh7jepIpAw",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/se0lQ1yC0k0rAh7jepIpAw/o.jpg"
      }
    ],
    "user_id": "n7Gpd6n6FiqJjjKdfgCi9A"
  },
  "FpZmW5rwjSm11x31t2w6Mg": {
    "date": "7/4/2017",
    "text": "This place has a great atmosphere, great employees, and amazing dishes! The food is really delicious! I got the Fusilli Con Pollo E Pesto and was not disappointed. We were all delighted with our meals. For dessert, we had Sticky Toffee Pudding. It was a great way to wrap up our meal. Yum! Our waitress, Klara, was very friendly and used a lot of initiative. She was enthusiastic and on top of things. When we left upon finishing dinner, my brother left his umbrella and she ran out to return it to us! We are very pleased with our experience. Highly recommend this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "500_sZymEPV79peR8R8DTQ"
  },
  "oWPF0bIKOsZNd41QfBhICA": {
    "date": "4/26/2019",
    "text": "Just WOW! My wife and I shared the 2 items-pasta/pizza combo. We had the bolognese pasta and tricolore pizza. We were dubious about rosemary potato on pizza but it was very good! It came out from the kitchen very quickly! Had an Italian Rosso wine called Biferno that was great for the price! We shared the lemon sponge cake with raspberries. It was a great finish!  We were full up on Cullen Skink and fish and chips. Needed a break and found a great spot that we may visit again before we leave Edinburgh! A note about the waitstaff: Sonia was our server. She was charming and patient and made good suggestions! She's a gem! Outstanding experience all around!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "sdK6XxWP3J-6LI79He4Psw",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom. Delisia lemonari ( or something like that )",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sdK6XxWP3J-6LI79He4Psw/o.jpg"
      }
    ],
    "user_id": "Q5dT6ylP50X8G_QWCNMEZw"
  },
  "OccDtM5zUErh8A2ru2SU-Q": {
    "date": "6/17/2019",
    "text": "There are so many amazing Italian eateries all over the world, in Italy, in America, sometimes in the most unlikely of places. But, for every fabulous restaurant there must exist an opposite, a really horrendous restaurant somewhere to counterbalance each great restaurant. Therefore, I suppose there exists an absolute worst Italian restaurant somewhere in the world. And I think I just found it in Scotland!  The sleek, modern interior draws in tourist after unsuspecting tourist, thinking they're entering a fine Italian establishment. Take advice from an accomplished cook who grew up in a family of chefs. This is really bad Italian food!  Our family always starts with calamari, and what we ate was unequivocally the worst calamari we have ever tasted anywhere in the world. Yup, 79 countries visited, thousands of restaurants visited, and this is THE WORST appetizer in my life! The calamari was chewy, meaning it wasn't prepared properly, the batter was horrid, and it was obviously overcooked. Absolutely inedible!  Next I attempted to survive a burrito-shaped chicken stuffed with cheese and wrapped in ham. Horrible! Quite possibly the worst chicken dish I've ever tasted. The chicken was dry, the cheese tasted like some sort of processed liquid cheese oozing out of the inside, and the ham was as tough as plastic! Yikes!!!  My wife had pasta, but it was so oddly lumpy and undercooked that it was essentially inedible. The waiter asked why she hadn't eaten her meal and she explained. He turned and walked away completely unconcerned.  My son had spaghetti and meatballs, his favorite dish. He's a big eater, so he always cleans his plate, especially this particular dish. He got halfway through it before losing the battle, stating he could no longer eat this food!  I attempted to eat a side dish called potato gratin. It consisted of lukewarm potatoes mixed with what I think was milk and utterly tasteless cheese. It was even worse than the ham-wrapped chicken burrito-looking thingy. Yuck!!! It's still churning in my stomach as I write this review! Horrendous!!! We heard several other tables complaining about the quality as well, so our family sentiment was definitely a theme.  Do not eat here, whatever you do!!! You've been warned!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vbTVyyBl88xVRlTQcBXTUA"
  },
  "2GfSyZIz1YCMyT5brkp67A": {
    "date": "9/17/2019",
    "text": "Looks good from the sidewalk and they talk a good game. Food was incredibly average, maybe less than average. The service was worse.   You know the service was bad when the server apologizes for the bad service when he hands you the bill and the manager says Sorry as you walk out the door instead of good night.   If you want authentic Italian keep walking or hold your cravings til the next day.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NSiGALenWXxDJvTwXZN6GA"
  },
  "t2GMrmEpq67WVeW6mdoPJQ": {
    "date": "9/15/2019",
    "text": "Loved this place. The staff was friendly, the food was delicious, and the decor was smart and modern. Would definitely visit again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CQLlqO3JldthX_SgUqSBpA"
  },
  "05mrEYpURPpsi6M0DBK-Nw": {
    "date": "6/18/2019",
    "text": "3.5 stars really. A good Italian spot close to the Royal Mile. It has a large capacity, so that may be a reason why it wasn't hard for us to get a seat on a Friday night (although it was busy). The place was nice (a bit bright, maybe), service was good, and we enjoyed the food. We had the tagliatelle bolognese, tagliatelle Vittoria, the 1/2 and 1/2, with Margherita pizza and gnocchi, and fiocchi pasta with cheese and pear. Just a few dings - the focaccia appetizer tasted great, but it was flat, like pizza crust thickness, instead of what is typical. Just a little strange. Also, some of the drinks and dishes were not served together, so some had to wait a bit, although not so long that we wondered what happened. For dessert we had a tiramisu, profiteroles, and ice cream. All just ok I would say. 3.5 stars if I could, but we had a good time, and it was a solid place, so the bump up to 4.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rcpwgWJhFVPXc17Op8kuXQ",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom. Pizza and gnocchi",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rcpwgWJhFVPXc17Op8kuXQ/o.jpg"
      },
      {
        "img_id": "6Mh8R2nPnFZwhEvW5oS3aA",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom. Pizza and gnocchi",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6Mh8R2nPnFZwhEvW5oS3aA/o.jpg"
      },
      {
        "img_id": "NvREDFQ3dGMr0vLrXRqnpg",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NvREDFQ3dGMr0vLrXRqnpg/o.jpg"
      }
    ],
    "user_id": "GstKY58wGYPCFjZOGJbjGg"
  },
  "2DU98eWLitX4Bev8lRNbTg": {
    "date": "7/24/2019",
    "text": "Very nice ambiance, very fancy. We ordered lasagna, calzon pizza, fish and chips and waffle dessert. Lasagna was the best amongst all. Fish and chips were good not crispy, calzon was not upto the mark and dessert was low in quantity.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WfsvamKxXxPHoazh8jwvIA",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom. Calzon",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WfsvamKxXxPHoazh8jwvIA/o.jpg"
      },
      {
        "img_id": "cmAnRNO7aWMgBZzdi0vacg",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cmAnRNO7aWMgBZzdi0vacg/o.jpg"
      }
    ],
    "user_id": "AR22DIvXgvWEraYpgHTzYw"
  },
  "cel8Ytz1CZLa17gA1hV6yQ": {
    "date": "6/10/2019",
    "text": "The bolognese pasta was great. Nice atmosphere and great service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L6gt9T0YH3SYXoqsNC9_TA"
  },
  "NEuUXN650ftaWpom7GLWIw": {
    "date": "11/4/2018",
    "text": "We ate here this summer as part of a large group on a Saturday night. They were slammed. It was chaotic and the food wasn't very good.  Our servers seemed annoyed the whole time that we were a large group. We pre-ordered our meal choices, and they acted really annoyed when there was a misunderstanding with my pre-order.  I wouldn't recommend it or return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3MTUmYnuqcb3jiv4nnwb7g"
  },
  "CS47L-eE-_wCUfBrvMazCg": {
    "date": "6/13/2019",
    "text": "Excellent food! We ordered the mushroom pizza and spinach/ricotta and mushroom ravioli and both were delicious.  The pizza reminds me of pizza I've  had in Rome. If we weren't leaving in the morning I would definitely come back! Service was great too and the food came out quickly even though they were quite busy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "guzhDu7GsmYB1VdXpzemrA"
  },
  "2qc83RljexDajlxuwn7Z-w": {
    "date": "7/29/2018",
    "text": "Great option for Italian near the Old Town.  We did dinner for 6 (2 adults and 4 kids) for 95 GBP including 3 alcoholic beverages, an appetizer for the adults, the \"3 course meal\" for each of the kids, and 2 mains with 2 desserts for the adults.  It felt like a ton of food for what we paid.  I loved the tagliatelle bolognese- pasta was perfectly cooked and the sauce was extremely flavorful.  The kids menu is super fun- they offer a 3 course meal for the kids allowing them to choose 1 starter, 1 main, and 1 dessert.  The kids loved it.  We will definitely return the next time we are in Edinburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uFhdYLb4OtIvqq7Kv66q5g",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uFhdYLb4OtIvqq7Kv66q5g/o.jpg"
      },
      {
        "img_id": "Vd44Wy8_tLjXXAJ2ShZiPw",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Vd44Wy8_tLjXXAJ2ShZiPw/o.jpg"
      },
      {
        "img_id": "WsROmBsI2ChFnhl69gSMUg",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WsROmBsI2ChFnhl69gSMUg/o.jpg"
      }
    ],
    "user_id": "V2LOYsvg4T97YQ5D0FNK4g"
  },
  "bHZ0GsK0zoRjzsR8xMsXWQ": {
    "date": "5/22/2019",
    "text": "Just finished eating here with my wee person and boy toy. We ordered spaghetti and meatballs, garlic mozzarella bread, spinach (creamed?), battered haddoc and chips and minestrone soup.  Every entree and side was delectable.  The pasta was perfect - not too soft or hard.  And to top it all off the staff was extremely pleasant and helpful. I wish we had found this place earlier during our Edinburgh stay.  Grazie!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fsavy60lSVeqwW09VsUEbQ"
  },
  "G4RWJOeg6oQrwuvVGh2_Sw": {
    "date": "6/6/2019",
    "text": "Not impressed. Hubs and I went here after reading good reviews on Yelp and Trip Advisor. Our garlic toast was tasty and we ate it up. Hubs' pasta with bolognese was decent and he ate it all. My chicken wrapped in Parma ham not so much....dried out. Zuke frites were cold and sent back only to return without the dipping sauce. What once may have been a quality food stop has got a little too big for its own good. Server was fab though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9G7yzkYaij8EaS5a0meixQ"
  },
  "b5O4RBcMROLc1TYyx7HG1w": {
    "date": "6/19/2017",
    "text": "I was really excited to come here - first time having Italian food in the UK! My friend and I walked in and asked for a table for 2. The guy said we could sit at the bar but there are no tables...so we politely declined and said we will find another place. Then another guy comes out and suggested that we could sit outside. Fine. It was a nice day.  I had their spin on carbonara (cream, mushroom, pancetta). It was COVERED in black pepper. Like they just dumped it in. I was very surprised...The pasta was just ok. Usually chefs over salt/pepper to compensate with lack of flavor. It was very simple, something I could have easily made at home (minus all the unnecessary black pepper).  My friend got the special (lobster ravioli). She said it seemed like there was no lobster at all. We took a closer look and there really wasn't! Just white cheese...  Dinner was over and they gave us a dessert menu. We passed and they looked disappointed?? It was odd.  I got weird vibes from the staff here. It was pretty uncomfortable and I certainly would not recommend this place for top-quality Italian food.  Disclaimer: *I'm a New Yorker, so I'm used to amazing Italian food*",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rpkB7yd0KsJcXqdzm2WdcQ",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom. Spin on carbonara. Aka cream, pancetta, mushroom. Wayyyy too much pepper",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rpkB7yd0KsJcXqdzm2WdcQ/o.jpg"
      }
    ],
    "user_id": "ZpO7BzOM2vmZcUW_m8H2KA"
  },
  "8_gv16JZNAZSfj_D9rvBVg": {
    "date": "3/8/2018",
    "text": "My husband got a half order of chicken and mushroom pizza and a half order of the original carbonara and really liked his. I ordered their \"most popular\" pasta with mushrooms and spicy sausage. It barely had any mushrooms and the sausage was way too spicy for either of us to eat. I do have to say this was our most substantial meal in Edinburgh. The wine and beer were great, and our service was great. For dessert, we ordered Tony's Banana boat. It was awesome and made up for the spicy pasta. The restaurant was very nice inside.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TaSXEbDSFK4fbXgRoYDLrA",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom. Tagliatelle spicy sausage and mushroom pasta",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TaSXEbDSFK4fbXgRoYDLrA/o.jpg"
      },
      {
        "img_id": "IN6eHNmJt6LgZnyODbAk_g",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom. Tony&amp;#39;s banana boat",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IN6eHNmJt6LgZnyODbAk_g/o.jpg"
      }
    ],
    "user_id": "jsQrtbl5y4F68dD1AyQ6-A"
  },
  "aVUmzADC2zRwvxrxBmYdsg": {
    "date": "5/19/2018",
    "text": "Delightful Italian getaway right off the Royal Mile in Edinburgh!  Every single thing we ordered was delicious, and our server was amazing!  Beautiful Italian spot and would absolutely visit again!  (The only photo I managed to grab was the Banoffee Pie, which changed me as a person. YUM!)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Xs652wceBF4Bkju8_OfmNA",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Xs652wceBF4Bkju8_OfmNA/o.jpg"
      }
    ],
    "user_id": "j5JYelFD-HBKTb5Q7EiznA"
  },
  "AtkWdKi8C3JxCNQPzUSHMw": {
    "date": "6/21/2019",
    "text": "OK but not great spaghetti carbonara.Vegetarian spouse had ravioli & she rated it 4 stars but she thinks everything is delicious. Also had mac&cheese croquettes & minestrone soup & both were very good. Wines by the glass were overpriced. Complementary bread and olive oil would have been nice touch for app & entree pricing. Service was superlative.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tDOaDdi3Zjgq7ODXnzMlLg"
  },
  "nuoOUiOHJkiUiwWfBioDlQ": {
    "date": "3/1/2019",
    "text": "We were in here in December 2017 and my son (age 11), can't stop talking about this. Great food and atmosphere. A little noisy (aka lively).  Such a fun place. I highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fL3Ot8wpDQvBwQdJlXYjdQ"
  },
  "iT7mv8wHZTB6zg9S-_IWNA": {
    "date": "2/20/2019",
    "text": "Excellent high quality food, service, and atmosphere. Came here on whim, was passing through definitely had one of the best meals here in Edinburgh. They have a 8 main lunch deal which is a steal and the staff is very tentative and friendly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vIdxS946FwKJRsTQ00PlYw",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom. Minestrone soup",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vIdxS946FwKJRsTQ00PlYw/o.jpg"
      },
      {
        "img_id": "M8z6gN5eGbe5Rl44NFDYqQ",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/M8z6gN5eGbe5Rl44NFDYqQ/o.jpg"
      }
    ],
    "user_id": "P84bkoAL9S1S_ulLwTTC_Q"
  },
  "8_aveBtOPRtEdZXUJiRykQ": {
    "date": "5/17/2017",
    "text": "Some of the best Italian food in town! I never thought I'd be eating authentic Italian food in Scotland!  We arrived for a late dinner and the restaurant was pretty empty. Our waiter Nicola was very nice and made some great recommendations.   My favorite thing about this restaurant is that they have a meta-meta option, which means you can pick a pasta and pizza and get half of each! Best of both worlds. I ordered the original pasta carbonara and parmigiana pizza. The pasta was classic! The pizza was one of the best I have ever had! Everything was made fresh to order.   Drinks: the bellini and Edinburgh bramble were fantastic.   Would definitely go back!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "yQxeimz3u29xEJdj82kJGA",
        "caption": "Photo of Vittoria - Edinburgh, United Kingdom. Meta meta - half portion of pasta carbonara and half portion of parmigiana pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yQxeimz3u29xEJdj82kJGA/o.jpg"
      }
    ],
    "user_id": "hIZiWElzEfM4Jh_xkrDVpg"
  },
  "yA0VVJ6F_ecH4-48GDyC1g": {
    "date": "8/5/2018",
    "text": "We were out of town to see the Royal Edinburgh Military Tattoo and looking for a nearby restaurant for dinner. The first couple of restaurants were full. Not only could Vittoria could accommodate our group, but the the service was amazing! Even better, the food was over the top good - I wish this restaurant was in my town!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yEUdbtCCMMcajw4XRWVVfQ"
  },
  "l01sI2ItoIZ0IqElqGo8kQ": {
    "date": "2/7/2011",
    "text": "Food was great, but staff run about brushing past you every few seconds. Too many tables, staff need to be slightly less stressful.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qoEgUNkRQI1gUtWDp8ypOQ"
  },
  "0DlIkh9r60pr9TBhDB55yw": {
    "date": "1/24/2011",
    "text": "I went here on a recent trip to Edinburgh for dinner and really enjoyed it. We turned up on the night without a booking but the staff managed to quickly find us a table even though it was busy. The restaurant was smart & modern and the service was quick and friendly. The food was a very reasonable price and I had the spicy sea food tagliatelle which was very flavoursome and came with a large variety of seafood & shell fish. I left very happy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ehuxz5eo1Yvv53PW3eowgQ"
  },
  "rCqN6JC5KPS-hZdaOCrgVA": {
    "date": "3/27/2011",
    "text": "Excellent service and food, would highly recommend, slightly better wine menu would be better, but all I all very good experience",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CFOyuhGJ2n2Rp8-dpItb7A"
  },
  "mjJrdkDD6fAutOLXabR-UQ": {
    "date": "11/28/2008",
    "text": "This is the second Vittoria restaurant to open in Edinburgh and has become an instant hit. The unit it occupies has had a few occupants in recent years but Vittoria's is here to stay. The food is very good value and tasty - great, authentic Italian food from a friendly family business. The lunch menu is especially good value with small pasta dishes at around 5-6 and filled rolls (usually ciabattas) for 4-5, all of them tasty with interesting and delicious combinations of fillings. The staff are very accommodating and there is so much space that it is always possible to get a table for two if not more, although for larger groups it is advisable to book. The service is quick and the staff friendly and eager to please. There is a takeaway counter serving ice cream and other desserts to passers-by, however I've not had the chance to sample its delights as yet. The atmosphere is typical of an Italian restaurant - noisy, relaxed and informal. Excellent all round.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "clcemNTSlJs3O7iv_Q7BFw"
  },
  "DnYLbSiRScbPPAqZyei5kQ": {
    "date": "3/7/2011",
    "text": "Very busy which is good sign. Very good range of food on menu. Loved the idea of spilting your order so you could have half pizza half pasta. Food was nice, Service was good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "F2rf8vAF2VL-GBsaRC3RcA"
  },
  "kY1addwxDYTIWaY3ByuPJA": {
    "date": "11/15/2008",
    "text": "One of our favorite restaurants in Edinburgh. Good prices, lively and friendly service. It is always busy here (we normally go to the Leith Walk Branch).   The food is what you would expect from an italian restaurant - all the old favorites. Generous portions and great range of ice cream for pudding.   Definitely worth a visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dIAHvx0I8T1OVNlgt2paVA"
  },
  "jzN7-eh5wbnditHo4M0OIw": {
    "date": "1/1/2010",
    "text": "Fantastic. We visited Edinburgh and fancied an italian meal so searched a few on the internet and found Vittoria. What a place!   The food was excellent, service fantastic and friendly staff.   The restaurant is quite modern, very clean and has a separate dining area downstairs too for functions etc.   All-in-all we had an excellent meal and will return when next in Edinburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gO9sQk_dIjfKVHWuns2JnQ"
  },
  "XSFc-7zufH3d9a1v_5lqCg": {
    "date": "11/20/2008",
    "text": "Nice friendly, family run italian which is situated close to the city centre of Edinburgh. There are several good bars on the same street if you fancy a quick one before eating.   The decor is clean and modern and the place has a nice atmosphere. Beware when there is a hen night on as things get a little noisy and banana puddings arrive, with sparklers shaped in a particular naughty way!!   The restaurant is big - at first you think that it is full when you enter but there is a whole floor downstairs too which is the main place they put the hen parties.   Friendly staff, nice surroundings, varied menu, good food, big portions. Definitely worth a visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LGfDJMfXDDj93YUfrEqEhA"
  },
  "RWp0zGPqluvxPr5noNYtLQ": {
    "date": "11/21/2011",
    "text": "I was very impressed that Vittoria amnaged to sit our party of 17 with no problem, no slow service and no errors! Really friendly waiters, very attentive. As a large party we were asked to order in advance and this seemed to help. I had king prawns for starter and a tuna steak for mains, if I was to gripe about anything I perhaps would not have had my tuna steak so well done, however, given that they fed so many of us so fast, it is a small thing. Bill split 17 ways was about 30 each (about 2 drinks each). Good place to go if you have a big group, as they are able and willing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "utymPwB_ESYxPzgz7Yh-IA"
  },
  "05W8lW6U_Tl5hegJ3Bbxsw": {
    "date": "3/7/2011",
    "text": "We had our staff Xmas dinner here; it's the first time I'd eaten in this branch - loved the Leith Walk original and La Favorita. The standards are just as high, the service is excellent and the food can't be faulted - the rich flavours and fresh ingredients are exactly what you hope for in Italian food. It's a hustling-bustling fun place to be.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_aTB-LS7NqzRTljtJjlpew"
  },
  "_yJAWzgYUyOWB0LtgY5OlA": {
    "date": "5/12/2010",
    "text": "It's been a while since I last stepped into Vittoria, but it was a memorable enough experience to review offhand!  The surroundings are spacious and modern, but with a cosy, rustic colour scheme that looks great when the sun goes down. Perfect for a wee candlelight romantic meal.   Which is what me and my boyfriend went for and it was amazing! Lovely A La Carte menu, with traditional, thick Italian pizzas that are explained in a fun way on the menu. The extensive amount of food they do in here shows the sheer dedication by the chef's - just look for yourself on the website. But they offer a ton of veggie options, at least 10 different kinds of pizzas (from plain to adventurous) and a great wine list. I went for red wine when I was in here last by the server's recommendation, and although I'm not usually a fan of the red stuff the descriptive menu and our helpful waiter both aided me in making a good choice. Everything was delicious. I went for a spicy option, aptly named Vesuvio, which is hotter than Iceland's volcano chaos right now but still gorgeous. Eating a spicy pizza just made me drink more wine, which isn't a bad thing when you are having a night being pampered. My boyfriend's pizza was gone in 60 seconds.  The whole experience was amazing, with lovely surroundings, attentive staff and food that was lovingly created. Vittoria has been raking in awards since the 70s and after a number of successful visits now, it's easy to see why. Pizza magic!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5iRCT4uAsyP1UoEUoxbylA"
  },
  "hlBhEV7U7F-XmnzKyVs2-w": {
    "date": "8/6/2012",
    "text": "The pizza funghi was spectacular.  True Italian fare same as in Italy.  Great atmosphere, intimate, bustling, modern.  The staff was great.  We stuffed ourselves silly and would do it again!  Do yourself a favor though -- make a reservation.  They are always packed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5BmMpDqDLGbYAvj5G1bt0A"
  },
  "YKp-g6C1OrVkw0NEgEzxqw": {
    "date": "1/4/2010",
    "text": "That a lovely italiam restaurant. The price are really reasonable and the service is very friendly. The dishs and desserts are very good. You also can take a dessert in take away. I advice you to taste the chocolate cake which is delicious! Don t hesitate to eat at this restaurant!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VL0LSyczp3ZyDIaRND3VPQ"
  },
  "RAIOnCxAwRh5Jakhm504zQ": {
    "date": "7/9/2012",
    "text": "Awesome service, the Tuscan bean salad, brusecetta, spaghetti with meatballs, and Lasagna Verde, Tiramisu , ice cream all were amazing, my wife and I loved it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "36rgSpmSn-KlOkH5ndlf7g"
  },
  "mhHIdritGc8DypAKMtRnvA": {
    "date": "12/2/2010",
    "text": "Love this place - it's a fairly standard Italian menu but the ingredients are particularly high quality and everything is finished with care. The waiters are highly entertaining too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XAXn4anx2vD_DNClJuYzIA"
  },
  "1ie-Lw2T6QR-DHodCG30gA": {
    "date": "6/1/2008",
    "text": "Nice Modern Decor Excellent atmosphere & Fantastic food. Friendly & helpful staff. Prices fairly reasonable",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VRVCKQhYDCkzaEDce8GEtQ"
  },
  "4KsE4OEpeO3xSj27wbxnag": {
    "date": "9/30/2008",
    "text": "Very family friendly Italian restaurant. The food here is lovely. They do a very reasonably priced lunch menu too. The atmosphere is very good, and service good also, for such a busy city centre location. The restaurant is surprisingly big too, with a whole other level tucked away downstairs. Great for a staff night out, I'd think.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ai-lb1pt586HE6qcpUidPA"
  },
  "Kea1pgS2Vh0iFs1fdwKgMg": {
    "date": "12/22/2011",
    "text": "Nice restaurant, very good pasta and very...very quick service. Strongly recommend if you want to eat good pasta and pizza. The only negative point is that we expected the plates to be bigger. Nice desert, we had \"trio of deserts, mmmm......delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GkDbVetJr9pBZg_engbZ8A"
  },
  "MKPjzTTxdzpBgX-Hevs_Uw": {
    "date": "4/23/2008",
    "text": "I love Vittoria's in leith and was really excited when they opened the new restaurant on George 1V bridge. It's got a different feel to the Leith restaurant, quite trendy and a bit more up market but the same values are there. The staff are very friendly and helpful, and the food is amazing! There is a huge selection of starters, breads, pizza and pasta. There are old classics like lasagne and macaroni but there are some exciting specials on offer like pasta stuffed with aubergine. yum! desserts are also impressive but I recommend choosing a few different flavours of ice cream as they are all delicious (gingerbread ice cream is awesome, as is pistachio and nougat) This is a great restaurant, and I've eaten here on loads of different occasions. Its really nice for a romantic quiet meal but also great for a big group party. The waiters are accomodating of either situation and in the party situation really go out of their way to make sure everyone has a good night.  It's reasonably priced, the food is amazing and the atmosphere is great too. I love Vittorias!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YZtT78f32jBlkpZRBQ_Hig"
  },
  "reqLHbQoQdOe1ItYKWc6HA": {
    "date": "6/6/2008",
    "text": "A family run Italian restaurant with some of the friendliest staff I've ever met this restaurant has a great atmosphere and very reasonable prices for fantastic food and a large, varied menu. La Favourita further along Leith Walk is a pizza restaurant owned by the same family.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lO5LwtjeGx6IdKxXKvzTiA"
  },
  "yl7pcRMZpH75C3FrW1Zdyw": {
    "date": "11/18/2008",
    "text": "The best italian in Edinburgh. Visit and you will not be disappointed. A nice atmosphere with good service and a range of food. Pizzas to pasta to seafood are all brilliant and it is possible to do half and half providing someone else asks for the other half. Well priced and all food is very tasty. Good location with lots of nearby bars. Easily accessible on the 23 or 27 bus.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E7UTVunQLtiTnGYBlUQFDg"
  },
  "OQOc-hPk2ZsNkNIVXj_c1A": {
    "date": "11/20/2008",
    "text": "Everyone who has reviewed this wonderful place seems to be agreed - it is something special. Over the years I have been for a snack, done lunch, had an evening blow out, had office parties and never once was the food and service anything less than fantastic. Their version of Chicken Milanese - Pollo Padana if memory serves - is my absolute favourite and a delightful meal. The fried onions that accompany it are probably the best I've ever had. If you doubt how 'Italian' it is just look for the tables full of Italian families munching happily through plates of patate (chips to you and me). Love this place to bits.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VexgOwaVWntJt1ZUyraVcw"
  },
  "512tPrHTsrjdteDfTxYJQA": {
    "date": "10/20/2011",
    "text": "Amazing Lasagna, buit the girl who served us made us feel unwelcome, its a huge restaurant, good value, very family orientated.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iyJicj5hmJqYwJTgze220w"
  },
  "X8DkQxoOuUgkz5tFVtEMkA": {
    "date": "7/19/2011",
    "text": "Nice food, service OK, prices reasonable.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UhpSC4X1FzPOz8qUW-8YSg"
  }
}