{
  "bSo0JmlBM4P2wKCrtmUKMQ": {
    "date": "3/30/2010",
    "text": "Anima is owned by the same people as the super-good chippy next door so it was a bit of an easy choice to decide to go there. We first went late last year, lunchtime I think, was the best time to go as it seemed to be remarkably cheap. We shared a seafood pizza which far surpassed my already high expectations of the place and I'm really gutted I didn't get to try any of the side orders - I saw them whizzing past after it was too late to start reversing courses.  The waiter was friendly and honest but left us alone enough to enjoy our meal - a pet hate of mine is being pestered. Red wine flowing and nonstop laughing made me forget about the stunner of a take away next door as we left.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "U3SmhvS8MoYZPFSbe5U0bw",
        "caption": "Photo of Anima - Italian Soul Food - Edinburgh, United Kingdom. logo from official website",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/U3SmhvS8MoYZPFSbe5U0bw/o.jpg"
      }
    ],
    "user_id": "rJi2YPK6uj4FtE8R7OFQcA"
  },
  "kpA1qLCCBCe6rUcd3U5syw": {
    "date": "1/18/2015",
    "text": "Anima is where i go for lunch most workdays. Firstly, their 4 Meals are tasty, filling, and are giving me a fantastic array of options across Pizzas, Pastas and Melts. On top of this, the staff are really friendly while dealing with an often crowded lunch crowd, patiently explaining on my first meal why my selected Pizza wouldn't be 4 with 6 (rather than 4) ingredients, laughing and explaining that many people make the same mistake (was clearly explained on poster - I hadn't read it properly). I look forward too trying just about everything on the menu at some point as i'm loving it and intend to be the Duke for a long time ot come.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hqnChTwn7I2sZYoDuggCNA",
        "caption": "Photo of Anima - Italian Soul Food - Edinburgh, United Kingdom. Front counter and their awesome lunch deal",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hqnChTwn7I2sZYoDuggCNA/o.jpg"
      }
    ],
    "user_id": "3yxKJWUKh1cZvNSDUJCmag"
  },
  "bnE-0IMLTPVNXneU3PrRYw": {
    "date": "4/15/2016",
    "text": "It's brilliant for lunch. Pizza and pasta deals are delicious. These guys know what they are doing. Best Italian take away for miles. Shame they still charge a 50p fee for using card payment tho.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P6hw2oJ1xY_lwxlpY7VVag"
  },
  "8IM1HRNxSTVFIejFDuMoyg": {
    "date": "12/22/2012",
    "text": "I've just moved up to Edinburgh, I was really looking to trying this place as it seems to held in high regard by the locals, but after my experience I fail to see why.  We ordered two takeaway suppers for delivery, which took over an hour, when it did arrive I started to take my goods inside the delivery guy stopped me telling me I still had to pay, even though I had an email saying that I paid by card through their online payment system, the guy phoned the shop and some on the other side said I still had to pay. Being starving and hacked off I paid the guy anyway.  Upon opening the boxes we greeted by the most bland, soggy, limp fish suppers we've had in a while. We also ordered brown sauce on our suppers and it bizarrely presented in tiny wee tub, not enough sauce for an east coaster like me.   All in all, a rather disappointing experience.  Yes it filled my empty stomach and but lacking any flavour, but after all of the buildup, I was left unconvinced. It's sad that I've gotten more brown sauce from chippys in Glasgow!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kuUm4sA7F2P6HJlWcvkPzg"
  },
  "r6tiTumIcSTR-XlC7bfKAQ": {
    "date": "2/27/2012",
    "text": "This is the sister restaurant of L'Alba Dora next door. I would highly recommend the ciabattas, especially the chicken pesto and mozzarella and tomato ones as they really are delicious! My friend has tried the pizzas and pastas which also look good and are a nice size for lunchtime eating (not too big!)  I often go there on a lunchtime at work as a treat. It can be a bit of a wait for your lunch but they do have an advance online ordering system, so if you were in a rush you can place your order online and come in and pick it up when ready, so I must do that next time.  I like the decor, and it's a nice place to sit in the window and people watch at thew busy street outside.  They have a take away menu now in conjuction with l'Alba dora so i'm going to try that next!  Lovely stuff!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eLdRbA_hHQUR6K3mqaB5yA"
  },
  "KSoqI6JUUU5_UrM5EEoF8g": {
    "date": "11/20/2008",
    "text": "Anima on Henderson Row is such a fantastic takeaway. Opened several years ago as the funky sister takeaway to L'Alba D'Oro next door, it serves a large variey if Italian pizzas, pastas, paninis etc.   All the food is made fresh in front of you by the chefs, so you can really see what you're getting. The pizzas are amazing with wonderful toppings that you don't normally find in your average takeaway. The pastas are also very good with a large selection of sauces in offer.   One of the great things about this takeaway is the small seating area they have, meaning you can sit down and enjoy your food rather than waiting to get it home, They also have a good selection of beers and wines, either to take away or enjoy on the premises",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mu6xEHThck91bAyD38XuZQ"
  },
  "lhxDWbNWGdK61YB-yowz6w": {
    "date": "12/11/2008",
    "text": "I ate here quite a bit when I was working at RBS in Dundas Street.   Some of the best pizza and pasta you can get in Edinburgh, and it's all reasonably priced. The pasta in particular is served piping hot, and there are daily specials which are often well worth a try. The salads and garlic bread also make great side dishes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7vJT5yNQwoz3AGDzYdj1cA"
  },
  "aRcSbMO2Lqp30e25ucyrgg": {
    "date": "8/7/2010",
    "text": "Anima produces excellent pizza, sandwiches, fish & chips, pasta... pretty much anything. My preference is for their sandwich selection, in particular their grilled sandwiches (but in a wrap rather than ciabatta or french bread). The only thing is this is not fast food - to the contrary I have often waited 20-30 min for a couple of sandwiches.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jo7r2YHS_-mqutpB2k1nPA"
  },
  "tvATJS9GDiGxAf-Q5z_7UA": {
    "date": "11/14/2008",
    "text": "This place does amazing pizza and pasta to take away or eat in. The pizzas are light and crispy with plenty of toppings. The pastas are yummy, although some of the sauces can get a little dry by the time you get them home to eat them (carbonara suffers badly). they do specials which change frequently. There is also a good selection of panini and foccacia which I haven't tried yet.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l_n89Nfn1BSJENwHy9nt-A"
  },
  "M_Jr99DMXUFdUNFlxllcKQ": {
    "date": "3/19/2010",
    "text": "Small, funky, fresh, and ITALIAN. What more can you ask for? A typical takeaway only that it's cheap and food is freshly made in front of your eyes. Yes, as someone before me has said: it could become dangerously addictive and I do recommend it wholeheartedly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hqZiOnwZ3J1s7piCBUN6Ow"
  },
  "zPiMCveaVXAdn9U_MvQk0A": {
    "date": "8/10/2010",
    "text": "They do great food here. I am a big fan of their grilled sandwiches and wraps, that's usually my order of choice but the pizza is also very good and they do salads too if you fancy something a little bit more low carb.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bEZeIC1vGQSJZYPTGM4Dhg"
  },
  "VJlNUTH44CuwiOW-eTmHfA": {
    "date": "8/8/2010",
    "text": "Very good food, and there is some space to eat-in. The staff are lovely and seem to be having a great time. It can take a long time though, but it is worth the wait... just make sure you're not in a hurry before you order. The oreo smash cake is also amazing!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IRap2MhkXYqno-zfVvm2iw"
  },
  "42kSkB6n55ZQgZG3KmQLGg": {
    "date": "7/4/2010",
    "text": "We arrived 22.40h (closes at 23.00h) & ordered 3 bruschettas ,garlic bread, cappochino and a late. The bruschettas were tasteless, dry and the bases were very chewy. We have always enjoyed a snack from here before ~ what has happened to this place",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ugVBmapd7bLfXwt2mHx3lA"
  },
  "qD13jry4opSPwpWEc_YKVg": {
    "date": "11/26/2008",
    "text": "Anima can be extremely addictive. For cheaper than pizza hut you can get much more interesting pizzas and watch them made while you wait. The whole grain pastas are worth a try also.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bxl3j_UX2PmRl4nga-_4oA"
  }
}