{
  "ZzKEEl5T3xHeFs9SMRLC3g": {
    "date": "9/3/2015",
    "text": "Great food! Stopped by at the right time. Seems like many had reservations, however, we luckily got a table in the first dining/ bar area. Bread was offered with the meal, which was delicious. My partner and I ordered the King Scallops (referred to as one of there best plates) and the Crab Cakes (one of the most popular). A great range. Glad we made the trip down. The staff was very friendly. Thank you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vjPS9c7Yt2Vc_gEly-65rQ"
  },
  "Sw6Rtz_XqoF_HjaI9YhktA": {
    "date": "9/16/2011",
    "text": "Fantastic.  Dinner at Fishers was the absolute perfect way to end our stay in Edinburgh.  The seafood, vegetables, and meat were all amazingly fresh and cooked to perfection.  The brandy and peppercorn cream sauce on the steak was one of the most delicious sauces my taste buds have ever had the pleasure of tasting.  The restaurant itself was quaint and situated right along the water, the perfect setting.  Definitely make reservations, we didn't have one but were very lucky that 2 spots opened up at the bar right as we walked in.  The bartender also recommended a lesser known whisky that is now my boyfriend's absolute favorite-a small example of the friendliness and helpfulness of all the staff there!  When we're back in Scotland we will be back to Fishers!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Et6mwzOORak5K6kJ-yw4Xw"
  },
  "-DZWSXYlKNGAnwPXxcJ5YQ": {
    "date": "9/4/2015",
    "text": "The cold seafood plate was really delicious. The fish cakes we did not enough. The mussels were a bit disappointing and the raw oysters were amazing!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EOrkroVcrYvI_EGD26xnQA"
  },
  "biFT76KeecB0HEBQ8BRxnw": {
    "date": "11/2/2012",
    "text": "LOVE! cannot fault this restaurant! I have been here twice for my birthday and the food is exquisite! I had breast of partridge to start and monkfish for main....amazing! I did not have room for  desert, however the chap on the table next to me ordered Creme Brulee and it looked divine! It can be pricey but you certainly get what you pay for in this fine establishment, also importantly you do not feel intimidated like you may do with other high end restaurants as the decor is cosy and welcoming. Nice for a wine too with its extensive wine list. Go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "AnXbqBBa4tZ21RbPWpKoqg"
  },
  "CkU9v5lWlh77xuewOsk6gQ": {
    "date": "5/30/2010",
    "text": "Yum yum yum! Exclamation mark. I hopefully managed to put across my admiration, greedy respect and wholehearted recommendation of Fishers in my review of Fishers in the City, and Fishers Bistro on The Shore is no exception.  In terms of location, Fishers Bistro definitely has the scenic edge compared to Fishers in the City. The Shore, if you're unfamiliar with it, is a really pretty little area of Leith, lined with really good bars, restaurants and old fashioned pubs, and a fantastic get away from the city centre on a sunshine filled day. One day I decided to do just this, as I do feel I neglect Leith sometimes, just because it is that wee but further from my abode. I had a gorgeous lunch at Fishers Bistro, with the seafood soup to start, with lashings of buttered bread, followed by a perfectly textured and flavoured halibut dish. The interior has that definite maritime look going on, and marble look table tops, which I think suit Fishers perfectly, being sea themed and all that.   Fishers Bistro is a bit smaller than Fishers in the City, so booking ahead would definitely be advised. Don't be fearful if you're not fishy orientated, there are succulent meat options and a list of veggie offerings to choose from too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "lDeuV8KDMrIwGEDZvKWpmw",
        "caption": "Photo of Fishers - Edinburgh, United Kingdom. Photo from fishersbistros.co.uk",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lDeuV8KDMrIwGEDZvKWpmw/o.jpg"
      }
    ],
    "user_id": "5Mujjzv-ZH6HhxT-hWCpVg"
  },
  "0dFH7qqNQj2XygUbTJTaKw": {
    "date": "7/19/2016",
    "text": "Excellent food, excellent service. If you want to eat at normal dinner hours, you should probably try and make your reservation a few days ahead of your desired date, but it's totally worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ic0o8EE6avr1_nDgR4AXxg"
  },
  "Vm1c9WgVXfg9R7Q0wSqppw": {
    "date": "1/24/2012",
    "text": "On the down side this is an establishment having to make best use of a small-ish space therefore getting in and out of the left side of the table my group occupied last Saturday night was a bit of an escapade. On the plus side I personally was right beside the radiator. Feng shui aside there was nothing wrong with any of the food or drinks we ordered. Having initially felt that the pigeon breast starter was a tad on the small side by the time I finished my main course of red gurnard with potatoes, garlic & shallots I was full enough to have no need of dessert (which in the end didn't stop me polishing off half of the rather large creme brulee ordered by a friend). Washed down with an excellent Portugese red this all more than made up for the minor serving errors (1 too many cheese boards, a delayed linguine etc.) therefore I feel quite safe in recommending people make the effort to eat here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ApZua3NpaWgKJvkXXHJz2Q",
        "caption": "Photo of Fishers - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ApZua3NpaWgKJvkXXHJz2Q/o.jpg"
      },
      {
        "img_id": "I67T0_o3a_sNGYPB-MVVAQ",
        "caption": "Photo of Fishers - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/I67T0_o3a_sNGYPB-MVVAQ/o.jpg"
      }
    ],
    "user_id": "txzOZrHK9EVY0kYjSuXkKg"
  },
  "aunLzYWmaXJZWjnYSSM52g": {
    "date": "5/19/2016",
    "text": "Visiting Scotland for the first time and wanted to try the fresh seafood. This place delivers. The wait staff was excellent and gave us pointers on places to visit and recommendations for local breakfast. The food was superb.  Each of our group had a different seafood dish and were totally impressed. We did save room for a wonderful sticky toffee pudding, delightful. Would highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QTpU5GC1RAELU5f4wxqm1g"
  },
  "4sYTIYo8Oq5ofiL1957_SA": {
    "date": "4/16/2013",
    "text": "I sea food, you sea food, we all sea food. And ooooh was it goooooood!  I'm no foodie, but having been born and bred in a seaside town, my stomach can't help turning a bit when the fish+friends aren't just about right out of that big salty pond yonder. And so I tend not to eat a lot of the stuff when we're inland, and then I invariably go bonkers whenever we're anywhere near a waterfront.  Enter stage right: Edinburgh. Enter stage left: Fishers.  So what did we order? Umm...what did we *NOT* order?! It was a weeee night of indulgence. After having invoked my deep Asian-roots and most easily convincing the others to go all in with family-style ordering, I think the six of us managed to get down a piece of just about everything that comes in a shell, four starters, three puddings, two loooovely fatty fish, and a partridge in a pear tree. La la laaaa  Oy the oysters!!!! Mmm the mussels!!!! (Thank god for stretchy pants.)  And the staff? Top top top. This will be a no-second-thought, hands-down, immediate go-to for any seafood cravings and then some. The few sides of veggies were fantastic, and while no one ordered any meat, we'd be convinced in returning after having chatted a bit with one of the staff regarding the cuts.  We weren't the only table sitting around leisurely and laughing lots, nor were we the last to go at the end of the night. That just goes to show how fantastic the atmosphere is, how great the service continues to be, and last but not least, how grand the food is.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "SXOSr532-9p1e7mhmC-VSQ"
  },
  "b5s7qqfmICPOg5HvgUmCcA": {
    "date": "7/19/2015",
    "text": "amazing oysters. fun seafood platter.  sat at the bar and had great service from friendly Scots.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qF1oVavX_7mf-4FJIiBP-Q"
  },
  "hKvXTOG9LD_PcVz5qtlu_w": {
    "date": "6/26/2010",
    "text": "Fishers is just perfect.  My husband and I spent a weekend in Edinburgh at the Scotch Malt Whiskey Society flats, which is just a few blocks from the restaurant.  After hearing what seemed like countless great reviews, decided it was necessary to check it out before leaving and grabbed a late lunch on our last day in town.    After being seated, I asked our waiter if the fish soup had salmon and when he confirmed it did, we bonded over the fact that we both find it annoying that we don't like the taste of such a popular fish that is seemingly in everything.  Since the soup wasn't an option, I started with queenie scallops.  They were served broiled on the shell with a tasty butter sauce.  I parted with one in return for one of the six fresh oysters that my husband was enjoying.  For my main I went big and ordered the lobster, which was incredible.  I could have honestly eaten a second one just because it was that delicious.  My husband feasted on a fillet of smoked haddock with Isle of Mull rarebit.  I'm usually not a huge fan of smoked anything, especially fish, but after trying it I reached over with my fork a few more times to sneak some nibbles.    The portions weren't small, but somehow we managed to order dessert.  I had the cheese plate which included some very strong slices, which I loved.  My husband opted for the ice cream and wasn't disappointed.    Fishers can be a bit of a splurge, especially if you order the lobster, but it's worth every penny.  I don't think I'll ever forget my meal.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "YXOnf6nNB6xA1xtkTxFUEA"
  },
  "W2mmqUD0sx4EymZS2ofjcA": {
    "date": "6/26/2011",
    "text": "I really wanted to go to fishers since i came to edinburgh , i live 2 minutes from it and i smell the wonderful food everyday .   o we went in today as it was sunny , we sat outside and ordered fishcakes , fish soup , trout main , mackerel main . to tell you the truth i expected something really awesome ! something heavenly , but is was alright! i can't say it is the best fish i've ever tried! :S but over all it is still good fish.   a bit expensive to tell you the truth , but isn't fish always expensive?   PS the soup was reallly good , fish cakes were ok (needed a bit more spices for my taste) , my mackerel was good , and my husband liked his trout.   i gotta say it is located in one of the best spots in leith",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f0ODldmlswlM4YMSYZMB2g"
  },
  "Nffwfeu8dYnpo8bM_E46cA": {
    "date": "10/6/2010",
    "text": "Absolutely perfect.  Wonderful fresh and local seafood options, a daily specials and a la carte menu, oysters to die for and wonderful Aberdeen steaks.  Great service with a smile and reasonable prices.  Overlooking the Port of Leith - stunning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aIFbo8WaP6SCuOFnj_v9kA"
  },
  "i7XjcmHKQ30C6MgunlJqlw": {
    "date": "12/25/2011",
    "text": "Friendly bartanders, great seafood soup, but most importantly, the best oysters and mussels I've had.  They accommodated a last minute traveler like me, and made it a highlight of my trip up to Edinburgh.  I hope to return back to this place someday!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-iWhYcFB9VpszSxatkYLcw"
  },
  "8h8g6y1sitqFDpfage1_2A": {
    "date": "10/6/2012",
    "text": "Outstanding restaurant in Leith section of Edinburgh. Many new places to eat, but I'm glad we decided to eat here. Many great choices of fish to eat, all well prepared and very tasty. Very good selection of wines to compliment the meal and deserts to die for, especially the sticky toffee! The service was very good once we got going with our meal. The fun place to sit is in the barn area with the tall tables and chairs, although we enjoyed being in the other room and being able to see outside. I would highly recommend. One of the best meals out I've had in Scotland.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "azaT7ghOLnxMb5ZlpLdrZA"
  },
  "3sX4Zr72d1DVd6Le6s4KPA": {
    "date": "3/18/2011",
    "text": "Wow! From the ambiance of a very old restaurant with huge amounts of charisma, to great service, great oysters, fantastic smoked salmon and fish chowder..Fisher's is an awesome place to dine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4qjJEOoTuCaFB0pTUWAilA"
  },
  "0CkBovYVIMz849vRqXZhiA": {
    "date": "9/30/2008",
    "text": "Fishers in the City let us down the last time we had a family dinner there. So this time we took our mother (she's 78 you know) to the original and vastly superior Fishers Bistro, down at The Shore in Leith, to celebrate her birthday.   We began with a cocktail or two sitting outside Malmasion (depuis 1994), enjoying the sights (upmarket hen weekenders), the sounds (ditto) and the smells (sea, champagne, perfume and a soupcon of sewerage). Then it was a short stroll to Fishers Bistro, where the smells significantly improved.   Our meal:  The oysters were reported as exemplorary and came with a little bottle of Tabasco, a side dish of chopped onion and paprika. There was a striking dish of mussels and clams and an almost delicious dish of swordfish strips with pickled ginger, bean sprouts and sesame. The latter came wrapped in a bog-standard wheat tortilla, without which the plate would have been near perfect.   Then followed whole plaice, pan-fried cod and queenie scallops - all of which were superb, if the grunting noises were anything to go by. I can personally vouch for the plaice, cooked perfectly with a small topping of goats cheese, just enough to compliment, not swamp the delicacy of the fish. A substantial side dish of mange tout, gratin dauphinoise and carrots accompanied the lot in a retro yet surprisingly appropriate manner. Puddings! We all had one. Which either means the portions are of a reasonable size or we are greedy pigs. Stalwarts such as sticky toffee pudding, chocolate mud pie and pecan pie all came served with ice cream or cream. We didn't have coffee and by then they needed the table back for the second sitting; a harsh intrusion of commercial reality into our well-fed heaven.   The wine list was reasonable in as much as as I only perused the white ones. We enjoyed a very decent Pouilly Fume at 22.50 (two actually), rejected the two Cloudy Bay options at 32 and could have settled for several other perfectly good New and Old World whites between 15 - 30.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "81N8AufvRToL2H1dLtYcOQ"
  },
  "sDBpGUspq-P0iFpYSI_SDw": {
    "date": "4/28/2009",
    "text": "If you ever find yourself in Edinburgh, make the trip to Leith; it's only a short cab ride.  This restaurant is worth the short trip and it's also located near the docks in area that has been revived so it's a different glimpse into Scottish \"suburb\" life.  The food is exceptional!  Thankfully, Scotland next to  cold waters so you are able to experience seafood and local fish that are so fresh they are bursting with unbelievable flavor.  You will not be disappointed.  The staff is attentive and strive to make certain that you are satisfied.  We brought our toddler child here, the staff was so sweet, we almost asked if they babysat.  We loved this place so much that we went twice in 3 weeks.  Oh what a find.  Had it not been for the kind, old gentlemen strolling along the boardwalk in Portobello, we would have never found this gem!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "N7iZR_VfpmCaRqnTfZ9xEw"
  },
  "j9CLIFLaYNb4_MXA3ckbtg": {
    "date": "7/5/2009",
    "text": "This is a great place for fresh seafood. The oysters were amazing and from a local lake that is both fresh and salt water. We also shared a pot of mussels that felt bottomless and the famous crab cakes. The food was excellent despite the sunburn I got from eating outside.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "dPY-u-G2RdPl0qMxbiuGcA"
  },
  "UbqYQMwupuuAYoz6qICr1A": {
    "date": "3/14/2009",
    "text": "We were staying in Edinburgh and looking for somewhere rather special to eat. This place came recommended and despite being a bit of a jaunt we paid a visit. It was pretty busy and we had neglected to book (doh!) but they managed to squeeze us in at the bar which was fine and actually quite nice. The menu wasn't huge but we both spotted the dishes we wanted straightaway. You expect to pay a bit for decent seafood but this was still quite reasonable. Would definitely go back but would of course remember to book next time!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_7e6JEqNJPMwR9SqAQezow"
  },
  "9dTf7MwWBvyQV0vEmcIfMg": {
    "date": "6/27/2019",
    "text": "My wife and 21 year old son had a wonderful dinner at Fishers. It will definitely be one of our more memorable meals. The restaurant is charming snd welcoming. All food was outstanding.  I had the grilled scallops for a starter. They were brilliant. All fish was delicious. What was the surprise of the night was the ribeye steak our son ordered. It was perfectly cooked. They green pepper corn sauce he had was truly outstanding. We have had this sauce in Paris snd other parts of France but this was the best we have had. It had wonderful depth of flavors and excellent balance between savory, rich, and sweet flavors.   The desserts were heavenly. My wife and I had the brownie with the clotted cream ice cream. Our son had the sticky toffee pudding cake. They were both outstanding. The brownie had a nice crunch on the outside with a nice chewy and inside. It had just enough sweetness to balance out the hint of salt on the outside. They ice cream was the unbelievably creamy.   The staff were friendly and welcoming.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6sQ2la3v73SB29WtmvoPjQ"
  },
  "jJothNxBHR-jINIfJ_a8Aw": {
    "date": "10/13/2018",
    "text": "Get the Cod! The hake is good also, both dishes comes with the skin on the fish and you should eat the skin with the fish as it provides a good source of salt and flavour for the fish. The sides with the dishes were very good and properly prepared. The fish soup was a good starter along with langoustine. Fishers lives up to the hype. Now book ahead, seats book up fast. The sticky toffee looked good we just were too full!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WQOkt6lkkNIXs7muomzL9w",
        "caption": "Photo of Fishers - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WQOkt6lkkNIXs7muomzL9w/o.jpg"
      },
      {
        "img_id": "xpYUBzwe50aWEN4HxH50Lg",
        "caption": "Photo of Fishers - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xpYUBzwe50aWEN4HxH50Lg/o.jpg"
      },
      {
        "img_id": "MmfP8QvZwzufPcJZwfncGQ",
        "caption": "Photo of Fishers - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MmfP8QvZwzufPcJZwfncGQ/o.jpg"
      }
    ],
    "user_id": "_ElRZefmV3ABaBpkjHqpVg"
  },
  "DC3Zs1kygN2gGjFuGG2FRw": {
    "date": "9/18/2018",
    "text": "Nice little restaurant right near our hotel. We didn't have reservations (probably should have made them) but they found us a table and we didn't feel rushed to clear room for others coming in later. Food was fresh and tasty, a nice variety of local seafood choices. Even had room for a nice local cheese variety for dessert and had a couple of the local beers. A very nice place for a meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RyJXGJzlx9sfsI3idwqYQQ",
        "caption": "Photo of Fishers - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RyJXGJzlx9sfsI3idwqYQQ/o.jpg"
      }
    ],
    "user_id": "lyIwECTGiPb2SNrryJFPmg"
  },
  "xiBFAWKzw1jNGeUpmTzNPg": {
    "date": "7/17/2018",
    "text": "Dropped in for lunch and found they had a two course lunch special for 15 pounds. The price was right so I chose the fish soup starter and mussels for my two courses. The fish soup had a lot of potential with a variety of seafood including salmon and potatoes in a creamy white base. Unfortunately, it was served lukewarm which definitely seemed to take something away from the taste. The main course, mussels, were very good in a creamy sauce. But, the best item was surprisingly, the French fries, they were large slices very hot and slightly seasoned with salt. If I knew the fries were going to be so good, I wouldn't have ate so much bread waiting for the meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9Xwv_5CchKV3Jkszq-DTXg",
        "caption": "Photo of Fishers - Edinburgh, United Kingdom. Fish soup starter!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9Xwv_5CchKV3Jkszq-DTXg/o.jpg"
      },
      {
        "img_id": "saVYLHEguWPaMlQb4Y99dA",
        "caption": "Photo of Fishers - Edinburgh, United Kingdom. Lunch Course 15 Pounds!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/saVYLHEguWPaMlQb4Y99dA/o.jpg"
      }
    ],
    "user_id": "Oa5ZwOn_a6abJ8lozPEohg"
  },
  "h-mouEnG_MoYjW2mL4C94A": {
    "date": "9/15/2018",
    "text": "My favorite place to eat in Edinburgh. This place has incredibly fresh seafood. When in Edinburgh you must try Fishers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0LqUnXWV659nvLaaUpoj-A"
  },
  "GAtR9xiO-0Nu05eUn6sGaA": {
    "date": "6/10/2018",
    "text": "I ordered the caviar blini's, the pan fried hake, and the sticky toffee pudding. I thought that the blini pancakes were a little bit dry but I loved my entre and the dessert was to die for. If you go make sure to save room for some sticky toffee pudding.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mDo2qUwVzruvHryg7Jsgng"
  },
  "Nr674W8im-BiR7IsSR81qQ": {
    "date": "4/6/2016",
    "text": "A fantastic seafood restaurant in Leith. I would recommend booking before going as they do get quite busy and there is limited seating.   I came for a lazy Sunday lunch with a few friends who had ordered the chateaubriand 24 hours beforehand. Unfortunately, there was a mix up and they ended up with the seafood platter for two.   The staff were so gracious and apologetic, we were offered free bubbly and the smoked trout starter on the house, extremely generous (and so delicious, a must try!)   I've been before and came with my eye on the prize that day (mussels!) I've had them here before and they were hands down the best mussels I'd had in a long time. Unfortunately the menu has changed so it's now in a cream sauce which I wasn't as huge of a fan of, but good all the same.   For starters I had the salmon ceviche, my partner had the scallops. Both very flavourful though my ceviche could have done with a bit more acidity.   I've already commented on my main so I'm going to jump to the giant bucket (I kid, platter) of seafood. It was a ginormous combination of lobster, mussels, prawns, langoustine, amongst other delicious bites. Served with lemon, sauce and butter it was a massive feast that 2 adults plus myself picking at it barely made a dent in.   Also, let's talk great wine selection. Schaeffer Merlot and Noom are both slightly pricey, but highly recommended.   Highly recommended  you visit the Leith restuarant. I've been to their restaurant in the city centre too which was ok, more seating but a bit more fancy pants but I didn't find the food to be as good.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 15,
      "cool": 11
    },
    "photos": [
      {
        "img_id": "xJoV_HoSHlzsUHTSO4sNxw",
        "caption": "Photo of Fishers - Edinburgh, United Kingdom. Seafood platter",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xJoV_HoSHlzsUHTSO4sNxw/o.jpg"
      },
      {
        "img_id": "-Wdrae7oqPhJ5Zvkqnu-pg",
        "caption": "Photo of Fishers - Edinburgh, United Kingdom. Mussels in cream sauce",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-Wdrae7oqPhJ5Zvkqnu-pg/o.jpg"
      },
      {
        "img_id": "09gPMVRd63ec4T52WgKGWg",
        "caption": "Photo of Fishers - Edinburgh, United Kingdom. Scallops starter",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/09gPMVRd63ec4T52WgKGWg/o.jpg"
      }
    ],
    "user_id": "NwVyki35xOcaxhMzHNtHDQ"
  },
  "wJ55bUcWswA209fOxKww6w": {
    "date": "9/9/2017",
    "text": "Thanks for another great find, YELP.  We were touring the Royal Britannia and wanted a lunch place that wasn't in a mall. I wanted some of the legendary local seafood. Fisher's Did not disappoint. We had to sit in the bar, as we didn't have a reservation. Completely understandable.  We ordered a half dozen oysters, the cold seafood platter and some salads/ sides. The mussels, crevettes and oysters were some of best I've ever had.  What sets them apart beyond the fantastic sea food is the attention they spend on the sides and salads. Fresh and local can't be beat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-uwRIcT-3RtuhWf6JUYt4A"
  },
  "-PcNgDIPCQz_Z9ODG-73Ew": {
    "date": "7/15/2017",
    "text": "Super nice food and friendly staffs! Oysters, Fish Soup and Lamb Livers are really delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ITJzv1LQnQVvN8AfcDExrQ",
        "caption": "Photo of Fishers - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ITJzv1LQnQVvN8AfcDExrQ/o.jpg"
      },
      {
        "img_id": "e5GqVI92j0LQlBuyhE8iDw",
        "caption": "Photo of Fishers - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/e5GqVI92j0LQlBuyhE8iDw/o.jpg"
      },
      {
        "img_id": "GMyrs8QFqeZSrtUHW7q89g",
        "caption": "Photo of Fishers - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GMyrs8QFqeZSrtUHW7q89g/o.jpg"
      }
    ],
    "user_id": "IR9T0IjPhn8eO5ptgpfJkw"
  },
  "q9r24_tgc9K7jzUdWHVsBw": {
    "date": "6/19/2018",
    "text": "This was probably the best seafood restaurant we ever went to. The locally fresh caught sole was amazing. Normally I consider it a pretty boring fish, but this was just like butter melting in your mouth! We also loved the smoky fish soup and the mussels. Everything here was outstanding. The warm and joyful staff made the whole evening a rare pleasure. Worth a special trip!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DCdZvfo2TZi3JM8Vce0ExQ"
  },
  "y8VCbAoNT2LoiHI6RvkSDA": {
    "date": "4/3/2015",
    "text": "I am not sure if we have been very lucky or if Scotland became a gourmet country. Either one, we are very happy with the restaurants we have been trying for the last 2 weeks. Of course, having advices from Yelpers helps a lot because guided us for the best ones.   Fishers is just across the street from our hotel, and we could not resist the lovely food smell passing their everyday. Good Friday seemed the perfect opportunity to try it. The food was delicious, with a hint of surprise and very fresh. And the fact that the restaurant is across from the ocean adds another special touch.   Without a reservation at Good Friday lunch time, they managed to find us a table near the window. We order the white house wine, which was from France, priced at 15.90 the bottle. Nice and crisp Sauvignon Blanc, went very well with our food. My husband asked for the squid, fried with a delicious pepper jelly sauce. And I started with the pumpkin and coconut soup of the day, perfectly seasoned with a hint of pepper. Scored very highly already. Following my new tendency to have a start as a main course, again I had the fish cakes and again I just loved them. My husband had the well elaborated coley on coconut sauce and wonderful rice plate. We share the creme bulle and finished the day with a very tasty and classically present house Port. The bill ended up as 55.55 and worth every penny. What a wonderful experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Ot2HIg9cRsCtsvA4ggaKbQ",
        "caption": "Photo of Fishers - Edinburgh, United Kingdom. Main course: coconut sauce coley",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ot2HIg9cRsCtsvA4ggaKbQ/o.jpg"
      },
      {
        "img_id": "xPnQ3Yr2k-aoc2DpzTpFzA",
        "caption": "Photo of Fishers - Edinburgh, United Kingdom. Fish cake (small) - a start good enough for a main course",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xPnQ3Yr2k-aoc2DpzTpFzA/o.jpg"
      }
    ],
    "user_id": "QtwcxQ8Uez29iIziMSf3Sw"
  },
  "gKw1ImSjzTHwIuCLTFBA0A": {
    "date": "7/23/2015",
    "text": "Great seafood place. A perfect alternative to the local favourite (and much pricier) ship on the shore. Humble, welcoming atmosphere with a sea-side, Scottish feel. Small place, so reserve in advance. Staff were very friendly.  Oysters were fantastic, seafood was fresh and prepared well. There's a limited vegetarian menu for those who aren't into seafood...but I'd recommend just not going to a seafood restaurant in that case.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wfgnkBAZo3Pl4ADYZkMcxA",
        "caption": "Photo of Fishers - Edinburgh, United Kingdom. Smokie fillet with potatoes and haggis and veggie pasta.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wfgnkBAZo3Pl4ADYZkMcxA/o.jpg"
      },
      {
        "img_id": "ZgqsS2An1kh24xTWMyjesg",
        "caption": "Photo of Fishers - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZgqsS2An1kh24xTWMyjesg/o.jpg"
      }
    ],
    "user_id": "JXrzk6xM-KS8AQ9_Lu6PAQ"
  },
  "NUhkQqo_PeQAq1HPGchmKw": {
    "date": "8/3/2016",
    "text": "Hands down one of the best seafood experiences I've ever had. Everything incredibly fresh and well cooked with very good flavours. Would highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Afd91HQ48R0tcEbh1qPjNg",
        "caption": "Photo of Fishers - Edinburgh, United Kingdom. Scallops, mussels, oysters",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Afd91HQ48R0tcEbh1qPjNg/o.jpg"
      }
    ],
    "user_id": "76i3qGOynMF0VqCa5fGDPw"
  },
  "WTN56nmpqWxfjzjjaexjXw": {
    "date": "7/30/2017",
    "text": "Terrific local seafood. Prepared creatively. Very knowledgeable and helpful staff. Small place in a historic building. Strongly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3oAQK99cXz0kv3oQhXQXGw"
  },
  "WU1Fg3uIcdrh6q8dfFbERg": {
    "date": "3/24/2018",
    "text": "Very good food, wine and service. Had the fish soup and mussels with white wine and was excellent. Definitely worth 5 stars.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JlTBFnE8zB_jAFPJAC485Q"
  },
  "1g4JIpoQ1HJRocQk7hwtxg": {
    "date": "12/17/2017",
    "text": "Amazing food (definitely go for the fish soup starter) and lovely staff. One of my favourite restaurants in Edinburgh, partly also thanks to the great location. If youre considering if the trip to The Shore is worth it for dinner - the answer is yes and Fishers wont disappoint.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hhsPztHheEP4WpM93Z0QuQ"
  },
  "7lGtR3Z6NTW9YIhj-L7dMg": {
    "date": "7/24/2017",
    "text": "ALERGY FRIENDLY! (Dairy Free) The food was amazing and being lactose intolerant, it's hard to find good food I can eat. Everything was fresh and tasted so good! They can make almost anything on their menu without dairy. They are the most friendly people and made us feel right at home. HIGHLY recommend going to Fishers if you are in Edinburg! (If you are going for dinner you might want to call for reservations are they are very busy)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lCQegFI3TnxJ7Ah13aShNA"
  },
  "AhQzPSCNsMJP4DBJIGCh2A": {
    "date": "9/10/2013",
    "text": "Going against the grain here and giving them 3 stars. I found this place thanks to a Yelp search, and was really excited with all the 5 star reviews. I'm a seafood fanatic, I can't get sick of eating it. I wouldn't be surprised if I have mercury poisoning. Anywho, we took a bus to Leith specifically to eat lunch here. We arrived right when they opened at noon (we tried not to be the first customers, I hate that). The staff were all welcoming. We had planned to share a couple items, a must for me is oysters, I can't get enough. We ordered a dozen, unknowing they were enormous. No really, enormous. And way too salty. I don't know if this is normal for Scottish oysters, as I'm used to Kumamoto, Kusshi and Fanny Bay Oysters. I'm not a salt lover, and my friend is, she couldn't even eat these. Thankfully the West Coast Mussels made up for the oysters. A couple glasses of Sancerre also helped.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "_jA7Gli-2Db25rdwPPLrWw",
        "caption": "Photo of Fishers - Edinburgh, United Kingdom. Scottish Oysters",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_jA7Gli-2Db25rdwPPLrWw/o.jpg"
      }
    ],
    "user_id": "SfY0jEFqBkrqq9bVi6P31Q"
  },
  "nmrtfHsZsbvZBOyv2xIhJA": {
    "date": "8/30/2013",
    "text": "Excellent. We walked in without a reservation last night and were told that there weren't any tables available and that we should try their sister restaurant \"The Shore\" next door instead. As we walked out of the front door and onto the street, a member of the waitstaff came out of the restaurant and told us that two people had just left if we'd still like a table.  We had a bottle of wine at the suggestion of our waitress, which was excellent, we had oysters and langoustine for appetizers, and we both had the king scallops for entrees, and I had the pavlova with berry compote for dessert. Everything we had was perfect. I would recommend this restaurant to anyone. The atmosphere was cozy, the service was incredible and the food was delicious.   Will definitely be back, thank you!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "jnLv7eCFdnsKFdRz_O8gUA"
  },
  "z19UpyKGtJMxsbb5lSB5zg": {
    "date": "5/6/2013",
    "text": "Fishers was recommended by the owner of our B&B and was a nice choice considering we had only two days in Edinburgh and wanted to experience some fresh sea food.    The two great points going for Fishers is that they are smack on the water and pulling in a nice selection of super fresh seafood.  That combined with the fact that they cook it really well, makes for a great fish experience.  We started with a soft shelled crab which was delish - worth fighting over the last bite for! :) Then I had the sea bass and my partner had the sole - again, both cooked so that the flavours shine through without too much fuss or muss.  (of note: both fish we ordered were cooked whole, with head on, eye balls intact - so if this makes you squeamy, ask about how your fish is cooked before ordering)  Service was also very nice and friendly.  So far, so good! Where things were a little less than perfect were the sides and wine.  Potatoes in a sort of croquette form came with my sea bass and they were rather dry and chewy - as if they were an after thought.  If I remember correctly, veggies came with my partner's sole...but the fact that I don't remember what they were a day later indicates I didn't find them very interesting.  We ordered a bottle of Viognier for about 19 GBP, which was just okay.  My partner was bothered by the fact that it was a screw top - this doesn't bother me at all as I've lived in places where it's more common and I've had some good screw tops.  He's French so probably feels more of a personal affront over the issue.  But, again, if that bothers you and is something that will affect your enjoyment of the meal/wine, check before you order your wine.  Overall, this was a good, worthwhile, fun experience and I can't fault the tasty seafood.  If I could give a 3.5, i would - as it's better than just A-OK, but to be a full 4, I'd have to say it's good enough to travel across town for and in this case, I'm not 100% sure it is.  But, it was perfect for us and if you're a seafood fan and aren't bothered with the sides and such, you'll really enjoy the fresh quality, impressive presentation and great preparation.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "aJuP0hM3wKf6B8WfLjqK_A"
  }
}