{
  "j5lfZ2FtJJ4X4baulH5Hag": {
    "date": "11/15/2008",
    "text": "It's a really busy and bustling place now - you can't always get a table there around lunch time. I am surprised they haven't opened a 2nd yet!   It's well worth a visit though if you can get a table. You feel like you are eating quite healthily - ingredients are fresh and interesting and I could have chosen so many different things from the menu. It's not megre healthy food though - it's rich and tasty and filling. The soup I had was wonderful - sweetpotato, coconut and chilli - yummy.   If you can make it on to desert it's well worth it. They do lovely home made cakes.   There is a little shop that sells nice food to take home.   No longer a hidden gem, now it's a well discovered and successful venue.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dIAHvx0I8T1OVNlgt2paVA"
  },
  "2NcyJHdMkQquA7Wx7nnVaA": {
    "date": "11/16/2008",
    "text": "I can appreciate the standard of the food that is served at Urban Angel and the quality of the products that they use but something about my experience here left me quite cold. We ate in the room at the back which is a bit of an odd dpace with a few tables crammed in. The toilets weren't great and were a bit awkward to get to.  The staff were friendly and, although I did enjoy the food I didn't feel it was really anything to write home about. Which was a shame as I had really wanted to enjoy it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9pT2y3XKs0Iq9Wq_FWnnkA"
  },
  "PLztVgbHzNanX-UlY9WPZw": {
    "date": "11/7/2007",
    "text": "If you are young, hip, and enjoy good food, you probably already live at Urban Angel. Even if you are old, cantankerous, and despise trendy eateries, you will be glad you visited UA. The food is that good. Oh! AAND they are fair trade friendly, O do-gooders!   I am a big fan of homemade soups, and UA feeds my need by offering a wide variety of steaming concoctions, changing seasonally with available produce. The corn fritters are also very very good. I am also particularly fond of the tomato and mushroom aloo tikki. Ooh! And the fried halloumi!   For the quality of food on offer and the upscale ambiance, prices are what you'd expect, with starters between 4-8 pounds, and mains from 7-14. My fellow diners complained about the portion sizes for the price, but in the end no one left hungry. As UA is located at the top of Hanover Street, shoppers or afternoon strollers can enjoy a steaming cup of expertly prepared coffee, sit in the sun (when it's feeling social), watch the world roll by, and eat, eat, eat and be merry. : )",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SrUdc2DcFphyqk4X5CKbLA"
  },
  "7wlQ5RcJgA1Dbx6przAsrg": {
    "date": "11/30/2008",
    "text": "This one of my favourite places to eat at any time of day. For morning coffee the range of cakes are excellent. At lunchtime and in the evening there is a wide range of choices ranging from light  options to more substantial meals. Everything is cooked with high quality ingredient and with a lot of care. The range of deserts is also very well thought out with particular attention, for example to which type of ice cream would be the best match. The main room is painted white and is very light and airy, the back room is a little more crowded and the toilets are a bit cramped. But the mood is relaxed and unhurried. I've also been here with small children and they have also been treated with a lot of care and charm. Definitely one to try if you've never been.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3LW_w3POTvwjl0gY-rHmmw"
  },
  "dL18GZeblKXCNXbrFI3wQQ": {
    "date": "10/31/2010",
    "text": "Nothing like having your fill of healthy food! This really makes a difference. Nice place. Food is great. The food just hit the spot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kcmnNN6PhjwDoyZ6SFVuTQ"
  },
  "Jz4-RGLHB2pYxHzzUR4KzQ": {
    "date": "4/12/2010",
    "text": "A cute little cafe. Every time I have been in here, it has been very busy. Has great tasting food, though rather pricey for what it is. They seem to have the odd (in a good way) collection of drinks for sale. Worth a visit, but only if you aren't in a hurry and have extra money to spare.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ylLCne6ufPaNHmxF9clFg"
  },
  "QB_0veuF07etK57Hb2Tgmw": {
    "date": "11/27/2008",
    "text": "Great halloumi. Also good fizzy pink wine, of a derivation i can't remember but which nevertheless brought on the celebrating. And they brought me a macchiato which was exquisitely small and served in a glass cup, so as to show off the tiny shot of black and foam. Better than all that, they brought a taster plate of different chocolates and cakes, even though none of us ordered pudding.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "RwxLNxhp3N0-FssSwDizUA"
  },
  "WWh2YAv6bskjwPIxz5D7yA": {
    "date": "3/31/2010",
    "text": "What a great coffee shop. After visiting yesterday for the first time, it was a real haven from Edinburgh's miserable weather! I only opted for a coffee but was very pleased with it, the service and particularly the fresh, mordern decor. I must visit the sister cafe now!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cqecqnFK2eu88VtKJLHpiA"
  },
  "PD6Nhf_yCETU7XHiMuIk7w": {
    "date": "11/21/2008",
    "text": "I visited Urban Angel for the first time for a dinner with a group of friends. Having passed numerous empty restaurants on the way there I was surprised to see Urban Angel was busy, bordering on full. My first impression is of a lovely little, ethically-minded deli and cafe. It's in an old-style tenement basement and the decor has been left rather rough and ready, which is in keeping with the sustainable ethos. Water is provided on all tables which is a nice touch, and the food was of good quality, healthy, and mostly from local sources. A great find!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "clcemNTSlJs3O7iv_Q7BFw"
  },
  "Alm9fSiFsZ-o4-MCIWvmYQ": {
    "date": "11/14/2007",
    "text": "Opened in 2004 this cutsie eatery prides itself on dishing out mainly local, free range and fairly traded produce. A tad on the pricey side but that feeling of solid wellbeing and doing your bit for the local farmer and trader is priceless. Quality food in a quality setting.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bp6bMTGC8qUxT2A8DC37Cg"
  },
  "a6JvYfQ_yXHdI9CmpEaCJQ": {
    "date": "11/18/2008",
    "text": "Amazing that no-one has yet reviewed the new branch - the original Urban Angel on Hanover Street (still there & still good) spread their wings a little and took over the old Tapas Tree location on Forth Street. The same recipe of inventive, organic, local fresh food continues. The place has been decorated out to a very high standard and is usually busy. My last visit there for lunch last week was a fine example - beautiful hand-dived scallops to start, vegetarian haggis for main (try it even if not a veggie) and a sublime apple and banana tart with (real) custard to finish - all washed down with the organic Merlot and in good company too. Try it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VexgOwaVWntJt1ZUyraVcw"
  },
  "xDMd7wJziEnCrOKNif7sOg": {
    "date": "11/14/2008",
    "text": "Urban Angel is a budget vegetarian eatery off Broughton Street in Edinburgh. The decor is clean and fresh, with the best toilet door signs in the city. On my last visit I sampled the halumi and chickpea salad, which was incredibly tasty and very reasonbly priced. It does suffer from a lack of atmosphere at times due to the sparse layout and lack of customers, although on a summers day it is ideal for a Friday lunch.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NGGMzTpmh7ieHe5wPTQtjQ",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NGGMzTpmh7ieHe5wPTQtjQ/o.jpg"
      }
    ],
    "user_id": "ryFP0xBwLPqjsBu_ERicHA"
  },
  "B1bqzr-6cKofqUILSIZtzw": {
    "date": "10/10/2010",
    "text": "the waiter who greeted us looked as if he'd slept in his clothes; the table we were shown to had the remains of the last customers' meal on it; another scruffy waiter wiped it with a dirty-looking cloth; the water brought to the table was warm; the portions (and we asked for the 'large' portion) were pitifully small - I shudder to think how small the small portions were; the chef kept wandering in and out of the kitchen; a waitress scrawled on the blackboard which was directly behind me while I ate; the food wasn't particularly good (some of my beans in my casserole weren't properly cooked) and to add insult to injury we were charged 25 for two meals which some other places I've eaten in would have served as tapas at less than 5 per portion. It's a pity I couldn't give this place zero stars.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4NadL6k_10oj7q9r228BwQ"
  },
  "jAgDkUHZptPw-6dNP0gqBQ": {
    "date": "8/25/2009",
    "text": "great wee place - not so great for taking wee kids as it's down a few steps, space is a bit tight and toilets are a bit of a faff - we've not returned since we had our 3rd bairn - but no doubt we will when they're a bit older. nice food and friendly staff.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8f5AsveP0ojWAYaZU_2XeQ"
  },
  "KkZwLH-3OEtCqOPOjlhujw": {
    "date": "10/30/2007",
    "text": "passion fruit sorbet... damn yeah!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1g9_rAfoKieVn64my3Awbg"
  },
  "xh781xbwdActjbdWAP_o3w": {
    "date": "8/17/2014",
    "text": "Food was fine but pricey. Service was rude to say the least. We were asked to keep our lunch under an hour & a half (which we would have done anyway as it was just two of us). Plus, we were asked to stand in a certain spot by an angry waiter whilst waiting in the hallway for the table to be cleared & then once we moved, asked to move again, rudely by another waiter. I understand that the festival is stressful for restaurants, but being welcoming costs nothing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7cDv2xutXJZTHClKDSZKmw"
  },
  "sk9i8MCTdK3io0_WdMbrww": {
    "date": "4/3/2015",
    "text": "Great place with a cool atmosphere. They have a decent gluten free menu! I was able to eat there with no issues. Drip coffee was fair but I really loved the bottles of water on the table. Very friendly staff.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i9AztstacN3GKY8l2f4KYQ"
  },
  "0IQ_vFEZIjHM8gQ8qnuQ1g": {
    "date": "6/21/2016",
    "text": "Good bkfst spot, not a huge variety and not much on the lighter side, but the chorizo and mushroom toast w scrambled eggs really hit the spot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kBXW54yhJVSIeUJhjaJuWA"
  },
  "VRaY2J82fTWB4loKbQiZ0Q": {
    "date": "10/20/2011",
    "text": "Nice place, and nice sweet pastries, coffee, tea and scones.  More trendy/updated than classic.  Been here twice, but i rather prefer Peters Yard",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-GwqsPQ2WC-dNkjOyJ_FcA"
  },
  "tgzIdUEiLB7kD6-Sb5sweA": {
    "date": "7/22/2014",
    "text": "Stopped by for a late lunch and we had avocado and tomato on toast, hummus and flat bread, and pulled smoked pork on ciabatta with cole slaw inside with some yummy Mediterranean salads. Everything was so fresh and wonderful. Highly recommend!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Mk9pa4urkOWEGvfeIpmEw"
  },
  "b0GFVFl4GNRQOmhtfHqAqQ": {
    "date": "10/20/2013",
    "text": "So.... to tell you more about Urban Angel Hanover st. I treasure the welcome area. Many reasons as it is good to wait for a friend, can look at all the lovely salad and cakes( ready for when seated, great area to feel free to sit and quickly down a coffees. It's peaceful there as its brightness and sense of the staff having things in hand in the restaurant feels lovely. Really dig all the bars of chocolate in the welcome area for sale. Especially the raw consciousness!!! Go U rban angel!  And have a glass of proseco. Make all things right",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "VSQyBAZyifo1kxA-ChkP9Q"
  },
  "7sPT6AmVr9M_Zjz0mQF7aA": {
    "date": "5/23/2011",
    "text": "Two words - Vegetarian Haggis. When I was in Scotland, I knew I had to try haggis, but I didn't particularly want \"sheep's pluck\" (to put it politely) in my stomach. But, when I saw that they had vegetarian haggis, I knew I had to have it - and it was absolutely delicious. The desserts looked delicious, but I honestly couldn't eat anymore - I had decided to have the vegetarian haggis and one of the seasonal soups (it had been raining and I was soaked and freezing).   Plus, the whole place was great. It was a cute cafe, perfect for three friends to sit and have a great catch up and reminisce about high school. But not only was the cafe cute - the plating was also beautiful. Highly recommend everybody to eat here - especially vegetarians who want to try haggis. You're in Scotland - eat as the Scottish do!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KIRUItqBI5IwFB1PWqSGzA"
  },
  "JK_unfdnd9LfEo7J2Wjwtg": {
    "date": "11/10/2013",
    "text": "The perfect spot for Sunday brunch! Huge tasty portions, and quick and cheerful service. the French toast is awesome, especially with black pudding!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y61k45eT7vQQKWhDYNjoBg"
  },
  "rGvIpQSRngwZ_tjqFjaeAg": {
    "date": "10/13/2010",
    "text": "I wanted to like this place more but I think I may have just expected too much. The food is quite good, but unfortunately not prepared that well. The ambience is cute but the service isn't great.  -Chicken BLT - the chicken and bacon were delicious but the flat bread was completely burnt so all I could taste was char. Side salads were yummy though.  I like that they use seasonal and fresh ingredients, but the way it's presented isn't the best. The breakfast items people ordered around me looked tasty though!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2dNwjr46I_ImeMgIR8ljqA"
  },
  "ooeAvU2ER2Gi6oTvbiqYWg": {
    "date": "7/3/2010",
    "text": "Urban Angel has been a brilliant addition to the high quality cafe scene in Edinburgh, popping up a few years ago and gaining super quick popularity.  There are two branches of Urban Angel, one on Forth Street, and one here, on Hanover Street. In all honesty, I'm more of a fan, eating and drinking environment wise, of the Urban Angel on Forth Street, just because it feels more spacious and I like a good high ceiling, whereas on Hanover Street, the cafe is at basement level. It's still nicely done inside though, with a simple and very clean looking, contemporary feel to it. If you're right in the centre of town, this is a really handy option for a quick bite and a coffee, as the Forth Street cafe, although not far, is that bit further along at the east end.  Anyway, on to the food, which I am a definite fan of at all times. The menu is pretty extensive and really well put together, and you can choose from an awesome brunch and breakfast menu, if that's the time of day you're in there, or from a selection of lighter tapas options, and tasty soup, sandwiches, a brilliant Cullen Skink and an equally as taste bud pleasing burger option. If you've got room for cake, definitely sample some of the home made treats on offer here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5Mujjzv-ZH6HhxT-hWCpVg"
  },
  "tSAcG96MXvca32ESXGuBNQ": {
    "date": "7/24/2010",
    "text": "I popped into Urban Angel for a quick lunch bite last week and I can't decide if I'm a fan or not. The guy who served me was really pleasant so it's nothing against the staff who are all nice and friendly, I just feel the whole place doesn't seem to fit together as well as it should. I automatically wanted to dislike this place from the ridiculously naff name but I decided to venture in.  It took me a while to decide what I wanted from the menu, they have an excellent selection of brunch bites and I decided to go for the greek yoghurt with a seasonal fruit compote. I'm not sure what I was expecting, perhaps some greek yoghurt with a side of fruit compote that I could mix or just eat on it's own. I have to say, I was a little disappointed when it arrived. It was just a bowl of yoghurt with a small amount of fruit stuck in the middle, not exactly the best way to spend 4.50. It was okay, but nothing special, and definitely  not worth 4.50.  I sat outside and the weather was lovely and the seats were pretty comfy, I enjoyed sipping on my sparkling water and watching the world go by. I was tempted by the delicious looking cakes but decided not to, maybe next time though.  For me, Urban Angel would be a regular haunt if the menu has a better savoury selection and the prices were a little bit cheaper or perhaps the portions a little bit bigger or better presented.   All in all, it's an okay place to grab a bite to eat.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CqkdpG2tkCPQA69umlAHsA"
  },
  "hyhqu7_z_UWRi4EqLiI-hg": {
    "date": "6/21/2009",
    "text": "This cafe gleams like a beacon of light along a stretch of road overrun by American chains and overpriced entrees.  Walk down the few steps into Urban Angel and you feel immediately like you've come home.  No really, it feels like a home.  Comfortable, relaxed, and not fussy in the least.  I half expected to see crayoned drawings peppering the bottom two feet of the walls.  My favorite three things:  1) Its whole look: from the promo postcards to the menus, the strategically wallpapered walls to the worn wood floors, this cafe makes you feel like you're hanging with the cool crowd with none of the worry that you might be wearing the wrong shoes.  It's inclusive, but has just a bit of an edge on its customers (like an older sibling).    2)  I came here for breakfast two days in a row on a three day trip.  'Nuf said.  3)  Everyone who works here seems like they lead interesting, exotic lives that they'd regale you with stories of if they weren't so busy running around to serve their ever-increasing number of customers.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "ncGqga8KnrltsE0VMImugA"
  },
  "xhFwpGAR82ubvWM8NraPGQ": {
    "date": "7/8/2010",
    "text": "The Mocha's are good  The sandwiches are tasty  The staff are friendly  The price is ridiculous",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o0WGr8L3BWfH2Bslpnqw6g"
  },
  "vmH9c2XKbYMxubbQouApsg": {
    "date": "8/7/2014",
    "text": "Love this place!  High quality food...fresh, free range, local, organic.  We were in Edinburgh for three breakfasts and ate here for every one.  I really loved the Raw Cacoa smoothie, poached eggs with salmon, and raw salad.  Amazing place!  Full of light, yes cozy...made me feel warm and fuzzy and kept my stomach purring all day long =)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "loyhv1-XjRjw2PWagcdb4Q"
  },
  "Fdg8NZBUPVXogm8ro5RO1w": {
    "date": "12/10/2009",
    "text": "The best mocha I've had in Edinburgh. Nuff said :)  Really nice staff and a really pleasant atmosphere - perfect for a coffee house.  Don't be put off by the apparent small size - the real seating is through the door on the right!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "30ODyjnOKE1hjIKTs-o2YA"
  },
  "lKMmb-6ExVXDUqRvcXLASg": {
    "date": "8/31/2009",
    "text": "I'm so annoyed that I've only found this place with a few days to go in my month-long Edinburgh stay.  Food is top-notch. Drink choice is fantastic. Desserts delicious. And, to top it all off, there's free (reliable!) wifi. I've now spent half a day working from there, having found a power-point. I'd be doing the same again if I wasn't leaving the country so soon.  The staff are friendly and cheerful, the vibe is relaxed, from what I've picked up of the ethos, it seems like an intelligently and ethically run business.  If you're planning on getting dinner there, I highly recommend the spicy lamb meatballs. You may want to book in advance, though - there was a steady stream of disappointed almost-customers one of the evenings I was there, with all the tables booked out before dinner hours really started.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_5X2car5GgCIiAOLd8gt-A"
  },
  "QuurhVwRjB4_ZjTWxR5Ucg": {
    "date": "1/8/2009",
    "text": "If you find yourself wandering down Princes Street looking for something to eat PLEASE take my advice- walk past TGI Friday's, McDonalds etc, past the overpriced George Street restaurant's and bars and down to Urban Angel on Hanover Street. The food here beats everything nearby- fresh, locally sourced, original recipes and all homemade. In addition to the substantial brunch, tapas and dinner menu's there are always a great range of specials. Pasta of the day, risotto of the day, fish of the day- delicious!   I've been here at every time of day and I've always been impressed. Burgers are enormous and come with great chunky chips. The scrambled eggs have obviously been made slowly with loads of butter and cream but my favourite is the tapas selection. Halloumi bites, pork belly with fennel and chargrilled artichokes- yum!   Not only is the food here great but the venue itself is beautiful. Exposed stone walls, wooden beams and an odd fire place have a very country cottage feel. Urban Angel is a lovely restaurant and well recommended!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "F7o19Xwgh-Qtg-8zgkFNiw"
  },
  "Vy9jawMBnA2iFMC5nHVbkw": {
    "date": "9/18/2011",
    "text": "Great location.  This unassuming front of the house cafe leads to a dine-in section (make that two) in the back.  Lovely find during our weekend getaway from London.  Friendly and helpful staff fueled us for our day at the Edinburgh Castle.  The Chai (with honey) was yummy, the benedict (with smoked haddock) just the right amount and the oatmeal - made to order and to your preference.  It was just a tad too early for the arbroath smokie but if i'd a second visit would've definitely tried the dish.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5gz8szYeYntJMCBtReC8gA"
  },
  "tAFa8XbgRbLMlQQEUTghTA": {
    "date": "1/9/2009",
    "text": "Urban angel popped up in 2004 and has been quite a success with new stores opening around the city. Despite assumptions UA is not a vegetarian establishment and serves a fish, meat and veggie menu.   I have found the food here uninspired and very expensive and the service mediocre (I waited 20 minutes in a deserted store for a sandwich one afternoon).   Treat with caution!   Ess",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vQnR9L9HILjw4PgWB8q1cQ"
  },
  "mAhDkJv05l8pGn4ePNE7pw": {
    "date": "5/29/2011",
    "text": "Great food. Smoked venison sandwich is amazing. Long wait for lunch and the host acted though as we were putting him out by telling him we'd wait for a table. That was the only con. The local Scottish sodas are really good too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lzpQkHsCtuEhMre6RUh1Xw"
  },
  "eHwTQz4LCLddQ94MEx5tAg": {
    "date": "6/29/2017",
    "text": "Went for breakfast on our vacation. You get small portions for the price you pay. 9 for a slice of French toast and bacon. My dish was not very good. My husband got the eggs benedict with salmon and that was decent (still overpriced). Coffee is good but very small in comparison to other places we visited during our stay. Service was good but I would skip this place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_QcptefEYUOk5kXxjokQsw"
  },
  "0-bIcW5heO4tSxa1wpJaqA": {
    "date": "8/11/2014",
    "text": "Superb food, not the most child friendly place in the world.  We did come during the festival so that might excuse the less than friendly welcome we got but there was a definite feel of \"it will be quite a wait for you\" translating as \"I really wish you'd get yourself the hell out of here\" from the \"greeting\" staff.  We ended up sitting outside which worked out fine and the food did make up for the welcome as did the coffee which was superb.  We'll come back without the wee ones and give it another whirl",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_QLRCGEIFkwYXKcy0SBvKw"
  },
  "zoXmWRk1diqTuA7lMSR4vw": {
    "date": "12/4/2013",
    "text": "I recently had brunch at the Urban Angel. I loved this place. Their menu featured some classics like eggs benedict, scrambles, and quiches but also had some more inventive dishes such as a superfood salad and falafel flatbread, which is what I opted for and thoroughly enjoyed. My friend got eggs benedict and said they were great with some of the best hollandaise he's ever had. Also also had some great-looking juices and smoothies which we were too full to try, but the coffee was excellent. This place emphasizes the quality of the ingredients they use, so everything tasted fresh and well-sourced.   The ambiance is nice - relaxed in a basement with wood furniture and natural light. It's nice, but casual.   I would say the service wasn't great. Everyone was friendly, but it took a long time to get our food -two tables sat after us got their food ahead of time. However, I did feel this was a one-off and it wouldn't stop me from going back again.  All in all, I highly recommend this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "a1ZvE7muOisfVUgnz9NxlA"
  },
  "xKhJeFeKxJvC9UnOqo2lFQ": {
    "date": "8/2/2014",
    "text": "Delightful little place!  Went for brunch and love the super fresh eggs, fresh squeezed juices, good tea, thoughtful food choices, and generally refined feel.   Wouldn't think twice about going back any time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rnNkt2okxwb6H3aYjgu9Rw"
  },
  "sprUTpcbKOFGFD1mbBijfQ": {
    "date": "5/21/2014",
    "text": "Damn, I wish I could remember to take food photos.    Anyways, the husband and I walked here from our hotel on the Royal Mall for brunch on a Wednesday at about 1.  For ppl from the US, Edinburgh is NOT a cheap eating city - however, many restaurants offer a prix fix menu with options for selecting an item from the apps and an item from a selection of entrees and so on.  For 10 pounds each we had an entree, choice of tea or coffee, and a glass of fresh squeezed OJ (delish).  I chose the avocado and cherry tomatoes on toast with the addition of a poached egg.   Doesn't sound like much, but picture a giant slice of brown home baked bread, about an inch thick with and entire avocado mashed on top of it and bright cherry tomato halves sprinkled with sea salt - and a perfectly poached egg YUM.  Service was good - ingredients were superb.  Oh, husband had an egg benedict - said it was great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YczurbalRifsqoV3OmWE7w"
  },
  "_HLoqAb6ssjWcmUd2r7WsQ": {
    "date": "2/17/2016",
    "text": "Food is average. Great for brunch and lunch. Love the interior and ambience.Coffee is always good. Reliable and quick service. They used to have the best New York Cheesecake but they don't have this now unfortunately.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JwLgaFivbSO0prsju8H9KQ"
  },
  "lLpy-02OhfrcpA-e3aOASg": {
    "date": "1/6/2015",
    "text": "I ordered Eggs Benedict and toast with avocados,salsa tomato n poached egg are for breakfast .  The poached egg is so good which is a really  liquid yolk inside! Everything is really  good. Then I had  a breakfast smoothie which are mixed banana n berries. it's a good ending.  What a good morning!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YsAXV5Q8FJJy1XDNeU30eg",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom. Poached egg with liquid yolk",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YsAXV5Q8FJJy1XDNeU30eg/o.jpg"
      },
      {
        "img_id": "AtbWc1tr0zlrUhw1zvPTQQ",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom. Toast with avocado and salsa tomato",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AtbWc1tr0zlrUhw1zvPTQQ/o.jpg"
      }
    ],
    "user_id": "z3dT8ynQUBg6ByHuiY3aMg"
  },
  "vcSgMNhLQZuPwW_fMu6dmw": {
    "date": "12/4/2015",
    "text": "I've been to many of the most popular breakfast/brunch places in town, and Urban Angel definitely ranks near the top. Beautiful decor, creative and delicious food. Loved the Spiced Almond smoothie and Avocado and Ricotta (homemade) on their house \"granary\" (also homemade). Urban Angel does a great job of catering to those with dietary restrictions (i.e. lots of GF, DF, and vegetarian options). The food is pricey but deservedly so. I will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y81N4elAYYNFTKr25yDINA"
  },
  "_GF_BaoZP5pSWFDVwxlccA": {
    "date": "10/9/2013",
    "text": "It would be a 4star but it's been brought down a peg due the the price tag.  You're no angel for being pricey UA! That aside, it is good food.  We went to the Hanover cafe for a tapas of light bites one Sunday afternoon and it was all very tasty.  Some even quite unusual, such as artichoke, kale and pinenut brushetta.  My favourite was the creamed smoke salmon with horseradish and herb crostini.  After sharing 4 'little plates' we were surprisingly full!    The opening times surprised me here, it closes at 5pm on a Sunday, which seems a little early.  I'd would have expected they would stay open longer, being located at such a prime spot for possible evening diners.  If you do come here sit in the back area, here you'll find the authentic old servants (?) kitchen with orginial Belfast sink, floor tiles and built in wood burning stove.  Everything appears to be in miniature too.  The rest of the interior is quite rustic with chunky timber and industrial style lighting.  Very trendy urban chic.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1-dmQknIfIwZ6rmXk5r0pA"
  },
  "QuUmR_9Y4Ng3aE2DeGqgQg": {
    "date": "5/26/2013",
    "text": "Met a good friend here for a birthday brunch. Great menu choice, attentive service & good location.   I had the beef burrito from the specials board, it came with veg rice, sour cream & guacamole. Tasty & fresh & well seasoned with a hint of spice but not enough to make my eyes water. It definitely hit the spot.   Mrs D had the pulled pork ciabatta which she thoroughly enjoyed. There was at least half a pig in there & she managed to polish it off. The homemade coleslaw earned brownie points too.  Since the sun was out & it was her birthday through the week, we both had a cheeky glass of rose with lunch.   To finish I had the chocolate brownie & a pot of tea & Mrs D had the lemon meringue tart & a flat white. The brownie was light but a little dry & crumbly but I still polished it off. Mrs D said her dessert & coffee were superb. She could give Rachel Allan a run for her money so that's high praise indeed though neither of us liked the schooshy cream on the side of the plate.  Will definitely go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "R9UNH0rb3a_glQlk4ylKCw"
  },
  "2VRqpL4wENzswfTMr_lQzw": {
    "date": "4/20/2014",
    "text": "1 Forth Street, EH1 3JX or 121 Hanover Street, EH2 1DJ. Appropriately obsessed with the chai tea latte and True Scottish haggis I had for breakfast there. Delicious. Serves lunch and dinner, too. Haggis, by the way, is sheep organs ground with barley, onions, and spices. Quite a sweet meat-esque dish; very hearty, fulfilling, tasty, and chock full of iron and trace minerals.  Emily Rose Reeder",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "szJGIAReInHXt7r8RQxcKg"
  },
  "fwXzKXCWwmfMTaGXmA3CMQ": {
    "date": "4/1/2013",
    "text": "I've been to Urban Angel on Hanover Street a couple of times now - both times for coffee and cake - and, although I really want to love it, I can't quite commit just yet!   The decor is right up my street (I love the old black and white photos of Edinburgh on the walls!) and the staff are really friendly... The only things holding me back from really liking this place (and they seem a bit silly!) are that the loos are always freezing cold and my brownie came with squirty whipped cream and berry coulis. The second might seem the most fussy but if they'd given me that brownie on a plate with nothing on the side I would have been very happy. Why ruin it with cheap cream and unnecessary coulis?  Apart from that, I liked this place and I would go back but perhaps in summer and for a meal/breakfast!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YZgUPGJQcDTCzzbxIaxNcA"
  },
  "70etcO3gwD0kQUo8NME77g": {
    "date": "5/28/2013",
    "text": "Glad they got rid of the auto play music on their website. That was truly abhorrent.   I wish I could like this place more as it is literally a stones throw from my house on the other side of the Queen St gardens.   I do recommend tourists and out of towners to come here that are staying with me due to it's location, however I can't pay these New Town prices even though I live in the epicenter of it. The food in the several times I have eaten here is pretty hit and miss. Ingredients are decent and service can be good to indifferent depending on how busy the place is. Took my parents here who are even more haughty than me and everyone was disappointed.   To pay 9 for a breakfast is just above my limit and as a former short order cook for that money I can get to the shops and rustle it up myself (even in the grip of hangover).  I like what they are doing and most people will keep going at these prices but as an Aberdonian I baulk at paying that myself. For your money you can get more in Edinburgh but then brunch is about proximity and in this area you can charge top whack.   GO  If you're in the neighbourhood, you're not going to be disappointed but neither are you going to be blown away.  DON'T GO  If it involves a detour, when they opened this was an exciting edition to the Edinburgh scene but now clones are ten a penny on nearly every corner.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hbRDTyoHgeqUC-NLVlXR_w"
  },
  "scLFhUcysd-xX2EAQSAGfQ": {
    "date": "8/18/2013",
    "text": "Just has brunch in this cute and hidden place. Perfect for Sunday morning breakfast or brunch, quietly buzzing and with great service.  I had eggs benedict and my friend had French toast with bacon, both top notch and beat another venue for brunch yesterday. Juices and shakes a little on the expensive side - 4 for fresh orange which wasn't special, but the food was reasonably priced.   Overall definitely recommend this place - exactly what I was looking for on a sunny Sunday morning during the fringe!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U5BQzaDMIWM8Jn4Ez-EAZw"
  },
  "qu0IlTVAVKQqNrI-Alvf4Q": {
    "date": "6/29/2016",
    "text": "Very good breakfast, friendly service. Very helpful for a gluten free diet/allergy. Had the eggs with sausage, coffee and GF lemon poppyseed bread. They had GF bread as well, which they said is toasted separate from the standard bread toast. The coffee was excellent by the way.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OF4_4PYBRvrMmzItgk2paw"
  },
  "TyglMoz1WmpkcK02W2Bvgg": {
    "date": "10/30/2016",
    "text": "Great food, VERY fresh, worth going. However, not worth waiting for 40mins queueing on weekend morning.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "APUX8MOAvx26EAxoSIzG7Q"
  },
  "IOjyfslXmggp6D-rtGmAYg": {
    "date": "8/20/2016",
    "text": "It's fine, I guess, if you like fairly mediocre, overpriced food with a hefty side of attitude. For a place with a great deal of breakfast items on the menu, the eggs are woefully overcooked (eggs Benedict). The chorizo and spinach dish is trying but somehow just never comes together. The cold brew is good though more expensive than it should be.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7XneXYnp3y7nvPyPtlmpwA"
  },
  "c0xCnZTJYeklZnbueN-b8w": {
    "date": "7/3/2010",
    "text": "I've nipped in here one or two times during the lunch hour. So far, the cappucino, soup, and smoked salmon sarnie I've tasted have all been from the top drawer, but the place is just a bit too overpriced and unloveable to do it for me. And I find the name really, really annoying.  \"Urban Angel\" is the kind of name a frumpy, 30-something, Fiat Punto driving woman would pick as it's \"soo Manhattan\". It's not, it's just wanky and irritating, and another indictment of the deluded nature of the city's New Town.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZyLcdnWGw4BjXLhm1I-9yQ",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom. from website",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZyLcdnWGw4BjXLhm1I-9yQ/o.jpg"
      },
      {
        "img_id": "mYelMYlNAG2J6ksuSApPFw",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom. from website",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mYelMYlNAG2J6ksuSApPFw/o.jpg"
      },
      {
        "img_id": "MHIlXMpi1d1PqPD3gipGLA",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom. from website",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MHIlXMpi1d1PqPD3gipGLA/o.jpg"
      }
    ],
    "user_id": "xXQTdJXPGOP-NUYctcQw8g"
  },
  "dQ-NZO8epAUVQHZrgVNlRw": {
    "date": "5/16/2015",
    "text": "In the heart of Edinburgh's New Town, an UNESCO World Heritage site, great cafe with gourmet style soups, salads, sandwiches and mains. Great smoothies and coffees.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aFswSvwxe5sX9mXd_-1zoA"
  },
  "nwujqYqWPajoHybSBTuVHg": {
    "date": "11/9/2014",
    "text": "Very good food, sometimes can have you waiting for a table for a little too long. Pretty fast service, and lots of healthy smoothie options!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N77IYsTnvLbxw21YJmV51A"
  },
  "pmb3IqkzVlsH1OoWpHUQrw": {
    "date": "8/16/2017",
    "text": "We came here for breakfast before another day of exploring beautiful Edinburgh. We were very pleased to know they had free wifi, also the food was delicious and the portions were very generous! We ordered the eggs Benedict with spinach and the avocado on toast, both did not disappoint and the cappuccinos were delicious. I recommend stopping in here for a bite if you are looking for something yummy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PxIYKVpoKa0BmQDh8x6v1w"
  },
  "eBFzfd6INW3ebEICphesgQ": {
    "date": "5/14/2017",
    "text": "Having asked my phone where I could go for great scrambled egg, Urban Angel was the number one selection. Just a short walk from our hotel, it proved to be an inspired choice. Urban Angel is quite a spacious place, with innovative art adorning the walls, varied seating and great music, serving as a good accompaniment to a lively vibrant place, where you can relax and plan the day. The menu was varied enough to a have range of items from homemade granola and porridge, to substantial cooked breakfasts. We opted for porridge with lashings of maple syrup and scrambled eggs on toast with black pudding, very tasty! The accompanying  flavoursome cups of coffee and a refreshing cup of Earl Grey, complimented the breakfast perfectly. A little expensive perhaps, but Urban Angel is near the centre of the Edinburgh, but definitely a great choice for breakfast",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "7tCL10cCP1EzOXyILgnMvA"
  },
  "cMFTC1h2csnOA6vkyRORVA": {
    "date": "3/17/2015",
    "text": "We were a group eating here for lunch and I was stoked to arrive and find a super cool rabbit-den layout with lots of little nooks and crannies.  The menu is pretty damn drool-worthy and the toughest part was narrowing down what to eat from all the things. Avocado toast immediately jumped out at me, so I got a portion of that to share with the amazing Jody B. The other dish I really wanted was the chorizo + mushroom toast with a poachy, but I asked to swap the chorizo for salmon which the guy said was fine - happy days.   Food didn't take long to arrive and overall, it was delicious. It's obviously all freshly made and a lot of love and care goes into it. The thing that really let down the experience for me though was the guy who was serving out table. He was definitely a bit grumpy, and when an order was mixed up he didn't apologise for it. It was just a bit awkward and tainted the experience for me. I don't find myself in this part of Edinburgh very often so I can't say if it would put me off going back all together.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "LGZmZWi4WRiYG_43Pa_Gzg",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom. Spinach, mushrooms, salmon &amp;amp; poached egg on toast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LGZmZWi4WRiYG_43Pa_Gzg/o.jpg"
      },
      {
        "img_id": "ftuehPb_2n3g_66daI-q4w",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom. Avocado toast with salsa",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ftuehPb_2n3g_66daI-q4w/o.jpg"
      }
    ],
    "user_id": "6EWIu6Ea04qcFAL3XSalvQ"
  },
  "BrvE7YQMzS_LCaag7CtkbA": {
    "date": "3/17/2016",
    "text": "Not being a resident of the 'burgh I often struggle to know exactly where to go for food when I'm visiting. There are plenty of nice, wee cafes and places you can get a decent coffee and cake but when it comes to breakfast or brunch I'm always a bit stuck for where to go. I'd bookmarked a few places on the Yelp app to try but I found that sadly quite a few of them didn't serve breakfast/brunch after 12pm *sad face* This predicament isn't unique to Edinburgh though, it happens a lot other places too. Boo. I'm a BIG fan of breakfast & brunch and especially enjoying a looooong, lazy breakfast/brunch at the weekend. Luckily for me/us Urban Angel is one place that DOES serve their Breakfast/Brunch menu after 12pm ~ joy! In fact they serve Brunch until 5pm ~ ya beauty! I already had a feeling I was going to like this place...  We arrived on a Saturday morning at about 11:30am and it was already very busy. We were told there was a wait of about 30/45 mins. I didn't mind the wait as we had a table and they said we could order a coffee while we wait. It's also a nice wee area near the counter to wait so we were quite content until we were called to our table. This place is bigger than it looks yet I get the impression they could still do with expanding it as it seems very popular, especially, I imagine, at the weekends. I liked the decor and vibe of the place & also (more importantly?) the menu. So many lovely choices. I found it hard to pick. I settled on the Eggs on Toast; Poached eggs with a side of crispy bacon. YUM. It was really good ~ the eggs were poached perfectly & the toasted granary bread/butter/crispy bacon combo was great. Had it have been sourdough bread it would have been ideal. My boyfriend ordered his fave: Eggs Benedict & he said it was also really good. It must've been as I didn't get a look in! Doh.  I also had 2 coffees; a soya flat white whilst waiting which was really top notch (I love their cute mint cups & saucers) and a filter coffee with my food, also really really good and again served in their cool cups with a dinky wee cute milk jug too. My partner had a bottle of All Good Lemony Lemonade to drink & I fell in love with the uber cute bottle! I must find somewhere that sells it in Glasgow just so I can own one. Besides looking cool it tasted really nice too.   Price-wise it's pretty alright ~ My food came to 8 and the EB was 7. My coffees were both around the 3 mark. I noticed they had really tasty looking/sounding cakes, one was Chocolate, Beetroot with Salted Caramel, which I am NOW fully kicking myself in the bahookie for NOT buying. Uh. I was pretty stuffed though but next time I'm saving room for cake!   Staff were all lovely and it's a really cool atmosphere/place to do brunch or whatever. If I lived here I'd be a regular for sure. Only niggles I had were the wait for a table and the Wi-Fi wasn't great once you head downstairs.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "emzaSNVmK-hMla2yBtE3_g",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom. Filter coffee",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/emzaSNVmK-hMla2yBtE3_g/o.jpg"
      },
      {
        "img_id": "R8EKVswEj2cJC7jqlWd-CA",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom. Eggs Benedict",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/R8EKVswEj2cJC7jqlWd-CA/o.jpg"
      },
      {
        "img_id": "6Y7B0-WihuKyxRo-PH9Muw",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom. Poached eggs, toast with crispy bacon.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6Y7B0-WihuKyxRo-PH9Muw/o.jpg"
      }
    ],
    "user_id": "612gs1pbACfzsMMiBBO80g"
  },
  "st3WiBJay2he7QnW1DtpzQ": {
    "date": "9/30/2014",
    "text": "I suppose I should get over the fact that everything, simply everything in this city is some degree of charming or exquisite, if I'm to save my next year of reviews from the endless loop of, \"oh my gosh, it's so pretty!\"   But give me a break, it's only day two.  Oh my gosh, it's so pretty!  Shabby chic interior with wood detailing and a hidden courtyard? Edinburgh, i'm in. Let's do this. Pull on a few more heart strings why don't you? For hecks sake, I even found the four lopsided stairs into the place charming as #$&% (though, this city is like a high heels olympics.)  Hailing from the land of, \"absolutely EVERYTHING must in some way sound like it will save your life\" (also known as Vancouver), I truly appreciate a place that makes fried cheese sound healthy.  For lunch, I inhaled the halloumi with fried tomatoes & a side of portobello mushrooms. So distracted was I by the promise of fried dairy that I failed to notice the \"small plate\" classification. I may look like a lady, but my appetite thinks otherwise, and though exceptionally tasty, it was not enough to keep me going for the rest of the afternoon. Thankfully, they also boast some seriously tasty smoothies and the Recovery with peanut butter goodness was enough to keep me perky through the remainder of the work day, while still seeming healthy enough to partake in a particularly devious dinner (stay tuned). With good coffee to boot, I could see this place fast becoming a lunch time haunt when i'm in need of some greens and a quiet atmosphere.  Bonus points for the GF availability - it will come in handy when the mother unit comes for a visit.  Definitely worth a pop in the door but do mind the steps!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "mOEdxeXCW9yoHN3SiqKErQ",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom. Same thing, different angle, still delicious.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mOEdxeXCW9yoHN3SiqKErQ/o.jpg"
      },
      {
        "img_id": "AocjQdiUUOqBzLmQt3COrg",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom. Avocado on toast.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AocjQdiUUOqBzLmQt3COrg/o.jpg"
      }
    ],
    "user_id": "H5TEwR-OD0XxILGNaewohA"
  },
  "b1j9pabDbhIexs5GrRGczQ": {
    "date": "5/11/2015",
    "text": "Last brunch in Edinburgh, and it was delightful.   My friend and I ordered the toast with garlic/tomato/olive oil spread and the chorizo with mushrooms/spinach/poached egg. Both dishes were solid with great presentation.   Service was prompt and kind.   I absolutely adored the ambience -- very simple but sophisticated. A cute local type of place.   Give it a try if you're in the area and need a quick brunch!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Aj5lcLOtUK1vnib8N6q-fQ"
  },
  "y8olUF6y-8O9n5KWPlYN6A": {
    "date": "8/3/2016",
    "text": "Concierge at our hotel recommended this little cafe for breakfast and we are glad he did!!  The food was top notch!  The juices are all freshly squeezed, the smoothies are awesome, and the food itself absolutely delicious and made fresh on premise.  (the jam and custard we had with our toast was the best we ever had - we found out they even make them in house!)  Id also like to point out their eggs benedict is PERFECT!  Best little breakfast spot in the area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z6l4EBQohw_4TwJHkv3UfA"
  },
  "nmTSKT4gkwjUjsqf6kfyjw": {
    "date": "6/25/2015",
    "text": "Extremely fresh food. Lovely cafe to visit for a brunch and some filter coffee.   A must have is the avocado on toast with broad beans and goat cheese. Amazing food and friendly service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6MrYxds0d0wL9RjgGkretg",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6MrYxds0d0wL9RjgGkretg/o.jpg"
      },
      {
        "img_id": "k5XI_qv0xBFAI8fT8TveJA",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/k5XI_qv0xBFAI8fT8TveJA/o.jpg"
      },
      {
        "img_id": "4bxiAfalhHPHboxEEe_uoA",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom. Eggs benedict",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4bxiAfalhHPHboxEEe_uoA/o.jpg"
      }
    ],
    "user_id": "xt0a0WV7pDSSSUXpXs3YSA"
  },
  "2G9IoDADkF54DaM_MwxF_g": {
    "date": "1/17/2016",
    "text": "Great breakfast/brunch spot right in Edinburgh!  Amazing coffee and avocado toast.  It's such a cute little place to enjoy a cup of tea too.  Super homey and everything we ate was delicious.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "LmGadCd2vyypPaqtF51XsQ",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom. Cappuccino",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LmGadCd2vyypPaqtF51XsQ/o.jpg"
      },
      {
        "img_id": "XqWO429A1rLC3UhzhVKETQ",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom. Avocado and ricotta toast-got too excited and ate a bite.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XqWO429A1rLC3UhzhVKETQ/o.jpg"
      },
      {
        "img_id": "2asH_OALqQpj-0kLpf0WBw",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom. Cute cafe with back rooms. Feels like someone&amp;#39;s home.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2asH_OALqQpj-0kLpf0WBw/o.jpg"
      }
    ],
    "user_id": "_zK0LrKpyKhZ8BOQq752Jg"
  },
  "8_qmj-B2HxCk6f4YTRu9qQ": {
    "date": "2/1/2017",
    "text": "Had a wonderful early breakfast at Urban Angel. Their mocha was delightful to start and really warmed me up. My husband had the traditional breakfast with beans, sausage, rasher bacon and an egg while I had a bacon roll. Both were delicious and filling. We were seated in the back room away from the front counter so it was a bit more intimate without being distracted by folks coming in for their morning coffee. I was afraid we'd get forgotten, but the service was spot-on. Highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "RAWfLiL8glbqpl__VEJx9w"
  },
  "9rKO-kQePJ1qks4GxGJfBA": {
    "date": "3/27/2017",
    "text": "Was visiting Edinburgh for a weekend with some friends and we came here for breakfast - TWICE! It was that good. Had the avocado toast one day with the mango smoothie (delicious) and almond butter toast the next. Would highly recommend this restaurant to anyone looking for a healthy, locally sourced meal in a great part of town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "u_G1NeWQIPh7SUCVQrsp8w"
  },
  "GRarB3jNTgnH4M7ab_K3Tw": {
    "date": "4/23/2016",
    "text": "Very cute, home-y atmosphere. Great service and even better food. Everything on the menu sounded delicious, my porridge was tasty, sweet, and filling, and everything on other tables looked amazing. Came for breakfast and was eye-ing the lunch menu so I will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fgJeX63H8D8lhX9lGUkvWw"
  },
  "GX2M90spz6Ha3hmmyvO3nQ": {
    "date": "10/9/2017",
    "text": "I ordered a salad to eat healthier. The 'watermelon salad' was 4 pierces of watermelon and a couple pieces of cheese and two pieces of bread. Worth 8? I don't think so. Salad is a very loose term here, double check with the server what the dish actually contains",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QDT60_qz4Cqy4PuG8k-1kw"
  },
  "23e9Zqrj6rCyXbQYszec7w": {
    "date": "2/12/2014",
    "text": "This place is a favorite. I think of their eggs and bacon anytime I want breakfast. They also have this thick amazing bread that comes with, and for 7.50, I'd say it was worth it. When I was about to head out I impulsively ordered the raw chocolate shake, and my my I was glad I did. 4 for delicious, not too sweet, raw goodness. They are organic, fair trade, local sourced - they care about the food they serve. And it tastes better for it. The lovely staff let me sit for nearly two hours, writing, relaxing. They are under ground so no wifi- but I made due. They have a fireplace but it was not on, a bit of a bummer, but hopefully they turn it on sometimes. But then, I might never leave.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "Et1kX7gtotXUjbIxM-0Vew",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom. Eggs and bacon, and the most delicious bread I&amp;#39;ve had in a long time. Also had the raw chocolate smoothie - i will dream of it",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Et1kX7gtotXUjbIxM-0Vew/o.jpg"
      }
    ],
    "user_id": "tVrGBW6rj1uebWnqjY-iTQ"
  },
  "Ewhf05ylXq4bhjuRtvZP5w": {
    "date": "7/4/2016",
    "text": "The food here is great. They have a variety of options that range from brunch foods (including freshly made juice) to a fish-of-the-day served over roasted sweet potatoes. And here's a bonus: the tables are large enough that you don't feel cramped.   However, you may have to wait a while to get a table--even for parties of two. Which can be uncomfortable in this restaurant's atrium.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CxrqKxR9UnzmQXGXOaanBw"
  },
  "blX4NuoLpfqQXs5iCMwhIQ": {
    "date": "5/5/2014",
    "text": "Stopped in for breakfast on the May Bank Holiday.  Located a few short blocks from Princes Street on Hanover.  Nice atmosphere, friendly enough servers, tasty food and good, strong coffee.  Rating is for brunch (4 stars).  A bit expensive for brunch so I would give it only 3 stars for value.  French toast & bacon was good. Porridge with honey was good. Breakfast smoothie was OK. Coffee was good. Service was fine. Atmosphere is good, I liked the old stove / sink in the seating area.  Give it a try, see what you think :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Iuly-9WY_kczsb5m_EL7TQ",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom. Cappuccino, with lots of love (tasty too!!)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Iuly-9WY_kczsb5m_EL7TQ/o.jpg"
      },
      {
        "img_id": "sfW7jtOZG28FrK2ytaiZww",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom. French toast with crispy bacon",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sfW7jtOZG28FrK2ytaiZww/o.jpg"
      },
      {
        "img_id": "OligIrdE4OC3A262siQeJA",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom. Panorama of rear dining area, looking forward towards street",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OligIrdE4OC3A262siQeJA/o.jpg"
      }
    ],
    "user_id": "uHOQS0jFKEBwP-YfKXAIjw"
  },
  "G0HkJ1KcwB1DjkaXkGnd8g": {
    "date": "1/3/2015",
    "text": "A cute, chi-chi place in New Town. I got the kale, spinach, mango, coconut water and spirulina smoothie for takeaway- 4.60 quid- and the orange polenta- 2.60 quid. A little too pricey overall for both as the frothy, smooth drink went down too fast. But the polenta, wow, incredibly rich and moist and could only take a few bites at a time. Well-done!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OoDYh7DK_9tpOneTacTlaQ"
  },
  "5ymWnd-jrqTpH4lh4djk8w": {
    "date": "5/13/2015",
    "text": "I come here regularly for coffee and have yet to have a bad one. This place usually has quite a wait for a table at peak times and I've noticed that some customers come in looking for their favourite barrista, which I think speaks volumes.  Staff are always friendly when I come in and the price is reasonable.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NwVyki35xOcaxhMzHNtHDQ"
  },
  "HJf2cNjG4qCgDeJTEds97Q": {
    "date": "4/8/2014",
    "text": "I'm laughing at myself for this one as I got the wrong branch (there is another one on Forth St) - so had to run to meet the rest of the hot chocolate search team!  But I like the atmosphere of this Branch and i will be back!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BhYROfCjIJsKUk22_IVHig"
  },
  "faQsXhgsRifXeBi6-7XusA": {
    "date": "4/7/2014",
    "text": "Went here on a rainy Sunday afternoon. I'd never been to any of them, but it was the only place I could think of for both coffee and food (and ambiance) in New Town. The girl working the counter was lovely and offered to let my friend and I sit in the area around the counter. I opted for table, at 2:30 they were fully-full, so I was happy there was one for us. The menu is filled with yummy and healthy options and it looks like they serve a smashing breakfast. They also offer lots of fruit smoothies and shakes, which all sounded amazing.   I opted for the eggplant quiche, which was on the special board and a flat white. The service was very on to it and it is a cozy little place, all be it, a bit nosy, but it was very busy, so always a good sign. My food arrived not long after and to my surprise (and delight!) the 'salad' alongside the quiche, was not your traditional green leaves, but a mix of a small lentil salad, a small grain salad and some pickled eggplant.  I am a sucker for all things eggplant and the pickled eggplant or maybe it was just served cold after it has been cooked in something slightly-sweet or vinegary, but it was delicious! Light and fluffy and filled with veggies. The accompanying salad was a real treat and was so nice to have instead of the average green leaves you generally see.   They had a cheesecake on special, which looked amazing, so I will definitely be back for breakfast or cake at some point. My only gripe about this place, is the coffee tasted fine, it just came out and wasn't very hot. I would need to have it again, as it was a bean I have yet to encountered yet in Edinburgh.   A definite stop for me from now on!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "dPA1RBX8-pF54IQGvwpyRA"
  },
  "8BByNEOvo_DjtMKkJ94xLQ": {
    "date": "8/13/2019",
    "text": "A cute little gem hidden on the corner. Staff were friendly and helpful. The food was great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nZQdKcNnDpbiRrZXd9lMKA"
  },
  "RD9ZKrVBhEuxFhENuOuvQw": {
    "date": "6/27/2018",
    "text": "Cute place with great ambiance, but seats are really uncomfortable. Service was slow in taking our order--you can order at the counter before you are seated and you will be taken care of before people who order after being seated as they tell you to do. (In other words, locals know the scoop) Cappuccino was good but only lukewarm. Food came out fairly quickly once we ordered. We had the eggs Florentine; eggs were cooked perfectly and sauce was good. Side of sausage was really delicious--lots of flavor.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kP92EoMqvHJVnoSaPXtShg"
  },
  "WWiI_s2PN11eqa_R7sf5mQ": {
    "date": "2/19/2019",
    "text": "Love this place!  But you definitely need to reserve- went a couple times during our vacation and it was always packed!  The staff does try to accomodate you, think they're used to the bustle.  Yummy mochas, delicious french toast, really can't go wrong with any of their breakfast options!  Also, we grabbed a couple of smoothies for our walk down to the train station and they were so tasty too!  Love this place :)",
    "rating": 5,
    "rated": {
      "funny": 18,
      "useful": 28,
      "cool": 29
    },
    "photos": [],
    "user_id": "vfS3_cr8iqv5snG6uknwSw"
  },
  "L-PelZ2zgSBcW_gh016gcw": {
    "date": "11/26/2017",
    "text": "After being turned away from several closed/packed bistros and restaurants in the area, we stumbled into quiet Urban Angel in search of a decent, warm dinner. The cheery, bright cafe facade belied a cozier, interior seating area, which my friend A. deemed \"perfect for couples\".  A. was disappointed that they didn't serve smoothies in the evening, but ended up highly satisfied with her creamy butternut squash soup. H. and I split the charcuterie plate, which tasted balanced and was plated beautifully. The arugula was fresh and melded well with the smoky, savoury sausage and cheese. My main dish was the pork meatballs with roasted root vegetables - the meatballs were a bit salty but overall the dish was very successful. I wiped as much of that juicy pork oil off the plate using the slender cuts of veg. H. ordered the venison haggis with neeps and tatties (pureed turnips and potatoes), cause you gotta try it if you're a tourist in Scotland! If you like meaty, umami flavours you should definitely order it.   Service was a bit slow even though we were only one of four parties there - it took us forever to get the check and to receive water refills. Still, with such a nice ambiance, why would you want to leave so fast? :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "np9vwOeeKTmCykcDWgQrWA"
  },
  "0xaT4Enq6J2wmHLtu2yNXQ": {
    "date": "1/31/2019",
    "text": "Delicious breakfast in a cute setting with an even cuter staff!  I came here for breakfast and didn't know what to expect. The food was fresh and delicious, smoothies were amazing, and all topped of with a very cute staff (all of them). The eggs Benedict was perfect, the French toast was beautiful and hit that sweet spot perfectly. Fresh juice and smoothies were the perfect accompaniment to the food and overall or entire experience was great! Highly recommended of you like being greeted with gorgeous smiles and served delicious food! (Who doesn't?) Sending the Urban Angels lots of love from San Francisco!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cQy1sShtniGQuIdjqZ29Sg"
  },
  "sNCJhLY_no8e9fxfAb1Ndg": {
    "date": "7/31/2019",
    "text": "The people serving were really friendly but obviously stretched thin and under pressure despite it not being that full. It took a while to get my order, about 20 minutes to receive it and then some of it was missing and nobody was to be found for a while to rectify it. I had to ask twice for milk for my black coffee- this should really be given as standard anyway. The acai bowl was good, not great, but the toast was lovely when i finally got it but again, it took 10 minutes after to receive my butter and jam for it so it had gone cold. Prices are good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3GUeDU9t2-tyWQa--4PQfA"
  },
  "VNPEYarr2dQNC3aCvvc9XQ": {
    "date": "10/1/2018",
    "text": "It's amazing how this place has such good ratings. When we arrived at noon, we were told there's a 40 minute wait. We were starving but were determined to try it. After about 30 minutes, we went back and they asked us to wait in the front area. We ordered tea and coffee while browsing the menu. That should've been the first sign because the menu was so limited and basic, nothing caught our eyes. Additionally, my friend's latte came as flat white. ok fine. On our way to the table, we spotted at least 4 completely empty tables. CLEAN. EMPTY. TABLES. Why were we made to wait? We also never received water from them while every table was served. We were ignored for a while because the brilliant waitress who was helping us up front \"thought we ordered\". Yea ok. Food was meh at best. I had the berry waffle and my friend had the avocado toast. I would not recommend Urban Angel because their menu selection is limited, basic, boring and expensive (for what you get).",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IfCgLrjasxmPyRoARBazQQ"
  },
  "bM8DA_exVFcP0STrBZ2X6g": {
    "date": "6/21/2018",
    "text": "Landed in Edinburgh and rolled into town on the local tram.    Googled a place for breakfast and wound up at Urban Angel.  Everyone here is so nice and the food was very good. I ordered Eggs Benedict with smoked salmon and my wife ordered avocado on toast with scrambled eggs.  We cleaned our plates!!  The only reason I didn't give a 5 star rating is because they charge for basic coffee refills.  Hey, I'm American and expect to at least drink a couple of cups of coffee with breakfast and not go broke paying for it. On the flip side, they don't charge extra for the gluten-free option bread.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tYr1wiX1Lahn2GFeQWEQIQ",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tYr1wiX1Lahn2GFeQWEQIQ/o.jpg"
      },
      {
        "img_id": "8T9JUAdubnW5hKVlfa_B5g",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8T9JUAdubnW5hKVlfa_B5g/o.jpg"
      }
    ],
    "user_id": "6LvndQq-Iynt3QTQeaTaQQ"
  },
  "ivdfNc0gmK1TF941G03wUw": {
    "date": "1/4/2019",
    "text": "I was just in town from NYC for Hogmanay and my \"friends in the know\" brought me here for breakfast straight from the airport. I ordered the avocado toast which was so delicious, and SO huge, that I could only eat half of it. I also ordered a side of bacon, which filled an entire plate, but definitely wasn't as cooked as I would have liked. Still, the avocado toast was enough to have us come back again two days later, where I also ordered THE BEST SMOOTHIE I HAVE EVER HAD IN MY ENTIRE LIFE!!! It was the turmeric smoothie with almond milk, almond butter, turmeric, salt, dates, and vanilla.... and let me tell you, I will be trying my damnedest to recreate that recipe until my next trip back! Unless of course, a kind employee takes pity on me and sends it over (hint, hint).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "6eipwrk2ZjOdvuD6GI-TTw"
  },
  "_5-Ye4qg12YLJtpNUVk7dw": {
    "date": "6/26/2018",
    "text": "I found it a bit hard to find wholesome, tasty food while simply walking around the touristy part of Edinburgh, so I'm glad I stumbled upon this place for breakfast! Plus, it's quite instagrammable if I do say so myself :~) The service was a bit slow (25 min for table, 20 min for main dishes, 10 min for bill) so I'd suggest making a reservation if you can. Staff was kind and handled the rush pretty well!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VwqeaAMdtAeSsw0oR7dWnQ",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom. Almond croissant",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VwqeaAMdtAeSsw0oR7dWnQ/o.jpg"
      },
      {
        "img_id": "pLsFf53jz-OLECqlwX6pMA",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom. Breakfast Smoothie",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pLsFf53jz-OLECqlwX6pMA/o.jpg"
      },
      {
        "img_id": "DN57dA2TfaeJtJ0j6_GC3Q",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom. Maca Smoothie Bowl",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DN57dA2TfaeJtJ0j6_GC3Q/o.jpg"
      }
    ],
    "user_id": "rg5fw1KhOhd8IGb5MidpXA"
  },
  "Ancwavpwl_Tk8Xvk32Fvyw": {
    "date": "11/20/2018",
    "text": "Nice little place with great food and service. Even tasty gluten free options!! Easy to find and easy to get to shopping places.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nLQyKsnbr01nRpMJ88PuIg"
  },
  "uP_0FIia2Mxwn2QwzKzTDQ": {
    "date": "7/8/2018",
    "text": "This place has to have the best French toast in all of Edinburgh. It was crowded, but the staff was friendly and accommodating (but a bit slow). We sat outside and enjoyed a lovely meal of smoothies, coffee, eggs Benedict, and that delicious French toast. I recommend this for brunch/lunch/any meal for anyone looking to get a delicious bite- but be prepared to take your time, this isn't a quick spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WhaUwMoqkOR6Fp0XyBZGcQ"
  },
  "42brBYTsYdFOr--B9z0kuQ": {
    "date": "2/21/2017",
    "text": "Had a really nice brunch here, though service was a little slow. I went with the carrot apple ginger juice and avocado toast with ricotta (I added a poached egg). Everything was fantastic and the ingredients were really fresh. Definitely the place to be, as the wait for a table was pretty long, but they let me sit in the front area right away.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "00k1mh5dOJFPUSrLgFaGqw",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom. Carrot ginger juice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/00k1mh5dOJFPUSrLgFaGqw/o.jpg"
      },
      {
        "img_id": "3CKA1AgA3PGCwQf6kHROsQ",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom. Verrrry photogenic avocado toast",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3CKA1AgA3PGCwQf6kHROsQ/o.jpg"
      }
    ],
    "user_id": "HVQKFDi-vZbawtmLMq3ZOw"
  },
  "mp1NO0iptaneiCleG3qvYA": {
    "date": "7/4/2018",
    "text": "I had just gotten into Edinburgh and found this place after some research on Yelp. A quaint cafe perfect for brunch or lunch is what I found. I went with my boyfriend and his family, the six of us getting different things. I got the avacado toast and the salad of the day - it was so good with nice sized portions. My boyfriend got the poached eggs with Hollindaise sauce adding salmon which was all declious. In short I highly recommend the place and would go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tGmR5PlJbty2_6FRQ9CXHQ"
  },
  "6t1duSHMgq0asmBzBzRIlQ": {
    "date": "10/10/2016",
    "text": "This place changed the way I think about haricot beans. They are so good on toast!   The juice was amazing - elderflower, blueberries, banana and apple.   Highly recommend! Tastefully decorated and warm inside.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P4tSZPeEeDgVWaJH5hwwAA"
  },
  "xKnh3mq7h5uVx-TlpAG5Jg": {
    "date": "12/11/2017",
    "text": "Best breakfast I have had in a long time! Best coffee in UK! Gluten free toast and flat white with oat milk.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "s1H6vA-uiufmNRX56d8HPA",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/s1H6vA-uiufmNRX56d8HPA/o.jpg"
      },
      {
        "img_id": "CLpaMWZcjUAMhF68OUtEPw",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CLpaMWZcjUAMhF68OUtEPw/o.jpg"
      }
    ],
    "user_id": "jMYX-tXjRU7uFphxaGe6gA"
  },
  "uP8Ll7I4u02awfcgYAVw2w": {
    "date": "11/26/2015",
    "text": "I wanted to like the Angel, really I did!  When I arrived there was a sign that said please wait to be seated. So I waited, and waited, and was ignored by no less than 4 members of staff. For almost 10 minutes ( 8 actually). If I hadn't been meting someone I would of left. When I was taken to the table, I pointed out that it was actually for two on the way, at which she changed course - as she hadn't asked how many it was for. The lunch was good, I had eggs benny, they were cooked perfectly on a great hollandaise sauce. Unfortunately things had got off to a very bad start.  Hence 2 stars.  I would be willing to try again in the hope that it was just a one off.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "eBVFtdxqTGdogezZ98HUsQ"
  },
  "jugWaVC0RQiH3-FiuyQNnQ": {
    "date": "7/4/2016",
    "text": "3.5 stars, not 4. Just to be clear :). First impression is nice. The food and the presentation reminds me the Urth cafe in Los Angeles. The ingredients seem fresh and taste well. But somehow they didn't jive together for me. The chorizo was good, a single piece of toast was too little of a portion. But maybe an actual sandwich open would be a better portion. Or it's just the fat yank in me talking.   The ginger Apple carrot juice was nice though. But I did have to order another dish just to feel full and it was quinoa fritters and they came with Harissa sauce and some baby greens and beans. The fritters were nicely browned but the insides weren't seasoned properly. So it was slightly bland unless you used plenty of Harissa sauce.   Overall 3.5 stars!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wAHcujqEWnRucqSkxejQIw",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wAHcujqEWnRucqSkxejQIw/o.jpg"
      },
      {
        "img_id": "4AbNhSoSCH2yyFfbjyyjsg",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4AbNhSoSCH2yyFfbjyyjsg/o.jpg"
      },
      {
        "img_id": "diUn9ZEH4ECLDYSQ_kBEyw",
        "caption": "Photo of Urban Angel - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/diUn9ZEH4ECLDYSQ_kBEyw/o.jpg"
      }
    ],
    "user_id": "m-NJb7g1fdCqtzhvQuN24A"
  },
  "bH-Ja87HeHaN3omDc52zog": {
    "date": "8/29/2016",
    "text": "Everything but the coffee was horrible.  Read this place on Scottish independent coffee guide, naturally, I thought this place must be pretty good.  We went there for a coffee in the afternoon. However, as soon as we walked in, we saw this chaotic where people just started queuing at different places. Some were waiting for a table, others like me were just there to have a coffee. We found 2 chairs by the window and ordered a batch brew coffee, a small piece of cake and smoothie.  The cashier girl had the biggest poker face in the world... come on, it was sunny that day!  Also, I wasn't very happy with their heavy mark up on everything just because they are in a good location.  A small cup of smoothie was close to 5.  Didn't enjoy it there, will not see you again :)",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "aNfG4yqETNKXNQgc2qTToA"
  },
  "vnjPZZmT51Nn369VDTrrLw": {
    "date": "8/22/2015",
    "text": "Checking in reminded me I hadn't actually reviewed Urban Angel and when I was here twice in two days for brunch, I figured it was long overdue.  First time here was with a couple of yelpers who raved about the french toast. As I'm gluten free, I couldn't have this but they do have gluten free options which is fab. Plus, you can get brunch options till 5pm through the week which is awesome :-)  You can get gluten free bread - I usually have this toasted and I also do a 'create your own breakfast' so I have gf toast, bacon, tomatoes and either sausages (gf, yay!) or portobello mushrooms with thyme. I also like their smoothies and fresh juices. The tomatoes are oven roasted so they are lovely and sweet!   I've always found service to be friendly and I've never waited ages on food, though sometimes, there will be a queue for a table as there's no reservations during the week so first come first served.   I love the indoor colours - white and pale grey so lovely, simple and calming. Brought my mum here and she rated this as doing the best poached eggs ever. Cute little table out in the back yard which would be lovely on a sunny day. Has an alcohol licence too.  Brunch - around 12 per person, though depends on what you order (eg around this for my create you own and smoothie) as it will be cheaper if you go for porridge and coffee.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "frthTngbBHgSdk4j85HmEQ"
  }
}