{
  "svZcscBfHsj_zZH-uEs8lQ": {
    "date": "7/29/2010",
    "text": "Zenobia has set itself apart from other takeaways in this area by offering more seating, more variety, healthier food and a family friendly environment.  It's halfway between takeaway and cafe, reminding me more of the latter with its sleek appearance and impressive seating area. They serve up a variety of foods - a lot of which you see in takeaways, yes. But kebabs and pizzas aren't a slapdash effort in Zenobia, with the quality of their kebabs suggesting it was fresher than the likes of stuff that sits under a heatlamp or steeped in grease for hours.  Zenobia marks the beginning of South Bridge, which admittedly is not the kind of area where you'll be seen puttin' on the Ritz. So when I was hungry one lunchtime, I had to step over the sick in the street to get to my food destination - a bit of an appetite killer. Sadly, it's the area that needs cleaned up, but at least it's not an overall reflection on the better, more respectable businesses like Zenobia which reside in it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pY4zGEePueKiCD8lqoyIrQ",
        "caption": "Photo of Zenobia - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pY4zGEePueKiCD8lqoyIrQ/o.jpg"
      }
    ],
    "user_id": "5iRCT4uAsyP1UoEUoxbylA"
  },
  "FKg8xA3M-p5keJenkHw0tQ": {
    "date": "8/27/2019",
    "text": "Not nice food .. Taste not as good as expected.. or I can say is.. taste was too bad.. prices are higher too..",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cJ9F6bn5p4zsZZS8DBHo4A"
  },
  "O-FLkyKAf63N2MLUQ3pKdA": {
    "date": "12/28/2016",
    "text": "High Yield: A falafel and Shawarma place that serves quickly but food is not the freshest or strongest in flavors, but has impeccable service and very reasonable prices.   Details: Food- I have to give them a 2/5  Chicken Shawarma: I've had shawarma before. It comes with veggies and it is a spiced  seasoned chicken kebob chicken dish. The chicken was kinda cold in my opinion. I wished it was hotter, because it just felt it was like some half microwaved kinda dish. It came with carrots and purple cabbage. It was an interesting combination. Not bad but not immediately pleasing to me. It was a 6.75$ dish though so I couldn't complain as I was hungry  Falafel wrap- not a bad dish if you like wraps. I personaly feel it's too wrappy in my opinion. too much wrap and not enough filling. If you like the very bland taste of wrap with slightly bland raw vegetables with fried veggie patties inside,go for it.   Service: Our waitress and the staff were friendly however. Business wasn't very good in terms of sitting down and ordering. Some people came in to order and to go but not many sat down like us to order. Our waitress was very friendly and attentive. So they get a 4/5 for service   Pricing: Good pricing. Everything was less than 8-10 pounds, so you can't beat that kinda deal. 5/5 for that.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qUfRCH5NUyRDsJfM6jA5PQ"
  },
  "_tQRhCPD4ZYODU-Vy5ZkGA": {
    "date": "9/7/2015",
    "text": "Average Kebab place. I got a Chicken Shawarma here and it was OK. The service is quick and it's pretty close to the old city, so it's great to take care of a quick craving and nothing else.  Oh, and they have a pretty good Hummous here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oprY58vreksJSR3uU4KleA"
  },
  "9N49BoAiM8iDl7J1rdSuQw": {
    "date": "8/30/2016",
    "text": "Friendly staff, halal & tasty food, quick service, comfy seats...Bring some cash because this restaurant doesn't accept payment by card",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "H0FuABHC-PselYed7khuag",
        "caption": "Photo of Zenobia - Edinburgh, United Kingdom. Zenobia",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/H0FuABHC-PselYed7khuag/o.jpg"
      },
      {
        "img_id": "nUWiDWN6OjLUaVPSEKhn8Q",
        "caption": "Photo of Zenobia - Edinburgh, United Kingdom. Pizza doner",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nUWiDWN6OjLUaVPSEKhn8Q/o.jpg"
      },
      {
        "img_id": "fYuLEIHozQz7LxuQYsmoLg",
        "caption": "Photo of Zenobia - Edinburgh, United Kingdom. Zenobia",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fYuLEIHozQz7LxuQYsmoLg/o.jpg"
      }
    ],
    "user_id": "iwbMIYxfHV9Gv75-cU1Bkg"
  },
  "LTNScAXhg-RtuXeL8BWrnQ": {
    "date": "6/15/2017",
    "text": "We're from the US and after our vacation in Scotland, we decided that this was the best restaurant we ate in while we were here. We had a shish kebab and a chicken kebab, both were very tasty and the meats were nice and juicy, cooked perfectly. The service was excellent as well.  In general we found the food in Scotland to have less seasoning than we're accustomed to, but this place was very good. We'll definitely eat here again the next time we're in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GEMPjDAcB3YR9_1oEUSNzw"
  },
  "BJuag85tz2n7up3J29c8xA": {
    "date": "8/11/2016",
    "text": "Service was absolutely terrible. The cashier accused my mother of lying about the change even though he was the one who made the mistake. The cashier mistook my mother's 20 pound bill for 10 pounds and when my mother asked for the proper change, he immediately took the offensive and started shouting at her for trying to scam him out of money. I am not sure why but  he grew increasingly louder just to try to get the other customers to think he was right. Eventually he did give us back the proper change without apologizing and even felt the need to taunt us as well. So if you do eat here remember to count your money and watch out for the heavy set cashier with a big belly.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aL2o6HUpIV6EgqkAVuk4EQ"
  },
  "rvA2yf7IDcug5fwIhorJ9g": {
    "date": "7/27/2010",
    "text": "Arguably there are enough Middle-Eastern takeaways on Nicholson Street to feed the entire city.  However, just for good measure Zenobia has set up camp.  It looks a bit more lush than the others from the outside with a stark black and gold sign to attract the customers.  The guys inside are friendly and seem to make everyone feel welcome. The menu has just about everything which you would expect from the place in the way of kebabs, falafels and the classic pizzas.  I went for their doner with salad, mayonnaise and chips.  The meat was fairly greasy and I've certainly tasted better in the area, but the salad was fresh and the chips weren't bad. My mate had a pizza which looked okay, although there seemed to be a bit of grease on the top.  I'd come here again as it actually has quite a nice ambiance, but I'll be expecting a bit more from the food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nEAkxG6Dbe_mJWLJIKkvXg",
        "caption": "Photo of Zenobia - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nEAkxG6Dbe_mJWLJIKkvXg/o.jpg"
      }
    ],
    "user_id": "yfXqZkU5iXE07GSHzdsQBA"
  },
  "r0lJnPQqFj6_Ar0ofobiqg": {
    "date": "7/24/2010",
    "text": "Oh great, just what Edinburgh needs... another humus/falafel/shawarma takeaway place. Not. And just to be a little bit different, they also offer pizzas and kebabs too. Oh no wait...  It's only just opened, so as I was walking past on my way home the other day I thought I'd try it out. It was lunchtime, I knew I had nothing in the fridge and I have to be honest, I do have a cheeky weakness for a humus and falafel wrap.  But I don't really know what to say about this place that hasn't already been said already about every other one of the hundreds of places like this in the city centre. My wrap was nice enough, they have cheap-looking tables and chairs for you to sit at if you want to, all the ingredients were in those metal bowls that they all seem to use and there was one of the revolting \"meat\" things rotating in front of a heatlamp for the doner kebab munchers out there. But not exactly anything that couldn't be said about anyone's local kebab shop anywhere in the UK.  I'm not sure if this will last. Its one saving grace might be the fact that Pizza Paradise a few doors along is so disgusting that people may defect here, rather than enduring Pizza Paradise simply due to the lack of other options. And if that's the case, it can be no bad thing.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lHJlidcU_vCj4q7FqYvNGg",
        "caption": "Photo of Zenobia - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lHJlidcU_vCj4q7FqYvNGg/o.jpg"
      }
    ],
    "user_id": "oEshN5oq98_g23MvEnRc5A"
  },
  "_dquPLm0W_ZAjKvQuaWHnA": {
    "date": "7/24/2010",
    "text": "I have to agree that there appears to be a huge amount of Middle Eastern takeaways on the streets of Edinburgh, which isn't usually a problem for me as I tend to love my kebabs and shawarmas. Zenobia has only recently opened up, and while the food is good enough and it seems quite busy, I son't see the affection that the locals have for Palmyra a few minutes down the road being replicated here.  Shouldn't detract from the standard of the doner though, which as expected, is a far more tasty affair than you'll find at some of the city's scruffier late-night eating venues.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xXQTdJXPGOP-NUYctcQw8g"
  },
  "6EhwcNbp7FG-ELRTmJZV4A": {
    "date": "10/3/2012",
    "text": "It's plain, but it's good - tasty felafel wraps, mint tea, friendly waitress. It's not somewhere to hang about, but it filled us up with tasty, healthy food before we headed to the pub.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g74l-c4UXDKTwHuScrO3sg"
  },
  "Ran9tnIi7WK4zJvk1bLgeA": {
    "date": "3/25/2011",
    "text": "Well what to say about Zenobia....  I used to be a big fan. I would have recommended them to anybody. Then I went in on a Friday night (Saturday morning) at 2:45 am after wrapping up a nice night of clubbing.   I don't expect pristine service at 2:45 am, but nobody in my group of 4 was either belligerent or rude. We were very friendly and happy to be in Zenobia. One member of my party actually ordered 2 kebabs, for himself and his girlfriend at home. So 4 of us purchased 5 kebabs. The man was friendly when selling to us, then when we finished our purchases, I asked for the toilet, and he said they had no toilet...... odd.  Then, at 2:50, he said, \"in 10 minutes, we close\" ... at 2:55 (because I check my watch constantly, I knew precisely the time he gave us) he kicked us out. He was very rude, and there were about 7 other diners with us....all given the boot.   I understand kicking out the drunks at closing time, but I was with a group of three, along with a group of 5, and we were all given the boot 5 minutes before closing.   I appreciate Zenobia's five  mixed kebabs, which are not cheap, but I protest the horrendous service! I was regular customer, but now I will definitely be going elsewhere for my kebab needs!  As to the \"healthy\" food mentioend by Marj C on 19/7/2010: I was never asked what sauce or sides I would like with my kebab. I do not want sauce, and was never given the option.... Omitting sauce by default is not the same as offering \"healthy\" options, but rather it is simply omitting the OPTION of health.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sKpXijbd_UpoDzVi30UlAA"
  },
  "Rf6NFqXBAniLLNPxhhdpsQ": {
    "date": "7/25/2010",
    "text": "This is another average Kebab joint. It seems to be making a bit of an effort to shake off the grease laden scummy image that many Kebabbies have but that is a tough task. There is a seating area that wouldn't be out of place in a standard Maccy D's and that seems to be the type of client they appeal to.   The food is pretty average. It is not smeared in grease and could possibly be actual meat instead of squished plastic but to be honest it is pretty bland and unadventurous. I know most people aren't looking for an adventure when they go for a kebab but something different would have been nice. Ironically, by cleaning up the image of a skanky kebab shop, they have also lost a bit of the character. Go here if the only other place open is the godawful Pizza Paradise down the road, though you'd probably have more fun there",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ga9DnmdmhE0Zzs_jRtmrfA"
  },
  "QsFhSF3cUlVd4a4kj4fJDQ": {
    "date": "12/7/2011",
    "text": "This is one of my go-to lunch places whenever I'm up on that side of town. Of course the falafel wrap is a favourite, but if you get a chance to try the one with the grilled vegetables. Fast service, fresh food, and plenty of tables to sit and watch the world go by: what more could one want from a quick and sleazy shwarma experience?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oMyqf4PtBmsBK-tEeXopmg"
  }
}