{
  "aA3sYGGgTT-r4I89ky-5qg": {
    "date": "5/14/2019",
    "text": "This place is pure heaven. The bartender/server was fabulous--attentive, friendly, much too smart to merely bartend (maybe he owns it, or will some day? Lol) and the food was divine. Beautiful to behold and delicious on the tongue. Loved the Cullen Skink and herb couscous salad and the sticky toffee pudding was lovely enough to shed tears over. The place is beautiful (we had a window seat) and where the locals meet, which is always a good sign and certainly was today. The prices were the best we've experienced pub wise thus far and the food was more delicious than many of those. All in all a treat we recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8UgMUgkhCh3HwB0x7YgxqQ"
  },
  "jDU9NVTlt5LeeCaIdNtYPw": {
    "date": "6/5/2018",
    "text": "Ok, here is a real gem. Super friendly staff, superb food. Great selection of coffee, tea, beer and spirits at a nice price. I travel a lot internationally from the US and this pub stands out in my opinion. The pub itself is so warm and friendly, nice window light, wifi, comfortable... a place you'd like to hang out for awhile. The food, is really good. My wife loved the salads, the desserts and the eggplant. I had the fish and chips and they were excellent.  Cant ask for much more. But again, the food selection and quality was exceptional.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZdNFnb44pkjKXdRNZ4Cvlw"
  },
  "QcKC4SHW-al6IHKW3CY48g": {
    "date": "10/4/2017",
    "text": "Quite simply, a great local restaurant. Service, food, atmosphere, location. Came in under $50 cdn hard to find the same in good ol Alberta",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9cRTmnPOktQUoR4hQ34mcg",
        "caption": "Photo of No1 Grange Road - Edinburgh, United Kingdom. Scottish fish and chips - wonderful choice also. Hand cut fries are worth the price alone.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9cRTmnPOktQUoR4hQ34mcg/o.jpg"
      }
    ],
    "user_id": "rR6sKw5YmNXwYoDQcykGwA"
  },
  "U26BDi76f153iQqCAdnSVg": {
    "date": "4/14/2017",
    "text": "Came here on the recommendation of a local.  Great pub with excellent non-pub AKA gourmet food.  Tried the smoked fish chowder and mushroom and cheese toast as starters.  Then I had the giant herb salad with couscous and my partner had the Hake.  Excellent place!  Under new ownership as of November 2016.  Definitely recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "n0YyV8UI6j-MCT8z926xbg",
        "caption": "Photo of No1 Grange Road - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/n0YyV8UI6j-MCT8z926xbg/o.jpg"
      },
      {
        "img_id": "9hJOOYUrwKxbJwYAzdtYng",
        "caption": "Photo of No1 Grange Road - Edinburgh, United Kingdom. Mushroom and cheese on toast.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9hJOOYUrwKxbJwYAzdtYng/o.jpg"
      },
      {
        "img_id": "Qfsyxhi7xMBFC2KwA6F9hg",
        "caption": "Photo of No1 Grange Road - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Qfsyxhi7xMBFC2KwA6F9hg/o.jpg"
      }
    ],
    "user_id": "vEzBCT1QGYv2K1_XDQfzow"
  },
  "C0rPvFuVWjMuwY40Ru2lfA": {
    "date": "9/10/2017",
    "text": "Great Food, Great Ambience, Great Beer and drinks selection. What more do you need to know!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eBVFtdxqTGdogezZ98HUsQ"
  },
  "ccbHq8zvMbfjsjL9eiw5ZA": {
    "date": "8/27/2018",
    "text": "Amazing modern Scottish food! Great service, cool atmosphere. Cullen skink was outstanding.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nnWropepAYhlRr-5AYbCyw"
  },
  "uE0k6G71A6xHJ4hTwB54Sw": {
    "date": "8/3/2017",
    "text": "I was recommended The Grange by a colleague and have become something of a semi regular.  It is a nice place to drop into for a post work drink or for a relaxing meal.  There is a regularly changing selection of guest beers which means there is always something new to try.  The food is not traditional pub fayre, it is more restaurant quality.  It is always well presented and very tasty.  They also offer specials for when you have exhausted the regular menu!  The staff are friendly and helpful, although service can occasionally be a little slow.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E2MHLiystbgwMuWUpeLvmg"
  },
  "x9G8BoH6xK2PAKzqs-fWDg": {
    "date": "2/9/2015",
    "text": "Seen this place go through name changes and ownerships over the years. I never really loved it as a place to hang out when it was an old mans pub, then when it was given a refurbishment to become Beirex I think I liked it less. Now I don't know what it is trying to be. The food is expensive as is the beer and neither are particularly special.  I don't have call to be here often and there are much better pubs within walking distance.  Minus - expensive food and drink that isn't that great - weird use of space  - some of staff seem bored and unfriendly  Positive - isn't terrible just a little generic, like a privately owned chain pub....  - some of the staff are great",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PQq5JGWvr0u_IKDXZyDAgA"
  },
  "kcrsvS9ClJYLXv7W8ErnCg": {
    "date": "6/5/2013",
    "text": "Formerly Bierex, Number 1 Grange Road hasn't changed much since the refurbishment, essentially a paint job and a name change with a few minor changes to the menu.   This is a local bar to me though it's usually to eat that I go there. It's good pub grub with a few twists on the menu, particularly the choice of nachos options, there's classics with just salsa,guacamole and sour cream, chilli nachos adds beef chilli, chicken nachos adds chicken and fried peppers, then there's haggis or veggie haggis nachos, both with whiskey sauce and steak strips too in the case of the standard haggis.   Also of note is the Sunday breakfast special, two full Scottish breakfasts for a tenner, so find a friend and it's only a fiver each or wait till you're ravenous and go and have two (the offer is on till 2pm on Sundays). I'm not sure how long it'll run for though as it's become quite popular.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "5ioyqT-rb2ppl7IVuKwovg"
  },
  "O9FbFGvUypNmRaCYJMJxDw": {
    "date": "1/6/2014",
    "text": "Nice tartan-based interior design in here now. Not a pub I've managed to visit in any of its previous incarnations but the pints of Trade Winds we had were well kept and the general atmosphere was only let down by them playing one of those cover version cds (like they do in B&Q), rather than the real thing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "txzOZrHK9EVY0kYjSuXkKg"
  },
  "CFQ624Hzfgsl3vcRaDyylA": {
    "date": "5/29/2013",
    "text": "Family friendly fun  This is possibly one of the most PG rated pubs in Newington. Recently refurbed, they have gone for a really Scottish vibe, it's quite cosy without being quaint. The girls behind the bar were very friendly, happy to chat, which was welcoming as we were already half a dozen beers down the road. The rest of the clientele weren't as inebriated - but I was cool with that.  Drinking with a childhood friend and his fiance (wasn't at the time but is now, congrats) from Aberdeen we had settled into a noisy banter routine, and our efforts to get others involved didn't go down too well. All the other punters seemed like couples, and they chortled every time i shouted something stupid at the football. The guy in the Top Gun T shirt seemed to handle our banter well also!  We had some nachos, which were good, not the best ever, but fine for the price. They had a decent back bar with some nice gins and also one local beer on the hand pump - but I opted for Guinness....  Go here for a relaxing bite to eat or some non male dominated sports viewing... though there are better options in the area",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lOZKlSyQa-jSv4HZ66okGg"
  },
  "VxlZ8LjZvhIJJ0W5k3q9cA": {
    "date": "9/24/2012",
    "text": "I've been in here many a time because of its handy location and decent lunch deal. Soup and a giant sandwich for a fiver gets my vote.   This place is never going to blow you away, but it's warm, friendly and the food always arrives in good time. It's never spectacular, and I wouldn't come here for a dinner or proper meal but for a warm, filling lunch I have always been happy. I also wonder if the chef might be a smoker, because the grub sometimes leans towards the salty side...  Still, a pleasant wee place that is unlikely to offend any of your senses. Pop in if you need a quick lunch or want a pit stop for some chat.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fcMTpwfLS9F5DWTqlp8ktQ"
  }
}