{
  "zlFblg1QYDyZckU44zLz-A": {
    "date": "1/4/2015",
    "text": "Butternut squash veloute amuse bouche. Smoky and good  Duck slices rare-ish but not too w slaw.  And caramel onions  Smoked salmon and smoked trout pate  Main Mushroom risotto--firm  and good mushroom flavor  Bouillabaisse --but very good quality fish --not tons of quantity--all cooked just right   Dessert   Cheese plate --interesting local cheeses  Chocolate --pudding, cake and ice cream--loved it.  Very small place maybe 20 people max--down into a basement in Stockbridge.  Nice being at a family run non corporate place.  We were the only non locals or at least non Scots.  Worth seeking out.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jolimJOJh9ElUbI4oj0AEw"
  },
  "iPD86v-HPXCQ23Dm2ONdBw": {
    "date": "8/10/2013",
    "text": "But, soft! What light through yonder window breaks, it is the east and Purslane is my sun!   It was a beautiful sunny lunchtime when we came in here for lunch, and the sun carried on shining on my tastebuds as we had the two course lunch for 12 pounds. What great value for such great food!  We were made to feel very welcome, and the casual fine dining experience to me is all about relaxed good service with excellent quality food. The service was brilliant and it was clear everyone here is passionate about good food and making every trip here special.  I started with the smoked salmon blinis which was fresh, rich and beautifully presented. The pan fried hake was delicious and has to be up there as one of the best fish dishes I've had. I really did spend the whole afternoon afterwards finding myself just going 'hmmmmm' at the memory of it.  Unfortunately we were under a bit of time pressure, so I'm already planning a return visit with some more time to enjoy a leisurely lunch or dinner at what is now my top picks  Edinburgh restaurant.  And the best thing? You get a QR code on a card with your bill that allows you to go and buy Paul and other excellent Edinburgh chefs recipes, so you can recreate the fine dining experience at home with friends and family. What a fantastic idea! I've already cooked the roast rump of lamb with a herb crust for some friends.   But it won't be stopping me coming back for the real experience of being so wrapped in the sunshine of service and taste that is Purslane.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "VUK5MouXYXAT7yhBN-sHLg",
        "caption": "Photo of Purslane - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VUK5MouXYXAT7yhBN-sHLg/o.jpg"
      },
      {
        "img_id": "_5XBJM31-UZVW2vFeX8Rww",
        "caption": "Photo of Purslane - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_5XBJM31-UZVW2vFeX8Rww/o.jpg"
      },
      {
        "img_id": "uhdSJj04nSAD3w2IUwIO1Q",
        "caption": "Photo of Purslane - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uhdSJj04nSAD3w2IUwIO1Q/o.jpg"
      }
    ],
    "user_id": "5MNWgTvvhAaQcnbVql-d_w"
  },
  "3mUY6b581JkuTCQDtQtgHA": {
    "date": "6/16/2013",
    "text": "Went there for their 7 course tasting menu on Friday. One look at the menu and I almost wanted to do a Bridget Jones dance around the restaurant. Knowing full well that my dinner partner would be more than slightly embarrassed with that uncouth and outwardly show of excitement, I sat back and enjoyed the glass of Prosecco and 'acted' sophisticated. The only tell tale sign was probably the gleam in my eyes and my lack of focus on the topic of conversation that my dinner companion had embarked upon. Wine.   I know I am in trouble when I can't focus on a topic such as wine.   He picked the Pinot Grigio Rose, Bella Modella, Italy, 2011 for our meal.   Our servers hit the exact note of polite, friendly and chatty which was perfect for the small, rustic but cosy restaurant decked in charming earthy tones.   The amuse bouche was a Butternut Squash veloute which was sweet and creamy and the perfect accompaniment for the slice of freshly bakes cumin bread I had picked.  We then had the Sole and Salmon Roulade with Sauce Vierge which was a thing of beauty. Delicate with every little element complimenting the fresh fish. I could happily have eaten 10 of those and still want more.   We were then presented with an Crispy chicken and Asian noodle salad.  Chicken that is moist and tender on the inside with a crisp and moreish crumbed exterior served with a refreshing salad with crisp bean-sprouts and broccoli and an Asian dressing.   We then had the pan fried Hake with the Vegetable Fricasse. Crispy skin, flaky fish sitting on a bed of vegetables expertly prepared and a light creamy sauce. I was almost temped to ask for a bit of bread to mop the sauce up with. I didn't since we had 4 more courses to go.  For our main we were presented with a Roast Loin of Pork with Confit Potatoes, Stornaway Black Pudding, Pork Belly and an Apple Sauce. The Pork was deliciously tender, the plate so skilfully put together that I almost didn't want to dive in. My dinner companion pretty much inhaled his in 2 mouthfuls.   We then had a refreshing Raspberry sorbet pre-dessert and I can safely say that I would've happily had my tasting menu end there. I was comfortably full and didn't think I could manage another bite.   Well that was before our Dark Chocolate Marquis with Ice Cream was placed on the table. The decadent chocolate dessert sat there and stared me in the eye. The dark gleaming square beckoned me to try it, just one spoonful it seemed to be saying. Try I did. And finished it too and what a perfect finish it was to the meal.   You know those moments when you taste something and you can almost hear an emotional celebratory tune in your head... imagine confetti falling from the ceiling with loud explosions of glitter filling the room....???  Yeah.... My dining experience at Purslane was one of those.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "cMhdgToS7d59AqxwDRMaRw",
        "caption": "Photo of Purslane - Edinburgh, United Kingdom. Roast loin of pork, Confit Potatoes, Stornoway Black Pudding and Apple Sauce",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cMhdgToS7d59AqxwDRMaRw/o.jpg"
      },
      {
        "img_id": "r_1a-N7q0Cw0P8CsdLug-g",
        "caption": "Photo of Purslane - Edinburgh, United Kingdom. Pan fried Hake with a Vegetable Fricassee",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/r_1a-N7q0Cw0P8CsdLug-g/o.jpg"
      },
      {
        "img_id": "9FsIvqedYT9bWREuQD2IRA",
        "caption": "Photo of Purslane - Edinburgh, United Kingdom. The Sole and Salmon Roulade with Sauce Vierge",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9FsIvqedYT9bWREuQD2IRA/o.jpg"
      }
    ],
    "user_id": "M9X9HpdWPGermFQLYiPCJw"
  },
  "SM3u5Z3C8-Ucgoxn0ZpnrA": {
    "date": "6/5/2013",
    "text": "I OFTEN WALK passed restaurants just to have a gander at the menu; call it a food geeky hobby of mine.  As it happens, Purslane is just around the corner from my work and has caught my eye all too often without action.  Time to pay a visit!  Located on St. Stephen Street, Purslane proudly sources around 80% of its produce from the surrounding Stockbridge area.  Not only does this bring a community feel to the restaurant but also allows the excellent produce from the likes of George Bower the butcher, George Armstrong the fishmonger and I.J Mellis to feature on its menu.   The restaurant is small, there's no beating around the bush about that, but it's small with a certain charm and romance to it and is tastefully decorated too.  Our server was very relaxed and chatty and as we placed our order, it was obvious he really enjoyed his job.  We were presented with an amuse bouche of crispy chicken and Asian noodle salad.  The aroma of roast chicken invited you to dive straight in, where you were greeted by this excellent nugget of chicken and accompanying salad that was fresh and crunchy and had a pleasant hint of aniseed to it.  For starter, I went for sole and salmon roulade with sauce vierge.  The smell suggested the fish was as fresh as a daisy.  Expertly seasoned, the roulade was moist and tasted of the sea.  The sauce vierge was well-made and added to what was overall a great modern version of classic flavour combinations.  Sarah chose pigeon pithivier with wild mushrooms and Madeira jus. The pastry was properly cooked and satisfied my Paul Hollywood-esque inspection - no soggy bottoms here.   She found some of the pigeon a little chewy, although the piece I tasted was fine and the flavour was there.  The mushrooms were wonderful and woody and the jus, ahh that jus was simply sublime.   The intermediate course consisted of pan fried hake with a fricassee of vegetables, which being honest I wouldn't have expected to be included in a meal priced at 25.95. Not that I was complaining, as this was a sheer joy to eat.  The fish skin was crisp and the meaty flesh was perfectly cooked. The attention to detail evident in the shelled peas and podded broad beans and a wonderfully light and creamy sauce made it as if the dish saying 'you didn't order me in the first instance and this is what you're missing'.  For main, I had roast breast of guinea fowl with confit potato, watercress and jus gras.  There's several different skills demonstrated in this dish; not just the cooking of the breast but a nifty ballotine and a neatly butchered leg were all top notch. The tasty jus gras sees the whole bird being used to its full potential; I only wish there was more of it on the plate.  I have to say I thought the watercress made this dish.  The pepperiness just gave it a hint of spice and a bit of texture. The use of an ingredient bang in season tells you a lot about the ethos of the restaurant.  Sarah had grilled red mullet with herb crusted boulangere potatoes and roasted red pepper salsa. Faultless execution and seasoning of the fish, which was complimented by the zingy salsa. However, Sarah felt the potatoes could have been crispier and more golden.  The raspberry sorbet was a welcome palette cleanser as I chose to finish with apple and butterscotch creme brulee while Sarah ordered the assiette of pear.  This was no standard brulee let me tell you.  Lifting the apple crisp to find the centre had been cut out to house the butterscotch sauce was rather quirky, while the outside offered the crisp exterior you would expect from a classic version of the dish.  The popcorn was a fun addition but it was sadly a little on the limp side.  The presentation of the pear dish was clean and modern and the tastes from the sorbet, cannelloni and poached pear were refreshing, light, and a thoroughly pleasant way to end any meal.  Paul Gunning has honed his trade under chefs like Marco Pierre White, Jeff Bland and Jean Michel Gauffre and that shows.  His presentation of food is outstanding and no detail goes unmissed. This is a chef who has learned his craft and is now intent on putting his own stamp on the Edinburgh food landscape.  At 25.95, I can't think of anywhere that offers better value for the standard of food on offer and it really is fine dining without any hint of pretention.  It's made me question how good places where I've paid considerably more actually are and I can't give a much bigger compliment than that.   This gem of a restaurant and one really needs to be experienced first- hand.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "lh1QIr8Bp8WOI1ws1tPZWA"
  },
  "sRFkHW3lbwjL_KyWgwNIxg": {
    "date": "7/22/2013",
    "text": "Anita A. and I went to Purslane for their 7 course tasting menu @50 pp - as we had a voucher it was half price and a good reason enough to indulge for a date night.   I'll have to mention that the place is small and the tables are just a little too close to each other. However the music is not too loud, so when speaking it doesn't travel to another table - too much.  Anita booked the table a couple of days before and advised the restaurant that I had a fish allergy, which she was assured would be no problem on the night. On arrival we were warmly greeted and seated. Directly we were explained what the fish alternatives were for those 2 dishes that contained it. I was supplied lamb and (I think) a ham alternative.   The courses supplied where on queue and though looked tiny (for you multi tasting diner virgins : it is supposed to be that way) as these were plentiful it did filled you up. We decided on a light red wine to accompany the dishes and settled on a sangiovese.   The courses have been described in full, but I will post a picture of this as I cannot really remember what in which order.  In other reviews they have described most of what we had in detail (thanks Nishitaa R.)  and I can assure you that they were indeed very good - only one we didn't particular enjoyed was the pork dish. A little too dry, chewy and the green peas a little too crunchy. And Everything else was well attended and presented.   It was a pleasure to have good service, efficient, genuinely interested in how you liked it and how your are feeling. They left enough time between courses and provided and placed clean cutlery for every course presented. (is that important? -  Yes! As after other restaurant experiences - this doesn't happen that often these days!)   There is a cosy sofa outside to cool down and tho have some fresh air. I would not smoke there as it will go in to the restaurant.  In fact for smoking I advise you go up the stairs - away from the entrance & window.   We really enjoyed this visit and were actually well fed",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "fKi8ZF3xpJJkgSusRubeMA"
  },
  "KgTcqME2wRGbXpMQDwBjbg": {
    "date": "2/1/2012",
    "text": "A recent addition to the Stockbridge restaurant directory, the Purslane promises \"casual fine dining\" in relaxed surroundings. One of those places you might not spot until you're really looking for it, it served us really good dishes, and is just the kind of place we could see ourselves revisiting on many occasions.  Overall, we said: \"this is a charming place. I now understand the phrase 'casual fine dining' and for the money, I'd say you'd be hard pressed to mix quality and quantity as well.\"",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "LURC3E0DoXYgN9aYTF3XOg"
  },
  "MA-RCwwBxRoJvgegtEIqMA": {
    "date": "1/12/2013",
    "text": "I have been to Purslane at least three times. On two occasions I was entertaining business partners. Choosing from the three course menu was always a challenge, as all of the dishes sound very appealing. The food is excellent: delicious, generous portions and superb presentation. The wine list is good and prices are VERY reasonable for Stockbridge. The place is nice and service is very friendly. In summary, two thumbs up and five stars for this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9xmP0uJqIayMVzT03r6APg"
  }
}