{
  "TfLX3djK-AXTy-XB5t4OBw": {
    "date": "5/17/2010",
    "text": "Martone's modest decor doesn't give away any secrets about how good the food is. Which is great because, like the other girls who have been here, I believe there's nothing worse than a trendy eating place. I hate ostentiatious, showy restaurants whose managers would prefer to cultivate an image, when they should be concentrating on the food!  So yes, the food in here is mervellous. Big plates of pasta served up in rich, tasty sauces and more traditionally Italian than some other chains in Edinburgh. They've got a decent selection of booze but it's also handy to come in here for a lip lickingly good coffee, especially since most of the coffee chains on Princes St shut at pitiful times in the early evening!  The staff in here are friendly and welcoming, the menu is substantial and good; the food in here is served up in plentiful portions. My mum always says that Italians really care that you get a good feed and although that's a stereotype, I must admit I felt looked after the few times I've been in Martone's. You can always tell a good restaurant by how attentive the staff are, and how they go out of their way to make sure that you enjoy your meal. It's a good indication that the food will be great, and it is in Martone's. A place to bring the family for a big birthday meal, but also a place to come for a wee glass of wine and some penne pasta.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9WF9alwPptcSZj1VJ4yWUQ",
        "caption": "Photo of Martone - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9WF9alwPptcSZj1VJ4yWUQ/o.jpg"
      },
      {
        "img_id": "bBnHIoM_uGS3gzED4m5X1g",
        "caption": "Photo of Martone - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bBnHIoM_uGS3gzED4m5X1g/o.jpg"
      }
    ],
    "user_id": "5iRCT4uAsyP1UoEUoxbylA"
  },
  "vZAUGSBU3iRH2FdbUshBmQ": {
    "date": "4/1/2010",
    "text": "Martone is a centrally located Italian restaurant/cafe. My boyfriend and I usually end up in here when we're waiting for a bus or train, as it's very handy for both Waverley station and St Andrew's Square.  The food is standard Italian fayre - pizzas, pastas and paninis. It's not a particularly adventurous menu, but they know how to do the classics well. The pizzas have lovely thin crisp bases and are very reasonably priced at around 7. Being Italian, they take their coffee seriously and you can be guaranteed a decent espresso here. The homemade ice cream is worth getting excited about, it comes in a variety of flavours (including prosecco and pannacotta) and is served in tall glasses with long spoons.   Service is quick and efficient, which is very important when you've got a train to catch. There's also a student discount. If you're looking for a quick bite to eat when you're in the middle of town, this is a great place to go.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Y22Aalo9obTkqW1IYmIMzQ",
        "caption": "Photo of Martone - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Y22Aalo9obTkqW1IYmIMzQ/o.jpg"
      }
    ],
    "user_id": "mJJj_SZff6MEWG5Vx1r8Bg"
  },
  "ulE8lui4KkTPpKvu5LOoZQ": {
    "date": "8/12/2011",
    "text": "We came here for dinner.  I had a pizza and my husband had pasta.  The pasta portion was too small for him, but the pizza was big enough for me.  The prices are pretty affordable considering its downtown but the food was just ok.    Service was polite and prompt.  They gave us free tap water when we asked and came around several times to check on us.  The ambiance had a very busy feel that I feel suits a lunch place better.  I would come back for lunch, but probably go somewhere else for an italian dinner.   What I would come back for in the evening is the desserts!  The have a coffee bar with gelato and all manner of delicious baked goods.  My recommendation is go for an italian dinner somewhere else and hit up Martone's for dessert!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cmsTop-ECJhX6mQd90_8kQ"
  },
  "FfEwUsans3Sl0w5uSQcPaQ": {
    "date": "9/3/2011",
    "text": "Really convenient to our hotel (Apex). I got the lasagna which was so overcooked in the middle that I couldn't cut it with a knife (not good when you're eating lasagna). It was good though. I think it was probably microwaved too many times. I was so hungry that I didn't complain. I practically hurt my fingers trying to cut the center portion of the lasagna though.   The service was pretty so-so.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KOo-Zf1zB693nkG-4441_Q"
  },
  "zLWU18uzMKP18QAuZKciiA": {
    "date": "8/1/2011",
    "text": "Martone was our first cafe stop in Edinburgh, after climbing all over Calton Hill. It was just the place for morning tea for this tired family with girls weary from climbing and hankering for a hot chocolate. I loved my 'Scottish breakfast tea' and scone, and the croissants were great. The service was prompt and friendly. Recommended!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZDz_MJpAKSEdbGlDXKXSKw",
        "caption": "Photo of Martone - Edinburgh, United Kingdom. Tea and chocolate croissant.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZDz_MJpAKSEdbGlDXKXSKw/o.jpg"
      }
    ],
    "user_id": "NhgEJR8PCp6hIJKmxQboCQ"
  },
  "90xPasaZrls7qDXtgiC1RA": {
    "date": "10/1/2010",
    "text": "A long few days of traveling brought me from the USA here for work. Needed something quick so I wouldn't fall asleep at the table.  My pasta carbonara rocked!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "B-s-8VUnuBjGTP3d01jsyw"
  },
  "CDeBjt6UeYW0DbYQPk8VRQ": {
    "date": "5/18/2010",
    "text": "Straddling the fine line between cafe and restaurant, I was quick to dismiss Martone as quite frankly, it looked like it was probably shit. Yet given that I only had 15 minutes left to get back to work and I desperately need an ice cream, I gave them a try. I made the right choice.  Admittedly I did find the atmosphere a bit too close to dentist's waiting room, but I'm not sure if that was down to the place or the two tables of diners eating in utter silence, but this all became insignificant as I scoffed down my ice cream. It was fantastic, exceptionally rich and creamy, and a huge step up from the dross you'll find standing in for ice cream in some of the city's more touristy dumps. Some of that cheap shite would go uneaten at a 3 year old's birthday party birthday party.  Given I'm mainly down this end of town only on my lunch break and it looks someplace just that bit too awkward to sit alone, god knows when I'll try the proper food, but I'll look forward to it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "xXQTdJXPGOP-NUYctcQw8g"
  },
  "JXwFUg4TLyP4hS2LxJ92xg": {
    "date": "5/17/2010",
    "text": "This wee Italian cafe is just the ticket for a quick bite before catching the train home, or a hot coffee on a rainy afternoon.  I love places like this because they always feel so much more authentic than big, showy restaurants and bistros. This place is nice, simple and serves delicious food for not a lot of pennies. It kind of reminds me of Dinos in Glasgow which is one of my favourite places to eat.  They do a cracking coffee which I had the pleasure of sampling. I had an amaretto layered liquer coffee which was absolutely gorgeous. The tables around me were all tucking into big bowls of olives, breads and hummus which looked yummy, and pizza which was very authentic Italian thin crust. We had eaten earlier but I was definitely tempted!  I noticed on the way out that they had glass fronted freezers with Italian ice creams, including a Gin and Tonic sorbet! Safe to say, I'll be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "p-DUu7rHFh_3odlQFUJctQ",
        "caption": "Photo of Martone - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/p-DUu7rHFh_3odlQFUJctQ/o.jpg"
      }
    ],
    "user_id": "Cy1PV2TdYeDFA16mUOlr3Q"
  },
  "57tmNVkPykPpHt1iFLB1fg": {
    "date": "10/30/2011",
    "text": "Ducked in here to get out of the rain and grab a lunch. Not much to look at but the wait staff were friendly. Food was acceptable, cafe style Italian. The table next to us just ordered deserts, and they seemed happy with what they got. Place feels like a soda shop with food, but I'd rate it higher than that. Again, I'd not choose to come back, but quite serviceable if you happen to need to duck in out of the rain.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uXBqvK4-qcQTjHGv7NETGw"
  },
  "3RgvKZr5nt7oYZ-_QgFlIg": {
    "date": "8/18/2019",
    "text": "Very nice cafe/restaurant/dessert place. I had a scoop of dutch chocolate and one of Madagascar vanilla ice cream. Very good and not a pinch left over. My partner had a brownie like dessert with a scoop of vanilla ice cream and extremely good.  Lots of seating and a nice place to go in the afternoon for a tasty dessert!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HYJUTUxMzyLyniE5tFoE-g"
  },
  "zbzJrduZBNSYkBZBbM9bXQ": {
    "date": "3/6/2019",
    "text": "Mmm mmm mmm! Delicious! Lasagna done right! Layers and the perfect amount of meat and cheese.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "22ZQuvSn0Cy2mCavRL6kuA"
  },
  "CqcdDYSM1VqaqM0mPocJmA": {
    "date": "10/28/2018",
    "text": "So we came by here after a nice early morning climb up Calton Hill and we were in need of some breakfast. We were seated immediately but I was not impressed by the table we had as it was dirty, appeared not to have been cleaned properly as there were still crumbs on it.  We were given menus but it was a good 20minutes before the waitress came up to serve us and I was pretty frustrated and ready to leave and find something else at that point. Waitress noticed the dirty table and cleaned it as she brought out breakfast stuff out. The breakfast itself, was fine I suppose but service left a lot to be desired.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0suJsRrbbt4onJgUcRJ9Lg"
  },
  "Oj7EITd3DdGVHHTApLYauw": {
    "date": "7/25/2017",
    "text": "I can only speak for dessert...I had an After Eight: Vanilla and mint chocolate chip ice creams with creme de menthe, mint crunch and topped with chocolate sauce and whipped cream. It was awesome. We were there relatively late (10ish) and the place was hopping...no wonder with desserts like this!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8nqp5WKJ0tZ6Hs1Sfbj3-g",
        "caption": "Photo of Martone - Edinburgh, United Kingdom. After Eight: Vanilla &amp;amp; mint chocolate chip ice creams with crème de menthe, mint crunch, chocolate sauce and whipped cream.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8nqp5WKJ0tZ6Hs1Sfbj3-g/o.jpg"
      }
    ],
    "user_id": "InInjzaZxzQ8_suxZEAP5g"
  },
  "qon6fJBrSWXAF-zlQbYG9Q": {
    "date": "2/10/2019",
    "text": "One of the neatest places I have eaten at.  The food was very authentic and delicious. Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x8nAHrcdRxZ6HeurENf9Vg"
  },
  "R6k8YxbzBz0SWIshAtGGlQ": {
    "date": "9/19/2018",
    "text": "Due to no southbound trains, we found ourselves staying overnight in Edinburgh. My husband wanted Italian so we checked online and found Martone's. I am so glad we did. Awesome food!! Tables are a little crowded but the food is AWESOME. The service and atmosphere will keep us returning on future visits to Edinburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-R_5EHSUhtSOyZQUF5JJXw"
  },
  "nBODv0uuUd0bGcWGLrBNUQ": {
    "date": "9/29/2016",
    "text": "FOOD// Came during a non-busy time. Food was nice. Portions were a good size, enough to fill you up. Wait time for food was not bad. A lot of people were coming in for just the gelato, I didn't try.  VIBE// Being right next to a hotel and a short distance to Calton Hill, I worried it was going to be very tourist targeted with not so great food. Instead, it did feel very cozy and family-run with good quality food. Very relaxed and casual, especially the staff.  STAFF// Friendly but lazy. Despite it being a non-busy time, it was consistently hard to get any servers' attention.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "e969b2MqLQFiIXlKa04tRw"
  },
  "i-PbVFCgp7L1mD_MClOEIg": {
    "date": "7/7/2015",
    "text": "Randomly came upon this place as we were walking up and down Princes St and ended up returning here twice more (in total, twice for gelato, once for dinner). Their ice cream was DELICIOUS. In particular, I liked that I could have somewhere to sit after getting gelato, as we were exhausted from a day of traveling. Dinner was a great value and extremely filling - I had a burger (a little dry for my taste) and my mom had a hot sandwich. If I could do it all over again, I would have tried a pasta dish, as it is an Italian restaurant.  Service was friendly and though the food took some time to come out, it was a packed restaurant so that seemed understandable.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "rVA85dMsTw7B6v2opDuMuQ"
  },
  "llmBFeAOyKoppAdpb55eNA": {
    "date": "6/10/2015",
    "text": "Stumbled upon this place after a little shopping trip at St James Center and we were pleasantly surprised. The service was lovely and the restaurant had a vey cosy atmosphere.  Took a leap of faith and ordered the Haggis Ravioli (exotic to me at the time) and it was absolutely delicious! The traditional whiskey & cream sauce really tied the dish together too.   The pizza & pasta was amazing as well, but what really blew our minds was the dessert. The Torta di Mele, Panna Cota, and Tiramisu were scrumptious and has completely ruined other desserts for me. I won't rest until I find something that's able to match the superb taste & textures I found at Martone!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "yYsUKu3Q4VcJ4lbhl3YNqQ",
        "caption": "Photo of Martone - Edinburgh, United Kingdom. Tiramisu.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yYsUKu3Q4VcJ4lbhl3YNqQ/o.jpg"
      },
      {
        "img_id": "uBaIHg35Tx_1wCHW-GiBQw",
        "caption": "Photo of Martone - Edinburgh, United Kingdom. Torta di Mele &amp;amp; hazelnut ice-cream.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uBaIHg35Tx_1wCHW-GiBQw/o.jpg"
      },
      {
        "img_id": "WJM61YTlQJPPDj-OoWuSQQ",
        "caption": "Photo of Martone - Edinburgh, United Kingdom. Haggis Ravioli in whiskey cream sauce.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WJM61YTlQJPPDj-OoWuSQQ/o.jpg"
      }
    ],
    "user_id": "XNd_tgHi403e_3eS68Wk5Q"
  },
  "mZLhg7gqF-0QXVwMNMbhHA": {
    "date": "12/2/2015",
    "text": "After the gym I needed a pick me up so I went here for a smoothie. The review is pretty much just for the smoothie since that's the only thing I had, but will certainly come back and try their Italian food next time.   The smoothie was made fresh and was a mix of pineapple, mango and other fruits. It's kind of weird getting a smoothie from an Italian place but it's a cafe as well so I figured it's fine... Ha! The smoothie was tangy, not to sweet and not too thick. Sometimes there's too much pulp or too thick but this was a bit more on the liquidy side. I'd come back here for another smoothie!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "LMkFulPXQHRGMAaJSPUyVg"
  },
  "PUHWmQhx_F8C9qWGGVf4hw": {
    "date": "5/24/2017",
    "text": "Yum, yum, yum only stopped here for dessert but what a stop. Everything was delicious from the latte, tiramisu to the gelato and all with beautiful presentation and friendly service.  They have a wide selection of gelato and sorbet flavors from Oreo to strawberry.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tNuUngvqLIpqhH0WL2uOrw"
  },
  "p_G0mgeeZICHxif5NRrfSg": {
    "date": "7/3/2016",
    "text": "This was a wonderful place.  A little noisy, even upstairs where there were fewer people.  Horrible radio station playing.  But the food was excellent.  Service was excellent.  Many folks brought their children and they seemed quite happy.  I had the spaghetti amatriciana and my wife had the focaccia ham sandwich.  Both were excellent. I had a three course meal for around 17.  Included an appetizer and dessert. The gelato was heavenly.  Would definitely go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aHJp1meTQb1fsTcERqcK3A"
  },
  "doQhPwQlGagAznKbL5HHDQ": {
    "date": "11/6/2014",
    "text": "Nomnomnomnom!  Being in the area for Bonfire Night, my partner and crime and I decided we needed some fuel before heading up Calton Hill to watch the fireworks being set off. We literally walked through three different pubs, two of which were too crowded, one of which just felt \"odd,\" before we happened to pass by Martone and spot some empty seats--surprising considering the amount of foot traffic.  We ordered a veggie pizza with goat's cheese to split between the two of us as well as some coffee, and were not only greeted promptly but also served our food in a very timely fashion (lovely, considering our trek up the hill still to come). The pizza was excellent, the goat cheese was properly smelly, and the coffees were lovely.  Not a bad meal, and a good price too! Next I'll have to return to sample some of the sweet treats.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZslMmrn4z4BMPRRDoaBtgA"
  },
  "o9kuIJv-8hFcsLgF-oqVfA": {
    "date": "5/7/2016",
    "text": "I was surprised by this place on a recent trip to Edinburgh. We stopped in for some Spaghetti Carbonara and ended up getting a delicious meal with mozzarella garlic bread and incredible ice cream sundaes. I had the After Eight and my husband had the Caramel Cup. Huge and also really good quality. I'd definitely recommend! Great value for your money.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-fqpMxpfgk_0w-smV_L2UA"
  },
  "PT3JS3yGcLNslwmBmFqjmg": {
    "date": "11/19/2015",
    "text": "First, the staff here are very friendly and provide good service. I had a light lunch of minestrone soup and a side salad. The soup was good with nice chunks of vegetables. The broth was quite weak to my taste, however. The salad was also just okay. Lettuce was a bit limp. The balsamic vinegar was quite watered down - so much so that I wasn't positive it was balsamic or what it might be. If you are interested in a quick, serviceable but not great lunch with great staff in a homey, casual environment it works. If you are looking for more than that, I think not.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "JO1CC7rtjc0707FOth849g"
  },
  "39ma-pZp9UF2ZZo5GkSm_A": {
    "date": "6/24/2017",
    "text": "I ate here twice. The food and service are great. I had garlic bread, smoked salmon, spaghetti bolognese, and ice cream. All were excellent!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Od-KDFuRGcYUfWY-kgIYqw"
  },
  "M_Tv7_xbqaGdlyz5QQQdAg": {
    "date": "10/26/2014",
    "text": "Oh my sweet goodness, I got served some happy today! After missing the express bus by seconds, I decided to wait for the next one with a quick snack. Martone was right across the street so in I went. The service is terrific, and the staff seem to enjoy themselves which really contributes to the relaxing atmosphere. I'm not exaggerating when I say I had the best damn chocolate cake I've had in a year: a generous slab of soft, fresh, nearly-black cake that was warmed just enough to make the icing ooze and pool onto the dinner plate. It was accompanied by a scoop of their famous ice cream, fresh berries, and an extra drizzle of chocolate sauce... because more chocolate, very yes. When you're sitting in a cafe on a Sunday afternoon, and they're playing hilarious AM radio hits from 1981 and the staff are chatting in Italian with customers and sharing handfuls of fresh mint, while you work your way through a slab of warm chocolate goo on your fork, you're as close to heaven as you can get.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "HJQUikI7arFymAclOEx4Mw"
  },
  "TigRswOGW18hjls72yYhBA": {
    "date": "6/24/2015",
    "text": "Who would have thought that the best Tiramisu I have ever had would be in Edinburgh.  We walked in on our way back to our hotel.  To our surprise we found that the restaurant is owned by Italians.  Pizzas were as good if not better than ones we had in Italy.  Proper cappuccinos and gelatos as well.  Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iassrS6ie0wPed6K2T2GjQ"
  },
  "duiK_iMyJHBecdaPZpqVfw": {
    "date": "12/14/2015",
    "text": "We only had some takeout wraps and grilled sandwiches and ended up tossing out half each. Ice-cream wasn't that good either, my favourite flavour was a disappointment.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tP4HJxKxCp5S9LMAXli7vg"
  },
  "wmbcxMx77zr2XMFNz5bjmw": {
    "date": "6/18/2015",
    "text": "I came because I liked Zendra's review, and I even ordered the haagis ravioli as she did. I agree with her that the food and desserts are exquisite. Highly reccommendable!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YpV0DniZQKnG6mWVVl-TSw"
  }
}