{
  "Ez5MG1pt568OvWDBh7zNgA": {
    "date": "1/8/2014",
    "text": "Wonderful food! Its gourmet to be sure but in a rustic hipster kind of way. The menu changes they said, not sure how often but often enough to say.  My mom and husband got the venison burgers and I got a barely butternut mushroom risotto . We all agreed that the food was delicious. I though by looking at mine that I was going to walk away hungry but man was I wrong , barely is a heavy grain and I was more then full at the end! It made me want to look up recipes for making at home  b/c it was so good.  Prices are normal about 8/9/10 depending on what your getting. Great place, really liked the seating and the decor, as I said like hipster farm, and the service was super friendly! It was almost shocking how friendly everyone was ( for being in Scotland) and they checked on us a few different times which allowed us to order AMAZINGLY RICH soy mocha and hot cocos! SOOOOO Good! So I've decided that if I'm in the area and need a pastry and coffee this is my place, and if I'd like a healthy but delicious lunch this is also my place ;) Cute farm shop that you can wander in while you wait for your food! With lots of yummy samples ;)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "fc0ke5gPk6mI7Me-zfn7KA",
        "caption": "Photo of Earthy Canonmills - Edinburgh, United Kingdom. Mocha",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fc0ke5gPk6mI7Me-zfn7KA/o.jpg"
      },
      {
        "img_id": "aQ2CHcMSwKV0qiw1G4pSYQ",
        "caption": "Photo of Earthy Canonmills - Edinburgh, United Kingdom. Butternut squash barley risotto with mushrooms! Yum",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aQ2CHcMSwKV0qiw1G4pSYQ/o.jpg"
      },
      {
        "img_id": "i6FX9UUvWTf14t5_YwAtLw",
        "caption": "Photo of Earthy Canonmills - Edinburgh, United Kingdom. Venison burger and chips",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/i6FX9UUvWTf14t5_YwAtLw/o.jpg"
      }
    ],
    "user_id": "BpKuNkYgAuisCNZlSzfUAQ"
  },
  "ffkLbbyPpQJG3eJglY0xPA": {
    "date": "3/23/2014",
    "text": "Yeah, rustic hipster. I don't much care what their schtick is. I'd like less attitude with my snacks. Went in for coffee and cakes. The cafe room itself is very warm and welcoming. The coffee making machine had stopped working but we were kept waiting and given various excuses that fell slightly short of an apology. Two cups of tea, 3 small cupcakes and a tepid cup of cocoa later, we were out 14. Meh.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "C2oXAYS4H6uOf7CWLywUYQ"
  },
  "LFWfAP8KjJHvTU4c1rxX6w": {
    "date": "1/30/2013",
    "text": "I am a huge fan of what Earthy stand for, supporting local businesses & bringing us tasty goodies without the food miles!   Positives are the delicious & nutritious selection of goodies ... service with a smile ... and the option to walk the water of Leith before/after!  What I would say is that it is pricey for a cafe, so not somewhere I would drop in to grab a bite to eat ... I would make it worth your visit and take in the atmosphere.  A word of warning, if you go weekdays - there are often a lot of mums & kids... if you are not allergic to children, you'll be fine. ;-)  I'm being a bit tough on Earthy - it's 4-5 star food, but 3 star on price... but I guess you get what you pay for, right?!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GnFsut1uTm5CXxmCLve5gA"
  },
  "fFgHzSacRP1FzHorpxfv6g": {
    "date": "8/2/2014",
    "text": "The first time I ate here, I *loved* Earthy. I love the shop and the whole rustic/crunchy atmosphere, and the food has generally been very, very good. However, the attitude of the staff on my second and third visits what has brought the place down in my estimation. I would describe it as indifferent. It makes me hesitant to return despite the lovely food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mIlGkQCpUvfcpst-l8C1Dg"
  },
  "1zO62Jy14SWGiC9hRe7PKA": {
    "date": "9/13/2012",
    "text": "By the time the Lemon Posset was served I was extending the cook offers of marriage. Things already took off spectacularly when the sharing starter platter was put on the table, full of vegetables and home made bread and a spread that were absolutely delicious, and everything just got better after that.  He didn't take me up on it, but you can't have it all.  Go. In the last month I have had meals twice as expensive, and not even close to as good. My tip is to have two starters for a light mains, but the mains themselves were a revelation (and so generous my table companions shared them with me, which is why I got a taste of chicken that was a complete revelation of how chicken can taste).  Just go.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i7-9PzjvO_lrzQvVxHAibQ"
  },
  "fUvltGFPC9lBHL_66bVhmg": {
    "date": "8/12/2014",
    "text": "Absolutely amazing breakfast. I had the waffles, which I did not regret. The place also has a really good organic store next door.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0bpe54UmM9T6LnpSpx6UAA"
  },
  "ikmYr7cmY1fjt9J45Sm6Qg": {
    "date": "11/4/2012",
    "text": "Sorry to buck the trend of good reviews as I do agree that the food is yummy and I really want to like this place BUT......  I've been here twice now and the service has been poor-grim. The first time was a sunny spring day when some friends and I popped in for brunch. Yes, I was a little late arriving but we waited an age for the coffees they had ordered and then even longer to for the waiter to take our order. 30mins later (over an hour since we had sat down) we were informed they were no longer doing brunch (even though the same ingredients are on the lunch menu). The manager came and apologised, we had yummy lunch in the sun. Ok, so they're just having a busy shift and training new staff. I'd still come back.  Nope - months later a friend and I decide to try again for a quick brunch. We ordered at the counter before we sat down as we were pressed for time, and turned to feel a few angry eyes from tables who had obviously been waiting a while. Uh oh! Coffees again took an age, despite the staff having no urgency about them at all. They had run out of rolls for my friend's sausage roll so would she take toast? She asked if they had brown bread, answer was 'We have all kinds.     Do you want toast?'. It was all just a bit less pleasant than a weekend brunch should be. I won't be hurrying back to give them a 3rd chance!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bgsy8MOW3URtRArbJXg3fw"
  },
  "gSDkLIT-EpGfvvKJ5PFtSA": {
    "date": "7/22/2015",
    "text": "Chickpea burger was just all right, but the chips were terrific.  Good beer selection.  The hummus they were selling when we were there was very tasty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tAWwaepUPjGLrZmdqvQvSQ"
  },
  "uOxdCTAhVdLlZPaI2hK-4Q": {
    "date": "6/27/2012",
    "text": "Really underwhelmed by this. Service was slow & took almost 20 minutes for our order of 1 soup, 1 sandwhich & one Fritatta to arrive. The food was bland. mean portions & overpriced. Wouldn't visit again & wouldn't recommend",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h27kVQQaejp53UUkj_TC-w"
  },
  "nEoexBjafjRwt5zAG62CDw": {
    "date": "8/3/2012",
    "text": "We went here for breakfast on the recommendation of a friend. The food was delicious, the staff was friendly, and prices were reasonable (for local, organic food in particular). We will be returning again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YwSiUkXKYyhofK9h0XOITg"
  },
  "L0lQh0F92cL4Om8-UGyDIQ": {
    "date": "11/17/2015",
    "text": "I'll be honest, for years i was quite reluctant to cross the threshold of Earthy.  I'd been told it was pricey with an overbearing organic 'we love the earth' ethos that just put me right off.  but after a brunch location nearby was too crowded we decided to head here for some brunch instead.  what was a very tasty sharing board in my memory when i saw an itison voucher for a main course and glass of wine for 2 for only 14 i quickly bought it.  the voucher itself was incredibly good value as a main course comes in around 10 and a 175ml glass of wine around 4-5 depending on what you get.  so basically a two for one deal.  Earthy has an all day menu, so after breakfast time you get the same options for lunch or dinner.  i went with the lamb meatballs and the boyfriend went for the burger.  i added on a side of green bean and barley salad as my main was literally just a bowl of meatballs.  all the food arrived in decent time and i have to say it was incredibly tasty.  although for my main i really feel like it could have come with an actual side and that is probably my biggest gripe with Earthy's menu.  the majority of main courses only come as the single item, nothing on the side.  which for the price you're paying 10 or more you could at least get a bit of green salad on the side really.  after our mains, we were tempted into dessert after spying what the table next to us had gotten.  we shared one of the best bread puddings i've ever had in my life and i only wish i could remember what was in it.  either way it was amazing and if i saw it on their menu again i would go in just to have that!!  with the added sides and dessert our bill came to around 10 i think, so overall 24 for two people for two mains, two glasses of wine, a side, and a shared dessert is pretty good value.  i'd definitely buy the itison voucher if i saw it again but will probably stick to their cheaper breakfast and brunch offerings when i head back there again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z_xbO-Iaxbx-ZRPhLJK-Ew"
  },
  "TuscXLMiD-Lx5_lb5ODkoA": {
    "date": "11/27/2015",
    "text": "Firstly -the shop/deli section is fantastic. It's is my first stop when buying veg, particularly tomatoes. There is a nice bread selection from a local bakery; it's a great place to pop into in the morning and pick up a loaf and some nice eggs. Staff have always been friendly and informed.   The restaurant and cafe doesn't live up to it unfortunately. It's the kind of place I really want to love but it always is slightly disappointing. The food is good,  sometimes sounds a little bit better on the menu than it does to eat. I love the passion for local organic produce but I feel like they could stand out more in the end dishes.  Breakfast/brunch is the best option. Baked eggs dishes such as shakshuka, served in a frying pan are worth it if they are on. Coffee (from Matthew Algie I believe) is fine. I'll have a flat white if I am in for food but I wouldn't go out of my way otherwise.    Service is without fail, always incredibly slow. Don't come expecting to eat in a hurry and be prepared for a long wait for food. I gave them a free pass on this when they opened but in the yeas since then nothing seems to have improved much. It can get very busy at the weekends so it becomes a problem.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Vtz3apL-jIH9Jr009w9AKw",
        "caption": "Photo of Earthy Canonmills - Edinburgh, United Kingdom. Get your brussel sprout fix.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Vtz3apL-jIH9Jr009w9AKw/o.jpg"
      },
      {
        "img_id": "7VGjcH6HO7Ef7ZR41I5cTg",
        "caption": "Photo of Earthy Canonmills - Edinburgh, United Kingdom. Know your squash.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7VGjcH6HO7Ef7ZR41I5cTg/o.jpg"
      }
    ],
    "user_id": "eFqg1qaOBHq_Od6fRlMcWA"
  },
  "d1Sbyp9Nr87naaGGm3diGQ": {
    "date": "12/7/2015",
    "text": "It seems strange living just a few minutes walk from Earthy that I haven't been here for a meal in the evening. Decided to head along on a dreich and dreary night as the menu looked to be fairly veggie friendly (for the girlfriend) and enough meat dishes for the non-veggie.  We arrived to be greeted by a barrage of noise and the waiter explained that there was a girls 16th birthday taking place which was why rubbish music was playing in the background. I have tried not to let the background annoyance influence the review as that is something that the venue can't help (but jeez,16-year-old girls are so bloomin' screechy!)  Firstly, don't base your decision on going to Earthy on the menu online. It's fairly different to the actual menu and there are some more choices in real life. That said, it was (rather unusually as a meat eater but good for a veggie) lacking in a wide selection of meat dishes. The Venison Ragu with Kale that I had was pretty good and an unusual mix that I hadn't had before. My partner had the mix of four salads which was enormous and great value! So food was good, not amazing but not uneatable.  Drinks are very expensive, 5 for a bottle of Williams Bros beers is a bit over the top given that they can walk around the corner to Tesco and get one for 1.65  Given the competition that is around Canonmills Earthy wouldn't be the first place I'd be jumping toward for a night out but if I was heading out with more than 1 veggie it probably would be somewhere I would suggest.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "CD-cuKfj2wybw2DDQbp5Wg"
  },
  "CbmWo3Z9MMcQ84RYERN4Ng": {
    "date": "5/15/2015",
    "text": "They do a very brisk trade at Earthy's selling themselves on the idea of wholesome and organic fare, and charging accordingly. Sadly, their food isn't really all that much of either and their service certainly isn't brisk...  I've been coming here every few months since not long after they opened, and in the beginning their food was very tasty and their staff friendly and decently efficient. It didn't take long for the honeymoon period to end, however. After a while, I realised that their food is predominantly not organic. Their eggs are, which is good, but their produce could be tesco value for all I know much of the time. That doesn't stop them using marketing language and a \"feel\" that encourages people to assume they're the \"organic option\" in an area with a lot of half-decent places.  To be fair: Their meat seems to mostly be local, at least, and Scotland is pretty decent for animal welfare standards. I don't eat meat (anymore) so that doesn't affect me, but it's good to know.  If you have read my other reviews, you'll know that I'm a bit of a coffee nut. Some would say snob, maybe... And I quickly gave up on having a coffee with my lunches here. It's... Okay for most, I guess. But if you're a brew lab/ artisan roast/ machina regular, you won't like what you get here (is my entirely predictive and accurate assumption)  Their food has gotten less and less worth the money, and while the fritters I had today were decent enough, they were not good enough or generously enough portioned for the 7.50 I paid. The fritters themselves were laid out on some fresh greens that were absolutely drenched in fat. (See photo)  Now, the waiting... I get that they're busy and popular, but waiting for 25 minutes to get a seat at the window (we were very nearly bypassed by someone who walked straight in and was shown to a table straight away until we intervened) and then 10 minutes to order and another 30 for a sandwich and some fritters... Inexcusable. The staff are friendly, but from a place that has been consistently busy for years I expect better organising than this... We ended up going to the toll to pay as they didn't bring us the bill after we asked for it either...   Bye bye Earthy! We had some good times, but those are clearly over. You're too expensive and too slow for the level of quality you provide.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6qhMryH_6mVRJc4l6EZZUg",
        "caption": "Photo of Earthy Canonmills - Edinburgh, United Kingdom. Greens swimming in fat.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6qhMryH_6mVRJc4l6EZZUg/o.jpg"
      },
      {
        "img_id": "bR_0n4iFZzwmEDgaboAArw",
        "caption": "Photo of Earthy Canonmills - Edinburgh, United Kingdom. Quinoa fritters and a sandwich.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bR_0n4iFZzwmEDgaboAArw/o.jpg"
      },
      {
        "img_id": "AoVff3VpqL6XOZSJg17eBw",
        "caption": "Photo of Earthy Canonmills - Edinburgh, United Kingdom. The ubiquitous and pointless minted water.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AoVff3VpqL6XOZSJg17eBw/o.jpg"
      }
    ],
    "user_id": "02YOZ7OLgXj18Jp9Fu-Fkg"
  },
  "gnMgMw0Brt0AtYSHmviFqQ": {
    "date": "10/4/2014",
    "text": "Found this place by virtue of sitting at the traffic lights during roadworks at Canonmills, and as they had a car park round the back decided it was a good option for lunch.  What a great find! It's an organic wholefood shop & deli with attached cafe. I was slightly surprised that it wasn't completely vegetarian as it looked the sort of place that should be, but there were enough veggie, vegan and gluten free choices on the menu to satisfy the most demanding dietary requirements.   We opted for a simple salad - I say simple but actually it was anything but. You can pick four salads from a list of 7 or 8 I think, and they arrive in a decent-sized soup bowl. I had a mix that included spicy cauliflower, sweet potato with couscous, squash, and kohlrabi. I'd only ever heard of kohlrabi but had never eaten any to the best of my knowledge - in fact I had to Google it to see what it actually was! A Fentiman's ginger beer (my favourite) provided a suitably refreshing accompaniment.   I can honestly say that I have not had a salad as tasty as this since the last time I was in Hendersons - and that was quite some time ago. A good portion size for the money too - it was around 12 for a huge bowl that kept me going the rest of the afternoon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8W-1w3jvjRQ2BGxaZ5FQhg"
  },
  "YmXjv6HHUYAIBVFxwK3ZSQ": {
    "date": "10/14/2012",
    "text": "We walked past on a Sunday morning and decided to have lunch. Make sure you are not in a hurry, because service can be slow, the food more than makes up for it though.    Very reasonable prices, and vegetarians are well catered for.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eBVFtdxqTGdogezZ98HUsQ"
  },
  "LKpdMFsFXe8guij2SeZ-Tg": {
    "date": "10/28/2013",
    "text": "Seriously, the kale and butternut squash salad with the chili oil is my favorite dish anywhere. This place feels very good and wholesome, and I had 3 salads in combination for a lunch plate, and I was so happy to have a healthy and damn good taste together.  I am vegetarian, and often I make lovely food, but not this tasty.  I either need to bankroll my new found obsession or learn to make it myself.   The country store has a lot of tea, cheeses, breads and veggies.  Also, they have sundries like almond butter and such.  Good finds in there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "tVrGBW6rj1uebWnqjY-iTQ"
  },
  "-siBrj43RB2AaI-8wxZT6Q": {
    "date": "12/3/2015",
    "text": "First time here on a dreich December evening. Restaurant has an attractive layout and decor and staff were friendly, relaxed and welcoming. We had main courses and 2 drinks each which came in at just over 40. As a vegetarian I was keen to try the 4 salads for 12 option in spite of it being a wintry evening. The salads sounded delicious and did include lots of fresh, varied and filling ingredients but there was no wow, make-your-mouth water factor. The pinot grigio wine was insipid but the mulled red very spicy and tasty. I'm definitely inclined to give it another try but felt it had more of a daytime than evening vibe. Would have liked to see four salads a little better presented too as heaping them together meant it was harder to appreciate individual salad tastes. Will return and try again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "YaZi78FLckEMAB_93eVqaA",
        "caption": "Photo of Earthy Canonmills - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YaZi78FLckEMAB_93eVqaA/o.jpg"
      }
    ],
    "user_id": "t0lb4ZHHAAt1K10bjXIATg"
  },
  "a190ZYDdWJpwMkAOrTNsgw": {
    "date": "8/9/2014",
    "text": "We had the full Scottish breakfast and I give it an easy 5 stars. So tasty! Each ingredient was amazing quality & the bread especially, was perfect. The only negative was the coffee. Not bad, but not great either.   Service was really good and we had a big hug of water with fresh mint in it placed on the table straight away. A grand experience!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BwUUiQgTE62t_eXmCSS9Eg",
        "caption": "Photo of Earthy Canonmills - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BwUUiQgTE62t_eXmCSS9Eg/o.jpg"
      }
    ],
    "user_id": "7cDv2xutXJZTHClKDSZKmw"
  },
  "unDaG9ud6WYAyGPk8Ntrbw": {
    "date": "8/2/2015",
    "text": "Locked out of my flat this afternoon I took cover from the rain in Earthy.  Earthy has a reputation for delicious organic vegetarian & vegan food as well as catering to a wide variety of diets, with plenty of gluten- and dairy-free options.  I enjoyed a quick coffee, opting for a soya flat white and couldn't deprive my sweet tooth of a little treat to accompany this. From the vast selection of cakes & pastries I ordered a strawberry & pineapple cake. Dense, moist and indulgent, I would never have known this was vegan.  For me this is a huge part of Earthy's appeal: their offering is a well-thought out, colourful array of nutritious but also delicious salads & snacks, challenging the many preconceptions around vegan & vegetarian food.  With heaps of outdoor seating this place would be ideal for a sunny day, however, those are few and far between in Edinburgh.  Coffee and cake for 6.50 so not cheap, but I think this is more representative of what we should be paying for great quality, house-made products, rather than the cheap mass-produced crap that most places get away with selling.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kUSvk0HUX5OFavCIboBZuw"
  },
  "-dclgl2uxt0Rzezevfa6IQ": {
    "date": "1/4/2015",
    "text": "I'm not really sure what 'rustic hipster' means - but if it equates to overpriced food, with very limited menu choice, coupled with an aspiring upper middle class/aged clientele with poor and slow service then it's certainly not for me.   Unfortunately, the Earthy at Cannonmills was a disappointment. We have been meaning to go for a while due to its lovely decor, and a hungover Sunday afternoon seemed a good time to give it a try.  Firstly, I was really looking forward to the breakfast which has been recommended, but discovered they stop serving at 11:30am and there was no brunch on the menu.  Secondly, the menu was very limited. With no chance of brunch, there was about 5 mains on the menu which consisted of soup,    Sausage sandwich (sold out), Chicken burger, 'posh cheese and toast' or salad. Given that 2/3rds of the rustic hipsters in the cafe went for the chicken burger - including myself - probably suggests the sentiment was shared.   Thirdly, the service was painfully slow and when the burger did arrive I felt guilt asking for some sauce, which seemed to be such an inconvenience for the waitress. I assume rustic hipsters take what their given.  In seriousness though, this has the potential to be a great little cafe if they sort the staff and menu out.   Finally, the burger was good, not great to be honest, hence 2 star, and we sadly left disappointed and won't be back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FNxM7Zl-ThbBe9VPHgZF-A"
  },
  "NBOZPbubg40y820mNBULjw": {
    "date": "9/24/2012",
    "text": "Part cafe and part health food shop. So after eating off the excellent menu you can go buy some Penguin friendly tofu burgers to have at home.  There's also free parking for ones Stockbridge tractor round the back.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UfLGgjd6UExBVZb6JRJiQA"
  },
  "b5C4oNmjNkIKH3pFQtueFQ": {
    "date": "10/9/2013",
    "text": "A 3 star despite the love for Earthy?  Being GF, this place had been recommended to me. Hmmph. I had a ok enough brunch here but it wouldn't be my first, second or third choice in the future. Despite a shop filled with GF products (I would shop here), the options are pitiful in the cafe. Granted many business won't have the products to make certain things GF but when you sell those ingredients then you'd expect a better offering.  Tasty smoothie, portions a little small for the price, but Earthy and it's lack of GF options just left me a bit cold...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "frthTngbBHgSdk4j85HmEQ"
  },
  "n1xIP5CBLE_VsCQt8ENl7g": {
    "date": "6/24/2013",
    "text": "So finding myself hankering after a burger on a Saturday lunchtime, I thought I'd give the place another chance. I was asked for my order refreshingly quickly - things were looking up.  90 minutes passed.  I eventually received my burger, an apology, and my drinks on the house, but the damage was done. I won't be going back, and will instead go to Circle where I have never been disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "v-zTwlStpGrbgxKAu6xKUA"
  },
  "XN3y6PtTKLssJ52tXDQcKw": {
    "date": "3/15/2013",
    "text": "I thought Earthy was all about vegetarian eating but it actually provides delicious sounding meat dishes too. On a whole it is all about good quality, locally sourced and nourishing food; prepared and served with love and you feel better for it too!  Up until now my home-made salads consisted of green leaves, carrot, tomato, celery, cucumber, peppers and cheeses but man am I inspired by the salad menu at Earthy - so much so that it has made me think about growing my own veggies! The selection of about 10 different salad options from which I chose four to make up my salad platter for my main has really shown me how interesting and sexy a salad can be! I can't remember the exact ingredients unfortunately, however I do recall bulgar wheat, wild rice, goats cheese and pomegranate seeds in one, grilled aubergine and peppers in another, sweet potato wedges with cinamon and puy lentils on a bed of green leaves and walnuts to finish. It was soooooo good and so filling!  For dessert it was a naughty chocolate tart accompanied by a dollop of cointreau cream - I could have easily walked about with a spoon of this in my mouth for the rest of the day to savour it if I wasn't going to invite weird looks. This went well with my delicious pomegranate blini!  The only down side was it was Mothers Day, the place was packed and it seemed to be a little understaffed as service was slow - our drinks arrived with our meal, 35 mins after sitting down! One of my companions who is a regular here said it has never been like this before and the place is always busy so maybe they were caught out by unexpected absence or something.  I really like the earthy decor, art work and chilled music that plays here.   Never again will my face resume the expression of a goat's when chewing it's greens, oh no! It will be of a sprightly bunny who has hopped upon a field of golden vegetables!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "RNIQdiN2RHamTGwdq6PXqg"
  },
  "sWZgv-mOXOlaPgmcEpb-Sw": {
    "date": "4/13/2015",
    "text": "If I could give Earthy 3.5 stars I would. The food is superb - fresh, great vegetarian range and the salad options for lunch are to die for. Wine can come in a carafe too, which always gets my vote. You sometimes have to share tables, which sometimes I'm in the mood for and sometimes not. You also can't make bookings at lunchtime. However, service is always, always slow and sometimes muddled. Don't visit if you're in a rush.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "prZz2ZcVhJZZgswQaT8iuw"
  },
  "Obb9Bx4OaIOWdDU2oDoimQ": {
    "date": "7/11/2013",
    "text": "Really nice cake - I had lemon drizzle cake and a refreshing jazzy americano to wash it down.  When it's quiet on a rainy day - it's my bliss.  Pure bliss.  Like a sanctuary.  I really like the interior and the fresh fruit and veg they offer too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qdq7kCzz4PAzEAfv68bO2w",
        "caption": "Photo of Earthy Canonmills - Edinburgh, United Kingdom. Saw this in ladies Toilet!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qdq7kCzz4PAzEAfv68bO2w/o.jpg"
      },
      {
        "img_id": "OQ5hTer0x0dnXBV6NsU0NQ",
        "caption": "Photo of Earthy Canonmills - Edinburgh, United Kingdom. Had a lovely coffee and americano here - love the space!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OQ5hTer0x0dnXBV6NsU0NQ/o.jpg"
      }
    ],
    "user_id": "BhYROfCjIJsKUk22_IVHig"
  },
  "VaChHdWvXfQZZT2F_i9Vuw": {
    "date": "7/5/2013",
    "text": "This review is for the dinner restaurant (open till 10).  Wonderful healthy food, casual atmosphere but three-course dinner reminiscent of upscale dining. I had feta and endive salad, then sea bream over quinoa, then gooey cookie with ice cream. Good wine available. Friendly service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "853ieF6KqXFU20tyVr3LBQ"
  },
  "9q_6Pat1bNdAVYUcVY8-mw": {
    "date": "2/21/2013",
    "text": "I was very pleasantly surprised by Earthy. The major surprise was that their steak was so impressively tasty. I thought its strengths would lie in delicious fresh vegetables and bread, and while that is True, it was the red meat that really stood out, for me. I look forward to going back again, soon.  Overall, we said: \"I was highly impressed by Earthy. I was always sure that this would be a place that MJ would love, but I wasn't so sure it would win me over quite so overwhelmingly as it did. Their dishes were high on quality and flavour, with very generously sized portions. I'd happily come back to sample more of their delights and would strongly recommend you visit, at your earliest convenience.\"",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "LURC3E0DoXYgN9aYTF3XOg"
  },
  "1RA0Ol7gLuIKjG7pRqFzCg": {
    "date": "7/29/2015",
    "text": "Had a lovely breakfast here with my husband and little one, on a sunny morning.  The space is beautiful, filled with lots of natural light. The menu is small.  Our order:  The Scottish Breakfast for him, which he raved about, the coconut Bircher for me, also excellent, scone for the little one, which was only okay.  My only complaint is that the service was slow.  A number of parties sat down, were brought menus, and then walked out after waiting for someone to come take their order.  After our food came, no one came by to check to see if we were okay, or to see if we wanted out bill.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aS0f-OAog6zVNMI3RxGCTg"
  }
}