{
  "jUacxE3ax2A8xatqmO97UA": {
    "date": "7/17/2013",
    "text": "I did a curry tour of Edinburgh while I was there on holiday. See, I eat curry and spicy food like NOBODY's business - I eat food so hot that I've literally watched others cry over a mere taste at my food. So, I decided to hit a different Indian joint each night while I was in the city in search of the most flavorful and spiciest curry.  This place was pretty good. The staff were more interested in chatting with each other than serving, which I'm not opposed to as a rule but it wasn't the most welcoming atmosphere. Also, the prices were a bit higher than I expected, which sort of put me off. And, since I'm complaining, my request for the dish to be \"extra extra spicy\" was obviously not taken seriously because I could've poured my meal into my eyes and it wouldn't have hurt.   That aside, the atmosphere was very elegant and simultaneously welcoming, which was nice. And the food WAS very delicious. I'm not sure I've ever had a tastier dal (lentil) dish than the one I had here. That I had to bring my own Thai Chile Peppers to add even a zest of spice was unfortunate but the chef's ability to bring out subtle flavor was extremely impressive - redeeming in and of itself. So, not Edinburgh's spiciest curry and never going to come close, but it sure tasted good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qn5qBkOzrnjPrIkv2ZRYPg",
        "caption": "Photo of Passage to India - Edinburgh, United Kingdom. Turka Dal with Rice and Chapati.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qn5qBkOzrnjPrIkv2ZRYPg/o.jpg"
      }
    ],
    "user_id": "O05pk5e0BLaO4cpXzH9d-Q"
  },
  "e3IY3KXlPn4upe8XZrcykg": {
    "date": "7/27/2018",
    "text": "We were told by an Indian friend that Passage to India was very authentic. We weren't disappointed. Located quite close to our house, we were delighted with our choices. I had vegetable pakoras, saag  paneer, dal, and paratha. I loved every bite. Our waiter Mir seemed to be unfamiliar with the drinks menu and seemed confused, but other than that, the food arrived promptly as was the bill. We will definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Be-xNQObaeO1qV-kH8AvA"
  },
  "uScRIsptmwq2TNvHM_54ww": {
    "date": "8/10/2017",
    "text": "Shared samosa and a tandoori mixed platter for two which had chicken, kebab and lamb. Got to sit in the window and people watch while enjoying the good food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tZNyGifhl2hkfH7tq6qcZg"
  },
  "tMuCrxwH-BEzCBn6piQksA": {
    "date": "5/14/2017",
    "text": "We want to Passage to India last night - seated and promptly forgotten about- finally brought menus and had to ask two waiters for water - we ordered and didn't see the apps for over a half an hour (approx 35 mins) -son had gone to ask about them - no explanation (another single older man was completely ignored nearby as well) two tables who had come on after we had ordered were served their dinners first - maddening - after an hour and 40 minutes my husband went to ask where the food was, the waiter said he was going to get it - came back a few minutes later empty handed said it would be ANOTHER TEN MINUTES- approximately two hours for Indian food ???? Butter chicken and chicken tikka?? So we left and got a decent fish and chips next door-  Also noticed since we had plenty of time for observation, waiters brusque and not overly friendly to other tables - plenty of good Indian in Edi to put up with this place :(",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ydk_fT8hAkLHzQ7XHsx_ow"
  },
  "J9OeTcC6fmawqsKylstH-Q": {
    "date": "11/1/2015",
    "text": "Loved the food! Pure indian taste..they have various variety of indian food. And i got all my favorite dishes:) Awesome hospitality..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nZb-0Rh8NNKaVFuq2vsL-A"
  },
  "A_ZuBneWcyOeu9t6ENKCyw": {
    "date": "7/17/2010",
    "text": "Passage to India looks like a takeaway from the outside, but inside you'll find a top-notch Indian Eatery which surpasses many of it's bigger counterparts in Edinburgh.  The interior of the restaurant is nothing special but it is tastefully done and stylish, the real colour coming from the flavours in the cuisine. I especially liked the fact that all the tables seemed far enough away from each other to be private, even with limited space.  We hadn't booked a table but it wasn't too busy when we arrived at about 8pm on a Wednesday night, so we were treated to first class service. The waiter showed us to a nice table, and brought us our drinks. The menu is quite extensive with plenty of choice. We chose the chicken pakora for two to start, it was perfect and the batter was crisp with no grease whatsoever. I had chicken Dansac for main and it was delicious, plenty of spicy lentils and the rice was really fluffy and moist.   The price is right too. Two courses each with two drinks came to just over 20, a total bargain for City Centre dining.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dTfebfz77lTtR1YYhpnN8g",
        "caption": "Photo of Passage to India - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dTfebfz77lTtR1YYhpnN8g/o.jpg"
      }
    ],
    "user_id": "Cy1PV2TdYeDFA16mUOlr3Q"
  },
  "bX7b-6hmeIpH5eSh4H-iwg": {
    "date": "6/16/2010",
    "text": "The thing which first attracted my mates and I to Passage to India was its name and original sign.  This place is definitely not just any ordinary restaurant, and I would even go so far as to say that it is flawless.  From the moment we walked in we were greeted like old friends by one of the friendliest waiters I've ever met.  The decor is stylish and unique and the tasbles all seem perfectly placed to give a comfortable atmosphere.  The menu is extensive and has a good range of kormas, tandoori specials and other authentic Indian dishes. I ordered the Lamb Tikka, plain rice and a naan which all arrived pretty quickly and tasted incredible.  The sauce was amazingly creamy and had a good blend of spices whilst the lamb was clearly of the best quality.   We each spent about 13.50 on a great, filling meal and some real Indian beer.  I would recommend Passage to India any day for both impeccable food and service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yleuUItwNzfpeyd2DMiNAA",
        "caption": "Photo of Passage to India - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yleuUItwNzfpeyd2DMiNAA/o.jpg"
      }
    ],
    "user_id": "yfXqZkU5iXE07GSHzdsQBA"
  },
  "aWWS_aZTqkxT8qyhKi9laQ": {
    "date": "5/27/2010",
    "text": "As a rule, I tend to find you can judge an Indian restaurant by the smell when you first walk in. This useful tip has come in very handy more than once I have found and, I am proud to say, my nose didnt let me down for Passage to India.   My mouth was watering by the time I had sat down at my table, and had ordered my drink with the most friendly staff member I had ever met - he was funny, helpful and just all round nice.  The food was certainly not a dissapointment - my lamb masskai was beautiful, and all the sundries we had ordered were just as good.   The price was also pretty good - with 4 of us dining for around 12 each, which was the cherry on top of an already good cake.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SxV1Jq7UANuSYpn42JXvOA"
  },
  "6Sy_Pq7TGVlRegQ0ODQCOA": {
    "date": "5/20/2010",
    "text": "I was very surprised by Passage to India, I was given an extremely warm welcome by the manager and he pulled the chair out for my girlfriend (touch of old school class).  I ordered the Chicken Shashlik on a recommendation and I wasn't disappointed. Big chunky kebabs marinated in a mild curry sauce with safron infused rice. Heaven!  The best part was the price, both of us ate for 20 and we got 2 glasses of wine on the house!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ngUL7XCzxqzbFs2U_QIU1A",
        "caption": "Photo of Passage to India - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ngUL7XCzxqzbFs2U_QIU1A/o.jpg"
      }
    ],
    "user_id": "9nUtGoOnZMPlZdUQV_aqTA"
  },
  "-h7R7PbxMdIEUkiK7pd8bQ": {
    "date": "3/21/2015",
    "text": "Wonderful little place. Friendly atmosphere, interesting music, quality ingredients, gorgeous waittresses... what's not to love?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fd6xr_yV29AAi7qa5JNHLQ"
  },
  "rC7JSbG9Z_rauxVQT4ktWA": {
    "date": "11/6/2007",
    "text": "Dining at Passage to India can be a mixed experience. While the decor and lighting are modern and inviting, the staff tend to be hurried and preoccupied, creating an uncomfortable pressure which is further enhanced by the excessively loud music.   However, these shortfalls are quickly redeemed by the tasty and flavoursome food which is sure to excite your taste buds. Curry dishes are presented in steel bowls placed on a small heater and are usually value for money. I would recommend ordering a nan bread with the curry as it is a great sauce scooper.   Be warned, these curries are not for the faint hearted so remember to pack extra tissues to wipe away those tears!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zekiCxtF-O8gF7agmUQm6g"
  },
  "OljNEn1Incmi5xBsXi3JxA": {
    "date": "2/28/2011",
    "text": "Passage to India is just another curry house serving up dishes with muddled flavors that won't excite you.  Paratha was a bit dense and came to the table when I was half way through my curry.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZFAtjSBQDA3kDExHwFz4Iw"
  }
}