{
  "rOPtEasWYZuzdToIdksTjw": {
    "date": "2/4/2016",
    "text": "Nice enough wee place. Kind staff and great selection of cakes. The only thing that puts me off is the location",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yoNEakGPJ5wMmye0_mzDpQ"
  },
  "7k5WWZk5RLwQjL4YctyOKQ": {
    "date": "5/20/2014",
    "text": "This place was just so cute. It was really old fashioned which I like, the quality is so good and they don't,t feel the need to do some fancy and inappropriate refurbishment which I respect a lot. I had a beautiful homemade potato and leek soup and then a coronation chicken salad. My mum liked her brie and apple panini too. Yummy.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "Hzt2Rv6SHaZZEb-4peqEPg"
  },
  "ftB2QYbWK7mf5wS13ICy3A": {
    "date": "6/25/2010",
    "text": "Muffins Coffee House has been here for years and I used to pop in for a cake with my gran when I was younger. It has a nice friendly atmosphere, has a cute name and has a great selection of cakes to choose from. You can take your cakes away with you or you can sit in and have a cup of tea or coffee if you're looking for a more relaxing afternoon.  In addition to cakes, lunches are also available here and there's always a good choice of goodies on offer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "CqkdpG2tkCPQA69umlAHsA"
  },
  "ZQxLDkL7ui_T-P_gZjZ8zw": {
    "date": "10/11/2008",
    "text": "This place is brilliant - a visit here was always a welcome treat growing up. You can buy a nice indulgance to take home, sit in and have a coffee with it, or go the whole whack and have lunch there. Lovely little coffee shop, I've only given it 4 stars because I think the quality of their cakes has dropped a bit in recent years.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HggfQIXR9sDqtl_qRYPBrg"
  }
}