{
  "4bADaUJyeXMMfWpMREr3Hw": {
    "date": "10/30/2010",
    "text": "Great place for chilling out - alone or with friends. Nice comfy sofas and big glass windows. Great drinks. Though I haven't tried their food yet, the restaurant area has a lot of following. I'll try it one day....",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kcmnNN6PhjwDoyZ6SFVuTQ"
  },
  "KVKtqwfnpPoEbZnvd16gmQ": {
    "date": "4/29/2008",
    "text": "Conveniently situated in the centre of Edinburgh's city centre office district, Grand Cru is a firm lunchtime favourite of office workers, when it's quite difficult to get a seat. This is largely due to the wide variety of tasty snacks and hot drinks this grown-up refuge offers, with old favourites like soup, paninis and chips blending flawlessly with newer classics like spring rolls and fish cakes. However, the comfy sofas affording a great view of the ladies who lunch around Hannover Street means that it's also a much loved hangout for students and artists. In the evenings, Grand Cru becomes a classy wine bar, with its individual booth-style tables full to overflowing with corporate suits dissecting each other's day over a bottle of wine and a pleasant soundtrack of modern cafe sounds.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "akNJFydZUlOICiMwOluoEg"
  },
  "qo9KLX4U1co1_KxdK2S6Hw": {
    "date": "11/26/2008",
    "text": "The Grand Cru is a restaurant by day and a wine bar by night. The food is good, I really like the pan seared tuna and their hot chocolate but they can be a bit funny about which food you can eat in which seats - always want the restaurant food with the comfy seats",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bxl3j_UX2PmRl4nga-_4oA"
  },
  "Hf9DvKqEm46XHqdB508CJQ": {
    "date": "1/29/2009",
    "text": "Been to this bar a couple of times and always had a good time.   Good atmosphere on a Fri/Sat & more relaxed during the rest of the week. Service is excellent with friendly & helpful staff, while the snack food (especially the nacho's) is well worth a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ihyhu-HSkPVp9mtmUtfJ0g"
  },
  "AgTM4viXCF61GPN6bz-1LA": {
    "date": "5/2/2019",
    "text": "Arrived here at around 12:30 for a late brunch/breakfast but they were no longer serving that menu so we had lunch. It was very busy and the only table available was a really low one which would have been awkward to eat at but we didn't mind. When another table became free our waitress asked us if we would like to move - which we did but it was great that she acknowledged the situation and looked after us. The coffee here was really strong which I enjoyed. We decided to get the 2 courses for 8.95 offer which is unbelievable value for what you get. I had the Mussels as a starter and decided on the Italian Panini for a main course which is a vegetarian option. Both dishes were full of flavour and service was really quick. Couldn't recommend here enough.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lgEe0iZNnq0UaQE-9v-DYA",
        "caption": "Photo of Grand Cru - Edinburgh, United Kingdom. Italian Panini",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lgEe0iZNnq0UaQE-9v-DYA/o.jpg"
      },
      {
        "img_id": "PPqaowYGqBxf4Zcw6O6ffg",
        "caption": "Photo of Grand Cru - Edinburgh, United Kingdom. Cappuccino",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PPqaowYGqBxf4Zcw6O6ffg/o.jpg"
      }
    ],
    "user_id": "cYJ6Qq85p1hJ1BbcaNH4Kg"
  },
  "J-7YB6RIxqpC6c8Rq8m8Ng": {
    "date": "11/17/2018",
    "text": "The staff was very friendly and attentive. We were offered a seat and some checked if we were ok every other time. The food was cheap (2 course meal for 8.95) but underwhelming. Not bad neither fantastic. We had the Burger and Pasta with mushrooms. The pasta was fine, the burger wasn't so great. There isn't a specific card for the non-alcoholic drinks which was (to us) kind of confusing.  The facilities were nice, modern and offered a good place to sit. Although we sat in the back which was a little dark.  The restrooms weren't that clean.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9QowyTzRAqimlYdBMN7rJQ"
  },
  "E6LcggNlWa735u_A3vB1jg": {
    "date": "7/13/2015",
    "text": "I came here one fine Saturday afternoon for lunch.  Unfortunately, my lovely afternoon was spoilt by the food here.  This establishment has been one of a favourite amongst office workers for after work drinks.  The place is trendy and the employees are really good.  However, the food here is a shocker.  I ordered the mussels as a started.  When it came, I was really impressed with the portion as a starter.  However, when it came to tasting it, it has got to be by far the worst mussels I have ever eaten in Edinburgh.  It is not properly cleaned and the worst thing is they are not fresh.  I can taste a lot of grit and just taste of seafood that has gone bad.  I was extremely disappointed with the mussels.  I don't know how they actually manage to serve this dish and the added too much cream to it.   Don't even get me started on the main.  Ordered a full baby back ribs as the main.  Again portion was huge but the quality of the ribs were terrible.  Has to be the worst ribs I have ever eaten in Edinburgh and extremely bland.  If I have to guess, the ribs must have only been boiled and then smothered with plenty of bbq sauce.  That's not how you serve or prepare ribs.    The chef really needs to improve on his food or change the chef.  No love or effort has been put in the dishes at all.  It is like they are taking a shortcut.  Not cool man not cool.    Sorry for the bad review. Maybe I have too high hope for this place.  I usually order dessert to finish but on this occasion, I didn't bother and went straight to the counter to pay for my bill.  I did leave a tip for the guys though.  I am reviewing only the food but the waitress and bartender were extremely polite and helpful.  Drinks must be great as well since it's a lovely hangout place after work.  I would only come here for drinks in the future and forget about the food.  1 star for the service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9MOPLRR77B-zBrqnh3yC5w",
        "caption": "Photo of Grand Cru - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9MOPLRR77B-zBrqnh3yC5w/o.jpg"
      },
      {
        "img_id": "W_kIee28-950qXu_SmM0fA",
        "caption": "Photo of Grand Cru - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/W_kIee28-950qXu_SmM0fA/o.jpg"
      }
    ],
    "user_id": "bJ5CG5cBguo09dqLFTyHjw"
  },
  "VZHPvPnjkyGQMzYGbCZOlw": {
    "date": "12/26/2016",
    "text": "Service is nice and food is fast!! We ordered two fish and chips and it only took less than 10 mins.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q8j8ZRdYkR5BWxpLMu48pw"
  },
  "Jfta7oFBd_b0VDFMdJJ5kQ": {
    "date": "1/30/2016",
    "text": "I was recommended this place for its cheap full breakfasts, which is certainly has. I can here during the summer to meet up with a friend for a cheap lunch. And lunch here is very cheap and very good for the price.  It's like a bar style place with people ordering cocktails at lunch and basking in the sun. But still a good place for a bit of glamour and cheap lunch.  I had the risotto which was really good and a huge portion that I took have of it home. Not the best risotto but still great risotto :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eN2pCfT17EGokP9UWnoZUA"
  },
  "zAcjXH0Wt6csFMPPkRnveA": {
    "date": "6/13/2017",
    "text": "Looks cool from the street. Only had one server on for the night. Nice lady. Only had wine and dessert. My brownie was dried out and burnt.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lJHRsve1VN0Z-bKTVkG8gQ"
  },
  "gZYFam-3Lodg0wNXhte75g": {
    "date": "1/18/2016",
    "text": "Great tapas! Great prices! Great prosecco! Love this place, great fun, really enjoyed the food and drinks.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KrKSIyhT8R53lv943P8lpg"
  },
  "KSHIg8aw4sU0Z9P2N26Q5A": {
    "date": "7/19/2013",
    "text": "Popped into Grand Cru last night for a couple of drinks. My margarita was meh - salty rim but a lack of kick from the tequila and lime. The gin and lemonade I had afterwards was decent though.  Quite a lot of (comfy) seats in this Hanover St bar. Drinks promo's appear to run Mon-Thurs so spirit and mix is 2 and some cocktails, marked CC for cocktail club are also 1/2 price so around the 3 mark so cheap if you are looking for a couple of drinks in that week before pay day.  Does food as well - typical bar stuff and not great for gluten free at first glance so maybe wouldn't return for food. For a cheap drink it is ok but the clientele are very 'young' looking - lots of blonde hair, tans and A&F clothing...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "frthTngbBHgSdk4j85HmEQ"
  },
  "yIpYSBxbBdjiC8AHNbv0iQ": {
    "date": "2/5/2013",
    "text": "Grand Cru offers a very decent lunchtime offer, with good soup, a tasty panini, and more than passable fries for the princely sum of 4.95. The place seems to divide opinion, but I rather like it, and often pop in for a quick drink, on my travels.  Overall, we said: \"as a quick lunchtime stop, I was really happy with what was on offer at Grand Cru. It was a filling lunch for a very reasonable price, with the quality of the soup and the panini more than acceptable. If you're looking for a hearty lunchtime snack, I'd be happy to suggest you pop in and try this light-on-the-wallet option.\"",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LURC3E0DoXYgN9aYTF3XOg"
  },
  "t9oamBtZVitIGBwLZCO-rQ": {
    "date": "3/31/2013",
    "text": "I haven't eaten in this bar so I can't review the food, but as a bar I'm not keen on it. Whenever I go out socially with my exercise group we always end up going here for some reason and I never enjoy it. It's a weird layout for a bar, but maybe that's because of the restaurant as well which divides it up. It makes it hard to find somewhere to stand and we always seem to be in the way of people passing to the toilet which you have to go down a flight of stairs to get to. The toilets are shared with Bar Napoli.   I personally don't think there's a great atmosphere in the bar and with all the great bars in Edinburgh to choose from I would never choose to come here.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O6dMShJ-dIX_4Qsq6mvvqA"
  },
  "VzuW8-EMdLuScGFkGNrNZg": {
    "date": "5/4/2010",
    "text": "Grand Cru has that handy advantage of being open past the time (until 3am) that normal bars in Edinburgh get to be open until at the weekend, so if it's past 1am, and you still fancy a drink, but not a dance, Grand Cru is a useful drinking establishment to be aware of.  I do find it a little bit clinical as far as bars go, and beyond the limit of busy at the weekend I can be bothered with, but there's nothing really wrong with it to be honest, so A-OK probably describes it fine. In fairness, the staff are always really nice and tend to give you some good banter while they're serving you, which is always a bonus, as a lot of bar staff, particularly on a Friday or Saturday night, are understandably pushed to the limits of their drink serving ability, so there's often not much time for chat. But then again, you should probably be relying on the mates you're with for conversation, not pestering the bar staff for entertainment.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Af_dFzfPbY9AwmT0oGvBCw",
        "caption": "Photo of Grand Cru - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Af_dFzfPbY9AwmT0oGvBCw/o.jpg"
      }
    ],
    "user_id": "5Mujjzv-ZH6HhxT-hWCpVg"
  },
  "Le1h-DAMkx3YddoaAFo3Jg": {
    "date": "7/19/2010",
    "text": "I love this place. Ok, so you cold say it's yet another expensive bar on or around George Street, but there's something about Grand Cru that makes it a little bit different from all the others.  Maybe it's the huge floor-to-ceiling windows along the front of it, which allow for great people-watching over a glass of wine with friends in the afternoon, or maybe it's the clean cut lines of the wooden furniture, but something about this place has a trendy yet relaxed feel to it.  Yes, drinks are definitely on the pricey side; and yes, on weekend nights it does get absolutely rammed, but for daytime drinking this is definitely one of my favourite spots.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lD2ELgrRQMLIFRUsMt_Tfw",
        "caption": "Photo of Grand Cru - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lD2ELgrRQMLIFRUsMt_Tfw/o.jpg"
      }
    ],
    "user_id": "oEshN5oq98_g23MvEnRc5A"
  },
  "IfiP5uG1lRQ_MmbcJpoYLQ": {
    "date": "4/5/2010",
    "text": "Grand Cru is a 'style' bar on Hanover St in the city centre which also serves food.  The bar is quite classy and modern, there are cosy booths along one wall if you're looking for some comfort and privacy. Unfortunately given its proximity to George St, in the evenings Grand Cru does tend to attract a rather raucous crowd of yahs (although I think a lot of these people are wannabes and not the real thing). It is quite a nice place to pop into for a coffee or something stronger when you're doing an afternoon's shopping, but I'd go somewhere else for food. I had a jerk chicken salad on my last visit, a dish you would expect to be bursting with flavour, however it was bland bland bland. Given that the wonderful Dogs and Amore Dogs are right across the street, you'd think Grand Cru would've upped its game a bit - they most definitely haven't.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ILfT59JAkNTiaNcUOp35sw",
        "caption": "Photo of Grand Cru - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ILfT59JAkNTiaNcUOp35sw/o.jpg"
      }
    ],
    "user_id": "mJJj_SZff6MEWG5Vx1r8Bg"
  },
  "wHMOR1qIu1apMhEoW65VoQ": {
    "date": "3/30/2011",
    "text": "I think this place again comes under the long list of bars that just shouldnt bother trying to be a restaurant.  As a bar I like it, daytime its great to chill and it is nice being able to have a little nibble but at night the fact the tables are taken up for \"the restaurant\" just annoys me and lets be honest the food isnt that great and well its the same people as Bar Napoli, the same bar Napoli that was closed due to a small rat issue.  Now im not saying Grand Cru 100% has the same issue but its not hard to imagine.  In any case as somebody pointed out seabass for less than a 10 when your not in a tiny bistro is only ever going to go one way!!  I want to be positive about this place but they really make it kind of hard, i noticed recently lots of their regular staff disappeared and they seem to have been replaced by mindless zombies for the most part!   Having said all of this if you dont hear from me for a while please inform the police as the 'mafia' will probably have me swimmign with their seabass!!",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rl4hqDnywPJDCK4wfbXMzg"
  },
  "6KzJ3JEOQ4QrVbrrRtBxQw": {
    "date": "10/13/2010",
    "text": "Went here for lunch and loved it, and ended up coming for late night too! The food is delicious and cheap and the drinks aren't steep either. Booths are super comfy and the seating by the huge windows makes for great people-watching.  -Caprese - Great starter to share with another. Mozzarella has lots of flavor and the tomatoes are fresh. Could use a little more basil. -Steak sandwich - You pretty much get an entire steak wedged between yummy bread with a tasty bearnaise sauce in the middle. -Goat cheese & roasted pepper panini - Really nice. Not too filling and lovely flavor  This is a great late-night place with DJ playing eclectic music, stays open until at least 2 a.m., and crowd is diverse.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2dNwjr46I_ImeMgIR8ljqA"
  },
  "6KqtkGUTKs4SXiI_87izoQ": {
    "date": "7/24/2010",
    "text": "At Grand Cru I had a dining experience that was all round pretty bad but with enough Fawlty Towers-style comedy to make it enjoyable, which made giving it a score quite a tricky task.  Firstly, some of the reviewers clearly have the beer goggles on by describing it as \"posh\" or \"stylish\". On our visit the drinks menus written on a sheet of A4 paper, grubby tables hastily painted over and toilets straight out of Trainspotting suggested otherwise. All this wouldn't have mattered a jot if the standards were good. They weren't great, but there was a few saving graces in there.  The menu isn't too exciting, but quite competitively priced at about a tenner for a main course. However, some things just don't work when you charge a tenner for them and edible as E-Bot's seabass was, there was an obvious dip in quality from the many places where this fishy friend occupies the highest price bracket. Her potatoes were raw as well, which was equal parts shocking and totally hilarious.  My caesar salad was alright but lacked the anchovies it was meant to have on the menu, which were also the main reason I chose it. It was still tasty enough to gobble down every last morsel though.  A perhaps minor but notable success was that Grand Cru did dish up the best glass of Coke I think I've ever had. Served in a tall, thin, frosted glass with proper crushed ice and a bit of lime squeezed in to give it some unexpected zinginess. It did suggest that Grand Cru might be a better bar than it is a restaurant, a sentiment seemingly reflected in the other reviews.  It was disorganised, chaotic and in gastronomic terms below par, but what a way to serve up a soft drink. It's at times like this Yelp needs half stars, consider it a very low 4.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xXQTdJXPGOP-NUYctcQw8g"
  },
  "-nKveUuvNtcDvD1JkRumLQ": {
    "date": "5/7/2010",
    "text": "This place opened up with high hopes! It looked cool, it was in a cool location and the bar-staff were hot - the perfect formula right?  I came for food with my dad once - the selection was awful, we had a choice of 2 dishes and that was that - duck or chicken. Inventive! The drinks were good though, a bit expensive but good nevertheless. I had a cosmopolitan and the glass was really funky, I felt like I was a child again with a funky straw! Full of yah's though",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o0WGr8L3BWfH2Bslpnqw6g"
  },
  "2SMgkdn3eEukEyLCbtluAA": {
    "date": "7/21/2010",
    "text": "I'm surprised Grand Cru hasn't just opened as the schoolboy errors that I encountered when I popped in the other night I had just put down as teething troubles. I've never noticed Grand Cru before and I have no idea why as I'm in this part of town all the time and it's isn't exactly hidden.  I'm also surprised at reviewers describing this place as \"classy\" and \"posh\" as let's be honest people, it looks rather naff. I'm not really sure what it is then, that drew me in... as soon as I walked in and saw the hand typed bar menus I kind of wanted to walk straight back out again but the food was reasonably priced and the restaurant section seats looked pretty comfy so we decided to take a seat.  I decided to go for the seabass and Bot went for a Caesar salad, the seabass as only 9.50 so I was a little bit sceptical and wasn't hoping for too much... just as well then. From where we were sitting we could see the window for the kitchen and the staff were flapping about in there like headless chickens, in no particular rush to do anything even though the place was quite busy. For some odd reason, it seemed as though the kitchen light was on a timer as every five minutes or so the light would go out and the clueless staff were plunged into darkness and one of them had to run for the light switch. I thought I was in an episode of Fawlty Towers.   Bot's Caesar salad was made in record time and the chef sat it out for the waiting staff to collect but my seabass wasn't ready yet so we watched Bot's salad sitting there for a good 10 minutes, slowly wilting as my dinner was prepared.   We finally got our meal and tucked in, as we were both starving by this point we didn't hesitate. The meal was okay but it was what I was expecting really. I was shocked when I bit into my potatoes as they weren't cooked! You know when you cut a raw potato and it's that starchy way and looks oily? That what my potatoes were like... they were rock hard and just tasted like starch... a 12 year old boy could have cooked them better than that. Clueless. I'm just happy that I didn't get a funny tummy after the seabass but at least that was cooked okay.  Quite frankly, this place is a bit of a joke and unless you want to go somewhere for comedy value and if you're thinking about opening up a bar/restaurant then head here to see how it's NOT done. It probably doesn't deserve the one star that I'm going to give it but for raw potatoes in a meal and the wide kitchen with the clueless staff that's all I'm prepared to give it. Oh and also, we ordered a bread basket that came with the thickest cut brownish/orange most disgusting bread I've ever seen in my life and no butter.   The one star goes purely to the comfy chair that we sat on and the friendly waitress who served us who seemed to be the only person who was doing any work and seemed a bit embarrassed to be working there.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CqkdpG2tkCPQA69umlAHsA"
  },
  "XIAgAOwjc9QG5A8gKJxlng": {
    "date": "5/18/2010",
    "text": "On first glance at Grand Cru from across the street, I thought it was a posh nosh eaterie. The dark blinds and swank exterior drew me in and I realised it was more of a gastro-bar, selling beers, wines and cocktails and food, but as more of a secondary thing.  After reading the reviews on here, I'm glad I didn't have food, although we did settle into one of the cosy booths next to a starlight backdrop which was lovely. It was a Sunday afternoon so the bar was busy and tables were full of people having lunch, and the atmosphere was nice and friendly. We stayed for a couple of glasses of wine which weren't too expensive considering, and left because it was getting really busy and we wanted somewhere quieter.  Nice bar, can imagine it getting rowdy on the weekends and as for the food- I'd steer clear!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iSlyTaAnEKF3txB0keu4zQ",
        "caption": "Photo of Grand Cru - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iSlyTaAnEKF3txB0keu4zQ/o.jpg"
      }
    ],
    "user_id": "Cy1PV2TdYeDFA16mUOlr3Q"
  },
  "1BHkl79gwXu_aEXPWUEclg": {
    "date": "1/7/2009",
    "text": "Before leaving the shores of the UK, this was one of my fav bars. Good beers. Awesome chilled music. Nice range of cocktails. Decent clientele. I miss this place. Yup.",
    "rating": 4,
    "rated": {
      "funny": 10,
      "useful": 10,
      "cool": 10
    },
    "photos": [],
    "user_id": "ZeiM3Uspn6CUThUBt03JSw"
  }
}