{
  "QgON01or_p4C3e3eH1sGow": {
    "date": "8/14/2018",
    "text": "The Barrelhouse is a recent addition to the Edinburgh bar scene, previously was Jocks Lodge, a bar that was to be avoided. Now has the same owner as the highly successful Espy in Portobello. Managed by Richard and his crew, they won Bar of the year from the Star Pubs organisation (in spite of some fierce competition from the other 500 bars in the group) who are their landlords. The pub is a slightly quirky addition to the Edinburgh pub scene, with a solid real ale selection, and some great whiskies and gins. The menu is a diverse and changes regularly. Well worth checking out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4OqNZACU-HxzidBEEj2-uQ",
        "caption": "Photo of Barrelhouse Bar and Grill - Edinburgh, United Kingdom. The menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4OqNZACU-HxzidBEEj2-uQ/o.jpg"
      }
    ],
    "user_id": "eBVFtdxqTGdogezZ98HUsQ"
  },
  "tLEwjKWDGfh6khVGfomNww": {
    "date": "1/7/2017",
    "text": "Wow! I know it's not fair to credit somewhere because of inadequacies of its predecessors but Barrelhouse deserves lots of credit for taking on the poison chalice of the infamous Jock's Lodge, nightmare mafia pub. So now we have a cool southern US style BBQ joint which does great food with excellent service. Big portions - wings, burgers, etc - at a reasonable cost (burger 8). Kids options (3). Reasonable beers. Decent coffee. No wi-fi as yet and cash only but BT is promised to be booked in. Loved it here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uUVN8cDbtrMwkkDjIYmESQ",
        "caption": "Photo of Barrelhouse Bar and Grill - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uUVN8cDbtrMwkkDjIYmESQ/o.jpg"
      },
      {
        "img_id": "mGlD584lfydeumjFkkULJw",
        "caption": "Photo of Barrelhouse Bar and Grill - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mGlD584lfydeumjFkkULJw/o.jpg"
      }
    ],
    "user_id": "9y8q3wSNJKkk3zDj67w1WA"
  },
  "VQ_bIrtA-rvbnBIm7gPNoA": {
    "date": "7/9/2018",
    "text": "We showed up a little late after our quick fix across the street turned out to be closed already.  We were actually a little after kitchen hours, but the bartender managed to sneak our orders in and the kitchen was awesome and took care of us.  We both ordered burgers.  Mine was the Espy burger, which was a fantastic blend of sweet and spicy, and hot off the grill.  The fries were skinny and reminded me of In 'n Out back home.  Whatever she got (I honestly don't remember now) she also loved.  Together with an ale out of the cask, the meal was great.  We'll definitely be back before we leave town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tc0vDnkUavpKBnKdCK4oPA"
  },
  "PpZAx1yU3UH7Hi6bpK_nhA": {
    "date": "10/8/2017",
    "text": "Felt like this place deserved a follow up review after the first one being quite soon after it opened. The barrelhouse is an absolute treat of an alternative hang out spot! The food isn't literally mind-blowing, but it's all very well seasoned, tasty, and well-priced. It's all sort of American diner style, and we had ribs and burgers that were really nice. What really got me was the interior! The restaurant is decorated in a sort of swamp, grunge style, with exposed filament bulbs, and corrugated iron. My pictures don't do it justice, but it really gas a very great atmosphere, quick service, friendly staff, and an all round great funky place!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "o-S8kgbvNuDaiaCKKRPgLg",
        "caption": "Photo of Barrelhouse Bar and Grill - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/o-S8kgbvNuDaiaCKKRPgLg/o.jpg"
      },
      {
        "img_id": "IpkFEcS0f3sye5DwWWtMcA",
        "caption": "Photo of Barrelhouse Bar and Grill - Edinburgh, United Kingdom. Pulled pork burger",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IpkFEcS0f3sye5DwWWtMcA/o.jpg"
      },
      {
        "img_id": "FRZbuGrXLbNgbnYJTXGswQ",
        "caption": "Photo of Barrelhouse Bar and Grill - Edinburgh, United Kingdom. Ribs",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FRZbuGrXLbNgbnYJTXGswQ/o.jpg"
      }
    ],
    "user_id": "Z4DchkjSCxqdZxZO_WDEPg"
  }
}