{
  "T3G1jLBfreoJN6jJTV445Q": {
    "date": "4/23/2008",
    "text": "Not always an obvious choice but if you ever get the chance to experience a night out in Gay Town then grab it with both hands and get yourself down to CC Blooms!   Perfect if your guilty pleasures include bad dancing, getting drunk, euro pop and being completely fabulous! Regardless of your sexuality, CC's is a top night out.   The top bar is a casual affair with seats and a long bar that gives way to mini dancefloor. Venture downstairs and you are in for a treat! A big dancefloor with mirrored walls make it the only time its okay to grind yourself between 2 men and not be deemed a slut.   Expect average priced drinks with an emphasis on Smirnoff Ices and Midori. Perhaps a little daunting to those unfamiliar with the whole gay scene as it's not uncommon to see ladies participating in foreplay with each other at the bar or even worse, in the loo's. But if your pretty unshockable and think we're all just people then you'll have a riot.   Just watch out for the tokenistic straight guy enjoying the lesbian action a bit too much!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MSdbKDWQYc_okF1wwply2w",
        "caption": "Photo of CC Blooms - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MSdbKDWQYc_okF1wwply2w/o.jpg"
      }
    ],
    "user_id": "EZ-5oUOinc0aKp7j3LpPkA"
  },
  "sADc9n09kZmsYXO8aQRhqA": {
    "date": "1/23/2012",
    "text": "Met a group of friends here for a few drinks. It was a busy night with everyone seemingly having a good time.   Door staff seemed pleasant enough, if somewhat disinterested. Service at the bar, once you could push your way past some very drunk and obnoxious lesbians, was quick but somewhat curt. A smile wouldn't go a miss. Drinks were reasonable with some decent offers on the go. Sounding good so far??  A fight broke out....4 or 5 lesbians..The security staff were really quick to handle the fracas and looked to be well in control. However, moments later we were asked to leave. No reason given, just leave! I asked why were we being ejected and was told to shut the f--k up and get out if I knew what was good for me.  I have never known anything like this in my life. We were standing having drinks and chatting then were suddenly set upon by these security personnel. Mistaken identity or what and despite our protestations, we were ejected from the venue.  Summing up, unless you want to go to a venue crammed full of Hens, that think its cool to go Gay for the night, or want to be in the company of some really chav lesbians who bump and push their way through the venue, then this is one place that needs a wide berth. It is embarrassing to describe here as a Gay establishment. Maybe years ago under different ownership, but not today!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 8,
      "cool": 0
    },
    "photos": [],
    "user_id": "F5_iRtLHvbNcc84AGQxT3A"
  },
  "fWkr9ZGqqa_-m2x4IbCyhw": {
    "date": "6/29/2010",
    "text": "Since I'm not really big on the Edinburgh clubbing scene, I didn't actually realise CC Blooms was a gay venue, which doesn't bother me in the slightest, but was a bit of a surprise when I walked in to be met with two incredibly crudely dressed gals snogging the whole face off of each other. Never nice, regardless of gender or sexuality.  I was here on one of the first nights of Deviation, a rock, pop and grunge night which was actually really good. It wasn't really busy but not empty either, and after about an hour of sipping some reasonably priced voddys I thought I was a bit Madonna-esque and drew quite a crowd of admirers.   It was a great night out although since I've been I have been met with many glares of 'Eh??' because I think it gets a bit of a bad rep, but I liked it!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "O2lfegrnXLeuw5a98ja7_g",
        "caption": "Photo of CC Blooms - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/O2lfegrnXLeuw5a98ja7_g/o.jpg"
      }
    ],
    "user_id": "Cy1PV2TdYeDFA16mUOlr3Q"
  },
  "KD6IpEseWt7cWyyMV5yOWg": {
    "date": "3/23/2012",
    "text": "Ok, it's free to get in, but they should be PAYING people to step into this cesspit. Overpriced and full of clowns looking for sex  or people who, quite frankly, have no taste when it comes to the venues they frequent for a night out. There is a funny stench too, a bit like a combination of sweat and bleach. Eugh.The decor has been the same for about 13 years (and probably longer?). Tacky mirrors on the walls and checkered floors just like the film  The Shining. And then there are the creepy straight couples looking to pick up any lesbian who is remotely attractive  which is few and far between in CCs. Interms of Gay Clubbing in Edinburgh, CC's is a total embarrassment.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xYmJTCC4GowUQRsn-q0ZvA"
  },
  "2nw4KWH5AQTT3oaUFFFr2g": {
    "date": "6/18/2012",
    "text": "I think it's a very good club, staff are really friendly and door staff are nice too . I have to say the dj's are great they always play good music. They have just done up the top floor and oh my looks amazing. They have put a lot of effort into it! It's a great night out.  I really do recommend going in to have a look!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KgvHCLOdnu5lRTvUntNL6g"
  },
  "rD5KItUqczUGdz4qw5Odaw": {
    "date": "4/27/2008",
    "text": "CC Blooms is the centrepiece of the cluster of gay-friendly pubs and clubs at the top of Leith Walk. Its simply the best of the bunch when it comes to pulsating, pheromone-drenched late night fun.   If you manage to get in (I tried three times before the brusque and baldy bouncer finally believed that I wasn't off my rocker on something or other), find a quiet spot to dump your stuff and hit the dance floor.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hnzGNcqwSZ60nkZRytlubg"
  },
  "E11LqxkvAJHe1_95x3xp7Q": {
    "date": "5/3/2008",
    "text": "This long standing Gay bar cum nightclub boasts two bars on two floors at the top of Leith walk, a few doors down from the Playhouse Theatre. Can be very busy at weekends when the crowds come out of the other local bars, it can be busy during the week also but not packed. There are regular Karaoke evenings and other events and promotions. The clientele is as mixed as the music. They do not sell food!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "25vWgsIA4HMx9Ep-TSbdOw"
  },
  "cUdlb2cb2-t93E-rXDo6rQ": {
    "date": "6/10/2009",
    "text": "I have to be honest, I'm not really not a fan of this bar.   It's crowded, stinks of a mixture of fags, sweat and alcohol and tends to attract the most outrageous and sometimes perverted clientele.   However, the prices aren't particularly anymore expensive than anywhere else. If you like bright, neon-like colours that are most likely hazardous to your health - then maybe this is your idea of a night out on the scene.   Certainly outrageous but that doesn't necessarily con notate with good or worthwhile.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gHu5JGBUdzED3-cezIJnlg"
  },
  "WPhn2DV7fFIoDgpjoifTzg": {
    "date": "4/11/2011",
    "text": "Horrible place with rude guys at the door...  I was dancing with my friend and they invited me to leave the place because I was \"drunk\".... lol I was just dancing and the idiot took me from my arm and took me outside... What is that attitude?",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nxAXdto1kTzzqUzGgw2SSQ"
  },
  "M4yF-IVP-Fji3z_BLpnqEQ": {
    "date": "3/3/2011",
    "text": "Went here with some friends of both sexes and danced the night away. The staff are friendly and the place is really wild. Drinks are cheap and everythings ship shape quite thourghly enjoyed myself",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bdis9i7u4yENsHYCEpw-qQ"
  },
  "XxS0ksX21-SZpaywEJaQtQ": {
    "date": "6/12/2012",
    "text": "The CC Blooms that all the previous comments (mostly out-dated might I add) refer to is a thing of the past! Its just went through a massive refurbishment and turned into one of the most stylish bars in Edinburgh! Door staff are effiencient and do their job really well! Bar staff are friendly and the music is great as always!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sENs0_7KcBajPTwHJ8co0g"
  },
  "b8a8wlTOrHtCOFxL4p6LdA": {
    "date": "12/29/2008",
    "text": "Oh lord. Tragic is definitely one way of describing CCs. This is the sort of place you only drag yourself into when you are VERY drunk/other establishments are on fire. Good for a laugh, in that you can stand and laugh at all the elderly gay gentlement cruising for toy boys. And at the drinks prices, which are normally ridiculous. Like the plague, it is best to avoid this one.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GbrjLXBt14r_5QxJh25U_Q"
  },
  "z4GjMfFNMWPzK42WnR6Ppg": {
    "date": "4/28/2009",
    "text": "This place is wicked.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hV-30pXW_f37xj0fm6idxQ"
  },
  "kg1MAd0srfzCKcwIm2b-Ng": {
    "date": "6/2/2009",
    "text": "This place is pretty dire. Generally overcrowded, you usually have to queue to get down stairs. The drinks are overpriced. Most of the staff have an attitude problem. There's not a great deal of room, it's usually too hot. It's full of far too many exhibitionists doing things that one should not be doing in the middle of a dancefloor. If I wanted to see that I would have either stayed home and rented some porn or booked a flight to Amsterdam. Steer clear, there are so many better places to go.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kSeIojPeRy6nqSalkPEUog"
  },
  "c30mFIuZLuacWkWzqVfCPQ": {
    "date": "6/17/2008",
    "text": "ok its True the times i've been here have usually been preceeded by a few drinks.but i must say the mirrors everywhere put me in a bad mood.not because i looked a state but because it lends a rather alice in wonderland weirdness to an already strange arrangment of space. more than once i almost walked into a wall, a couple of times i waved at friends on the other dancefloor, when they were in fact behind me(!) and the cloakroom was full so several of our party had to haul our coats, scarves, and bags around with us. maybe if you get there early, don't have much to drink and leave before it gets too crowded its a better experience.but i doubt it",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mJM9uvrQ0q1nrSn1xRbHQQ"
  },
  "ity3u4u8e8ESYKa8f2bwUg": {
    "date": "7/29/2016",
    "text": "Fairly recently refurbished, I've been here on two occasions, the first time completely unaware that it's rather a fab gay bar.   The first time, I was here for a pre-show dinner, not actually for the play house, which is right next door and super convenient, but for a cabaret of Missy Malone's at the Voodoo rooms. We both had haggis, neeps, and tatties, all together in a tin, and it was perfectly adequate, simple food.   The second time, was after I'd already managed to fall asleep in Jekyll and Hyde, yep, my friend had insisted the night carried on, and you know what, This place totally re-filled me with energy, small dance floor, full bar, well stocked, great crowd, cheesy music.  Beautifully un-judgemental place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PIqgaeMSEh7i0AmFgtCYOA"
  },
  "_8RiEqrRHf3-0GhFJ-X4Rw": {
    "date": "5/22/2019",
    "text": "horrible. lot of bad attitude. pass on this place if you want passive aggression, subpar service and to feel the most unwelcomed. find it all here full disclaimer: 1st yelp review ever",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-0t4gt_cgmHDpsd9odCgbQ"
  },
  "Vl1QJkMiidotSyJH2WXI-g": {
    "date": "9/17/2018",
    "text": "I went here tonight or tried to have a night cap from a long day of traveling. I spent 14 hours on the road traveling and got to my hotel at 11 PM. Had a few drinks at my hotel bar and decided to go have a few more at a non crowded place but was turned away because the bouncer said I was stumbling and had to much to drink. I explained I had been on the road all day(completely sober) and he was wrong but he didn't care. Don't ever go here. I guess they don't like tourist.  I never write bad reviews but this I can't let go.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DPm_y5J8x4friuFgnMvkOw"
  },
  "Y79NBM8F46p4Y219zlZ2aw": {
    "date": "9/30/2017",
    "text": "Avoid this place like the plague. THIS PLACE EXCLUDES black people or anyone with a dark skin tone. This is the most racist club or should I say the security guards they have screening people entering are extremely racist. When I attempted to enter one of the security guards said \" I think you better find somewhere else to go tonight\". In other ways he told me to get lost. I was dressed the same way as everyone else, the only exception is that the people who were being let in were WHITE. I know this because I was observing the people entering before I even approached the entrance. Such a disappointment. Save your money and spend it elsewhere.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "IzDJhRaWkW7xtW0ray1bKw"
  },
  "8eAuybwzcOsVoTtw0s34Kw": {
    "date": "4/8/2015",
    "text": "This place has undergone a bit of a facelift, at least upstairs, since I was last in a few years ago. Has it lost some of its charm in the process? Possibly (charm's maybe not even quite the right word for it) but you'd maybe have to ask a regular or pay it a visit later in the night which is when it used to come into its own.  All that aside it remains a decent enough bar for a few drinks any night of the week.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "txzOZrHK9EVY0kYjSuXkKg"
  },
  "5WCzzV8OAX4zRG5nJltvlw": {
    "date": "10/25/2015",
    "text": "I wanted to dance and not pay to get in a club so CCs is always a good choice on a Friday or Saturday night. The music is current top 40 and you can dance your ass off until 3 am. The place can get crowded but there are 2 floors so you can move around the place of it gets crowded. The front are of the club has seats but it's way too loud to chat and lounge so you should just get up and dance when you're here.   The cocktails are pricey... About 4-6 depending on what you get but at least they don't charge you to pay with your card. They recently renovated the place and while I think it looks smaller now, it does look much nicer than before. There's a coat check but for 2 (last time I did it) I'd prefer to just chuck my coat in the corner while I dance. It's a restaurant during the day but truthfully I've never been interested to try their food... So this is just my go to place when I wanna dance which usually is every weekend... Ha!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "LMkFulPXQHRGMAaJSPUyVg"
  },
  "9OyXuKhwxn_yHHsb7wXnSA": {
    "date": "3/15/2016",
    "text": "Wow! I hadn't been in here for years! I wouldn't recognise the place ( even with or without beer goggles)  I went in to watch a friend perform in Wig Wars hosted at the Rabbit Hole. While I was waiting for sound checks etc I sampled the excellent food, chicken skewers, fantabulous mac cheese  ( good inch of cheese on top) and a lovely pitcher of Pimms.  When I used to frequent ccs I wouldnt have been capable of eating!  Great venue with great fun nights on, good food, cocktails, what more could you want? ( except for my podium back) xx",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1otkilxTrHF6Z1vdrrlZrQ"
  },
  "IZtI65SyUiAKb6PguMdmdA": {
    "date": "1/7/2017",
    "text": "I stopped in on a random weeknight for drinks. The vibe is fun and the bartender got sassy when I didn't take his drink recommendation initially. He also presumed I'd like sweet drinks on the basis of my gender, which isn't a huge offense.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s1mD1PvJQrAYHfNG9UDYJw"
  },
  "cIWZUXoqVweriItt8knJ2w": {
    "date": "8/31/2015",
    "text": "This review spans a few years.   2012 I fell in love with CC's. It was fun, busy group of friends laughing, dancing and the drink weren't too pricey.   Not much has changed. We came here in bank holiday Sunday.. I thin that's important because it's not your average Sunday. It was dead. DEAD I TELL YOU.   We left at about 3.30 a tad disappointed. The staff was lovely and the music was up to up to date. Was just a shame for a Sunday's bank holiday, I wonder if we hadn't gotten the invitation to the real party.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BMEv94gBZZUsJtIyz_Htng"
  },
  "w03GUMt_Jb1VeT8uEixHow": {
    "date": "12/31/2015",
    "text": "Went here with friends on new year as was told was gay friendly.   Got told one of your friends was \"too drunk \" (he had had 2 drinks that night and was totally sober) and we're not allowed in. Bouncers were rude und unfriendly when we tried to ask why  and what would happen to the table we booked and had paid for.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "IcmxmtviTwP73paWDvAmUw"
  },
  "avPWaLDwl7yJ8bOfzzqFwA": {
    "date": "11/18/2013",
    "text": "CC Blooms, besides its main function as a host of scene club nights, is practically next door to the Playhouse and therefore ideally situated to serve a pre-show dinner menu to musical theatre enthusiasts. I'm aware that later in the evening it becomes an altogether different affair but since it also puts itself out there offering a pre-show dinner option we went for it. At 8 for two courses, how could we refuse?  After I'd surprised my brother by waving a ticket to the Lion King in his face - thereby placing myself strongly in the running for the Sister Of The Year award - we decided to hop along there early and toast my award nomination with dinner. And, friends, it grieves me to report a slight fault in the proceedings...  The seriously cheap dinner deal offered on the blackboard outside was what had tempted us in, and the carrot and coriander soup starter was, admittedly, decent enough, served in a sweet little pot with nice bread on the side. However, it all fell apart when the mains arrived. I had spinach and ricotta ravioli, which normally gets me very excited  - but alas, I found that it was little different from something I could have bought from Tesco and blasted to temperature in my own miniature domestic radiation chamber. The waiter appeared little more energised by the whole process than the poor old pasta did and I can't blame him as the place was almost completely dead. Those of you who read my reviews frequently will know to fling your hands up in dramatic sympathy when I say this: we didn't stick around for dessert. *sigh* Yes, that Sister award might be slipping through my fingers...  I'm sure this place is mighty fine at its primary objective, but they've got a nice place and a great location and so they could be doing a lot more to make the most of opportunities earlier in the evening.  Closing irrelevant-yet-interesting fact: it's named for Bette Midler's character in Beaches, Cecilia Carol Bloom. Did you ever know..?",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "bcxcQhp0sKYd9eUnEVUzPA"
  },
  "kctMPiEXLDUHePFxN17tUw": {
    "date": "9/9/2015",
    "text": "Pleasant enough pop place with a generally kind staff. No complaints. Edinburgh doesn't have the largest gay scene, so one should be thankful for any establishment that caters.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JjimMxHoJOkpWXe43NDckw"
  },
  "Uze9MJOFjvE3GvHNhJvBRg": {
    "date": "3/2/2017",
    "text": "CC Blooms bouncers are complete wankers especially the fat bald one. Avoid this place. Staffed by morons. Crap service. Arrogant twats",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qr-U63s-Hip0WPEIDEeWpA"
  },
  "v9p13puIF-Ny961mV7WuhA": {
    "date": "3/24/2013",
    "text": "Went in for a pre-theatre dinner and had the haggis, which was excellent. Staff were friendly and I'd certainly recommend CC Blooms for the food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "fZPQuXhqBGozLV8C5CdLuA",
        "caption": "Photo of CC Blooms - Edinburgh, United Kingdom. Haggis , neeps and tatties",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fZPQuXhqBGozLV8C5CdLuA/o.jpg"
      }
    ],
    "user_id": "kYw-rhxxm5k5tCt4Z5kyjA"
  },
  "DnRwKND-6R8g5mBAKVaI-Q": {
    "date": "10/20/2012",
    "text": "While visiting from the US we stopped in for a few drinks - and were ignored. The bar was virtually empty, maybe 8 guests but it was early. We walked in, I said hello to the male bartender, he made complete eye contact and turned his back on us so we sat at a table. I finally had to walk up and ask the female bartender if they had table service or if we ordered from the bar.   Not a friendly lot, really - and pretentious for no reason. I'll gladly spend my cash elsewhere during my stay in Edinburgh and would discourage other tourists from bothering to stop in here...unless you like being ignored and treated like a bother",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "UaXMvIfb1XEZu8sfbdn4Ew"
  },
  "Rt73XJ5rj6_KgiZ_5w9tLA": {
    "date": "7/19/2014",
    "text": "This is a great place to just sit and chat with a friend.  Yes, its known to be a gay bar, but so what.  Sit upstairs and look down at the people passing by.  I've seen many a beautiful snow fall from that window with straight friends.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "PWaCUSVZMiXi91RO8c_e-g"
  },
  "vZY-UF_Cv03HPTifho7XnA": {
    "date": "4/15/2010",
    "text": "I'll tell you what, butch lesbians don't find drunk straight girls funny. Especially if you're trying to pull them, not as a joke but you get carried away and think that this free-for-all place also applies to you. It doesn't. But then again, I learned recently that LGBT is nothing to do with Lothian Buses.. Who knew?! Well I should because I used to work in a gay bar and CC's is where me and my (mainly gay) work pals used to hang out.  You have a good night but it's rather dimly lit so you can't seem to remember anything because of it, you really have no vision even if you weren't drunk. You come out smelling of sweat and resentment that gay people seem to be able to party a lot harder. Regardless of good nights had, it's a bit grim, the floor's sticky, the mirrored wall let's you see things you wish you hadn't and as the gay community in Edinburgh isn't as big as Broughton Street lets you believe, so you can feel a bit out the loop - All hetrosexual girls may want a homosexual friend, but cockblocking them in their clubs sometime's isn't the best way for us to go about it.",
    "rating": 3,
    "rated": {
      "funny": 6,
      "useful": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "tiCyWICi2AXiUK0RfOPtzA",
        "caption": "Photo of CC Blooms - Edinburgh, United Kingdom. photo from official website",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tiCyWICi2AXiUK0RfOPtzA/o.jpg"
      },
      {
        "img_id": "cAIIsVrYIlBm8M4HHKqOrA",
        "caption": "Photo of CC Blooms - Edinburgh, United Kingdom. photo from official website",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cAIIsVrYIlBm8M4HHKqOrA/o.jpg"
      }
    ],
    "user_id": "rJi2YPK6uj4FtE8R7OFQcA"
  },
  "li4O0dZ073VBtITOXkPpUA": {
    "date": "10/17/2014",
    "text": "This restaurant/bar is 2 doors down from the Playhouse in Edinburgh.  I had seen it on the internet but as it was not doing any \"deals\" didn't pay much attention. Mistake.  The lighting is just right with well spaced tables at the front, booths across from the bar and funky stools and tables at the back. It is clearly a gay bar but not in your face and certainly not important. Got there at 12.30 and no one hassled us as we ate our slow way through the meal.  My friend has a throat difficulty and is a very, very slow eater but we were never made to feel we were taking up space they could use. Service did get a trifle slow as it filled up, mostly with people going to see Jersey Boys and needing food quickly but staff were buzzing about doing their best.  Suited us as we had made sure we had plenty of time and needed space between courses. The Pre Theatre 2 courses for 8 and 3 courses for 9 was ideal with lots of choices and good portions.  Soup was Tomato and Basil with a lovely thick slice of bloomer type bread and butter, followed by lasagne with garlic bread. The Aberdeen Angus lasagne had less meat than I usually like but lovely nonetheless and piping hot.    Friend had Red Thai chicken skewers with a fresh piece of lime and sweet chilli sauce, followed by Spinach and Ricotta Ravioli with garlic bread.  The plate was cold so the food cooled very quickly but was immediately taken away and heated with a smile and an apology. Friend managed a piece of Red Velvet Cake (baked fresh daily by the owner's sister) which had been saved for her when she noticed it was the last piece.  She asked for pouring cream and that was no problem.  I had a tiny piece and because it was cherry it was ok.  Friend was drooling over hers. Cappuccino and a latte and a small glass of baby jelly beans to finish.  Lovely touch. We really liked this place and our waiter, Brooke, was a joy.  Seems we amused him too which was nice to hear. Will return and recommend it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "04w5svrdxExF986GjMIecA"
  },
  "4ZYn1wC4yFt1jBvBAyf1qw": {
    "date": "7/31/2010",
    "text": "There's a lot to be said for the theory that gay bars are a straight girl's best friend. You can go out, wear what you want and dance with your friends without getting perved on by leery blokes. Brilliant. And the gay women can tell pretty much immediately that you're straight and so don't try and chat you up either. Either that, or none of them fancied us. Whichever the reason, I had a really goo night when I came for a friend's birthday to CC Bloom's.  I'm not sure I'd like it so much if I were to come here on a regular basis, as I think you'd probably start to be bothered by the fact that you're in such a minority and so might feel out of place. And let's be honest, although we girls whinge about guys pestering us in more 'straight' clubs like those on George Sreet, every now and then we all secretly love it!  But for a one-off random night out every once in a while, I'd definitely recommend this place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "R7Ykkz8euVtHTN3QAszPHQ",
        "caption": "Photo of CC Blooms - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/R7Ykkz8euVtHTN3QAszPHQ/o.jpg"
      }
    ],
    "user_id": "oEshN5oq98_g23MvEnRc5A"
  },
  "3dbWQ77GpRY_a3PMDZz6Qw": {
    "date": "10/18/2010",
    "text": "All the reviews so far have been by straight girls. So I thought I'd try to redress the balance.  I come not to praise CCs, but to right a few errors. Stephanie said she didn't realise it was a gay bar. Situated in the heart of Edinburgh's gay district this place doesn't look gay, it screams gay in your face til your eyes go rainbow.   Also apologies for gay couples snogging so openly inside a gay club, but you can experience much worse in CCs and I have. This is a cheesy, trashy place, you go after having been to several other places. It can be a bad idea at the end of the night or a good idea that is very much the beginning of the night.  There's no cover charge, the drinks prices aren't bad for a club, but don't spend too long at the bar there's no great selection and you really need to get on one of the two dance floors and start making eye contact or avoiding it. It is it's own worst enemy as since meeting someone there last year, we've barely been back.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tI5jVZ1CGZr2tLt1cwGZ5g"
  }
}