{
  "bU3p2XGBMJXli4xl_ljVfg": {
    "date": "2/25/2011",
    "text": "Whighams is a lovely place to enjoy a glass of wine with friends. Very atmospheric and can be quite busy on a Friday night. The food is also tasty; I popped in for lunch one Monday and the food came out really quickly, which is always good when you have an office to rush back to.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xwJgGjg_GAMvd5HyO1Ajrg"
  },
  "1L96h-oLC37PGhoWIlLOrw": {
    "date": "11/17/2008",
    "text": "This has an excellent, wide selection of wines and it's clear they're more about the wine than about being a trendy place. That's not to say they aren't atmospheric and chic; just that they clearly get wines in for wine lovers. The brick walls and cosy nooks also mean this is a great place to hang out. Really good fun especially if you're a wine connoisseur.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RwxLNxhp3N0-FssSwDizUA"
  },
  "-PXxt5PuInsrOOEna86n0Q": {
    "date": "12/10/2007",
    "text": "Whighams has many points in its favour- great atmosphere, a good location, and an excellent menu. There's nothing quite so cosy as sitting in its alcoves with a glass of wine or dinner, staff are friendly and the service quick even at a busy time of night. Surprisingly for such a chic bar prices are also very reasonable. I went with my parents but would recommend it as a nice place to take a date.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o-vbyifa4Sqah7BM5ty3wA"
  },
  "7f-klt6ubFgsz-Yfq1nyKA": {
    "date": "8/17/2019",
    "text": "Whighams was recommended by the concierge at the Sheraton Grand as a spot less frequented by tourists with a chill vibe and a solid selection of whiskeys.   Whighams lived up to its billing. A nice chill venue off the beaten path with a good number of locals. The staff was incredibly friendly. They were also quite knowledgeable when it came to selecting a proper whiskey. Overall a great choice for a chill evening and I would certainly go back",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "ezV_V7mj-KIti9j9GuijBA",
        "caption": "Photo of Whighams Wine Cellars - Edinburgh, United Kingdom. Whisky list",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ezV_V7mj-KIti9j9GuijBA/o.jpg"
      },
      {
        "img_id": "nQ1w1DFafj-KiG82wsIpeg",
        "caption": "Photo of Whighams Wine Cellars - Edinburgh, United Kingdom. Time for a Scotch Whisky  tasting",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nQ1w1DFafj-KiG82wsIpeg/o.jpg"
      }
    ],
    "user_id": "X9LT66H7NosO9MOSm_qt8A"
  },
  "CjLpg_gw2tu6r-IwJ6tlxg": {
    "date": "7/27/2019",
    "text": "Wonderful food, warm atmosphere, lovely drinks.  Locals brought us here for dinner while we were visiting and we had a fantastic dinner.  The wine cellar tables allow for great conversation.  The food - amazing!  Our whole party loved their meals; but I had the Skink soup which was delicious, as was the smoked salmon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vYn0pkwxgYPt6JJhSHtAjg"
  },
  "QfXhoSRTRQwrG1FVVtMG-w": {
    "date": "7/1/2016",
    "text": "This place is awesome!!! When I made the reservation, I requested a table near the stage for Sunday Jazz night. When we got there, the waitress sat us in front of the stage. We could not have asked for a better table. Our reservation was for 7:45 and the band was setting up when we got there. They started playing at exactly 8pm.   What a night we had! The evening was filled with wonderful live jazz and delicious food & drinks. My husband and I started by sharing the seafood platter. Holy cow! We were visiting from Boston, Massachusetts and we know our seafood. Whigham's seafood platter was amazing! The most delicious, sweet oysters and clams we've ever had. The Langoustine......Oh my god, I could've had 20 more! For entrees, we both ordered prawn linguine. Previous to ordering, I mentioned to the waitress that I didn't like spicy food. She told us that the sauce was pre-made and it would be a little spicy, but she would give me a little ramekin of some sort of white cream sauce to mix my pasta with. To be honest, I was skeptical about this, but it worked! By mixing that cream sauce to my linguine, it made it into a vodka cream sauce (without the vodka) and lessen the spiciness. It was pretty darn good.   We had a couple of different servers and both were professional & attentive. The Jazz band was superb! The singer was this young woman, and she had this voice that sounded like smooth vintage wine. If you're planning on dining here and you love jazz, make your reservation on the nights they have live jazz night. You won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "WnLOiB5jfbrXraxHP1KomQ",
        "caption": "Photo of Whighams Wine Cellars - Edinburgh, United Kingdom. Sunday night jazz.....good times!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WnLOiB5jfbrXraxHP1KomQ/o.jpg"
      }
    ],
    "user_id": "FtTwsdIffvlrkoqnDtpLTQ"
  },
  "C6BEoeXbqbTYKOrSuFE7Bw": {
    "date": "11/6/2017",
    "text": "Very disappointed it has to be said. Whighams was recommended by a friend visiting Edinburgh and the Yelp reviews are uniformly positive. The restaurant itself is both spacious and cozy, even on a miserable October night with driving rain sending us scurrying along the roadway. Calm reigned inside which we decided to embrace along with a glass of a very nice Pinot Noir which was so good we upgraded to a bottle. However, the food was another story. My calamari starter was chewy and overcooked to the point of caramelised, brown batter. My 1/2 lobster main was nice enough, or would have been except the only meat retrievable was in the shell. Possibly because of how it had been 'halved', all of the meat in the rest of the unfortunate, and now late, lobster had seemingly migrated to the other half. In any event, there was only a mouthful or two in the entire meal. My other half fared better but I left hungry. A pity.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UN-BdnKr6coBVxCyndY1Qw"
  },
  "Cdl761rqzo8JhatinzlCkg": {
    "date": "8/21/2015",
    "text": "This restaurant / wine bar is very conveniently located in the West End / Princes street.  Easy to get to.   we reserved a table of 7 people. This was a Saturday and they were fully booked - so 9 pm was the earliest we could sit down that day.   This place is a fish food haven, loads of varieties of different kinds of fish and seafood dishes. Less so on the meat and vegetarian options.  Starter for me was grilled langoustines, conveniently cut open already and long lobster forks provided.    Out of the 7 of us we had 4 steaks for mains. I have to say that those were very well prepared, Mine actually came a little later as I ordered a meat gravy in addition, and I am pleased they accommodated that request. It is a little pricy, but the quality of the food and service reflect this.   I'd be happy to return here.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "u_catrJuWvm-aec2LVrWuQ",
        "caption": "Photo of Whighams Wine Cellars - Edinburgh, United Kingdom. Full house",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/u_catrJuWvm-aec2LVrWuQ/o.jpg"
      }
    ],
    "user_id": "fKi8ZF3xpJJkgSusRubeMA"
  },
  "os_NNJB1jmoFHmly09ZQvA": {
    "date": "6/3/2015",
    "text": "If you're cooked when it comes to traditional Scottish pubs and want to try a wine bar with tapas, here's a hint: Read my review.  It's in a basement, where it's very dark and cozy and romantic.  Bring a date...bring a couple of dates...bring lots and lots of dates.  I think the vibe is still chill enough for you to also bark it up with your pals.  I saw crews in here, cold yappin.  The bartenders are accommodating and cute as hell.   As for the wine (Rioja - Spain), it was mad cheap and tasty, the prawns and crayfish were deelish and the toffee dessert, ohfuhfuckssake...just lovely.  Lovely.  One more time, lovely.",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "BBaud_GoyLLjZdyKFhmmTA",
        "caption": "Photo of Whighams Wine Cellars - Edinburgh, United Kingdom. All I need in this life of sin, is me and my next ex-girlfriend.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BBaud_GoyLLjZdyKFhmmTA/o.jpg"
      },
      {
        "img_id": "I-spLRNVeQM2i-XFWQn2IQ",
        "caption": "Photo of Whighams Wine Cellars - Edinburgh, United Kingdom. Mmmmmmm",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/I-spLRNVeQM2i-XFWQn2IQ/o.jpg"
      },
      {
        "img_id": "Wy7wbnlt7RaxvkeUT15vZw",
        "caption": "Photo of Whighams Wine Cellars - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Wy7wbnlt7RaxvkeUT15vZw/o.jpg"
      }
    ],
    "user_id": "Yjer78RnYr7OCzirgdcOaw"
  },
  "Ni161r3XITyogxZEO2iLwA": {
    "date": "3/23/2012",
    "text": "A local institution, here for over 20 years, literally in a wine cellar, good food, and a massive wine selection.  Well worth checking out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eBVFtdxqTGdogezZ98HUsQ"
  },
  "adjNx0pETWL1Z0OQ1Cwemg": {
    "date": "4/20/2016",
    "text": "Great atmosphere, wine, oysters, WiFi, and friendly service. Whighams is always a treat!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MFI6uRd-qFDXvqtlhgaFYA",
        "caption": "Photo of Whighams Wine Cellars - Edinburgh, United Kingdom. Wine and oysters in the home town.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MFI6uRd-qFDXvqtlhgaFYA/o.jpg"
      }
    ],
    "user_id": "qwxDAe1Xa5D4bqdC88xRLQ"
  },
  "ZujPcujrUd12Y5PmlpbWlA": {
    "date": "12/27/2016",
    "text": "Went for dinner. The food was not very good. My boyfriend had he fish cakes and I had the fish and chips and we started with the olive and cheese plate. The bread was stale. The fish and chips and fish cakes both tasted very fishy in a bad way and tasted like frozen food that was reheated. The only redeeming quality was that it was pretty cheap and the service was decent.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dFe7Y0_6G5c-3VjWLfIcRQ"
  },
  "jn14VyODw7bhrNRD9tsyEw": {
    "date": "11/8/2012",
    "text": "This was a return visit to Whighams, though neither of us had a clear memory of the first occasion. Not sure if that implied that we hadn't had a good time, or if it was that we'd had too good a time.   The place was pleasantly buzzing, with quite attentive service. The bread was delivered while we considered the menu, and I'm afraid it was somewhat dull and lacking in flavour. Slightly disappointing, but the fairly reasonable prices for wine were encouraging us to a more positive view.   S had the fish pie, which was scrumptious, with lots of fish and accompanied by a good serving of mash and peas. Hot plates too, which is a particular obsession of mine.   I had the special of Coley with a herb crust and veloute sauce. The fish was delicious, almost but not quite under-cooked and very fresh tasting. The sauce was nice enough, but I would have preferred it on the side as it diminished the crunchy texture of the crust. The veg was green beans, and I don't think they could have been better cooked (assuming that you don't like them blanched and soggy the way your mother used to make them).   S finished with the cheese, and an excellent chutney. Not a huge portion, but decent enough. I had the sticky toffee pudding; lots of sauce, nice and hot, and a very creamy ice cream (if that's not a tautology).   All in all, very impressive, and certainly more than enough to justify a return visit. I suspect from the reviews so far that the quality might be a bit variable, but we'll let you know!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ayOv5dCnUG4qVP9IbxT6mw"
  },
  "-o3U0ADxSFoWA0NUhEH0gw": {
    "date": "12/3/2011",
    "text": "I was really quite disappointed with Whigham's. It's pretty loud, very difficult to navigate if you are looking for someone to show you to your table (where's the host's stand??) and the seafood was good, but not great. I would venture to say that if you are meeting a bunch of friends or going to the bar it is a better experience; I just wouldn't recommend the slower dinning area. The wine menu is a redeeming virtue though. I would recommend it as somewhere to go for a glass before your actual meal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hSW6tj_jJKrZxSkG2n7NPQ",
        "caption": "Photo of Whighams Wine Cellars - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hSW6tj_jJKrZxSkG2n7NPQ/o.jpg"
      }
    ],
    "user_id": "y0mXSJKOi_1y3ZQyXnFGFg"
  },
  "I4vuImbOAqBnwfdxWF2NQA": {
    "date": "7/3/2010",
    "text": "This is one of my favourite finds in the city!! And what a find!  Hidden away in the depths of Charlotte Square, this place doesn't look like much. It's got such a lovely, authentic atmosphere though, really genuine and comforting.  It's really traditional and a great place to come if you would like a relaxing, authentic atmosphere.  Yes it's a bit cave-like, but it's an experience! When you go (which you will) you won't be disappointed, and you'll be back (alongside Arnold)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5Aftqz2aq1JZurNLc0D-NQ",
        "caption": "Photo of Whighams Wine Cellars - Edinburgh, United Kingdom. Courtesy of Website",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5Aftqz2aq1JZurNLc0D-NQ/o.jpg"
      },
      {
        "img_id": "2a0l2MKKqIPoszDjq4hQ2w",
        "caption": "Photo of Whighams Wine Cellars - Edinburgh, United Kingdom. Courtesy of Website",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2a0l2MKKqIPoszDjq4hQ2w/o.jpg"
      }
    ],
    "user_id": "o0WGr8L3BWfH2Bslpnqw6g"
  },
  "IwYaZdoOYjWE1IEHLyU6xA": {
    "date": "1/4/2013",
    "text": "I'd always really thought of Whighams of a place for after work drinks rather than a restaurant but having recently dinned here I was pleasantly surprised at how well both elements of the place work together.   The sunken alcoves, that I'm assuming previously held wine barrels when it actually was a wine cellar, have a lovely cosy feel to them which is great if you have one to yourself. Sharing one with complete strangers however can feel a little awkward depending on your company as the music and chatter of the bar is really subdued in the little alcoves, so they can hear everything you're talking about. (Thankfully I've usually been sitting with a loud, exuberant group who's rowdiness tended to scare off anyone foolish enough to try and sit with us.) As you would expect the place has a good wine list and also provides a very nice list of cocktails. If the weather is nice there is also a teeny tiny beer garden that you can sit it, though it is usually full of smokers.   The restaurant area is separated off a little from the main bar so it's not quite in the thick of things, though I wouldn't really want to eat here in the evenings on a weekend given how busy the bar gets. On the Wednesday I came in here for food the place was quite quiet and my friend and I got tucked away in a nice wee corner away from the hubbub of the bar. Seafood seems to be a speciality here with lots of fresh and enticing options on the menu. I opted for mussels while my friend had some oysters followed up with langoustines and pasta for mains. The food is lovely and it was nice to find a decent seafood restaurant outside of Leith. I'll probably stick to drinking here as opposed to eating but it's a lovely place to spend some time if you're in the West End.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wk-QmrbyCtGD23oIhMP44w"
  },
  "ldDVy6-rimrvZ3OPo8-JKw": {
    "date": "1/18/2014",
    "text": "Had dinner with my partner at Winghams on a Friday night.  The staff was friendly and the food was fine - nothing too exciting.  For a wine bar, I'd hoped for more variety in wines, such as wine flights or wine pairings but this was not available.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yrGX6Pw3wTO-1xG9TTsIaw"
  },
  "I-Q7w_W_KU2-0xSxhrrWhQ": {
    "date": "11/8/2012",
    "text": "I have only been here once, so maybe my views are a bit \"jump the gun\" but I had one of my best nights out in Edinburgh here a couple of months back and I whilst I want to give it a 5 star, the sensible (ex) scientist in me wants to see if the results of previous study can be reliably replicated.  Experiment 1: Arrived in Whighams wine cellar after consuming a nice bottle of wine with my lovely wife and an old friend whom I hadn't seen for 7 years in another establishment one Sunday evening. The sounds of live jazz enticed us in and once we were in we were not going anywhere as the music was great, we found a bottle of tasty Lebanese wine (Chateau Mussar) and we were in our element sitting at the front, wine in hand, fine music (for which there was no cover charge by the way) and we even ended up chatting to some friendly customers.  The prices weren't cheap, yes you could get the same wines in a good wine shop at a cheaper price, but it's not very often I get live jazz in my living room for free so I don't mind paying a bit more for the entertainment.  The bar itself was OK, not too much to shout home about and I can see why a mid-week empty bar might not have the same feel as a packed Sunday full of jazz hungry wine filled people.   I've been meaning to go back but haven't made it yet, will do it soon but it has to be on a Sunday for the great music.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BahHBtIfpuT-w-BUO_g1mg"
  },
  "Tgv-ciJnycbKmEjYmN7rKQ": {
    "date": "6/23/2009",
    "text": "Well priced, with a varied and interesting wine list and pleasant waiting staff this is another establishment that would have benefited from a further half star if that was possible.   My starter of crayfish tails and the main courses of mushroom stroganoff and thai fishcakes (with well cooked new potatoes)were all resounding successes, washed down with a pleasant 17.95 chardonnay. The dessert was a bit of a misnomer however - when I order a brulee I expect to have to break into it, not for it to be ready smashed.   This was an enjoyable meal in an establishment I've previously only drunk in but I wouldn't suggest coming here for an intimate evening - the acoustics (due I imagine to it's cellar nature) make it pretty noisy even when, as was the case at the weekend, it is no more than half full.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "txzOZrHK9EVY0kYjSuXkKg"
  },
  "jaJtK2hWzQr0jI_wYNf4UA": {
    "date": "10/18/2012",
    "text": "on a cold, rainy, and dark wednesday night i made my way down the stairs to Whighams for a quick glass of wine with the lovely Georgia A.  I was quite looking forward to visiting this bar as i'd never been before but always thought the place had some of sort old worldy type charm....  on arrival, the place was fairly empty, but to be fair it was Wednesday night at 5pm.  I shed my rain soaked coat, hat, and gloves dropped my brolly on the floor and picked up a drinks menu.  I was tempted by the offer of champange or prosecco by the glass, but felt the weather dictated better to a red wine sort of drink.  i had been wanting to get a glass of pinot noir, which i'd seen available on their drinks menu on the website, but when looking at the menu last night this was only available by the bottle.  thinking a whole bottle of pinot noir was a bit excessive for a weekyday evening i opted for a glass of malbec instead.  after getting my drink, i secured a table just under one of the big windows looking up the stairs to Charlotte Square and sat down just as my wine drinking companion arrived.  We had a lovely, although brief chat, in which i drank my malbec and enjoyed the ambience of Whighams. i also enjoyed the free nibbles we got at 6pm, very nice touch :)  now this was a perfectly lovely catch up in a nice location, but there was something missing about Whighams.  first off, i felt their prices were a wee bit on the expensive side.  I paid over 5 for a small glass of malbec and while it was nice, i can get a whole bottle of malbec for not much more from the co-op at the top of my road.  second, when i sent the bartender away so i could look at the menu, it took ages for him to notice me again when i was ready to order.  and lastly, while i enjoyed the bar and though the little alcoves very appealing for a romantic glass of wine, i didn't get a feeling of the character of this place.... it just sort of fell flat.  maybe it was the lack of patrons or maybe this wine bar just lacks a certain je ne sais quoi...  either way, while i'd be happy to go back, i don't think i'll be in a rush to do so.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z_xbO-Iaxbx-ZRPhLJK-Ew"
  },
  "YLdSEzYN0hfQoEgPoDCGjg": {
    "date": "1/2/2013",
    "text": "Made a reservation here for New Years Eve before heading out to Hogmanay.  While the bar seems like a cool place to grab  a pint or a glass of wine, I wasn't blow away with the restaurant.  The menu was fairly standard for Scotland (pork belly, steak pie, fish and chips, a few soups, etc.), and it was OK.  However, I was expecting a bit more selection from the wine list, and the waiter didn't have much knowledge of the wines at all.  The service was polite and pleasant, but not great.  For the price, this is a reasonable place, however I would keep to lunch and the bar, and skip it for dinner.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lD-wCzMChujoM10pZh0fhw"
  },
  "CsCSJztiNcA2r_E7GFNN0A": {
    "date": "10/21/2011",
    "text": "We summed it up: \"Whigham's is much as we'd remembered it: very hit and miss. My mussels were outstanding, but most of the rest of the stuff was pretty uninspiring. Certainly, if you're visiting for a glass of wine and someone mentions, \"shall we eat here?\", I'd say \"yes\", but be prepared for peaks and troughs.\"",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LURC3E0DoXYgN9aYTF3XOg"
  },
  "VwrWTNcs9qVGfNh4PRMOXg": {
    "date": "12/13/2008",
    "text": "Really nice wine bar and restaurant right in the centre of Edinburgh, just on the corner of Charlotte Square.   It's slowly grown over the years, it was a tiny cellar bar with dark alcoves when I first came here but they have now extended this back and have created a nice restaurant bit at the back.   The restaurant is good, quite a small menu but interesting and reasonably priced. It also has a great wine list - lots by the glass so you can try lots of different ones.   It's a good, busy bustling bar.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dIAHvx0I8T1OVNlgt2paVA"
  }
}