{
  "FIJeBPPLf1ArdyD1w82mmA": {
    "date": "5/29/2014",
    "text": "Daura Damm GF beer available and for a first visit, this pleased me a lot!  I don't find myself in Leith that often and although we've had a few brunches in Leith, I've always found the menu's to be lacking in GF friendliness so I've tended to avoid.  The Lioness is one of the new gang of pubs which have opened over the last year or so. All reclaimed furniture, lots of wood and even a pinball machine you can sit at. We of course sat at the pinball machine for novelty value but not the most comfortable as I hate sitting on stools.  So, GF beer available - yay! We grabbed some quick snacks - chips which were ok and nothing outstanding hence the three stars. If I'm in the area then I probably would pop back and try some more of the menu as there were GF friendly dishes listed and maybe will increase the star rating.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "frthTngbBHgSdk4j85HmEQ"
  },
  "Pmdc2Dg-U-DhOPcaIQhWpw": {
    "date": "1/28/2014",
    "text": "My kinda place, thanks to Rayan D. for setting up a Saturday brunch here!  There was a slight initial misstep, in that our first round of drinks went undelivered, but the friendliness of the service more than made up for the slight mistake.  The only other slight curiosity is in ordering one of their bloody mary's I was asked how spicy I would like it... as anyone who knows me would expect, I ordered the hottest possible and was even warned by the waitress that it was going to be \"extremely hot\" when it was delivered... somehow, to the point I'm wondering if there was a mix-up, it was not spicy at all... as in I'm not saying that because I love spice and it wasn't spicy enough, it literally lacked any kick whatsoever... to the point I'm wondering if there was a mix-up somehow.  That said, it definitely got an A+ for presentation... if I find myself here on a weekend morning again I might give it another go directly from the bar.  As for the food, between three of us we had a sharing platter and two of the egg dishes, the Mary Moriarty and Eggs Irvine Welsh... all three were winners, with a special nod to the sharing plater and the Mary Moriarty.  (The Eggs Irvine Welsh wasn't bad, I would just choose the Mary Moriarty over it personally.)  Some of our group opted for the roast chicken, which I believe normally requires four to order... it definitely looked like it was worth a try, but having lived in Yorkshire for so long I tend to skip any type of roast lunches if there's something a bit more adventurous on offer.  The decor and vibe of the place were spot on... no complaints to be had, I personally love a rustic retro chic vibe.  As an example of the level of service, after the majority of our group left another large group was seated next to my two cohorts and I... after a while more members of that group arrived and the waiter very kindly asked us if we would be willing to move later if he topped up our beers.  We explained we were happy to move when the time came, and that no top-up was required... after moving and denying two top-ups of beer the gentlemen came by with three shots of jaeger as a thanks for moving without a fuss... as you can guess, we graciously accepted these... I mean, he had already poured them, it would have been rude not to.  I guess one of the best compliments I can pay to this place is that I wished it weren't so far away from where I'm located as I stand envious of those that can call it a local stop... still, it was worth the journey and I definitely look forward to returning for another lazy weekend lunch or perhaps even dinner in the future.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "FSTZjd727upEKYE6lTQVwg"
  },
  "uokTEXdTi7Ih3T6KljjYOw": {
    "date": "11/2/2015",
    "text": "I love hipsters!  They've brought a bit of colour and style into our dull world and this place was made for them. Luckily ordinary mortals are welcome here too. Tasty food, if a tad pricey, and their own lager goes down well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yKM5bmrZhKNs1GGsNauqoA"
  },
  "yFCtHN5VmSyo3Z6_O_jbVQ": {
    "date": "3/30/2015",
    "text": "Probably went in at the worst possible time, 10pm sat night. Very very busy ( good for business, not for full of food, heel wearing ladies )  popped in for a cocktail after dinner, the cocktails were ok but not amazing and town prices. I'm sure a great addition to leith but don't know if I'll go back on a Saturday night in a hurry. Have heard great reports about the food during the day though x",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1otkilxTrHF6Z1vdrrlZrQ"
  },
  "kenowqLynvXTbbT2I2upfQ": {
    "date": "5/21/2014",
    "text": "I gave the Lioness of Leith a couple of chances because I really could make up my mind... and I still can't! I think that kind of says it all.  This place has some pretty cool decor but once you're past commenting on the wall mounts of animal heads it's basically a pretty average bar.  The staff seem lovely though and I definitely prefer this as a daytime rather than a nighttime place.  At night it gets pretty busy and there is a lack of seating which makes it difficult to have a chat!  Has a similar vibe I think to the Villager on George IV.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nltUy-nDWqKcDHGd12ZfLg"
  },
  "lPuVI1tCe3vQ9EPoHGbo1w": {
    "date": "6/3/2015",
    "text": "Oh, Lioness. I so want to like you but your kitchen keeps letting the side down. The front-end service is very friendly, a few minor glitches with the orders but largely attentive and kindly. The food just never quite gets off the ground. My chicken burger was tepid on arrival and leathery, but the rosemary fries were quite good. My dessert was a brownie with ice cream that was a microwaved-then-hardened lump. Not terribly chocolate-y either. My husband had a veggie burger that was a jumbled pile of veg on a roll. Meh. Dad and teen had the fish and chips which were paltry portions and only so-so. Mum had aubergine with some sort of ratatouille but found it uninteresting and small. I give the Lioness points for now having a children's menu and toys/ colouring in for the kids. The beer was lovely but the food is not where it should be at these prices. And I'll all-cap this last part: THE PORTIONS ARE TOO SMALL.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C2oXAYS4H6uOf7CWLywUYQ"
  },
  "yVE8exZTznbYoupPT712wQ": {
    "date": "10/6/2015",
    "text": "The Lioness of Leith is a little diamond in the rough! (plus the have my favourite beer on tap!) pretty hipster in design with quirky interior featuring a mish mash of styles and oddities including a ceramic leopard wearing a diamante tiara, retro graffiti and murals, pinball machine giving this place an air of cool... just what this part of Leith was lacking.  Food is pretty good too - not your standard pub fayre, more gastro pub / bistro i'd say - menu changes regularly and there are daily specials.   Despite oozing with cool this pub is really down to earth and friendly - i'd reserve a table if you're looking for food on weekend evening as it's often pretty busy.   Apparently they have a pub quiz too - wanna pop in for that at some point too!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 5
    },
    "photos": [],
    "user_id": "8M2Ladv1AIAUVwoOzxX3VA"
  },
  "x9a4z2O_9pLFGFyxLxwW4g": {
    "date": "6/27/2018",
    "text": "Pros:  Service was good.  Love the location. I  Leith.  Atmosphere warm, friendly, comfortable, hip.  Appreciate the free range,grass fed, etc ...  Cons: Was excited about the 'gourmet' burgers . Our party of 4 ordered burgers. Very disappointing. Liked the bun. Fandom ends there. I asked for medium rare, was told well done the only option. . My well done, super dry burger was the worst burger I've had in years. Granted, I am from Northern California, and gourmet burgers r us!! Big time. So, my baseline is high.  The burger did not meet my juicy, yummy expectations.  Hopefully it was a bad day. I really wanted to like this place, and it came highly recommend by our air b&b hostess.   Please up your burger game!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3MxHcBgASasAJb07vZQbBA"
  },
  "5C_YzKYw-gYTN480qtqqag": {
    "date": "6/3/2016",
    "text": "Came to Lioness of Leith with as part of Brunch club with other Yelpers.   It's appeared on a few lists as a recommended brunch spot in the city, and judging from some of the past reviews it seems to have had some interesting brunch options in the past.   I'm not sure if it's changed hands recently but it seemed pretty unremarkable. They had the usual brunch options - poached eggs, black pudding, eggs benedict. Mostly fine but wasn't executed to a really high standard. Some of the english muffins weren't toasted and just a few details not quite right. The poached eggs were a high point though.  I'd go for tea over coffee here. They make an effort but it's not a place for a decent flat white.   As a bar, I think this place is pretty cool. There's old arcade machines and a retro vibe. I could see myself coming here for drinks rather than morning brunch.   I wouldn't be in a rush to come back for brunch but if I was in the area I'd check it out again in the evening or potentially to see if dinner was a better option.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "llckDZ8toeTqwEq0VHOVWQ",
        "caption": "Photo of The Lioness of Leith - Edinburgh, United Kingdom. Lioness brunch.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/llckDZ8toeTqwEq0VHOVWQ/o.jpg"
      }
    ],
    "user_id": "eFqg1qaOBHq_Od6fRlMcWA"
  },
  "v1IE8nkb0zfv_P-TBievOg": {
    "date": "3/23/2015",
    "text": "LOL! Well, if they will call themselves Lioness of Leith, it's to be expected.  I quite like the Lioness. Yes, it's super hipster at first glance, but the clientele is a nice mix of younger, well, hipsters, families, and other non-dodgy residents of the burgh of Leith. Duke Street isn't the first place you'd think of to find a nice, friendly and SAFE pub, but LOL took a chance and it worked.  The purple woodwork, the pinball machine, the big game heads and the bizarre three-eyed Ginsberg portrait might put you off at first, but look beyond the wacky interior and you'll find an interesting menu and a decent selection of beers on draught.  We've popped by for drinks a couple of times, but until yesterday hadn't eaten.  I suppose this is mostly because I've read so many mixed things about their food, largely that when they do it well it's really, really good, but they struggle with consistency, and to be honest consistency is what you need.  But on a lazy Sunday and in need of sustenance, we decided to finally have a go and eat.  Sundays at LOL mean one thing, the roast! You can get a whole chicken for 17.50, or a half for 9, with a selection of sides at 3 each.  Whilst I'd initially had every intention of having the roast, a quick tot up in my head made me realise that this was an expensive option.  Sure, all the roasts coming past our table looked amazing, and I was jealous of them all, but I'm not made of money.  Instead I settled on the fish and chips, and Kip S went for the bacon and brie burger.  And lord, was that fish good!  Perfectly crispy batter, succulent cod, skinny fries and unexpectedly delicious peas.  I'm assured Kip's burger was very tasty too, and he ate it so quickly I can only assume he enjoyed it!  I was stuffed, and mine was a proper fish tea so came with bread and butter so I really was very full.  We washed it down with (in my case) a pint of their housee IPA brewed by Leith locals Pilot (cloudy and a big whack of flavour), and (for Kip) their house lager Lioness (much easier to drink).  I've noticed they now do an afternoon tea, and I've spied 4.95 cocktails on Tuesdays!  Usually Nobles is my go to for pretty special pub grub in Leith, but LOL is definitely getting a look in now.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "dDlJff4w4Lg2Hywa7mk_KQ",
        "caption": "Photo of The Lioness of Leith - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dDlJff4w4Lg2Hywa7mk_KQ/o.jpg"
      },
      {
        "img_id": "1I3Gi0t7khBqa8ulLhNVnQ",
        "caption": "Photo of The Lioness of Leith - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1I3Gi0t7khBqa8ulLhNVnQ/o.jpg"
      }
    ],
    "user_id": "Mqg4L8flJmg8pqeR-uYyRg"
  },
  "1PLo8UCrQUC7_myr4291Og": {
    "date": "1/22/2014",
    "text": "Oh, it's so very cool here - I love the bright walls and the wacky decoration (a stuffed antelope head on the wall adorned with a tacky tiara sums the place up pretty perfectly) and the retro arcade game. I also love the sense of space.  The brunch menu is limited, and of the four options, two appealed to me: the Mary Moriarty (poached eggs and smoked salmon on a brioche bun) and the Eggs Irvine Welsh (scrambled with chorizo, I think). I plumped for the MM, but I was surprised to find the salmon cold. To be fair to them, it was clearly meant to be - not a case of \"outrage! My dish arrived cooled down!\" More a case of \"that's a bit odd, with hot eggs.\" Maybe just me, but I wasn't sure about it. The brioche bun was very nice - again not my expectation - I think of brioche as super soft and fluffy and this was toasted to rock-like crunch - but pleasant.  Our waiter was very perky and achingly cool in style; big plus points for dealing with a confused rabble of brunch-hungry Yelpers on a Saturday morning with such efficiency and cheer.  All in all, I had a lovely brunch, but I think much of that was related to the lovely company. I'll be happy to go back and try it again to see how it fares in a less brunchy situation because it really is a very nice spot.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "omlV2R5u8CstEtNpxMXplQ",
        "caption": "Photo of The Lioness of Leith - Edinburgh, United Kingdom. Cocktail menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/omlV2R5u8CstEtNpxMXplQ/o.jpg"
      }
    ],
    "user_id": "bcxcQhp0sKYd9eUnEVUzPA"
  },
  "3vPpvDTeuSaaeS6hqq-XAQ": {
    "date": "2/19/2014",
    "text": "Quite nice. I'll keep it.  After jogging by here a few times and reading the Yelp reviews I was looking forward to a visit. So when my folks were over and were looking for somewhere nice in Leith off we went.   Spacious, wood, jukebox, purple. That pretty much sums up the look of the place! There's some cool stuffed animals and a ginormous mirror. All very cool and I imagine that at night the place looks quite relaxed and hipstery.  My family went with sandwiches while I went for a stornaway black puddin salad with apple compote and walnuts. When I ordered I was warned that the portion wasn't very big. This surprised me as there was indication on the menu that this dish wouldn't be a 'meal' portion. I went for some roast potatoes with rosemary with my salad to bulk it out (which were promptly stolen by Dad, he does love his spuds!)  For afters I had a large profiterole with a coffee. They do a cake/pastry with coffee for 1.50 which is pretty alright! My profiterole had a smiley face which definitely cheered me up after my stolen potatoes!  The staff were lovely, very nice if a little slow. Overall it was a nice visit and 'll definitely be trying to get my 'West Edinburgh' friends Leithwards to try it out!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Mlhh6WxzuMGwiwNo__yigQ",
        "caption": "Photo of The Lioness of Leith - Edinburgh, United Kingdom. Cheese platter (complete with someone digging in!(",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Mlhh6WxzuMGwiwNo__yigQ/o.jpg"
      },
      {
        "img_id": "ebEoqc2ubhlfialhC55ObA",
        "caption": "Photo of The Lioness of Leith - Edinburgh, United Kingdom. Eclair, a bun with a smile :)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ebEoqc2ubhlfialhC55ObA/o.jpg"
      },
      {
        "img_id": "UhGBF_iVhW6vHDDqy1mV4w",
        "caption": "Photo of The Lioness of Leith - Edinburgh, United Kingdom. Stornaway black pudding with apple and walnut salad.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UhGBF_iVhW6vHDDqy1mV4w/o.jpg"
      }
    ],
    "user_id": "KPY6FvT6h-r0W0HAC1Buag"
  },
  "-lW8cZqXLAt_oPWWscafgQ": {
    "date": "12/20/2013",
    "text": "The LIoness of Leith (or LoL) has just opened on Duke Street.  This is a new cool bar / restaurant in Leith serving great food and drinks. Joseph Malik is the head chef and he also owns Safari Lounge, so I was excited to try out the food.  I had a half pint of strong apple cider to start with. I could have been drinking apple juice for all I knew, it tasted so light, but beware it's 7.2% so it can be deceptive!  I shared a starter of beef carpaccio which was nice, it had a home made feel to it.  My main course was wiener schnitzel, which is my secret love. I love a schnitzel - who doesn't? It came with apple and carrot slaw which was delicious. The schnitzel itself was fine, tasty enough. A side of rosemary roasties was also ordered.  I was too full to have a dessert, but my friend had cardamom pears with candied nuts. I had a little taste of it and it was enjoyable, though the cardamom taste wasn't particularly strong.  I like this new bar. What I like is that they have something a little bit different on the menu (both food and drink menus) that you don't necessarily get elsewhere.  The food and drink is also reasonably prized, e.g. half pint of apple cider only 2.  On weekends the Lioness serves brunches and sunday roasts which I want to sample soon as the menu looked delicious, with things like 'Eggs Irvine Welsh' (scrambled duck eggs served with chipotle pepper) to name an example.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "qG9cE0jc7zxKYREOUSNjfQ",
        "caption": "Photo of The Lioness of Leith - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qG9cE0jc7zxKYREOUSNjfQ/o.jpg"
      },
      {
        "img_id": "cHcLrQpkhGqlCexLsX61DA",
        "caption": "Photo of The Lioness of Leith - Edinburgh, United Kingdom. Beef carpaccio",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cHcLrQpkhGqlCexLsX61DA/o.jpg"
      },
      {
        "img_id": "DspTCcLS59Ht4YcRQHC2IQ",
        "caption": "Photo of The Lioness of Leith - Edinburgh, United Kingdom. wiener schnitzel with apple slaw and a shot of weiss bier",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DspTCcLS59Ht4YcRQHC2IQ/o.jpg"
      }
    ],
    "user_id": "yuFHrb8YQtVuzu0eEXvJtA"
  },
  "S7vGKMPrJC4R6f1hYSOPog": {
    "date": "1/16/2014",
    "text": "I feel i ought to give this place a second visit as I went for lunch and don't actually have a great sense for the place as a pub. anyway:  So the lioness has a very child of the 80s aesthetic. Arcade game machine by the door, big boom boxes hanging from the ceiling. This place has certainly managed to shake off whatever lingering clientele there might have been from whatever it was before and has established itself as a place for trendy folk with cash to splash. It's a big open bar, i'd love it if they did events where they cleared away all the tables and had a big dance space. The main bar is probably somewhere in the region of 25m^2 so could be fun. I didn't particularly like the rustic tables they have here. the table edges are too rough and I could feel the skin being grated off my arms through the meal. They're also not level, not idea for tall drinks at all.  Firstly i had a pint of the house beer, a light lagery thing that was entirely drinkable. Perhaps not to the taste of people who want a pint with a great deal of depth, but I suspect it would be a great post work pint. I didn't ever get close to the bar to inspect what drinks are on offer at large, the taps looked a little lacking in variety, fairly typical euro imports for the most part although i did see some barney's on the right.  The menu seems a little impenetrable at first, there is none of your typical pub grub affair here, and perhaps some of the descriptions are suffering from being a little too wordy. That said the staff are happy to explain various things to you so you don't order something you don't want by accident. I had a lovely little chorizo and capers starter, but my risotto main was lacking something. Perhaps some crunchy roasted pumpkin seeds or something. The dessert i had was pretty excellent however. Poached pairs with, get this, cardamon custard croquettes. Light, sweet, spiced; heaven I tell you.  I want to come back to this place to drink rather than eat so i can get a full measure of the joint, but I'm positive it'll be to my liking. That said I am fussy about my pubs...  *edit* I popped in for brunch with a yelpy bunch today and was very please with my brunch roll thing. Delicious filling although the roll was a scone which just plain confused me. What was really lovely is the facilities they have for kids. A gorgeous kids menu and tasty food for little mouths too.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "pYjNFTvCYH__zg7qNSqMkA",
        "caption": "Photo of The Lioness of Leith - Edinburgh, United Kingdom. Roast!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pYjNFTvCYH__zg7qNSqMkA/o.jpg"
      },
      {
        "img_id": "b0uyPe9DVAVmvF865uuSUw",
        "caption": "Photo of The Lioness of Leith - Edinburgh, United Kingdom. Poached pear with deep fried custard",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/b0uyPe9DVAVmvF865uuSUw/o.jpg"
      }
    ],
    "user_id": "U55y_61paae1f6r6vgITJw"
  },
  "Q6rzhlvmv0f2tiK9Mlk_DA": {
    "date": "3/5/2014",
    "text": "Popped in for a pint on a rainy Saturday night and the general impression was of a place still in the phase of initial popularity as there wasn't a seat to be had around ten pm.  Plumped for a bottled Australian beer as there didn't seem to be any real ales on tap so confirmation of that, paying a visit when it's emptier and having a look at the menu are all factors that will see me make a second visit in the near future.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "txzOZrHK9EVY0kYjSuXkKg"
  },
  "qH1ZPeHRuaNJSwRULEkMwg": {
    "date": "12/22/2013",
    "text": "Only opened recently on Duke street in Leith this pub shows potential for visitors and locals alike. You can still smell the fresh paint and might notice that there are still some touches missing. However, the longer you linger the more the pub grows on you.  Somehow the interior feels a bit plain. The floor space is covered with a few wooden tables and chairs. Plenty of room for brams in that matter having seen a few families around aftet 19.00. After a certain time the place started to become very busy. It was Friday night!  There is a Tesco just opposite, such this place is a good start or end point for food shopping. A cash machine is not far either.  Must say that the staff was very attentive when we ordered our dinner and even the head chef came to welcome us into his realm. There are cocktails a plenty on the drink list and much more. It's quite an extensive list. The menu itself gives you less choice, and not all of it might appeal, but the Wiener Schnitzel is definitely the best choice for a first time order. It comes with a tiny glass of Weissbier and some carrot and apple slaw. Personally I prefer the traditional parsley potatoes with the pork schnitzel, but that's just how it's served on the continent. I ate it all. The plate was clean.  Would I recommend this place? Yes, definitely.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "esbF0D7EY0y8SOuReyXdDA",
        "caption": "Photo of The Lioness of Leith - Edinburgh, United Kingdom. Bloody Mary with Guiness topped up",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/esbF0D7EY0y8SOuReyXdDA/o.jpg"
      },
      {
        "img_id": "5J_I6QwODFjoaMMoNpA-1w",
        "caption": "Photo of The Lioness of Leith - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5J_I6QwODFjoaMMoNpA-1w/o.jpg"
      },
      {
        "img_id": "OeaP9uKeBrPYbf1sZXvoIw",
        "caption": "Photo of The Lioness of Leith - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OeaP9uKeBrPYbf1sZXvoIw/o.jpg"
      }
    ],
    "user_id": "s85sNAMlsrI0xCRvfj7Jrw"
  },
  "OjG_4_o_PQ-YgHKN930Xdg": {
    "date": "10/6/2014",
    "text": "I only popped in here for a quick drink to kill some time before picking the boy up from Tai Kwon Do. I wasn't expecting much as the foot of Leith Walk can sometimes be dodgy...  However I had a pleasant surprise! A wee gem of a place and right across from Tesco, near to Leith Links, it's a pretty good location for the locals and anyone else about in Leith really.   I only had a G&T, but I thought the price was pretty decent at 3.50. Saying that I think it was tonic from the tap. But even so.   I didn't eat there but from the looks of things they had a pretty nice menu. The table next to me had giant bowls of mussels which made me, and big seafood scaredy cat, tempted to go back and try them. There were a number of people in having meals.   The atmosphere itself was really laid back and chilled. It was only 6:30 when I popped in but they were pretty busy and no one minded if you were on your own (with a few grocery bags even). The bar maid that served me was lovely and friendly.   It looks like they took reservations as well and could easily host events, parties whatever. I would recommend it if you're in the area and looking for a nice place to get some drinks. It's a bit out of the way if you're heading into town but if you're heading down to the shore or doing a Leith pub crawl definitely put this one on your list of stops!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "r0yOk0uIcK0uqj1rdyDXpQ",
        "caption": "Photo of The Lioness of Leith - Edinburgh, United Kingdom. Pretty cool decor!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/r0yOk0uIcK0uqj1rdyDXpQ/o.jpg"
      }
    ],
    "user_id": "GoJPBrs_xZmLiYPZrrzOkA"
  },
  "iu50v5i-d7y7DDqgpV6FTQ": {
    "date": "12/22/2013",
    "text": "They have just opened to the public and got their license a day before that. Thus they are still trying hard to get the correct system in place.  Some of the beers were not on yet,and some of the wine hadn't arrived. That said, they are a very friendly and helpful bunch. The staff is lovely and sweet!   The atmosphere is a pub, a brownish one. The decorations are a well though out mismatch of grafittied walls to taxidermied exotic animals.   We noticed that there are a few elements not so well though out. The lack of coat hooks for one. This means people use the sofas or the back of chairs to leave their coat, and discovering the second flaw - balance. The chairs are not designed to have a heavy coat on them, so they tend to topple over. Minor but noticable inconvenience. I think they need to change the seats/ supply pillows.. but that could just be me.   The good points are the staff, prices for the food, cocktails and other drinks. Also the menu is slightly different than the usual fares you get. I loved their chef's handrolled sausage and vodka infused fennel. And the rosemary roasties were a treat!   It was nice of one of the chefs and owner; Joseph Malik, to come out and have a little chat with us and plug their brunch menu as well. And that looks delicious.    I do like it here and have already staked my favourite seat(s) in the house.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "2ThW0Tcj_9veNhbGW41QUA",
        "caption": "Photo of The Lioness of Leith - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2ThW0Tcj_9veNhbGW41QUA/o.jpg"
      },
      {
        "img_id": "aNEn3ATUZUK-AevdBHhIwQ",
        "caption": "Photo of The Lioness of Leith - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/aNEn3ATUZUK-AevdBHhIwQ/o.jpg"
      },
      {
        "img_id": "HS5lXhhuyZqCaQHMEiK0dA",
        "caption": "Photo of The Lioness of Leith - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HS5lXhhuyZqCaQHMEiK0dA/o.jpg"
      }
    ],
    "user_id": "fKi8ZF3xpJJkgSusRubeMA"
  },
  "yPVdhDf0nNpuBcTwz6ZhzA": {
    "date": "9/2/2014",
    "text": "It's funny. I first saw this place from the bus on my way to Leith Links for the Mela festival and what caught my eye was a classic old pinball machine in the middle of the pub. Immediate mental note to self to return! After the festival, we all fancied a beer and so this place immediately leapt to mind. It turns out the pinball machine no longer works but they've turned it into a table with four bar stools around it, making a perfect spot.   The other thing that struck me about this bar was how dog friendly it was. Maybe that's just me noticing all the dogs these days as I've gone a bit dog crazy but there was a gorgeous beagle, a stroppy Maltese and a super cool collie. So bring your best friend here.  As for the beer, the Lioness Lager tasted light and crisp, perfect for a warm, sunny Sunday and the bar staff were friendly. One beer turned into two before we made our way home. Having Tesco just over the road was pretty handy too for some last minute purchases!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "ZkWzMb9QbB5e3JerEIg4Fw"
  },
  "qD7C6tJ7wROMl6fZycn6DQ": {
    "date": "1/15/2014",
    "text": "Had a fantastic sunday lunch here with a full Chicken joyfully torn apart by myself and my SO. We had each of the sides which were perhaps a touch on the expensive side however when taken into account with the value of the actual chicken and the evident quality of all the ingredients involved, I'll take it. As much food as I could put in me (and she could stuff in her) with a drink each was about 33. I reckon for sunday lunch that's pretty decent.  Beers wise these guys need to have a think about their keg selection although I get the idea that they are either tied into one or two breweries through the premesis or that that they're just finding their feet. Good to see Thistly Cross and Barneys Beer, Be nice to see something a touch more interesting on one of the keg lines.   The pub itself is big and spacious and feels airy even when full thanks to the massive windows.  Really enjoyed my time there and the brunch does look delicious so I imagine I'll be back soon!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 6,
      "cool": 5
    },
    "photos": [],
    "user_id": "lr22Y8AqhDdqLa3Wl0s_fw"
  },
  "oU5vkZu_qh_OFqYpatZDbA": {
    "date": "4/23/2015",
    "text": "This place is exactly what duke street was crying out for. Good atmosphere with lively decoration. It doesn't conform to one theme, but pinball, arcade machine and getto blasters take you back to the 80's! Some might call it hipster. Take a closer look and you will find that they've maintained much of the original quirks of what is an interesting building. Tastefully botched up floorboards give it a genuine feel and reclaimed furniture works to good effect. The lioness lager is nice and I was happy to discover that it's reasonably priced. This is what I've stuck to each time I've been. The only criticism I can make is the price of the menu which put us off ordering anything. But on the flip side, if they did cheaper grub then maybe the place would become too popular! Overall thumbs up. Another jewel in Leith's majestic crown.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "k_VkNVPou-CS1gyvN5AsUw"
  },
  "0zzdsSuAKz5Jh1VleMVZxA": {
    "date": "1/19/2015",
    "text": "Very trendy, very stylish, and they have an arcade cabinet! Then again... Why doesn't that pinball machine work?!  I hear people deriding the Lioness for being WAY TOO HIPSTER. I also hear people applauding it for being SUPER HIPSTER! That may be right. If you're not a fan of \"hipster places\", you're probably going to not feel at home here. They wear their hipster pride on their sleeve tattoos and on their menus. There are pictures of beards on the walls, after all!  Personally, I don't care how big your beard is or how skinny your jeans are. IS YOUR BURGER GOOD?! And their pork burger, which was the special that day, was purdy tasty, I will say! It wasn't the best burger I've had in Edinburgh by any stretch, but there's some fierce competition on that front and I wouldn't hold it against them.  I was driving when I was there, so I didn't sample their beers, but my compatriots seemed to enjoy their mojitos. I will say that Beck's Blue is NOT a good non-alcoholic beer and I cannot for the life of me understand why 90% of the near-beer in Edinburgh bars and pubs is that dreadful, metallic muck. If you like Beck's, I guess it's not bad, but if you like Beck's... My reviews are probably not written for you. I'm not beerist! Some of my best friends are Beck's drinkers. We just have different priorities, you and me.  Oh right! Lioness! I liked it, and when I'm in that area again to visit my friends, I'm sure I'll go back. I shall update this when I know more about their inebriation-enablers. For now, though: Points deducted for not stocking Erdinger's near-beer or something else that's actually drinkable.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "02YOZ7OLgXj18Jp9Fu-Fkg"
  },
  "eV1AQyHmX8rMBR3hpDbmuQ": {
    "date": "12/28/2013",
    "text": "Can Leith stand another pub? Well, maybe yes from my first couple of experiences of the just opened Lioness of Leith (LOL).  In terms of location and market LOL squeezes in between the Parlour (which will suffer most from LOL's arrival), the Swedish bars (Victoria and Boda) and Compass/Nobles on Constitution St.  I dont think it comes close to the Vintage in terms of booze and food (which is my benchmark Leith bar) but equally its got a cool factor the Vintage lacks.  It should do well with its friendly service, great food, decent (but not great) beers, good cocktails, family friendly, decent sized space etc.  It has a pinball machine and a retro video game.  So far the big plus is the food.  The wiener schnitzel is already a hit with those who've had it.  The steaks look great as do the roasts (there is a rotisserie set up at weekend) .  In passing, I am so pleased to see that the tradition of a good roast is beginning to make its mark on Scottish bars.  I have tended to think of this as an English pub or a Beefeater chain thing but there is no reason not to see it more regularly in good local bars.  I am a BIG fan of LOL's sister bar the Safari Lounge and if LOL can take some of that vibe and develop some of its own style then it will become a very popular Leith destination bar.  There is a bit of a buzz at the moment since it is new but the test is in Feb/March when we see who chooses to spend there time here rather than in the other good bars mentioned above.  I hope LOL does well.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "q0X_CFlX52ll4kmOcTx_UA"
  },
  "fUtuIQkfLFOxzR6G7N9yIg": {
    "date": "3/17/2014",
    "text": "In traditional Stephanie style I am giving this place five stars because this shit is on DUKE STREET. Admittedly, I am a new Leither, I'm not sure I am even a Leither, being that I live in Craigentinney (next Yelp goal is to review all the places here). But, I have been known to scuttle my way to Duke Street when I need:   A: Wetherspoons breakfast for under 3 B: Discount books, because on Duke Street ALL the good books are still on the shelves at the charity shop.  C: Tesco   But never, never have I been known to go to Duke St. for a really nice meal.   In a terrifying turn of events in my life, my boyfriend's mother is moving to the UK. She was roaming around England looking for massive Tudor mansions (I imagine, I have no idea) when she decided to come up and visit her son for a few nights. I... happen to live with her son. So she, happened to be sleeping on my couch for the weekend.   We decided that The Lioness had gotten reviews that were acceptable to bring a massively picky English lady (my words, not his).   We were SO right. For less than 10 each (not Wetherspoon's, prices, but what is?) we had a fantastic fantastic meal. I ordered the fish, she ordered some sausages and he got some game bird... but really it was so difficult to decide. I wanted a plate of all of it. We had amazingly delicious cocktails and fancy free water (free water is key).    And it was good. Not take away chips and curry good. Not burgers at Holyrood 9A good, it was like fancy restaurant on George St. good... and it was on Duke Street. Until Duke St. is lined with high end restaurants that I can bring my boyfriend's slightly terrifying mother to... LOL - you're five stars in my book.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "WrMDMbEt9ap0VbmNsnKvKA"
  },
  "X-xbMHgIrMeQZokOmRoNjg": {
    "date": "6/30/2014",
    "text": "I think 3 stars is about right for this place.  Personally, I think there's too many similar bars popping up in Edinburgh with similar decor and drinks etc but what makes others better is their menus and to a lesser extent, the price.  There's been a couple of times I've been hungry but just don't fancy the limited choices at the weekend.   There's also been a few times where I've popped in only to find that all the tables are reserved with no one actually sitting at them. This is not the only bar that has this policy in place though  it is annoying and these places are losing custom because of it.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZkmKyB9660N9d30GIrBGTQ"
  },
  "zqrboPoOgJwnD640rJ3iBA": {
    "date": "2/28/2014",
    "text": "Checked this place out last night; just round the corner... seemed appropriate. Came away with good and bad points.  THE GOOD - Funky, spacious bar with lots to look at. - Trendy, friendly staff, happy to have a chat. - Perfectly satisfying food. - FREE Street Fighter arcade machine (for all the VG geeks out there, it's actually Alpha Zero, but I digress....)  THE BAD - Only bourbons on offer were Maker's Mark, Bulleit and Wild Turkey. None of which are anywhere near the top of my Bourbon List (yes, I have a Bourbon List, with capital letters and everything..... What?) - I'm not a fan of being asked how my food is after one bite and these guys asked a couple times. I like to just eat my meal in peace and will say something if it's not to my liking. If ask you must, then ask when you're collecting the empty plate... if the empty plate isn't clue enough. - Bit pricey for what you get. I had the Guinea Fowl, which was tasty, but paid 12 for the pleasure, which I found a few quid too steep. Reminded me of the Fountain in that the food (although satisfying) isn't of the same standard the price sets.  A cool hangout for sure, but not going to be first on my mind due to the lack of tasty bourbons. Get some Eagle Rare in and all is forgiven!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "9RGIvzCGHp8ELF_JgAlbZA"
  }
}