{
  "4-kw3I6T0uNER_C-EXM8xA": {
    "date": "4/3/2017",
    "text": "Is it Asian? Is it Western? Is it an artisan coffee shop? It seems to be all of the above.   Is it authentic? Wrong question. The place bills itself as an Asian fusion cafe. Considering I only saw one Asian (Singaporean?) out of half of dozen staff roaming around, and I was perhaps the only Asian in the whole restaurant area, we should take the \"Asian\" part with a pinch of salt.   You've got your choice of rice and noodle dishes, sushi, or a selection of meat-goodness wedged inside a steamed bun. We decided to go with the last option since it was the most out of the ordinary - we were not disappointed. Between the two of us, we easily downed four pairs of meat-goodness-wedged-steamed-buns. They were tasty. Belly pork, roast duck, char siu, and Shiracha beef - each pair costing 5.95. With a couple pots of hot tea and two free pastries (a deal with a hot drink), that came out to be more than your local grocery store lunch deal.  Nice eats that I would come back to, but not if I were on a budget (or an Asian food snob... which I often am!).",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-8dfvCeJtTupDvUDOYDCKw",
        "caption": "Photo of Dai Pai - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-8dfvCeJtTupDvUDOYDCKw/o.jpg"
      },
      {
        "img_id": "wtWnuucn9BZVDp5XzkqE_w",
        "caption": "Photo of Dai Pai - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wtWnuucn9BZVDp5XzkqE_w/o.jpg"
      },
      {
        "img_id": "wbydE7yFZY9bb7EKe-4xlg",
        "caption": "Photo of Dai Pai - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wbydE7yFZY9bb7EKe-4xlg/o.jpg"
      }
    ],
    "user_id": "4FxADcoBgm_8xqTyfmTIug"
  },
  "6_rAl2NW4S-zvGdxVM7xLw": {
    "date": "5/26/2018",
    "text": "Had the char siu noodles, the pork was juicy and tasty and the noodles fresh and non-greasy. A little pricey, but tastes healthier than your typical Chinese takeout. Menu is a little all over the place, they also sell sushi and ramen, wish they'd just specialise in one cuisine.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rpCDjlDHXKoJ0hV4a50CvA",
        "caption": "Photo of Dai Pai - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rpCDjlDHXKoJ0hV4a50CvA/o.jpg"
      }
    ],
    "user_id": "1ty1PWKi1Lysc9hcimddXg"
  },
  "z1YPpb46boWRoX9r8i9prQ": {
    "date": "2/12/2019",
    "text": "Purchased the veggie gyozas, and although they were very tasty my hunger was not satisfied after eating them. Prices are a wee bit high for the quantity. Good eat, though",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ly7aOKKwfBk0OpTWjFCbIQ"
  },
  "Q3SV7bZo7vlH_qA5sArQJQ": {
    "date": "9/28/2018",
    "text": "Got the bbq pork and rice. For the price (7.5 pounds) it wasn't a lot of food. The pork was fairly good, not great, and there was a lot of fat that I had to separate as I couldn't eat it. So 3 stars may be a little on the generous side.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Um5oekayGKhaT6jI0yxoiA"
  }
}