{
  "wkFOZjwK1C78o5r223khEQ": {
    "date": "8/4/2010",
    "text": "Now this is what it's all about.  Much like Stuart, the word that come into my head when I think of Snax aren't just ones like \"tasty\", \"greasy\", and \"affordable, but \"honesty\" and \"integrity\" as well. They don't make proper greasy spoons like this anymore, but they should. You very quickly sicken of goats cheese and roasted red pepper ciabattas, but you will never, ever tire of a well-fired morning roll with egg and crispy bacon.  Every builder, student, suit and office drone who works within a mile of this place can't be wrong. Huge crowds aside, it's practically flawless.",
    "rating": 5,
    "rated": {
      "funny": 6,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "xXQTdJXPGOP-NUYctcQw8g"
  },
  "jeBfdIY4W5UiHaQSUcq3Ew": {
    "date": "8/7/2010",
    "text": "Snax has always been and will continue to be my ultimate hangover cure. I mean, I definitely sometimes get weird tofu cravings when I'm hungover, but it's mainly a craving for greasy deep-friend potato products with eggs and beans and other stomach-lining things. And Snax does this so well. And so cheap. So incredibly cheap, it makes my heart sing.   They have a vegetarian breakfast, complete with a buttered roll, a fried egg, baked beans and potato-ey deliciousness. They also have fairly undrinkable coffee, but it's so fitting to the rest of the food and the atmosphere of the cafe in general, that I never really minded it. Believe me, next time you find yourself with your head between your hands, and the world spinning, go to Snax and get yourself an explicitly greasy breakfast.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SJHZlBsy0GF_HYRN7wG-6A"
  },
  "9L6GRG1ptQl7BQqRdRkJ5w": {
    "date": "8/4/2010",
    "text": "Snax is amazing. A combination of a greasy spoon cafe and a sort of grubby sandwich shop, the food is great and for really cheap prices. It has been my hangover cure for 3 long years of partying at Edinburgh, although I sometimes struggle to make it in before about 2, when they tend to run out of food.  The food is a proper greasy spoon classic, offering everything from fry ups to sandwiches to burgers to omelettes and much more. They have all the necessary ingredients - sausage, bacon, eggs, black pudding, haggis etc and will mix and match ingredients as you want. The full breakfast, at a remarkable 3.20 (or 4.30 with a tea/coffee) is amazing and will wash away any lingering hangover. The sandwiches to take away are really good as well, and often filled me on the way to lectures.   As well as the classics, they do paninis, admittedly with limited ingredients. There is ham and cheese etc but nothing too fancy, Snax really isn't that type of place. Very different league from Toast in Marchmont but if you want cheap greasy food this is the best place around.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ga9DnmdmhE0Zzs_jRtmrfA"
  },
  "z8J81PC6O9g-fyTzy6VPzA": {
    "date": "7/2/2010",
    "text": "2.60 for a Panini...in Edinburgh??? When i found out I almost bought the flat above the shop. This place is amazing, it's the most Glaswegian shop in Edinburgh. Good, honest, rough as fuck meals that will fill your stomach for less than a fiver.  Avoid mornings at all costs because it's packed out the door.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TQ5ErzoSwOzsvQeuNCeUWw",
        "caption": "Photo of Snax Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TQ5ErzoSwOzsvQeuNCeUWw/o.jpg"
      }
    ],
    "user_id": "9nUtGoOnZMPlZdUQV_aqTA"
  },
  "bTn_zSX8MuJJNZ57AYfK-A": {
    "date": "6/6/2010",
    "text": "Located in the heart of student-ridden George-Square area, Snax is the ideal solution for the main problem in the area = hungry students. They have cheap food, cheap drinks and cheap humour. They make great breakfast rolls, as my fellow yelpers has said, and will save your life when in need. Although they are not open at the weekend, mid-week mornings here are always busy to make sure you go reasonably early to be able to get the greasy goodness!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o0WGr8L3BWfH2Bslpnqw6g"
  },
  "B9HiaZGBigfHe_sG0yCI7Q": {
    "date": "7/6/2011",
    "text": "What more do you want? Friendly service, decent food and great value for money. There's a queue, always a queue. But there's a reason for that. Serving a Big Breakfast, filled rolls, a Bigger Breakfast, paninis, the Biggest Breakfast...the list goes on and on. Something for everyone. And the coffee, very good coffee. Thank you!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "VAEWQdJT-0Q-N5bhXSU74Q"
  },
  "UcOHg6CcyAHPARY7p_LG4w": {
    "date": "3/14/2012",
    "text": "This place was recommended to me by a friend and one day whilst passing i thot i wud give it a try. I ordered my food n waited for it to be made. the girls who were working all seemed as if theyd be having a bad day, as they wer aggresively slamming my order down on table and slapping bacon on etc. i was disgusted but stayed quiet. i watched whilst gettin a lil nervous at how the food would av turned out. in came three workmen in ther get up n suddenly the girls cheered up n started to smile and served them in an overly friendly manner. i have never been back since. so i guess if ur male and in ur uniform u will b treated well. food wasnt that great my rolls didnt hold together so i now know y its so cheap. wouldnt recommend it even to the workies who'd get gd treatment.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7W6qj6dMdUBIK0J3aY3_oA"
  },
  "w3Kf9JMhbnv3oqjvzcb43A": {
    "date": "10/23/2008",
    "text": "A gem in the mixed Princes Street market.   Very few places on the gauntlet of the high street offer you the service, speed and price of Snax which has stood the test of time over the years.   Stuck in between excellent pubs and generic high street shops it can be easily missed, but difficult to forget.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TlE17X7DRDxS6iOsNEndGg"
  },
  "xT6RI_AwVO-ZgN05Ynu7XQ": {
    "date": "7/3/2010",
    "text": "I wish I had read Stuart's review about avoiding Snax Cafe in the morning, because I rocked up here last week to be met with a hideous queue at 9.10am, and I had a hangover. Probably the worst scenario I can think of really. I needed Diet Irn Bru, and I needed it now.  I persevered however (mainly through sheer laziness to go elsewhere) and when I finally got served by a very cheery assistant for that time of the morning, I was glad I had sweated it out in line.  I went for a grease ridden roll with sausage and a tattie scone, and a bottle of my beloved Bru (which has to be ice cold and shaken so all the fizz is out of it- weird, I know) and both hit the spot precisely. It was really cheap, the whole thing coming to just over 2, bargain.  Now I know the paninis are only 2.60, I shall definitely be buying my lunch from there this week too!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cy1PV2TdYeDFA16mUOlr3Q"
  },
  "MijWN18Td-wZpuIgG2t6fg": {
    "date": "1/22/2009",
    "text": "cheap all day breakfast. greasy pit of goodness, lunch items too. this is the place to go after a night out and youve spent all your poundage. sadly, not open on the weekends. three different sizes of breakfasts and they are great with substitutions if you havent warmed up to black pudding, haggis or the bland ass tatty scones.  will also make your bacon crispy, which without ordering so, you will never get so.  if  youre extra hungover, get an irn bru to wash it down.  mac and cheese is bland. some of the sammys suck. id stick with the breakfasts.   cheapest in town.   good place to go alone as they have every possible newspaper. there are at least three in the city- one off princess street, one by edin uni and one on the shore. they are all great. same menus. limited seating-  and  make sure to time it right, the one by edin uni has one toilet but the other two dont have any.  quality",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "M-RKuwyjIsgY-w9TGLKNSA"
  },
  "8IbOpsPqNUe7SRI-jmlakA": {
    "date": "4/22/2010",
    "text": "Reliable, cheap and cheerful: Snax cafe never fails to layer my belly with greasy goodness.  Like many 'greasy spoons' the full English breakfast is always available.  I've opted for the 'Biggar' breakfast and a coffee on many a hang over ridden morning and am always tempted by another to follow. They do some solid Paninis too and always have a few newspapers stacked on the wall for a light read. Frequently busy with Builders and Students alike Snax is a great way to grab a tasty breakfast.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pu1EbtzGlMjsv6UYK6Bzlg",
        "caption": "Photo of Snax Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pu1EbtzGlMjsv6UYK6Bzlg/o.jpg"
      }
    ],
    "user_id": "UvIb5v3biEgcxWKnxf0ocg"
  },
  "Tvt3yd8KeVipqZeVJumOwg": {
    "date": "4/12/2010",
    "text": "Snax is my fail safe hangover cure. Great for greasy breakfasts and breakfast rolls at an affordable price to banish away any affects of the night before. They make a great sausage and fried egg roll, which the thought of makes me feel ill but when you are hungover it hits every spot in the right way. Their fry up is good too, and they let you change items if you don't want to which is pretty good considering a lot of places don't let you. They offer different sizes in fry ups too so I guess varying levels of hangover will need different portions. I haven't tried anything apart from their greasy breakfasts so I can't comment, but if you are looking for a proper fry up then this is the place!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oKdygoDX5CfDJeXzv_EVaw"
  },
  "jua_s9hZfcsroLDBbkY7uw": {
    "date": "4/29/2008",
    "text": "The Harlequin Cafe is tucked down in a basement very close to the university, and as such has a very basic, studenty sort of feel to it. Its a reasonable place to go for a quick, healthy sandwich (they specialise in vegan fare - carnivores beware!), and is also very child-friendly for health-conscious parents. Its ok if you just want to tuck up in a cosy corner with a book and a cup of tea, but really there are better places out there.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hnzGNcqwSZ60nkZRytlubg"
  },
  "ud517OUHO0xlMQjhb0JxIQ": {
    "date": "4/25/2008",
    "text": "An excellent little cafe, whether you want to grab a quick bite on the go or sit in and have a big cooked breakfast this place should be considered, i've been many times and will be going back many more, very cheap and tasty food, i'm getting hungry for one of their bacon rolls just writing this!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n0FSYxOyMgNZ8GFTP1pStw"
  },
  "k-6lb-oK0o8aJzmocDRZIA": {
    "date": "3/31/2011",
    "text": "This place does great and chesp fryups as well as proper big mugs of tea. Plus its obviously a local favourite!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JufckdsmxvT1mqvEuwJcHQ"
  },
  "CWI8DUMpOJwtmXGYcnh0rw": {
    "date": "3/28/2010",
    "text": "They've closed down - it's rotato, the spit-roast potato place, now.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4kS6cxNo8PCfKnScmCSYog"
  },
  "Yn1bSosVM-ouJl5IZ39z0A": {
    "date": "2/10/2009",
    "text": "A student and workman hang out, Snax is a small Cafe with a warm atmosphere, friendly staff and fantastic food. Wither your on your way to a lecture (it is located 2 minuets from George Square campus) or a traffic warden popping in for a quick bit to eat, Snax's generous menu will have something for you. It specialises in all day breakfasts (severed from opening at 7 to closing at 3-4) but also does excellent paninis and subs and a variety of other dishes. All the food is cooked in front of you at very good prices. The staff are always present and very friendly, leading to a very casual laid-back atmosphere and though they do sometimes get an order wrong, they are always happy to rectify it and more often than not the error leads to you getting free chips with your meal or some other little bonus. If your within a mile of this place, don't miss it - its the best breakfast/lunch cafe in Edinburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w90SctFrlfXTOjHthZSGeg"
  },
  "vT_sulN4P2ApsGvjvSNAxQ": {
    "date": "8/31/2019",
    "text": "Really low price, but the food tastes really good and offered with giant size. The atmosphere is really good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j3H73POy-zZjjJKuAINmJg"
  },
  "KtuVjlaohMwC_RH8oRfzHA": {
    "date": "6/30/2019",
    "text": "Excellent local food at an affordable price.  What a concept.  Try it out.  It's a no-nonsense small cafe near the University.  BTW, don't expect anything special; just simple Scottish food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r1BM6Jb4VKT_aRanY5fxcQ"
  },
  "iG31icfN2-3yY4l1TMkE8Q": {
    "date": "1/16/2019",
    "text": "This was just what I needed after arriving in Edinburgh after at least 9 hours of flying. Prices are great, food is great. Portions were a bit smaller than I was expecting but it is high quality food. Vegetarian-friendly as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ly7aOKKwfBk0OpTWjFCbIQ"
  },
  "n8Dn9gonMeFdLK9jBec5iQ": {
    "date": "6/30/2016",
    "text": "I tried their biggest breakfast and it was literally the biggest breakfast i've had in Edinburgh. I wont list everything that comes with the breakfast, but as a visitor, I appreciated that i could try the haggis, black pudding and tattie scone in one meal.  I left the restaurant stuffed after this meal. For the amount of food that i ordered, it was pretty cheap as well. Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6mjWlN7PnhWlkFJQbYQdfA",
        "caption": "Photo of Snax Cafe - Edinburgh, United Kingdom. The biggest breakfast. Its huge.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6mjWlN7PnhWlkFJQbYQdfA/o.jpg"
      }
    ],
    "user_id": "P8qK9bvWta-kDCT0NUyx4g"
  },
  "AQ2OnjhA28KFu9xG_OJV_A": {
    "date": "3/30/2016",
    "text": "Is cheap and cheerful... Full breakie for a fiver...  Solid greasy spoon!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "eKc2gY6fPaQy3zNsbIYDvA"
  },
  "sSkUiyhSKJ72XAhW8vYcBw": {
    "date": "3/10/2016",
    "text": "If you factor price, service quality, and taste, Snax is 5 stars no question.  It's definitely your typical hangover or drunk food. They do have salads and somewhat healthier options, but I wouldn't come here if you're looking for a little salad.  I'm from America and a good burger is a staple for a happy person's diet (note, happy not healthy). Snax has the best burgers I've personally tried in Edinburgh; I'm sure there are other great options out there, but the value here is incredible. You're able to get a double bacon cheeseburger with chips for less than 5 quid. Unreal.  Do beware that Snax closes at 5 PM (17:00 if you will), so don't expect to come here after the drunchies. For students, this is prime if you ride the potterow shuttle bus, since this is the first stop on the way home from Kings.  Enjoy with no regrets. Burgers and paninis are the way to go!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RNwIh9YMoWWz5g-eGg43aw",
        "caption": "Photo of Snax Cafe - Edinburgh, United Kingdom. Mexican chicken panini with chips",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RNwIh9YMoWWz5g-eGg43aw/o.jpg"
      },
      {
        "img_id": "F2FFf7AnudQ6fMc1mCs4mg",
        "caption": "Photo of Snax Cafe - Edinburgh, United Kingdom. friend got a veggie burger",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/F2FFf7AnudQ6fMc1mCs4mg/o.jpg"
      }
    ],
    "user_id": "tbjcds39O4I6R0UsAQGFlQ"
  },
  "IeODCsl_za5vzaMfDUlohA": {
    "date": "12/16/2015",
    "text": "I've been here a few times now and have always got some form of the breakfast (most recently the biggest breakfast) and it's just damn good!   If you're looking for a fancy upmarket breakfast then don't come here but if you want a solid full Scottish for an awesome price(5 for the lot) with well cooked everything(even a runny egg) then here's your place.   It's usually busy breakfast and lunch but people filter in and out very quickly and the staff are always helpful and friendly so you won't ever feel awkward. The breakfast tied my friends and I over for the day but we loved it so much we had to go back the next day.  The other bits and bobs are what you would expect from a greasy spoon cafe but it all tastes fresh and exactly what you need after a night out. Don't eat the biggest breakfast before work! That wouldn't be a productive morning.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "jJUwXDLtWyS-zzIFEgxz8Q",
        "caption": "Photo of Snax Cafe - Edinburgh, United Kingdom. The biggest breakfast",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jJUwXDLtWyS-zzIFEgxz8Q/o.jpg"
      }
    ],
    "user_id": "BcvtWhc5-1S_Dr0A3Esimg"
  },
  "OtVTa03nURWH16dO4dWfsA": {
    "date": "12/2/2015",
    "text": "I used to live directly opposite Snax, so it will always have a special place in my heart. The amount of hangovers it's cured, it set me up for many early morning runs to the library, and has never let me down!  I Always get the Bigger Breakfast. It has everything I could want on a breakfast, hash brown, tattle scone, link or square sausages, eggs, bacon, beans and toast. It also comes with a black pudding but I always swap it for another sausage or tattle scone depending on my mood.   The staff are friendly, accommodating, even when the queue has been out of the door!   It's cheap, cheerful, it is covered in posters for events all over the city, their music is always spot on. I really just can't fault it.  On this occasion my sausages weren't that great, a little hard, and for the first time in the history of eating at Snax I had to complain about them. The guy was so apologetic and brought out a plate of four new sausages!   One of my favourite places in Edinburgh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PiFoNKtgthASrn8sh7jBRg",
        "caption": "Photo of Snax Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PiFoNKtgthASrn8sh7jBRg/o.jpg"
      },
      {
        "img_id": "HCcaEbSiZcy3cAUl0nTZ-w",
        "caption": "Photo of Snax Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HCcaEbSiZcy3cAUl0nTZ-w/o.jpg"
      }
    ],
    "user_id": "DQAUe-9wWoPJjSNkxk1mzA"
  },
  "H9G93OTYtla6nU2r_ej2sQ": {
    "date": "12/11/2015",
    "text": "It's a typical greasy spoon. You know exactly what you're going to get, and they don't disappoint. With a HUGE breakfast menu, Snax really has something for everyone, and for an excellent price too. I had a simple bacon and egg roll with a cup of tea, and the food was made fresh and was very tasty indeed.  The place is simple, with some tables and chairs scattered around. Finding a seat can be very difficult sometimes. There is a plethora of posters on the walls advertising events, exhibitions, shows etc. No better place to find out what's happening in Edinburgh! Prices are low, food is good. Service is not the best, I will say that, but I'm overall happy to recommend the place for the value on offer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KvucOc1_GGHMkDrGFg8ang",
        "caption": "Photo of Snax Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KvucOc1_GGHMkDrGFg8ang/o.jpg"
      }
    ],
    "user_id": "RMOJLdLHdFai_ksWCMDOoA"
  },
  "YKVJ9REvxl3FL7vvWtITtg": {
    "date": "5/28/2017",
    "text": "Great place for a quick snack or meal but if you expect a full restaurant experience you've come to the wrong place. You need to find your own seating space after you order, and they bring the food to you. The classic order is their Scottish breakfast, which comes in three sizes. I got the \"biggest breakfast\" with does come with haggis, for the adventurous. Was a delicious meal, but can be on the salty side for some. For five pounds, great value for what you pay for. They also have burgers and paninis if you don't want breakfast foods.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lSOd7xynRdkUAalcvenOAA"
  },
  "W5YF11w0lLCvRDHFNzdLng": {
    "date": "10/9/2016",
    "text": "Got a ham panini but it was super greasy and didn't enjoy it that much. But I guess they are supposed to be greasy...so good place if that's what you're looking for I guess. I've definitely had much better paninis at other restaurants.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_OrPKdnwd2_JnsgissooNw"
  },
  "l3qQv1ffjBzS7MBy3jSQrw": {
    "date": "4/29/2013",
    "text": "This no-nonsense greasy spoon has become one of my favourite local conveniences. They do hearty breakfast / brunch / lunch meals and snacks. I love it for it's good, reasonably priced food, and generous portions. And the fact that they're not shy to play good music; you can rock out to Jimi, ACDC, etc, while grinding down your haggis roll. But most of all, they earn 5 stars for always being very friendly and enthusiastic. This place puts me in a good mood, and as a consequence, I'm likely to die happy in my 30's of a heart attack!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 4
    },
    "photos": [],
    "user_id": "k_VkNVPou-CS1gyvN5AsUw"
  },
  "iA9E8FleKqmPNFCJ0x5Tgw": {
    "date": "12/1/2012",
    "text": "Ah, Snax you have saved me from a hangover on more than one occasion and provided me with an enjoyable lunch even more frequently. Your staff are cool and often I can hear rock or metal playing in the background, in short you are a greasy spoon but you're my sort of greasy spoon!  So yes this is the place to go for bacon/sausage/egg/haggis in a roll or on a plate with potato scones, hash browns and beans and that is one of the reasons it is almost always busy around lunch time.  Aside from the fry-up nirvana Snax also sell some fairly decent soup and make a reasonable chili (served with chips, baked potato or on a hotdog) so yes it is comfort food, but sometimes that is exactly what you want.  Here is the final surprise, Snax also make a decent cup of coffee, so there you go, an ideal breakfast/lunch place, just be aware there is often a queue.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GN3wBXDaLLmY6Oitfy3T8g"
  },
  "z1QYsjhPTdlvzenIX-6GSw": {
    "date": "7/15/2015",
    "text": "In this case you get more than you pay for. A small cafe with too many tables and chairs squeezed in, very inexpensive food that is generally very good,  friendly service - a great old-Edinburgh-style student hangout. Try the Haggis Roll, the Bacon Roll, or the full Breakfast..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "inKaQIBzXTcGxt9Z9CJTwA"
  },
  "MQIxR25Y1CvozEIGSFcfNw": {
    "date": "6/8/2015",
    "text": "Among my fondest memories of living in Edinburgh is Snax Cafe. Hidden in an alley just off Princes Street is this little hole in the wall with an incredible variety of eats, from burgers to mac & cheese. The burgers are an absolute highlight, being both big and delicious. As if it couldn't be any better, Snax is also one of the cheapest places to grab a bite in all of Edinburgh. Thank you, Snax.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GpbRs_UlAwzLNxt32RuMbA"
  },
  "r9ABEEwmgd1SX_20iRWJkg": {
    "date": "11/3/2012",
    "text": "As a fine dining, date night, location Snax gets 1 star but it isn't fine dining it's a greasy spoon and it is what it is.  Prices that can be described as \"Student friendly\".  The breakfasts come with a roll big enough to fit your whole breakfast in. You should do that and send me a photo.  Can get very busy at peak times so you should phone ahead and book a table. Nah, you shouldn't do that you'd look like an idiot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UfLGgjd6UExBVZb6JRJiQA"
  },
  "auoLPhKwVtA4bnjERbj1IQ": {
    "date": "4/16/2010",
    "text": "Snax is my deffinition of the ultimate 'Greasy Spoon' cafe - great food, local and best of all cheap.  If Snax could bottle its ability to cure hangovers, it would make a fortune. I mean it, the breakfasts are unbelievable. Morning rolls stuffed with just about anything you can imagine or huge plates of fried breakfast just ready to set you up for the day. In fact, I dont think the breakfasts are just good for hangovers - generally if you cant face the idea of boring cereal and toast, Snax is your best bet.  Snax isnt just about greasy breakfasts - no. They have a huge range of sandwiches/paninis/hot mains all for a couple of pounds, making it simply the best value I can think of in pretty much all of Edinburgh. The food isnt the best quality, but it is tasty, filling and you will never feel dissapointed. I personally recommend the Chilli con Carni - a massive bowl of chilli, tortilla's and a load of sour cream. Ace.  The staff are friendly, full of banter and genuinly seem happy with there work - if the sporadic out bursts of innfectious laughter are anything to go by.  There are a few problems with Snax however - the lunch time rush brings in a huge amount of people, that the cafe itself cant handly because there just isnt enough room, but also (and understandably) the wait for your order increases exponentially - which can be very annoying when all you are waiting for is a toastie, rather than a full cooked breakfast.  This of course doesnt matter, in fact it is most likely a testament to how excellent Snax Cafe is.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bHUZVBexODxFgb5_mYcHYw",
        "caption": "Photo of Snax Cafe - Edinburgh, United Kingdom. Snax",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bHUZVBexODxFgb5_mYcHYw/o.jpg"
      }
    ],
    "user_id": "SxV1Jq7UANuSYpn42JXvOA"
  },
  "m4e2MDKxzE9xqU0CyxkIJA": {
    "date": "2/26/2014",
    "text": "My favourite place in all of Edinburgh.  *I have to admit that I've never eaten here not hungover/still drunk **Still the greatest",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nc9Z92irQEzxGQ6-IAIDog"
  },
  "DvqsqaAiBoDEtsTqKWGsRQ": {
    "date": "7/7/2010",
    "text": "I come here for lunch pretty often and it always offers a decent, filling meal at a value for money price.  Inside it feels clean and fresh with friendly and quick service.  This efficient service is important as it's always rammed around breakfast and lunch time.  Their square sausage in a roll is just one of the gems on their breakfast menu which are always delicious cooked to order.   On their lunch menu they have a great range of toasties, paninis and burgers.  Their cheese burgers are amazing, juicy and served on a nicely toasted bun. Snax Cafe is an ideal place to come for lunch or on your way to uni/work.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FUVeIw92ZjpEvUXmBVYn3Q",
        "caption": "Photo of Snax Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FUVeIw92ZjpEvUXmBVYn3Q/o.jpg"
      }
    ],
    "user_id": "yfXqZkU5iXE07GSHzdsQBA"
  },
  "RkhL9cLQQXcl50jmti27DA": {
    "date": "2/7/2014",
    "text": "Pretty standard fair.  I really like their nachos.  Great for a cheap snack when you're in a rush.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ekNHB8kEJnYM1SwmyF7QgQ"
  }
}