{
  "Ly8LwzIDxuClqQM7jxOrGg": {
    "date": "8/26/2016",
    "text": "Sweet place. Built on the site of an old time chemistry larder (what is it?) from time bygone, now call vintage, very cool. I had a gluten free Frittata, really tasty, the dressing on the salad was smashingly good. And a pot of Secret Herb Duchess Grey with steamed soy and honey. It was strong, in Scotland they know how to make a cup of teah! The honey was fragrant with flowers. The soy thick and creamy. Thumbs up.   Beware, they close -- why? -- between 5 and 6pm for a rest and reset. If you come at 4:45 and order something, it's a short stay.   I came again and had a Kaleidoscope soda and the poem on the label: What you are I'll never know or barely care to ask.  But if I did I'd ask you if, you'd lived or chose to pass?  Did you fill your summer days or pass them in a haze?  And summer nights to dizzy heights, in noisy city street? First times, first loves, all set to burst, the way it ought to be.  Though now it seems to pass me by, I scarcely stop to see.  And in the end, I am these things I barely comprehend, Kaleidoscope of memory, is all the parts of me.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "x44lrd9cYnFMWCySsZTROQ",
        "caption": "Photo of Maxies Cafe - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/x44lrd9cYnFMWCySsZTROQ/o.jpg"
      }
    ],
    "user_id": "V75YT6Vq9UVUIw-Af5XGOg"
  },
  "Sius2A8mijlhDjG7PNcXKQ": {
    "date": "4/28/2008",
    "text": "This is a good place to relax in - a bright space with a wide selection of teas including fair trade and organic, and cakes, sandwiches, soup, etc. It's quite a popular place. The prices are not too bad, either. Also, it is in a brilliant district for charity shop shopping, as there are several shops in the same street that often have great bargains in them.  This is a daytime cafe and closes in the evening.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X42QbBZjG0llxV7Eadgypw"
  },
  "_VXNlQ4N351L0_prsmhZtA": {
    "date": "10/1/2008",
    "text": "love this place!! The food is good wholesome home cooked and the cakes are to die for!! Would also recommend the breakfast selection they have. I have a 3 month baby and we love going here as they welcome you which makes a change from a lot of these places.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AJ67-fSW3Wm8rapgZnXeBg"
  }
}