{
  "ZDJYBPzryTi1y99he8ebdw": {
    "date": "1/30/2016",
    "text": "The food here is exquisite.  Matched well with wines from the Langedoc region of France, the food here is delicious.  I took a couple of special life long friends and they loved the dinner as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5hMS9P4tEPMwS6iwxqMK3w"
  },
  "B37a4IQwAbYUZkjA7am0GA": {
    "date": "2/27/2011",
    "text": "Definitely Meh I've experienced better- especially in a culinary city like Edinburgh! With as much hype as this place has been getting recently I was hoping for a yummy lunch and a new favourite place to adopt. Plus their appealing lunch deals meant that a visit was in order and very soon, so when my mum came up for a visit I thought it would be an ideal treat.  I'll skip to the important stuff: - potatoes with my main (pork) were hard in the middle- not cooked at all. -slow cooked pork: over cooked and hard (far away from melt-in-your mouth goodness I was hoping for). -My mum's fish main was OK, OK being that it was good but nothing really to write home about. -the desserts, walnut tart and coffee ice cream and chocolate parfait with marshmallows and raspberries were a bit disappointing. There was nothing exactly wrong with them, the chocolate was too heavy (never thought I would say that about chocolate) and the walnut tart was mediocre.  -plus be careful if you are going for the appealing lunch menu deals cause the various add ons tend to add enough on the bill).  All in all if it wasn't for it's hype it would be an alright restaurant, sort of at the medium level of all the other restaurants this city has. It wasn't packed, the view is from the front windows and the staff were alright. Didn't really get the feel of a rustic french food place and I have a feeling the publicity was a bit damaging to their quality. Perhaps they were having a bad day or something. I would like to try their other restaurant in New Town but I would not rush back to this one any time soon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "nhVvcPyRGLw466qHVbUjrA"
  },
  "CwWVY16OOO_710VVkc7iNQ": {
    "date": "2/9/2009",
    "text": "At 13.50 for 3 courses the January sale here was definitely good value for money and at 13:30 on a Friday the place was virtually full so had clearly caught a number of eyes. I'd been interested in paying it a visit for a while so my birthday offered a good opportunity.   Service-wise I got the impression that an extra member of staff would have made quite a difference - my starter arrived near instantaneously after it was ordered (tasty oxtail terrine so I suppose it was just a question of slicing it and delivering it to the table) yet the main courses took far longer than you'd normally expect. Our waitress was though very able. They were good when they got there though - my no nonsense duck and beans went down a treat. My parents both enjoyed the apple tarts they had for dessert, but felt that the main course fish could have down with more veg or the option of a side-order of such. Within the terms of the deal the cheese board was fine and certainly had enough biscuits but 5 for brie and something un-named, even with the blob of quince jelly would I think have seemed too much to pay on its own.   We had a pleasant Merlot to wash it all down but having no wine cheaper than 15.50 is I think something else that this establishment needs to look at, particularly in these financially straitened times.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "txzOZrHK9EVY0kYjSuXkKg"
  },
  "5JMYtOkd9TdeOgluhSTVPA": {
    "date": "2/22/2011",
    "text": "2010's Good Food restaurant of the year in Scotland and contender on Gordon Ramsey's best restaurant quest in the French category.  Came here for lunch, there was a simple but varied set menu at a very reasonable price. The food is delicious and the staff are very tentative and know what they are talking about.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "QQM6jv7CoAEb71wW8Qvi2Q"
  },
  "-o7P5ZyaVR-NSvcgt0hbCw": {
    "date": "5/7/2014",
    "text": "Nice French restaurant near the Royal Mile.  I went here for their 15.50 3-course lunch special and enjoyed ham croquettes, chicken casserole w/ peas, potatoes, & onions, followed by chocolate mousse.  The service was a bit slow, taking about 10 minutes to take my order and another 10 minutes & 2 requests to pay the check at the end.  Other than that, it was a very nice lunch & I will probably will return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "M1o5JhYaYD_71ULu1Iw7kg"
  },
  "N-qvRcoweDPcQ583oXL73Q": {
    "date": "1/24/2012",
    "text": "I've been to this restaurant on several occasions, and have always enjoyed the food there. Yesterday, I took a group of 14 for dinner, and both the food and service were excellent. As a starter, I had baked goats cheese with almonds and beetroot dressing. This was a fantastic blend of tastes. My main course was slow cooked check of beef in red wine sauce with spinach, tomatoes, olives and pasta gratin. It was as awesome as it sounds! The entire group loved the range of food. This is now firmly in my top three list of Edinburgh restaurants. I want to go back! Now!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "EAXWjnCLv5l_rP6sszQNGA"
  },
  "ou2YYLBIFy5KaCmiEjsGjA": {
    "date": "12/24/2014",
    "text": "Very disappointing Christmas Eve dinner. Lovely venue...but food was \"meh\" and service was worse. I",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZSOMacGy0kFcwBVn44XUiA"
  },
  "96Un_hc8OZax9JWsu3woKA": {
    "date": "8/21/2012",
    "text": "Went here on a recommendation from a friend. Small, pretty restaurant just off the royal mile. Food was amazing, and good value with 2 courses from the lunch menu were 12 pounds. Would go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-K78Uw-3Z_Ph0JCx0FXNig"
  },
  "0RtQkUk-pCockweYUsCE9Q": {
    "date": "8/29/2008",
    "text": "I organised a work's Christmas party here a few years back based on a recommendation. It had to be worth a try! They were amenable enough to let us book the whole restaurant out (always a prerequisite for our office parties), so the organisation kicked off superbly!   But what about the food? Well, the meat eaters in the group seemed relatively contented with what they were served (although the profuse amount of alcohol in circulation may have had something to do with this). But the vegetarians amongst us most certainly weren't happy. The food was bland, tasteless, the pasta had that microwaved 'rubbery' texture (yum) and we were generally unhappy with what we'd been served. And for the record, I was sober that night (curse of the antibiotics, but a blessing due to the fact I got to snigger at all of the latecomers in work the next day, heads on their desks, and sheepish glances as they weren't sure 'quite' what they needed to be embarrassed about or apologising for).   The ambience waswellbright. And I'm talking about the lighting. Too bright in fact. Glaringly bright spotlights over-emphasise the white walls and to me, the place just lacked character. I much prefer a subdued and dimly lit restaurant.   The service was rather frosty - I guess this matches the white walls and lighting however. Admittedly, we did stay late and the staff were probably hoping to have escaped home, but the service had been like this from the beginning.   I've been to worse restaurants, but for the price, I expected a lot more. I wouldn't go back. Mediocre food, a lack of atmosphere and average serviceit doesn't really fill me with enthusiasm unfortunately.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UzinZcZEaJKc07hBuHTcQw"
  },
  "9z7QbU4oO2DHM4zIFszKRg": {
    "date": "6/6/2008",
    "text": "I went there with a lot of expectation and I left the restaurant very very disapointed The menu is very expendive for what it is. I took a fish soup (that was good but not special), then the cassoulet (not very good and a very small portion of meat) and finally I had the lavander creme brulee: fisrt the creme brulee was cold and there was no crispy layer as it should; it was like the creme brulee was prepared hours ago and for me the lavander taste was too strong (It was like eating laundry soap).....  Everything was precooked thus the cook had nothing to do except chatting with his guests and put the food in the microwave The menu cost around 30 pounds !!!! Never again for me For me la Garrigue is a posh restaurant with bad food and an overated chef or a lazy chef!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cQdEGncnlATzhofkT_5dsg"
  },
  "QRI89AWhyLzc_ea8cBayPg": {
    "date": "7/4/2008",
    "text": "went here one rainy night, and got straight into their speciality cocktail, which is something and champagne.its lethal! the spicy fish soup is obviously an acquired taste but the duck was deliciously tender and not at all fatty as you would normally expect. dessert was looking like a possibilty until after the third cocktail.will be back as soon as the memory of the hangover has faded sufficiently",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mJM9uvrQ0q1nrSn1xRbHQQ"
  },
  "ouo1eQqUZ9zOzClALJNfuw": {
    "date": "8/3/2019",
    "text": "Authentically great French food, excellent service, expert wine list.  Quiet and a welcome break from Edinburgh at peak August festival time.  Highly, highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t-qxKiM-YWTGMUDMf3Rv8g"
  },
  "My9f_ztGJp1LatAzfgi7Hw": {
    "date": "8/16/2018",
    "text": "They were able to accommodate our party of 14 at the last minute and they were SO amazing about it. I'm usually nervous about going to a restaurant with a large party, but they didn't lapse in their excellence in any capacity. The food was outstanding, the service was excellent, and the overall experience was memorable and delicious.   I really enjoyed the ham hock terrine and their selection of bubbly appertifs was unique and delicious.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "4ImNK5q4EIqi5aiuiPMBFw",
        "caption": "Photo of La Garrigue - Edinburgh, United Kingdom. Poached pear",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4ImNK5q4EIqi5aiuiPMBFw/o.jpg"
      },
      {
        "img_id": "jjIFshhYEy4dxfjygllmvA",
        "caption": "Photo of La Garrigue - Edinburgh, United Kingdom. Slow-cooked beef cheek with polenta and black olives",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jjIFshhYEy4dxfjygllmvA/o.jpg"
      },
      {
        "img_id": "WZAVJ68Wxn6nmsmLa47h9w",
        "caption": "Photo of La Garrigue - Edinburgh, United Kingdom. Asparagus leek chilled soup amuse bouche with goat cheese cracker",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WZAVJ68Wxn6nmsmLa47h9w/o.jpg"
      }
    ],
    "user_id": "nwyn40lYhUyEZn3J2a8Xyg"
  },
  "6H_NrYGsSxL2zJQZ9OGeuA": {
    "date": "4/20/2018",
    "text": "The food was exceptional. What a way to end our trip to Scotland. My friend and I decided to each do two appetizers instead of an entree to try the most out of he menu. I had the breaded soft poached egg with wild mushroom ragout and crispy pancetta. It was so flavorful! The ragout was delicious and hearty. The egg was a wonder and I still can't figure out how they cooked it. My friend had ordered the fish soup but after it was too fishy for her they kindly swapped it out for what I had but without the pancetta. She then had the king scallop which was a huge portion as they also included the foot. The sauce was so flavorful and bright. I had their homemade foie gras. Smooth and delightful, it came with a delicious raisin marmalade. The service was excellent and the food was superb. If you find yourself in Edinburgh and want some French food do yourself a favor and check this place out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "614WMjitdA90UHKxcTICGw"
  },
  "doXIcUPBmvTotezV5n-rMQ": {
    "date": "12/16/2017",
    "text": "Very warm and friendly staffs, service is great, food is excellent.   Kind of Franco Scottish Cuisine, will come back again. The rabbit dish is delicious. I for get other dishes' name , but they are all very good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KPToWYkUv6mOZ-rU98wNAQ",
        "caption": "Photo of La Garrigue - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KPToWYkUv6mOZ-rU98wNAQ/o.jpg"
      },
      {
        "img_id": "e0DpBs_-kZCQMQLinFgwSA",
        "caption": "Photo of La Garrigue - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/e0DpBs_-kZCQMQLinFgwSA/o.jpg"
      },
      {
        "img_id": "cMTe6oDEzvNiBPJehOo0eg",
        "caption": "Photo of La Garrigue - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cMTe6oDEzvNiBPJehOo0eg/o.jpg"
      }
    ],
    "user_id": "nVgS5-Lmgoz4MJU06RpuBA"
  },
  "LiYuxZWxfZiqf_zGdGKJMQ": {
    "date": "6/12/2018",
    "text": "I've been living in Edinburgh for a few months now, and this was one of the nicest dinners I have had. The wine was exceptional, coming mostly from the Languedoc region of France. The food was great. I had the Cassoulet, a favorite of mine that I like to try and French restaurants, and the service was so very detailed and friendly. We had received a gift certificate from my partner's granny and had trouble arranging (and rearranging) the time for the reservation, and the staff of LaGarrigue were incredibly patient and accommodating with us which mattered a lot in the overall experience. I have worked in the service industry for years, and I rarely seem to find a place that combines both excellence in food and service in such a sophisticated but comfortable way. This place did just that.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pzlkl8rH2wN4YMiU3dXV3w"
  },
  "gcoKOIIyjmo47wez7xaTNg": {
    "date": "6/18/2018",
    "text": "Staff are very attentive and very unpretentious. They serve very nice food. It has a small, family owned sort of feel to it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QFO9jF7OVzaHLPuk4_DqiA"
  },
  "_Axj-ixdkNOQVVPfupUTDw": {
    "date": "7/6/2017",
    "text": "I arrived at La Garrigue early (around 6pm) and was able to get a table without a reservation.   As I wasn't very hungry, I only ordered a main dish: the chicken breast with courgette cake in smoked tomato sauce.  The dish was delicious with the chicken breast tender and moist, and the smoked tomato sauce paired well with the courgette cake!  The desserts looked amazing (lavender creme brulee, olive oil ice cream!), I hope to return for the desserts!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "dSBkPxqUjJ9W-RZdR9XN7w"
  },
  "p4Zm8J0RRyqZ9Sp0v4eXpg": {
    "date": "7/2/2016",
    "text": "Service is efficient and prompt and quite attentive. The setting and the ambience isn't pretentious like you'd expect from a well renowned French restaurant. It's very down to earth with a nice view of Old town Edinburgh.   We ordered Pigeon breast with Apple & spinach. Which was amazing and the Apple didn't taste like an apple and the red wine reduction was nice as well. I had a cauliflower soup which was very smooth and light and didn't taste like cauliflower and was full of flavor.   For the mains we ordered Fillet of pork, pork cheeks & pork trotters. This was a small portion, but full of flavor. It was also very filling for a small portion. I had a duck leg casserole with lots of beans and sausage in there. Apparently this is the most tradition homemade grandma's kitchen type of dish from the south of France. But I did prefer the Fillet of pork better. Very nice restaurant and the staff was very friendly and were keen to explain things voluntarily without even being asked. Which was a nice departure from the typical stoic abrasive service we've received so far in Edinburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fhap5oGDpNem2RACBs2-UQ",
        "caption": "Photo of La Garrigue - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fhap5oGDpNem2RACBs2-UQ/o.jpg"
      },
      {
        "img_id": "im4JkkXv1m1zfVX7oGgH6A",
        "caption": "Photo of La Garrigue - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/im4JkkXv1m1zfVX7oGgH6A/o.jpg"
      },
      {
        "img_id": "RuJpRt5-rLqG1_XUH_U2LQ",
        "caption": "Photo of La Garrigue - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RuJpRt5-rLqG1_XUH_U2LQ/o.jpg"
      }
    ],
    "user_id": "m-NJb7g1fdCqtzhvQuN24A"
  },
  "S4OUs5yd2Iu2_GD1em9F9A": {
    "date": "2/29/2016",
    "text": "Went here for a Valentine's dinner.  Was accommodating in moving our reservation slightly earlier and had excellent service. We ordered from the a la carte menu although there was a set Valentine's menu because it had lots of seafood that is be allergic to.  I saw quite happy with my choices..  Pigeon breast with spinach and apple,  rabbit with caviar, aubergine and wine sauce, finished with an apple chestnut dessert with ice cream. My hubby got a fish soup such was quite fishy and needed more salt,  pork tenderloin with pig cheek and 'trotters croquettes', and creme brule.  French cuisine is great for special occasions and we weren't disappointed.  We were also apple to pay with an app called Zapper, which was really convenient and apparently doubles the server's tip on the last Friday of the month!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "-h59jD7ldZixxmh8iKAmQg",
        "caption": "Photo of La Garrigue - Edinburgh, United Kingdom. French Rabbit",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-h59jD7ldZixxmh8iKAmQg/o.jpg"
      },
      {
        "img_id": "Jsl-jLyzRQFkOhWMyV-GIg",
        "caption": "Photo of La Garrigue - Edinburgh, United Kingdom. French Rabbit..",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Jsl-jLyzRQFkOhWMyV-GIg/o.jpg"
      },
      {
        "img_id": "2ZnsF6a_YeUnhlacEz7Tbw",
        "caption": "Photo of La Garrigue - Edinburgh, United Kingdom. Pigeon breast with apple and spinach",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2ZnsF6a_YeUnhlacEz7Tbw/o.jpg"
      }
    ],
    "user_id": "PbgqvUdjTRh-HoJUqRvlmg"
  },
  "Utde7cW0gXqTnPpmIaGszQ": {
    "date": "12/19/2015",
    "text": "I've been here two years in a row for work Christmas lunch and this place is great. I don't know why I haven't visited at other times of the year?  Reservations are easily made and the staff are well organised with pre-booked and pre-ordered food so we always know what we're getting and when. Food comes out at a decent pace and all of got our courses at the same time so there was no awkward waiting around ages for someone to get there's before you start. The drinks also flowed at a good pace, which helps.  The quality of the food is bloody brilliant. I haven't looked at the regular menu but the 3 course Christmas lunch is only 17.50 and for that I had a seafood flan started, a perfectly cooked duck leg main, and a satisfying vacherin dessert.  Right, that's it - I'm off to book a table for January for a proper dinner!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "97JTwCnKnyTHpr6fp-sNdA"
  },
  "OVN3aUHnjHQoDDFJlxejew": {
    "date": "2/7/2015",
    "text": "Great lunch at La Garrigue. I went there with a groupon voucher for 3 courses with a aperitic cocktail, hoping for good things and I can say it was all absolutely delicious.  We started off with an interesting aperitif of chestnut liqueur and white wine - don't think I have had that before but it was a nice start for the lunch.   I had the endive, pear, roquefort and walnut salad for my starter. It was very tasty, just the right amount of 'everything' and nicely dressed salad. The only thing is that it was served in a bowl which wasn't entirely practical eating, but when it tastes this good it's not a big deal...  For main course I ordered the toulouse sausage with apple, grapes and potato. Again, so tasty!   Finally, dessert. I had the baked cheese cake with a poached pear. It was a small portion, I ate it all... The flavours were good, though the cheese cake for my taste was maybe a tad 'wet' but I polished it off nevertheless.  Great food and great service - very friendly staff who truly make you feel welcome.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yuFHrb8YQtVuzu0eEXvJtA"
  },
  "_kcgVS4mLvGMBIBmuHnnqQ": {
    "date": "4/8/2015",
    "text": "I was quite apprehensive about going here because it's French and the French are known for their exquisite and sophisticated cuisine. I'm quite a fussy eater so, I wasn't sure if there would be anything I would like on the menu...  I started off with the soup- Parsnip and Cauliflower (I don't usually go for cauliflower) and it was great! It was rich and creamy, but not too creamy. The bread supplied was good, but it wasn't warm.   I then had the cheek of beef for my main course. I have never had beef so tender before. My knife just fell through it. The vegetables were a bit too crunchy for me and a bit tasteless.   I haven't had creme brulee before, so I had it for dessert here. It was gorgeous. So creamy and disgustingly sweet (but I like sweet things...). The wine was good too.   I would have given it four stars but the food was just a bit too rich for me (if you get me). I wasn't feeling very well the next day.   Perhaps good food just isn't for the wee lassie from Paisley...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xq-9imgF_ueORrZDWxeflw"
  },
  "zgYr0_kqnB9Lz3XBzX49-w": {
    "date": "8/3/2016",
    "text": "I was so pleased with my experience at La Garrigue. Outstanding, professional service from our waiter and wonderfully prepared food. I had the set 3-course menu with souffle, cassoulet, and creme brulee. Unlike other restaurants' set menus that serve mini-versions of the dishes, all 3 of these items were large portions at La Garrigue. They were served in perfect sequence, and the waiter even gave us extra time to finish our wine before bringing out the dessert course. Speaking of the wine - La Garrigue's list is approachable, affordable, and expertly chosen. I ordered the 2000 Chateau des Estanilles from Faugeres, which was remarkable. At 36 for a 16 year-old bottle, I definitely got my money's worth. An authentic, delicious French experience in the heart of Edinburgh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "J0srNS3XFuvqW_hxaBBa1A",
        "caption": "Photo of La Garrigue - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/J0srNS3XFuvqW_hxaBBa1A/o.jpg"
      }
    ],
    "user_id": "vVJsmh83zYmM-1qXCzvePg"
  },
  "Sd1vxoreoOQh9N2mLmUEjA": {
    "date": "11/25/2015",
    "text": "Apparently La Garrigue is an Edinburgh institution but as I've lived in Glasgow for the last hmmhmm years I'd not heard of it before.  The restaurant is very, very French, right down to the ladies loo with it's odd saloon swing doors (thankfully there is an outer lockable door).  All the staff we encountered were authentically French but despite that very friendly and helpful.  Vibrant colourful paintings of the owner's home village hang on the walls. The reasonable fixed price lunch menu was suitably interesante and I started with rabbit rillettes with celeriac and carrot salad followed by sea bream wrapped in smoked swordfish with mussels and puy lentils.  I'd never tried fish with lentils before but it was delicious as the smoky fish stood up well to the robust puy lentilles. A classic chocolate mousse with mint cream completed the experience. There is a well curated wine list with several available by the glass. Holding back the final star is a bit mean of me - I enjoyed the food, the room was comfortable, the service was good, the bread was excellent but somehow it all felt a bit too safe and didn't blow my socks off.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "yKM5bmrZhKNs1GGsNauqoA"
  },
  "2vOmzh3WwMwjW6yxYtww9Q": {
    "date": "7/20/2012",
    "text": "I was highly impressed with La Garrigue. The onion soup was the best I've been served in a French restaurant in Edinburgh. We had an issue with their coffee, so shared our review with the restaurant. Next day they commented on the blog to say that they'd spent time re-training their temporary staff, who were working when we were there, to ensure that better quality coffee was served in the future. I don't think you can ask for more responsive service than that, so well done to all concerned.  Overall, we said: \"On a rainy Edinburgh day, La Garrigue offered heartening dishes, and sent me nutritionally and spiritually restored to face the slings and arrows of outrageous afternoon fortune. I'd heartily recommend that you pay it a visit, to sample its good quality, well-presented dishes.\"",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "LURC3E0DoXYgN9aYTF3XOg"
  },
  "yv3J7VOLI8-izHq0hbBKRg": {
    "date": "7/23/2012",
    "text": "Had a dinner here with my partner and her Dad, and lunch with my Dad - both discerning gents (and Francophiles). We were all really, really impressed - with the food, with the service, and with the beautiful, bespoke furniture. The seafood soup and the steak were particular hits. Everything was perfect; only one small blip was made - coffees took longer than a couple of minutes, so we weren't charged for them.   My second visit was 2 months after the first (and at a different restaurant), but the restaurant manager recognised me immediately and greeted me warmly, which was a lovely start to the meal.   Price-wise, La Garrigue is particularly good value at lunch time, with their 'Prix Fixe' menu; if you go for dinner, however, the choice of dishes is is wider and the atmosphere mellower. Bon appetit!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "0S2KCUzFvnWvlRWaDMz7Ng"
  },
  "RrKPNzH1zR_H7uwhbAu9hQ": {
    "date": "11/30/2014",
    "text": "This is an awesome French Restaurant. If you're on the fence and wondering if you should eat here, stop thinking and do it. I started with fish broth soup that was served with my favorite sauce in the world - Rouille!  Smear some on the crusty bread and float it in the soup and you'll wonder how you're parents could be so cruel as to not give it to you in bottle form. Wife also had a delicious blue cheese souffle salad. The next course was another favorite, Cassoulet. So good! Again, So Good! This is French food done right. Yes, I love this little restaurant.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "twa3cUujI77fneOYg1G9YQ"
  },
  "zLo3PridvKrTDzU3IhLP-A": {
    "date": "9/18/2016",
    "text": "Probably my favorite place to eat in Edinburgh. Their confit of rabbit was particularly good (probably not the actual name of the dish but that's what I recall). The servers are very kind and helpful, especially when recommending wines. If you are visiting Edinburgh, try to have dinner here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aUiLS6gVuG_WM84FtSB7OQ"
  },
  "qwosA8o4C7jkwVWtBuSgsA": {
    "date": "8/6/2012",
    "text": "A rainy summers day in Edinburgh. I'm not here for the comedy festival, so I expected not to get in, but they were very accommodating. I skipped the starter and has the Coley for my main course, and some yummy cheeses for dessert. Gorgeous. Great service and timed perfectly. The waitress even went through my cheeses describing and naming each of them. Looking forward to my cheese dreams :-)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "w8YEQlJ4rFFa-RC4lLpiOg",
        "caption": "Photo of La Garrigue - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/w8YEQlJ4rFFa-RC4lLpiOg/o.jpg"
      },
      {
        "img_id": "WTe3estre2hhBJJjim6aTQ",
        "caption": "Photo of La Garrigue - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WTe3estre2hhBJJjim6aTQ/o.jpg"
      },
      {
        "img_id": "AAnqCt1_sSmmviHeflSc8w",
        "caption": "Photo of La Garrigue - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AAnqCt1_sSmmviHeflSc8w/o.jpg"
      }
    ],
    "user_id": "2GbY5VsA-sJ-_pjrVnVAtQ"
  },
  "X7jtVrd1h_Dqxv6q8adgdA": {
    "date": "4/28/2013",
    "text": "I was taken to this lovely restaurant last night by my lovely husband. He had been with work and had really rated it but it was my first visit. On first appearances this restaurant doesn't look all that much from the outside but inside it looks very rustic, authentic french with a great array of art work on the walls which makes it really appealing. The staff was so friendly and full of advice on the menu choices. The Food is top quality and at affordable prices. I would have to note that like over reviews the coffee took a little while to come. However thoroughly great restaurant that i would definetly recommend.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "KVzcPnrigbaQbfKhVBmp0w"
  }
}