{
  "ntcoG1JEfapMBjIh3FjatA": {
    "date": "5/23/2017",
    "text": "4 in our group. 3 had burgers, 1 fish and chips. All of us were satisfied.  I was impressed with my special requests ( burger as a wrap instead of a bun-- turned out great.)  I would definitely go back here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U9A7jOVPxlGt9qdmSCOgPQ"
  },
  "DdQOSlVf3nmdSubBPg1njw": {
    "date": "12/11/2016",
    "text": "After seeing the horrific wait for a table at Nando's down the hall (queue out the door!) We decided to venture down to the slightly dodgy end of the Omni to visit Filling Station.  The waitress who took us to our table was friendly and chatty and our waiter (Jaime) was great.   I had fish and chips and it was a massive portion! It was pretty expensive (12) but I got a 20% discount with my cinema ticket. Not bad considering the meal was good.  To drink I had Pepsi which was good but a little bit watery from all the ice in the glass.  The only real negative about the experience was that our table was next to the toilets and it was not busy so we could have been seated elsewhere.  While Filling Station is pretty pricey, the cinema discount is good and if you take part in their survey you get a 10 discount!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uPrXFSes-oYbkb8C0CFTYA",
        "caption": "Photo of Filling Station - Edinburgh, United Kingdom. Fish and chips!!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uPrXFSes-oYbkb8C0CFTYA/o.jpg"
      },
      {
        "img_id": "t6kZLolFjhGsTQGUM6UpJA",
        "caption": "Photo of Filling Station - Edinburgh, United Kingdom. Inside",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/t6kZLolFjhGsTQGUM6UpJA/o.jpg"
      },
      {
        "img_id": "_FJ7-J34_103tV5vKPm0lA",
        "caption": "Photo of Filling Station - Edinburgh, United Kingdom. Entrance",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_FJ7-J34_103tV5vKPm0lA/o.jpg"
      }
    ],
    "user_id": "bi9U1kSYSbo2kPh7Xxuayw"
  },
  "2zWj8jKi62lS1AmT3-v73g": {
    "date": "11/27/2017",
    "text": "Not my usual choice and I'm not sure I would go back in a hurry. Ordered chicken wings for starters and my friend ordered wings for her main. We both ended up with drumsticks!  We queried it with the waiter who admitted that he knew they were drumsticks but wasn't sure why and then asked aren't they the same part of the chicken anyway!? I also ordered the Ginger Beer which was advertised as Hartridge's at 350ml for 3.05; what did I end up with? Britvic 200ml still at the same price. The only Britvic items I saw on the menu were for 275ml fruit juice and neither were being charged at the premium of 3.05! My ribs were fatty and not piping hot, the celery sticks served with \"the wings\" were tired and dried out; would it have taken for the kitchen to chop the ends off rather than serving it like that to customers?  My onion rings were oily and burnt. Lastly, appreciate it was the end of the night and we were the last customers but I still would not to have expected to find the supervisor/manager standing in the middle of the restaurant busy tapping away on her mobile. I don't mind some chains but this was a disappointment and for the price they charge there are much better alternatives to try nearby!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qupg_mtIW68hXB8HB-1Xbg"
  },
  "XLkjqJ3hueIYNt2Vw6GkJQ": {
    "date": "12/10/2017",
    "text": "Yeh wasn't great today pizza was warm at best sat on the counter for about five minutes while they moaned at each other .rest of our table wasn't impressed with the food either will go else where next time",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ax7NI_ym7AADaFa5z--P4Q"
  },
  "EnpEONCiM-NDF6E3g0xsiA": {
    "date": "10/28/2014",
    "text": "Service good most of the time. If I was to sum up in 2 words what I think of the food it is FINGER LINKIN! !! Oh and great American drinks and cocktails",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gv6zmTxmhqTOI6iqML5xBw"
  }
}