{
  "8zvlkKaxByh9srzoefSKgw": {
    "date": "6/10/2011",
    "text": "Sucha good Chinese - completely love it and when they deliver everything is nice and fresh - not like most the other chineses - awesome",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MXdFKeqnoMDj180hlC7ttg"
  },
  "RXvI4inm2MHeLBncOYQ10Q": {
    "date": "9/14/2012",
    "text": "Just had a chow mein and it was by far the worst I have ever had. Luke warm and dry. Also had chips which were undercooked and hard. The meal was ready in about 3 minutes which isn't enough time to cook anything properly. It looks like a lovely clean modern place but I will never be back. Disgusting!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lax5AYo363JI8XPf9h-RwA"
  },
  "FOw8jSmjqnCxB6uvnFhmGQ": {
    "date": "9/5/2010",
    "text": "My favourite Chinese. Tastes VERY good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q3IPY0ZEtpboue7qPHyiug"
  },
  "hkyLyUuc_TPW3epaAK72cA": {
    "date": "7/28/2012",
    "text": "We ate here before going on to Madonna concert; Fantastic! The restaurant, although downstairs, is beautifully done & very clean. The service was excellent and the staff were charming. The food was AMAZING, in fact we are about to drive 30 minutes to get a takeaway from them (rather than using a local restaurant). The best Kung Po Chicken I've ever had!!! The house wine was a really good house wine too. Recommend, recommend , recommend! PS we come from West Lothian",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zhg21Rt1q9wZKkt5UnJEyg"
  },
  "PTBaiW7rm6NTcvrn59KRBA": {
    "date": "11/19/2008",
    "text": "I completely agree with the previous reviewer. Taste Good is an excellent takeaway, definitely the best I've tasted in Edinburgh. A great choice of dishes and reasonably priced - the meal deals are particularly good value, although they don't allow you to substitute dishes for others on the menu. The food is well prepared and delicious, not too stodgy, and definitely lives up to its name! Some dishes are, of course, better than others (the seaweed was rather too salty for my taste), but delivery is always within the time quoted (often earlier) and generally with a smile. A real gem!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "clcemNTSlJs3O7iv_Q7BFw"
  },
  "QDkU4m09Jxq_cQHAIQhhzw": {
    "date": "10/11/2009",
    "text": "taste good is without any shadow of a doubt the best Chinese restuant/takeaway I have had the fortunate chance to try out.   The appropriately named company have delicious food which is very fairly charged. The time it takes from order to collection is very good even during the peak times of the day. I have often bought my Friday night dinner from Taste Good and they are always very quick.   There is one minor negative though, what company is really perfect huh? the customer service over the phone and counter can sometimes be very impersonal and rushed. this can be expected though during peak times however it is something I particularly find a little bit annoying especially when you consider they have done everything else right.   If you are after a fantastic Chinese restruant or takeaway you would not do wrong with trying out Taste Good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gVqBIzihiWFkkCnfLdASQQ"
  },
  "TwyNux3wLcD3hE0JkR_roA": {
    "date": "9/22/2009",
    "text": "Definately the best chinese take away in Edinburgh. I have been going here for years. I would recommend the crispy chilli shredded beef, king prawn and blackbean sauce, spicy bean curd and lemon chicken...Always of a high standard and not gooey or greasy as I have experienced at other take aways. Delivery is always as specifiedand you can also order online. Although as mentioned before you can wait up to 1 hour at peak times for delivery, but worth the wait. Great stuff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "utymPwB_ESYxPzgz7Yh-IA"
  },
  "2otB2yijvJBRjTdPt0g7LQ": {
    "date": "8/17/2011",
    "text": "yummy very nice food, i must say their house special crispy noodle are the best in edinburghgood value and nice food",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uMJ_gLfOuw5Fo4-_giVr2A"
  },
  "ay5u3EPzzdcBvVO9fAnWyw": {
    "date": "5/7/2011",
    "text": "Good take away. Best fried rice in Edinburgh. Wouldn't recommend eating in, the restaurant is in a dungeon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yxplUTyzTXGz0Fj1doXWcA"
  },
  "Rwyoe0rT7DIn37fu427O1g": {
    "date": "2/5/2009",
    "text": "A modern funky Chinese restaurant and carry out. It is a bot more expensive than the other local ones but the food is much better. you can see into the kitchen and it is always sparkling. They do all the usual favorites but you get little of the repetitive sauces that you find in the cheaper places. Have only ever had carry outs as it is on the way home, but will recommend",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0CptBiovyRGXJDQxKL-aww"
  },
  "uCWqU3P-tAvYRwIVnKVHew": {
    "date": "11/13/2009",
    "text": "I will agree with everybody. I live next to the Taste good restaurant and quite often we visit this place. We tried almost everything from menu and there is one thing you can say about this guys - they are cooking brilliant food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dox0vSzJ15L6OiE7T8qyZA"
  },
  "5YVUKhZeiJczT4AK3B3ffg": {
    "date": "6/6/2019",
    "text": "Excellent authentic Cantonese cuisines using seasonal local ingredients. We had roasted duck, chicken 2-way, crayfish, lobster over noodles, braised winter melon, stir-fried greens. All excellent. Seafoods in Edinburgh is best!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "K-3glLgCfL2233JmWIpYbw",
        "caption": "Photo of Taste Good - Edinburgh, United Kingdom. Chicken two-way.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/K-3glLgCfL2233JmWIpYbw/o.jpg"
      },
      {
        "img_id": "tB572Bn4Fa_5vecAWtTVsQ",
        "caption": "Photo of Taste Good - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tB572Bn4Fa_5vecAWtTVsQ/o.jpg"
      }
    ],
    "user_id": "m1cLluXmXCDQu8MiEHHnqQ"
  },
  "BdBEA5onq6HQUIL3y96WcQ": {
    "date": "1/21/2016",
    "text": "Taste Good isn't the closest Chinese take away to my house anymore but it's still my go to option. The menu is huge and has an excellent range of veggie options. My usual choice is the chicken and cashew nuts which has way more cashew nuts and big bits of chicken than the same dish that I ordered from another take away.   It's much faster if you can go and collect from the store and there is a 1.80 delivery charge for orders under 19 it's still excellent value for money. The starters are 3 to 5, mains are 5 to 7 and fried rice 2.60.   They also gave me an awesome calendar in December with amazing chinese zodiac artwork for each month. It's sat on my desk and I've had a few people ask if it's from my trip to Thailand last year and be super surprised that it was free from a take away. If you're ordering soon ask if they have any left.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "5qkb06IntVwJx_XKUh6xDA",
        "caption": "Photo of Taste Good - Edinburgh, United Kingdom. Very pretty 2016 calendar from Taste Good",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5qkb06IntVwJx_XKUh6xDA/o.jpg"
      }
    ],
    "user_id": "uTRWF_Hd-Sbc164ixIP8ng"
  },
  "z0DW6PvOkSw4MJ8kqcMqCw": {
    "date": "6/2/2017",
    "text": "By far the best place to get Cantonese BBQ in Edinburgh. Roast belly pork, honey char siu, roast duck, soy chicken, etc., as well as standard dishes. Also one of the few places to get roast suckling pig.   Nice for restaurant or for take away.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4FxADcoBgm_8xqTyfmTIug"
  },
  "a3SLbji9WI14iEMvUyy2wg": {
    "date": "8/22/2015",
    "text": "This is my local Chinese take away, and I've never been disappointed. It has a great selection of starters that are always cooked perfectly crispy and never soggy like some takeaway options can be! Even the packaging of their take away boxes and bags are nice, and it's these little extra touches along with the tasty food that keep it at the top of my take away list!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "brpOnxaRsg56LK7OverL0A"
  },
  "nkCn6Hwak2jcqtfKlc0qaA": {
    "date": "3/16/2015",
    "text": "As part of continuing my search for a local Chinese, my roommate recommended this one. As I am a veggie, maybe I missed the real flavour of the BBQ and meat options, which might make this place special, but overall, there was just something missing. Our local Chinese in Leith was so amazing, I knew it would be hard to beat, but this definitely didn't come close.  I had a Spicy Bean curd, which was nice, but wasn't enough on its own with rice to really make a good dinner. We got some noodles, which tasted fine, but nothing special and definitely didn't make the top of my list due to them being sort of flavourless. You have to spend 26 to get free prawn crackers, which is pretty steep in my mind. The spring rolls were really good, good size and very tasty, but were almost 4 for just 2. I think we could have made better at home for that price.  Overall, it is a bit overpriced for what you are getting, which isn't much. I would rather go further to find a better local then eat here again. Although it is absolutely fine if you just want some basic Chinese. Maybe I didn't try the right things, but it didn't wow me.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "dPA1RBX8-pF54IQGvwpyRA"
  },
  "6tYsSbIsgCVnTYX47j0-gg": {
    "date": "11/21/2015",
    "text": "This is my local Chinese takeaway and I've tried a few different dishes from here. They are always packed full of flavour and you get a decent portion, including the meat and vegetables, so not just noodles and sauce for example. Some of their dishes have been a bit on the spicy side for me, although I am a bit of a wuss. Also, some of their dishes have massive chunks of onion and a lot of it, which takes over the flavour and isn't the most pleasant. However, on the whole, I've enjoyed most of my meals from here and is certainly a convenient option. They have an extensive menu and are open quite late. They're always busy, although I've found the service pretty quick if you go in and collect.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 5
    },
    "photos": [],
    "user_id": "CiEcf2sST7Ow1dP_RKb22w"
  },
  "em6Fl9vJSMNGCLce8fO28w": {
    "date": "11/26/2015",
    "text": "This used to be my local Chinese take away, but I've now moved out of their delivery area (Deliveroo - get this sorted!) and am absolutely gutted as nothing else has come close. Never been disappointed with any of the food or delivery times, plus they do the best salt and pepper chili chips - I could survive on just these alone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "oqptcZGSPxribe0W8Y2CKA"
  },
  "6rMHPl1qMZpFOMSDByE_0w": {
    "date": "8/15/2015",
    "text": "Definitely the best take away Chinese restaurant in Edinburgh, but it's been over a decade since we were at the restaurant.  We ended up having pretty much the same as our take aways, but it tasted even better.  Service was great and we got a table no problem even though it was during the Festival.  Loved it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Qp0GNCgBBAm34QIV_Yx2JA"
  },
  "XT1u-7pfN2t0HrYQZaiT6w": {
    "date": "9/2/2013",
    "text": "On an endless mission to find my favorite reliable local Chinese take-away. Will the search ever end?  Taste Good is like pretty much every other Chinese take-away I have tried so far in the area. Its OK. It will do in a pinch and youll somewhat satisfy your Chinese craving. Is it something amazing that you will want to order all the time? Not for me.  Like other take-aways it is just lacking something. A lot of flavors all taste the same in multiple dishes. My singapore noodles still had chunks of dry spice powder that hadnt been mixed in properly. My chicken and mushrooms was sort of oily, greasy and flavorless. Nothing I ordered had any 'wow' factor. So, my search continues...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "A_dC3FJOqvlsDEiDyMrzlA"
  },
  "gpUXeEnF43gHz9JGbGKZBQ": {
    "date": "10/9/2012",
    "text": "My go to Chinese for a home delivery, now with a website and online ordering system they are taking the art to new levels.  The food is still hot when delivered, it is clearly freshly cooked and it just hits the spot. Favourites so far are the Fishcakes, the huuuuge spring rolls, the chicken sweet and sour cantonese style and the beef and black bean.  Highly recommened got your hangover recovery needs!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "rl4hqDnywPJDCK4wfbXMzg"
  },
  "vTrrKn6QyVpr1ce-yMK45w": {
    "date": "7/26/2012",
    "text": "Taste Good is my local Chinese take away and it really does Taste Good! It is very busy and a better option is probably to order and collect, rather than wait for delivery.  I usually order a Kung Po chicken which comes packed with chicken and veggies and a decent kick to the sauce but this time, I fancied something nutty.   I'm gluten free and although the Taste Good doesn't have GF options on its menu, I've been ok with the Kung Po. I also decided to try the Chicken and cashew nuts which was lovely. Huge portions, crammed full of chicken, nuts and veggies which was delicious and despite vowing I wouldn't eat it all, I couldn't help myself scoffing the lot.  The Taste Good is always busy and with food of a consistently high quality then it is well worth a visit. There is a restaurant downstairs which I've yet to try but I'm sure I will at some point.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "frthTngbBHgSdk4j85HmEQ"
  },
  "qsLd0RLB1MM6-w_Ks8Hpqw": {
    "date": "8/11/2010",
    "text": "Yes the food does indeed 'taste good' but they make you wait for it, I had to wait for an hour when I ordered. But to be fair it was Friday evening and as the food is really tasty, I imagine that they are inundated with people calling making orders.  When the food did come, the packaging must be the most fancy that I have seen from any takeaway shop and is a real nice touch. Me and a few friends ordered some prawn crackers between us but we found that they were pretty greasy, the sweet and sour pork I had with fried rice, was however very tasty and not at all stodgy or greasy and all of my friends enjoyed the meals they had and found it very filling. I definitely recommend a trip here, and will be ordering from Taste Good again as the food is great and the prices are very reasonable, just be prepared to wait for it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jFKFtLq426rY3M8HJ_oQWw",
        "caption": "Photo of Taste Good - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jFKFtLq426rY3M8HJ_oQWw/o.jpg"
      },
      {
        "img_id": "8OfPfqWnxOudBjrxEW7MMg",
        "caption": "Photo of Taste Good - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8OfPfqWnxOudBjrxEW7MMg/o.jpg"
      }
    ],
    "user_id": "hutJzKEYHuVq6CP-XSARgg"
  },
  "ClKolzFF28iYZkBfwSW7pg": {
    "date": "10/13/2011",
    "text": "Taste Good is my local Chinese.  I not only go there because it's nearby, but also because it's good.  Although I have to admit that I may not be very objective as I only ever order the same dishes, which I really like! These are: the  Singapore noodles, the Special chow mein and the King Prawn Szechuan.  My flatmate is a big fan of their spicy shredded beef, which tastes nice but lacks vegetables for me!  It's best to go and pick up as it takes much less time than getting the food delivered. I have visited the restaurant downstairs before, they have a very nice mussels dish that is not on the take-away menu, which I strongly recommend.  A bit dark down there though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "V5U4-iDA2FeO2AlkUrATsg"
  },
  "mL4hEef9E6rCN7UFgjiSYg": {
    "date": "4/9/2010",
    "text": "This Chinese restaurant and takeaway has chosen a very fitting name for itself, because the food really does taste good. The modern and stylish decor sets it apart from most other Chinese's in Edinburgh: think clean lines, blocks of colour and lots of glass, wood and metal. They do manage to back up all the style with some substance though: the food is yummy. Back in the day, when I dabbled with vegetarianism (the follies of youth...), I insisted on coming here for the Hot Spicy Bean Curd. These days, as a fully fledged carnivore, I am more likely to order the Shredded Beef with Chilli, but both dishes are equally tasty.  I wouldn't necessarily head all the way over to Slateford road to visit this place, but if I was on this side of town and I fancied a Chinese, I would most definitely go to Taste Good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "mJJj_SZff6MEWG5Vx1r8Bg"
  },
  "AmJyEfoDrmoW8PqwoGaB0w": {
    "date": "6/15/2010",
    "text": "I find it unbelievable that they can't deliver to an area in Edinburgh 15 minutes away from the takeaway when back home in Clackmannanshire I can get a meal delivered from 5 miles away!   And I was willing to pay extra for the delivery fee. They lost custom on at least two occasions. Idiots!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oAWDgPCwFuLYphdo6eumZw"
  },
  "gpeAd7m0xoAi_GBW37mwCQ": {
    "date": "4/23/2008",
    "text": "Taste Good on Slateford Road is by far and above the best Chinese takeaway in Edinburgh. No competition. Forget greasy soft noodles and spring rolls that taste like you're eating your own trainers - this place uses fresh ingrediants to create traditional masterpieces.   With great value set meals and curry sauce to actually die for this little gem will deliver to all of the West end, Shandon, Gorgie Dalry and as far out as Chesser! The only downside is you may have to wait in excess of an hour during peak times. But trust me, it's worth the wait!   Taste Good - tastes oh so good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EZ-5oUOinc0aKp7j3LpPkA"
  },
  "8vTzz3q2oNBuRpRo9FuHDA": {
    "date": "11/12/2009",
    "text": "Does what it says on the tin and more. I've tried 5 chinese takeaways and 4 chinese restaurants in Edinburgh and none of them come close to beating these guys.   They consistently deliver the best taste, the best value and (curiously) the best packaging. (Their Spring Roll Buns are to die for. Add them to the list of things to do before you die).   I've been with them for 3 years without a single issue and I'm never going to any other chinese takeaway again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3mTKyBcBTNo2XTIu-kCs7w",
        "caption": "Photo of Taste Good - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3mTKyBcBTNo2XTIu-kCs7w/o.jpg"
      }
    ],
    "user_id": "zzudnwbJ_W0wUl21WO-DNg"
  },
  "_iFLpHdQGGIsN43aGqNk3Q": {
    "date": "3/11/2012",
    "text": "Recently lived in the area for 6 months and went a few times for takeaway. Wished I did not. The service is the worst I have ever experienced.  All those people ordering food deliver should pop into the place. The face-to-face service is a crime; no smile, no thanks, no eye contact and if your change lands in your hand its purely by chance. It has the feeling of a factory/sweatshop.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WvHCNUOpjg2Mz7RXXzxb4w"
  },
  "oZZlWwnTAYayr5zRIUyEHw": {
    "date": "3/11/2012",
    "text": "Tastes Bad. Bad service, mediocre food, packaged well.  The service is so bad, I'd rather starve than ever give them my cash. Any good reviews on here are definitely years old, as it once was good but now established and obviously raking in the dough, they don't feel the need to crack a smile or mutter a 'thanks'. IT'S REALLY AWFUL.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4ToLQXZxDPcEoyF0hE4_Sw"
  },
  "HYtXAsmtjlmJ4IEgRnDpyA": {
    "date": "3/17/2011",
    "text": "Taste Good was always the standard go-to Chinese takeaway for my friends and I when we lived in the Dalry/Gorgie/Slateford part of town. Their spring rolls are particularly amazing, and as a garlic lover I absolutely adore their garlic chicken which has a slight chilli kick. They have a really nice wee sit in section downstairs, which feels a lot fancier than it is for the price you pay. The staff are very friendly and certainly make you feel welcome. I would recommend sitting in over takeaway, just because that's my personal preference and is probably the best sit in Chinese restaurant in Edinburgh in terms of atmosphere and service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xwJgGjg_GAMvd5HyO1Ajrg"
  }
}