{
  "GT8Sq8OfWE78U8Sfgtpf-w": {
    "date": "11/22/2008",
    "text": "We visit Edinburgh every year and always head for Frankensteins late on the Saturday nightwhich probably says it all really!! As a tourist and a gal out for a good time,this place is just the ticket!! It is themed and just good fun. The music is good. The bar is split into 3 levels which is great to have a wander. We did eat there once which was pretty good pub grub. Good innocent fun!!Whoo hooo!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ej3wu-Cvz5S5XMzgPY4w9Q"
  },
  "kzYk-tl2xyqgG7ZZIZ808w": {
    "date": "4/4/2009",
    "text": "A fun themed pub. It can get very busy at nights during the weekend, but I like coming here for food. They do a wonderful full Scottish breakfast and have lots more included on the menu!   If you are a student it is possible to get student discount on the meals (this depends on which day it is) and it is also possible to get 2 for 1 meals, depending on what you choose. A meal will cost you 6 - 7, which I think is quite reasonable.   The building is very impressive and looks a little like and old church inside. It is set over three floors, with a dance floor on the first floor, which is usually packed on saturday nights. There are mostly boothes to sit in, which are nice and comfy.   There is an electronic Frankenstein model which descends from the ceiling quite frequently and sits up to look around. I think this is a nice novelty addition, and I think it certainly helps to pull in customers. They have lots of screens dotted around the place too, playing Frankenstein.   There are a wide range of drinks available, including a unique cocktail menu with cocktails such as The Bride Of Frankenstein and lots more!   The staff are friendly and attentive, as long as its not busy. When it is you may find yourself forgotten about or waiting for a long time!   There are often different promotions on on different days of the week such as karaoke or quiz night, and these are clearly marked on the plaques outside of the establishment.   A fun pub to visit which has some character, though I prefer to go here for lunch or during the week, instead of the busy weekend nights!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8kWbwEqdgDjSogg56e6PnA"
  },
  "_ft6PRxGsCuCuxvc9vKJBg": {
    "date": "1/14/2010",
    "text": "Really not worth the bother, for some reason its world famous, although I have a feeling this may be referring to the story of Frankenstein, shame to tarnish Shelley's excellent book. The whole place is decked out in the most horribly tacky way, it's usually rammed full and fairly grimey. Bar staff are bored out there faces (not surprising, it's so dark they've probably all developed SAD syndrome) and tend to be pretty but dense pollock halls girls. Food is outstandingly bad, even if you go for the free food it's not worth standing in the enourmous queue. Bearing in mind that they make so much money from the 'free' food night (I know this from a insider and common sense) think how much money from your pint goes to making the food! Overpriced Avoid.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XKEaZzncxtx4BovE2eOAdw"
  },
  "6ldyDOxyPosHvRJzpSk-DQ": {
    "date": "11/4/2007",
    "text": "Not a huge fan of this place - good novelty value of the frankstein monster coming out at midnight to a big song and dance of noise and flashing lights, but to be honest, once you've seen it (and drunkenly tried to steal it...) you've done it all. Good place to stop on a pub crawl because of its location, but the beer's quite expensive considering it wants to be a studenty bar. Nevertheless lots of people do love this place, but I can't really figure out why.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nB0G7GRthPlFljphIs43mg"
  },
  "I34pIx6m-00vJrlM6sxT6A": {
    "date": "11/25/2008",
    "text": "The one thing you cant take away from Frankenstein's is the effort that has gone into transforming what was a church into the eponymous doctor's laboratory. Seriously gothic, complete with animatronic monster periodically emerging from the altar. Other than that, it's a pretty standard bar split over three levels, with all the usual suspects drinks wise, and a pretty smaverage selection of pub grub. The crowd tends to be a bit more stag/hen party than when it first opened as a student favourite.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n_rSCsfU2M3tGcEfFp1q6w"
  },
  "KVS1yh8MYqnvyy430LlPaQ": {
    "date": "4/22/2011",
    "text": "Good bar if you're with a bunch of mates and your looking for laugh on a Saturday night! Really busy at the weekends! Price of drinks seemed okay to me! Would definitely recommend if with a stag or hen party!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eCUAG7L_ToChxEqfjDZ0hg"
  },
  "jmyw3Ji5Px-YNgflQflIPA": {
    "date": "7/25/2013",
    "text": "4 stars for being kid friendly (up until 8pm).  3 stars for menu/food.  must order mains in order for the kids to be welcome.  strange policy but seems to be common for the area.  nice big screens were a plus.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VT4-OLshYiS81Wf8rldm2Q"
  },
  "Qyio1xwbaxzWgtTDmt3kvw": {
    "date": "11/19/2008",
    "text": "Frankensteins is a themed pub popular with students. The food consists of typical pub fayre with burgers a speciality, but nothing outstanding. I've been a few times and had a reasonably pleasant experience, however on this occasion was very disappointed. The place was packed full of students taking advantage of the free food on offer from a restricted menu). Fortunately we were early diners, around 5, but by the time we left the queue was out of the door and onto the street. Due to the busy-ness the service was extremely slow, and we foolishly ordered a dessert which took a long time to arrive and when it did, it did not resemble anything like the description in the menu. Added to this, in an effort to 'entertain' their clientele, every so often a large version of Frankenstein's monster emerges from a cubby hole amidst loud Phantom-of-the-opera music and almost total darkness in the remainder of the pub. Not conducive to a pleasant evening meal! I will not be going again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "clcemNTSlJs3O7iv_Q7BFw"
  },
  "dS4lyQctc5RSHOsaewLppA": {
    "date": "10/5/2007",
    "text": "During the day this place serves really nice food but when dusk falls it all changes. It gets very busy at night, making it very difficult to get to the bar and get a drink, or have a dance on the dance floor without banging onto people. Despite this its definately worth a visit.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NjshRcdJxlshJZRB5X7kbw"
  },
  "vQ1uZM4fhuKqPDH-txJU-A": {
    "date": "10/31/2007",
    "text": "Frankenstien's monster comes out at midnight to the salutes of all the drunken teenagers.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1g9_rAfoKieVn64my3Awbg"
  },
  "dauN709Ei0_5kua1VnkVwA": {
    "date": "11/7/2007",
    "text": "Been there on few occassions with friends but every time I go there my opinion just gets worse and worse so maybe I'll give my opinion now so that they'll get 2 stars instead of one.... The place has it's pluses: atmosphere (from time to time), nice interior, it's pretty spacious - and thats about it... Minus'es: overcrowded (thats one bad thing about being popular), music is hell to loud even on club standards (to speak with someone or to order a drink you need to shout your loungs out!), ordering drinks (you have to be really funny looking or shout with anger to get the barmans attention as they just dont care much and look a bit bored), places to sit (as in other clubs - plenty of seats if you come early but later on the tables just make moving around harder) If you can visit it and find for yourselves but if you want to avoid big dissapointment just avoid it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EWNjX2eqSWi5xHZ-iRR7QA"
  },
  "kTs5GTq74kivj4hHMq91CA": {
    "date": "11/8/2007",
    "text": "The Frankensteins is one of the most famous bars in Edinburgh. As you can tell it has a theme based on Frankenstein and has a quirky and fun atmosphere. Located just off the Royal Mile the pub is perfect for a quality pub lunch during the day or to get a pint (or ten!) in the evenings. However, the music is quite loud so it is not great for a quite pint but is perfect for a party night warm-up.   The bar is usually quite busy from 9pm onwards and after 9pm the small dance floor becomes un-danceable due to the large numbers of people. However, it becomes a lot less bust after 11pm as people head off to some of the many clubs nearby.   There are three levels and all of them have bars (although the bar upstairs in only open Friday and Saturday nights) so it does take especially long to get served. The pub is excellent for students as there are several student deals on lunches and drinks. There is also a 4 deal for two pints of Fosters.   Happy drinking!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qFOy-T6HU4WxS5t_34IBaQ"
  },
  "V84Z1dQma3iY1gBapntLVw": {
    "date": "11/14/2008",
    "text": "This is all themed on Frankenstein (or should that be his monster), but it is quite a fun place to go. I have been there quite a few times for a meal. The food is usually tasty and prices are reasonable, and they do offers like buy one get one free etc at times, and a fajhita night one day through the week. Quite a dark place but quite cosy. They have two floors where you can have a drink or a meal. If you like something a little bit different from the usual pub grub then I recommend trying here.  It can get a bit busy and noisy at the weekends, but most places do.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "09_FFRjVsCc7pbqG7MxXyA"
  },
  "PuLq0MUl_oKyzqgskhqqzA": {
    "date": "11/20/2008",
    "text": "This has always been somewhere I have ended up in after a night out somewhere else. It is good fun but full of men who think it is ok to grab your rear end on the way past. I would say the majority of people who end up there are hen or stag parties, or people who are very drunk.   At midnight a Frankenstein appears from the ceiling, bit tacky but funny when the staff start dancing on the bar!!   The fact that it is free to get into and plays music you can dance to makes this a great place to go for a few hours to finish the night off.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LGfDJMfXDDj93YUfrEqEhA"
  },
  "0XEFQJhd8o20Z0F2WSEUbA": {
    "date": "11/30/2008",
    "text": "Frankensteins is a great pub situated up from the Mound in Edinburgh. The place is very big and sitated on 3 different levels. The food is quite good here also, and if you have got quite a few people going they will reserve you an area and give you a buffet. They do deals on drinks also and late on frankenstein comes out from the wall. It is a great themed pub which is always very busy.  Good music, great atmosphere, good food!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P_cM_cXgjuQd-CVJ5_HB0A"
  },
  "SY7aDkPQBDB5QUrEMAj7cA": {
    "date": "7/14/2009",
    "text": "The test tube shots here are great, but it's always busy when I've been there so it's not somewhere I'd normally choose to go as you have to push your way through loads of people just to get back to the door etc!   The music's quite good when I've been there though.   I've never had food there but they seem to have some good deals!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "52IVqlAINNlrjva8mDjTkQ"
  },
  "cynCBt0gMZ3ofwYRm9QPwQ": {
    "date": "2/24/2010",
    "text": "Went in here for first time a few weeks ago and was rather dissapointed after what i had heard of it. We had a meal and although it was ok it wasn't worth what we paid for it , drink was rather expensive as well although it was a good pint. Good place to go see if you are a tourist and get a phot taken outside of bar but not a locals bar by any means. Staff were friendly and service was ok.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yI4LI8-aYYUS9MmrfpidMQ"
  },
  "mN81DYlDIzsnuIa1VheXOQ": {
    "date": "10/13/2007",
    "text": "I have intense qualms, having read and enjoyed the original story, with any popular culture version of Mary Shelly's monster. The nuts, the bolts, the green, the zombie stancewhere did this all come from?? But it provides a good theme for a bar, I suppose, especially around Halloween, when those iconic and unfounded masks will be seen in every shop.  Frankenstein's provides all the fun and entertainment for a lively group of eaters, drinkers and dancers; the food being of a 'beer and a burger' style, but for a quick bite with the lads it's all good. There is, I must admit, something exciting about a themed bar which always makes me, at least, imagine the fun in decorating it and acquiring all the electro-themed gadgets that give it the image. So if it manages even to sway the cynics, it can't be doing that badly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x-xinceFIUsjPutqNBiAaQ"
  },
  "JyEUIR7f7PGv_R-iVA-oWQ": {
    "date": "11/8/2007",
    "text": "Depending on what you are looking for on a night out you will either love or hate frankenstens.   There are three levels: the ground floor is where all the madness happens. During the day it's busy enough with people coming in for lunches, or if there is any sport Frankensteins will have it showing. As it gets later the place fills up and up until you can't move anymore, never mind get to the bar for a drink!   There is usually a DJ and the music is cheesy, but the alcohol is cheap. Oh, and at midnight Frankenstein himself comes out of the wall in his coffin and sits up to let you see him (the tourists always take photos!).   Downstairs is a bit quieter, as is upstairs on the balcony.   The last time I was there was the day Scotland beat Georgia at football in May. As Scotland won, everyone was given a free drink from the bar - which I thought was a nice touch.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0rMkjnsRm82lOhyQH_3enQ"
  },
  "xCYoBQb2bC-BQddslm1p_Q": {
    "date": "5/20/2008",
    "text": "Mmmm..not a huge fan anymore. When I first stumbled into this place I had an absolute ball. This was some years agomust have been 2005. We were seated at the top level and had a great view over the other levels. Also the boot style seating adds a nice touch of privacy. If I remember correctly the food was quite good- served in generous portions- and we were served by a friendly Canadian waitress. The place was buzzing, and we didn't even stay until midnight when Frankenstein apparently makes a spooky appearance.   Some months ago I revisited Frankensteins and sadly it was that disappointing that I shant be back for more. This time we were seated in the downstairs area which was very noisy- any attempt to a decent conversation was quickly drowned out by extremely loud music (and it was only 5pm). The quality of the food was shockingly bad. One of my guests had hairs in his meal(not his own!). When we tried to have this matter sorted, we had a dickens of a time to get a staff member to come over as they appeared to be more interested in having fun amongst themselves than serving the clientele.   It's a shame because Frankensteins certainly has potential with its great location and unique decor. But unless they step up the service and quality of food, not even ten Frankensteins can drag me back to that place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-zhW9UyMKOMuuydi17x7Ag"
  },
  "MzZVoWtA_kJcrqu64gFnYg": {
    "date": "2/3/2011",
    "text": "This place is great if you're feeling a bit silly and up for a laugh, they put on Frankenstein shows and have competitions and raffles that centre around the theme. i really enjoyed myself when i was there and the staff were all fun and friendly (you'd have to be working there). Theres proper security which is reassuring as i could imagine people getting a little carried away with the hilarity of it all. i cant quite remember if it was value for money or not... but the less said about that the better.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BQ1BC8uGl6hl3TQ1CkSlMA"
  },
  "OJUUz43JcZGItQxRwITrIw": {
    "date": "8/28/2010",
    "text": "This was my most favorite place to be in Edinburgh!! I spent most of my nights here and met some of the most amazing people!! Frankies will always be in my heart!! Im sure its just as fun without the Rocky Horror Picture nights but man I felt Like I was living a dream here!! Frankie burgers here are amazing!! best burgers in town!  Please order their specialty drink called the frankenstein and also frankensteins bride both amazing drinks!! have fun and take home memories!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mbtri0iWlGf-Qd25JQ_UBA"
  },
  "6QSbT3tAgjQdtKnPONaKKA": {
    "date": "9/27/2013",
    "text": "Fun little theme bar that has old Frankenstein movies playing in the background. Has a decent food selection if you have not had dinner.  Good bit of room to both stand or sit.  Was a little slow at 9:00 but when we came back at midnight it was quite packed.  Go in and have a drink if you are looking for something a little different.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wvsEOXM9l77DGO9bSTDXWA"
  },
  "WDpFDvgyjfulQfXA5ahW9Q": {
    "date": "2/25/2010",
    "text": "This place was a good option for us as a hen-party of 20 people. We managed to get a booth downstairs and we never had to wait too long at the bar. Cheap drinks and good service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cqecqnFK2eu88VtKJLHpiA"
  },
  "XzQC96THeFowILB1NtNSxA": {
    "date": "4/8/2009",
    "text": "Came here upon the recommendation of a friend who studied abroad here (see my other review on Biddy Mulligans). The atmosphere is interesting and reminds me of halloween decor with the lights and frankensteins... haha anyway,  i had the burrito (I know, I know, what was I thinking ordering a burrito in Edinburgh, but I was curious)... It wasn't what I was expecting. The chicken was wrapped in the tortilla and then it was baked with salsa and cheese on top... And it was served with the beans and rice and cheese/sour cream/salsa (more of it!) on the side. But it was DELICIOUS!!!!!!!!!!!!!!!!!!!!!! My friend ordered the portobello and bleu cheese burger (which includes a meat patty, not just the mushroom!) and he LOVED it and said it was the best burger in the WORLD. hahaha. My friends ended up going again another night and both ordered the burger and both agreed that it was the best burger in the world and for that reason alone, they want me to give it 5 stars, but alas, I didn't try the burger ( i don't like bleu cheese or mushrooms) so I can't give it the full 5... oh well.  Come to Frankensteins for good food and fun!!!!!!!!!!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jh9lzfkbRiHcuftkBE4XsA"
  },
  "RjqW6nz04OJ1SsGmOVP_kA": {
    "date": "11/14/2008",
    "text": "Frankenstein's was our funny find for the weekend. A very funky bar stretched across three floors we visited on the Saturday night and then when we went back for quick bite to eat on the Sunday night they'd run out of food! Festival run out! Our waiter/bar man was very friendly and accommodating though and found combinations on the menu we could eat. The food isn't high quality but the atmosphere and fun is.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hOGuX_P8k5oalP8vVkNTvg"
  },
  "jlxzQMOo23J0NkRePFQbJQ": {
    "date": "10/9/2007",
    "text": "Having worked at Frankensteins over a summer it holds a special place in my heart. I loved working there as it was always lively and fun-filled from a workers point of view, so you can imagine how much I enjoyed being on the other side of the bar! It is a very student-orientated bar, we had specials for freshers week and give out student loyalty cards. Its also got a great menu too though, really reasonable and really good food. I cant really fault Frankensteins in any way.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OvZ7cVhTcJ55yb_mtUhC1Q"
  },
  "gQYyPRqxZ13TXeLXc2V9Lw": {
    "date": "11/17/2008",
    "text": "I absolutely loved this place when working at the Fringe as it was over the road from our venue. It is located in a huge old church and made to look like Frankenstein's lair. The atmosphere is fab and there are three floors. On the main floor there is booth seating which was my favourite place to sit. We used book the downstairs, which was like a big cellar, for our new staff members arriving each week and had a party. I loved the food and found it to be decently priced. Every so often a song would blast out and Frankenstein would be lowered down from the ceiling and then he would sit up, it was brill. A great place to eat or drink and they even play organ church music in the loos. Well worth a visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RHVM5j03hS650fYb7EuAxA"
  },
  "0XoRjBY5FCSWuV4N_jCWVw": {
    "date": "4/20/2008",
    "text": "Frankensteins is alway busy, this can sometimes be a bad thing as the place is very noisy and you can hardly hear yourself think never mind talk to company. Great venue if you're well gone and with a crowd but not really an ideal starting pub. They also serve food whhich is very nice though service can be a bit too slow for my liking. The decor is quite quirky so worth a visit for the experience",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dqji5fRROkLc3eNMMQOI_Q"
  },
  "QBsPpEpVxWAuqtdxWIq1-w": {
    "date": "10/3/2008",
    "text": "This place is more like a club than a pub in my opinion. Everytime I've been its been really busy. They have a wide selection of cocktails and drinks and the decoration is amazing. The TVs usually show all kinds of old black and white frankensteins films.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yRm9czxWwbiJA-rtRAigcA"
  },
  "VC1Ki-35mTYct0T8Ytj1Lg": {
    "date": "9/3/2012",
    "text": "Stopped in here to use the bathroom, and I can see that it would be kind of cool for the college-aged set. Kitschy and fun. We didn't try the food, but the drinks were good and the prices average. Bathrooms were clean.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jp1ph-DwAjU9uChMue6bng"
  },
  "E1Wn2yjYrq5OKcIVnuxWrw": {
    "date": "6/5/2010",
    "text": "My friends and I come in here every so often, just for that sense of comfort, where you realise that some things will just always stay the same, no matter what the rest of the world is up to. With life changing and moving so fast all the time, it's nice to know Frankensteins will always be there for you, showing you that none of those new fangled ideas of updating things and being trendy matter, because after midnight, Frankenstein will always be lowered from their roof on his stretcher, then he'll slowly sit up, then the chords of Robbie Williams, Let Me Entertain You will blare around the bar. Last time we were in here, there was a terrifying moment where it sounded like they might be about to alter the space time continuum and play something else, but after freezing for a fearful second, we heard the unmistakeable sounds of Robbie, and order was restored.   Frankenstein is pretty expensive at the weekends, and undoubtedly gimmicky, but it's good, non pretentious fun, and I can't help but have a soft spot for it. The dance floor is pretty big, and there are also two other floors, one of which is a viewing gallery where you can observe the dancers below.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Mujjzv-ZH6HhxT-hWCpVg"
  },
  "BnfSfI0WPoHwkkg5NsEFaA": {
    "date": "6/3/2010",
    "text": "Friday?  5pm?  Tie wrapped round head?  Welcome to Frankensteins. Next stop, self loathing.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xXQTdJXPGOP-NUYctcQw8g"
  },
  "XtSp_Bl7R8gcvNaXXnYQfg": {
    "date": "7/17/2010",
    "text": "I don't like this place. Purely because an ex of mine works here, a particularly shitty ex.   You might like it though...!!  It's above average as a bar and restaurant. Every Tuesday they have great  free food giveaways for students. It's amazing, too good to be True! Every now and again the huge Frankenstein face thing comes down from the ceiling, pretty f'ing scary if you're not expecting it! They have pizza's, burgers, salads and lots of other options.  It's a fun place, definitely worth a look in.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o0WGr8L3BWfH2Bslpnqw6g"
  },
  "Ozm6gM4DmtQZpAmW1TSWAQ": {
    "date": "6/25/2010",
    "text": "I agree with Fiona, Frankenstein's is a total marmite place, you either love it or hate it, there's really no in between. I have to be totally honest and admit that it's not really my bag, it's a bit too gimmicky for my liking. I've only been during the day and feel I'm missing out a little as apparently at night they have a robotic Frankenstein who comes out and does a little party piece which would be hilarious to see but once you've seen it, I'm sure it would get old quite quickly and soon turn into an annoyance.  This place is rather dingy and the prices aren't all that cheap either. It seems to also be lacking in atmosphere so to be honest, I'd rather drink elsewhere and it would never be my venue of choice.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CqkdpG2tkCPQA69umlAHsA"
  },
  "EozuckHG2pZdyg-OmU0j_A": {
    "date": "6/2/2010",
    "text": "I mistakenly came to Frankenstein's to nip to the loo, and my pals decided to grab a drink whilst we were in.  One word: dark. It was only about 4.30pm, and I actually needed a torch to find the bogs. I hate this, why wouldn't you want to let some light into the place? It's also gimmicky, horror themed, and generally tacky and crap. Its too expensive, and it doesn't justify it one bit.   I hear a robotic Frankenstein's monster comes swooping down at the weekend to scare all the punters. Wooo. I might come back for that spectacle- not.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vlZn18XdlqVjXSp5-X1jeQ",
        "caption": "Photo of Frankenstein &amp; Bier Keller - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vlZn18XdlqVjXSp5-X1jeQ/o.jpg"
      }
    ],
    "user_id": "Cy1PV2TdYeDFA16mUOlr3Q"
  },
  "5wRveKrfVZz7LqvCQ2ydzg": {
    "date": "5/30/2010",
    "text": "There's a similar bar to Frankenstein's just off George St: Jekyll & Hyde. You'll find the same depressing gothic interior and gimmicky props scattered around. I've tried to see past this facade, loosen up and just enjoy a drink or two here...but with no success.  The drinks are overpriced (undoubtedly to fund the many 'free' food evenings). This is all well and good, but the food is plain terrible.   As I write, summer weather has finally graced Edinburgh and as a result I fully intend to avoid the dark, dingy and cliched interior of Frankenstein's and drink in a lighter more refreshing environment.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_wo4M02kUj92XWo-WW4MxQ",
        "caption": "Photo of Frankenstein &amp; Bier Keller - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_wo4M02kUj92XWo-WW4MxQ/o.jpg"
      }
    ],
    "user_id": "UvIb5v3biEgcxWKnxf0ocg"
  },
  "lPDB7su6bcowGn3jqbSqLQ": {
    "date": "5/2/2010",
    "text": "I attempted to have a date here once but it was far too busy and crowded, so we left.   I feel the idea of Frankenstein's is actually much better than the real thing. It's very gimmicky with it's Gothic, Frankenstein theme and is located in an impressive old church. Impressive from the outside anyway. The drinks are stupid expensive and not worth it, I don't think you can justify the hiking up your prices just because you have a special theme going on. The staff are pretty rude too, maybe they are tired of the Frankenstein theme and the fact they are constantly in the dark.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oKdygoDX5CfDJeXzv_EVaw"
  },
  "m3SE-Ya9s9lXMyHhQGRO8g": {
    "date": "4/27/2010",
    "text": "This place is hilarious! Don't be fooled with the sign: World Famous Frankenstein 1826 : to my knowledge the old church building this bar is placed in is not that old. This venue is placed over 3 floors with pool tables, electronic games and bars. The \"Frankenstein theme\" is quite obvious all over the shop, including a large screen tv showing a Frankenstein movie (the one with Hugh Jackman). The bathrooms were surprisingly clean late on a popular night (and the only time I have actually been in here).   It has a grand karaoke night on Sundays and the bartenders are quite amusing, especially at closing time. Although this seems to be the place for tourists and stag/hen parties it can still be good enough for a cheap drink, or when you are too merry to care.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nhVvcPyRGLw466qHVbUjrA"
  },
  "6NfBfGoyUHdckFZSdc9GSA": {
    "date": "4/25/2014",
    "text": "Literally one of my favorite nightclubs ever.  Music was SO FUN.  Drinks were ok, but music was what makes this place amazing.  Videos of the music are so entertaining.  They play the top hits of the 80s, 90s, and today...I wish there was a place this awesome in New York.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m2B7te1hqEOV_-prH5RBmw"
  },
  "8VfugN8OyqV2Kkdd4IR_fw": {
    "date": "6/24/2009",
    "text": "Are you a student? Are you mentally ill? If you answered yes to either if these questions then you will no doubt love this place. If not then stay away. Frankensteins is a bog-standard chain pub dressed up to look like a Hammer Horror film set. Nothing of note can be said about their drinks or their food, its exactly what you would expect from a corporate enterprise aimed squarely at a young audience - umpteen types of fizzy, tasteless lager to wash down your greasy, bland fajita/burger. Avoid like the plague.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6S6sZMLuy_StHVs2lqpUUw"
  },
  "DvC7FNgRRXVwWhDiPjEI-Q": {
    "date": "11/26/2010",
    "text": "Not much to say but that this place was great fun! I went on a Wednesday, they had a wii mario kart tournament going on which was quite entertaining! Staff were very friendly and the first round of drinks was incredibly cheap (I guess we arrived at happy hour)!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J1iZnGC5MVIZvUye4U8Z6w"
  },
  "01NTqI52Z7uhiYp0El0U8Q": {
    "date": "7/13/2011",
    "text": "In my \"perfect world\" every old church would be converted into a pub. Notre Dame and St. Vitus would be amazing pubs! But, I don't see that happening anytime soon. This place is really well done... A bit of an over the top \"theme\" pub, but that is okay. The place is modeled after Dr. Frankenstein's lab, complete with plasma balls, Jacob's ladders, and the monster being lowered from the ceiling. They had several speciality drinks, but we stuck to a few nice droughts. When in Edinburgh, I would definitely recommend stopping by for a few pints.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZeYGUAbTX4RtqiR_bLRT1Q"
  },
  "L5D2N-cahraik72EZWOzkg": {
    "date": "1/7/2009",
    "text": "Too popular with VERY drunk stag parties / hen nights and students for me.   Many better bars closeby!!   Ess",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vQnR9L9HILjw4PgWB8q1cQ"
  },
  "qpeAp8LzhFrpY9tWWVWKWA": {
    "date": "3/10/2009",
    "text": "Frankenstein has a pretty cool atmosphere as it was an old church that looks like it could be a scene in Shelley's book now.  Either that or a really bad Halloween party.  The biggest plus was that they seemed to have the best student deals (20% off all the time) and weekday specials as well.  Also they had some cheap food (burger and fries for 3 pounds).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a9m3FLUiZ3PcAY35yVP_ng"
  },
  "yHNnXi-mR4z5wo76IAx0_Q": {
    "date": "11/3/2009",
    "text": "This a bar/restaurant full of gimmicks that, for me, do not distract from the fact that the drinks are overly expensive.   The decor is pretty interesting. Its gothic themed and at certain points in the day, a Frankenstein figure emerges on a stretcher above. This is obviously largely for the tourists. The novelty certainly wears off after a while. I do, however, rather like the fact the upstairs seating area overlooks the downstairs bar. It's also nice to know that there is a downstairs seating area (something which proved to be handy when it was packed with footie fans).  My favourite thing about this bar are the student deals. They offer buy on get one free on a selection of meals. The food is tasty, hearty, pub grub. I also loved that they have free food Tuesdays - you just need to buy a drink and you get a free meal from a small selection.   I dunno if I'd go here when I'm not a student. It'd be somewhat pricey without special student offers. I'd probably try out their 2 for 1 fajita Wednesdays.   I'd beware of this place- it's very much a touristy novelty pub.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oAWDgPCwFuLYphdo6eumZw"
  },
  "7bnrfGVXtCMmJ3YxTFtsTw": {
    "date": "11/16/2008",
    "text": "A horrible place. I severely dislike this bar. It masquerades as a bar with tons of history behind it (Frankenstein has absolutely nothing to do with Edinburgh) and is full of your usual crowd of numpties that populate tourist bars in Edinburgh.   They have a thing that happens at midnight, Frankenstein comes out of the wall and sits up - it's all very scary. Very.   Avoid this bar, it is nothing special and there are many other bars that will give you a better night without a load of idiots.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xL8TPB74FH44MNc3cokrFA"
  },
  "OlklWwKxAWWdhY79StDRdQ": {
    "date": "11/19/2008",
    "text": "Frankensteins is the kind of place you either love or you hate. It has that little bit of novelty value in that there is a model Frankenstein who comes down from the ceiling every once a night whilst the staff dance on the bar, but to be honest, it's a bit tedious after you've seen it once.   The balcony is a great place for people watching and checking out the people dancing below, but it get's very crowded up there, and can be impossible to get to the toilet/bar when you're up there!   This place generally attracts quite a hen/stag/lads night out type of crowd at the weekends, so ends up pretty heaving. If you're looking for drink promos, cheesy dancing and to be chatted up, then it's probably the place for you. If you're looking for somewhere for a quiet night out, then i'd avoid this place!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mu6xEHThck91bAyD38XuZQ"
  },
  "_SwT04ggIIxPLar98nHFNQ": {
    "date": "1/29/2009",
    "text": "Frankenstein's is just off Chambers Street. they serve standard pub grub which is nothing special but fills a whole.   Popular with students, they usually have some sort of drinks promo on. So drinks are cheap but you need a loud voice to be able to order them.   The bar is themed and as you walk in you hear a cackle from Frankenstein- the mood lighting is great making the place seem quite creepy the place has green flashing lights, nuts and bolts,cages.   The Dj is quite cheesy but its good music to boogie along to carelessly with friends.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MsyysnjgKEnvg1fC9Q2OCw"
  },
  "24RW4yHYborM7WQtryxlRg": {
    "date": "8/5/2010",
    "text": "An institution in itself, Fankenstein's is one of the most famous pubs in Edinburgh. Like Jekyll and Hyde, it goes for the gothic and Addams Family theme, and being converted from an old church certainly pulls it off well. Inside you have scientific experiments bubbling away, with fake cobwebs adorning the walls, and the DJ booth is to be found in the pulpit. The most famous bit is 'the monster' though, who is winched out from high up in the pub, lowered into the middle and growls at people to an operatic score. This is good fun enough on its own but recently (now every Monday at midnight) I saw an updated version where the staff dress up as a medley of different horror creatures (vampiresses, corpse brides, Jason Vorhees who had a real chainsaw, not a little plastic one, a real f**king chainsaw, Dracula etc) and have a bit of a boogie to a mash up of Lady Gaga / Beyonce etc and ends with an undead wedding. Completely pointless but one of the best bits of pub entertainment I've ever seen.  The pub is a bit of a tourist trap, and this is reflected in the prices. Even with the discount student cards available, it is still about 3.50 a pint. Also, despite the bar being huge, there is a very limited selection of beers on offer. The food is good though, and quite a few of them are on 2 for 1 offers.  Overall Frankenstein's is good is you want a slightly different pub experience, but the poor beers and slight overpricing means you won't come here too often. Definitely one for the tourists, but a good laugh for everyone else as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ga9DnmdmhE0Zzs_jRtmrfA"
  },
  "2q6jPiOmUcpoGQcbGA2y5w": {
    "date": "8/21/2015",
    "text": "First off, this place is pretty mediocre. The ambiance is meh. There's no point in going more than once unless you want to hear the exact same playlist over and over again. It's consistently way too empty despite the enormous size of the venue. And a lot of the bartenders don't actually know how much they're supposed to charge for the drinks--one overcharged me and was about to tell me I hadn't paid enough, and was going to ask for more money if the manager hadn't been standing being him digging him in the ribs.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SaGcF7WcRbhdFFcRYZk84A"
  },
  "vidsRH846tqtUo07BWoikQ": {
    "date": "6/1/2015",
    "text": "If you enjoy halloween, horror films, or themed entertainment - this is a must. Swung by on a recommendation from a coworker who said to make sure we were there at midnight. Once the clock struck 12:00am, a Frankenstein animatronic was lowered from the ceiling with lights, smoke, and fantastic score. Very fun, would high recommend.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "dLVxk97NP29W8Ke8x2s8rw"
  },
  "KGOJ5HAgSY83GhS9_PIO3Q": {
    "date": "4/19/2015",
    "text": "Originally I was going to rate this place at least 4 stars because I loved the environment and the type of music they played! Lots of old alternative classic hits and awesome dancing kind of songs and catchy tunes. I actually had a great time at the club because it was a lot of american music and things I'm used to. But then the security guard kicked my friend because she was dancing the way american girls who love music dance. And then he kicked her out. I thought that was so rude because you can't just kick people. Never in America do people kick people, it was just rude. And I think he should have at least gave her a warning if she may have been dancing inappropriately by respectfully tapping her on the shoulder or something. So after, our whole group of Americans just left. Besides the security guard, the place itself was great.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-hamNUJcfmeYObvM5Wlgyw"
  },
  "n9eJ_tpKUba35tSOv5UpIA": {
    "date": "1/4/2013",
    "text": "Frankenstein memorabilia everywhere inside, looks like a church on the outside, check.  Have beers on tap with loud music on, check.  This is definitely a place for you to stop by and have a beer and take a look around, even once.  This place is unique and one of a kind.  First came here on a pub crawl one night, and we came back the next day for a later afternoon beer just to make sure it wasn't just weird when I have had a couple of drinks already.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "E68ZPVpcuWhxvnjq8vTqAA"
  },
  "zvyHDyrZgSvil-AAA8o6dQ": {
    "date": "2/24/2013",
    "text": "A converted church, Gothic style interior, Mr Frankenstein making an appearance, fancy lights, nice whiskey and beer, Edinburgh center alcohol prices.....this pretty much sums up this place.  My colleagues and I strolled by this place on a Thursday evening around 7.00pm and it appeared pretty much empty. We grabbed  a high table in the center of the room and got ourselves some drinks. First it felt like we were the only people in there, but after half an hour the \"Church\" started filling up (people nestling into the comfy booths around the dance floor) and Mr Frankenstein came our from his hiding place. Loved that appearance. Spooky!  I did not see much of a dance floor, and at the same time you don't really need much space to have a good time. There is plenty of  \"boogie space\" if you don't try to outmaneuver other people, just to look good :-)  It appears there is an upper floor, which would be suitable for private parties. Always a good one to celebrate your 21st BD!  Shame I was there only for a short time, but it's definitely a place I would like to go back to.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s85sNAMlsrI0xCRvfj7Jrw"
  },
  "OShvFKi3iskH-1jGcy1ubw": {
    "date": "12/1/2016",
    "text": "We were very welcomed at Frankenstein. We got to experience our first trivia night overseas and it was one of the highlights of our trip (thats how fun it was)! The bartender and trivia host were both so sweet and made it a very fun night for us. The beer and Goldschlager were tasty too! We will be back. Thanks, Frankenstein!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hWk7duPk_5v3RmuZUUsV4g"
  },
  "cpqfj1Xclt-cG133bX-MRA": {
    "date": "4/27/2012",
    "text": "What in the name of Mary Shelly is going on here?!?!?   MAYBE it was just the Night I was there, but..the Decor and the Music went together like Angelina Jolie with a huge Herpe-Sore. Gothic Decor + top 40 American hip-hop?!? WTF.  Half the patrons were Men in Business Suits, the other half looked like rejected extras from The Crow or Insane Clown Posse groupies.  The Frankenstein-theme is also a bit like a ridiculous funhouse...ridiculous in a bad way.  The novely soon wears off after the first three sips of your Drink.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "bubCIa8tqeWGyTlBjxvuLg"
  },
  "jz12c2Q8G_KJzyvCK5RZbA": {
    "date": "11/26/2012",
    "text": "I actually liked Frankenstein a lot more than I thought I would, given my outrageous aversion to all things bar or club shaped. I loved the atmosphere of the Frankenstein bar most particularly--what a commitment to a theme! All of the windows with scenes from the story, a wide array of formulas and lights and crazy music videos.   I stayed for several more pints than I meant to, chatting with friends in increasingly horrendous Scottish accents, while enjoying the view from the mezzanine bar. I liked a lot that you could be down on the main dance floor or choose the higher, more casual upstairs area. Their pint selection was limited upstairs, but still sufficient to encourage the purchase of more.   Built inside an old church, it's just an entirely unique experience. The place is marked as \"World Famous\", and I'm not sure how they come by it, but it's certainly not the kind of place you'll forget.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BvIIvQqPJ2cKC8eaSxOFpw"
  },
  "iXe7ZJfLIIGryKiI0HPh0Q": {
    "date": "1/15/2012",
    "text": "Oh hell no girlfriend, uh-uh.   I don't know what that drooler in the white shirt was thinking, grinding up on me like that without introduction, but I'm pretty damn sure my punch in the chest got my message across. Look-look-no-touch, thank you.  This place was, meh, average, kinda crappy music, DJ didn't play requests and kept pausing the music in all the wrong places to scream shit about Jagerbombs. Every. Five. Minutes.  Had to run around the dance floor a bit trying to avoid the rather grab-assy \"gentlemen\" that were present, and yes a wooden doll got lowered from the ceiling that vaguely resembled Frankenstein's monster. To their credit, they did play Michael Jackson's Thriller,  but then again, what else would you play to go with that?  Keep walkin' people, if you've got to set the bouncer on the chavs to keep off your body (for their safety really, I would've done them more harm), you know it's not the place to be.   Frankenstein, somehow that name is oddly appropriate...",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6YW-IEZzzVaIYpteJlgy9g"
  },
  "xAFX5EmBH9XBbfPID_WVsA": {
    "date": "7/13/2010",
    "text": "Frankenstein is undoubtedly a student bar.  The whole inside is decorated along the theme, almost over the top in places.  I've been here once as part of a night out, and I can't say that I found my time in here amazing.  It's the sort of place that someone may mention as part of a night out, but that will inevitably be passed by with a better offering elsewhere.  If you're a student, then you'll love the whole decor and the days when they do free or cut price food.  If you're not a student, you'll probably steer clear of here.  It's not really a classy or sophisticated place, and don't get the impression it is.  I'm sure they do big things at Halloween, but apart from then I can't really think of when I'd want to be going here.  For what it is, it does well though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eavGq2dYu8mZVENi4-Wz3g",
        "caption": "Photo of Frankenstein &amp; Bier Keller - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eavGq2dYu8mZVENi4-Wz3g/o.jpg"
      }
    ],
    "user_id": "v_lWueG7V_vul4E8rCEdjQ"
  },
  "vLQVbKbnf1uGKibxIOJIoA": {
    "date": "8/21/2015",
    "text": "Don't waste your time. This is the tackiest place on the planet. The mood is desperate. The DJs cut into the music at the most inopportune times so that it's virtually impossible to dance. Even if you wanted to try having fun, you can't. Also, the bartenders are complete assholes who can't make a decent drink.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "fEOIKaT2UK3Eub6igi7xbg"
  },
  "5--Ko7AyZ9yxlGL9H9fe6A": {
    "date": "5/8/2010",
    "text": "Theme bar? Awful. It's always packed full of people waving Snapfaxes around (you can get some good deals admittedly).  One of it's only good points is that it looks like it's been build by a theatrical set maker, looming bookcases in such a good building with one of those lightning balls above the bar. But it's not a nice atmosphere to be in, especially on a Friday or Saturday night and even when it's quiet it seems too lifeless.  The bouncers can get a bit arsey but they must be used to so many Stag do's (and don'ts) and underage drinkers trying to get in they must be sick to death of George IV Bridge's general public.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "S2mN5u3wYxo3_zeAdc0oAg",
        "caption": "Photo of Frankenstein &amp; Bier Keller - Edinburgh, United Kingdom. logo from official website",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/S2mN5u3wYxo3_zeAdc0oAg/o.jpg"
      },
      {
        "img_id": "PsTc8-BGWX0ItAPmV5Ivvg",
        "caption": "Photo of Frankenstein &amp; Bier Keller - Edinburgh, United Kingdom. logo from official website",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PsTc8-BGWX0ItAPmV5Ivvg/o.jpg"
      }
    ],
    "user_id": "rJi2YPK6uj4FtE8R7OFQcA"
  },
  "7t7RHpqcV147AMOjqx8Zvg": {
    "date": "4/18/2010",
    "text": "Frankensteins is always a 'last resort' type of place - where you go when every where else is too full or the queues too long.   During the day, Frankenstiens poses as a gothic, Mary Shelly themed restaurant serving a range of basic and rather bland meals to students and tourists who fell for the Frankenstien gimmick. Student however, do have an excuse, this place is cheap - really cheap.   In the evenings, Frankensteins embraces the dark and becomes a bar. This really isnt a good thing, for while the gothic theme lends itself better to a bar than a restaurant, the atmosphere is still pretty dreadful and the whole thing feels like Frankenstein going for a jog - uncomfortable, dragging and groaning.    I dont like Frankenstiens that much, but it remains a faithful back up if the hundreds of other bars in Edinburgh close.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7AcEC8rdFVK-MYG1KTBtTA",
        "caption": "Photo of Frankenstein &amp; Bier Keller - Edinburgh, United Kingdom. Frankies",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7AcEC8rdFVK-MYG1KTBtTA/o.jpg"
      }
    ],
    "user_id": "SxV1Jq7UANuSYpn42JXvOA"
  },
  "rHFRsye0_rL1knLjodbM3Q": {
    "date": "4/12/2010",
    "text": "This place will definitely divide opinions - you either love it or hate it, and personally I'm not a huge fan.  Some people love the fake cobwebs hanging down everywhere, or the fact that even at 3pm in the afternoon it's almost pitch black in there because of the themed gothic decor, or even the fact that at midnight on weekends the huge robotic frankenstein comes alive and is lowered down from the ceiling to flail around for a few seconds then go back up.   It's not really my cup of tea. I will hand it to them, the place is huge and so if you're going on a pub crawl or even just on a normal night out with loads of people, there will almost definitely room for you there. However, at the same time that's also one of this place's biggest downsides... because it can so easily fit large groups there will always, always be at least 3 stag/hen groups in there on any given evening. Depends what sort of night you want.   I think I'd have maybe given this place 3 stars if it weren't for the prices - I wouldn't mind being dragged along here by friends who seem to love this place if it were cheap, but expect to pay 3.50 for a pint... if you're lucky, the glass will be cold and/or clean.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "67NNj3RmManaW35SrBevhg",
        "caption": "Photo of Frankenstein &amp; Bier Keller - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/67NNj3RmManaW35SrBevhg/o.jpg"
      }
    ],
    "user_id": "oEshN5oq98_g23MvEnRc5A"
  },
  "dXnILs9Q74UJNBRpYh4OXg": {
    "date": "8/3/2013",
    "text": "Staff are not very helpful, place was dirty when I went in , couldnt even get a table to be cleaned for me and my friends. Pretty sure there was no booze in any of the cocktails . Also had a different very bad experience in this pub and the staff wouldnt even help out or anything. The only thing going for this place is the music that plays which is ok. Otherwise I will never be going back and neither will a large group of my friends.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VdAFcSPJgMvCAmp869X2gQ"
  },
  "M9B6ogChnGkXcwnbUVvLuw": {
    "date": "5/8/2013",
    "text": "Such a fun place to eat!  the food is good, comparable to most pub food in town. Its really the atmosphere  and old \"monster movies\" playing in the background that really make it. If you're going to take a guest to pub food, then you should go here!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BpKuNkYgAuisCNZlSzfUAQ"
  },
  "bSQgo_YDYeqY4Bd_h_Y95A": {
    "date": "3/11/2014",
    "text": "Don't know what's up with all bad reviews. Maybe I came at the wrong time. When I stopped by for lunch, I was the only customer. The food was good and the service great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3vk_JVJIwM3PC-3_IKrHNA"
  },
  "1JbrOooN9OB3Gg4XoNPBcg": {
    "date": "3/24/2013",
    "text": "Went in for lunch and had a really good cheese and bacon burger. Love the Frankenstein theme with Bride of Frankenstein playing on the big screens",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kYw-rhxxm5k5tCt4Z5kyjA"
  },
  "-ZrMA-M7nD0DBarKG-dYUQ": {
    "date": "5/4/2011",
    "text": "Great decor for the theme--spiderwebs, some shorts in beakers, random scientific looking stuff--and also great music for the theme--'its back from the dead: 80s music'. Not sure if they always play music by the decade, but they should. You would need to be in a certain mood to go there there though--not your average night out--and, because of the decor, I felt like I should have dressed up more.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5kMii2JySygayQpyPBjqCA"
  },
  "Xmc9RAw_NHIny7zqQ5x7qw": {
    "date": "5/2/2008",
    "text": "Former church, decked out in 'frankenstein' horror movie theme. There is also one in Glasgow and one in Aberdeen. Offers a wide range of cocktail;s, special offers on pitchers and other drinks promotions. Plenty of food available all day till 10pm. the food is freshly made, simple, no frills wholesome pub grub. The weekends can be very busy especially on an evening attracting a lot of young people and students. A very lively, multi-floored pub with a surprise visit from Frankenstien at midnight coming down from the ceiling. well worth the visit for the atmosphere alone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DL8irTGPCoOFhDtg0glImw",
        "caption": "Photo of Frankenstein &amp; Bier Keller - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DL8irTGPCoOFhDtg0glImw/o.jpg"
      }
    ],
    "user_id": "25vWgsIA4HMx9Ep-TSbdOw"
  },
  "2zFg8zFTtBXzHvDVRRs_bA": {
    "date": "3/30/2019",
    "text": "Absolutely stunning Atmosphere and worderful details concerning the decoration. Prices for drinks and food are appropriate. The food is ok but not spectacular. We were there for the smartphone pub quiz, which was great. Really cool host. Unfortunately many of the questions are aimed towards UK residents, but that's ok, we still scored 7th place :D",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "orX6h8MACMyRaKQTIv8UyA"
  },
  "wd04Ogf7ThyIxtnOQZ-eLg": {
    "date": "12/3/2018",
    "text": "This restaurant was very unique and fun to visit. I stumbled upon this place while visiting Edinburgh and found it very interesting.  There is a Frankenstein in the entry way that talks to you as you go by and once in the bar area, the decor is much like Frankenstein's laboratory. It was difficult to get service as it was quite busy in the bar but when I did get served, I had a Scottish beer and a classic burger and the food was average. I would recommend going here just for the experience though, it was very loud so if you don't like noise, maybe this place isn't for you.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kbsk13_G2-BpUCWwF_UB9w"
  },
  "SyPrt6Z1H8OhEmsmnYRLBg": {
    "date": "1/9/2019",
    "text": "Pretty fun joint located around the corner from our hotel. Our tour group had scheduled a NYE dinner here for 7pm and we were a bit nervous when the dishes that we had pre-ordered were taking a bit long to come out. Our Hogmanay tix said no admittance after 10pm so you could see where are nervousness was stemming from (we were a group of about 30 and another, larger tour group was also there). For my starter I had ordered the pea and ham hock risotto but it never made it to my table ( I think it stayed at our other tour group's table) but I shared what my table mates were eating. My entree was the salmon, and it as quite good, well cooked, but neede a little more flavoring, maybe even just some table salt would have given it the boost. I think i only had one bite of the Christmas pudding but at that point it was really time to schlep it over to the party so it had no lasting effect on me.   The restaurant has a lot of fun things in it so it was fun to walk around during the wait. Definitely a tourist spot",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "B9J6L6fVSrJ3cT8lif3hkA"
  },
  "WUYQ_9VdAcSj0gRBb8aIkg": {
    "date": "7/3/2018",
    "text": "I was the ripe old age of 22, traveling around Europe with my study abroad friends (years ago). We needed a bite to eat in Edinburgh and stumbled across this Frankenstein gem.   Around the same time and prior to meeting me, my husband was in Edinburgh with one of his buddies. On a cold and dark February evening they felt the pull of the monster and also ended up at this bar   10+ years later we find ourselves back in Edinburgh, this time together. The nostalgia of our youth is strong and we just had to end the night at Frankenstein's. It was as amazing as we both remembered. Pop music blared from the speakers, a dude kept ordering Jagerbombs, the black and white film played on a loop, and the monster descending from the ceiling surrounded by smoke and fanfare. I enjoyed my Strongbow and took in the show.   This place is totally worth it! So kitschy and amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "mvSbgmmSrCVR62i-csHGMA"
  },
  "X5XjKQQyPgc8_KGIz0PX4Q": {
    "date": "8/2/2018",
    "text": "The worst meal experience we've had in Edinburgh so far during our stay. We were 6 people who ate (burger, fried chicken, fries, chicken wings and soup) and each one of us was extremely disappointed. Poor taste, not fried enough and not enough spices. The burger was fried way too hard and the small salad piece on it didn't even look good enough to eat.  Service could be better. They guy who handed out the utensils actually put them down by holding on the side of the fork you put in your mouth. Also was quite difficult to get their attention when wanting to pay.   They do have an A/C so on a hot day it might be comfortable to walk inside but on the day we were there we were freezing.   The only thing we were satisfied with was the beer. So... go here for a drink, but don't eat...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XWls3ZSEi81T1YCN8Wwmhg"
  },
  "nL19b1RuUsRPifaJ30b7Lg": {
    "date": "8/19/2018",
    "text": "Such a fun bar. My friend and I wanted to go to a bar somewhere in Edinburgh and had no idea where to go. This place showed up and we though why not! When we got there it was super dark and eerie-but in a good way. We sat down and ordered some super fun drinks that were called the Frankenstein and Frankenstein's bride. We also got fun test tube shots! They had a lot of good deals for certain days of the week and discounts for students. It was also apart of a lot of bar crawls so people were in and out making it fun to meet people. Every hour on the hour something very exciting happens- but you'll have to go there to figure out what it is",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Y4jQh5BA1SrquHex3jT8w"
  },
  "OrfSoW8P-cYgz9VZ9iUKtQ": {
    "date": "7/29/2016",
    "text": "It's quite a big bar!  It has both an upper and lower level.  It's theme was right up my alley: Frankenstein.  From the moment you walk in you see a large statue of him.  Going inside, the walls have posters and pictures from the old black and white while there are film-based statues and figurines adorning all nooks and crannies.  The tables have spooky red votives and there's electricity style lightning balls near the high booths that provide sparkling light.  They even have the film playing on loop on two large screens right above their bar.  The menu and drink selection also pay homage to the theme.   I had a Bloody Mary Shelly for my cocktail while my husband had their Frankenstein draft.  We both enjoyed those and spooky, breaded haggis balls for a starter.  For our mains, I had their Cajun chicken sandwich while my husband had their hotdog.  Both plates were inspired in their presentation by the movie, too.  For example, my husband had a ketchup lightning bolt down his hotdog.  I really enjoyed this place, despite its touristy vibe.  I'd so go there again!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "5OZvqngWSRvdMeQQRkwzLw"
  },
  "T-p5b8Zda0saBz_pQczPPg": {
    "date": "7/24/2016",
    "text": "It claims its world famous but I wouldnt waste a meal here (for me it was my last meal in Edinburgh :/).  Slow service (we waited 40 minutes), menu that was out of burgers, steak and roast chicken, loud dining area and mediocre food.  The sweet potato fries were a bit soggy, and we had to go to the counter to ask for water refills, if our order was coming, and to pay because the waitress never came to check on us at all.  My party was able to get 20% off with the yelp check in instead of 10% off because they had no 10% off button, and \"I have never heard of Yelp\" and couldn't find a manager that did either.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5t1C0s5K622QP19-v8jH9w",
        "caption": "Photo of Frankenstein &amp; Bier Keller - Edinburgh, United Kingdom. Sharing platter + 6 of each type of wings + sweet potato fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5t1C0s5K622QP19-v8jH9w/o.jpg"
      }
    ],
    "user_id": "SSliWS7ujxBp3MtVwmX7Gg"
  },
  "s2hFhHvTw84Afjo_4gtdbA": {
    "date": "9/5/2016",
    "text": "We had had a long day trudging the streets of Edinburgh, and were ready for a relatively late (for us) dinner. After being rejected at our first choice (a steak restaurant that looked promising but had an hour wait), we stumbled into this joint. The first thing we noticed was how dark the place was, the second was how large the bar area seemed to be. And of course we noted that Frankenstein really lives to its name - if we didn't know any better we'd have been running for our lives.  But we're just a little smarter than that. Even though we knew we would not be getting Grade A steaks, we figured what was present would at least be adequate. We were correct. For starters we tried that Scotland delicacy, haggis, which was prepared in such a way that the taste wasn't too different from a chicken nugget. I naturally had to try their Frankenstein Ale, which was not at all scary but ran down my throat rather smoothly, and supplemented it with a hot dog (given our relatively late lunch, I wasn't as hungry as I might normally have been). Wife had the Cajun Chicken Sandwich - both of us wound up full, and made it through the night without desiring a midnight snack.  So, despite a rather touristy vibe, this place is: Recommended",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N6LeUJGpsS3vP5Rtz1TtKA"
  },
  "RSJK0-C6S4ilDSQssazQCg": {
    "date": "4/19/2018",
    "text": "This bar is ok I went when it was opening and the music was lame but overall cool bar",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y2lQYYDD3H-7w1Ej1EUy-g"
  },
  "5-aoQEkBD0Lbic4y_XLyIQ": {
    "date": "7/29/2016",
    "text": "No this place is good and silly! It's quite a big bar, and there are always some middle aged chaps trying to get you to salsa with them or some rubbish, but if you can shrug that off, you're in for a quirky few!   Quite dark, a good stocked bar, and some horror themed cocktails- some much tastier than others I may add! A lot of space, and tables a plenty, though it still does get pretty packed, and people will jump in your grave when you get up to go. Votives, gargoyles, dark wood, and a frankenstein animatronic will pop down to you a few times.   It's novelty, and very odd, I like that kind of thing. The staff were lovely, the bouncers even offering to put our rained on coats on radiators and such too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PIqgaeMSEh7i0AmFgtCYOA"
  },
  "moWZnWctnTIq2e70B5c1hg": {
    "date": "1/27/2017",
    "text": "Very popular, very touristy place.  The drink selection was decent.  It was very crowded and seating was hard to find. I would recommend not going anywhere close to peak hours.  The decoration was pretty cool, very unique.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "m9BOYtBwrFEQryDrtiyvNA"
  },
  "6RBcX4mXDWDIefmq0mX3NQ": {
    "date": "9/8/2016",
    "text": "The bar downstairs is quit big. Frankenstein movies are playing on big screen in black & white. So much decoration on the walls & ceiling, kinda kitchy. Me and my friends arrived here a little after noon, the place was empty. The girl at the bar wasn't really friendly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "H8eGhYKK5TivXIw2A5zraw",
        "caption": "Photo of Frankenstein &amp; Bier Keller - Edinburgh, United Kingdom. Hot wings!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/H8eGhYKK5TivXIw2A5zraw/o.jpg"
      },
      {
        "img_id": "DAFZb-YyzA1IU_DN7MkLvA",
        "caption": "Photo of Frankenstein &amp; Bier Keller - Edinburgh, United Kingdom. Long Island ice-teas for the win",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DAFZb-YyzA1IU_DN7MkLvA/o.jpg"
      },
      {
        "img_id": "1Vvhg7F_Iaim6BDV9R9x_A",
        "caption": "Photo of Frankenstein &amp; Bier Keller - Edinburgh, United Kingdom. The bar downstairs!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1Vvhg7F_Iaim6BDV9R9x_A/o.jpg"
      }
    ],
    "user_id": "G8-12mXz5NgPqsFOuIeqLg"
  },
  "r4TtmWVe6_KuDCCNeAW9bQ": {
    "date": "10/22/2016",
    "text": "I enjoyed going to the karaoke night with my friends. It is great fun! Although the acoustics is not the best. The food is not that great, but there's a good variety of drinks - with student offers!! And the location is absolutely fun - that giant Frankenstein - amazing!! :D  Unfortunately the DJ often forgets people who wanted to sing - but still: worth a visit!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tUdyuqlMqd9Vvs4UuT0gHQ"
  },
  "QtGIPiwX2VKuDIKdZvs1Eg": {
    "date": "12/14/2015",
    "text": "'At 5, Frankenstein will come out.' We had small children and we had been warned. What did this mean? We soon found out. Frankie was prompt, joining us five minutes early. The lights went down. The spooky novelty music came on. Everybody is looking around for something. And then above us we see a mechanism slowly come out. There he is. Robotic Frank slowly sits up. Head turn to the right, head turn to the left. And then he's retracting in again, back in his cave. We were underwhelmed.  One of the weirdest bar experiences I've ever had, no doubt. So, Frankenstein is an a-okay bar. We were drawn here because it was child-friendly (yes, really!) and spacious enough for my friend to bring in her pram. I wouldn't make a point of going out of my way to come here, but it's fine for a one-drink stop.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "8rI2CoS4ltQePbZceSOgow"
  },
  "G8VWnqTk1lz9w9mWaDLiFA": {
    "date": "1/20/2014",
    "text": "Eh, Kind of a tourist trap. I mean, it is entertaining and all your first time out, but once you've seen the cheesy decor, it is just another club. No, this is mainly for the college and the tourist too confused to realize that this has nothing to do with Mary Shelley's classic tale published in 1818. I have a hard time imagining any self respecting local or yelper, saying, \"Yup, this is my bar.\"  However, I could be wrong, for the strange and unusual thrives in every country, I once spent an evening in a Russian Ice Bar in Nha Trang, Vietnam, so anything is possible, I guess. No, for me, I would much rather explore the hundreds of authentic bars in Edinburgh, Still, to be fair,I had popped in hear alone, so this bar might merit another star if I had been with a large group. Next time, I am in Edinburgh, I may drag the whole clan down here and see what they think,",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "IFkSQLXXTMACoWirAYI1jw"
  },
  "-C2DSC8LTQEwUUOzYprQiQ": {
    "date": "11/5/2016",
    "text": "Food =  average bar food, karaoke = decent to good, 3 story Dr. Frankenstein laboratory with massive lightning electrodes = AWESOME.  If you want to feel like your singing in pub with all your rowdy pitchfork villagers before a night of monster hunting, this is the place!  Sing, drink, and go chasing after Frankenstein!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Fda8JkSLGPYG-4s_cYF3ug"
  },
  "Uh73W505QEOE4-BKIsM3GQ": {
    "date": "10/22/2014",
    "text": "Why do I like Frankenstein's?   It's been here since like my student days - and in today's terms, that means forever.   It's part of a chain of horror pubs (seen in Edinburgh and Nottingham...probably elsewhere too) with cheesy cocktails that I used to knock back when I were but a lass, and cheap beer/wine that I knock back now that I have earned my flat cap and pipe. I was a wannabe goth as a teenager, so the vamp in me can never resist a visit.   It has easily accessible toilets that you can get to without having to endure the stares of the barkeep (honest, I'm coming in for a drink!).   I've never, repeat, never not been able to get a seat. Trying to get a booth, however, can be a wee bit more challenging, but I am happy to report, challenge accepted on many a time.   I don't think I've ever spent a full evening here, or in any of the theme pubs, but it's a bit of cheesy, cheap fun to throw into an evening, and great during a rainstorm.   Now, do I really want to go to one of their theme dinners? Hmm, maybe not so much....",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "X2uF3C3YBD24xcgKA104Sw"
  },
  "P5jlcbGFg0r16IL7QJbg9g": {
    "date": "2/17/2015",
    "text": "This used to be a regular hangout when I was 18 year old student. This chain pub is pretty much what you'd expect for a themed drinking establishment. The horror vibe is quite fun, featuring a dummy Frankenstein that makes an appearance when the clock strikes the right hour.   I've only ever been here for drinks, never food. The space is quite large, the bar is adequately stocked and service is fine. They have wine on tap here - it's that kind of place. In the evening the music is really loud so it's a shout-in-your-ear joint, and there's a central space downstairs for dancing and merriment.   I'd never choose to come here, but if you're in a large group or need an inoffensive pub that's centrally located then this should suffice.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fcMTpwfLS9F5DWTqlp8ktQ"
  },
  "0uU1HPLAF56TQo89ZymlgA": {
    "date": "12/24/2013",
    "text": "I'm going to go on a limb and guess that red neon bulbs probably weren't around in 1818.  That's not saying I wasn't excited about visiting, but I had doubts about many of its claims.  Its full name is The World Famous Frankenstein 1818.  World famous?  I know the novel, The Modern Prometheus, which for me is a more ominous title than just Frankenstein, but world famous?  Is the novel world famous or is it the pub, because I'm pretty sure I can ask ten random people in my home town and they wouldn't know anything about it.  Can you just call yourself world famous?  And its title, \"The World Famous Frankenstein 1818\", was the pub was founded in 1818?  That's somewhat hard to believe considering the novel was published in 1818.  And that really is its full name, The World Famous Frankenstein 1818.  That's a mouthful, so I'm just going to call it Frank from here on.    When I entered, instead of some dated dungeon-like pub replacing walnut wood panels with roughly interconnected cobblestones, I found that Frank had red faux leather chairs, iron girders, and...what do you know, walnut wood panels.  This is not to say that I was disappointed with Frank.  As pubs go, it's breathtaking, except it feels more like a night club than a place people would gather to eat.  Frank is very dark, almost shadowing the details of an establishment which probably cost millions to construct.  It blends old-fashioned and decor with modern accents though I felt the latter overshadowed its attempts to be dated.    I can't hate Frank...I can't.  It looks too good; I just wished it looked...well...older.  As it is now, it's more of a tribute to the films than the novel, a snapshot of some fantasy we wanted the world to look like in 1818, not as it actually was.  Frank is a collage of movie sets slammed together into a pub.  Not bad, just not what I expected.  It's part steampunk, part gothic, part modern nightclub.  I would even go so far as to say that your opinion on the decor can radically change depending on which angle you're looking at.  As for the food, we opened with a shared plate of nachos, towering taller than the red cuillins.  This would be enough as a meal for two, but we were foolish and had already ordered mains.  I had the Franken-furter (oh I saw what you did there) while my girlfriend enjoyed the haggis, neeps, and tatties.  These are huge plates of food for surprisingly reasonable prices.  One would expect huge markups given the location, but no.  I keep getting reminded that most pubs don't offer good food, but so far, this has not been my experience.  If you ignore the borderline menacing decor, is Frank a worthwhile location?  I would say so, but I would also say that its intimidating nature may frighten away people looking for something a bit more mundane.  Don't get me wrong, Frank must rock during Halloween, and I would rather return here than to The World's End for the simple fact that I can stretch out my arms in Frank without taking out an eye of someone at another table.  But it's also obvious that Frank is not meant for anyone older than 40.  It's not where men in tweed jackets gather around for a pint after a long day's work.  It's for students after exams are over, and they become possessed with an overwhelming desire to get so inebriated, their gait and mannerisms would make the famous monster articulate and agile.  The truth is that I would not be caught dead in Frankenstein after 10:00 pm given the obvious demographics that would congregate within it...but until then, I would definitely love to book it for my next birthday.    DECOR:  9 PLATING: 7 SERVICE:  7 FOOD:  8 VALUE:  7  OVERALL:  7.6 out of 10",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "tmLFOG2DbYRFy8fdJ3__1A",
        "caption": "Photo of Frankenstein &amp; Bier Keller - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tmLFOG2DbYRFy8fdJ3__1A/o.jpg"
      },
      {
        "img_id": "SNVlRkv64tbv_KmZhCNpTw",
        "caption": "Photo of Frankenstein &amp; Bier Keller - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SNVlRkv64tbv_KmZhCNpTw/o.jpg"
      },
      {
        "img_id": "hmjCJlax89lKaZHiOGehIg",
        "caption": "Photo of Frankenstein &amp; Bier Keller - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hmjCJlax89lKaZHiOGehIg/o.jpg"
      }
    ],
    "user_id": "ZwLfrWgTq7uFBQMEjr5ugA"
  }
}