{
  "j0VAXljsqCRAyoCs17w4Bw": {
    "date": "6/9/2019",
    "text": "Amazing Nepalese food. We were in Edinburgh for 3 nights and came here twice with our friends. Incredible food, good atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vytcAFfIObNag095e6MzaQ"
  },
  "NpDxisqzxtQhwt5ERb-0aQ": {
    "date": "3/26/2017",
    "text": "Overall it was a decent experience but not impressive.  The place was somewhat deserted when we arrived so our 5pm Sunday advance reservation wasn't needed.  Chicken momo dumplings were ok but were about 1/2 the typical size I've had elsewhere, and only 5 were served with a slightly spicy tomato based chutney.  They definitely took the 15 minutes and more to steam.  Saag paneer (cheese with spinach) and lamb khutta Nepali leg of lamb) were flavorful but over salted and the naan was small and a bit too thin for the price.  Service was satisfactory.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "tdklMiQwQSR7nKTtctr_6g"
  },
  "rFFZc_GKevRa3l_vDIgYGg": {
    "date": "12/31/2013",
    "text": "I don't know what astounds me more, the fact that Nepalese cuisine is an option for the culinarily curious or that there are so many of them that they fight over the same name.  I tried to research my review for The Gurkha, a restaurant in Edinburgh, not to be confused with the Gurkha cafe.  And not the Gurkha Brigade, which is...really, three Nepalese restaurants with the name \"Gurkha\" in the title all in the same city?  Is that a condition for being a Nepalese restaurant?  I would be happy to just have a Nepalese restaurant in my home town.  The closest I could find was in Vancouver, and its name is...huh...Gurkha.    I shouldn't be surprised about that.  By the way, the Gurkha I'm at claims itself the first and \"original\" Nepalese restaurant in Scotland.  I can read between the lines and that's effectively a giant middle finger to the other like-named restaurants.  Oh and if you click the website link on TripAdvisor, it takes you to the WRONG Gurkha.  That must sting.    The Gurkha is an adorable sky blue-painted restaurant slotted between an acupuncturist and a Chinese take-out place, all three occupying less sidewalk space than a McDonalds and located on Morningside road (not to be confused with Morningside place or Morningside park--oh for the love of GOD, Edinburgh; you're not that big of a city!).  Gurkha is considered large in that it occupies two storefronts, one door blocked off, yet it only takes about five seconds to cross on foot.  What I'm saying is that the businesses in Morningside are tiny; it's like an economy of Lilliputians.    The interior was a modest collection of white-draped tables, red shod chairs, and walls painted in an ill-advised choice of yellow promoted as amber but coming off as \"corn via protein spill\".  The decor was simple, with few fixtures hanging from the walls.  The staff was stone-faced but welcoming, wrapped in ties and vests, very posh considering the time of day.  The effort was appreciated.  I entered at lunch and noted the massive menu and listings with a very pronounced Indian inspiration.  Biryani.  Masala.  Poppadom.  Of course, there would be some carry-over--I've mentioned in other reviews that country lines mean effectively nothing and that True cuisine can only be graded by tribes and ethnicity, and even then one must acknowledge the sharing of trends between neighbors.  I say all that to educate some and prevent my lynching from others.    What distinguishes Nepalese from Indian (apparently) is the reduction in spice and the increase of sweeter ingredients like ginger.  This was confirmed with the dishes I ordered.  I say dishes for lunch because the Gurkha offered a lunch special, three courses for 6.95.  The first was a trio of fried breads with huge buckets (BUCKETS) of various dips and curries, after...I'm sorry, did I lose you?  You seem to be stuck on that price.  That's right, it wasn't a numerical error.  6.95.  Pounds or dollars, despite conversion, that's really cheap.  The menu prices were a little higher on average, perhaps dauntingly so if you only wanted to stop in for a quick bite, but 6.95?  That's the price for a starter in any other restaurant and here it's for three courses!  I felt like I was robbing them.  The courses were fixed but that's the brilliance.  It's one thing to have a daily special a few dollars less but to have a three course combination meal, it becomes a given.  Who would think of ordering off the main menu with a three course option for 6.95?  And you still get to choose if you want chicken, lamb, beef, or pork.  You still get a colossal slab of naan so large you can't see the plate it's served on.  After that you still get dessert.  This is beyond a good value.  And thankfully the food was fantastic.    It was my last day in Edinburgh and the Gurkha reminds me dramatically of one of the many things I will miss about this city.  The value and possibilities cannot be quantified in the number of words remaining in this review.  The Gurkha may be one of several Gurkha-named restaurants in Edinburgh, but it would be difficult for the others to measure up.  There are many places to eat in Morningside and if you happen to be wandering along the road and come across Gurkha, THIS Gurkha, it's worth your time.  Food:  5/5 Service:  3/5 Presentation:  3/5 Value:  6/5 Recommendation:  4.25/5",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3twQvp7k78CebHOS1299MQ",
        "caption": "Photo of The Gurkha - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3twQvp7k78CebHOS1299MQ/o.jpg"
      },
      {
        "img_id": "nm3TdMj1F_FU3kxnNUJI1w",
        "caption": "Photo of The Gurkha - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nm3TdMj1F_FU3kxnNUJI1w/o.jpg"
      },
      {
        "img_id": "F0RfZ26_eHM9LZrEhX0mZw",
        "caption": "Photo of The Gurkha - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/F0RfZ26_eHM9LZrEhX0mZw/o.jpg"
      }
    ],
    "user_id": "ZwLfrWgTq7uFBQMEjr5ugA"
  },
  "x9EjWNEeHatXIqRbKBZKjw": {
    "date": "4/30/2013",
    "text": "We needed something quick to eat before the cinema & so we thought we'd give this a try. The service was efficient & the food was really tasty. I had the chicken dhansak and it was one of the best I've had in ages. If you're in the area it is worth checking out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "R9UNH0rb3a_glQlk4ylKCw"
  },
  "Fc2yn_znaWjgnkWInSA-4Q": {
    "date": "7/19/2013",
    "text": "The Gurkha looks like it has been around a while, decor wise. The SR is a fan of Nepalese cuisine, so I suggested we pop in one evening.   I did my normal - I'm starving and plan to order EVERYTHING. Much to my horror, every single item I ordered was HUGE. Mains, sides, the lot. I tried to avoid looking at the SR, in shame, as I knew what he was thinking. Miss piggy wiggy, stuffing her face in the corner full of delicious curry. Well, I reasoned back, I have lunch for tomorrow! This is why taking home leftovers is a Good Idea.   It's been a while since we visited, so I don't remember what I ordered (apart from it being vegetarian, that is for sure), but we did enjoy our meals, but struggled with the volume - so heed our warning, as with others - don't order too much!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X2uF3C3YBD24xcgKA104Sw"
  },
  "ONnnmErWmMgh5FxHYElIww": {
    "date": "7/28/2012",
    "text": "The odd occasion i venture down into Morningside in the evening i always get a huge wift of the most gorgeous smell from The Gurkha so finally after 7 months living in Bruntsfield we decided to try The Gurkha for a takeaway!  WOW is all i can say, the taste certainly lived up to the reputation of the lovely smells that waft from the restaurant doors. It was alot less spicier than Indian food but alot more flavoursome.Myself and my partner both had chicken dishes and the quality of the meat was fantasticand the pilau rice was really nice nothing like the rice you get at an indian restaurant. We will certainly be trying this restaurant again.  The only thing that stopped me giving it 5 star rating was that because the restaurant is really quite small they didn't really have space for us to wait for the order which took about 20 mins so we had to go away and come back, but they do delivery for next time!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KVzcPnrigbaQbfKhVBmp0w"
  },
  "edTGfyh0irfUZbQqol39PQ": {
    "date": "5/1/2010",
    "text": "I think I've finally learned the difference between Nepalese and Indian food. Whenever I see a menu claiming to be Nepalese I always feel a bit cheated to see familiar things like Biryani and Tikka Massala on there, but apparently the difference between the two is that traditional Indian dishes are much creamier and coconut-based, whereas Nepalese is based around tomatoes and lentils.  That's one of the things that's so good about The Ghurka - you go for a curry but don't leave feeling like that girl in Charlie and the Chocolate Factory who swells up into a giant blueberry and has to be rolled out of the room.   We went for lunch, where you have the choice of the a la carte or their 5.95 Set Menu. A main from the a la carte costs about 6-9 so we thought the set meal looked like great value for money. Also, you got a choice of at least 5 or 6 different things for each course, and it wasn't a buffet, which is always a bonus.   With your main course, you had the choice of whether it came with rice, chipati or poori, and I have to say their poori are easily the best I've ever eaten in my life. When the waiter set the plate in front of me with 2 huge ones on it, I thought I was never even going to get close to finishing them both myself. I did.  I can't review this place without mentioning this one thing though: on the lunch menu, although you have a choice of loads of different meats/fish/prawns, and you can choose the spice level, it's still just described as \"chicken curry\" or \"lamb curry\" etc. It doesn't exactly give off the most exciting impression of the food, although when it came we did all agree it was delicious.  Also, this is an ideal place to go for a chilled out, relaxed meal. I wouldn't eat here if you're in any sort of rush, as the service wasn't the fastest.  Definitely worth a visit though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gmaJZ0n3yOZvUJM_zCSgCA",
        "caption": "Photo of The Gurkha - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gmaJZ0n3yOZvUJM_zCSgCA/o.jpg"
      }
    ],
    "user_id": "oEshN5oq98_g23MvEnRc5A"
  },
  "MpeNXuHhiEHBx88OMA72Ag": {
    "date": "6/23/2010",
    "text": "The Gurkha, with its pleated tablecloths, smiling waiters, and dinky interior has an old-fashioned charm, that is complemented by its range of extremely tasty curries, which are satisfyingly spicy without being so hot that they bring a tear to your eye.    My particular favourites are the channa masala and the bhanta (aubergine) curry, but I've never had a dish there I didn't like - though, as I've found out the hard way, the portions are extremely filling, so avoid the temptation to order too much!    It's location makes it the perfect place for a bite to eat after catching a film at the Dominion over the road, but in my opinion, the Gurkha is a real Morningside gem, well worth heading to in its own right.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "N3J-41OHb87d-d395bMDmQ"
  },
  "LpQ23vaoS4U-9uXKKUYhGg": {
    "date": "6/12/2010",
    "text": "Being situated on Mornignside Road, The Gurkha has some stern competition in the form of other South Asian restaurants.  However, it certainly rises to the challenge, and the food as well the service are excellent.  When you enter the restaurant it feels inviting and has a particularly enclosed atmosphere with a maximum capactiy of about thirty.  The tables are all quite close together and we all felt a bit crammed when I was in, but this just added to the environment.   I ordered the lamb bhuna with a garlic naan and plain rice which only took about ten minutes to be prepared and served.  The sauce was amazingly creamy with a good range of flavours in it, and the naan and rice were just the right size to make it a satisfying meal.  The whole thing only cost around 8 which was definitely value for money, and the waiters were polite and friendly  The Gurkha also do takeaways and deliveries on all their dishes so, if you're in the area, there's no excuse not to give them a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "B9RzCwdUbXb_2GyhiOjOeQ",
        "caption": "Photo of The Gurkha - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/B9RzCwdUbXb_2GyhiOjOeQ/o.jpg"
      }
    ],
    "user_id": "yfXqZkU5iXE07GSHzdsQBA"
  },
  "qGEzESSJJf2_bSnQkQQbrA": {
    "date": "11/16/2008",
    "text": "I used to live in Morningside and it was a struggle living so close to the Gurkha and trying not to order from there every day! It provides an excellent takeaway service (not sure if they deliver but you can definitely collect) and the food is just delicious. The restaurant is small and intimate - but not too intimate- and the service is unobtrusive but effective.  The food is delicious and suits both those who like their curries hot and spicy and those who prefer their curries with juswt a hint of heat. Either way the food is tasty and it is nice to eat something just that little bit different. I never knew anything about Nepalese food before eating there but I am definitely glad I gave it a try. If you are looking for authentic Nepalese food in a lovely, friendly restaurant this is the place for you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9pT2y3XKs0Iq9Wq_FWnnkA"
  },
  "2GAxu_BdtAIlbphxQEHFYw": {
    "date": "5/22/2011",
    "text": "Friendly enough and good service. Menu is OK but not very exciting. Interesting to see Nepalese dishes, though these ate not super exciting. A good local \"curry house\"? Definitely.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pWu0bPDRCOuNQs9aAawa3g"
  },
  "jqZlO36KaxKNX32lHXHOVQ": {
    "date": "5/8/2008",
    "text": "The Gurkha is situate along the main Morningside Street so is well located for those that wish to enjoy all aspects of Morningside (e.g.-pubs and cinema). The restaurant is easy to see with the blue writing across the front of the shop. The restaurant is very small in terms of numbers (max 30 at a push) but is almost always full for evening meals and is usually busy at lunch times. The layout is well done to maximize numbers of potential customers without making any paying client feel squashed. The decor inside is very traditional of Nepal and there is a lot of historical information about British colonial rule over Nepal. The owners are very proud of their heritage! The interior has a constant stream on dulcet Nepalese tones, very different to Indian music, which is always a treat.   Good menu, helpful staff! good value, happy days!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qFOy-T6HU4WxS5t_34IBaQ"
  },
  "HY4JwoxGtvz902l6CmIZ9g": {
    "date": "4/16/2008",
    "text": "A great place to get a curry, they have many specialities and the staff are really friendly and remember you after you've been in just once. The menu is much like a standard Indian but as I say you get some specials and it is very resonably priced for Morningside.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OvZ7cVhTcJ55yb_mtUhC1Q"
  },
  "6XjqM4E4-kERSN9PUdbEFg": {
    "date": "5/7/2011",
    "text": "Food was a bit stale and the service was scary. It was like being at a funeral!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yxplUTyzTXGz0Fj1doXWcA"
  },
  "xoIb6oJ_kLM98g8D_z7sBA": {
    "date": "6/30/2013",
    "text": "delicious meals, very quick and polite staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O0i6vJuPPXI-ZQGoI7Ze6w"
  },
  "HwD4LT5RJ2UmeagzjLjhVg": {
    "date": "9/11/2008",
    "text": "Delicious for onion naan, hot chicken madras and other curries. Definitely above average compared to other Indian restaurants in the country. Its a pity that the restaurant is so small that you may feel a bit uncomfortable sitting too close to others.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Os-3Aeoig8tTudYLUfOxTw"
  },
  "ic1xPGU5QPXxzKME4eX1DA": {
    "date": "2/10/2010",
    "text": "me personally i love ethnic foods, indian thai you name it, but here at the gurkha i defy anyone to sit inthe small restaurant look through the extensive menu, have a gorgeous meal, and feel absolutely well fed afterwards, having dined in a few times i have had nothing but excellent service and food, and recently laziness took over and we had a home delivery. within the time they stated, food exactly as if in the restaurant, delicious, i cant get enough of the place, trying to work my way through the menu. you have got to try it .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LetQ_P57MAzeGebtMKTqiw"
  }
}