{
  "ymmMzVQDJOR3o3a8zUqhyg": {
    "date": "12/11/2016",
    "text": "I want to like this place, I really do. The interior is nice and cozy, albeit small, the staff are friendly, the service is quick, menu is rather large. The lunchtime queues would suggest the food is outstanding...but it struck me as rather midline, mediocre at best. Don't get me wrong, it tastes okay, but for someone who really loves Thai food, \"okay\" is the only qualifier I can use. And for the lacking price to portion size ratio (caution: cash only!) I can't justify eating here frequently. I've been here multiple times and have tried several rice dishes, side dishes, and the tom yum soup. The sauces overall taste like they were poured from a bottle bought from one of the Asian markets down the street. The soup broth was scarcely spiced and flavored. The tofu has a nice crispy fried texture, but I was curious as to why they paired tofu with tomatoes and cucumbers, not exactly Thai staples. Overall, I'd eat here again if it was convenient, perhaps try the curries and give the food another chance, but this isn't a place I would go out of my way for and isn't a place I'd bring visiting friends.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M-IFKk7TUPay6nX4INfWug"
  },
  "Dk3Mp5blvRVRBq5UyPKyUg": {
    "date": "2/5/2014",
    "text": "Best green curry in town so far. Service is not too fast and a bit cocky, but I don't mind. Lunch prices are very reasonable for the quality of food they serve. Great place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ihec1-9B0NHOrmQrRXUppg"
  },
  "RwiKmrrUqoS2nysqgeG83w": {
    "date": "1/9/2014",
    "text": "Second visit and fab fresh food again. Had nam tok nua (thai spicy beef salad) with thai parsley removed and sai Krok E-San and mr m had nua yam talay with rice on the side and the obligatory sweet potato crispies. Everything is made fresh so extra chilli can be added for the brave and for my fellow coriander and parsley haters that can be left out. For two mains and sides and juice for two its around 24. Excellent value for money.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "an8U16gLBUAT2S2Hlr8G2w"
  },
  "53fVmBTtgXi6tMkTyt7lLg": {
    "date": "8/8/2015",
    "text": "Yes yes yessssss!  Although there was a pretty long queue outside (due to fringe fest) our group of 4 only waited about 15mins to be seated. Service was really fast, our orders were taken well within 10mins.  The self service water jugs are a great idea as it probably saves the waiters a lot of time - thumbs up for this idea! We had the prawn starters which were AMAZING! All our main dishes were absolutely delicious and full of flavour - decor may not be \"authentic\" but with food that good and that affordable - who cares! A friend even went as far as to say \"Best Thai I've had in the UK, better than in London\" big claim, which it definitely lives up to in my opinion! An absolute must if you love Thai food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Ge372SNSBFGvwo0Uld2bA"
  },
  "UqVSdYewF0IuebKqfxNTvA": {
    "date": "12/21/2016",
    "text": "Best Thai food I have had in the UK! So fresh and tasty and a really cool atmosphere. We went earlier in the evening so didn't have to wait for a table but I think there would often be a line. Definitely worth the wait though. Staff were really friendly and it was brilliant value for money. Would highly recommend to all!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f4L2L3_JySRE98LYnQQ0Ow"
  },
  "MeBATXmFNfQlauqq-iZ0fw": {
    "date": "7/11/2014",
    "text": "Super tasty food, pretty affordable prices, dare I say it \"healthy' as well - I really enjoyed Ting Thai and was delighted that I got the opportunity to check it out while visiting Edinburgh this week!  I love these sots of places where world food comes together with a modern interior, funky staff and a bizarre soundtrack that really hit the spot! 80's synth classics rubbing shoulders with the best of classic soul really worked and for me it was a great way to liven up my usual fairly average Monday lunch times.    I'd love to say what I had off the menu but I don't know what it was called. In fact the waitress actually brought me the wrong food (a couple of friends who'd eaten 10 mins before recommended their dishes and said what I got wasn't what I asked for off the menu) but it looked pretty good so I stuck with it! Basically a seafood stew with just the right level of spice, sticky rice and very very nice squid - YES!  Next time I'm in Edinburgh - I'll be making sure I check out Ting Thai again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "SdyaF3_mFMdCig_25qW7TQ"
  },
  "s95mGarRhxEhvMvXiiv0JA": {
    "date": "5/24/2015",
    "text": "delicious food! We thought of this place as more of a fusion Thai and stopped comparing it to other Thai restaurants that we've enjoyed in the SF Bay Area (California). In that light, it was delicious.  we had: pad thai, pad see ew, green curry. all with chicken a duck dish, and the pork-rice ball thing. all were delicious.  the chicken portions in each dish were quite generous.  if we were staying longer in Edinburgh, we would definitely come back!! highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j9WoUNalIHDpJATFFMWclA"
  },
  "R69vVvKD-DYoBSPz6dBMow": {
    "date": "1/14/2014",
    "text": "Heard some good reviews of this place, so ventured along for some thai treats one evening. The decor is really quite nice and we were quickly shown to a seat and presented with a glass of water each.   Lots of interesting looking choices on the menu and the restaurant had a really nice buzz, as fellow diners got on with their evenings. We had our choices sorted and the waiter came over ... different person than who seated us.   Ordered some tofu and were told that they had ran out. Which I found a little odd for an asian restaurant, so thats the menu options cut in half for my veggie dinner mate then.   Informing the waiter that she is vegetarian she was cut off very abrobtly half way through and told \"you can have vegetables!\". Okay its your menu any suggestions mate? nope nothing he just stared at us and repeated the \"vegetable ones\"... this was all getting a bit weird.   At this point we asked well what is vegetarian and we were told pretty much nothing as it all has fish sauce. Another bout of akward silence and staring. Normally in this senario people suggest well we could subsitute fish/oyster sauce for soya sauce or similiar. Maybe even speak with the chef and see if they could at least put out one dish thats vegetarian. Sigh nope we just moved on to a new restaurant as we clearly werent welcome. ended up with a  great meal down the road.   I will come back and re-review this place at some point with some omnivovore friends as I love Thai food and grew up in asia, but come on its Edinburgh 2014 surely you could cater for vegetarians in some way... phad thai phak maybe or even just be a bit less hostile. Thumbs down on service from me!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "PQq5JGWvr0u_IKDXZyDAgA"
  },
  "jrfkQy8zM5HZt-stTQLn_Q": {
    "date": "2/25/2016",
    "text": "DOPE  great atmosphere, great food, awesome sweet potatoes starter, BIG portion of meats in every order, love it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "P0qOM3GWCATqg1ihbj2Csg"
  },
  "0QdvvH5JSwnHH7GjRutSlg": {
    "date": "7/17/2015",
    "text": "There are few places in Edinburgh that consistently offer delicious, masterfully crafted, full and fresh flavoured food, and one of my go-to places is Ting Thai.   They never fail to serve yummy, balanced dishes that fill me up just enough, and leave me satisfied. I always leave with a smile!  Great music, very friendly and efficient staff, the kitchen staff all have Thai roots, and the design and atmosphere is simple, relaxed and has a refreshing sense of community. They also offer takeaway, plus if you dish is served in a box you can take it home if it was too much.  If you're in the area, drop everything and go here. You won't regret it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l9WbumDKDweph3iKDgUkJQ"
  },
  "C0jY5ZfvITX-fg7dEVlFRw": {
    "date": "5/13/2016",
    "text": "This place has constantly been on my top list for lunch. Offered for a bid time window (I think it's from 12 to 6pm) there is a nice variety of lunch options at very competing prices (an average main costs about 5.80) and the portions are very filling as well. I recommend their pad thai noodles and green curry chicken.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9X8XPJCTqrsiGwsiyuJBTg"
  },
  "otwCUEtWgDtsGq8Jqxth-A": {
    "date": "1/22/2014",
    "text": "I've been coming to the restaurant regularly for the past week. The food is delicious, definitely recommend Kao Mun Kai Tod. The food deserves a better review but it is the horrible customer service that made me give this restaurant a one star.  I came in for lunch and it was very busy, so I decided to wave at the waiter and said \"excuse me\". The man with attitude came up to me mocking my waving gesture and said \"I can see you and you don't have to do that\". This is the first time in my life I've ever seen a waiter getting offended because a customer tried getting their attention by waving and saying excuse me. As a customer I must say I was truly offended, Mr. Attitude came to pick up the menus after we have ordered our food. As a concerned customer I reminded him that his job was a waiter and that's not the attitude he should have.   After speaking to a lady who appears to be the manager, she told me something along the line that \"waving to a waiter is unacceptable in Britain and this is not how it works around here\". I then apologized to her for losing my temper at their employee and came to a conclusion that customer service is non existence in this particular restaurant. It's a shame. Really.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "H5fUPpCnozIhD0IVF6Vb2g",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/H5fUPpCnozIhD0IVF6Vb2g/o.jpg"
      },
      {
        "img_id": "S4tz71nXwLL_HqafjjvJKg",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom. Kao Mun Kai Tod",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/S4tz71nXwLL_HqafjjvJKg/o.jpg"
      }
    ],
    "user_id": "E9cyktYO2DvuCAbkjVSxLg"
  },
  "r85GjdzrUZj_C_Al_MMPsQ": {
    "date": "8/17/2015",
    "text": "I found it weird that this restaurant only ranked 400th on tripadvisor. To be honest it was one of my favorite restaurants in Edinburgh so far!!! I went there with my colleagues, and ordered a portion of rice with chilli and pork in it (sorry I can't remember the name of it but it was the last one in 'rice and noodles' session on the menu). Don't expect too much on service because it's always full of people...the price was fair though. Even it's festival season, rice/noodle will only cost you around 5-6 pounds per person.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "UqrBc-0rQViX_RW7dinkMg"
  },
  "MONsO9WL5OKFK9K7WSdWPw": {
    "date": "11/7/2015",
    "text": "The best pad Thai in Edinburgh... Generous portions some of them served in nice boxes...good prices... On top the place is quite cool looking...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dqc63Kw6nJGAasTVS2Xmtw"
  },
  "gjwcsn_clabkKVgQOmJ9VA": {
    "date": "1/5/2015",
    "text": "We walked by on a Saturday afternoon and it was packed, so we were excited to come back on a Sunday for lunch and see what the fuss was about.  It's a very modern and casual restaurant, with unusual art and music, and communal tables with stools for seating.  Very trendy, though not a place you want to linger for hours as you'll be sat next to somebody else and you can't lean back at all!  Cash only as well.  I can't find a menu online, but I remember that it was full of really unusual offerings.  Not just the usual curries you see anywhere, there were lots of ingredients I'd never heard of in fascinating combinations.  We both went for the Kuay Tiaw Nam Tak Nua (under the Soup Bowl section) and added noodles for 1.  Apparently noodles aren't traditional in this soup, but I'd recommend them!  This is a flavorful, herbal soup with beef broth and extremely tender meat (though not quite enough of it).  We also shared a few snacks - a side of stir-fried veggies (which were oddly delicious, they were cooked very gently in a very delicate sauce and were a vast improvement over the usual bland steamed affair) and an unusual side of calamari and prawns in a sweet-sour sauce with some crispy crackers in.  I didn't really \"get\" that one, it wasn't what i'd pictured.  Felt like proper street food, lots of things all blended together in a box with strong flavors, but it was a bit of an odd combo!  Our soup came in bowls, but all the other dishes came in little cardboard boxes that look like they're meant for takeaway, which is a cute little touch.  Oh, and we got a lemongrass ginger juice - and hated it.  So sticky and sweet and strange.  Fiance said it tasted like squash (not like, butternut...the concentrated juice syrup that you can get in the UK) and we left it almost untouched.  It's a very cheap place to get a meal!  It's certainly an interesting dining experience, I love how different it is and how full of surprises the food was.  You can fill up easily for under 10, probably even less.  Great place to pop in for a fun lunch, off the beaten path in Edinburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "yaBIVHDxaUBN2YHQ8-YiuQ"
  },
  "XQjsTHkppjzGSGb2luuR6w": {
    "date": "11/29/2014",
    "text": "I have now been to Ting Thai Caravan twice now. The first time was amazing and the second...not quite so amazing. Firstly, the staff are pretty friendly and the atmosphere has a good busy buzz to it. You just know everyone is enjoying their meals immensely. Thy are generally quite speedy you sit down where there's space, there's not reservations and you're sharing tables with other folk. But that's ok, it's part of the charm. If your really hungry I wouldn't recommend getting there too late as it is often busiest between 6-8 and you'll likely be waiting...but that's ok because Doctors is just on the corner you can grab a pint or two if you don't want to hang about outside. Otherwise arrive before 6, or after 8...8:30 at the weekend.  Now something should be said for my second visit only because I think there could be room for improvement and I would have given them 3 stars for this visit alone but because my first was pretty flawless, it could have been a rare situation.  Knowing it would be busy my friend and I arrived about 6 on a Saturday to find it wasn't at all busy! We were catching a show at 8 so figured we had plenty of time given they are typically very quick. We sat down, ordered a litre of wine (as you do!) which was only 12. Happy days. Ordered our meals, both the same and happily chatted away whilst the place quickly filled up.  Then we noticed that a number of people who sat down after us were being served. Hmm weird. What- it's been 50 minutes since we ordered?! Shocking but not the end of the world. Neither of us are usually bothered and it was mostly that we were starving by this point and had to get to a show. So we asked nicely where our meal was. Although I am surprised that not one server noticed we had been sitting there for so long with no meal when the average mealtime there is about 50 minutes in total. Anyway. Turns out there was a mix-up in the kitchen and it would be out ASAP. Ok no problem thanks very much.  When they did arrive they smelt heavenly and we tucked in. Sadly mine was lukewarm and the steak, for being medium rare, was so incredibly chewy. I was sorely disappointed. I get it sometimes depends on the cut, combined with everything I was less than impressed.  However they went up again in my estimation when, without us having to ask, they comped half our bill for us. So all in all no great loss. They admitted their mistake with the delayed order and made up for it without even being asked. So kudos to the manager and staff for taking charge and avoiding a bad customer experience.  It's a shame about my meal but it will not deter me from going back or even attempting the same dish.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "GoJPBrs_xZmLiYPZrrzOkA"
  },
  "SUOauhNWMt4wIiOXLT_M9A": {
    "date": "9/22/2015",
    "text": "Amazing food. I got the noodles with duck, delicious!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IPHmDLkW7b21zaL1ZKlK7w"
  },
  "MDHbLh093NXSxuh7c1ExYA": {
    "date": "8/13/2014",
    "text": "An amazing quirky restaurant. i haven't tried a lot of thai food but it was all delicious and all at a good price. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "GEgifgwsWxtihJ6u5OYfAw"
  },
  "YqXVov6NizjCzo4e_HkZuQ": {
    "date": "8/24/2014",
    "text": "Best thai food I've ever had. Freshly prepared and a very good price. Quick friendly service. Clean restaurant. They only accept cash but there's a RBS ATM very near by. Lunch menu is cheaper than the dinner menu the only difference for me was portion size which makes sense as you usually eat less at lunch than you would at dinner.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Yt_QxDBaJ04yjoZ0i_oKrA"
  },
  "euJrM4KAVAA8BVun5Z4wDQ": {
    "date": "9/30/2015",
    "text": "I've eaten here three times in the last week. This place is fantastic, and it's CHEAP. (5.80 for Pad Thai.) They could be charging way, way more. I've gotten the Pad Thai each time, but I also tried the Massaman Ped Curry and it's just as rich and delicious. The service isn't great, but that seems like more of an Edinburgh problem at large. The space is cozy and trendy, and I have never had to wait for a seat, though I have seen long lines for the takeout option.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "omWOBhAh70HYchS8uu6ozA"
  },
  "9ZjyzVsLsmD2q3eZqVC_rA": {
    "date": "3/6/2014",
    "text": "Came here the other night for cheap, fast food - wasn't disappointed. A friend and I had a couple of small plates to start things off with some really excellent fish and salad on the go, and then both had Massman Ped for our 'mains'. This was an excellent curry, and pretty cheap for the amount we got. I think the restaurant would benefit from a better beer list (the Singha on offer wasn't the best, some craft beers wouldn't hurt), but overall this was a great wee place with a friendly buzz about it.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "YnyOXmOfCwm85-13DIbSWA"
  },
  "pwM1ETkfOOyXKQqtUvyMtg": {
    "date": "9/28/2015",
    "text": "I used to live inThailand and so feel qualified to say V authentic Thai street food. Great taste, little bit busy and sometimes need to wait a little while to be served but worth it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mGhkok3hRc2B85YLfk8wUw"
  },
  "m10HpoUZIUKgchVzshJv0w": {
    "date": "4/22/2014",
    "text": "Food is good. The som tum is quite authentic, even without sticky rice. However, the service is quite slow and very hipster.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WAun9zeP0pkzWFAexObplA"
  },
  "kRMDj780nJuA_9hihM8CBA": {
    "date": "7/7/2014",
    "text": "Ting Thai Caravan looks and smells equally as good when you first walk through the doors. It's very cool in its design and, no surprise, was super busy around lunchtime!   Luckily we managed to get a table by the window which, despite the overbearing heat for those sitting by the glass and at the mercy of the sun (no fault of Ting Thai Caravan's) was nice and comfy!  The choice of food was impressive - most of which I'd never heard of before, so you're not going to be bored by the traditional pad Thai or Thai green curries here (though they were on the menu hidden amongst more interesting options). I had a duck dish with honey glazed vegetables and it was delicious! Very unusual in its taste but I liked that it wasn't generic Thai food. It could have done with some spice but, to be fair, our server did add spice to the meals of others so I'm sure if I had asked for this, it would have been possible.  The service was incredibly friendly- our waitress was very sweet- but it was a little slow and there was a missed order as well. Bear it mind it was lunchtime and one of the busiest parts of the day, though.   The rest of the food I saw looked lovely, all nicely presented in simple bowls or boxes depending on your meal.  All in all, I really enjoyed this place! Great prices too, for the portion sizes and the amount of meat you were given in your dishes! I'd go back and try a spicer dish any time!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5QFZkdvANhEXTZBg-om-JQ",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom. Duck main- very tasty!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5QFZkdvANhEXTZBg-om-JQ/o.jpg"
      },
      {
        "img_id": "HrfkujcrNr-k2oXUx-JDRQ",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom. Pork balls",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HrfkujcrNr-k2oXUx-JDRQ/o.jpg"
      }
    ],
    "user_id": "wK7unWb9i25ekCP37sWtfQ"
  },
  "ejVv1cX2alMvjIf3INZq3A": {
    "date": "4/1/2015",
    "text": "I had been thinking that I could really go for some Thai food, but its normally so overpriced and just meh... then my friend who lived in Thailand for a bit  recommend this place... so after work the other day and before my train I decided to try it out...  Let me say its only been a few days and I have already been trying to plan when I can go back again!!!  The food was Amazing ! And the prices before 6pm were super cheap!! I was there at 5pm. I noticed the menu said till 1800, but the restaurant is open till 10 I think?... so I'm assuming there is another menu after 6pm.   I had ordered the Khao sway talay- a seafood noodle soup in a coconut broth. That was amazing and not fishy at all! Sweet and savoury, just delicious. It cost just under 6!!! Crazy right! I know amazing!!   I also had a side of Goong frong beer- which were fried Shrimp sticks with mango sweet chilli salsa! YUM!   They don't have dessert on this menu, which was a bit disappointing but luckily my Lychee juice, made a lovely sweet companion to my dinner!   I want to eat here everyday... can I please take a cooking class from this place! We need to do a YELP elite event here! ;)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "K42cfpYEWnG5R40359l07w",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom. Ming pla",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/K42cfpYEWnG5R40359l07w/o.jpg"
      },
      {
        "img_id": "8AlmuZZh28aJE_ADInnJeA",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom. Tom kha gai",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8AlmuZZh28aJE_ADInnJeA/o.jpg"
      },
      {
        "img_id": "BwbyJho0k3P29vIkyMjuww",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom. A feast for two! Delicious",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BwbyJho0k3P29vIkyMjuww/o.jpg"
      }
    ],
    "user_id": "BpKuNkYgAuisCNZlSzfUAQ"
  },
  "1xgZa2p3t4z3ooBzVvffkA": {
    "date": "4/23/2014",
    "text": "Ting Thai recently won the List Magazine best newcomer award and it is very well deserved!  We have been 4 times since the restaurant opened and every time has been fabulous. note they dont have a website but do have a facebook page.  Ting Thai is a street food restaurant that has its roots as a pop-up, which appeared at various addresses, including nearby Forrest Road, during Edinburgh's Festival Fringe in recent years. The soot-colored exterior is dark, the signage is understated. It's very cool and low-key inside, with communal wooden tables, a wall of gig posters and last night had some brilliant 90s tunes on the stereo. The menu divided into categories including Rice & Noodle, Soup Bowl, Other Box, Sides, Beer/Wine Snacks and Small Box.  Everything arrived all at the same time, each in a cardboard take-away box. Nestled on a salad of lettuce, chilli and shallots, the bubble prawns are my favourite. You get 3 in the box and they are really well priced at 3.60. Sweet potato crispies were just perfect as were our chilli squid and crispy pork.   Onto mains and my Steak and prawn was really tender and tasty. A little on the spicy side and just how I like it! I had it with a coconut rice and the boy had the moo yang. Though the pair of pork cutlets were huge with a caramelised coating of sesame, honey and palm sugar. Singha beer topped off our meal and it was very reasonable at 20 per person. Definitely my favourite place at the moment!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "qKNFrvOgu_JtfpbNnzSQVQ",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom. Beef and prawns!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qKNFrvOgu_JtfpbNnzSQVQ/o.jpg"
      }
    ],
    "user_id": "neMi0e3dZaUtX7Sg-3Qytw"
  },
  "udAe-PqMulAni7UivkuzsA": {
    "date": "3/19/2018",
    "text": "Not only that Ting Thai Caravan has good and great value food, the customer service is the BEST!  All the workers are super extra nice and energetic..  This is my go to restaurant for take away, if not twice, atleast once a week.  I do not have a particular dish I like because everything is very delish, each is my favorite!  I do not mind it's a Cash only restaurant, could you imagine if they accepts credit card?  You can't go wrong in trying their food-to try is to believe.  Two thumbs up!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2UAyQVdYCG0DhnvttVw7cQ"
  },
  "W4Ot-Uo4lYO00Xk6CaQThg": {
    "date": "7/11/2014",
    "text": "After a long journey from Birmingham to Edinburgh on Monday, a healthy and fulfilling lunch was in order. After checking into our hotel, our Edinburgh expert suggested that we head to Ting Thai Caravan for lunch. Now, I am a bit of a fan of Thai (but there isn't a huge amount of options for the cuisine in Birmingham), so I was excited at the prospect of having something a bit exotic to fill the belly and get me ready for a week of learning.  This place is relatively new in the Burgh, and as such, can get very busy. We were pretty lucky! Being a group of 6 (which then turned into 8), we were warned there might be a bit of a wait but ended up being seated within about 5 minutes.  The place has a lovely aesthetic. With hard wood and not too much going on decor wise, the main focus is definitely the food. I was pretty hungry, so was warned that if I ordered the soup I might want to opt for a small boxed meal to go with it. This was a great call as I got to try the spicy soup (I cannot remember for the life of me what it was called, but it had quite a few large king prawns in it) and the salad with peanuts and (surprise) more prawns.   The salad was fantastic! Colourful, fresh and tasty. Just the right amount of spice to leave a tingle on the tongue, but not overpower the other flavours. The soup was the star of the show on this visit. Great broth, big prawns and lots of other ingredients (the portion size was just right).   I opted to just have water with my meal, but they did a lovely coconut water with fresh pieces of coconut floating in it too. My two courses came in at around 11, which makes this a great place to grab a quick, healthy and tasty lunch if you're about in Edinburgh. I would definitely recommend this venue.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MVsVu8tranKaH12uLjx5YQ",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MVsVu8tranKaH12uLjx5YQ/o.jpg"
      }
    ],
    "user_id": "jCMdF94UyMHEi6iv8ys-gg"
  },
  "jFFch7Jp249Y549BHYk7vQ": {
    "date": "2/3/2016",
    "text": "I took a group of 8 people here after reading the reviews on Yelp at about 6. We had called ahead to make a reservation and were told they didn't take them. So we figured we'd be okay, because it was still pretty early. As soon as we got there I was in love! It's a cute picnic style layout where you sit at a table and if there's extra seats someone else sits with you.   Being a group of 8 we did have split up to two separate tables as it was already packed inside! We all got different dishes from the Moo Yang to the Pad Thai, panang nua, and tom kha gui. All of it was delicious! It's a really hopping place while we were eating the line was out the door with people waiting for a seat! That's gotta mean something. My group left full and happy. We all wanted to go back the next night (:",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YnCC40soVvM8cDWHKDkvkw"
  },
  "3n0AcfhYGDQHE8PEqRFWBA": {
    "date": "10/17/2015",
    "text": "Always super busy but very tasty authentic Thai food.   They don't take booking so you have to just turn up and hope that they have space but the turn around is quick so you usually can get a seat relatively easily and quickly. The tables have bar stools and you'll probably end up sharing a table with another two or three people depending on where you are sat.  The staff were a bit rubbish last time I went, they brought one drink out before telling us that the other ordered wasn't in stock, brought us someone else's side dish, didn't know the allergens in their dished (and had to be asked to double check). Nothing major but combined it just wasn't that great. Previously they've been much better so I'm putting it down to an off day.   The food however was excellent. I had some type of noodles that weren't pad Thai but were delicious but a tad spicy and my friend had the slow cooked duck which was also excellent. The fried sweet potato was super good but very filling.   They only take cash and the nearest cash point is at the top of the meadows 2 minutes away or at Potterrow so both kind of on the way.   For quick, tasty casual food it's one of the best options in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "uTRWF_Hd-Sbc164ixIP8ng"
  },
  "VvoWHpjjcDpKmuQZXHdWyQ": {
    "date": "11/5/2015",
    "text": "A Busy place but don't know why..  Was a disappointment! Group of three ordered a variety of six 'boxes' each between 3.30 to 4.80.  Pretty expensive for what you actually get!  Beef was chewy and papaya salad good but a bit too spicy!  We were still hungry afterwards so ordered chicken Pad Thai to share but it lacked in flavour,  condiments and spice. When walks for some chilli sauce we got sweet chilli sauce. Definitely careers to westerners as doesn't come close to the taste of authentic Thai food.  Took a long time to get our orders and server didn't return with plates!  There limited drinks on the menu (No alcohol) and no dessert.  Only upside was the cool vibe with the purple lighting wooden tables, and younger crowd.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yUbFCyySl1A04aagctqOxA",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yUbFCyySl1A04aagctqOxA/o.jpg"
      },
      {
        "img_id": "Txod7EnATlveRkUfv460RA",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Txod7EnATlveRkUfv460RA/o.jpg"
      },
      {
        "img_id": "ZlB0hKxg5Zy9E-TSCvGRAg",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZlB0hKxg5Zy9E-TSCvGRAg/o.jpg"
      }
    ],
    "user_id": "PbgqvUdjTRh-HoJUqRvlmg"
  },
  "Zg09nmX3Xq-Hb8OyHG0vUA": {
    "date": "6/3/2017",
    "text": "We had the pad thai goong and red curry with beef for dinner. Both were really quite authentic, especially the herbs, spices and condiments used. The pad thai had the right balance of sweetness and acidity, the prawns were really fresh too. For the red curry, the spiciness level was satisfying and the use of basil, kaffir lime and coconut milk etc was just nice. The downside is that you can't make a reservation, so do go there early as there will be a short queue all the time. I would have to say, this is one of the few good Thai food I ever had in Europe. Highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vjWjkApdMBZLbBf6xp6gcA"
  },
  "j4N0eYxkDLU_MfYEiGUMuQ": {
    "date": "10/18/2015",
    "text": "Oh yeah... They are really good. First time I came was when they first open the menu was short and simple but all the dishes are perfectly made.  After a year or so I went back there and saw so many people, maybe because it's busy, the atmosphere is really good. The food arrived fast and the taste are even better. I order pad Thai 8.30 , a beef salad and a lemongrass drink. I was really satisfied.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "OIOE56uoRo2U4TKZJ4xcjA"
  },
  "zFZeIOQB9Su8jITQ0V3MSg": {
    "date": "10/25/2015",
    "text": "My girlfriend and I went here after hearing many good reviews. It's nicely located close to the University, and the prices at lunchtime are definitely an attractive point. I had some Pad See Ew (spelt wrong?) noodles, and honestly have little definite knowledge of Thai food, so maybe this was my mistake. I didn't enjoy my main course at all, which was a severe pity, as I generally love noodles. Thankfully, my partner enjoyed her vegetarian pad thai a lot more, and we both washed the food down with some tasty Thai beer. The place is more informal than I expected, with food served in little boxes, but this is not a negative point, just a surprise.  Also, don't expect to get a table to yourself. You will be put wherever there is space, creating quite a convivial atmosphere.   All in all, although I was disappointed with my main course, I think it would be unfair not to return here in the future for another try.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RMOJLdLHdFai_ksWCMDOoA"
  },
  "w01E95RWAY-IXIaxiCvGug": {
    "date": "3/23/2015",
    "text": "I went here for dinner after work on Friday night, having heard for ages it was worth a visit, I was excited to finally give it a go. They do not let you book in advance, so you queue outside until they can seat you. It seems the turn over is quite quick as they want people to order, eat and go, which makes sense given it is sort of like popping into a street food vendor. We waited maybe 10-15 minutes to sit down, and were able to look at the menu whilst waiting so we knew what we wanted. You sit on a long table across from your party, and it is very cozy, not much elbow room, so be warned! It is like eating in a cafeteria, or someone's home.   The only issue I had, was it was so unbelievably loud. After a long work week, it was not a relaxing meal, and I could barely hear my boyfriend over the noise level. Maybe it isn't always like this, but it definitely was a bit of a deterrent to go back on a weekend evening. I think lunch might be worth a visit, or taking away in warmer weather to eat in the Meadows! The service also wasn't very attentive, granted they were very busy, but none of the girls seemed happy to be there, and we had to ask to order as well as ask for our check, but fair enough the turn over is quick and with how busy it was, it probably is harder to keep track of people. It was redeemed by how fast the food came.  BUT aside from the noise factor, which isn't their fault, the food was absolutely smashing! I would say it like having street food, as it was served in boxes and super quickly. We waited maybe 5 minutes for our meal which was, Pad Thai, Khao Saway Talay and Goong Frong Beer. All of which, was absolutely fresh, well-flavoured and delicious! The pad thai was so yum, having only had it once in Edinburgh elsewhere, I definitely won't be going anywhere else for it. The Khao was sort of like a red curry, but the seafood was perfectly cooked and the dish was so fragrant and tasty. The Goong, was lightly fried, and oh so good. I would love to go back with a group and do lots of sharing as this place warrants a family style meal.  I will definitely be going back, but most likely for lunch, as in my old age, I can't overlook noise during my dinner.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "dPA1RBX8-pF54IQGvwpyRA"
  },
  "F1ACMebsnjDpN8I4PIp5fg": {
    "date": "12/1/2017",
    "text": "Thai green shirt curry curry or bus it is. Shit now you're not even sure Sweet potato fries",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ErZIGs-woaRgj8vbLTQZRQ"
  },
  "M4On35c8tpupSAOFZKMooQ": {
    "date": "9/4/2016",
    "text": "Wonderful Thai food!  We had the Pad Thai and the Green Curry - both were great!  The place was packed but the waitress was still able to seat us right away - obviously a favorite place here. Very reasonable prices and service was reasonably fast considering how busy they were. Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ss0UJv908dzKyPayao6UGA"
  },
  "1QHMT6b-F34RpyZNwpBWrA": {
    "date": "1/2/2015",
    "text": "Unbelievable Thai food. Like seriously this is proper Thai street food I've had nowhere but ting Thai and in Thailand. Almost Thai prices too ! Managers a bit abrupt maybe just overworked coz she always seems to be there but really I've never had 'bad' service like others have experienced",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "QssDrW4xPnhnpx_nMo2Kow"
  },
  "VZaTICerkkS8xBf-Doodlg": {
    "date": "11/23/2015",
    "text": "Excellent! Went on a Friday around 8 and had to wait for a table but tables freed up quickly given the communal dining style and the fact we were only 2 people.   Found it really hard to select a main and side as everything sounded so good. We eventually went for a crispy chicken with garlic noodles and a Massaman curry with their deep fried sweet potatoes and coconut rice as sides. Each dish was delicious and flavourful. The curry was nicely spicy and had a generous amount of beef.   I would definitely recommend Ting Thai and hope to return soon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bjFuPignA5EH_IMBMsp1IQ"
  },
  "5HleUWqdD38UHpQEoPoL8A": {
    "date": "10/31/2017",
    "text": "The Ting Thai Caravan is a very trendy place. We passed by twice and it was always packed, people even queue up. This place offers flavor rich dishes in a street food style and the menue gives you a wide range to choose from. The service was quick and friendly. We ordered three dishes which all taste good. The best comes at the end: a very reasonable bill...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0jBMjSZJ8MBYgCEyaJpfPw"
  },
  "Jm_A1tt86a4IpyOc0UTLPQ": {
    "date": "8/17/2016",
    "text": "Seriously yummy Thai food, love the rustic interior and how cheap the lunch menu is! Although will probably be eating here for dinner to get he bigger portion size. Tofu is just perfection, and Mum says best she has ever tried!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ttf13jziilUWI7PjWqGYYA"
  },
  "oupMbJ1n58O3Eyvr5tQFYA": {
    "date": "10/6/2014",
    "text": "I just looked at the clock, realized I missed my window for Pad Thai take out and cursed the universe. When you curse the all mighty over noodles, you can safely assume it's worth at least four stars.  I'm a simple lady. After a hard days works (and the even harder task of being perpetually lost in a new city), I want nothing more then to sit on the couch, watch Doctor Who and binge eat noodles. It's the little things. So, after a particularly exhausting day of getting lost and with a quick search for \"take out noodles\", Day Three on my Yelp Only first month in Edinburgh plopped me into none other than this funky little canteen.  First and foremost, kudos on the music choice. I've played the awkward game of \"prop yourself at the end of someone's table while you wait for take out\" for the last three days now and this was by far the best playlist to my socially bumbling, \"i'm hungry\" shuffle. Toe tapping truly.  I grabbed a Khao Moo Daeng to go. Which is 1. not a noodle dish and 2. made with pork loin, which i'm rarely a fan of. But the gent behind the counter who suggested it was cute and in such situations, I have the memory retention of a guppy. It wasn't until I got home that I realized I had wholly failed in my quest for lazy noodles.  Silver lining? Khao Moo is pretty damn tasty. It's got a bit of a kick to it and a little bite of vinegar that makes it oddly refreshing for pork. Definitely not what I was craving, but a solid runner up considering the circumstances (my guppy tendencies have done worse in the past).   But the real surprise? This dish is EXCELLENT the next day. I happily plowed through the rest of it this morning and that vinegar base is wonderful as a cold dish. It would be a damn fine hangover cure - kick, protein and doesn't feel like dodgy left overs.  I'll definitely be back for noodles. I'll make myself a note. And I must try this jerky that's been noted in a few other reviews. But so far, my verdict: cute gents, cool tunes and surprising pork? I'm a fan.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 3
    },
    "photos": [],
    "user_id": "H5TEwR-OD0XxILGNaewohA"
  },
  "Zk6qZM6mBEnV_URaYdQTdQ": {
    "date": "11/13/2017",
    "text": "It's quite unfriendly restaurant. The food is just so so. The food seems like cooked in the big pot and then take it to some small bowls. The service is the most terrible one I experienced. Do not go to this restaurant!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dmLqeC_W4lE0J8fy7k80ew"
  },
  "x13klglJxnQmifFv6Io58Q": {
    "date": "10/6/2017",
    "text": "We came here on a Tuesday night and had to wait in line, so you know it's going to be good. Had the pleasure of meeting two super friendly Italians and killing the time with a cool cultural experience. Had a cider along with the kuy pad (or something along those lines...it's been 2 weeks, I can't remember what I had). Anyway, I recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HBMAxsiTdnq_XCF_r13LCw"
  },
  "0f8fc2u6Q-v53050_t84-Q": {
    "date": "12/22/2017",
    "text": "It's the best restaurant in Edinburgh. I enjoy Thai cuisine very much. I was surprised that there is a worth-it restaurant in UK. My friends and I even had it as dinners for 2 times during our trip in Edinburgh. Although the staff accidentally spilt the sauce on my coat without saying sorry, I'd like to come again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "egDp6IqvMBoFA-Umz4IhgQ",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/egDp6IqvMBoFA-Umz4IhgQ/o.jpg"
      },
      {
        "img_id": "_WDQEk8Ry8xjBboca1qzKw",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_WDQEk8Ry8xjBboca1qzKw/o.jpg"
      },
      {
        "img_id": "6k96Jmr2NMaEB8tpNqIXpg",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6k96Jmr2NMaEB8tpNqIXpg/o.jpg"
      }
    ],
    "user_id": "HhrDeEO9gneggvaeIN28IA"
  },
  "q70CXdfpIegSnBedYpDE4Q": {
    "date": "5/19/2018",
    "text": "Excellent, and a rockin environment. Shared tables. Lots of students. Great. I am tired of writing, blah blah blah.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MjR1VC4zQ6AcMiGoJgWpHw"
  },
  "LovZldvs-jwDbeRstZmcdA": {
    "date": "3/25/2018",
    "text": "Love love this place! I was so lucky to find this place at the right time that I were craving of Thai food! It was absolutely a great place to go - hipster atmosphere, cheap but good food compared to food in Endinburgh and staffs were so nice to us too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xaqPc67b6Y90UawrKIPl-w"
  },
  "e3FY-g2Pi4unP9Lv-ZgBeQ": {
    "date": "2/22/2016",
    "text": "When I found Ting Thai Caravan on yelp, I was like YASSSS CHEAP TOM YAM! I miss having cheap tom yam goong at the tip of my fingers :') so off I went to try out this fairly popular and busy location!  While there, I was greeted by a young lady with a relatively chronic grumpy face. I chose to sit by the window so I can stare at (and scare) people outside. She placed the menu beside me, wiped the table and walked away quickly. I suppose there's no small talk allowed ey  Anyway, I ordered the Tom yam goong with noodle (5 + 1 w noodles) and a side of Thai chicken wings (2.80), thinking that this would clearly be enough for a person!   Guess what? I over-ordered haha the portions were pretty generous! I had to pack the chicken! But anyway, the tom yam was yummy! Obviously catered to the Scottish tastebuds, it was not nearly as creamy or spicy or sour as I'm use to but regardless, still delicious and filling! With the noodles, it hit the spot!  The chicken, which seemed to be marinated in lemongrass, chilli and some soy sauce, was super fragrant and yummy too!! I liked it a lot and enjoyed it again as my leftover for dinner :)  Overall, I liked this place! It's fast, has affordable good food, staff members are quick though could smile a bit more (that's ok. Maybe you just had a bad day young lady with a chronic grumpy face) and the restaurant is very trendy!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "ONTrQwGitb-7n0bIbMvvNQ",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom. Lovely tom yam goong and chicken wings!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ONTrQwGitb-7n0bIbMvvNQ/o.jpg"
      }
    ],
    "user_id": "PzMB3BwmIdaWF_RoiRX5Aw"
  },
  "zPIpQiqTS3_i0unNdVosfw": {
    "date": "11/6/2017",
    "text": "As a big fan of Thai food, I've been to numerous thai restaurants in Thailand and around the world. The food at this place is one of the best! Appetizers, curry, pad thai.... everything on the menu is beyond standard.  Staff is welcoming and energetic. Expect to share a table and sit closely with others as the tables are very packed. Therefore, not the most comfortable place to stay long and have conversation but I don't know where else you can find the same amazing food with that price.  There is always a line outside and the waiting time is usually 5 - 20 mins. The food is worth the wait :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h8YJECceVQqjBGPSyb9zSA"
  },
  "tmkWex5BI9-dYIG3Ya4jXw": {
    "date": "7/25/2017",
    "text": "Walked all the way across town for this...and it was worth it! Great vibe, music and super friendly staff. The menu isn't too large, reasonably priced and everything looked delicious. I ended up going for the Moo Yang (grilled pork) and Som Tam Thai (papaya salad) and wasn't disappointed. Super fresh! Note: cash only, and there's an ATM just down the street.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PgaNeu8vciavO8VEZ0F8hQ",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom. Moo Yang and Som Tam Thai -- flavorful and the papaya salad packs some heat!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PgaNeu8vciavO8VEZ0F8hQ/o.jpg"
      }
    ],
    "user_id": "LP4qsWRd4ew1-08b6mJ6BA"
  },
  "jClsDjI_h8mT8MijNwrdgA": {
    "date": "7/22/2018",
    "text": "Great Thai food. Very casual, communal tables. Water at each table to share. Service with a smile and food suggestion! We found the food seasoned as we like it, veggies were fresh, noodles done right. Lots of activity people know this place. Great for lunch!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xuQ51kpd3TKXwYwHUysRpQ"
  },
  "l3qauFMS46n_UA81V6kFwA": {
    "date": "7/11/2018",
    "text": "Ting, you save my ass.  In Edinburgh for vacation for a few days with my 8 and 4 year old girls.  After an intense play at the nearby playground my girls were hangry.  Noodles, rice and chicken to the rescue!   And mom and I had tasty food too!   Thanks for the cool vibe and friendly service.  I hope someday to come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sCQ6rHyAXwggiAYWVsKsnw"
  },
  "_-5K1Cj-CU6Gu9HvrE2AXg": {
    "date": "2/14/2017",
    "text": "Wonderful Thai food, well thought out and very flavorful. Had the Tom Yum Ka with noodles, it was perfectly flavored, not bland at all. Came here a few times while we were in Edinburgh for a week. Highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5y6iCs9SUNCZFmD9e-TK3Q",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom. Tom Yum Ka with noodles and Roti.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5y6iCs9SUNCZFmD9e-TK3Q/o.jpg"
      }
    ],
    "user_id": "gBMEoKL6F2E0eTuVfmmn5A"
  },
  "wv4uJ_O_s7sYNfUPRatZ1Q": {
    "date": "8/14/2018",
    "text": "Does anyone know the guy with headscarf and brown eyes in this restaurant!!!!? He looks good",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sSZdYFO59oJmjQ4Vd4s2jw"
  },
  "5PSMyQAdTN_vors9cwvdSA": {
    "date": "11/21/2016",
    "text": "The food is always fresh and tasty, and the line to get a table is never that long, so its always worth the wait. Well worth checking out :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "eBVFtdxqTGdogezZ98HUsQ"
  },
  "6Gav3gyylCyyx0Oevs5x0Q": {
    "date": "2/14/2017",
    "text": "This quick Thai place is great for lunch; but note it is cash only !!! It can get really crowded, so I'd recommend going in small groups. There are a variety of noodle / rice dishes as well as curries. I loved the coconut rice! Its super close to the university and has a young hip vibe. Highly recommend to anyone who wants a break from the standard pub food !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ef5lmypxoB3FXX4O47jWUQ",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom. Green curry in the background; moo yang pork in the foreground",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Ef5lmypxoB3FXX4O47jWUQ/o.jpg"
      }
    ],
    "user_id": "i43W5hxMyHO8a9ol_3offg"
  },
  "hJ_O-aqCusKzuEekv9ULeA": {
    "date": "10/15/2017",
    "text": "Delicious, cheap and quick. Tofu was crispy with a sweet sauce. Tom yum was a nice size and could be a meal if you add noodles for one pound. The Chicken pad Thai was filling. I highly recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1cRNIYEP4MxoRd-JZ_2zJA",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1cRNIYEP4MxoRd-JZ_2zJA/o.jpg"
      },
      {
        "img_id": "sqYEmxJWILOjzjfoOuC8sg",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sqYEmxJWILOjzjfoOuC8sg/o.jpg"
      }
    ],
    "user_id": "AJ6oDR8G5eVbOLMvlZpKeQ"
  },
  "HMUY2PaJtIfVZQAaepSkRg": {
    "date": "3/22/2017",
    "text": "The tom yum was a bit overrated.  But the pad thai is good. Definitely will have that again",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A9RNW0biaXSJaNrWtNmpSw"
  },
  "9OrgtSRHsNsfw4IMh5-tdA": {
    "date": "10/22/2017",
    "text": "Amazing food and quick service for a great price! There's sometimes a queue outside but the tables turnover pretty quickly. Only downside is cash only and no splitting the bill but that small inconvenience hasn't stopped me from coming back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8b5H6tG1riOQw2mEVrO--A"
  },
  "Va50yIiC_PDmuxU9dV2KNw": {
    "date": "12/8/2014",
    "text": "My favorite Thai restaurant in all of Edinburgh. I probably come here every week! My favorite is the Penang curry, but the small boxes are also a perfect snack. I don't think I've eaten a single thing here that I didn't like!   My only complaint is that they don't take credit card, and when we tried to get change to pay the bill, the waitress decided that it would be too complicated for her to give us change so we had to explain the process of giving change to her for about 20 minutes until she understood and gave us appropriate change.   Also, would not recommend for dinner since some entrees are much more expensive while the quality and size of the dish remain the same, but it's perfect for lunch!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "mR2sfC5IowJ1CyE5xrwJig"
  },
  "JHRvG0704FFWsnlT-4E2iw": {
    "date": "10/12/2016",
    "text": "We came from California, safely to say, this is by far the best Thai food we ever tasted so far in UK, yes UK! I think food in general here in Edinburgh better than in London. Cheap price, good food and the workers even they were not Thai (mostly students???) they were familiar with Thai food and know what they doing.  Next time we visit Edinburgh and in need of Asian food, we'll go here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mqxE9StGVUR2iyFf7SjwLQ"
  },
  "IuRMcOrVwrNI6U_zCYpAyQ": {
    "date": "5/9/2015",
    "text": "We went in for dinner. When we got there around 8pm, there was a line of people waiting to be seated already, though the line moved fast enough, so all was good.   I had pad thai, and it was one of the best I had ever had in the UK. It was perfectly flavoured with just the right amount of prawns and veggies. The portion was big too. Everything in a paper box of sort, which made it feel like authentic street food.   Ambience was very casual. We were seated at the counter table, and I enjoyed looking out at the people on the streets as I had my food.   Service was quick enough, although at times, things got quite disorganised and hectic.   Great place for a quick Asian food fix whilst you're in Edinburgh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Aj5lcLOtUK1vnib8N6q-fQ"
  },
  "5hy3_Ch6STyLg1punKFOGQ": {
    "date": "3/3/2015",
    "text": "I had already heard so much about Ting Thai Caravan from other Yelpers and random people all around town so I have been excited to check it out! Every time I walk by this place it seems packed to the gills so I figured it must be good. On Saturday night after a disappointing rugby match and then a few drinks at the pub, a friend and I headed over for a late-ish (8pm) dinner and hoped we could get seats. Since we were only two people we got right in, score!   The place was very busy though and service was less than attentive. We were by the window all the way in the corner so I think it was a little easy to forget about us. But once we ordered the food came really quickly. I ordered Mee Gratiam (noodles) with pork and while they were delicious and I ate the whole thing, I found the amount of tamarind used in the dish slightly overpowering. Next time I go I think I may try something else, but I will definitely go back. My friend got a duck curry that looked really delicious. The vibe of the place is very hip and city-like with big long wooden tables (and also a weird screen in front that was projecting an image of a poodle in the matrix or something...I didn't ask). The price was right too, but this we just got a main because we were hungry and tired. Next time I'm going for the full meal!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "M38Dzpe_C3Uk8VrREyTZDg",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom. Mee gratiam with pork",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/M38Dzpe_C3Uk8VrREyTZDg/o.jpg"
      }
    ],
    "user_id": "h7kFt1px7Z5A5e92X6aMvQ"
  },
  "JSUZD1bnRNp5gm6I49yKPQ": {
    "date": "5/7/2019",
    "text": "The food was delicious! I thought the servings were very generous, with tons of veggies and meat. It took about 10 minutes to get my food from the moment I sat down. I tried the lemongrass vodka which was delicious.  The wait staff was lovely and very accommodating, especially nice after a long day of travel. My experience here overall was very positive. I would go back in a heartbeat!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "phxOu2EAUrlEBlWR8H46_w"
  },
  "TZpuzFnlUICRskPUCPEAIg": {
    "date": "8/23/2019",
    "text": "Be warned, do not come here if you have serious allergies. They are not accommodating and will refuse to serve you due to fears of cross contamination. In 2019, that's just unacceptable. You also can't eat outside food so you literally have no other option but to sit there if you're party stays. They told us we could leave if we liked, which we could always do anyway so I'm glad they told us we still had free will. But the service is also seemingly unapologetic about it, recognizing it's an inconvenience but not correcting the situation at all.   Normally I don't let the quality of service dominate my reviews, but this was just egregiously bad. The food though is actually pretty solid and reasonably priced. Some of the dishes were disappointing (such as the chicken wings) and the chicken pad see ew that we had was far inferior to the beef pad see ew so there are some clear inconsistencies across preparations. But I did like the curries we had as well as the tofu. Just sadly will not return for obvious reasons.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "h5wnhoMBkOTzQ_2ZV0dQzw",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom. Beef pad see ew",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/h5wnhoMBkOTzQ_2ZV0dQzw/o.jpg"
      }
    ],
    "user_id": "GWOf1oB2mTalRY_A-EjSiQ"
  },
  "fZGX7BiaUqHPRueBsVkcQA": {
    "date": "6/2/2019",
    "text": "Food was average portion was good. Had pad se ew chicken. The pasta was very lightly flavored.  I may be used to more fish oil and Thai spices this had only light flavour. Not bland but not full Thai taste either. I would guess they have less taste to appeal to those who may not like heavier seasoning.  Service was not polite but given the location next to the university it is a popular place to eat.  It's crowded you will be elbow to elbow with others.  Serve your own water of have a serving container near to you.  Also just be prepared this is cash only.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8YeiX_oRKI3gCWC14sJgTA"
  },
  "mReeLxV63IlgdILJgebQ1Q": {
    "date": "4/13/2019",
    "text": "It's a good place to go near uni of Edinburgh George square campus. The pad Thai veggie I tried was good,  a little bit too sweet for me tbh. And defo sweeter than pad Thai I had in Bangkok. The chili flakes on the side were serious .   It bothers that it came with take out box even though I chose to eat in. The takeout paper box may be relatively eco-friendly, but to me they're just being lazy. Of cuz, it seems I am expecting too much from a street light eatery.  And The staff were not the most helpful and friendly",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fRmfjo1MzYzRyGdp-5jUTQ",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom. Pad Thai veggie",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fRmfjo1MzYzRyGdp-5jUTQ/o.jpg"
      }
    ],
    "user_id": "BwOtI76h33XEdUcQhrMM0A"
  },
  "8G7Fm-NhvYbY1nd7Hq7m0w": {
    "date": "9/19/2019",
    "text": "Best Thai food in Edinburgh! Must go and try their menu! If you order curry make sure to get some rice, white or fried rice for sure! Also make sure you are super hungry before going. I didn't have time to take a photo because I was so hungry I just hate it all. If you haven't tried this place or have never had Thai food you should go right now and never look back. Just order a bunch of stuff or bring your family and order one of everything. Just do it. It is cash only but there is an ATM right around the corner. Easy to find and easy to do. Just make sure to order a lot of food. Lol I'm serious you'll love it. If there was only one place I could eat the rest of my life it would be this place if I was in Edinburgh lol   I wish I took more photos but wow I ate it so fast. I'm going to have to make sure to take some content for yelp next time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9EB_WZ5Lw991mrnfkzkqvQ"
  },
  "6uyehECjaqYaeEqvxn7dRQ": {
    "date": "6/26/2019",
    "text": "Communal tables, communal water jugs, and all meals in take out boxes. I don't mind sharing a table with others (meet new people!), but I don't like the aspect of disposable materials being used for dining in. There are not many vegetarian options on the menu, and it wasn't cooked well. I had the pad kee mao, which was very dry and lacking in flavor. The tofu was also burnt, which gave the whole dish a smoky flavor. Portion sizes were good, but service and flavor lacked.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U_DL5GbEdUfvrcswuXY9ng"
  },
  "rejSOK9C25jFyCeJyWwA5Q": {
    "date": "7/5/2019",
    "text": "It has really good taste but it is not clean enough since I ate someone's hair out of the dish!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sVN-A7j2iAH_niIhg9o6mw",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom. It has really good taste，but it is not clean，cause I ate someone&amp;#39;s hair out of the dish. Hhhh",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sVN-A7j2iAH_niIhg9o6mw/o.jpg"
      }
    ],
    "user_id": "nVusR42wmkDz99pv5PGrQw"
  },
  "SrjRAqfI3RNY2pSuhB6PBw": {
    "date": "5/17/2019",
    "text": "The pad thai was greasy and tasteless. After two bites, I tossed it. It is inexpensive and the portion was massive, but bleh.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yDk4QoB4Dw-fzL7sX8GhKQ"
  },
  "PU9ecZrao4ybMAFqPq1-4Q": {
    "date": "4/11/2019",
    "text": "Totally IRRESPONSIBLE! It is unacceptable that a restaurant that serves hundreds of customers each day uses single use disposable containers to serve their sit-in customers! After talking to a very polite waitress I was informed that customers have complained before about the single use boxes that are used for the food but nothing changed. It seems that the owners of this place don't give a **** about the environment and all they care about is their income and convenience. Never going back unless something changes!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kZzBDhCUO07RCZBL1MZXdA"
  },
  "4SmTVZxu6h2DD-snThJQBg": {
    "date": "8/20/2018",
    "text": "The hours listed here are incorrect but because of this, I feel we got lucky. It actually opened at 11:30am and we got a table rather quickly. While we were waiting on our food, a queue formed. We walked by the following day and there was a queue outside in the rain for the entirety of our lunch at another establishment. So go early because it's worth it. We ordered Peak Gai Kao Prik (chicken wings), Gai Cha Plu (chicken small box and my fav), Gaeng Kiew Wan Gai (chicken green curry and my main), and Gaeng Pha Talay  (jungle curry and my boyfriend's main). All were delicious. The mussels in my bf curry were as big as my palm! The service was speedy and friendly and we had a great meal at a good value for the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VbUHCOtm94rmoPIoXA0yMg"
  },
  "JfqVShys7og2WbpiE4xyHg": {
    "date": "4/27/2017",
    "text": "I have mixed feelings about this place. I don't know why it's considered one of the best restaurants in Edinburgh. There is at least one restaurant that I love that I think should be awarded that distinction far more.   In any case, I wanted to see what the hype was about. My Airbnb host stated it was one of the best restaurants in Edinburgh and I respectfully disagree.  I don't get the cattle herding. Why can't we sit somewhere that has an empty spot? I don't get why two people can eat at the bench by the window facing outside yet others can't? Are they VIPs? We were squished between two groups while there were spots elsewhere available, like a corner for example.  - the deep fried tofu portion is small but that's ok. It was delicious though the tofu shouldn't be cut up that small to be deep fried. I'm used to larger cuts so there's still a little softness in the middle.   - the pork skins were just chicarons so delicious whether it's Thai or Mexican.  - the pad see ew sits at one of the lowest ratings I can imagine. I'm sure I've had better in a food court. It definitely wouldn't fly at most Thai restaurants I frequent.   - the tom yum with shrimps was delicious. There was a generous amount of shrimp and oyster mushrooms. Definitely not one of the best tom yums I've had but it worked here because it was with noodles. So if it was more spicy or sour/tart like my regular favorite tom yums, it would have been too difficult to eat with the noodles maybe.   My biggest issue with this place is the takeaway boxes. Is it trying to be hipster or different by serving food in it? If so, I didn't appreciate it. Why? I hate waste. I absolutely hate thinking of how many boxes go in the trash or compost. Yes it's renewable but it's unnecessary. It is nice if you have leftovers so you can pay and just walk out without waiting for the server to pack up your food or to ask for a box. But for dining in, it's completely unenviromental and wasteful to serve food in takeaway boxes.  Fact: If you feel like they're insulting you for assuming you don't know how to use chopsticks so that's why you didn't get any, you'd be incorrect. Chopsticks aren't traditional Thai utensils. You won't see them in authentic restaurants. The fact they had them here threw me off and it definitely was an immediate giveaway that it wasn't authentic.  Clearly this place is popular for the locals. There was a queue outside of hungry people braving the cold waiting to be ushered in. Would I come back if I lived in town? Maybe for the tom yum and to try other dishes. Would I come back if the restaurant was situated in Northampton, Seattle or Vancouver? Definitely not.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5LrgakGAr0pyvsw3ZJjHRg",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom. Chicarons aka deep fried pork skin",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5LrgakGAr0pyvsw3ZJjHRg/o.jpg"
      },
      {
        "img_id": "H-1jc1eFEp6yYSCdM3FPWw",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom. Tom yum goong (shrimp)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/H-1jc1eFEp6yYSCdM3FPWw/o.jpg"
      },
      {
        "img_id": "6tWZ_DbFt6OuSZ5FU5-Kvg",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom. Deep fried tofu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6tWZ_DbFt6OuSZ5FU5-Kvg/o.jpg"
      }
    ],
    "user_id": "MhchR3F82Q0w9JGseDmYLw"
  },
  "knYacwb7DYvwMMag6SrBJQ": {
    "date": "11/22/2016",
    "text": "Really popular spot, especially for university students! This restaurant is always a full house.   The prices can't be beat. Delicious Thai food for a decent price. Even when there were 5 people total, our bill did not surpass 30.   I got the tom kha gai (coconut milk soup with chicken and added noodles to it for an extra pound. So filling and satisfying (especially after a night out). The portion size was quite satisfactory and the flavors were sublime.   There seems to be always a little bit of a wait but I'd say it is worth it! Definitely recommend this gem of a restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "oFtwzFnV1Q1FuXwlu8WJvQ",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oFtwzFnV1Q1FuXwlu8WJvQ/o.jpg"
      }
    ],
    "user_id": "U20HG9oOWWYLqmg9JgsmVw"
  },
  "IDzaknein-XvwfxS3hBJLA": {
    "date": "7/18/2016",
    "text": "I am so glad we were able to eat at Ting Thai Caravan because it's absolutely amazing. i read about this restaurant on Thrilist while on the hunt for good and affordable food in Edinburgh. It's located near the University and away from the more touristy spots. It's a small place with long communal tables so be prepared to share space. It was very busy when we went but we were able to get seats within 5 minutes of walking into the restaurant.   There are different options of what you can order including boxes and bowls. We decided to get some food to share: roti with curry dip, yellow curry with chicken, a spicy chicken, coconut rice, and extra rice of course. The food was delicious. The curries were flavorful and the right amount of spice (not as spicy as I'm used to but still very good). The coconut rice was awesome, not too sweet but you could definitely taste the coconut flavor. The roti was good too. The portions are decent sized and the food is very affordable so I'd recommend ordering a  few dishes to share.   Service was good, even though they were busy and they stayed busy the entire time we were there. Our food came out quickly and everything was correct. Definitely recommend!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "QX4RpEI2bg3oJt09nRoq5w",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QX4RpEI2bg3oJt09nRoq5w/o.jpg"
      }
    ],
    "user_id": "Eus5ji048KwmXXDSKKmxKg"
  },
  "_yaxDh2ScWzR5XCMlk-dFA": {
    "date": "10/19/2017",
    "text": "This was the first Thai food restaurant we enjoyed on our trip back in September and it was very good.  We met nice people, enjoyed good conversation and delicious food.  A great experience.  The food was brought to the table rather quickly, despite the sizable crowd. The food was hot (temperature wise) and just the right level of spices. This is a very trendy establishment and very upbeat.  Fun for all!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "m6n0unJoo9ZbXsVfgeWTcw",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom. Supporting local brewery-Scottish IPA",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/m6n0unJoo9ZbXsVfgeWTcw/o.jpg"
      },
      {
        "img_id": "fW9CAbb_gBJZPu5nNapZqg",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom. Busy but quick service and hot, delicious food.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fW9CAbb_gBJZPu5nNapZqg/o.jpg"
      },
      {
        "img_id": "6xeYRGBYxWRDlLwEudeyQg",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom. Gaeng Kiew Wan Gai = Awesome!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6xeYRGBYxWRDlLwEudeyQg/o.jpg"
      }
    ],
    "user_id": "Z4AVPqcUXAJd8E8nHCrKMA"
  },
  "WgEpfysQvZIIIZE62IvUOA": {
    "date": "10/14/2017",
    "text": "This restaurant was wonderful! We were looking for a cheap dinner for our first night in Edinburgh and I'm so glad we chose to eat here. It has a really run vibe and the two of us sat at a long table in between other customers who were there in pairs. We shared the Pad Thai noodles with tofu and the Panang Nua curry. The noodles were super flavorful and cooked perfectly, and the curry had just the right amount of spiciness. I also ordered the lychee flavored thai juice and it was very refreshing and not overly sweet. It didn't take long at all to get our food despite the restaurant being filled to capacity on a Friday night. Great easy dinner, with the bill coming to about 25 total.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CVT9DwmCosXSzmCsLIZa0A",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom. Panang curry, Pad Thai, and Lychee juice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CVT9DwmCosXSzmCsLIZa0A/o.jpg"
      }
    ],
    "user_id": "wHIZLPnJyG6QtZNT_Giy1w"
  },
  "jHlXgDuIHFgfXSiWwPS3ZQ": {
    "date": "11/13/2018",
    "text": "I've been going here for many years when I'm over on business and love the food.  It's some of the best Asian food Edinburgh has to offer.  That's not enough to earn five stars though.  It is almost 2019, why is it appropriate for a restaurant to refuse to take my credit card?  Being cash only is just stubborn.  Smaller, local restaurants can accept payments by card - so why can't you?  It's not saving any time, contactless payments take three seconds to authorize.  And paying by cash is costing your foreign customers (like myself), money in ATM fees, and time trying to find one.  It's all round just inconvenient.  Like I said, I love the food - but it's not enough.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MmX-6xKhblWWzqvxo0nxXQ"
  },
  "zn5qN7MUhuQgz8JHX_nUew": {
    "date": "9/25/2018",
    "text": "If you like Thai Soup and curry it ok. I had the pad Thai with chicken.  It was extremely salty sauce covered the noodles and chicken.  I tasted the Tom khan yum it was semi medium dish.  This place was very busy with college students because of the price and not because of the taste.  They do not accept credit cards only cash.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2uEE9IPhjowBnIWChcv2Yw"
  },
  "D0BePaYTiNwRV9n94i-lZw": {
    "date": "11/26/2016",
    "text": "On a spontaneous lunch date out, my friend and I came here based on recommendation. Every time I would pass by this establishment, it would be completely packed--usually, with a line out the door. Upon arrival, we were immediately greeted. The staff made sure they knew we had arrived and quickly accommodated us.  When I sat down, I was instantly thrown by the familiar smells of Asian cuisine. I was really excited, as I had been on a hunt for authentic Asian food in Edinburgh. My friend and I both ordered Kao Mun Kai Tod, which is fried chicken with rice mixed in a sauce of complementary chilies, ginger, garlic, and I believe I tasted fish sauce. The chicken was a little dry, but the flavours and aroma of the rice was absolutely amazing. Barring the fact that parts of the rice were inconsistently salty because of the sauce distribution, it was actually quite tasty. I would recommend they put the sauce on the side, as most Asian restaurants would normally serve; that way, the customer has more control over the flavour.  Everything on the menu was completely affordable with the most expensive dish being around 8. Additionally, they also have a cooler with imported Tsingha in cause you're really in for the Thai experience. I'm so relieved I finally found a place that was closer to authentic Thai cuisine. I'd definitely come here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8M-tYCXo_16ll9XmA1BvXg",
        "caption": "Photo of Ting Thai Caravan - Edinburgh, Midlothian, United Kingdom. Kao Mun Kai Tod",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8M-tYCXo_16ll9XmA1BvXg/o.jpg"
      }
    ],
    "user_id": "cDyMUPMeuwAvUr66TkPbhw"
  },
  "zwUE383qT_4VzPsWRVeRzg": {
    "date": "1/12/2018",
    "text": "Came out with a friend on a Thursday night. Food was yummy, fast, and well-priced for the area. Gotta try the coconut rice!  We enjoyed the community table setup. People come to socialize as well as enjoy tasty Thai food. Four stars for how busy the small location can get--unless you're lucky enough to time it right.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R9O3vnu_qW1NUHb8fHvyLA"
  },
  "XCV5WeMf3DLfpBOaI_yR5Q": {
    "date": "6/3/2018",
    "text": "The food is good and the ambiance is cool. However, the seating is awkward and uncomfortable (many chairs are stools that don't have back support) and you may end up having to sit adjacent to your friends instead of across from them. You might have to wait outside in the cold for a table to open up.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0UxHupnflIWWE9ZWHvErEw"
  }
}