{
  "GRnoUjiBpVhY-97MFRPdAA": {
    "date": "2/25/2016",
    "text": "Sometimes the need for a good bagel coincides with a wait for a train (or no time to cook dinner) so I get to have a Bagel Factory bagel for tea. I'm not sure why exactly but it always feels like a bit of a tasty treat.  As other reviewers note, it's quite hard to get decent bagels in Edinburgh. The range here is good and coffee isn't bad at all. I tried the new halloumi one. Some old favourites are missing from the menu but you just need to ask for those fillings and voila..! It's my fave place for takeaway food in Waverley.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "t0lb4ZHHAAt1K10bjXIATg"
  },
  "-GDcb59QYf5hXytrupi8IA": {
    "date": "12/9/2014",
    "text": "I always go to the Bagel Factory when I'm in Waverley.  It's a great place to grab a (relatively) cheap (relatively) warm lunch that will fill your belly while you're on the train.    I was surprised at the breadth of some of the pricing, though.  I always get an everything bagel with cream cheese, lettuce and cucumber  - this is crazy cheap, possibly less than 2, maybe?  While The Man loves the pastrami bagel, which is priced closer to 5 or 6, I think.   All the more points for my choice, though they appear to be cutting costs a bit these days as my cream cheese was painfully thin. I mean come on, if the other ingredients are lettuce and cucumber, at least give a girl some creamy cheesy goodness.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "4UQfst9jve4GCSfWpWn2uA"
  },
  "ADn0X6yJd_GM_f2GnvIpyg": {
    "date": "6/17/2015",
    "text": "I'm honestly really amazed that you can find such tasty breakfast sandwiches at such a reasonable price at the train station. I had the sausage, egg, and cheese on a plain bagel, which came out nicely toasted with melted cheese. It's not the best breakfast sandwich you'll ever have, but for being in a train station, it's pretty much a miracle.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "HylGr2mRKE9CCC9KvdvCoQ"
  },
  "BWuvP65SbkKsH7pyG-LcZg": {
    "date": "1/1/2014",
    "text": "If you are up early enough in the morning the bagel factory is one of the few places that are open this early.  Situated near the middle part of the station an easy location that's not far out the way to pick up something to eat and buy a coffee to go.  When l came by one early morning there was a steady stream of people with orders, with the server not taking long in getting through them.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 9,
      "cool": 5
    },
    "photos": [],
    "user_id": "U6ZW22QFOIgkuV53emzIbQ"
  },
  "ZfHC6734-Vb62NnQgcAPhQ": {
    "date": "2/10/2015",
    "text": "I ordered a bagel with cream cheese before going on the train, once I got on the train I opened the bagel and there was BARELY ANY cream cheese on it. Literally about less than a teaspoon of cream cheese for my whole bagel. It was such a waste of money.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5Q5lsnq_lVZJs6Mlck238g",
        "caption": "Photo of Bagel Factory - Edinburgh, United Kingdom. Asked for a bagel with cream cheese and got THIS! There is barely any cream cheese on it! So disappointing",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5Q5lsnq_lVZJs6Mlck238g/o.jpg"
      }
    ],
    "user_id": "x-9AN426Qpj8TXE6KA_yNw"
  },
  "PTFHBDiUztFDmqHUcvWvKw": {
    "date": "9/16/2015",
    "text": "Mmmmmmmmmm.. My treat on the way home after meetings is often a personalised bagel. There are lots of options to choose from, and many different bagel types (not just plain white or cinnamon). The coffee is pretty good, and they have San Pelligrino too. My only niggles are that I wish they were open longer, and also had more vegan options.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fvnkUEa7q5ULUoFA7gK0mA"
  },
  "ICYyGnuv0aA25z3ti94-YA": {
    "date": "10/11/2013",
    "text": "One of the quickest and most convenient breakfast stops in the train station, but sadly the bagels (and their contents) are average at best.  There's not much flavor to be had with a simple egg and cheese bagel, and the liquid eggs they ladle out from a bucket are a far cry from a freshly cracked egg.  The service is fast and friendly though, so you could do a lot worse.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ctrp5IoEKHkixDSIyYHDpw"
  },
  "u9r7Jv2SyQLIiq0vu86TSw": {
    "date": "9/28/2013",
    "text": "This is a great bagel place conveniently located inside the Edinburgh Waverly train station.  The staff are friendly and quick and nicely package your coffee and bagel selection for a quick carry onto your next train.  Options for different bagels spanned from sausage , egg and cheese to Salmon to just spreads.  They had quite a few combinations.  Next time I am back to this train station, this will be my go to breakfast place!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "prxCLqCYwUsl0JwO_V0CGg"
  },
  "7HMw-cuQ0-a6yAcj9h2QNQ": {
    "date": "5/8/2013",
    "text": "not ooh Bagel Bagel  Well its more standard bagel issue, it's no salt n peppa hit, thats for sure...I used to work round the corner from here, and the pastrami bagel was 10/10 - alas they have reduced their range, and ergo the pastrami bagel is no more.  I'm over that now, as the Soho Club is pretty damn good - a good range of bagel options such as onion, wholewheat, plain blah blah  fast service and relatively well priced - this is the best place for food on the run before you jump on the train... coffee is a little average also - so hit up the starbucks on thehigh street before hand",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lOZKlSyQa-jSv4HZ66okGg"
  },
  "LUhFrECetUbqkzF1TGJUIg": {
    "date": "4/27/2012",
    "text": "Whenever I have to take an early train from Waverley, I treat myself to breakfast at the Bagel Factory. It pretty much does what it says on the tin. A selection of bagels and your choice of fillings, as well as a number of set options you can choose if you can't decide what to have. You can make it as healthy or unhealthy as you like. You can imagine that on those unfortunate occasions when I'm taking a 7.30am train, I'm not bothering with the healthy option.   The staff are always friendly and helpful. The coffee is good for a wee place like this (on a par with the other chain options in the vicinity) and if they're putting it in one of their little takeaway bags alongside a bagel they will often put a small coffee in a large container so it can slosh around without spilling. Little touches like this make the difference and keep me coming back. It's almost enough to make me glad to get up early. Almost.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "ixBoXpBL1JmKmcP1F2fTHA"
  },
  "lu7jtTzyqGddYcJYRRTdNg": {
    "date": "4/14/2010",
    "text": "This place is my savior at 8.30 am when I am catching the train to uni and I haven't had breakfast. I love bagels and secretly like to think I am a New Yorker about to hop on the Subway with my fresh bagel from H&H Bagels.  Well as anyone who has ever tasted a REAL New York bagel knows, there ain't any other bagel that comes close. These bagels are better than the stodge you get in the supermarkets and they are probably as close to the real thing that you can get while still being in Edinburgh.   There is a choice of just about any filling you could possibly want to go in a whole range of flavours of bagel. My favourite is Cinnamon and Raisin, washed down with a coffee. Prices aren't too bad, but as you add more and more fillings it does get quite expensive.   Great if you are in Waverley Station and need to pick something up to eat on the train.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xtspqK5CjjtByNN_-du2fg",
        "caption": "Photo of Bagel Factory - Edinburgh, United Kingdom. Courtesy of Bagel Factory website",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xtspqK5CjjtByNN_-du2fg/o.jpg"
      }
    ],
    "user_id": "oKdygoDX5CfDJeXzv_EVaw"
  },
  "V4E4VGLrduYhYkxGnch6Aw": {
    "date": "10/26/2013",
    "text": "I have been in Sweden for several months where I can't find any bagel at most of the supermarkets. Luckily, I travelled to Edinburgh found this shop at the station and order a BBQ chicken bagel. It was not bad!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BJznQcG7JKUeBPlGW0ZajA"
  },
  "dR9E_gONUV0aeZtE8xMUtw": {
    "date": "6/9/2010",
    "text": "This place is a case of letting your standards slip just a little bit for the ease of getting something to eat when you need it.  I'm a big bagel fan, and while I would rather go to a proper cafe or bagel place like Elephants and Bagels, when I'm rushing for a train and need something to eat quickly - this is the place I come. There is a large range of both sweet and savoury bagels, but If I'm honest, they arent the best I have ever eaten. They taste just a little bit 'standard', they dont really make me think wow.   Still, as I said, its a case of ease and speed. And, ok, they do taste quite good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qcoxJKCXmv-pOHK6GLqkFw",
        "caption": "Photo of Bagel Factory - Edinburgh, United Kingdom. From Business website.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qcoxJKCXmv-pOHK6GLqkFw/o.jpg"
      },
      {
        "img_id": "LmSni6Gf6Vv_FluqeZ_hpA",
        "caption": "Photo of Bagel Factory - Edinburgh, United Kingdom. From Business website.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LmSni6Gf6Vv_FluqeZ_hpA/o.jpg"
      }
    ],
    "user_id": "SxV1Jq7UANuSYpn42JXvOA"
  },
  "ZT_MQ3rJefZZxvzqCwrWxQ": {
    "date": "6/19/2012",
    "text": "Yummy bagels when travelling. Also there are few places in town where you can actually get bagels, so this is pretty good. Their bagels are always well-filled and they also do coffee.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VMGBoRpjgwB0uEWdG-nZ9Q"
  },
  "1UExpLKwqWip2oj7WD5fjQ": {
    "date": "5/9/2010",
    "text": "As Amy has mentioned, the bagels here are as close as you will get to real New York bagels in Edinburgh. They're still not a patch on the real deal though but they're pretty tasty and much more firm and chewy instead of soft and fluffy like the ones you get in most other places.  This place also has a perfect location in Waverly Station making it perfect if you need a snack before or after a train journey. I'll usually get a tasty onion bagel before hopping on the train. Yum!  Still quite standard in comparison to NY bagels but they will have to suffice until I can get my next trip over the pond!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CqkdpG2tkCPQA69umlAHsA"
  },
  "m-AiT5lxrhtL2jvGuUIXlw": {
    "date": "5/8/2010",
    "text": "Great as bagels are, it's quite rare to find a properly delicious one on UK shores. Having not yet found a dedicated bagel shop in Edinburgh, this small but competent outlet at Waverley Station will just have to do.  I tend to stick to the savoury side of things when it comes to chowing down on a bagel, and usually opt for a regular or onion option with some sort of salmon concotion inside.   Whilst not perhaps as good as a \"proper\" bagel, the scran on offer here is still fairy delicious, though can be a bit wallet busting for what it is. Sometimes it's hard to justify the best part of a fiver for what is effectively a fancy roll, when Boots and their 2.99 meal deal is just a hop skip and jump away.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xXQTdJXPGOP-NUYctcQw8g"
  },
  "eQYI0nYLJbrNRIBZpfgD8g": {
    "date": "11/23/2008",
    "text": "The only fault I have to find with this little bagel place is that food from here tends to be expensive - I could probably make just as good food at home for cheaper.   But I don't, so every now and then I buy a bagel for breakfast, usually with some outrageously expensive orange juice, and for a few minutes I feel quite healthy and virtuous, until I remember that bagels aren't low in fat and cream cheese is definitely not good for me.   On the other hand, this may very well have been the food that the expression 'om nom nom' was invented for. Because one does 'nom' the bagels with decided relish, and that, in the end, makes them worth it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1_ZgkUK0kGgV-gcFViS5Rg"
  },
  "iLr4DPQftN_7REvTBMcBEg": {
    "date": "11/27/2010",
    "text": "Good quick service. It's saved me missing breakfast while running for a train several times!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DprJbp9xeq1fSkSQI5S5LA"
  }
}