{
  "UQ5Z7UUbLKm4dJ82lIHsFA": {
    "date": "5/13/2016",
    "text": "Fish and Hits  Don't know why this place has so many dodgy reviews, it is dynamite - and this is coming from a guy who doesn't really like fish and chips. Seriously, service is top notch and everything is cooked to order, I can't account for how genuinely fresh the fish is, but the batter is amazing. It has a lovely sweetness to it that makes you want to be wrapped in it and smothered in vinegar. The chips are probably the best bit, also freshly prepared and soft and fluffy in the middle, like fried bits of cloud! the scampi is delightful also, I'm going to try the Chicken some time soon....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "lOZKlSyQa-jSv4HZ66okGg"
  },
  "Vqh4z0Pnyc-hlplTIuPT0Q": {
    "date": "11/23/2018",
    "text": "It's  just our local chippy, but it's pretty reliable. The fish is usually huge and the chips are not too greasy. Can be a bit slow if they get a rush but it's worth the wait.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4p3KGTvPgJccqMaF1Q-dcw"
  },
  "kzGPNvcOsyrM4oytwJpRbw": {
    "date": "10/5/2016",
    "text": "Best chip shop in Edinburgh . Fresh fish fresh chips and amazing chip shop sauce !  Very fast and generous with their portions . After going to the globetrotter you will find that other shops just don't seem to have the same quality of potato !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "FlvusipNZAH6mtvuLLPAIA"
  },
  "Rg7E7Bs12gi5Hdox6OerrQ": {
    "date": "12/22/2014",
    "text": "When they said they didn't have any fried pizzas I had a mini breakdown. Maybe it was meant to be for my arteries sake. Once I'd finally brought my head back up from the counter I decided to have a white pudding supper instead. The white pudding was delcious. I also had a red cola because I'm a gangster.",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "Hzt2Rv6SHaZZEb-4peqEPg"
  },
  "G80NmlI2fXO7hZ61kyGSwQ": {
    "date": "7/17/2010",
    "text": "I don't know why I went back, but I did.  I should have re-read my previous review to remind me how absolutely horrible the food here is. It's dripping in fat it's chewy (are chips meant to be chewy?) and the staff eye you up suspiciously. I felt like a criminal.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o0WGr8L3BWfH2Bslpnqw6g"
  },
  "LVpv2_MRFOdZl4W0OnhUUQ": {
    "date": "7/10/2010",
    "text": "As a fan of Fish & Chips I always like trying out new places, seeing if any can match the quality of my favourite chip shop in Anstruther. In Edinburgh, this has proved to be a challenging task, with many chip shops providing soggy, horrible fish or chips which have not been fried for long enough!  However, Globetrotter was, to my surprise, quite a good chip shop. The fish has consistently been good, not great, but good. And on must occasions the chips have been crisp! However, I am not always to enthusiastic to pay near enough six pounds for a fish supper which is just well, good! That is why I would advise you to try the smoked sausage supper! Less than four pounds, this chip shop knows how to fry a perfect smoked sausage alongside some crispy chips!  Globetrotters also do burgers, pizzas and all the normal suppers you expect in a chip shop. If you fancy a chippy one day, then you will be hard pushed to find a better one in Bruntsfield!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0-wo7wKN_Rp0Xs6cBMEDJQ"
  },
  "PBmHi78t6dqr4kkS0d1ZmA": {
    "date": "6/9/2010",
    "text": "Situated on the busy Bruntsfield Place, Globetrotter seems to do a roaring trade around 6pm.  As indicated by its bright neon lights its speciality is fish and chip, yet, as with many other chippies, it also serves sausage, haggis and stek pie suppers amongst other favourites.   The service was friendly but a bit impersonal, although this can probably attributed to how busy the shop is around dinner time.  Everything on the menu is quite expensive with fish and chips costing about 5.90 and other classic suppers costing about 4.50.  At these prices most people would probably expect a near impeccable fish supper.  Whilst it wasn't particularly bad, there was certainly room for improvement.  The chips were pretty decent but the batter on the fish tasted a bit greasy and was wierdly thick.  The actual fish itself, however, was cooked nicely inside and the portion size was generous.   Globetrotter serves quite good food, yet you may come away expecting a little better for the money you pay.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GKf--ukxmPhFRQGAIWbDdw",
        "caption": "Photo of Globetrotter Fish &amp; Chips - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GKf--ukxmPhFRQGAIWbDdw/o.jpg"
      }
    ],
    "user_id": "yfXqZkU5iXE07GSHzdsQBA"
  },
  "IfohxxrTWXnK-1zP-O-9Jw": {
    "date": "11/7/2007",
    "text": "Globetrotter is a decent takeaway chip shop in Brunsfield. Their product range is similar to many other chip shops but their opening hours are very good for the late night clubber or a hard working employee coming home late in the week. The staff are always nice and courteous and help you to pick what you really want if you cant make a decision !!   Most of the food that they serve is of good quality but I would recommend eating one of their pizzas as these are quite wonderful !!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qFOy-T6HU4WxS5t_34IBaQ"
  },
  "8Sg7voEJtYpVPPiSP7LoQw": {
    "date": "7/15/2008",
    "text": "Has a great reputation in Bruntsfield as a decent chippy but goodness knows why. I really disliked my fish and chips and it also took an unreasonably long time to get served.   Its surrounded by other chip shops, like tica tica, which are far superior.   The Greek owner is really nice though, just a shame about the quality of food!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T9QAj2joHCAbdKeUyzAZJw"
  },
  "LNHT5VjtRACdzhWcuiCqJQ": {
    "date": "4/21/2010",
    "text": "My love affair with the British classic: Fish and Chips can be a fickle relationship. Sometimes the chips are soggy, often the batter is too.  The fish can have a rubbery texture, and you can often find and empty chasm where the fish is supposed to be once you've broken the outer-layer of batter. The Globetrotter consistently addresses these problems and consistently provides some pukka fish and chips (contrary to the previous review, they seemed to have cleaned their act up!).  Particularly popular around 5pm, you will always spot a bunch of waiting customers underneath it's gleaming neon sign. Expect to pay around 6 for a generous portion piled into a card box. It's not the cheapest, but your paying for the quality.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CTZEnTsW2JYN2NH1BCAaZw",
        "caption": "Photo of Globetrotter Fish &amp; Chips - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CTZEnTsW2JYN2NH1BCAaZw/o.jpg"
      }
    ],
    "user_id": "UvIb5v3biEgcxWKnxf0ocg"
  },
  "YlsloVqgRh9INCrEBpmt6A": {
    "date": "1/18/2009",
    "text": "This fish and chip shop is located in bruntsfield.It has great chippys and battered food to take away.You can also sit in as it has a few seats at the window.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yI4LI8-aYYUS9MmrfpidMQ"
  },
  "RuUGQrMSkKj0H-nzaT-F_w": {
    "date": "11/14/2008",
    "text": "Delicious fish and chippes to take away. Perfect for a easy dinner. The food is nicely cooked and not to greasy. They also have a nice selection of saussages, haggis etc. Friendly staff, quick servce, expect to pay about 5 for a fish supper",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n_rSCsfU2M3tGcEfFp1q6w"
  }
}