{
  "bCcQWyakF06wAcbqUXuxlw": {
    "date": "7/9/2018",
    "text": "Burger was cooked perfectly and large. Came with ham and an additional fried egg. Fries were tasty and warm. Beer list was about 30 strong with 10 droughts on top. IPA and American varieties available, though not many above 5%. Total after about 4 beers and 2 meals was under 50 which seems good to me.   We came on trivia day on Wednesday night and had a great time. Competitive game and not too difficult to make you feel discouraged or quit early. Nice venue and good host. Empress is a nice option for trivia night during the week.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JaqcCU3nxReTW2cBLHounA"
  },
  "lgnmfzVbTSIsL8MJRyOnhg": {
    "date": "4/9/2015",
    "text": "Stopped in here for dinner last night having heard good things about Meat Hook operating out of the bar's kitchen.  It's not immediately clear but you have to order the food at the bar. That hurdle overcome the burger my brother had & my Beerwurst with housemade \"German\" potato salad were both good and filling. The mustard & ketchup were also housemade & served in good sized pots along with one of HP sauce. Not sure if they make their own buns too but both were of a Brioche nature.   The bar itself has obviously not changed in any way just because it's got noted cooks making burgers onsite so it's still one to go to for good ales at sensible prices & to watch the sport on either BT or Sky. And probably the terrestrial channels too.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wqxlk1ZmIRf22jdFM45G5A",
        "caption": "Photo of Empress - Edinburgh, United Kingdom. Beerwurst &amp;amp; potato salad.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wqxlk1ZmIRf22jdFM45G5A/o.jpg"
      }
    ],
    "user_id": "txzOZrHK9EVY0kYjSuXkKg"
  },
  "vQVK6A-S3bBFaHviH9CUcA": {
    "date": "10/21/2018",
    "text": "Our first time in Scotland (and Edinburgh) and first day in town so winging it for dinner.  Our flat is in New Town and there are plenty of pub options within a short walk.  We went to one other place first which had live music which was too loud for our tastes.  We then ended up at Empress (within a short walk of our place).  Loved the place and I'd have given it 5 stars but the food menu was a bit limited.  That said, it had a ambience (dark, warm and comfortable), good full bar with a pretty extensive beer list (both draft and bottled), decent prices and excellent service.  Our server (Sophie) was \"top shelf\".  I had the Haggis Pakora (my first time having Haggis - and I loved it) and my wife had one of their flat bread pizza's.  All in all a great night - thank you Empress!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GMWtX-psvQjLfW0JMCPWfQ"
  },
  "fX7KctqFGVQkeP0ehiSKQQ": {
    "date": "9/1/2017",
    "text": "I was in Empress yesterday evening for a few drinks with colleagues and a bite to eat. Have to say I was impressed. Empress has a relaxed and friendly atmosphere, the bar staff were nice, chatty and very helpful with more detail about the menu options. A good selection of tasty bar food, and thankfully the beer selection seems to have improved since the last time I was here. It is no longer the preserve of random micro brewery beers which I'd never heard of, there are now some  mainstream beers to choose from. A big improvement!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "omLRfZKggXtjRWN_VXf7Fg"
  },
  "x4hqSCYx-DnkUdoLrkorFg": {
    "date": "8/10/2017",
    "text": "Honestly, The Empress burger was the best I have had in a very long time. Cooked perfectly, no need for ketchup or any other extra sauces. Pretty good thin fries (chips). My mom had fish and chips (thick cut fries), also very good with some excellent tartar sauce (which they mixed themselves).  If I ever make it to Edinburgh again, The Empress will be on my list to revisit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tZNyGifhl2hkfH7tq6qcZg"
  },
  "NL2yYJ_kx-Zs2grCb3Ow2g": {
    "date": "12/29/2014",
    "text": "Reading the previous reviews I thought this was going to be dodgy as anything. I was ready to down my pint and leave sharpish. It turns out it was a decent surprise.   There was no angry patrons growling in my direction. Everybody was having a pint and watching the fitba. There ain't nothing fancy about it though. There ain't much to say. It's a bit of an old mans boozers. It serves a few decent beers from Harveistoun and Williams brothers. The staff were friendly.   Fine for a quick pint, but nothing special.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "J7Hl7OCQcFjmUerZhcwxOw"
  },
  "VStQ8XOuvflYK-fooTnpLg": {
    "date": "9/15/2015",
    "text": "Lager & drink prices are cheap & service is good. Interesting atmosphere as well. Also has big TV screens for sports events which is good if combined with affordable booze. Free WiFi is available too.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BAg-3SNvMIpLsXNjqtG54w",
        "caption": "Photo of Empress - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BAg-3SNvMIpLsXNjqtG54w/o.jpg"
      }
    ],
    "user_id": "RBvR8MoGAoxeLlm_ajTYgg"
  },
  "gW2UwHIlPlt5OZPFLXssuA": {
    "date": "7/2/2017",
    "text": "We stumbled in here randomly and were delighted by the friendly service, menu choices and delicious food. Thin crust pizza, burgers and salad all satisfied.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H_5V-UvDVxI8TDt32NhHeA"
  },
  "ANYXDg9pTT5oq1jp_01gnw": {
    "date": "6/24/2010",
    "text": "This is a good, traditional pub which, as the decor informs you, has been around for a long time.  It feels friendly inside with a clean, impressive, wooden bar and plenty of top quality spirits behind it.  Malt whiskey is its speciality and it has a great, but also expensive, selection.  Pints are reasonably priced at about 3 each and they sell good quality, real ales and beers alongside the standard Tennents and Strongbow.   Mathers also has plamsa TV screens which are always showing the latest football, rugby or boxing matches.  Naturally, this attracts a good bunch of 'lads', but on any given nights there's a good range of people, including locals and students.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-ES7MkVueMO0gkhgK9pERg",
        "caption": "Photo of Empress - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-ES7MkVueMO0gkhgK9pERg/o.jpg"
      }
    ],
    "user_id": "yfXqZkU5iXE07GSHzdsQBA"
  },
  "ZgxYT-ds9bPWjFE9NlCP5w": {
    "date": "7/22/2010",
    "text": "Like the others have pointed out, this is a man's pub, and I felt like a delicate flower in here, when I came on a night when I really should have known better, one of the World Cup games. Duh.  Safe to say I only stayed for one because I sort of feared for my life, but the pub was busy, bustling and packed with punters swigging pints and having a merry old time of it. I didn't fit in with my large glass of Rose at that point.  Great atmosphere, I might try a quieter time on my next visit and stick to the Pints.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "u8Oj8qZFTXop5zv_pBrWGQ",
        "caption": "Photo of Empress - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/u8Oj8qZFTXop5zv_pBrWGQ/o.jpg"
      },
      {
        "img_id": "daKlLbFqqWimIwGvUr_-wQ",
        "caption": "Photo of Empress - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/daKlLbFqqWimIwGvUr_-wQ/o.jpg"
      }
    ],
    "user_id": "Cy1PV2TdYeDFA16mUOlr3Q"
  },
  "zTOWKQLwExfvvuhFfOojyg": {
    "date": "5/24/2015",
    "text": "NO NO NOOOOO!!! Maybe a good pub for every day drinkers but me , my Husband and 2 of our friends came in too get some food before a show at the playhouse. Had didn't even make it threw the show with the stomach pains from hell. Got a burger which was soaking wet with God knows what on it, pink as hell and was generally disgusting. Only had a couple of bites and left it. Paid the bill as I don't really like to complain when someone has cooked you something. An hour or so later I seriously believed I was going to leave the playhouse in an ambulance!!!!!!!! The pain from that couple of bites was incredible !!!!!! I thought I was going to die in the theatre ! My husband and other friend also had terrible stomach pains as we all had the same thing. woke up and pretty sure Iv got some kind of hell on earth food poisoning!!! Never never never never again!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "me9N4yWGqx49dSk7JSNegw"
  },
  "t7o17gXP1yqatablQ-3htQ": {
    "date": "5/17/2010",
    "text": "Emma had it spot on, Bar Bruiser.   I've never felt less manly in my whole life. Everyone in here used to be a boxer/kick-boxer and have a 3 course meal of nails and barbed wire for dinner. They don't really make any noise or have anything to say until someone scores a goal, which then becomes the hot topic of conversation all week.   Staff are very nice though and the place is comfy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pBNTTtYeU8pPRQwshCqB1Q",
        "caption": "Photo of Empress - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pBNTTtYeU8pPRQwshCqB1Q/o.jpg"
      }
    ],
    "user_id": "9nUtGoOnZMPlZdUQV_aqTA"
  },
  "42spQHDvEpAf5FGSYpn_CA": {
    "date": "7/27/2008",
    "text": "Old traditional bar which has been around for a long time.   It tends to attract a slightly older crowd, who are much more interested in having good conversation than posing in an expensive George Street bar.   There's a coal fire in the winter, which is just the thing for thawing you out when you come in from the cold.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EAXWjnCLv5l_rP6sszQNGA"
  },
  "OHrZEw0tskcx0SAf8RlnjA": {
    "date": "6/8/2011",
    "text": "Pretty much what it says on the tin, an old geezers spit n sawdust pub. I like it!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W1Nl6_R7amuZ6NStXI3uBA"
  },
  "Z4j_hGfdkVrENctCw37bwg": {
    "date": "5/26/2012",
    "text": "Was in here last night. Great pint of lager! Ideal for pre Playhouse visit where we were heading.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B3vRhS-yIT-SEnqYaY-Ung"
  },
  "aHAzLcCnXX4Fhop_RGTB2w": {
    "date": "11/18/2007",
    "text": "Theres two Mathers bars in Edinburgh....just to confuse everyone. Both of which are good and i'm sure are run by the same person.   Mathers Bar in Broughton Street is idea for anyone looking for a cheap drink at the start of a Friday or Saturday night or just a quick one with a few friends from work. With a great selection of real ales and whiskys, as well as the standard lagers and ciders its got something for everyone.   Mathers is located just round the corner from the Omni center so tends to be a slightly older crowd, when i say older i mean 22-23 and older. So its perfect for people trying to avoid the youngsters that tend to hand around the pubs in the Omni center.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3MfXY3EaCwy-dxAsl926nQ"
  },
  "JqE0LsF6eQyFzp0oaNhoiQ": {
    "date": "4/17/2010",
    "text": "Mathers is a bit of a spit and sawdust kind of establishment at the top of Broughton Street, the kind of place where you could probably actually get away with gobbing on the floor if you so desired. Its clientele look like the kind of guys who are qualified to use pneumatic drills, this is most definitely a bloke's pub and tends to be full of proper blokes on any given evening. I wouldn't come here on my own for a quiet drink, but the boyfriend and I have been in together on a few occasions to take advantage of their extensive and reasonably priced range of single malts. They show most major sporting events on their TVs, although I'd advise you get there early to grab a drink and somewhere to stand - it can get pretty mobbed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mJJj_SZff6MEWG5Vx1r8Bg"
  },
  "S58MQhOKaiuNlNx6LKNicQ": {
    "date": "5/29/2012",
    "text": "Have to say hands down one of the best pints in town & at 2.95 probably one of the cheapest!! Bar is great for watching sports think they may have a few Sky boxes as they always seem to have a few different games advertised, great when wanting to keep an eye on different games at the same time! Highly reconmend their burgers.mmmmmmmmmmm",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lT6LZJrPk7x-_lT9ZIfGSQ"
  },
  "VuNtGVv8IZAeU1GdcbEJIQ": {
    "date": "4/28/2012",
    "text": "I had been into Mathers before and found it a cosy pub with great old world charm but a bit of a sad drinkers only bar. I went in last week and found a new BBQ style menu. They do this new burger which is ace, really juicy and only 5.50 ! They do BBQ ribs and great chunky chilli all at really good prices, and none of your \"out of the frezzer into the microwave lasagne \"style food. You should try it out before going out on the town, good ale selection too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5igJhHxAQ6NhFzI83rQIVA"
  }
}