{
  "x6wS9c5ZLcLxF0wloEra4w": {
    "date": "12/23/2012",
    "text": "Disappointing customer service - we were given our table at 7.30pm and at 10pm were told that the kitchen had closed and they were unable to provide desserts. The waitress did not ask our table if we wanted pudding after our main courses were finished. Several of our party were disappointed that the waitress could not accommodate us at 10.01pm. We will not be returning!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4gnQEAk0o7NXpAOTF0ilJw"
  },
  "IMRa6DrDsqTsJDwn2UKtoQ": {
    "date": "4/12/2012",
    "text": "Nowadays me and my little family only get to go out for lunch/dinner every once in a blue moon. So when we do I like to make it count. I am not the type that likes to go to any ole cafe and have a sandwich or soup, I want it to be special and really yummylicous.   Since moving to Scotland I have been both impressed and disappointed, it seems to be very hit and miss but when its a hit, it hits in all the right places. Treacle had been talked up quite a bit so my expectations for having a mouth-watering burger were quite high. First off in my Californian mind a burger requires a number of components to just be considered passable such as: a slice of tomatoe, some onion, lettuce, cheese and yes smothered in slices of dill pickles (not vinagery cocktail pickles) delicately flavored dill pickles. And of course a nice bit of meat without gristle and a light fluffy bun. Now lets say Its all out of 7, each component equals one point. Though to be fair some should be a bit more, like the meat. So we'll go for 8. Now having established this Treacle got a whopping 5 out of 7 which is pretty damn good and I'm being generous cause the cheese wasn't really that great and the pickles were the cocktail type but the meat was sumptuous. It was seasoned very nicely and was quality. The bun was very dense and dry, they didn't serve it with any veg but upon request they added in some tomatoes. Oddly they didn't have any onions in the restaurant AT ALL (????) but the yummy bbq type sauce made me happy enough to forgive them for that. Also the fact that they hand cut their fries/chips was a SUPER PLUS (but no sweet potatoe fries :( )   I was also pleasantly surprised when the bartender actually made me a Shirley Temple! Mind you it wasn't perfect, he had gotten a bit too generous with the grenadine but it was a nice gesture. All in all it was good stuff not the best burger in Edinburgh cause I saw that there was a Lebowski's here and I have yet to try so many other joints but still not a bad one.  So here I leave you faithfully in search of the best burger in Scotland but happy to recommend this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F0nFAY1Qi_7it_Q52n3nTw"
  },
  "zL-ASP1MFlFabYiBi_YYwQ": {
    "date": "3/19/2010",
    "text": "Treacle is a great spot for an evening pint or a few cocktails on a night out. I can personally recommend the cocktails; a little pricey but the selection is massive and they're made by people who really know what they're doing.   The decor in Treacle really separates it from your usual 'old man' pub, with shiny laminate flooring, brown leather seats with, wait for it, sheepskin rugs (I know, very plush!).   I've been in on a few occasions now and it's a great bar for a quite mid-evening drink, or for a more lively night out on a Friday or Saturday.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cqecqnFK2eu88VtKJLHpiA"
  },
  "cpUFpF8gAbTSoIePqEoX4Q": {
    "date": "2/4/2014",
    "text": "we had Christmas lunch there, food and servise is good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xLxkXp9BfF-wYCnkeDp65g"
  },
  "fpwhzk1hEUP5Y3MWNow1SA": {
    "date": "4/30/2010",
    "text": "I do like Treacle, and I was pretty excited when it opened up last year. Although I didn't mind the bar that existed in its place previously, I was definitely keen for some new faces on the East End scene, plus an excuse to get away from George Street for a while.   Treacle gets good marks for being on Broughton Street, which in itself makes it cool, and it's packed with people most days, so the bar has a really good buzz about it. Free Wifi always bumps up my approval levels too. The fish cakes here are always a winner, and there are loads of cocktails on the menu, so you definitely won't be disappointed on that front. I also quite like the cool, random, cartoon-ish design on the wall on the restaurant side of the bar, and there's some good looking decor going on with the sofas, sheepskin and stone wall combo. I think it might just be personal bar taste, but more often than not, I prefer bars that you can lounge about in a bit more. If Treacle was slightly bigger, than I'm sure this would be possible, but I do feel a bit cramped in sometimes. Then again, it would be worse if the bar was always empty, then there would be too much space. They could maybe do with turning the lights down a bit too towards the evening, but that might also be the dark, seedy part of my personality talking. Overall, a nicely polished bar in a good location.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Mujjzv-ZH6HhxT-hWCpVg"
  },
  "NQ9snOduSy4JmOx7szsF4w": {
    "date": "4/26/2009",
    "text": "This place has been open all of two days. We happened across it when seeking somewhere for lunch earlier today.   Previously home to baroque, it's been overhauled so not a trace of the slightly overpowering purple and orange remain. Now we have funky cushions and sheepskin rugs atop the seats, delicately mirrored toilets with scented candles (in the girls toilets at least), very funky decor with a mural that turned out to be wallpaper on the full length of one wall and a strange kind of rubbery upholstered effect on the toilet door. It's very cool in short - but in a very laid back way.   The food was great. Boyfriend had a full breakfast which kept him perfectly quiet for the duration of the eating. I had a sandwich and the nicest chips. Skin still on, properly potato-ey, plenty mayonnaise for dipping. And my ultimate test - the latte was great.   All very reasonably priced. 8.95 for the breakfast including tea or coffee. My sandwich and chips was about 6. Which I'd say was especially respectable for Broughton Street. And the staff were lovely, respectably quick. All you'd hope for in fact.   Give them a shot. They're a very nice addition to Broughton Street. They deserve to do well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SXTh-cBuiwUAaaI4hw-bcA"
  },
  "JXV8ebIVLhFPDuKwhN98Mw": {
    "date": "7/16/2011",
    "text": "I visited Treacle for the first time a couple of weeks ago and I was seriously impressed with what I found. I'm not sure if it was just luck but we had two different waiters and they were probably the friendliest staff I have ever met. Ever. Despite there being quite a varied menu, all three of us ordered from the 'Pub Classics' menu (we'd been in the pub all day); steak pie w/chips, chicken & bacon pie w/chips & fish & chips (I know, outlandish choices). Our food was brought out in good time and I think quirky is the word I would choose to describe how Treacle serves their food: wooden boards instead of plates, chips in a little silver pencil can etc. In other words, awesome (we also noticed people who had ordered some chinese food which was brought out to them in a cardboard takeaway box on a wooden board!). The food was really tasty and was exactly what we were looking for. Afterwards, we chilled out and had a couple of cocktails/beers which were really very good. Again, the waiter was very helpful in informing our choices! The atmosphere in Treacle was really nice and there was a bit of a 'buzz' with a mixture of clientele; which I think is a good sign. All in all, we had a really great couple of hours in here and I would seriously recommend taking the time to visit this place. 5 badger stars.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JA6uRiy32Dj2Lppq597wxg"
  },
  "3atxYIIxgv5nemKlcvyOYg": {
    "date": "7/14/2011",
    "text": "Having a bit of a wander around Edinburgh and looking for something just a little lighter than standard fare for this city.  We tried this funky little place and really enjoyed our lunch.  Great service and a nice decor.  Try the spinach, goat cheese, and sweet potato pie.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i9ycl0QkwHnyFmW3kJ_0pA"
  },
  "6io96H968GVRq-ompSB-Ig": {
    "date": "10/25/2010",
    "text": "Relaxing drinks after a night at the theatre... Awesome vibe... Bar staff are attentive but not terribly quick... Really enjoyable and friendly atmosphere...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-5Mv-eJqc6jtFuimyuWmJQ"
  },
  "dzDNLxBmudtzv8ubkbecww": {
    "date": "9/26/2011",
    "text": "Just realised that this place isn't as good as it used to be. The prices are pretty hefty and the staff are almost useless, especially on a friday night, when it is difficult to get served.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rg2jange37XtAL--zGgG4w"
  },
  "vHDHOFpc_026vkWJyqNvFg": {
    "date": "4/13/2010",
    "text": "I really can't make my mind up about Treacle (don't worry, in the course of this review I will try to come to some conclusion - please read on....). Before it had a bit of a make-over and was completely rebranded, this was a pretty empty and slightly naff looking cafe bar on Broughton Street; which was actually quite a nice place to chill on a Sunday afternoon. It was given a lick of paint and lots of sexy new furniture (no problem with that), but some genius decided that what it really needed was a new logo. Now there is a hideous little cartoon monkey thing all over the walls (outside too), which reminds me of a poor man's PowerPuff Girls and makes me feel slightly queasy. Admittedly, I have only ever had been here for tea and chips: the tea is the lovely Suki kind, made with real dried fruit and herbs; and the chips are chunky and hand cut, almost, but not quite wedges, they came served with aioli (mmm mmm mmm). Whenever I pass by the place always seems to be full, so the management must be doing something right, unfortunately the clientele seem to be of the poncey, posing variety, not really my scene at all.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mJJj_SZff6MEWG5Vx1r8Bg"
  },
  "t4fF5nyASGhC3w_MMqYhHw": {
    "date": "5/24/2009",
    "text": "I recently visited Treacle for dinner and thought it was a great place. My friends and I all had the 80z beef burger, which was delicious - especially the chips. The service was quick and friendly and the prices are very reasonable. The house white was also very pleasant. The decor is funky with a manga-style mural along one wall. My only criticism is that it's a little cramped, but the waitress did ask the people standing around our table to move once our food was served. I will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dibc1MT2Svkjf9rNmdd4_w"
  },
  "dsJ8gLCmZk9QOgCe9rmulA": {
    "date": "1/29/2013",
    "text": "I was initially a bit put off visiting Treacle - it's monkey logo and manga cartoons made me suspicious that it was going to be a bit studenty but I gave it a go and it's now one of my favourite places to go for brunch on the weekend. I'd definitely agree with other reviewers that it's a counterpart to sister restaurants Hamiltons and the Blackbird in that it's a perfect daytime place to enjoy your meal with a drink or two.  They've got a great breakfast selection, a good selection of pies and some pretty healthy salads too!  I love the sweet potato and spinach pie with chips and on the other side of the coin, the superfood salad with green tea dressing makes me feel super healthy!  The noodles are great and the desserts are amazing too, if you can fit them in.  The cocktail list is pretty extensive and I'm a sucker for a girly cocktail so really enjoy the pear and violet mule.    The service can be patchy but on the whole is pretty decent.  It does get busy so it's best to go before 1pm on a weekend - well deserved success for them!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "l6f1IN840kIXVZ5bmNz9wA"
  },
  "-WX9w5CWc3bdfQ25oeqwVQ": {
    "date": "7/30/2015",
    "text": "The food here is decent. I had a full Scottish breakfast which included baked beans, black pudding, an egg, haggis, bacon, sausage, toast, a hash brown, and a tea or coffee. However, I ordered my tea and got it right away, but had to wait an hour for my food to arrive and by that time my tea was finished! When I got my meal I asked for some more hot water in the teapot and finished my very large breakfast. But when I got the bill I realized that they charged me 1.50 to refill my pot with hot water! They didn't give me a new tea! Bit strange, but the Scottish breakfast is absolutely huge and worth the money.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gYYA1fGrQ3d1WFVvBS8rmg"
  },
  "H6TXekIyEBc-SPWg-r86OA": {
    "date": "5/2/2012",
    "text": "It's not an understatement to say that I have been waiting to eat here for ages...AGES! Everyone keeps rabbiting on about how good the food is, especially the sweet potato fries. So I was really grateful that Jenny.L took pity on me and arranged to meet me for some drinks and dinner last Friday night.   First impressions were great. I love the manga style art on the walls and the place felt roomy for such a small pub. I arrived slightly early to snag a table for us and the staff were really friendly, laughing along as I begged for a pot of tea on a Friday evening as well as a margarita for my good friend Jenny. (I hadn't had a cup all day and was dying for caffeine!)  It took me awhile to order, there were just too many really tasty looking things on the menu, but I finally settled on the stir fried crispy beef noodles with a side of sweet potato fries. I was really tempted by the burgers, something that was recommended to me by friends, but felt I would regret not having these noodles.   I'm so glad I did!   My noodles turned up in a delightful little box with chopsticks and were absolutely delicious, I'm actually salivating right now just thinking about them again and had moments over the weekend where I'd find myself craving them. It's a sign of an amazing meal when you're still drooling over it days after. The only difficulty I had was eating the beef as it was in large strips far too large to be a mouthful. If I'd had any sense I would have asked for a knife to cut the beef in to more manageable chunks instead I insisted on attempting to chew through a strip of beef using only my teeth and a pair of chopsticks. I must have looked like such a moron, well done to Jenny for keeping a straight face. (Though she did burst out laughing when I decided to start eating my sweet potato fries with my chopsticks too...clearly I don't know when to quit.)  Even though I was full I refused to let the bemused waiting staff take my meal away...I was determined to continue picking away at those noodles as long as it took to finish them, cold food be damned! (Our waitress admitted when we paid our bill nearly 5 hours later that this was the longest they had ever seen anyone pick away at a meal. I'm not sure whether I should be proud or embarrassed?)   As I was driving I was unable to avail myself of the very comprehensive cocktail menu but I did get a little sip of Jenny's margarita and pear and raspberry mojito. Yum. Now I have my excuse lined up for why I need to go back there soon.  The only actual down side for me was the noise. With it being a Friday night it got a bit busy and noisy, so much so that I couldn't hear Jenny over the music. I understand that the place is a bar (and I was warned that it could get busy) but it did lesson my enjoyment slightly that I couldn't hear my friend at times. I'd definitely go back but would try a week night this time.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wk-QmrbyCtGD23oIhMP44w"
  },
  "VikvghEIeBPJTRzyBCB2CA": {
    "date": "11/16/2014",
    "text": "Visited Treacle.  It was near my hotel in Edinburgh.  Trendy, loud but as expected.  My martini was poured by a new guy I think.  I returned it with a little resistance from my waitress. The food was prepared very well.. fresh and delicious. I would return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "T_1UK_RWPTef9wgF_TcncQ"
  },
  "zQQjoSchan1GnzAOw5cKrw": {
    "date": "4/15/2013",
    "text": "I have been in Treacle a few times now and really like it.   The cocktail menu is huge, such a great selection and are all yummy too. I went for breakfast/brunch here this weekend and the portion sizes were great on the full cooked breakfast and it was really tasty too. Only thing was that service was quite slow...especially taking 15 minutes for four cups of tea but as everything else was so good and the staff were lovely and friendly, I'll let them off :-)  They also had a good selection of mini bites and lovely sounding sharing platters, so want to go back and try those.  There is great seating too...we chose the sofa with tonnes of cushions which was so comfy but as I am quite little, I had to sit on a pile of cushions as a booster seat though as the sofa was quite low and the table quite high!   And it plays cartoons on the TV and is dog friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DFqyIrDXR_Q35KDIyN7u1w"
  },
  "efLLTA2U62B10ZidmbpZHg": {
    "date": "9/16/2012",
    "text": "The bartender is a True mixologist, which seems rare in this country of 400 year old pubs and sellar temperature ale.  He took loving care in each cocktail, deftly cutting the pith away from the lemon rind for my sidecar, then fashioning it into a sort of lemony arrow.  The waitress sold me on some sort of beef noodly thing that was actually quite tasty, though if I had had the good sense to read Jenny L's review I would have gone for the burger.  Noodles were well spiced, though the tempura beef served over them was just sort of bizarre.  Who deep fries beef (well they do in the south of America, but they call it chicken fried steak)?  Service was top notch, and the bartender was friendly and knowledgeable.  I'll definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-LP5O6JelPyVS6n2F9JQ7A"
  },
  "B6tXMxaz3RB2ODFBxNT71g": {
    "date": "3/20/2012",
    "text": "In the pantheon of Edin-burgher (see what I did there?) joints, Treacle stands somewhere mid-table for me.   It was a pre-theatre bite and my first experience eating at the bar. The burgers had been recommended on several occasions by friends so I went for it. In hindsight, I saw LOADS more on the menu that interested me over the burger but went for it anyway. Get it out the system so to speak. And now I'm hankering for another go at that menu to see what I missed out on. As burgers go, I can immediately think of at least 4 bars I'd sooner go to to get my burger on.  In its old incarnation as Baroque, Treacle was a previous after work local. They (used to) do some decent Friday happy hour deals, and their cocktails are awesome (try the Margherita... ridiculous!), but with happy hours being abolished in our fair capital, that asset has unfortunately flown from Treacle's portfolio.  Located on Broughton Street, not too far from the likes of 12 Picardy Place, GHQ, the Basement, etc. it's a no-brainer that Treacle falls into the trendy and attractive area of the scale, but thankfully it's well enough away from George Street so as not to become completely rife with posers and ponces comparing their bright-whites like a bunch of girls dancing round a handbag (don't worry Amicus Apple... you're review is coming...!).  When it was Baroque and an after work regularity, I was a massive fan. As Treacle, I'm not quite convinced as yet. It's an attractive bar with attractive staff, no qualms or complaints there. They do impressive cocktails and an interesting menu, both plusses. Is the music funky? Yes, but also too loud for this kind of venue. Are the drinks a little pricey? Yes, considering the likes of Lloyds and Walkabout (if you're not too fussy) are considerably cheaper and a stones throw away.  So I'm on the fence. I don't throw out 3 star reviews very often largely because there's never usually enough to say about them... hence the 3 stars (vicious cycle much?!). But I suppose for a bar with a menu that includes Crispy Coconut Chicken or Griddled Pear Salad or Bounty Bar, Mascarpone & Lime Cheesecake, I WANT to say more about them.  And so for now, I hope I can ramp up that rating a star or two after I've had another crack at that menu.  See you soon, Treacle. Round 2.... ding ding!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "9RGIvzCGHp8ELF_JgAlbZA"
  },
  "cRWRDSZhVJ1Tc2wLRo5egA": {
    "date": "1/23/2012",
    "text": "Ok the fourth star is back.  I keep giving Treacle another shot because I SO want to like it.  I think the food has some serious yum power and it's very conveniently located.    On this most recent trip (With Jason M and Gillian L), I was treated with friendly and attentive service, and a really yummy margarita.  It was a *really* yummy margarita.    So, good job Treacle.  Maybe you read your reviews and provided some customer service instruction to your staff, or maybe we just got lucky.  I'm really hoping for the former.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "4UQfst9jve4GCSfWpWn2uA"
  },
  "Crvxh5GLgOEl3iC45F02HQ": {
    "date": "6/24/2010",
    "text": "The owners of Treacle have definitely gone for the cool, stylish feel.  The decor is stylish and contemporary, but it doesn't have that relaxed feel that you get with some other bars in Edinburgh where you can just slouch on a sofa all afternoon.  The seating is comfortable and all, but it just doesn't have that same feel.  The staff are friendly, quick and most of the drinks are reasonably priced. The all day menu is extensive and most of it looks delicious, but some of the main courses are steeply priced for what you get.  I paid 9 for a chargrilled chicken breast with cheese and chips.  For 9 I was expecting a hefty portion, but I was still hungry after it and the chicken was chargrilled, whilst the cheese was virtually Dairylea!   As a bar, you can't help but feel that Treacle should somehow be better than it actually is.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AfadtNnTCje5XCnop3FVFQ",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AfadtNnTCje5XCnop3FVFQ/o.jpg"
      }
    ],
    "user_id": "yfXqZkU5iXE07GSHzdsQBA"
  },
  "7yXnzmadt9xC4TQx7RyeZA": {
    "date": "3/23/2010",
    "text": "This was the first meal I took my boyfriend out for - we live in a fantasy, delayed-feminism world when it comes to paying for dinner and this really hurt when the figure on the bill came out of my bank account.   Attention in the detail is one thing, really bad food is another. Instead of mash it was Smash. the entirety of the burger and chips meal tasted like, and was as satisfying as eating, cotton wool. We were also lucky enough to experience a scientific miracle of when the spoon didn't manage to get through the mousse. I won't be going back to experience any more of these bland, pointless delights.  You can't deny that the team behind Treacle (also responsible for Hamilton's in Stockbridge) have tried really hard to create a unique style experience. There's a lot of similar looking bars around Edinburgh and a part of me is glad that it's stepping out on it's own. . However, they've gone for what can only be described as a \"youth club\" interior with that hideous mural on the wall which is supposed to represent the Last Supper.. certainly fitting at least.  Every cloud has it's silver lining as it's alright for a drink, remarkably good looking members of staff swan around and in fear of sounding shallow, I like that in a bar. Another plus side you can sit out on the street in the sun in summer, as both of which are becoming rarer.. being able to sit outside and the Edinburgh sun.  Drink? Yes, perhaps. Food? No, hell no!",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VWXgc88LqZ2DOs4UjX9MFw",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. photo from official website",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VWXgc88LqZ2DOs4UjX9MFw/o.jpg"
      }
    ],
    "user_id": "rJi2YPK6uj4FtE8R7OFQcA"
  },
  "Kbd2JWSYxf425tCjS8fNSQ": {
    "date": "2/10/2013",
    "text": "I'm really torn about what to put in this review.  I thought Treacle served up a pretty decent lunchtime option. It was a reasonable price and the staff were friendly and attentive, though it did take a while for our drinks order to arrive.   My burger was good. Nice BBQ sauce and the chips were excellent. The lady opted for a super food type salad thing and I could see all wasn't well in her veggie world.  Now this sounds like a small thing, even I was cringing a bit when she called over a member of staff, but the seeds on her salad should have been toasted and obviously weren't. I kind of thought no big deal, but then I realised that if you state it on the menu, then you've got to stick it on the plate. Also, if you're someone who actually likes eating this stuff, you notice when one of the few ingredients with any defined taste is missing. I have to say the staff were really nice but said the place was too busy to ask the kitchen to actually toast some seeds.  I was pleasantly surprised when it came time to settle the bill and our drinks hadn't been charged. The manager explained that if we weren't happy then they had to make things work for us somehow. I really appreciated the gesture, but obviously complaining about a meal kind of takes the pleasure out of the overall experience.   If the other half was more of a committed carnivore and had opted for the burger rather than her usual hedgerow pickings, I'd be pumping this up to 4 stars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hpOJQWalhWC8Lp2tETE1dw"
  },
  "E90PuhX3g79GUQ337wrFEA": {
    "date": "5/22/2014",
    "text": "This is a tricky one for me... The food and drinks are pretty good (great cocktails)... that is when you can manage to order them! A trendy little bar attracting the after work crowd, it's a victim of its own success making it overly crowded and the layout of the bar meaning everyone gathers at the front making it impossible to get past the layers of people to get a drink in to the point the last time bar staff were barging past us.  When I pointed out there was no other place to stand and to get a drink this was met with a '...and soooo, what do you want me to do' response.  Not great. If you can balance the good against the not so good you can persevere but you'd be a better person than me.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nltUy-nDWqKcDHGd12ZfLg"
  },
  "GaDaVqH2g4wIf6sYmPbaCw": {
    "date": "2/3/2012",
    "text": "Treacle is a lively bar at the top of Broughton Street, serving a wide ranging menu of well-presented dishes. They've clearly put a good deal of thought into presenting their dishes in an eye-catching style, and that's very much to their credit. Sadly, the food I sampled tasted nowhere near as good as it looked, which was a shame.  Overall, we said: \"while I liked Treacle's schtick, I'm not sure that their food really delivered, flavour-wise. A few little tweaks (a little more filling, a little less bun, a little tangier cheese) and I dare say they could have things working much better, but for now I'd say go for drinks, bask in the happy vibe of the place, but think about popping elsewhere for food.\"",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LURC3E0DoXYgN9aYTF3XOg"
  },
  "iOfbtEIZ6XHkj70zaIF1vg": {
    "date": "3/2/2016",
    "text": "It's a nice place with an inviting atmosphere. I stopped in for lunch. They were busy, but not packed. My grilled chicken sandwich was tasty - though calling it a banh mi seemed to be a bit of a stretch. My largest complaint is that the service was slow. I had three people see to different parts of the service - yet, getting one of them to bring me a glass of water in under 5 minutes seemed impossible. Which was annoying given the fact that one of the guys spent a good part of the time slicing limes. The sandwich was tasty enough that I'd give another try.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "78mM59aeGQsxvSwDZSH7Yg"
  },
  "oADtc6o8GN59sQice_uxxA": {
    "date": "1/22/2016",
    "text": "I really liked this place, it's a shame though that the staff let it down. None of them seemed like they wanted to be there, and we felt like we were in the way for wanting to order a drink. Once the bartender got off his shift though and joined his mates in the bar he was full of life, if only he could have been a bit more like that when working.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eMDU38ZPWfiXzdowuGG0iA"
  },
  "HX4WbiktGs8uj8mJ2pf14A": {
    "date": "10/15/2011",
    "text": "I spent my honeymoon in Edinburgh. We were introduced to Treacle on our first night in town by some local Yelpers.   The style of the place is anime meets modern romantic. It's a little over the top for me, but I can look past it because the drinks menu, oh the drinks menu, is WOW. During several trips to Treacle while we were in town, I tried the Pear and Violet Mule, The Silver Fern and the Elderflower Fix. They were all so delicious and the ingredients were so unique.  We didn't try the food, but it looked and smelled YUM-O!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VVBzicjxYIhE2RR3nUfOTA"
  },
  "t58mArX5jMltf9D7rgqkKQ": {
    "date": "7/22/2011",
    "text": "Friendly staff, great cocktails, outstanding food for modest bar prices, cool decor with a manga flavour. One of the best bars in Edinburgh to go to: stylish, but with a chilled ambience and minus exhorbitant prices or pretension.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7vJT5yNQwoz3AGDzYdj1cA"
  },
  "nsZXHeKYgIb7KkqdckbBwA": {
    "date": "1/16/2012",
    "text": "I ended up heading to treacle with some yelpers before we headed out for a lovely, tasty dinner! When we first arrived, around half 6ish on a saturday night it wasn't too busy! And we got served pretty quickly. Although I did think that the drinks are maybe a little pricey. Nearly 8 for two spirits and mixers, would have been better off getting a cocktail!  We then returned after dinner, needless to say it was much busier! The service did take a little longer, and I did feel that some of the barmaids were a little bit more interested in having a good old flirt with the old men at the bar than actually doing their job. Another point, you work behind a bar, you have to bend down and move around alot, yes the men may enjoy it but quite frankly I had just eaten and did not appreciate seeing your cheap, sparkly, barely there underwear. Put. It. Away. Also the crowd of people here really is quite an odd mix and it kinda put me off a little. I don't like very drunk, loud, shouty and attention seeking people, pretty much what I got here. These are my main issues with this place. The mojito I had was very nice and I tried some of the margaritas that were in full flow, they were amazing! Purely based on the cocktails this place is good, but I remain unconvinced. Maybe a trip back when it is not a Saturday night might help.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "j9AYnOtFC90VpDFbma8Q3A"
  },
  "xXr26zNAHh7h6RgdtFKZcQ": {
    "date": "8/7/2010",
    "text": "Treacle is an excellent bar to go during the day for some food and a quick drink or as a starting point for a night out to grab some drinks or cocktails. Their cocktail menu is extensive and they have a great selection much more exciting than the boring old French Martinis and Cosmopolitans.   I came in last week for a quick lemonade and parked myself on a pew and sifted through the free magazines and flyers that I'd picked up from the bar. Now, I am the clumsiest person on the planet and I before I'd even taken a sip, I stupidly knocked over my glass of lemonade, I don't know how I managed to do it but as I felt the cold ice cubes dripping onto my feet I felt like a right diddy. I stealthily sneaked over to the bar to grab some tissues to clean the table. At the same time one of the waitresses came over with blue roll to help me clean up, I felt so stupid but she was really nice and even brought me over a new glass of lemonade! I offered to pay for it but she said it was fine which I thought was really nice as there aren't many places who'd give you a replacement for being clumsy.   A great place to sit, whatever time of the day with really friendly and helpful staff that make the atmosphere nice and chilled out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CqkdpG2tkCPQA69umlAHsA"
  },
  "qbL3MZHWrKQyQ5vMd0FwVw": {
    "date": "7/19/2010",
    "text": "I absolutely love the monkey for a start, it really draws your attention to the place and although I'm not sure of its significance, it's really cute all the same! The bar/diner is really cool and stylish, with wooden block tables and stools, giving a really chic feel to the whole place. My friend and I popped in for a drink one afternoon and we really liked the vibe of the place.  The staff were really nice and helped me choose something from the cocktail list, it's not like me to struggle with that but I just didn't know what I fancied! I decided to have a Treacle beach tea, a concoction of 42 below, Havana rum, Bombay sapphire, Cointreau and pineapple soda, which was probably a bit strong for the afternoon but it was actually amazing! I wish it was on the cocktail list in every bar! At 6, it was pricey but not too bad for a cocktail I suppose.  After one, we left, because if I had my way I would have been bankrupt drinking my way through the cocktail menu, but at 2pm, we decided it was too early to be drunk and left for some shopping. I will definitely be back at night though, for a few more of these amazing drinks!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yBPLm8Bwda_iFdiEQnbNSQ",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yBPLm8Bwda_iFdiEQnbNSQ/o.jpg"
      },
      {
        "img_id": "i7iKPg2k72GJlFVVGyUorg",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/i7iKPg2k72GJlFVVGyUorg/o.jpg"
      }
    ],
    "user_id": "Cy1PV2TdYeDFA16mUOlr3Q"
  },
  "ScNXi67imAqfOTsLHTW2sg": {
    "date": "10/25/2015",
    "text": "There is a pleasant vibe in this place. The layout is open and could made a bit cosier. Nevertheless I enjoyed sitting and watching people coming in and chatting at the bar.  The cocktail -Raspberry Pegu Club- was fresh and got me wanting more. The crispy chicken breaks was tasty, but the dip could have been more up to level. The Japanese meatballs were moist,  but due to size,  they would have benefitted from a dip as well. Both portions were a big size. Maybe even too big as a starter. The noodles salad with chicken was zesty, a nice mix of warm and clod and crisp and soft. It needed a bit more spice though,  so I asked for some hot chili sauce. I got sweet&sour back. Too bad,  I always like the extra sting when eating a Vietnamese style salad... The menu isn't extremely big but there's probably something to everybody's liking. Conclusion: will I be back? Most probably yes.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jxkox59-sVyTlRnUNGSOxg"
  },
  "H9I3VlqSaU6UEE-nNxj1nw": {
    "date": "5/24/2014",
    "text": "When in a new city, I tend to go to many different places to sample all kinds of food. I wasn't able to do that while here in Edinburgh because we just kept coming back to Treacle. The food is high-quality and delicious, and the service super friendly. dog-friendly, artisanal cocktails, vegetarian, gluten-free (on request), great atmosphere and fun furnishings make it a perfect place to relax and meet the locals.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mzleBmmtaIRa-zuJZx-BRQ",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. michael trying to look busy",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mzleBmmtaIRa-zuJZx-BRQ/o.jpg"
      }
    ],
    "user_id": "gBKyfG3Po3ZonmPv6ILldQ"
  },
  "1JZ14eaCDns1Lmgx65BpNQ": {
    "date": "2/17/2015",
    "text": "Very unexpected but this place is a hidden gem! Friendly staff and amazing food! The chocolate chip cookie dessert is made to order and everyone should get it! Yum!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0gJpbz4XneAHqiISAa_jSA",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0gJpbz4XneAHqiISAa_jSA/o.jpg"
      },
      {
        "img_id": "sUGVYMYEmrXaVCuqBxvuBQ",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. Steak and ale pie, yum!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sUGVYMYEmrXaVCuqBxvuBQ/o.jpg"
      },
      {
        "img_id": "bgvO1Cs7oazCBlwLdHCXyg",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. Steak and ale pie with chips",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bgvO1Cs7oazCBlwLdHCXyg/o.jpg"
      }
    ],
    "user_id": "x-9AN426Qpj8TXE6KA_yNw"
  },
  "ZvPs0CagaUblS88CSmdLJg": {
    "date": "10/30/2012",
    "text": "Great night out with friends Trendy and innovative A smashing Pad Thai",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eKc2gY6fPaQy3zNsbIYDvA"
  },
  "0p2_JpYIaLOg11WHG_hOUQ": {
    "date": "11/9/2011",
    "text": "I'm not entirely sure what the official definition of brunch is. For me, it's breakfast with booze. And Treacle is the place to go. I'm a bit of a creature of habit, so when going for brunch I always get Eggs Benedict and a Bloody Mary (extra spicy). Fantastic the morning after the night before, and indeed at any other time. Both come out perfectly every time. Treacle succeeds at walking the fine line between cafe, bar and diner (it must be a three dimensional line), but I've no idea what it's like in the evenings as for me it's always been my brunch place. Really, Broughton St should be renamed Brunch St. What a great part of town. But I digress.  I've been told that \"any day you eat Eggs Benedict is a good day\" and I have to agree. But even though I'm not much of a food snob, it's one of those dishes that is easy to screw up, and on first glance Treacle looks like more of a bar than a proper dining establishment. But fear not - it's top notch. I've also been for lunch more than once and tried both a beef and a chicken burger which were excellent, but 99% of the time I go for my usual combo.   As some others have said, the service can be a little slow but they're always nice and friendly and it's a pleasant place in which to ease into the weekend, so I forgive them. That's big of me, don't you think?",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "7kpcPwzuk0EPp9xdPi_TyQ",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. Eggs Benedict",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7kpcPwzuk0EPp9xdPi_TyQ/o.jpg"
      },
      {
        "img_id": "xSrhgKyT32auaQFTlG2qfg",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. Best Bloody Mary in town.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xSrhgKyT32auaQFTlG2qfg/o.jpg"
      }
    ],
    "user_id": "ixBoXpBL1JmKmcP1F2fTHA"
  },
  "IqOk0xaar8qDqfOWwuXGvw": {
    "date": "10/24/2014",
    "text": "I like Treacle. They are a open faced, trendy bar with some tasty dishes!  It is good to know that they don't overcharge the Innis & Gunn from the draft.  They have some comfy sofas and some clean functional dining furniture.  The times I visited I was pleased with the bar staff, they are friendly and always trying to see if you need anything.  One niggly bit is that somehow there is a feeling that they are a close-knit group friends and how much they try I cannot shake the feeling I am not entirely at home here. I wouldn't spend much longer than a few drinks a a quick meal here.  It is purely subjective I know, but after a few visits I still feel the same. Possibly the not the right vibe for me.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fKi8ZF3xpJJkgSusRubeMA"
  },
  "G3P1FBl79-H-qXqV7X_wNQ": {
    "date": "7/4/2013",
    "text": "I hadn't been here in aaaages but as I live in Leith and my friend lives in Stockbridge we decided that this was roughly halfway (though actually much closer to me!) and worth a revisit.  Treacle (or as my OH calls it 'The I heart monkey place') hasn't changed. The weird faux anime on the walls and faux/real anime on the TV are still there though I personally thought the crowd was slightly older than any of my previous visits (again, I haven't been in ages). Around us were mainly dates, middle agers out to meet their friends and groups of women with copious amounts of wine. I'd booked in advance just in case and we were quickly shown to our table. The crowd was pretty loud so we were lucky to be in a corner by ourselves.  The service was a bit slow but very friendly. I ordered the seared beef salad with broccoli, pine nuts, orange, watercress and a dash of manuka honey along with the coconut chicken and peanut dip. The salad was DA BOMB. The beef was perfect and the manuka honey tasted like heaven. The coconut chicken was delicious and went perfectly with the peanut dip. I was one happy monkey. Across from me steak and ale pie with chuky chips looked smashingly presented and I was assured it was tasty. For afters we seared the *famous* deep fried brioche jam sandwich with ice cream and berries. I definitely could have eaten one alone, though I'm sure I would have regretted it. The sandwich was wonderful. There is a reason why it is the main picture for this business!  Overall it was lovely meal and a great catch up, but unfortunately one of my peeves reared it's ugly head! When the waiter took out order I commented to my friend about how waiters in trendy places never write down your order and how it must be uncool to do so 'these days' (I'm a granny!). Low and behold, some of my order was forgotten, that added to the fact that our waiter checked his hair in the mirror every time he came to our table lost this review a star.   First class food, slightly image obsessed service!",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 7,
      "cool": 4
    },
    "photos": [],
    "user_id": "KPY6FvT6h-r0W0HAC1Buag"
  },
  "T06DAbNSqxQgMRG-smORZQ": {
    "date": "7/1/2017",
    "text": "The atmosphere was great at Treacle. Fun, inviting, modern bar with a friendly and accommodating server. The food was tasty. Will definitely return when I return to Edinburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0tU6YVy_j41tlxCNCPmwSA"
  },
  "jug4QHayUURrnojhzRJ8jw": {
    "date": "6/16/2013",
    "text": "There something about Treacle that could be bottled and sold. Yes, it can be noisy and yes, at times the service can be slow, but you get the sense that in one way or another, its all been designed to be part of the very specific 'Treacle' experience.  As a Broughton resident, Treacle is my local haunt and so I've spent many a post-work Friday and lazy Sunday working my way through both the food and cocktail menu. The weekend all-day breakfasts can, at times, be a Godsend and with main courses priced in the region of 10, it's affordable for a week-day meal out.  I've never been disappointed by the food in Treacle, and particularly love the noodle dishes. Presented in New York-style cardboard boxes, the generous portions are packed with flavour and there's options for both carnivores and herbivores. They also have a great line in smaller dishes and are very accommodating of both vegetarians and coeliacs - most of the menu can be adapted to be gluten free.  Word about Treacle has spread, so I would almost always recommend booking a table if it's food your after - I've struggled to get fed in there on a Monday night at times, it's that busy. But even if you're not that organised and don't book ahead, it's still worth  sipping on something cold at the bar. My current favourite is Treacle's Russian Roulette cocktail, which is a combination of Stoli flavoured vodkas, and tastes almost exactly like lemon sherbet.",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "AD5-3gEjii09vG3ZqonoCA"
  },
  "mtKy0iEUh2rmVYfYAsOvsg": {
    "date": "11/27/2013",
    "text": "I love this place.  I've been a couple of times before for food and both times it has been delish!  This time is no different.  Ok it was a busy Saturday afternoon and the rubgy was on too.  Although we had to wait for a table, no more than 30 mins - the waitress offered us to drinks while we waited on a window seat.  Both of us had sandwiches.  i have the smoked salmon on brioche which was orgasmic.  It was filing and really good value.    Although the service was patchy I'd still give it 5 stars - the food combos are really good.  Staff are super friendly and give good service.    I'd defo return as it's a handy food and drink joint to know!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BhYROfCjIJsKUk22_IVHig"
  },
  "QwkOI3rpCj-67XLb7ZdFjA": {
    "date": "12/26/2013",
    "text": "I came to Treacle because of all the rave yelpings. I like it but i was super disappointed because they no longer have sweet potato chips! Which was one of the dishes people talked most about in their reviews!  My friend and I shared a noodle soup and a sampler pate with fried tofu, chips, coconut shrimp, and some other goodies. We really enjoyed our food plus we had delicious drinks! Defintiely a place to meet up for drinks with friends.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mGmIu1lCPKlS1xHchjpjHA",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. Yummy drinks",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mGmIu1lCPKlS1xHchjpjHA/o.jpg"
      },
      {
        "img_id": "2ZL71GlpupyXtc_uukS0Sw",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. A share platter with coconut  chicken, tofu, shrimp , yummy chips",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2ZL71GlpupyXtc_uukS0Sw/o.jpg"
      }
    ],
    "user_id": "BpKuNkYgAuisCNZlSzfUAQ"
  },
  "RQUGODympsmNQ6pudYc8gg": {
    "date": "6/20/2014",
    "text": "Treacle is one of quite a few trendy bars on Broughton Street. It combines being a coffee house with also being a bar serving food. On this visit I was only buying drinks on a sunny weekday afternoon so it was fairly quiet but the bar staff were still attentive and the outdoor seats were great to watch the world go by whilst sipping on a cold beer (it was great to see them serving Innis and Gunn Lager on tap). The decor plays on the trendy vibe with manga cartoons on the walls. Definitely a great bar to meet up with friends to show you are one of the in-crowd.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CD-cuKfj2wybw2DDQbp5Wg"
  },
  "WPdz9vGNDEFppk0Y1TWliA": {
    "date": "11/30/2015",
    "text": "Get the feeling I'm supposed to like this place more than I do, that for some people it's like Cheers and they just love coming here. Food isn't bad but nothing on the menu was drawing me back. Staff ok but bit more interested in catching up with the regulars/their own small talk. Drinks again not bad but can take a while to get to your table. Can't really put my finger on it but it's like everything is kind of here for it to be a good place to hangout but only if we all left and let the staff have it to themselves.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oqptcZGSPxribe0W8Y2CKA"
  },
  "8j8M9Ba2ISpO3eMyH_4Y3Q": {
    "date": "3/26/2014",
    "text": "Absolutely love this joint!  The atmosphere is legit and the food was just as good.  The staff was incredibly awesome and they played good tunes all night long.  I would highly recommend this for a younger crowd scene and would definitely come back here during my stay in Edinburgh.  I'd give it 6 stars if possible, great place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ICDS8qUouelj5n5E5yvPYA",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ICDS8qUouelj5n5E5yvPYA/o.jpg"
      }
    ],
    "user_id": "qt02s43ccwhUGoUsg8WUyA"
  },
  "xEzYGdLvzaeDp8P8i9m6Yw": {
    "date": "7/16/2013",
    "text": "I've been to Treacle a few times for drinks (who can resist that cocktail list?!) but had never eaten here til now when we popped by for lunch. We'd originally headed out with the hopes of getting a late breakfast somewhere but it being a weekday and bumping into a friend and nattering for a while meant we missed Treacle's breakfast by 5 minutes. Never mind, we thought - lunch it is then!  My boyfriend went for the steak sandwich which looked really good and he easily finished. I wasn't sure what to have, part of me still wanted breakfast, and whilst the noodles sounded good I'm not a big noodles person so I went for a couple of the small plates instead - Crispy coconut chicken with chunky peanut dip, and beer battered tiger prawns with hot and sour cucumber and lime aioli. These were... okay. Absolutely nothing wrong, but a little underwhelming. I couldn't taste the coconut and whilst the peanut dip was tasty (very like satay) the chicken pieces were a bit meh. The prawns themselves were lovely,  but there was nothing hot or sour about the cucumber and aioli. A tiny bit of chilli in with the cucumber had had no discernible effect.  Pity as I loooove hot and sour tastes!  It's four stars though as I do like Treacle. The cocktail list is extensive (bit unsure about the inclusion of drinks for girls though...) and the general vibe is cool. Drinks are expensive mind. And the steak sandwich looked tasty, I was just a little disappointed by my small plates.  Okay, but nothing amazing.  Overall though Treacle's pretty good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mqg4L8flJmg8pqeR-uYyRg"
  },
  "UzNpBJXqQ__UdRyKwCayuQ": {
    "date": "1/9/2013",
    "text": "Treacle has a good cocktail menu, and this place is typically busy with an afterwork crowd.  However, I've eaten here several times and have yet to have decent food. On the last visit, the vegetarian tempura was so horrible that we sent it back. It was a random mix of veggies. I have never had a spring onion tempura'd before. Really?! ...  We had to complain to the bar staff because the waitress didn't return to check on us. we didn't receive any apology from her or the bar staff, but the waitress later said that's why she's not vegetarian, she only orders meat herself.  Again, Really?!    Two stars for the drinks menu, and a max of one star for the food and service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "zUXTdPXno9-V_LVXOGa2sw"
  },
  "8XVRcDx82CjTYRfCS0UOjg": {
    "date": "6/23/2014",
    "text": "Had the best scottish breakfast here.  I know i know... this is a gastropub and i have being here only once. But i have to write a review since it was here that i had the most delicious veg scottish breakfast. So i was in Edinburgh with hubby for a small trip of Scotland. We reached around brunch time from london at our hotel and were very hungry (since we missed breakfast, obviously). The hotel receptionist suggested Treacle for a quick bite. This is a really nice place and they serve breakfast till 12. Comforting ambience and good service. Hubby ordered Eggs Benedict and i ordered a hearty veg scottish breakfast which included veg haggis (so delicious), veg sausage, has brown, potato scone, portebello mushroom, beans, tomato, egg and toast...and last and the most important..TEA....Absolute deliciousness. Hubby also liked his eggs benedict a lot. So all in all i am giving a 5 star based on the service, the breakfast and tea.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZUqfTKEi5NhTrLrmRPCRVw",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. Vegetarian Scottish Breakfast! Yummmmm",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZUqfTKEi5NhTrLrmRPCRVw/o.jpg"
      }
    ],
    "user_id": "RUfoCEdyNr-8IxWX5vDSgw"
  },
  "ZWQ3xlWZPRur_N0GzQS-hg": {
    "date": "8/27/2009",
    "text": "Essentially not a lot other than the colour scheme has changed here since it took on its current persona, apart from the Friday Happy Hour that looks to have bitten the dust.   Comfy couches, good, efficient bar service and a well stocked and varied bar are the staples.   4.50 for a large bottle of Grolsch? Pardon?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "txzOZrHK9EVY0kYjSuXkKg"
  },
  "VU13BwdLhIhna-c9ghCalw": {
    "date": "11/5/2012",
    "text": "Almost every time I find myself in Dunedin, I visit this very fine bar and fill my face with spectacular cocktails and sometimes some scrummy foodstuffs.  The food menu tends to be seasonal, but there are staples that never change much to the delight of patrons, and the cocktail menu is extensive and full of luscious libations to get you salivating.    If you know me, you'll realise that I do love a bar that will set things on fire (oh no, my inner pyro is showing), which is why I'm always so enthused to sample one of Treacle's Zombie cocktails!  Fire and rum...  YAY!!!  Make sure you blow it out before drinking, as a friend of mine almost lost her eyebrows that way.  Tis not for the faint of heart, but it is a firm favourite of mine.  If you don't fancy having a meal, you'll want to try the sharer platters.  It's not your average fare, and there'll be something to keep everyone happy and prevent stomachs from rebelling while you test your mettle against the cocktail menu.  I also like the cosy atmosphere, and the retro cartoons that are ever playing on the TV.  The last couple of times we were treated to the Samurai Pizza Cats and the Visionaries.  Fantastic stuff! ^^",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Y2BLJqGAtX3Eb-3PGBkeMw"
  },
  "oBw-wa5rAKEsK1YNExD1IQ": {
    "date": "7/6/2013",
    "text": "The best tomato soup I have ever had, hands down. My grilled chicken salad was also very tender and crisp, respectively. The wall decor is styled with Japanese anime and the TV was playing anime as well. Our waiter was so nice and helpful in giving us (tourists) recommendations on nearby attractions.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-dw8f7FLaUmWR7bfJ_Yf0w"
  },
  "56eYXUHo3s7Fu5qMtu2twg": {
    "date": "6/29/2017",
    "text": "Eclectic menu with crazy dishes, funky ambiance, and amazing service.   Treacle has a trendy, quirky interior with great table spacing. We came here three times and had outstanding food and service each time. On my first visit, I went with the tonkatsu banh mi, which was exquisite. The bread was the real deal fresh French baguette, Japanese panko breading was perfect on the pork, cucumber could be cut up more and pickled more plus could add pickled carrot to the mix. The presentation of the sandwich is a bit daunting - it required some fork eating to widdle it down to edible size with your hands. Chips (fries) were perfectly cooked, and with some self-seasoning and sauce, they hit the mark.   On a second occasion, I went with the Bibimbap with smoked salmon. Just outrageous flavor on the salmon and a huge amount of food packed into this regular sized plate.  Wife did the sweet potato and goat cheese spinach pie, which was delicious and filling, rich with goat cheese and flaky crust. Nice plating here on wooden cutting boards and a nice touch of putting the chips in a Belgian style frites basket. Cucumber water for the tap water was another nice touch.   Overall, highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "i9znFfcClbpdi7HGMwWJbg",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. Maple bacon waffle",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/i9znFfcClbpdi7HGMwWJbg/o.jpg"
      },
      {
        "img_id": "z6Z6I5oqgkdMzCh-1Ck_jg",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. Bipimbab with smoked salmon - outrageous flavor on the salmon. Huge amount of food. Delicious",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/z6Z6I5oqgkdMzCh-1Ck_jg/o.jpg"
      },
      {
        "img_id": "EBohNc16SpEjcAkIOwqD5Q",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. Tonkatsu pork banh mi - a bit tough to eat at first, but the flavors were phenomenal with excellent fresh bread. Outstanding!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EBohNc16SpEjcAkIOwqD5Q/o.jpg"
      }
    ],
    "user_id": "SUAFCKtkx8RrQ6EgJQIVrw"
  },
  "voCuiMnQRepom8wEgswscg": {
    "date": "2/5/2017",
    "text": "Great bar/resto on Broughton St. Friendly & helpful staff. Great for drinks, especially cocktails. The bar staff know their stuff.  Food menu looks good too. Haven't eaten here in a while but will definitely be back now I'm resettled in Edina",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "WfXXFayvH_zX7hwRv2tNig",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WfXXFayvH_zX7hwRv2tNig/o.jpg"
      },
      {
        "img_id": "0Iy4Jv7mxlRyxSCckgT0mg",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. Cocktails",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0Iy4Jv7mxlRyxSCckgT0mg/o.jpg"
      },
      {
        "img_id": "wQrj5vrrSdbzZZuP3N98jg",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. Sloe Gin Fizz, perfect in a cold day",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wQrj5vrrSdbzZZuP3N98jg/o.jpg"
      }
    ],
    "user_id": "R9UNH0rb3a_glQlk4ylKCw"
  },
  "qygmMeUCnK7z3feiqzMKHw": {
    "date": "9/12/2018",
    "text": "Stay clear of the burger! The meat is subpar. The salmon app is very good (we are in Scotland after all) and The coconut chicken wings were good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XpO2zJYphfP0EG0iGR7d_w"
  },
  "KW9dRM8MnrxzG7U3dNwmpA": {
    "date": "9/6/2016",
    "text": "Rumor had it that there was Vietnamese food served here. So I came, anxious for some good eats. But, what kind of place is this? Seems like a fusion Asian (Vietnamese and Japanese) with Western flavors. Not what I expected and I am not entirely sure the mix works.   Got the chicken breast bahn mi (traditional Vietnamese sub) and my buddy got the pork katsu bahn mi. (Note that pork katsu is Japanese.) The sandwich had some nice flavors, with a relish with a kick. But the breast meat was dry and without flavor. Buddy's pork katsu was amazingly tender. But like I said, not sure if the mix works.   May have to come back when my expectation levels are lower!",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "MYfVMhrrhwN6c8cSVVXHRA",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. Bahn Mi Chicken Breast",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MYfVMhrrhwN6c8cSVVXHRA/o.jpg"
      }
    ],
    "user_id": "4FxADcoBgm_8xqTyfmTIug"
  },
  "gcfUqEI4BB8Aervog2uw2Q": {
    "date": "7/14/2015",
    "text": "My cousins and I decided to grab a quick lunch here before heading out to do more sight seeing. The restaurant itself is cute and has a modern appeal to it.   I ordered the sweet potato and spinach pie. It was very tasty as the sweet potato and spinach complemented each other very well. The crust on the pie was divine and was flaky, crispy, and buttery! These guys sure know how to make their pies! I was in heaven.   The potato wedge chips that came on the side were not as good and were on the bland side. They were quite ordinary and needed some serious seasoning and flavor. These could have been a lot better. It tasted like someone just chopped up potatoes and put them in the oven without any preparation! They also seemed a bit charred too.   Overall, I'd come back here again for another pie and ask for a different side!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "fQrqIVko9Tf1sDRoOmT8tg",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. Drinks!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fQrqIVko9Tf1sDRoOmT8tg/o.jpg"
      },
      {
        "img_id": "vVdlzyx9BDurmZWAjofS_A",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. Spinach, sweet potato, and goats cheese pie. Excellent!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vVdlzyx9BDurmZWAjofS_A/o.jpg"
      },
      {
        "img_id": "w3UKdR7EmcD1wW9C6ui7xQ",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. Nachos",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/w3UKdR7EmcD1wW9C6ui7xQ/o.jpg"
      }
    ],
    "user_id": "ZLCJjYA9sYaK2zKBiyB5uw"
  },
  "kEgolxot32loWqRIplPNxg": {
    "date": "9/8/2017",
    "text": "Apparently redone and good for a decent lunch and beer. Some things to be desired but acceptable.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Du2Q0r9K_PI2Z53CRu4GfQ"
  },
  "WsRm0XM3ZRmAc_SxK7-Urw": {
    "date": "6/28/2015",
    "text": "Visited Treacle for a Sunday brunch and was pleasantly surprised. Really good food and coffee. Order the black bean burger and sweet potato fries. So good!   The place was really packed so make sure you make a reservation before you go otherwise it'll be a long wait for a table.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mixV3QB5YsKZCkXTvrGT7g",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mixV3QB5YsKZCkXTvrGT7g/o.jpg"
      },
      {
        "img_id": "1hWViLp5jMJh-q5_Dj_NuQ",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1hWViLp5jMJh-q5_Dj_NuQ/o.jpg"
      },
      {
        "img_id": "fn5sm38qS5EbBPiWkdnUTg",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fn5sm38qS5EbBPiWkdnUTg/o.jpg"
      }
    ],
    "user_id": "xt0a0WV7pDSSSUXpXs3YSA"
  },
  "CfsfzmkGVWNM64wwR_S79Q": {
    "date": "6/30/2016",
    "text": "Why 5 stars : - the service : really friendly, willing to advice you in your complicated choices of cocktails and quantity of food needed. - the cocktails : except two, all of the others were really fabulous ! - some of the food : the share plateau where everything was delicious, and the pad thai which was also really tasty - most of the prices are OK  Why 3 stars : - the place : I loved the banquettes and the sofa, really warm atmosphere and comfy, but I totally dislike the tables on the left (where we ate), because it was cold and not comfortable. - the cauliflower : thought it would be grilled cauliflower with sesame, and it was straight cauliflower with little toasted sesame. Simple cauliflower with industrial asian sauce.. Good to eat but not 5 worthy ! - also the price of the 1/2baguette banh mi was really overrated : 9 for not that many food. Maybe 1/2baguette would be more convenient for a main course !  Why 1 stars : - superfood salad : NO TASTE AT ALL. The dressing was supposed to be \"Ginger&blueberry\", but it had no taste, really, even tasted on its own, while ginger should be felt at least ! The additionnal chicken was cooked straight : nor seasoning at all, nor crispy nor anything. Really really disappointing... As the description sounded SOOOO GOOD ! - the cocktails : TANG GA BANH and PORTOFINO : both were really low in alcohol. The first one was just a gin&tonic taste whereas it sounded so much more creative on the menu. Both weren't not suggested by the barman.  Thanks to the feeling, the atmosphere, the cocktails and the bites I stole from my friends meals I had a 4* evening (nearly 5*), but when I think about reality, I can't for the moment, grated them more than 3*. I highly recommand the place, but try to take the sofa, and AVOID the superfood salad and the two cocktails I quoted !  En realite mon avis est moins tranche que \"3 etoiles\" car j'ai adore certaines choses et presque deteste d'autres...  Ce qui lui vaudrait largement 5 etoiles : - le service ! J'ai ete tres surprise par les autres avis, ici tout le monde a ete aux petits soins, gentils mais pas insistants, toujours volontaires pour donner des conseils (cocktails, quantite de nourriture, etc), que ce soit les deux femmes ou l'homme que nous avions ce soir-la ! - le plateau de starters : c'est le premier dans le menu, et tout est delicieux !  Il y en a assez pour deux, voire pour trois petits appetits par exemple, pour 14. - le pad thai tres bon et a un prix honnete pour le travail et la quantite. - les cocktails (sauf deux) qui etaient vraiment tres bons, parfois tres originaux, a des prix corrects ! Environ 8 pour la plupart.  La ou je suis mitigee : - la salle : autant j'adore le coin de droite : banquettes chaleureuses et la partie canape qui est juste geniale, autant la partie de gauche (ou nous avons mange) est trop froide et inconfortable pour moi. - le starter de CAULIFLOWER: ca avait l'air chouette \"sesame roasted cauliflower\". Moi j'avais compris ca comme du chou-fleur grille au sesame. En fait c'est du chou-fleur avec trois graines de sesame qui elles, sont grillees. C'est bon, mais ca reste du chou-fleur nature, en fait. Et la sauce est de la sauce toute prete qu'on retrouve dans tous les resto asiatiques et qui couvre completement le gout tout doux du chou-fleur (puisque nature). Aucun interet pour la sauce. - certains prix : notamment celui du starter de cauliflower (quasi 5) et celui du banh-mi (9) car il s'agissait de tout juste 1/3 de baguette ! Trop cher pour l'absence de cuisine du premier, et trop cher pour la quantite pour le second.  La ou je ne mettrais qu'1 etoile : - ma SUPERFOOD SALAD: elle avait du potentiel, en plus j'avais ajoute du poulet. Sauf qu'en fait j'ai rarement mange quelque chose d'aussi FADE. La sauce annoncee \"blueberry&ginger\" n'avait absolument AUCUN gout (pourtant le gingembre...) et etait vraiment en minuscule quantite. Le poulet etait simplement cuit \"a la vapeur\", aucun assaisonnement, aucune saveur ! Grosse deception. - les cocktails TANG GA BANH et le PORTOFINO : vraiment trop trop faiblement doses en alcools, et le premier avait simplement le gout d'un gin&tonic pour annonce bien plus elaboree que ca. (aucun de ces deux n'avait ete conseille par le serveur !)  Pour le ressenti de ma soiree, je mettrais bien 4 etoiles, mais vu que le contenu entier de mon repas ne m'a pas du tout satisfaite (et oui je cumule cauliflower ET superfood salad), je m'en tiens a 3*. Je vous conseille neanmoins d'y aller, l'atmosphere est chouette et tout le reste est super top !",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-bKKBMrBVVh3pXv6fWVveg",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-bKKBMrBVVh3pXv6fWVveg/o.jpg"
      },
      {
        "img_id": "IzfbgJ0yD4wCkzIr6wl5JA",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. My sherry amore",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IzfbgJ0yD4wCkzIr6wl5JA/o.jpg"
      },
      {
        "img_id": "rqX2sM8qwURj4r8XuuU1zA",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rqX2sM8qwURj4r8XuuU1zA/o.jpg"
      }
    ],
    "user_id": "nOJUg-lhmJf7I_BgdGKy2Q"
  },
  "t582u2Kmec81KYKoxpNisg": {
    "date": "3/18/2015",
    "text": "Monkey shoulder is the house whisky. If you have never had one, I would highly recommend it. It's one of the lesser known yet quite underrated scotch IMO. Blended malt but worth a glass of rocks.  Anyways, The food was good. The pies were decent but I was blown away by the desserts. Their fried brioche jam sandwich was incredible: crunchy with sugar flakes layer on the outside and sweet strawberry jam on the inside with vanilla ice cream on top. Mmm. I would've have appreciated more ice cream to be proportional to the big sandwich serving.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kcPOvMhRl0s1jNaattZnyg",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. Brioche jane sandwich with ice cream and jam",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kcPOvMhRl0s1jNaattZnyg/o.jpg"
      },
      {
        "img_id": "v9rZOyWn4nLruxJemZAVMA",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. Monkey shoulder on the rocks",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/v9rZOyWn4nLruxJemZAVMA/o.jpg"
      }
    ],
    "user_id": "TczHyShMdmAB7pHuMu5VeA"
  },
  "DEwUOGj-TnKH-cw35dW1WQ": {
    "date": "5/19/2016",
    "text": "Nice laid back atmosphere with food that's tasty and pretty to look at. The downside is the long waiting time for full meals.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SIvcj6xQfGTjy8TcrqT1dA",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. Vegetarian sandwich with soup and potato wedges.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SIvcj6xQfGTjy8TcrqT1dA/o.jpg"
      },
      {
        "img_id": "W0i5M-O1vmWozKOC_FXnnw",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. Ramen with prawns!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/W0i5M-O1vmWozKOC_FXnnw/o.jpg"
      }
    ],
    "user_id": "Q7fH0eiQbLyI8MDTLHU4aw"
  },
  "XawbKv7orIpqw6XIYnUeRA": {
    "date": "8/11/2015",
    "text": "*sigh*  If ever a place defined the phrase \"trying too hard\"...  Staff who barely look at you, and seem more concerned about comparing their tattoo collection than serving you your drink. Don't get me wrong - I love a random tattoo, but you know, give me my drink first, eh?  Drinks when they eventually come are served in trendy tins, which as cool as they look, had a hole at the bottom so you lost most of the drink. Which was then very slowly refilled.  I did like the 80s cartoons on the tele, but found it odd that not one member of staff knew what the toons were. Obviously there more to make the place look hip, than any genuine interest from the team working there.  Overall, I find more soul in a Wetherspoons...  (Their noodles are decent though)",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "SlSpryqL91enzQTEnIQ4yQ"
  },
  "KZJa54hHltT55OI8YhbbzQ": {
    "date": "1/9/2015",
    "text": "The plan was to come here for food and it had been highly recommended. Sadly I only made it for beers and I may have not reviewed  it at all, but I thought you yelpers deserve a warning.   First. Before the warning. It's a cool looking modern bar. Comfy seats and a laid back atmosphere. It does craft beers and has funky murals on the wall.   All sounds good eh? It is actually a nice place for a beer or two. The kicker in the story is the bill. Three bottles of Ipa. Ordinary size bottles. They cost 15.10. The barman might as well have had a mask and asked for our wallets!!!   So in sum. Nice place for a beer. Just be ready for the bill to be far higher than anywhere else on Broughton street that I visited.  Alright treacle?",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "J7Hl7OCQcFjmUerZhcwxOw"
  },
  "rPZnz5qF8CgEML2Nn9O-TA": {
    "date": "6/30/2014",
    "text": "We came here over the weekend for lunch - I had the pulled pork sandwich and my husband had the prawn. The food was delicious - would have been five stars, but the service was a little slow and we had to ask for menus. Other than that though this was an excellent choice for lunch, great food and reasonably priced - would recommend",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VQjCWy1qw0MLi9YP4HzhWA",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. Pulled pork sandwich",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VQjCWy1qw0MLi9YP4HzhWA/o.jpg"
      }
    ],
    "user_id": "hzHHNt4llWHcgyrYNEVywg"
  },
  "MDYNNs9ll5TZWM6D-IqF-g": {
    "date": "1/20/2015",
    "text": "Treacle is one of those places where I have a chip on my shoulder about it but can't understand why. Whenever I've been here I've had a good meal, drinks or catch up and the experience has been positive, so I'm not sure why there's this little voice in my brain going \"meh\".   So in short, my logic and reasoning says this is a good option for Broughton Street. It's always busy and has a buzzing atmosphere, the food is good and not too expensive, the service quick and friendly. The chef forgot to put noodles in my lunch on my most recent visit, but it was sorted in a jiffy and dealt with really well.   I would never choose to eat here though, and that's the shoulder chip kicking in. For no reason at all. It's a good place. So shut up, emotional side of the brain - there's really no reason for me to be turning my nose up!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 5
    },
    "photos": [],
    "user_id": "fcMTpwfLS9F5DWTqlp8ktQ"
  },
  "P2Lvh54fvKWG3yrFojzaBw": {
    "date": "7/9/2013",
    "text": "We had an hour for lunch, saw this place and just went in... OH MY GOD! 4 of us ate and no-one had food envy because all the dishes were awesome.  The beetroot hummus is AMAZING and so are the soups.  Definitely going back to try other dishes.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KsDuvLnQI1QHQZgdWfIeVA",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. Will with his veggie burger, fries and beetroot hummus",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KsDuvLnQI1QHQZgdWfIeVA/o.jpg"
      },
      {
        "img_id": "a7s8FAp7Cbx8sedEhGFzww",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. Smoked salmon cream cheese brioche with fries and a mug or veg and chilli soup.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/a7s8FAp7Cbx8sedEhGFzww/o.jpg"
      }
    ],
    "user_id": "2FatRNIv_ziqB0UFVvOJOg"
  },
  "6ma6bq9B1hlwFgg0z2-y5A": {
    "date": "3/16/2013",
    "text": "I enjoyed my Pad Thai so much all I could hear were the Nom nom nom's of my inner voice over the banter of my table. It came in a cute take-away box and if I hadn't finished it there I would have taken it home and laid it next to my pillow with a protective arm over it while I slept. 3 scoops of ice-cream for dessert: pistachio, chocolate and coconut - with actual coconutty bits - mmmmmm!  I was really impressed by the menu: full of familiar dishes but also food combo's I haven't heard of or seen anywhere else e.g. steak, chorizo and olive pie; and pleasantly surprised to see an Asian influence after expecting just typical pub grub.   The cocktails too are the funkiest I have had in the city and with an extensive menu, I'm so coming back to make a night of these!  I love how the food is served, the comfy cosy setting, music, artistic style and friendly staff. I love Treacle! I just wish it was bigger!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "RNIQdiN2RHamTGwdq6PXqg"
  },
  "p7jVVRnwx0zRmX-CXvzxSw": {
    "date": "6/9/2015",
    "text": "Nice, fresh, modern bar to which we called for a drink on an extremely sunny day. We opted for a bottle of prosecco and sat outside (it's a very small seated area) soaking up the sun. Pleasant place, staff and drinks but possibly lacking a bit in atmosphere for me. Close, but no cigar.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yNE7_6V-78CZ2cnmjO5mIw"
  },
  "4QAGdLBq7tVVH5VNsUeqHg": {
    "date": "5/22/2015",
    "text": "I love this place for grabbing a quick bite to eat before going to the cinema or to The Playhouse for a show.  The food is great and very affordable (the Sweet Potato Fries are amazing!) and the service is always really quick, too!  The only negative is it's quite small with not that many tables so I'd recommend booking ahead if you're in a rush to go somewhere else after.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "K4sa96QZrpK9fi5yQzNZXQ"
  },
  "p1SUl2RG1ERwnGuFXFt6SQ": {
    "date": "10/18/2012",
    "text": "The Treacle is fantastic and fun, whether it is for a relaxed and cosy lunch on the sofas, for working from here in the afternoon, for midweek evening drinks in a relaxed atmosphere, or for the extremely crowded after-work drinks packed with trendy young professionals on a Friday night.   I have come twice for lunch and really enjoyed the Chicken and Peanut Pad Thai with a whole chicken breast on top. It is really delicious. I was told they had experimented with a super spicy sauce for a while, but they are now back to their regular and manageable level of flavorful sauce, which is perfect for me.   I would come here to work from 'home', sitting at a table with my computer (although I don't believe they have internet) or sitting on the sofas by the door for reading/editing work.  I have also been twice for drinks. The cocktails are a bit pricey but often worth it since they are done so well and have a great (and long!) cocktail menu. The Peach Daisy was delicious and the Pina Colada was fantastic (unlike many bad imitations that you find in the UK).    I will definitely be back to the Treacle.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Jn-gjxoFtVTdc-4PQybYvw",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. Great cocktails!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Jn-gjxoFtVTdc-4PQybYvw/o.jpg"
      },
      {
        "img_id": "qaLU_UzZpsaCgH9YgvtM1w",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. The Welcoming Treacle - October 2012",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qaLU_UzZpsaCgH9YgvtM1w/o.jpg"
      },
      {
        "img_id": "6WPEwsID7dBX4AW4uYQgLw",
        "caption": "Photo of Treacle - Edinburgh, United Kingdom. October 2012",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6WPEwsID7dBX4AW4uYQgLw/o.jpg"
      }
    ],
    "user_id": "vvQhikDPjAzHfSLVgnFkPQ"
  },
  "LTEL_KBiR4Z00H8G3kQ1xQ": {
    "date": "11/4/2012",
    "text": "Treacle is much different than its counterpart, Hamiltons, in Stockbridge.  Hamiltons is where the beautiful people go for cocktails on a weekend night, Treacle is where equally beautiful people go but for brunch and lunch over the weekend.  so being beautiful people, Nikki A and i headed here for some lunch on a sunny Edinburgh Sunday.  i was pleasantly surprised on entering at just before 12:30pm that the place wasn't very busy and the very friendly (and cute) waiter told me to choose a table anywhere.  i happily chose a nicely placed table for two in the raised part of the restaurant.  what i like about this place is the stylish interior that is cosy and trendy but without trying very hard.  it makes me feel welcome but not that i'm entering a super hipster zone where i need chunky black glasses just for a fashion statement.  the menu isn't huge, but there is a large variety in choice and they serve breakfast until 5pm on weekends.  but i decided it was lunch for me and i went for the philly steak and cheese sandwich and a ginger beer with lime.  my lovely sunday lunch companion went for the veggie nachos with extra sour cream (a girl after my own heart!).  drinks arrived promptly followed shortly after by our food which was fantastic as i was starving!!  my cheesesteak sandwich was pack full of tender strips of steak cooked to a perfect medium rare with yummy melted swiss cheese on top.  the hand cut fries were equally as tasty and clearly freshly cooked as they were absolutely piping hot!  the plate was finished off by a lightly dressed salad that added a nice fresh touch.  i happily ate every last bit on my plate as it was just all sooooooo delicious!!  we finished our meal with some coffees...a flat white for me that was of similar quality to the amazing coffees from Artisan Roast!  it was thoroughly enjoyed and made me want to return to the restaurant again asap.  they also have a seriously awesome looking cocktail list that i may need to sample on my return...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Z_xbO-Iaxbx-ZRPhLJK-Ew"
  }
}