{
  "dMLdrB8nou5UezNJ7bWZug": {
    "date": "2/8/2018",
    "text": "Visiting Edinburgh and heard about Lazeez from a local. \"One of my favorite curry experiences,\" or something along those lines. Boy, was he right. This place is amazing! We ordered the set menu for two, and it included chicken tikka, veg pakora, dal, rice, naan, and two curries. They even threw in some chicken pakora for no extra charge. We got the order for take out, and it was still piping hot when we brought it home.   The dal makhni was on par with the best I had in India, and everything else was also excellent. If Lazeez were in my home town I would eat it once a week. 5 stars.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0KSUmATRbw17C4JyEs4m5w"
  },
  "hoPMpQwy1vxRtHpM_eShcQ": {
    "date": "1/3/2019",
    "text": "Really delicious food and a super sweet staff. If I was here longer I'd come back constantly",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1o089OR1ZGC_PYw3Fa83zA"
  },
  "Q6EmG1Oved5wfBDbrTMc9A": {
    "date": "3/20/2016",
    "text": "Stayed in Edinburgh for a couple of nights. After a stroll along Dalry Rd, I came across Lazeez Tandoori.  A warm welcome from the staff, & after a short, mouthwatering wait my wife & I were rewarded with the tastiest curries we've had for a long time.   The care and attention the Lazeez staff afforded the food, and the sit down diner, surpassed many of the other  restaurants that came before it.   Our wonderful meal was washed down with Mango Lassi's, with 'Gulab Jamun' (an Indian doughy sweet with a syrupy sauce).     Can't recommend highly enough!  10/10.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SYtqTewDw7Bi8eqkZCQblA"
  },
  "0vNVxElMIYq-pIqRbDeRUg": {
    "date": "11/4/2012",
    "text": "Brought up with a huge variety of Asian food, I do find it hard to be content with most of the Asian food I've had in Edinburgh (The boons and banes of being a Malaysian).   Strolling down the street one day, with my other favourite kebab stores either out of reach or not open during the time, I made my way into Lanzeez Tandoori! NO REGRETS!!  Slightly different from your average Edinburgh kebabs with mayonnaise and garlic sauce, Lanzeez has an Indian authenticity to it, which I enjoy.  The marinade of the kebabs has a herbal tinge coupled with an aromatic Indian tandoori flavour. If my Indian friends say that the food tastes very Indian, enough said.    Smells great, tastes even better!   Very affordable and other than its kebabs, has a wide selection pizzas options, biryani and other Indian/Pakistani type food. I particularly enjoy their maddenly sweet Gulap Jamun as a desert.   Since then, I've visited the place a few times and have always been pleased. While service isn't quick since good food needs time for proper preparation, the people at the place are very cordial. I've always had a nice chat with the staff there (Specifically the lady boss) while waiting.  When I am feeling lazy, their delivery option is good too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "VkOrDn_QYoq0x5E1OuqarA"
  },
  "qZwrGA6Ehyt4RVf9pW5HFw": {
    "date": "7/22/2010",
    "text": "Lazeez Tandoori is a great Indian takeaway which offers delicious food and speedy delivery at reasonable prices.  I ordered from here with some friends only two weeks ago and we were all in agreement that it was one of the best takeaways we'd had.  The menu is really well laid out with plenty of Tandoori, Biryani and Punjabi dishes to choose from.  I went for the lamb Madras which cost only 7 along with a portion of plain boiled rice and a naan bread. Delivery took less than half and hour and the guy who brought was friendly.  The Madras sauce was delicious with a great range of flavours and some pungent spice throughout.  The lamb was tender and there were absolutely no fatty or sinewy chunks in amongst it.   We'll definitely be ordering from here again and I really couldn't fault Lazeez on any front.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "AIPvkk78FHS8G0v0wJvNkQ",
        "caption": "Photo of Lazeez Tandoori - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AIPvkk78FHS8G0v0wJvNkQ/o.jpg"
      }
    ],
    "user_id": "yfXqZkU5iXE07GSHzdsQBA"
  },
  "wXMrds39zDRrhXGg1rCA0w": {
    "date": "3/28/2013",
    "text": "Had a take away from Lazeez. Very quick service and very tasty. If in hurry visit Lazeez.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "55LR1Tcz_NUb9aJg7QJK5Q"
  },
  "s0Elt-HDpomuPAKJkx7tOQ": {
    "date": "7/14/2011",
    "text": "We were visiting Edinburgh and were looking for a night in for a bit of a rest.  This place was down the way from our rental flat and had good reviews on Yelp.  We did some take-away and had the Veg Pakora and a couple of curries.  Big portions and delicious flavors were a winning combination for a night away from fish and chips.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "i9ycl0QkwHnyFmW3kJ_0pA"
  },
  "6_NMuByNNGmEXDwVMYHD2Q": {
    "date": "4/5/2011",
    "text": "Best tandoori mixed grill this side of the equator brilliant sometimes have to wait a long time for delivery but it's worth the wait.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-V3iXmuL568kFvfJKBXROA"
  },
  "tgb3DzxvqjES1qN59lrBHg": {
    "date": "7/19/2009",
    "text": "I dared to taste chicken tikka biryani from Lazeez take away - Dalry road.   I would say that none of the Asians would accept the dish as biryani. It is like pilau mixed with chicken tikka.   To non asians - please do not think that this the real biryani.   I never expected this kind of servings from Lazeez",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VUgYU55SfU6tY-7nAm9QyQ"
  },
  "dSJIS9bGUt0MCqs8YuYaRQ": {
    "date": "8/20/2009",
    "text": "i had chicken tandoori at this take away and believe me it was awsome!! This dish has good quantity of chicken and served with lots salad and naan!!   I think this small takeaway sreves best indian food in edinburgh and its quiet cheap as well. You can get any maincourse in just 5 pounds and all the dishes taste so well. Try the food here and ul luv it..trust me!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6WMy-2YGO9-49tYpnldeJg"
  }
}