{
  "MK83IW2diRKp48SYO_7ZgA": {
    "date": "6/19/2016",
    "text": "Got introduced to it by my colleagues in my new team! Lovely small place, great lunch deals, very tasty food, quick and friendly service.   I enjoyed the crispy beef with chilli and fried rice: excellent sweet and sour flavour, went well with the prawn crackers too.  Finally there was also the banana fritter as dessert: not the lightest in terms of sugar, but having been trained with Greek baklava, I managed well :-)   Definitely worth a try: 9.99 for three courses!!! (My crab soup was yummy!)",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "O9GLJgOwhF7AS6ehzCM0tw",
        "caption": "Photo of Lune Town Cantonese Restaurant - Edinburgh, United Kingdom. Crispy chilli beef",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/O9GLJgOwhF7AS6ehzCM0tw/o.jpg"
      },
      {
        "img_id": "Csc-Y9cT7X-H5py5r3A76A",
        "caption": "Photo of Lune Town Cantonese Restaurant - Edinburgh, United Kingdom. Chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Csc-Y9cT7X-H5py5r3A76A/o.jpg"
      }
    ],
    "user_id": "VPZ0UYhVW2ZkdT-mMQ4KLQ"
  },
  "hLTgpXdIRbeY7tG5J9jHRA": {
    "date": "11/16/2013",
    "text": "Nice Chinese in the West End of Edinburgh. Bit tucked away but still easy to find. I mainly go here for lunch as it is close to our office. They have a fabulous 9 three course lunch deal. Good tasty food and friendly service. On the occasions I have been here for dinner the food was been good and the price is good. Lunch times (especially Fridays) can get busy so best to book. When you first come in it look like a small place but there is also downstairs seating.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "duI9-_L6Sz7yh7nMVGJqLw"
  },
  "Qu2mBMq7wtiTnUThJlrCHQ": {
    "date": "7/9/2016",
    "text": "Yelpers, there has to be better Chinese in Edinburgh. Three of us gave this a try based on the five star reviews. We were seated quickly, food arrived fairly quickly, but trying to get service beyond that point was tough. I swear we were walked by several times while the table next to us clearly heard our attempts. The food? Ok but not great. We tried hot & sour soup, pork buns, fried rice, chicken with vegetables and chicken with mushrooms and onions. The food arrived hot (rice is extra). The broccoli in the chick/veg was so tough I had pieces I could not bite into. Send it back? That would have required service. Other than that, the flavor was alright, not great. It looks like they do a good business and were taking reservations and take out orders. Me? I'd keep looking.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9MZDbeK6PGnueThPdP02UQ"
  },
  "oqP7PHMJ8SPN_mwUd0hG8g": {
    "date": "10/9/2007",
    "text": "My favourite cantonese resturant in Edinburgh, fantastic business lunch on offer with full menu an option. Best to book in advance for Friday lunches and weekend dining as the restaurant is busy at these times and the seating is limited. A good variety of seating arrangements and can cater from couples to large(ish) groups",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dqji5fRROkLc3eNMMQOI_Q"
  },
  "UeOUVWKsofRcQLreUcnO5A": {
    "date": "7/29/2011",
    "text": "The best Chinese Restaurant in town. No doubt. Particularly liked the sizzling beef szeuchan style. Been going for years now and still never disappoints! Price is great also, an all round great meal!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SU-lfCpPCCit7LHq8qvERA"
  }
}