{
  "PtbXA_nTtjQpHOOdyb4kbg": {
    "date": "3/2/2017",
    "text": "I went to Wolfits to get myself a fast lunch late one day a while back.  I was pleasantly surprised by the quality of the food.    I ordered a red onion panini and the Thai red chicken soup.  The soup in particular was quite good - it was well seasoned, and the chicken was good quality meat.  You have the option to get your food to go or stay and eat there at no extra charge.  I decided to stay and very much enjoyed my lunch.  I'll be back!",
    "rating": 4,
    "rated": {
      "funny": 9,
      "useful": 9,
      "cool": 9
    },
    "photos": [],
    "user_id": "KGpmy60EA7e9DO9ICRbSNA"
  },
  "bH2BmX5Q5ep1m_uG2XC65A": {
    "date": "5/16/2017",
    "text": "Been going to this place for lunch on most weekdays for the past year and the quality has bee steadily declining. It's now to the point where I'll never set foot in the place again.  They've increased their prices while quantities given in the salads are laughable (salad box is barely half full). Staff seem to have forgotten how to smile, but mostly the quality of the products is simply too bad to pay for. Never again",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TCbOUpK-_7h1l8ZR-lrECQ"
  },
  "kOwO3EBBjc4n6sC5Un9sNA": {
    "date": "1/22/2016",
    "text": "Great little sandwich shop if you're in the area - make sure you're prepared though, it's cash only! The set-up is a bit confusing - there's no list of filling options anywhere, and items at the counter aren't labelled, so you essentially have to ask what everything is. Once you ask though, you'll find there's a very nice selection of fillings. I bought a toasted wrap with cajun chicken, crispy bacon, applewood smoked cheddar, rocket, pesto, and cranberry sauce. Delicious wrap, and only 3 (much cheaper than many of the spots nearby). My co-worker got soup and said it was quite nice as well.  Certainly will be going back next time I'm working nearby, and certainly recommended!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "mY7AWgtA90KQXxKhFAhC5g"
  },
  "eMah2tTWVwubjfS50_Ml8A": {
    "date": "3/3/2015",
    "text": "Honestly, I'm surprised I've not got round to reviewing Wolfits yet as I'm in here often enough!  Wolfits is one of those lunch places for office workers where you can order a sandwich, a baked potato, soup, or a big bowl of salad. They have a pretty decent selection of fillings too, much wider than a lot of similar establishments, which is what really makes Wolfits a good choice at lunch time. Not to mention the portions are very generous, a salad bowl could easily do you two lunches and the number of additions you can make is huge.  More often than not I pop by and pick up a soup. I tend to veer towards lentil, or lentil and bacon, and 9 times out of 10 it's a tasty, thick soup. Coupled with a buttered half baguette and I've spent less than 2.50 on a really filling lunch.  Due to its superiority over other make-your-own-sandwich shops, it does get very busy around 1pm, but the queue moves quickly as there are usually several members of staff on hand to help. It's definitely going to be my 'go-to' place for a quick lunch so long as I continue working in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mqg4L8flJmg8pqeR-uYyRg"
  },
  "0szjr98dCMyFc4d_dUeqhw": {
    "date": "7/23/2010",
    "text": "I do love a good sandwich bar.  There are loads springing up, along the lines of what is provided by Subway and Baguette Express.  Wolfits, on Rose Street, is one of these.  They offer a wide range of sandwiches, paninis and wraps, all made fresh on the day.  They can also make these to order.  They also do other hot food, like breakfasts and bacon rolls, so will cater for most of your snack-based needs.  Prices seemed to be reasonable, and the range of fillings and things available will easily compete with some of the larger high street chains.  I suspect that this is the sort of place that will get heard about by word of mouth, and that you will want to keep visiting.  I only sat in to get out of a heavy rainstorm with a refreshing drink of, funnily enough, water.  This gave me ample time to have a look round  the shop, and take in what was going on.    I was very impressed - clean and modern with a great range of stuff to eat.  Give them a go if you're ever on Rose Street and need somewhere to eat.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0xA9kzGm39J2xIRm44a6mQ",
        "caption": "Photo of Wolfits - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0xA9kzGm39J2xIRm44a6mQ/o.jpg"
      }
    ],
    "user_id": "v_lWueG7V_vul4E8rCEdjQ"
  },
  "ZrTzQnI7JoeV8hpPs-_o0A": {
    "date": "8/19/2010",
    "text": "Wolfits is competing with many sandwich bars in this area, but it does a bloody good job!  Selling sandwiches and panini's etc, Wolfits manage to cater for an amazing variety of tastes by offering fillings from brie to salami! You can opt to keep it plain and no frills or you can deck your sandwich out in loads of healthy and continental fillings. They do salads with a number of garnishes too if you are looking to get some of your five a day.  If you really don't fancy being healthy, they also have a huge selection of temptingly cheap breakfast rolls. If you're going to go down the fry up road, you might as well get a double up. Go on, treat yourself!  Teas, coffee's and hot chocolates are all cheap and tasty. The staff are efficient and although this place is busy, indicating that it's good, you're not left hanging around unassisted for too long. More upmarket and contemporary than a lot of sandwich bars, Wolfits nevertheless offer hearty, simple rolls. A safe bet for any hungry citizen of Edinburgh!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qtZgDkWBIK4ZxUSVNC5Bsg",
        "caption": "Photo of Wolfits - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qtZgDkWBIK4ZxUSVNC5Bsg/o.jpg"
      }
    ],
    "user_id": "5iRCT4uAsyP1UoEUoxbylA"
  },
  "XyGzGXb1l_cpxR6fbbXXJA": {
    "date": "7/25/2010",
    "text": "Wolfits is one of many sandwich and salad bars in Edinburgh, but it is worth a visit. Situated on Rose Street, Wolfits is right in the centre of the city and it is just around the corner from the main shopping area in Edinburgh, Princes Street, and so it is a convenient place to reach.   They serve a whole range of sandwiches, baguettes and rolls, as well as lots of salad options and soup. I have been here several times over the last few weeks to buy my lunch. They have a deli type section displaying a range of filings such as meats, cheeses and salad. I have played it pretty safe here and stuck to their steak and cheese baguette, which is really tasty and very well priced at less than 3! Breakfast rolls are also available here so it would be a good place to stop by for a bacon roll in the morning.   This store is pretty much an extension of the big sandwich chains such and Quinzo's Subs and Subway, but if you want to buck the trend and buy your baguette from a local business, Wolfits is definitely the place to go.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_r5onZdlc1txEgtfpfLeAQ",
        "caption": "Photo of Wolfits - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_r5onZdlc1txEgtfpfLeAQ/o.jpg"
      }
    ],
    "user_id": "OdUSlS-S6qfZFnDUCKzwEg"
  },
  "-diKnBXkL5N0-2FfpEpbbg": {
    "date": "11/14/2011",
    "text": "I spent my honeymoon in Edinburgh in September. We stayed at the Caledonian, so we found ourselves strolling down Rose St. every day. After two days of passing, we decided Wolfits looked like an easy bite to eat one morning. It was difficult to tell what we could actually put on our sandwiches--where were the labels? Our sandwiches were good, although my silly husband thought it would be a good idea to drink coffee and put jalapenos (chilis in Edinburgh terms) on his sandwich before starting out our day of exploring on a unseasonably warm day. \"Sweat, baby, sweat\"  I got my dose of UK gossip as I flipped through a trashy newspaper and watched music videos on the TV. This is a nice little stop if you need a sandwich, soup, salad or coffee.  Alas, there isn't wi-fi.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "VVBzicjxYIhE2RR3nUfOTA"
  },
  "B5Lh1WLYQeWE4VkJkl7ikg": {
    "date": "8/8/2012",
    "text": "So far so good. I've been here a couple times, firstly because i was very hungover, wanted a panini and couldn't find the place i was planning on going so i went here.  I asked for a bacon, brie and cranberry panini, but they were out of paninis (it was about 3pm so this was fair enough), but she gave me a couple of other options and i had a toasted baguette instead. No complaints at all and it was delicious.  Second time was on my lunch break at work. I asked for the same again (creature of habit) but this time they didn't have any brie. I was a little saddened by this, but i prompted them for substitute suggestions and we decided upon mozzarella. It wasn't the same but still tasty.  It is pretty much like most sandwich shops, they the staff are lovely and friendly, prices are fair (panini was 2.85) and there is a wide selection to choose from. So far so good anyway :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HV24bliLib6FuMW3bWBrpQ"
  },
  "SJy2itO-pHgVflrCa096_Q": {
    "date": "11/10/2011",
    "text": "Having worked in various locations around central Edinburgh over the years, I like to try out the local Sandwich shops that cater to my lunchtime needs, and out of them all, Wolfits gets my top spot.  Now, this isnt fancy dining, this is soups, sandwiches, salads, paninis, baked tatties etc, so it's simple food, but I constantly have my mind blown at how easily people cock this type of thing up.  There is a lot of competition in the area, from similar independent shops to chains such as Pret, Baguette Express and Boots.  Where Wolfits excels is the quality and variety of the ingredients, the professionalism of the staff (hygienic, friendly, efficient), the presentation of the results, the size of the portions and the price which all in all offers great value for money.  They have a variety of soups, all thick, fresh and tasty which is a welcome change from the watered down nonsense that is all too common.  They have a variety of sandwiches and salad pre made, but they will custom make anything you want, and have a range of rolls/baguettes too. For both the salads and sandwiched there is about as big a selection of salad and deli items that you could want (all laid out for you to easily see) along with a good range of dressings too.   There's nothing mind-blowing about what these guys do, they provide the same breakfast and lunchtime staples that a thousand other bushinesses in Edinburgh offer, the difference is the variety and quality means these guys do it better than just about anyone else.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tQuEVOwokhp63Xl6wEvmqg"
  },
  "rVzkowRij9xnd8Ki4ZSowQ": {
    "date": "2/6/2013",
    "text": "bacon and egg rolls.  brown sauce.  yum.  (as you can probably tell, i've yet to try a sandwich from here... )",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NIwD0clhd0rAgCOOUeLoFQ"
  },
  "795D6Kn90qMnbwIcY2qMhQ": {
    "date": "10/11/2011",
    "text": "I used to make this my regular lunch stop when it first opened!  The soups are not what they could be, the fillings all rather dull! Just not very bexciting or special if i compare to the like of Bread&Olive.  Needs a good kick up the backside in my opinion!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rl4hqDnywPJDCK4wfbXMzg"
  },
  "ZQKwnkKN1yIsX01c3k0Iig": {
    "date": "3/18/2009",
    "text": "Of the many sandwich/baguette/roll shops in central Edinburgh, this one seems decent enough. The only things I've tried are the steak baguettes - well priced at 2.95 and they avoid falling into the steak so tough you need a lion's jaws to digest them trap - and one or two of the paninis and fruit salads.   I certainly go here quite often.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7vJT5yNQwoz3AGDzYdj1cA"
  },
  "3LE0TnLSwLU3E3ge0jIDAg": {
    "date": "3/17/2011",
    "text": "A great sit in or take away sandwich place. As well as the usual paninis and baguettes they have soup, salad boxes, fruit salads, baked goods coffee and tea. I go here for lunch most days, and it's easy to get something healthy and delicious so a guilt free lunch is had. They are always generous with the helpings and really friendly too. I try to avoid the 1 o'clock rush though, it does get busy, despite being pretty quiet the rest of the time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z1ii0twHk0G4CHszyYAdAg"
  }
}