{
  "OI0e17xjx4od87IEHefclQ": {
    "date": "12/31/2008",
    "text": "How do I love thee, oh Potatoland, bringer of potato based goodnesses to myself on cold Edinburgh nights? How can I explain the feeling that courses through my veins as I see your twinkling light from afar, feel the warm air blowing from your air vent and smell the fluffy, alluring aroma of baked potato? Your staff remind me of characters from Charles Dickens novels- so small and humble the girl is, so greasy and rotund the man, so angry and scowling the older lady- and your wares remind me of why everyone loves potato. The chilli and cheese is my particular favourite, although there are toppings fit for the kings and queens of various countries available in your abundant glass fronted counter; prices are all under 5, most under 4 [although my decadent choice comes in at 4.20, expensive for a potato, not expensive for the potato love that comes with it].   The ONE thing I will say against the land o'tatty is this- the opening hours are terrible; lunch 12-2.30, evening 5.30-10?? And closed on a Sunday??? A Sunday?? The Lords day?! Potato day!? Terrible. Still, all in all, I love Potatoland, so I can forgive it for not loving me enough to be open 24/7.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GbrjLXBt14r_5QxJh25U_Q"
  },
  "FrivbbQEwgCMT9Kxw8iAiQ": {
    "date": "8/5/2010",
    "text": "It took explorers years to finally discover the fabled Potatoland, but now we finally have it marked on our maps. Of course the motivation behind the expeditions was always to find a supply of cheap, convenient, filled baked potatoes, ideal for lunch. And that is just what Potatoland offers.  Whats that? You say you want potatoes? Try Potatoland! Truly a land of potatoes. Affordable, crispy jackets filled with filling that oh-so suits a potato.  Potatoland at the end of the day is a place where you can satisfy your tattie desires. It's not high end cuisine, but then neither is Finland and look at their visitor numbers.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "V83CmD1Rtm8KlacBiYWJVQ",
        "caption": "Photo of Potatoland - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/V83CmD1Rtm8KlacBiYWJVQ/o.jpg"
      },
      {
        "img_id": "zSys3Kf0Y8oo2rbmxpYcXQ",
        "caption": "Photo of Potatoland - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zSys3Kf0Y8oo2rbmxpYcXQ/o.jpg"
      }
    ],
    "user_id": "PEN-Ttdt8r2MEk6Q5CnYbw"
  },
  "v1Pw_IujxmNks2hodNWrkw": {
    "date": "3/27/2013",
    "text": "Ah, Tatty-L. One of the wonders of my youth, and still standing today.  Excellent wee treat of a takeaway for those looking for a moderately more healthy option. Just a pity they are so out of the way, situated at the tail end of Newington, just round the corner from Los Argentinos and across the road from Reverie.  Probably not worth going out your way for but a tasty option should you be in the area, and at affordable prices, with a quick turnaround, you need not ask for more. Toppings are plentiful in options and serving, staff are pleasant and prices reasonable.  Good grief, just writing about it's got me hankering for one!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9RGIvzCGHp8ELF_JgAlbZA"
  },
  "An7cfm4h91hyOuBhsk1diQ": {
    "date": "6/30/2010",
    "text": "The baked potatoes from Potatoland became my staple lunch when I was in first year at the University. I find it impossible to resist the delicious potato smell wafting from the shop on my way home . The staff in this shop are efficient and incredibly friendly and didn't make me feel awkward about always going in for food (like some places have!) The baked potatoes are inexpensive and are incredibly welcome on a cold and wet Edinburgh day. There is a reasonable selection of fillings for the potatoes, but the choice is not as expansive as some of the bigger potato shops in the city.   It is shame that Potatoland is rather tucked away and at the far end of the busy Nicolson Street as I am sure it would have a much higher trade if it was more central.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "TEWhfNbiFV4OgtSOzRecuw",
        "caption": "Photo of Potatoland - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TEWhfNbiFV4OgtSOzRecuw/o.jpg"
      }
    ],
    "user_id": "OdUSlS-S6qfZFnDUCKzwEg"
  },
  "FcDoP4fOm-29P5jNsDBnZw": {
    "date": "4/20/2010",
    "text": "Why do baked potatoes smell so good especially when the weather is grey and cold?   The potatoes are here are good, with crispy skin. However, there isn't a great selection of fillings ( we have been spoiled by too much selection in chains!) However, the people who work here are friendly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SaSbeIDe9VIMdJq1fkhOaw",
        "caption": "Photo of Potatoland - Edinburgh, United Kingdom. Potatoland at night",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SaSbeIDe9VIMdJq1fkhOaw/o.jpg"
      }
    ],
    "user_id": "nhVvcPyRGLw466qHVbUjrA"
  },
  "9j1fcWoY--pJHAo5sx9fSw": {
    "date": "4/20/2010",
    "text": "I defy you not to walk past Potatoland, at any time of day, smell the smell of delicious baking potatoes and not feel instantly hungry.  I do feel sorry for Potatoland though, I have only ever come in here out of convinience - prefering to go to other baked potato based places to eat if the option is available. I think the preblem is that the place just lacks a few little things that could make it so much better. It has few fillings/topping for it potatoes, and the ones that they d have are pretty basic - cheese, beans etc. Its also very 70's when it comes to its decoration - frankly making mke want to take my meal somewhere else for fear of growing a mullet and buying flared trousers.  Regardless of this, the potatoes are always really nice, and cheap too. The smell is great too though.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "SxV1Jq7UANuSYpn42JXvOA"
  },
  "n5xIDwys1RA07QLTr9KtWg": {
    "date": "5/31/2010",
    "text": "If there is one thing which certainly gets the thumbs up from me it is generous portion sizes.  Thankfully Potatoland fufils this essential criterion as they only sell big, man-sized, crispy-skinned, fluffy-centred potatoes.  Both times which I went in my first year I got my potato filled with a generous helping chilli con carne which was delicious and easily sufficed for a lunchtime meal on its own.   There is, however, room for improvement in Potatoland.  Being nestled away deep in the tail end of Clerc Street it is up against serious competition and, in my opinion, it would benefit from several key adjustments.   Inside the place it feels dark, dour and almost cramped.  Further, the selection of fillings just isn't adequate when compared with some of the sandwich shops nearby which are also baying for customers.  Chilli, beans, cheese or tuna mayonnaise were some of the only options available and one can't help but question their lack of imagination.  Nonetheless, Potatoland is a great little business which should be worthy of competing with the best in the area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9SKNCjHcxs7JKMBpnK7W5A",
        "caption": "Photo of Potatoland - Edinburgh, United Kingdom. Potatoland",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9SKNCjHcxs7JKMBpnK7W5A/o.jpg"
      }
    ],
    "user_id": "yfXqZkU5iXE07GSHzdsQBA"
  },
  "Wobq9WTWkZrpyZ7np0ojGA": {
    "date": "4/5/2011",
    "text": "I am such a fan of potato land! I have to walk past it every night on my way back from work and I'm nearly drawn in every time by the yummy smells that waft out the door. We regularly have baked taties from here and would recommend them loads. They even often their amazing garlic butter with their tatties instead of normal butter and it's AWESOME. They are really good with helpings and don't just give you a few strands of cheese. We totally recommend their beans and haggis tattie or a prawn mayo and garlic butter tattie. MMMMM, I might just go for one now!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YE3F5cZTR_xBGZC1VdRy2g"
  },
  "HeQPnDZMRzgj-v1Dr8xizw": {
    "date": "5/12/2010",
    "text": "Hot Baked potatoes in the Potatoland are a re True experience. I live next door and could not explain how grateful I am to the staff who bring such tasty filled potatoes to miserable hungry customers like me. The place has a very limited seating area but to make up for it it offers a very delicious food and a range of drinks. The staff are friendly and really fast.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hqZiOnwZ3J1s7piCBUN6Ow"
  },
  "shBun8Ci5fmAJWsIjueWjg": {
    "date": "11/28/2009",
    "text": "Had 4 attempts to get a tattie here as I went too late for lunch, the next time I was too early for dinner and when I finally thought I'd sussed it they had no tatties left... and advised I would have to wait an hour... So I tried a 4th time and got my tattie!! Whoop woop!! It was tasty, but I would not rely on this place as you never know what'll happen.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "utymPwB_ESYxPzgz7Yh-IA"
  },
  "N_CYcllxX09a40sZFDwApQ": {
    "date": "12/8/2008",
    "text": "My favourite baked potato shop in Edinburgh!  Very tasty potatoes, with a good choice of fillings from the classic options of cheese, beans, coleslaw etc. to the more adventurous chilli con carne and haggis. Good vegetarian options too. They give you the option of plain or garlic butter which is nice. Prices range from about 2.50-3.50 for a generously sized portion (they often give you two potatoes if the first one is small!). The only down point is frustratingly they often seem to run out of potatoes or you have to wait about 15 mins until they are ready - but I promise you it's worth it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MnOHHaVMAEj1Mh9WRKbpSQ"
  }
}