{
  "e8daOmIH-jWWZqJ1MjTu7w": {
    "date": "11/18/2008",
    "text": "I quite like this place as i like its ice cream.It has a great cafe for eating and ordering meals upstairs.Staff are polite and helpful.Nice food and ice cream.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yI4LI8-aYYUS9MmrfpidMQ"
  },
  "Kde7_2hEWUKWvRT8tIoNCw": {
    "date": "11/19/2008",
    "text": "S Lucas cafe and ice cream shop is on several easy to reach bus routes along Morningside Road. The downstairs shop is a sweetie lovers dream. Here you can buy gourmet chocolates, old fashioned sweeties like my favourite cinnamon balls, and the delectable Lucas ice cream. The very best flavours Lucas do are the vanilla and strawberry ice creams, simple, but surprisingly tasty. Don't neglect to try their interesting sorbet flavours though. Our favourites are kiwi, mango, apple and the very scottish Irn Bru flavour! Upstairs there's a lovely affordable cafe where you can purchase ice cream sundaes, don't miss the knickerbocker glory!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xBZ1_3ylm3hf3VQHZ3ApFw"
  },
  "Zrsbw88XHT9TjS8JFsrhiA": {
    "date": "5/22/2009",
    "text": "This is such a great place! They sell amazingly wonderful ice creams and sweeties downstairs, but if that wasn't enough there's a food bit upstairs that sells really good value meals. I got an all day breakfast for about 5, which is rare these days   Bright, airy, and child friendly. Service is fast, and the food's good value. What more could you want?   PS There's a picture of Tony Blair here Because he ate at Luca's once. You can sit where he sat!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DG3mdYJJ8oLTQum14YMbjQ"
  },
  "stqdJHLSfohHmI1of8BnJg": {
    "date": "11/15/2008",
    "text": "When it comes to ice creams, S. Luca of Musselburgh is a very popular Edinburgh institution. This parlour, on 16 Morningside road, always seems to live upto this popularity, and does a brisk trade in not only ice creams, but food and drink as well. There's even a photo of Tony Blair dining in the establishment several years back to attest to its status as an iconic Edinburgh eatery. And not without reason, as the food is fresh and tasty prepared in the open plan kitchen and served very promptly. But let's not forget the ice-cream, which although expensive, is very well-made and pleasantly different from the usualy supermarket and branded ice-creams most of us are used to. Try the sundaes if you don't mind treating yourself a bit every so often, or just get a takeaway cone if it's a rare warm sunny day in the city.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-BJTaybCScNgY73ph1TE8Q"
  },
  "mHOkoCkqTcqrTNS4sT6Ypg": {
    "date": "4/20/2010",
    "text": "If its good enough for a visit from Tony Blair, then its good enough for me.  Peeking through the window at the vast array of truffles, jelly beans and ice creams I felt compelled to taste at least one treat (although one treat always leads to another, and indeed it did!).  S. Luca cafe offers something of a sensory overload: A rich spectrum of colour, wafts of sweet smells, and an assault of flavours.  With a spiral staircase leading to its upstairs cafe, you can take your counter bought delights and sip and coffee or two.  But be warned, the cafe menu offers more tempting dishes: The Amerena Cherries Ice cream special will leave you in a trance like state of indulgence.  Being a haven for sweets you can expect the occasional swarm of giddy children running amok, so don't expect a quiet treat for two.  Nonetheless, those with an insatiable sweet tooth will be in a frenzy over an S. Luca logo marked bag of truffles including such flavours as butterscotch, Amaretto, Champagne Milk and many more.  The only thing missing was Willy Wonka himself.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "NwcAfMH_4jeFE8gZu5PyIw",
        "caption": "Photo of S Luca - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NwcAfMH_4jeFE8gZu5PyIw/o.jpg"
      },
      {
        "img_id": "aEGTA9bvZBcg8KTCc3r70Q",
        "caption": "Photo of S Luca - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aEGTA9bvZBcg8KTCc3r70Q/o.jpg"
      },
      {
        "img_id": "wKtv079gae6TDw6TT5ucUQ",
        "caption": "Photo of S Luca - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wKtv079gae6TDw6TT5ucUQ/o.jpg"
      }
    ],
    "user_id": "UvIb5v3biEgcxWKnxf0ocg"
  },
  "RdqUyDWH75--fc9OblxJFw": {
    "date": "4/25/2008",
    "text": "My children, friends and I particularly like this cafe. One of two, other in Musselburgh. Famed for its delicious (but rather expensive I feel) ice cream. The Morningside cafe is fabulous, and food is amazing. Their chips are the best in Edinburgh!!!!! Definately recommend it. Its doesnt do my 'diet' any good when I go there tho they do have healthy options. Often have to wait on a table but boy its worth itx",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FO0mjWGV3Z1mBRvdxCAwPA"
  },
  "3kQLxa9oMWuJxwsW4U5yQA": {
    "date": "5/14/2012",
    "text": "Wow S Luca sell the best ice cream i've tasted, especially their nutella flavour!  Yum yum yum!  You won't regret searching out this shop! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XF4uZb_yscXCYcRCALFymg"
  },
  "E3u55wX-YpE9hJaVozQjrQ": {
    "date": "7/8/2010",
    "text": "As a grown man who for employment purposes frequently wears a shirt and tie whilst strolling round the capital, I probably look a little odd whilst supping on an ice cream. I don't let it stop me however, and wherever I see such frozen, creamy manna on sale, I find it impossible to control myself.  My usual double cone with flake tasted magnificent from S Luca, and on my second visit the coconut flavour I went for really was a joy to behold. Tremendous as it is, I'm not 100% sure it's actually all that much better than everywhere else as some of my fellow scribblers seem to think, but as an avid icy lover I'm possibly just not that picky.  Very nice, borderline opulent surroundings, and located in what  is the dictionary definition of a leafy suburb, it does pretty much everything right.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "xXQTdJXPGOP-NUYctcQw8g"
  },
  "WIkXJMDXUbN0GIuDdMTTTA": {
    "date": "5/7/2010",
    "text": "My mother always claims to be 'not an ice-cream' person. However, having taken her to St. Lucas, I think she might have changed her mind.  This amazing shop sells. Without a doubt, the best ice cream ever - and there is such a large selection of it too, from traditional flavours like vanilla and chocolate, to more modern (and Scottish!) flavours such as Irn-Bru Sorbet. Yum! On sunny days there are literally queues out of the door and around the corner, it's that good! St. Luca also houses a small cafe, and downstairs a counter selling some very tempting chocolates.  My only concern is the size of those queues, it really can take the edge off a desire for ice cream having to wait for 15 mins to get served! Over all though, amazing.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "SxV1Jq7UANuSYpn42JXvOA"
  },
  "F72LfAfSEBIiyOBXKUM9Mw": {
    "date": "2/23/2011",
    "text": "This rating is solely for their ice cream.   I moved to edinburgh over 8 months ago and been asking about a place that makes fab. ice creams n almost everyone referred to luca's ,so i went there and i was absolutely disappointed , there are few uncreative flavors , we had four different scoops and each and everyone was just awful!  they all tasted like full fat milk with a hint of whatever flavor they were supposed to taste like!   seriously how could people have such a bland taste to ICE CREAM! haven't they tried haagen daz? or any real gelatos?!   anyway i think they have a cafe as well but i did not try it so i cannot judge!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f0ODldmlswlM4YMSYZMB2g"
  },
  "brNwCLx-GSAYh56GuvBD0g": {
    "date": "7/14/2010",
    "text": "When I lived closer to the Morningside area, I used to come here after playing tennis, to scoff down a panini, and then top it off with an ice cream for good measure. I mean, how can you come here without selecting yet another exciting flavour of ice cream? Italian ice cream is awesome, and that's a fact. You could say that coming here and consuming high amounts of calories defeats the purpose of playing an hour and a half of tennis in the first place. Well...that's probably fair enough, but you have to have some incentive to aim for when you're killing yourself running round the court.  S Luca is always busy, busy, and lunch time sees an influx of mothers, children, and babies, although you do get students from the university up the road too. The children running about and the babies wailing I'm not so keen on, being the most not maternal individual of all time, sorry if that sounds harsh, but it's just an honest reaction. This doesn't take away from the fact that the food is tasty, with a great lunch menu served in the cafe upstairs, from sandwiches, paninis and soups, plus there's the ever appealing option of tucking in to an ice cream from the gelateria downstairs.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Mujjzv-ZH6HhxT-hWCpVg"
  },
  "ec4kfnEpMtawZMkFEvifNg": {
    "date": "11/15/2013",
    "text": "Not Willy Wonkas chocolate factory unfortunately but still still yummy. Just stopped in because I had some time and I have been past this place a million and ten times and have never gone in . Place is nice and clean and had a good variety of chocolates. I decided on the violet and rose truffles as well as a chocolate mouse ( no harry potter chocolate frogs unfortunately ) anyways the gal was real nice who served me so customer service was good. The chocolate was not bad at all, the two truffles tasted just like the name of them Rose and Violets. The Violet was not to good in my opinion, tasted to much like soap so maybe the flavors in that one need to be toned down so you can taste the chocolate. I will stop in again when I have more time as this was a rush when I went in I should have browsed more but oh well. Try the chocolate mice, they are remarkably well detailed ( hope there not real mice haha) .",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "VdAFcSPJgMvCAmp869X2gQ"
  },
  "JCvksjYrHZv46s2kaOqJkQ": {
    "date": "7/9/2010",
    "text": "You see this shop, and you can't resist - you want to treat yourself.  Your taste buds are telling you you need this ice cream, and now I am signing up to the list of S Luca's merry fans - it's outstanding. Offering creamy, traditional ice creams in a number of flavours and styles, it's worth making the journey to Morningside for.  As Eleanor said they have a sit in area, where you can get teas, coffees and light bites, but as the ladies and gents also said you can't come in here without purchasing something sweet. It's what S Luca is here for, and the ice cream is perfection. Soft, a little bit chewy and fresh, it's unforgettable. I would recommend the chocolate, but I can imagine their other flavours are just as impressive.  A perfect way to end a sunny day, S Luca's ice cream is also tasty in winter. They sell lovely confectionary too, from homemade chocs in Arran to Lindt bunnies. I love an ice cream shop which brings with it a touch of class, and S Luca certainly fits that criteria.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5iRCT4uAsyP1UoEUoxbylA"
  },
  "lM7ya9ZNupfyOORx2zWy7w": {
    "date": "7/8/2010",
    "text": "I am not surprised that this place has got a whole page of glowing reviews - it certainly is excellent! Morningside Road is such a nice street to have a wander down, there are so many gorgeous little boutiques, art stores and other independent shops that you could spend a whole afternoon going from shop to shop getting some goodies or just searching for inspiration.   I was having an inspiration searching day last week and as it was a beautiful day I decided to pop into S. Luca to reward myself with an ice-cream. I spent ages drooling over all the flavours wondering what one to go for. Chocolate? Strawberry? Mint? It was torture. I eventually decided to go for some chocolate and I wasn't disappointed by my decision, it was amazing.  You can also sit in with a wee tea of coffee and grab some lunch as they offer sandwiches, paninis and other light bites but make sure you save some room for a slice of cake afterwards!  S. Luca offers amazing quality produce in a traditional setting with a great atmosphere and friendly staff, I can't praise it high enough!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CqkdpG2tkCPQA69umlAHsA"
  },
  "SHxjIz7J7jGDhUuUL4reTw": {
    "date": "7/17/2010",
    "text": "all I can say is WOW  You need to come here, seriously, it's amazing.  Yolanda, the owner, is nothing short of brilliant. So creative, so meticulous with her presentation, so fun and energetic, so lovely and so nice!! She is so professional and it shoes in her parlours.  eleven out of ten!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o0WGr8L3BWfH2Bslpnqw6g"
  },
  "eebTDno6e3lyuMHw84kOHg": {
    "date": "7/14/2010",
    "text": "Mmmmm...Luca's.  Even the mention of the name, and my salivary glands begin to work overtime.  I've been here plenty of times now, and I don't remember ever having been disappointed.  The Morningside branch is located just near Holy Corner, and is a cunning plan to lure all of the well-off people from the local area to enjoy their ice cream all year round.  Each time I've been, I visited the upstairs restaurant part.  For nearly all of the times, I've gone for a Strawberry Bliss - a heady mix of ice cream, cream, and strawberries.  It's very tasty, but also over far too quickly because of its tastiness.  The downstairs part serves cones of a variety of flavours of ice cream, as well as a lot of sweets and chocolates.  They should maybe consider putting a dentist in there too - I dread to think of the amount of tooth decay that this place is responsible for!  If you have a sweet tooth, or appreciate a good ice cream, then you have to visit Luca's.  You'd be crazy not to.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v_lWueG7V_vul4E8rCEdjQ"
  },
  "cG_OLSsuQHglN9i8Jba4eg": {
    "date": "7/11/2010",
    "text": "I can't comment on the cafe itself but on a day out in Edinburgh, one of my friends ran into S Luca with an ice cream order, as we sat and waited with anticipation soaking up some sun. When my strawberry cone arrived, I realised what all these other Yelpers were talking about. It was fantastic.  It did taste different from any other ice cream I've had, and certainly rivalled my otherwise favourite ice-cream retailer Equi's of Hamilton! The flavour was simple but I find those are the hardest ones to get right, and they certainly got it right. It didn't even melt quickly so I got to savour it for ages! Brilliant!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "y1zDSS3FAG4YLf8XHbWNTQ",
        "caption": "Photo of S Luca - Edinburgh, United Kingdom. From official website",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/y1zDSS3FAG4YLf8XHbWNTQ/o.jpg"
      }
    ],
    "user_id": "Cy1PV2TdYeDFA16mUOlr3Q"
  },
  "cX0i9I0ebeRYOguWISyA-Q": {
    "date": "11/15/2008",
    "text": "This is the place to experience the YUM factor. Staff are quick to serve and fast on there feet happy and friendly.   NOW the food all so Yum. I normally just have a starter then for desert. Nothing but the best IRN-BRU sorbet this it the most amazing tasty thing ever it got the a lovely fizz to it and is just totality AMAZING.   You can buy litre tubs but the dam things melt very quickly. Unless you have a mini freezer with you its not worth it..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hhTEZQNODA7xPLYRy7Jkew"
  },
  "Gxy7hHyZh-5qeBWwqtu3vA": {
    "date": "11/7/2007",
    "text": "This family friendly cafe in Morningside is a great place for a light lunch, dinner or an ice-cream. The food and ice-creams are fabulous and are not very expensive. The range of food is great with breakfasts to pizza and salads to poached eggs on toast! There is something to suit everyone's pallet. There is a friendly atmosphere, helpful staff and short waiting times for your food.   You don't even need to sit in with a take-away service for hot drinks and ice-creams being offered. This has to be a gemstone as cheap and high quality food in a great environment is very difficult to find in this area of town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qFOy-T6HU4WxS5t_34IBaQ"
  },
  "h4QF9dsRHlf-2ANFUMaW7Q": {
    "date": "4/24/2008",
    "text": "This cafe is great for people looking for a fuss-free, quick meal. The cafe caters well for children and is usually really busy and noisy, which can be great sometimes but not so good if you're looking for a quiet dinner. The food is simple. Pasta, pizza, panini and salads, with nothing complicated or unusual! The best thing about Luca's is the selection of ice creams. They have lots of unusual flavours including an irn bru sorbet! They sell them in big tubs, or you can have a few scoops or a cone. There is also an impressive selection of retro sweeties such as astro belts and trolli burgers, and a big jelly bean selection too. Definitly somewhere suited to families with children, Luca's offers quick, efficient and friendly service, good food and brilliant desserts!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YZtT78f32jBlkpZRBQ_Hig"
  },
  "57AsvtUl4t9U9JL7Uuy5tA": {
    "date": "7/16/2009",
    "text": "Decided to go there today for lunch after seeing the prices at The Merlin!   Luca's was a favourite of mine a few years ago so expected it to still be great.   When we went upstairs there were several staff just standing chatting and hardly any tables were occupied which I was surprised at.   Anyway I had American Cream Soda and a cheese and tomato pizza, both of which were nice but the pizza was a bit too crispy. My boyfriend had an all day breakfast, which came with orange juice and tea which I thought was good value. However the milk for the tea came in a mini jug thing with black speckles on the top like dust or something which wasn't too appealing so he asked for another one.   It only came to 11 which was good for lunch but wouldn't rush back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "52IVqlAINNlrjva8mDjTkQ"
  },
  "LU90HwNXp37NFB0glnqhqQ": {
    "date": "6/10/2011",
    "text": "Nice Ice Cream but many flavours",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e9zlm1zsC97ioMSSdlUtFw"
  },
  "iyPfT1aI_WK-AWv_uyabiQ": {
    "date": "11/30/2008",
    "text": "You have to know the cafe is here because it is on the first floor. Its not huge but has that lovely atmosphere you get when all generations use a place. It is great for taking kids who will be delighted by the ice creams on offer. But it is also a good spot for a bit of lunch or a coffee and a scone. The quality is always fresh and good and the service friendly. Of course , they are most well known for their ice cream and even the most stern adult will often be unable to resist their ice cream sundaes. If you are really hooked they sell ice cream by the litre to take home . Their vanilla really is a classic.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3LW_w3POTvwjl0gY-rHmmw"
  },
  "SHkB8s72YeHhYArF7rEcUA": {
    "date": "4/24/2010",
    "text": "Luca's make the best ice-cream - take note, that's not the best ice-cream in Edinburgh, that's the best ice-cream ever. I have had this drummed into me since I was a small child, it wasn't something that was ever up for debate, but since I'm now grown-up and have had the chance to taste many other varieties and brands, I can assert that it is most definitely True. This cafe in Morningside has an ice-cream counter on the ground floor, where you can pop in and grab a cone or tub to take-away, or you can sit upstairs and enjoy something more extravagant. They sell light meals upstairs as well (paninis and sandwiches etc), but everyone knows that dessert is the main event. The ice-cream is so creamy and delicious, you'll never want to have Ben and Jerry's or Haagen Daaz ever again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mJJj_SZff6MEWG5Vx1r8Bg"
  },
  "nuGExt1YNGXX3VYH5tUAeA": {
    "date": "6/15/2012",
    "text": "Honestly a must visit in Edinburgh. They have other shops (not sure where though) but this one is slightly far away for tourists (suppose that's a good thing really). I LOVE the fact its open till 10pm,... ive turned up here a few times at 9.30ish & still had to wait in a queue... it really is THAT good. The small portions work out moderately expensive but you can get a standard ice cream tub for like 3-4 ish (cheaper than B&Jerrys across the road in tesco) and you can get all different flavours in the one tub. The flavours are gorgeous, but sometimes if you arrive later they have a limited supply. Last time I had key lime pie... to die for! Also just their plain vanilla is good too. Never been to their cafe upstairs as I always take away. They have a pricey chocolate section, & a small sweet section too. Honestly though, the ice cream is amazing... much better than anything you can find in the supermarket.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dM9WWt-uMcSdAYBglSrbkw"
  },
  "phgMnVmogHYMt22WpLD3ew": {
    "date": "11/15/2008",
    "text": "mmmmmmmmmmmmmm!   love this place - yummy scrummy ices in a selction of flavours from traditonal vanilla to the more daring irn bru sorbet.   Lovely sweets too. helful smiling staff. dine in or take away. the dine in cafe also offers snacks and drinks which are very nice and everything is priced fairly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MsyysnjgKEnvg1fC9Q2OCw"
  },
  "aJaqYzz9CI0IAfxOzH8CYg": {
    "date": "7/16/2015",
    "text": "This place is the best. It's open until 10pm in the summer which means you can make it a nice little reward after achieving your 10,000 steps.   My favourite flavours: - toffee fudgie wudgie  - banoffee  - ny like cheesecake    And my new favourite (which they had on offer last night): very berry pavlova.   It's generally busy in the evenings but it won't take long to get served. There is a nice bench across the road at the Eric Liddell centre where you can sit and enjoy your ice cream.   They also sell chocolates and candy. Good for gifts!   Staff are friendly too!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "I8xxucwvRfZ2ksyvgLQG1w",
        "caption": "Photo of S Luca - Edinburgh, United Kingdom. The best",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/I8xxucwvRfZ2ksyvgLQG1w/o.jpg"
      }
    ],
    "user_id": "jY-M01vatSmfy-mK_g0h9A"
  },
  "ou3ZxrnCHuaQBqSmWWSVeQ": {
    "date": "8/25/2017",
    "text": "It really bugs me when businesses with a long history rest on their laurels: Being around a long time doesn't excuse mediocrity. Perhaps once upon a time S. Luca made delicious ice cream, but now not so much. Everything is dyed a hideous color and tastes fake. The mint chocolate chip was so acrid, I wanted to scrape it off my tongue with the nearest utensil. The Kit Kat flavor tasted like... nothing. The best that I can say is that the ice cream had a nice, creamy texture, which is why I gave a generous two stars.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gWsOO1hOqxPp7RZn2BVlRQ",
        "caption": "Photo of S Luca - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gWsOO1hOqxPp7RZn2BVlRQ/o.jpg"
      }
    ],
    "user_id": "flojnA33Ll494B34L-6SeA"
  },
  "8w8YQXVviSoiLBxvXKsE_g": {
    "date": "8/26/2014",
    "text": "I love the ice cream here!  Great place with nice chocolates and really nice ice cream.  On a nice sunny day, this place is perfect to get a cool dessert and go for a walk in Morningside and the meadows.   Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "3tsYRnsvN1c8Hiukrk9uPw",
        "caption": "Photo of S Luca - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3tsYRnsvN1c8Hiukrk9uPw/o.jpg"
      }
    ],
    "user_id": "kUFw657uRE2MYo4NiIdZgg"
  },
  "6qmcFNo7_0G70bzMGvUCRw": {
    "date": "1/25/2016",
    "text": "S Luca is part of my soul. Ingrained from my childhood in Musselburgh, it's staple of anyone who grew up in the area, and I know a few octogenarians that have frequented the original cafe pretty much all of their lives. As a result, the menu has rarely changed, bar the addition of a few new plates, and over the last ten years or so, the incorporation of more than 3 flavours (vanilla, strawberry and chocolate). Now I'm studying in Edinburgh, I took the opportunity to visit the Morningside cafe, thinking this might be a bit more of a highbrow experience.   What you get, in terms of dependability, is a completely faitherful version of the Musselburgh cafe. What did you expect Catriona? Welll.... I thought it might try to be a bit different, perhaps a more modern menu, but no. Savoury options are trapped in the last century, and my baked potato was an odd combination of burnt bottom, and slightly raw inside. Salad is iceberg, a slice of tomato, one layer of a slice of onion (not even a whole slice) and a spoon of coleslaw. I do wonder if Luca's will continue, stubbornly on, refusing to change an iota of their setup onwards to the next century. Although I retain affection for what is decent ice cream, I do waiver for lunch options, as there are many better options out there, and I'm slightly disappointed that Morningside Luca's was reliable in it's predictability, I had hoped it might be slightly different.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "X2uF3C3YBD24xcgKA104Sw"
  },
  "F8lNeYU-8wDPpfYHWJfaMQ": {
    "date": "4/17/2014",
    "text": "If you just want a cone of ice cream, i literally can't praise luca's ice cream enough. it is of the highest quality! There is a restaurant upstairs here too which is totally cheap and cheerful (mostly) but i'm not such a big fan of it there. Thankfully though the ice cream is incredible, which i think is the important thing given that it's their thing.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "G7ZSsFS6HWlSi44rM-kBdw",
        "caption": "Photo of S Luca - Edinburgh, United Kingdom. Nom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/G7ZSsFS6HWlSi44rM-kBdw/o.jpg"
      }
    ],
    "user_id": "U55y_61paae1f6r6vgITJw"
  },
  "9bLyTQxCJbl5NX-t2BBxRA": {
    "date": "7/26/2014",
    "text": "We craved an ice cream; a perfect pairing with the beautiful sunny day that it was. And so, we headed to S Luca. The queue flowed out the door but the staff worked through it with ease and speed. No sooner had we reached the counter. It was so busy that I hadn't been able to sneak a peek of the flavours until that point. They all looked delicious; Nutella, Peach, Lemon Sorbet, Key Lime Cheesecake...  I surprised myself in going for their vanilla.  - It just looked so scrumptious! 99 cones were just what we needed to cool down from the heat. We headed out to the sunshine and...They were gone in minutes! So very delicious and creamy and mmmm...Vanilla ice cream perfection.  S Luca is quite the ice cream parlour, but forget luxury prices. The prices were extremely reasonable. Service was fast and friendly too.  I know I can rely on S Luca for ice cream in Edinburgh!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8rI2CoS4ltQePbZceSOgow"
  },
  "jYZuxXXtvQMDMiwfUGehGA": {
    "date": "1/25/2015",
    "text": "lucas is my favourite ever ice cream place!! They have a huge range of ice creams , my favourites that i would reccomend are irn bru sorbet, rasperry sorbet, bubbleguk sorbet, mint choc chip, nutella, and chocolate. Its reasonably priced for such good quality!! Theres also tubs you can buy of the ice cream in the freezer that come in different sizes to take home, and there is sweets everywhere to pick from, including jelly bellys which are really nice! They also do a huge vary of truffles! There is a small sit in area downstairs and if your in for a bit more than ice cream you can pop upstaires for a seat! Upstaires you can get chips etc , as well as ice cream and a bigger vary of puddings , ex. Pancakes and icecream, ice cream sundaes, etc. Its all lovely & i really reccomend you try this place",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Jwl_Z1zF1Aa9GNE6BkrBZQ"
  },
  "N8kzJkO18P8FWYEBF6teNQ": {
    "date": "3/18/2013",
    "text": "When announcing I was coeliac the waitress was able to tell me straight away that a couple of the ice creams were OK but she'd get the manager to come over to chat through the choices.  Manager duly arrived with a folder full of all their products, with all ingredients listed, so it was incredibly easy.  Vanilla, strawberry and Nutella ice creams are OK, chocolate is not as they add drinking chocolate powder.    The rest of the service was superb, and the place was buzzing for a Sunday afternoon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_yTpnxUb0ygqrUd1_R0ERg"
  },
  "feeNKdUf4AKkV1meM_cWBQ": {
    "date": "3/20/2015",
    "text": "This is a great ice cream shop and always busy, there's always a line to get served so a little patience is needed but it's worth the wait.  The flavours are delicious,  esp the rhubarb!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ORcSlJ7HPsYwjlsSlRH9pA"
  },
  "H1WcpJuHA1MfrQMP3TIIcQ": {
    "date": "6/4/2013",
    "text": "I love ice cream and was really eager to try S Luca's ice cream that I had heard so much about. When we arrived on a Saturday afternoon, there were long queues for the take-away treats downstairs but we headed upstairs to find seats. We should have known this would be packed as well, especially with boisterous and sugar-filled kids with lots of newly found energy. We waited patiently for a table to open up and were seated within a few minutes. My chocolate and pistachio ice creams were good, but they didn't blow me away.   Besides the okay-it's-good-but-not-amazing ice cream, the whole experience was a bit lacking in my view. The servers seemed overly-busy and lacked a sense of genuine friendliness. The place was clean and the old-fashioned ice cream bar feel provided good ambiance, but the rowdy kids and sheer noise of the place got to me. We could hardly hear each other, which never bodes well. I'd go back to S Luca for the ice cream, but perhaps next time I'd just do take-away and enjoy it while strolling through Morningside for better ambiance.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vvQhikDPjAzHfSLVgnFkPQ"
  },
  "lw2icssYwVOKYARhH9CBOQ": {
    "date": "5/26/2012",
    "text": "I want to like S Luca more than I do.  I keep trying, but I just .... fail.  I've had ice cream from here a number of times and so often I get really excited and then I try it and I'm reminded that I didn't really like it last time either.  The other day the glorious sunshine and heat caused me to require icey creamy goodness so a couple of us headed out to Luca's.  I got cookies and cream and mint chocolate chip.  The mint chip was reeeeeeeeeeally tasty, I was well pleased about that, but the cookies & cream was a bit grainy and just didn't taste very nice to me.  Additionally every time I come here I really want a sorbet, but they seem to very rarely have standard sorbet flavours. The other day they had Irn Bru (??), vimto (????), and mango.  What's with the soda flavours??    Additionally, every christmas The Man gets me a box of chocolate from here.  I don't have the heart to tell him I really really really really don't like their chocolates, and he ends up benefitting in the end as I get him to eat most of them.  They have the same odd flavour that I found in the cookies & cream ice cream... maybe it's the vanilla they use?     So, I know that this totally puts me apart from the Luca's loving crowd but in my opinion if you're looking for good chocolate and ice cream in Bruntsfield, The Chocolate Tree is absolutely the way forward.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "4UQfst9jve4GCSfWpWn2uA"
  },
  "IbuwmF3DrqupDXK4cbpo5w": {
    "date": "5/1/2010",
    "text": "I. Am. In. Love. With. This. Place.  Quite frankly, if you walk out of this place and don't also feel the same then there's something wrong with your eyes and tastebuds.   This chocolateria and gelateria used to be on my route to the nearby supermarket, which invariably meant I'd have much less money for boring things like groceries by the time I eventually got to Tesco! You can get a takeaway cone or tub, but I challenge you to step inside, see the home-made confectionery counter full of sweets, cakes and handmade chocolates and truffles, and still have the self-restraint to order your take-away and walk out.  Instead, you'll probably end up spotting the menu, and before you know it you'll be ordering a cappuccino and slab of home-made cake. Yes, they do savoury stuff like sandwiches, home-made pizzas, soups and lasagnes in all their cafes, but why bother with sensible food when you're surrounded by all that sugary goodness?!  It's True, the Morningside branch isn't quite as big as the original in Musselburgh and so doesn't stock quite as big a selection to choose from, but I guarantee you won't leave feeling hungry.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "wgaORFwjRLuqBX7jzdC4mw",
        "caption": "Photo of S Luca - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wgaORFwjRLuqBX7jzdC4mw/o.jpg"
      }
    ],
    "user_id": "oEshN5oq98_g23MvEnRc5A"
  },
  "5gaZpppyAUp58EtkfLXllw": {
    "date": "6/8/2010",
    "text": "I'm not really into ice cream as much as some people but this place is seriously good.  It's on two floors with an ice cream parlour on the ground floor and a cafe above it.  I came here with two friends and we sat upstairs after about a ten minute wait for a table - testament to how popular the gelataria is.  The menu had the normal flavours of ice cream like vanilla, strawberry, chocolate but also more exotic ones like champagne and kiwi fruit.   They let you choose either three or five scoops of any flavour of your choice and there's all kinds of sauces on offer to go with it.  It costs about 4 and the scoops which they give you are a decent size which are the perfect antidote to a heat of a warm summer's day.   As a cafe it's very pricey and I would only really recommend coming here for the ice cream which is definitely its major selling point.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "0nhdQ1eeLL6EdfBetWOKhg",
        "caption": "Photo of S Luca - Edinburgh, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0nhdQ1eeLL6EdfBetWOKhg/o.jpg"
      }
    ],
    "user_id": "yfXqZkU5iXE07GSHzdsQBA"
  },
  "Zll0c7382ArSV6fiWIenLw": {
    "date": "7/3/2010",
    "text": "The founder of this icecream/chocolatier/candy store had a name I didn't even bother memorizing, so wisely changed it to the more easily remembered S Luca. Another Italian establishment (where are they all coming from?!) this shop is primarily an ice cream store and has quite an extensive variety. Being a more traditional gal, I've had the vanilla flavour on several occasions and tried some others as well; it's definitely the yummy stuff!  If carefully tasting your way through every ice cream flavour isn't enough for you, they also sell realllllly fancy chocolate right next to the ice cream counter and just by the entrance is a further candy counter; apparently they're  \"everyones' favourite childhood sweets\" but having grown up in Nigeria, it's obviously some one else's childhood they they're talking about.  My next plan of attack is to venture upstairs and visit their cafe! That's if I haven't succumbed to sugar shock by the name I make it there..",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "aVzh1-PU5Aum5nKrEG88OQ",
        "caption": "Photo of S Luca - Edinburgh, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aVzh1-PU5Aum5nKrEG88OQ/o.jpg"
      },
      {
        "img_id": "8EVJj9_0_85QnKAkoThUUA",
        "caption": "Photo of S Luca - Edinburgh, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8EVJj9_0_85QnKAkoThUUA/o.jpg"
      },
      {
        "img_id": "KH8tAawnDDNq1B8-_w0lkw",
        "caption": "Photo of S Luca - Edinburgh, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KH8tAawnDDNq1B8-_w0lkw/o.jpg"
      }
    ],
    "user_id": "IY8cvV2SQuhJjKhRW68tFw"
  },
  "ZMWspzSssO8GSXkM77KBtg": {
    "date": "3/31/2010",
    "text": "My university is based in Musselburgh where S.Luca originates and is an institution. I have visited S.Luca many a time and it never fails to impress. The Morningside location is just as great as its original.   We visited the cafe for lunch and the menu is great. The menu includes sandwiches, paninis, fish and chips, and a wide range of specials. I went for the Chicken, Mozzarella and Guacamole panini. Despite the fact the Guacamole was store bought (it really isn't that hard to make at home), it was lovely. My boyfriend had the Club Sandwich which he really enjoyed. Basically it is everything you would expect from a cafe.   But it isn't the cafe you come to S.Luca for.  The ice cream is what its all about. I could spend forever in here sampling the different flavours and sundaes. They have your standard Chocolate, Strawberry, Mint Choc Chip as well as Coffee, Toffee, Irn Bru Sorbet, Vimto Sorbet and many more. My personal favourite is Toffee Fudgy Wudgy. Yeh try asking for that with a straight face! The ice cream is homemade and really is fantastic. I recommend eating in the cafe first and if it is a nice day, go downstairs and get your cone to take away.   Downstairs also has an amazing selection of chocolates which will leave you drooling all over the glass.   Also you can buy tubs of ice cream to take away. Which after sampling their delicious ice cream, you probably will do.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "D5EdLsEXCUxAy5gvnpy7_g",
        "caption": "Photo of S Luca - Edinburgh, United Kingdom. S. Luca courtesy of Lucas Ice Cream Website",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/D5EdLsEXCUxAy5gvnpy7_g/o.jpg"
      }
    ],
    "user_id": "oKdygoDX5CfDJeXzv_EVaw"
  },
  "o7xBSJm8vMr0BXtZOk74SQ": {
    "date": "6/27/2009",
    "text": "During my week-long vacation in Edinburgh I spent the first few days and nights in romantic bliss, but then my companion-in-intimacy had to leave town a couple days before me -- I needed immediate and immense comforting, and S Luca provided just that (in spades).  Irn-Bru sorbet -- HOLY COW, I came back three times to enjoy it... It's fizzy, it's ginger, it's phenomenal... Also I enjoyed something called the \"Knickerbocker Glory\" which was a little overwhelming (I'm not really a sweets person, and it's pretty much an encyclopedia of sugar's varieties and manifestations) but still pretty damn good.",
    "rating": 5,
    "rated": {
      "funny": 9,
      "useful": 7,
      "cool": 8
    },
    "photos": [],
    "user_id": "NV0u95G-WcjZRAfCX-jcWw"
  },
  "OCJzXxf3W0qKGIvm6uLpPQ": {
    "date": "5/25/2012",
    "text": "Amazing ice-cream - 3 scoops is 2.35 to take out and is very busy on a sunny day (there was still a queue at 8.50pm last night). I tried the irn-bru sorbet (amazing!), fudgy-wudgy (gorgeous sweet fudge and toffee bits), and strawberry (real bits of fruit). Ice-cream sundaes are impressive and good value (typically under 5) but make sure you are hungry when ordering as you feel guilty if you cannot finish it! You can sit in upstairs in Luca's. The menu is basic (pannini's, burgers, pizzas) but prices aren't over the top. Gluten Free chioces are more limited but if like me, cheesy nacho's are your fall back then a decent portion with salsa, guacamole and sour cream is only 3.80  Also- - if retro sweets are your bag, Luca's has an awesome selection :-D !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "frthTngbBHgSdk4j85HmEQ"
  },
  "wcPIm41Y_HFdjTIHaeKfIA": {
    "date": "6/10/2013",
    "text": "I have yet to come here for food, so this is just a rating of the ice cream and sweet shop downstairs.  They have a fantastic array of flavours, I haven't tasted one that DIDN'T make me crave more, and there's always a new sorbet or frozen yoghurt available every time I come in - the raspberry and green apple frozen yoghurt being a personal favourite.   The Irn Bru and Vimto sorbets are so addictive they may be illegal, they do the only chocolate ice cream I've found that doesn't taste horribly bitty, the strawberry and vanilla are phenomenal....I could probably just list every different flavour and a different superlative next to them, but that would get boring. They also have a great variety of interesting sweets available, and they're one of the few places in town to get my Jelly Belly fix.  Did I mention their ice cream is really really good?",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "RBgpFyntVu4Iy6i0xoI5-g"
  },
  "OBBn07ainD9y6pWxGw4e7w": {
    "date": "7/27/2011",
    "text": "I have yet to find a better ice cream shop in Edinburgh. It seems a lot better and real when compared to the big chains. The staff seem nice, allowing you to taste your flavour if you like before buying. This is always helpful for me as I am a little bit indecisive! As a huge fan of Bananas, I discovered their Banoffee ice cream. Oh man.. I don't think i'd need to try any others. LOVE!   They also sell other chocolates and yummy things. But I will always choose gelato over chocolate! I'd suggest going if you have a craving, enough choices to find one you like!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "F9nMHS70LBqEwKYFFuJ_0Q"
  },
  "Yg9YZ-e_zZ5td8vsBWuBPA": {
    "date": "10/2/2011",
    "text": "This little shop is amazing, and they definitely sell the best ice cream that i've found in Edinburgh so far.  The portions for the price are totally reasonable for the quality (two scoops of gelato for 1.70? I dig it!) I got a scoop each of nutella and vanilla, and I was beyond pleased. Probably some of the best, if not THE best ice cream I've ever had the pleasure of wolfing down. I'll be sure to buy a liter to take home with me next time I pop in.  They also have an array of adorable handmade chocolates that I'll have to come back for to give as a gift to someone!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hRk8IR9fhwBtrDsldW-6fA"
  }
}