{
  "Ctx5TKv4rfHP2VsMq-UYOQ": {
    "date": "11/17/2012",
    "text": "This review is for the cafe. We ate here for breakfast and then again for lunch. Embarassingly forgot to pay for the breakfast so we came back, paid and then stayed for lunch. Both meals were reasonably priced & staff was friendly. Good food too. :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-bT32tHNq7ngqZNA4Tr8jA"
  },
  "DOZ6E3pkVRqzUZHBGhmTaA": {
    "date": "1/28/2009",
    "text": "This is another wee gem for lunch. My vegetarian pals particularly like this place because the menu usually offers them a good choice. You can get a really health lunch or snack here but its not as cheap as some places in the vacinity. We can usualy get a table here which makes me wonder if some people presume you need to be attending something in the Storytelling Centre to use the cafe. Its ideal for just a coffee as the coffee is really nice here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OnNStaDA9o-i98roxOzeIg"
  },
  "6ieWBY0YoqthRgStMTHByA": {
    "date": "11/17/2008",
    "text": "Halfway down the Royal Mile, next to John Knox's house you find the recently renovated Scottish Storytelling Centre. It is easily accessed, just get a bus to the bridges and walk down the mile for 5 minutes. There is generally a programme of events worth keeping an eye on, they have exceptional cultural events for little ones. My kids enjoyed the Chinese New Year celebrations and storytelling. The cafe has lovely, if a little pricey, food, it's so Scottish you can even get yourself a bowl of porridge! Next to the cafe is one of the stroytelling areas, which has lots of little exhibits for restless toddlers to muck about with whilst you enjoy your coffee.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xBZ1_3ylm3hf3VQHZ3ApFw"
  },
  "c1thE_RzDmkhwGnvGMET1w": {
    "date": "2/10/2011",
    "text": "Not too busy, with a range of reasonably priced homebakes and meals on the menu. Table service. Although they forgot to bring us our meal, they were pretty quick when reminded.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Oga88SZfQJHA2c4FH6yPpA"
  }
}