{
  "5uYgesqkAghcIWFC9gfJSw": {
    "date": "2/23/2010",
    "text": "Only good AFTER YOU go to the bar. Sober it sucks. Drunk it's great",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BHZc9f008n_II9bXS5V_lA"
  },
  "JZaDORHkejAgxb69v71JAg": {
    "date": "9/4/2015",
    "text": "Fridays are good for happy hour and food is good too. It can be busy so be prepared to wait for a table once in a while. Or just sit on the back deck.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CC8CjFzY8YjqFsFoCmp69A"
  },
  "isswD5jO3GwCYIkDNK9AEA": {
    "date": "10/5/2016",
    "text": "I love the white pizza and the Monongahela (bloody) Mary. Boyfriend always orders the Smallman Street fries & a huge, capicola sandwich. He can finish it every time! Not the cleanest place, but the food is consistently good and the beer is cold. A family go-to!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D5_iQw0N9wO7kT7FrT7j6A"
  },
  "dXkk6t-SFfliYv0EUpV4Hw": {
    "date": "6/5/2012",
    "text": "We were the first ones to arrive on a Saturday morning at 11am. This was a perfect stop to shake off the cobwebs from a friends wedding the night before.   I always enjoy the cheese combo. It's served with the best fries, coleslaw, and amazing French bread. For those visiting Pittsburgh and Ft Lauderdale, you must give it a try! After all, it is a Pittsburgh staple!!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "D8PJTlkMlwAyDjow3pup_Q"
  },
  "noUc21w5Hcl4gJu4n51EIQ": {
    "date": "3/13/2015",
    "text": "We come here all the time food is always amazing they are kid friendly which as a mom is the best part an the staff is always happy to be there an just really nice people",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lQ931JnaJXExVEkJfAB0uw"
  },
  "g6HDVOxXtb_OoYzrpwmegg": {
    "date": "10/1/2012",
    "text": "Really disappointing after seeing their sandwiches on TV. I had the Pastrami with cole slaw. The cole slaw tasted like old lettuce. Maybe it was the vinegar but it was a gross flavor and it overwhelmed the sandwich.  The chili was tasty but not hot enough.  The quality of the Wings was below average although they were tasty.  Our waitress was nice and very friendly.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b1j3QAOOUr6Mq9_8TntLGA"
  },
  "vyi-gmPOhpyLfsj32vzqEQ": {
    "date": "8/20/2008",
    "text": "What can be said of Primanti Bros. (pronounced \"Primanny's\") that hasn't been said already in other locations?  This suburban location fills up fast on game nights, offering beer specials and dollar pizza slices.  Even during the day, you'll find it a welcoming place to sit down on the pew-like booth benches, order a sandwich with hot fries and cold tangy slaw inside the rich, substantial slices of bread, and wash it down with an Iron City draft.  For those who have never visited Primanti's before:  1. Don't ask for the fries on the side.  They might oblige, but you're missing out.  2. Don't ask for the slaw on the side.  See item 1 above.  (Though I love a $1.50 side of slaw; it's a light, vinegar-style slaw bursting with crunchy wisps of thread-thin cabbage.)  3. If you're wondering why the menu advertises a \"#2 best seller\" but doesn't mention the #1 best seller, have a beer and think about it.  They'll tell you if you ask, but it's more fun to figure it out on your own.  4. Don't ask for a plate.  Your sandwich will be delivered on wax paper in a paper basket.  If you want something fancier than that, you're in the wrong place.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "zr8suN_SHxvjaOs3pQdwWQ",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. The famous Primanti&amp;#39;s sandwich, with fries and slaw inside.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zr8suN_SHxvjaOs3pQdwWQ/o.jpg"
      }
    ],
    "user_id": "EIt66bYmFr_2kbs5qsL-0Q"
  },
  "x7Vx6QvJ-iLL4HoZFh0riA": {
    "date": "11/13/2013",
    "text": "They did have Dogstyle Head Ale 60 Minute IPA, so good job there.  I got the \"Angus\" steak sandwich with double meat and the meat was a f-ing dogchew.  Jack Link's would have been a step up.  This is NOT a Philly cheesesteak, it is a Pittsburgh dogchew.  The fried pickles were actually very good.  The cheese sauce must be powder, it is not good.  I don't think they salt their fries either.  Sad, I keep wanting to like this place (3rd visit, 3rd location) because of the history but man that sandwich dogchew meat was bad.  The people here are friendly and very nice.  The service was good.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "fpNH1CqgDxavVh6Q73eA0A"
  },
  "41cydhKeCNPMs2IHUYfi6Q": {
    "date": "2/18/2015",
    "text": "Our favorite Primanti Brothers in the area. Service is always on par, and the food is consistent here. The sandwich is a 10 + !!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NUGAyn_mV1NwcVlhY28wpw"
  },
  "hzjYre9dFxzq3Uzaqr5-Sw": {
    "date": "11/23/2014",
    "text": "Got the Pittsburgh and I must say it was quite disgusting.  I wouldn't even feed it to my dog. For something thats there 2nd best seller i expected something amazing. Barely edible could not finish it. Other than that the staff was very friendly and polite. Just stay away from the pittsburger it's dog chew. Hopefully this helps.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bKfyBgt9Yn9hbiceux355Q"
  },
  "_3b-lu_5SOpTlWnWjE2w-A": {
    "date": "11/6/2014",
    "text": "I travel for a living and Pittsburgh favorite of mine! I try to make sure to eat there when I'm in town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h0HJYIipIm3SKgXqT5876Q"
  },
  "ginBDVhXMQFU7J63qqL5xg": {
    "date": "12/21/2013",
    "text": "I'm not from Pittsburgh so when I moved here I was looking for something that was a local staple. This place fits the bill perfectly. Never have I seen slaw and French fried on a sandwich. Maybe one or the other but never both. I love cabbage but cole slaw is not my thing. That being said the steak sandwich with double meat and all the fixings was really good. I'm actually a fan. I did end up taking a bit of the slaw off but thats just personal preference. This is a place I will be visiting again. It's not my Mexican food from home (Phoenix) but its a must have while in pittsburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U92V-gp13uMZL-sl_naTHA"
  },
  "k-pWlmGyjL7Fop7NpMebTg": {
    "date": "12/24/2012",
    "text": "<a href=\"/redir?url=http%3A%2F%2Fstevelerer.com&s=6e2ad90d4e196a5cf6db98b32c56e4d520f934ad805dc4aec22634c6c2239ee4\" target=\"_blank\" rel=\"nofollow\">stevelerer.com</a>  While in Pittsburgh for a family wedding we managed to swing by the original Primanti Bros which was a stop by Adam Richman on Man vs Food. This place is known for it's sandwiches stuffed with french fries and coleslaw just like the fat sandwiches from my college days. It is not known for it's ambiance, so let's get that out of the way and talk about the food. Primanti Bros has grown into a chain but I imagine all the stores look similar. It is a wood table and chair place with a nice old school looking bar. The menu is plastered all over the walls and you can only pay with cash. We grabbed a seat in the second section of the restaurant and waited to place our order.  After a few minutes our waiter came by and we ordered. I decided to check out their #2 best seller, the Pitts-Burgher Cheese Steak, and a cup of their almost famous chili. Everything came out together and ready to eat. The chili was a seriously tomato based with a smattering of beans and meat throughout. I love chili and I love tomato soup and in my opinion this was a very good tomato soup. Don't get me wrong, it was a good soup but in the end I am privy to the texas style chili with heavy amounts of spicy peppers and a lot more meat.  My sandwich was also pretty good, some serious after drinking food. The bread was nice and thick which held up pretty well to the wet slaw and cheese. So here is when I admit my failure to read menus carefully. I thought that this would be a real cheese steak but I neglected to recognized the play on words in the name Pitts-Burgher. Instead of thinly shaved meat I actually got a burger on this sandwich. I was not expecting that and honestly didn't want it so my review is a little skewed. While the sandwich tasted good I was thrown off by the burger texture with the cole slaw and the non bun bread. The burger was also cooked all the way through which is not to my liking, as I am a rare kind of guy. I found myself wishing I had read more carefully and ordered the pastrami because this sandwich was not for me. Next time we are back in town I will try it again and order the meat I really like and judge it more fairly. I will say though that I have and always will love adding cole slaw and french fries to my sandwiches!  In the end this was a good restaurant with a strong following and I can see why. Cheap and sizable sandwiches for people going on or off shift or stumbling in after a long night of drinking. Pretty much the same reason why the grease trucks at Rutgers do so well but I will take my Fat Darryl over the Pitts-Burgher every time.  Overall Review: 6/10",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0poYV3uCsnYjxQBjUI9XoQ"
  },
  "eq1IwUBQpSbJ6YW2HTzzTg": {
    "date": "12/31/2012",
    "text": "Just as I remembered. Took my wife and kids by for a sandwich (as only Primanti can do) during a Steeler's game while we were visiting relatives for the holidays. Nothing compares to a Cap & Cheese, Primanti Style, with a cold Iron during a Steeler's game. Some things just work together...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JXlpMw6WeT7SQo-0UxjjzQ"
  },
  "2y-lkbOeLPlJfAsM9YI06Q": {
    "date": "1/3/2010",
    "text": "Ah, Primanti's.  This place is SO fucking good.  You get your whole meal in a sandwich.  I usually get the roast beef and cheese (with homemade cole slaw and homemade fries in the sandwich).  And it's so big that if you weren't starving when you walked in, you won't be able to finish it.  The fries and cole slaw are worth coming for on their own.  Both are fresh-made.  Beer is usually cheap.  Service is friendly.  Prices are fair.  Warning: There is one in Fort Lauderdale, Florida, but it is not the same experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "_WtDntfuJuU3VgwKDc-c4w"
  },
  "tguVJHq2thdGKpNbD6l2Eg": {
    "date": "7/23/2013",
    "text": "Decent sandwich. I don't get what all the fuss is about. Must be a Pittsburgh thing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6vBD5rfVZzEzL0QQCcyEdQ"
  },
  "nbqIzYXwesy0KPo0MpDkxw": {
    "date": "5/27/2013",
    "text": "A Pittsburgh tradition. Every time I have a friend that comes in from out of town it is a must stop. They are the innovators of the \"sandwich\". Its a local staple. The restaurant is clean and the atmosphere is great. The staff is also very friendly. I would recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w4zFlHj5k3Bry5Zt1FZCJw"
  },
  "SyE6lK87Sb4HB2uaJLgSUw": {
    "date": "8/10/2012",
    "text": "Good sandwiches. fries, pickled Cole slaw and tomato on the sandwich. Pastrami or corned beef are popular. Outside seating. Casual atmosphere",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YzLbbVd254jSha5br2Tyqw"
  },
  "vCrNtilcv0CjW0fOlhRbew": {
    "date": "7/30/2012",
    "text": "We had a pizza. Meh. A colossal fish sandwich. Ehhh. A fish sandwich...Ohhh.  Food poisoning. Requests to have food removed from our bill (and our memories), and vows never to return.  Our server was very nice and attentive. It was freezing cold in the restaurant and no matter how hard we tried, we couldn't smell food aromas.  It was roota-to-the-toota GROSS.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KpJPT3Eu7zyYb70SNwluhg"
  },
  "Wlx2Nw5SmdnKU-ifG-1ypg": {
    "date": "2/2/2014",
    "text": "The best! The pizza and classic sandwiches are the best. If you live in south hills, follow this advice...make this one of your usuals and you'll never be disappointed. Round out you list with Doridos, Galis, Pan Asia, and Big Jim's and you'll never need to try a new place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vr-CkJScI3snDiYlD9k4xw"
  },
  "CXnZnnEuZaedS3od2ud62Q": {
    "date": "3/26/2014",
    "text": "Sandwiches are obviously the best .  But this is about the pizza.  Possibly the worst pizza I've ever had.  The chef boyardee build at home kit is better.  The crust is not crusty, and the sauce is just bland crushed tomatoes.  It's flat out gross.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Ql5TaJ2f_ry8VMpyZStuw"
  },
  "ecLCsn-M37XaB8zZfBXNHQ": {
    "date": "5/30/2015",
    "text": "What else can you say about a Primanti's sandwich?? Capicola or egg and cheese is my go to sandwich. What is really great here is the pizza. Hand tossed, great toppings. Love the white pizza with anchovies. Also a great deal on Tuesday nights. Pizza, salad, pitcher of beer for under $20.  Great happy hours with discounted draughts, slices of pizza.  This location is a nice one. Outdoor seating, specials on craft bottles on Mondays.  Nice way to hit the Primanti's experience without heading into the strip.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UBUV0ElEvm8kgxZvcdDo2Q"
  },
  "1Y2PR8dA86ZTYaEaN2CXgw": {
    "date": "6/12/2015",
    "text": "Mmmmm, mmmmm, mmmmm.  I heart Primantis!   My favorite Primantis sandwich is certainly the Cajun chicken. It's a nice amount of spice on the chicken, and it's always cooked perfectly, not dried out or overcooked. The fries and coleslaw on the sandwich make it for me. The bread they use is always so soft and delicious! Their pecan pie is huge (1/4 of a pie!) and pretty amazingly tasty. My kids always enjoy their kids meals and the atmosphere is loud enough to accommodate kids nicely!   They give moms free food on Mother's Day and dads free food on Father's Day, so it's become our new tradition for me for Mother's Day! Yay!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pBxXdtqr18nsxPtRb-P4hg"
  },
  "1mi5-2nKgRQ0u6KoWXA3vQ": {
    "date": "9/27/2016",
    "text": "You can't beat their happy hour! Great sandwiches! A popular stop for the after-work crew.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4qfMMlGtme2RNFqDgxYLxg"
  },
  "f54ybPsxQD6bTEOjra31RQ": {
    "date": "11/7/2016",
    "text": "I used to love primanti's bros, but I wish the would use fresh pressed ground meat for their burgers instead of frozen patties. It would be SO much better. Just not a fan anymore",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Amd1mZAzHhHMbgKd2RuOg"
  },
  "coBFeIlogDBeAcv1QW8YIw": {
    "date": "10/17/2014",
    "text": "The food was good, but the staff wasn't overly friendly (well at least not to me).  I guess there were some regulars in there that my server paid more attention to, and was very curt when it came to interacting with me.  I've been to the original Primanti's in the Strip District as well as the ones in Monroeville, Moon, and Harmarville and they all have friendly staff.  However, I guess it's who you know at this location.  Like I said, the food was good, it was clean and the price was right and that's what mattered the most.  I'll just stick to the other locations in the area next time I'm in Pittsburgh.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gmYU_SLgpWgafgSejWdzTg"
  },
  "CRMppAp7f0GF5pa8sNkV4g": {
    "date": "7/31/2017",
    "text": "love Primanti bros.great food. good service. friendly people.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nyzncOg3goSAMK15IijIqA"
  },
  "mG41U8q3GDH6sF9hth8PYQ": {
    "date": "10/27/2014",
    "text": "I decided to give it another try.  I went to this one in Pleasant Hills versus the one I went to for the first time in the Strip. This environment was more appealing to the eye. The sandwiches were still ok. I'm willing to try one more time ..sometime in the future. I want to try the bacon, egg and cheese sandwich. Hopefully it's not \"just ok\"..",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wkPXgEWL1Kbg6Ivh0VEnDA",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Lamb Gyro..half a lb. cheeseburger, corned beef and cheese and street man fries..yum!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wkPXgEWL1Kbg6Ivh0VEnDA/o.jpg"
      },
      {
        "img_id": "7IJYiOkonW5Ks27hXwOGig",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. What to drink ..what to drink?",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7IJYiOkonW5Ks27hXwOGig/o.jpg"
      },
      {
        "img_id": "nmw_G57ATCg2DevxW2INhA",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Waiting for our food to come..",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nmw_G57ATCg2DevxW2INhA/o.jpg"
      }
    ],
    "user_id": "MP5PG36M4h2T-rMfAKqM0w"
  },
  "QGn4gpKpOEVej7Et-7s3fA": {
    "date": "6/25/2016",
    "text": "Great place to have fun and eat delicious food. The servers and management staff are top notch!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6m2A6rRQbFMlvUYr0GfEDQ"
  },
  "9AC50RYEmASkzN_g-1lsxA": {
    "date": "1/29/2016",
    "text": "LOVE the food, service was great. Not going during happy hour ever again. Took my 16 y/o daughter, she had boneless wings with cheese fries, I had the roast beef and cheese. The table next to us was 2 men and four boys who didn't understand how to behave in public. The noise level was overwhelming, between the music, televisions, and all conversations being yelled over everything.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F5w08Mjr1XEtMYLim2v-2A"
  },
  "z0Nt-FEc1S50cHm9rs3uEg": {
    "date": "3/16/2016",
    "text": "Solid 3.5, amanda the server was so fun on both trips. Food is ok, pizza was good, the mystery meat with fries and slaw was ok.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hl06-Y6fqMRvfbBJ6qmDOA"
  },
  "-ikzPr1ZM3_EXUGHFZNzeA": {
    "date": "3/12/2016",
    "text": "I can't stop coming here! So freaking good. They're tots are so addicting and the service is so welcoming, friendly and attentive. My kids love primanti's! !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ApRbqTASDJ3Bzg4YIaOm0w"
  },
  "EYqt2IM1SpJaCqCscfOmWw": {
    "date": "11/16/2015",
    "text": "Having to live in Northern Va for the past 24 years and missing my home town the Steel City of Pittsburgh.......this is a must stop for me when I am in town!!!!  Wahoo!!!! I live for this place.  After all these years we tried a slice of Pizza.  It was good!  My wife is from D.C. and now is in love with these wonderful sandwiches of delight!  If you never been in here your are missing on a treat!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9AqCwT7uHOCGK7x29E_Q1w"
  },
  "PcDNuM_0QtMDVw_B-vgcsQ": {
    "date": "7/27/2016",
    "text": "I'm not a fan of this place never was. I guess I'm not your typical pittsburgher but someone told me hey they have this pizza night it's cheap. Well i have a family of six so you just said the magic word. I was kind of worried because i thought hey 22$ it must be like little Cesars. Boy was i wrong got a warm welcome entering which gave me hope. Sat down and ordered the pizza feast. Which came with a large pizza a family salad that could be refiled for free. Also for a couple bucks more came with wings. And of course a 2 litter or soda. For 22$. The pizza was amazing loads of cheese. You can pick up to 3 toppings which we got extra cheese and didn't have to pay double like most places. Pep and mushrooms the mushrooms could of been bigger. They were like shaved pieces. But it was good i didn't really care. The wings were amazing i got the honey bbq. For 22$ you get a lot of food for your buck.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9TY2iU0mhsVL17VP0S2D4w"
  },
  "uEasegoMF2EEZlC4p-ZQ2g": {
    "date": "1/6/2013",
    "text": "I had never eaten a Primanti's sandwich before coming in here, and although I had some idea what to expect, I wasn't quite sure how well I'd like it. But I was willing to give it a shot.  I am so glad I did. The restaurant was clean and well-staffed, and our waiter, although not real friendly or anything, was polite and efficient. I ordered a Yuengling which came in a huge .5L glass (a surprise to me) and was perfectly cold and fresh.  I ordered my sandwich with spicy Italian sausage. What came out of the kitchen was a thing of beauty. Two slices of soft, fresh Italian bread, with layers of sausage, fries, cole slaw, tomato and raw onion. It was absolutely delicious! It was filling without being really heavy--the fries are not real greasy and the cole slaw is vinegar-based, not doused in mayo.  The flavors of everything in the sandwich work perfectly together, and my pronouncement upon finishing the first half was that this was easily one of the best sandwiches I had ever eaten.  What I also find impressive is that Primanti's is such an institution, they could put out far inferior food and still coast on their reputation, but far from just being some gimmick, the sandwich is actually really tasty.  Definitely worth a visit!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "tgkjSWCcWXAAk2DScYmQrg"
  },
  "pMlBfk_ULAAxKqIpOnIVnw": {
    "date": "2/1/2016",
    "text": "Always gotta love primantis when you're a pgh local. Staff was kind and quick. Food was excellent. Always a good experience eating here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nEwisT6x5_5p5e3Xs8v_VA"
  },
  "e2vAT8fE9BB5VYlGxhlHCQ": {
    "date": "1/7/2015",
    "text": "U can't go wrong here!! There sandwiches are amazing. Fresh bread.. Its just great! Come for a Steelers game pens game or any other Pittsburgh sporting event they usually have $1 beers. AWESOME! $1.50 pizza slices that are huge and they run other specials during games too. There chili is to die for. Try there chili cheese French fries mmm!! My favorite is the Turkey sandwich with chili cheese French fries! You won't be disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8NFRcQpV1HnK45H6JhMe-Q"
  },
  "U17PTKB2Q4Q2rLxA4cnujQ": {
    "date": "8/27/2015",
    "text": "I know they're known for their sandwiches BUT.... Ya gotta try their white pizza!!!! And Thursday's special is amazing!   Pizza - salad - soda all for under $20!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oTesbc_Eny4nv5_iGXStBA"
  },
  "jQTUHBIMDQUwCwXG977yQA": {
    "date": "7/8/2015",
    "text": "Came in to give it another try. The waitress was nice but wasn't allowed to serve alcohol because my 37 year old friend forgot his ID BUT HAD NO INTENTIONS OF DRINKING. We have been there many times before and a manager could have stopped over to explain. I left very angry.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tzE3QhxkHRwFry5nBn8F8g"
  },
  "PRcdbeKNxarTUz1YQlYCgA": {
    "date": "9/14/2015",
    "text": "My first time at Primanti's and I was not disappointed. I ordered the turkey and cheese and of course I could not finish it all. It was delicious though. They have their own coleslaw which has a sweet flavor to it...it's a little strange, but good! Their menu is reasonably priced; cheap if you ask me considering how big the dang sandwiches are! My husband had the Angus steak...double meat. He was thrilled. They even have personal pizzas at this one. It was a great experience. Will always stop at Primanti's when we're in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4YoI1oWnmR1GfmQ5E02ECA"
  },
  "icDfJP3xFpUl4IPeAPWwUQ": {
    "date": "7/19/2015",
    "text": "Primanti Brothers is a Pittsburgh legend. While this Primanti Brothers do not have the classic appearance of the original restaurant in the strip district it does offer the same classic Primanti Brother food.  I have tried several of the Classic Sandwiches and my favorite is the Cajun Chicken.  This Primanti Brothers is located near our Hotel and we tend to visit several times whenever I am in the area.  We are always greeted and seated promptly and our waitress quickly appeared and took our drink order.  Once our order was taken our food was prepared and delivered quick. As always our food was good and is the reason we keep returning.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qrxWg7Gmk768Nx1jx6lnng"
  },
  "DjhEOT-p2QQAjOLAlJg1Tg": {
    "date": "1/15/2017",
    "text": "The sandwiches are often raved about, and they're good, but I come here for the pizza - specifically the personal pizza.  It includes 3 toppings which makes it easy to order instead of fretting over how much extra an additional topping is.  The crust I think is what makes these pizzas standout.  It also pairs great with a beer and they have good craft beers on tap. At my most recent visit, there was 3 of us and we all wanted the pizza so we decided to get a 14\" deluxe which includes 5 toppings. It was large enough because we weren't starving, but on a more usual night we would need to order a larger pizza.  The crust in the center of the pizza was soggy.  This doesn't seem to be an issue with the smaller personal size pizzas. This is a good place if you're looking for a fun time with conversation that prompts laughter, to watch sports in the background, maybe to tell a few exaggerated stories.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "rddZUJaDuMkvvllSKDFqVg",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rddZUJaDuMkvvllSKDFqVg/o.jpg"
      },
      {
        "img_id": "XA4Kunevj7LG7aJUsbddtQ",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Pizza!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XA4Kunevj7LG7aJUsbddtQ/o.jpg"
      },
      {
        "img_id": "DhAtKqUdjkmz6squoguH1w",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DhAtKqUdjkmz6squoguH1w/o.jpg"
      }
    ],
    "user_id": "QYKexxaOJQlseGWmc6soRg"
  },
  "Ljw2io3g6bhfXppzjhZnSA": {
    "date": "6/22/2017",
    "text": "I normally stop in this location when out with my mom and sisters. It is easier to get in and out of than the one in Mt. Lebanon for us. But everything about this location just seems average.  It seems like we have more issues with the order or waiting for food here. The quality seems the same as other locations. But there just seems to be more concern here. It may be possible that it could be because my one sister complains more and I go to the other location by myself. But maybe not. I've definitely noticed the issues myself  I was excited to stop in once as they had been running a special I was REALLY ENJOYING. However as it turns out this location wasn't doing that same special as the Mt. Lebanon one was. Here I thought the specials would have been company wide as with any other normal company. but I guess they figured they could just do whatever they wanted regardless. Oh well.  So with the extra issues and not having the same specials this location gets a 3 rather than a 4 that the other one got.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V2QFgQcbpUQltfwLnoESCg"
  },
  "6prhTqu7nAf2g0JZjPM-AQ": {
    "date": "10/27/2016",
    "text": "Whoa! What a sandwich! This spot was recommended as a great place for lunch and is known for their sandwiches. We were down the way from the location and decided to give it a try. I was definitely pleased with the meal I got!  First and foremost, the place wreaks of PITTSBURGH, which is fantastic if you're a visitor. With memorabilia every where, you definitely know where you're at. The servers were so nice and gave a really great run down of the menu, even recommending several sandwiches to try. In case you weren't aware, Pittsburgh puts fries on everything, which was a surprise for me. I decided on the Capicola sandwich consisting of spicy italian ham, cole slaw, tomatoes and fries (yes, fries inside the sandwich). IT WAS AMAZING! I would definitely recommend this place to anyone that's in the Pittsburgh area.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "65GY-LY1Y9OLQ24bk05VYg"
  },
  "AOJkOOWoQy6iKn-D6V2wfg": {
    "date": "6/7/2018",
    "text": "Are these bartenders even serious???? Waited over 6 min for a drink from the older blonde lady with a clip in her hair, Jesus. Really (I actually set a timer, bc she was so ridiculous)??? Second drink needed before happy hour was over, nope. Wow. The younger tender to come on was at least more attentive, prompt, fast..... Promise, never again.....",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RspAYDz3QlBEFBp5BVm3pw"
  },
  "4-W5E55Z4nDM6vU1j-a5GA": {
    "date": "1/3/2015",
    "text": "West Mifflin (or is it Pleasant Hills?) has their own Primanti Brothers franchise. How 'bout that? Now one can grab a pastrami/corned beef monster sandwich before or after an ordeal at the Mart of Walls nearby.  Primanti Brothers sandwiches are often maligned, particularly when consumed at the original Strip District locale, but I will continue to vouch for the suburban satellites for they offer streamlined, more professional service, preparation, and atmosphere. Take your mother-in-law to this one and convert.   But back to that sandwich on the Italian bread, the one with the slightly sweet sauerkraut-ish slaw, the french fried tater blades, the tomato, the onion...the bacon???  Hence the beauty of the suburban Primanti Brothers restaurants: the menus are more flexible and expansive. If you don't like the slaw, you can leave it off. Do you feel like a burger, pasta, pizza, or a gyro? This Primanti's has 'em, and will bring 'em to your table on that custom, bakery tissue-lined aluminum cookie pan that always evokes sheer comfort.   And, unlike PB's grittier urban establisments, here one can indulge in dessert. In this case, we went with their...bread pudding? Hell yeah, you can have some of that here (brownie sundaes and pecan pie are also on the card)! Topped with a potent Maker's Mark whiskey sauce and raisins, this tart, spongy, honeyed, wholly housemade end to dinner brings to mind french toast or Bananas Foster sans bananas, if that reads sensibly.  I'm knocking off a star due to a slightly bitter aftertaste left by the slaw towards the last couple of bites. Was the cabbage cored before shredding? That faux pas aside, Primanti Brothers is a surefire way to make me smile on a wintery shopping trip, their sandwiches never failing to remind me why they are legend, clueless haters be damned.",
    "rating": 4,
    "rated": {
      "funny": 7,
      "useful": 11,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "Qvpspyh1WV7YKuYFKFfyow",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Bread Pudding with Maker&amp;#39;s Mark Bourbon Sauce and raisins",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Qvpspyh1WV7YKuYFKFfyow/o.jpg"
      },
      {
        "img_id": "A0A9DRrmra4j3G3_R3Abyg",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Primanti Brothers sandwich with egg, bacon, onions, pastrami, and corned beef",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/A0A9DRrmra4j3G3_R3Abyg/o.jpg"
      },
      {
        "img_id": "3K3FFE58yeyskOT-Ke2e4Q",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3K3FFE58yeyskOT-Ke2e4Q/o.jpg"
      }
    ],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "zy9S0Dt-YJ7V4qpoqOb9VQ": {
    "date": "7/30/2016",
    "text": "A must if you're visiting Pittsburgh! The sandwiches are amazing, with fresh cut French fries and a vinegar-and-oil coleslaw. If that doesn't sound like your cup of tea, the Smallman Street fries and hand tossed pizzas are great too.   The staff is great at every location I've been to. If you let them know you're from out of town, the sandwiches tend to be even bigger! I bring all of my guests when they come to visit.   The only drawback to Primanti's (or maybe a plus) is when a Pittsburgh sports team is playing. The place gets really loud, and if you're not paying attention to the game it can be pretty startling when a team scores.   Overall, a great place to get a great meal at a great price.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tSAOXRfYQNoYOdREI0axpA"
  },
  "ETVe9l-9PZusOZozLTZvEA": {
    "date": "5/31/2015",
    "text": "Looking for a taste of Pittsburgh? Then this is the place for you. Primanti's is known for it's sandwiches which include coleslaw and fries. The back story is that the steelworkers needed a meal they could take with them but didnt need eating utensils and could even eat with one hand if necessary.  Hence the fully loaded sandwich. I have eaten the Pastrami, the Corned Beef, the Italian, and a few others. They are all good. The coleslaw adds a nice crunch and the fries bring a saltiness. It is a great combination/bite of food.  Their wings and their pizza are also good. Everyone in the family can find something on the menu.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5JVY32_bmTBfIGpCCsnAfw"
  },
  "wWMoe-smld6v0YNxYdwEag": {
    "date": "6/20/2017",
    "text": "Service was the <a href=\"/redir?url=http%3A%2F%2Fbest.pizza&s=64859d3ecb32f5e9842570c100d5edac4af6ee586939197fb2ee13c0ad8633aa\" target=\"_blank\" rel=\"nofollow\">best.pizza</a> is delish Always get dble meat on sandwiches, my fav is the pastrami Wait staff always do an excellent job",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MG0Pc-T_KhoFk3Oc82Hv_A"
  },
  "oF458JNF7goNH1atU5jFVw": {
    "date": "9/30/2012",
    "text": "I've been to several different Primanti locations within the city limits, but never to one outside and that is mostly a sit down/restaurant setting.  With that, I'm happy to say that I enjoyed it.  Within seconds of walking in the door we were sat and our drink orders were placed.  Unlike at city located Primanti's we actually had a menu to look at and I was a little mixed up.  I was surprised by the selections that they had.  I opted for the Coney Dogs.  Interesting way to make some dogs.  Instead of a traditional hot dog bun the use of Italian bread was a great way to go.  The dogs were topped with their chilly, filled with beans and meat.  Then topped with some shredded cheese.  A huge serving of fresh cut fries and a fried pickle completed the place.    Was loving  the tunes being pumped in overhead, a nice mix of older rock hits that just seemed to be the appropriate selection for such a place.  Sports memorabilia lined the walls along with some Pittsburgh themed items.    The wait staff was amazing, very attentive and on top of their game.  I can say that I will definitely revisit this location.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XzMcbDa0sjrqXTnb90HFSA",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Awesome coney dogs!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XzMcbDa0sjrqXTnb90HFSA/o.jpg"
      }
    ],
    "user_id": "ACwBMSJzgW6vOvV7vOrk8Q"
  },
  "sDQJNPqY16R4uFOi8Pk46A": {
    "date": "2/4/2016",
    "text": "Want to gain 2 lbs just by eating a sandwich, here you go! Stay skinny and good looking Pittsburg, or not!",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FdwtUY4rzpeBYiCAnSYfUQ"
  },
  "FzJvfBm7VuwMNR-GEBT-Gg": {
    "date": "12/7/2013",
    "text": "Growing up in the Burgh and IMHO they know what it takes to establish a decent bar and Pittsburgh does this better than any city in the USA. Now the food, decent bar grub and of course they are almost famous for their overstuffed sandwiches with everything but the kitchen sink thrown on there including slaw and fries.  It's the bomb - the belly bomb that is.  Now for the stainless topped bar, very cool and the barmaid working the Pens hockey game the night my buddy and I were there, very cool as well as she was always on her game.  Most of the patrons drinking these 23 oz draft beers, life is good in Pittsburgh.  It all seems to come together here at this Primanti Bros. location in the South Hills.  I enjoyed my visit and shall return.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "2FFV6At1U8w2nefNiI15vw"
  },
  "JpIa-KOKBV1HpdcaI7v_3Q": {
    "date": "10/11/2016",
    "text": "I just moved to the Pittsburgh area and could not wait to try this place out. On Sunday we were starving after moving all day and driving seven hours, we stopped by for carry out. Somehow we ordered six sandwiches but only got five. We called the place and somebody told us just come by and will take care of you next time. Well I just called and caught a massive attitude from a manager name \"Jamie\". All I wanted was the sandwich. One on Sunday and one today. But I got nothing, but an attitude from \"Jamie\". I'm not going to any of the restaurants in this chain if I can help it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uHyE6oz8dXTYCQ087JQYEA"
  },
  "060C7zHNscDINZFLq4doiQ": {
    "date": "11/16/2015",
    "text": "I've been dying to try these guys out after I saw a different location featured on \"Man vs Food\". The sandwiches, while good, were not as good as I'd hoped. But they are definitely big and hearty portions and decent, just not the best I've had. I had the ham and cheese, overall it was a bit on the bland side. I did manage to eat the whole thing with just a few fries left over (and somehow was hungry again within the hour!).  Service was good, everyone was very nice. I would try them again because maybe it was an off-night when we went and food not as good as usual?",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VoO-eDoNC87qolK8Fz9yPA"
  },
  "BdGR_xduQ2CLkEIgtR2eCQ": {
    "date": "3/24/2017",
    "text": "Great food and very convenient location. The people that work there are very friendly. And the atmosphere is great for sports games.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YFRp9i9sDuA1T5oMKq5cbg"
  },
  "R--EiGEHNHMWdmN0XSQCIQ": {
    "date": "3/5/2016",
    "text": "I had the Colossal Kicked Up Fish with the Old Bay fries!! It was very tasty! I also enjoyed an Angry Orchard that was ice cold. It was very refreshing since the fish was piping hot! Good service and speedy despite the fact that the place was packed Friday night. Will return again for sure!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RDwgRogBFp-RO5_mD6jPJQ",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RDwgRogBFp-RO5_mD6jPJQ/o.jpg"
      }
    ],
    "user_id": "DsC-mWFQNkfcemNzrnkbyQ"
  },
  "_FqzEMmkSyvE2rgLq4bwMA": {
    "date": "7/16/2016",
    "text": "A Pittsburgh staple, you must try a Primanti's sandwich whenever you visit the city.  I grew up in the area and wasn't much of a foodie in my youth (I didn't even have buffalo wings or Chinese food until I was 18), and I didn't care for their sandwiches when I had them as a kid.  Fast-forward twenty years and I love them... the vinegar based cole slaw is the perfect compliment to their hand cut fries.  I get the capicola with fried egg and it's spectacular.  I can't help but do a happy wiggle in my seat when I have my first bite.  We had Primanti's twice in as many days on our last trip to Pittsburgh.  You won't be disappointed... and if you are, you don't love food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "61nr50PqgF4WUWx4r-OcsQ"
  },
  "5cpYnDYE4-Vr3psRMc0Vsg": {
    "date": "1/23/2013",
    "text": "When first arrived in Pittsburgh, I heard rumors of this mythical \"Primanti Bros\" and of the brave men who had gone to slay the dragons that lurked therein, only to be dealt ignominious defeat by way of too much food for even the manliest of men to handle at once.  When I went, therefore, I approached the estabishment with mixed eagerness and trepidation.  My greatest fears and greatest hopes were confirmed: food, food, and more food.  Sandwiches as big as your head, filled with fresh-cut french fries, vinegary cole slaw, deli meat piled high, and at least 1000% of the daily recommendations for fat, sodium, and moral fiber.  I plowed ahead, entering uncharted culinary waters for the sake of glory -- and science.  And I staggered out a little bit wiser -- and probably much closer to death by myocardial infarct.  Glorious!  In sum, if you happen to belong to the (apparently very extensive) set of people who (a) value stupendously large sandwiches packed with more cholesterol than sense and (b) do not value their coronary arteries, then this is definitely the place for you.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "XifwGGNqOh3ipTL2Dq08_g"
  },
  "4AOXqQAHy2CYFC79qYvOdg": {
    "date": "11/16/2014",
    "text": "I love Primanti's. Over the years the style and flavors haven't changed at all. Oversized portions for a good price! Coleslaw and fries on the sandwich are a trademark of this place. Definitely a must to go to Primanti Bros!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "AT2py5BNTZFLZd1WL-pQWg",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. The Original",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AT2py5BNTZFLZd1WL-pQWg/o.jpg"
      }
    ],
    "user_id": "IIe6WIrx9ZJBzg7d7sEzSg"
  },
  "LcM4uw_J_ThDwK7zKFxJsA": {
    "date": "3/24/2015",
    "text": "This location of Primanti's gets my vote because of their rocking happy hour (4-6 Monday through Friday).  1/2 off any alcoholic drink?   Cheap pizza by the slice?  Yes please!  I still am partial to the Kielbasa sandwich, which is more than enough for one person, but one day I am going to try that pizza.  For now, it's pretty awesome that I can get three Captain and Cokes plus the Kielbasa sandwich for $13 and some change.  Bar service is good, though it appears that they do a shift change around 5, so there is always a lot of shuffling around that time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "h9LPugJk2cpIh0gmQb5LnQ"
  },
  "FM2qygD36ZouZjjdTdF3GA": {
    "date": "1/5/2015",
    "text": "Doesn't live up to the hype.  The sandwich was \"ok\".  The wait staff was friendly, and the beer choices are great!  I was expecting that a regular helping of meat on the sandwich would be overwhelming, that to order double meat would have been way too much food, but now I'm thinking a double meat sandwich would just barely cover it.  It all tasted good, I was just expecting more from my friends who swear up and down Primanti Brothers is \"the sandwich\".    The fried pickles were awesome!  I'd go back, but I think I got sold a story more than a sandwich.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KM8BdF1kAQeSLA63HABlcw"
  },
  "8OtDaMMjfTvjyKGXw8KRlg": {
    "date": "7/10/2019",
    "text": "Ok.  So first off .... if you want the original experience you have to go to the strip :).   The location  on Rt 51 in the Pleasant Hills area of the Burgh is one of their many other  locations - family friendly, clean, friendly staff and food is always good when you want a quick bite.   It does get busy when games are on .. they run specials too!   Tonight we got take out.  Was easy to place order via phone ( they also take online orders) ... food was ready when I got there ... quick walk up to the bar to get your order and pay.  I use their reward program ( in their app) and had a $10 bonus I could use!  Super easy and makes you feel like you got a deal!   Not sure who all is aware of this part but you can ask for the heel of the bread (the ends) and the sandwich is more like a hoagie ... see the angus pic attached for an idea of what it looks like.     Out of towners be warned.. the sandwiches are really good and come with  slaw (vinegar based not mayo) and fries on it ( what we call Pittsburgh style)!   Enjoy it!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_CFan5vaHjf1pPDvdc-feA",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Cap-egg and cheese.  Family fav!!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_CFan5vaHjf1pPDvdc-feA/o.jpg"
      },
      {
        "img_id": "kN0Ny0_pNCSfw5nX6QW3ZQ",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Angus in bread ends!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kN0Ny0_pNCSfw5nX6QW3ZQ/o.jpg"
      },
      {
        "img_id": "8SGs_z1JqT5EhnJH7XaVMw",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. To go box!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8SGs_z1JqT5EhnJH7XaVMw/o.jpg"
      }
    ],
    "user_id": "nQ1VkrRtTcmbaLsZOzvSpg"
  },
  "OdjnLLQYMt7ksiOd3dMZlQ": {
    "date": "2/1/2019",
    "text": "While it wasn't the original location downtown, it was close to the airport and we were able to try it out! The service was friendly and she helped us narrow down our decision on the large menu.  We started with an order of onion rings, which was so large that we couldn't even finish them. The sauce that came with them was fantastic. It was sweet but also had the perfect amount of kick.  My copilot had one of the burgers and I went with what is claimed to be their most famous sandwich. The \"Almost Famous Sandwich\" was massive but full of flavor. It is definitely overflowing with coleslaw and fries while the meat is the smallest portion. If I come back, I'd probably try a different version of this sandwich rather than the pastrami, which wasn't my favorite.  Overall, I can check this place off my list, but I won't go running back. The portions are outrageous for no reason and it won't be a cheap lunch.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DQJtGwPDuMyWd8JwMCI9vA",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DQJtGwPDuMyWd8JwMCI9vA/o.jpg"
      },
      {
        "img_id": "t1GCTFhIxfOxsz_lEqfPZA",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/t1GCTFhIxfOxsz_lEqfPZA/o.jpg"
      }
    ],
    "user_id": "hs8DpwHhp204x4tmuZR5ww"
  },
  "tYUUzFOVa5pfjPcwyhOkDQ": {
    "date": "8/13/2019",
    "text": "Please! Burnt msg filled with trans fat - wilted lettuce - moldy cheese and WARM beer",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VWmox-R0b2-RaWxkctlzJw"
  },
  "8CvIywI90CvaLelvevPIow": {
    "date": "7/18/2018",
    "text": "Primanti's always provides a great experience.  Whether you go to watch a game with a group or just a dinner, you are sure to have good service and great food.  The sandwiches are obviously what they are known for.  The cheesesteak, which is not really a cheesesteak, is my favorite.  The bread is so fresh, fries are fresh cut, and I love the vinegar based cole slaw.  It all just comes together to make the perfect sandwich.  For those who aren't into the primanti's sandwiches they have plenty of other good food for you.  The Buffalo chicken sandwich is a The pizza is surprisingly very good as well.  Update - try their Primantis Rueben.  It is a twist on a traditional Reuben, and was one of the best sandwiches I have had in a long time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "YZoAiM0fiI3CJvvO17K8Jg",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Primanti&amp;#39;s Rueben, sooo good",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YZoAiM0fiI3CJvvO17K8Jg/o.jpg"
      }
    ],
    "user_id": "1u80DXuswfp7hFW2NN9B-Q"
  },
  "-os6wgiyf0V4ZosEKE_f6Q": {
    "date": "3/28/2019",
    "text": "I love this primantis location. I've been here many times-it's my moms and I tradition to go every Friday night, and despite always being very crowded, they're very fast and friendly. I've had their sandwiches, fries, pizza, zucchini planks, queso, salads....it's always good. The sandwiches-ugh. So amazing. I LOVE their coleslaw, and the fact that it's vinegar based instead of mayo. It is the perfect addition to any sandwich. The pizza is always delicious, with a sweeter sauce and the perfectly cooked crust. Another good surprise to the menu is their chili, I get mine with onions cheddar and jalapenos. Be careful it's spicy!!! Overall, just a super good no frills place with great service and great food. A Pittsburgh classic and staple.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EOxmDIA_t5lcBWeYyOv9vw"
  },
  "Jt2iThRe8Fu6GAG-moAIPQ": {
    "date": "12/31/2017",
    "text": "I love visiting Primanti Bros every time we come home. It is the homestyle comfort food that I miss when I'm back in NC. We stopped at this location on our way back from a night out to grab a True Pittsburgh style sandwich for dinner.   We ordered waters for our drinks and had to send one back because there was stuff floating in it. Then, we went on to place our sandwich orders and my mom wanted the Angus steak. Our waitress went to log them in and came back to tell us that they were out of the Angus steak. My mom decided on a gyro instead and the waitress went to put that order in. She came back a minute later to tell us they were out of the gyro materials, too. Crazy. My mom wound up just getting a sandwich. (We've been to this location before and they've been out of menu items.)  The food service was quick once all of our orders were in and the sandwiches were actually put together really well. Sometimes, they're falling apart or the fries are everywhere.   I do still love Primantis but will probably just stick with going to another location (like South Side or Station Square) since we've not had great experiences here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mPTjB8GAXs41DMFiU8zsUw",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mPTjB8GAXs41DMFiU8zsUw/o.jpg"
      }
    ],
    "user_id": "QqdHAP9tSwjteG7b9q7sAw"
  },
  "bXLLSSgTgV_i_n9MCIZYTQ": {
    "date": "10/23/2018",
    "text": "I've ordered take-out from this location many times- never had an issue. Our go-to order is a turkey sandwich and a cheese steak sandwich. We also order fried pickles every once in a while. Always delicious. They pack the food up to-go really well, which is great. Service has always been friendly as well. Hoping to dine in at some point!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "DeXKbQYNx52OlOizobOLJw"
  },
  "snnYswSBC_tYkSHPkmMmlg": {
    "date": "10/4/2018",
    "text": "We love coming to the Primanti Bros restaurant on 51. Usually we don't have to wait for a table and if we do maybe couple minutes. Maybe we come at odd times because it always is busy while we are there. Even though it is a bit loud inside it's not annoying. So far to date all our waitresses have been pleasant. This particular day we dined here all our food was wonderful. My husband really likes their boneless wings and we always get the fried pickles. Yummm. My sons both eat here really well also and this is another reason we frequent this restaurant. Can't wait to come back again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W8EAuJDTuy9foHWGvoyGxg"
  },
  "tkrN7ETeJybO_7jKpNbFGQ": {
    "date": "6/20/2019",
    "text": "Always a go to location for us and this time was no different.  Hot sausage sandwich was excellent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JJ_P7WZw5fDWVLyvFgK2Nw"
  },
  "fmJQw5gsIeK63QEMDqB8IA": {
    "date": "2/17/2019",
    "text": "A couple years ago or more, this location made the best pizza for takeout.  Something has changed and it's not so great.  I'm not sure if the cooks have changed, the recipe, the oven....It's sad because it was delicious before.  It's still not bad but it has changed.  I always see a gray powder on the bottom and it has a bad taste and smell.  I really hope it's safe to eat and that it's not cleaner from the oven.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AaUuTDcnDlMcmD-z0oryeg",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AaUuTDcnDlMcmD-z0oryeg/o.jpg"
      }
    ],
    "user_id": "Bw6nZzS4HciYSkxiMnp1mQ"
  },
  "DsdFW3JGPvnNnMtva1PyYQ": {
    "date": "9/20/2017",
    "text": "Great, attentive service with great local Pittsburgh decor - Go Steelers!  The food, traditional favorites that add slaw and fries to sandwiches or pizza, is delicious!  If you want a taste of \"Pittsburgh\" look no further!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ASDyTrS8R6mXOv21QQ2d2g",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ASDyTrS8R6mXOv21QQ2d2g/o.jpg"
      }
    ],
    "user_id": "ICtC3GL1ssRWDkOA5tt4iQ"
  },
  "2QwwZ11cwEHVgVmj0KLhfw": {
    "date": "1/29/2019",
    "text": "Ordered take out - they were out of onion rings. They always are for some reason. My wings were either over cooked or undercooked so they weren't edible.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NWGfpIj3E4CZL3H0pjXwrw"
  },
  "cTMm3SMl-HjM02zACru5Zw": {
    "date": "3/2/2018",
    "text": "Inconsistent.  Sometimes the service and food is great sometimes the food is over cooked and the service is just ok.  The place has never been packed when we went in so that wasn't the issue.  I think they have expanded the franchise and lost the magic of the original place.  The quality of the ingredients doesn't seem to be the best either.  I think they rely on the tourist factor and their name recognition more than the fact they still make great food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "58tVksIIkoYTHpUbTwZb3Q"
  },
  "BFWQxpaPAZgJuLd9R4XtBA": {
    "date": "10/6/2018",
    "text": "Primanti Brothers has a reputation for fantastic sandwiches stacked high with meat and other toppings. They typically include fries and cole slaw on the sandwich. I prefer the fries & slaw on the side but have always found the rest of the sandwich loaded. Until today.  For takeout, I ordered a corned beef with everything and fries & slaw on the side. What I found was a very small pile of rubbery corned beef and a couple small tomato slices. They didn't come close to covering the bread. Needless to say I am sorely disappointed.  I gave three stars because the pizza & wings for the rest of our party were good.  I don't know if takeout orders don't get priority, but I'll think twice before heading back to Primanti's.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qhJX5tAk8kI2UvHk1w2j8Q",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qhJX5tAk8kI2UvHk1w2j8Q/o.jpg"
      },
      {
        "img_id": "D7nE1d_kYExY7J5_fWbOYw",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/D7nE1d_kYExY7J5_fWbOYw/o.jpg"
      }
    ],
    "user_id": "VrNcMg01LNNqWJo2KoklOQ"
  },
  "-nx4S8G5HUkI-h-z-T60oQ": {
    "date": "12/8/2017",
    "text": "This place was really good. We went based on a recommendation given to my sister. Since it was 6 of us we tried different things. John Michael was our waiter and he was amazing. He was very attentive. Now when it comes to the food we loved the queso, mozzarella squares, wings and Sangria. Neither one of us enjoyed the sandwiches. We all agreed the sandwiches were dry and more bread than meat. I wasn't a big fan of the fries on my burger but the coleslaw was really good. Happy hour was from 4-6 although the website says 5-7 but I still enjoyed the red Sangria. This was a great recommendation and I could see myself returning especially for the wings when in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qmO1jsUwOSSIE9eAOryuZw"
  },
  "jsVQTrFtQ0j4BlDYjwSibQ": {
    "date": "5/21/2016",
    "text": "Love the garlic parm wings and this location did not disappoint once again the food was excellent the service was good  EXCEPT... if you have leftovers... We had a table of 6 with an $80 bill needing a box for pizza, fries, and 1/2 of a sandwich...our server brought the box for the pizza and 2 pieces of paper for me to wrap a wet sandwich in. I asked what the paper was she said \"that's for your take home sandwich\" \"ask my manager, that's what you get now\"... Disappointing if that's the case, they do have boxes available if you push back. I go out to eat to keep things simple, last thing I want to do is origami my food container.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "v-q6JbJnbbVF9tLqY_QdgA",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Corned beef and cheese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/v-q6JbJnbbVF9tLqY_QdgA/o.jpg"
      },
      {
        "img_id": "NTwOZKa4zZMvFgXVip513Q",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Roast bee and cheese",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NTwOZKa4zZMvFgXVip513Q/o.jpg"
      },
      {
        "img_id": "xuLEyv8h_NWEEY3BZXjoRA",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. HBK exposed",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xuLEyv8h_NWEEY3BZXjoRA/o.jpg"
      }
    ],
    "user_id": "ulQ8Nyj7jCUR8M83SUMoRQ"
  },
  "2EnQFpwyu98e-S9HCzugeA": {
    "date": "1/2/2017",
    "text": "Primanti Bros. is never a bad choice. Great food and great place to watch sports. They always have good beer specials and recently added specials for after 9pm. The happy hour is always a plus, being half off all drinks. If you have never been to Primanti's before, you must try one of their famous sandwiches, piled high with whatever meat you want, French fries, cole slaw, and tomatoes. The Pittsburgher is their number two best seller, with their number one seller being Iron City beer. If you live in Pittsburgh and have never been to Primanti's before, you should go ASAP.  If you are a visitor, this should definitely be on your list to visit while you are in town!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BJNnBySyTh82A3flvbLfsA",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. The number two best seller; the Pittsburgher, with a fried egg.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BJNnBySyTh82A3flvbLfsA/o.jpg"
      },
      {
        "img_id": "q5vRz278lJ6cwsJ4-nvyRQ",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. You can&amp;#39;t go to Primanti&amp;#39;s and not get one of their famous sandwiches.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/q5vRz278lJ6cwsJ4-nvyRQ/o.jpg"
      },
      {
        "img_id": "NCbAKKm6Lm55XvGMhYuUkQ",
        "caption": "Photo of Primanti Bros - Pittsburgh, PA, United States. Primanti Bros. - Pleasant Hills",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NCbAKKm6Lm55XvGMhYuUkQ/o.jpg"
      }
    ],
    "user_id": "wrsj5oMHsRzouMNuZlatbg"
  },
  "Nawnqwny8zN6W-FOmbI2bQ": {
    "date": "4/5/2018",
    "text": "The service was decent but my sandwich was terrible & had to be sent back twice without a decent apology. Once it was almost correct, the meat & bread were both cold. It was probably the worst lunch I've had in a very long time.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cL0Nj40PkWO5e67pfCWJYw"
  },
  "mzqsJFrwJS4LNFpBVRDnVg": {
    "date": "10/9/2018",
    "text": "I had the same server twice when dining in, her name was Tara and both times the service was horrible! Not only was the bar out of 4 kinda of beer that I consecutively tried to order but the server Tara was extremely ignorant about approaching me to tell me, I waited over 20 minutes for a water white I watched her stand and talk to other employees, it was not busy in there as I came in around 12 o'clock noon.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KpKmwM1-0ORTJ8SvYqhZew"
  },
  "ahlonBc-iMSNbmRF85S6Tw": {
    "date": "5/9/2017",
    "text": "Oh, what can I say about Primanti Bros.  My husband and I ate there because we were told we had to try it as it's a Pittsburgh institution.  The fried zucchini appetizer was alright. I did like that it was cut the long way. The sandwiches were not appealing. I had the pittsburger. The meat had no taste and the fries in the sandwich did nothing but add starchy, film to the roof of my mouth.  My husband had the Carolina pork, which was better, but only because of the BBQ sauce.   We were seated promptly, but the server barely looked at us when she spoke and twice I had to ask her to repeat herself. (I do not have bad hearing.)  We ate the food. We didn't die, but it certainly was not worth our time.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ynQWcEUSahZ9uegM9kE9Qw"
  }
}