{
  "1VfdXCcTBMstvvlf04F7Kw": {
    "date": "11/1/2015",
    "text": "There is a reason I don't go to Sharp Edge. Every time I get terrible service. This time I'm finally writing about it.  I had dinner down the street and left specifically to get waffles and a beer at Sharp Edge. Empty Sunday evening. 7 people at the bar, a manager and bartender behind the bar. 10 minutes pass and neither acknowledges us in any way. The bartender walks by a couple of times. The manager (I assume manager) comes out from behind the bar and stands next to me watching the football game.  Meanwhile, the bartender is counting her tips.  We just wanted a beer. This happens every single time I sit at the bar there. I live downtown and I am always looking for places to go. Service like this is why I always direct people elsewhere. I walk a few more steps to visit the neighboring establishments instead. Please find attentive bartenders (or other staff who will notice customers and prompt he bartender).",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "CtUsYYsJFd5QvMVJUOsTAw"
  },
  "j17DCgQLtggURZkESku7jg": {
    "date": "2/4/2013",
    "text": "I was in town for business and Yelped a place for lunch since I got in ahead of my co-workers. I searched for gastropubs at random and walked about 10 minutes to Sharper Edge without really knowing where I was going. I got a great vibe from when I walked up outside and knew I'd done well when I walked in. If you think you may like a Belgian gastropub then just go. They've got a warm and inviting air and the bar is killer. I had some mussels with bacon and blue cheese and a beer. The only thing that may have been lacking was some better bread to go with the mussels.  That's it as far as negativity. If they opened one of these near where I live, I'd go often. Sharper Edge was everything I was looking for and then some.  A shout out to Elizabeth G behind the bar. Great service. Thanks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FF9N2lYo_FDcMbkCF28d1g"
  },
  "gRabm_O5e0RQyKsF3Yuh6Q": {
    "date": "10/16/2012",
    "text": "I ended up here a few weeks ago for a happy hour with some former co-workers.  We arrived at around 5 PM on a Thursday to find the restaurant and bar area fairly open.  The restaurant itself has an impressive locked beer room when entering its space and a dining room on one side of the restaurant and a bar with high top tables on another side.  Since we were only ordering appetizers and drinks, we decided to sit at one of the high tops.  Thankfully we were there during their happy hour and so were able to get half priced Belgian drafts and 50 cent buffalo bites.  Our waitress quickly came over and took our orders and when all was said and done I had tried some mozzarella wedges and buffalo bites as well as a few beers on draft.  The mozzarella wedges were decent but nothing special and I was not a huge fan of the buffalo bites either.  It wasn't that the flavor wasn't good but they seemed to be somewhat overcooked and so not that great.  We also ended up staying past the end of happy hour and so our last beers were what I consider to be extremely overpriced.  Overall it was not a memorable trip to the Bistro.  The bottom line for me is that I will probably be back in the future but not necessarily by my choice.  They easily have the best selection of beer in the city proper and their food is good as well, I only wish that it wasn't so expensive.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4m9NXICYBC5i9t4aTt-I6w"
  },
  "5iEVADgW0iGLmsloCYpB9g": {
    "date": "2/10/2012",
    "text": "I've been to this Sharp Edge quite a few times.  I would have liked to give them more stars and was oh so close in doing so, but then I remembered a handful of times when friends and I went and they were out of \"fill in the blank of desired beer\".    I mean I can understand how this happens, but it seems to consistently happen at this location.  I typically order a Wittikerke and so far they've never been out of this one.  It's a wheat beer that I find perfect for the hot summers and cold winters.    As for food, I've had their mussels, buffalo bites, and their pizzas.  I've enjoyed each of those but I think if I had to choose a \"winner\" it would be their pizzas.  Their Jerk Grilled Chicken pizza is covered with toppings and I always have left overs.    This is very convenient for those working downtown and looking to grab a beer for happy hour.  I feel that it gets fairly crowded on Friday evenings, but most other nights that I've gone there's never been a big crowd.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "NnrCwpS1i5mZtkGGzmIk0g"
  },
  "1WSz-D_CdusszGSTqBVQRw": {
    "date": "12/19/2011",
    "text": "When it comes to relationships everyone who knows the benefits of finding the right person knows what it's like to be with the wrong person.  What I am referring to is the dreaded Ex.  Assuming they weren't flat out crazy or the epitome of the word scumbag you can bet your britches there were days even you yourself wondered if they ever had any potential despite the flaws.   Possible great things about your dreaded Ex:  You have fun, Oh you do and more. When you are with them you can be sure to have a great night.  They are appealing, the people they surround themselves with seem interesting, one could even say, inspiring.  Lastly the big fish is this one. They are convenient, very much so. It's Friday, all of your friends are busy and you are bored out of your mind...and I mean when was it ever a bad idea to snag a quick glance into Pandora's box?...  So here you are. It's Friday still. No plans but you oh so wish you had some. This is where Sharp Edge comes in. You will have fun, Hell maybe even a great time. The people there are interesting. The beer selection is from all over the world to keep you interested maybe even...inspired. All your other plans fell through so Sharp Edge seem like a great fallback, one could even say...convenient.   Like all Ex's you will feel one thing though. You will feel like this potentially great bar...isn't your bar. It isn't the bar you want to keep going back to. It wasn't your Bar from the start and it won't be yours when you leave.   Am I saying show Sharp Edge your sharp edge by cutting it out an as option? Not exactly but what I am saying is, this is one of the bars that will never give you your Cheers atmosphere that you deserve despite you not realizing it.  You can do better.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "mL3Cqv1m7W_N0CpqI1KlsA"
  },
  "Op2rZy_xJe2WVia0lNpZ5w": {
    "date": "8/24/2016",
    "text": "Very good beer bar, the food could be a bit better, but I was there for the beer first and foremost.  Will definitely visit again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q0nipv8mdlnMoCd2oQc_bg"
  },
  "HlnACJbu_IcKG64TNOu0tQ": {
    "date": "7/23/2012",
    "text": "I'm sure that if you like beer and you come for the beer, this place is going to be great for you. If you are coming for food, and especially if you are vegetarian, this place is to be avoided. It's just incredibly overpriced for the quality of food.  Husband had the mystery beer, which he thought was meh. We started with the crab stuffed artichokes, which were legitimately tasty. Then, a salad and salmon burger to share. The salad was really one of the sadder things we have ever seen. Lots of lettuce, little to no toppings, and the grilled portobello mushroom was small and shriveled, rather than plump and juicy. The salmon burger was fine, but nothing to write home about. At the end of the day, the tab came to a little over $50, which just seems ridiculous, given the quantity and quality of food. We won't be going back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ckMFtaljrmXWaSiQqk9ZWA"
  },
  "k3Cuj27e16Ru92D5X1Eq6A": {
    "date": "4/24/2012",
    "text": "We were there around 10:30 on a Friday night, looking for some post-concert dinner. The bar part looked more hopping. The dining part was decidedly not. The food was at least cheap, thanks to their half price munchies menu after 10pm.    I tried the individual pizza. The cheese was rubbery, the toppings scant, and the crust resembled more of a quesadilla than a pizza. The sweet potato fries was the highlight of my meal.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tGx9-4LpdahotPuNuVfNVQ"
  },
  "_PpHQoikrQh0edCrAUEoog": {
    "date": "10/11/2012",
    "text": "I blame this place on getting me hooked on Belgian beers, and starting me down a long dangerous path to a more empty wallet.  I live nowhere nearby here, if you haven't noticed.  That being said, about once a year I make a pilgrimage to Pittsburgh, just for this place alone.  I could write pages upon pages about how amazing I find this restaurant, but I'll try to summarize it real quick:  The food is fantastic, and I've never had a bad meal here.  Depending on what's in season, they typically have some sort of \"wild game\" burger available.  The last time I went, they had a Boar Burger, which was one of the most delicious things I've ever tasted.  The venison burger? Fantastic.  Close your eyes and point to something on the menu? I can guarantee it'll be great.    The beer is top-notch.  An immense bottle collection, and about 40 taps means there's a never ending supply of something to quench your thirst.  Don't know what to pick? Try the daily \"Mystery Brew\", which is only $4 for a pint.  True, you'll have no idea what it is until the week after.. but I've never had anything bad, either.  Overall, if you're in the Pittsburgh area and you DON'T go here? You're seriously missing out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TuV0oExunGyW1Yf9Z0oIOw"
  },
  "E2erEMhi0z-UvnRlxFbEYg": {
    "date": "8/20/2014",
    "text": "I went to Sharp Edge as part of a group of 8, from work, for dinner.  We ordered the Mediterranean Nachos as the appetizer and I must say that this dish was the best part of the entire meal.  The Nachos part of the appetizer was deep fried pieces of flatbread, topped with Mediterranean ingredients.   I then proceeded to order a side salad, which contained a nice mix of greens, carrots, onions and beets.  I also ordered the wild boar meatloaf topped with a wild mushroom sauce, which came with my choice of 2 sides.  I opted for the Belgian Frites (because there were no mashed potatoes and the vegetable of the day which was summer squash and zucchini.   The meatloaf was a miss for me.  The texture was weird, slightly congealed.  The mushroom sauce was a miss as well.  I didn't taste or see any mushrooms and the \"sauce\" equated to juice in the bottom of the bowl that the meatloaf was served in.   The frites were ok, nothing spectacular, especially with meatloaf and the vegetables were just ok.   I'm not sure that I would return to Sharp Edge, just not my cup of tea, especially with so many other restaurants in the immediate vicinity.   A couple of my co-workers gasped at their dinner bills, when they realized that the 2 beers ordered were $7 each.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dvwFC5u09dbG_16AeNKBmQ"
  },
  "1kwpK94xjlZMvpb9IRsoWA": {
    "date": "6/28/2012",
    "text": "Boar burger. Boar burger. Boar burger. Boar burger. Boar burger. Boar burger. Boar burger. Boar burger. Boar burger. Boar burger.  Seriously. Get the boar burger. That's what I'm trying to say here.  It's one of the most amazing things I've EVER had, hands down and without question. I would there just FOR that item. We stopped here while at a convention in Pittsburgh, and... wow. Let's just say it's amazing.   The aioli sauces that come with pomme frittes (appetizer version) are all amazing. Three different dipping sauces... all majestic.  Of note: this place is good for goups of /up/ to four people only. If you need seating for a larger party call ahead and make reserverations, otherwise you will probably end up sitting at different tables.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "0BRSt_s0b6MbQ5cQ7oezzg"
  },
  "t-vfhGrvfQYkA-Eea7NRsA": {
    "date": "5/20/2013",
    "text": "Went to this place on 5/13/13 for dinner as I was traveling on business. It was pretty good they have a large beer selection and run happy hour specials throughout the week. There were a lot of business travelers there which was nice so people were friendly and you could strike up a conversation with folks. They also have three large TVs over the bar which is good for watching games. The food was pretty standard American fare.  Will go back when in Pitt.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XAHlf_gD_0kQ2XH_6JD2Xg"
  },
  "XZ2TvY6ZZGudepGBi2Y8FQ": {
    "date": "3/17/2014",
    "text": "I absolutely love the jerk chicken pizza! The beer selection is great and it's a good place to go after a concert at the symphony. The service is okay just a little slow. I wish the prices were a little cheaper, but overall a good place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "d6JltKIeAbPj415bwSm7eA"
  },
  "1qX5K4i7UAC9mBBZA3rwEg": {
    "date": "7/17/2016",
    "text": "Great selection of Belgium beers a little pricey",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ne7iv81ZRa3LSdBZJ4GYrg"
  },
  "PgRP68cD7gxVeSdStHPV_Q": {
    "date": "11/14/2013",
    "text": "Wonderful happy hour... Half priced drafts.  HOWEVER, I have never experienced service like this.  The hostesses and servers were rude to us, and we're talking about how annoying we were about 5 feet away from our table.  It was completely ridiculous.  We ended up moving to the bar in search of better service.  WRONG - the bartender was just as rude!  I was shocked.  This really unfortunate, because they have one of the best beer selections in the 'Burgh.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "m7bTLQo6u3PwdYyj22ITOA"
  },
  "NXcmlou_G5KC8sLM2Q6WhQ": {
    "date": "2/13/2015",
    "text": "I got the Buffalo Burger which looks good on paper, but seemed way over cooked.  Most people come for the beer anyway.  It usually doesn't disappointment, although too Belgian heavy for my tastes.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YTuksHb6YsMI62BqEG_eRA"
  },
  "KcNm_lgb7n3r8A2jCD78hQ": {
    "date": "5/1/2013",
    "text": "Excellent selection of Belgian and local beers on tap. Great list of Belgian, European, local and other beers in bottles as well.  Went two nights in a row. Night 1- awesome staff, very friendly and knowledgeable. Night 2- uninterested staff, they didn't even know what they had on tap, had two beers before they closed early with 30ppl still in the bar.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f5J-kgaQLzQ2DXlI8KEwFw"
  },
  "pZK2iM7H_VpSBjBCE8S2Ug": {
    "date": "6/16/2015",
    "text": "I ordered the sesame salmon salad. It came out late, and it was missing sauce, and it was missing sesame seeds, and to get it fixed I had to walk it back inside (I was on the sidewalk) myself because the service was slow. It's my own fault--at a place like this, you order a burger and a beer.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hm-LsLhrjShBozpXbRpdXQ"
  },
  "GdVgYCnpMCy8H94Z8jy3iw": {
    "date": "11/15/2014",
    "text": "Food is a little pricey and it's just okay. Not much on the menu except for burgers and pizza. Lots of different beers though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "An-4ic2-X0J6V4oWOZft8w"
  },
  "lCBpLAFgPsZ0jmp9m1Q-3Q": {
    "date": "9/15/2014",
    "text": "It's a nice bar that's not all stuffy like some other places. Decent food and huge beer selection. I would have given 4 stars but you really have to be a beer drinker to go here. My wife drinks Chardonnay and they only had 1 option other than the house wine. That option was $14 a glass. Little steep even for downtown. So overall I do like it here and the staff is friendly and quick",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "994PZt-iao0QQG5351c8NA"
  },
  "2J18YveOcbM-nikCqqMqTQ": {
    "date": "7/16/2015",
    "text": "Very excellent food (I had the very tasty quinoa avocado burger and soup of the day) and great atmosphere. Very reasonable price for downtown.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6LK8019L37_snmMv0UkvBg"
  },
  "LjJzw93uhNdVi2TMrz9kXg": {
    "date": "12/23/2016",
    "text": "The food is very bland, which is especially disappointing considering that it is pretty pricy. Service was mediocre, and the atmosphere was ok. There's literally nothing good about this place. I recommend going somewhere else!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xGtHcdxdwDh5ktk-9aKt5g"
  },
  "kZPrqPr6pNNwwsDQmqSq7w": {
    "date": "8/13/2015",
    "text": "I love Sharp Edge Bistro! They have a fantastic array of beers and good food too. If you like fruitier drinks, I would recommend the Pesca (peach) beer which is delicious. Sharpe Edge has many different types of IPAs, ciders, ales, and other American and Belgian brews so there is a beer that everyone will enjoy.  When my parents came to visit me from back home, we had a melted Brie cheese and apple slice appetIzer which was absolutely delicious. The Belgian burger (lamb burger) and the Belgian waffle fries are also fantastic as well. While the restaurant is a little on the pricey side, It is always such a worthwhile treat going to Sharp Edge Bistro!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-t9kQSbZ0Hnehu-L8GmSZA"
  },
  "qZKXzHkSwQxHa-iEjP7cGw": {
    "date": "5/27/2014",
    "text": "I agree with other Yelpers. This is a place in the midst of major identity crisis.   It's a Belgian beer bar. It's a burger joint. It's got a cafeteria feel going on with the cheap-looking tables and chairs. It looks like an 8th grader designed the logo and menu and artwork. It's the kind of place I could see on Gordon Ramsay's show in desperate need of a makeover.  So it's 5-stars as far as the beer goes. I decided to gamble on the mystery beer for 4 bucks. It was a decent lager, but nothing spectacular. My wife and I each had a burger (BBQ burger and Belgian burger). The burgers were good, the fries were abysmal. I would bet my house that they were frozen and re-heated Ore-Ida fries. I've made them in my oven many times, but for $12 and $14 respectively, I'd sure hoped for a little more.   Bartenders were attentive and service was good. So come for the beer but skip everything else.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "qGDIsH6b4GTo37krG8ZfzQ"
  },
  "OzS6FX-zLBzIUvBMB_6O-g": {
    "date": "8/10/2016",
    "text": "Pretty odd place. Didn't feel very comfortable in the ambience. Not total hipster but it was just a weird setting. Not typical Pittsburgh. Food was eclectic and unusual. Decent meal. Nothing over the top. If you're looking for good Belgian beers this is definitely the place though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S_OS6YCQwIDvTpoVp1NMMA"
  },
  "wcJ5p3tUSFjHr4uuasUGwQ": {
    "date": "11/7/2014",
    "text": "I met up with my friend, Kris, because he frequents this bar often. He was running a little late, so I ordered a beer (Bavik) and some fried mozzarella bites. Tasty, yes. Once Kris arrived, we ordered more beer and food. I had the mild buffalo bites. They were not mild, but I had some ranch dressing to cool them down.  Once we were done eating, we migrated to the bar to watch the Pens game. The bartender wasn't very friendly and had some strange excuses for not having any game-time specials (Pens game, CLE/CIN football game). Kris and I had one more drink and left.  It was a strange night - I liked the food and atmosphere, but not enough to justify going back again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1C-aJJRIilfZRB4IxMZplg"
  },
  "yNLCSwzPqFLQktqvosS5Iw": {
    "date": "1/16/2016",
    "text": "Come here for the drinks, not the food. Wide beer selection but the food is overpriced garbage. The menu looks fancy but the execution is not there. For instance, the burgers. On paper, they sound amazing because there are a couple that are more exotic meats, not your typical ground beef. But the bun they put it on, ruins everything. The bun is a crumbly, dry Kaiser roll. The fries here are your typical diner wide steak fries, straight out of the freezer, with no salt or seasoning. And they serve them with an aioli which is ok, but a little rich after a while. Just skip the attempt to be fancy and serve it with ketchup, especially if the fries are anything but fancy. The buffalo bites here are just not worth the price; they are basically popcorn chicken drenched in wing sauce and they're charging you about a dollar a piece. One saving grace for their food is the mussels. The individual size is perfect for $10. However, you might need a side to fill you up, but don't get the frites (fries). You might be better off just getting the large order of mussels all to yourself. Like I said, come for the selection of beer. Save your money and get food at one of the places next door or down the street.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "2jKzO_01d12oiu-2bOYcYg"
  },
  "w5-2-AvsmKcb4OhggMt2wg": {
    "date": "11/10/2014",
    "text": "The service here was horrible. It was an extremely slow lunch and everything took way too long. The food(just sandwiches) took forever. My chicken salad panini was ice cold. When I told my waitress she said it was \"supposed to be cold\". Nevermind that I've had the same sandwich at the East Lib location and it was toasty and melted. Quiche was completely cold too. The waitress sat at a table we could see her at and bullshitted with her coworkers instead of ever checking on us. Terrible gross food. Overpriced (but great selection) of beers. Just go for the happy hour beer.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lVdnGNhEkUj1zZhgBk5Wog"
  },
  "iRA3ciHLTLz4SB5o-4zGCA": {
    "date": "9/18/2014",
    "text": "Wow, worst service ever! Took forever to come by, so long that the hostess actually asked if I'd been helped and brought me water herself. I finally gave up and got my beer at the bar, which was all I wanted anyway. The bartenders were perfectly nice and helpful, but my waitress, when she finally bothered to show up, overcharged me 50% for my one beer, when she had actually provided no service at all. I mean, really, the beer is that day's special, are you really that incompetent? Or do you think I won't notice?   Besides that, the place is harshly lit. Maybe that's the ambience they're going for, but it seemed odd.  Go over your checks with a fine-toothed comb, that's my advice.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "I8U8_AKJ-3dEAzeAkHczjA"
  },
  "LRxqYsNgIvDiB-Gfnmqw7A": {
    "date": "2/9/2015",
    "text": "Went here after a concert on a Friday evening.  We stayed at a hotel just a few blocks down.  We were very impressed with this place.  Our server was great and the food was delicious.  We decided to try the Mediterranean Nachos and they may have been one of the best appetizers we've ever had at a restaurant.  Seriously, order them!!    Our meals were very good as well.  I had the chicken and avocado Panini.  It was good, difficult to eat though.  He got the meatloaf and loved it!  I ordered the Sangria to drink, it was okay.  Not the best Sangria I've ever had.  A little disappointed with that, especially for $11.    Other than that, it was a great experience and fun atmosphere.  Would definitely go back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RHSHgYCbOBxVIP2oQNfQ-A"
  },
  "ettQQYvtibvYyBafAsGYmw": {
    "date": "9/9/2014",
    "text": "I am giving one star solely for the decent beer selection. Food is some of the most disgusting I've come across anywhere. Belgian my a**.  Frozen fries common at any truck stop across the nation.. Minuscule supermarket mussels. Everything drowned in gross butter. Really, a god da*n stale wedding dinner roll for the bread? All for the low price of $15! Lol. Thank goodness I'm not from Pittsburgh. If you want solid (edible) Belgium food check out Taste of Belgium in Cincinnati or Columbus.  Pennsylvania folks should be embarrassed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "a-e5JiJ2YvSO8nVQAY17EA",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. AVOID FOOD AT ALL COSTS!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/a-e5JiJ2YvSO8nVQAY17EA/o.jpg"
      }
    ],
    "user_id": "uvPU20qe6UCVEhDLtaJY2g"
  },
  "EB36ijOsxRnhz8fXFJQbpw": {
    "date": "8/13/2014",
    "text": "Suuuuper helpful and friendly staff! I left my credit card there last night after closing out my tab and called today to see if they had it.  When I did, the manager said that our bartender had gone running after us for a full block with my card but we were just out of earshot.  Upon picking it up, he told me that the guy had been incredibly relieved to hear that I was coming to get my card back.  How sweet is that? No one puts out that much effort these days!    So aside from having a great moral character, our bartender was clearly very knowledgable as well.  He made some fantastic suggestions for beers to try, despite hearing very little about our personal tastes.  I'm very impressed, and would definitely recommend!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iDqwR72K1RvutGk7mcDBFw"
  },
  "qM5cpE-punfzI8PQiftw9Q": {
    "date": "5/1/2014",
    "text": "Their beer selection action can't really be beat... The service isn't bad, but Aldo isn't overly friendly... I was waiting for friends, that ended up being very late, and no one said a word to me... I mean, I would understand if they were busy or something but it was 4:00 on a Thursday. Meh to service, yay to beer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "3DltS5Wr9MOntnc8StBFBA"
  },
  "SAVSO5AyOwEAJM4LOVBw8Q": {
    "date": "5/29/2016",
    "text": "Come to the area for work every year. Used to be a go to place by the convention center. This year went 2x and was disappointed both times.  Slow service. And poor service.   Good has gone down hill. For the first time in my life, I sent food back here on my 2nd visit.   With more options opening up, I can't see this lasting unless they make improvements.   Buffalo notes are still good, and I was told the burgers were good.   Still have good beer selection.   Maybe I'll give it a try on my next visit.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pmu93_uK0f6KqnqDdealvw"
  },
  "pbVHEDJdB0w1zDGx7vameg": {
    "date": "8/19/2014",
    "text": "I was pleasantly surprised by the crowd here on a Friday night. Downtown Pittsburgh can be a little dead on the weekends, but Sharp Edge did not disappoint us. It has a vast beer menu and some comforting appetizers for the late night crowd. We enjoyed some \"nachos\" which ended up being cheesy dip covered pita/bread triangles. They were like the Pittsburgh version of nachos. Delicious. They also have a great selection of New Planet gluten free beer, which made me very happy. They accommodated our large party of 16 and we had a great time. The service was fantastic and we definitely felt taken care of. We will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "u3OCn-7UTb2g_zIRXwrJdw"
  },
  "VlQQGCPTb9BPtlbh3xK6BA": {
    "date": "11/18/2015",
    "text": "The food here is simply not worth the price. I ordered the elk/bison/venison/Angus combo burger for $16, and was underwhelmed. It was the requisite med- rare, so they got that right, but that's about all. For that price I expect a hand formed beautiful burger, and I got a flat patty that reminded me of Wendy's, topped with a slice of cheddar cheese. They're putting zero effort and thought into the food here, and the people behind the line do not know how to cook.  All of those exotic meats? I really didn't taste them. The salad that I got with my meal was just ok, a little sad, really. I tried hubby's fries and they sucked. Greasy and flabby. These were supposed the be \"frites\", as he ordered the mussels. They are not. I mean come on, at least have some shoe string fries as a stand in if you're going to offer a Belgian classic. Like other reviewers, my guess is that folks come for the beer. I wish they were putting half the thought into the food as they do what's on draft.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "YrlNGnrofZHseVYxrLrvJA"
  },
  "QNNd1odaniKYxe6pwP5ggw": {
    "date": "12/8/2013",
    "text": "Okay so I am for sure a fan of the Sharp Edge!!!! I last had their burger known as the Belgian AMAZING!!! An incredibly simple burger with amazing results. The food is always great and the BEER oh my goodness the BEER!!! Tons of imports from Europe and great smaller micro-brews. AMAZING!!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "5XVGDqn9wdwG4c_T1o0XUw"
  },
  "8mEypJeE8UKt5Xes9PFuAw": {
    "date": "6/27/2015",
    "text": "Uhh, it's a great place if you're into the whole craft beer thing going on. They have a tone of selection. But I'm not.   I was looking forward to the mussels but after I'd ordered them, I was informed they were out of them. Wait staff should probably know what's 86'ed. Anyway I got some of the small boneless wings. Overcooked and flavorless. The soup was way too salty.   Like I said if you're into the craft beer thing, check it out. I won't go back for the food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UvrsOJNVqkFzf20r7rTPOQ"
  },
  "5IAeQSwiEDNmw7OPa5JG7w": {
    "date": "2/15/2012",
    "text": "Meh describes my experience at the Sharp Edge Bistro on Penn...   Good beer selection, and good menu selections... however, the food items seemed quite poorly executed when I was there... it was nothing to write home about.  Service was less than impressive as well.    Like I said--- a good work to describe this experience was indeed \"meh\".... I have had much better experiences at other Sharp Edge locations so I have to say that I will continue to patronize those locations and not this more stuffy and less pleasant experience.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hLVq7VSJBHZwqurwWoCmpg"
  },
  "TgtjZopHw0yFnujk7dNdcg": {
    "date": "5/10/2015",
    "text": "Great selection of (50 or so) Belgium drafts.  Literally something for everyone.  If you aren't into drafts then choose between 100+ bottles from around the world.  They also have a kitchen which is a little better than most other \"bar\" food.  The food won't keep you coming back though it's all about the drafts when you come through the doors of Sharp Edge.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "y2cuE0Y17dci1cmGkt-KTQ",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/y2cuE0Y17dci1cmGkt-KTQ/o.jpg"
      }
    ],
    "user_id": "n9ZrR1HOXHVe5PAmkGFTPg"
  },
  "FM0KXok1HVqFo1dL8j1FAw": {
    "date": "8/5/2015",
    "text": "I often go to Sharp Edge with my coworkers for their awesome Happy Hour. This location is only a block away from my office and is super convenient for any downtown worker. During happy hour craft and Belgian drafts are half off. They always have a great selection of draft beer and it's always changing, so even if you go once a week, there's always something new to try. They also have wing bites that are half off during happy hour. They are delicious. My favorite flavor is Buffalo Bleu. The bites are also available in tofu. I'm not really a big fan of tofu normally, but I actually enjoy these!  When I go to Sharp Edge, I usually always just get bites and beer, but I've had their other menu items a few times as well. Their burgers are very good.  As far as service goes, sometimes the bar area does get very busy and they only ever have had two people behind the bar max that also act as servers for tables in the bar area. When the bar is full, it sometimes does seem it takes a long time to put an order in. I'm guessing the bar is only SUPER busy during that happy hour time, so they wouldn't want to have more people than necessary there for the whole night. But if you plan on going, it is something to keep in mind!  Overall, really great place! I completely recommend it if you're looking for an affordable, craft beer happy hour experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "B3fVQWx-gb3ZEMwbjOjBrQ"
  },
  "A_PkjfyO2IjBMIsdv3y6uA": {
    "date": "5/9/2017",
    "text": "Terrible experience for a large group (~22) at lunch at Sharp Edge Bistro / Bistro Penn, while on a lunch-break at a conference at the Convention Center. We had a 12:30 reservation, and at 2:15, many of us left, looking to get back to our conference meetings, still not having been served food (but we had paid already, you know, to save time at the end when the clock was clearly ticking down on our 2 hour window for lunch). When at 2:10 the server said, \"You're food's about ready, I'm just going to bring some drink refills for you first,\" I insisted to skip the refills, bring the food.  While the server was nice enough, this restaurant really couldn't handle multiple large reservations at the same time (there were probably 4 groups around 2 dozen each). I can't tell you if the food was any good; I was one of the people who left after an hour and forty-five minutes.   If you're looking to make a reservation for a group while in town for a convention, don't just go for the convenience of the location.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9OSAsEr_KTn4DG7mw_Pl_g"
  },
  "s7SOpj9hfDdBZ_9_77Ns3Q": {
    "date": "9/28/2016",
    "text": "One of Pittsburgh's original craft beer bars in it's second location. They have a large numbers of beer on tap and while they specialize in Belgium beers, they have beers from other place in Europe and America as well. The bar is big but there are also a decent about of tables as well with a few places outside to sit. A nice place to go it you are looking to sit down and have a few nice beers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "zATgdMp_5gL4kYPu7aVdUg"
  },
  "qmjREZ8jNdK9KYHWDsmeQg": {
    "date": "6/3/2017",
    "text": "The Sharp Edge Bistro is located near the convention center, so I stopped in for a quick bite to eat.  The waitress behind the bar was great and the service was quite good.  The veggie burger wasn't very good though and the fries had no flavor and were soggy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cl94yObh8uT_qjjAwAQEqQ"
  },
  "7CtJ6UkDTgSWLSFdRox0Cw": {
    "date": "6/7/2013",
    "text": "Can I remember the name of the Belgium raspberry beer that I had absolutely not but I can remember absolutely loving it, in a way that I haven't loved any beer in a while.  Those Belgium have got a thing or too figured out about beer crafting.  I love this bar I think it is upscale with out be pretentious and the selection is hard to beat.  This is  great spot Downtown to chill after work and unwind.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "CIIHtILoj8xq2g8D54aVtA",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CIIHtILoj8xq2g8D54aVtA/o.jpg"
      }
    ],
    "user_id": "V7uS5US4oTf-S9u36HJQCQ"
  },
  "x7KWhKBYBaPHv8tmCwwF0g": {
    "date": "10/15/2011",
    "text": "Hmm, started with the pretzel rolls, wish I would have read the other reviews first!  They looked great on the October specials menu, but damn I agree they appear microwaved.  Sad, so much potential.  Thankfully they redeemed themselves with the burger, but their Belgian frites, ehhh...not so much.  Mine appeared burnt, and too greasy.  Service was quick and pleasant.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hn6bgCKb-cLvQ9GLAhUQMA",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Burger, good.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hn6bgCKb-cLvQ9GLAhUQMA/o.jpg"
      },
      {
        "img_id": "yBcNFUCH8UuxhC5H4z7Rmg",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Pretzel rolls, meh...no nice",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yBcNFUCH8UuxhC5H4z7Rmg/o.jpg"
      }
    ],
    "user_id": "nF2TR0yfB2tx3VzAMvdlgQ"
  },
  "HURr5PLMulRQ4mWT2Uo6Ow": {
    "date": "11/30/2016",
    "text": "Awesome food and drinks. It's great for larger groups. I've never been disappointed in their food and selections. Def a favorite casual spot downtown.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "hJFSuk7W0stwyGX0bpMhjw"
  },
  "wPFF0OXIRZI8FQ7xb2E4HQ": {
    "date": "3/4/2015",
    "text": "Pay no attention to Lindsay. She looks to me like a serial complainer. Who has the time to excoriate some girl trying to earn a living? You can take the measure of a person's character by how they treat people who can do nothing for them. Lindsay, you flunk. The word BULLY comes to mind. I'd bet a weeks pay she voted for Obama...TWICE!  Loved Sharp Edge. Get the Belgian Burger medium rare.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "fNQd6olDH2SBgZDcPLe8ZQ"
  },
  "lwvvfQCJXmDk8SpaBh9Hmw": {
    "date": "7/16/2016",
    "text": "As far as beer goes, this place is great. The staff, on the other hand, leaves a lot to be desired. When the manager says to a party of 7, \"it's time\"-after telling us that in \"10 minutes you have to get out of here,\" it's no wonder the staff is unhappy. Work on your management and manners, sharp edge. No thank you.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "TPHfddkYkrJR3JAJEt6djQ"
  },
  "Xu4enm2QEwyxI4phHhVolA": {
    "date": "9/25/2016",
    "text": "Came here at lunchtime on a Sunday. We asked the waitress for a few extra minutes to look at the menu and she didn't come back for 15 minutes. It took another 25 minutes for the appetizers (three soups and an order of provolone wedges) to come out, and the provolone wedges were soggy with fryer oil. During this time, our waitress only stopped by once to refill drinks, with no word on where our food was or when it would be coming. When our entrees finally came out, my shrimp skewers were cold to the touch and the dipping butter was grainy and starting to congeal. On top of that, our meal for four people was over $100 - way too expensive for the quality of food we were served. The only things that tasted decent were the Oktoberfest specials, and we ended up having to take most of our food to go because it had taken so long to come out.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "axNLhJHVL95Jwaf0os1hdw"
  },
  "2OwWEjk_PXIJ7m8BAlv6Kg": {
    "date": "6/17/2015",
    "text": "I had the short ribs very tasty Had a quick lunch say at the Bar Good service, friendly",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kKf7FFlDKJIBTYFEXTsnKw"
  },
  "brKJ8L67WwbnS0rnUAQHvw": {
    "date": "9/28/2015",
    "text": "If you're into barely palatable chain restaurant food this is the place for you. Basic burger, clearly frozen meat patty. Always judge a place on their burger.   The beer selection is decent and extensive selection of Belgians. Sit at the bar and have a couple but seek food elsewhere.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "a0BGRi6vaI3sBiEuV-bsPQ"
  },
  "LGI29sJLpiPMwwdf4CxrXA": {
    "date": "3/24/2017",
    "text": "The shrimp appetizer is a waste of money. They charge $12 for 8 frozen shrimp that are about the size of a quarter. The \"bites special\" is $0.60 for fragments of chicken, McDonalds nuggets would put them to shame.  The fish sandwich was bland, and that's even giving it more justice than it deserves.  Beer selection is decent and the fries are edible.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WeHAO-cK9szHkM1F6PsyvQ"
  },
  "NEtPlayz6xbvU4kskaj1bQ": {
    "date": "2/5/2017",
    "text": "The food was really good.  They had a lot of vegetarian items.  I got the caprese panini and my friend got the buffalo bite salad... both excellent.  The restaurant itself wasn't full. The bar had a nice crowd.  Hope to see this place popping in the future!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UTQ6NNz8GGklGQY5RbX-mw"
  },
  "SYO4m54XlzPSg5fsX8u4JA": {
    "date": "7/24/2015",
    "text": "Worst staff of people. They don't care to correct their mistakes and will insult you if you try to order off the menu. Tried to order a Bloody Mary and brought me a V8 with no celery. No restaurant manners and wouldn't bring any plates and utensils.   It's sad, I'm born in Pittsburgh and in town visiting and the sharp edge was my favorite go to spot. I'm excited to see the new restaurants in the area because I need a new go to...now.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZkwOolfjeJdY2B_dMi94jQ"
  },
  "IjwBiMYRwB0ENOUaKPH0OQ": {
    "date": "1/17/2014",
    "text": "Whenever I end up here in Pittsburgh, this is one of the first stops.  An incredible beer menu as well as a really great food menu.  Bartenders are friendly and well educated on the product they're serving. A superb menu of imported, domestic, drafts and bottled beer from near and far.  If you've never had a Lamburger... This is the place to try it! Come on, live a little and try something new you won't be disappointed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DrYXaFxdQ_2tVfgE0h99lg",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Piraat..... A great Belgian IPA",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DrYXaFxdQ_2tVfgE0h99lg/o.jpg"
      }
    ],
    "user_id": "4lFYrZ6tuDa0B6eTeGPmHg"
  },
  "-ihwX9Ts6G8toTzj2WvVCQ": {
    "date": "3/11/2013",
    "text": "So I'll start with the beer.  Terrific! I'm a huge Blue Moon fan but tend to prefer Drafts over bottles any day. The bartender suggested that I try a certain beer (the name escapes me at the moment), if I was searching for something similar and it was outstanding!  We also had some delicious Brie en Croute (which has since changed I've heard). I could have eaten two of the amazing 'appetizer' portion.  Finally, the only issue we had, was their manager?/Host? sleeping (yes you heard that right!!!) in the 'lounge' area (complete with VERY loud snoring).  We were, at first, concerned that someone had passed out drunk and brought up our concerns to the bartender. She answered that she had 'only served him one drink'. Her boss(again- ?) went over and shook him awake. He fell asleep again not even 5 minutes later and wasn't disturbed again.  Who lets someone (even if they're a manager or Host/ess) SLEEP in their restaurant?! That's just bad business!  For the above, I have docked two stars. That was just ridiculous.  I'll go back, but I'll be sitting far far away from the sleeping employee who uses their comfy seating as his personal bedroom. See the picture in their Yelp profile for info.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EOIdNV_NcWfgKcP1iS370g",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Sleeping worker. Slept and snored nearly the entire time we were there.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EOIdNV_NcWfgKcP1iS370g/o.jpg"
      }
    ],
    "user_id": "xgo5LaVvc6Ci1uMkYlcCvw"
  },
  "eqHY5k7ur7bBvB5k75aBRA": {
    "date": "12/4/2016",
    "text": "Very good beer selection. You guys really need to figure out the ambiance. Bright lights = not good. Turn down the lights, and everyone will be much happier.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kWPhHCTTZBSEyBuQR2P01Q"
  },
  "fVSLzSZXOBsa9YkkCt3XaQ": {
    "date": "11/12/2014",
    "text": "Suggesting the bartender not refer to me (3 times!) as \"ma'am\" and should definitely avoid making recommendations which start with: \"well my grandma likes..\". Just a thought.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "0Yb8E4j6lHSDwcN_PT746w",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. A fair bit of bar area. good for business travelers.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0Yb8E4j6lHSDwcN_PT746w/o.jpg"
      }
    ],
    "user_id": "Mv2RWEOKXjsocE0VGSsQ7w"
  },
  "rZAVmvHSFBl8lv3lCvcMjg": {
    "date": "8/10/2016",
    "text": "Great beer selection and good food to compliment you drink. Sharp Edge is not a cheap place to eat and drink, but if you are in convention center area Sharp Edge is one of the better value dining venues. Stop by and have a beer, you will be amazed at the selection that is available.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "LzZPZDlXiEv9adPzdN4gzw"
  },
  "36nADZidAdpnKqnF69BpZA": {
    "date": "1/11/2015",
    "text": "Soooo we stopped in just for breakfast to kill time while waiting for my son. The place was empty and the menu was very limited. However the breakfast drink menu looked quite yummy. I ordered a hot chocolate which I could've made it better my self. Service was insanely slow which was odd because we were the only 2 in here. Anyways I ordered the sausage bites and potatoe hash. The potatoe hash was very good!!! The sausage bites were interesting. Overall I had an ok experience",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SGd4HquTjkqhD1QQbYuFQQ"
  },
  "M5twEWatEQ7fTiWeP6tdzA": {
    "date": "12/27/2016",
    "text": "Waitress said that they were out of the first beer that I had requested, \"Lancaster Hop Hog IPA\". So I asked about another beer. She said it was a DIPA, so I was excited. Turned out it was a holiday spiced beer..... when I told her and asked if she could replace it with another beer, she did, and charged me for the original and the replacement. Damn.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IwvbQpW-4WcNqHlirfkEuQ"
  },
  "nvDRbPJqWy_CpZgkgBMUwA": {
    "date": "10/9/2014",
    "text": "It's one of my more favorite bar/restaurants downtown. It has plenty of good food on the menu but the real draw here is the huge selection of imported beer from Germany, Belgium, and other place in Europe. If you're looking for a drink this is the place to go.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "cMW1HsxzAN0cFTffAS6hOQ"
  },
  "F9rpHzPPH26xbI7PbYKUAA": {
    "date": "10/3/2012",
    "text": "As far as Bistro's go, this one is really lacking.  The food is just not on par with the price point and the decor is kind of lame.  I don't know, I've been here for a few lunches and they were all so mediocre.  Probably come here for the draft selection and only eat if someone else is buying...  I guess what  I'm saying is you can pay 15 bucks for an overcooked grilled salmon salad and sit in a rec center type chair and wait 20-30 minutes for it or you can pay 16 bucks for the same salad but well cooked at the Terrace Room and sit in a lovely setting and be taken care of.  The soups, which are a lunch fave of mine, have always needed a ton of salt and pepper to swallow and were generally flavorless without.  The quiche, another go-to always seemed to taste like it was a week old and frozen and thawed more than once since.  Maybe get a burger or stick to the beer, but I refuse lunch dates here.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "lnJrAr7VQqwp5TqIqqqjmA"
  },
  "SDbjchw2Y6zCzWKXpDp2sA": {
    "date": "12/8/2013",
    "text": "This is one of my favorite places in Pittsburgh. They have an awesome beer selection with a great happy hour. Half priced Belgium drafts and the boneless wings. (Favoring the ranch flavored.) My coworkers and I constantly choose this place for our happy hours on Fridays. Mainly because it is hard to beat the atmosphere and the prices. Some of the bar tenders can be a little snobby, but overall it's worth your time and money.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Ce-tNu5GbdGBRH-ioT0GQ"
  },
  "2_rJ6efMJS05Cg582U2hng": {
    "date": "12/1/2015",
    "text": "It's a bit pricey, and the service is a bit \"relaxed\" during the lunch rush (we don't all get a 90 minute lunch break ya know). But, the food is really good, and they have an extensive beer selection. If you want to save a couple bucks and you're not too particular, order the \"mystery beer.\" It's like $4, and not even the person pouring it knows what it is!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kneey6lq_XsBoM6yN7IeHg"
  },
  "LKWWYTiDk_ZzSHpERsDIKw": {
    "date": "5/27/2013",
    "text": "The food was very good for being a pub. Had a few great beers and left with a growler. A perfect stop for a beer aficionado. Also has a nice location close to the convention center in the Cultural District.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KMBVv7JdLRtFWqvHLoH-Yg",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Beer on the left...house salad dressing on the right.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KMBVv7JdLRtFWqvHLoH-Yg/o.jpg"
      }
    ],
    "user_id": "i7s-PZxQDqc9_zeaWMU35Q"
  },
  "1F9DK5El-iDOtbZagVlfcg": {
    "date": "8/11/2015",
    "text": "Stopped in here for lunch during a conference. This location is about a 5 minute walk from the convention center. Ordered a few beers, good beer selection with a Bavarian influence. The food was mediocre. One of our party ordered a spicy sandwich. The waitress said it was spicy but the thing was over the top. I ordered a burger it was nothing special. The service was decent and by the time we left it was busy. Seemed to be a local business crowd from the area. I would be inclined to stop in here for a beer on occasion, either before or after dinner somewhere else. This place falls victim, like many others to the amount of quality restaurants in the area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E6JZ-wrvSfkmRwa56uIbCQ"
  },
  "2pOBI9aQ-wuP7dv1sccfEQ": {
    "date": "11/21/2015",
    "text": "Blackened salmon was good except for vegetables it served with, since I don't like onions very much. Service was great and staffs were friendly and helpful. Though a little bit noise with music and people. It was full of people on last Friday night, due to the light up night event.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "et4UIX9lhXl9AcSQ6RRR3w"
  },
  "ST3BsZxOIrwR4-q3AfVM3w": {
    "date": "7/22/2012",
    "text": "Didn't  love it, largely based on the atmosphere: it has a cafeteria feel, with too-bright lighting, cheap-looking tables and chairs, and cheesy wall decorations. The music was way too loud during our visit.  The food was just OK. For a starter we ordered the Bites and Frites. The Bites were very good, small pieces of boneless fried chicken tenders in a choice of sauces (we had honey BBQ, quite tasty). The Frites were meant to be authentic Belgian frites, but felt like a poor imitation; authentic or not, they just weren't all that good.  We then shared a classic Margherita pizza. The crust was very thin and crunchy, and hard to eat. The sauce tasted like it was nothing more than Hunt's tomato paste, straight from the can.  Service was attentive enough, and there are dozens (hundreds?) of beers on offer but, curiously, only one non-alcoholic beer (Kaliber).   Come for the beer, I guess.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ay4YlF8Bwhjyt2pjUMOPPw"
  },
  "BWjuLcjtmxcYx44Az87QNA": {
    "date": "10/14/2013",
    "text": "Fantastic selection of beers albeit at terrible prices.  I'm from NYC and had sticker shock when seeing what they were charging for many of the Belgian beers I can get at home. I'll be working on Pitt for the next couple months and was hoping to find my local watering hole.  This won't be it.  To be fair the staff was kind and attentive and they have great TVs for the games.  Would not deter someone from going here once.  Just wouldn't recommend it either.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cPfiMsNNt74178rz9_8dDg"
  },
  "3RtMZYCa-BoSeqmkREEkNg": {
    "date": "4/3/2015",
    "text": "Comfortable atmosphere, good beer and a few cider choices and big portions. A great hangout for friends.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hAR2Znsh-_hpaS4PbV1yGQ"
  },
  "j0e39UPy1SLScOUO3fkrYg": {
    "date": "4/2/2013",
    "text": "I really wanted to like this place. Unfortunately, it suffers from an identity crisis. Part Gastro pub, part sports bar. It's over-lit, with over-cooked, over-fried food. Frites that are really just fries. Best things: nice beer list, both bottle and tap. Cheese sticks were perfect.  Would come back for a nice Belgian beer if I can't find a better place for that Pittsburgh, but I hope that I do.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KOHZB_OHI6UqeDg49cz5Vw"
  },
  "IU_CMBNhsl2c7USFF7fIVA": {
    "date": "2/19/2013",
    "text": "Decent bar/lunch restaurant.  This is my first visit. 3 of us had the Belgium burger (lamb burger) and a side.  Sweet potatoe fries were decent.  1 person had the chicken sandwich special.  Prices are on the high side.  Probably gets convention center people on an expense account.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DEFk299pEBqKgUgQ703V9g"
  },
  "kqHOLuuXuiTPrVTZbqViEg": {
    "date": "12/21/2013",
    "text": "If you're in the area you have to try the Sharp Edge. Amazing food and even better beers. The staff is extremely friendly and extremely knowable about all the beers. I will definitely be back here when I'm in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PZmI73EOH_DdIfgYid5GWQ",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PZmI73EOH_DdIfgYid5GWQ/o.jpg"
      }
    ],
    "user_id": "IQpIM_71HijL1Y3Jsga8cQ"
  },
  "TZPN-VesbZLZDs3_ofL75w": {
    "date": "9/17/2012",
    "text": "Holy Moley, long time in the making.  Living out in Robinson my bus route used to take me by the Sharp Edge in Crafton/Thornburg on a daily basis.  A lot of my friends described it as a 4+ star establishment that leaned to the pricier side and served excellent food.  So needless to say I have been intrigued for quite a while, just had no opportunity to give it a try.  Skip to the future and I found myself eating lunch at their Penn Avenue location.  This newer establishment is well placed on the upper end of the Cultural District and from my initial impression seems like a hoppin' (pun!) place.  You know you're in food a good beer based on the displays and the atmosphere and no sooner the smells surround you that you know you're also in for some good eating.  I went with a burger and I was SUPERBLY impressed.  The ingredients were all fresh and crisp.  No seriously, the lettuce was crunchy (in a good way) while the tomatoes were plump and just outstanding.  They did over-do the burger patty every so slightly, but the flavors were not compromised.  Our party selected both regular and sweet potato fries.  The sweet potato fries could have been better, I wasn't a fan of the overcooked trend.  But their regular ones were done perfectly.  Since it was a work related lunch, no one imbibed.  So next time I look forward to trying out their selection of brews and maybe that blackedned chicken sandwich that looks uber appetizing on the menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "B-60XQ_fR72PevFzHM-ieQ"
  },
  "iE1roKUYFlG3Wq3617t1ug": {
    "date": "9/19/2015",
    "text": "Nice, comfortable atmosphere.  Just stopped in for a beer, East End Harvest is delicious.  Staff is friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WFZiP0v_ihhnqFEqH7thVw"
  },
  "UHvYzeC91UdwLBIub2OvEw": {
    "date": "5/15/2012",
    "text": "Looks appealing on the outside... and happy hours are quite crowded here.  However, after the rudeness of a bartender with tattoos, plugs in his ears, and who is balding, I won't be back.    OK, OK, I mean I know the Sixers/Celtics game was on... and maybe he wanted to be in character for the game, but did he really have to act like he was from Philly while he was serving us?  Jeez!    Anyway, we sat down ordered our beers.  My friend got his change thrown at him at the bar and the bartender seemed to be annoyed that we happened to be ordering beer... at a bar...  I asked him if they served fries (as I thought I had had them there before).  He promptly replied yes, and walked away.  What a jerk.  Nonetheless, beer selection is great here, and that's the only reason this place has one star.    Definitely plenty of other decent bars in Downtown to patronize.  Do not go here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "tOMztypmq06beq-zncxjiw"
  },
  "J0KKe7Gb-vX44b19nV70og": {
    "date": "3/28/2015",
    "text": "Yes, this place has a great beer selection.  But yes, it is overpriced even for the good beer selection.   Stopped in to get a beer, at the recommendation of a friend.  Beer selection was great but before even noticing that, heard bartender complaining that it looks like she isn't getting out anytime soon and she wishes everyone would just leave.  I get it.  I've been there.  but hopefully I didn't say it loudly in front of customers...REPEATEDLY.  Seriously, she commented no fewer than four times how she wasn't going home anytime soon now, how she would be here 600 hours more than she wanted to, how she wishes they would just lock the doors so no one else could come in, etc.  she was saying this to fellow bartenders who, to their credit, kind of just gave her the, \"yeah i know now please go work\" kind of response.    And it's not just that she was that annoying attention-wanting complainer who most of us have worked with before, but she wasn't doing her job.  she was largely ignoring the customers, who could hear her complaining, and when she did come over, she was like, so do you know what you want or not? umm, hello to you, too, and yes a list would be great, and so would a smile, btw.  but pretend one of the nice bartenders had served us instead. :) i ordered a beer without asking the price (bad on me, I know) and when the bill came: 10.50. ok, i know beer can be expensive, but this is the same beer that in boston is maybe 7.  so why is it more in this bar in pittsburgh? by a lot? when I said to the grump (why, i don't know), that it was more expensive than i expected (or something annoying, I know), she said, yeah honey, retail mark-up.  boo on you.  Later in my trip i saw the same beer at Sienna Mercato--a much nicer place, btw-- for 7.50.  That is $3 less.  THREE DOLLARS! Thirty percent less two doors down? anyway, overall there was a good beer selection and it did seem to be open late with a good crowd, but I'm guessing there are other places to go that would have better service and prices.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CYJNXUDHC-TdkYEkMXkcAw"
  },
  "ZRFAhk9Zo7G9Ro7eKRe0eA": {
    "date": "7/26/2016",
    "text": "Ate here several times and it was average at best, but more recently I had a poor experience that will keep me from going there again. They were Extremely rude on the phone. Some guy named Levi picked up. I tried to place an order and totally got blown off and basically hung up on. If you don't want people's business why answer the phone in the first place. I won't be eating from here again, and will be spreading the word to all of my friends and colleagues. Don't eat here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FFIKx6Z_3AfqDO4CALRqtQ"
  },
  "xEXA7HXBQnc731X6uyaFZw": {
    "date": "9/27/2016",
    "text": "We came here on a Sunday night after a Steelers game to grab a beer and dinner.  With it being fall, the pumpkin beer selections were in the air.  I tried two local pumpkin bets and ordered the Octoberfest sampler which included pulled pork, sauerkraut, and potato pancakes.  All were delicious and fulfilled the empty stomach.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zuILPSF7Et9BmdrvQ5Txgw",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Octoberfest sampler platter",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zuILPSF7Et9BmdrvQ5Txgw/o.jpg"
      }
    ],
    "user_id": "kIxOBilHAjCIRFBrXB8fDQ"
  },
  "cD4JzEChW9bn68H5F6qajA": {
    "date": "6/26/2016",
    "text": "While attending the Jazz Fest, I decided to try this place since it was the closest. I ordered the shrimp skewers and sweet potato fries. I was disappointed when I received only two skewers of shrimp for $12.50. Then, my sweet potatoes weren't even fully cooked as they were externally borderline soggy, and the internal potato was still crunchy. Now granted, this was place was packed inside and out due to the Jazz Fest so I may try again for better tasting food. I will say that their drink selection is extensive so that's another reason to return.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UyXqGEKod-veD6m6Hq0EDw"
  },
  "7OlwH40Nry0cxN_GZMJt6g": {
    "date": "5/6/2012",
    "text": "It was either Mike Ditka or Wilson Phillips who said \"You won't see me cry\"*   I mention that because I almost broke down in tears when I saw a couple order TWO ROUNDS OF BUD LIGHT at Sharp Edge Bistro.  That's seriously criminal....that place has some of the best beers in the world and they choose Bud Light.  I would have been bawling like a baby had they ordered an IC Light Mango!  Anyway, went here after running the half marathon to reward myself with good beer and good food.  Had the house triple IPA and a Corsendonk.  Both great!  For the meal I had the Belgian burger and frites.  The Belgian burger is awesome.  It's lamb and beef and it was perfect. Great food.  Ryan was the only bartender working and he was doing the job of two people because the place was packed.  The bar, the tables... all full.  Don't know if they have a bar manager but you need more than one bartender when you have 25,000 downtown for the marathon plus another 743 there for the Pirates game.   But he did a phenomenal job of keeping all the patrons in beer and food.  Definitely a great place.  I highly recommend if you're a Belgian fan.  And back to the abomination I saw with the Bud Lights, I only have this to say...  I'm gonna pull myself together And find a way to fight it Even if I have to hide it You won't see me cry....  da Bears.    Must have been Mike Ditka that said that.  _____________________________________________  *Here are the lovely ladies of WP- <a href=\"/redir?url=http%3A%2F%2Fyoutu.be%2FZRCeQahzdzE&s=756f418a0967af7289c1bb873f1f8d394ae36e4068c3d539b259a3515872c4f3\" target=\"_blank\" rel=\"nofollow\">youtu.be/ZRCeQahzdzE</a>",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SpV6BQu_gKQGmE02hGrCwA",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Beer stuff!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SpV6BQu_gKQGmE02hGrCwA/o.jpg"
      },
      {
        "img_id": "byEpXJTJkjZ60rcH0e4iAQ",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. There should be a law against people ordering Bud Light in a Belgian bar",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/byEpXJTJkjZ60rcH0e4iAQ/o.jpg"
      },
      {
        "img_id": "ndI5_Nf5GQTXAZtEyLjyJA",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Belgian burger",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ndI5_Nf5GQTXAZtEyLjyJA/o.jpg"
      }
    ],
    "user_id": "wzyGNvArcpUjZauRWFrKHA"
  },
  "xB8RMVkZSdhMh8ks1hs7-Q": {
    "date": "4/5/2015",
    "text": "Good food but better beers.  At least I think they had good beers, I'm having trouble remembering. :o)  The place is always packed, but they move people through a good but non-rushed pace. There are too many beers to ever try to work your way through the menu.  And I would not advise it.  The staff is friendly and knowledgeable of the menu and beers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "n2MvO88Gx4EBE1LUqFYC3Q",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Love that they serve the beers in the glass with the name",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/n2MvO88Gx4EBE1LUqFYC3Q/o.jpg"
      }
    ],
    "user_id": "6ymH4WgJJ6m6ynsKirm-ow"
  },
  "cmX3V33OIrf2Ci3A1vaFWQ": {
    "date": "9/21/2017",
    "text": "What a rip-off! Awful and disappointing.This was the worst lunch I have experienced in a long time. The food took an hour to arrive after our order, the service was terrible, and they charge $17 for a salad that is the size of most restaurants' side salads. I don't understand how they are in business when there are so many quality choices in the area. I will never go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XELCbeUXHJU3fp6yRXAwag"
  },
  "z1H8eH7SREf6DUC5rztyiw": {
    "date": "5/2/2017",
    "text": "We went as a large group (24ppl), as part of a break out from a conference.  I had to increase our numbers several times, prior to our lunch, and had no problems with the staff being helpful.  Day of, our area was set and ready before our reservation time.  We had WONDERFUL service from GRANT.  We were well fed, bills paid (separate checks) and out the door in record time.  Thank you Sharp Edge!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ecHp5ETj7pmoCTh38Yn4PQ"
  },
  "WYCIq69GcZmV6bI4pZ8EIg": {
    "date": "5/14/2016",
    "text": "I love this local chain. While the Creekhouse location is my fave, they are all wonderful. I like being able to pop in here after work for happy hour or to grab a six pack when going to a party. As with all of their locations the beer selection is out of this world.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "ob-V3fKzCEknIYBd2_cUnQ": {
    "date": "6/6/2017",
    "text": "I dined here on a week night celebrating a birthday, the list of Belgian beers was what brought us in. For it being a Penguin playoff game night I was surprised by how slow it was, albeit it was an away game.   We sat in the bar area and our waitress was very attentive. We started with a round of drinks and a few appetizers, the feta wedges and wings. I must say though the list of Belgian beers was impressive there isn't much variety for anything else.   For dinner I ordered one of the chicken sandwiches while others ordered mac and cheese, the Rocky Mountain burger, and the meatloaf. Though the food was fine we were surprised by the prices. Sure, wild boar meatloaf may cost a bit more, I couldn't believe a simple chicken sandwich was priced at $14 and with no extra frills.   Along with the high cost of the food we were very surprised when we received the check. Even local beers had such a high upcharge. Certainly the cultural district is home to more upscale dining but our experience was more on par with a TGI Friday's than any neighboring restaurants.   I would've given this spot 3 stars if it weren't for our post dinner experience.  Once we closed our tab we decided to finish watching the first period of the game at the bar. We all came from work and had bags and extra items to gather up, while my party was gathering our things to move to the bar I decided to order a round of drinks so that those in my party wouldn't have to wait. Once the bartender came over I ordered drinks, I was told she would need to see everyone's ID's-understandable. But when she saw that we were at the table she told us we had to order from our server. I tried to explain we were moving and was ultimately denied a drink until my whole party was seated. Within a minute our party had made its way to the bar where we waited a few minutes for her to stop back. The whole ordeal made us feel unwelcome that half of our party decided to leave. I get not wanting to serve those at a table but the fact that she didn't believe me (?) really rubbed me the wrong way.  All in all, over priced bar fare and an unfriendly bartender make the Sharp Edge a one-and-done for me.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3VSXGpollr0CAee0_BROtw"
  },
  "Uk-cYxcJ_3ElHPLle0oYyw": {
    "date": "12/5/2015",
    "text": "So, I wanted a sixer and I inquired of the guy at the hostess stand if sixer purchasing was still in play -- thinking it might not be the same hours as the bar -- the fellow I spoke with responded with a condescending \"yes\" and informed me that it'd be more expensive than a six pack of Miller lite.   While I admit that I'm not out shopping for a new yacht every fortnight, I'm not exactly living in the gutter. I mean, I showered today, I brushed my teeth, put on clean clothes, and appear generally well kempt.   So, I turned around and left with no beer in hand.  I'm not sure what the standards are for making a six pack purchase, but I recommend that at a MINIMUM you wear formal attire and have your driver pull the Bugatti directly into the entry way, just in case.   As for me, between this experience and an even more aggravating incident at the Friendship location, I don't think I'll be returning.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "f4OOZxwwUSSA-tqOndpmCA"
  },
  "LMQ_VYnPIR65qFTMY9CHUQ": {
    "date": "11/29/2012",
    "text": "If you want to get a drink while downtown, and you like beer, this is definitely your place. I went to check out this branch of Sharp Edge with friends last night and even from the beginning, we knew we were going to have a good night. Why? We discovered that there's actually an enormous wall of shelved beer right next to the door when you walk in. I've never seen my friends' faces light up so quickly. And the selection of type of beer is fantastic - Canadian, English, German, Irish, it's all here. I went with a Strongbow cider, but believe me, there's definitely something here for any and all beer lovers, and quite possibly some non-lovers as well.  Naturally my friends and I ordered some food to go with our drink sampling. I personally did not eat much other than a bowl of French onion-type soup, so I can't comment to much on what the menu overall is like. Here, however, are the observations I COULD make based on feedback from friends: the mussels were delicious, as were the fries, which came with a house dipping sauce; the burgers are quite large and not too bad, though not as good as the ones served at our city's many gourmet burger joints; my soup, while tasty, was mostly broth and croutons, and lacked the thick layers of cheese and onions that I would have wanted.  My conclusion - some of the menu items and recipes could use some improvement and prices are a tad steep, but our waitress was wonderfully attentive and patient, and the selection of available drinks even put some local breweries to shame, which is not an easy feat. I admittedly wouldn't go here JUST to grab some food, but the food paired with their amazing drink menu is enough of a reason for me to enjoy coming here on occasion.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M9TjYmTgHayJ22cNkyvW_g"
  },
  "WtvxTTNRmJTvCfAcaU4M-g": {
    "date": "6/21/2014",
    "text": "This place is fine. Good beer selection, but really pricey for sandwiches.  My Mom paid $9.50+ for half of a tiny panini with barely anything on it and pre-frozen fries.  I got a very good fish sandwich (and pre-frozen fries) for $11. The service was fine.  Nothing was great.  Everything was mediocre.  Now,  they do have a Saturday special... the same burgers for $6 that they sell for $14+ on the regular menu, but only from 11-3pm.  I don't think we'd have been as dissatisfied with Sharp Edge if we hadn't seen that special when we arrived at 3:30pm.  Knowing that we could have purchased burgers and cut our bill in half if we'd only arrived 30 minutes prior was like a smack in the face.  That's just terrible marketing. If you have that special only on Saturday, you should put it on cards on the table throughout the week and take them away promptly at 3pm on Saturday. Don't have it on the menu.  It makes people feel cheated.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Q_gNELKRElBS2gaHweoJwg",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Pre-frozen Belgian frites.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Q_gNELKRElBS2gaHweoJwg/o.jpg"
      }
    ],
    "user_id": "V4Yx_l2ksyVVs1qm_STstQ"
  },
  "6YnShX9IP1L6l__4TtqaBQ": {
    "date": "3/20/2018",
    "text": "This was really great place! Super casual and delicious burger. Very good gluten free options too! Recommend highly as a pub style dinner. The beer selection looked pretty extensive, although I don't typically go for beer, I would recommend that too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TBZubMcVu7lvfljTbMER4g"
  },
  "PFqBsMkUyYPuY9YuyLKEmA": {
    "date": "8/5/2016",
    "text": "We really liked this place. The food and service was really good with a good beer selection. Had a small but great outside seating right on the streetscape. Definitely would recommend you to try it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HwTOMcSaTneXv5I1JBuEng",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Chicken bacon avocado panini with sweet potato fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HwTOMcSaTneXv5I1JBuEng/o.jpg"
      }
    ],
    "user_id": "ZaYJ8aDQSS5LhGwGGmd6mw"
  },
  "C1Ts3bpL5Hz5cJy4pRK45A": {
    "date": "9/4/2017",
    "text": "Great food (love their fry sauce) but the selling point of this place is their happy hour. Half price on belgian beers! How are you gonna beat half price Piraat?!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IKqwv7nUvQ2ap502azKLSA"
  },
  "337ZwK6DJQx4LBAxu6nzDA": {
    "date": "12/9/2015",
    "text": "Came here for a private function upstairs. As such, the food was pre-set. They had something akin to popcorn chicken bites but a little bigger with an assortment of sauces, spanakopita, some kind of nacho dish with semi soft pita chips instead of tortilla chips, a cheese and cracker plate with meatloaf. Food overall was fairly so-so (but the spanakopita was great cause they were mini sized, so just meant more flaky pastry bits).  Redeeming factor was the beer selection though. Seems like they've got A LOT of different beers on tap, and it wasn't just the typical stuff you see in every bar (well at least for me, I'm not from Pittsburgh). For our private event, they had a selection of about 20 beers to choose from, including 3 porters/stouts. Tried them all, liked all of them.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0HicMOOs-M_gl2eO-zES4Q"
  },
  "dDt2w8EF3vowKmxY4Szr8A": {
    "date": "2/19/2017",
    "text": "We went to lunch before the Car Show. Three of us got the chicken almond salad panini. The chicken was moist and shredded. I really liked the ratio to mayo, and the cranberries added a nice tang. I had the fries, which were ok. Nothing special. My dad had the American traditional. He didn't like the potato hash since he said it was mushy. There were a lot of options for beer if you like to drink. The staff was all friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "hHFSpKcnDtJOs6M-JKFZ8Q"
  },
  "JOxJ7t3j_YtbDgOhjLm0xw": {
    "date": "3/22/2017",
    "text": "I am a regular here, it's the spot I come to watch Premier League matches every week. I know the staff, who are all incredibly friendly and super attentive. They have great bloody Mary's, an epic beer list, and shockingly amazing house wine from Romania (I know, sounds random, still good). I'm obsessed with their honey BBQ chicken bites.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QalijQo5z7k2tM54UCbhcw"
  },
  "R6BPrW16JCSg23MvWvCzXw": {
    "date": "10/22/2015",
    "text": "Snooty beers at snootier prices, incredibly basic microwaved bar food, annoying and weird 20-something guppy yuppies populating the bar.  Try and avoid.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9olpPYmaiCqIgOyLrmT24g"
  },
  "xq4e3tsz_TWA-NElz5F6Bw": {
    "date": "11/19/2015",
    "text": "IMO this location is underrated and overrated at the same time - if that's possible. On one hand, I dig the location, the menu and the beer list but on the other hand, the service is consistently some of the slowest downtown. Tuesday's service was pretty solid this time around, but the food I ordered was...not.  I ordered the Sriracha Mussels and a side salad.  I've never walked away unhappy from a cluster of mussels before but these little things needed to hit the gym big-time.  I was so hungry from my  1/2 ounce total of mussel meat (a guess) that I ordered another [fresh-baked] roll for a grand total of 3 eaten at that meal. The humanity.  Next time it's a liquid dinner of Belgian beer all the way.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-ARdx8hOcEWlMDjzwLYZ_g"
  },
  "0TdsSCBXDzjjY8iAtfRPMw": {
    "date": "2/12/2018",
    "text": "Really disappointing , this place has gone downhill. They don't honor the \"no wait\" app on Friday and Saturday nights. We tried to order wine, but were told they were changing wine distributors, and they were out of the ones we were interested in. We were seated in a booth, and the carpet running along side them was FILTHY. -- probably not vacuumed for weeks. We ordered mussels (their specialty) and the ones on top were COLD ... fresh out of the refrigerator cold ... they didn't even bother to stir them into the hot broth in the pot. We were having fun with another couple, so we didn't walk out, but none of us will ever go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G1hANYOOkR0ZOvuRvFXo5g"
  },
  "_7gBD8b3IxzboOHrqZbdrg": {
    "date": "1/3/2012",
    "text": "I had never heard of the Sharp Edge until this past week. We stopped in to grab drinks with our friends who were in from out of town. The atmosphere was very nice - not crowded or loud. There's a sweet wall of beer as you walk into the restaurant that summarizes their options. Our first waitress left after taking our order and another waitress took over for our table. I imagine it was the end of her shift, although we didn't get much of an explanation. I thought it was a little odd, but I understand everyone's shift ends sometime. They have a large selection of beers and the ones I had were excellent. We weren't able to have any food but I'd be more than willing to go back and give them a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iqhra1MRbjLWxrTkw4yqkA"
  },
  "CF96xuNqU4STK4ITsm_iUg": {
    "date": "10/12/2014",
    "text": "Food is awesome.   Beer selection is beyond compare. Manager rocks.  Bartender less than pleasant. Too much attitude and messes up orders without being all too busy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XE2VNf8filW2e5ukaGR2vw"
  },
  "ZXsNaYDQtzF8TdhyAj1VZg": {
    "date": "5/9/2012",
    "text": "In town for lax nec playoffs. Stopped in for lunch.  Beer beer beer, you need to stop here! The belgian burger us fantastic.  The mystery beer fun!  A must stop for burger an beer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Q0zOArcCEU9hKdvt0gJBQ"
  },
  "iIVYVzeRfyZT41EIiJKBBQ": {
    "date": "6/18/2011",
    "text": "(06/11/2011) Great casual place dahntahn for good food designed to go with great beers.  Extensive selection of Belgian (and all other sorts of) brews.  The mussels were delicious; tried the special Thai-style with chilis, ginger, cilantro (addictively hot, sour, salty) and the bacon and bleu cheese with cream.  The bacon in the broth ends up wilted, not crispy, but flavors the liquer with unctuousness and smokiness.  Both broths definitely sop-worthy with the French bread brought to the table.  The Calamari Study was described better than executed; fairly ordinary cornmeal-crusted and deep-fried legs on a superfluous bed of frisee and rather bland and disturbing looking bodies (like engorged ticks extruding their lentil stuffing).  The Flemish Onion Soup (made with Augustijn Abbey Ale), was mildly beefy, plenty oniony, salty, tons of gooey cheese on a thick slice of soaked bread.  The duck burger was coarse ground hunks of duck melded together on the bun; surprisingly juicy.  A nice complement was the dried cherry stone ground mustard.  The sandwich did have some slippage problems though.  Overall, service was fairly prompt, civil, helpful in suggestions.  Place was packed late on a Saturday night, looked like most people were there for the beer rather than the food; not hard to see why the place is so popular.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-YmuhcPYU9qj342Wl7j1sQ",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Flemish Onion Soup (with Augustijn Abbey Ale)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-YmuhcPYU9qj342Wl7j1sQ/o.jpg"
      },
      {
        "img_id": "HaukOLBvLAFpiAKvQz8e4Q",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Duck Burger (with dried cherry stone ground mustard)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HaukOLBvLAFpiAKvQz8e4Q/o.jpg"
      },
      {
        "img_id": "wAVTRPc1C2oZHbjqp1HF2Q",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Duck Burger (with dried cherry stone ground mustard)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wAVTRPc1C2oZHbjqp1HF2Q/o.jpg"
      }
    ],
    "user_id": "0aBTYXlP3z5nJ7okTARj8A"
  },
  "qHVvpKTDBCik5Yj_obyD7g": {
    "date": "6/24/2011",
    "text": "It is a great place to go for a happy hour (half price is affordable).  Great Belgian beer selection.  The food is good, but I highly recommend the bar.  Their fee for the private room is a little unreasonable.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VrZWYEMw3eGRH7FitQKYgQ"
  },
  "yIa6GfTCrhiljDS3NJEm-g": {
    "date": "12/30/2011",
    "text": "Incredible beer selection (I'd give it a 5*), but the food is consistently so-so (I'd give it a 3*).  The waitstaff is very friendly and attentive, but the bar area can get overwhelmed when the place is crowded.  They have a restaurant option for the family and a cool DIY dessert for the kids.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x6O5ioOhMSUkDCNN7eOPXQ"
  },
  "HxE3XRoxYvgZk_oFdZYh5A": {
    "date": "11/9/2012",
    "text": "have you ever seen miniature beers?!  well, they have them here!  my friend and i remember when the beers here were normal sized and resent the obvious attempt to increase profit by shrinking the glasses / pours while keeping prices the same.  the food is mediocre and overpriced for what you get.  also, table service was spotty.  it's too bad because we like the beer selection and the place could be special.  we'll pay for good beer but we're adamantly opposed to the teeny tiny glasses.  moving on!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "BwGBTrLkbibs_lzW0xyOlw"
  },
  "4Nc6tr2m8nHHCX0apFSV8w": {
    "date": "11/29/2011",
    "text": "A terrific place solely for the beer selection and surprisingly for the food... try the boneless wings as well as the pretzel rolls. Did I mention beer selection is great as well. A must try when in Pgh",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xJzuelYMGFLrbqPVfhWeLQ"
  },
  "ieRqsVBfnrigG7TBPZk0BQ": {
    "date": "1/28/2015",
    "text": "really disappointed went after the art crawl on Friday night. they ran out of mussels by 8pm? really? that's what they are famous for, at least what I have been told to try there. we had to sit upstairs, which for me is so under decorated for a bar. I felt like I was in an old folks  home. we were 8 and had to sit at 2 round tables..super awkward pushed up to each other. just cold and no fun. wont go again..to many other places to try",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sPxxHafrQ6PxKZsbMk2L1A"
  },
  "SbDvwcdcf4Wxv4dvikT6ew": {
    "date": "2/10/2012",
    "text": "Great beer selection. Food was good, with the exception of the Pomme Frites, which were average.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dYs_nCb5T4fXyfsOgWGmaQ"
  },
  "76bXdxyzS9FqBK4xjU3Wcg": {
    "date": "6/29/2010",
    "text": "Tremendous selection of beer on tap, especially for a visiting Belgian-lover.  Very nice ambiance.  Unfortunately terrible service.  We arrived on a Sunday at 7:30pm.  There was one server, no maitre'd, and two bartenders.  We were told a 15-20 minute wait.  We sat at the bar.  Initial bar service was good and prompt, but the bartenders vanished, apparently to take up server slack.  40 minutes later we were finally served another beer, after numerous attempts to get the barkeep's attention.  At the same time, the group who arrived after us was seated first.  At this point we decided to just give up waiting on a table and eat at the bar.  As we attempted to try and catch the bartender's attention again, we watched as he forgot about a waffle and burned it to carbon, which made us dubious.  After another 15 minutes of the bartender vanishing (and presumably another burned waffle), we decided to give up.  Total wait, including initial sign-in, and then waiting for the check was over an hour.  Great selection and ambiance, but terrible service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "AD6d511keMqewsUDs_aj0g"
  },
  "XE6CXS8goUeSQvENTRpXmg": {
    "date": "6/10/2013",
    "text": "This place was fantastic.  Great atmosphere and beer selection.  My wife and I ordered the Brie en Croute et Prosciutto and went back the next day to have it again!  It was fantastic.  I would go to this place again without hesitation.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "em9M4W5bCqD3HzrVFAJY_Q"
  },
  "9NVtL6IE1iyJdib1wd4htA": {
    "date": "6/13/2013",
    "text": "\"Awesome\" describes my experience at this joint.  In town for business and walked across the street from my hotel, saw this spot and decided to give it a try.  Fantastic beer selection, great service, and great food.  I started with the mussels with bleu cheese.  How sad I was that I've been eating gluten free because I would've loved to sop up that delicious broth with a piece of bread.  Followed that up with the ostrich burger sans bun.  Burger was juicy and perfectly cooked and the garlic aioli was a nice accompaniment.  I will definitely be back on my next visit to Pittsburgh!  BTW, the folks I've met on my visit to Pittsburgh couldn't be nicer!  I've become a big fan!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8JDPq29vutTHYbIXUlIWYA"
  },
  "DrfLKlB7RC5Lf5A7PqbMzQ": {
    "date": "2/4/2012",
    "text": "Nice Belgian draft selection and decent food after a long travel day.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zqHiKFvUl1l7eMDx4amUmw"
  },
  "j7wsb6i2ELBSbOTkln8zIA": {
    "date": "2/15/2011",
    "text": "Average food but friendly service. However, the Manager was extremely rude to my sister and me when we didn't realize that the elevated tables at the bar were part of their regular seating. In fact, he essentially made a snide comment about checking in with the hostess and then walked away even after we tried to clarify with him, not even bothering to turn back. It was maybe one of the rudest experience I've had at a restaurant. While the rest of our dinner was fine, I do not think I will make a recommendation to go here if will not be treated with respect by a Manager.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e3sriJfynFxdjKLYsUsWkQ"
  },
  "OLu15LTkFJHsh7qeXvBWog": {
    "date": "7/5/2013",
    "text": "We look forward to visiting Sharp Edge every year! They have a fantastic  selection of beer and food whether you're looking for a quick drink and appetizer or a full dinner. The Belgian Burger is particularly good, and be sure to ask for the herbed aioli to go with your frites - I can't get enough of it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U3E0OpcsU-ZQYDfzWzFpmA"
  },
  "aw3qZmu4GeQrxd9IJDbVpA": {
    "date": "4/5/2013",
    "text": "Came to Sharp Edge before a cultural evening downtown in the Cultural District.  Seemed to have many of the same menu items as the Sharp Edge in Friendship, although I wasn't able to tell if it's a perfect overlap.  Ordered a burger medium well and it ended up being very crispy and dry so will have to calibrate in that regard.  On the plus side many of the Belgian drafts were half price during happy hour (before 6:30).  I wasn't wowed by the food (although hard to argue with the frites) but pluses go for the Belgian selections and the proximity to the theaters.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2iD_yIdPmwbVdrlcr5loVQ"
  },
  "Z-q2O0b0FYEbEvRG6-Y_fA": {
    "date": "11/15/2016",
    "text": "was once so much better , dirty napkin, hair in food 2x, owner wont call back, whatever man!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EX8qOAfAXh6wTc0agiRLMA"
  },
  "qHwdnbjIzS-tb6LuuwgCPg": {
    "date": "4/17/2012",
    "text": "In my book this is a yuppy place with over priced food. Yes, there's more depth to the atmosphere compared to the rather pubish original location but somehow it seems their beers are more expensive (probably not True, but that's the feeling I get). I'll go back after kayaking downtown but I wont drive to the place.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VwAhjZPN7zJuyG03P8mp_w"
  },
  "yoeSWsUX61enl-gp_hBDhw": {
    "date": "6/17/2012",
    "text": "Tons of beer options and great tvs for watching sports. They even have gluten free beer options.  I like the black leather couches up front, comfy! They do offer seating outside too!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "A0ssDikuj0SQr9mVqnh91Q"
  },
  "lffxajd6GEirrcUDeRjW8A": {
    "date": "7/7/2015",
    "text": "It's not a waste of time - but I expected more.  There are a lot of Belgian beers, some craft beers and not much else. I've never tried the food so I can't comment on that.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1tc3YTz-yyHqLkkdQtJqDA"
  },
  "7V0JDslv2qYXMXNTeQ7dhg": {
    "date": "9/9/2013",
    "text": "Good beer selection. Kind of pricey. The food is descent. I like just going here for a quick bite! :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D_UF3zj7yUSGX_DvUO2LSA"
  },
  "VjejWiBkG6MfJ0E11FrgrA": {
    "date": "6/13/2015",
    "text": "Stopped in for breakfast. Delicious! I had the \"sliders\" - poached egg, hollandaise, and ham over mini waffles. Cleared the plate! Potato/sweet potato hash is delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "88UtiW8TExqLgd-q0V2HwA"
  },
  "1CcFgpHFoP6HJle8Z8Yweg": {
    "date": "6/1/2013",
    "text": "We used the private room upstairs to host our rehearsal dinner the night before our wedding. Our group was about two dozen and the room could probably hold twice that. The staff was very friendly and offered drink suggestions for anyone who wanted some guidance on the very extensive beer menu.   We were all blown away by the food. The set up was buffet style, starting with some boneless wings which everyone dug in to with gusto. Especially the garlic flavor. I think the group would have been happy with just the huge cheese plate and several hundred wings. But then we had salmon and steak for entrees, rice and sweet potatoes for sides, salad and rolls. Everyone was raving about the entrees and sweet potatoes. And for dessert we had incredible, rich chocolate Belgian pudding.   The space is functional and worked well for our event. I think it looks like a pub and you might expect some basic bar food to go with their huge beer selection, but they really deliver excellent bistro food in addition to the extensive beer menu.  Our guests seemed delightfully surprised by the quality of the food. Service was great and we actually came in way under budget for the dinner, so 5 stars!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HHI-MyTo0KkBQMa0kv21PQ"
  },
  "HVY5HsCEKyl4kvq3p6aF8Q": {
    "date": "8/28/2012",
    "text": "i've been to the sharp edge in friendship, but this is the first time i've been to the one downtown. it's pretty cool. i like the space much more, but everything else is about the same. i haven't eaten at this one (although the food in friendship is amazing, so i'd venture to guess this one is too considering the menu is the same) but i explored the draft list a bit more and was not disappointed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5QWtZdJlAxO_Ye4t6YB1jQ"
  },
  "HzdHdyv6Ie-nHS3SoBzdyA": {
    "date": "10/14/2010",
    "text": "It's not the one on friendship but it's just as good. Great for happy hour. Problem is you might get too drunk too fast!! Great service and the food is fattening and yummy!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FTwOgiBCYm2feXgx18P4Bg",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FTwOgiBCYm2feXgx18P4Bg/o.jpg"
      },
      {
        "img_id": "lcMvveWxxeH0PuoLZ1ZR3Q",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lcMvveWxxeH0PuoLZ1ZR3Q/o.jpg"
      },
      {
        "img_id": "CK1u5Xm2h2kwK4CYlC7K3w",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CK1u5Xm2h2kwK4CYlC7K3w/o.jpg"
      }
    ],
    "user_id": "Q0Bs5ObN4w2U5WHs2gLsPA"
  },
  "vZgLqlAkiuAM6YPLFjcZFA": {
    "date": "11/24/2012",
    "text": "This is the place to go if you like beer, you name it and it is there.  The food is another story.  The menu sounded interested but the food didn't live up to the descriptions.  The special zucchini appetizer was just deep fried zucchini.  The mussels ordered by my spouse,  were fresh but they were serve in a thin overly garlic broth.  The artichoke hearts stuffed with crab were the worst. The baked brie was OK.  If you decide to visit this place stick with the beer and french fries. The service was at best indifferent.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ui2Gzbuy-PmOMGQRtjLHoQ"
  },
  "8gfrYWlWdL4GNE-gd4yPwQ": {
    "date": "8/8/2012",
    "text": "Their beer selection was super, but pricey!  I got a Yuengling and it cost $4.75.  Hmm?  The service was pretty good and the food was alright, it just seemed a little overpriced.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pRRiH2PvzuXFI0EAYp08bQ"
  },
  "QQFv4A3pUl7LTNMPZq4d2w": {
    "date": "7/18/2014",
    "text": "this place is ok.  if you want a meal better than say Applebees it qualifies but there are certainly better options in Pittsburgh.  they do have a nice beer selection.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1R7q2e3SSgBVp1CL5HabPw"
  },
  "TVZUQKMi8S1Wo_aVVAPbUw": {
    "date": "9/15/2012",
    "text": "Great selection of craft and import beers, especially Belgian. Features many Belgian dishes as well, along with specialty burgers (lamb, buffalo, boar, ostrich, etc). Great appetizers. Downside is that everything's on the pricey side.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4nzgitp8kIFZe4qf0eB1-A"
  },
  "Uw0jXp40T6oRuPGsnjeCAg": {
    "date": "2/14/2014",
    "text": "Service was mediocre at best. Food was incredibly poor quality: literally had a freezing cold French fry served to me. The only thing they have going for them is good beer selection. Thus, one star for the beer.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mSzVGZo-2KFfclYtqxLoTg"
  },
  "duJQpqPoSPl-VeIocIzLzA": {
    "date": "5/18/2012",
    "text": "While in Pittsburgh waiting for a Megabus on a Saturday, I found this little restaurant around 8 PM when NOTHING else in the area seemed to be open (Did I mention this was Saturday, at 8 PM, WTF?!) Anyways, they have an alright menu, delish sweet potato fries and the salad I got was pretty darn good and fresh as well. Some of the beer prices were questionable though I stuck with soda for this trip. The person I was with also liked their food, they got a soup, sandwich and salad and had no complaints. This is just an average place, I mean the beer selection is great, it's got plenty of TV's... the service is not the best, and they seem unenthused to say the least. I doubt I will be back here...or in Pittsburgh but it's an alright choice if you are looking for some quick bar food, beer, and to watch a game it seems with low expectations of service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "--Yrq6JLmQNdbZkWJsHy5Q"
  },
  "ZVkjiYwi_BxadfjF6FWg3A": {
    "date": "5/16/2012",
    "text": "Great Belgium beer selection and enjoyable food. Our wait staff did a good job of pointing us in the direction of beers we'd enjoy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z4MQzyewTRzSoStg0NwL-w"
  },
  "XWOPSc0oONCq8xbsHkvRVA": {
    "date": "7/13/2014",
    "text": "For Belgian beer selection alone, this would be a four star place. It was busy at 7 on a Friday night, so there was a bit of a wait, which is fine since they have plenty of beers. However, the food is where it fell apart.  There was a lot going on in town that night, (a conference, a marathon, playoff hockey, etc) and they just didn't seem like they were prepared to handle it. The menu had some interesting stuff, but they were out of the one thing that I was excited to try - the poblano Mac n cheese. They were out of at least two other menu items we requested too. I settled for a margarita pizza, and my girlfriend had a chicken sandwich. Both just average - should have been better than that for the price. Sweet potato fries were tasty though.  This place could easily be awesome if they really stepped up their game in back of the house, but for now, it's just a bar.  It's a four as a bar, a 2 as a restaurant, so 3 stars it is..",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9vH4X_xEyau3eZpfEd58qQ"
  },
  "rzcGPQS4Ozy_3JtKgcGkIg": {
    "date": "11/3/2010",
    "text": "They should call this place the Penn Garrison Sharp Edge.  PG residents keep this place busy in the slow times. The beer selection can't be matched by any neighbors on Penn Avenue.  The food is quite good but the menu is a little thin.  They recently added a features menu which is great, these items are non-menu items and add more variety to the food selection.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W0MH969sEMRDoS8_CLsGoQ"
  },
  "HuvEfCO94j6ExN17vdZG_A": {
    "date": "11/6/2015",
    "text": "Unusual and tasty burgers - with a very good beer selection. The restaurant seems more Brooklyn than Pittsburgh. This is not a good thing or a bad thing, just an observation. If I only could have one or two meals in Pittsburgh, I would eat somewhere else. I enjoyed the meal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8Cai_xabK52gP-_-9NFNsA",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. If you like root beer, you&amp;#39;ll like this",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8Cai_xabK52gP-_-9NFNsA/o.jpg"
      },
      {
        "img_id": "3YbFxhD93gm7M3MnEwVXcg",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Piggy Bac - tasty!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3YbFxhD93gm7M3MnEwVXcg/o.jpg"
      }
    ],
    "user_id": "Bzq1tZI3SMsewc2FerFcOA"
  },
  "G_5DmD5oGRehlP_HRIgS5Q": {
    "date": "9/10/2015",
    "text": "Much like it's counterparts in Friendship, Crafton and McMurray, the downtown Sharp Edge is a haven for Belgian beer lovers. This place has been a goto pub for me since the day it opened (I was lucky enough to get an invite to their soft opening). I'm a huge fan of Belgian beer so I make it a point to visit her at least one a week of not more. My favorite is the Chimay on draft but I've been known to sample the rest of the drafts, including a Wittekirk, Duvel or their own special brew Over the Edge. These beers are tremendous but I'd recommend calling an uber after finishing, as most of the beers are high alcohol.   The food is also really good here. Whole nothing special, the Buffalo bites are a great boneless wing perfect for sharing over a few drafts. The mussels are also extraordinary. The burgers offer a unique offering with some meat not always readily available like Buffalo or Ostrich. The dick burger used to be the absolute best but had been off menu for awhile now. Perhaps a return is in order. For dessert, I highly recommend the leige waffles made to order right at the bar.   As far as the service, the bartenders have always gone above and beyond. They know the beers they pour and are always ready to make a suggestion if they don't have your favorite on tap or bottle. They also take the time to get to know their regulars and take care of them.   All in all I love this place and all the sister pubs throughout the city.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7WajxtIUzGjbqQZCwzKH8w",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Best bar tender around",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7WajxtIUzGjbqQZCwzKH8w/o.jpg"
      },
      {
        "img_id": "8WYOhvZIQFusp-QMbTkWcg",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Best beer period",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8WYOhvZIQFusp-QMbTkWcg/o.jpg"
      }
    ],
    "user_id": "Rw1AysawQfy1Y8kLlO55ZA"
  },
  "N0KI-CHnKHY2IZwV5reD4g": {
    "date": "1/2/2017",
    "text": "Came in during first night downtown. They have a great selection of craft beers and drink specials. The food is kind of a second thought. We both ordered paninis which were good but nothing really special. I would give this place a second chance but I wouldn't go out of my way with all the other offerings in the area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "svQNvrfilGddy07U5v5YzA"
  },
  "Mg4rN3lNKFEYdT_Tn9Xx4Q": {
    "date": "4/14/2015",
    "text": "Sharp Edge has around 5 outposts in the Pittsburgh area, each one differing in terms of menu items, decor, and general atmosphere. After having been to the more casual \"Creekhouse\" location in Crafton a number of years ago, I've been eager to try the \"Bistro\" that stands in the center of the city. When the lady didn't feel much like cookin' and got off work around the same time I did one afternoon last week, well, the Kaymobile was parked in her employer's free, private lot only a few blocks away...  Whereas the Creekhouse is homier, resembling a cabin of sorts, The Bistro is much swankier. Walls of shelved, bottled liquor capture your attention as you enter. Leather couches surround a coffee table in the corner. This is where the suit-and-tie set comes to unwind once the day of bean-counting, meetings, and negotiations is through, but that's not to say that this Sharp Edge is formal. No, I was welcome in my carpenter jeans and pocket t-shirt, and our hostess even gave us our own booth, secluding us from the drinkers in neckties and pencil skirts on what was a slow Wednesday.   Feeling indulgent, we began with the Brie en Croute et Prosciutto, a gooey magnum opus of an appetizer served with Granny Smith apples, the famous Italian ham, and toasted pita points. The titular cheese itself was encased in a phyllo-like pastry and was melted ideally, oozing its seemingly alive, oleaginous decadence all over the plate and onto the fruit, bread, and meat once the flaky hide was broken with a butterknife. This is why we eat brie. This is what we want in it. Furthering this appetizer down the path of depravity was a raspberry honey glaze that almost reached the brink of treacliness, causing us to ask if this was just too obscene for us. Were we deserving of such delights? Yes, we most certainly were.  Despite the vague \"Belgian\" theme (even though everything from Jerk Chicken and quiche to mussels and Wild Boar Meatloaf is on the card), Sharp Edges across the county are known for their burgers more than anything, and when that's the case, I lean towards the ground beef, chief.   As I just alluded to, exotic meats are something else Sharp Edges dabble in. I recall having an ostrich (!) burger at the Crafton restaurant. This time, however, I stayed within the confines of my home nation and chose a Buffalo Burger, one which I customized keenly with Asiago (in lieu of the Swiss it comes with), avocado, leaves of lettuce, and aiolis of the the \"herb\" and ancho chili varieties. I also kept the roasted garlic spread but eschewed the mushrooms. Sharp Edge lets ya get creative like that, which lead me to my next exercise in bizarre daring.   A quarter of that brie was still left on the plate. I didn't want it to go to waste. So I shoved it under the unctuous, sweet, medium-rare sirloin/American bison patty and went beserk. The young, milky cheese and soft and ripe. Fanned alligator pear brought a sense of comfort and lavishness as the mayonnaises clashed for pungent, condiment supremacy, the toasted Kaiser roll that held it all demonstrating the right synthesis of squish, chew, and absorbency. My (risky?) decisions had proved successful and were well-executed by the kitchen.   I'll be lenient and pretend the \"frites\" never reached my table as I am fairly certain they were flash-frozen and dumped into the fryer straight from a bag. They were just a little too pristine looking and had that telltale shape and texture. I ate 'em regardless. There are worse things to digest, I suppose, and the ancho chili mayo masked my disappointment. Hell, I was thinkin' fresh-cut, dunked in hot, liquified lard...yinz know of what I peck away about.   I came very close to ordering their tremendous Belgian Chocolate Pudding, and a few spoonfuls from Kay's goblet almost filled me with regret. Ah, the smoky, quivering, mousse-ish, bittersweet cocoa blob infused with tart raspberry couli had me pining for greener grass. There was also that fresh whipped cream, the toasted almonds, the chocolate syrup, the pirouette wafer jutting out...  Feeling like exploring \"foreign\" cuisine a bit more, I instead opted for the Liege Waffle and was not at all unimpressed with its crisp yet fluffy texture and its sugar-laden flavors. I doubt this is \"authentic\" to a T (I seem to remember reading that a coarse product known as \"nib sugar\" is used in Belgium), but once I started tearing off pieces of the golden gaufres de chasse and dunked them into the berry sauce and hot fudge, I was content with what would make for one fine state fair treat on a July evening, that checkerboard tissue serving as a quaint touch.  They may not be all that Edgy, but when it comes to their overall preparation of food, they sure are Sharp. And ya don't have to look sharp to eat and drink here. Don't neglect them when you're in Downtown.  P.S. The service was up to par.   P.P.S. I don't drink alcohol, so I cannot comment on Sharp Edge's beer selection, which is their specialty.",
    "rating": 5,
    "rated": {
      "funny": 10,
      "useful": 21,
      "cool": 17
    },
    "photos": [
      {
        "img_id": "n5KTNOJB162y7RfGoFGZFw",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/n5KTNOJB162y7RfGoFGZFw/o.jpg"
      },
      {
        "img_id": "_Gce2bfWRki4KJ4ciAH9ng",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Belgian Chocolate Pudding (back) Liege Waffle (front)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_Gce2bfWRki4KJ4ciAH9ng/o.jpg"
      },
      {
        "img_id": "jO0Y2myzQTVX9zigPvh3xw",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Buffalo burger with Belgian frites",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jO0Y2myzQTVX9zigPvh3xw/o.jpg"
      }
    ],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "QnesEFeZeJF6_Gz6jJ1anQ": {
    "date": "11/20/2016",
    "text": "Burger was obviously a frozen patty - dense, bland, dry. I found it humorous that I was asked how I wanted it cooked, as it came out a uniformly brown/gray color.   Absolutely will not be eating here again. I am surprised Sharp Edge is still in business with all the excellent options within steps on Penn Avenue.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LQOjEwmAWYngBGkZlx59fQ"
  },
  "LgrbAeiPfGIgdiF1sE_zSA": {
    "date": "3/11/2017",
    "text": "Good beer selection. The food isn't bad but nothing that really \"wow'd me\" at this location.  Also, the decor (specifically the carpet) is outdated.  Again, the food when I go here is always pretty good but they got some competition in the area so this location needs to step it up.   I will say...I live half way between their Sewickley and crafton location and I do really enjoy going to those spots but when I'm downtown, this is on the bottom of my list.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dUozAkhg4-u06zwE29hUDw"
  },
  "CqRndphgkzOPznyLhogwqg": {
    "date": "12/6/2016",
    "text": "I come here for two things: Belgian beers and Buffalo chicken bites.  I've yet to be disappointed by either.  The service is pretty good here, and it's close to the action near the Cultural District and the Convention Center.  Chances are that if you like beer, you won't be disappointed here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3FjdHwnoz-vfw6hBBtckqg"
  },
  "XNfBqU2F8ZWy99vCrmoYrg": {
    "date": "2/17/2015",
    "text": "I stopped by Sharp Edge with CM for a drink after seeing the PGH Ballet Theater's performance of Beauty and the Beast last Thurs. evening.  I'm not really a beer drinker, but I'd been to the Friendship location for happy hour with my former lab two years ago and tried the raspberry Framboise and enjoyed it, so I figured I'd see what this location has to offer.  When I arrived (at around 10:00pm), it was pretty empty, with only one or two other tables occupied.  I ordered the peche (peach) framboise ($8.50) and the Mediterranean nachos ($11.50) to share with my dining partner.  CM didn't order anything to drink himself due to having to drive afterward, but I can't help but wonder if it may have also been due to the steep prices.  (In a similar vein, I wonder if this is why it was so empty at the time that we came.)  Both the beer and the nachos were pretty good, if overpriced. If you're a non-beer drinker or don't like hoppy beers, I'd recommend trying a Framboise, since they're more similar to a cider than a beer, due to the fruitiness.  The nachos were an interesting take on the dish, consisting of fried pita bread topped with hummus, asiago cheese, and tomatoes and back olives. I wish they had been a bit more flavorful, given the ingredients, however.  Although I enjoyed the drink and snacks, the sticker shock of the price will probably prevent me from returning again, except for during happy hour.  I suspect the reviewer who said that they depend on conference attendees from the convention center across the street for revenue was on the money (literally). 3.5 stars.",
    "rating": 3,
    "rated": {
      "funny": 9,
      "useful": 16,
      "cool": 12
    },
    "photos": [
      {
        "img_id": "IIC6BAcls4RI9F8tMo5gDg",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Mediterranean nachos",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IIC6BAcls4RI9F8tMo5gDg/o.jpg"
      },
      {
        "img_id": "ssOugZusN8eJr8Lww5kZIA",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Peche (peach) framboise",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ssOugZusN8eJr8Lww5kZIA/o.jpg"
      }
    ],
    "user_id": "135DbbQnr3BEkQbBzZ9T1A"
  },
  "EjWXTxM5e51UNSm6FvBq4A": {
    "date": "6/23/2015",
    "text": "*** Update ***  Came back 5 months later to see if my last five star rating of the Bison Burger was an anomaly. It was not... It could possibly be the best tasting burger in the Burgh. And the toasted Kaiser roll it's served on holds up well to the juiciness of this burger. I highly recommend it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "je0cXoa4NFkNS7msONQ6Gw",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Bison Burger with Beef Veggie Soup",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/je0cXoa4NFkNS7msONQ6Gw/o.jpg"
      }
    ],
    "user_id": "cUqU7UfSaamDg0L5TIJPRg"
  },
  "ckUcqFDKrRZ7L_VGhEFMlA": {
    "date": "7/10/2016",
    "text": "Food is very average or below average. Better for drinking - if you like beer especially. If they could improve the food I would go again but it's just meh. Flatbread seemed like a safe choice and marked as a \"favorite\" but it was soggy and bland. Salmon salad was okay but salmon had very little flavor. Guess that's why it was easy to get a table. Overall as far as food goes, disappointing.  Shocked to see some reviews here mentioning good food. Have gone several times and food is always bad. It's bad chain food. Don't waste your money.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "25Z1S3ANy1EJTwF6hpuQFw"
  },
  "iZVHSFZydxTI81QlePfv9Q": {
    "date": "4/29/2016",
    "text": "I have had it with this place. I work in the Cultural District and love craft beer, so this seemed like a natural fit for me. The more time I spend here, the more I hate it.   Half of the time you need to light a signal fire to get the bartender's attention.   The beers are grossly overpriced. If you expect me to pay $12 for a New Belgium draft that's available year round, this better be PNC Park. Not to mention, there's no point in advertising hundreds of different beers in your menu if you don't ever have half of them!  The staff routinely cracks under pressure. A bar in the cultural district should be at its best when multiple events are happening at the different theaters, as well as major sporting events on TV. Instead, this staff makes me feel like I'm posing an imposition on them for trying to order drinks and food.   What really did it in though was having the kitchen close during the middle of last night's Pens playoff game. I thought this was ridiculous, seeing as I was hungry and would've gladly spent money on some buffalo bites. I was further insulted when a waiter asked me if I wanted food; he didn't know when the kitchen was open or not.   But the straw that broke the camel's back was when I saw people who came in after I was told the kitchen was closed who sat down and ordered food.   I will not be giving this establishment any more of my business.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 9,
      "cool": 3
    },
    "photos": [],
    "user_id": "wYQTWCcs-joYuls5NASALQ"
  },
  "pCE5QDp0aOtgUwyetqlO7Q": {
    "date": "12/13/2016",
    "text": "Insane beer selection   Chances are they will have what you're after. If not, these guys are incredibly knowledgeable about where to find it. Seriously great conversation and every beer under the sun...this could possibly be my next hangout.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "asbO7KLh00WrheXa2-IjDQ"
  },
  "g794qdl6ti69Eh1Pf6r8OA": {
    "date": "9/15/2016",
    "text": "I came here for lunch with a friend at noon on a Thursday.  The waitress came over and took our drink and food order right away.  And then never came back.  I order the chicken pesto flatbread which was supposed to be flatbread, chicken, pesto, roasted red peppers and asiago.  My friend ordered the burger with a side salad.    After about 45 minutes, I asked for the food to go since I had to get back to work.  When I got back to work and opened my food, I found flatbread with cheese and pesto - no chicken, no roasted red peppers.    If you are going to keep working on food for 45 minutes, you would think they could at least put all the toppings on it.  My friend described the food as \"sad.\"  Way too many good restaurants downtown to bother with this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "2JjI8DCyrpabtg36iL5lrw"
  },
  "An5LHNRMTWnSn5Lt0Qb2Dg": {
    "date": "4/22/2016",
    "text": "I've given this place a couple of tries. And I want to like it but I can't. A large draft selection, absolutely. The food is very much lacking. I feel cheated every time I come here.  The menu says panini. On the plate was pre packaged roast beef that they didnt even bother to unroll, stuck between two pieces of toast. That type of misleading labeling will get you arrested in Italy. Its not the point to trash a place just to trash a place. The cool hope for social media is that Management sees this and makes things better. I hope the place improves because downtown needs bars and restaurants.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "wGSyWECCQkAfFtZryEWvgw"
  },
  "2TNeANrCzLuwSx5vYA_zkA": {
    "date": "7/4/2016",
    "text": "We sat at the bar and ordered burgers and drinks. The burgers were pretty good and fries were good too- but a little \"potato-y\" for my liking. They were served with a garlic lemon Rosemary aioli for dipping. I personally did not care for this, but my husband loved it. Later, we ordered the O.T.E mussels with a side of fries for dipping. Neither one of us were impressed with the mussels. We thought both the mussels and fries lacked salt. The kind of mussels we got were nothing fancy and we thought we could pretty much make the same thing at home. You do get a pretty good serving size though, and food was hot when it came out. Do not order the OTE muscles if you do not like black pepper. It is loaded with black peppercorns, garlic, and a buttery sauce. I figured the pepper was going to be black pepper flakes, not black peppercorns, so that is something to note when ordering. It also has a strong black pepper taste, and even my husband, who does enjoy the taste of pepper was even a little thrown off.  The service was just OK. There were a couple of times we had to get the waiter's attention for another beer and food seemed to take at least 20 to 25 minutes to come out, post ordering. They were not crowded at all the entire time we were there. If anything, the bar only became full around 430 for happy hour,, so I'm not sure what the wait was on the food. They did have a decent happy hour special: half off Belgian and craft beers from 430 to 630. Bathrooms were clean though, and so was the rest of the restaurant. Also, it was really cold inside. I had a long sleeve sweater on and was still freezing.  I'm not sure if I would be in a rush to go back to this place, but I would go in a pinch.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vpH1oQvhPjykFGA_49QMTg",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Mussels",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vpH1oQvhPjykFGA_49QMTg/o.jpg"
      },
      {
        "img_id": "2P7I00UV0Ouc3VFAlypLPg",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2P7I00UV0Ouc3VFAlypLPg/o.jpg"
      },
      {
        "img_id": "YQScka2iAPmHgtStALddig",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YQScka2iAPmHgtStALddig/o.jpg"
      }
    ],
    "user_id": "bqPFHeXp8OkAGixJ_Pi3jA"
  },
  "htt-3h-4_Y38REsbSdSh1g": {
    "date": "11/5/2015",
    "text": "Great Belgium selection!!!  I left a bad review last time based on the individual server I got, and that's not really cool.  This place has a fantastic selection, and a knowledgeable staff.  FYI - they always keep Gulden Draak on tap!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EM8KzA5B33gW1Kn-Auqm_Q",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Bam!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EM8KzA5B33gW1Kn-Auqm_Q/o.jpg"
      }
    ],
    "user_id": "GjzcwrVcPksUBhks4_jgZQ"
  },
  "xiHK8PKtOEQluk-aldMIMA": {
    "date": "2/26/2017",
    "text": "Paid $30 for the Rodenbach Vintage 2009, but they gave me Rodenbach Grand Cru which retails for $12. What a rip off. Called them and spoke with the manager who passed me off to the bartender that served me who defended the sale was correct. Here is what they are passing off as the 2009 Vintage. <a href=\"/redir?url=http%3A%2F%2Fwww.craftbeerkings.com%2Frodenbach-grand-cru%23container&s=cd5e80cca105670d07a12c4b75519f29bf18e235c31c60d2c30d4247534092e9\" target=\"_blank\" rel=\"nofollow\">craftbeerkings.com/roden...</a>",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Eu-oCI7oo6AZ-7-BPKexOQ"
  },
  "UbKxaA1t_KqDzyTp8pZWRw": {
    "date": "3/15/2016",
    "text": "This is a great downtown spot for lunch or happy hour/dinner. I haven't eaten here yet, although their menu looks great. Typical American bar fare, but a lot of good things to choose from! They have an extremely large variety of beers, with A LOT of draft options. They have a great happy hour special that runs until 6:30, which I appreciate as someone who typically works after 5.  Our server was Justice and he was extremely attentive and friendly. I loved the fact that he came to check on us just minutes before 6:30 to see if we wanted to grab another drink before the special ended. Not many servers would go out of their way to do that and it was greatly appreciated!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "5IaHGddT0RLq1-S5LbP1iw"
  },
  "Hh0t79Rl5HfMSaBvaQF29w": {
    "date": "9/5/2015",
    "text": "Typically we drink wine,  but thought it would be fun to try a beer with our lunch for a change. The Sharpe Edge was the perfect spot to do that. A bit overwhelmed by the wide selection. Our bartender Scott ( great service by Scott) graciously guided us along the way. based on what we liked  Scott recommended the Petrus sour beer and the Wittekerke Belgium white. We loved both of the sections. As for the food we both ordered burgers to a specific temperature, and the burgers came out well done, not how they were ordered. The burgers are still very tasty but a bit upset they didn't come out to our requested temperature. Well garlic herb aloi that comes with the french fries was quite delicious. Based on this visit to the Sharpe Egde we would definitely come back the next time in Pittburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-FpX1cklDHdLlRVKKgJ28w",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Over cooked",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-FpX1cklDHdLlRVKKgJ28w/o.jpg"
      },
      {
        "img_id": "J9Nn0EtksJfJV8JRPAxI1w",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. My fav",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/J9Nn0EtksJfJV8JRPAxI1w/o.jpg"
      },
      {
        "img_id": "zfUh0MshdenE8O4mBL-kHw",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zfUh0MshdenE8O4mBL-kHw/o.jpg"
      }
    ],
    "user_id": "A4qI4DrptJrwiYZJY4IrVQ"
  },
  "sXvXfrdD_ej4_riAeM35kQ": {
    "date": "6/20/2017",
    "text": "Cajun buffalo bites were great at happy hour. Beer specials also great (1/2 of most drafts). Nice layout and comfortable bar and restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bBvb6ZWMYYxzMrXZLNK9iw"
  },
  "uZcOwPucVDj8OfCG-JSBKQ": {
    "date": "5/27/2014",
    "text": "I had the opportunity to really enjoy a few \"brews\" here and I was very pleased. I got great recommendations from the bar staff and they seemed to really know what I would like based on my taste for beers. They have a great menu that really offers a great selection and the food selection is just as great.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_p1KSIthe6VdQZKy0P7gOw"
  },
  "QU26UsDOXnEj4llezSo4tw": {
    "date": "1/21/2014",
    "text": "Great selection of Beer and good food if you pay attention.  Don't order a burger, concentrate on the mussels or entrees.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dGp2bJeyxNhDVIaEpkCNsA"
  },
  "6o3NB9mqXxr14THr6q1cjA": {
    "date": "8/6/2014",
    "text": "Great selection of beers. Selections from all over the world. Casual friendly atmosphere. Waiters are very knowledgeable and helpful in recommending beers based on likes and dislikes. Best way to go is a sample rack of 4 draft beers for $16. Each beer is 5.5 oz. Perfect for taste testing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FfVkMKsY-ITlfBYOe7jg2A"
  },
  "pq7AT2IgG73i2V9bh3XdGA": {
    "date": "8/2/2014",
    "text": "Didn't try any food but, for a quick tasty beer from a great selection, this is the place to go if like me, you are at the convention hall. Just a quick walk from their, service at the bar was quick and I can't complain about the East End Big Hop that I enjoyed there.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y-YGvupIgKu1_icxITEjXQ"
  },
  "JKV5iQQbM4TyvBWV9OAejA": {
    "date": "2/18/2015",
    "text": "Great beer selection. A couples beers and brie at the bar is perfect before hitting the Benedum.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "bBpm4zr1VXjZXa3UHNRn6w"
  },
  "OnWXxEF4DUin3oDGLZ1PTA": {
    "date": "11/15/2015",
    "text": "DIdn't have any food here but the beer selection is nice. I enjoy Belgian ales so I am biased as this place carries a lot of beers that I like. So if you are looking to try different Belgian beers under 1 roof, this would be good starting place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0hnfc4XlbDFMs69BaV5YbQ"
  },
  "aKVFGH5ylJutF1si-hr7UQ": {
    "date": "12/3/2013",
    "text": "Great beer selection and my burger and sweet potatoe fries were excellent. Definitely on my list when I'm in PIT.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ALrYmp0k-DzEgaGsOltdrA"
  },
  "rlpjeYiU4Y3cnJqDlRqP9Q": {
    "date": "1/8/2012",
    "text": "Great beer selection, average food.   I went to Sharp Edge Bistro during happy hour and took advantage of the beer special. Half off all Belgian beers, and their are plenty since it is a Belgian bar! They also had plenty of other styles of beer including a $350 bottle. Needless to say I did not get the expensive bottle.   For dinner I had Poblano Corn fritters for the appetizer and a lamb burger for dinner. The app was disappointing. The flavor was not bad but I had to search for the corn. They were mainly dough and had very little kick from the poblanos. The after taste was a little odd, almost flowery. The burger was pretty good and juicy. I would recommend asking for extra sauce/mustard since with the toppings and bread you lose the flavor of the sauce which by itself was delicious.   Overall, I would go back just for the beers. The food was nothing special but a nice way to absorb extra beer!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D9_2TAka66qKhXaGnzDceA"
  },
  "TShF3GJ8_gFNXXlPPzd7VA": {
    "date": "9/26/2013",
    "text": "I have never seen so many beers before.  All different kinds and styles.  Everyone is very friendly and willing to help you find that right beer to get your drunk, I mean satisfy your needs.  I will be making this a regular stop going forward.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qW-cnqEJ-ijC23GiuGQx8w"
  },
  "mWriuU_FdDTXqq9dGfYWkw": {
    "date": "8/17/2015",
    "text": "I dined here on a Saturday night with my friends.  We really enjoyed ourselves.  The food was good, and the prices were pretty reasonable.  I ordered the sriracha mussels as an appetizer, and I was very happy with it.  It had just the right amount of spice.  I then ordered the quinoa \"muffin\" for my entree because it certainly seemed like a unique option.  It did not disappoint! The salad it came with had cranberries, pecans, and feta, and the quinoa muffin itself was very tasty and surprisingly filling.  The service was pretty good, nothing exceptional, but we were seated quickly on a Saturday night, which was a nice change from most other restaurants in the area.  My only complaint is with the drink that I ordered.  I chose a beer cocktail from a menu that had no prices listed.  I understand that they serve craft beers, and that there was also vodka in my cocktail, but it was $15 when I got the check!  Considering that my drink was just okay and my entree was only $12, I found this to be a little disproportionate.  I would not recommend ordering one of their beer cocktails; however, I would still recommend the restaurant to anyone looking for a nice spot to eat good food and catch up with friends.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y4PuxA3yRL-j02kDMhy1zQ"
  },
  "a8GmGUup9JJwKr3-0orvww": {
    "date": "3/14/2015",
    "text": "I would not return. We had a very long wait, which I wouldn't have minded had I loved the place. My food was ok (got pizza) but my friend got a salad and bit into a large piece of jagged hard plastic (or was it glass? We weren't sure). Not good. The only pro was that the service wasn't bad.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xqi1yfndMgNJg5Rrnma-sw"
  },
  "OyQmAhAWgMbXVSua5pBLeA": {
    "date": "1/11/2014",
    "text": "Came in from tampa. Used yelp to find a bar, and this place has met all expectations. The setting, food and beer is great. Wendy, our waitress made our night  a great experience. If in Pittsburgh, this is a place you must visit, and please seek out wendy, her knowledge on belgium beer is remarkable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ru26HBJuXgfDFBVwMUiAQA"
  },
  "Ri2Fxm4mxFTOjbuwcV-v3Q": {
    "date": "8/1/2011",
    "text": "Bier, beer og cerveza!   This must be one of the best pubs caring microbrews in Pittsburgh.  Their selection and happy hour deals are great.  Keep up the great work, Scott & Co!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9QoXklTk-Fl1Q1Cy8fCbdQ"
  },
  "IeBK0U-RuIhNuq0SbxUBJw": {
    "date": "10/21/2013",
    "text": "Great beer, great atmosphere, great food, & a good portion size at a decent price. The evening started out with a glass of their smooth tasting Gulden Draak Ale. The Mediterranean nachos tasted awesome, while the shrimp and langostino pizza was loaded w plenty of shrimp, lobster and flavor.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U9t7n2-IsCTVaNE4-YmSGA"
  },
  "Vr1-ta8iFK5mjx6s0A6l5A": {
    "date": "12/12/2015",
    "text": "What a horrible experience. Watered down beers, horrible food. Had to wait 15 minutes just to be greeted at our table, then my partner's meal was brought out 15 minutes before mine. They said they would take my food off the check then didn't. There are much better restaurants on the same block. Never going back to Sharp Edge.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cTsfvsPjnQLxWnZgnzMyhw"
  },
  "fPDbKbfoNgCZ3ZPMopdinw": {
    "date": "6/8/2010",
    "text": "I have been looking so forward to the opening of this Sharp Edge location ever since I walked down Penn a few months ago and saw the sign that it was coming soon.  Finally, a place downtown for happy hour that is a little more relaxed and not focused on cocktails or wine!   I LOVE beer, and I love the Friendship location so I went to lunch on the first day that it opened, sadly sans beer since it was a workday.   It took me forever to decide, because everything sounded so great - and I ordered a hamburger which is odd because I really don't eat red meat!  I was swayed by the bleu cheese that came on it!   As with any new restaurant opening - there were most likely kinks to be worked out and it took us about 40 minutes to get our food.  The burgers were delicious though!  My friend got the BBQ burger and that will most likely be my next venture - or one of their pizzas!  Or mussels!    This will be a frequent spot in town for me and I cannot wait to update when I have a chance this Friday to try their extensive beer collection.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "tKlgOobycwQnoFgwLBOKQw"
  },
  "njAmwbPjRs8rikP5fN7ceg": {
    "date": "8/12/2011",
    "text": "One of my favorite places to find new beers right downtown and have been a somewhat regular since it opened last year for lunch and dinner.  I've been to many of the other locations, but the downtown pub has the best food.  The bartenders there also kickass and are very helpful and their suggestions of what one may / may not like are almost always correct.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Txkfkx_hp3MzejA5T1WyJQ"
  },
  "UYVhoNUk-Y-Vb12zSprz-A": {
    "date": "3/19/2011",
    "text": "This place has decent food at decent prices along with an impressive selection of beer, especially Belgian.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SlbGQDdJy319kMFlH3wp6w"
  },
  "SXjF5uBz-9e2BMXwHyjZ0g": {
    "date": "10/19/2013",
    "text": "I love mussels and Sharp Edge offers affordable mussels with awesome tastes!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NMkdeWDyqXT0kOLhxYcoCA"
  },
  "P-UeVCJG3Mj0cHowBsDHPA": {
    "date": "1/1/2014",
    "text": "Great beer selection, good happy hour specials, and the nicest restaurant of the franchise. Would recommend the ostrich burger, sweet potato frites, and waffles.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "owsX5JI9cHzkCiTvuVGhVA"
  },
  "0Zp9SVjxGKHPkAy7dXAdJQ": {
    "date": "11/25/2018",
    "text": "We picked this spot for dinner due to its proximity to the Pittsburgh Convention Center. It wasn't too crowded, thanks in part to the home team Steelers playing earlier in the day.  The bar has an international spin to it. That amused us, particularly since it's only the second place I've visited state side that has Palm on tap (The Smokin' Hubster ordered that). I had Troegs Hop Knife and was very happy with the selection.  Our server Mackenzie was very helpful and patient as we reviewed the menu. I ordered the Flemish onion soup which was flavorful and hearty (lunch had been pretty big, so the soup was perfect!). Hubs ordered the Rocky Mountain burger, aka the burger of many meats. He raved about the cook and flavor on the burger, though found the fries to be greasy.  Overall the visit was good. I would return to keep working my way through the beer list!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "NOAB0yxAYMDW9WzazxOFbA",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Flemish onion soup",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NOAB0yxAYMDW9WzazxOFbA/o.jpg"
      },
      {
        "img_id": "-hamzbCD1V53V71-AaLBbg",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Rocky mountain burger",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-hamzbCD1V53V71-AaLBbg/o.jpg"
      }
    ],
    "user_id": "swCPRXp5PyD5Oodf3bRXgw"
  },
  "HrOM7RnnFG4-39E97w3XVA": {
    "date": "10/17/2018",
    "text": "Name on outside door is Sharper Edge! Cool spot on Penn with a Great bar and Bistro serving so many fantastic varieties of Belgian and other microbrews! They have a mystery beer, which they release the name after they empty the keg, fun promotion, if I lived here, I'd be back again to find out what I drank last time!  The Belgian pudding (tasted like a glorious cocoa mousse) so good, order it, large, rich and shareable! The menu had variety!  Only sour spot for me was service by the hipster bartender who exuded distain for  customers, never asked for refills, we had to wave down even though he was not busy. That made it a lil disappointing of an experience. Still worth a return for this amazing tap list!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Zx9Y8WPHvnoqWKm0eP5xSg"
  },
  "o2aKHss4yOs6vIiXQEZjmg": {
    "date": "12/22/2016",
    "text": "Desperate for a late night dinner, I stumbled across Sharp Edge through my trek downtown in search of food. Like most restaurants downtown on a weekday night, it was completely dead. Our waitress was very friendly and greeted us immediately, but the service quality dwindled the longer we were there.   Their menu consists of your typical bar food - apps, wings , and burgers. I was surprised to find that they are very vegetarian friendly with a specific symbol that signifies a vegetarian dish. I opted for their Brew-a-Burger option with the quinoa patty which comes with fries, side salad, or their soup of the day. Their roasted red pepper soup was delicious - definitely recommend. However, the veggie patty was clearly a frozen patty that was reheated - completely dried out. The Kaiser bun tasted fine but it was a strange white color that didn't really sit well with me. Overall, little effort was put into this and for $11, I expect a little more. On top of that, you also get nickel and dimed for every sauce or topping you would like to add. Every burger comes with lettuce, tomato, onion and pickles but any sauce or additional toppings will cost you.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "U7kSu1EOUtbVQ2W-QIse4A",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Sirloin and Quinoa Brew-a-Burger",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/U7kSu1EOUtbVQ2W-QIse4A/o.jpg"
      }
    ],
    "user_id": "6KUA3-IfHoAhQ3FL2djQoQ"
  },
  "9DFufEcBBWHDLWWd6wk0jw": {
    "date": "7/18/2018",
    "text": "Was in town for work and went here 3 times in a week because they were showing the World Cup and had a good beer selection.   The only real downside was a daytime manager who was kind of a tool and stressing the rest of the staff out. Everyone else was pretty cool though.   Beer was above average, food was OK, and design-wise they could do better with that space.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wIzB-wMdpwzw-z6kSulusw"
  },
  "JOVrfmwR-0ruulwPPhAR_Q": {
    "date": "9/26/2017",
    "text": "Food was mediocre for the price. I had the shrimp avocado salad and it was $15 for a few pieces of shrimp and some sunflower seeds. The service was good though and I'm sure if I was a beer drinker I would've been in heaven.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "0mVKvQ_bBumLjf4dMvefyQ",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Shrimp and avocado salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0mVKvQ_bBumLjf4dMvefyQ/o.jpg"
      }
    ],
    "user_id": "ssyfiCwpNNwTjmia-kgsmQ"
  },
  "BLtZAmMsh8bwbkAYMr3dEw": {
    "date": "2/26/2017",
    "text": "Another visit to one of our favorite places before a show. This time, we enjoyed happy hour prices and discovered the jalapeno sauce on the wings. Loved it so much we ordered a second set of 6 wings!  Great service was provided to us by a cool guy who knew a lot about the beers. And, he took great care of us in terms of getting our food out- even took enough care to put our food in around a few larger groups of patrons since there were only two of us, so that we didn't have to wait too long.  (How cool is that?)  And, the drinks were served timely - because of course you will drink many when you spend time here, and, like me, you may need to be extra careful while you are walking out happy",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VW0cXpgZuk37YVAsqwQKGA",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Another favorite discovered",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VW0cXpgZuk37YVAsqwQKGA/o.jpg"
      }
    ],
    "user_id": "jQYBEx46STPB6UnJ6dYKkQ"
  },
  "NJAruTVwA3DHtkY2huNeCA": {
    "date": "5/21/2017",
    "text": "When did they change the name of the restaurant on Yelp? Is the name changing anyways?? So confused.  I also like the new look of the menu. Oh and they turned the A/C on! Wow.   Anyways, still great beers on tap. Always can depend on a great selection.   TBC....",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pXKN4RLjhq4rkRimJKAbpQ",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pXKN4RLjhq4rkRimJKAbpQ/o.jpg"
      },
      {
        "img_id": "yEsKKMq9qaEWnMwlVCj-9g",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Menu 2",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yEsKKMq9qaEWnMwlVCj-9g/o.jpg"
      },
      {
        "img_id": "lJQrKGIT9LV36UfF1GDy9w",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Menu 1",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lJQrKGIT9LV36UfF1GDy9w/o.jpg"
      }
    ],
    "user_id": "mtrwciirsnKJGleYFfXYCQ"
  },
  "AQv0_oQ12T3aYF_aTLTvrA": {
    "date": "11/18/2015",
    "text": "I went here for pretheater happy hour. Sharp Edge has a wall full of various beer and wine bottles and a great selection to choose from. The place was packed with people and I was there fighting a bad sore throat.  Instead of beer I opted for a glass of delicious moscato wine and had a bowl of French onion soup. As I was preparing to leave I met someone who was enjoying one of the most absolutely to die for chocolate mousse dessert.  Sharp Edge is a chain and there is one located near my house. I plan to go back when I feel better and will try the food next time as a meal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "qWkTV6eGimz3QBqrHZEgBQ",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Belgium chocolate mousse",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qWkTV6eGimz3QBqrHZEgBQ/o.jpg"
      },
      {
        "img_id": "KNkSlC7IzLp6xIxX00niWA",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. French onion soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KNkSlC7IzLp6xIxX00niWA/o.jpg"
      },
      {
        "img_id": "4qvRQfcVqFJrnPYXa-PiYg",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Inside",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4qvRQfcVqFJrnPYXa-PiYg/o.jpg"
      }
    ],
    "user_id": "fmzIm7RxEdii5Jz44PtO7g"
  },
  "8_9XQfBC2YtFHCekdd32bA": {
    "date": "6/28/2016",
    "text": "Sharp Edge has some redeeming qualities, which is mainly their beer selection.  You would be hard pressed as a beer drinker not to find something here that would please your palate.  However, this Sharp Edge also has some not so redeeming qualities such as inconsistent service, to downright rude service and, at least what I have tried, not so great food.   While working downtown I stopped in here a handful of times for lunch.  Can't recall much of what I ate but I do recall it being pricey for lunch.  On a specific time I stopped after a Pirate game and ordered their mussels.  I happen to adore mussels and I honestly couldn't finish them.  The broth was off putting and the bread was absolutely nothing special.  I didn't think much of it at the time.    Last time I came here to eat I again decided to try the mussels.  This occasion was before a show.  When my food came I went to take a picture, just to be scolded by the server for being \"rude\" at the dinner table!  HA!  He told me to put my phone away dinner is a time for talking with your partner not being on the phone.  Thanks Dad, may I be excused please???  So it was official, it wasn't just a onetime bad experience with the mussels, as these were as equally unpleasant as the first time I tried them here.  I again, did not finish.    Last time we stopped here was after yet another Pirate game.  The place was busy.  We were waited on by who I guess may have been a manager?  I am only guessing as he wore a tie.  But then again the other bartender wore a bowtie so who's to say.  So Tie guy gets our first drink.  We are enjoying them, and bowtie comes over to one of their many taps, which we and another couple were sitting in front of, to pour a pitcher when the tap kicked spraying booze on me and the other two people.  Bowtie didn't apologize, nor did he extend a rag to clean ourselves up.  Luckily I had a towel in my bag and wiped myself off.  The other lady that got sprayed was annoyed.  So I guess bowtie went to change said keg and tries again just to spray more beer our way.  At this point the lady said we should be given free drinks.  I laughed and said good luck with that we can't even get an apology!   We wanted another but were being ignored for quite some time.  Eventually getting our last drink I asked for the check and scooted.   I would come back for drinks, maybe.  Though I am in no hurry.",
    "rating": 2,
    "rated": {
      "funny": 19,
      "useful": 28,
      "cool": 27
    },
    "photos": [],
    "user_id": "_5fx5gexi9OeZIuukV2gHQ"
  },
  "B-34q93GgQDo0kOJAGRSLg": {
    "date": "7/22/2016",
    "text": "Waiter, your words about your full bar confounded us. Your bar, that you believe is full cannot provide flavored alcohol, but yet you serve Kahlua shots. We are in awe of you. Please see graphic image.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "1alJxw03Xrv-rBg7IkodVA"
  },
  "N7Yc7M1-pOyssavJrFDprA": {
    "date": "3/23/2018",
    "text": "Great beer, killer chicken avocado sandwich and sweet potatoe fries. The staff is also super friendly",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Ya2u-Ee3wLOJquobw5fDg"
  },
  "UN9pc9_2eEt3-wst9SWDiA": {
    "date": "5/25/2016",
    "text": "Ate here with a group of friends on a recent Saturday night. Had an overall good experience and would definitely return.  First of all, this place is always busy, so make sure to make a reservation if you have a big group or have your heart set on eating at a specific time. There is a great bar with lots and lots of beers on tap and in bottles to keep you busy while you wait too.  Second, the food was very good - I would say 'gastro-pub' good. We started with a margherita flatbread and an order of provolone wedges (battered cheese, deep friend - like mozzarella sticks, but with provolone and in wedges...served with a marinara sauce). Both were tasty, and split between 8 people, everyone had a taste, which for me was enough to whet my appetite but not fill me. I would say if you wanted more apps to eat, you should order two of each for a group of our size.  For mains, 4 of us had salads, 1 had the wild boar meatloaf, 1 had mac and cheese and 2 had burgers. I thought all the food was very good quality. My salad was the Shrimp and Avocado - it had a whole very fresh and perfectly ripe avocado cut into slices, and 8 grilled shrimp, served over the top of the salad on skewers. The greens were all fresh and it came with cherry tomatoes and a lemony dressing on the side. Awesome. My other friends had the Sesame Ginger Salmon salad and both thought it was delicious. The person who got the mac and cheese felt it was a good sized portion and very creamy, but not very complex - could have used something to amp up the flavor a little - she described it as 'flat' and 'one dimensional' even though it had both gouda and cheddar cheeses in the sauce.   For those with the burgers, one had a regular burger and thought it was great; the other had the Buffalo burger, which is a mix of buffalo and sirloin meats - very, very lean. She ordered it cooked medium and it was way over well - hard in fact. She only ate a couple bites then called the waitress over. The waitress admitted that the kitchen had been slammed and that the burger was not cooked as ordered and she offered to bring out another one. The second one, which unfortunately came out almost 20 min later when the rest of us had finished eating, was perfect, and my friend remarked it was very tasty.  The one who got the wild boar meatloaf loved it, but I was surprised to see her plate just had the meatloaf on it. She must have asked to substitute the fries with soup, because that came out with her meal; but it was odd just to see meat with no veg or side on the plate! She let me have a bite and it was really delicious - the meat was tender and moist and the mushroom gravy was rich and savory. I would get that myself next time.   In addition to our meals we all had drinks - wine and beer - some drafts some bottles - and our waitress was on it! She checked on us frequently and joked with us and was overall very attentive.  This is a fun place for a good solid meal.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "xKwdQNkBZIpwKLWYOlyz9Q"
  },
  "eyoMLMxrW8jnlEdjVfogPg": {
    "date": "4/25/2017",
    "text": "I live across the street from Sharp Edge \"Bistro Penn\" and I do not think it will be around much longer. The managing owner, Jeff, is changing the menu in such a way that while it might save the company money in the longer run, does nothing for the quality of food. With so many great restaurants in Pittsburgh to try, this is not one I would EVER recommend. Ever.   For the last year and a half the only reason my wife and I have liked the place has been because they serve halfway decent Belgian style fries (frites) with a delicious Aioli, but this is not the case anymore.  Apparently, making aioli and decent fries are two things that are not in Jeff's budget so he's cut it from the menu. So, now you're left with basically sub-par burgers, overpriced beer on tap, and sub-par fries.   It's not all bad though, as, I've never been in a situation where I can recommend a strip club's food over the food at an actual \"pub\" but seriously, if you want good burgers, please go to the 3rd floor of the strip club on 9th instead, the management and cook there is pretty good. Actually, just go anywhere instead. Even the ex-felons at the 6th and Wood MacDonalds make better food than the cooks under Jeff's leadership at Sharp Edge.  I can imagine this place on a show with Gordan Ramsey's Kitchen Nightmares, where he's yelling at Jeff and the other babbling owners to get their stuff fixed and they are incapable of doing so.  What's sad, is if he reads this review, he's probably going to take it all out on his kitchen staff and front of house staff, instead of analyzing and actually addressing the real problems that HE is involved in creating.    It is unfortuante, but the restaurant scene on Penn Ave. will go on.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "r5bFqEBe9Y4y4IMZ1nQ_Bw"
  },
  "eaeQXAJH6J2OF9xZsYSTVw": {
    "date": "3/15/2017",
    "text": "I feel like I have to be honest here...I really don't like this place. I have had to go for happy hours and celebrations and I never enjoy the food or feel that my tab is worth being a patron of this place. In my most recent experience, I stopped during a friend's birthday. We shared appetizers and ordered the Mediterranean nachos, brussel sprout bake and shrimp skewers. The nachos were not awful and really I was starving and ate as much as I could. The brussel sprouts...were the most depressing thing I have ever eaten in my life. it says they were baked but, they tasted like they were steamed with zero seasoning. They were also not cooked through. I actually ordered the shrimp because we could not eat the brussel sprouts because they were so tasteless. The shrimp was pretty good but not enough to salvage anything.  In addition to items lacking any flavor, everything is overpriced. The buffalo bites, which I've had in the past, are $12.50 for a dozen. They are not homemade and the sauces do not taste like they are either. The beer is overpriced as well. In a time where local breweries are all over the place, paying $10 for a beer that isn't stellar is a waste of money when you can go into most restaurants downtown that serve amazing local beers for $6 My last gripe concerns how outdated everything looks. The competition is stiff downtown and there is a new restaurant opening up everyday it feels like. In order to keep up with growth, you have to stay up to date. Everything in this place feels tinged with yellow. Nothing is new or fresh but is stale and stagnant.  I will say, my service has always been good when I have gone and it is an option when a lot of the other restaurants are full. But, overall, I really hope I cease to have any reason to stop in.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "OWtzJMlqA7cY559O80nqQg"
  },
  "cYFbozHcbl3jbbQ2-GD8vg": {
    "date": "6/15/2017",
    "text": "Sharp Edge downtown is extremely hit and miss.  If you're looking for Belgian beer and you have a small party, this is your spot. Otherwise, I'd recommend anywhere else including the alleyway nearby.  They have a nice Belgian beer selection. The prices are steep, but Belgian beer is expensive. The mystery beer is fun.   The service is mostly terrible. You'll get the occasional good person, but 4 times out of 5 is just bad.  The food is standard bar food.  I'd never recommend this place for groups. It's all bad news for groups. Expect a hassle.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "sbb2XUj9aYh5zP6gTJ14lw"
  },
  "ACdw8dMCa4Go0El0Phmnmw": {
    "date": "2/4/2018",
    "text": "The Belgian burger was pretty average and a little pricey. I liked the seafood chowder though. The place wasn't too crowded even though we went on a Saturday night. The service was ok too but there was quite a bit of wait for the burgers. Overall nothing stood out to me in good or bad ways...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "EU5dSjk-UzILTp5kcg-dOQ"
  },
  "WXlbGAGLt45RH0RHzKTurg": {
    "date": "11/17/2015",
    "text": "This place does not pass as a restaurant. Fine if you want to say they know how to buy beer. Not much talent required there. This is an awful place to get a meal. They know nothing about food. I've tried 2 other locations. I didn't choose to eat at any of them. I was a victim of peer choices.  All pretty sub par to ridiculous.  I ordered the featured Bloody Mary. It came without a garnish. NOTHING. It was so spicy I couldn't drink it so I sent it back for something they couldn't ruin. A beer    It took an hour to get our food. I ordered mussels and frites. The mussels were good but were served with 2 pale, cold, sad, stale rolls. No sopping for me I guess. The frites were $3.50!  Small dish, cold, soggy, greasy and definitely NOT frites. You should have seen my wife's $16 burger. What a joke. I can't believe people line up to give them money here. This is the last time I eat at one of their pathetic excuses for a restaurant.  I feel completely violated and ripped off.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 1
    },
    "photos": [],
    "user_id": "QQtoHnP0cP7nzNnUob_1CQ"
  },
  "IlQ_Vb__LLXOs49w_C4uIg": {
    "date": "1/30/2017",
    "text": "Sharp Edge is a go-to standard in my book. They have a vast menu, crazy number of beer options and lots of seating. I've been to the one on Penn Ave. as well as the one on Friendship. Penn Ave., has a lively atmosphere straight after the work day. Our server was terrific even with the crowds. LOVE the buffalo bites. I rarely order anything else (besides salads). They have great homemade dressings. The portions are good without being too huge. I've gone with my mom and her friends as well as my children and their friends. We went just before a show at the Benedum and they were good at getting us in and out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BJUY0UadA-STNQfNGnpTjg"
  },
  "UwANBc01orad7QtdIKyE6w": {
    "date": "8/15/2018",
    "text": "We hosted a happy hour event here in the upstairs room, and it was fantastic. GM Dan couldn't have been more helpful in scoping the event for us and adjusting as our numbers changed up until the day of. Our bartender for the night, Joe, worked non-stop to make sure everyone had enough (delicious and affordable) belgians and apps and always with a smile. Great bargain, great drinks, and great people. I can't recommend them enough when you're looking for something near the convention center area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KUvGJwJW10skq_fjU53mVw"
  },
  "IK9z0sYZMdMEJGB80Zwy6A": {
    "date": "11/26/2017",
    "text": "Food was poorly prepared; my salmon was way undercooked (talking cold and an \"uncooked\" pink and blood in the middle) and the salad greens just looked near their end of life. Service was slow, in a place that was at least half empty -but when they got around to me they took more than 15 mins get me water/another drink and then 15 more to process my bill. After another week on the area I found many better options- skip this and checkout elsewhere.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "reTF0s__K35y1g9X9nIu-w"
  },
  "UZEqmCYyMeuXrtd1RkyuuA": {
    "date": "8/17/2011",
    "text": "This is a great down town lunch spot.   Solid menu of sandwiches, salads, pizzas, etc.  We eat here - easily once a week.  The spinach salad with salmon is my choice - always.  But there is a ton of variety.  Buffalo Bites are a great lunch - or appetizer at happy hour. Mediterranean nachos are unique and good!  Soups and other salads are all great.  (Except the french onion...for some reason they are adverse to getting it crusty and bubbly...beg and plead and show them the picture on the front of their menu and they'll get it right)  This is also a favorite happy hour spot.  It's layout isn't the best for a crowd - as it gets pretty packed on a Friday.  But if you're good with that - the beer selection and appetizers are all good!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "_N8YA_UiSwUIXoyHBx_qrw"
  },
  "szlLKU2UvQDmuB50Sd2NHQ": {
    "date": "3/13/2012",
    "text": "Fun atmosphere and great food. This block of Penn Avenue is really coming alive!  I've only been here during the lunch hour so I haven't gotten to try any of the large selection of beers and other libations.  I will be back some evening soon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_LnalcvCHP0C29oooF66Fw",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Bar area",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_LnalcvCHP0C29oooF66Fw/o.jpg"
      }
    ],
    "user_id": "VbLZSyr39Xx9oox3r-YOmg"
  },
  "eWvl9HvGqLwuwteMZUjj5A": {
    "date": "11/30/2011",
    "text": "The Sharp Edge brews a Belgian beer called \"Over the Edge\", which is one of my favorite all-time favorite beers.  It has the right amount of hop, flavor, and alcohol content to keep me satisfied.  They have beer samplers which are a good way to try all the drafts.  Aside from the beer, the food is quite good.  I usually go for the portobello panini, which isn't your typical overcooked, overcheesed sandwich.  It's light with fresh spinach and grilled mushrooms.    I love sitting in the bar area.  They have several tvs and plenty of seating (at the bar and at tables).  If you're downtown try the bistro, if you're in the East End try the emporium!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8jIZDXmriW4jhJJYu405cQ"
  },
  "m7A018anWWQ-dW8nWnyAvg": {
    "date": "6/24/2012",
    "text": "Wandered in here during a weekend conference. Now I'm thinking that TW value and selection this place offers will cancel out another trip from NYC.  Go here. Get a beer and order food. Then get the mystery beer. Enjoy it and get another, cuz it's only 4 bucks.  This place may be the only non-conference spot I see, and I'm ok with that.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XDXGNY4lOU0dvfhivnqApQ"
  },
  "CxekiqV4VCD0HMkil7flzg": {
    "date": "3/24/2011",
    "text": "Yeah, yeah, yeah!  I know--the irony of a non-drinker going to a beer emporium for lunch.  Hey, I may not imbibe but that doesn't mean I don't like the occasional repast of good pub chow.  I went with my coworker Maria and to be fair, there are strict rules against alcohol consumption during business hours.  But o-my the food here is good, if a little expensive!  Maria and I began by splitting an order of wild mushrooms & leek tarts.  Picture a baked pastry filled with beer braised leeks, chives and shallots!  Mmmm, baked pastry. Pump that insulin, Susan!  Pump!  I was considering the Flemish Onion soup when suddenly the Belgian Burger caught my eye.   Oh baby, that burger was to die for!  Ground lamb & beef with shallots & bacon, topped with melted smoked gouda!    So I guess my burger was gouda 'nuff!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 6,
      "cool": 5
    },
    "photos": [],
    "user_id": "UtkjXTiMfGRz4R1zDF3Kxg"
  },
  "PodhtbLruMHqSIbNB0LlrA": {
    "date": "10/1/2012",
    "text": "I love all of the sharp edges, but this is by far the best. They have a ton of good beer.  I would give it a 5, but the beer prices are too high.  Get one of the burgers, they kick ass.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wrnDEjCl22v5R9USrXnLgA"
  },
  "4amaqUNn6riUDmIvCxce0Q": {
    "date": "3/9/2012",
    "text": "I never did get to try that Ostrich Burger :(. O well.  So this is the place my friend and I always eat at while waiting for connecting rides at the nearby MegaBus route. Thank god it is so close, because Pittsburgh is a ghost town and there pretty much is no where else aside from fast food to eat.   Their fries, sweet potato, or regular, are awesome. Get extras if you can! The burgers, sandwiches, etc all do the trick. I get some turkey sandwich with an excellent honey mustard sauce and sliced apples on it. Never though to put straight up apple on my meat, but it is something different and really tasty.  Friendly staff, usually adorning accents and food wisdom. Ask them for help.   They also always let us loiter in their seating area for hours after, utilizing the free wi-fi.  Thank you Sharp Edge for making lay-over so smooth!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e_CAc7b6we3XZffB2PaDUQ"
  },
  "JJHRUEGjpSbo3DDvVQ0fFw": {
    "date": "9/13/2014",
    "text": "The beer list used to be unrivaled in Pittsburgh, but there's now a lot of places that have pretty awesome beer lists too.  Their mussels and fries are where its at.  Drink a good belgium and down some mussels.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_0TKEDIcuWW5Y4BHo1t24g"
  },
  "Zy3JtVPwgMmkiU2rAg-7zA": {
    "date": "3/25/2011",
    "text": "Wow, the years have not been kind to the Sharp Edge chain.   I realize that most people go the Sharp Edge for the beer, I used to go regularly to all of them for the food.  Now I don't go at all.    I feel like it all started when they passed the drink tax.  I remember seeing a sign that they were lowering the price of beers to help ease the burden of the consumers.  After that I noticed the price of the food went up, which I was ok with.  However, I was not ok when the quality of the food started to deteriorate.   Example: If I got a salad, more than half the greens would be wilted.  I would be fine if this only happened once in awhile but it became a habit for them to serve sub-par food.   When the downtown location opened I hoped that it would have the old, higher standard.  I was sorely disappointed.    If you are mostly interested in the beer, you'll be fine.  If you want to get your money's worth on the food, go elsewhere.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "Foe27CvcuGIFNKJcl_cqsQ"
  },
  "OoNWSzMGmoGsb4zbcxKcKw": {
    "date": "10/30/2014",
    "text": "This is a classy bar and restaurant in downtown Pittsburgh. The space is very inviting and was a welcome refuge on the first cold night in October. Interesting if not huge draft selection. Good people. Eclectic menu a cut above pub fare. My only complaint was that their \"mystery beer\", which appears in the draft beer pages, was a bottle of an Octoberfest beer. I will definitely return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "482SujWxaxXUh3IGbiTYow"
  },
  "insickt16TZWiLKOHVDZWw": {
    "date": "10/21/2013",
    "text": "No pitchers. What kind of bar doesn't serve pitchers? Given how expensive (and small) the beers are, pitchers would really have helped bring down the cost.  If you like beer, want something different, and don't mind paying extra for it, this place is for you. If you don't like beer, don't feel like trying something different, or you do mind paying a lot for small beers, then stay away.  The place was dead during the Steelers game, so if you're okay with paying a premium for good seats with good beers in front of good TVs, and don't care for a loud/crazy atmosphere, then this is the place for you.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "P3zs8-Uw6NGxQca2XEV3TQ"
  },
  "09HSNFS-9yY-jTuss17wOw": {
    "date": "6/12/2013",
    "text": "I moved away from Pittsburgh several years ago and when I visit there are certain places that I must eat or drink. Sharp Edge is a must. I love their Buffalo Blue bites and, of course, beer. I am an IPA kinda guy and was headed to a concert on North Shore tonight, so dinner at Sharp Edge on Penn Ave was a perfect idea. I hate to say that  I was wrong. Sure it was a little busy but I didn't have to wait at all. The host said they weren't sitting people outside because it was suppose to storm so I acquiesced to a booth inside. The guy who came up to serve me looked like the Pittsburgh Dad from that YouTube show. He asked if I wanted a drink and I said \"bring me the best IPA on draft\"... he proceeded to open the menu, point at the Belgian draft menu, and told me everything was happy hour process so to \"pick one\". I was flabbergasted since 1) these are NOT IPAs and 2) waiters at Sharp Edge really should know beers. I responded \"these aren't IPAs at all, so I will need to figure this out by myself.\" He said \"ok\" and walked away. I was shocked. At that point, I almost went to sit at the bar but there weren't lots of seats there.  I got up to check the menu on the wall. The Terrapin Hopzilla sounded good, so when he (finally) came back, I ordered one. I also got the buffalo blue bites, and he asked what sauce I wanted. Doesn't that come with buffalo blue sauce? Every other time I've ordered this for over a decade, every Sharp Edge person gave it to me the correct way without asking.   A different guy brought me my drink. A third brought me my food, eventually.   My guy came to give me my bill, eventually. By then, a skinny white man in a tie came by and I asked if he was the manager. He said \"something like that\". I told him I was disappointed that my waiter didn't even know the difference between Belgiums and IPAs. He just chuckled. I told him I was hoping my experience at the McMurray store (where we have a dinner party scheduled later this week) will be better. He said he'd trained there, but he did NOT address my concerns about my waiter at all. He pretty much ignored my concerns. I was unhappy with this experience.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "X0X3hiKv5CigUec1XYi_pg"
  },
  "X_8zrKy7IbQyK11Lv-098w": {
    "date": "7/15/2014",
    "text": "Great selection of beer. Plenty of it! The food is so-so. Typical bar-food. Very nice wait-staff and bar tenders. Large enough place to accommodate a busy night. Worth the stop.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P_B6b_x-LxGbkThk7HmAIA"
  },
  "IxW0XH_xNAZGW86qJe5GPQ": {
    "date": "4/9/2011",
    "text": "Been a while since we posted. Haven't been too many places recently.  I was headed to a local lunch spot downtown earlier than usual due to a 12:30 meeting (12:30? seriously?) and this was the first place we found that was serving lunch to the 1st lunch period crowd (remember those poor kids in elementary school that pulled the short straw and ate lunch at 11 AM - that was us that day).  Now I am not a drinker.  My dog imbibes more than I do, so the beer list was kind of lost on me (besides, I always think it is bad mojo to go into a meeting after lunch and wreak of anything, especially alcohol).  My CW and I were the first to be seated - maybe that was our mistake.  She ordered the quiche of the day and I ordered a sirloin burger w/ sweet potato fries.  Her salad was okay.  Nice greens although not much else going on in it.  From there, it went straight downhill.  When CW's quiche arrived, it was lovely to look at - leeks and andouille sausage - and cold.  Not warm, not cooler than you would prefer. It was flipping cold.  So she explained that to the waiter who took it back.  Then she waited and waited and waited.  Expecting it to be nuked, this was taking quite a while.  When he brought the plate out, it was a new piece of quiche - he explained that when they tried to heat up the original piece, it crumbled so they made a new quiche.  As a former waitstaff (waitress but trying to be PC here), I would have stayed around and made sure that this piece was more to her liking. But he bolted. And - you guessed - this piece was equally as bad.  Now I know - you are going to say she was picky.  But I actually touched the quiche to allay my fears and it was flipping cold.  My guess? The quiches were either chilled or frozen and they didn't know how to reheat them.  She ended up with a 1/2 of a chicken salad panini with dried cherries although I will be darned if there were any dried cherries in it.  So CW is going vote this bistro off the island.  My lunch?  I ordered the Brew-a-Burger Sirloin rare.  When it came, I don't think it was much warmer than CW's quiche - yes, I order it rare and expect the inside to be warm but I also expect the outside to be hot which it wasn't.  The cheese sat on the top and never softened, let alone melted.  I also expect a rare burger to be flavorful without the addition of much else - and it wasn't.  About 1/2 way through, I almost wondered if they had given me a ground chicken burger in error.  At that point, I figured it was not worth pursuing.   Should they have given CW a free lunch?  Or a GC for a free lunch upon a return visit?  Doesn't matter what they should have done as they did nothing - the bill arrived and was paid as expected.  All in all, it was not a great food experience.  I don't think we will be returning for lunch anytime soon. Was it a bad day for the kitchen?  Did we arrive before they were really ready to serve lunch?  Not sure but, either way, when you spend $25 plus tip for lunch, I think there are better places to drop it.  Pity the kitchen staff cannot live up to the restaurant's name.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "6ldbs7uuetv5UOWm_21REw"
  },
  "mF7IY4FHqLa8JpRKOlOesQ": {
    "date": "1/16/2016",
    "text": "There's a huge sign out front that Sharp Edge is now serving breakfast on the weekends. The food they serve at night is okay, so I figured I'd give it a try. It is not good! There were three of us, and we each had a different one of the only four items on the menu. They were all bad. I hate to say this, but Sharp Edge needs to stick with what they do well. Breakfast is not one of those things. Examples: The hash brown potatoes were cold and tasteless. The burger patty tasted like it came from an industrial package of frozen hamburger patties.  The sausage gravy was bland and watery. The toast was plain old white bread toast. The orange juice was in a bottle and we had to remove the cap. Only the fried chicken tenders and the bacon were decent, out of the three breakfasts that we ordered. If you want to compete in the brunch arena in Pittsburgh, you need to come up with something a lot better than this.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hz5tzHc4JijfiD9K5hHlAQ"
  },
  "Dn9bQyk4XrpyNNuvBaXJWQ": {
    "date": "1/15/2011",
    "text": "I was VERY reluctant to check out any of the Sharp Edge locations for one simple reason: Their gawdawful, amateurish, Comic Sans/clip art logo. As a designer, it irritates my gag reflex to see such horrendous \"designs\" in public.   But I took some Pepto and managed to get myself inside. For such a Crayola-ish logo, the place is pretty darn classy. It has a really nice atmosphere, and for a downtown joint it was pretty hoppin on Friday night. The design of their menu unfortunately matched the lack of sophistication in the logo. I counted four fonts (PAPYRUS?!, Comic Sans, Optimum, AND Century Gothic. Really?) on the menu, and a whole lot of awful clip art. Maybe I'm being too critical here, but I think your branding is supposed to set the scene for your restaurant, and this stuff really doesn't do them justice.  I ordered the Bites and Frites, boneless wings and fries. The chicken was good quality and juicy, but the seasoning (I chose Hot Garlic) was underwhelming and dryish. You also can't split your order into two flavors which is disappointing...I wanted to try the honey bbq too! The fries are tasty, but somehow the dipping sauce they serve with it tastes like absolutely nothing, so I got a side of regular ol' ketchup too. Pretty much everything I ate needed a good layer of salt.   The Mr. though said his burger (build your own from a large selection of toppings) was really really good, so I'll try that next time. We did not partake in any beer, but they  have a huge list, albeit a bit on the pricey side  Service was friendly, not very fast but it was busy so I'll let them slide.  They have some really interesting items on the menu so I'm eager to check it out again. All I ask is that they please, for the love of design, hire a professional graphic artist to REBRAND THEM!",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "M9MXoSsb193m1g0QmmUYBQ"
  },
  "Vrd-uYjP5VpTbAIkL90LyQ": {
    "date": "3/19/2016",
    "text": "Service was great!  Our food was delicious! A huge corporate event was taking place at the convention center, and everyone took lunch at the same time. Our waitress Michelle and the staff remained, calm, cool,  and attentive.  Great job! Definitely recommend it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SzH0l5Q-N160WqGWh1vHyg"
  },
  "Vlj80sRFWVZjUhf50Cw6Cw": {
    "date": "10/13/2011",
    "text": "Had dinner there with some girlfriends tonight and figured I'd yelp while it's fresh.....  We started with the pretzel knots....the came out looking like rolls with salt affixed by water(kinda like the microwave pretzels you made as a kid). Not good...  Beers were good. I had the portabella panini which wad good, although the panini bread was really Texas toast without the crust, just sayin..  I was pleasantly surprised by the bathrooms. I expected old school subway tile but saw faux slate... Kinda offsets the 80s leather furniture in the lounge area?",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oE_rZ5gjWD1Cp8fePoVKzQ"
  },
  "omz636hpfAdIZi6fWQRmFA": {
    "date": "8/31/2014",
    "text": "We love Sharp Edge.  First of all, this is only the second time I was at this location but have eaten at the one on 19 a few times.  We stumbled in the door at 11 AM last Sunday morning (8/24) after celebrating my son's 21st birthday in the Strip the night before.  We were all set on Bloody Mary's and not having a reservation to get in anywhere else for brunch we figured Sharp Edge might not have eggs, but they'd at least serve us a great Bloody Mary.      Our server was Rod, and hands down he was probably one of the best and most attentive waiters I've ever had in a restaurant.  As we all ordered our drinks he noticed the slight congestion I had and immediately asked me if I would also like some hot tea.  Caught off guard but very pleased I responded yes, and before I knew it he was back at the table with not just a bag of Lipton's steeping like I expected, but a full chest of assorted herbal, black, and green teas to choose from.  (Ahhhh, Earl Grey, I love you).        We all ordered our food, all of us choosing sandwiches and assorted burgers, and laughed about my other son, who having forgotten his ID in the car, ran the three Pittsburgh blocks back to where we were parked in the Strip so he could also enjoy a Bloody Mary with us.  From the Provolone Wedges, Bison to Quinoa burgers, Roast Beef and Brie Panini, Spicy Squash Soup, Chicken and Avocado Panini and everything in between our lunch was fantastic, all the while having every need and whim not only handled but even anticipated by Rod.  He even made up a ramekin of his own \"Special Sauce\" table side when one of us requested hot sauce.  The burgers were all cooked to the ordered temp as well...most restaurants think that medium means well done and rare means medium.  The burgers ordered all came out just how we all wanted them.      My only disappointment was that I just wasn't in the mood for mussels at 11 AM, being that they are one of my Sharp Edge favorites!  Although we don't get downtown as much as we'd like to, Sharp Edge is one of our favorites and we'll definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TtAlwk41qRddJo5wftYKBw"
  },
  "Pk2Q_EtbtTeaH_ygRVuDww": {
    "date": "5/28/2014",
    "text": "Nice selection of Belgian drafts and bottles, as well as a few other styles of beer and wine. Food is great, love the french onion soup. The baked Brie appetizer is delicious & I've had a few of their sandwiches and not been disappointed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AxBSmOlOAe1y3EOx7SStjQ"
  },
  "82g-3nKZqS836MoCTII1JA": {
    "date": "9/7/2013",
    "text": "Great craft beer selection and friendly service. My Belgian burger (ground lamb and sirloin with smoked gouda) was cooked  to an exact medium like I ordered. It was also topped with whole grain mustard, crispy bacon, and shallot. It was pretty bangin'. Great happy hour specials too.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "82LKBcd0y52DjFUGrGN_5A",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Belgian Burger",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/82LKBcd0y52DjFUGrGN_5A/o.jpg"
      }
    ],
    "user_id": "u8xbKg7tmA-LhuJkypf1Qw"
  },
  "QAdajIKDv2gtMzfj-FkGZw": {
    "date": "4/2/2016",
    "text": "Awful food, worse customer service.  I ordered a burger and asked if the patty could be cooked sans peppers. \"No problem,\" the waitress said. I received incorrect orders twice, once with ingredients that weren't even listed on the menu. I asked for a manager, and a cook came out instead. He admitted their patties are frozen and shipped from a \"mother company\" (or, as my boyfriend and I now joke, the mother ship). He said I shouldn't expect him to make modifications to my burger. \"When you go to McDonald's,\" he said, \"you don't tell them to add or subtract things from the patty.\" This isn't McDonald's, I argued, it's a $12 burger. \"What do you want me to do about it?\" he said.  I spoke with the actual manager later. He apologized profusely, took down my address to send coupons. I didn't receive anything in the mail.   Also, beer prices are OUTRAGEOUS!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AbC8YQLq7aLQgzbzNrWXHQ"
  },
  "CH_X56sEcqwZ5MzhqTsK5A": {
    "date": "2/16/2016",
    "text": "The beer selection is quite good if you like Belgian style and European beers on tap. Lots of double and triple beers.  Food was about average for a gastropub or maybe a bit below. I had the Rocky Mountain burger medium and it was a little disappointing. More lettuce, tomato, pickles included would be an improvement. Kind of skimpy on that front. The flavor was good though. Had the Gulden Draak, or Golden Dragon, and it was exceptional. This was followed by an always solid New Belgium Citradelic and an Elysian BiFrost from the PacNW. Better for good ever than good. Also a bit too brightly light and if you are sitting in the bar at a table the drop down pendant lighting is in the way of the TV.  It totally blocks the game view.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VVa5-iHUvjfpfjfLbmOIMA"
  },
  "t_9GgmIko1wEyaT-XINIVg": {
    "date": "7/23/2011",
    "text": "It was the night of appetizers, instead of grabbing one app and dinner, we decided to focus on Apps. Crab stuffed artichoke hearts, buffalo bites- garlic hot. Pomme frites. These turned out to be awesome choices! To top it off we had a beer sampler of 4 to help wash down the delicious appys. We were only in Pitt for  a couple of days, but we liked it so much we ended going back the next night.  Great ambiance, great service and a good place to unwind and have some delicious food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yzbWtdUW-efqfiozUvVrug"
  },
  "A1-mW11ULkV_tf4vF2Xl2g": {
    "date": "7/1/2013",
    "text": "Awesome happy hour. Great service. Great food. I work downtown, so this is one of my favorite places to go after work. I have only tried the chicken salad sandwich (twice) with frites. I love it. I have had Sharp Edge burgers at their other location (in Friendship). I'm assuming it's about the same at the Bistro. However, I really don't like going to the location in Friendship. I feel like it's kind of dirty and crowded and not great service. I enjoy the Bistro location much more for the overall environment. Of course, there is an amazing selection of beers. They're all really good. If you have a chance to stop in, do it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6z9ERfBvRF3HOXLNTNkdpg"
  },
  "L_aZi_1GQHgctHOwxnmBKg": {
    "date": "6/23/2014",
    "text": "I've frequented the Beer Emporium more than this branch in Downtown, but had a fine experience stopping in here one afternoon for their mystery beer and a burger. The design and feel of the place is more lacking when compared to the Beer Emporium. It was quiet and our server was friendly and put up with our friends watching weird Vine videos on their phone with the volume up and us telling her about this interactive performance art piece we took part in during the Three Rivers Arts Fest.  The bleu burger was good, not anything incredible, and the beer was fine. The beer selection was good, it seems like that's where the effort goes. The fries were, as others said, on the low end of quality. Spent more than I'd have liked for what I got, but would probably stop in again sometime.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u0kHjwk9h7OwW1AVCM-Zdw"
  },
  "OJNth2uf_JukgmhoxvxVwQ": {
    "date": "7/2/2013",
    "text": "The Sharp Edge Bistro on Penn is definitely not the Sharp Edge I love in Friendship.  This place is obnoxious, full of attitude, and not nearly as well versed as its counterpart.    My coworkers attempted a happy hour here and had a heck of a time getting any of the waitresses to give us more than a dirty look.  We finally asked if it would be easier for us to be served at a table on what appeared to be the 'dining' side of the restaurant, which was empty.  Unfortunately, the empty dining side left us with a larger bill but only slightly better service.   I'll be hopping the bus back to the Friendship Sharp Edge for happy hour from now on.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "h79wpG7kAYMPc8gNJqvlqQ"
  },
  "otkpG5cZMiPweMrLzz1oyQ": {
    "date": "9/2/2013",
    "text": "A mellow bar to grab a Belgian or craft beer with some food while watching the game. They have a very extensive beer selection which is rather expensive when not paired with one of specials which run every weekday (for example, Belgian beers are half off from 4:30 to 6:30 on weekdays). The bar counter is very spacious and there is a cozy area adjunct to the bar where you can sit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SqVUNVeYJblyoUz4e-Fiqw"
  },
  "9LBEWpMutRfppsnqIEVjYQ": {
    "date": "11/19/2013",
    "text": "Excellent beer selection - particularly Belgian options.  They have specialty glassware for every beer as well.   The menu is underwhelming - a few interesting Belgian-style options but they are drowned out by typical bar grub. I'd love to see them fully embrace the Belgian theme. In short: go for the beer; eat if you must.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ohRTwbQPO0bYAB6q0a3W7Q"
  },
  "ZGoyh76CiFZeoy75P2yaFQ": {
    "date": "3/19/2013",
    "text": "Belgian Beer + Half Off Happy Hour + Good Food = Three Thumbs Up  It's simple math, really.   Having tickets to the evening hockey game was probably a life saver because I probably would've camped out here all evening. Well, once I finally got a seat at the long bar. Yeah, it was Happy Hour and the place was packed, and for good reasons already mentioned: 1/2 off all Belgian drafts. And there were PLENTY to choose from. Knowing I was on a limited timetable, a Gulden Draak quickly became my dinner drink of choice.  Resisting the urge to default to my go-to mussels, but keeping with the seafood theme, I instead ordered a Seafood Po' Boy sandwich with a side of smoked scallop clam chowder. Both were a unique, delicious and satisfying change of pace.  Sharp Edge is definitely a \"must-visit\" if you're in downtown Pittsburgh, even if you're not a mathematician or a three-thumbed freak.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "t2LoCqGXkr5mPtu2a336SA"
  },
  "-v4WT4sIUGyMRbu3C1QwBg": {
    "date": "1/6/2015",
    "text": "I ate lunch here. I did not have any beer. Their menu has buffalo bites, mussels, soups, salads, burgers, sandwiches, entrees such as meatloaf and quesadilla, pizzas, a few desserts, and sides such as Belgian frites. The food tasted OK but was not impressive. The restaurant looked a little dirty. The waiter took a long time to bring our check. I did like that it did not take long to be seated because there were many empty tables.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "FW5F5QzzMoeRdIib1OyNOw"
  },
  "cinRjbrMYOAcyYEW-OfEUw": {
    "date": "1/25/2016",
    "text": "I came here hoping for a good meal but I was disappointed. The service was bad they either good your Order Wong or forget that you even order. The food wasn't great my dad ordered a medium well burger and it was over cooked and was just bad just was not good. It also took a long time for our food to come out. The only good thing about it was the server Ethan.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7BcvDnWXF1U3AVmatKwr6A"
  },
  "G_WOQhc4iu4enc6591WUqA": {
    "date": "2/19/2016",
    "text": "Great beer selection. Food was ok...just ok...little overpriced for the caliber of food served.  The staff was courteous and tried to be fast,  but i could tell the kitchen was the reason my food took so long to get out.  The waitress was pretty knowledgeable about the beers...piraat is my new favorite beer, little pricey, but worth it.  My burger was way overcooked, and really sloppy, i had to eat it with a fork and knife...the beer is why I gave them a 3 star review...otherwise it would've been a 2.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B5bp0c8qdGDXab9KhHKhoQ"
  },
  "T_rtI1kQobtvLteD1saYFw": {
    "date": "4/13/2015",
    "text": "This was my cheers bar, walk in and everyone knew your name; but now it's an I'm too busy to wait on customers bar.  You know the bar that the side work is more important than paying customers with big corporate tabs.  Its a shame; but do yourself a favor and head down a few door to Mercato and get much better service and food.  That's what I did after sitting at the bar for 30 minutes and was never acknowledge by the bar staff.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iJQA09lOOliv9gPL-cNHBw"
  },
  "Fe5j2Rj7_4Q1l5zj2-8Dtw": {
    "date": "1/19/2013",
    "text": "Sharp Edge is a pretty nice gastropub with a HUGE beer selection and pretty good food if not generally outstanding.  It has a large bar area which seems very popular for happy hour and is nice for larger work groups, etc.  Fried appetizers are pretty good and the pizzas are decent - the duck & fig was really good while the chicken & pesto was just okay.  Desserts were quite good and I would definitely consider eating here again for a quick bite in a nice atmosphere.  The wine options were limited and I'm not sure if I would trust a cocktail here but if you're in the mood for beer you won't go wrong.  I'd probably call it 3.5 stars but will round up to 4 for now.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Uv5v7r1eN4XFsKZ2jwn1sg"
  },
  "lRDKB-QB3KoTtlkw89H7hQ": {
    "date": "10/16/2013",
    "text": "We were staying in a downtown hotel and friends suggested trying out Sharp Edge/Bistro Penn for a late-night snack and some drinks.  The place was busy so we were worried about getting seated and service, but we were immediately seated upon arrival and our waitress was friendly and prompt.  Other than that, I don't think there is truly anything special about Sharp Edge.  The location was great (walking distance), and people around us seemed happy, but the beer selection was MEH and the food was MEH-ER.  My husband had the buffalo wings, my friend had the soup, and I had the fish sandwich.  Everything was just OK, and satisfied hungry appetites.  But, the beer menu was not interesting and some of it was even way more expensive than I was used to seeing in other restaurants who served the same beer.  Our waitress was nice but she was super busy and her demeanor showed it.  I would MAYBE go back again if I discover they have a beer I really need to try, but other than that, I'd rather spend $16 you'd spend on a 4-beer flight on other things.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MZxpfo6fVI7bNG6q50XZKA"
  },
  "-qgohm7o3hDYAzCCcebSTQ": {
    "date": "12/7/2013",
    "text": "My boyfriend had the bleu burger and proclaimed \"this burger tastes the way boobs look\" and said it was the best burger he's ever eaten. I had the veggie burger, while it had a nice char and very flavorful, it became very mushy very quickly, but they so not skimp on toppings!  If you get a salad get the house dressing, it's delicious! Like a creamy Italian. Also a wonderful beer selection, highly recommend trying the mystery beer, a little cheaper and bound to be delicious!   Only downside is the service, their host was also acting as busboy to it took fooooreeevvvverrrrr to get seated, even though there were plenty tables available, but maybe it was an off day.  However my boyfriend has declared that this is where he wants to go for every birthday/anniversary/special occasion.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-ONyyxFUhDatBG3vw6PkUw"
  },
  "KSG785yq7iP3euu5Mq7qAA": {
    "date": "1/30/2011",
    "text": "During a weekend in Pittsburgh we found this restaurant on yelp. It had a great ambiance so we decided to head inside.  They have a ton of beers on tap and you can do a sampler of 4. We had the server choose for us and she picked some great ones.  Our favorite was Corsendonk Brown. For food we had buffalo bites, Mediterranean nachos, and artichoke hearts stuffed with crab. The food was so good that we headed back two nights later! A must for any visitor to downtown Pittsburgh!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VLWoPQUFttatEMSHSmKE0Q",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Crab stuffed artichoke hearts!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VLWoPQUFttatEMSHSmKE0Q/o.jpg"
      },
      {
        "img_id": "aKLph79MRS5NJHsN1lXogQ",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aKLph79MRS5NJHsN1lXogQ/o.jpg"
      },
      {
        "img_id": "eZJ_V04-wNL10rRbZkdfRQ",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eZJ_V04-wNL10rRbZkdfRQ/o.jpg"
      }
    ],
    "user_id": "cdqwCD1pq-T8ce4mwfBe0g"
  },
  "sGuPvAbnxkCbllu6dmEGfw": {
    "date": "3/13/2015",
    "text": "**Disaster city! Nothing like the original in Friendship. RUN AWAY if Danielle is your waitress**  We waltz in post-theater, maybe 4 tables and as many waitresses. Seated, drink order given.  Now everything becomes like the Odyssey.  Drinks don't materialize for 10 minutes. Our order is taken at this time -- and cups of soup don't appear for another 15 minutes, delivered one at a time by the host, not our waitress. Luke warm, no doubt ignored by our incompetent waitress Danielle  Continued apologies, and now the place begins to fill up post-theater.   Danielle is continually appalled - she is sure to inform us - that people in the theater district came to said restaurant in the theater district.   It appears Jackie is literally delivering Danielle's food and filling her customers' water glasses.   After consuming our food (tasty wild boar, quinoa stacked salad missing the key eggplant stack) we again wait for more than 10 minutes. Again, Danielle is nowhere to be found and Jackie asks us if we're okay.  We leave cash on the table and bounce, after okaying it with a staffer.  Danielle CHASES US DOWN THE STREET, as we miscalculated the bill (my bad!).  Manager is sought, hears our tale, hands us back our cash and comps the entire check. Bizarrely, he apologies for being understaffed and unprepared for a theater crowd.  Long story short, Jackie will probably begin working for another (read: any other) theater square restaurant. The Sharp Edge Downtown staff will continue to be shocked people in the theater district want to eat before and after the theater. And the sun will rise in the east.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VKrXZY_OjTZ1yg7a3HH_4w"
  },
  "V5b06UGe8eeZNSlfVURuTQ": {
    "date": "12/7/2014",
    "text": "This was our first stop on our weekend of exploring the city.....we sat in the windows right out front and watched the people walk by.  The beer selection was AWESOME!!  We tried several each...and our bar tender/server was a BLAST!  Very personable and VERY knowledgeable!  We told him what we liked and he picked out beers that fit us...it was a very nice first impression of the city!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "SPz_rPxpWQRBCSLmPddD2A"
  },
  "ytko9iFsPnBzTdIeYIwsgA": {
    "date": "12/8/2015",
    "text": "Food is pretty good, at least in the burgers category.  Good selection of beers also.  But atmosphere is a bit dated.  Could use a makeover.  Location is nice though.  Overall worth going to if you're in the mood for burgers and beer.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LJfc03blK_-qzwWztBqUcw"
  },
  "uPiMeDj6KkFh1xBC8IGeHw": {
    "date": "8/7/2013",
    "text": "I'm debating between a one and a two star.  The food was...boring and poorly prepared. I ordered tomato soup and the \"gourmet grilled cheese,\" after being assured it was vegetarian. I received a panini-pressed cheese sandwich with bacon on it, and a lukewarm cup of soup that could have easily been from a can.  The sandwich was pathetic. The cheese wasn't melted (I could count the number of slices on the sandwich). The tomato was tasteless. The bacon (while I didn't eat it) looked soggy and/or rubbery. The bread looked (and tasted) like cheap store-bought sandwich bread. I'm not sure what made it gourmet. Even if everything was right, it was still just a tomato, bacon, cheese sandwich. That's hardly gourmet. Hook me up with some fancy aioli, or maybe some garlic jelly, or something unusual if you're going to call it gourmet.  Also, a grilled cheese sandwich is different from a panini sandwich. A good grilled cheese has that buttery, crispy exterior. This was just ... bread. That tasted slightly grilled.  I only decided on the grilled cheese and soup because the other vegetarian options were not enticing. I don't know why restaurants convince themselves that a portobella, a garden burger, and/or a vegetarian pizza are the be-all end-all of vegetarian cuisine. And after eating those same entrees for years on end, paying through the nose at a place like Sharp Edge for the same old crappy portobella cap just isn't something I want to do.  The only saving grace of the evening was the super-pleasant server. She apologized profusely at the mix-up with the sandwich, and was prompt and friendly throughout the evening.  Short of it: I would not go back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "yVGumqztm72dn4FpUdVeDA"
  },
  "knV7r1RoAm5bIQ8ZnIf1Rw": {
    "date": "3/14/2015",
    "text": "I've been here before & I would say they were a 5 star last time. Last night, however, I was disappointed.    The beer I got was barely chilled which was disappointing. My husbands was the same way. Our next round was slightly colder but not cold by any means- disappointing for a place that specializes in beer.  When we went to order our food the waiter told us they were out of mussels which wasn't the end of the world, however, it was the mussels that made us go back there. We ended up with burgers which were good but not \"WOW\".   Not a bad experience- just a dull one.  Also really expensive!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iGlBhxeMwRK-MD4svZ0w9A"
  },
  "fRE3WFrSg40sEwxwapvIqA": {
    "date": "6/10/2017",
    "text": "IFood was marginal, service was decent, beer is what you come here for. Bartenders are knowledgeable about the beer and helpful in choosing flights for you based on your taste. However, attention to detail of food order was lacking. Asked for a pretzel bun, which is an upcharge, got the regular bun. Asked for a side of ranch dressing for my fries as I don't like ketchup, even after repeating \"ranch dressing\" back to me, I was brought mayonnaise--which is great given that my sandwich was a tad dry and lacking. All-in-all, I probably won't go back... But it's not the worst place I've been.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hr5kcpVO1q-o5OW2JzbaBg"
  },
  "c0PSDw98HbWuO67dTKfiag": {
    "date": "12/19/2013",
    "text": "Went in for HH last night.  They have an impressive selection of beers, but seem to go through kegs very quickly.  About half the things on the menu were out and replaced by other (seemingly less desireable) beers.  I didn't get a chance to eat there, but would like to give it a shot sometime in the future.  It will be difficult to dislodge my favorite Belgian scene at Point/Park Bruges, but I'm willing to try.    I must have been too late for the HH prices - all my beers were in the $9-10 range.  Pretty pricey, but they were good beers.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QtOUK5LFF23nl0UM7pncbg"
  },
  "M2CZEolvUVPmKQQH7FYxKQ": {
    "date": "6/17/2014",
    "text": "I've frequented here many a time considering it's just around the corner from my home. .. it's decent.  Decor, is kinda blah... but who cares. .. it's all about the food/beverages, right? !  Beer selection is top notch but I do wish they'd have some local ciders available. Food is good but a little pricer than what it should be when you see your quantity. ..either put more on the plate or lower the price but I may just be overly particular on this. Service is always excellent no matter how busy it is... some how I always have the same waitress who is fabulous.  I will caution, if you like cheap beer.... do not come here. .. they don't have it & the beer prices are on par with prices of a fancy cocktail. ... with this said. .. please don't bitch about it loudly & annoy fellow guests. I hear this about every time I've dined here & is annoying.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h8zU2zZ6eB9kX65rAETN9A"
  },
  "xCB01cJ1JUWv0iCA-ro6cA": {
    "date": "5/29/2017",
    "text": "Came for a girls' night out on Saturday. Sat outside. Nice atmosphere. This was actually our second choice for the night as we were dissatisfied with our first choice (poor service). Even though this is a gastropub, the waitstaff could put a lot of the higher-end Downtown restaurants to shame. Our waiter was so nice and so attentive. There were a couple larger parties that showed up and even suggested that we put our dinner order in with our drinks and appetizers as it could take up to 45 minutes if we wait  (because of the larger parties). We appreciated this. Great service goes a long way. We had a great time. I had the blackened salmon, which was cooked to perfection! I could cut it with my fork. My friend got the quinoa burger which she said was tasty. The drinks were good, food was good, service was great even though they were busy with larger parties.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FifUZGQ6otnYk4w3BaWH0Q"
  },
  "6LDNk_UfXApYTWcOApBZ5w": {
    "date": "4/17/2013",
    "text": "Last time husband and I were in Pittsburgh, we made a point of visiting Sharp Edge Beer Emporium.  We're Belgian-brew-heads.  We love a run down neighborhood watering hole.  It just made sense.  This visit, while walking from our hotel to The Strip, we happened to stumble serendipitously on Sharp Edge Bistro on Penn.  SEBoP is SEBE's more sophisticated big sister.  Me like.  Leather couches, marble bar, polished wood, blah blah blah.  What you really need to know is: 36 taps of Belgian beer, plus hundreds of others in bottles.  Corsendonk, Leffe, Kasteel, Gulden Draak.  Anything your Belgian-swilling heart desires.  And during Happy Hour, EVERY BELGIAN DRAUGHT IS HALF PRICE.    Snag a seat on the small patio on Penn for prime people watching along with your brew.  Some folks were eating food, so I suppose there's always that if that's your thing.  Me, I'll fill the belly with Belgians.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 8,
      "cool": 7
    },
    "photos": [],
    "user_id": "mJCK1qpsCkKePozYIrIT-g"
  },
  "pJVCQHYRtQ_i_w3254rJzQ": {
    "date": "6/17/2013",
    "text": "I'm guessing that people come for the beer and love the beer. Well, I cannot have gluten, and there were 3 gluten-free beers on the menu. Guess what? They had none of them. So much for the beer.  So now let's move on to the food... the chicken burger itself was good. I had mine topped with pepper jack, baby greens, and pesto. The pesto was blah. The frites. Seriously? Those are frie/s/. Regular old fries. Like diner fries. Very disappointed. Not Belgian. Overall, waaaay too expensive for what it was. It was the 4th chicken/turkey burger-based meal (no judgments, please) that I had eaten in the last 6 meals, and it was the worst and the most expensive. (I can tell you where to get better ones if you're super nice to me.)  I was actually surprised at the vibe--in a good way. I imagined it would be more of a beer bar, but it's very much an after work dinner place for people who live or are staying in hotels downtown or perhaps a place to meet and chill out with work colleagues. We watched the Pirates game on the big screens at the bar and listened to some jerks say inappropriate things about their female colleagues. Good times.   Bar tenders were pretty cool although I don't think they love serving food at the bar.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "rpK40ZN2rNFJLhfdlQqS-Q"
  },
  "XDVLcGGrE9cvmImKC8bBsQ": {
    "date": "3/27/2012",
    "text": "Great bar/bistro in the downtown area.  We were recommended this place by our shuttle driver at the Doubletree and it did not disappoint.  The place has a huge selection of beers which suits me just fine.  The bartenders were great, allowing tastes of different tap beers and recommending some great choices.  We didn't eat (unfortunately), but everything looked and smelled great.  Looking around they also throw some cool beer tasting/pairing events.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2qW-VO3UxZSU6HSHQ7fh7Q"
  },
  "bckAGrR_iBbTnBG2RL1JAg": {
    "date": "3/10/2016",
    "text": "I've been here twice now, food was great but the service was extremely slow both times!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7wDeeduMmCty1Bmgc23-Ew"
  },
  "0DTymNMLHLN3r6gftKd3Jw": {
    "date": "4/13/2011",
    "text": "I like this location is much better than the Friendship one for many different reasons.  Same beers, but totally different vibe!    The Beer Emporium is more of a bar kinda bar.  Bar food, bar atmosphere.  This Bistro location has a better variety and I think better tasting food.  Plus the atmosphere is a lot more inviting.  Couches in the front to relax at, nice sized bar and clean restaurant area.  Hence the Bistro title!  I love their Dried Cherry Almond Chicken Salad Platter and Grilled Portobello Panini.  Of course for the tasty and indulgy choice I go for the buffalo bites aka wings.  The menu here has much more to offer than the Emporium does!  I always love a good deal for Happy Hour, so thank gawd they have half off Belgian Beers.  If you love to indulge in the beers but think, like me, that they're too gosh darn expensive regularly, you can take advantage of the half off!  It may mean that framboise you lust after could be yours for $5!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 1
    },
    "photos": [],
    "user_id": "4wp4XI9AxKNqJima-xahlg"
  },
  "AZchc-ncBopOfVZu2hrhPw": {
    "date": "9/26/2013",
    "text": "Excellent choice of beers and a very swank decor.  The bartender was generous in giving out samples.  Everyone that works here seems friendly and welcoming.  The food is very good and it arrives promptly.  I especially like all the windows so that people can see in and out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8AwcaBJjiMpQ__FPxktwwQ"
  },
  "lxYQ3FeJVnyVTJ5emvLl1A": {
    "date": "2/5/2016",
    "text": "Huge beer selection!  If you can't find something here, you won't find it anywhere!  A friend of mine got a beer cocktail, which was pretty good.  Bottles were pricy for a basic import though.  I would go back for more special occasions, but not my everyday hang out for sure!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6RHfgRlvHNvWpv9F3t8Ycw"
  },
  "zwmwlJmoDS3_LGCb_Lad8A": {
    "date": "6/28/2015",
    "text": "Ventured into here on a Sunday (6/28/15) evening with my boyfriend and his mom looking for a bite to eat. Walked in and wasn't too busy and the three hostesses greeted us. After asking for a table for three they argued over where we would sit because I'm assuming they wanted to be fair to the servers. Ended up sitting in bar area at a high top. Waited 15 minutes with no acknowledgement by anyone in the restaurant. Even made eye contact with the bartender three times. We got no service after nearly 20 minutes of sitting there. When we got up to leave the hostesses seemed stunned. Will not be returning to that location ever.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Asj0JRlxQ3WqOyTA1ci6IA"
  },
  "KDIaOVzPkUF_EwP8wlEZrw": {
    "date": "6/24/2014",
    "text": "I've come here a few times with friends, and because of my vegan diet and ambivalence towards beer, I can't say it's one of my favorite places.  Before I went vegan, I went for their half-price pizza night, and shared a plain cheese with a friend. The pizza was pretty plain all right. Like, a taste and texture not worth eating at all, but we had bought it and it was cheap so we had to.  Their tofu bites featured as a \"wing night\" companion deal are alright, but nothing special. The veggie burger is homemade, but infused with parmesan, so its not vegan-friendly. My vegetarian friend who ordered it said it was \"ok,\" but at 12 bucks is a bit steep for what you get.  Their beer selection looks good, though I can't say much else about it. They do have a very tasty pear cider that comes in a large can, and is a good value.   The atmosphere is fine as well, not too loud when I've been, with lots of space. Service has been good too.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fQB979CfsIXHmcHJhNBuSg"
  },
  "0_W1XLcgret_Um-FgP6pwA": {
    "date": "8/31/2014",
    "text": "I enjoyed the restaurant a couple of times during a recent trip. Great beer selection, staff is very knowledgable about the beers. Good menu selection. I had the HBT with sweet potato fries... Excellent",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nY_ofV-DqslYFzf-1WAssw",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. HBT with sweet potato fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nY_ofV-DqslYFzf-1WAssw/o.jpg"
      },
      {
        "img_id": "eFCdrqvrWw0oKq9PfFKUxg",
        "caption": "Photo of Bistro Penn - Pittsburgh, PA, United States. Bar area",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eFCdrqvrWw0oKq9PfFKUxg/o.jpg"
      }
    ],
    "user_id": "tOuqzsrmaVOVKafGwihH1g"
  },
  "O22Y-IqnbLWLNqSy4_MXbg": {
    "date": "1/5/2012",
    "text": "I had an opportunitiy to come downtown to visit a buddy.    The bar was quiet for a Thursday Happy Hour.    My beer was good just like the Sharp Edge in Sewickley.  I am hoping that if go to all the establishments they will make me the chain's honorary mascot.  Go for the beer, try the food.  Atmosphere - always good but tonight very quiet Prices - $$$ but go for happy hour 4:30 - 6:30 - all Belgians half off (means a $9 / 9% beer is now $4.50 :-)) Service - Very good - not as friendly as my other pub but no dings here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JgOcyMF1lTwSVCarSZrrrA"
  },
  "TQW8ZiXihrrY2kydQmxsLw": {
    "date": "4/4/2013",
    "text": "Is it a \"bar man's\" bar?  Not necessarily. But how can someone not be impressed w/ over 200 different types of beer?    Oh & whatever beer you get, it is served in the corresponding glass.  Chimay?  Chimay glass.  Lagunitas?  Lagunitas mason jar.  Get the point?  Was only here to drink, so I can't comment on the food.  But with a seemingly endless selection, not to mention comicallyarge bottles of Stone Vertical Epic , how can it not be aces?  Tons of taps & bottles to choose from as well as bottles you can purchase to take home.  What bar does that?  Now if only we can do so somethin about that hipster vibe....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "avo2ivEhwkYSJvAAKLJUGA"
  },
  "tQlyh5oqN2LgtCo0NfS9zw": {
    "date": "2/25/2017",
    "text": "We stumbled into this place during the Pens vs Flyers Stadium Series and are glad we did. Great beer and wine selection. The food was great. The honey jalapeno chicken bites were great. Not too sweet with a great kick. The brie and prosciutto was good as well as the salad with pear and walnuts. Atmosphere was friendly and warm",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W5tvKFe72UAudv5aFFflSA"
  }
}