{
  "uAsGOP4aO6E_-MyxapTctQ": {
    "date": "5/6/2015",
    "text": "We used to love this place! It has good down hill. Sad as the owner is very nice. As others say, it is clear stuff has been sitting too long as many dishes are dried out. Worse yet most of the food is ice cold! unacceptable!! 12$ and all that I could eat was the icecream. At least that was supposed to be cold",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Iq_-UfNcdi7xi9oVjGfwnw"
  },
  "OYWSRLL7w-kuPxuh4CrDXQ": {
    "date": "10/3/2012",
    "text": "Really awful, the place was empty thus all the food was either cold or very dry. Avoid at all costs. I wish ponderosa would move back in!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EOS1aH7ZASKaE2BfbQjeJg"
  },
  "_zjnhDSVaoVJs_JHec9Fyw": {
    "date": "4/27/2014",
    "text": "Their chicken and brocolli is just YUM!!! There have been several times where I had to go just because of that for a very far places. Overall, its a bit noisy and staff is really loud all the time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5uYNGx7PKC0RBpq3vSp1cw"
  },
  "Dqy0VZCtGmBFPscrlXnRXg": {
    "date": "2/7/2013",
    "text": "That was one of the most disgusting experience that I had in my life....very Bad FOOD  period!!",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "5ZB7URVq_NJf8CK_z_hhrg"
  },
  "lpzCQ0iYJVp1K1Hz-UMUfQ": {
    "date": "4/8/2018",
    "text": "There is more in my empty fridge than on this buffet!!! Later in the evening on Sunday night we stopped by for a late dinner...pans were empty and the little bit that was scraped over looked like lunchtime leftovers.  We should've gone down the street to Angkor...but...it was late.... and we tolerated it. When I mentioned to the cashier that the buffet was empty... She was just plain nasty and said that what did I want...it was almost closing time.  She hastily took $27 for the lousy food and service.  Then she turned around and strutted away...Well...so did we because we won't go back...ever.  AWFUL!!!! One star is 10x too many!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y9bSlSiYzPAlftEYPB6b8Q"
  },
  "6KtrYoB9wZECn26xRIUaiQ": {
    "date": "11/27/2016",
    "text": "Lunch buffet is highly suggested the first time you go here. I don't usually do dinner because of the price, but I'm not a crab leg in Pittsburgh fan so it's not worth the extra to me.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "7FmHFmKsaUKyAHwdMqG2aw"
  },
  "eWkQyrExztziyuEn3Sdy1Q": {
    "date": "4/13/2018",
    "text": "This restaurant is by far the worst buffet I have ever been to.  The lady who owns the place couldn't be any more horrible to the customers.  Half of the buffet bins were empty and don't even think about the crab legs.  Absolutely the worst crab legs ever.  How do you screw up crab legs you ask?  They tasted like they sat in salt water for 2 weeks.  The crabs were mushy and salty.  And the only time they brought out the crab legs is when I asked them to.  Which of course they got pissy about. When I asked them to fill the pineapple chicken...someone stormed into the back...came out with chicken nuggets...threw them in the empty pineapple chicken tray that did still have some of the sauce left in it.....then she went over to the salad bar and grabbed a handful of pineapple and threw it in the pineapple chicken container.....I couldn't believe my eyes.  Horrible staff...an even worse owner....horrible food....Stay away from this place.....seriously.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kV_-5fcIqQPbAsSOAEdsLA"
  },
  "wBuSxE7iQFR7fW0dBHWOpg": {
    "date": "11/17/2017",
    "text": "This buffet is gross. The first time I ate it, I threw up a few hours later. I gave it another try with my friend and the honey chicken tasted like straight up ketchup. The food was just not good and it was such a big waste of money both times. I will not be going back again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "evZFDCpticNiFlK8Bzlq2Q"
  },
  "hnGcINBFSyfZR405Lq3iWw": {
    "date": "10/31/2014",
    "text": "My boyfriend is a buffet freak. He could eat one for breakfast, lunch and dinner if he could. I, on the other hand, enjoy buffets but only on occasion. Buffets are nice because you can take what you what and try new things, however sometimes when I go out to eat I just want to sit and have somebody bring me my food.   Last night I caved and agreed to go here to make him happy. Was it bad? No, not really. Was it good? Ehh, I've had worse. The best way I can describe this is really just your typical run-of-the-mill Chinese buffet. It's nothing spectacular, yet you'll still be able to find something you'll like.   As I mentioned in previous reviews, I like the more \"American\" Chinese food like Pineapple Chicken. There is no shortage of this kind of food as they also have a few American dishes like fried shrimp, chicken bites and onion rings. One thing I enjoyed was their coconut shrimp. It was probably one of the best I've ever had. It was unusually creamy (in a good way) and had a sweet taste that wasn't too strong.   The biggest disappointment for me was their crab rangoons. Not only was the amount of stuffing extremely unappetizing, but it was way too sweet. I'm not too much of a sweets person so I was turned off. It made me sad because I really enjoy my crab rangoons! That's one food that's usually a guarantee score for me at a Chinese buffet. That being said, all of the food seemed up to temp and watched carefully by the staff.   The place itself is a little dated but what do you expect for a place like this? It was 7:30 at night and we were one of the three or four tables there. I will say that the employees are very friendly and the woman who took our check (I'm assuming she's the owner), thanked us several times and really seemed like she appreciated us coming in. If it wasn't for the kind staff, I probably would have given this place two stars. Customer service goes a long way!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "pkpzIhX1mNzLLEEyj4syKQ"
  },
  "CakaamI2HN7CTify4CVJaQ": {
    "date": "6/15/2014",
    "text": "China king Buffett was a  diamond in the rough. I was introduced to the restaurant 4 years ago and have been a customer ever since. Besides the grand view buffet at the casino and Tokyo Buffett in the north hills this is my favorite Chinese restaurant to recommend to folks traveling west on 376 .   I try to base my reviews on quality, variety and price. The lunch Buffett will allow you to fully enjoy your time and you will never leave hungry.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "ERskdga90GvEF0Bf0LJ4Jw"
  },
  "ooJO9wqACPsODXiPyvpQ6Q": {
    "date": "3/24/2016",
    "text": "This place is a little above average Chinese buffet. I was quick to be seated, and quick to get my drink that was ordered at the same time. During lunch it wasn't too crowded. The assortment of foods was abundant with a hot and cold station. It also had a fried station with some American foods as well(pizza, fries, chicken wings, etc). There were some desserts, sushi, and even ice cream. I had the chicken and broccoli which was hot, fried rice, some egg rolls, and wonton soup. All were very good. for the price of lunch $7.75 it is worth it. Everyone I was with also enjoyed what they ate. We will be returning for lunch",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "8sjJVxEOTko2iH1n-OUsDw"
  },
  "-lBxP7JlTYZo53H1BeC4yg": {
    "date": "8/16/2017",
    "text": "Traditional chineese buffet. Food was hot, fresh and tasty. Lots of varieties. The staff was friendly and attentive on the drink refills. The decor is a bit dated but it is clean. The staff was continually wiping down areas and changing out the food with fresh offerings. I will definetely come back when I am in tje Pittsburgh area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1cBgwTx98QmTIHAMQmqoKg"
  },
  "gwMg7TOI3KjepoXg4Da7Kw": {
    "date": "1/2/2017",
    "text": "I wish I could give it zero star. Horrible. The quality of food was terrible. Garbage. The waitress could notspeak English well. I asked for coka and they did not know what is the coke. Everything taste like socks. Spending a penny is too much for this place.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1-btA8ZavX_uSWos_HvzHQ"
  },
  "gYEIUJuWQb8qoT6ee66OiQ": {
    "date": "2/3/2015",
    "text": "Place doesn't exist anymore!  I went up and down back and fourth, def nothing where that address is.  Nothing",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y-2dxuu8Ve3bKpF2YE4X2g"
  },
  "OLJDXyR2WbOQLFAtjt59BA": {
    "date": "6/23/2017",
    "text": "I would rather never come here ever again. Came her many times before and they had a server that was really nice and every time I finished my food that would take my plates. But now she left and I come here often and this place is get ridiculous and server are getting more retarded. For example now the servers don't ask to refill my drink anymore and you might say if you want a refill you should ask them but it is not my job to ask them but its their job and they are the ones getting paid to do the task. Also they stopped taking our used plates it just sits in the table and no one collects them. The seats are dirty and the building is really old. Also if you are looking to find a god place to sit and eat in a quiet place this is not the place the dumb Chinese people talking really loudly that it feels like you dont want to eat anymore. DO NOT COME HERE.!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fYGXnWBh-RVYTKa9177Afg"
  },
  "Ko9IuKZaWBarbzOrdWdOwA": {
    "date": "2/12/2014",
    "text": "I was in the area and craving quick Chinese so I figured I'd give it a shot.    I would rate it ok at best.  I arrived at 7:30ish to a place advertised to be open until 10.  There was one other table in the entire HUGE restaurant.    Most of the buffet was picked over and you could tell that it had been sitting out for a while.  I asked if they would be refreshed and was told \"we closing soon\"  It was 7:30 and the sign on the door said they were open until 10.    The best thing I ate was the sweet and sour chicken.  That isn't saying much considering that an easy and fairly bland dish that is.  But the chicken had a good texture and the breading was right.  They had a lot of dishes that I enjoy, but most were dried out or almost empty.  The coconut shrimp looks like it would have been very tasty, but all that remained in the dish were remnants of sauce and one lonely shrimp.   I tried both the hot and sour and won ton soup.  The wonton soup had good flavor, but the won tons were dried out, again probably because they had been sitting a while.  The hot and sour was not horrible but not great either. Service was nonexistent.  I had to go to the register area (where the person was playing games on her phone) in order to ask for a refill on my water.   Not a great overall experience and the food was meh, but for the price, ($10) you aren't spending that much more then you would have on fast food and had a larger variety.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_VTEyUzzH92X3w-IpGaXVA"
  },
  "5kQiLIQAxLEVitdkBGb5pQ": {
    "date": "5/10/2013",
    "text": "I saw the other low ratings, but I was feeling brave and hungry from an intense Krav Maga session at Wright's Gym down the street.  What I got for my bravery was low quality food at low prices.    The place was almost empty, and the food ranged from mediocre to downright inedible.  All the vegetables had been left under heat lamps so long they were neither solid, nor liquid, but some abomination between.  They had a fairly wide selection, but unfortunately it all tasted (at best) bland and the same.    Pittsburgh is home to many great asian buffets, this is the worst one I've been to here by far.  I hope you'll be wiser than I was.  Heed the low yelp rating and save yourself some disappointment.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "MDeA-Gx8NScCyAdziq7IeA"
  },
  "zOV5ox5kZArz0OaPLAS8NQ": {
    "date": "8/21/2016",
    "text": "Came here with my boyfriend because there were decent reviews and members talked about how good the sushi was.... There were only two types of sushi and no soy sauce to be found anywhere in the restaurant. The place smelled awful and the bathroom resembled a sewer. The food tasted like river water, and any dish that contained dairy basically smelled and tasted like vomit. Not an expensive place, but for how much the buffet cost definitely not worth it. My boyfriend- who enjoys shitty buffets even said- the worst Chinese buffet I have ever been to; don't waste your time.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gbTcggDMwvtBD8EuqrKGNA"
  },
  "pR_QAKLjkx42Zt4my322rw": {
    "date": "4/23/2012",
    "text": "China Buffet King is a good, traditional Chinese Buffet restaurant. It is located directly behind the Wendy's on Noblestown Road, so it is easy to miss unless your looking for it. Good food, good service. About what you would expect from a restaurant like this. Price is reasonable as well!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Dy7mJRr52fFw_PxuO-Ht9g",
        "caption": "Photo of China Buffet King - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Dy7mJRr52fFw_PxuO-Ht9g/o.jpg"
      }
    ],
    "user_id": "XbDp87Hr1D_dOUb9vbo7TA"
  },
  "f9_fsq-YB7g4yXtc64anqA": {
    "date": "3/7/2016",
    "text": "I think some of the reviews are a little harsh. Not the greatest buffet I ever had, but certainly not the worst. Been here a few times, some experiences better than others. Here today, and I'm glad I made the choice. Everything tastes hot, and was good. Friendly waitress. Plenty of food choices, will be back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "1WM9rK8lkct03GWKmrHFww"
  },
  "AklgPtbXK9O659Ndy3vCbA": {
    "date": "7/19/2014",
    "text": "Decent food buy WAYYY too expensive. $13.50 dinner price is outrageous. I'd rather go to an actual Chinese place like Sesame Inn and get very high quality food for much less.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TqU4nP56jTS7-maNCItykA"
  },
  "0-9NmC0H5lbaAJGxZn66lQ": {
    "date": "10/29/2013",
    "text": "Expect to stuff your face and feel awful afterwards.  Great Chinese buffet experience.  Food hot and its clear there is a high turnover of tables.  For 7 bucks; Can't beat it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "h2u6zWZSAnwVg28I2AmPZw"
  },
  "eiJEJNegN86DolxD2WzbWA": {
    "date": "7/2/2012",
    "text": "Good food. And the waitress leaves you alone...until you need a refill on drinks.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "XXBy1qXvig6xAyQZR6aRSA"
  },
  "LnCIP5tbxWt6fsJFHXgn9A": {
    "date": "5/30/2015",
    "text": "I recently went to the China King Buffet, because my parents kept saying how consistently good the food was. This could not be further from the truth and in fact, it was among the worst dining experiences that I've had in over a decade. This has to be among the worst Chinese buffets in the city. Listen to the others reviewers, the food is awful and your money would be better spent elsewhere.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FFm_No81TVog6UjTbIdDbg"
  },
  "tXioAHp6VIPqbMrwmJwb6Q": {
    "date": "6/2/2019",
    "text": "Decent buffet for an amazing price - lunch buffet is 7.75 for all you can eat cheesy mussels, at least 8 different types of chicken (honey chicken, pineapple chicken, basil chicken, sweet n sour chicken,  chicken on a skewer, general tsos chicken, chicken n broccoli etc) pork ribs, sauteed imitation crab, two types of mushrooms, steamed fish, twice cooked green beans, two different flavored broccoli dishes, creamed spinach, steamed and fried dumplings, other various fried foods (like onion rings, fried zucchini, crab rangoon, etc), shrimp, sushi, various soups (hot n sour, egg drop and wonton), ice cream (moose tracks, cotton candy, butter pecan etc), fresh fruit (honeydew, watermellon, oranges, red bananas etc) egg custard and so much more. My favorites in the buffet include the broccoli, mussels, dumplings, fish, ice cream and fresh fruits.  The food can be a little heavy - well actually very heavy - and some of the fried food is not that crispy and other food is not as fresh depending on when you go but you can't beat the price of 7.75 for a lunch buffet that offers what this place others. You will not find a better deal for your money anywhere else close.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "k0eL3zxukakoi4DRkbxGng",
        "caption": "Photo of China Buffet King - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/k0eL3zxukakoi4DRkbxGng/o.jpg"
      },
      {
        "img_id": "P1IpW0d5h77jXRtcTd2a2g",
        "caption": "Photo of China Buffet King - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/P1IpW0d5h77jXRtcTd2a2g/o.jpg"
      },
      {
        "img_id": "djVWlUW4OZ2osoLrSVDUVQ",
        "caption": "Photo of China Buffet King - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/djVWlUW4OZ2osoLrSVDUVQ/o.jpg"
      }
    ],
    "user_id": "cgecfJZ46npwKX2iOIbVWg"
  },
  "eM8OpBWrwtVdWCSOzHpK7g": {
    "date": "5/5/2019",
    "text": "Honestly don't understand everyones negative reviews. Let me clear some things up. The place is not a mess or dirty. At least not at the time of me writing this. The price is fantastic. Me and my girlfriend come here specifically because its cheap. Rougly 26 dollars for dinner and 2 drinks. We would tell you the price for lunch but thats what we are getting now so dont know yet! I won't lie. Sometimes it doesn't taste all the flavorful, VERY rarely (we come every Saturday). But it usually is very good. If your coming in 30 minutes to close or after open, expect less choices and less quality. I back them up on this. Our first visit was 30 minutes to close. At first i was severly dissapointed in the quality but the manager was very kind and explained they were just closing but were happy to refill anything fresh if we would have asked. So we came back much earlier and it was MUCH better.   In short, your paying VERY cheap. For its price, i think the food is beyond good! But overall, i know this isnt the best Chinese food. Ive had better. Im not coming for fantastic die hard ungodly great food. Im coming for some pretty good food thats extremly cheap. And thats what i get. The negative reviews are of people expecting more out of a roughly 13 dollar per person buffet. Hell thats cheaper and taste better then golden coral (17 per person).   P.S. the floors and walls arent dirty. Who wrote that  Edit: lunch was 18.80!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SXaF7C1uo2_cH-8JiDazqw",
        "caption": "Photo of China Buffet King - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SXaF7C1uo2_cH-8JiDazqw/o.jpg"
      }
    ],
    "user_id": "U9nhZwwcvUSyEfLwoiTnOg"
  },
  "vcf05xQ38uJ2ZaoR7vFLdw": {
    "date": "2/14/2019",
    "text": "This is the worst of the worst! Stay away, seriously. You've been warned. Normally I would find something good to say about a Chinese buffet. Eventually in this review I will tell you the one redeeming quality of this place.   Tasteless, greasy food. My date said the General Tso's was decent, not great. The fried rice was salty, noodles were limp and flavorless. The only thing I really enjoyed were the dumplings. Nice pork filling. The sushi was sparse and only two varieties. Gas station sushi would be a step up.   Normal desserts, ice cream, tasteless \"cake\", fruit, bananas with that mystery red sauce, and an Apple pie my date said was the best thing on the buffet.   At $11.99 it's cheap and filling, but go find a place that has quality food, even if it's a few dollars more.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UsmTxWbobLsI6WR1Db0W7A"
  },
  "lTJPla-dmbAZV_kvS9TSrQ": {
    "date": "6/13/2019",
    "text": "The waitress wanted 10$ tips for 26.70$ total even it was a self-service food She insisted to take the tip and I had to given it. I feel like robbed so rude and unlovely service. She was looking at me in front of me if I'm giving tip or not. I've never seen something like this.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Uq1YPI545drJ5c0pomFgmw"
  },
  "3wNVEqERRavTWwjDVHH0iA": {
    "date": "11/27/2018",
    "text": "WORST \"BUFFET\" in the area!!! The food was not refilled and the food that was out was old, soggy, and cold! I asked a waitress, and manager to bring out some of the food options that were empty and it took over 20 min and it was noon- lunch time!! Then, when I had to get back to work and was unable to wait any longer for the food to be brought out the manager told me I would still need to pay full price because I ate food. The only thing I ate was a bowl of soup and a little bit of fried rice that I was able to scrape out of the pan. The manager was rude, and on his phone the whole time he was speaking to me. He is the only person in the restaurant who was able to hold a conversation in English. This buffet was absolutely horrible. Save yourself the $7.75 and don't waste your time at this place!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "5PlmEdnt8zMcBDOBIQeutw"
  },
  "u8ATkK0KKh2LSw5SOkoZqw": {
    "date": "6/12/2018",
    "text": "This place is really good. Don't understand all the negative reviews.   What do people expect from a low-price buffet restaurant?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "i1RpweYkmTT7t4wYpXsx9Q"
  },
  "DE732AGmpqw7z6ZEz8_73Q": {
    "date": "4/24/2019",
    "text": "I've been going here for several years.  It's no-frills, for sure.  The food is good and so it the service.  Lunch is still $7.75",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_oAcQC30dYcWSx2DTQBqKA"
  },
  "hCS3HQ1ckPYSik09LMdxtQ": {
    "date": "9/26/2018",
    "text": "I stopped in here yesterday and thought I would give it another try and my first impression was that there was not much of the food put out after the place that already been open for a half hour and when I asked the older Chinese woman who I believe is the manager if there was going to be more food put out she angrily and defensively pretty much scolded me and told me \"we just open...\" and I could not understand the rest but she was very rude and cold about it and I don't know if that is just a cultural difference or what but that may be the last time I go here",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_ekUMPGWf4QB5uj6yAvGIw"
  },
  "vPVvCZVl-QY3RDwhfLAYtA": {
    "date": "4/14/2019",
    "text": "Great buffet and pretty cheap as well. They refilled it quite often and they had a nice variety. Would highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R6XlI-pAhqrumap410fJ7A"
  },
  "9LE65kkgyJwelvdG3JLe4Q": {
    "date": "3/14/2019",
    "text": "I was treated rudely by a waitress who is a middle-aged and short woman at this buffet. I was walking towards the food section and this woman walked \"through\" me at a fast pace as I didn't exist. I would have run into her body if I didn't stop quickly enough. She didn't even look at me and not alone saying sorry. As I said, she behaved as I didn't exist. Afterwards, she put our check on our table and stared at us for 3 to 4 seconds when we were still eating. I felt so uncomfortable! She left and came back in about 10 minute, pointing at our check, said to me:\" Do you want pay?\" OH MY GOD! That is equivalent to \" get out\"! I have never seen any restaurant treating their customers like this! This is absolutely unacceptable! A restaurant like this should be shut down. I will never go to this one ever again!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jc1g0AwVaiPsZc6JRsq9GQ"
  },
  "a2hdv-2Ortth2CJV9Niizg": {
    "date": "7/2/2018",
    "text": "We've gone to this buffet since it opened.  My kids were little then, now they're adults and it's still one of our favorites.  Don't listen to the negative reviews.  Restaurants don't stick around twenty years of they are as bad as these people claim.  I love the peanut butter chicken and the coconut shrimp!  The crab Rangoon is delicious.  The staff is ALWAYS KIND, drinks always refilled, I always leave FULL.  LOVE this place.  It's always one of our favorites!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "N5_Dyq6VKqoPnBs0FbUDqA"
  },
  "ST_UJkLPQgVq1IKaWHNhGQ": {
    "date": "12/20/2018",
    "text": "Ignore the negative reviews, it's a cheap Chinese buffet and it is DELICIOUS.  I go often, the food is always fresh and refilled often.  I guess the naysayers just like to hear themselves bitch",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bC8x3bzbFMZ9VitC0NK6Zw"
  },
  "lp6wGz65IpZKYllkZu45ZQ": {
    "date": "5/27/2018",
    "text": "I really can't figure out why my husband loves this place so much and I only go there when it's his turn to choose dinner. I feel like this buffet has gone down hill over the years. Last time we were there, everything was cold and picked through and it was fairly early into dinner (around 6:15 pm).",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_O5ajREINPG9zeyhW5Dmqg"
  },
  "HWYxsx3aW77276Nq3f-CQw": {
    "date": "8/27/2018",
    "text": "Quick, fast and cheap. Lots to choose from and the staff was friendly. It's you're typical Chinese buffet.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AJ6oDR8G5eVbOLMvlZpKeQ"
  },
  "cS4xwhj2zi0-GAGegoA_pg": {
    "date": "6/30/2018",
    "text": "Great buffet with a lot of choices. I'll be back again. Clean, roomy, and bright. Good chives of desserts. Even saw the staff eating the food so it must be good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gjrjz7PBjx1hVB9eM7yo4A"
  },
  "f31VvV-FV-OEWrjvVxngrw": {
    "date": "7/16/2016",
    "text": "In Pittsburgh from Michigan, was looking for a quick place to sit down after hours in the road.  It was after 6pm on Friday and we were hungry. My daughter loves Chinese buffet and our local said it was close to hotel.  It is tucked behind Wendy's; we passed it the first time.  The parking lot was sparse which worried me, but it was still early, I hoped.  The waitress was nice and efficient, refilling our lemonades constantly and finding lemons for me which is a staple in buffets in Michigan.  The food area was clean and I saw a woman consistently wiping the counters which I appreciate.  The food was standard fair, a little better than most.  My daughter didn't appreciate the sushi or lack of variety which is her favorite.  I had crab legs and peeled shrimp, not bad.  I don't eat much of the breaded stuff so I cannot review those.  I did try the peanut butter chicken which surprisingly I liked the sweet meat.  The ice cream was excellent only about 6 flavors.  I had jello with a tablespoon each of mint chocolate and butter pecan.  my daughter had mint chocolate and chocolate.  All were great!  it was a nice space with a quiet atmosphere.  Good for families and date nights.  The waitress gave us 2 fortune cookies with the bill.  Overall it was average to good experience and food wise, however not great.   I would come again if in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "53l6Pz4UJfK0IAwQ-jyA-w"
  },
  "WG10uEmfWGbTlnnC-4h2DQ": {
    "date": "7/12/2016",
    "text": "This is my favorite Chinese buffet, and I LOVE Chinese buffets. The dumplings are fantastic. The General Tso is nice and tangy, and the pepper steak is deliciously salty. The hot and sour soup is better than at most a la carte places. Plus the \"fried\" category of food is extensive, and good. I love that they offer real Hershey's ice cream, including moose tracks, instead of the nasty ice milk at most buffets. They do not offer a ton of American selections, which I think is a good thing. The service is more attentive and friendly than other buffets.  I only hesitate to give 5 stars because if they are not crowded, the turnaround on dishes can be slow. Also, they always have the exact same dishes. I like it when there are always the old standbys, but some new rotating dishes as well.  Overall, if you are looking for some solid Chinese buffet food, this is the place to come.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "3SrvQNZ1d1D5ynOP2LTVpw"
  },
  "ICubfv3YHbZbRuj-aaFq3Q": {
    "date": "6/17/2017",
    "text": "Even though the last time we are her my wife got food poisoning we still decided to give it another shot as we er hungry and wanted buffet. The building is mess and the only thing that let's you know is porn are the cars in the lot.   We walk in and the guy behind the count is talking to one of the buffet servers. I say excuse me after waiting some time snd he turns to use with an agitated look say just wait I have to talk to her. At which point we turn around snd wakj out abd decided on Thai food instead.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "pLfvPx8xsTfQGAUantG7uw"
  },
  "HvIzDKfvg_hilQCW4cZRMQ": {
    "date": "4/20/2016",
    "text": "I don't usually like buffets because either they are horrible and I don't want to eat there again or they are amazing and I ate food coma worthy calorie bombs in each plate.   These guys have delicious food in their buffet. I loved the sweet and sour and appreciate that they kept the sauce separate. The beef brocolli was good. The general tso was okay. I was in the mood for protein and sugar so that's mainly what I got...  They also had tons of fruits and some salad stuff... They had a decent selection of sugary options. The apple pie thing was like anywhere else. Pudding and jello. Yum. And the best was their Hersheys Ice Cream. My parents owned a convenience store and we sold tons of food including Hersheys Ice Cream. So right when I opened that fridge I jumped straight for the Moose Track and Butter Pecan. Oh my god Hersheys has those to flavors on point. Sorry I'm getting off track. This place was cheap offered tons of delicious food. And they had fast service. I think I gained 10 pounds...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "KsHaXs4OfojDHqzhRqTlmA"
  },
  "53D9c4oH7P047ShW6RYHUA": {
    "date": "5/24/2017",
    "text": "This place is disgusting. There was dust and dirt on the carpets. The food was not made well at all. I couldn't finish my food (not that I wanted to) because I was so grossed out by the look and cleanliness of the place. You're wasting your money if you go here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "KWQQEttb8tmmRMc5s-lKng"
  }
}