{
  "ttqdyw9jVuAw3XcC6N-Gzg": {
    "date": "10/5/2017",
    "text": "The tacos are fine, but it always takes way too long for them to be prepared. Last night it took 15 minutes and there was only other customer in the store. I far prefer El Burro in Regent Square.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xg98DhTV0z4yNiC4LChDtQ"
  },
  "Fd80Xb6qczCdHVLbM1uA-g": {
    "date": "9/8/2017",
    "text": "Taco's really are really average but it's almost impossible to find a taco shop in the city so it's passable. Service is pretty terrible. Messed up multiple aspects of my order last time.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VgrfY7oeGfYcWiSVA_64Lw"
  },
  "w6dTOX7O4eIy7YeNWvlabQ": {
    "date": "10/14/2017",
    "text": "Really good tacos at a fair price. I think the pork tacos are especially good. Fast service. Not much room to eat, tho, so be ready to take them to go.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "upiilBMeKjt-7DUDAxPihA"
  },
  "nEPseny_hAYF6lU5rF48Tg": {
    "date": "9/8/2017",
    "text": "Woo tacos! Also, read the lower reviews below. Not sure what alternate universe these folks are in. The Tacos at this place are sizable, tasty, filling, and for what you get, and compared to prices in the area (I work in squirrel hill), VERY REASONABLE. I have a pretty good appetite, and all I usually need is 2 tacos (that's $6 and change for a tasty lunch!). And If you're really famished, then go for the taco salad! It'll fill you up. Seriously the other day it took me 45 minutes to get through mine, and it's only $5 and change!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L6-Q85VyjYRGwJ8DGL1ayQ"
  },
  "Uk3s0nZbV0JhxQe4YOladQ": {
    "date": "8/18/2017",
    "text": "Great hole in the wall taco place! Convenient location for a quick place for tasty food! Got the chicken taco and it was phenomenal",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WSrWZAnTikz1o3PPhXfVLQ"
  },
  "mH4e6JuMlUzBgMZ_YgEsaw": {
    "date": "1/16/2018",
    "text": "Spicy beef was delicious, chicken could've been better. They have tubs of cholula, both the green and red which is a nice touch.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wDEUVdBgVqNhqj5v3WFzYQ"
  },
  "9gcig4piALnwwdQptNCHkg": {
    "date": "8/14/2017",
    "text": "Tacos are pretty good but not quite sure if they are worth the price.  The salsa on the other hand tastes like they just poured Ortega out of a bottle from Costco :P",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "knjwsoTWSdamodG6hTp9Lg"
  },
  "6hKnU5pR2dr97fH40LlkmA": {
    "date": "8/24/2017",
    "text": "The food is absolutely wonderful. It makes me look for excuses to go upstreet. I wish they'd have barstools for those who choose to eat there, though, at their two counters. You have to stand and wait, then stand and eat. But the food is amazing. I will return. And return. And return.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9QXnLxxMOqfqIegODZ8N3w"
  },
  "haDAsxatiUzIOSCkFP4MLw": {
    "date": "10/21/2017",
    "text": "best tacos .... we got the chicken and pork and a chicken nacho . they were ridiculous ... reminded me of California  the tacos on the beach and late at night the stands on the corner . and the prices are crazy ... considering how cheap they are $3 for tacos and $5 for nachos i have no idea how they're making a profit. seriously but while we were waiting for our order they had a line out the door. seriously the best tacos!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pQzRxEBQKoWSYJ9-4y2K2w"
  },
  "Re9cF2f45hcZ1twEmgQX1g": {
    "date": "9/7/2017",
    "text": "Was so excited to see Bull Run open in Squirrel Hill. We walked down and ordered tacos for a group of friends. Got all the way home only to find out that we didn't have all the tacos we had ordered and paid for. Sort of sad, but the food was really good. We're going to give them another shot, I hope this time we get our full order.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6u14ektkze2DcorIkPuYSA"
  },
  "7UcY5FYAvNyRAatiwlG-LA": {
    "date": "9/27/2017",
    "text": "Super tiny - almost a literal hole in the wall (I think this used to be the location of Waffelonia). This is definitely a place where you takeaway, not much space to stand and eat.  I ordered a few tacos. There was only one couple ahead of me waiting for an order. It took over 10 minutes to get my tacos. The tacos themselves were fine. Plain ground beef -- pretty generic, but pretty good. I'd have to go back to try some of the more innovative tacos.  The biggest plus was the price--cheap eats for sure!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z3f78GereM3pspS5Yqjlqg"
  },
  "yRJAczvvCoJORPCE15wGXQ": {
    "date": "6/5/2018",
    "text": "Chicken tacos were great! Really enjoyed the rice - it looks like it's not a regular item but would love if it were! Also very, very affordable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rc-hG9g0GEDVl-410oK99Q"
  },
  "MPdOF66hIMtNnxtIIroASA": {
    "date": "8/22/2017",
    "text": "The more I eat, the better it gets. I've had the nachos three times now with all different meats and I think chicken is by far my favorite. It's LOADED with meat, I even have leftover to share with my German Shepard. (A prize for her patiently watching me stuff my face ) Price is very cheap ($5.95), something this size would cost easily $8.95 at other places. I've also tried all the tacos, and I think the beef taco in a flour tortilla togo's the best. The corn tortilla got a little soggy last time. Haven't had a chance to eat it there yet, but I can imagine if it taste this good an hour after I pick it up, how much better it would taste fresh in the store. Price for tacos sounds expensive at first ($3.00 each) but after you eat them, it's so filling and packed with meat, makes it totally worth it.  There's always a line when I get there but it moves very quickly. Staff was very friendly and worked quickly to get everyone's order done right. Overall, great addition to the neighborhood!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WMyUfQtfLRKNvlgD0ujuyQ",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States. Left side: Pork Right side: Beef Both on a flour tortilla",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WMyUfQtfLRKNvlgD0ujuyQ/o.jpg"
      }
    ],
    "user_id": "w2AYXokBMGjAAdHsYQnPxg"
  },
  "ZaMDHUamFAQIRfh6gaMXvA": {
    "date": "1/12/2018",
    "text": "A small taco shop located in squirrel hill. There are two tables without seats for eating and a small bench for 2-3 people to sit and wait, however most stand to wait. There is absolutely no reason to call ahead for your order, every time you order ahead, the food is never ready when you arrive. I've been to this location 4 times and each time I've waited more than 30 minutes for basic tacos. The wait is not worth it, as the tacos are soggy, tough meat and lacking flavor. Forget about ordering nachos to go unless you enjoy eating soggy flavorless stale chips. I do not recommend this location.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eqXE-RXL30BiUWoeFxM6OA"
  },
  "_gnd6wHRtyqNSz9aMZCPVQ": {
    "date": "9/9/2017",
    "text": "Cheap, tacos that don't taste cheap! Pork tacos are my favorite, and they don't cease to amaze. I always need to get takeout though, since their \"seating\" is basically just a couple of standing bars with no stools.  All in all, I never expected to be wowed by $3 tacos, but I was :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0ZUaj2dASxlNK2jOFjeZSg"
  },
  "K5WY9HvKm46C0AjtWLz-Dw": {
    "date": "8/13/2017",
    "text": "As the others mentioned, Bull River Taco has been a long-awaited update to the Murray Ave. restaurant repertoire. One of the endearing but slightly frustrating aspects of Squirrel Hill restaurants is that while we have great variety of food available, there is a lack of quick take-out options for people on the go. This little place is a promising remedy.   I tried the chicken and veggie tacos with my sisters a couple nights ago. I stopped in on my way home from work, and was in and out in about 10 minutes. The staff were friendly, and they worked quickly. The store was out of nachos, which was one of the items I had hoped to try, so no word on those yet. We thought the ingredients tasted fresh, and the seasoning on the shredded chicken was balanced and well done. I also appreciated the use of corn tacos and real queso cheese -- something I grew to enjoy while living in California and which has been difficult to find on the East Coast.   All in all, this is a great place to grab a quick, reasonably-priced lunch or dinner with a much more authentic and satisfying taste than larger taco chains. I hope this new restaurant is successful, as I will most certainly want to go back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4xEFFkoTrXflI1SghcDC7g"
  },
  "TFG4zlA4cwVxhubOoRUc_A": {
    "date": "4/23/2018",
    "text": "This place is the best! Haven't met an employee I didn't like. My roommate & I are frequenters & the one gentleman always remembers me when I go in. I highly recommend this to anyone who loves a good nacho!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pamocJSxxLDyAlXv8gXiBQ"
  },
  "KcGNimEo5JKYHnYo1RDQHA": {
    "date": "8/4/2018",
    "text": "We are having a cookout today and wanted to get a box of 20 tacos.  The woman at the counter was nice.  She said that this a catering order and they need 24 hour notice (even though it does not say that on the web site).  But they weren't busy (there was no one in the shop) so she said she could do it.  The guy behind the counter rudely turned around and said he 'didn't want to deal with this today' and told her she could't make the tacos for us.  So we drove to Moe's and got tacos for the cook out.  Too bad - I was hoping this would be a nice addition to Squirrel Hill.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h5Wass-NW9UGguXjMX0mdQ"
  },
  "8MhMQjVhBvrzqmxGkZ1nfA": {
    "date": "8/10/2017",
    "text": "This is a great no-nonsense taco joint for quick eats.  The prices are reasonable and the tacos are amazing. The ingredients are always fresh and the composition of the different tacos are very well crafted. If you have chipotle fatigue like many of us, this place will seem like a breathe of fresh air.  The shop itself is pretty much brand new with great fixtures and fun design choices too.  I suggest the pork tacos!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E5Xnv2KQkt0R_Rm97tDJcQ"
  },
  "Wxp6vlhHH3WTRL2_t3js5A": {
    "date": "8/28/2018",
    "text": "These don't taste like real delicious tacos.......more like a suburban white boy version from 1986",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CZxTyU7RJSybqjCCtO970w"
  },
  "MFoj9DF33RubcYutH77yXw": {
    "date": "9/4/2017",
    "text": "The portions are huge. I've tried the spicy beef tacos, chicken tacos and the salad so far. Food is consistently good and take out is quick.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "9ur0YKKae4ueOj240sZ4Mg"
  },
  "s0fSuLIOe2fE_om0jwnuew": {
    "date": "11/30/2017",
    "text": "This place is exactly what a Taco place needs to be. Cheap, tasty, simple. The Spicy Beef Taco is my favourite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fjamzhzpm6lommM5lx5HOQ"
  },
  "f6EmXDXXGZ1rqR2XRxNNTg": {
    "date": "5/31/2018",
    "text": "Great tacos I had the pork and the special which was a brisket. They have cold mango jarritos too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DbDHXGbJBEqAnn60XChMdQ"
  },
  "dddEMbTATDdoIsS04YlirA": {
    "date": "10/19/2017",
    "text": "Small place and staff pretty friendly.   Ordered a Chipotle chicken taco (special), Vegan, and another chicken taco.  Overall, it wasn't that great.  More like college food - quick and inexpensive.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fxELYAwBpOWlhWSwm2e-sg"
  },
  "yBkapjlODUYCS0TJM_Sfhw": {
    "date": "8/20/2017",
    "text": "4/5 times we've been here our order has been messed up. Got pork when I ordered beef, got guac when I asked for none, got flour torillas when I asked for corn... Something Everytime. Bullseye sauce is ranch and tasted sour last time I was there. Fly's flying around everywhere. Really wanted to like this place but they need to figure some stuff out.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0F1hue1FtbKDFIOUskfcyQ"
  },
  "UuBCMPYv1guxYHVWVo6QXA": {
    "date": "6/10/2018",
    "text": "Wonderful halibut tacos. Just wish the place had seating,  however it probably wouldn't be as inexpensive.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qzkq2jLgBLTjwKRMllklsg"
  },
  "Ln2Zjpwrgydmwqewoun0wg": {
    "date": "10/28/2017",
    "text": "Pros: tasty, cheap / good value, some veg options  Delicious tacos for $3 and huge portions of deluxe nachos for $6. You can and will overestimate how much you can eat. So obviously a great value.  Cons: tiny storefront  It's super small and hardly has any table space (standing room only). I'd also like to see the place open a little longer. It currently closes at 8 but I can imagine myself being in the area and wanting to get some food here around 9 or 10.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TH9xshxCmTeg-tZY-QgeDA"
  },
  "hgZYLIcNn2WEkmfHEJSsUQ": {
    "date": "10/20/2017",
    "text": "Love the food but not sure its worth the wait.  Spend 40\" waiting for 3 tacos a couple weeks ago. Returned today with a large order put in ahead of us but got our 3 tacos in 15 minutes",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1fMo5ivSyvXezpSoB-S0eA"
  },
  "oogT8v9ROeMgma9C0JbMGQ": {
    "date": "9/19/2017",
    "text": "I would like to review properly but since I didn't actually get to eat my taco, I will say this much. The smell drew me in. It's tiny, no seating, just a couple of standing tables, crowded quickly with 6 people waiting for their food. For a quick to go, the prices were low and I was excited to have something different around Squirrel Hill to try. Luckily I wasn't starving as half way back to work, I opened the box to find my taco smothered in a white spicy smelling sauce. (I did not notice it on the menu while there, so I looked it up and called to ask about the ingredients...) I am allergic to dairy, so I will be more careful next time and I am not a fan of a lot of sauces in any case. I did tell them no cheese, and did see sour cream on other menu items but not this one, so I felt I covered my bases. Hopefully my coworker enjoyed it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Uf9X-ZCpPDPD6hsUKqLepw"
  },
  "fyGAQhV-rH_CxPz0OV1htg": {
    "date": "10/8/2017",
    "text": "Beef tacos, excellent crispy shells, fresh toppings, plus guacamole. What's not to love. It's crowded. Call ahead to cut wait time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vE70HTAukx0L-0lw8eUodg"
  },
  "gQ0ILZ92GhZcYBegelbsig": {
    "date": "8/9/2018",
    "text": "I walked in here and I happened to find an employee yelling and being verbally belligerent toward a customer who was complaining that this employee was harassing and demeaning a separate woman employee, and being sexist toward her. The employee almost got in the customer's face and threatened them and yelled at them. It caused me and a few others to leave the store before ordering. I for one would not eat somewhere where an employee was acting so childish. I also hope that this employee gets removed as his behavior toward his coworker was unacceptable, and the fact that he got belligerent with a customer is just embarrassing for this establishment that is supposed to be a casual dine in atmosphere.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dtd5c_LJPjpi1HqzbEPFeg"
  },
  "w42W6Bf4Xds0UE4qxDEZ3A": {
    "date": "9/14/2017",
    "text": "This place is the s#%* !!!  Cool ambiance, cool people working, great tasting food!   Quality of the food is amazing, and very generous portions. I also love the feel of the actual restaurant. Casual/cool, no chairs - in and out type of place.   You need to check this place out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Z2cso86T2jKCFt5nlQmfEQ",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States. Nachos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Z2cso86T2jKCFt5nlQmfEQ/o.jpg"
      },
      {
        "img_id": "VxponOuY3UZKZPiAS8s6wA",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States. Black Beans",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VxponOuY3UZKZPiAS8s6wA/o.jpg"
      },
      {
        "img_id": "4akY0HyUF02tsc3Z0gQTEg",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States. Pork Tacos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4akY0HyUF02tsc3Z0gQTEg/o.jpg"
      }
    ],
    "user_id": "ueY3vHSY0qqKtIHjmjnvmA"
  },
  "3mbBVc7ner0Fmqi5aXn5SA": {
    "date": "8/7/2018",
    "text": "Quick service, delicious tacos. Fresh ingredients and slow cooked meat is hard to beat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "JSU0EENib6qV8rZOAA1SIA"
  },
  "ax8wgxyEqiFXf5-yWoF3JQ": {
    "date": "6/3/2018",
    "text": "I honestly don't know why all those bad reviews! A lot of places don't have chairs to set ! I actually liked the idea! The food is so good an the portions are really good for the price! I ordered the nachos with beef and oh my it's huge and delicious! I also had chicken tacos and smoked brisket tacos and both were great as well. The staff were friendly and good. I would definitely go back again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gT5iDXQFx43fEu54zC9vxw",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States. Chicken Tacos",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gT5iDXQFx43fEu54zC9vxw/o.jpg"
      },
      {
        "img_id": "g60b-mDtSU8jpiONzOjr7A",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States. Beef Nachos. Delicious!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/g60b-mDtSU8jpiONzOjr7A/o.jpg"
      }
    ],
    "user_id": "UEdC7bCX664wKdid_r8Gug"
  },
  "siMzxwJ8nahtF6r-auY-ug": {
    "date": "9/16/2017",
    "text": "Tried the beef taco. It's all soft tacos with chopped tomatoes, onion, etc..covered in a tangy sauce, I added some bottled hot sauce available on the tables. For Pittsburgh this is a fairly good deal for the price. It's not tacos from a city that have a higher Hispanic community but I don't think you'll be too disappointed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qpSrMdMaJzVBBxB-1ViiKg",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qpSrMdMaJzVBBxB-1ViiKg/o.jpg"
      },
      {
        "img_id": "nu7LaHqABVwFCBWgInJYxA",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States. Bull river&amp;#34; version of a beef taco",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nu7LaHqABVwFCBWgInJYxA/o.jpg"
      }
    ],
    "user_id": "c-geEqyt3Ko6yTEydoCYTg"
  },
  "L8rmP7M7fTF8QawzIU-VbQ": {
    "date": "8/29/2017",
    "text": "It is where Waffallonia used to be.  Bull River Taco moved into this small store after Waffallonia moved one store down (where an insurance company used to be).  Always wanted to try, though to be honest, I do not know much about Mexican dish.  The only other Taco place I know is the \"best taco on campus\" in Oakland. if you are from Pitt, you know what i am talking about.  Pricewise, Oakland is $2.5/taco, here is $3. But this is Squirrel Hill, so i think the price is fair.   Foodwise, I had the chicken and spicy beef tacos.  ** I was confused about the # of tortillas in each of them before and they private messaged me about the numbers. \"So corn tortillas (chicken, pork, veggie), we use two. When it is a flour tortilla (beef/spicy beef), it is only one due to the thickness.\" **  One thing I like the most is the fact that the two tacos tasted very different.  It's not like they change the meat but give you the same sauce. The chicken goes with a guacamole (which i did not taste it), coleslaw and bullseye sauce.  The chicken was soft and almost like pulled-chicken.   The spicy beef taco comes with a pico de gallo and jalapenos. The jalapenos were just right to give the kick but not too hot. (I am not a super spicy person)  There was only 1 person in the line, so i cannot comment on how they do under the heat.  Good to have something new to the area.   (Diner area is standing only, good for quick lunch / quick dinner / snack.  But no alcohol drinks.)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Yo4Mc7maN41emnUZ4h9FxA",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States. Spicy beef",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Yo4Mc7maN41emnUZ4h9FxA/o.jpg"
      },
      {
        "img_id": "49bVsXJRUZip-36wil_GyA",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States. Spicy beef and chicken.  Corn tortillas (chicken, pork, veggie) = 2. Flour tortilla (beef/spicy beef) = 1.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/49bVsXJRUZip-36wil_GyA/o.jpg"
      }
    ],
    "user_id": "YQvXj_PfSEw2bccbLNop-w"
  },
  "0cYlTsmqMX93BTruCVu5dQ": {
    "date": "8/17/2017",
    "text": "This is a small taco shop very close to the corner of Murray and Forbes.   The shop itself is quite small with standing tables to eat food. It was also super hot inside the place. I know this place is new so they're figuring some kinks out but ordering/waiting for food takes awhile.   We got the pork, spicy beef, and chicken tacos, as well as the beef nachos. The tacos were super good, we just wished there was more filling in the tacos, especially because they are $3 each. The nachos were sooooo good, especially the queso they put on them. I feel like the nachos are more worth the price (~$6) because you get a lot of everything. We also wished they weren't canned jalapenos but overall the flavors of everything were great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bov42iYDhrcBdLNFW7EQ7g",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States. Chicken, spicy beef, and pork tacos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bov42iYDhrcBdLNFW7EQ7g/o.jpg"
      },
      {
        "img_id": "yEEGblrqZMRLLD-B3Q4AVg",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States. Nachos",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yEEGblrqZMRLLD-B3Q4AVg/o.jpg"
      }
    ],
    "user_id": "3EN4rQgpR8cR1NxuJNzi9Q"
  },
  "z0FjqnrdyJykEU-jelym0w": {
    "date": "12/5/2017",
    "text": "Ignore the fake news -- this place is top notch on the quality/price scale  Tasty tacos + bomb nachos.  Portion size galore.  My girlfriend and I prefer the pork. Not a good sit down location (literally, no chairs) but definitely serves the purpose of grabbing something while walking around in squirrel hill or on a lunch break if you are around. Would frequent if a squirrel hill resident.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "mGTI55GQfBvarOnpfvCzFA"
  },
  "QBRcMUjhRz_fLpDwaNhcrg": {
    "date": "7/19/2018",
    "text": "Both servers were under the influence of drugs. Couldn't make my order in 45 min. I had to get a refund. Please make sure you hire the right people",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_k0vTvh7oslgwzn09Mfmog"
  },
  "ARFJQ6PSo-Xzi4_EhCLWqA": {
    "date": "2/25/2018",
    "text": "Went here for first time with my family, all of us enjoyed it. They were able to accommodate our customizations. Unfortunately no guacamole but they promised it will be back in the spring. I had the brisket chili and a chicken taco also the spicy beef taco which is really good. I wish the brisket chili came with chips but they gave me some when I asked for free. Good taco stand style tacos, maybe the best I've had in Pittsburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "y72zPGH8-Ppan3Cx1aL1VQ",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/y72zPGH8-Ppan3Cx1aL1VQ/o.jpg"
      }
    ],
    "user_id": "bz5F7EVOlUJXAHFavKaR5Q"
  },
  "KrkphF3rfN21cdqUwO8L6g": {
    "date": "1/3/2018",
    "text": "I like this place. It is what it is. Cheap enough to forgive some if the quirks. Not really \"authentic\" but closer to Western taquerias than Tako.   2 areas to improve: Have a spicy/hot salsa option or add more heat to the tacos. Have a water cooler or water dispenser.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6hwRx01Zh9m6la9pFqMYig"
  },
  "SuSUitQplahTVLBckmDNJw": {
    "date": "4/7/2018",
    "text": "I never write reviews - but this place has the best tacos I've ever had.  It's a must try.   We had GLUTEN FREE pork, beef and spicy pork tacos as well as corn loaded nachos.  Totally amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H6O6XkR3CVBAEQl_xbtRJQ"
  },
  "inQn-vQc3tzONi3S-XCRwA": {
    "date": "8/3/2018",
    "text": "Not bad, not great. Tasted like something my white mother could easily make at home. Only two standing tables means you'll probably be eating in your car or taking it to go. Overpriced as well. There are way better taco places in the city, so I won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0zwj4cI7rhhQM9Ck8ZnIGg"
  },
  "WB3j8B9EhZXbI9oGu8kikg": {
    "date": "9/25/2017",
    "text": "Great little taco place! Flavorful tacos and can get in and out quickly for lunch!  I had the special of the day, the chicken chipotle taco and the spicy beef taco. Both tacos were good sized and filling. The sauces on each were the best features of the tacos. The beef had good seasoning on it. Veggies were fresh. Service was very quick and helpful.   I will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "5_BxzVPVy2c2Zp9SteMhTA"
  },
  "NKCGWz2lQzpzrfn0YGLc6A": {
    "date": "10/12/2017",
    "text": "Every time I passed by this small hole in the wall of squirrel hill, it smelled soo good that I finally took the chance to try it out! First thing I noticed was that there are not enough seating, which is understandable in such a small space but I think that would be my only complaint about this place. Each taco is $3, which I thought was reasonable with the quality and how satisfied I felt after eating two tacos. I ordered the Spicy Beef taco ($3) and the special Jamaican Jerk Chicken taco ($3.50). The spicy beef taco comes in a white flour tortilla and the special taco came in a corn tortilla. I really enjoyed these tacos because of their sauce that they use, called bullseye sauce. I'm not sure what it's consisted of, but it's what makes these tacos set apart from regular tacos. We did stand the entire time while eating, but I don't think I minded because the food was so good haha. I saw their loaded nachos being made and was so tempted to order it as well but I'll save that for another time :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1yxfjl8MrHj6Kta_-Ch1Tw",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1yxfjl8MrHj6Kta_-Ch1Tw/o.jpg"
      },
      {
        "img_id": "p0_Wq1-yguXKaivtQkCBRg",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States. Jamaican jerk chicken taco (left) and spicy beef taco (right)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/p0_Wq1-yguXKaivtQkCBRg/o.jpg"
      }
    ],
    "user_id": "bryAPtwnnMYjbzoOWHzbWg"
  },
  "wcmP1hSUIGBBbzU5rJ3W2A": {
    "date": "6/8/2018",
    "text": "My mom and I stopped here for a quick and impromptu dinner before we saw a movie at the manor theatre. The inside is very small, no chairs, just two high tables and a window seat, but it works perfectly because you can grab a taco and eat while you stroll Murray Avenue. The folks behind the counter were friendly and attentive, and our tacos were ready in under ten minutes. We tried a chicken, a pork, and a veggie taco. I liked that each taco had different toppings, not just the same toppings with your choice of meat. The chicken was my favorite; it was very juicy, and I think it was only dark meat. It had a Mexican slaw on top, along with their special sauce, and it was very flavorful and added a nice crunch. The pork taco was a bit dry but there was plenty of pico on top to give it some juice. My mom really enjoyed her veggie taco (I didn't get much detail, she was too busy chewing). We shared a mango soda and a bottle of water, and were on our way in time to get good seats at the movie. I hear they have a location on route 51 as well - I'll be sure to stop by on my next trip to South Park.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OSsFQ9mH1nxa7FkJk2Ihrw",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OSsFQ9mH1nxa7FkJk2Ihrw/o.jpg"
      },
      {
        "img_id": "Q_wZF92zCwtGDFVTYG55Sg",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Q_wZF92zCwtGDFVTYG55Sg/o.jpg"
      },
      {
        "img_id": "vjdw94FXzPXNvzH2KHVa6g",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vjdw94FXzPXNvzH2KHVa6g/o.jpg"
      }
    ],
    "user_id": "NA5xWmkVODVcOI5VccebUQ"
  },
  "emH6sD-UjZIbvPlXOzdalg": {
    "date": "11/1/2017",
    "text": "Location: Great foot traffic location @ Murray/Forbes. Chic and clean. Standing room only w/ 2 tables.  Service: Was not a can-do vibe and didn't sense positive vibes to customers. Man was on a phone call with one hand and crafting my taco with another. Also, called a customer sweetheart which is borderline.  Food: Tacos are $3. Good serving of food and variety in each choice. Fresh ingredients and crunchy veggies. Aroma of seasoned beef added to a good eat.  All in all I recommend if you don't want to walk to Cuzamil on Murray.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WqcLRN3fFAk0fI94xBnpCA"
  },
  "-20UWNw7LKZgZ60G9zKwUQ": {
    "date": "10/8/2017",
    "text": "Not bad tacos, but almost felt like I was just eating a slightly nicer version of Taco Bell. The meats and topping are uninspired. Maybe good for a quick bite on the go if you're passing by but don't go out of your way to eat here.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HUpihzyoYJh-qcmmr9I2nA",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HUpihzyoYJh-qcmmr9I2nA/o.jpg"
      }
    ],
    "user_id": "fG1rDDobEnE3_Y8B-5U-aQ"
  },
  "Ht85yRCc9PuYXdGsZqhRGA": {
    "date": "12/1/2017",
    "text": "I stopped in on an impulse purchase. My first choice (pork taco) was not available yet so I purchased a chicken taco instead. The taco was served without guac contrary to the description on the menu. When I inquired, they told me that guac was no longer served.   Taco was ok but not worth going out of your way.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ru0WkKOA18bWJbGb40M7SA"
  },
  "cjboMWu6wYDowvqj3BrLxA": {
    "date": "11/30/2018",
    "text": "This place is amazing! The food is delicious. The ambiance is awesome. The service was great. This is our new go to spot! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iiK6c2Qba27Yj365sFFuZQ"
  },
  "Qegb9Jybo7eQzaWtnKEH2w": {
    "date": "2/3/2019",
    "text": "Came there after a much needed study break snack with my friends! The store is very small with only 2 standing tables on the side. There's usually only 1 person working, so the line can be held up because the workers to customer ratio. There were about 5 people in front of us and we waited about 15 minutes. The decor inside is beautiful, yet simple. I really love the look of the place. I got the chicken taco and the beef taco. The chicken taco was really yummy with shredded chicken, mexican slaw, pico, cheese, and cholula cream. The beef was ground beef with cheese, pico, lettuce, and sour cream. They were out of pork and lettuce today, so they had to switch ingredients around. The tacos were delicious. Super flavorful and fresh. The meat was juicy and they put a ton in the taco! The tacos were pretty big and they fill you up. I recommend!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dodYuHhSlgwr74si3nLwkw",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dodYuHhSlgwr74si3nLwkw/o.jpg"
      },
      {
        "img_id": "Zzv7Lj6jIJ5YCZkKedtzxA",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Zzv7Lj6jIJ5YCZkKedtzxA/o.jpg"
      },
      {
        "img_id": "rwxiOkTWxTbEQduUHn_8sQ",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rwxiOkTWxTbEQduUHn_8sQ/o.jpg"
      }
    ],
    "user_id": "MOyCcje6MobLW-AO-39ySA"
  },
  "ux8oQ50O37Ysc28zsCUNLg": {
    "date": "10/18/2017",
    "text": "Very solid tacos here and super quick and easy! I hadn't even realized this new taco place had popped up until I was headed for waffles next door and saw the sign outside.   Decided to pop in and try a few tacos. Went for spicy beef and chicken to start, although it appears they have a special/feature taco each day (happened to be buffalo chicken that day). The transaction was easy and friendly and I snagged a spot at a standing table to wait for the order. The tacos came out pretty quickly and I got to work trying their several hot sauce offerings on the tacos!   Depending on how well business is, I could see them maybe needing to expand to include seating or more standing tables. In any case, the ingredients were fresh and the tacos were well portioned. Hot sauce was fun to try :) will definitely be back to try more of their menu!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7vCPI2bAxfEWJfWb2ZmC8g",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States. Spicy beef &amp;amp; chicken taco",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7vCPI2bAxfEWJfWb2ZmC8g/o.jpg"
      }
    ],
    "user_id": "MoFYvOoufOMyVTmUFAhRxQ"
  },
  "-aHDLcK-oKtKsXRGnCtADg": {
    "date": "7/18/2019",
    "text": "One of my favorite taco places in Pittsburgh. If anyone asks me where around Pittsburgh to get tacos or nachos, I tell them either Bull River by the waffle place or Tres Rios in Southside. It always tastes so fresh; the chicken is my personal favorite and whatever they put in their nachos is just so melty and delicious. The seating is limited, there are only two tables so be prepared for that.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HEcQJkEhFF3nTXhs_g7KmA"
  },
  "kkq8qmJ52UL4lY1kgOQbCw": {
    "date": "2/10/2019",
    "text": "Quick, easy, yummy, and affordable.  It's so nice to be able to run in and grab a healthy bite.  One visit I had to leave sans tacos because the line was too long and the person in front of me ordered about 12 tacos.  :(.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8f2D1OM2eziSIjnIu4Kd1g"
  },
  "6ranGMTur6qLODBiaHX-Tw": {
    "date": "3/7/2018",
    "text": "Elevator Review: Decent Tacos with a staff that doesn't seem to like people.   When I saw that a taco place was opening on Murray Avenue I was really excited. This was exactly the area needed.   The tacos are pretty good: I prefer the pork tacos, but I have enjoyed the fish tacos as well. The food is a bit salty overall. So be sure to get a drink or bring one.   My big hang up is the staff. I feel like the staff is irritated with me being patronizing their restaurant. And I notice that they seem just as disinterested in the other patrons as well. I am not looking for a deep friendship while ordering tacos, but it seems like some of the employees are disdainful of the customers.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vg0xfP02tul2MMl6q4Rj0w"
  },
  "cs05UEyanz_p4Frp2WrBUQ": {
    "date": "3/24/2019",
    "text": "Friendly, fast service. Chicken and fish were very good, every taco seems better with the bullseye sauce on it. Beef is okay, just missing some flavor but still worth ordering. Overall very good for a fast meal, and will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5tM1Y0yE6JVeyG_JYaFZUw"
  },
  "LJdp0gT0Q4HEV16-5oy03A": {
    "date": "9/5/2018",
    "text": "This is a decent place for a quick bite to eat! It is a bit of a hole in the wall, and there is nowhere to sit, just two big tables for standing. I would say the tacos are pretty average. I got a chicken and a pork taco, and both were on doubled-up corn tortillas. The meat was flavored decently, but the tacos would've been bland without the sauce, pico, and cilantro. At $3.25/taco, it's a bit more expensive than some of my usual taco spots, which usually have larger portions and/or more creative toppings for a lower price tag. Overall, I would stop in if I was in the area and wanted a snack, but I wouldn't go out of my way to go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DHz6KMCpvbsJyvDAPzJbhA",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DHz6KMCpvbsJyvDAPzJbhA/o.jpg"
      },
      {
        "img_id": "uX0_iuM6PyzOPtzy5sAQhg",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States. One chicken and one pork taco on corn tortillas",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uX0_iuM6PyzOPtzy5sAQhg/o.jpg"
      }
    ],
    "user_id": "iEJAlXOJFbw4lJNx-P2Hpg"
  },
  "H5fFjCKIcJrMNoof7Nxt6g": {
    "date": "3/24/2019",
    "text": "loved! went for the first time and significantly impressed! Not really any seating but standing to eat was fine. Service was fast even though there were people ahead of us. Can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A9sfTz2nRdg4XZIy8HZ3ig"
  },
  "7y7hkeoqkRna_VL40XgcrA": {
    "date": "12/31/2017",
    "text": "Came here for a quick lunch.  The tacos were pretty big and decently priced.  I wish they have more different flavors but overall it's solid.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2AKb7HdbRp9ZRc_sfZXHCg",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2AKb7HdbRp9ZRc_sfZXHCg/o.jpg"
      }
    ],
    "user_id": "_hsruQCw6UTnjlQiuSpScg"
  },
  "KvdNUNiOldj3gMYMFnIeFA": {
    "date": "4/22/2018",
    "text": "Been here twice. Last visit:  - Incorrect prices taped to glass next to register + on menu cards all over place ($3.25 vs. $3 listed) - A/C broken (85 degrees)  - Out of salsa - Out of queso - Out of loaded nachos (claimed out of boxes, when mentioned could put in another holder, claimed out of queso) - Item ordered with guacamole came without any (later said they were out of guac)  Food was good, but WTF.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "RdL_t9FEmyOPWEe2uacYyw"
  },
  "Qu8qCZW6aOKmeybw8i7wQw": {
    "date": "6/12/2018",
    "text": "Great tacos to go! This place is extremely small don't don't plan on sitting and eating (you get lucky sometimes). The nachos here are enormous and will probably last you a couple days. The tacos themselves are very good, reasonably priced and have very fresh ingredients. I only wish the inside of the place was bigger!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RnkKHzIl3LVee_Q6zooQMQ"
  },
  "D3ZNFWwPHht8lb2_1VhHlg": {
    "date": "10/3/2017",
    "text": "We were on our way to get a slice of pizza down the street, but stumbled upon this new taco joint so we decided to order 1 taco each as an appetizer. The worker was welcoming and even let our dog inside. Not only that, he gave him a bowl of meat to eat while we ate our tacos :)! So nice!!  We ordered 2 fish tacos which were AMAZING. I'm used to fish tacos with whole fish filets, not \"pulled fish\". It was so different, but a flavor I'll never forget. The tacos are HUGE so keep that in mind when ordering.  The only downside is that their are no seats here. There are two communal tables and that's about it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "uNuPyXHbbtHnhWhPLamESQ"
  },
  "KhmvAHnRlWna1PtLBLBQow": {
    "date": "4/9/2018",
    "text": "Not sure where the bad reviews are from.  Only has 2 small \"standing room only \" tables but overall the tacos are great and the price is fair. Beats some of the other higher rated taco joints.  I had the pork and the spicy beef btw.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "1-WVaosTuwwYglNTl8CViA"
  },
  "yTe4YpBwG1dhKIIHkGE4MA": {
    "date": "9/8/2017",
    "text": "I'm a bit of a taco purist (originally being from Southern California and my favorite being a strictly traditional taco al pastor with nothing more than cilantro, onion, and a medium-hot salsa roja) and I'm also always complaining to people about the lack of authentic (and good) Mexican food in Pittsburgh (aside from the street tacos at the Reyna taco stand), so I went in here with guarded expectations.  It's not strictly traditional (though it is influenced by authentic street tacos), but man, is it yummy.  I ordered three tacos: the pork, the spicy beef, and the daily special, a chipotle chicken. They came out about five minutes after I placed my order and were definitely made to order.  All three were quite delivious and distinctly different from each other.  The spicy beef was the most Americanized of them. It's in a single medium-taco-sized flour tortilla that's been lightly griddled and filled with ground beef and topped with lettuce, tomatoes, shredded yellow cheese, a creamy sauce, and several jalapeno slices.  The pork was on a pair of corn tortillas (about the same size as the flour) and had slightly crispy carnitas in it topped with tomatoes, onion, cilantro, the creamy sauce, and a light dusting of crumbled white cheese (not sure if it was actually Cotija).  The chipotle chicken was similar to the carnitas, except it omitted the tomato, making it the least non-traditional of the bunch.  That said, for what they are (doctored-up street tacos), they were done very, very well. The meat in all three cases (even the ground beef, which I normally eschew as too bland and Americanized) was moist and flavorful, and the creamy sauce (I think they call it \"Bullseye Sauce\") added a wonderfully buttery flavor to the ensemble. I'm not a small eater, and I had also skipped lunch, and the three I had was perfect for satiating me without overfilling me. (Of course, I had to get a waffle next door, which I ultimately probably didn't need to do...)  The sauce options are definitely non-traditional, though. There isn't a traditional salsa bar with homemade salsas (other than the Bullseye Sauce they add to each taco). There's an assortment of a few different kinds of bottled sauces. I think there may have been some Tapatio and one or two others, but the one that stood out to me was the giant-sized pump jug of Cholula green salsa, which worked well on all three of my tacos.  The price was, I felt, fair, at $3 per taco. That might be a little more than street tacos elsewhere, but not much more, and these were definitely more substantial than most $2ish street tacos (where I'd need at least four to fill me up), and some of the added  This will definitely be a place I return to, perhaps even frequently, given its convenient location, reasonably quick service (though not instant), and fair pricing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "uxglfTgdaR5hAwxrz1HDhQ"
  },
  "-cUL7NAr3gT6guXoCs9P3A": {
    "date": "8/26/2017",
    "text": "I really wanted to like this place more. The staff were really friendly, but couldn't handle a lot of orders at once. Staff were getting a bit confused at which orders were completed already, but were very accommodating for this though. The 3 star rating is really for the taste of the tacos. We got 3 spicy beef and 3 pork tacos. Tacos are $3 each. They were very average tasting tacos and didn't taste as fresh. The nachos on the other hand are huge and less than $6! The nachos were by far the best thing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "zg9Q_0WkjGilSB8GVVXyFg",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States. Where the toppings are added",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zg9Q_0WkjGilSB8GVVXyFg/o.jpg"
      },
      {
        "img_id": "J7SmereOJCGhidznNnxVlw",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States. Loaded nachos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/J7SmereOJCGhidznNnxVlw/o.jpg"
      }
    ],
    "user_id": "3IBiLPp5TIivhTo1eJbPEQ"
  },
  "ossdWUJpXzxC8553xIqLRQ": {
    "date": "8/8/2017",
    "text": "This Bull River Taco location is at least as good as the one in the South Hills!  It's a great little joint, occupying the former storefront of Waffallonia. We've been waiting a long time for it to open and it finally is!  The spicy beef and chicken tacos are both excellent. The pork is also excellent. All tacos are three dollars and on fresh tasting tortillas.   All in all a great addition to the Squirrel Hill scene!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QgWuDaq4go7XG4S9qUBewQ",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States. Menu at the new location in Squirrel Hill!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QgWuDaq4go7XG4S9qUBewQ/o.jpg"
      }
    ],
    "user_id": "CIKD9oMj-qTZ3zDdgFW5_Q"
  },
  "BUgeVg5U-EmGVxoGdKhb6g": {
    "date": "9/18/2017",
    "text": "Bull River Tacos were flavorful and the perfect portion size for the money in my opinion! ($3 ea)  There isn't any seating in the restaurant just tables to stand if you want to eat your tacos there. I got the pork and chicken. Yum. Also saw them making nachos that looked good. It seemed like the employees were pretty young and more worried about their phones than our order which is why I can't give 5 stars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jy_L4vBF8fJF0q_t1QFuuw",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States. Chicken tacos",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jy_L4vBF8fJF0q_t1QFuuw/o.jpg"
      }
    ],
    "user_id": "xFW6D-dxhqO5I2M5ynEJUQ"
  },
  "n3Gf5NCDna7pWGookA0CRg": {
    "date": "9/22/2018",
    "text": "Tasty tacos in a cool small-space environment. Really flavorful tacos for reasonable prices.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "catu20n-RQnAEjcgbqu-4A"
  },
  "88p5UIBFNJj4twI-DqyPzg": {
    "date": "9/4/2017",
    "text": "Been anticipating the opening since I saw the sign go up a while ago. Finally had the chance to stop in today at lunch time.   The food was quite good. I got 3 tacos, one chicken, one pork and one spicy beef. The chicken and pork (pictured) came on double corn tortillas the beef was on single flour. The two on corn were somewhat indistinguishable from each other but very good. I thought they were a very good rendition of a street taco. The beef was also good but a little more Americanized.   The nachos which I didn't try looked very good (and too much for one person), I may try them on a future visit when I'm not alone.   The atmosphere is okay for this type of place. No seating but tables to eat (standing). They were a bit short for me (I'm 6'2\") but I like the concept. It's hard to get a food truck positioned well in the neighborhood so this is a great compromise.   For me I thought the price of $3 per taco was a little steep. That's one of the reasons I'm giving it 4 stars. Meanwhile the nachos are only around $6.   All in all I like this place and I think it's what I've been looking for in Squirrel Hill. I'll be back to cute my street taco cravings.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Gj_IUsGh6sWScmA7oHvHKA",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Gj_IUsGh6sWScmA7oHvHKA/o.jpg"
      }
    ],
    "user_id": "PFD_c0uOK84rL4isitEwsw"
  },
  "nnM4NGcs_PftoHJxQMpdBQ": {
    "date": "6/10/2018",
    "text": "I got 3 tacos, chicken, beef and pork. Beef was decent. I threw away the other two. This was the worst taco experience I've had in Pittsburgh. Everything tastes cheaply made, everything is drenched in a sauce that is not good, smothered in a pound of tomatoes, and lacks flavor. It's great for 'fast' and cheap, but I can get the same price at Condado... and actually enjoy the food. Needs a major repair  I'd definitely also like to add that the staff wasn't very friendly. No greeting, not welcoming, just quiet.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "B3kA2WV248hXCWao-wtRXg",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/B3kA2WV248hXCWao-wtRXg/o.jpg"
      }
    ],
    "user_id": "hlADEsornSzZn7jR_D5xYA"
  },
  "a-Q4ieT9wzsWDbyDmmX3mQ": {
    "date": "8/15/2019",
    "text": "We tried the chicken, pork, and buffalo chicken tacos. Everything tasted fresh and delicious. The buffalo chicken had a mild heat to it. The more traditional chicken and pork were nicely seasoned.  We chose to carry out, but there are also a couple of standing tables to eat at.   Without any other real taco options in Squirrel Hill, Bull River Tacos is a tasty change of pace.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HOt4dV5lPrug5WwhK7OpQg"
  },
  "BI9kaRBHhaJ2KIDDzc2PzA": {
    "date": "8/31/2019",
    "text": "This is one of my favorite taco restaurant in town. Cozy place and delicious food! A little bit slow because only one person services customers but I would love to wait because it's really good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fR9wGzN1xTC_ZLLIqeQroA"
  },
  "8KPVTP9hNNVHTXzRBYdLOw": {
    "date": "7/22/2019",
    "text": "I would prefer to be able to give 3.5 because I feel 4 is too high, and does anyone really get excited about a place with 3 stars? That said, Bull River served us some good tacos, but the night we went around 8:45, they were out of all but one type of taco. How can you be out of \"beef\" tacos. Stuff takes 3 minutes to make. I got the sense the guy working there was simply checked out for the night despite their 10pm closing time. Overall, you can't beat the prices ($3) and $0.99 for double meat - count me in every time!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UqgEOWZl9h5YLyoJRurJsA"
  },
  "zn94fYKbTlEcsv8i0hIjrg": {
    "date": "8/28/2019",
    "text": "My friend and I literally stumbled into this place on a leisurely walk and at first the interior decoration was kind of off-putting BUT man o man do these guys know how to make a delicious taco. We must have eaten 6 tacos each before we realized that we had gone overboard and needed to calm ourselves. Instantly this became a top 3 taco destination in town! But head my warning - you might miss this place if you don't look closely, its hard to find but worth it if you do!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5HjIUXB2VnKVwX19CQu_cA"
  },
  "UJSpmBi2R1EqsYtzKlaqmQ": {
    "date": "7/1/2019",
    "text": "The loaded nachos were supreme! Delicious and filling. The guy behind the counter was polite and amazing.  Pretty much standing room only, but still a great place to go for a quick bite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M-1BZHpE9ERnw_S_zh6h-Q"
  },
  "ewdf6LuPQvvQXV2vOhXxRg": {
    "date": "5/3/2019",
    "text": "This was unquestionably the worst eating experience I've ever had in my life.  I went and had dinner with my sister, and we ordered food to eat.  We sat down and ate.  We sat there for a couple minutes, and a couple other patrons were sent away.  The employee said that he had to close the doors at 9:30.  We continued to eat.  We had barely touched our nachos and were told we had to leave.  We politely explained that we were still eating and the place closes at 10.  He said I don't care, you have to go.  He was very rude from the beginning, and I remained calm and nice saying thank you, have a good day.  In the end, we had to eat on a bench across the street in light rain.  Also, I got the post done before their 10pm closing.  9:50...  I understand that a job like that can be frustrating and he may have just have a bad day.  In the end, is actions are 100% inexcusable.  I could never imagine treating another person like this on my worst day.  I feel very bad that any person could ever be this unhappy with their life...",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "NtPLbLF_gkraR1uy-zkYXg",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States. The employee",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NtPLbLF_gkraR1uy-zkYXg/o.jpg"
      },
      {
        "img_id": "Zff92Zjnin11szA-cBdjJg",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States. The employee",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Zff92Zjnin11szA-cBdjJg/o.jpg"
      },
      {
        "img_id": "hvoxCZLiUjfL8COLw8296g",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States. The employee who was so rude",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hvoxCZLiUjfL8COLw8296g/o.jpg"
      }
    ],
    "user_id": "ua1E9wd7vTXhDPHdUlNRug"
  },
  "KI85iHPj3XastSNrJBwjcg": {
    "date": "6/21/2018",
    "text": "Why not 5 stars you may ask... Not enough eat-in space. No seats. Food, however, is amazing!! We ordered 2 chicken tacos and a beef taco salad. Both needed no additional toppings or sauce. Certainly, if you like more heat, there are several options. Prices were weird though. Menu prices and cash register prices weren't the same. They kept True to the register price and did not offer a refund. Not a huge difference, but should really be the same. Will be back for sure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "BJUY0UadA-STNQfNGnpTjg"
  },
  "qRYft5eLYGvozWvjhPur4g": {
    "date": "8/3/2019",
    "text": "The pork was tendency with fresh ingredient and the spicy beef was not too hot but tasty. Great bar food except they close at 9:00 ish.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VkthmT4rFIwemsc8PLG_OQ"
  },
  "ccj3fHgkfqT4YFhW1Npo_A": {
    "date": "7/11/2019",
    "text": "This is a great little stand. Tacos are made fresh in front of you. And the staff is friendly space is small to eat no real tables but all in all. Good food tocos that aren't taco bell",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9TY2iU0mhsVL17VP0S2D4w"
  },
  "mZB8NUKF0Wj7PcmDanVBhQ": {
    "date": "7/5/2019",
    "text": "Just learned about this place so stopped in for lunch. Just grabbed the pork taco and some chips and salsa, which is kinda how I establish a baseline for a taco shop. The pork taco was great and the salsa was pretty good. The salsa is ticker than I prefer, but it was fresh and had a good flavor. It's a small detail, but that's why I gave four stars. If you prefer the consistency of store bough salsa, but want the fresh flavor, this is for you! Definitely will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LqCpQqiVWSIDQVMihCa6CA"
  },
  "q-Rnk4KpuMwP6Cz3O-CZkQ": {
    "date": "7/22/2019",
    "text": "Great place to stop for a quick and cheap bite (1 taco ~$3.25). It is definitely a small restaurant, but most of the times I've been there, there's been a spot at a table for me to eat. Sometimes there are barstools, sometimes there aren't. Tacos are made to order, and the flavors are all pretty good. The pork taco is my favorite. That being said, the amount of food/love that goes into assembly definitely varies by who is working that day. Typically if the owner is behind the counter, the tacos look a lot better than when he isn't.   Overall, a good spot for Squirrel Hill where there aren't a whole lot of \"grab and go\" places.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yaXs1g-YDqwEkiLIL7ndBw"
  },
  "OpP4FzSAgI5ZTVgxliT0ng": {
    "date": "6/7/2019",
    "text": "We heard about this place so we came to check it out! It is a hole in the wall...very small with limited seating. But don't let that stop you from coming here for some delicious tacos. The meats are high quality from the BBQ, and the black bean tacos are good too. While the selection of menu items is somewhat limited, what they serve they do well.  Staff was great, too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HVbqpnH0htJ7dJsoKhiHGA",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States. The whole family enjoyed this hole in the wall!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HVbqpnH0htJ7dJsoKhiHGA/o.jpg"
      }
    ],
    "user_id": "iqOGXj-MltHRnTO_BptgLQ"
  },
  "cNIFhjq2NXP9XtCmE0Za_A": {
    "date": "8/21/2019",
    "text": "So nice we had to have it twice. Tasty tacos, great fast service, and fun fast paced environment. Mostly for take out, you can stand and eat in also, but the service is fast that you won't be in there too long anyway. Fully recommend this place to anyone!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-jK_iQYOWpvuRGWfAi97nQ"
  },
  "dAi1Lh6iRadtssgd1I3pOA": {
    "date": "7/30/2018",
    "text": "This place is alright. I tried two beef tacos, one spicy, one regular. Both tasted like something I could whip up in my kitchen out of a box. The spicy only had some jalapenos thrown on but the beef (or, the problem here) was just ok. I also had one of the specials, a buffalo chicken taco. Unfortunately, I tasted more rice and unnecessary sauce than anything else.   This place looks gorgeous on the outside but doesn't provide anything interesting or new i  its food. The staff were fantastic so that's a bonus but the food itself is a major let down!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1fJD0_vU8GB83OtpBQMhWw",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States. 3 tacos: Buffalo chicken, spicy beef, &amp;amp; beef!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1fJD0_vU8GB83OtpBQMhWw/o.jpg"
      },
      {
        "img_id": "GcAfG35O-JsozrUMfsg2EA",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GcAfG35O-JsozrUMfsg2EA/o.jpg"
      }
    ],
    "user_id": "vA1jGLAmaf3oUN_pkx3Tmg"
  },
  "shvVfUkG2QZXepRhWvbiaw": {
    "date": "1/1/2019",
    "text": "No affiliation - IMO some unfair reviews below.  Food: Tried all of the tacos. The flavors and textures were all really nicely composed. Classic tacos and some slightly more exotic ones. Overall very high quality and beautiful. Healthy too.  Atmosphere: Casual. Very small, but beautiful, stylish, and laid back. Staff was inviting. Place is very clean. Smells really good inside. BYOB. Not a sit-down restaurant, more of a stand and eat at high tables and talk with friends.  Love what this place is doing. It's unique, affordable, tasty, approachable, and feels good to be inside.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "7dOhZyyfEGis9l9NRBacEg"
  },
  "ed8XHP2ALOTC6M_6R6ozOQ": {
    "date": "11/6/2017",
    "text": "I just had a very unusual experience here! Walked in and they have two huge tables and no chairs so you are kinda forced to have awkward conversations with strangers standing there too. It smells very strongly of meat and spices. It was not a very pleasant smell for me, but it's hard to help that in a small space like that. The two people working there were very rude.. the girl seemed like the last thing in the world she wanted to do was talk to me and the guy who made my taco was on his phone the entire time he cooked it and afterwards!   They only had one vegetarian option and a very small menu. My major problem was the fact that their \"bull river sauce\" was blatantly ranch. I really don't like ranch and I didn't expect that at all. I had to eat it standing up with strangers next to me staring at me!! Don't see a reason to return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "VJiz_EeATEZlBK0oXR51NQ",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VJiz_EeATEZlBK0oXR51NQ/o.jpg"
      }
    ],
    "user_id": "xhmBgIT3xHgojioDq_c_fg"
  },
  "KAlfGazKEMCTmMWaYL4COw": {
    "date": "11/18/2017",
    "text": "Keeping it simple and basic comes to mind when I think of the food at Bull River taco. Basic tacos, no frills. Super small selection/menu, only about 4 different tacos to choose from.   The loaded nachos were quite HUGE! The nachos could of been a whole meal by itself.  Bull River is extremely small with just 2 tables that you must stand at. So if you get there and there's already someone eating at the tables then you have no where to eat.  I wasn't overly impressed with the food at Bull River. It's definitely not bad but yet nothing special. The flavor of the tacos were pretty basic. And because the menu is so small it doesn't give you much of a reason to keep coming back to try other items.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9pbOJFanh66_QnIb5Fjblg"
  },
  "-Kifr0v9VPCo5cvZfAMaQw": {
    "date": "11/1/2018",
    "text": "I dropped by right before catching a movie and grabbed the pork nachos with a friend. Portion-wise, it was just right for 2 people and possibly even more if you don't eat as much as I do. The queso was super yummy and the staff was generous with the amount that they give. For the price, it's a great snack to share with friends. I would definitely come again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "a7-q9Ni3McqzcAHULxgdFg"
  },
  "Uoi_jHqszRBm6k6yh85tOg": {
    "date": "12/2/2017",
    "text": "Saw this new place on Murray Avenue and was excited about trying it. Small space with 2 standing tables.   I ordered 2 veggies tacos and 2 chicken tacos for 2 people. The veggie tacos were good. However, I was disappointed by the lack of seasoning and heat in the chicken tacos.   Price is reasonable for the quality and quantity. But, it didn't leave an impression on me that would pull me back in there again when I pass by that place.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZZTz00YGfJd-7Bmfa-419w",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States. Chicken and vegetarian taco...",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZZTz00YGfJd-7Bmfa-419w/o.jpg"
      }
    ],
    "user_id": "bmSuFvdMyF66PDUZr9VfoQ"
  },
  "UWrWZGQX6nIPrHU-pH6cBw": {
    "date": "10/28/2017",
    "text": "** Flavorful tacos but a bit on the saltier side with a few simple options on the menu. Not super cheap (~$3 each), so good place to stop by for a snack but maybe not for a full meal.   I ordered two tacos - the beef taco and the chicken taco, both without cheese or their sauce (not typically a huge fan of sour cream), so these tacos might be a bit different than how it tastes normally. I am a huge fan of guac, so I really like how it is already included in the tacos.  The beef taco was flavorful and the ingredients mixed well together nicely. The only thing I have to say was that the taco tasted a bit salty. The tortillas were also a bit more crispy and firm, which isn't necessarily a bad thing but I think personally prefer soft shell corn tacos. I'd definitely recommend the beef taco over the chicken since the chicken seemed to be lacking in flavor.  Not too much table space (two tables) in the restaurant, so not good for big groups... and only standing space.  Also conveniently located right next to Waffallonia for a good snack afterwards!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "oLQYSjfK4m7UbhPy6MzRAw",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States. Beef chicken and pork fully loaded",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oLQYSjfK4m7UbhPy6MzRAw/o.jpg"
      },
      {
        "img_id": "Si56U4W6m3Qp057SFAvavQ",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States. Beef and chicken tacos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Si56U4W6m3Qp057SFAvavQ/o.jpg"
      },
      {
        "img_id": "SKYLdxOD2dGW0m2yQZiY6A",
        "caption": "Photo of Bull River Taco - Pittsburgh, PA, United States. Menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SKYLdxOD2dGW0m2yQZiY6A/o.jpg"
      }
    ],
    "user_id": "mxufNEcZIYndtjPHVtCh5w"
  }
}