{
  "V_IGKvvDlyA8FILwNwEgbg": {
    "date": "7/5/2018",
    "text": "Damned if this place doesn't make one tasty burger ... I was skeptical, and when they first opened it was a bit wonky. But now? Pretty well oiled machine. Plus its one of the few casual burger places who will actually cook your burger the way you ask! Medium rare? They do it. I've not ventured too far off the menu. The double thin burger - as listed - is the best imo. I tried a thick burger with swiss once and it wasn't as good. Tater tots seem to work. Super thin breaded fried onions are fun. Now I'm craving burgers when I didn't much in my life. Thanks Wahlburgers.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zjdjetVJWEtoiwG95Kqr1w"
  },
  "pFzM1XAj9Ky48SETDz9dtg": {
    "date": "9/1/2018",
    "text": "Good burgers, good price,nothing to brag about but nothing to complain about! We will be back when the hype calms down the wait is insane!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OtDLG5tMpySIvCW3VG_fDw"
  },
  "TbJtkJdTY8A5qibUAq975w": {
    "date": "1/14/2019",
    "text": "So I wanted to just be blown away as Wahlburgers became my new craving. We drove up to the Pittsburgh location which is in a nice space. It's a cool comfortable and engaging space. Gotta love their ability to self promote! We were seated right away and attended to by some very friendly staff. Menus were distributed and drinks followed almost immediately. As it was the first time we all decided to go with the house burger, onion rings and macaroni salad were ordered for dinner. I'm going a little backward here as we also ordered Chef Paul's take on poutine. Now to be fair I didn't actually read the description I was just asked if I wanted It. I love love love a good poutine so this should be really nice. Fairly quickly our appetizer was delivered and, well it didn't look like poutine at all. Kinda looked like loaded fries or loaded pork nachos but definitely not poutine. Fries, nacho looking cheese sauce, bbq sauce, pulled pork etc.... as a poutine type dish very disappointing. That being said as a loaded pork fries it's was pretty good, just not my thing. Dinner arrived nice and hot and looking great. The sides are rather large so sharing is in order. The burger was a little lost in the bun, I shifted it forward for the picture, but it was hot cooked well and had good flavor. It's a good solid burger for sure, not crave worthy as I had hoped but good. The sides were also pretty good. The onion rings and thinner than thin and a bit greasy, only a few of those got eaten even though they did have good taste. Alma's macaroni salad was the winner for me. Tasted like homemade macaroni salad that mom would make. In the end we all liked Wahlburgers and would go back but probably wouldn't go too far out of the way to find one.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cMKnWCo2feSaAWBc-zeqcQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cMKnWCo2feSaAWBc-zeqcQ/o.jpg"
      }
    ],
    "user_id": "mn3nXwTkaZSW3hQfIjnygg"
  },
  "GDvvkBDgPyS6LtSld8v__A": {
    "date": "8/26/2018",
    "text": "Second time here and still wasn't impressed. The first time I went, I got the sloppy joe which was cold and the wait times were horrible. This second time I got a burger and it was dry. It had no flavor and seemed to be over cooked. The waiter didn't seem to care and wasn't really attentive.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tPGboQ2eRnrUlbAT0IIiuA"
  },
  "ZFTtT3k4eIT38lC8GHBw-Q": {
    "date": "2/22/2019",
    "text": "I was expecting more as a burger place. Nothing necessarily bad tasting but it's expensive for the amount of food you get and I think other burger places are more worth the calories!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZAKruLw8n91z2OHg_oHjIg"
  },
  "wJCMrg4sSudT8VwmZYgsQA": {
    "date": "7/5/2018",
    "text": "We were really excited to try a new burger joint but I can say with confidence that we will not be back. We waited 20 minutes before anyone even came to our table to get drink orders. We were told a manager would be sent to the table to speak with us about the service, but we never saw one. Once ordering, it took nearly 40 minutes to get out food. Not worth the time and frustration.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f1SRs0_QepG2IOdR5VClSg"
  },
  "uzOmxABpS7xlUvt3zUokYg": {
    "date": "8/17/2018",
    "text": "Great burgers and great service. Loved the turkey burger with cranberry and stuffing. Will definitely be going back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TMjMYhGB06njPz4gSkPgQA"
  },
  "8folNRs-hITuiCqrrSzGpw": {
    "date": "8/16/2018",
    "text": "We are a family of four eating here. I would like to say shame on the Wahlberg family for putting their name on such mediocre food. The menu is limited and the execution is lackluster. I feel like they are trying to use their celebrity status to dazzle and distract from the disappointing food.   I ordered the O.F.D. Medium rare. It had a tomato jam that was too sweet. Other than the jam, the burger was bland. The kids Mac and cheese has artificial smoke flavor added and neither of my children would eat it. We wouldn't recommend.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GDar4VX0YoiI-2Ywcr7Eew"
  },
  "ai3HqKgGY-Tflxe4-NKsHQ": {
    "date": "6/18/2018",
    "text": "Quick and easy! Good place to go for a delicious burger. Has been consistent quality each time",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "37Oe4gaSpLzfa01sr1xMxw"
  },
  "JBSVrXZ_QISxV9bYbMkFFw": {
    "date": "2/13/2018",
    "text": "First timers here and experience was fantastic!  Our server was Jillian G, who knew the menu inside and out, gave great suggestions and was very attentive - keeping our drinks filled and also entertaining our 2 yr. old son, who was on overload from the TV's going and all the people milling around.  Hubby had the BBQ Bacon Burger and tots which he really enjoyed, I had the \"Our Burger\" with x pickles - omg that Wahl sauce is fab!! Wahl sauce+ tots=heaven!  Pickles are house made and delicious.  I ordered a side (1/2 side) of Alma's macaroni, which could easily feed 3-4 people, so I took the rest to go.  LO had the Smahlburger and he ate the entire thing - I loved that it came with fries, but $2.75 additional for milk was kind of crazy.  We are used to kid's meals including the drink.  Other than the \"new kid\" at the front who was learning how to pretty much work with the public for the first time ever (he ignored people standing right in front of him in the middle of the conversation/checking them in to answer the phone, but never said \"excuse me\" or anything), we'd definitely come back again.  Bottom line: Food is good, burgers aren't greasy or messy and everything was fresh.  Good place to take your family or hang out at the bar with friends.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Q4wgagoAglXOvirRbwJEPw",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. &amp;#34;Our Burger&amp;#34; delicious!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Q4wgagoAglXOvirRbwJEPw/o.jpg"
      },
      {
        "img_id": "Qaz4IydAtQ0zhrrsjfIN0Q",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. 1/2 order of Alma&amp;#39;s macaroni... Huge!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Qaz4IydAtQ0zhrrsjfIN0Q/o.jpg"
      },
      {
        "img_id": "wDpYBQ8HBTPbosfeheHI3w",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wDpYBQ8HBTPbosfeheHI3w/o.jpg"
      }
    ],
    "user_id": "NbMlaYyh4_d7JzqdLv8eEQ"
  },
  "6izLpl9CL3MhB-GuTM3z1Q": {
    "date": "8/13/2018",
    "text": "I was overly excited about this restaurant opening. I went there shortly after it opened. I thought the menu was small. I ordered a burger. Mediocre at best.  But I thought I'd give it another try. This time I ordered the salad with grilled portabella. What a waste of money. The salad consisted of mixed greens a few diced tomatoes, red onion and maybe 8 very small pieces of portabella. I will not return.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vli8U0S1sbHYEsqF81DnCA"
  },
  "zYmgotTTUV-AHwHzUAmuqQ": {
    "date": "2/9/2019",
    "text": "The food is pretty decent. But they grossly misquoted the wait time today. They told me 30-45 min, I returned after 42 minutes of waiting, and there were still about 6 parties that needed to be sat, which is about 20-30 more minutes at least. Just very disappointed with the waste of time as we had to be at work and couldn't wait any longer.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UK-N3d_phRp_j5YZVgGD9A"
  },
  "Yvwbbp2A4SWvAYN7LC5IGQ": {
    "date": "4/17/2018",
    "text": "We've been there twice and we love the burgers!!!  Definitely in my top 2 now.  Our kids love their chicken nuggets and Mac&cheese too. Great staff are a plus-plus!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "65KUG0uPTljtb1joZ3XRSA"
  },
  "E9gayEFAAB3OfVaEGCdyFQ": {
    "date": "2/6/2019",
    "text": "Pretty decent.  I got a Walhburger and onion straws.  The burger was good, better than Five Guys and Burgatory, but probably not as good as Red Robin (yum).  I like that they don't try to kill you with beef like they do at Five Guys and Burgatory.  I like a good balance of beef and toppings.  If all you can taste is bland ground beef (like at Burgatory especially), in my opinion you've done something really wrong.  The onion straws were tasty, and they give you way too many.  Would have been better if I had two or 3 people to share with as an appetizer.  I can't speak to the service as I got this delivered with Ubereats, but overall I'd definitely order from them again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Gn52HDDe_aYUN2lYHLQWQ"
  },
  "aL4iCscAKziXkA2MVwSj2Q": {
    "date": "8/5/2018",
    "text": "We had really high hopes for this place! It's in an excellent location, and it has a seemingly relaxed atmosphere. When we walked in, there was an employee on the floor, organizing t-shirts, but no one at the front desk. We waited for about a minute, and the employee on the floor finally addressed us. She then said that she would go find a place for us to sit. She disappeared. A few other employees came by, and they all gathered around the front desk. One person asked how many were in our party, and we told them that a woman had already taken that and was looking for our table. That woman then came back and stood around with the other employees, not addressing us. Someone else then offered to take us to our table.  The atmosphere was very nice, we did really like the outdoor seating. Then we met our waiter. He very slowly approached our table, and seemed really relaxed. At first, that didn't seem so bad at all. When we ordered, half of what we wanted was already not available. We had to then change our order. He brought us our first round of drinks, then left. We did not get a refill until our food arrived, even though we were out of something to drink a while before hand. His relaxed demeanor turned into more of a problem.  Another employee brought our food out, but wasn't sure which burger belonged to whom. She then started lifting the burger bun up and looking at both of them so that she could tell the difference. This took her a second, and she just continuously messed with our food. She then dropped our food off and very quickly left, before we could even ask for silverware. We then had to wait for our original waiter to return so that we could get our silverware.  The food was fine, not great. The order was partially incorrect (my salad had the wrong dressing and I was too hungry to correct it). The side salad consisted of lettuce, tomatoes, a few cucumbers, and a lot of onions.  It took forever for our waiter to return to give us the check. When he did, he made a comment about our last name and how he couldn't pronounce it. He then sauntered away.  The one thing we truly appreciated was the calorie listing on the menu. That just makes it easy whenever you are being health conscious. They also offer a variety of healthy choices.  Honestly, if one of these things had occurred, it would not have been a big deal. It was a combination of all of it. Maybe we caught them on a bad night. Maybe they need to reconsider their staff. We likely will not be returning because of this experience, which is a shame. I actually created a yelp account just because of this experience, if that tells you anything.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1haAKz7fVwxzh7xpUTQQ_Q"
  },
  "hz4MMbhFil8SEx4JJ2koaA": {
    "date": "5/6/2018",
    "text": "If you can find the restaurant hidden in the back of the block \"mall\", it's pretty good! We really enjoyed their burgers. They even make their own ranch and have vegetarian burgers. Totally worth it if you're in the area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "NWyl7b2QeytZfXhiWti2Vw"
  },
  "bCyDaweaZw0_BujAeP8RzQ": {
    "date": "7/27/2018",
    "text": "The food was a slight step up from an Applebee's, and it was a bit over priced. The only reason to come is for the Wahlburg name.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-77IgifCOLnnKFscCJomHg"
  },
  "BClAzw8LEP0oPZkTBb_47g": {
    "date": "5/14/2018",
    "text": "I had dinner here a couple weeks ago and I was disappointed. There's a lot of hype behind the food here and I just thought it was mediocre. I got the sloppy joe and that was decent but my husband got a burger and it reminded us of a 5 Guys style burger but not quite as good. For sides, we had the tater tots and the Mac and cheese. Both were mediocre. On the positive side, the space is very nice, they have a lot of outdoor seating upstairs on the balcony, you can put yourself on the wait list through Yelp, and the service was friendly. Also we didn't leave there smelling like burgers, which was surprising. We might try it again but aren't rushing to go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E3RCyqHVXIgUFZbUVgr73A"
  },
  "NoGx6GfOQY7prh5WiPRdUg": {
    "date": "7/22/2018",
    "text": "Love this place! Wait staff is awesome! Food is great. Energetic and fun place! We will return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ftP5pAYJEOJPvbIqC8XLfw"
  },
  "gamzQDSPWNxiVkhRAzKWJQ": {
    "date": "1/21/2018",
    "text": "I had probably unrealistic hopes for this place, like thought it was going to be the best burger I ever had. The food was good though nothing spectacular. The oil that they use to fry their foods left a weird after taste in my mouth, almost like it had gone a tad rancid which I wasn't a fan of. Service was good though! We put our name in on no wait but still had a decent wait, and they gave us free French fries (that we definitely didn't ask for) to hold our kids over.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZQ_ZTdhB3tEqxG5EE1WeRA"
  },
  "Um91Nw6ilBQ8lZ7rXbZ6YA": {
    "date": "1/27/2019",
    "text": "Very slow and messed up orders for an empty restaurant... all I can say about this place is that it's an overpriced steak and shake. Sides are an upcharge to the already small beef patties. I would not recommend this place, but if you are a fan of the show or the actor don't get your hopes up",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "K4xbJICEbGn2gAuF02RecQ"
  },
  "XDZCxGfI20xBGtWlYs18BQ": {
    "date": "6/25/2018",
    "text": "My husband and I have been to Wahlburgers a few times since they opened a little while ago, which speaks to the quality of food.   First and foremost, they use the No Wait app, so they win points in my book. The burgers are good and the ingredients taste fresh. We've run into some trouble with our burgers being cooked to order, but it was never so bad that we sent anything back. The service has always been good as well.  Four stars because of the a la carte menu style. You think you're getting a good deal for an $8 burger until you realize that fries are something like an additional $4 and mac n cheese is like $6.   That being said, we'll definitely be back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "xKR85VrcBBsIVfNmDT6ADQ"
  },
  "Qsd9eLqhJlp4-PEKI629Jg": {
    "date": "1/26/2019",
    "text": "This was my first time, and I have to say that it was awesome! I got the BBQ bacon burger that is Donnie's favorite. It has a good vibe; service was great. Only complaint, I guess, is the price is a bit hight on some things. Maybe your just paying for the name, but it is not terrible.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6NL9JC3jrwgxyq6lq_Bstw"
  },
  "vjhMGPu8KuxapRiMey9Oiw": {
    "date": "6/14/2018",
    "text": "Wahlburgers is pretty good. I like the fact I can get a beer and I'm sure others appreciate the cocktails. My first visit was a late lunch and I sat in the bar. The bartender was very friendly and the service was awesome. My second visit was dinner during Happy Hour. I sat out on the deck and the service was also good. Both times I had the \"OurBurger\" and I liked it a lot. I liked the tater tots much better than the fries. I will have to try the sweet potato tots next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 5
    },
    "photos": [],
    "user_id": "nDS68-Z9x21817kgKECNcQ"
  },
  "yyjTkCMM0MYoJkP8pZ8zUA": {
    "date": "8/5/2018",
    "text": "I came here and I got the portobello sandwich. Our guests got the triple decker and the original burger. The waitress didn't write our order down. Items were forgot and the kids meal was wrong. Pleas encourage the waitress/waiter to use pen and paper.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JxqqrKWcb74GaUukmna9cw"
  },
  "xFemMN_fUJ6wDLfOHHERdA": {
    "date": "8/10/2018",
    "text": "This my new favorite burger spot. Everything is delicious. I even ordered food to take home with me. Alysia is the best server!! I recommend the Our and Pierogis burger and the fried pickles. Can't go wrong with a cupcake to finish off a epic meal and then some.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1U_1KeTe7722r4mEGvRClA"
  },
  "rcAQiligFpljzXhhLnOM4Q": {
    "date": "4/5/2019",
    "text": "Food wasn't bad. A little pricey for what you get, and all sides are extra. I'd say fun experience once and than I'd be over getting a thin burger for 15 bucks",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l3LZpWsMW3LXfiRdtgRNJw"
  },
  "b9wLk37xJkCJx6uavb_F8w": {
    "date": "5/19/2018",
    "text": "I'm sad.  Very sad.  I had high hopes.  If it weren't for the good service I wouldn't have any stars to give.  We went for dinner and it was a bad decision.  I ordered  their Wahlburger with bacon.  Our waitress asked how I wanted it cooked and I asked for Medium.  It took quite a while for our food to come.  The minute I saw the premade perfectly round burger patty my hope started drifting down the drain.  It had no flavor.  None.  It was also WELL DONE.  IF it had any flavor it was cooked out.  The lettuce was shredded like the paper you put in decorative baskets.  It was green but it was wimpy, almost soggy.  It added nothing to the burger.  I CAN say that the house made Ranch dressing that I dipped my almost cold fries in was the best part of the meal.  IF that is the best thing you can say then I think that speaks volumes.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "BqhhBCErgb6He6bwSB3ilw",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Sloppy Joe",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BqhhBCErgb6He6bwSB3ilw/o.jpg"
      },
      {
        "img_id": "cEDS-ygfO9sXhxM77BW6AA",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Tater tots",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cEDS-ygfO9sXhxM77BW6AA/o.jpg"
      },
      {
        "img_id": "xxqWi4bYEhrMEBH23xZbFA",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Onion rings",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xxqWi4bYEhrMEBH23xZbFA/o.jpg"
      }
    ],
    "user_id": "5JVY32_bmTBfIGpCCsnAfw"
  },
  "YyhnsglBynQPd5hqrd7yUQ": {
    "date": "6/15/2018",
    "text": "I happen to be at The Container Store and noticed Wahlburgers as I was driving by so I thought why not! I had the option of sitting at the bar, in the dining room or on the balcony; and since the weather was so beautiful I opted for the balcony. My waitress Chatara was excellent. Super friendly and very attentive throughout the meal. She asked if it was my first time there and proceeded to tell me some of her favorite things off the menu, I ended up going with the sloppy joe that she recommended and also a side of sweet potato tots.  The food came out really quickly, I was actually quite surprised. The sweet potato tots came in a little cardboard bowl and the sloppy joe filled up the plate along with some slices of pickles.  All of the food tasted great. The sloppy joe was actually very mild in flavor, so if you are someone who is used to eating Manwich sloppy joes the flavor on this is much less pronounced!  You could definitely tell that it was homemade. The crispy onion rings on top were a nice addition, as were the pickle slices. The cheese sauce and the wahl sauce we're also quite unusual I thought for a sloppy joe but gave it that something special. Wahl sauce is a mixture of ketchup, mayonnaise, sriracha, sauteed onions and parsley. The sweet potato tots were just as I expected, nothing unusual there. Overall, my experience at walburgers was a good one. I will definitely bring my husband next time. Hopefully I can try one of their adult fraps!  They also offer a 10% military discount.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-0iji4O826BDtXeifWpGKQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Sloppy Joe and Sweet Potato Tots",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-0iji4O826BDtXeifWpGKQ/o.jpg"
      },
      {
        "img_id": "MBscAr0YF6fkLsLXU43BhQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Beer Selections",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MBscAr0YF6fkLsLXU43BhQ/o.jpg"
      },
      {
        "img_id": "cUyQoiDWhSW4F1kO7zlXnQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Happy Hour Specials and wine",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cUyQoiDWhSW4F1kO7zlXnQ/o.jpg"
      }
    ],
    "user_id": "NUjPmuf284g5J6EGT-Uhjw"
  },
  "fnr7ozq4nIkpqR1fEySOjw": {
    "date": "12/22/2018",
    "text": "In June of this year, back in Wexford for our family gathering, my experience, the 1st, at new Wahlburgers in Ross Twp. It was outstanding.  I was there by myself, on a weekday morning (11;15).  I met the manager, and was impressed with her acumen and restaurant experience. Ordered the house standard cheeseburger and onion rings, perfectly cooked and delicious. I'm writing this now, after reading all the mediocre reviews in the past six months, and asking myself, what has changed with the restaurant personnel?  (I recommended this location to my brother...he went and liked it, but noticed,  with weekend crowd, very high noise levels make conversation difficult.) I rate this particular Wahlbergers better than the one in Atlanta, GA.   Located in the Battery complex, part of the new Suntrust Stadium where the MLB Braves play.  The day I visited Kennesaw State had a football game, and we waited 90 minutes ( with an earlier reservation) to get seated, at 2PM.  Same meal, cheeseburger and onion rings...did not measure up in quality, nor freshness, compared to my memory of the Ross Twp. experience. Probably, the staff was exhausted after dealing with the crush of local and JAX FL football fans.  Still, I'm a fan.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rXft4AxENHkUl-ieS5KHeA"
  },
  "Q1VtUuqfGdf9WsBlIcpO-Q": {
    "date": "1/27/2019",
    "text": "It's ok. There are better burgers and better food and drinks. You get charged restaurant prices for paper plates and take out level product. Not worth it. Was really hoping this was more than just the Wahlburg name but let's face it, that's what it is. If you didn't know the name of the place, you wouldn't come back. And I'm not going to either.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mzkdlf9u_jHRCrujANaqYg"
  },
  "lgOLhljV2flxNdzziPbjRQ": {
    "date": "11/26/2018",
    "text": "We were visiting Pittsburgh for the Thanksgiving holiday and wanted to try Wahlburgers. We went on Black Friday 11/23/18 and surprisingly it wasn't too crazy. The first issue was the sound. I brought my 83 yo mother and my son and we couldn't even hear each other talk over the music. Thank god my 88 yo dad didn't come because he definitely wouldn't have heard a thing. We were seated in a booth which I liked. The booths are much more private than the tables with steel chairs. We ordered 2 Our burgers and some type of bacon burger, tater tots, French fries, macaroni salad and soft drinks. We enjoyed everything but the macaroni salad which was bland. It was basically macaroni and mayo. When the macaroni arrived at the table it came with a plastic fork. We were sharing it and it could have used a serving spoon. Th server gave us paper side bowls for the macaroni salad and silverware but only after the food was served. The burgers were very good and so were the tots and fries but they definitely could have been hotter not lukewarm. I would have liked to try the shakes and the bar but we were too full. My mom said she wouldn't go back but I would give it a try. The server was friendly and did give us tips on ordering.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jO6_hCFTDfCmcfxEiSNcOw"
  },
  "dJfBmf_qFX7TDFTYW87PPA": {
    "date": "10/26/2018",
    "text": "Stopped in for a mid day lunch.  It was busy but plenty of tables were open.  Service was freindly and good.  Ordered the Our Burger that has lettuce, tomato, onion, cheese and Paul's housemade sauce & pickles.  Loved the homemade pickles.  The burgers are cooked to medium well unless you specify differently.  My burger was very good and a nice option and I though the pricing was very good.  Had a side of the sweet potato tots that were  sweet and very good.  Wahlburger's menu does have some sandwiches and salads, a plant based impossible burger and a turkey burger for those that do not want a beef burger.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 14,
      "cool": 7
    },
    "photos": [],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "nkj2rDDev44Z2G9zg64dXA": {
    "date": "4/25/2018",
    "text": "Decided that we would have dinner on a Friday evening. They are on the no wait app and had no wait, so why not try it out. They get a solid 4. We were greeted warmly by the hostesses and we were promptly seated. We were waited on by our phenomenal waitress. She was on it. She was there but not overbearingly so. We started with drinks. Hubby got a beer. I chose their white sangria. It was terrific! Not too sweet, not too dry. I got the Thanksgiving turkey burger. It was tasty. They put a mayo and cranberry combo on the burger which provided the perfect balance of sweet and tangy. The burger comes with stuffing on it. It was quite tasty. Solid! The hubby got a burger done to his liking with mushrooms and a tomato relish. He said he could have done without the relishy stuff but liked the burger overall. We got the fries, tater tots, and sweet potato tots. I LOVED the sweet potato tots. They were awesome!!! Overall, a solid meal. We would certainly go back!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "_u_7rSAK3q0kYiu422VsMQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Our burger feast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_u_7rSAK3q0kYiu422VsMQ/o.jpg"
      },
      {
        "img_id": "nV72LCj2WfMbVU9-DBIgNg",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Sweet potato tots, delicious!!!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nV72LCj2WfMbVU9-DBIgNg/o.jpg"
      },
      {
        "img_id": "tgVLAvFYCrLlnHFaNn4KPQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Time to eat",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tgVLAvFYCrLlnHFaNn4KPQ/o.jpg"
      }
    ],
    "user_id": "NAZzgDkNIL_DpHg6xu9APQ"
  },
  "HkyX3sEphDq0UHsR2w8_tQ": {
    "date": "7/30/2018",
    "text": "I really enjoy this place- the highlights:  Excellent burgers. Generously portioned and cooked to order   Onion rings are wonderful   Creative drink selection and menu  Friendly staff  Outdoor seating, which is uncommon in this neck of the woods   Things I don't like:  The French fries are not good. They're frozen, and not even good frozen fries.   To dovetail with the above, at $3.50, they aren't a very good value.   In closing, I really enjoy the restaurant. They are a welcomed addition to The Block. Cool atmosphere, great staff... just please cut your own fries!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6iZgjjV93Rf6Xwg2nQL0Ew"
  },
  "14W1ouiZjxc5rYL0JGIWpw": {
    "date": "3/14/2019",
    "text": "There is no variety in the menu and it is completely overrated. Considering the prices, it most definitely does not meet expectations.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aivoS_by2WpRiJigihY2Bw"
  },
  "dl--XtoZdKj0al2e738V_Q": {
    "date": "4/27/2018",
    "text": "We showed up in this restaurant at 9:45 PM, although the restaurant was scheduled to close at 10 PM. The hostess/waitress led us to a booth. A couple of other tables of customers were still in the restaurant. We ordered our hamburgers, fries, onion rings, and root beer float. Our food was brought to our table at 9:58 PM. My husband was brought fries rather than onion rings, but we did not mention the mistake to the waitress because it was almost closing time. She was friendly and checked in with us off and on to make sure that we were happy with the food. The burgers seemed to a good quality, and we enjoyed the taste. The fries were fries.  4-28-2018 update: I ate at this restaurant again this week. My husband really likes their hamburgers. He thinks that the hamburgers are the best in Pittsburgh. Today I ordered macaroni salad, which was 5 stars, and a grilled cheese sandwich, which was 4 stars. The waitress did not bring out my macaroni or utensils, so I had to ask for them. She also fumbled with our payment at the end.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "FW5F5QzzMoeRdIib1OyNOw"
  },
  "OXq8vw_6zLxcxB1leWfFqw": {
    "date": "3/9/2019",
    "text": "I arrived T Wahlburgers around 8:45 abs there was no wait - the staff was very friendly and my server was super helpful with food recommendations as this was my first time dining here. I ordered the sweet potato tater tots and onion rings as appetizers and both my boyfriend and I ordered the OFD Burger ( meat patty with Swiss. Here's, bacon, sauteed mushrooms and tomato jam - I am not a huge fan of the jam so I opted for the famous Wahl sauce instead) ordered the burger medium- well. This burger was so delicious and cooked to perfection ! The Wahl sauce was like a thousand island dressing with a zing and very complimenting to the burger . Both apps were very good - the onion rings were thin and. Rusty just as advertised - very good flavor . The sweet tater tots were amazing as I had never had anything like this before. Dipped in ketchup was good but I think they should serve it with a cream sauce for dipping ( or even the Wahl sauce would be amazing ) overall I had the perfect experience here - I am looking forward to returning - I am going to try the Sloppy Joe next time . Thank you Wahlburgers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "X-6AU5Xk6O4vWqaHbV-FDQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. OFD Burger",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/X-6AU5Xk6O4vWqaHbV-FDQ/o.jpg"
      },
      {
        "img_id": "rOIfYNSt0oCEgbnNXjlOFw",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Restaurant Front",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rOIfYNSt0oCEgbnNXjlOFw/o.jpg"
      },
      {
        "img_id": "Q1oZWFygitBLNFS058a1Fw",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. The Wahlburgs",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Q1oZWFygitBLNFS058a1Fw/o.jpg"
      }
    ],
    "user_id": "nX7yvIPVqY2CLYyliQsLEA"
  },
  "ObFF6_2Neu6-qPydnPl0Gw": {
    "date": "1/5/2019",
    "text": "Tasty grub. Server asked us right off the bat if we had any dietary restrictions. We didn't, but it was pleasantly surprising to get that type of question at this tier of restaurant. Food was delicious. Service was fantastic",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nZ7l46gvTILEbTlzZ99mCA"
  },
  "YoLyDYWQPnyTbBBlMP248w": {
    "date": "6/21/2018",
    "text": "Really 2.5.  Not judging on the atmosphere, as it's a chain and these people have no say. But customer service is key. Which unfortunately was somewhat lacking. We witnessed two other parties having issues at the same time as us, so maybe just a bad night? The server did slightly try to make it right, but with so many mishaps, the experience was kind of swayed. Wrong beer. Wrong burger. Dead house, long wait. No compensation on the bill for said mishaps. Maybe will try a different location or a later date. Chin up.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iJELxrdYsVtHtk_W__PttA"
  },
  "bMa5DHqUJhIuq8ylW8zv9g": {
    "date": "1/8/2018",
    "text": "I enjoyed this place. Would go again but not rushing back. Very limited menu-no appetizers...not a big deal. I expected it to be a notch below Burgatory and it was. Although, it was every bit as expensive. It was fun and it was good enough but I don't feel the need to go again soon. Service was good. Went on a Saturday and if you don't use Yelp's \"no wait/get in line app\" you'll be looking at an hour and a half wait by 5:30 pm. I would recommend it but not expect \"gourmet burgers\". Don't think of this review as negative because I don't mean it to be. It's just that the \"burger bar\" has been raised significantly in the last ten years and I suspect Wahlburgers wouldn't be making quite the noise that it is were it not for the name. Like I said earlier though, I'll go again because we had a nice experience overall.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AQruHnvI-OkdDX-wI-eGvw"
  },
  "0E2_ed67SQfTGQjPAnBCoQ": {
    "date": "12/22/2017",
    "text": "Overall it was just \"ok\". I know they are newly opened and there is expected to be some kinks in the flow of things for a little. So we chose to go at about 230pm on a Thursday expecting things to be slowed down a little and for the most part it appeared to be so. My biggest issue was the temperature of my burger and the inattentive service. I would have said something about the temperature of my food but the server never came back to the table. Didn't get a refill on our beverages until we were done with our food and paying the check. The fries and sweet potato tots were awesome, they came out very hot and fresh. I chose the thanksgiving day burger, it wasn't as special as it sounded in the menu. First, it was cold... like, pulled from the fridge cold. The burger advertised that it came with stuffing on the sandwich, I didn't see any underneath my clearly flattened/squashed turkey patty. Mostly just the sauces and the squash puree, it was a let down. My partner's burger (the beast) came out steaming. I was for sure jealous. The fries were my favorite part. I would be willing to go back in a few months to try something different, but I won't be making it a priority. Overall, it wasn't as good of an experience as we had expected it to be.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IXD-jdycm7m34b_Nliy82g"
  },
  "2AU2JFR27yrXfDS1OLcT6w": {
    "date": "3/5/2018",
    "text": "We were on the waiting list with no one in front of us.  When we arrived they said we would be seated next.  They seated two parties ahead of us.  After the third party was seated before us once again we decided to leave.  We were so looking forward to trying this new restaurant but,  we left extremely disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wwj767gupIq32aTSc7uD8g"
  },
  "iKmtihYg22VEK2GOGpF39A": {
    "date": "1/1/2018",
    "text": "Juicy and flavorful burger, hot dogs were also very good.  I would order both again.  Loved the garlic mayo sauce, it's great for dipping the fries!  They also have IBC root beer which is my favorite.  Love that they support Peace Love and little Donuts.  Great service too!  Everyone is so nice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f3EtJC39qiEMyXKq6j13Ig"
  },
  "9f-wO-pGSNcO6Dc6w9OV5g": {
    "date": "2/26/2018",
    "text": "Best burger in town. I've been here numerous times and has yet to disappoint. Every time with more family members. They all enjoy it. Left happy and buying merchandise because they like it so much. Highly recommended in my opinion.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "45amb8dzyzpPGnk2SkQtaQ"
  },
  "qjZ7PBTQKkujtL5NzoDMyg": {
    "date": "2/26/2018",
    "text": "Burgers are okay not to great.  If you like liquid cheese sauce for your overpriced mac n cheese this is the place for you.  You are definitely paying for the name.  The value for what I paid was not good.  Its a nice restaurant and was clean tho.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gIGniqz6ES08f7OfzirAjg"
  },
  "pIuCrqllVtgPraMepdmj2w": {
    "date": "8/26/2018",
    "text": "Had to give this place a shot, and the food is about 4 stars I have to say. The BBQ bacon burger was rather good, the beef is obviously good quality, their BBQ sauce is home made and fantastic and with an avocado spread that makes you feel a little better for eating a burger was a nice touch. While the server was very nice, service is incredibly slow... after three rounds of drinks and 45 minutes later we had finally gotten our food and for a few burgers is just an unacceptable wait time, and when food did come they forgot my side of loaded fries. The place was also only about half way full so no excuses there. Overall food is pretty good and pretty reasonably priced, but the incredibly slow service really hurts this place. I however will give the place another shot and give it the benefit of the doubt that it was a bad day and I encourage you to give it a shot because the food is pretty good, but I warn you that this was my experience with the service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ouXS3bmGsvNHJCkMQA8VbA"
  },
  "5iHRmOl_2p61FZBX4ZRtTA": {
    "date": "1/13/2018",
    "text": "Service was terrible.  Burgers very small.  Onion rings are onion straws.  Thanks to the bartender working all the way down that kept noticing we needed something.  The two bartenders servicing us was to busy talking to the waiter and waitress.   A shame looked like a fun place to go.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fk62pb80bqpLai0O7DKsIQ"
  },
  "s_dJVOf89djs_OZcSZjkMQ": {
    "date": "12/23/2017",
    "text": "This was the worst burger. It was greasy and tasteless. The onion rings were straws and greasy. The only good thing was the tator tots. My husband refused to eat and I ate half of the burger and it instantly made me sick to my stomach. Never will go back and do not recommend. Go to BRGR, Burgatory or Red Robin. Eat n Park super burger is way better.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HzChjvPqJ7jCiUKUL1yEAg"
  },
  "tEHfeObCbnJR1au2ckCe_A": {
    "date": "12/22/2017",
    "text": "We came in with a party of 10 (including 3 children under 10) and waited an hour for seating -- understandable. However, we waited over an hour for 6 burgers, a salad, and three kids meals. When our food finally arrived, we were missing 2 kid meals, a burger, and a side. Therse items took another 20 min to arrive. An hour and a half for Kids meals? True, they comped the kid meals, and added desserts (which none of the kids had room for), but there was an attitude that we should not really be complaining. The food is good, but not spectacular. It's a burger joint - better than fast food but not better than other brgr places. Probably won't be back",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iRwsHG-4Y4JmNogJBq8U1Q"
  },
  "OpK2w2pPgEzRf3iECSHktg": {
    "date": "2/18/2018",
    "text": "Burgers are mediocre, which would be fine if they didn't cost $10 without fries or tots. This is not a $13-$15 meal, especially when there are direct competitors in BRGR, Burgatory, and Burghers nearby that all serve excellent burgers for the same price or less.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OMnbmP1RyCNyINMUGTohCw"
  },
  "Qta6qVkTkOpu-zn3oX6KOg": {
    "date": "1/4/2018",
    "text": "Loved Wahlburgers!  We went on a Wednesday night so it was not that busy so we were seated right away.  I had the Thanksgiving day sandwich and my husband had the bbq bacon burger.  We enjoyed both as well as the tater tots and mac & cheese with smoked bacon.  Delicious!   We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w5zYN5eLPxu9yJglaK1yWQ"
  },
  "BvTruKDHQy9elEIhbdO0dQ": {
    "date": "2/13/2018",
    "text": "We went a few weeks after opening. We had two kids who can't sit still for hours (5 people total), so we came at 4 pm for an early dinner. There was still a 20 minute wait. We ordered immediately to speed up our process but our food took forever. We all ordered burgers because it's Wal BURGERS. Our order wasn't difficult, maybe a no pickle here, a no special sauce there... the order came out completely wrong. And the waitress, who was actually very nice, had no idea what we ordered. Not only was everything wrong, but she just randomly handed out the food. Some people just took bites and then realized it wasn't what they ordered. It's flu season, people! No one wants to eat off of each other! And it's expensive enough and took too long to just order another burger. You would think that they might compensate us in some way but no. Other than a quick \"sorry\" we got nothing! Not worth the headache. We'll go to Burgatory for our burgers from now on.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0LMXfK_SreN1q1DcuE8vJA"
  },
  "CgybJECK2b14_jRqPhdz_w": {
    "date": "2/1/2018",
    "text": "Ate here last night for the first time and unfortunately the last!!!  Was hoping to like it but everything was disappointing!  I see everyone on here complaining about the sides and I have to agree!!  We ordered a side of French fries (3.50) and they were awful!!  And you get about a handful if that in a paper cup!!  The drinks were all mixers with an added taste of chipotle on the rim (absolutely disgusting ).  The burger was average!!  Red robin has better burgers and unlimited fries wish they would put one in the north hills!!!  Overall too expensive!!  And not at all the quality you would expect from the Wahlburgs they should stick to making movies not burgers!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xjtRUCwDRjv0scbru5IYOA"
  },
  "YsmHRbZaZjJqYAlUp55Mbw": {
    "date": "1/30/2018",
    "text": "Best burger ever. Easley followed by the best server ever, Jill. Thanks for being such a pleasant person, wish all servers could be as nice as you",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-gKYeK0mWtaSWMW75lKNGw"
  },
  "QaUv3MEh80wRYb__u6NPmg": {
    "date": "1/28/2018",
    "text": "Seasoning goes a LONG WAY... they should try it! Tasteless and bland.  The burgers from my kitchen taste better.  The hotdog my kiddo got was the best thing served! Very disappointed.  I'd compare it to McDonalds... but if I had to choose, I think I'd pick McDs!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "92n8YwxWLs2R5QAzWkzd7Q"
  },
  "U-xrrwB4u6jTkL78FJ-QQw": {
    "date": "1/20/2018",
    "text": "Just went for the first time today, had a great experience! They told us it'd be a half hour wait and they were able to seat us around 20 minutes which wasn't bad at all for how busy they were! Our server was Brie and she was wonderful. Our food came out fast and hot! And there was a ton of food for the decent prices. And most importantly the meals were delicious! Would definitely go again! I think for how new this location is/how busy they are, they really have it together.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rPjcQnVe4qYiJ35B-MMwaA"
  },
  "Vbg-8NxJ6fTxwYyYqG4YNQ": {
    "date": "1/15/2018",
    "text": "I was pleasantly surprised with my meal at Wahlburgers!! I went with no expectations and my experience at Wahlburgers was a 10 out of 10. The food was amazing. Hamburgers are not my favorite food ... but the hamburger I had was delicious. The sides were good but not anything extraordinary. Next time, I would go get a hamburger and tots and call it good. The service was also amazing. It made my experience there that much better. I would suggest to anyone and everyone to go try Wahlburgers !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_gAR5Aud93DHW08GvWskEg"
  },
  "7i2EsPuSmYcj_nmxTp70Cw": {
    "date": "1/8/2018",
    "text": "At at the one in Vegas back in September and couldn't wait for this one to be finished. We went on a weekday at lunchtime. Being its new it was busy but we didn't wait more than 5 minutes for a table for 5! Our kids LOVED their burgers. Our server Stacy was highly knowledgeable of the menu and bar items. My husband got a beer and she was sure to keep him happy! She took our orders and checked back enough but not too much. Can't stand when servers hang out while you eat. She made my children feel very \"at home\" with crayons and paper to color on. Our food was brought to us in a timely manner and was absolutely DELISH!!!! Can't wait to eat here again!! Hopefully Stacy will be working again and we are lucky to sit in her section!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mez7IF1A91jRAiosRRF8uA"
  },
  "8CKHPwXxK15cU_rmAOl8fw": {
    "date": "1/5/2018",
    "text": "I took my daughter here and we ordered a BBQ burger, a black and white shake, and a caesar salad. The burger was delicious; their portions are very reasonable, which is great for me because I'm not a fan of huge, complex, packed burgers. However, the service was a huge disappointment. We went around 3:00 on a Thursday, and the place was not even close to packed. There were several tables open, and no waitlist. Our waitress seemed nice at first, until she gave us our check in the middle of our meal. My daughter still had at least 1/4 of her burger to eat, and we still had salad left. After placing the check at our table, she asked if we were done with our food. I began to question the professionalism of this waitress because it was clear we were not finished. I simply said no, and when my daughter finished her burger, the waitress was back... not even a minute later. She didn't ask if she could take the plate away; instead, she took the plate and the check and walked away without a word. I was very upset to encounter such a rude waitress. If she was in a rush to leave work, that's fine but she should've asked someone to cover her table instead of rushing my daughter and I to finish our food. Never in my life had I ever gone to a restaurant and received the check in the middle of our meal. I've eaten at places where the wait was more than 30 minutes, but the waiters and waitresses never gave me a check in the middle of our meal. I will come back for the food, but the service could really use a bit of construction.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mWXWxN5-ZWcFpm7PHwvEqw"
  },
  "GGE7OuX80NpNPabG7VoCaw": {
    "date": "12/27/2017",
    "text": "I have been to this location three times since it has open and the food and service are terrific!  If you are hungry go with the Triple Decker or the Melt.  Very tasty!!!  The onion rings (made with slivers of Red onion) are addictive and very good.  Try the Frappes (a milk shake kind of thing) - my favorite is the Creamsickle - tastes just like the frozen treat on a stick the you would get as a kid!!  Service has been excellent every time i have gone.  These servers really seem to care about getting you good food out to you fast.  I never waited for a thing.  Prices are very reasonable for the quality of food and service I received.  Definitely will be back many, many time!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XsLOR1RM_URSGfVPaSWqFg"
  },
  "kQuJBwkssgAuuIN6N8kF4g": {
    "date": "6/24/2018",
    "text": "Really didn't expect to love it as much as I did. The burgers were amazing!!  We also ordered the sweet potato tater tots - again amazing!! We will definitely be back to try more on the menu!  Thanks for bringing this restaurant to the North Hills!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M4gbkR6s72GuvYgeZZrHVA"
  },
  "wDQlRWzyYOZ6s-OXyvC8Jg": {
    "date": "3/11/2018",
    "text": "Nothing special.   Very greasy.  Left the place and had to change and shower to get rid of the greasy smell.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4DXqSF3MGFg9UDhNbH_VBg"
  },
  "VRVWzMesF_9Twf85TPEoAA": {
    "date": "1/20/2018",
    "text": "Ordered The Our Burger and fries.  Even though the burger was tasty and done perfectly, it was very small and not filling at all.  When I go back I will try a double or a sandwich.  On the plus side, we were seated immediately for lunch during a weekday, and the waitress was a hoot.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EL75pY9qGXwX_eYWzDfKAg"
  },
  "9K-nQJcLO2v3DvEUKVOUvg": {
    "date": "4/29/2018",
    "text": "The location is good, the layout inside is good, the food is good, food comes fast, menu is hard to follow.  Overall fun place",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2WIaneiedRwpXsykLNnS_w"
  },
  "9tmZuDJhLCZC4mKjPCtvHA": {
    "date": "6/10/2018",
    "text": "Wow what a disapointment, I think we bought into all the hype and thought it would be great. I had the chicken sandwhich, way to salty and nothing special. My wife had the OFB and found it to rather normal. The service was very poor, we were only one of about six tables and the waitress was unatentive and rude. Had the tater tots and could have gotten a whole bag at Giant Eagle for the $3.50 they charged for one small cup, way over priced. The beer was very cold and Cosmo my wife had was very tasty.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BeeOXsat618v7NJOeKVAaA"
  },
  "9cEnozkUyx4r2Ts9lkoeDA": {
    "date": "1/10/2018",
    "text": "I am on a diet and got the salad expecting it to be covered in French fries and cheese but was pleasantly surprised that it was healthy fresh and green!! Brandon T the bar tender was great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U0y04FKby2td6fvagb4h5A"
  },
  "6exAzZGmWgoB6axf6VeiOg": {
    "date": "5/27/2018",
    "text": "I am giving this one star because the service was horrible. We were seated and waited 10 mins for someone to wait on us. I ordered a beer and my bf ordered a tea. We both got burgers. The waitress brought the tea out and me a water. A good 25 mins goes by... no beer is delivered. Our waitress never came back until the food was delivered. In between the time she took our order and when the food arrived, I had to ask 2 different waitresses to bring me my beer. After the food arrived, my burger had onions and I specifically said no onions. It's like this girl didn't hear a word I said when she took my order. She was not attentive at all. When it became apparent that we were not happy she stopped by 3 times AFTER we got our food to check on us probably because she knew her tip depended on it. I don't understand what she was doing the whole time because the restaurant was not busy. I was so disappointed and I wont be returning.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tzWpxBJE-cMuhOUWf7xQ0Q"
  },
  "PxleQd5plmPnWQuQKPEjeg": {
    "date": "5/25/2018",
    "text": "This was my first visit to Whalburgers, and it was awesome!!!  Chloe, our server, was spectacular.  I highly recommend the sweet potato tots.  Our burgers were loaded with flavor and perfectly cooked.  Greatest place to go for a burger.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F60ARkzL9fwXOG0YPT4Svw"
  },
  "AEuFhsNfh_uVdPA6FQPF6g": {
    "date": "5/25/2018",
    "text": "Husband and I went to Wahlburgers this evening for dinner.  Husband ordered the Impossible Burger and thought it tasted better here than at another local restaurant that serves them.  I had the portobello sandwich and really liked it.  We sat at the bar and the bartender was great.  This is our fourth time visiting Wahlburgers and I can't wait to go back to try the Impossible Burger myself.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FN8FkiSn8OsWv3HJOx-xbA"
  },
  "_UOMz8ZHezoL_LyPSn752A": {
    "date": "3/23/2018",
    "text": "I have no idea why the rating average is so low, this place is off the charts! The burgers were great, there's a ton to choose from both food and drink wise. I will definitely be going back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FWi-nMMR9XCplq5GU2IpYA"
  },
  "qLBxKQNBDY0QUsUed1wFgA": {
    "date": "4/26/2018",
    "text": "Not impressed at all, for a burger place you would think the burger would stand out from all the other burger joints. My wife and I tried it because we liked watching the tv show. Fries were just ok not great either. Burghers in Lawrenceville was ten times better. Won't be back, sorry Marky Mark, still love you.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Pxs6340f7CKXmlsD0BNkg"
  },
  "GptVeSqGPneLc0C1tcTm-g": {
    "date": "4/26/2018",
    "text": "This was an okay place. Had to wait a bit as this is the new kid in town. Thet had buzzers and some games outside in the hall. I wanted a burger, no bread. The waitress suggested a salad. Turned out it was a good suggestion. My partner had a burger. Portions were generous. While the food was nice, it was nothing exceptional. Service was good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yrY0TeoX_knVs1QXJ7c_aQ"
  },
  "Qgs2jCF4k3M-kC0K8_B56w": {
    "date": "4/25/2018",
    "text": "Burgers are always good but it's a bit pricey. Tater tots are worth sharing! We have been there a few times now and the takeout is my favorite. They are consistent and always get our order right.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uMHvuQhtirMcpz6zTlyVlw"
  },
  "v0WKZEilVM-7W08iQCvY2A": {
    "date": "12/28/2017",
    "text": "So yummy! The burgers were juicy and full of flavor. My 14 year old was raving over the Our burger  The crispy haddock was just wonderful. Onion rings were amazing!  Love the Wahl Sauce. So worth the wait! Our server was lovely also! Great experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZurDC_uglI9YGe6U7DcUdw"
  },
  "PY72wZwMrzHwyCjyIP3zmg": {
    "date": "2/25/2018",
    "text": "Burgers were average, everything is ala carte - burger, fries, drink. I would compare this to Five Guys but with a bar and table service. Wahlburgers is a sit down restaurant but drinks and fries are served in paper cups like a fast food restaurant. There are better burger joints in Pittsburgh for sure.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lqy21XyyxcDoISvaJHuzZg"
  },
  "jOVfxHa7CDLQjgEyvakyKw": {
    "date": "2/1/2018",
    "text": "We had a great visit to Wahlburgers today. It was pretty crowded and a little noisy as my friends met right at lunch time. It was our first time there. The place looked clean and nicely decorated. Jill our waitress was energetic and polite and stopped by often. We ordered the onion rings basket which was yummy. This was my first time eating such thin cut onions, but they were good. I ordered the portobello mushroom sandwich which I enjoyed . The price was reasonable and I would come again. It is a nice addition to the Mccandless area ! By the way, you can enter the restaurant from either the McKnight road side or the back side. They did a great job renovating the old Northway mall with a beautiful stairwell. Check it out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c3F2-bRbYBbQF2JsuSzvug"
  },
  "s9zqy9rFdVARSz-s4fELFg": {
    "date": "12/22/2017",
    "text": "Waited over an hour and a half for our good once seated. Waitress checked on us once in that timeframe, only to get another round of drinks. Never updated us on delay on food. She took an attitude when we questioned the delay and why others arriving after us were getting food before us.  Good food but service is non existent.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "G8ra1vk9TjcBkUA4AUY3LQ"
  },
  "1SIfS_KWIOv2H0eANxKxoA": {
    "date": "3/25/2018",
    "text": "Tried the Our Burger and onion straws.  Very good.  Friendly service.  I would recommend if you're in the mood for a quick burger.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EGw3KOTNprGE2DOsbsTOuQ"
  },
  "be-OmvE1hBivuddK8-4Ing": {
    "date": "1/12/2018",
    "text": "What an awesome new place!!! This was our third time at Wahlburgers. The new open seating option at the bar is really cool, as it cuts down the wait time at dinner to get in. This time, we came for lunch, and we walked right in. After starting with a cold Wahlbrewski, we moved on to our salad and Mac n cheese course. The mac n cheese was awesome! Then we went on to enjoy, of course, a one of a kind delicious burger. Our server was friendly and attentive, and food was quick! This is definitely the hottest new place to go! I would recommend it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZpULAu9vUZEiBmJbXdCm8A"
  },
  "25g7REpMnKdsoAtKmn922w": {
    "date": "7/29/2019",
    "text": "The food was good but nothing special. Fries and onion straws were about the same as you can get at most places. The burger was good, but so are the ones you get at Red Robin, 5 Guys, etc. Bottom line: the place was decent, but didn't live up to the hype.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0nxzG-WAxV6ROi6gEPPzRg"
  },
  "8cYY8Ky8v7VNgs9K8ulCMA": {
    "date": "3/6/2018",
    "text": "This place is good. I'm glad we tried it, but we probably won't return. The food is tasty but the quantity and quality are not worth the price. We did however receive fast service. 4.5 for the taste and atmosphere 3 for the price versus quantity/quality 3.5 overall Also, not included in the assessment above is 1/5 - didn't meet Mark Wahlburg.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "f4BtAqZMGslm-CvLfD0iuA"
  },
  "o_Qm25cxE5IKMDzFc8mOnQ": {
    "date": "3/30/2019",
    "text": "This place has no business being as freaking delicious as it is!  I can't even believe a restaurant owned by the Wahlbergs is GOOD and not just a marketing scheme.  Best portabella sandwich I've ever had, and my meat eating husband - who is a total snob () says it's his favorite burger of all time.  Don't sleep on Wahlburgers!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K-nJvlZKQOHp1R5CkHh0Eg"
  },
  "ZodFkTRA8hFWEisVrVaTeQ": {
    "date": "9/28/2018",
    "text": "This was my first time trying Wahlburgers. I walked by and checked out the menu previously and liked that all of their burgers could be ordered with the impossible burger patty. We happened to be shopping in the North Hills plaza and ended up here during happy hour and they have half off appetizers and half off their Walhcoction drinks as well. I ordered a drink (cant remember the name) with rum and several juices and it was not a strong drink. I have to admit that I ordered a shot of tequila halfway through my drink to add to it. I ordered the O.F.D burger which is a half pound burger normally with Swiss and mushroom, bacon and housemaid tomato jam. Swopped out the half pound patty for an impossible burger and minus the bacon and the sandwich turned out to be pretty tasty. I really liked the tomato jam touch. I also had a side of fries. Everything was good until the check came. Normally when ordering a burger in a restaurant, fries come with it so I didn't actually think anything of it when choosing between fries and tater tots like the waitress asked. When the check came...to my surprise the burger was $13.95 ITSELF and the fries added were an ADDITIONAL $3.50. these are not specialty fries. They were a basic side of fries that were no different than making frozen fries at home. the friend I was with mentioned to the waitress next time if someone says they have never been here, maybe mention that fries are separate. I did rate this place a three because the burger was actually really good, but the value after learning that the total cost of a burger and fry was $17.45, I would have passed and just got a drink and an appetizer",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "M2KBq61ps7HF8lH1_9nylA",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/M2KBq61ps7HF8lH1_9nylA/o.jpg"
      }
    ],
    "user_id": "mA3tALTzmDunDRctGEu-wA"
  },
  "Wm-IL0tuO7AG_4Wgt_6eng": {
    "date": "9/22/2018",
    "text": "Today was my wife and my first time visiting Wahlbergers. Our waitress, Jillian G, was extremely friendly and helpful. She pointed out all of the features on the menu and was very quick to bring items to the table. It is very rare that we experience people who are so friendly and enthused at restaurants. The food came out really quick and was one of the best cups of chili and burgers I have ever had.   Thank you so much for the great experience we will definitely return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HCLu64wLbS2rn7Ditu9dDA"
  },
  "dKt0SVl9qPOXeR6GatojcQ": {
    "date": "11/11/2018",
    "text": "I have wanted to eat at a Wahlburgers for years, and the Pittsburgh location did not disappoint! I had The Our Burger, sweet potato tots, Mac and Cheese, a Wahlbrewzki, and a S'mores adult frappe. Don't judge - I really wanted to try it all and I took some back to my hotel. It was all soooo delicious! I will definitely visit this location again if I am in Pittsburgh and I cannot wait to try others!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ogconH6Pe-nQv6MplfI_xA",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ogconH6Pe-nQv6MplfI_xA/o.jpg"
      },
      {
        "img_id": "rCnmotXrNwGWLbYG9rA4yg",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rCnmotXrNwGWLbYG9rA4yg/o.jpg"
      },
      {
        "img_id": "iH1bZWZFg7lYXPo4oVcr0w",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iH1bZWZFg7lYXPo4oVcr0w/o.jpg"
      }
    ],
    "user_id": "R37SJxqn5C9bz-cuXIqDJQ"
  },
  "KgvB9tbAO4-PCBr29twKVQ": {
    "date": "3/10/2019",
    "text": "Fun place to take my nephew & his friends on a weekend night. The atmosphere was busy, friendly, and noisy. The burgers were delicious; plenty of variety of toppings, without going \"too fancy\" for a group of teens. At the same time, better than most burgers, as they were fresh, and cooked to order. Excellent service, fair price.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uFqTIbEGRinKSTSrjdV0JA"
  },
  "oGlKK2aS__yMuCUm7AvzMg": {
    "date": "2/18/2018",
    "text": "I was really looking forward to trying Wahlburgers. I didn't hear much about this restaurant, besides that it was owned by the Wahlberg's. The menu isn't large so we were able to find something quickly. I ordered the \"Our Burger\" which was a regular cheeseburger with their signature sauce and fries. Mike ordered the triple decker which was the same thing but three meat patties and also fries. The food was okay, it wasn't really anything that impressed us. Mike compared the fries to \"concession stand fries\", simple and not much salt. I guess we had higher hopes of having \"gourmet burgers\", but for a Sunday lunch, it was good. We went around 1:30 and it was a 30-45 minute wait. I definitely suggest using the Yelp Waitlist prior to going.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SR-w_UPji16tY54z9jnlXQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Triple Decker",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SR-w_UPji16tY54z9jnlXQ/o.jpg"
      },
      {
        "img_id": "Om-UP1YnYHdv5FpGM5wzpw",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. The &amp;#34;Our Burger&amp;#34; and fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Om-UP1YnYHdv5FpGM5wzpw/o.jpg"
      }
    ],
    "user_id": "Nx3Y_sXwqrSfwWS8LsNiRg"
  },
  "unO5pkCAsgavQoydRoDY7Q": {
    "date": "10/14/2018",
    "text": "This is a typical modern day hipster chain with small portions and large prices.  I ordered fries, the chili-cheese dog and the burger.   - The hot dog was sent back as soon as I got it. They don't use buns, they use more traditional loaf style bred. It's not very strong. I couldn't pick up my hot dog because it was just covered in toppings and when I did, it poured out all over the place and self-destructed. I had to get a new one. The dog is a beef style dog, which I don't really like as I prefer pork.  - The burger was really small which is fine but not fine for the price, but McDonald's is the same size and half the price. I make better burgers at home. Nothing special.  - The fries were fine and nothing special, but it's hard to mess up fries.  The price was too much for what they gave you and the quality was just not there.   The seating are these bright green hard plastic/metal chairs which aren't comfortable at all.  In the end, this place was a lot like Burger 21 which was right across the street and didn't make it. I don't drink, but I don't really see why you would go here for a burger when the North Park Longue or J-Clarks is up the street and if you have to go to a chain, Chili's is better.  This will not make my rotation of restaurants and this was my first and last trip there. If it didn't have a name and a TV show, it would probably already be closed, because the quality and pricing just isn't there.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YW5la87xn4Ik-3X-rUX4Ug",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Hot dog Explosion!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YW5la87xn4Ik-3X-rUX4Ug/o.jpg"
      }
    ],
    "user_id": "7nIzgNF7YzI-UAyYr3y9hw"
  },
  "VndiKyMxOduTjoEpYldtuQ": {
    "date": "4/28/2019",
    "text": "Always good food and pleasant service. Their pickles are oh so yummy. I can't wait for the new Robinson location to open.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lw6CTB3p6WXkl88Zu5sWAw"
  },
  "c9mn6mgqUbiuJhzFsUNkHw": {
    "date": "8/6/2018",
    "text": "I had to check this place out as I'm a huge Wahlberg fan and a huge burger fan - I mean, who isn't?   I was a little disappointed with the burgers just because the place was really hyped up when it first opened. The burgers are really greasy and I that's not how I love my burgers. However, the onion\"rings\" which are more like thin onion strings, were really good!  On the upside, Wahlburgers uses the No Wait app, and since it gets pretty busy and wait time can be more than an hour, that's a huge up. I love the atmosphere inside - especially if you're a fan of Mark, Donnie and Paul! Service was quick and concise, too.  My biggest complaint, overall, is that we were seated near the kitchen and when I put my clothes that I wore to dinner in my llaundry hamper, my ENTIRE closet smelled like Wahlburgers the next morning and I couldn't have washed my clothes fast enough. I'm sure that stems from the frying grease - as I said, my burger was pretty greasy.   Wahlburgers is a one time visit for me - cool atmosphere, sweet to say you've been but I'll be hurrying to another burger joint next time I'm craving a patty between a bun.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "o_iRK516QddvopdKRTTnCQ"
  },
  "gFGPLktelMl97JwruRTBfw": {
    "date": "12/28/2017",
    "text": "A huge hamburger fan as well as Wahlburg fan.. was so excited to visit the new restaurant that opened in the North Hills area of Pittsburgh.   They do not accept reservations so my first trip was on a week day  - hoping to beat the crowd.  It wasn't as bad as I expected.   The area where the restaurant is - the mall has completely been revamped... and guessing this restaurant was opened here to attract more businesses to the local stores/area.  I just found it odd of all places for Walburgs is in the North Hills - not downtown or southside etc.  BUT!!!!  I am all for more jobs and do like to see other areas of the Burg thrive.  There is a small bar (about 10 bar stools) you can grab a drink or eat at.  The dining room consists of tables mostly - only a few booths.   I thought it would be bigger in size but it was just right. There is also an outside balcony with outside seating.  So we only had to wait about 15 minutes for a table (Thursday 5 pm).  I expected to wait longer. I like the fact that my table status was sent to me via text msg through yelp!   Seated at our booth ...  service was good.  We had studied the menu so we knew what we wanted.  I of course wanted to try several menu items.  The mac n cheese with bacon ...$3.50 and worth it but folks its on the borderline of the sharing size.   It was good and very flavorful and no doubt one of our favorite parts of the meal.  The tater tots (regular not yams!) We were excited about this menu item but when they arrived..  they looked like frozen tater tots!?   I could have bought two bags for $3.50 at the grocery store. They were bland and a disappointment.  We tried dipping them into the walburg sauce and that sauce was ok - a bit odd. Seemed like mayonnaise and ketchup? Then the fries.. ok so they weren't fresh cut but were definitely better than the tots.   The onion rings..  we were sold when we saw they were \"house made\"  .. and if you are a lover of onion rings.. its so fun to dip but when these arrived.. they looked like deep fried onions straws that belong on a burger? They were tough to eat and so odd.  I get it.... It's a different twist on the popular fried food - but was also a disappointment.  Basic tossed salad..dressing on the side - ranch - was requested. The salad came and it was accompanied with the ranch dressing but it was already dressed with a vinaigrette dressing?    Ok mis-haps happen. It was obviously someone elses salad.. another server put it back that way or something? It was just odd.   Then the burgers arrived.  I loved mine.  It lived up to my expectations.  The atmosphere was cool but the food was lacking.   My boyfriend was so excited that there were cupcakes on the menu and when we inquired about those.. were told that they didnt have cupcakes but donuts?? Donuts for dessert? Ugh I will pass.   We had to ask for silverware? Why weren't they on table or provided when we were seated?  It was disappointing.  Myself and my party were not impressed. The prices weren't too bad but it was one thing after the next.  Perhaps the restaurant is just experiencing growing pains.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 8,
      "cool": 5
    },
    "photos": [],
    "user_id": "7qGe49__QqCpk8ZYOm7W8w"
  },
  "4EcyzTEhC7FyDYlTx4G31Q": {
    "date": "2/18/2018",
    "text": "I've got to start by saying that I was so thankful to check the Yelp app before heading over for burgers. It was late lunch on Saturday, and the app let me know that the wait would be well over an hour. Luckily I was able to reserve a spot on the wait list before I left my house. We checked in person with five parties ahead of us and were seated within 20 minutes.  The restaurant is smaller than I would've imagined it being. However they made up for it with the prices. Things capped at about $10, which seems like a rarity these days at nicer burger joints. The cheeseburger I got, which came with pretty amazing sweet potato tots, cost about 7 bucks. Everything was tasty and good.  So, was this a meal worth a two-hour wait, like some groups I saw outside? Hell no. But it was a good inexpensive meal, and hopefully a place I'd go to again once the hype dies down a bit.  Also, it wasn't until afterward that I saw they have a black and white milkshake, but that's on my list for next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "0JIiQelaItruoV6F9pWHvw"
  },
  "1snA4f0JOObMuJybBfR2YQ": {
    "date": "7/10/2019",
    "text": "Attempted to come here when they first opened and was told there was an hour and a half wait on a Thursday afternoon. Tried again a few months later on a Friday at 6:00 and there was no wait and no crowd at all. Burger was average, wasn't a fan of the fries or the crumb topping on the Mac n cheese. Good service. Excellent happy hour specials!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q5id8l-8neWf78rbe0qbeA"
  },
  "EKT4mb4pPs-jqPDuCfRARA": {
    "date": "6/18/2019",
    "text": "I went there hyped expecting great food as lots of hype was surrounding the opening and among my group of friends, my gorgeous galpal and me went for a lovely little date, from the sounds of the menu I was excited then came the miserable server from hell and the over rated food... I ordered the triple burger and add bacon, she ordered some kind of fiesta burger, we also ordered fries and onion rings as sides and an appetizer of fried pickles...waitress came back and told us that there were no pickles left okay, then for the next 10 mins we tried to get her attention to order the buffalo chicken dip, we finally got it after watching her almost blow a gasket after having a bad day presumably, and just giving us dirty looks, but her i can tolerate some lousy service if the food is kick ass...it wasn't... the regular pickles were awful, the buffalo chicken dip tasted like quaso cheese with spicy chicken, no cream cheese and super greasy big let down, the fries were worse than most frozen fries i have had, ore ida makes better frozen fries, the fries were dry bland and not flavorful; the onion rings weren't onion rings but onion straw that are typically on sandwiches, which is fine they were good but they weren't onion rings... the milkshake was delicious, and here comes the burger...it was good...but it wasn't nothing i would go out of my way for, average burger comparable to a smash burger or a five guys burger... very overrated place i wouldn't recommend it and wouldn't go outta my way to eat here, price for the food was about 40 dollars kinda pricy for two burgers and a appetizer, having to pay separate for the fries and onion rings instead of being included with the sandwich upped the price a good bit and cost almost 15 bucks per meal, and it just wasn't that good, would def recommend five guys over this or hell Red Robin Atleast u get unlimited Fries that are good and they have the delish strawberry lemonade:)",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RCOGu6kAGQypYj8tmOTRkw"
  },
  "MjHUxSjHjWKf8IfKZ5SqSQ": {
    "date": "12/27/2017",
    "text": "So I'm assuming that this was only the \"Soft\" opening.  So let me start here, we were seated a table ASAP. A waiter came over to explain the menu to us. But then proceeded to let us know he was not our actual server and that she would be over soon.   Our waiter who's name was Keirston did not really know the menu yet. Which is fine because everything is still new. She asked if we wanted any drinks (we placed those orders) Waters with lemons, Red Sangria, White Sangria, and 2 beers. The drinks came out fairly quick. Next she asked us what we wanted.   Orders: I ordered A \"triple burger with no cheese\" it was supposed to come with lettuce, cheese, onion, pickle and \"wahlsauce\". My Burger came out just with the patty and bread. NOTHING ELSE. My sister ordered a double decker burger with everything on it. And a side of Mac N cheese. They forgot to serve her Mac N Cheese. And after she received her order they never gave her a fork to eat with, Even after reminding her!  The other meals consist of 3 double decker burgers with everything on them. With a side of fries and tots. Their meals came out as is.  Our meal took about 1:30 to come to our table. Even had to ask how long it would be, receiving \"it should be on its way\".  I thought this was very inappropriate. They were only making BURGERS !!   After all was said and done. My total was under $30.00 and my card was charged $66.00!!  I will not be returning here.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "2nd9mK1Gy3IAeffBA4XpBw",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Spiced sangria",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2nd9mK1Gy3IAeffBA4XpBw/o.jpg"
      },
      {
        "img_id": "zN4fg52Am0O1SNzE4qbN4w",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zN4fg52Am0O1SNzE4qbN4w/o.jpg"
      }
    ],
    "user_id": "yA0Kddgz1zTXdDsJTX98OQ"
  },
  "Kl86W0QZ3Xsfr0GdrLuWmg": {
    "date": "8/17/2018",
    "text": "I really enjoy coming here! Every time we have gone here it has been busy, but they are on No Wait so we have never had to wait for more than 10 minutes before being seated! I always order the Our Burger, and it is delicious! The coffee milkshake is also super good. Looking forward to eating here again soon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qsZAt8QHxZ6VjX-jCKyr0Q"
  },
  "Y-DVxawNXF7t_yFR4jIimA": {
    "date": "12/29/2017",
    "text": "Stopped here for a bite to eat before shopping.  This location had just opened so it was packed.  Two hour wait to be seated but the bar was open seating.  We grabbed two spots & waited patiently because they were so slammed.  We both ordered the Our Burgers.  I topped mine with bacon & avocado spread in addition to the regular toppings. I also ordered a side of Yukon gold fries. The garlic mayo mustard dip was delicious. It's one if the many sauces/dressings available.  The food was good. It was along the lines of Five Guys or Red Robin.  Service was pretty good considering the amount of people that the staff was waiting on.  Loved the decor.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Z_0JBdvWLFk52dWjBhd-zg",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Z_0JBdvWLFk52dWjBhd-zg/o.jpg"
      },
      {
        "img_id": "5huOSQQZ5cYwF9jbTtS5Hw",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Part of their menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5huOSQQZ5cYwF9jbTtS5Hw/o.jpg"
      }
    ],
    "user_id": "FNpdDqeTRi4Rqe7eeq5w3Q"
  },
  "y8w0kTpPV0mKtdmYNy8yvw": {
    "date": "7/6/2019",
    "text": "Best burger in the Pittsburgh area bar none. Fresh, simple, clean, fast, and relatively well priced.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ley5AKUFKc5jd-Qkr7xclw"
  },
  "inTfbLXSOqa9Z5UMcEW5nQ": {
    "date": "4/14/2019",
    "text": "Very average food. There are so many good places to get a burger in Pittsburgh I would skip on this one.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IADx7yEJ3TByoM27JahU6g"
  },
  "DqMMcs8L6UHDvJqC-WOYbQ": {
    "date": "12/22/2017",
    "text": "I'm not going to lie, I had some pretty high expectations for this restaurant that were not fulfilled. My mom and I arrived around 3:50 this afternoon and there was a 5 minute wait (which wasn't bad). They do not have their no wait app set up yet so you can put your place in line before arriving. While we were standing there we noticed it was getting pretty busy and people's wait times went up to 45 minutes. Everyone seems pretty hyped up to try this place. We were seated in a booth and greeted by our waitress Chloe fairly quick. She was very friendly and knowledgeable about the menu. She was also very good with making recommendations which I always enjoy when I go out to a new restaurant. I'm going to be honest, the employees and friendly service is all this place has going for it in my opinion. Kind, friendly service that makes you feel welcomed goes a long way in the food industry. She was very attentive and deserves to be recognized for that.   The burgers though, they didn't win me over. In fact, they left me wanting to hurl over instead. I ordered the BBQ bacon burger and it was greasy. It comes with 1/3 lb burger, jalapeno, white cheddar, bacon, House made bbq sauce and avocado spread. I asked that they didn't include the jalapeno on my burger, but they also left off the avocado spread sadly. The bbq sauce was pretty good, but the burger itself was too greasy and not very thick. I have definitely had better burgers elsewhere. I hate to say it but it's almost like having a burger at a place like Steak 'n Shake. The tater tots were pretty subpar. Unfortunately, I wouldn't come running back here if I was in the mood for a burger.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "t_7w07ncJ8XZW0v8Dcn0Rw",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/t_7w07ncJ8XZW0v8Dcn0Rw/o.jpg"
      }
    ],
    "user_id": "mYJW4-M4tcRygSwdT3A6Ww"
  },
  "WUGlgdTdgWfGGRlQ_ok_pQ": {
    "date": "2/3/2018",
    "text": "Eh. Long wait but that was to be expected since it is new. Server took awhile to great us. She was nice enough though. Food was mediocre at best. Didn't realize plastic cups are a thing beyond fast food. Husband didn't enjoy either. I guess that's a thing with celebrity owned places they just rely on the name to keep them in business.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e4V4WN6wSbCWl6BzyGBEuQ"
  },
  "pWTwHLbp8Sh1CufqpxY88g": {
    "date": "8/11/2018",
    "text": "A great place that does live up to the hype!!  Great food with some special Pittsburgh touches!  The burgers are amazing!  The Sloppy Joe is great and takes you back to old fashioned sloppy joes!!  Mac and cheese, amazing!!  The staff is pleasant and helpful!!  Been here at different times of the day and always a good experience. The only thing I would change are the chairs. Not the most comfortable but the good food makes up for it!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6xPsx3VBc-xkHVoKsDfrNw"
  },
  "-G2M9RC8j-hK90Pjc8AGmg": {
    "date": "9/4/2018",
    "text": "We were out in the shopping center and figured we haven't tried Wahlburgers, so why not eat there? I was underwhelmed to say the least. The burgers were standard and to me nothing special. You do not get a side dish with your burger either, which is kind of annoying. Raise the price a buck or two and include fries or tots. Up charge the other sides. I found my burger greasier than I'd prefer and eating from a basket just isn't for me. Also the sides came in paper cups, which seems wasteful. Honestly we probably won't be back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H0-AyKKuBnz9XBzwwaEcmA"
  },
  "SVbGoOr2VRIZSeX-Jd4KZw": {
    "date": "7/6/2018",
    "text": "So I had mixed expectations. But I have been pleasantly surprised!  Not only affordable for a date night but I got Jenns walhbowl and I have never had a salad with this quality of lettuce. The chicken was amazing. Everything was amazing. I LOVED my dinner and my husband and I will return!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bS2sQitAgMPHu_k2h6Wdpg"
  },
  "y9ottlfMe_O0s5ZaGi8VCA": {
    "date": "2/6/2018",
    "text": "For my first time, it was a pretty decent experience. Other than the pretty cold \"welcome\" (um, can I get someone to seat me?? Why are staff looking confused?) I enjoyed Wahlburgers. The waitress, Chole was mad cool and the food was delicious! I had the sloppy joe. It was very filling and I wish I would've saved some for lunch the next day. The sloppy joe is a bit sweet, so I love the pickles they give you on the side. Nice balance of taste. The only thing that would've made it better was an extra slice of bread. My daughter had the vegan sandwich. I think it's called the Impossible Burger or something. She loved it, especially with the special Wahlburger sauce. As a side we shared fries. For $3.50 or so a side, I wasn't buying two, but the one was enough for the both of us. We topped it all off with double chocolate cupcakes that we weren't able to eat since we were full. There are some other items I'd like to try, so I will be back!   It was a clean establishment, the bathrooms were decent and we went on a Monday evening and it  wasn't busy. The overall service and experience, on a scale of 1-10, was a 8.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4nHHxHKj6qHXuRT4p2ZQ0A",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4nHHxHKj6qHXuRT4p2ZQ0A/o.jpg"
      },
      {
        "img_id": "wHCbYgZLhwE4UOWEoVL3hQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wHCbYgZLhwE4UOWEoVL3hQ/o.jpg"
      }
    ],
    "user_id": "6rBGHCB79UOdIu1ghFYFtA"
  },
  "RXKWuCaU5DQaSjji0nRjAA": {
    "date": "10/6/2018",
    "text": "Excellent ! Loved this place . They have many options and very reasonably priced . Ambiance is amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IOUoRVq2X0RohULay345EA"
  },
  "6wEpdqI-jvb7RrUZr-BwgQ": {
    "date": "12/31/2017",
    "text": "Not only is the food great but..,, ask for Brendan and he will make you an AMAZING New York sour. Sorry pic is with some gone it wS so g",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IcY4grMGFS_GdhXUvrnKiA",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IcY4grMGFS_GdhXUvrnKiA/o.jpg"
      }
    ],
    "user_id": "cfdj49Ud9X2tYx766N6-_w"
  },
  "3Cc5kZb9xj5zS6-Yg-Kl6g": {
    "date": "6/15/2018",
    "text": "Amazing burgers and always great service! I always get Donnie's favorite the BBQ burger with avocado, never disappoints!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CIJunlgX_qKroz_jSlm0fg"
  },
  "9OS83mt5XmKmiUB0XUPGFw": {
    "date": "2/14/2018",
    "text": "The burger I had as a whole was good except the meat didn't taste like it had had any seasoning added to it. I ordered the side of onion rings and it became obvious that the oil wasn't hot enough, as they had soaked up so much oil I began to feel a little sick at the end of my meal.  The overall feeling of the restaurant felt ok but the acoustics was a bit too overwhelming. I would give it another try as I might of gone in on a bad night, but not a great first impression.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2noidYhD9qn7kMYjrsv2mw"
  },
  "MAYkdyqSqz_I5X-s-aQWhA": {
    "date": "7/28/2018",
    "text": "Good food thought portion size was alittle better service is what helps. Plave was crowed and good prices also.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oGvs4aDSHrd76hPo073F1g"
  },
  "u-RGmvPcEPOwrnd9_qbD9Q": {
    "date": "2/10/2018",
    "text": "I was really excited to try out the Wahlburgers restaurant. There beer selection was ok. They had Dog Fish 60 mins, which I love. They also had a local brewery (East End) which I like but the beer they decided have on tap was not my favorite (an Ale).  Anyway, I ordered the BBQ Bacon burger. It was just ok! That is troubling because (1) the burger was around $10, (2) it did not come with fries, (3) I didn't taste any BBQ sauce, and (4) the description mentioned jalapenos and there was only one on the burger.  This place is a big DISAPPOINTMENT. It's on the same level as Applebees.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dm3mV4U7d4CJEWEzp66wiA"
  },
  "o7baVnSseOL5-StJmE8VqQ": {
    "date": "3/24/2019",
    "text": "I'm not going to lie I love this place and the food and mostly The service but I ordered a lemonade once and it tasted like it was sitting in the sun for 5 months I told the waitress and I got a new drink but she still charged me for it I only took a sip and spit it out immediately... other then that experience it would be a five star.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PB_PHCn6lAT-pl9YxC1__g"
  },
  "8jk5sBykDrIaXUnW_kpe7w": {
    "date": "7/21/2018",
    "text": "Always crazy busy. I think the food is good but doesn't live up to the hype or the price. I'd rather go to Burgatory down the road.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I5clPkoRmHs0yHGpxzTBfw"
  },
  "uj5I4QJmEjWcTJIJGs4wPQ": {
    "date": "3/15/2019",
    "text": "Only reason people go there is to hope to see the owners. Only went because the school was having a fund raiser. Sorry fans of the owners not of having a heart attack from the food. One start for their generosity.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DxeE5Z31gpxvKrylywNk_Q"
  },
  "woBW2Cm45pPQt0TVxMPlMA": {
    "date": "9/11/2018",
    "text": "Came in for the first time and it was pretty much what I expected. The bacon blitz burger was good but quickly fell apart into many pieces forcing me to use a fork to eat a good portion of my burger. The sweet potato fries were good as well, and the pierogie burger looked great even though I didn't try it myself.  It's the kind of place that I'd be willing to eat again but not really a place I'd go out of my way to eat at a second time- the same as any chain restaurant in a city with so many good dining options",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ncGIUrilW6jEEHWaPpYmkA"
  },
  "72raXOIZuQK3SPXi5LYktQ": {
    "date": "3/14/2018",
    "text": "The burger I had was the greatest burger I have had I a long while. Definitely worth the calories, and the best service I have had in a long while as well. Jillian G, our waitress was the best!! When we go back I will ask for her.  The burger I had was the Melt, and had Alma's macaroni salad... YUM! And you must try the sweet potato tots! Thank you Wahlburgers!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Y2gxmk6Ji9hQiC70rjgAw"
  },
  "mMVocicKjNBfHM3Llfi_2w": {
    "date": "6/21/2018",
    "text": "The waitress we had tonight gave us the worst service we've ever received from anyone. She treated us as if we were an imposition on her time. I had to speak to the manager once during the meal because we asked her for sauce and it took her almost ten minutes to get us 'prepackaged' sauce. Then when she gave us our check, she then went to the front to have a long chat with the hostess and we waited almost 20 minutes before getting up to go to the front and pay for our meal. As we were walking to the front the same waitress passed me, twice, and completely ignored me. I then told my husband to go get her tip from the table and asked the hostess to process my bill. The hostess then went over to the waitress, in front of me, and told the waitress I wasn't giving her a tip and they both started laughing about it. The waitress then came and slammed the bill with my credit card in front of me and said in a nasty tone,\" Have a nice night!\" and stalked off. I then told her to get the manager and advised her on her rude and disgusting behaviors/customer service. She then walked over to the bar, where the manager was making a drink, and she advised that a customer wanted to see him. He asked her why and she stated ,\" oh I was rude to her\". They then joked about it, in front of me and my family, and she walked away. The manager came over to us and apologized for the waitresses behavior,  but after all of the above I was disgusted. I really hope to talk to a general manager, or possibly one of the Wahlburgers to find out why these behaviors are tolerated and encouraged amongst the staff.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tq_D5idg5kllCLaFcRlnaQ"
  },
  "VWifRJh9uEFI8RiunyhsAg": {
    "date": "3/10/2019",
    "text": "Bleh. Frozen, overpriced, hamburgers. Went here once and when it's mentioned in conversation, I say it's a no go. Sides were ok. Save your money and go to brgr or Burgatory instead. Do not recommend.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-nlV6qsVy63zZhIlOWZIKg"
  },
  "uiUDeuidJ90Kv_rxZMSX9Q": {
    "date": "7/8/2018",
    "text": "Second visit. Great happy hour prices. 8 us seated promptly and service was exc. Thank you Stacey!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aL7nUo6By5tNucYqmvKHSw"
  },
  "REKZVNSG3JeDMJEFdopUUA": {
    "date": "1/28/2019",
    "text": "Honestly, I'm in love with this place. I just recently went gluten and dairy free, so I'm highly restricted when eating out. Especially because of cross contamination. However, wahlburgers, and the amazing place it is, has gluten free buns and cooks their fried items in a separate fryer for patrons that are gluten free. What more could you ask for??? I felt as though the service was incredible and the waitress truly worked with me to find what would be ok for my dietary restrictions. Everyone was friendly and helpful. If I could give this place 10 stars, I would. My food was also insanely good. I loved my turkey burger. And the bun was great too even though it was gluten free! Go here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "reOpmyRS0ViF4EPQJNdCzw"
  },
  "v7VM6wwUoqv-Dfd-45DSuA": {
    "date": "1/1/2018",
    "text": "Great casual spot for a low-key burger and fries meal! I enjoyed my meal here. Wahlburgers offers a quality meal and adequate service relative to the price. I'm not sure why others have given this spot low reviews. This is simply a fun, affordable, casual cheeseburger spot - its just not a gourmet or speciality burger spot.  Atmosphere is clean and casual. Service was friendly. Walhburgers surprisingly offers a diverse menu with lots to choose from. Food was definitely enjoyable, what I expected for the price.  I was only disappointed that they did not have onion rings at 6 on a saturday night :( I really wanted to indulge in those.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "dGHY4RvKgNIWBwjQ_GOxyw",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. cheeseburger",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dGHY4RvKgNIWBwjQ_GOxyw/o.jpg"
      },
      {
        "img_id": "HTv9KVjFgoAD34f5qWeZPw",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. cheeseburger",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HTv9KVjFgoAD34f5qWeZPw/o.jpg"
      },
      {
        "img_id": "OPhpxOC-N_8oLvjyw_lMmQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. cheeseburger",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OPhpxOC-N_8oLvjyw_lMmQ/o.jpg"
      }
    ],
    "user_id": "YYkC8eFXC-PB6U9fjmW_JA"
  },
  "6UTorORRwfaDNauwxc0U9w": {
    "date": "8/12/2018",
    "text": "It would be easy for me to not like this place... The sheer amount of Wahlberg photos, quotes and family history is enough to make you a little nauteous. But I was here to try a burger. Thankfully on a Sunday night where the restaurant was fairly empty and we were able to sit outside.  The service was fast. Our waitress was friendly. And the food? It was way better than expected and they set their bar high for my first visit.   I went with the standard burger but swapped out raw onion for carmelized onions (major win). They don't ask your cooking preference, but mine was a perfect medium and plenty juicy. Not a huge burger, which I consider a major plus. It had a nice house sauce, fresh tomatoes and pickles. The lettuce was a major waste as they used shredded romaine? It ended up somewhat wilted and didn't have much use (iceburg would be a huge improvement).  The tater tots and fried pickles were both satisfying sides and I really enjoyed their homemade lemonade, and the fact they didn't charge for a refill like I was expecting.  For dessert we only had one cupcake option which was the plain vanilla with cream cheese icing. Not too sweet which my molars were thankful for.  Campiness aside of the name, the reality show and all the press - it was a good meal, and I'd take it over Burgatory. It was only one visit though, so let's see if they can keep it up.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dhQOA8-FdpA6D0hNhXEYIw"
  },
  "Ohz_cjvjJVAchC1Dw7s3Bw": {
    "date": "4/28/2019",
    "text": "Impressed by the food, not impressed that fries are separate, I need my carbs without the extra $$$.  Also not impressed that Marky Marky and the funky bunch isn't playing throughout. Bathrooms were very clean, the service was great. If you plan on bringing the kiddos, go for it but leave the stroller behind, it's a tight squeeze.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SpjJFrRi0nltN9nd_7tLdA"
  },
  "aRcNG3P_k68i8s8R8_bLww": {
    "date": "8/10/2019",
    "text": "Yummy burgers and the loaded tots are my new favorite. Also excellent service and love all the outside seating.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x9-w8F4Cl9VVX2fMVtNa2Q"
  },
  "f6ZTxFGs1FBrd-ZYdzn9cQ": {
    "date": "11/5/2018",
    "text": "I would just like to take a moment to thank the Wahlburger brothers for creating some bomb burgers! My boyfriend and I went here recently for a little last minute date night and we got a couple fantastic burgers. The atmosphere when you first walk in is so colorful and makes you ready to sit down and watch a game over a beer and a burger. I ordered a double stacked burger with cheese, bacon, pickles, lettuce, tomato, mayo, ketchup, and mustard. Pretty plain Jane, but damn was it good. Definitely set the bar high for burgers for me. The fries were phenomenal as well. Our server gave us a side of their special sauce they make here, which was amazing! Whatever that sauce was, I'd love to buy a bottle of it and use it on all my fries in the future. On a side note, this place makes their own pickles too. Which is so cool, and they were to die for, especially if you're a pickle lover like me. I even got extra pickles on the side and ate every single one. Our server also talked me into getting a frappe, which is a fancy word for milkshake, and this milkshake was one of the best things I've ever put in my mouth. (And that's saying something.) She made it perfect. She told me she used some extra chocolate syrup and threw some crushed Oreos in it. My god, I felt so naughty eating that bad boy. She was so nice too, she gave us the whole run down as soon as we sat down about the specials going on, and about everything on the menu. She did inform us that their happy hour drinks are so cheap. Happy hour drinks are half price than the normal menu price, something to keep in mind there. This place is super affordable too, for my boyfriend and I to both get burgers, fries and drinks, it was a total of $39 and some change. Nothing beats great food, great servers, and a great price. The 3 elements to a perfect restaurant if you ask me.  I honestly have no complaints about this place, my boyfriend and I are taking all our family and friends out to Wahlburgers very soon so they can all experience their next level creations. Can't wait to come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "I4wplanZZZbL7rYPA7RVrQ"
  },
  "s4EYH8nZ5p_GZFLX4mUMbg": {
    "date": "4/26/2019",
    "text": "Lots of different burger choices. The service is always prompt and attentive. The Cornhole set right outside is a nice way to keep the kids occupied",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zC3Vot_HRlPfPhX7wUz6MA"
  },
  "a09H8S9wiV8nvbcER1HbSQ": {
    "date": "3/17/2019",
    "text": "Stop in for a burger. The place is clean and the staff was friendly. Service was awesome! The food was delicious, and the price was fair.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5OqfNQwdyRpCQgo8t-F3rw"
  },
  "My3ygQTyQ8fKMVDzLL1EiQ": {
    "date": "4/26/2019",
    "text": "We arrived during happy hour with 3 kiddos under 11.  The two moms needing Gin and Tonics.  Luckily we hit the Gin and Tonic Mother Load.  I had the Pittsburgh G&T and Rochelle has the  Cucumber.  Very generous pour! Our server was quite gracious and patient even cleaning up the obligatory kid spill right away! Impossible Burger? Great!  OFD burger? Great!  Sweet potato tots? Great! If we didn't live in California, we'd be regulars.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AMnlRNiwf8I1kFCLoPBsmg"
  },
  "cJSAWbbLy_R0ZUYl8qOyWw": {
    "date": "6/3/2018",
    "text": "I don't know why but I didn't have high expectations coming into this place.  I'm glad to say that it definitely proved me wrong.  I ended up getting the fiesta burger with sweet potato tater tots.  The burger was seriously delicious.  It was a bit spicy, just the way I like it.  The tots were perfectly cooked and they give you a solid portion.  Overall, this place has great food at a good value and I'll definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_hsruQCw6UTnjlQiuSpScg"
  },
  "yNIBb1Cl4FDYOF63Pgxtrg": {
    "date": "4/9/2018",
    "text": "I need to start by saying... I love NKOTB & Wahlburgers so I didn't expect to dislike it !!!! :) I was sooooo excited to give this place a try. I've heard they can have a sizable  wait so we chose to go around 2 on a Saturday afternoon and were seated immediately!   The atmosphere is bright (they offer outdoor seating but it was still too chilly) and everyone we dealt with was extremely friendly and offered their suggestions as far as the menu!   I ordered the BBQ Bacon (Donnie's fav, which it indicates next to all three brothers) and it was delicious! I don't usually order a burger when I'm out to eat, but this one was made perfectly and very good!! I got sweet potato tots which were YUM (who doesn't love tots?) and my bf tried the French fries which they recommend dipping in their Wahl sauce... wow! That stuff is addicting and GOOD.   Yes, it's a little touristy and people may doubt the food... but to me, the quality, price, and atmosphere was all great! We'll be back ! :)",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "o7e-6SZOJ1opCD14MveH6A",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/o7e-6SZOJ1opCD14MveH6A/o.jpg"
      }
    ],
    "user_id": "ZF95rAgWIoaTtJqlarLTaA"
  },
  "zz0ZnUBfLjbDYFeMUDONCQ": {
    "date": "11/24/2018",
    "text": "Ordered the OUR burger with no tomato and added bacon. Took a few bites and realized no onion or bacon, and a huge hunk of tomato on it. Wasn't in the mood with having to deal with to get them to refire my order. Bun was over buttered. Tots were nothing to write home about and not that hot. Usually I am that crazy person that loves ALL sauces, but not today. I could just barely stand the wahl sauce or the house made bbq sauce. Server was friendly...despite totally whiffing on my burger order. I was so hungry walking in and left without even finishing my meal. Oh well...overall disappointed.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dh40VdmptP-W0Y9XqBrZEw"
  },
  "qn4t3hhD0EMNWcw8oFlwWw": {
    "date": "10/31/2018",
    "text": "Service was great, the Paul's favorite burger was just ok, Mark's Turkey Burger in my opinion probably the best thing on the menu. Lots of better choices for burgers in Pittsburgh, especially for the wait times on the weekends.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4L4LU_X-IJE6josAe0-V0A"
  },
  "l7yfIU3rktytoUHbXYyIkw": {
    "date": "1/27/2019",
    "text": "The food is great and we didn't mind the wait to be seated, but the wait time for your food was a bit long.... 30 minute wait for burgers? And server was not too friendly or helpful.  Also ... be prepared to have all your clothes smell of burgers and onions! Wahlburgers should hand out free dry cleaning coupons with their receipt. There has to be a ventilation issue as the entire mall smells of it. And I mean REALLY SMELLS of it.  Thinking we will wait until summer to go back and sit out on their outside deck to spare us from the stink.  Low stars for atmosphere and service.  Wish I could give 5 because the food was so good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DOCGmd56z0MBxPwxuV88_Q"
  },
  "eolcCnyuBTAXWaBYVu-z-Q": {
    "date": "3/25/2018",
    "text": "Marking another one off my list at The Block. I was worried going here on a Sunday night at 5:30 would be a bad idea but there wasn't a wait at all. Regardless, I decided to just sit at the bar to watch the Kansas/Duke game.  It was seat yourself and had 4 decent sized TVs.   The bartender Brendan was awesome. Friendly, informative and made you feel right at home. Everything you'd want.  I decided to try a Wahlbrewski because why not!  It was okay and that's about it.  Pretty standard.  As far as food, I really wanted that Double Decker Hotdog the very first reviewer had but was told there was no such thing. Even when I showed the pic I was told someone must have messed up...oh well!  Much like that reviewer, I have rarely seen a Sloppy Joe on a restaurant menu so I had to give it a go along with a side of Sweet Potato Tots.  Best decision of my day!  The portions were huge and I was beyond full when I left. High marks for the Homemade Wahl Sauce, Cheese Sauce and Dill Pickles! I'd order a side of Pickles next time on their own that's how good they were.  The Sweet Potato Tots are a great choice to compliment any dish and the Sloppy Joe itself was a perfect open faced sandwich with just enough mix of what your Mom would make and how a unique chef would fix it.  Try it out!  The prices are a bit high in my opinion, $8.95 for the Sandwich, $3.50 for the Tots and $6 for the Beer.  I'd like to see a side come with the sandwich but to their credit, the side was enough for at least two people. There had to be 50 Tots in there.  Overall, I liked it a lot. Between the friendly atmosphere and service I received and how much I enjoyed the food I ordered, I'll be back to explore more of the menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MzmGTcxgDLdKD4Cw1OIl6Q",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Mom&amp;#39;s Favorite Sloppy Joe and Sweet Potato Tots",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MzmGTcxgDLdKD4Cw1OIl6Q/o.jpg"
      },
      {
        "img_id": "7ZKS6R5uGCj5QQ0GFj9TJQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7ZKS6R5uGCj5QQ0GFj9TJQ/o.jpg"
      },
      {
        "img_id": "NNINFkZpHW_5JCqJ2U1Siw",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NNINFkZpHW_5JCqJ2U1Siw/o.jpg"
      }
    ],
    "user_id": "wzItnkHTHKNqJESMSTEYJg"
  },
  "CfwYmiJsTvORM089zAXeeA": {
    "date": "5/25/2019",
    "text": "The Mac & cheese with bacon add chicken was super dry and pretty inedible. Good thing the dog will eat practically anything     Dad's chili was pretty bland but the burgers and the deep fried pickles were AMAZING!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2qR-X1dvfbtkD1uiFEfhxA"
  },
  "mXu5-mgNZmR3pE9X8yiIaQ": {
    "date": "5/2/2018",
    "text": "First off Vegetarian yelping friends They have the impossible burger! I was in the mood for a hearty burger often a challenge for a vegetarian I had heard seen the sign for Wahlburgers on McKnight saw such mixed yelp reviews but figured might as well give it a try.  It's in a mall The mall was closed I almost left there were no cars in the lot..but looking up I see Wahlburgers all lit up and their outside porch TVs were on So I head in take the elevator up...and there is Wahlburgers  Warmly greeted I sit in a booth Instantly my friendly waitress is there to help me I explain I'm here for that impossible burger she assures me I will love it As I'm waiting I'm brought a yum little cup cake with green sprinkles Then some sweet potato tots omg are they yum They taste sort of maplely.  Waitress made me a cherry coke float a perfect side to my burger  And let me tell you about my burger I tweaked it's original menu suggestion  So mine has American cheese lettuce tomato and their burger sauce The burger was So good  The atmosphere is casual there was a tv showing Wahlburger info it's cute And there was a tv with Baseball on All the chairs are green so maybe Donnie's fav color is green? Great service yum food this burger place is an easy five stars. I'll be back for sure",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k55-QGGiZwKI0l6mY2w_lQ"
  },
  "7JVAkChfZFbU9TwMHaohgg": {
    "date": "3/10/2018",
    "text": "I wanted to try Wahlburgers for the obvious reasons...the celeb owners and TV show. It did not disappoint! The prices are so reasonable...$8 for a decent burger. Burgers, fries, tots, onion rings, Mac n cheese were all delicious! Def try the sauces...wahl sauce and Jens sauce both had great flavor. The service was wonderful, waitress was super friendly! We got our food pretty quick which was a plus. I put our name on the waitlist through the yelp app before we arrived so we only had to wait about 10 minutes once we got there. Oh and get a cupcake, one of the best cupcakes I've had. All in all, I was impressed and will def go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Qe6DmpkN0Al8hNLjgaafog",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Our burger, fries, Mac n cheese",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Qe6DmpkN0Al8hNLjgaafog/o.jpg"
      }
    ],
    "user_id": "mu-GFiSWKmtqj2CduZP5wg"
  },
  "UMriE4kQkabFY8mbSCB6FA": {
    "date": "10/26/2018",
    "text": "So not impressed with Walburgers, and I had such high hopes it's so expensive and everything is separate. I got the fiesta with the turkey burger and it was so average I could of went to steak and shake for almost the same thing and it's 3 times less in price. Got an adult frappe and it was blah and my daughter liked the hot dog but not the fries and my mom got the chicken salad and it wasn't worth it at all. Won't be coming back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YA4rt_AzaD59hVBcMDEJ4A"
  },
  "4nUQE5TDbWWIQryqcTZQSg": {
    "date": "5/18/2019",
    "text": "Yummy!! Great waitress!! Enjoyed the bacon Mac n cheese. My husband got the Our Burger. Incredibly good. Ended the dinner with the adult hot fudge sundae. Ok. Delicious!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kt4kEE6v9LSpF6V7GVf83A"
  },
  "8UC09jcfgeLVgDz5MMLM7g": {
    "date": "3/11/2018",
    "text": "Amazing!  Burgers are delicious, Mac n cheese is the best ever!!! . Fast service, great atmosphere.  Only thing missing was Donnie!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7JIm-L0jvYn0QZN0DPj36Q"
  },
  "eEutiF2T6yWzd024d8f7XA": {
    "date": "7/26/2018",
    "text": "Had lunch here yesterday. Service was very good. Our waterless was very good and even noticed my order was wrong before I noticed she had it corrected immediately. As for the food it was tasty and large portions. I had a Cobb salad  my wife had a bbq hamburger salad. We split an order of onion straws that was more than enough for two. The only thing I did not like was the silverware it was one step up from plastic. We sat out on the terrace. Nice weather very pleasant. Would recommend trying it sometime",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RwQxIaWU1czchKoWnL8Xxw"
  },
  "KNwz3HtSfgXw3gkhYU-0rA": {
    "date": "3/9/2018",
    "text": "Good food, a little pricey only because you have to buy everything individually, like fries don't come with burgers",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TloxN6efzR37EN-mHicxjg"
  },
  "AmumWPF1nF8ucsN396poFg": {
    "date": "1/21/2018",
    "text": "We visited twice and both times it was just ok.  Nothing very special or memorable.  I was expecting more.  Sweet potato tots were tasty if you like those.  I really don't understand all the buzz?",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WP4fxh1_O7JycFmeIntw_w"
  },
  "9dHDaz1doBBaAi75hsHiDg": {
    "date": "3/2/2018",
    "text": "This is a great spot for a casual lunch or dinner.  We avoided a hour-ish wait by checking making a reservation on Yelp beforehand, which really helped the overall experience.  The location was smaller than I had expected, but we were seated within a few minutes.  The burgers are very nice sized - a burger and a shared order of sweet potato tots were enough to leave my wife and I stuffed.  I got the OFD, and really enjoyed the burger.  The meat was well seasoned and the tomato jam was amazing.  I got the jam on the side, and it made a perfect dipping sauce for the tots.  The prices are great, and the burger stacks up well against many of the higher priced burgers I've had throughout the city.  Go in with realistic expectations, and you won't be disappointed.  This is a great casual burger in an convenient location with a price that's tough to beat.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wKgQ0PSsI2Pib61OduWDmQ"
  },
  "Wc7kk5c398qwh-63NYT0eQ": {
    "date": "6/14/2018",
    "text": "Would give this 3.5 stars if i could. The service was pretty good, friendly staff. The bathroom was dirty, I expected a little more to start with that. Overall, the burgers were good, but not awesome. The fries were thick, and pretty plain. The sweet potato tots were average. Altogether, everything was good but probably not something I would come back specifically to seek out and eat. Nothing on the menu jumped out and said HEY this looks great! I had the BBQ bacon burger. It was on the smaller side, but the avocado spread was a nice addition. My husband got the fiesta burger. The meat was good and quality just not packed well and falling apart in his hand. The prices seem to lineup with any other burger place, since the sides are separate, it still evens out to be the same price as burgatory. I had low expectations going in, and it didn't really exceed them.. if you want to say you went here just because then this is the place for you.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gKU45Tq9JJ9Z7HiZChu3ew"
  },
  "Cw8I9XSwUHbOHwYwsu8RXQ": {
    "date": "8/20/2018",
    "text": "Good food but service was horrible. Overall it would be about two to three stars at best. The menu options was ok. The burger good but the sides not so good. Mac and cheese was lacking flavor. Frys ok not very good. Hard and overlooked. Service bad. Not to busy and can see why. Skip and go to five guys.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AnzzRrBXuQerbmkK1S5yPg"
  },
  "tf5Cpasl23rRIH-l_Z3FLA": {
    "date": "8/17/2018",
    "text": "My second time here. Burgers and service was good. Apps not so much. Just skip the apps and eat the burgers.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1s3O5T4_iKkPfka4dNn_4g"
  },
  "W5dC_kT38XXfzTmw9JZx5g": {
    "date": "7/5/2018",
    "text": "Great burgers (get the Paul sauce)  and a nice homemade macaroni salad. Finish it with a cupcake.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nQyZDb0Qy0vZnhmWJQqyZw"
  },
  "pgXhtnYgQ4CbAEol2jJwQA": {
    "date": "6/3/2018",
    "text": "Went for lunch and was pleasantly surprised. Had the fried pickles and sweet potato tots. The bbq bacon cheese burger was delicious and had a kick.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AJ6oDR8G5eVbOLMvlZpKeQ"
  },
  "o7kEaQ-gnUGesYnhlz6n7Q": {
    "date": "2/12/2018",
    "text": "Very disappointed food was below average  Service was great (only reason for 2 stars) Burger = below average  Hot dog = awful Milk shake = McDonald's  This place will not last long not even in same category as Burgatory I would put it below steak n shake and 5 Guys way below them",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ujuSvPtjixVaqLbTj5YfhQ"
  },
  "sq-QRvNZERoNCPggwn4cFg": {
    "date": "2/12/2018",
    "text": "My husband and our 2 kids went there. We love that they use the no wait app. All of their food was amazing and reasonably priced, good portions. My husband had a double cheeseburger and it was super cheesy. I had the grilled chicken sandwich with onions and it was very tasty as well. The sides are good portions. My son had the Mac n cheese and it was SO good! We will be going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6eGkgCqWuQGwSwHmjDnZ7Q"
  },
  "8-OrgGOXZJ5auYK2qix_tg": {
    "date": "12/28/2017",
    "text": "First-highly suggest you check the wait list, and join before going during peak times. We were lucky to grab a table at the bar, and bypassed the hour+ wait.   My daughter and niece proclaimed the burgers to be the \"best they've ever had\", and judging by the lack of leftovers-they were correct!  I've heard others complain about poor and/or slow service--we had the direct opposite. I highly recommend you try to get \"Jillian\" as your server! She was prompt, and super friendly! The best!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JdKGFluwS24afjIX9NQ8ww"
  },
  "pkL5uFiN1_I4_JLW9MrBvQ": {
    "date": "8/7/2018",
    "text": "Food was good. I was hoping to have the pierogi smash burger that was shown on the television show but it was not on the menu. I was so disappointed not to have the combination of Pittsburgh with a Wahlburgers burger. I then settled for the original melt and a side of tots. Both items were delicious. The atmosphere is okay.. the restaurant is in a section where it is alone. There is spots for shops just not current businesses so when you enter on the bottom floor of the building is feels somewhat abandoned. You can tell that the area is in the processes of revitalized so I'm sure it will be better when more businesses open.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_r2QZ48jn2OLt4zM8llYIA"
  },
  "6pP1149LrpzxI84NeRqC1g": {
    "date": "2/2/2018",
    "text": "I'm not sure how you make a burger taste like nothing. I don't mean lack of seasoning, but nothing. Not beef. Not meat. It was like chewing on a dry, flavorless disk of sadness and broken promises. I've had better dining experiences at a high school football game. Service was pretty good. Friendly. Attentive. Food needs some work.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fV8MY8HvNZLx6JcSeDcQdg"
  },
  "SJRw1S8jH_bmnsAyR5M-rA": {
    "date": "1/31/2018",
    "text": "Had the Our Burger. It was ok, nothing special.  It comes with zero sides, ordered a side of fries, they were ok.  The draft list only had 5 items.  Overall the portions are small, the food is fair and the decor reminds you of a McDonalds.  I'll not be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HeSqgDJM9mCUm-WMI-_ZSQ"
  },
  "acEnKSwAgI2D1615uZUYcA": {
    "date": "9/4/2018",
    "text": "Boy was I disappointed in this restaurant. I was looking forward to going because it was new and everyone was talking about it. So I go with my girlfriend and her family, and we order an appetizer of wings, and it took over 20 minutes for them to be brought out, on a day where the restaurant was only half full, and they screwed up the flavor of the wings. Then, they screwed up my girflriends mother's order and my order, so that's 3 mistakes. I ordered the sloppy Joe which had no flavor to it whatsoever and the waitress was very inattentive and couldn't seem to care less about serving us. I was never offered a refill on my water which was empty before my meal even came out. I'm very upset about my first, and last, visit to this establishment",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FjdqBXdPooTdoqTU5NLCRA"
  },
  "XgL3vXIm_PXHTB2OdbxvxQ": {
    "date": "6/15/2018",
    "text": "I am not a vegetarian.  Just trying to eat better si I got the impossible burger Walhbugers vegetarian burger. Yummy!!!!! I would eat that again. It was like eating any other burger. My sons got a super melt and like it as well. The fries were crispy and the staff friendly. If I have one issue it would be the price. The burgers do not come with fries or a side of any kind. And $31.00 for lunch for 2 people is a little pricey.   It will come back for dinner maybe.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bI9wGaTMq8qwwkmRmDAYig"
  },
  "tGpxYtuhpKCjoeiAtzDh6w": {
    "date": "1/19/2018",
    "text": "The burgers were ok, not awesome. The sides were hit and miss. Tater tots were a hit the onion rings were a miss. The mac & cheese was a hit. The service was a miss. Very poor service . I'd probably go back to try something different. The atmosphere was very noisy and tables were very close together.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xbpzsib5PAM52SGpSL1gbw"
  },
  "95T6I5MsT45KUuLUHd7oKw": {
    "date": "12/29/2017",
    "text": "Great burgers good price.  Service a little bit slow but definitely attentive.  Sitting in the bar is a good choice to avoid a huge line.  Definitely not the best burger of my life but for the price point it's just right",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tbJImLqHOXL-X7KKe17zIQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tbJImLqHOXL-X7KKe17zIQ/o.jpg"
      }
    ],
    "user_id": "HBu3G0IGSpms_LtwfYHXKA"
  },
  "2hxq6k0TNP-Sm0b0lYhpXA": {
    "date": "4/4/2018",
    "text": "This was my daughter's choice for her birthday. We had the Chili, Smahlburger, the Melt and Mac & cheese - Everything was delicious! The hostesses were nice & efficient. Jess F. was our server. She was friendly & knowledgeable. Food order was perfect & quick. Brian brought out our food with a smile. We would recommend and return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wiCetoG05F6SPHK6pIRlLA",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Happy Birthday Bailey!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wiCetoG05F6SPHK6pIRlLA/o.jpg"
      }
    ],
    "user_id": "oPaTPnJu4zZ8Pux3BPtUvQ"
  },
  "_7LkXJfY21EfotAvWLXLqA": {
    "date": "12/27/2017",
    "text": "The interior design is very low budget, I have seen better looking McDonald's. The fish sandwich was very good .",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1oLh2jIrkf6tnctJPjZ6Wg"
  },
  "bkyQR24IRhaRBuTcj2E0Qw": {
    "date": "12/27/2017",
    "text": "Went there last Thursday around 1:30 and there was a 30 minute wait. Once we were seated, we were greeted promptly and the server explained the menu. It took about 45 minutes from the time we placed the order until the food arrived, but we chalked up the long wait to the kitchen still getting in the groove after the recent opening. The food (two burgers, sloppy joe, tots and fries) was very tasty once it arrived. If you hate waits, I'd say give it 'til early February 2018 before checking it out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wAz0RsknHRZPPnTJi24l6A"
  },
  "v2IcswUF_7Dmyl-ufe26yA": {
    "date": "1/5/2018",
    "text": "This was our first time here. We were going to get a table. There was a 30-45 min wait not too bad considering it was 5:30. We sat at the bar to wait for the table but decided to eat at the bar instead. At first the two bar maids were a bit slow to get us drinks. But the 5 or so min wait was well worth it. They both were very nice and attentive. I am one I don't want to wait forever for a drink. They made sure I was not waiting for my next drink. My wife and I both got burgers she got a single and I did the double. We got fries and onion rings. The food was really good. We both really liked the onion straws. The fries were not the best but were just ok. We will definitely be back. The surprising thing was it was reasonably priced.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "pE2RL3v_DN76ugwQEH3f8A"
  },
  "2I5mNoAO3hXSiS6qsNJbDw": {
    "date": "2/16/2018",
    "text": "After all the hype, I was very underwhelmed. The food was bland and the menu was boring. Maybe it's just because they are new and still learning? Although, I did enjoy the tater tots. I'll try again in a few months.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2S61ofO9qwiaFbVb6cCNpw"
  },
  "OX86lWCqWRGEm_dwWn6sfg": {
    "date": "12/23/2017",
    "text": "We only waited 13 minutes AFTER we were seated for someone to come to our table. 20 minutes AFTER ordering, I was told they were out of onion rings. 40 minutes AFTER ordering, we were told they were out of mac and cheese for our 2 kids. I had high expectations that were crushed. There are way better burgers elsewhere in the North Hills.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "53j1GcmV24pKUKPC5KsWdA"
  },
  "XtWSQ97KbDRA8Khufh0NXQ": {
    "date": "3/30/2018",
    "text": "This was our first time visiting a Wahlburgers.  Our server, Jill, recognized we weren't comfortable in a booth and suggested we move to a table.  Her service was quick, she was very bubbly and made suggestions from the menu.  Because of that, my husband changed his mind and was very pleased.  We didn't have to wait for refills and all food came out quickly.  You will be lucky to have her as your server.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MQqw3m9WkGrHyuPivP_7lQ"
  },
  "vst8-vLQyCuRe3JnHyoccw": {
    "date": "9/24/2018",
    "text": "Went here for the first time today with my mom and 3 kids. It wasn't busy and the hostess told us she would be right back to help us then never came back and we saw her helping some tables. I had to ask someone else to seat us. Then we walked past the hostess who said she would help us but didn't and i heard her mumble some not so nice things to herself. Our waitress was friendly but only came over to bring or food. I had to flag her down just to get a little more water. Service took a while. Kids got burgers and they were good. I had a salad and it was average. Overall not a fan and i will not be back. There are plenty of other places to go. Don't waste your time. Go to burgatory",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M22IFmi4HD3IKxTVUg_Llg"
  },
  "lTz5tLcmoT_QDbjrKXY4iQ": {
    "date": "12/23/2017",
    "text": "Waiting over an hour for Burger and tater tots. Don't go here unless you have a lot of time to waste",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kqgn5JbHb1evY1q02TfvxA"
  },
  "vRlaVxPPBWxenlK6nCMSFQ": {
    "date": "1/22/2018",
    "text": "First, I would recommend using the no wait feature on here. Went here on a Sunday night and got put on the wait list. Got a table pretty quick though. I got the Our Burger. It was very good. Kinda like a less greasy five guys with Big Mac tasting sauce. I would go back for the sweet potato tots. Fresh out of the fryer and crispy. Positive experience and a place I would recommend despite only 3.5 stars on here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "39r3Gu2bUNLuNln6QaJwlQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Our Burger and sweet tots. Yum.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/39r3Gu2bUNLuNln6QaJwlQ/o.jpg"
      }
    ],
    "user_id": "4M8Nw1gfZ0aaSacEkaL2NA"
  },
  "tkq2r27XUYLUPdG3RK2GVQ": {
    "date": "12/23/2017",
    "text": "Good Try Wahlburgers but your going have to do better in this foody City.We are spoiled with lots of good burger joints.From the Start:30 minute wait to be seated,another 50 mins to get our Food.A burger that is thinner than the thickness of your finger is not a burger.The \"Onion Rings\"aren't Onion Rings more like Fresh French's onion toppings.My chicken sandwich had the Onion Rings on it as a topping but you can get them as the side as well? WHAT DA HECK is that lol.This is nothing more than a gimmick and celebrity driven idea.Dave and Busters will be the competition when that opens and Wahlburgers won't be any more than a 1 and done thing.I wouldn't recommend to any burger Enthusiast and I see PITTSBURGHERS only eating here once.Average at Best and Manipulative Marketing.I don't like fast food but I'd say a step above fast food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "oIHHyx13_fRTkNJDpvb-Hw"
  },
  "OHBWPIQEGQQ540UeqP_jhQ": {
    "date": "3/20/2018",
    "text": "My wife wanted to visit and had planned on it a long long time ago if we were to go visit where I grew up in southern New Hampshire we would go to the one in Boston area. I grew up with The New Kids on the Block and Marky Mark and the Funky Bunch. Then it was announced that this was opening up in the area and made plans to come eat at Wahlburgers. We had a little bit of a wait but we knew we would with the specialness of the place and how new it was. We got seated at a booth but it was too tight for me and the wife so we asked for a different table and were moved without hesitation. We ordered and waited and we got our order it looked really good. But my son who is picky saw black specs on his hot dog tweaked and wanted something else. Waitress got him something else and seemed like she didn't mind and cared that he wasn't happy. The burger was excellent however it was not gourmet. Price was not terrible and overall value was good. You have to expect with a famous co owners that it will be more about the experience of being there rather then just the food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Rrb_vSI8YjYniUGRR9YBuw",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. A sign hanging just outside of Walburgers in the mall on McKnight road.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Rrb_vSI8YjYniUGRR9YBuw/o.jpg"
      }
    ],
    "user_id": "B8FijaxziOAMazN46rzD3Q"
  },
  "RxYDv2E94VJ22w006VdvFg": {
    "date": "1/18/2018",
    "text": "Very new, clean, and tasty. Wish the fries were a little better. I would definitely come back. My babe loves burgers and so do I. Worth the trip for sure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3yqfsTxMeoSNxFY4JGkD4g"
  },
  "vVStKGOadYfweH8t_h16wA": {
    "date": "3/19/2018",
    "text": "We first went to Wahlburgers shortly after they opened. It was mid-day during the week so there wasn't any crowd. We really enjoyed our food, but our waitress just wasn't very good. Don't get me wrong, she was very friendly, but once we got our food we didn't see her again until she brought us a check. I was hoping she would swing by because I wanted a refill on my water. But she never came back to check and see if the food tasted ok, or to see if we needed anything.   Since we really did enjoy our food, we went back a second time. Our waitress was much more attentive. She even gave us some Wahl sauce to try with our fries. So far my favorite thing I've tried was the chicken sandwich. But the next time I go, I've got to try the Mac and cheese.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K7cZrsJ-hSs_rbg7z6T0Ag"
  },
  "RwMH_FFf0rWzS-exnbj32Q": {
    "date": "3/19/2018",
    "text": "I LOVED how much the servers knew about gluten allergies and what of their products were safe for me to eat! Thank you for being prepared for people with food allergies!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XlJmQaoRT-ckxYEIg8MB8w"
  },
  "fNErEQuu8BUpunGXPSUpyQ": {
    "date": "1/7/2018",
    "text": "Had our first visit to Wahlburgers today. Of course, there was a wait for such a popular restaurant. It was definitely worth the wait. Fast service, absolutely great food and very inviting environment. We will be back with friends and family. Great job!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cM7V7XJHFo7VpSyMrnS3yg",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Looking good so far!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cM7V7XJHFo7VpSyMrnS3yg/o.jpg"
      }
    ],
    "user_id": "ZbO05faYF-KO3aKpM-da_Q"
  },
  "8M6cm1FZGRkORXeSZEVVbQ": {
    "date": "9/14/2018",
    "text": "Service was terrible and slow. Sat down at the bar and It wasn't very busy at all. The bartenders were very lackadaisical. It took the bartender about 15 minutes just to take our food orders. I ordered the original melt and It was on the smaller side. My girlfriend had Paul's Choice burger. It was average. If the service was better I think I would have gave the food another chance but I won't be going back here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZYBdK5bV0BpBBBoDUePM0w"
  },
  "iMH_k_RDzq7I8AsNSm4UfA": {
    "date": "1/2/2018",
    "text": "I wanted to like it here. The burgers were good, reasonably priced. The sides (French fries & Mac and cheese) were not good. Fries were cold and starchy. Mac and cheese wasn't much better than boxed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6XajMxdcbiHHlvrD8z_Xlg"
  },
  "DoRV23r5Aa0ZOOxdhGvilA": {
    "date": "7/28/2018",
    "text": "We had to wait about 35 minutes to be seated on Saturday around dinner time. To be expected. Our waitress was very friendly. Had to wait a little while for our food and drinks. But that was all OK. I had the sloppy Joe and it was very underwhelming. Perhaps I am a snob, but my mother made the best sloppy Joe's and this was not even Close. It was very under season and it was slathered on top of a piece of white bread. Then topped with a rather Tasteless cheese topping. Perhaps the other items on the menu are much better, but I would never order this again or recommend it to anybody.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Uj9sfrifTsBRsadwwXAGDg"
  },
  "1QvGy9Ir4znM3FROytj7Vg": {
    "date": "1/27/2018",
    "text": "Im so glad Wahlburgers are finally in Pittsburgh Pa! Hope they open more in our Area! I had lunch at their Boston restaurant and tell you what was great Their thanksgiving Day burger its a killer! Their onion rings& Almas Macaroni Salad reminded me if my Aunts family picnic one. I would hope Donnie or Mark walk through door! You'll be satisfied eating here there portions are huge!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HgORY_l-za-s4_uwsvybFg"
  },
  "trduBYJuXLLo6-z6d5-26w": {
    "date": "8/18/2019",
    "text": "I just don't understand the hype at all.  Food was mediocre at best.   Previous reviewer said think Wendy's but priced no wait Wendy's is better.  It really is better than this place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kNGcVjvQC7ZGS8eJxBJZVQ"
  },
  "pjedVO0IL9422xtPR9rJPA": {
    "date": "6/3/2018",
    "text": "Wahlburgers exceeded my expectations. I went in thinking it would be just an average burger joint, with all of the hype generated by the owners being who they are. However, I was wrong. From the moment that I walked in the restaurant, to the moment that I walked out, I was impressed.   The decor was simple but branded very well to reflect the Wahlberg family. The service was very fast and all of the staff was super friendly. The menu is very easy to read and it's not overwhelming, like some restaurants can be. I liked how a lot of the sauces/dressings are all made in house. We did not even have to wait long for our meals to be served after our orders were placed.   I ordered a BBQ Bacon burger with fried pickles. I ordered a side of the signature Wahl sauce and ranch to go with my meal. The quality of the sauces and the taste complimented the pickles perfectly. My burger was cooked to perfection (medium) and was very flavorful. Our waitress was very attentive to our needs and provided us with exceptional service.   We ordered the grilled banana fluffanutta for dessert. This was one of my favorite parts of the meal! I would highly recommend trying it, if you save some room after your meal.  Wahlburgers truly exceeded my expectations by far and I will be returning in the future to taste different items on the menu!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 8,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "GJ3Xhr66UjxBw5EzD-WAGA",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Fried Pickles",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GJ3Xhr66UjxBw5EzD-WAGA/o.jpg"
      },
      {
        "img_id": "JtOZQrHatKJalb3Ho0ulGQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. BBQ Bacon Burger",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JtOZQrHatKJalb3Ho0ulGQ/o.jpg"
      }
    ],
    "user_id": "wrsj5oMHsRzouMNuZlatbg"
  },
  "98en52fnUQp6MM2-NWr9wA": {
    "date": "2/3/2019",
    "text": "This was our first visit to the Wahlburgers in North Hills. After reading the reviews and failing to make an impromptu visit a few months ago, we decided to check in via the Yelp app so we could get on the list. Turns out this was a great decision because it was a 60 minute wait time when I checked in on the app. I was glad to not stand around for an hour after arriving at the restaurant.  When we checked in at the restaurant, there were only 3 parties ahead of us.  We were seated about 10 minutes after we got there. The chairs were metal, but strangely comfortable. The server came over right away to get our drink orders.  The hubs got a tap beer and I opted to try one of their spiked frappes, which was called the Hot Fudge Sundae.  When the frappe came out, it was pretty huge. Lots of fanfare with the icing and jimmies on the rim. The taste definitely was spot on. Both me and the hubs enjoyed the flavor. After the drinks came out, the server took our food order. Hubs got the BBQ Bacon burger, I got the Our Burger, and we split an order of Onion Rings.   The first thing I'll say is that the Onion Rings are not rings. They are those onion strings you usually get on top of a burger at that \"other\" burger joint. Because of this, they were a bit difficult to eat and I wound up using a fork. They were cooked well and tasted yummy, but they were definitely not rings.   The burgers were tasty as well. The meat was seasoned well and the burgers were the right temperature. The BBQ Bacon burger had only a very small amount of BBQ sauce on it, so the hubs requested more and our server brought it right over. The one negative about the burgers is they are pretty overly greasy. This caused the bottom bun to tear and disintegrate, which made it difficult to eat after a few bites.  The service was spot on. I was nervous because some of the reviews stated the service was not good and the accuracy on orders was lacking, but we definitely did not have that experience. Our server knew it was our first visit and was very helpful on explaining the menu items. She also provided us great attentive service throughout the meal.  In the end, it wasn't the best burger we've ever had, but it was a solid 3 stars and I'd say the excellent service would bump the entire experience to a 4 stars. While we may not make a point to visit again, we will definitely have it on our list if we find ourselves in the North Hills area during mealtime.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7J6tPUjl4iJWBd8rPH3-Xg"
  },
  "sOHJcY4XiXxWLcw8-vi4HA": {
    "date": "7/29/2019",
    "text": "So much better then I thought it would be! Crisp, hot fries, juicy burger with perfect bacon and tomato jam... Best was service. From host to kitchen to server, everyone was so friendly and happy you were there; often lacking in PGH - especially is casual dining. Bravo to management here. Will be back. FYI, good prices on wine and beer...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "5iTdaHwTbms9D-Th3DNweQ"
  },
  "alasBCiw-QB2_nXsblVGmQ": {
    "date": "11/13/2018",
    "text": "I have only done take out from Wahlburgers so far. I liver pretty close and it is convenient to get to from my house. I have ordered from takeout several times. I always have ordered the same thing. Hamburger with bacon lettuce and tomato and french fries. Although generally the food is just warm at best by the time I get it home it is still really good. The french fries are delicious and the burger is always cooked perfectly. I will definitely continue to get food from Wahlburgers. I will definitely also make a effort to actually eat there so i can review the staff and service. Im sure that if you eat there and the burger is fresh off the grill it is much better.",
    "rating": 4,
    "rated": {
      "funny": 12,
      "useful": 18,
      "cool": 16
    },
    "photos": [],
    "user_id": "hg71CGHy9bwpgY8cGVVg4w"
  },
  "nM7Ury4T40-qYQJG3hBrqA": {
    "date": "8/11/2019",
    "text": "House burger: very good taste. Buns are good sauce is good it's all around a good burger. Fiesta burger: perfect amount of spices. Meat falls apart just right. Sauce on the bottom bun is a good choice. Small kids burger is perfect size and it's good! Took us 30 minutes to get here and yes I would make the trip again. Get tots to share, it's a big bowl! App of fried pickles were fresh and yummy",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KNXxj8Dv8nKnA5SGPi4C_Q",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KNXxj8Dv8nKnA5SGPi4C_Q/o.jpg"
      },
      {
        "img_id": "bLg1kYwlrr2TD-JCQeM37w",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bLg1kYwlrr2TD-JCQeM37w/o.jpg"
      },
      {
        "img_id": "oVv7a55sLrgbpny9pZnsWQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oVv7a55sLrgbpny9pZnsWQ/o.jpg"
      }
    ],
    "user_id": "5qv33bqMl9n9o1utAbtL_w"
  },
  "XV9kzA_2gP-RbhIwL5puOw": {
    "date": "4/26/2019",
    "text": "My wife and I ate there on 4/25/19.  I had the burger Wahlbowl and I could not find an onion, tomato or pickle in it and it just seemed like a chopped head of lettuce (not mixed greens) and the tiny bit of dressing added no flavor so we basically had a sliced burger on a pile of lettuce - bland! No flavor. My wife had the arugula / bacon / apple bowl / and more, she added chicken and said the dressing was \"horrible\" we both voted not to return the couple we were with told us the same thing the next day, bland, boringly awful. Dano",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "17vpJ7OLEUw01qlL7uewOw"
  },
  "R0fInD32f8oUGD-ftfIZvA": {
    "date": "7/18/2019",
    "text": "Walked right in and seated immediately tonight (Thursday) at 5:30. The place was busy but not packed. Our waiter was so friendly and service was very quick and efficient. We tried one of the mixed drinks the waiter suggested (sorry can't recall the name - but it was good) also ordered the queso and chips (I would recommend as an app) and it was delicious. I had the OFD burger which I ordered medium well cause I am a picky person when it comes to red meat and how it's cooked and it was cooked perfectly for me (cooked through) and my son had the Southwest jalepeno burger (sorry if not proper name of menu item) and his burger was amazing. Overall a great experience and would recommend and can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-wBBkmjzotmVqSYNZeoL3g"
  },
  "J8DXBSnL--D6ZUW4edPeVA": {
    "date": "5/18/2019",
    "text": "I went during lunch on a weekday. It was not busy. Which was perfect. The food was great. I had bacon cheeseburger which is my go to where ever I go. The wahl sauce is amazing. The onion strings are a must have. Bacon Mac n cheese I had a taste but it bought it for my nephew and he loved it!  I can't wait to head back in July to go again and try something else! Thank you for the great first time experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4XebtvKrOaWyUS5JfxxUkg",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4XebtvKrOaWyUS5JfxxUkg/o.jpg"
      },
      {
        "img_id": "9GDr8uC3n6ratZbaxkVMgQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Store front",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9GDr8uC3n6ratZbaxkVMgQ/o.jpg"
      },
      {
        "img_id": "OXvpiKWuKDS6sx1qJ02RTg",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Cook station",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OXvpiKWuKDS6sx1qJ02RTg/o.jpg"
      }
    ],
    "user_id": "Pi_yOeVTUBrldOqXqO8FiA"
  },
  "OoOW8zIEeOSTb_RJ9wVKsg": {
    "date": "10/14/2018",
    "text": "At dinnertime on a Friday, there were 4 tables occupied with a sprinkling of customers at the bar.  I ordered a hamburger with barbeque sauce, jaleponos, avocado, bacon & government cheese.  Yes goverment cheese, which brought back memories of my grandmother's grilled cheese sandwiches.  I asked if a house salad was available, was told it was recently taken off the menu but one could be made.  I also ordered a side of onion rings.  The house salad had spring greens, cucumbers, tomatoes, and purple onions.  The Italian dressing was flavorful.  I had the avocado and jalapenos on the side.  The sandwich bread was smooched and disappointing. The bacon was crisp worked well with bbq sauce. I am not a great cook but my hamburgers are juicier and tastier.   The onion rings ... it appeared that an entire purple onion was sliced extremely thin, battered, thrown in the deep fryer, and never shook up.  I received a giant clump of onion rings.  My server suggested either the ranch or house wahl sauce for dipping. The ranch was thin and tasty. The wahl sauce was similar to thousand island dressing.  Both worked well.  Had the onion rings been sliced thicker, it would have been easier to eat.  I did enjoy the family's filmography on the ceiling.  My server was attentive.  Ample parking.   It just didn't work for me.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "rxw9BOhbTzVUP5rvd5Acdw"
  },
  "0PM4pBEjvEJvgOuNhPDaGg": {
    "date": "9/28/2018",
    "text": "Over rated and over priced. I was very excited to try this place out and I guess I had higher expectations.   The cocktail selection was just ok, I had a pineapple chipotle margarita that was drinkable, but hardly any liquor (I'm a bartender and there was not enough alcohol at all I couldn't even taste the triple sec) my girlfriend ordered an additional shot to add to her drink. I then followed with a strawberry jalapeno margarita that I sent back because the puree/ mixed they use was horrible. It taste like a spicy ass lipsmackers lip gloss drink. #yuck.   Because it's so open and echo-y it is very hard to hear the sever and she could barely hear us too. It was pretty cool looking though they had a light fixture of some sort that has all the movies the Wahlburgs have been in.   Our appetizer was fried pickles that weren't all the way crispy and even missing breading from the pickles them self. We both ordered a burger and we had fries and tots for our sides. I noticed there is a bin near the POS that is filled with containers of ranch, ketchup, mayo, etc sitting on some ice I believe. I found this to be very cheap and cheesy looking. If I'm paying $12 for a burger I would like just be around a little more class. The ranch didn't taste like ranch but a dill sauce. It was edible though.   So we get our food, it was ok, edible and not horrible. I got the bacon blitz cheeseburger (I was so hungry at that point I didn't take a pic lol) and my only complaint is when I bit into a piece a HUGE end piece of the caramelized onion was in my mouth and because it was the end, it was very hard and completely off putting.   We get our check and find out they charge separately for the fries/tots. I'm sorry but WTF kind of cheeseburger is sold WITHOUT FRIES. And $3.50 to boot! For POTATOES?! I dunno, If it was a classier setting I wouldn't of minded but we were sitting on chairs that weighed less than 5 pounds LOL. Our server was new and a sweety pie, but overall I probably won't eat there again. There are way better upscale burger places.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DF3pL8EatKCBfsF0ok1qYw"
  },
  "uoqGAB6m5VIt11VBUQ0qcQ": {
    "date": "9/7/2018",
    "text": "I stopped by here a couple of Sundays ago with my wife for dinner.  We were craving burgers and Wahlburgers happened to be nearby and so we headed on over and arrived to the restaurant at 7:15ish.  Since it was a Sunday they actually close at 8 and so the restaurant was decently dead.  There was a large bar area up front with both high top tables and the bar.  Behind that is a dining room and finally there is an outdoor space as well which is where we chose to sit.  There were a number of TVs tuned to sports and both my wife and I were able to watch the Yankees game which was on.  For dinner on this day I decided to go with the BBQ bacon Wahlbowl with a side order of French fries.  The menu describes the BBQ Bacon Wahlbowl as 1/3 lb burger, white cheddar, bacon, fresh jalepenos and homemade avocado all tossed with mixed greens and a housemade bbq dressing.  Both my wife and I were excited that they made the Wahlbowls as it felt like a healthier way to eat a burger.  It came to the table within a reasonable time period and looked pretty good with all of the ingredients displayed on the top.  My burger ended up being cooked nicely here and I enjoyed it paired with the cheddar and bacon.  Meanwhile the jalepenos gave the dish a nice spice and I did enjoy the  mixed greens underneath. As for the BBQ dressing, it was pretty sweet and so while I didn't mind it, any more probably would have been too much.  That was a little bit of a problem too as by the end of the bowl my greens were feeling a bit dry.  Still, I enjoyed this slightly different take on a burger.  The bottom line for me is that I would head back here again in the future.  I was impressed by the reasonable prices here and love the idea of burger bowls.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "4m9NXICYBC5i9t4aTt-I6w"
  },
  "hps8wOUxu_DeaRsvZV_LPQ": {
    "date": "5/19/2019",
    "text": "This was our first trip to Pittsburgh, and our first experience at a Wahlburgers.  We had several great days helping our son move in, and we really enjoyed our meal experience at Wahlburgers.  My son and I had the Our Burger (excellent!), and my wife had the bacon Mac and Cheese (which son and I kept \"trying out.\"  Outdoor seats were very nice, great food, great prices.  We definitely recommend!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VzwB8TwnU5uUZuPrZuK8Ew"
  },
  "lM_tRcpXicurIgidllGoqA": {
    "date": "4/9/2019",
    "text": "Wahlburgers is a good restaurant with a cool atmosphere when in the mood for a burger! If you go on a weekend, make sure you use the \"NoWait\" app as there is usually always a wait. The burger salads are my favorite here, paired with one of their Wahlcoctions!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r35IgvyOy-6A30ieweQUGQ"
  },
  "S13UCQBJlgT6IvADWuYtTw": {
    "date": "3/2/2019",
    "text": "I'll give the food a solid 4 stars.  Burger was good and greasy with plenty of flavor.  Now, let's turn to the menu. It is virtually uncomprehensable.  The \"make your own burger\" section offers a 1/3 lb (5.3 oz) single then a double which is 2, 3 oz patties.  2 x 3 oz = 6 oz....a full 2/3 of an ounce bigger than a single????  Then there is the triple which is 3, 3 oz patties of 9 oz.  I wanted the 8 oz burger that is featured in their gourmet burger section, but that is not available in the make your own section.  The waitress (who was helpful) said just order a gourmet burger and we will make it any way you want. ?? Well why isnt it offered in the make your own section.  So she puts in a Fiesta burger at the gourmet burger price and then just has it made with lettuce, tomatoe and onion.....at the gourmet burger price?  What did I just pay for? A basic burger or a gourmet with nothing on it?  I then asked....what comes with that. Nothing, I'm told....sides are all ala Carte at $3.50 a side....  Ok, so a $15 burger with fries? And 2 hours later, I am still trying to figure out what I paid for on the 8 oz burger that is not available.....  She asked if we wanted dessert.... I said \"pass....I need an engineering degree to get a burger....dont need a doctorate to order dessert.\"",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "jnn4g_Ydkj152omk17L7Rw"
  },
  "ri6Z5TEnJ3LgPmiso2k8qQ": {
    "date": "7/28/2019",
    "text": "Anticipation from hearing the hype and it was  barely average at best. In fact, we went two nights in a row to be fair and again barely average. Imagine double the price Wendy's, actually not as good as Wendy's. My family and I will never go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JOrfN5J2VwiPQ5pKoixn_A"
  },
  "lJ-qCMFnWVhqz7PfGfUGgA": {
    "date": "4/3/2019",
    "text": "So I've waited a while to write this so I could properly do it justice and be honest without the excitement of the Wahlburgers brothers...I have been here about three times and each time I am wowed...I had three different burgers the first time I was here...the impossible burger, the double decker and marks thanksgiving burger and the last two times I stick to my favorite which I'll reveal a little later....first things first the decor of the restaurant is awesome with an laid back atmosphere.  Love the green chairs (actually wish I could just get one) and the decor has all the guys films on plus a sprinkle of Pittsburgh here and there...I have to say the burgers have a lot of thought and care and love put in to them and you can taste it in the sandwiches.  The impossible burger had a cheese that brought out the flavor of the burger and the sauce was a little spicy which livens it up a little bit...the impossible burger was a treat because I couldn't tell the difference between it and a regular burger...(now the Wahlburgers propriety blend you definitely can tell) it was also on a bun that had a semi toasted taste which made the burger pop!  I believe that this burger used its toppings and sauce to stand out and give it the taste unique to the Wahlburgers menu....the thanksgiving burger was not bad but definitely not my kinda thing...it was good but I have never been a fan of squash and the cranberry sauce...the burger was tasty and a great turkey burger patty definitely different from other turkey burgers...it was worth trying once but I'm definitely moving in to the Paul favorite burger the double decker....I will start out saying yes ilthis is my favorite burger and yes I think it's one of the best that I have ever had...the bun is a pillow of buttery goodness which almost has to be potato Roll and the toppings well executed with lettuce and tomato on it with the government cheese and fresh pickles it also has a juicy patty that isn't dried out and it melds together like a symphony of flavors....the sides I got were good we got the sweet potatoes tater tots and the smoked macaroni and cheese which is hands down one of the best Mac and cheeses I have ever had...the Pablo crumbs and the bacon is a great flavorful addition but the show is definitely inside the cheese sauce which is a creamy white mix that also has a smiley flavor which makes this a star of the sides at Wahlburgers...I can't say nothing bad about it the star power is there but the food, atmosphere and the family is all presented....got to meet the old lady gang here that was in the show and they are the most down to earth people you could ever meet....love this place hopefully there will be more built making their way towards Greensburg pa!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4MhP6pquLSlkj112SFw2ng"
  },
  "_OjaR2obtjVYU6R8_ZRxIg": {
    "date": "3/5/2019",
    "text": "We watch the wahlburgers show faithfully, and have anxiously awaited our visit to the Pittsburgh location (we used to live here, and came back to visit from out of town.). It was definitely worth the wait. Love it! Great food,  great location!  Hey guys, can you put one in the Harrisburg location?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "3xDVNoWkUiQHQ8OnXiz9qQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Lunch with Wahlburg&amp;#39;s",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3xDVNoWkUiQHQ8OnXiz9qQ/o.jpg"
      }
    ],
    "user_id": "UO1w5vVfm7f3-29L59KB9Q"
  },
  "JQ8NCfqMlXvoX0K5V9yMqA": {
    "date": "7/23/2019",
    "text": "Atmosphere is open and casual. The waitress was friendly. The first appetizer, chicken buffalo dip was sent back, I mimicked cat food. The second appetizer was quest, it was okay. The salad was descent, good greens and chicken. The original burger was small but good. The Mac n cheese was nothing to write home about. The garbage can in the bathroom was overflowing paper towels. I doubt I will be back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SY8kU4kFBDekW-Q0F1Ld1g"
  },
  "ppcjlrcOlDkQwkrHBZyErA": {
    "date": "3/28/2018",
    "text": "I have watched Wahlburgers, the TV show in the first season and so when I was looking for a lunch spot and saw that it was close by, I decided to check it out.   The venue is in what appears to be a new, upcoming location for dining and shopping - The Block. The restaurant is on the 2nd floor and is large, open, and airy. The color scheme is green and Black.   They had just opened for lunch and I was greeted and seated very quickly. My waitress, Christine, was extremely friendly and pleasant. She asked if I'd been here before and when I told her that I had not, she proceeded to go through the menu with me and explained the quality and type of meat used in the burgers. She then took my drink order while I made up my mind.q  I decided to try the sloppy joe. I'm sorry that I didn't try the Wahlburgers. It's not that the Sloppy Joe was bad, it just did not suit my taste. I think it might have been the addition of the cheese sauce and the Wahl sauce that was a bit off putting. I also prefer my Sloppy Joe on a bun instead of a slice of bread - but that's just me. The Thin Crispy Onion Rings were just that! They were hot and full of flavor, however, the house made pickles were a bit sharp tasting for me and I did not enjoy them. Beneath all of the stuff on top of the Sloppy Joe, the quality of the meat was excellent. Next time, I'll try their burger.   I don't know about the other servers, but Christine was great. She made the experience worth my trip even though I was overwhelmed with the flavor of the food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wqh9-9b6gRmMutKO5blzRw",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wqh9-9b6gRmMutKO5blzRw/o.jpg"
      },
      {
        "img_id": "dmidgX6iGk9CkdhcolMKRg",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dmidgX6iGk9CkdhcolMKRg/o.jpg"
      },
      {
        "img_id": "igiqzJp3Y-Ldnd6zTCZ6IQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/igiqzJp3Y-Ldnd6zTCZ6IQ/o.jpg"
      }
    ],
    "user_id": "5rFExUOgge71jv5U_ywSdQ"
  },
  "8mZh0v-3I4Dbtt4WCS37rg": {
    "date": "4/4/2018",
    "text": "Omg.   They should stick to acting.   Absolutely awful.   I'm no a picky eater but it sucked.    Onion rings???    Is that what those were ?       The ranch dressing was so overwhelming with oregano that I couldn't eat it.   Never again thanks",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3KttkCmFJx2VG7pvdkR4Vw"
  },
  "vxDuYkf7L5XrNv_m7MYy7Q": {
    "date": "11/11/2018",
    "text": "Had great service last time. Very accommodating to vegans. I would say that this is a good place to go with the family. It's not overpriced. The desserts are good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UtbNG832UudLHBG844QGYA"
  },
  "IWewHCnt6den1D-iY4JK0g": {
    "date": "5/11/2018",
    "text": "Very little good to say about this place.  So loud, you can't hear across the table. The service was extremely slow and I think he called us \"boss\" at least 45 times. Burgers were wrong, had to ask multiple times for sides. Definitely will not be going back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kmuh4BCDYvVNibwc-9ihlA"
  },
  "LwhHGiOD_R5BJC5UkWet0w": {
    "date": "2/25/2018",
    "text": "Decided to go here with family for a quick lunch. Checked in online and waited 10 mins after we got there. It was more affordable then I would have imagined. Food was good, but burgers were paper thin. Guessing most ppl go for the hype of it being on a TV show. We went right when they were opening so wait staff was a bit scattered but service wasnt too too bad",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uk1CJ-rDJ3RiudNfjc-w_A"
  },
  "NmovNIesTqWgweEkIJCTCw": {
    "date": "12/31/2017",
    "text": "I've been to the Wahlburgers in downtown Orlando, Florida and thought it was very good, so was glad to hear that they were opening a restaurant here in Pittsburgh.  I went on a Saturday afternoon, so expected the place to be packed, and it was.  I was by myself, so I took a seat at the bar as it was a 45 minute to an hour wait for a table.  The bartender, Brendan, was quick to give me a menu and pour me a Wahlbrewski.  I ordered a double decker burger with mushrooms, a side of Yukon Gold fries and a side of Alma's Classic Macaroni.  It took about 1/2 hour or so for my food to come, but again the place was jammed.  The food was great, awesome burger done just the way I like and of course the \"government cheese\" makes it!  Alma's macaroni was very good....Kudos to her as I assume it's her own recipe.  Brendan was a good server and did a great job considering he was taking orders AND manning the bar.  I wasn't expecting things to be perfect since the place just opened and I'm sure the staff is still adjusting and learning the ropes, but I can say that I wasn't disappointed.  The restaurant was bright, shiny and spotless, and the staff was very friendly and welcoming.  Now, since I live in the South Hills, I'm hoping they open another restaurant closer to me.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "nGI9D-1aEqoIjtu7L028LQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nGI9D-1aEqoIjtu7L028LQ/o.jpg"
      },
      {
        "img_id": "CEFqUBvLM2t69O9cOQcW_g",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CEFqUBvLM2t69O9cOQcW_g/o.jpg"
      },
      {
        "img_id": "ke9-h85iTZ-We8SQfNvBvA",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Wahlburgers Pittsburgh - December 30, 2017",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ke9-h85iTZ-We8SQfNvBvA/o.jpg"
      }
    ],
    "user_id": "hLmUotRbX1i27e3ac18XfA"
  },
  "vSG1v3TxADVF3KP-bNV_ng": {
    "date": "12/18/2017",
    "text": "This Wahlburgers was a long time coming!!! After anxiously awaiting its opening, today was the day!! Since the grand opening isn't until January, today's opening wasn't advertised so it was nice to experience the environment of the restaurant without all the chaos of a full dining room. Our server was amazing. I tried the white wine sangria (which she recommended) which was a great blend of fall flavors you don't usually expect in a sangria. To eat, I got the sloppy joe and chili cheese double dog (actually a double decker hot dog!!!) with a side of sweet potato tots - I had to try as much as possible because I just couldn't make up my mind! I loved the idea of a sloppy joe at a restaurant and this one did not disappoint! It was open-faced and topped with onion straws and cheese  The chili cheese double dog not two separate chili cheese dogs, but instead one giant chili cheese dog with 3 pieces of bun and two whole hot dogs! It was a challenge to finish after the sloppy joe but I'm always up for the challenge!! The sweet potato tots were a perfect addition, and I would definitely recommend adding them to whatever you decide to try!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "mlCv1XF4WdneNaIGJ9r1PQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mlCv1XF4WdneNaIGJ9r1PQ/o.jpg"
      },
      {
        "img_id": "2NslQKKz72c4SGIy68DblA",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2NslQKKz72c4SGIy68DblA/o.jpg"
      }
    ],
    "user_id": "FxrSWuB-FBJuCckdnf9zPQ"
  },
  "KMaIGJaPnv_LpXHg2kAmSQ": {
    "date": "5/6/2018",
    "text": "This has to be the best burger I have ever eaten. I got the Walburger nothing special just pickle, onions and Walburg sauce. It was cooked perfect hot and juicy. My wife had the portabelo salad awesome. Will be are go to place when I'm in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZHTU3Pnk30JY72BGUxOdKw"
  },
  "jXHkLS49MVVdrmK2d5Wblw": {
    "date": "12/27/2017",
    "text": "Burgers are great. Fries are good. Sweet potato tots are awesome. Service just awful. The service is gonna ruin this place for a lot of people before it even takes off. Service is slow and the bartenders have very little knowledge of the products here to top with a lack of \"service industry common sense.\"  Common sense such as providing silverware, ketchup, and remembering your glass of wine... oh and knowledge of the \"Wahlbrewski\" such as what the ABV of it is. Hoping for improvements with their grand opening because the burgers are really great. They also need to fix the stocking issues as well they've been out of the \"marks favorite\" turkey burger both times we've been here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Alzt_qkrh__Oo7NOG-iDvQ"
  },
  "U06tQMovlfwMspmfbcjdYQ": {
    "date": "3/13/2018",
    "text": "The sloppy joe did not disappoint! Plus I got the tater tots loaded with 4 cheese sauce & chili & it was only $5.50! Great price & size! Simple food with a kiss of gourmet flare. The waitstaff was incredibly friendly our waitress had a great personality so that made it fun. I purchased a souvenir shirt says 'Mom's Favorite' cracks me up since there are 4 kids in my family and we are all tied for last.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fzHxHbgtTzSGX_0OeDnx0Q"
  },
  "Y2zlZKoFQxuGJNO-D9bJMg": {
    "date": "12/21/2017",
    "text": "So for just having opened - it was actually very smooth!   They took our name and number and said it would be 60 to 90 minutes.  Immediately got a link that took you to Yelp and showed your place in line and we were 22nd.  In actuality it took about 40 minutes until our table was ready.  The waitress was very nice, forgot a couple of little things - but again, they JUST opened.  It probably took about 30 minutes for the food to show up, we all got burgers, and they were all good. 2 of us got their \"house\" burger and 1 got their Swiss mushroom burger with bacon - called the OFD - all were good.  We each ordered different sides, thin onion rings and tater tots that were good, Mac & cheese that was excellent and macaroni salad called Alma's that was was so-so.   I had a beer and 2 soft drinks - the bill was $56.  I'd definitely go back, but probably not a super regular stop.  They were far more together than I expected for a restaurant that just opened!  All staff was very friendly - again to be commended for a new place!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "71GrNNuS0JKgIHzjZnybvw",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/71GrNNuS0JKgIHzjZnybvw/o.jpg"
      }
    ],
    "user_id": "NiUHJ0VsJ3WpIHd2WSyeuA"
  },
  "WTtbLr1nCJsmV4OisO3AHQ": {
    "date": "3/11/2018",
    "text": "I thought the food was very good! I went shortly after they opened, so there was a bit of a wait. Which is understandable. I'll be back for sure .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_6Jy0ZH6nqh2k2iefGfYBA"
  },
  "gNR4pCH0vwFwA8rtIOXncw": {
    "date": "4/21/2018",
    "text": "Over priced, burger with no sides. Food served in paper containers, like a fast food restaurant. Burger just average. Atmosphere cold and steril.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AuWDyGZuuCizI40eJZ1GUQ"
  },
  "Zu7HzVeQh28wwyL-j8kyGw": {
    "date": "2/17/2018",
    "text": "Happy hour is half off drafts and cocktails , very very small menu. Service was good, not great.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oWScCjC0lzAo2WOXuWnJNA"
  },
  "z5DAPgok7AU6axnuIHDHGg": {
    "date": "3/4/2018",
    "text": "Eh, service was great with a friendly staff, though they don't take any to-go orders over the phone which is kind of a huge bummer. The burgers and tots were OK, but not really worth the price but I did love the open faced sloppy Joe! Was worth stopping in at least once.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ER4DgaTW7Diep_0NHMFn5w"
  },
  "vn5fbzTkP3oHwoUVnV0tjA": {
    "date": "1/10/2018",
    "text": "The burger here was just average. Really nothing to make me come back. The fries that accompanied my burger were cold. Asked for water with lemon and the water tasted just awful. I love Marky Mark, but maybe he needed a funkier bunch to make this better.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "21W8iTZGWdCk1utgudcToQ"
  },
  "CPUnH0YLjYG6KGC9IzJC8w": {
    "date": "10/9/2018",
    "text": "Been to this place several times so far. This is a great burger place in Pittsburgh! Especially when you're craving fresh great quality delicious burgers and fries. I love their tater tots as well. I've personally tried \"The Our Burger\" and another time I had the \"Crispy Haddock Sandwich\". Everything was cooked to my like and I had mushrooms on my burger which was great. The prices are reasonable. The atmosphere is great. I loved the interior design of the place; they have the names of the movies that Mark Wahlberg appeared in written all over the ceiling. Creative! We've also enjoyed watching a football game while having dinner outdoors.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qLfQliFpncXgrpbkN4DoIg"
  },
  "v3ObC_DKLZGBz7OkOsMj-Q": {
    "date": "4/6/2018",
    "text": "I had the Portobello Sandwich and onion rings. The sandwich was delicious! But $8.25 for a small sandwich with no sides is too pricey. I also had the onion rings which were good. My biggest issue with Wahlburgers is the seating. This may just be the most uncomfortable I have been in a restaurant. The seats are terrible. I fidgeted trying to find a comfortable spot the entire time we were there. Would give 2.5 stars if that were possible.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "blJAwjYRbpYdxfDNnWCqcQ"
  },
  "jg7RKpzK7ZVKyGeTwpai8g": {
    "date": "4/5/2018",
    "text": "Thought the food was mediocre at best.. I went there when they were first opening and the service was absolutely terrible. I watched them serve my food to the table next to us, saw those customers touch it, notify their server it wasnt there food.. the server took the food back to the kitchen and tried to deliver it to me about 30 seconds later as if I didn't notice..",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SLplikliqP8V6lzg0PPU4Q"
  },
  "D30ylXjlJ_8wyBVnjcJ-9g": {
    "date": "12/23/2017",
    "text": "Very disappointed my daughter had a burger it was very thin and greasy I had portobello sandwich very small for  the price. Mac and cheese was good.The waiters and staff were very nice service was very good Portion are small and pricey.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "y81W3JvlqJx8RidLCXUnBA"
  },
  "MuXRrd7caoPOcz57wher3Q": {
    "date": "11/7/2018",
    "text": "The burgers are good but you have to get onion strings or potatoes separately. A little pricey but I will definitely go back.  Hope to see Donnie",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0F6eAJyT_6mB6Y1qSrOE7g"
  },
  "LAizJIePZxeX8U-UnLM0mA": {
    "date": "8/2/2019",
    "text": "My family went on a weekday evening for dinner. The place was pretty full of people and the atmosphere was noisy. Had to speak loud if you wanted your group to hear and there were a lot of 'what?' And repeating going on. Not a good place for conversation. There are TV's all around the place with various sports games playing. I ordered an Impossible Burger and I couldn't believe it wasn't meat. The burger was flat and irregular and came with caramelized onions. The waiter didn't seem to know which burger was what either so I had my husband taste it and he said it wasn't meat. I did enjoy the burger however in other restaurants I've had a thicker Impossible Burger...more bang for your money as these plant based burgers are pricey. Everyone else enjoyed their beef burgers. One person got a salad. There are other options as well such as a portabello mushroom sandwich. Fries are available to order as a side and do not come with the burgers. This seems a little off putting but I never eat all the fries anyway so my husband and I shared an order. Biggest disappointment was the onion rings... they were not in fact rings but the shoestring thin style.  Overall a good place to have a burger and watch sports.  What???? BURGERS AND SPORTS! Oh, cool.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_Qha_SiNiHwDw5cXQGFCig",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Impossible Burger",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_Qha_SiNiHwDw5cXQGFCig/o.jpg"
      },
      {
        "img_id": "xC9FZWaMYKQxV738ZU2ZJQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Poutine",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xC9FZWaMYKQxV738ZU2ZJQ/o.jpg"
      }
    ],
    "user_id": "-zoKnhRd4Knnj_P-qO0GPQ"
  },
  "8SsMjBF9uRLgZ7G5365N0g": {
    "date": "7/11/2019",
    "text": "I was close to giving Wahlburgers three stars, but it isn't quite there for me. There's honestly not much to say and overall the entire place is just incredibly average.   The quality of the food is alright, but the prices are equal to or slightly higher than most other restaurants in this category. From the exterior, it looks like an airport restaurant - the sports bar atmosphere is fine, but the seating isn't particular comfortable. Our server was moderately attentive and pleasant, but definitely not setting the world on fire.  I didn't hate Wahlburgers' food the same way I didn't hate \"Daddy's Home,\" \"The Italian Job,\" or \"The Other Guys.\" There are much better options in the area, but you could also do worse.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BCvKoQbOVvSPydzQDaiAEQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. The super melt!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BCvKoQbOVvSPydzQDaiAEQ/o.jpg"
      }
    ],
    "user_id": "Egji_XwjS4dykCjk8qoZWw"
  },
  "4E9UlNPvdEjuFYvx3JzpIw": {
    "date": "7/6/2019",
    "text": "Not impressed at all. The thing that makes me mad, is when you order a burger here, they charge you an extra 3.50 for your fries. Not to mention the burger tasted like a frozen patty.  If I am going to spend 13-15 dollars for a burger, I am going to burgatory hands down.  Skip this place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "_bW-L7-F4sqncxVrbqj5rg"
  },
  "hZSeUMrbZ8KezY6E4S2_uQ": {
    "date": "7/2/2019",
    "text": "I want to give it a five, but the service was horrendous okay that's harsh, but he wasted so much time, we sat so long. I enjoyed the company of my friend, but it was long beginning and end. We sat with out a refill of water or beer. Then we sat forever to get our check.  The burger was outstanding !! The Mac-Cheese with \" government cheese \" was fantastic!! Yes the food gets FIVE STARS  Highly recommend !!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "i-tEL-EJ4U4sP6Vj7-8F7w",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/i-tEL-EJ4U4sP6Vj7-8F7w/o.jpg"
      },
      {
        "img_id": "77xYT5lo7p38GnsU8iK4oA",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/77xYT5lo7p38GnsU8iK4oA/o.jpg"
      }
    ],
    "user_id": "3egcdazws_x1wW35jgXfNw"
  },
  "0ZYTSQLlyverOVs7nq3MVA": {
    "date": "5/30/2019",
    "text": "I was pleasantly surprised by the burger and look forward to one opening in Robinson, so I can try the turkey burger. I figured I had to get a normal burger my first time there. I love that the burgers and sides are separate, since I was pretty full and able to JUST order a burger. I did try a tater tot and a few onion strings and those were good, too.   Most of our food was properly prepared. My burger was overcooked, but still SUPER juicy, so it didn't matter. That was impressive. Service was decent and burgers were very good. We won't go back to this one, since it's not close, bu we'll definitely try the new location when it opens.  I also LOVE that they do NOT allow smoking on their patio. :-)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "b_DBF-5HIi_KLzhZJDw0kQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. entry",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/b_DBF-5HIi_KLzhZJDw0kQ/o.jpg"
      },
      {
        "img_id": "Q43UCkFXYS6tHxhfDS2Y4g",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. bar",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Q43UCkFXYS6tHxhfDS2Y4g/o.jpg"
      },
      {
        "img_id": "ommRARhC2ks39KCpg8Tjdg",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Corn hole",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ommRARhC2ks39KCpg8Tjdg/o.jpg"
      }
    ],
    "user_id": "ZnIaEvJwrxlBUjimIpx2Qw"
  },
  "QZoT56adNZcz4aAIt6CMlQ": {
    "date": "5/24/2019",
    "text": "We ended up at Wahlburgers because there was a long wait at Burgatory. Walked right in and were seated. They are on No Wait so I had checked prior to heading there so that was handy. I didn't realize they had outdoor seating (covered deck) so that was a nice surprise. It's overlooking the parking lot and road so don't expect a view!  I had the Our burger and onion \"rings\". This is a total misnomer. It says on the menu that they are \"thin and crispy\" but not that they are onion straws. That's what they are. I'm not sure why they don't just call them that. Maybe because nobody really wants an entire basket of onion straws? I think if them as a burger topping, not a side. And at $3.50 it was steep for a side. They tasted good but it was a bit strange. The burger was a burger. I wasn't wowed but it was good.   The kids menu had your standard fare and both of my kids had the chicken fingers and fries. The waitress brought out both honey mustard and their special sauce for dipping. The honey mustard was more mustard than anything but it was good (and she said homemade, which is a plus). The special sauce was similar to McDonalds but with a very, very slight kick. (Very slight)   Waitstaff were all friendly and draft beer was half off for happy hour. Not a bad experience overall but definitely not stand out either.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XeAgS4oPX5RgDAmq_-eq2Q",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Onion rings (straws. They should just call them straws)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XeAgS4oPX5RgDAmq_-eq2Q/o.jpg"
      },
      {
        "img_id": "KObNLFdCkSGHr5G4ebfocA",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Our Burger",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KObNLFdCkSGHr5G4ebfocA/o.jpg"
      }
    ],
    "user_id": "YEUSn63CFm79Cr3o0hTUtQ"
  },
  "5e0DOjEsaTuQ5JOPmmplhg": {
    "date": "7/30/2019",
    "text": "I have been to Wahlburgers in other cities and was happy to finally get to one near home.  My wife and I split buffalo chicken dip, fries, and the impossible burger.  All were delicious.  Aside from Burgatory, this was the best impossible burger I have had.  A lot of places do not do them right and you end up getting a dried out patty that does not resemble meat.  Wahlburgers was juicy and tasted delicious.  The buffalo chicken dip was just ok.  I love their fries with their homemade ranch dressing.  The ranch they use is different than most other places, very dilly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zuymDE5jHnYmRoqz0NQ0og",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Impossible burger, so good!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zuymDE5jHnYmRoqz0NQ0og/o.jpg"
      },
      {
        "img_id": "LwOr8iLM2Ey4wMY1cNk4Tg",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Buffalo chicken dip",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LwOr8iLM2Ey4wMY1cNk4Tg/o.jpg"
      }
    ],
    "user_id": "1u80DXuswfp7hFW2NN9B-Q"
  },
  "zBqShV7nBBBxzsHZ7VBgFg": {
    "date": "8/19/2019",
    "text": "At best! This place is mediocre and very pricey. $14 for the cheapest burger and fries. And just ok quality and toppings. I ordered a BBQ bacon  burger minimal BBQ sauce on it but jalapeno and avocado was tasty. The Wahlbrewski's were tasty but again pretty average as well. The service was good, our server was very attentive and polite telling us the many options available. This place is WAY over hyped and too many better options to spend $75 for a lunch. Too many better cheaper options to say I'd be back here again. Sorry Wahlburgs's you got enough of my money.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "xEPCi2YhQiKKgvUj9CJKng",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. BBQ bacon burger minimal BBQ",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xEPCi2YhQiKKgvUj9CJKng/o.jpg"
      },
      {
        "img_id": "FehomLuY8j14Spkjcl_1Gg",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Wahlbrewski",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FehomLuY8j14Spkjcl_1Gg/o.jpg"
      }
    ],
    "user_id": "4Arn_eExr-Sqs_yvYYLkPA"
  },
  "22EWC8W6RZMq-Kl_L8mSkA": {
    "date": "1/16/2019",
    "text": "We purposely waited for the initial hype to die down before heading out into the North Hills suburbs for a burger.  Let me say that it was good, pretty damn good and I'll even go as far as ranking it up there with my beloved Shake Shack.  My boyfriend and I went with two friends. Two of us had the \"Our Burger\", another had the plant based \"Impossible Burger\" and my boyfriend had the \"Pittsburgh Burger\" aka \"Smashed Pierogi\" Burger.  Our meat was cooked to our requested temperatures and the burgers were juicy and full of flavor. The government cheese really adds to the beef.  A basket of onion rings is enough to feed a family of four. No joke.  Split the \"adult\" hot fudge sundae shake with the boyfriend and it was yummy. Just the right amount of cherry vodka.  We made a trek specifically to check it out. As good as the food was I can't see leaving the city for another visit unless there's a need to head out that way and of course we'd eat there again.  Our server was a great kid, very personable. I liked that the manager made rounds to make sure customers were happy.  All-in-all a great experience.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "cR0W2mHyrR-5NfpDsiqWrw",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Enormous basket of onion rings.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cR0W2mHyrR-5NfpDsiqWrw/o.jpg"
      },
      {
        "img_id": "66CSeWGvBkd0hupTkWH27Q",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. The OUR Burger.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/66CSeWGvBkd0hupTkWH27Q/o.jpg"
      },
      {
        "img_id": "NvkI1UD427kOUjr2w6ICig",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Smashed Pierogi Pittsburgh Burger.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NvkI1UD427kOUjr2w6ICig/o.jpg"
      }
    ],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "Xt3lht3hsDX-dzueaATCzA": {
    "date": "5/22/2019",
    "text": "Was craving the impossible burger and happy to have found they offer it here!   We were greeted promptly and chose to sit on the outside patio. Our server, I believe Christine, was amazing!! We started with Jalepeno margaritas and buffalo chicken dip. The chips were seasoned heavily, which I love, and the dip was very good. I thought it could be a little spicier and thicker but it was still yummy.  For my order I obviously had the impossible burger. I couldn't decide between fries or tots so Christine was sweet enough to allow me to try both. She also brought out their homemade cheese sauce without us asking and WOW am I glad she did. Such a good tangy flavor! It's a must to accompany the tots. My burger was very good and tasted like regular burger meat. It was cooked perfectly without being over or undercooked. I loved the aioli on it! The grilled onions were a little much for me on top but I just took the majority of them off.   If you are in the mood for a relaxed bar setting with great sandwiches then this is a great spot. I must say Christine really made our experience complete!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eY8pzn82zhVO95vBi-mzkQ"
  },
  "iBJR6vtDDY4I8KXvrgPbjg": {
    "date": "5/16/2019",
    "text": "Probably my second favorite burger of all time! Had \"The Our Burger\" and it was done perfectly medium well as I asked for which never happens anywhere else. The house made pickles and sauces are the best. As a side I chose Alma's Mac Salad and it was nearly the best Mac salad you could ask for. Top this place off with a great happy hour special of 1/2 priced drafts and $5 appetizers and you can be sure to have a good visit",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1F2gIwvwXbJVxguC7EcpHA",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Spicy cheese and bacon tots!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1F2gIwvwXbJVxguC7EcpHA/o.jpg"
      },
      {
        "img_id": "lheErY0voagli_Q0WR-2jA",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Back menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lheErY0voagli_Q0WR-2jA/o.jpg"
      },
      {
        "img_id": "4Iv_XgRJdmyMquguM4LGCA",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Front menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4Iv_XgRJdmyMquguM4LGCA/o.jpg"
      }
    ],
    "user_id": "s7FBtkGnOX27D7mojaXmCA"
  },
  "GwueTuyjlVYqHqp3B-lLbA": {
    "date": "4/25/2019",
    "text": "This was my second visit to Wahlburger's. I enjoyed the first experience with a friend and decided to bring my sister. Sadly there were some disappointing moments to this experience.   The appetizers were a highlight of our experience. We ordered the Spicy Queso & Roasted Corn dip with Chips and the Fried Pickles. Both were flavorful and hit the spot. For our main course, we got the Jenn's Chicken Wahlbowl and the BBQ Bacon Wahlbowl. They were decent salads but nothing to write home about.   Unfortunately service was a low point. The server Wendy did not seem efficient. When she came by the table, she would tell us a special and then walk away without taking our orders. This happened several times and it took much longer than we planned for our lunch.   We did enjoy the Lemon and Carrot Cake cupcakes for dessert. That put a spring in our step as we walked out the door.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "n5_XcQybyT34wWAGfP5TQg",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Carrot cake cupcake - DELICIOUS!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/n5_XcQybyT34wWAGfP5TQg/o.jpg"
      },
      {
        "img_id": "njHbT2xZYbQmWqee213EZA",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. BBQ Bacon Wahlbowl",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/njHbT2xZYbQmWqee213EZA/o.jpg"
      },
      {
        "img_id": "xWpcxR4qr1NSdpDjIs8ULA",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Lemon cupcake",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xWpcxR4qr1NSdpDjIs8ULA/o.jpg"
      }
    ],
    "user_id": "pD_URrASN38VIween6V3Sg"
  },
  "zCISsAM84oOZpbRMD8kogA": {
    "date": "8/28/2018",
    "text": "Large menu and many options, but nothing over the top. My favorite items are the sweet potato fries and the fried pickles. The burgers are also very large!!!   The sides are not included with the burger and are different sizes if you order with our without cheese.   I ordered an iced tea and it was bland.  Waiters were attentive, but mixed up orders.  All AOK",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "a0NdI_KgHLyv2zfRxnBJWQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. All the different kind of potatoes and tots",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/a0NdI_KgHLyv2zfRxnBJWQ/o.jpg"
      },
      {
        "img_id": "qt9upW8J_oU65TXgiTAzAw",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. The Our Burger!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qt9upW8J_oU65TXgiTAzAw/o.jpg"
      }
    ],
    "user_id": "e7CcnU1sjv1BuBfbbGDZSQ"
  },
  "D7q06VlG9rOTcbOQBMmVWw": {
    "date": "6/15/2019",
    "text": "Solid food in a relatively competitive part of town. $5 wings at happy hour are solid but hard to pass up places like mad mex that puts out a wider variety of flavors half off during happy hour.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jB4QmB-EbBakSSX1jJXJ6A",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jB4QmB-EbBakSSX1jJXJ6A/o.jpg"
      },
      {
        "img_id": "MaSnG4llvXikJscyh8oNFA",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MaSnG4llvXikJscyh8oNFA/o.jpg"
      },
      {
        "img_id": "kas5VD6npmW9GPvIeqlaKA",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kas5VD6npmW9GPvIeqlaKA/o.jpg"
      }
    ],
    "user_id": "yBQ48jYofc1Ob2idVCZgEg"
  },
  "mEOeb9I18183FNhXbhqqFg": {
    "date": "9/8/2018",
    "text": "Quick sit down place to grab a burger, a brew, and some very filling sides.  I ordered the \"Our Burger\" which was basically a cheeseburger done their way, even though the Thanksgiving Turkey Burger was calling my name. Need to try the basics first! The burger was cooked to my liking, and the toppings were in good proportion. I did think the pickles were on the slightly thick side, but did have a nice crunch. The fries were alright, and probably would taste better if they they were served \"loaded.\" The thin and crispy onion rings were super delicious, and plentiful! Throw a few on your burger before you finish either of them!  (We took a bit of the onion rings home and had them the next day - reheat in a warm skillet)   Also not to miss, even with its silly name is the Wahlbrewski, one of their beer offerings. Our server said it starts like an IPA, and finishes like a Bud Light. I am not a fan of IPAs, but never tasted whatever IPA flavor it was supposed to have. It was a darn good beer and paired very well with the burger, and it tasted more like a lager than anything. They'll grab you a sample if you're not sure. Beer not your thing? They have plenty of other sodas, floats, and frappes to whet your whistle!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xbjr7me18eXmIKNsHCQs9g",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. The Our Burger, order of Onion Rings, and a Wahlbrewski",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xbjr7me18eXmIKNsHCQs9g/o.jpg"
      }
    ],
    "user_id": "WjsmRfQ_ruPazoZl_9AQcA"
  },
  "LENuWqE-ih-G-bFHs-qXgQ": {
    "date": "2/3/2019",
    "text": "Came here for the first time for lunch on a weekend.  Hubby and I ordered the spicy cheese and bacon tots as an appetizer.  I ordered the portobello mushroom burger and hubby ordered their Latin spice burger (which is seasonal).  Total (w/o tip) came out around $26.    What's hot - Quality.  Their tots and burgers are pretty good.  I've had better, but it's pretty good.  For example, my portobello burger had really nice caramelized onions.  The smaller mushrooms were nicely sauteed.  With the caramelized onions, the flavor was pretty good.  - Layout/location.  It's located within the mall, which is easy to find.  However, it's on the 2nd floor, so you need to find your way upstairs.  There's no outside entrance.  Inside is a pretty decent layout, as well.  There are booths, individual tables, and a bar. - Menu/variety.  There's something for everyone.  Again, there are veggie options.  It's not a large menu, either, which is nice.  Not overwhelming.  There are appetizers, burgers, sandwiches, sides, drinks, etc...  Everything pretty much fits on one page.   - Service is good.  They seem adequately staffed, but the restaurant wasn't full when we were here.  On a side note, I asked for jalapenos to be added in my mushroom burger (which is noted as a free add on, on the menu).  The jalapenos were missing in my burger.  What's not - Price.  For the amount they charge for their mains, it's kinda pricey.  For example, hubby's burger was $12 and doesn't come with a side.  You have to pay extra for sides.  For what he ordered, he wasn't full.   - Portions.  Decent.  The burgers are about the size of a McDonald's burger.  The main difference is the thickness/add ons.  It depends on what kind of burger that makes it filling.  The burger itself is not big.  Additionally, as I mentioned above, the burgers do not come with sides.  The sides are separate.   - Not spicy.  The spicy cheese and bacon tots were not spicy.  Hubby's Latin spice burger was not spicy either.  There was a veery light kick at the very end and it was barely noticeable.  My point is that if you're expecting a good luck of spice, you won't get it here.  Final answer Willing to come back, but it's not a first choice.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "LBL8jS62__XP3TviUXjhlQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Portobello mushroom burger",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LBL8jS62__XP3TviUXjhlQ/o.jpg"
      },
      {
        "img_id": "PP3vjssDoBw2JJ1ksZIaSg",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Latin spice winter burger",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PP3vjssDoBw2JJ1ksZIaSg/o.jpg"
      },
      {
        "img_id": "6AC7WHTwUQN_oqJ6LBjoLw",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Spicy cheese and bacon tots",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6AC7WHTwUQN_oqJ6LBjoLw/o.jpg"
      }
    ],
    "user_id": "eYUt3Va-5w-NrCBxD_PrFA"
  },
  "SpRrjTtfATHlO40MX7MmXA": {
    "date": "1/11/2019",
    "text": "Definitely a great Friday evening stop. We were hungry... in the mood for burgers and decided to stop at Wahlburgers again. We sat at a high top bar table and the service was great. Got my drinks at happy hour rate- Pittsburgh G&T was tasty and refreshing. Had fried pickles as appy- crispy and yummy. Ordered bacon burger- done perfectly w avacado and crispy bacon. Jalapenos added some zing to it. Sweet potato tots are a must have here. All in all a nice satisfying Friday Eve dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_QjD59tmEqzJCgdJ4X--cw",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Best burger I&amp;#39;ve had in a long time",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_QjD59tmEqzJCgdJ4X--cw/o.jpg"
      },
      {
        "img_id": "7dV6A59nO6Ccbu2CLstyFQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Sweet potato tots are amazing",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7dV6A59nO6Ccbu2CLstyFQ/o.jpg"
      }
    ],
    "user_id": "MKOKaGIY1SW9w3hdVO9Jwg"
  },
  "GVg8s8ihJ-vu09xsbQvoxw": {
    "date": "8/25/2018",
    "text": "I wish I was able to give this place a higher score because I did enjoy it and would be happy to come back but I do think three stars is what it deserves.   For a Friday night, we had to wait about 20 minutes for a table, which was shorter than we were expecting to have to wait- so happy about that!   Unfortunately our server wasn't all that great. The place was busy and she hardly ever checked on us. We ended up flagging a different waitress down to get us refills and sweetener for our drinks...  As for the food, I had the festa burger and that was delicious!! Would definitely order it again.   I also ordered a side of Mac N Cheese and that was ok. It wasn't hot when it was served, just warm. Would have preferred it to be hotter. Taste wise it was really good till I got to the bottom of it. The bottom few noodles didn't really have cheese on it. So tasted just like a soggy penne noodles. Sad because Mac n Cheese is my absolute favorite.   Despite a few of the negatives, I think I would come again, but not for",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y_W7DqTkLQ-8LBpd2A1Qag"
  },
  "rSvjFqo2InLKXF-ocRqBIg": {
    "date": "5/16/2019",
    "text": "Everything was awesome except my salad! :( Salads are described on menu to be \"mixed green\" , but my Wahlbowl was all Romaine lettuce, nothing but Romaine (not mixed green ), not what I was expecting or wanting. Our appetizer tots was delicious but it came in a freezing cold bowl (like it was meant for a crispy salad) (?)... Despite all that, Our server was great! The Wahlbrewski beer was yum ! Loved the burger on my salad and the BBQ sauce! I will probably come back to try again, but the bowls may not be on my list to order if all I get is Romaine lettuce. \"Mix\" the greens or \"fix\" the menu description!",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "P0XUWy8Zd1TLS3SyDe92pQ"
  },
  "PmixY_keHsfdZjNa0WgOSA": {
    "date": "2/15/2019",
    "text": "Had lunch for the first time here, and it was delicious. Walhburgers exceeded my expectations WOW very thing was so good! I had the BBQ bacon burger and a order of fries. The staff was all very friendly and food was so very good I will be back so so good!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "s2WgSrZl4jl6Wc6hfRR2Xg",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Dinning room",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/s2WgSrZl4jl6Wc6hfRR2Xg/o.jpg"
      },
      {
        "img_id": "t4SI4eYcb-2MNK_HKuhuGA",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. BBQ Bacon Buger",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/t4SI4eYcb-2MNK_HKuhuGA/o.jpg"
      },
      {
        "img_id": "vfpheLuYtSIKzWq5-pgjyQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. Merch",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vfpheLuYtSIKzWq5-pgjyQ/o.jpg"
      }
    ],
    "user_id": "v73Wcorml6AXZlBbCYLq8A"
  },
  "1taRYJOJ1fmYOP27jgovLw": {
    "date": "7/21/2018",
    "text": "My wife and I have been to Shake Shack, Culver's, Red Robin, Sonic, obviously all big chain burger places, and Walburger's is the best. The bun, the meat, the toppings, they got it right. Service is great,  so is the food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ADopLMlGdhs4rpO_Dfh9uA"
  },
  "mAp4JY7tHBhAlEXNjyNaOQ": {
    "date": "3/29/2018",
    "text": "Omg, seriously the best burgers in town! Something for everyone....vegetarians prepare to be amazed with the Impossible burger! The staff was super friendly and attentive as well!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yK_0MHaOzi4o1YBzCUQRxA"
  },
  "EJ2rJB5P2cs63BJbr4gfWw": {
    "date": "1/17/2019",
    "text": "Omg the best cheese burger ever..loved the atmosphere and our server Kayla was wonderful. Will definitely going back. Also they offer gluten free buns and fries are fried in a dedicated fryer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "chRNb8I4ALLRjrATXSM_0A"
  },
  "A1k7Q43Oc9Vlv-bF2cNlow": {
    "date": "7/16/2018",
    "text": "Love these burgers! Their service is amazing there and it's just worth every penny to go there. So much better than burgatory or brgr.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-YhStn1Sp8TGMNZDJ6Qj2Q"
  },
  "Y4FvVdhzCLD8F5ouIspNLg": {
    "date": "1/6/2018",
    "text": "I was looking forward to my first experience at Wahlburgers.  I was somewhat disappointed, we ordered the onion rings, which they were out of and never bothered telling us until our orders came out. We also did not receive our homemade pickles with some of our burgers. Utensil we're not supplied, until asked for a few times, also adult sized drinks at adult prices were brought to our table instead of kid drinks, at the kid price.  Overall would give it 3 stars, really wanted to rate it higher, but was not super excited about the experience..... maybe because it's new, but wouldn't travel over 1 hour again for the same experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kmk8xsO_RO66dUi9VwWa-g"
  },
  "O2JniZ0s3c4eQ7wzmJhtkA": {
    "date": "1/4/2018",
    "text": "I first eat at your restaurant while in Vegas and loved it! And now that you have a restaurant in Pittsburgh we have eaten there twice now.. Thank you so much for com I g to my hometown!! Steelers Nation",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7P62V_UUC1r2IRN0Z0SsaQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States. The Melt!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7P62V_UUC1r2IRN0Z0SsaQ/o.jpg"
      }
    ],
    "user_id": "xR0x15GUTC3gkyYWbjDQHA"
  },
  "vIfwP4VQfV-kK0GskWVciA": {
    "date": "7/4/2018",
    "text": "They have the best macaroni salad..OMG!! Burgers were average. But we enjoyed the sloppy joes",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q24ZdvjIQEIs16VyOYirvA"
  },
  "XLxh0OO93ca1ttyxy2Fb-A": {
    "date": "1/2/2019",
    "text": "Probably the best burger I have ever had! Was our first time eating here and I will for sure be back next time I'm in Pittsburgh. It maybe a good thing we don't have one of these near me because I think I would eat here every day!  The Best Burger I've eaten!   Definitely a must go!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JuFhHM3HtrS258-89vZ64w"
  },
  "ppO89GdJjVVaNK9sIDHpDg": {
    "date": "3/16/2018",
    "text": "Portions are very small, food resembles public school cafeteria I expected more from Donnie mark alma and...Paul  tonight I am going home to binge watch blue bloods in disappointment",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aSx3y-JnAc0GX6YL986ATQ"
  },
  "MQ9ZRiQzaIvKkUdJyBLE5Q": {
    "date": "12/23/2017",
    "text": "Upscale burger place. Very good quality and good service. New place with a large waiting time. Add yourself to the waiting list ahead of time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LvKkZd2iBVJKgdpvxGi63A",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LvKkZd2iBVJKgdpvxGi63A/o.jpg"
      }
    ],
    "user_id": "BmmgI2TR1WrQQmW0hr-Fag"
  },
  "oAX3XUoC8cmQDJFVtjU_Iw": {
    "date": "5/3/2018",
    "text": "While the place is new and cool... the food is overpriced and underwhelming. I did have a  Pretty decent fish sandwich there the last time I was there but the $3.50 side and $3 drink ruined that pretty quickly. I would rather go to denny's.  If you want to be dazzled by decor and don't care much for food quality or prices... this is your place. The staff is nice for now but that will  Change for the worse with time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TBjTIdYqhMdZeRJclSSGZA"
  },
  "wtl6nphRZO2BpTy5HGMJ1A": {
    "date": "4/16/2018",
    "text": "Got sick here both times I tried there about a month ago.  I hope they've improved by now.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CcvU8PIm1KoEXzds5Xhi0Q"
  },
  "FmWhO9GE2sFxZZtKYpU6mQ": {
    "date": "2/1/2018",
    "text": "After a 2 hour and 15 minute wait I was very anxious to try the food here. I got a double decker and added bacon and egg. It was very solid and comparable to Red Robin and Burgatory, but not as good as BRGR. Got mine with a side of tater tots which were good. Prices were reasonable and service was very solid and food cane-out fast. Burger wasn't that big, but it filled me up perfectly. Came well done and I would go back. Hopefully wait isn't that bad next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Vt9Mx7h4TdKp4QaZ5g4CaA"
  },
  "lyHQWt93JeyQap1NPbxdYw": {
    "date": "2/27/2018",
    "text": "This place is seriously bad. Visited on a Saturday at 3:00 pm....waited 45 minutes for a table after watching party after party being seated before us. They claimed it was because we were a party of 5 and couldn't find the space for us. So we laughed after we finally got seated (after a lot of complaining) and they pulled up that extra chair to put at the end of the table. Wow....what a great idea!  When we got our food, they came over and auctioned it off...yelling out the orders and waiting for one of us to claim it. And the burgers were nasty. All completely over cooked and had no flavor.  Wendy's and Five Guys blow this place away. $60 later (only 4 of us ate and we had no alcohol), we vowed never again. Total waste of time and money.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8LPyj8vF80Bdk9ks7RP1xA"
  },
  "w0Mb_WAZsiXOYmXsd4q8Vg": {
    "date": "2/24/2018",
    "text": "Mediocre at best.  It was like going to Burger King in every way, except you have to wait 30 minutes.  There were 5 of us, we all got burgers.  The waitress asked how we wanted them cooked -- there were 2 for medium rare, 1 for medium and 2 for well.   All five burgers came out well.   Burger is a teeny tiny patty that was over cooked. No flavor. just salty.  Even a McDonald burger is better.   Service was poor. My favorite is when they bring the food to the table and \"hold an auction\".  They yell out the name of the food and hope someone raises their hand and claims it.  Of course there was confusion and we weren't sure if we didn't have each other's food, so the waitress argued with us.   Seriously, just skip this one.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "V_pjf2AybYJfBrPEyrfRhg"
  },
  "GbTKdAqXRSx7TTH9GqJhuA": {
    "date": "1/11/2018",
    "text": "Wahlburgers in Pittsburgh (Ross Township) is bad. I don't mean it was just a mediocre experience after a 40 minute drive and 1.5 hour wait. It was seriously bad in contrast to even if it was down the street from home with no wait after all the advertisement, hype, and price. Actually, there are so few positive things to say that I'm going to start with them because one might not make it to the end of the review and I do want to give credit where it's due.   The good: 1) Kind FOH staff - Everyone came off very friendly. The waitstaff was rightly apologetic when things went wrong and willing to make attempts to satisfy needs. The bar tender provided service to us at the service bar since the bar was full and we were waiting quite a while. 2) The actual flavor of the burger was ok. It doesn't crack the top 5 or even the top 10 in Pittsburgh but I'd eat it again. To be fair I was hungry on my way there and after 1.5 of waiting was starving. I had \"Donnie's Fave\" .. BBQ bacon burger as I do anywhere so I can fairly compare to others as it's a staple meal for me. Don't dream of getting anything as good as Tessaro's, Burgatory, BRGR, or even Primantis. We're talking higher end fast food quality like maybe if Chick Fil A made burgers, which doesn't make sense because they aren't even doing take out at Wahlburgers and there is no drive through. The sweet potato tots were kinda bland but not bad either. It's a far far cry from the \"high quality ingredients\" they boast on the website or all of the hype it has gotten.  The bad: 1) Terrible, and I mean terrible, attention to detail. At 8:30pm on 1/7/18 long after the dinner rush died down the server did not serve our party of 6 with food all at once, nor 2 or 3 or 4 trips. It took 5 trips just to deliver everyone's meals and sides over a span of 15 minutes. The excuse was that my burger was dropped and had to be remade but that didn't excuse the structure of service consisting of 3 other deliveries spaced out over 13 minutes brought out one or two at a time. He and assisting servers failed to return with obvious accessories required with food such as a spoon for chili (4 requests), originally ordered side of ranch (4 requests), silverware (2 requests), and forgotten sides.   2) What even is this food quality and is this serious?! Chili is legit Wendy's or identical to Wendy's fast food chili and this is no lie 3 times the price that Wendy's is serving it for. The fries and tater tots are exactly what I've been getting at the grocery store on sale 2 for $5 bags of Ore-Ida brand served at room temperature in a smaller portion. The thin crispy onion rings are not rings at all and by thin I think they mean possibly \"the edge of a butter knife\" thin. I expected petite loops of deep fried onion. We got shreds of stuck together onion hairs? Think a generic off-brand version of French's crispy fried onions that your aunt tops her green bean casserole with. Yeah, that was the side of onion rings. The mini penne Mac n cheese is not mini. It was some of the larger penne I've seen and someone literally tossed a handful of shredded cheddar over noodles, microwaved it, then stirred. I kid you not that the 3 year old trying to eat it said \"this is terrible\" unprompted before anyone else did which might have been the best part of my night there. Nothing was served hot or even pretty warm.  3) Priced at about $120+tip for party of 6, two of which were kids and included 4 beers (kids drinks were prepaid while waiting and not included in the meal total). Could have easily gotten better food in a place with similar items for much less. Places I'd rather go: Red Robin, Friday's, Applebee's, all the way down to Wendy's and even Steak N Shake.    Notes:  Funny that the people who waited after us in line approached our table after their meal to confirm it was the lamest experience ever. Even though we hadn't even finished yet they received the yes nod. You aren't crazy ma'am, this sucks.  There was an NFL playoff game on and we were stuck watching Mark Wahlberg talk (probably good about himself and his family's restaurant) on mute for 20 minutes while a host struggled to change it to something the whole place wanted to watch.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 8,
      "cool": 0
    },
    "photos": [],
    "user_id": "-cCkSj8Pc2rOT8PqciwyAw"
  },
  "6rA-OYvGt1WB0Rq6HEpaFw": {
    "date": "2/17/2018",
    "text": "Russell B at Wahlburgers Pittsburgh. Great service, great food and friendly staff. Clean bathrooms. Gluten free options are wonderful!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2-zPjJTgRU1mKP8l_nuiUg"
  },
  "tiTtu68o86GAVCajORfVGA": {
    "date": "5/12/2019",
    "text": "Third time here. Wife and I ordered the regular burger and she had the chicken Cobb salad. I also had fries. Eveything was aweful. Burger was not of good quality and tasted like frozen beef. Lettuce was shriveled and a bit brown. Only thing good was the Walls sauce. Fries were over priced and served in a little cup. Folks they are aweful frozen fries, cheap quality but they charge a fortune for. Wife salad had very little chicken and no variety of ingredients for a Cobb salad. Finally let's talk about the bar. We sat at the bar so we could watch a game and I ordered a rum punch and wife ordered a pomegranate martini. Was told they can not make a pomegranate martini. Ok so she ordered a cosmo. Both drinks were $9 each. There was not much alcohol in either drink. We watched her pour. Then they have the nerve to ask $9 each. Totally a rip off. We left most of our food and the bartender didn't even asked. When I mentioned the drinks being weak, he said, the management watches them pour to make sure there is no over pour and they were sorry but she didn't want to lose her job. She never mentioned the fact that half our food was left. Hence why there was no one except my wife and I at the bar. We are done here. Too many other places that have better food and much better drinks. Also went into the men's room and it was disgusting. So there you have it. Go else where",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4tAE-OTiM-UlFgCUTNuGYw"
  },
  "Bl2d8BadDMTKHjDqqyo7Vw": {
    "date": "2/17/2018",
    "text": "We ate Wahlburgers at Thursday afternoon and we could not have been more pleased with our experience. Our host Carley B. and server were friendly and expedient and our burgers were DELICIOUS! We will definitely be returning!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ks_Lbpn_GkLuM_3aQItDYw"
  },
  "RGeG2ubyGKO5bVwa9bwZvg": {
    "date": "5/20/2018",
    "text": "I got the mamas sloppy joe and it was INCREDIBLE! So flavorful and delicious and had a homemade feel to it. Tasted like my moms sloppy joe (but much better). Definitely recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2G76Rkh9MiZWgil4xtK6oQ"
  },
  "Odi-sUQKF0ySeABn1QNpTw": {
    "date": "6/24/2018",
    "text": "The food is consistently great, but the service gets worse every time I've been in. It took over 10 minutes to even be acknowledged, and our server could not have been less engaged in helping us. (The restaurant was only moderately busy at the time. ) Try takeout instead if you're hoping to try the food!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uZPZ35f39KMZJ7vtdFqZRg"
  },
  "DIlMu-Ymd6m8eLqTDsgFJQ": {
    "date": "12/23/2018",
    "text": "I walked in here expecting Chili\"s but I also expected Mark Wahlberg to be there. He wasn't there but it was also not Chili's, it was much better! Wahlburgers puts a lot of home grown and house made produce to the table. That being said my girlfriends \"medium\" burger was still Mooing. Other than that their homemade ranch and Bugers were outstanding. One of the most flavorful Bugers I've had in a while. The Mac and Cheese is a must try as well as the Fiesta Burger. I will definitely be going back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ilWH1J2Ry5JLOIlcX85rgw"
  },
  "5V80r8rP5ZMcaMKF46NvoA": {
    "date": "12/17/2018",
    "text": "Overall, it was a very good experience. Had a few appetizers, a couple of their specialty drinks and split a couple of meals and all were very good. Only issues we had with this place was the wait time of 45 minutes and the location of this restaurant. This place is kind of tucked in the corner on the second floor of the strip mall off of McKnight road. I'm not up in the north side of Pittsburgh all that often and would like to see another restaurant open up in the city.    4.5 on the service, 4 on the food, 4 on the price as our whole meal was under $40 which is impressive for what we ordered and 3.5 on the location of this place.    With that said I will be going back soon!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nroC1F7ZWTuJHJj5qWjWbw"
  },
  "fWMmWxotadkGxu_fpltCmQ": {
    "date": "1/28/2018",
    "text": "Went here on the spur of the moment on a Thursday night. Promptly greeted very nicely by the hostess and told it would be about 15 minutes. No big deal. Looked for a seat at the bar and the server working the bar area pointed out an empty table we hadn't seen. So our 15 minutes turned out to be 5. So far so good.   The good: 1. Service was good. The server promptly greeted us and gave out table a little extra wiping. Drink orders taken quickly and brought to the table quickly.  2. The menu is ok. After all, it is a burger place but there are several selections available if you don't want a burger.  3. Ordered my burger medium and it was actually medium. That seems to be hard to find anymore. The burger was very tasty and really just the right size.   The not so good ( don't want to say bad because it wasn't. Just eh) 1. $3.50 for a side of tots or fries with my burger? They don't come with? I saw that on the menu and assumed it meant if I wanted a side order of them not pay or you don't get them. Both the tots and my wife's fries were nothing I couldn't get an entire bag of at Giant Eagle for the same price.  2. The TV's showing what I assuming was the Wahlburg's reality show was a bit weird. It was on at least 2 TV's with no sound. Not that I wanted to hear it but I think having shows that require you to listen on in a bar is stupid.   Overall I think this place is, meh. Nothing special and nothing to make me want to return. I think the best description is; it's not a place that you plan to go to but rather somewhere you end up at.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "EsvLQhDfXtW29595W23rWA"
  },
  "EWdOenMMDl-S0Fc0lI3jpg": {
    "date": "1/17/2018",
    "text": "Nothing good here   Bar drinks are low quality with artificial syrups and burgers are undercooked   It's awful but should appeal to the yinzer crowd",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "iH_fFp5HO4DI1DmZM4vQcA"
  },
  "Xb0UjtMg6Utfe7dS1CZvvw": {
    "date": "9/24/2018",
    "text": "I've always seen this on television. This location was not crowded on a Saturday evening. It's well appointed and nicely lit and has television screens all around. I ordered the rum punch it was OK I didn't taste liquor at all. On the other hand the burger was delicious. I forgot the name, it had jalepeno  and bacon on it. I loved the fries and the in house mustard. I ordered take out bacon cheeseburger for my nephew and an order of fries he loved it loved it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vUyr0O72btWjs1HqZRc4EA"
  },
  "6ZzG2gmSU2ofXdqV_m7Mmg": {
    "date": "11/24/2018",
    "text": "We were in town visiting friends and had some free time during lunch. Since we don't have one of these in Miami, we decided to check it out. I had no idea it was an actual sit down restaurant vs. a counter to order like Panera or Five Guys. Service was good. Food was good. We shared fried pickles, which were tasty, and then two hamburgers that we split so we could both try. I'd go back and try again if there was one close by.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I6rvdlHsVLVo1eFVJMGeog"
  },
  "I8vXQqUUdP3g2NCPVf3ZEA": {
    "date": "4/23/2019",
    "text": "Amazing service. Fast and friendly. Great food. Pretty cheap. The burger was cooked just right..normally when I ask for a medium well burger, it ends up being a bit dry but this burger was juicy and cooked perfectly. Will definitely be back! Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lEb4uIweHgH5DFua6ouhrw"
  },
  "KEWwcXB-Lrrs30XmOaq2HA": {
    "date": "6/27/2018",
    "text": "We were there at the new Block at Northway location in the North Hills on McKnight Rd. Nice place. Love the tater tots. Burgers are good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8A179Q_SND4oRpx1khXGIw",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8A179Q_SND4oRpx1khXGIw/o.jpg"
      }
    ],
    "user_id": "3XREo2mEExS2NpWZhzFQxQ"
  },
  "SSI_paKoZxaK2_Tl5CeXWQ": {
    "date": "10/7/2018",
    "text": "Really enjoyed the meal and the atmosphere.  Very attentive wait staff and a decent value for the money.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4QS0EIx_TiNxv8PtLZ2BYw"
  },
  "hTzkcXPBwx6oDZCBS39-Tg": {
    "date": "11/16/2018",
    "text": "Many folks had a poor experience, but my husband and I really enjoyed our visit. Good, fast service and enjoyable food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r8YoRs8YwSuVAIpz-W4dEw"
  },
  "7KcBV038kxKfzJ6hs1oOQg": {
    "date": "4/19/2019",
    "text": "One of our favorite restaurants. Great food. Jill was absolutely fantastic. We were there recently with a large party. Jill provided fast and accurate service. Every order was delivered exactly as requested.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lV3MMIRWBDsJ0RDiJH2ggA"
  },
  "ncUVNYSOzLFPz2eKFkI2Rg": {
    "date": "12/30/2017",
    "text": "Excited to visit . Nice decor and view out the big windows. Burger was average at best , the cup of 15 small tater tots was small and lukewarm. Yellow gold fries were much better. A chicken Cobb salad was alright but again small and lacking much in toppings. A salad made from any burger is just what it means, they take plain lettuce and put the burger meat right in top of the plain lettuce. Letdown if you just get a burger with cheese sitting in a bowl of lettuce only. Glad I tried it but next time I'll go to 5 guys or even hello bistro for a burger.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "0tpLWXsk3Uyx_qyxcN_tEA"
  },
  "Awzcq3Gh01YhjIZPserobw": {
    "date": "3/2/2019",
    "text": "Unfortunately we weren't able to eat here because they were so incredibly off when quoting us a wait time. We arrived at 5:20 and put our name in and they said 45 minutes. We had a toddler with us but decided to wait anyway because we figured by the time we got back in the car and went somewhere else it would take just as long. After 45 minutes passed, we still hadn't been notified so I went up to ask. They stated that there were still 6 parties ahead of us and that it would be another 25 minutes. At that point our toddler had had it and we couldn't wait longer. I understand being off by 5 minutes or so in an estimate but 25 minutes is far too much, and that's assuming it actually would be 25 minutes because now we know their track record for estimating is terrible. They should always overestimate if they feel they have this problem especially when it's a busy restaurant with people frequently waiting.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tjCKsPywTjislyTV0yKB_w"
  },
  "mGvSauoZ4CqloF1q0lq1DA": {
    "date": "4/14/2019",
    "text": "Wahlburgers is the place to go if you want a good burger. Anytime I want a burger i go to Wahlburgers. They have so many options. They are usually always on a wait around dinner time so either go early or plan on waiting awhile. The only thing I don't like is the fries aren't included you have to pay separate.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IxZfTbPIOzjlUAOSnDp1TA"
  },
  "6WDUSzFZvYqx3kb106q-Hg": {
    "date": "3/23/2019",
    "text": "Meh. It wasn't horrible, but definitely not worth a 2 hour wait. Just middle of the road.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A-gw_8tgITMs3Phm8cPoQQ"
  },
  "5TyxPBfRiVY1-kKrCNZRbw": {
    "date": "3/5/2019",
    "text": "Getting this rating because of a completely incorrect order. I ordered $20 worth of delivery, and it was all made incorrectly. I added in notes for no bacon and no mustard on my burger-both were added. Asked for sauce for my tator tots-no sauce. There weren't even napkins in my bag. Will never order again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9JzsS4ykaZrn03JKivcDPQ"
  },
  "ygF0g6VvEWhg3PvZU_jE8A": {
    "date": "12/21/2017",
    "text": "It awesome hamburgers and tater tots!!! Fast and friendly service!!! The wait was about 15 minutes. It's a really cool place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "g3yb3_vDZCCuj24xozU1-Q",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/g3yb3_vDZCCuj24xozU1-Q/o.jpg"
      },
      {
        "img_id": "CVZS6Q2XBnsb8Ulv0gv2bg",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CVZS6Q2XBnsb8Ulv0gv2bg/o.jpg"
      },
      {
        "img_id": "veK9kYcO5feT_pxeC4RwzA",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/veK9kYcO5feT_pxeC4RwzA/o.jpg"
      }
    ],
    "user_id": "raEVolJBsXSe0yiFegHKvg"
  },
  "knOIFwKPdO4fGihvOan81A": {
    "date": "1/21/2018",
    "text": "Wonderful dining experience!  My family and I decided to give Wahlburgers a try this weekend, and were very pleased with both the service, and the quality of our food.  We were seated immediately, and greeted promptly by our server, Russell, who was super helpful, and friendly.  After some debate, we wound up going with the Melt, Mom's Sloppy Joe, Jenn's Chicken Sandwich, and a children's entree.  We also ordered the sweet potato tots, onion rings, and the mac and cheese with smoked bacon.  Our food came within twenty mins, and each entree / item was better than the next, although, I personally had the seared chicken sandwich, which I highly recommend.  The smoked mac and cheese was amazing, as well.    So glad to have another family friendly, affordable, delicious dining option in the area, and look forward to a return visit to Wahlburger's soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-H4Ju0eTZiKzz5TqRX3lUA"
  },
  "Z_Yur_E96YImLdz6-uZoUQ": {
    "date": "12/27/2017",
    "text": "Double decker burger and fries were good. The \"government\" cheese tasted just like I remember. The burger was cooked medium well and was perfect. The ambiance was comfortable. Wasn't too crowded. Might feel stuffy with more people. The waitress was new and could't get our orders right. Watch your receipt.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7QyNDdqh1a3pg5MvU-2Gkg",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7QyNDdqh1a3pg5MvU-2Gkg/o.jpg"
      },
      {
        "img_id": "gabEK-ggsoKBubuwR67nuQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gabEK-ggsoKBubuwR67nuQ/o.jpg"
      }
    ],
    "user_id": "_aDfKvHXlyRZ4W4TQQPbWA"
  },
  "bUc0TXlpH42clHNmGmBaxA": {
    "date": "3/2/2019",
    "text": "Enjoyed the burgers, and sweet potato tots. Always a great service, don't mind the wait to get a table. Worth the time to get a great fiesta burger!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0IZCmhYdVdkkjo3CsOyBMQ"
  },
  "og8KjA1Xl1xUMCgIc1k-jg": {
    "date": "6/10/2019",
    "text": "Good burgers. Wahl sauce like thousand island dressing only spicer. Gluten free bun available.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hN80U871UgWp4Q6mV90r5Q"
  },
  "a93J_r2JgNtHtGnH-1VP7A": {
    "date": "2/24/2019",
    "text": "Slowest take out service. The old women in charge or takeout orders is rude and the slowest individual I've ever met in my life. Please get it together wahlburgers and find someone a little more competent.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V0CMr3WfYngnumM_cZ4hsg"
  },
  "vbr3YA3I_PbcyvqieWllPQ": {
    "date": "6/24/2018",
    "text": "Awesome food an great service... im so glad i came here.! Food is to die for.. idk wat else to say get here.!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BCKN_uRbwgEarW051FSVmw"
  },
  "_N8IqL5FNySRifb2wjYl7g": {
    "date": "5/26/2018",
    "text": "Ate here for the first time today. Mom wanted to go for her birthday. Alicia, our waitress, was fabulous. She explained pretty much everything about the menu. Food came nice and hot. Ordered onion rings, recommend getting if going to put on burgers, more for snacking on since they are like shoestring kind. Food was reasonably priced and good. Will return again. Thanks again for the great service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "AYarmqNQXDpUdZIL-jSXtw"
  },
  "o1dGQEEeN4PU4hmGmnfMUw": {
    "date": "2/18/2019",
    "text": "Wahlburgers' menu had changed a lot from visiting a year ago.  The food is great however I wish they had normal onion rings instead of the small shredded type of onion rings.  I ate at the Wahlburgers restaurant in North Hills Pa.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "966kuNyky8rPbmxqU43nvQ"
  },
  "DBpzz22YvRVgyyBoMHSFEw": {
    "date": "6/4/2019",
    "text": "Meh. Just meh. Not all its cracked up to be. Tots are tots. Expensive for what you're getting.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WfQQyqi4Ls3vfBQ02lidDw"
  },
  "YcIeEMqXCaKDEa00Bn0upg": {
    "date": "4/23/2018",
    "text": "When I heard we were getting another burger place in the North Hills I thought we already have enough, so if another one opens it needs to be pretty great.  Unfortunately after trying Walhburgers I feel like they are banking on their celebrity status as the food is just lackluster and overpriced.  I had the Fiesta Burger for dinner with Smoked Bacon Mac'n cheese on the side.  The Mac'n cheese was the star of this meal.  It was delicious, but came in a very small cup so was a bit disappointing.  I expected the side to be a bit bigger, maybe even sharable since some of the other sides came in baskets.  The Fiesta Burger was not a fiesta in my mouth, I expected more flavor and spice.    I honestly wanted to like this place, but left me returning to my usual burger spots.  I wouldn't turn down a cup of that Mac'n cheese though don't even ask me to share it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "10W2B-BjOD9_RKPepLvtWQ"
  },
  "vbtlVkKhqF8lEGYcvfulSw": {
    "date": "8/12/2018",
    "text": "Awesome!!! place for lunch,great service  Wife and I enjoyed first time here need to take a swing by",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bX9bGNsiZjGTArZDp3PuDg"
  },
  "WGFvWX22hpFOhVLmNK_Zxw": {
    "date": "6/7/2018",
    "text": "First time at Wahlburgers. Quickly seated - few people here at 6pm on Thursday night. Wahlbowl chicken salad and sweet potato tots were good. Our little boy dropped his full cup of chocolate milk all over the floor !! Sorry!!! But they were nice about it and we cleaned it up. Great service!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AWqNydj5uFl3b24zeoAjbA",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AWqNydj5uFl3b24zeoAjbA/o.jpg"
      },
      {
        "img_id": "MN3BGvtumr2cdINLApYXMA",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MN3BGvtumr2cdINLApYXMA/o.jpg"
      }
    ],
    "user_id": "WQ-VTM4x0iB0LF2ovdqUqQ"
  },
  "-icumPq41iuUI-AGEkn77g": {
    "date": "4/19/2018",
    "text": "My husband and I were so excited to try this place. I am a huge fan of this family. I wentNeedless to say by the end I just wanted to leave. There was a small wait, however there was space at the bar. Being that we had an hour drive back home we decided to take the bar. We did get drinks within five minutes of sitting down. Our order was taken about 20 minutes later. When our food came out, we needed silverware. Took ten minutes to flag down the bar tender. He was to busy talking to someone about about how Mark hates being called Marky Mark and how he's so excited about the appearances that will be made this year. Also talked  about them being 2/3's owner of the Pittsburgh location. He finally saw I wasn't eating my food and came over. Took another probably 15 minutes for him to bring it to me since his conversation was more important than my now cold food not being eaten. My husband and I both ordered fries, which the container was maybe half full. No biggie for me due to my not being a big eater, but if those are the portions then why make people pay extra for them?! I waited for nearly 10-15 for a refill on my drink. I had it sitting on the edge of the bar. Even took it off and but it back down just in case he didn't notice the first time. My burger probably would have looked better coming from McDonalds and I hate fast food. If your looking to try something with a great experience and good food try something else. I heard Burgatory is opening up another location nearby so I doubt this place will last if something isn't changed.  To update from my last review. The owner quickly responded to my review from before! Was really nice. My husband and I went back with some friends and our experience was a lot better. Service was great! Food was fantastic. We used the No Wait app, so we didn't have to wait long either. We have gone back a couple of times since and have had positive feedback for each time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZwU2-EFYiXyRjNfC83ZZYg",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZwU2-EFYiXyRjNfC83ZZYg/o.jpg"
      },
      {
        "img_id": "iFvSziSj7Tf4m41fLhPd_A",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iFvSziSj7Tf4m41fLhPd_A/o.jpg"
      }
    ],
    "user_id": "fJCidRZiFGG7O5q0SP1xkg"
  },
  "yZSSYaJsDhGDkqChe9mk0Q": {
    "date": "4/30/2018",
    "text": "I finally got a chance to come here,  and so glad I did,  it was me and my twin sister birthday done picked this place for our family dinner,  it was such a good time and great food  I went to one in Myrtle Beach back in March and loved it so I couldn't wait to go to the Pittsburgh North hills location,  our server jess was very nice the whole staff there was friendly,  will definitely return",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "GJypYDM8PIyMdCWyNNazTw",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GJypYDM8PIyMdCWyNNazTw/o.jpg"
      },
      {
        "img_id": "_5Ho9fRXYyuSRj_S6G-Nyw",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_5Ho9fRXYyuSRj_S6G-Nyw/o.jpg"
      }
    ],
    "user_id": "s0rJ5eoGcI-gyJCmybsMDg"
  },
  "ZW5aX9CDk17EJw8jaJggUw": {
    "date": "1/25/2019",
    "text": "We were just there and had a wonderful experience. Our waitress Wendy was great , gave us  some suggestions, talked with us ,brought over more pictures of Donnie  as a joke. The manager Candace came over and talked with us. The food was hot and very good . We had very prompt service .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H9EAz54vUeyLUhzJ6MsMXw"
  },
  "t5ZApZv6RVL4Y8bWq8J0Zg": {
    "date": "1/24/2019",
    "text": "This place is unbelievably overrated and overpriced. The food is mediocre, at best. The service was not great on a night when the restaurant was half empty. The burgers were okay - not spectacular and by no means worth the hefty price tag. $13 for a burger with no side. $3.50 for 4oz of frozen fries (which were cold and clearly not fresh).  The thanksgiving burger was literally the same texture throughout. You could have eaten it without teeth. Zero flavor interest. It tasted entirely like butternut squash despite having cranberry sauce, which should have been a noticeable pop. Our server didn't put in our appetizer order, so I can't comment on what we ordered. At least she was honest and didn't blame the kitchen.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-FFUshmxcnv3PINbQPDj_g"
  },
  "D4KSXe4ZqPjIOWiqPVytxQ": {
    "date": "5/23/2019",
    "text": "Me an my wife stopped at Wahlbugers in the North Hills.I ordered the Paul's favorite with cheese, lettuce, tomato,bacon an mayo withe regular tator tots.My wife had the OFD an sweet potato tots.We both ordered our burger med well done.It came to the table in a timely manner.Our burger were burnt  an way past well done.An the sweet potato tots were so hot you couldn't eat them.They waitress asked if everything is ok an my wife said hers is way done.I didn't complain an just ate mine because I was hungry.The waitress took my wife's off the bill.After we ate an paid our bill.Which is about 20 mins.The sweet potato tots still were real hot.Not worth it to me an I don't complain about food to often",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YKNkQsIVfg-nnEh8DXggcw"
  },
  "UT6YhSEoMU8MwMM1RtvXLA": {
    "date": "9/15/2018",
    "text": "It's good.  But not great   Tater tots are yummy.  For the money I'd go back.   But if you can spend a bit more I'd go to BRGR.   We had the chicken sandwich, that wasn't bad, the regular single burger , the double burger , fries and tater tots. Chicken sand was ok. Burger was thin, little flavor. Fries were bland wouldn't order again.  Tots were very good   Pittsburgh location",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Oyp_r6ll7sTeWBPyWs9OWg"
  },
  "AbUZSJmUdFiRNtngIpSiFQ": {
    "date": "5/11/2018",
    "text": "After hearing so many things about Wahlburgers, I finally decided to give it a try. Don't believe the hype. I ordered my 1/2 pound OTD burger medium and it came out gray throughout - definitely not medium. The flavors were average and nothing special. The mac and cheese with bacon was also subpar. The bacon was on top and was so hard, it was borderline inedible. Upon leaving, there were two hostesses at the front - neither said thank you or come again. Overall, a very disappointing and subpar experience. Not recommended.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "38yYGzFZNuVn0_ArJYuzyg",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/38yYGzFZNuVn0_ArJYuzyg/o.jpg"
      },
      {
        "img_id": "l69OiphWGBMTE1Ud_gvWOA",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/l69OiphWGBMTE1Ud_gvWOA/o.jpg"
      },
      {
        "img_id": "Z75anto_z_jWpnPoYCG0DQ",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Z75anto_z_jWpnPoYCG0DQ/o.jpg"
      }
    ],
    "user_id": "Ih_3sCuepE90sacrrtxyKg"
  },
  "jrPkoO9Yjg-xBjw-3DgdPg": {
    "date": "7/6/2018",
    "text": "Stoped on a Wednesday for Happy Hour I was pleasantly surprised there was sports on TV and Half Off Beers  got a 5 Dollar Appetizer chicken parmisagne sliders will definitely be back again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XZKYJMqMGXAFlCcUvHQFhA",
        "caption": "Photo of Wahlburgers - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XZKYJMqMGXAFlCcUvHQFhA/o.jpg"
      }
    ],
    "user_id": "-TIJioJErzNgPax2u5w1-A"
  },
  "vr5vzIJJPLbMvVxjBq_Iig": {
    "date": "3/12/2018",
    "text": "It was time to give this place another shot, which I did on Sat 3/10/2018.   We got there at around 3:30 pm and it was pretty busy in the dining area, so we decided to add our name/number to the waiting list.  About 5-10 mins later a table opened up in the bar area, so we went and sat in there.    Immediately, someone came over to wipe down the high top table for us.  Shortly after that the manager came over and gave us menus and asked us if we wanted anything to drink.  So far, so good!  Then our waitress came over with silverware and napkins and talked with us for a bit.  She was fantastic!!  We started with the Sweet Potato Tots and Thin Crispy Onion Rings, which were both fantastic and highly recommended.    Next, I ordered the \"Our Burger\" and my counter part ordered the \"Triple Decker\", both with white cheddar cheese and a side of Crispy Yukon French Fries.  They were both cooked the way we wanted and were so very good!!    This was a total 180 from the 1st time I was here.  I definitely recommend you stop there and I know I'll be back....THANK YOU!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "NJkh6bmtAK799Ip_p59g-w"
  },
  "gOiPUuGvIqIUEDNMbHTj-w": {
    "date": "12/27/2018",
    "text": "I love it here. Their sloppy joe is amazing. Come to think of it, everything I've ordered there has been amazing",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nfO6B3rBXVyYtsg3f6rRPQ"
  },
  "LWKd-OotaWKx5ioLctZTmg": {
    "date": "1/4/2018",
    "text": "Needless to say, I am disappointed. I was prepared for the wait, no problem there. The service and the food were sub par to say the least, four of the five orders were incorrect when the arrives to the table. Actually, three of them were not even ours. If this is the soft opening I certainly hope that better preparations are in place for the grand opening and continued business. When you spend $80 on burgers and fries, you expect a little more. Step it up Wahlburgers !!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CF76jlzyjB0GdYYIcpBZDQ"
  },
  "UnPpG8pPN8aXzA7U22-uDg": {
    "date": "12/26/2017",
    "text": "Be prepared to shower after you leave here as you and your clothes will remind you of Wahlburgers long after you leave...like a bad hangover after a late night in the bar.  Apparently Mark W. was in town on Sunday 12/17 for the Steelers/Pats - he managed to get to the box but should have gone to his newest installment of his family restaurant chain.  Loooong wait, on a Wednesday night, which I get as it is new.....that said, so not worth the wait.  We had hoped to really enjoy - this was my nephew's choice for a belated bday celebration - what a disappointment!  A few of us ordered the \"our\" burger and expected it to come with the toppings they list...only came with cheese.  When we asked the \"manager\" about it, he said (all with a cheesy and disingenuous smile) that we should say we want it \"set\" going forward, and that we would stump his staff if we said that.  How would we possibly know this?  We had a party of 7, some burgers (not \"set\") and some chicken.  The chicken was good, nothing special.  The onion rings were like French's canned onion strings.  We weren't given any utensils.  Oh, and did I mention that not only was the wait long, the wait for the food was even longer....and we were served the wrong dishes, all seven of us...nothing comped, no apology from the management on the late, wrong food or the \"set\" burgers.....the funky bunch has its' work cut out for it....",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "2QB27zZUG03Rn0K-M4fNOA"
  },
  "x53P8HB7Bm0QSalCuBWQ6g": {
    "date": "3/31/2018",
    "text": "I've decided to update this review because I was finally contacted by someone within the restaurant management and invited to come back to try it again, so we did so.  This time around, the service was much more attentive, and all of our orders came out correct.  Someone at the table tried the Thanksgiving burger, which he said he far preferred to the regular burger that he had the first time around.  The waitress did a good job suggesting different sauces and condiments to try, and the manager stopped by personally to apologize for our prior visit and to encourage us to offer any feedback we felt might help.  Whereas some of this improved experience might have been intentionally focusing on us because of our prior complaints, we agreed we'd give this another shot in the hopes that maybe now that they've ironed out some of the kinks with management and staffing, that they might be more consistent.  There are still some issues that put this place further down on my list than some other burger restaurants (i.e. the fact that all sides are ala carte, the lack of any kind of shareable appetizers for the table), but that's just what the business is, and not a fault with this particular location.  If you live in the area and don't already have it, download the NoWait app.  It's great for a lot places, but since this place is smaller and always busy, it's nice to be able to \"get in line\" and then leave for the restaurant once you see your table is getting close to being ready.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1co99pw7jc2ohMap0ISJBQ"
  },
  "YQ9bbAmw23OaUx0f4FhhGQ": {
    "date": "2/14/2018",
    "text": "Been wanting to try this new burger spot. Don't waste your time or money. Lets start with the atmosphere; bright, cartoonish and very spread out. Wait staff was friendly, but the host was clueless. Moving on tothe drinks, stick to beer or soft drinks. Terrible wine and cocktails, sent 3 back. The spiked cherry coke tasted like cough syrup and the strawberry something tasted like sour cotton candy. When taking our food order, the server recommended the burger be medium well. Hmm. Never heard that at a burger joint. Very small menu, could be a food truck. Food was just ok. Burgers lacked flavor. For 2 drinks, 2 burgers, tots and onion rings, the bill was $70. Don't mind paying for a good experience, this wasn't one. And btw, spent most of my night in the bathroom. Yuk!  Also notice that corporate only thanks good reviews, how 'bout a sorry for all the unhappy diners. Stick to the burger you know....",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8DUA7y78Y3wuobNTlB4WWg"
  },
  "e2aQX1mSZCudC6nD-X8new": {
    "date": "12/28/2017",
    "text": "Went on a Tuesday around 1pm. It's was a 20 minute wait time.  Host staff seemed nice but didn't seem to know what was going on between the three of them!  After we were seated 10 minutes later our waitress came over just to tell us she would be with us in a moment.  We did not see her again for about 5 minutes. She asked what we wanted we just ordered two waters and waited another 10 minutes just to get water.  Now 20 minutes after being there we finally get something to drink and are able to order .  My husband ordered the 2 hot dogs and I ordered the Jenny Chicken sandwich.  We did not get our food for 35 minutes.  We had to ask for silverware and our waitress never asked if we needed refills for our drinks we had to ask her for refills and took her over 5 minutes to get us refills.  As we were eating we watched our waitress drop food on the floor clearing a table and clean it up with her hands.  I watched her and she never washed her hands she went and picked up a food order.  I will say the food was amazing but the wait staff will take this place under.  As much as I liked the food I probably won't be back due to the wait staff . All in all we waited over an hour to get food and drinks.   Our waitress name was Margaret and was very overwhelmed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YqneCkbyojSnNyvc8CeSoA"
  }
}