{
  "Eo2uj_Zs2Qt6BurgIo9kSw": {
    "date": "4/4/2012",
    "text": "We had a large delivery order for dinner.  Others liked this place. I thought it was horrible. I ordered a Shrimp Burrito and it had very little shrimp and a lot of rice (little taste for almost $10.  Nothing else was included.  The wings weren't bad (I tried someone else's).  Everyone refers to big portions,so I'm guessing you have to eat in to get it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DEFk299pEBqKgUgQ703V9g"
  },
  "i9nMh0t7mdbcHOiR9_lcIA": {
    "date": "3/31/2015",
    "text": "I love coming here on Sunday's or Monday's. The crowd is pretty relaxed, and it's a good place to go catch up with friends and relax. You can't go wrong with anything on the menu (my personal favorite is Kristy's Big Sister's Red Velvet Quesadilla). Highly suggest the Big Azz Margarita, but if tequila isn't your thing, try the sangria.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eEi85f9b9-QZngKciTCScA"
  },
  "U2_yn74uW504LAQeeLMZEQ": {
    "date": "9/6/2014",
    "text": "The best thing about this place is the late night half price menu. Otherwise, it's relatively pricey, super dark, very noisy, and TINY. Don't expect to have any real conversation here or to eat a meal without being bumped into a million times by people coming and going. I don't think this place would do well if it weren't for the college kids in the area looking for drunk food after 11pm.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KvnfUwut507lRle6fq6kyw"
  },
  "CiPMMdEdZTDi_RkfU9tSAQ": {
    "date": "3/13/2013",
    "text": "\"Not yo momma's tacos\" are my go-to. I always say I'm going to get something different but they really are delicious(as well as a bargain.) My girl always gets the wing-urrito which is a boneless buffalo wing burrito. Ingenious and tasty. This is white people Mexican at it's Pennsylvania finest. Reminds me of El Torito in California. Liz the bar tender is attentive and enjoyable.   7 out of 10 stars. Not Charlie Trotter. Not Taco Bell. Solid grub all in all",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K4lrgtSKdFyRWeSaeXwQig"
  },
  "OccH0dy3k6UG2NL2HR7P-w": {
    "date": "4/24/2016",
    "text": "Are you broke, craving mexican, and tired of succumbing to the garbage that is Taco Bell? Get your late night Mexican cravings at Mad Mex. after 11 they have Big Azz Margariitas (they always feature a different special flavor each month) for $7... You can't beat the buzz. They also have everything (except a few items) for 1/2 price after 11, too. This isn't just a college kids dream, it's everyone's dream. Everything is creatively, flavor fully mastered, and your taste buds will thank you. So many vegan friendly options, too. The only issue is the space. It's like packing 50 people into your mom's kitchen. The margaritas help the awkwardness of your ass rubbing up against a complete stranger while your tatas knock a dish of waffle fries (jersey fries) to the floor. GET THEIR RANCH, ask for extra, pour it on everything--- it is the best ranch dressing ever. Mmmmmm. Cinco de Mayo/Taco Tuesday all day every day. Enjoy the weirdness. Embrace the madness.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5QqTMJM9fiC6m34EZlbxJA"
  },
  "NoOOv-LduGD5dhLsa4MZ9Q": {
    "date": "3/27/2014",
    "text": "Definitely one of the to-go places if you're a college student on Pitt/CMU campus. Half off after 11 will make it easy on your wallet. Lots of good noms and  the half-off special is quite extensive ... can use on most of the top picks. I'm personally a fan of their enchiladas, especially the carnitas (steak meat) enchilada. Pickadippa is also a good appetizer to start if you're into the salsa and dip for chip kinda thing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MLf4JUa1uzQkDLrBJ5yJHA"
  },
  "F0kd9SNLj4zuavPWTdWtVA": {
    "date": "10/14/2011",
    "text": "Even though parking here sucks, this is my favorite Mad Mex location.  If not for lack of parking, I'd give it 5 stars.   I loved their Horny Toad Margarita, which unfortunately is no longer on the menu.  But if you get an old timer, they'll still make it for you.  The closest thing to the Horny Toad is the Ultimate.  If you like a wicked sour margarita, this is the one for you.  I'm not a fan of the big azz margaritas that are popular there, they're  just too sweet for me.  The red sangria rocks!!  There's always and awesome selection of drafts and bottled beers too.  I like this location because it's really small and really dark.  I know that's not a plus for lots of people, but I like it.   I love the Insane San Francisco Wings with Blue Cheese.  We always order them well done.  Insane is the highest on their heat scale, the heat level isn't consistent, but it's usually pretty hot.  The blue cheese is a perfect balance to the garlicy San Francisco sauce.   My husband almost always gets the Chicken Chimichanga, its generously stuffed with tasty chicken, it's always nice and crispy.   I love most of the quesadillas and fajitas... but I think my favorite entree is the Dance Marathon Enchiladas.  I love the garlicy portabello mushrooms and spicy spinach.  The tortilla soup is thick and creamy and so good.  The casa salad is awesome with the Lime Cilantro dressing.  A garlicy spicy creamy pesto-type dressing that is also great to add as a dipping sauce for quesadillas and taquitos.   The salad is a simple combination of leaf lettuce, cherry tomatoes, red onions, blue cheese crumbles, green pepitas... the crunchy pepitas with the salty, tangy blue cheese topped with lime cilantro dressing... YUM!!!!  One of my favorite places to eat.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MewXt6UbV5wbdB9EY0HkCg"
  },
  "REYpdpYqlmqbNNasw7mR7Q": {
    "date": "2/25/2010",
    "text": "Interesting decor, quick service, average prices, pretty good food.  That's my summary of the place. Having been to my fair share of taquerias, this place definitely does not look like one.. but the food wasn't bad. It's not the place to go for a quick good ol super burrito, but if you like Mexican food and at times wished that it was more \"sophisticated\", check this place out. The seating was kind of cozy, so I don't know if it would be ideal for a busy weekend night if you have a large party, but I'd definitely come back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "W9zhM4PP4HtwRNEVrAnuSg",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. the menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/W9zhM4PP4HtwRNEVrAnuSg/o.jpg"
      },
      {
        "img_id": "pnCEKlj9tC0ZMPQ4hNIpVw",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pnCEKlj9tC0ZMPQ4hNIpVw/o.jpg"
      },
      {
        "img_id": "ElWJyJ_dhbEbfzcvBAU_6w",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ElWJyJ_dhbEbfzcvBAU_6w/o.jpg"
      }
    ],
    "user_id": "rP1JhMcc7sZTzW3KzLpL9w"
  },
  "jz6O5GziTLNdY_L0Ccr6Dw": {
    "date": "5/14/2011",
    "text": "Oh, Mad Mex.  How I always want to like you, and always walk away going, \"Oh yeah, I remember that.\"  I lived two blocks down from Mad Mex for a good bit of college, so it was inevitable that we ended up here our fair share of times.  However, very rarely did our food-ordering go past chips and salsa, and each time I try to have food here, I realize why: I just don't like Tex-Mex or Cali-Mex or whatever sort of not-the-real-deal-Mexican food Mad Mex is.  That said, they do make a good margarita, and they do run a lot of specials.  The Oakland location has half-price menu items each evening after 11 (much, but not all of the menu qualifies for this), and two happy hours for cheap booze, including half-price Big Azz Margaritas (those are the 22-ouncers that often made for early bedtimes during college).  The drink happy hours and the food happy hours never coincide, but you can get your cheap drinks  from 4:30 - 6:30 (cheap wings at this point, too) or 9-11 each night, and if you stick around until after 11, you can get the half-price food menu.  Some times of the day are 21+, so you can have some margaritas and take advantage of the less-full restaurant before 11, then put in your food order once you've started drink round #2.  On our most recent visit, I tried to figure out what it is precisely that I don't like about their food, and I think it's the consistency of their tortillas.  They are a little doughy and thicker than what I'm used to.  Their fillings for quesadillas, burritos, and tacos just don't stick together like real Mexican food.  There are some things on the menu that truly are good, however.  Their waffle fries are seasoned quite well, and their chocolate dessert burrito is sinfully yummy.  At Thanksgiving time, the Gobbleritos (a burrito stuffed with all the fixins: turkey, mashed potatoes, gravy, and corn) are quite good.  But past that, the food is only average.  The Oakland location, as many others have pointed out, gets quite crowded during peak times.  The service is chancey, and sometimes you get a great waitress, and sometimes one who could care less.  However, the musical selections playing throughout the restaurant are almost always awesome, so I've always liked that bit of the atmosphere.  One final point, the bathrooms are rather sketchy.  Back when I lived down the street, I always preferred to just walk to my apartment when needed.  The Mad Mex bathroom just doesn't seem clean.  And don't have so many margaritas that you forget if you should go in the door marked with a nut or a bolt ;)  Overall, if you're looking for a margarita and some chips, Mad Mex is okay.  But if you're craving Mexican food, this is not the place.  Although, after a Big Azz Margarita or two, you may very well not notice :)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "r98FaAOAoJDCPp384XpcYA"
  },
  "Z1_smfmX3PkAdk18YtyDig": {
    "date": "7/14/2011",
    "text": "Dark, crowded, noisy, long waits, overpriced food, blah drinks.  Also, I don't get eating burritos with a knife and fork.  I just don't get it.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GKBIbzxluHpyKGVt1pjMjQ"
  },
  "l4UDxx5P2FHo3haouJQ50w": {
    "date": "1/20/2012",
    "text": "Big portions of food but very loud and crowded. I can barely have a conversation here!  Very dimly lit, i would say this place would not be ideal for a date but more like a drunken gathering with lots of margaritas!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xPgZn0DAvQMh7z5dGSqwyw"
  },
  "tOfQXJqJVj1j9g_n0XEQ7Q": {
    "date": "8/11/2014",
    "text": "This has consistently been the best spot for student drink and food specials. Always delicious! Definitely a dark and noisy atmosphere, but a good time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TcLHkuq67K2O4V0kw0JLJQ"
  },
  "qgSL-cW5g08ZZdWizuMDuA": {
    "date": "6/4/2012",
    "text": "This is one of my favorite restaurants. I have been consistently getting half price late nite food here for 10 years. The quality has waxed and waned over the decade and I would say recently it has been excellent. Favorites are the spicy M.M. Burrito and vegan nachos grande. This place is meat and vegan friendly. A continual staple in my life.    The music can be loud, the college students can be annoying, and the margaritas and monthly beer specials may make it difficult to get up.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y5vPu1GxF4LWp7g-w06-LA"
  },
  "-8VZBXNrEYlrH_N0G-EutQ": {
    "date": "4/24/2015",
    "text": "Mad Mex, what can I say? I came in a simple man with a simple desire. To get a burrito punched down my throat by a good strong woman. What I left with though, well that's a different story... The guacamole here didn't just knock my tits off, no, it reduced my tits to a ruinous blighted hellscape. A scorched pair of blackened craters where my once proud tits stood. Now I wave at them in orbit while I remember this guac. 10/10, yelp stars mean nothing to me.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "o87NA4xhCoqBgBgQRqn2VQ"
  },
  "qr5XI7xy-y7a5OcE1DBRyw": {
    "date": "10/15/2014",
    "text": "Great place to go with your friends! Had a frozen raspberry big azz marg which was excellent. My friend and I split the nachos which was a good idea-- the portion was huge. The only downside of this place is the size, had to wait forty minutes for a table for four. Always crowded on Thursday, Friday, and Saturday. Ambiance is nice, but get here early if you want a table!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ad8-vBhiiKLO7G5vQaymfQ"
  },
  "wLRNta2TkvaEZmTN1CAzbA": {
    "date": "10/15/2014",
    "text": "Love this place. Although in my opinion, it's only worth going if you go during half off (weekdays 2-4pm, everyday after 11pm). My go-to is the Wing-o-Rito with honey chipotle BBQ and ranch. Super cheap, super yummy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RvbrRuUTm-feH2lNQ5Bc3Q"
  },
  "5NYOcw-oZNx0CcO81zl4MQ": {
    "date": "1/18/2011",
    "text": "With a Big Burrito gift card in tow (yay Christmas presents!), we headed over to Mad Mex on a Friday evening, around 6:30 pm.  Parking was pretty bad for Pittsburgh - we've never been to this part of Oakland before and it was just tiny, crowded streets, and students smoking on their porches while discussing drunken escapades.  Not the nicest neighborhood.  Inside, it was packed.  We anticipated a long wait, but actually were seated immediately - the noisy crowd wasn't there for dinner, just happy hour and cheap margaritas.  Apparently you get a table only if you are really eating a meal, which I have to say I appreciated.  The room was dark and noisy, but the noise level become much more manageable as happy hour ended and the drunk students left.  Much improved.  Our server informed us there were only a few minutes left of happy hour, so we managed to squeeze in a quick order of margaritas in order to get the discounted price.  $5 for their medium size (happy hour only) was a pretty good deal.  I had whatever their featured margarita was - frozen, with three different fruit flavors.  It was very tasty, gave me a light buzz, and didn't taste of mix.  Would've appreciated more than a \"light buzz,\" if you know what I mean, but for $5 it was a deal.  We ordered chips and salsa, which are unfortunately not free as they usually are at Mexican restaurants, but you did get a few fun salsa choices - we settled on roasted tomato chipotle.  I think it cost $3.  I liked the smoky chipotle flavor - but I still think it ought to be free.  It always seems greedy to me when restaurants charge for things that are traditionally free, like bread, or chips/salsa.    For my entree, I got one of the specials, which the server said was a great choice - the Jerk Pork and Fried Banana Tacos.  I have to admit, they were pretty tasty.  Pork was well-seasoned, bananas were delish (but I would've liked more of them!), but HOLY CRAP those tacos were hot.  And I love spicy food, truly spicy food.  But this - there were these whole slices of hot peppers.  I bit into one once, and couldn't taste anything for 10 minutes, it felt like my mouth was shaking.  Spicy tacos are one thing, but so hot that you can't even enjoy the meal?  I had to pick the peppers out, for my poor tongue's sake.  Rice and beans on the side were bland, which would have been annoying but ended up not bothering me given my temporary taco-mouth-death.  I know my boyfriend liked his chicken chimi, and I get the impression the food here is pretty good, and they do have some cool options.  But this location was so loud and collegey, I'm not sure I'd return.  I'd try a different location though, to seek better ambiance.  But you won't catch me paying for chips and salsa again - stingy ol' Mad Mex!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "yaBIVHDxaUBN2YHQ8-YiuQ"
  },
  "CNqh60MdfVbmvJdlBZF2eg": {
    "date": "4/17/2011",
    "text": "I heart Big Ass Margs Drink til someone pees their pants Talkin' bout you, Steph.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HLhA0dL8xHz9HgvAs7HWSw"
  },
  "w4gCcZTBkYOfepB2uKmOUg": {
    "date": "5/30/2014",
    "text": "The food is pretty unique which makes up for it not being authentic Mexican food. They have some interesting burritos which are fun to try but I only come here for half price because then the food is more worth it.  However, coming here late is rather uncomfortable as it is full of people drinking mostly margaritas (which are pretty amazing mind you) and some how the waiter uses that as the reason they can't lower the volume below deafening; I'm writing this review at a full table because we all agreed to give up talking till we leave.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bdzVC3up6Uvj21h6QJxj_A"
  },
  "SxZ1KQmyZlP2KIDH6ndZFA": {
    "date": "11/10/2011",
    "text": "I was only here once, but it was for a free lunch (courtesy of the Big Burrito Group, can't really remember why, lol)...so no complaints here.  It's a bit dark, unless you're by the window (limited seating by the window).   Nice chill place, but probably wouldn't be good first-date material. More like a place to go with friends.   I didn't have any alcoholic drinks (I had to go back to work), but I someday want to have one of their Big Azz Margaritas.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j59_wo6jD2sHdwUdj17j4A"
  },
  "ARz4OFb-LpvNRdkjzPTRIQ": {
    "date": "1/20/2016",
    "text": "Mad Mex is a staple in the Pittsburgh and Oakland communities. With a burrito and drink you wont spend more than $20. This place can get dank dark and crowded, but the drinks are strong and it is a casual watering hole. The Mexican itself is fresh and authentic and you always end up taking some home.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i4KbPr-sURiuXypvfDHYDg"
  },
  "wcN-3kdsmN7ofgCYlhYPCw": {
    "date": "3/17/2016",
    "text": "Super good but a tad expensive.  I got the grilled Mahi Mahi tacos. $14 for 3 small tacos. They were very good, but way too much aioli and not enough avocado. The aioli was EVERYWHERE and a messy disaster. Made it a tad hard to eat.  Rice and beans are good but a little bland.  Delivery through GrubHub! Which is good because the Shadyside one does not do delivery!  My husband also got tacos, and with tip and everything we spent almost $40... for 6 tacos? I mean, it was great, but wow... that just seems sooo pricey!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7ZpeUpUGSb4nHXeXWQGSdA"
  },
  "-SUVP5Il-Utk9T71AsHhyQ": {
    "date": "3/6/2016",
    "text": "For chain tex-mex, this is pretty darn good. Went on a Thursday night and had a shrimp-spinach-mushroom burrito, my boyfriend had the Thai tofu burrito and we shared a fried tofu app (forget the name). The Thai burrito was a little lacking in flavor, but the rest was simple and very tasty. Not high-end quality, but the price is right, the portions are **huge** and almost everything can be made vegetarian or vegan (they carry Daiya and vegan sour cream!).   Good selection of beers. Margaritas were too sweet, with too much triple sec, but I admit I'm a margarita snob. They were cheap ($5) and made with real lime juice, so still a thumbs up.   Atmosphere is a little chain-like and can be loud, but it's still cosy. Shout out to one server there who noticed I left my leftovers on the table and actually saved it- was so surprised to find it wasn't thrown out yet when I came back 30 mins later!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zlpS22VJzBR4WrbhvahBAw"
  },
  "oDVfnfsGAfhLNAVNRxjt2w": {
    "date": "1/29/2018",
    "text": "Mad Mex is my favorite restaurant in Pittsburgh. The margaritas are amazing and the service is always great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gPDImeCpYn8yBht-HWkqPQ"
  },
  "gl8CPYDzfxrQjXOgA-CPzA": {
    "date": "2/12/2017",
    "text": "I go on fridays. Always get the half off big azz marg frozen and always leave happy. I personally love the wingorito burrito and the servers are always on point. If you go after 11 for half off, you'll wait in a line. Other than that, it's a good place to go and jag out with friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f9a95S1VRowU1Imyf3WOwA"
  },
  "vLGygebNPevYq_jgc7g2Ew": {
    "date": "2/22/2014",
    "text": "I like the craft beer selection here. There are about a dozen and a half craft options on tap from breweries such as Great Lakes and Troegs. The beers are fairly fresh and continually bring rotated.  The atmosphere is nice too. The music is enjoyable and at an appropriate volume such that you can hear it and easily carry on a conversation. The restaurant is dimly light which is easy o. The eyes as the night caries on. The only thing I didn't like it that the decor obstructed the view of the television; however, Mad Mex is more of a place to catch up with friends than catch a game.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SqVUNVeYJblyoUz4e-Fiqw"
  },
  "71BvkZFyNQYHPelGpIbxqg": {
    "date": "10/16/2015",
    "text": "Let's start with the positives (of which there are few): the $7 margaritas were delectable. A True Mexican delight.  Sadly, it is here where the positives end. We (a party of 4) arrived hungrier than a group of overworked migrant workers and eager to satisfy our palettes with the heavily promoted Gobblerito. Little did we know, our evening would take a turn for the worse.  When we crossed the border into the dining establishment, we were given an estimate of 15-20 minutes until we would be seated. Let me tell you, when passing time with an irritable stoner who wants nothing more than to rest his weary legs, every minute feels like an eternity. After a half hour of standing with no food or drinks to show for our journey, our efforts began to feel fruitless. To keep morale up, the decision was made to order a round of margaritas before happy hour ended. What came next was the lone bright spot in an evening filled with disappointment and broken promises. The margaritas were an oasis of elation in a dessert of sadness. But the exuberance did not last long. Shortly after, we learned that a table had been vacant the entirety of our stay. However, the restaurant's laws stipulated that only a party of 5 could immigrate to the table. We. Were. Livid. No bueno.  Long story short, we waited for an hour to no avail. Don't go there.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nx02FDBt8LeeFmkBuMt1YA"
  },
  "6qkMyFLqkXEQFns7GiUKBg": {
    "date": "12/3/2015",
    "text": "I usually don't make my way down Atwood to Mad Mex, considering just how many yummy eateries are right up the street (Las Palmas! Bangal Kebab!). Luckily, Mad Mex has a tendency to offer up some pretty convincing deals every once in a while.  If you sign up for their birthday club, you get a coupon for a free burrito you can use around your birthday, and/or if you're a student, you get half off food Monday-Thursday from 2-4 PM. There are also many more deals listed on their website... seriously, saving money here requires only minimal planning.  I went with a friend around 2 PM for the student deal. We split some guac and chips, he got the fish tacos (not covered in the deal), and I got the thai curry burrito.  FOOD:  + I like the guac here better than at Steel Cactus, which I visited recently. You get salsa in addition to the guac, and the chips are also thicker and have some flavor on their own. Could be personal preference! + My burrito was delicious, and the sauce was creamy and tasty. + My friend enjoyed his fish tacos too, and I kind of ate them with my eyes.  SERVICE: our server was really nice, but she wasn't around our table that much. Small mistakes here and there, like I asked to get my burrito as a Bare-ito (like a bowl), but it came out with a normal wrap anyway. Also, the appetizer wasn't discounted like it should have been when our bill came, but she quickly corrected it once we let her know.  ATMOSPHERE: it wasn't a super busy time to go, so the place definitely wasn't as loud as some other reviews say. Still had a little bit of trouble talking over the music though. It seems like a good place for small meetups with friends.   Not dying to go back anytime soon, but I think it's still a decent option for this kind of food in the area! Three and a half stars for me. :)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IhB3dvBjH5gWp__Ae1VxIw"
  },
  "8PHvo2S4bDxs4EAV0tBJDQ": {
    "date": "4/20/2017",
    "text": "I always find myself returning to Mad Mex for the food and the late-night deals; however, the service there is horrible. I've never been to Mad Mex and had an attentive waiter.   When the water-boil was in effect our waiter gave us attitude for asking if their water was contaminated.   Recently, after sitting, it took us at least 10 minutes to have our waiter come and take our order. It took even longer to get water. Once we were finished, he cleared our plates and didn't come back for another 15 minutes to ask if we needed our checks (we were just sitting there with no food and no water...)   Basically, every time I go the service is really sub-par. I'd be much more inclined to go more often if they had better waiters.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pF72EiSCxxMdM5ezyLgMMg"
  },
  "VcDRxiWL8M99py6BRS3BFQ": {
    "date": "2/3/2013",
    "text": "I love this location. Vibrant, packed with the higher learning population, always busy and like all Mad Mex restaurants the food and beverages are outstanding.   Mad Mex is one of the few restaurants in the city that can make about 90% of whatever's on the menu and make it vegan or veg. And, if you have other dietary needs like lower fat options, they'll accommodate your needs. That's how we'll they take care of their guests. I love the angry hippy quesadilla, sauteed spicy spinach, mushrooms and vegan cheese stuffed in a whole wheat tortilla, grilled nice and crispy, served with the best guacamole in the city and a tasty vegan sour cream. Wash that down with one of many micro brews on tap and you'll be a happy mad mex fan.   By the way IPhone users, download the free Mad Mex app and you'll know exactly what's on tap at the nearest Mad Mex!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "UsmTxWbobLsI6WR1Db0W7A"
  },
  "zPWHMepXdMBVoMnVJ2T_jQ": {
    "date": "12/15/2015",
    "text": "I love this place. They're constantly having deals, my go to is from 2-4 students (with IDs) get most of their menu half off, really cannot get any better than that.   The food is amazing. I always get the mad Mex burrito and no matter how hungry I am I can never finish it, good news though..it seriously tastes just as good the next day. Their jersey chips are out of this world..(get them with the ranch and wing sauce and thank me later!) not a big fan of their guac, there isn't enough flavor in it for me but forfeiting guac is a small price to pay for eating the rest of their food.   The service is kind of subpar all around. The servers are ALWAYS nice and friendly and fun but just seem to come to the table few times even when they're not that busy. My most recent server (Charla??) was great though, the best service I've had yet!   The atmosphere is not for everyone. The tables are pretty small and very close together, like you're dining with people you don't know. And the music is LOUD, when its a full restaurant it's to the point that I honestly just sit and eat because it's pretty impossible to have a conversation. Other than the noise level and the seating, it's a pretty awesome place, their style is not boring at all.   Bottom line: you need to eat here. The portions are huge, the foods great, and you'll leave with a full happy belly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W0trZ9jEzExL3EOC2MyD-w"
  },
  "vFJCWcb0meTDBZj5fnKTlA": {
    "date": "11/21/2014",
    "text": "True fact: I haven't been to a Mad Mex in over two years.  As you might guess from reading my review of the Shadyside Mad Mex, this is because I've generally been unimpressed with the quality of the food, and I'm not a fan of super-noisy places. However, I'd heard rumors, beginning last year, of a curious and delicious seasonal entree known as the Gobblerito--a burrito filled with turkey, stuffing, and mashed potatoes, with cranberry sauce on the side.  This fall, I vowed to try this chimeric creation, and receiving a $5 off coupon for being on the Big Burrito mailing list sealed the deal.  So, last night, I ventured over to the Oakland Mad Mex, which I'd never visited before, with a friend to consume the beast.  My friend and I started off with 12 oz. pumpkin pie margaritas--this month's margarita flavor--which, thanks to happy hour, were discounted to $3 each.  They were all right, but not quite as flavorful as other margarita flavors I've tried at Mad Mex.  After perusing the menu, she decided to order the portobello enchiladas, whereas I, needless to say, ordered the gobblerito.  Our food came out about 10-15 min. after ordering, and the food runners confused our orders, which I quickly (and passionately) corrected.  The gobblerito, while pretty substantial, wasn't as gargantuan as I'd pictured it--its dimensions were roughly 5\"x8\".  While it was quite delicious, savory, and interesting, I wasn't quite as blown away as I'd hoped to be by the experience.  I found the amount of gravy on it rather skimpy, and the contents weren't evenly distributed throughout the burrito. It was still pretty yummy, however!  Surprisingly, I was able to devour the whole thing in one sitting--although I considered stopping 3/4 of the way through but decided against it, given that there wouldn't have been sufficient leftovers to justify another meal.  Although I didn't try my friend's enchilada, since I was too busy putting away the gobblerito, she told me that it was quite delicious.  However, she pointed out to me that, when she took out the leftovers for her lunch today, she found small pieces of chicken in it, which she hadn't noticed last night due to the dim lighting.  Fortunately, she isn't vegetarian, so this wasn't an issue for her, but this leads me to question their practices when it comes to vegetarian food preparation.  Service was generally good, although it was pretty busy at the time of our visit (6pm).  We were able to get a table right away with no problem.  As for the atmosphere, similar to the Shadyside location, it was quite dark and boisterous, but much smaller and more intimate.  Overall, eating the gobblerito was an interesting experience, and I'd definitely recommend trying it if you haven't before.  It was good enough that I'd probably do it again next year--especially if I receive another coupon--but not perfect by any means.  Truth be told, the gobblerito is about the only food-related reason I'd revisit Mad Mex--though I'd be willing to come back for the margaritas, for sure!",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 7,
      "cool": 10
    },
    "photos": [
      {
        "img_id": "x_GsTmCs2PNMHeE-F3VhaQ",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Sangria margarita (12 oz.)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/x_GsTmCs2PNMHeE-F3VhaQ/o.jpg"
      },
      {
        "img_id": "e5zsZEZ3DOyINOOuj3X0jg",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Black bean dip and chips",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/e5zsZEZ3DOyINOOuj3X0jg/o.jpg"
      },
      {
        "img_id": "U-AamlxY6vMYJnNNwaXn5w",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Happy hour margs!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/U-AamlxY6vMYJnNNwaXn5w/o.jpg"
      }
    ],
    "user_id": "135DbbQnr3BEkQbBzZ9T1A"
  },
  "7V2yhb6Wc-v6cbYUKgOzCA": {
    "date": "9/14/2013",
    "text": "I can see why it'd be a great college hangout. I'd literally never stepped in here before since it looked so sketch from the outside. The inside is also a bit dingy - poorly lit, smells a bit like the entire place has been wiped with a mildewy towel soaked in disinfectant - that smell. A bit unpleasant but not so overwhelming I guess.  The portions are so generous for the price normally, and the deals they do at random times of day/night are even better. We definitely only ate half each in addition to chips and sauces (do the pick 3 for $8! you get a lot of everything).   The food was alright. Pretty good. Nothing out of this world, but above average and exceeded my expectations. And the margaritas were super strong. But it's good! For the price I'm very happy, since it's almost as good as my favorite margarita that costs twice as much. And it's like $3 at happy hour? Can't beat it.  Would I ever crave their food and come out of the way just to eat here? Nah. But happy hour margaritas and some light snacking on cheap food? Hell yes! Unfortunately apparently most of Pitt campus agrees with me so it gets too crowded at night :(",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jXX-G_goCYZZrLSDY8qXdg"
  },
  "S_NHh04ObykDdfA2fHq9dQ": {
    "date": "1/24/2015",
    "text": "My boyfriend and I came with two of our friends for a late night meal on Friday night. We arrived around 10:30pm and was starting to get crowded by the bar, since it was so late for normal dinner there were tables and we were promptly seated.  We started off with a Big Azz Strawberry Margarita on the rocks with salt and our friends ordered a Raspberry to split. They were on special 22oz for $7. They came out fast and were strong and had good flavor.    The waitress reminded us that at 11pm the food would be half off, so she said if we wanted to wait a few more minutes with our drinks, she would be happy to bring out the chips and salsa and come back for our orders.  I thought this was really nice of her to make sure we got their late night (11pm-1am) special that features their menu at half price.  I was kinda bummed they didn't have fajitas because I had been craving them, but my boyfriend and I happily settled for the Mad Mex Fajita Burrita with chicken. Also included inside was grilled peppers, onions, black beans and Monterey Jack cheese. We also got the California Grilled Salad with carnitas thanks to the suggestion of our waitress.  It did not disappoint,and was easily large enough for the two of us to split. The lime-cilantro vinaigrette dressing was the perfect addition to the carnitas and avocado in the salad. We were easily stuffed by the end and our bill came to under $20.   The atmosphere at Mad Mex is chill. Very fun and inviting place to hang with friends. I would gladly come back and try Mad Mex for round two!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "nHWdtJ-NBVru4av1JGQndw"
  },
  "lRGZY6Ldl__m_iJjLwr9mg": {
    "date": "7/1/2013",
    "text": "The food here is pretty decent but the atmosphere creeps me out the most.   It's pretty grungy looking on the inside and the people that walk in are usually bros who want some margs and wings. While they do have some good items on their menu like their hummus and the angry hippy quesadilla, I'm still put off by their cleanliness and the fact that it's so dark there I can't see my food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BkMqpJikNc3r5itc-ui6ww"
  },
  "APa6vPHV5Jbr4pq5vpTkZQ": {
    "date": "6/10/2011",
    "text": "I went during Happy Hour for Half Price wings. Not many other folks there.  Had the San Francisco wings. Good value and nice presentation. My personal taste is the crispy deep fried wings though like they have at Gene's Last Chance in the Strip district; otherwise, I would bump the review up another star.  There is a mid-day half price food discount for students along with the 11p-closing for everyone. I'll definitely have to come back after 11p to try a burrito or something.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oD0DeJbTsAyTMMvg3gYY8w",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Mad Mex Burrito",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oD0DeJbTsAyTMMvg3gYY8w/o.jpg"
      },
      {
        "img_id": "8WXIvLgvpbm8DkXtf8PtOg",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. San Francisco Wings",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8WXIvLgvpbm8DkXtf8PtOg/o.jpg"
      }
    ],
    "user_id": "x9rkVoNB92HR_bFOe6MFTQ"
  },
  "fxsWVstBU-JBg7lFlIAE-w": {
    "date": "10/15/2016",
    "text": "In from out of town, a local friend suggested this place, and even recommended what to order. Local recommendations go a long way with me. In a quiet neti or hood, inside it was happening. Four of us came for dinner, and two of us ordered the Gobblerito based on the recommendation. I'm glad we did. Coming from Arizona, I don't normally go to a Mexican restaurant when traveling, but getting a local favorite and house specialty was the way to go. The Gobblerito is white meat turkey, mashed potatoes, stuffing, and corn wrapped in a delicious tortilla and smothered in gravy. Served with cranberry sauce, sour cream and guacamole to garnish as desired. Our server was great. I highly recommend trying this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EkFKfkT6AsaV9aLoU3pr8A"
  },
  "a_Pd9wzfsuRRbUu1KfwF3g": {
    "date": "2/15/2015",
    "text": "The basics about Mad Mex are well known around Pittsburgh: good margaritas (with good variety of flavors), great wings that can get very hot (if you're into that), and burritos that aren't finger food.  The thing about the Oakland location that really disappoints me is the seating.  I've gone probably 10+ times in the past year and every time I've went with one other person, they seated us in one of two VERY uncomfortable places.  One option is in the middle of the restaurant with people walking back and forth and knocking into your chair every two seconds.  The other option is at a 4-person table sitting next to another couple like we were together, which made things very awkward.  I understand the staff wants to get people sitting down and not waiting by the door but that doesn't make it any less uncomfortable for patrons.  It would highly recommend a new layout to open up some space, but at the end of the day it's a college town restaurant known for its drinks.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D9NEhYwmbitOdfOoUoEYOA"
  },
  "mlHJoTaSavV3SFsI7N_CGA": {
    "date": "9/5/2012",
    "text": "Mad Mex Oakland, how I want to love you...I want to love you so bad. In previous reviews of Big Burrito restaurants, I noted that the group could do no wrong. Estaba equivocado--disappointment, thy name is Mad Mex.  I don't want this review to be completely negative, though. The margaritas are awesome. The beer list is sweet. They were one of the few places to sport a keg of the Brooklyn Black Chocolate Stout last year. Coming in, sitting at the bar (if you can get a seat), getting an appetizer, and having a good ol' fashioned college night on margaritas blurs together some of my favorite memories of Oakland.  Every time I make an attempt to eat a substantial meal there, though, I'm reminded again and again as to why I don't go back for years.  This review is nearly five years in the making. That's almost five years of consistently poor service, mediocre food, and minor mistakes--I've gone through everything from a take-out order being filled incorrectly to being charged for drinks I never received to waiting a long time for a meal (no biggie) only to get the wrong meal (it happens) only to receive the right meal with incorrect options (sour cream instead of guac, what was asked to be on the side wasn't there, etc.).  There have been up-sides to it, though--servers waiting ten or fifteen minutes to put in our order because we want to take advantage of Happy Hour; usually, as long as it isn't too busy, you can hold a nice small conversation with the servers or bartenders; the ice cream burrito is pretty tasty...but, the downsides are all too common, and nothing has changed in the five years that it took to reach these two stars. The gobble-rito seems like a good reason to try again, and I'm sure in another two months, I'll find myself asking, \"Why don't I go back to Mad Mex?\", once again completely forgetting the experiences I've had.  I am so sorry.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xhVlmdU1sPVH6GBJw6AZtQ"
  },
  "e9LyiyKKHCk2XonQuTXGgg": {
    "date": "12/13/2016",
    "text": "Great for drinks! The Big Azz margaritas are fantastic. Usually, the food is good but recently I was pretty disappointed. I ordered a Mad Mex Burrito in a bowl without the tortilla and it was kind of dry. I had to ask for more salsa and it was still pretty dry. The service was great though. I highly recommend for drinks and nachos.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wTIR6ine2Eoz9LlMvNI4sQ"
  },
  "YMDr0byBSXNSE_V5fkZ9Xw": {
    "date": "1/22/2009",
    "text": "Ten years ago, this place was inventive and delicious.  It is still a very consistently decent place to eat, but other establishments, including the fast food places have closed a lot of ground.  Mad Mex still has great chickpea chile, and nachos etc., and the burritos are still a bit different from the standard chicken, beef, pork fare at Chipotle or Qdoba.  But these other establishments are no longer miles away.  Mad Mex could probably do with updating their menu.  At least they still have the thriving bar scene that differentiates.  I think in general, that too many of the reviews revel in the 50% off value as opposed to the intrinsic value of the place.  This is -- to me -- an indication that something needs to give.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RvdWOF9kC5Q4qgjw9PbVow"
  },
  "rKRiHo97XXHBpLjxxwNQIg": {
    "date": "10/20/2009",
    "text": "I enjoy mad mex and their food very much. I always have a good time when I go there. My only problem with Mad Mex is their servers. My friend and I always seem to get not necessarily a rude server but they just never seem happy to be there. I understand they have to serve drunk pitt kids who come for the margaritas, but when they bring you your food they look like they want to kill you. Besides the service the food is as always very fantastic. My personal favorite is the beef chimi and I absolutely love the bean dip. Mad Mex gets 3 stars",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j5gVSq-dBGL7zFHh15rZ2g"
  },
  "aK0D6xt5pTmVVTIW-0O0sQ": {
    "date": "5/14/2005",
    "text": "Best burrito in town, and essentially a copy of  San Francisco cuisine. Show up for happy hour after 11, it's half priced food and half priced stellar margaritas.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c8qFkI_VusWo0xZvkjfBWQ"
  },
  "RTGgEG-KiVKCY_FsZoaTcw": {
    "date": "1/21/2010",
    "text": "First.... would love to see the filth on this place with the lights on.... seriously... I think the dim lit ambiance is mask the bacteria in this place.    Food - its a sad day when all i can say is that the wings are the best thing at a Mexican place.  The Carnitas was actually decent  but ruined by too much spice.  I know this is not meant to be authentic Mexican food but  a Tex-mex  classification doesn't give you the green light to overpower everything on your menu with Chili powder, Cumin and jalapenos.    I'm 1/4 Mexican - grew up with Mexican food - love spicy food - put hot-sauce/salsa on everything - eat jalapenos regularly....   Mad Mex - barley edible.    Gives tex-mex a bad name as I know there is great pride and a lot of heart and soul that goes into True Tex-mex.    I think people go there - get drunk - then think they are eating good food.  Only conceivable way anyone could give this place anything over 2 starts.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gwDlM1-ldXOvApXHuT1BYA"
  },
  "tGf1_Gg8N1x0FXabOcJChg": {
    "date": "4/12/2010",
    "text": "Having recently moved to Pittsburgh from San Francisco/Bay Area, it's good to find a place that fills that special niche of places that serve Burritos with tofu as an optional filling. I've been to Mad Mex three times now and each time it has been good. I can't speak to the meat dishes, but the Mad Mex Burrito and Spicy Mad Mex Burrito (both with Marinated Tofu) were delicious, as was the Herbovore Tofu Taco.   I was a bit disappointed by the salsa that came with the tortilla chips. It was too thick and had a strange smokey taste to it, but I can forgive Mad Mex for that, because everything else was good.   Pittsburgh still seems to be missing a good authentic Mexican place that serves up a burrito like you can find in the Mission in SF or pretty much anywhere in CA, but Mad Mex fills its niche nicely.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iQwtYQyEDe7zFDf8XyxzPg"
  },
  "Djw7fNx3yglxp8NKTbwKbQ": {
    "date": "3/22/2011",
    "text": "you really can't beat the food at mad mex, and there's a good selection of beer.  one thing: the service sometimes lacks, particularly if you're eating at the bar.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "benfF2qIwxDz7TCeF1XWIA"
  },
  "NYuaFsrUXTIl8cdDpaelEQ": {
    "date": "1/9/2012",
    "text": "I had been to this place more than a few times and tried the chicken in just about every shape and form. I've had the Chicken Tacos, the Chicken Burrito, Chicken Fajitas and the Chicken Quesadilla. Someone on here calls it modern Mexican Food, I just call it fancy shmancy and artsy fartsy. No matter what I order it just tastes like it has too much pepper, a little sour and nothing like authentic mexican cuisine. First of all the Salsa sucks. It's just not good at all nor are the chips that go with it. I don't think many people are used to paying $4 or $5 for chips and salsa when they go to a Mexican place. I know I am not. In every other place on the planet It is free and usually arrives almost before you are handed your menus. Last time I went for lunch I tried the Tortilla soup. It had the consistency of a butternut squash soup with zero chicken inside. If I did not read it on the menu and was just handed a cup I would never have guessed what it was. Their Fajitas are painfully average, Not sure if you like paying over $10 for the equivalent of one thinly sliced half chicken breast and some fried peppers and onions. Just seem like less quality than I am used to recieving. The rice is mediocre and usually comes cold on the plate, the black beans have an over bearing peppery taste that I could definately do without. Their roasted red pepper sauce put overtop the Chimichange may be gourmet but it is too sour and tastes like stomach acid. Not really what I would call delicious or even a sought after flavor. I just never got this place. I think it is has more of a draw for people wanting to go drink in a trendy place that is popular with the 20 something dirty panty crowd. In my opinion if you want a good burrito and don't need to have a few drinks before eating it just walk into a Chipotle and pay your $6.50 and be on your way. Save yourself from overpriced food and over tipping the short stocky waitress with glasses, messy hair and no makeup on that seem to be in every Mad Mex. I think it must be a pre-requisite to working there.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YmZb7nsmeufYcsjhg84zcw"
  },
  "TormsW9iMtAa2DZVnFDi4w": {
    "date": "4/23/2011",
    "text": "yummo! sign up on line at their website and get a free burrito for your bday.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q0Bs5ObN4w2U5WHs2gLsPA"
  },
  "1YBtW1r3uepNqfqJ9ksqVA": {
    "date": "8/18/2011",
    "text": "Gross. The chips were stale, blah. I ordered a burrito. It came out in a square shape and had the texture/ taste of a microwavable burrito. My friend got enchiladas which he hated-they weren't real enchiladas but a glop of goo with a tortilla on top then sauce and cheese. I will not be going back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_0qwia50lI5bjoFflPbL6Q"
  },
  "4K2mFwgTlS31BgTEbALo0A": {
    "date": "3/15/2010",
    "text": "been here twice, first time threw up b/c i drank their \"big azz\" margarita too fast and second time just came for the happy hour margarita. the margaritas are pretty strong, happy hour is $7 instead of $9 but they don't let you sit at the tables unless you order a meal, not even just an appetizer. that was annoying. had my margarita and left.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e2qr-1eYo1y5FxuR6SGJkA"
  },
  "NrPPUJQnYRxEuVNFvFt-eg": {
    "date": "9/11/2007",
    "text": "I have have to disagree with the below poster.  I was turned onto Mad Mex during my college years because the opportunity to eat out at half price was worth it.  Furthermore, their veg. friendly menu was satisfying and NEW at that time (tofu in a dish... WHAT?).  So I have continued to deal with lousy service and horribly lighting for my tofu burritos =)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "g3V76Ja0XgWS1rqx0gxL_A"
  },
  "xE2tqeHMOxbClDydAl8DDw": {
    "date": "1/9/2008",
    "text": "Meh. The food is overpriced, not that tasty, and they got my order wrong when I went there. To me, their main appeal is their trendy atmosphere (though it doesn't feel like a Tex-Mex place to me at all).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XnBwXP2xlwiNg6tcnkL_1Q"
  },
  "jay62Zv8dYaCqKCxOfVz3g": {
    "date": "12/7/2012",
    "text": "One of my favorite places in Pittsburgh! 7dollar Big Azz Margaritas after 9!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u9cWbmppqHUahCzDKO3dWQ"
  },
  "AoPD0ldLDw8xRh_HvdiV1Q": {
    "date": "9/2/2009",
    "text": "Mad Max is a great place if you're looking for good burritos, and if you have vegetarian or vegan restrictions since they have vegan sour creme and cheese.  This little place can get packed and you'll be shoulder to shoulder with someone you don't know, but the food is well worth it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "p-o-ISXQKhJpPu_lzf0A-Q"
  },
  "Oe-OI9Ba5r8-QWoTMxmNCQ": {
    "date": "3/15/2007",
    "text": "WHAT'S UP COLLEGE?  THis place was the FAVORITE when I was in school at Carnegie Mellon.  Given that was nearly a decade ago, and who cares that I'm reliving my youth through memories of a kickass restaurant, I still think this place kicks ass.  And I'll kick the ass of those who don't.  (fine, I won't).  Seriously Mad Mex was a place that was known for its after 11 \"half price food\" and kickass drinks.  I remember a night with my friends where we sat across from a table of girls that were more interested in each other than us, we ate a shitload of food with habanero sauce on it, and we drank a lot.  College was exactly that.  The observance of women, the ingesting of food, and the imbibing of beers.  Awesomeness that I'd love to repeat.  Daily.  Just go there and love it.  Don't debate its qualities of food or its noise-issues.  Just love unconditionally like a dog.  I do.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xrF8AYyV5sfRVceclZv-Rg"
  },
  "Ja2b8UGbQrDOn5KDpELU-w": {
    "date": "11/16/2010",
    "text": "great bold Mexican restaurant with a punk flair to it. Go there a lot for half off (because im a broke college student). Definitely recommend their burritos. I haven't been able to test their bar skills but it looks super good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LudMjWsTakIA1rxQaD_Adw"
  },
  "vjafPqfotSYh_8WQrySWLA": {
    "date": "12/29/2007",
    "text": "The FOOD = awesome.  But the aptmosphere sucks...    We used to come here for 1/2 price after 10 or 11 or whatever it was, in college.  I fell in love with their chick pea chili burritos.    Con - they wouldn't or couldn't make them without onions for me and it's too fucking dark to see to pick the onions out.  Pro - since it's too fucking dark to see to pick the onions out I just gave in and ate them and learned to like something I otherwise might not have tried/liked.    I really hate how dark and loud it is here.  It's kind of pointless to go in a big group because you're only going to be able to talk to the people immediately next to and across from you and it's a pain in the ass to get seated.  I much prefer the McKnight Rd location - is it still there??  Every time I am back in Pgh I mean to try the Robinson Town Centre location but I always forget until we are driving to the airport and I see it.  Maybe next time...  Love their chips and salsa.  Love their black bean garlic dip.  As I said already love their chick pea chili (have learned to make a knock-off to satisfy me out here in CA but it's just not the same...)  But avoid this location unless you're hurting for cash and/or have no transportation.  It's worth a little extra money to be able to see your food and hear your dinner companions.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BBLpIfJSBQPKT-KgcUm6Zw"
  },
  "p8YXkphVaHPqKHh6BJREcQ": {
    "date": "6/20/2010",
    "text": "Margaritas = Amazing Happy Hour Pricing = Pretty sweet deal  Service = Awful (always) Ambiance = Sucks unless it's some off-hour (e.g. don't go for intimate conversation) Bathroom = ::shudder::",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AYrWf7nJU1YKbHdet7oRAQ"
  },
  "yYNBSgWj2mvd0AK8eguuEQ": {
    "date": "8/20/2009",
    "text": "They have multiple locations across the state of Pennsylvania and one in Columbus, OH.  I have only been in the original location, which is in the Oakland neighborhood in Pittsburgh.  It is a tiny building, and it is often *loud*.  The later you go, the louder it gets.  Personally, I think a lot of their burritos taste the same, though it is a very good taste.  I like their pickadippa and potato taquitos.  They also offer lots of options, like meatless or vegan versions, or the choice to turn a burrito into an enchilada, and vice versa.  Everything is priced decently, with half-price food at a variety of times (depending on the location) and lots of great specials for holidays and such.  The Big Azz margaritas are enormous.  I enjoy the frozen strawberry.  I often get the small, and I usually can't finish it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lwCt_LgGAbPQpNRpaDR_Fg"
  },
  "12YOCJb0zuKue-F7ysHGSg": {
    "date": "9/8/2010",
    "text": "This place started out being great, but it seems that every time I go there the food gets more expensive and the margaritas get weaker. It's a really popular place but I am not on the bandwagon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lGMcYC0AN8feTcgwEs4LYQ"
  },
  "GYnJ7hD4UW3yW6OkxNZujA": {
    "date": "6/24/2010",
    "text": "I'm not a college student anymore, but I love coming to this place. It has a really grungy atmosphere with some crazy decor on the walls.   The seating is waaaaaaaaaaaay too close, i dnt' want people listening in on my convos. The food is so-so, really greasy, and a lot of it is deep fried, but for the most part i come away satisfied. The service is usually pretty dismal. The atmosphere is great, the drinks are reallllllly good!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZP83jnDKlbYqNVj6P8rUTQ"
  },
  "I0Pdb3scQAs4rMAELxptLA": {
    "date": "11/14/2012",
    "text": "Rude staff and dirty facility.  We left.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iP8QC4NSHjOWsWY5Re2T0w"
  },
  "2DaTc5JIqfCxl8aMfg-_vA": {
    "date": "11/13/2010",
    "text": "Went there to celebrate with some friends and I was excited to try some Mexican food - something I'd been missing since I moved from San Diego to Pittsburgh.  Since there was a long wait we got margaritas and waited for the tables.  I got a strawberry margarita, but the flavor was unnecessary as all I could taste was cheap, nasty tequila.  Gross.  To mitigate the taste and try not to be sloshed before dinner we asked for some chips and salsa while we waited.  When we finally got some (15 minutes later) I was buzzed and disappointed.  The chips and salsa were worse than even the store brand from the supermarket.  My opinion, if a \"Mexican food\" restaurant can't do the good chips and salsa and margaritas, I don't even want to try anything else.  We paid our tab and left before our table was even ready.  No thank you.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zetXIZ331v7qRJvUX4yPIg"
  },
  "TzZfwgFL5FVFsCSDk0MnFw": {
    "date": "7/3/2007",
    "text": "Drink atleast 5 of the BigAss Margaritas, Trust me on this one.  A burrito will soak up all the booze from atleast two of those puppies right?",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ff5IHtlp6ATxEu_Erda_tw"
  },
  "wo_RgTWGKc6uSMHF0LOwaA": {
    "date": "8/17/2010",
    "text": "I've been here a few times and really enjoyed the restaurant, so when my parents came into town for the first time I thought Mad Mex was a great choice to show them what Pittsburgh had to offer. I couldn't take them to the restaurant because it's too loud there, so I ordered carryout.  The food took half an hour longer than they said it would be, and when we made it home, the entree I had ordered (and been charged for) was missing from our overall order. They refused to send the order via their delivery company (which in fairness was open another 15 minutes), but they offered me a free entree card that they are supposedly going to send me in the mail. Hopefully it won't disappear on the way here.  The entree card is all well and good, but my family was less than impressed with the restaurant I took as a representation of Pittsburgh - Mad Mex.  It's a fine restaurant, but avoid it for takeout orders.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VoDaollr4r3UIIPH9FPGHw"
  },
  "kDrfmZrv2u3NUNwzYAK4Cg": {
    "date": "10/9/2009",
    "text": "My chickpea chili was good.  I still haven't a burrito or margarita at mad mex, so I don't feel like I've had the whole experience yet.  But my chili was good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gxRw9c2lvijXBNhKU5i7_g"
  },
  "imR1gtZVa5SCge63gjFi_A": {
    "date": "9/6/2011",
    "text": "Fun Tex-Mex type place in an attractive setting.  Nachos were great, service was attentive, noise level was not too loud, and the entrees were all delicious.  One quandary:  wouldn't one expect the chopped salad to be, well, chopped?",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-KduD3wwydWDq2GrODh2tw"
  },
  "1S57ifJbQ-rb2e1RwX_G5Q": {
    "date": "1/4/2010",
    "text": "The margaritas and chicken wings are great.  The place is really loud sometimes and the rest of food is just OK.  The corn bread used to be better but somewhere a long the way they changed it and its not as good nowadays.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-oORwGhuHqfdaHVbT7mumQ"
  },
  "wNNfU6qIdAfFA6IOaEcn1g": {
    "date": "6/23/2012",
    "text": "Los wingos wrap, wild, with waffle fries and ranch!  Got frog legs on leap day a few years back during a crazy snowstorm, which were awesome!  Shamrock-a-rita for St. Patty's day was surprisingly good.  Oh yeah, half of student special during the day for food, happy hour drinks, then half off late night menu makes for a solid evening.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qYjTUXZs2h-dW6DWs-8Ajw"
  },
  "ODmgfY6Y2C-C-PXbeO6cug": {
    "date": "10/14/2007",
    "text": "This place gets four stars because it is vegan friendly.  A bit pricey, I admit, but try and go for the half-price menu, after 11 pm and if you are a student, sometime during the early afternoon (can't remember the times).  Happy hour is always crazy, with half off Margaritas and wings.  (Get the San Fran - yum!)  Take note - it's dark and NOISY, so don't go here for some intimate talk!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7sAkIM47_LE99Hyg5lwdrg"
  },
  "TddmocLVpG7_ADQlXigpXA": {
    "date": "8/17/2009",
    "text": "i came here late at night for the half price burritos and cheap huge ass margaritas. i had the angry hippy with portabella mushrooms. the food is tasty and the margaritas are delicious. it was a friday and it was packed. the atmosphere was lively and fun. the waitress/bartender was really nice, fast, and very attentive.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dL1NppPS5J2OKk_6doYBxQ",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. symbols of content: angry hippie and a big ass margarita",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dL1NppPS5J2OKk_6doYBxQ/o.jpg"
      }
    ],
    "user_id": "vSBv-UgHU3UoPLOJx7Gdyw"
  },
  "28hWKzmUh5AReXaOPkageg": {
    "date": "1/4/2009",
    "text": "Half price after 11PM, which is a good reason to go for college students.  I went here pretty often.  Things to try for sure are the blue cornbread and any of the burritos.  The quesadillas and nachos aren't bad either.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5gdl9c9UkxF1TZa7AAlIgg"
  },
  "LfRkfkBfZlfb0TetJjfkQg": {
    "date": "8/31/2018",
    "text": "Hello, I am a university student and went here with a group of my friends with the intention of a cheap filling meal as that is what all of the reviews said. However, one of my friends ordered the chips and guacamole and she asked the server how much it was he told her it was about $3.50. When we got the check it was listed as $8.50, in their defense we could have checked the menu but the server should have known the correct price or even been close, but he was not. In addition, the food was subpar at best and I have definitely had better mexican food. In conclusion, this place is good if you have never had mexican food before and are super rich. But if you are a college student-- DO NOT GO. That is all. Thank you.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KA0fMNF_pVEW6NCn519hNA"
  },
  "iOBuQsc1BeTCL2vxSzaCig": {
    "date": "8/21/2018",
    "text": "It's safe to say I'm a regular here. They have the best deals ever especially for students, who get half off food from 2-4 on weekdays. I always come on weeknights with my friends for $7 frozen margs, which are huge and delicious, and half off food. They have countless vegan and vegetarian options. I always get the vegan nachos and tofu wrapture. One of my favorite places to go in Oakland.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QiKx7uHY4g4Xp0X2YmL73Q"
  },
  "hJnFMq6td2kgfGgjlt_Iuw": {
    "date": "9/7/2016",
    "text": "I never not have a good time at Mad Mex, but I feel like I never have an outstanding time.   We got there after walking around in the heat for the better part of the morning. I think my entire party breathed a sigh of relief whenever we got into the air conditioning. I was pretty excited that it was looking slow when we got inside for lunch. Usually there is a crowd and the kitchen tends to take a bit. But today it was sparsely occupied so I had a good feeling about it.   We got sat right away and ordered some chips. This is my problem. The waitress never asked what type of salsa we wanted with our chips. She brought out one and it was too hot for the table. We didn't not like it, but it wouldn't have been our choice. So when she asked us if we wanted more chips and salsa we said yes, but asked for a change in the salsa, but, and maybe this is how it is always done, we got charged for the change in the salsa. I thought that that was kinda weird. But, maybe that is how it is supposed to be done?  Appetizers: Chips and Salsa: I would suggest going for the corn salsa, it is my favorite and always a go to for me. Really fresh tasting and chunky. My favorite of all the salsas.   Lunch: WING SALAD:Boneless chicken wings in your choice of wing sauce (see previous page) roost on mesclun greens, cucumber, red onion, cherry tomatoes and Monterey Jack cheese. Ranch or bleu cheese dressing on the side.: I get the honey chipotle bbq, BUT always on the side. Honey chipotle bbq is my favorite of all of the wing sauces. I tried to like the San Francisco, it didn't happen. The salad was super fresh and all of the veggies in it were crunchy and fresh. I enjoyed it. It was refreshing. I was also really impressed about how much chicken was on the salad. I was not expecting that much. This salad was also big enough that I brought it for lunch the next day because I could not even try to eat it all. YUMMM. I will be getting this again. I think I might have found a new favorite thing here! It was a perfect mix of wing and salad, two of the things that I wanted but in one lunch choice!  Drinks:  Here is where the stars dropped. Our table ordered 3 WATERMELON MULE s BUT THEN..... The bar tender came to our table and said that he had only enough stuff to make one. He was in the process of making the stuff but....for now only one was left. That is fine... But two of our party were disappointed.  I got a margarita that was mango/raspberry and it was great. No complaints about those at all. Yummy and refreshing.  THEN I ordered the PINEAPPLE BASIL MARGARITA. It was just eh. I didn't think that it tasted like pineapple or basil!! I couldn't really pick out what it tasted like other than boozey. Eh. Probably not going to order it again. I was really excited to try this and it left me just kinda, sad?  I work in Oakland so I will be back soon.  Not to get the pineapple margarita but probably for my favorite new salad!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "-hietrA8M58asfpyJkCyiA"
  },
  "AksYyuz-ssBGYufVouRYag": {
    "date": "11/18/2015",
    "text": "Came here for my first late night with my CMU homeslices, and right away I understood the hype.   Almost everything was half off, and for every broke college student that's a steal! The wait in was a bit long, but it was worth it!  Once we sat down, service was slightly chippy at times but it made sense since there were so many people in for late night.   I ordered the southwestern wings which were surprisingly crispy and flavorful, and the nachos we shared had super tasty guac on top!   Overall, great portions, great food, but crazy crowd and super noisy! Definitely making a return for late night, because no crowd is gonna stop me from eating!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jaMD9VfFodW6jiVuvkbqgw",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Wings so good, they make red bull cry.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jaMD9VfFodW6jiVuvkbqgw/o.jpg"
      },
      {
        "img_id": "6eBnEUVITCsOowncvcEqyA",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Beautiful nacho tower.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6eBnEUVITCsOowncvcEqyA/o.jpg"
      }
    ],
    "user_id": "i1o4j6M5gtIJKoufbdNm8Q"
  },
  "7gIRzFIZBXge_QGqqNpR3A": {
    "date": "10/5/2017",
    "text": "It sure looked good, smelled good, etc. However, I sat outside and after being asked if I needed a dinner menu the waitress did not come back. I was there 12 - 15 minutes and not so much a drink of water. I just left and went elsewhere. Big fail.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zi8LBPvhGh3HWiqyPkjxsA"
  },
  "pVLepNxOS1rsT9KjJjnqyg": {
    "date": "12/12/2016",
    "text": "Small and loud, but this is the original, so check it out. Watch out if you order takeout -- on my last experience, I had ordered two burritos which were supposed to be ready in 15 minutes. I arrived on time, but some other take-out order (for one of the big take-out companies) was waiting for five giant bags of food, so I ended up having to wait for about half an hour to get my food! Hopefully this is a rare occurrence, but it still wasn't great.  Try the Gobblerito if it's in season; it's one of the best things they have.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2ZZNOoMQ7WFvFoxDUFw1wg"
  },
  "XxXrTlgvk8hIU1yqwffG_g": {
    "date": "12/4/2017",
    "text": "I went back to PITT to celebrate my sorority's 10 year and we made sure to stop in Mad Mex for the nostalgia and the WAFFLE FRIES. I had the San Francisco boneless wings and they are just as good as I remember. It was been 7 years since I left PITT but I'll never forget the Rita's and Fries. One of the best restaurants in Oakland.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AuhYiN2TTd05cAD1p3aoWA"
  },
  "8_E_7nq4ZXkkpioxjHxOCg": {
    "date": "6/6/2016",
    "text": "Nothing beats late night half-off food at Mad Mex (11pm-1am)! I'm hoping this baby face proves itself useful by letting me pass as a student for a few more years. I've never had a meal I didn't enjoy and the fact that each entree comes out to about $6 makes it that much better. My go-to is a classic Mad Mex burrito with tofu. When I'm looking for a sweeter option, I'll go for the Tofu Wrapture with honey bbq sauce. I highly recommend the waffle fries for your side - crispy, greasy heaven! Aside from being insanely delicious, their menu is a vegetarian's dream. Almost everything can be made vegetarian/vegan with the substitutions they offer. They even have vegan ranch and vegan cheese! If you still have room afterwards, the Big Azz Brownie is the perfect ending to a meal and the best way to ensure a food coma (or diabetes). Nothing but 5 stars for my favorite Oakland restaurant!!",
    "rating": 5,
    "rated": {
      "funny": 7,
      "useful": 4,
      "cool": 5
    },
    "photos": [],
    "user_id": "6KUA3-IfHoAhQ3FL2djQoQ"
  },
  "tuyBktoWY8mm_Bw8aR6QhQ": {
    "date": "10/28/2016",
    "text": "I crave Mad Mex in CA! There's something about Mad Mex that just brings a smile to my face. The wings with San Francisco sauce, the ginormous burritos, and the big azz margaritas. The happy hour and the half-off deals are soooo good. It's the best of times.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X754C7UkbPik6ppvYaIitA"
  },
  "bXsjDHAq_OD0xqdyM52pCQ": {
    "date": "7/16/2016",
    "text": "Try to come here when it's half off, it feels so good when you get that bill and see that tiny number. You may have to wait but it is so worth. I've had a few things here that I'll go over and rate.   Frozen strawberry margarita is super huge and delicious - 4/5 Mad mex burrito is nice, it is simple and just has beans and rice cheese and meat inside. I had chicken in mine which was good. The tortilla is kinda lame. It is pretty good, and rather large, but not mind blowing or anything - 3/5 Nachos with chicken were SOOOO good, you get so much stuff, the chips are crunchy and yummy and it comes with cheese, chicken, and ... I don't know what else honestly but it was good. I did ask the waiter if there was anything spicy on it and skipped the jalapenos, but I believe the tomatoes or the guac was too much for me so I scraped it off. And then I kept eating. 4.5/5 I also had the wing-o tacos. I mistakenly came here with my friend once when it was not half off, so I was missing that TINY BILL HIGH that is a large part of the reason I come here. The tacos are not normally half off so I decided to try them. Anyways, these are tacos with some boneless wings in them. I got them because they come with some JERSEY CHIPS on the side, which you will understand later in my review. I had a hard time picking the sauce for the wings because they all sounded very not my thing. I settled on the southwestern wings and asked my server how the heat level at a mild level would be and she said there would be none. Well, once again, I am a huge baby who should not trust my server and they were too much for me. The sauce also had a bit of a ranchy taste which I hate. It was kinda lame, there wasn't much to it so it just tasted like I had some large pieces of meat with a sauce I didn't like wrapped in thin, soggy tortillas. 2/5  Finally, I will dedicate a whole paragraph to Mad Mex and their jersey chips. You get a huge basket of waffle fries which are perfectly fried - super crunchy on the outside and soft on the inside. I like to ask for ketchup with mine. Seriously, these are literally the best fries I have ever had. If you're just here with your buddies and you don't like Mexican food just get two orders of these. If you're not sure what to get, just get two orders of these. If you're getting something already, get an order of this to complement your meal. If you think you ordered enough and can't eat it all, but have not ordered these jersey chips, then you should still order them. A trip to Mad Mex is meaningless if you do not have jersey chips. I would even consider paying full price for the jersey chips (jk haha that wouldn't happen) I will give these fries an easy 10/5.  GET THE JERSEY CHIPS!!!!!!!!!!!!!!!!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "C9s3jIxF_83-JN0sXRclKg",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Turkey nachos my friend got",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/C9s3jIxF_83-JN0sXRclKg/o.jpg"
      },
      {
        "img_id": "BaLf77LT9tt2A-t3u1OfXw",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Southwestern wing tacos with waffle fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BaLf77LT9tt2A-t3u1OfXw/o.jpg"
      }
    ],
    "user_id": "a1qCiLY6M7qwEhmzIE7acQ"
  },
  "m5T8twjFrfWT9w1N2S0Mug": {
    "date": "6/7/2018",
    "text": "Who can go wrong with late night happy hour at mad mex. parking is trash at this location however it's made up for when you get in a start eating and drinking.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wQ89DTbhSwmg-n-lYJAaeQ"
  },
  "--qx_6M5pN16wneI8xy4CA": {
    "date": "9/19/2016",
    "text": "Small, but fun college bar that stands out due to its good specials. Happy hour 4:30-6:30 gives half off all drafts, and half off wings. Salads are large, fresh, and tasty. A staple of this bar is the Big Azz margarita, which is discounted during happy hour too. Lastly, a late night special from 11pm-1am makes most of the menu half off, and is a great way to eat well after going out in Oakland.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YfONGuyn4mwe3G6PKCKtjw",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Specials 9/20/16",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YfONGuyn4mwe3G6PKCKtjw/o.jpg"
      },
      {
        "img_id": "oHIU7L6Uo5fz9ZEnJjom0Q",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Specials 9/20/16",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oHIU7L6Uo5fz9ZEnJjom0Q/o.jpg"
      }
    ],
    "user_id": "O4s9lPLMbT981mu5JMCFYQ"
  },
  "583T32uH3bDDquiGoFvfbg": {
    "date": "1/1/2017",
    "text": "Here's the deal: If you're a college student who doesn't mind being elbow-to-elbow with strangers, poor service from rude hostesses (the servers really do seem to be trying their best), this is your spot.   Honestly, I come here for the nostalgia of my Pitt days 15 years ago. But every time I do, I regret it. I know, it's my own fault for going out in Oakland.   The hostesses here are almost always surly and dismissive. The blonde one I most recently dealt with was less a hostess and more a referee, explaining all of the rules and regulations that this location has with bill splitting, parties at a table, paying at the bar, whatever. She was far less interested in accommodating us as she was in arguing with us.  On the bright side, the food was excellent, as always.   Anyway, If you're an adult who isn't trying to pretend you're still 19, hit up the Shadyside or Monroeville locations with the exact same food, more space, and none of the hassle. This location would get less stars if it wasn't on me for knowing better than to come here.  But if you're a college student, this is your spot. Five stars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "atIbkGhTPdK4GZcJgY6Qcg"
  },
  "yPsgXmgdc3BP-ob7oImq5A": {
    "date": "9/26/2017",
    "text": "This place is great for a younger crowd but regardless great food. The restaurant is a bit cramped and busy during dinner and lunch hours. I'm a huge fan of the enchiladas. Mad Mex is a chain that started in Ohio and offer great happy hour and late night deals.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q6l5y7PpfR50Wq4VjERlYw"
  },
  "dy_cNskVG_2DmWcv9MwsYA": {
    "date": "3/24/2018",
    "text": "This is definitely the best restaurant in Oakland, and probably the best mexican in pittsburgh. The food is amazing, but the service is terrible, especially on weekends. The waiters don't come to check on you, and you're left without drinks for a while. It's so loud that they can't hear you when you call them over. But the good is so good that I look past that.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1v95n9wOmsWVLK3XyaHUiQ"
  },
  "l0gkVCvPVrfR0ZEUCqjkNg": {
    "date": "5/26/2016",
    "text": "Mad Mex has my favorite food and drinks out of all of the Mexican chain restaurants in Pittsburgh, and you can get a great deal during happy hour. I was most recently at the Oakland location with a friend for happy hour. I ordered a frozen Sangria Blur margarita, which is a nice balance of sour, sweet, and salty. Wings are 1/2 off during happy hour, so I got a small order of Southwestern wings, which are dressed with cilantro, olive oil, lime and garlic. I was full, a little buzzed, and my bill totaled to about $10.  This location is dark, loud, and tables are really cramped. It's great for students who live in Oakland, but I'd recommend going to another location, like Shadyside, if you'd prefer a brighter and more spacious environment.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "guvwUV9ci5Y1IbnAhG6GYQ"
  },
  "ITF7lHmnv1zLTWIO9FJXXQ": {
    "date": "2/6/2014",
    "text": "Do go here for their half off wings special during happy hours and after 11pm. I've never tried anything here besides their wings. But trust me, the wings are good enough to have me keep coming back for more.   My favorite flavor is Southwestern--just the right amount of garlic, lime and cilantro. You get to choose between three levels of spiciness, but I usually go for the medium level. The amount of sauce is just right. The wings are crispy and meaty. I highly recommend if you are a wings fan and eating on a budget.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "H_09-Wr5JcN5hpp5RnSLTA"
  },
  "cZVuQ6GhLnDzyD6TOx3s1Q": {
    "date": "1/21/2014",
    "text": "Between Fuel and Fuddle and this place, I have no idea which I like better. Best time to go to avoid long wait time is to go right before the kitchen closes (around 1am). They turn on the lights around closing time which kind of kills the atmosphere, but if you're only there for the food/drinks, the later the better.  Food Recommendations:  Pepita Hummus Southwestern Wings Shrimp Mushroom Spinach Quesadillas - kind of on the salty side Blue Cornbread",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "DC1hfeeSaYr2E1xwiEL81A"
  },
  "UKUwQs3l0Gw1j4UGF6dv2Q": {
    "date": "4/18/2016",
    "text": "I couldn't remember why I gave Mad Mex only 3 stars, because I hadn't been back to Pittsburgh in almost a year and have been next to crying at just the thought of ordering a Gobblerito and an Apple Cider marg.  After living in Seattle and Salt Lake City and being perpetually disappointed in my attempts to find a decent \"happy hour,\" I have found myself describing the gem that is Mad Mex to many people I meet.  But, alas, after being reminded of a few of the below mentioned rules, I, remorsefully, still feel 3 stars is the right choice.  If you're not a student desperate for late-night deals, may I recommend the Shadyside location, which is much larger as less strict?   During happy hour, (4:30-6:30 weekdays) buy two 12oz Margs (=24 oz for $6) instead of 1 big azz margarita ( 22oz for $7). Big Azz Margs and most food are 1/2 price after 11 pm.  Sangria swirl is the way to go--according to the bartender, this is an extra \"serving\". Vegans rejoice--vegan cheese and cream cheese are available if you ask!! The Oakland location does require at least half the party to order food to be seated at a table, and the entire party has to be present to be seated at all (depending on the hostess even be put on the waiting list!).  Chips are free at the bar, but will will be charged the menu price of sitting at a table... if it weren't for all the annoyances I've had with their weird rules I may give this a 4 or a 5.  Food is delicious!!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yQsX1CXh8rhpcm9Hg3L94A"
  },
  "IKkH8paEmSaxU0ACkMWHbg": {
    "date": "4/16/2014",
    "text": "I love this Oakland location. As college students at Carnegie Mellon, we used to swing by here allllll the time for the half off big azz margs after 10PM and half off food at 11PM (which is totally the best way to motivate college students to frequent your restaurant).  This place is a must for margaritas! Some margs change based on the season, but all will knock you over! They are STRONG, but do not taste strong - so watch out!  My fave has and always will be the Spicy Mad Mex Burrito with chicken. Om nom nom.   And you can't beat Pittsburgh prices. You just can't.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QimZse8KstP94DeFgzAevg"
  },
  "D8mW0S-aPkMWsdrZOSi8Xw": {
    "date": "10/17/2016",
    "text": "Good, lots of options! They also have dairy free cheese! Great for vegans and vegetarians. Big-ass margaritas are great too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3ez2iRp1P4UNC8nam-jx2w"
  },
  "60eDuAiIZ00fGfXQ9Qkh0w": {
    "date": "12/28/2016",
    "text": "This is our Mexican (I know, I know, not really: Americanized Mexican) go-to. We have ordered different items on their menu and usually they are tasty. Although, sometimes we found pieces of chicken in the vegetarian burritos/enchiladas. Also, the music is so loud, it is hard to relax or have conversations; I do not appreciate that.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T5zzVFv-gwHax2SkSO5sgw"
  },
  "7MZ4km4gmR3OnPZljAa5kg": {
    "date": "1/21/2015",
    "text": "I used to love this place. The big azz margaritas were definitely the poor college student's choice. I would always order their wings until one day I found a wing that still had a FEATHER still attached. I almost didn't notice because it was smothered in sauce. Forever scarred. Bye.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d2yMxg6C68VBZoNnpK7arg"
  },
  "goc2Wa05zXYZopgeA7U7iA": {
    "date": "8/31/2014",
    "text": "The food here is usually good - the thai burrito is unique and tasty and the fried tofu is delicious even for a non-tofu eater. The margaritas are fantastic, especially when they're discounted for happy hour and late night. I like the seasonal variations as well as the usual flavors. A few margs and a pickadippa is always a good decision.  The service at this location, however, is bad. The restaurant is small and as a result the servers rush you in and out. I have been here at least two dozen times, and almost every time the servers have been at best inattentive and at worst blatantly rude if we stay at the table longer than 2 minutes after the entree is done. This doesn't just happen when the restaurant is busy - we were there a few days ago in an almost empty restaurant on a Thursday night and two waitresses stood four feet away from us and glared for 30 minutes. Everyone at my table commented on how uncomfortable it was.   I really do like Mad Mex at this location and I'm going to keep going because I love the margaritas - but the service needs to improve.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ITeOeYpNs5d6CSka-WkHjg"
  },
  "hge2AOx8YjwRqPVu-EXabw": {
    "date": "1/20/2014",
    "text": "Visited mad mex today for the first time since I've been in college, and we went at like 2:30 pm on a Monday, it was completely packed, but we got seated right away and didnt wait very long for a waiter. Ordered a red sangria, the pickadippa app, a cup of tortilla soup and the original mad mex burrito (needless to say I brought home multiple boxes). The sangria was delicious (and cheap -$5!), we got the original salsa, guacamole and hummus, and all three were delicious. The tortilla soup came out not hot but they took it off my bill and the manager was more than accommodating. The food was great, and we got student discounts (half off food from 2-4) as well as the yummy sangrias. Can't wait to come back for Wednesday happy hour and late night menu! Definitely one of my new favorite places!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Wd20XlVNaAyS35yPyhnU_Q",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Tortilla soup and the pickadippa app!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Wd20XlVNaAyS35yPyhnU_Q/o.jpg"
      },
      {
        "img_id": "V6o3TZ978WQ7rC8bUXM-iA",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Yummy red sangria!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/V6o3TZ978WQ7rC8bUXM-iA/o.jpg"
      }
    ],
    "user_id": "iMLGWjxFk0LgjaxRm6Uo9w"
  },
  "4prpwqdNNwCUQKhksFRnfQ": {
    "date": "4/16/2010",
    "text": "I love you, Mad Mex, for your over-sized margaritas, outstanding bleu cheese dressing, and painfully good dip trio appetizer.  And you know what else?  Hats off to your Southwestern wing sauce.  It's REALLY FREAKING GOOD.  I mean, really.  I'm in awe.  I'm quite a wing person, and it's rare that I get my socks knocked off anymore.  Yes, you're a little loud and always crowded, but now that I've found the best things on your menu, the atmosphere will never stop me again.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "hGxKMRt9f4drE10NUwsjGQ"
  },
  "d47TYUgXFfI9T4LrAX3Xfg": {
    "date": "10/30/2012",
    "text": "I only go to Mad Mex for two things: $7 Big Azz Margaritas from 9 pm to midnight and half-off food from 11 pm to 1 am. The Mex earns a spot in the lineup for 21st birthdays and other occasions that merit bar-hopping and all-night drinking (e.g. midterms, breakups, Tuesdays).  The food is consistent and tasty, though not exactly the most authentic Mexican food ever.  There are lots of option for vegetarians and even vegans. I have to eat gluten-free and they've always been accommodating and knowledgeable. Free chips and salsa at the bar is nice.  Why does this place get 3 stars instead of 4? Couple reasons: 1. Stupid policy of not serving alcohol if there are people under 21 at the table. Sucks when you're out with your underage friends and want some tequila with your enchilada. 2. You won't get a table during peak hours unless you're ordering a legit meal. Nachos to share don't count. Which leads me to... 3. Super crowded. Very difficult to get a seat at the bar on busy nights.  Also, one little weird complaint: the bar is sloped and uneven, so it's VERY easy to have a bowl of salsa or even your drink (dios mio!) slip off, particularly once you've had a few.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "RNqvfaL9HtKu8vsG2Gs1EQ"
  },
  "dSrdUFerTvwiVywTSUqYxw": {
    "date": "12/21/2012",
    "text": "My favorite place to go for Tex-Mex food!  I can go on and on about this place but let me talk about some of my favorite things. The wing-o-rito is awesome.  It is a burrito with chicken and you get to have your favorite wing sauce in it.  The los wingos wrap is also good and the waffle fries that come with it are amazing especially wen dipped in the spicy blue cheese dressing that they come with.  Always always make sure to get chips and salsa as a starter.  They have a number of different kinds of salsa and I like every one I've tried.  When you are not so hungry there is el no bono.  They are boneless wings.  We are not talking chicken fingers dipped into wing sauce...this is the real thing only without the bone.  Yum!  Then there are the \"big ass\" margaritas.  They are really good.  They have a lot of different flavors and you can get them either frozen or on the rocks.  I like the original on the rocks with salt and the strawberry frozen.  They also have rotating margarita flavors based on the season.  This is the original Mad Mex location and although it is quite small, I consider it the best.  The atmosphere, the music, the workers, the crowd, all make Mad Mex is great.  It does not have the family feel like the suburban locations which I think is good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zATgdMp_5gL4kYPu7aVdUg"
  },
  "kOyAfb25HInSkLy5TSQCBw": {
    "date": "7/31/2015",
    "text": "Loved the margaritas and the mad mex burrito is absolutely amazing. Loved the atmosphere and service was great. I can see why this place is so popular. The burritos are massive and the guacamole, sour cream and pico are on point. I'll definitely be back and you have a few different locations to choose from. Also, great menu with some awesome appetizers to choose from. Loved it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rwDMkAYPnkCrQsXIITCvHg"
  },
  "km4UApDMn5i6lzy6ZBxJAA": {
    "date": "7/28/2015",
    "text": "Very good burritos and margaritas. Wife had kale and roasted corn salad and she said it was good. Stopped by with friends. Very loud and happening place. Quick, polite service. Will stop there again when in Pittsburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3ciDCPy4b18aEbVNs3AsIw"
  },
  "mtOdCJr_kBZp7j9Lw6hI1A": {
    "date": "2/2/2014",
    "text": "My friend and I went out to eat for a quick bite to eat- we both had nachos- I ordered mine with chicken and she ordered it with steak. Despite the large portion size, the nacho chips were dry and therefore texture wise felt stale. The cheese dried out and wasn't melted - in addition Both of our meats were dry. I would prefer to go to Emiliano's next time and get better nachos there.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ft1JbxBPhibiCboC3oty9A"
  },
  "jvDSztIpiwJuwytYbZ-q0Q": {
    "date": "5/30/2014",
    "text": "VERY LOUD MUSIC during busy hours. Can't eat if plugging ears. Our table couldn't hear each other talk so decided to write reviews instead.  Normally it's alright. Food only worth the price during late night half price.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PARSz1llS-Bw1ZLHqI_YKQ"
  },
  "LDynf2y-xikz7C3NwO8Q6A": {
    "date": "3/21/2014",
    "text": "So this is the best place so far in Pittsburgh for Mexican that I've found. However, I'm sure there's some hidden gem out there somewhere. I wish this particular location was bigger. Every time I go it's completely full and a bit loud. I love that they have the black bean dip from Kaya in the strip as well as pretty similar fish tacos for less $. The margaritas aren't bad, but I usually only get them during happy hour.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "d6JltKIeAbPj415bwSm7eA"
  },
  "5LcRSskIzm7vvTyBJLVUNA": {
    "date": "4/2/2015",
    "text": "The food is so plain. The wait is insanely long and our server has an attitude.  My dance marathon burrito has literally 4 pieces of chicken (it's a chicken burrito) and the Chili they serve is canned chili not homemade . Disgusting",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "27xKKp-4way33YIEHa7Vww"
  },
  "BzHOQqbRCBNRpPEtquD5ag": {
    "date": "11/20/2009",
    "text": "I haven't lived in Pittburgh for over 15 years, but i used to eat at Mad Mex way before it was ever a chain restaurant.   Even tho I don't live anywhere near Mad Mex, every time I visit, I must eat here.  Not only does it have literally the best food, but for a fee, you get the biggest and strongest margarita ever. Yum!  I used to go here after with my friends 11 when all food was half off. not sure if that is still the same. But what a great place!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "h-Xe17qy0CRx4AZavazJiw"
  },
  "vCWE2qARDxkRrhby3cR__A": {
    "date": "7/22/2014",
    "text": "This Mad Mex is small, but mighty!  I don't understand the bad reviews--yes, it's a chain, but the food here is really good and the same as all the other locations I've been to.  I work in Oakland and if I can take a long lunch, I like to come here.  It's not usually that busy around lunchtime and you can definitely get in and out in less than an hour.  Staff is friendly and they have an awesome beer selection in case you're not coming here during the workday like me!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TkFcPIHDPx43OqnqZ_ElPQ"
  },
  "LRp27pS2cziZk0MbG3Cjvg": {
    "date": "2/10/2014",
    "text": "After spending a long cold day moving my college student into an apartment,, we were hungry and thirsty (not necessarily in that order!).  Mad Mex was a few blocks away tucked away in the south oakland student neighborhhod.  After a giant plate of nachos,  and a tall margarita, the world was suddenly looking brighter.  In addition to the tasty margaritas, I was pleasantly surprised to find they had about a dozen craft beers on tap as well. They were running a special on Bells, $5 for 22 oz,   I tried the smitten golden rye, while my  IPA loving husband had the two hearted ale.  they were both exellent and went great with the food.  The food itself was decent if nothing amazing. I thought the nachos were a little dry, the burrito was good though.  the menu is huge and there are a lot of vegetarian options. would come back,especially for the craft beers.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "53ApJTgvnYlEPgP0xgc6YA"
  },
  "QdqEvt9AmP-s4eOoQuaFHg": {
    "date": "2/12/2015",
    "text": "The Oakland Mad Mex is by far my favorite.  It looks different than the others, a little dingy, but in a good way.  I've had their shrimp fajitas, which are solid, but usually I get the buffalo chicken tacos that come with fries.  It's not astonishingly tasty, but sometimes my taste buds just crave it.  Solid beer selection as well.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YTuksHb6YsMI62BqEG_eRA"
  },
  "9ZTn8niROk8zQNOZp2VVhg": {
    "date": "10/22/2014",
    "text": "Received terrible service here. They refused to seat us because we just wanted to get their specialty margarita, yet there was no room at the bar for our party to sit.  There were PLENTY of empty tables for us to sit and enjoy a drink.  They only seated us when we talked to a manager and explained how one of us had a broken arm.  At that point, the employees proceeded to glare at us and we could hear them talking about us.  We just left because you shouldn't have to beg for service.  Really unfortunate because I had heard good things...I do not reccommend this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sr696bqeUXLr7rB3iIvQlQ"
  },
  "WRzFpGZAgrFVeS87dinaWA": {
    "date": "7/2/2016",
    "text": "Nachos hold a special place in my heart and I have to say there's are some of the best. The fish tacos are equally as amazing. Everything I've tried here is full of flavor. I never leave here not completely full from my meal. The only downside is the menu is a bit pricey. But if you don't come back for the food you will for the Big Azz margaritas. Essentially these are a giant glass of tequila with a splash of flavoring. Frozen or on the rocks. As a broke college student I can say I'd happily pay the price for one of these because I know I'm getting what I'm paying for. Recently found out you can mix flavors too, highly recommend strawberry and mango. They also have happy hour in the afternoon and after 9pm which is nice. Service is usually on the slower side but it makes for a really casual environment.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w1cEwTtPTgoqYgFIQKno2w"
  },
  "-mLIOCMa2dCmET8bDRDtuQ": {
    "date": "1/3/2018",
    "text": "Looks like they recently renovated the interior and there is much more privacy for each table now. They have the best guacamole of all the tex-mex places around. I love getting the pickadippa with guac, pepita hummus (amazing, highly recommended), and the black bean dip. The burritos come in pretty large portions, and I usually just get the mad mex burrito. The wings were sadly not as good, dry and lacked flavor. The margaritas are delicious, you can mix flavors!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zw_V_Hd-2bDCymvfII-8uQ"
  },
  "vTfmOvTrze0gF0DM0OqdWw": {
    "date": "1/20/2017",
    "text": "I am always a big fan of Mad Mex.  The top list is always very great and always changing. The happy hour let you try great beers at a fraction of the cost.   If you're going to get a margarita I suggest you not get one of the ones that are pre-mixed. Ask the server to show you the margarita list in the drink menu.  The food is always delicious and if you catch them at the right time you can always catch a really great deal. The San Francisco and barbecue wings are two of my favorite happy hour foods.  Wing tacos and the Christie's big sister quesadilla are definitely on my list to get when I go as well.  They sometimes have seasonal items out that are really great like the crab n corn quesadilla and the gobbler-Rito!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Mrudkq5duCOoiuhL61ZBcQ"
  },
  "UU2hVQl6nRJWcQcnU4e8qA": {
    "date": "9/22/2017",
    "text": "The restaurant itself is decorated really interestingly and the decor works well with the music playing in the background.  It is a smaller sized restaurant, so seating fills fast and there is usually a wait time at busy hours.  The food is decent.  I got the summer corn and steak tacos (recommended by the waiter) and they were pretty good.    The only thing that wasn't satisfactory was the service in general.  It seemed like they had two waiters serving the whole restaurant, which caused many backups.  My friend and I ordered guacamole and never received it, and it was really hard to get refills on drinks just because the waiter was running around so much.  Overall, I would recommend coming here, just not if you're in a time crunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NplAKOa_3rOKqhmkd3PkYw",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Summer corn and steak tacos.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NplAKOa_3rOKqhmkd3PkYw/o.jpg"
      }
    ],
    "user_id": "X37BbBvJjGC3C93jOYcS0g"
  },
  "3bSBhNXA1w7mK8MKpoXmvQ": {
    "date": "10/20/2015",
    "text": "I enjoy Mad Mex so this location works for me out of convenience. I have always been pleased with my meals here and I like the fact that you can choose your protein including tofu which is not always the case at most restaurants. My one complaint about Mad Mex is that chips and salsa aren't free but it often is at other Mexican restaurants.   The atmosphere at Mad Mex is always fun in terms of the decor but this location is excessively loud in my opinion and I found that I was screaming just so my friend could hear me. This location is also very small and cramped. They make seating tight in other locations too in my experience, but the overall space is much smaller here making it worse. Parking is also bad at this location as it is street parking but much of the surrounding streets are for permits only.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "ppxs-6ua_-Pbj1yQKSWt1Q",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Chips",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ppxs-6ua_-Pbj1yQKSWt1Q/o.jpg"
      },
      {
        "img_id": "G7N-HBzM1AbxAcEowJn0SA",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Salsa",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/G7N-HBzM1AbxAcEowJn0SA/o.jpg"
      },
      {
        "img_id": "yWtIbbiexgjt_A5wjUsvgQ",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Mango margarita!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yWtIbbiexgjt_A5wjUsvgQ/o.jpg"
      }
    ],
    "user_id": "mm9WYrFhiNqvHCyhQKw3Mg"
  },
  "pbsPCktftrQb5S6VobqXHw": {
    "date": "12/7/2017",
    "text": "Cool decor, friendly service and very average food. I had the Mad Mex burrito in a bowl with tofu and a side of guacamole. The tofu was good and the food was fresh but it was just bland. Not a bad spot but as far as Mexican food goes, you could do better.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "llNEW4qRUflzQs3hyetqSg"
  },
  "LK9UT0dZtn0MI3owf8rDTQ": {
    "date": "7/30/2018",
    "text": "Great! My favorite is the corn and crab quesadilla and the big azz margarita of course!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DSHkSfrOwdMU-WjI1bZ-ow"
  },
  "Y9fF4YTeWWvi_L_L4JGGAg": {
    "date": "7/24/2018",
    "text": "A quick and easy bite that will satisfy any burrito craving! Go late night for half off big azz margs! The restaurant also has really cool outdoor bar seating.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qngVaP58Ou6dewGydaRlDQ"
  },
  "9JdpNv1zIvVhwWZben8MvA": {
    "date": "1/21/2017",
    "text": "This is a tiny location on a side street in Oakland.  It's a packed college hangout with discounted food after 11 pm.  The food and service here are ok and they have a large menu.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gmfzA7G4KW441zh6S3A9yQ",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gmfzA7G4KW441zh6S3A9yQ/o.jpg"
      },
      {
        "img_id": "ok-92dV54ejRXhpF_Jjvug",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ok-92dV54ejRXhpF_Jjvug/o.jpg"
      },
      {
        "img_id": "AdlMQSW-OAnpb283rdyxvg",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AdlMQSW-OAnpb283rdyxvg/o.jpg"
      }
    ],
    "user_id": "HgeE8guC565OELCyWLmY6w"
  },
  "iKfFn8JmggdlrAU1horphg": {
    "date": "12/5/2018",
    "text": "Really sub par food. Not worth the price. I got pretty bad service the three times I've been there. Literally only got waited on once during my visit. Waitress didn't give my friend full change back and when asked she simply said she rounded up and walked away. The spicy burrito was ok but it's really not worth the price and overall experience there. Another time I had their chickpea chili and that might be one of the worst things I've ever tasted.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g9xibNc5B2PJdE82VjQFog"
  },
  "-xs8cgc87PNWoozvu47YUA": {
    "date": "11/17/2018",
    "text": "This has been the worse experience I've had at a restaurant ever. Never have I ever been so eager to write a review. We went in after cling and asking if there was a wait an if they were busy. We were sat right away and our order was take. Almost immediately. That's when the wait started. We were told there was only one line cook after we complained. We waited for 40 minutes to get our food, then they messed up on our order and gave us chicken instead of stake on our enchiladas. We repeatedly reminded them that we had been waiting and that we needed to leave soon. We got our food soon after and had to scarf it down to make our appointment. The food was ok, but it was definitely thrown together on our plate. As much as we would have liked to enjoy it and savor it it was definitely disappointing. As someone from the LA area and living in the Chicago area, I'm biased to Mexican inspired food but this falls short by a long shot.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6v9gmDDliXwPyT9sFWuz8g"
  },
  "2ew-3msKlCef5P6vZjhHDg": {
    "date": "11/27/2018",
    "text": "Love it here. The great food that you find at every Mad Mex location (so many veg options!) - with more of a college-y atmosphere than the Shadyside spot. Always a good time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_wIdLdtFlv83rxyws035OQ"
  },
  "ffJ-KwKL-h844018HTgkUw": {
    "date": "8/17/2017",
    "text": "Mad max for always get five stars in my heart, especially the Oakland location. It was the site of my first date with my now husband 10 years ago. What don't i love about mad max!?!? Nothing! This trip to mad Max I had one of their seasonal dishes which was a chicken and grilled corn burrito it was good but not my favorite burrito out there. The best seasonal item on the summer menu are the grilled street corn and steak tacos. Right now is peach margarita month through the end of August so if you love peaches to go and get one!  We sat at the bar and the bartender was super friendly helpful and gave all-around great service. We will be back again that is for sure!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "exlziNg-2I1-7JZcYPgWJg"
  },
  "tkcZimtnw0nTlCW9zJ0L3Q": {
    "date": "4/8/2018",
    "text": "We were in the mood for some Mexican and decided to give this place a try.  I liked the ambiance of the place and also think they have a great craft beer menu.  The food was just ok.  I got the chicken enchiladas and felt they were kinda dry and bland.  My hub got the carnitas burrito and that was good.  Their menu is vast.  Our hunt for decent Mexican food continues...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SCqi8N3vP4qIcF5ezzWzzQ"
  },
  "SAA41miOjreeHBShHDA4Qw": {
    "date": "5/31/2016",
    "text": "I had not been to this location of Mad Mex since my undergraduate days; I usually go to the Shadyside location. Yesterday I went here with some from friends from out of town, and I was not thrilled with my usual order: southwestern wings. They're so good, I get them all the time. However, they were fairly dry and lacking in sauce yesterday. At the Shadyside location, my wings are smothered in the sauce with some to spare if I choose to dip my chicken it. I will continue to go to the Shadyside location as there is also more room to breathe there.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JZU6phRVkJypf4z6kX4qYA",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Big Azz Brownie!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JZU6phRVkJypf4z6kX4qYA/o.jpg"
      }
    ],
    "user_id": "UyXqGEKod-veD6m6Hq0EDw"
  },
  "x2mW70Ay_ax-FesxuGXCsg": {
    "date": "9/2/2017",
    "text": "I have been here three times and each time was enjoyable. It is a little on the pricey side as far as this kind of Mexican food goes (as with all kinds of cuisine, quality justifies a higher price, and I think the balance is slightly off at this place), but everything is delicious. Their chickpea chilli is served in a verde sauce, and their mushroom burrito is very flavorful.   The atmosphere is usually chill during the day or in the summer when most undergrads are gone. the service is pretty good too. Sometimes I think wait staff could come by a little more often to refill drinks when they are on the less-busy side, but overall everyone is very friendly and professional.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rxhg67S_YNhllJWw3Rf79A"
  },
  "wcDoDs9X8cN2-g_rdmHk2A": {
    "date": "9/1/2014",
    "text": "We have ventured here a few times since our first visit.. both for regular menu and half priced. Just an fyi it's always busy during the half.priced food. I honestly have never had to wait but they sure know how to cram people in the smallest possible space.   What I normally order is the Los wingos wrap. I get the boneless wings with the honey bbq sauce. There is also (Mexican?) rice inside so it's very filling. I normally order it with waffle fries since you get to choose a side.  The big azz Margarita is also a fav. I normally order strawberry, but in August the flavor of the month was peach. That was also tasty and their list of Margaritas is lengthy.. Still need to try the sangria Margarita.   The mad Mex burrito is also good. I always get it with chicken. I've also had the curry burrito (with chicken). It honestly wasn't my fav. I barely tasted the curry. It was more of a marinated or seasoned chicken than that curry taste. However, the peanuts and pineapple were a nice touch. The bean spouts were not a good touch and the Mexican slaw also wasn't appealing to my taste buds.. Maybe some but not mine.  The chimi is probably my favorite. It's really delicious!!!! This is not offered as half priced. It comes with beans and Mexican rice as a side but of course the chimi is the star of the show!!  Bobby and I have split the nacho grande and then once our food was delivered, we were too full to eat.. Piled highhhh but very good though. Honestly two people ordering drinks and nachos is plenty to catch up or as a snack.  Mad Mex is still satisfying in my book.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XJwBq7A1n-C3TjNB0NXt-g",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Big Azz Margarita... Peach!! (August flavor of the month)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XJwBq7A1n-C3TjNB0NXt-g/o.jpg"
      },
      {
        "img_id": "Z_B5qkJyugxWtugF9bsRgQ",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Big Azz Margarita ... Strawberry",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Z_B5qkJyugxWtugF9bsRgQ/o.jpg"
      }
    ],
    "user_id": "d0D7L-vfQDIADolnPAcb9A"
  },
  "mp6pT3CXPDnLGpipgAGqaQ": {
    "date": "5/6/2017",
    "text": "I went here yesterday with a couple friends I've never ate at mad Mex before I've only had margaritas. It was really crowded but it was Cinco de mayo so that was to be expected. Their menu is pretty diverse. I ordered the enchiladas with mole sauce. I've never had mole sauce before so I didn't know what to expect. I know mole is made with chocolate in it which is interesting so I wanted to try it. I also ordered the orange pineapple margaritas I wasn't a huge fan of the margarita since it had chunks of fruit in it and the texture just made it odd. The enchiladas we're good but when I got more to the middle of the enchiladas it got too chocolatey for me there wasn't to much spice or anything to off put how sweet It was. I would go back since they have such a diverse menu it seems like there is something for everyone on it. P.s it was super busy and our food came out really fast!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xRFPqnPbOrZAkoomXqRW-Q"
  },
  "8P871NCeSKCA18ldCG5Rmg": {
    "date": "1/10/2017",
    "text": "I've always been a huge fan of Mad Mex, but I think it's time for them to revamp their business, especially at this Oakland location. Went out tonight after a long day with my 25-year-old friend, who has a very valid NY ID. We were looking forward to drinks and meals, and our waiter refused her service for a margarita. When she asked to speak to the manager, the manager claimed it was a fake, and said \"I'm 28, I know what a New York license looks like.\" Recently, New York updated their IDs to a newer, less flimsy version, so if anything, the state of her older ID showed her age.    Oakland is a college town. My friend and I go out to restaurants and bars with scanners, and there's never any problem. A smart business move would be to invest in a scanner, or provide a more rigorous training in identifying cards from different states. Not only was the manager unable to verify a valid ID, but she was rude about it. This reflects poorly on the restaurant and the management.   I couldn't be more disappointed with this experience. This isn't the responsible way to conduct business in a college town. I work in the restaurant business, I know things can be rough and everyone has a bad day, but this situation was unacceptable and so frustrating. There's no excuse to be denying VALID forms of ID by eye in this day and age.   I've always enjoyed dining at your restaurant, but this experience was beyond unsatisfactory. Please consider making a change, Mad Mex Oakland.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "IPoM6kNPLhnHAHxoIgIthw"
  },
  "M8s4bKEfr-qxlU0axTK8pA": {
    "date": "8/9/2017",
    "text": "First of all - I am no longer allowed to pick the restaurants for in-law family outings...idk why...THIS PLACE ROCKED! I love this places atmosphere and THE FOOD!!! SOOOOOO GOOD! Staff is excellent and friendly as well! If you love Day of the Dead art, big fresh burritos and hip hop - THIS IS YOUR SPOT.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8k4G4sPn7WgRJvOjtu52kA",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8k4G4sPn7WgRJvOjtu52kA/o.jpg"
      },
      {
        "img_id": "UB7KmUQ06m_MEf6X0ZrrtQ",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UB7KmUQ06m_MEf6X0ZrrtQ/o.jpg"
      },
      {
        "img_id": "lrp75xpF9d3wfpVBrM8FKw",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lrp75xpF9d3wfpVBrM8FKw/o.jpg"
      }
    ],
    "user_id": "OueOwpV0eNLzu8UE57XKzg"
  },
  "dNOpnzphVeyZPAgf58h_yQ": {
    "date": "11/16/2017",
    "text": "Horrible food service.  Carnitos Tacos took 30 plus minutes and still weren't there. I cancelled the order.  Everyone else in the group had been fed and I'm waiting for pulled pork tacos?? That should have been ready to serve an hour ago. Trust me. I am a cook.  Inexcusibly bad kitchen.  Period.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "M18vjUMs4m8KFqTD20JMbg"
  },
  "UpT5CxMlrtzmWAek22z_AA": {
    "date": "12/31/2010",
    "text": "Parking and seating was fine - winter break at Pitt. Food was great - especially the tofu tacos. My only complaint and its a big one - the music was WAY too loud. My party of 8 was seated at a large round table and I could only hear about half of them. What a waste considering the whole gathering was to catch up with old friends.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "RyV9s9itlNQhBvrr2vyo5A"
  },
  "4QqOgaG21rgihXPauBFabg": {
    "date": "6/21/2012",
    "text": "One of my favorite restaraunts in Oakland but I can't really give it a perfect review.  The food is awesome! The drink selection is awesome! And they have lots of deals so it's a great way to be able to go out, have some dinner and a few drinks, and not spend a lot of money.  It's also a great place to take a larger group. We've never had a problem getting seated together with groups of 10 people, or maybe more.  Just don't arrive before the rest of your group. They won't seat you until everyone is there, which is kind of annoying.  My main criticism goes to the atmosphere, but it's not the restaraunt's fault, really. When it's packed and there's lots of drunk college kids, well yeah. That can get annoying. And the waitresses there have given me attitude more often than not. I just kind of expect it now when I go, so when a hostess or waitress is nice to me, I'm pleasantly surprised.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sVE10pxDy76QMibaurCDEg"
  },
  "Stzi2UVm3o8gfuIEdNqeBA": {
    "date": "1/30/2007",
    "text": "1/2 food and margaritas after 11pm!!!   Love their margaritas,  food is ok,  usually a wait after 11pm.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "duMxpfTdUU-97xgyv0Ujfg"
  },
  "mP_tuPdHR3MdNX8se5K1RA": {
    "date": "6/29/2009",
    "text": "Mad Mex was one of the first restaurants I visited when I moved to Pittsburgh.  I've been a fan ever since.  This location (they have several around the state) was the first and helped the Big Burrito Restaurant Group get off the ground.    The space is cozy, and can be somewhat cavernous during the daylight hours.  The decor is wild.  Staff is nice and consistently busy.  The college crowd can take over this place in a hurry, so get to happy hours early and try to get a table just before the late night specials start.    I recommend the Kristy's Big Sister Red Velvet Quesadilla.  It's chicken, cheese, zucchini, and spinach combination is great with the salsa, guacamole and just a dab of sour cream.  Wing fan?  Try the San Francisco glaze with either the \"mild, wild, or insane\" hotness factor.  (I can't eat the insane wings...just too darn hot).  Also, try the variety of Monday through Friday lunch combinations.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U_sn0B-HWdTSlHNXIl_4XA"
  },
  "8vYIo48m1k8P2RxHvr5pZg": {
    "date": "8/17/2009",
    "text": "Hello (reliable) deliciousness! I swear the menu has grown 2-fold since I lived in the 'burgh.    I decided to change it up this time (my standby meal is shrimp funguy taquitos and the black bean and pineapple quesadilla with tofu). I ordered the black bean soup and the Pennsyltucky fried tofu. The tofu was a knockout! So crispy and flavorful, with nice sprigs of cilantro and sprouts on the side. Loved the salty warm peanuts too. The soup was meant to be like the Kiva black bean dip, but the dip is so decadent (read: fattening) and spicy, while the soup is just watery and missing the cheesy rich goodness of the dip, which I guess I should've expected. But still, it was all delicious.   My friends got the burritos, which I think are amazing, but sort of boring compared to everything else on the menu. I ordered a big azz mango marg, per the usual and was not dissappointed. I LOVE this place. Everytime i'm in the city I will go here. It's a must!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7QvDBjYGPyITqTWiO02aaw"
  },
  "RbrAe1xuxEFsaJAW_kPefQ": {
    "date": "11/19/2009",
    "text": "Probably one of the best (and SUPER CHEAPEST) Tex-Mex joints in the entire city. I don't go for the drinks, but man, you can't beat half-priced burritos as a college student. $5 for food that fills you up for a long, long time?  Sign me up. I'll miss you when I go, mad mex.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OJ0dSpMOOfhkBFKt9oPkJA"
  },
  "IKD6w0fTLgrIJ8eNcE50Ow": {
    "date": "4/22/2008",
    "text": "Mad Mex is awesome! And is one of the things I miss the most about Pittsburgh. The Pico Burrito is fantastic (probably the thing both I and my non-veg friends ordered the most while there) as is the Potato & Black Bean Taquitos. For non vegetarians I have heard great things about the Tortilla soup and some of the other burritos...  In terms of crowds it totally depends on the times, if you are going for half price food which was available between 2-4 PM with student Id or after 11PM then yes its crowded but for 4 bucks for a huge burrito in a town full of college students thats expected. The atmosphere is quieter and better for talking during peak dinner/lunch hours when the food is not half off.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dqaWBnkQhfFMdvhAtyke4A"
  },
  "FZ1-7Ucv_3qXwz5IAkQyXA": {
    "date": "6/24/2008",
    "text": "Ok. It isn't really Mexican! I mean, sometimes it is, but lets face it they serve an amazing hummus and their chicken wings are great. That's just not mexican. But if you can deal with the fusion-whatever, it is great.   The picka-dippa (three dips & endless chips - is a must).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xyTInk3Ctrdz00sHsGgbZg"
  },
  "iTFX2m7J5W7SX3z2zaDGVA": {
    "date": "7/18/2011",
    "text": "For the first time in about 6 years I went to Mad Mex.  They did not let me down.  I had the Chicken Chimichanga.  It was fantastic!  Our waitress was Liz and she was awesome too.  One of my favorite Pittsburgh restaurants.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tZwCQEX_dErf2O4tw4OmKA"
  },
  "E1kVg1MELtWZD-OgjtP8gw": {
    "date": "1/18/2012",
    "text": "I really enjoyed this place. The service was fast and friendly. They have lots of vegan options! The prices were somewhat high but it is high quality food. I would recommend going with a group of friends it is loud and you can be loud too",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UtEQnB39DuoqShoa05v31g"
  },
  "QbK4GppIzVx9azeZ7HpeyQ": {
    "date": "3/26/2012",
    "text": "i'm not sure I can say anything about this establishment that hasn't already been said, but it's worth noting that I think the Oakland service is tops, their margaritas are the strongest of all the 'Mex locations, and their menus always make me smile.  I filmed a restaurant show segment here for school in 2007, and the management was friendly and accommodating, going above and beyond normal service expectations to help me with my project. Love this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u6WE_x626TiEt3o2cUE8JA"
  },
  "5nlEFaAmZW00XEq-bDLg5g": {
    "date": "8/20/2006",
    "text": "Mad Mex offers vegetarian burritos with seasoned tofu that are pretty good.    It gets pretty crowded and noisy, so keep that in mind.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lw7wDW9PtXd8fFI2CYxvlQ"
  },
  "Flhv41lVP3FiUJNg_1jXgA": {
    "date": "1/26/2011",
    "text": "This is a review for all the Mad Mex chains. There's a Biggie quote in there somewhere...This is a shout out to all the people who thought i'd never amount to nothin'. Mad Mex stands on its own. It does not need reviews because it is so completely amazing. It's like Nirvana when I open the front door. The tequila flights are heaven. The burritos and wings are top notch. I don't even have to review the big azz margs. Just know they're out of this world if you haven't tried one yet. The decor is bitchin. So are the skelly's in the restroom. The menu is really fun to read. Just like my reviews. I want lights like they have. You know, the green ones in the jelly jars hanging on ropes? Yeah.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vdnMuP5iuEalosGN_XIUsQ"
  },
  "iF3plZUk2lqiqLRKpARkRw": {
    "date": "7/10/2011",
    "text": "If you're not at Pitt for undergrad, then don't waste your time here. If you want to get f'ing wasted and live in south Oakland, the only redeemable qualities are their \"Big Azz\" margaritas, and that is a long as you can put up with the over crowded restaurant, their asshole employees, and the wait times. By the way, you can rarely sit or sit at a table if you're only drinking.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8zE_ax1J2c1F-6-arf9L3g"
  },
  "DvOV1dXF5CJWgeo_OIotRA": {
    "date": "11/9/2008",
    "text": "Mad Mex is small quaint place.  The decor is dark but vibrant.  There is always a number of people and while you're packed in with tables it doesn't feel too crowded.  The food is good if you stick to the Tex Mex, otherwise it is hit or miss.  The beer selection is good and the prices are dead on (especially if you have a student ID.)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "84F_UxRVby3WqFIxt3Wshg"
  },
  "ue4hGWszfBF0HCOgR2MBjg": {
    "date": "5/31/2011",
    "text": "So I just finished running the Pittsburgh Marathon and I decided I needed some Mexican Food. Where to go. Found Mad Mex. Thought we were ordering the happy hour drinks but we weren't. Bummer - Big Bill. The waiter asked questions about additions to our meal and every addition increased the price. The food was OK but the bill was way to large. Wouldn't go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6wGfouzBAzEuDmgR7_fUJg"
  },
  "zWq6rIYl_Fk6u_oN5fq7vQ": {
    "date": "10/12/2010",
    "text": "Rumor has it this is Mel Gibson's favorite mexican restaurant in Pittsburgh, and with very good reason!  Be on the lookout for their new sister joint, Mad Mex Beyond Wingdome, which is set to open soon, underneath the unicorn mural in the Strip District.  You're going to want to hold on to your hats for that one, as they are taking Mad Mex's famous \"road warrior\" approach to traditional Oaxacan cuisine to an entirely new level.  Some might say that some of their food is unnecessarily dangerous, but if you've ever had their mole electric eel taco platter, a steal at $17, you'll know that it's more than worth the risk.  And if you haven't had their piranha-and-potato burrito - also for $17, as is everything else on their menu - you simply haven't lived.  I'm not sure if there's outdoor seating or not, I'm going to have to go back to find out. Maybe I'll see Mel there!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NXh_VM6xFl9ID46FGMgCfA"
  },
  "VBRWposr0UW99esLIuSpow": {
    "date": "6/26/2013",
    "text": "Yum, SO GOOD for getting your Mexican food fix.  They sometimes have good margarita specials; when I went, I got a gigantic margarita for cheap (and they don't skimp on booze).  As far as the rest of the food, it was really yummy.  It was packed with college students when we went, so there was a wait for us to get a table, but it wasn't horrible; it was a loud, college-type vibe.  Overall, I enjoyed it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e9Q3M4L9DwmtoBuBBux8Hw"
  },
  "TWVDh2XXvMKbCFMfr4KGmw": {
    "date": "8/25/2010",
    "text": "This place is loud, has obnoxious servers, pretty lousy food, and thinks it's clever because of bad puns on the menu.   That said, some of the food is good and it's better than most other Oakland options (which is damning with faint praise). Things that are okay: carnitas burrito, mahi-mahi salad (w/o the chipoltle aioli), pineapple habanero salsa. The margaritas are okay, but if you claim to be anything \"mex\", you better have okay margaritas.  On the whole, this place needs to turn down the music, turn up the lights, make the menu a little less colorful and focus on having consistent service and food prep. Oh, and while I'm at it, that blue cornbread is disgusting.  Oh, and to say that it's not good for kids is an understatement. They play very loud music with explicit lyrics and have drunk people stumbling around at 5pm. Leave junior at home.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h2dAxHXBzaUHwXWfiev7KA"
  },
  "GOrDlguYWL0-3GLknyZrOw": {
    "date": "4/4/2010",
    "text": "The only reason you should come here is for the margaritas and the wings (which are damn good! especially with the southwestern sauce).   Is it just me or is it funny when the wings are the best part of a \"mexican\" themed restaurant???  Anyways, there seems to be a happy hour for margaritas around 9-11 and then half off for food sometime around the same time frame. I had a burrito here once and it was beyond average and overpriced. Stick to the above basics and you'll be fine.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RnmPWWPhYdi6iKkLF4gzVQ"
  },
  "es5ibxdayltfBWw3an_vwA": {
    "date": "10/7/2006",
    "text": "Boy oh Boy. I was pretty fuckin bummed when I moved out here to to only have more bad news on top of no good Chinese food but NO FUCKIN MEXICAN FOOD! For anyone that knows me ... DAS MY SHIT! Sooooooo bummed. But ... I went in to this spot around the corner form my spot in S. Oakland and gave it a shot ... all I gotta say is thank god I found some place! The Thai Burrito is my jam over there. Hold the extra supa doopa burn yer asshole off spicy pineapple salsa. Unless you wanna feel like somebodies droppin' matches out of your ass I highly suggest don't fuck with the spicy pineapple salsa. No Joke. Aside from that, big ass Margaritas and .... every night .... NAKED GIRLS!  Just jokin ... every night after 11 pm ... EVERYTHING IS 1/2 OFF! Couldn't beat that with a woofle Ball bat.  I fux wid it!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "0H6CgVnZeY0pMdLOo--89Q"
  },
  "OehdgaiK8Fsmef9_p0r4ZQ": {
    "date": "6/26/2012",
    "text": "Okay, we only came here for the big ass margarita special, but then I got hungry so I got the hummus. Also, I got a beer instead of a margarita, wasn't in the mood for it. Also, tried some of my friend's, but t i didn't really like it, not a tequila fan. Anyways, back to the hummus. I enjoyed the flatbread! It was really good. Yum yum. The hummus wasn't bad. There wasn't too much flavor too it, a tint of garlic. Bit pricey for the amount, but I guess it was okay.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qpnrU31DaVDjxO8gxkrQGg"
  },
  "JFwreQq40ufpw_7X638gYQ": {
    "date": "7/17/2006",
    "text": "Loud, annoying and uncomfortable.  Perhaps, I am a Californian at heart, but the several times I was here, it was not the greatest experience.  Tex-mex food.  The menus are trying too hard to be witty.  My friend wanted to order the Area 51 burrito, but it was a joke item and was embarrassed when the server said it did not really exist.  Not a place to have a conversation, but hey come here for a couple of drinks down in the Oakland area.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BoUGdFkiU6EVsHGSvt-Uwg"
  },
  "1sNEF-LX09PWf5AehiO09w": {
    "date": "7/15/2007",
    "text": "4 stars for Pittsburgh.  Competent service, good drinks.  I don't love the theme-ed-ness or, for that matter, the food.  But they have lots of great specials and the California salad with lime cilantro dressing is one of the best salads in the 'Burgh.    If you don't like the noise, go for lunch, especially a weekend lunch or early dinner.  Other locations are fine too.  FYI, vegetarians, the dressing has cheese in it.  And it's so good, I bet it's actually real parmigiano reggiano, too, or close to it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "mR2P6XpEdbp0EjNsic721Q"
  },
  "cRU-3x7Jfr-WZVBl3kXLWw": {
    "date": "7/20/2008",
    "text": "Drinks?  Big and yummy and cheap.  4 stars.  Food?  Filling but not spectacular.  Let's go with 3 stars. Environment?  Fun, chatty, and crowded--luckily I've always been in the mood for this each visit.  4 stars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "XQKIgS6XYJOZqidTAypr2A"
  },
  "x6yL8eqL7IlMXp6rsva5rw": {
    "date": "5/19/2008",
    "text": "This is the least authentic Mexican food ever short of wrapping sliced cheese and jelly beans into a fruit roll up.  HOWEVER, you don't go to Mad Mex for authentic Mexican food, you go there for delicious fusion burritos, cheap and deadly margaritas, and loud music.  I live in California, home of the burrito, and I still miss Mad Mex.  When I get a chance to come back to visit Pittsburgh, I make a point to enjoy myself a red velvet burrito or a dance marathon burrito, and of course a Mad Mex Margarita.  I was pleasantly surprised last time I visited to find the new no smoking policy here.  Anyways, this place is great for half-price food and half-price margaritas.  It isn't just because I was in college either.  I would also mention here, that drinking 33oz of generously tequila-ed margarita isn't the best (and certainly not the worst) idea before attending your ex's wedding.  If you decide on this, I'd recommend not breaking the seal and making sure it isn't a catholic wedding first.",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mkxCw6GsMZDu-44_aCQTHw"
  },
  "d1hl-G9eLShiKxdjxCn0rw": {
    "date": "9/15/2010",
    "text": "My boyfriend and I visited Pittsburgh for a wedding and visited Mad Mex on a friends recommendation.  It was fantastic!    You must have a mango margarita!  Delicious.  And half off during happy hour.  If you're going to eat anything there, try the nachos.  Delicious to split and you don't need to order an entree.  The nachos are huge.    Will definitely recommend Mad Mex to anyone visiting Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-06z3EBdDDziAOPFfxOilg"
  },
  "CVfPtk_AIrQwxdLvzx1jug": {
    "date": "7/14/2014",
    "text": "Really great and fast Tex-Mex.  We went as a family of four on a summer Monday night around 6:30.  The place was full, but it's small.  We didn't wait to sit - but we did take the last open table.  The server was attentive and got everything right the first time around.  We loved the intimate (noisy) atmosphere.  The music is lively, and so is the crowd.  All of the things we had were great - my 11 year-old son devoured his wings.  My 15 year-old daughter elected to go with the fried tofu appetizer as her entree, and she took almost half of it home.  I had to try it myself, and thought it was a nice sweet blend of sesame, soy and peanut flavor...  Not really Tex-Mex, per se, but hey, it's delicious!  My steak burrito was full of flavor, and my wife had the mahi fish tacos, which she loved.  The prices were really great - with my wife and I each having two beers (we walked back to the hotel), the total price was under $70.  That's a pretty good deal, no matter what city you're in.  Loved it, and we'll be back next time in town!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3ai42Jx3L9H_yRwLb8lHNQ"
  },
  "5diYfEXTAfnnvzclHugNxw": {
    "date": "7/19/2007",
    "text": "Are you in Pittsburgh? Do have a craving for chips and salsa but are unable to satisfy it because you're Pittsburgh? Just go to Mad Mex. It's my absolutely favorite uber-americanized-californized-tex-mex-bar-restaurant-voodoo-lounge in the whole world!   They're unabashedly american-tex-mex here, but they also respect their Pittsburgh roots. You can get a buffalo chicken burrito here. Try finding THAT in San Francisco! You can even get your burrito with cross-cut fries. oh Pittsburgh - i miss you - sometimes.   That said, they actually do have awesome, humungous, fork-and knife burritos such as Super Mad Mex with Steak. So good. When they say spicy, they mean spicy. The restaurant has the coolest logo ever (I bought 2 pint glasses to take home with me). The service is great, if not eccentric.   They have half-off food after 11pm, in the Oakland tradition. However, its typically way too crowded at that time to eat successfully. The lesser-known secret is they do half-off lunch from 2-4pm Mon-Thursday. This is a much better way to go.   FYI: The chips/salsa are free at the bar but not at the table. Also, they will try to sell you guacamole and sour cream with every dish - but it's not free!  Mad Mex also has a decent selection of beer on tap, including, at various times, Rogue Dead Guy, Delirium Tremens, et al. And of course, they have IC Lite and Yeungling for the pittsburgher in you.  So go, get a huge-azz margarita, some beer, some great food, and stumble down atwood street drunk with the rest of the crowd.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KKdBQXnUlVUZ0ZNTfMQoEA"
  },
  "E2TELXoanbnl15j0x62cYg": {
    "date": "2/28/2007",
    "text": "Before I moved to Chicago I asked the waitress for her phone number. She was cute and had the punk rock getup. She had a boyfriend. I came back two years later and she was still working there.  She remembered me, I asked her what's new and she said it was her last week, she got engaged and got a masseuse license.  Freshman year I ordered buffallo wings (when I still ate meat). They asked me \"mild, wild, or insane\". I said insane. It was so hot my nose started sweating.  Dates Worthy Place? It's a great place to take a date because it's loud!  If you like the girl (or boy) you have to lean in close to talk.  Nothing says \"i love you\" like burrito and hot wings, unless she's vegetarian, then stick to the chickpea chilli burrito.  \"big ass Margaritas\" are 1/2 off from 10 to 11. then from 11pm on it's 1/2 off Food. Pittsburgh is so cheap!  Wall-to-Wall Studios did their graphic design work.  vegetarian: Super friendly! vegan tofu sourcream to soy cheese.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "C9xHi19zVeyLEqNxPiyGIA"
  },
  "Gs-TrEOg7L4ehUHsygjPDg": {
    "date": "9/8/2014",
    "text": "I have been here many times and the food is pretty good. I almost always go after 11PM when most of the menu items are half-off. My favorite thing to get is the Los Wingos Wrap with waffle fries as a side. This would normally set me back about $10 but after 11 I can get this yummy and filling meal for just under $5 plus tip. I also enjoy their chips and Kaya Yucatan Black Bean Dip. Be warned that they often seem to run out of basic ingredients very early. My friend ordered the Chopper Salad once only to be told that they were out of chickpeas and 2 other main ingredients. If you drink, you should know that the drinks here can be a bit pricey. The service is slow and the wait staff isn't too attentive. The music is so loud that you won't really be able to have any type of conversation with the people around you. During the half-price promotional period the place is always packed with college students so come early to reserve a seat or be prepared to wait for 15-30 minutes.  All in all a good place for a very cheap late night meal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_xVhbu3LrA1cXW6az72c-A"
  },
  "fQBfl_sgvlPHwPP64NERZg": {
    "date": "8/26/2012",
    "text": "Basic Tex Mex. The restaurant offered me nothing I would go back for. I would say if you didn't grow up in or spend considerable amounts of time in the southwest/west you might like this place. I put Mad Mex in the same category as an Apple Bees.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2zc7wRvtnQn-WjIfloUOew"
  },
  "s8IE8YNf77SQcjuAaZMMLw": {
    "date": "11/14/2014",
    "text": "Good food, but bartenders are not able to recognize a legitimate ID and don't have the necessary tools to check one.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Eld1-8syC3PZPZ0U254yBg"
  },
  "OzBcKphjCXbz1m6UUQ3_BQ": {
    "date": "10/14/2014",
    "text": "I have been going to Mad Mex ever since I was a kid and it is still as great as it was back then.  If you are looking for a great margarita this is the place to be with Mad Mex's Big Azz Margaritas.  Amazing deal for half off margs between 9-11pm in various flavors either frozen or on the rocks.  They have a special flavor that changes every month as well.  The food is equally as great, I especially LOVE their burritos.  Students get 1/2 off Mon-Thurs 2-4pm, which is totally worth it ($4.5 dollars for a HUGE burrito!). Be sure to get the bean dip because it is life-changing!!  Be careful when paying with a credit card though, I have had multiple friends have the wrong amount charged to their cards.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dExGhkCBdTpcEB75Cg_Cig"
  },
  "_HENq6QsTtGXfsBWTu9bKA": {
    "date": "1/15/2010",
    "text": "Extreme dim lights ,people everywhere and good smell coming from the tiny kitchen.        Apart from the crazy designs they have on the wall;i did keep starring at them until i was there and i think most of them were dragons or atleast looked like them.      I ordered the Golden tofu and i love it for two reasons <a href=\"/redir?url=http%3A%2F%2Fa.It&s=4e303e28b5ce4c5a9f13cd902fefbd1b2208ec257e6b80c82fa5237520c4f29f\" target=\"_blank\" rel=\"nofollow\">a.It</a> is tofu :D <a href=\"/redir?url=http%3A%2F%2Fb.it&s=e1806d16617c200d915bf79fe16bbd4bef5a68a533c745533cc64682fc392fa9\" target=\"_blank\" rel=\"nofollow\">b.it</a> had biscotti texture on the outside  Woah!! Biscotti filled with soya who wouldn't love it?? I definitely do!! I went to this place twice and i ordered the same thing.Not my fault!! *Keeps a sad doggy face* they do not have many vegetarian choices .     But it is  a great place to go hang out with friends and try talking.Note the point TRY TALKING.That's because they play the music so loud like a club,therefore by the time you are out of the place you have lost your voice or your ear drums.But don't worry you shall survive with the yummy food :)     wow!! This all explains the name MAD Mex :)  -Smriti",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Ezjju1mwsQRoVQlsiIq-Q"
  },
  "tBYbE7Tp8isI_2CTSz93eg": {
    "date": "4/12/2012",
    "text": "The food is roughly as good as any other restaurant in it's price range, and it is very dark with loud music, making conversation difficult.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LpxXUjPyvodtybLlVc9oBA"
  },
  "zDqcMnTJVCtfYrr6N3vJxQ": {
    "date": "5/26/2012",
    "text": "Mad mex Oakland gets 5 stars. Always great service, the big azz margaritas are great, and the location (though tiny and crowded) somehow adds to the fun - always good music and a good crowd. The burritos are A++",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k0irPfpse8q_v_O27fkStw"
  },
  "x_fhgb784Gh0fK7LWmZgWg": {
    "date": "5/25/2014",
    "text": "I went here with my son a few days ago who will be attending the University of Pittsburgh in the fall.   Wanted Mexican but didn't want the national chain stuff like Chipotle and Qdoba (which are right on Forbes Avenue,  basically Eatery Row).   We took a four block walk from the main drag and saw the neighborhood get a little seedier as we walked.   The outside of Mad Mex looks scantily enticing and the inside of the place just a little but better (I loved the Mexican Day of the Dead artwork, though).   Our waitress was prompt and friendly but never overboard.   My son order a vegetarian dish and I ordered a house special enchilada.   Both were excellent.  My dish had spinach & zucchini,  two things I didn't expect in a chicken enchilada.   But it definitely added to the entree which was perfectly spiced.   The place also has a very good bottle &  draft menu.  Prices were compatible to other Mexican restaurants.   All in all,  a worthwhile trip off the beaten path.   I will definitely.  I will definitely be making g another trip here when I return in August with my son & wife.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xDg7CGDXc5Wqn02AfNcTRA"
  },
  "VEkcvdiFo7olZ9xp6sa11Q": {
    "date": "11/26/2008",
    "text": "I love Mad Mex, despite the fact this location is tiny and crowded. Any Mad Mex is going to be great in my opinion, but this one is close to my heart since I spent my 21st birthday there.  We come pretty often for happy hour (4:30 - 6:30) where you'll find half-off drafts and wings. They don't advertise it, but I think you may get a discount on all margaritas, not just the big azz ones ($7 opposed to $10). The margaritas are THE reason to go, in my opinion (avoid the hibiscus peach one - it's pretty hard to drink and $12). Until the end of November they have cranberry and pumpkin margaritas as well. The pumpkin is surprisingly delicious. I'm not sure if it's only during happy hour, but you get free (and refilled) chips and spicy salsa at the bar.  But wait, there's more: they serve damn tasty food! And with half price starting at 11 (luckily one of the \"select items\" are the burritos), you can't pass it up.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6CoMpwA8D2s00RfzpKDuOg"
  },
  "I4ByYpO9qYsMV1ttTOMRMw": {
    "date": "9/27/2011",
    "text": "We were so excited to try the Mad Mex in Pittsburgh because we have so many awesome memories from Philly but unfortunately, this Mad Mex is just not the same. I don't care that this one is smaller but the food is just so below par. We've been twice in hopes that it would have been better the second time but no. Food was okay, beer/drinks were good and staff was nice. i love Mad Mex for their extensive vegetarian and vegan options but there was something missing from the food here. I'm going to give it one more shot.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qIossUhtsJ55_ciRTEqiPQ"
  },
  "5WHhsy_3AjCCeW6rebq59w": {
    "date": "6/13/2018",
    "text": "Arrived with a party of 5 at noon on a Wednesday, the place wasn't busy. Two women and three children. Was seated and nobody ever came to serve us, not even to take a drink order. Never got kids menus. We caught the wait staff glaring at us multiple times, including eye contact. We tried to flag down the wait staff multiple times and were ignored. Finally left the restaurant, it was the most discriminated I've ever felt in my life. Wasted so much time parking in Oakland to boot, worst restaurant experience I've ever had. Don't seat your guests and then treat them terribly.  Normally love Big Burrito restaurants, been to many, always felt welcome as  a parent and patron. This was terrible.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "7jo-yVpriVPnvWLhYjGLdg"
  },
  "u3OYn9Tsi-lx7UG2_KRSRQ": {
    "date": "8/9/2018",
    "text": "Delicious Mexican food that are very filling plus the margaritas! Cute small location compared to the shadyside one but the outside seating is nice!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N657YsSiqLXd-FAGXHB--w"
  },
  "MZ2rI5GKPuSDdGkGuq-jXw": {
    "date": "3/30/2019",
    "text": "It was okay. Not worth the hype, but considering the lack of sit down Mexican food in Oakland I probably will still be back. I Ordered the cheese dip and it was only room temperature. Flavor was nice but temperature threw me off. Also ordered the Mad Mex quesadilla, the vegetables tasted good and fresh but the chicken was very dry and there was barley any cheese on the quesadilla. The restaurant has a good but there are things to be desired.    Also the service was awful. As a server myself I was confused. Never got her name. She noticed that we were still waiting on people in our party so just left us (didn't even take our drink order) and didn't come back for 10 min. We had to ask for everything, napkins, refills, our checks. We even had to ask to appetizers and dessert included (interesting to me bc as a server I would want to up the tab by offering those items).   I could over look the sub par food if the service was good but both were lacking. (Service especially)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v7iu2nRaS0nGSBG4GKolbQ"
  },
  "Erj-xH3Z9zLfPcVajpEuOA": {
    "date": "6/29/2019",
    "text": "The bean dip is super good at Mad Mex. They have deals at this location too. It is small however.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oFrVn23LSrwfCcwL1CNEhg"
  },
  "Q6tYGRQ6Sr4-Bc1-TvsSTg": {
    "date": "12/6/2017",
    "text": "Stopped in for lunch and a beer.  Ordered a Southern Tier 2XMAS at 8.5% alcohol and $7 and a Spicy Mad Mex Burrito.  The beer was very good but I have to limit myself to 1.  The burrito is delicious!  It's very spicy w a hint of ghost pepper (def not for the non- spice appreciating crowd) but I can tell I'm gonna taste this burrito for hours...  I like that.  Food 5*, Service 4*, wish I could give them the 4.5 stars they deserve for this visit.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "B6EXcKIEiowFzZBe0ZjYMw",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Happy Hour menu...  LOVE the &amp;#39;Student Halfsies&amp;#39; deals...  I was a struggling student once.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/B6EXcKIEiowFzZBe0ZjYMw/o.jpg"
      },
      {
        "img_id": "sOg4BO3l1vCHL65iwoSERw",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Spicy Mad Max burrito...",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sOg4BO3l1vCHL65iwoSERw/o.jpg"
      },
      {
        "img_id": "uLUskMCaXJx3qXe8jf52ng",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Southern Tier 2XMAS draft, delicious...!  But only in moderation...",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uLUskMCaXJx3qXe8jf52ng/o.jpg"
      }
    ],
    "user_id": "vD2HML4pseH8-0HH3CrWzA"
  },
  "-B3476h4omUnGQ7W1m-Vpg": {
    "date": "1/17/2018",
    "text": "Very good Californian style Mexican food. Place was filled with college students but the food all tasted great. Staff was very nice too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RPUUpNJVrBFfCtdWSERIxw",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Steak Tacos. Very fresh",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RPUUpNJVrBFfCtdWSERIxw/o.jpg"
      },
      {
        "img_id": "nQS-1Rs81x3C7i4vkYLbkw",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Carnitas Quesadillas... so plump",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nQS-1Rs81x3C7i4vkYLbkw/o.jpg"
      },
      {
        "img_id": "Mlj0RHb7wiZ4XSroEe8rgg",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. San Francisco wings. Very crispy. Blue cheese dipping sauce was great",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Mlj0RHb7wiZ4XSroEe8rgg/o.jpg"
      }
    ],
    "user_id": "rNRqtp50e-oKbS10q6Q7Dg"
  },
  "9v5s0_c4IkIGENgI0tbFPw": {
    "date": "11/22/2017",
    "text": "Came here for their late night half off food. I had the potato taquitos and was unimpressed. The filling had no flavor. It was basically just some boiled potatoes. My friend had the Jersey Chips and those were delicious. They were nice and crispy and served with ranch and queso. My other friend had the spicy chicken burrito and was satisfied. I think I just ordered the wrong thing. I wouldn't mind coming back and trying other things as the half off price is very reasonable.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "g92YD6N7XxuSLnZGiP0A9Q",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Taquitos, jersey chips, burrito",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/g92YD6N7XxuSLnZGiP0A9Q/o.jpg"
      }
    ],
    "user_id": "gofnmwo5ptoEnQI47zCBYg"
  },
  "iw9wQA0n4CTl4B0RPMd3Fw": {
    "date": "9/26/2018",
    "text": "Mad mex? More like mad microwave and freezer. The food at this place is TERRIBLE. Service was mediocre. I got the corn chowder it, I got it 2 minutes later and it was cold and tasted like freezer.  It would have been nice if my waitress could have microwaved my chowder for another minute but she could obviously not be bothered. I ordered a chicken quesadilla, i got it within 4 minutes of ordering it, presumably, because it took that long to microwave it. It tasted like freezer, the chicken was rubbery, and the salsa was literally just diced tomatoes with salt. There is nothing Mexican about this place. The food isn't Mexican, the people who work there are all Caucasian and clearly know nor care to know what Mexican food should look or taste like.   I'd sooner eat gas station sushi with a glass of tap water from Flint, Michigan and then let mike Tyson uppercut my stomach before I come back and eat here. My stomach sure felt like the latter once I left this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yzn-KDu-YchRKi8ldW6nUA"
  },
  "iVfzwV2nLGwNrmYzsfWR-w": {
    "date": "3/22/2018",
    "text": "This is just your average so-so Tex-Mex restaurant. Literally just average. Nothing I have  ever had here has ever stood out to me. BUT The wings are actually pretty decent. Oh and the Big Azz margs never disappoint. They are also pretty cheap so that's a plus. Also I have never had bad service, so that is also a plus. Just wish their food was better,",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 4
    },
    "photos": [],
    "user_id": "ObqVg5hj-OzGfP2obqBzlw"
  },
  "4WYL4qoYxTKSzrfZYVskfg": {
    "date": "1/30/2019",
    "text": "Food is good and the portions are pretty big. The main problem is how tiny the restaurant is and it takes quite a while to get seated. There aren't really any tables for larger parties and there is nowhere to wait for your table inside when it's cold out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7quJ0B1qUGGcCEXNEwLItQ"
  },
  "xaMMjXOWOo65sPTWDkkuDA": {
    "date": "1/2/2019",
    "text": "Amazing Nachos Grande!!. Everything is 50% off after 11pm. As a grad student, this little restraunt at the corner of Atwood was our savior! At the end of our 12 am assignment deadlines we would hop onto the shuttle to get dropped off at Mad Mex. As a group of 3-4, we generally ordered Nachos Grande, Buffalo Wings and Ice Cream Burrito for the table, costing about 15-20$ or less.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UO2ISiHHf0YQNobgDjg0iA"
  },
  "RmlzSUtSJPW-WF9Xc_spTw": {
    "date": "9/16/2018",
    "text": "Mad mex is always reliable for yummy, strong margaritas and huge potions of pretty good food. On this visit, I had a frozen strawberry margarita and the seasonal grilled chicken and corn burrito. The margarita had a fresh strawberry flavor, as well as plenty of tequila. The burrito was huge! It tasted okay. It was supposed to include feta cheese, which I unfortunately didn't see or taste. I'm the past, had some of their other dishes, like the enchiladas and the wings, which have been tastier to me.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iEJAlXOJFbw4lJNx-P2Hpg"
  },
  "9cjXpd2i6wjqMDrnpG_4pA": {
    "date": "11/12/2018",
    "text": "One of my favorite places to eat in Pittsburgh. I had the herb o'vore's tofu tacos and they were outstanding. The seasoning they used on the tofu was delicious. They have lots of vegan options. The service was great and I thought the prices were reasonable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "giG8RUfdkJfhw5M3BvkaMA"
  },
  "-nenDRZFgkQvUZ7tZlCOdQ": {
    "date": "8/22/2018",
    "text": "Update 8/22/2018: Someone from Mad mex reached out to me shortly after posting my review. They wanted my contact information so the restaurant could reach out to me to discuss my experience. That information was provided three weeks ago and I've not heard a peep from Mad mex. Sure seems like they're concerned how negative reviews look here and probably think users like seeing a promising response from the business. In my case it is just that, for appearance. Not a bit of substance.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5R7Wu2kmCBv5951c9dNz4Q"
  },
  "MuYWoDxiItwVOaPpCqKYXA": {
    "date": "2/7/2018",
    "text": "I think it's good for late night, local food if youre hungry. Definitely not the best mexican restaurant I've been to because the service is also slow. Their drink menu is great and their half off menu is also awesome. I'm a big fan of their enchiladas and nachos. I probably wouldnt recommend Mad Mex to people from outside of Pittsburgh because there are some other restaurants that are considerably better in terms of the amount of food you get for the price you pay.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3oKtLdAO138VHY8KTlpXuQ"
  },
  "SACzISAJ717u-AUyIhUiWA": {
    "date": "8/9/2017",
    "text": "If you want fresh delicious TeX Mex with a local twist, look no further! Great happy hour and late night specials, currently enjoying a rose draft cider for a mere $3.50. Never had a bad meal, usually have leftovers, word to the wise -  if you're headed out to a show etc might want to share or order an app!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dR9yN4x2D4LBODFG3Btsvg",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Rosé draft only $3.50 during happy hour",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dR9yN4x2D4LBODFG3Btsvg/o.jpg"
      },
      {
        "img_id": "klCp_V64Gexrasm579469g",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/klCp_V64Gexrasm579469g/o.jpg"
      }
    ],
    "user_id": "o9cHwoFocl2YCsg9mg7MCw"
  },
  "GaWuW5xyMYkMXsxLWI1RfA": {
    "date": "7/29/2018",
    "text": "I've eaten at several Mad Mex establishments and I must say that this one is the worst. I ordered a cheese enchilada and it was cold to the point that the shredded cheese was uncooked. The chips are and added cost, which for a \"Mexican\" restaurant is just ridiculous, and the salsa is another 2 dollars. I'm giving it 2 stars for convince and okay service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FEW7pLU0TEhLvG20_Vw38w"
  },
  "zVlNtVk1aTC_Qr_Q7Q3WpA": {
    "date": "1/28/2018",
    "text": "I gave Mad Mex 3 stars due only to the food. It was my second time coming here for late night and I usually never write reviews but I felt the need to after our horrible horrible horrible service.   My friends and I came at midnight for late night were seated pretty quickly. However, we quickly realized that our waiter was not good whatsoever. I'm not kidding when I say he was definitely the worst and rudest server I have ever come across. He was rude in that he didn't communicate whatsoever, took my food without asking if I was done with it, just plopped our food down without one word, never checked in to see how we were doing, did not even give me the correct amount of change back, the list goes on.   I really hope this location evaluates their waiters and waitresses because I was hugely disappointed by our waiter. My friends (one of whom has been a waitress for many years) also agrees that our waiter was probably the worst they've ever had.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oiNE4MJQTBOpMdtEHQhtQw"
  },
  "7zuY8e5SYJGt1gRISdBIsQ": {
    "date": "1/16/2019",
    "text": "I've eaten here 3 times, and 2 out of the 3 times I had the experience of having the exact same waiter messing up my order.  Normally it wouldn't bother me but having strict dietary restrictions due to health and religion, I was extremely disappointed.  I had asked for Avodilla quesadillas (vegetarian), and double checked with the waiter to see if they were vegetarian, but she handed me shrimp quesadillas.  A few months later I decide to come again.  The second time I asked for nachos, requested no meat, and even double checked because I thought I learned from my previous mistake.  The same waiter there, still rude as ever, put beef in my nachos.  This waiter does not care about her job or the people coming in.  Also the food sucks.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yjtSp_ZyQbkldOB1TXmaOQ"
  },
  "P1vCKhXH7NWRAnx-e0h7Yg": {
    "date": "4/9/2019",
    "text": "Food was good, the service was good, loved the restaurant itself! Lighting and decorations were calming and beautiful! Didn't love the salsas all that much but they weren't so bad either! I would definitely go back! The fajitas are delicious and my husband enjoyed the wings!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qKBuIykEL0YJbSQ-WjF3jw"
  },
  "0sXb49DJSReNwDXkW0MXMg": {
    "date": "7/10/2011",
    "text": "I went to school at CMU and while I was there everyone seemed to love this place, but I never got too into it. Its best feature is that after 10pm you can get a 22oz Margarita for $7, which is probably the cheapest way to get yourself on the way to a good evening at a bar in Pittsburgh. The margaritas themselves are nothing too special; however people who are on their second may say differently (this includes me).  The food is fine but nothing special and the place is extremely loud, crowed, and dark. It takes a while to get a table and even if you just want to stand at the bar it is often hard to find a good spot. Also for college students there is the added irritation that they enforce a rule that if anyone at the table is under 21 then nobody can drink unless you have somebody over 25.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GBDp2GNoObBqwp30nPj3Ew"
  },
  "tixbDtiHdijKh1pzg9-kcg": {
    "date": "8/6/2010",
    "text": "Half off deal at. night is really worth it. Good portions for half of the price!  Get their wings, or their steak burrito. Big Azz Margaritas with a lot of alcohol content for $7  The parking is not the easiest to find. But you can also take a bus. The place is loud and crowded so you have to have the patience. The food quality and the price makes it all worth it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xpkdFgOVRX43fV0begAaOQ"
  },
  "P8qwhoHQV3FcNGoW9wqbBg": {
    "date": "6/28/2015",
    "text": "GREAT MARGARITAS. The food is good, but they don't use a lot of cheese. Half of deals are really great!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ktj4sAdCOFULMdh5A2-5Vw"
  },
  "kDmvUQFOsqIyrYDNwEBD3Q": {
    "date": "4/5/2010",
    "text": "The four reasons why I've never paid full price for anything at Mad Mex before:  2-4 PM: Half priced entrees w/ student ID 4:30-6:30 PM: Half priced wings and $7 BIG AZZ Margaritas 9:00PM -12:00 AM: $7 BIG AZZ Margaritas After 11:00 PM: Half priced entrees  Anyways, on with the food.  Mad Mex serves up super Americanized Tex-Mex and they don't pretend to be authentic by any means.  They have burritos, tacos, nachos, salads, wings, you name it.  For me, I go solely for their wings.  A large order of 14 wings ($4.50 when half off) is more than sufficient, and pair that with a $7 BIG AZZ margarita and everything is good.  Flavor of choice?  San Francisco.  All their flavors are good and their wings are some of the better wings I've had in Pittsburgh in terms of how well they're cooked.  If I'm not getting wings, what would I get?  Wing-o-rito.  It's a burrito w/ chicken inside that's smothered in wing sauce.  Okay, I really like their wings.  Try their double dipper with black bean dip too!  It's super hearty, slightly spicy, and pairs perfectly with a margarita.  If you go at night, it gets LOUD.  And the place also fills up fast after 11 PM, so you might have to wait if you don't arrive early.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "sWo7bAIUY_XBe33LKmNK9w"
  },
  "DCXVgs9g2kZBYPND74qZZQ": {
    "date": "8/1/2013",
    "text": "This place is fast with friendly staff. The decor is new. Highly recommend!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gP0ssVYaIFX5miYWrMllZA"
  },
  "ZxGdRTPh37-XHloZENhj6Q": {
    "date": "5/28/2011",
    "text": "Great Tex Mex food served in an extremely trendy restaurant.  The restaurant offers half price food from 11.00 PM onwards so its always packed with students. The nachos grande and the honey barbecue wings are my favorite things there.  They also offer a wide selection of margaritas and beers and is a perfect place to go to when you don't have a lot of work to do for the next day.   The only negative aspect of this Mad Mex is the lack of seating. There is almost definitely a 20 minute wait if you go for food after 11.00PM so it's better to go there at around 10.30 PM put your name down on the list.   Although I have not been there for lunch, I have heard that they haven half off from 2.00 to 4.00 if you show a valid student ID.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pf-kTkbZICMOy_h1kqOjWA"
  },
  "df8nAB3JpvWphUo8mWQ3AQ": {
    "date": "5/13/2013",
    "text": "Awesome food if you order straight off the menu without any special instructions. This location is the smallest I've been to. It's elbow to elbow in there almost all the time. And it's LOUD.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QFmoKChS3uVh_Tnbyp0QMw"
  },
  "zQovK1GmGGXO07ySNsq0IA": {
    "date": "4/30/2010",
    "text": "The good: I love the pork enchilada. The meat is sweet and tastes slightly of beer. The blue cornbread is fantastic with a pudding-like center. The chips and salsa are good. The ground beef is well seasoned and awesome. I like the coleslaw even though I don't really like coleslaw. Student half off 2-4pm Mon-Thurs.  The bad: The chicken can be a little dry or chewy. The rice is blah.  Overall, my favorite Mexican restaurant in Pittsburgh. Big Burrito, the restaurant group which owns Mad Mex and other Pittsburgh staples like Eleven, Soba, and Phipps Cafe, manages to fuse Mexican dishes with their signature inventiveness and style to create menu items which are by no means culturally authentic but taste very good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NyYZUEQBYU7D2EA_F9bObw"
  },
  "UgSZThYnbxzp6JMo7d9XBQ": {
    "date": "3/16/2015",
    "text": "i was seriously impressed with this place. after 11 food is half off. we got so much food for $20. the tofu dish was so awesome. can't wait to come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qcfXkGzPcYe1tDn42eAJTg"
  },
  "tILjLjnjENEmcT6LL_WvwQ": {
    "date": "4/11/2013",
    "text": "It doesn't pretend to be actual mexican food, but it is good for what it is. Big meals, cheap, served fast. I enjoyed the huge number of vegetarian options - practically everything on the menu can be made meatless if that's how you're rolling. I had tofu in my burrito, which turned out too mild compared to the loud flavors it was paired with. But filled me up, and I love any place the serves chick peas. (I know, I know. I just love them.) I tried some of the corn bread, and will say if you've never had real cornbread you'll like it. It tastes good, because its actually cake.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2dTQmS9iUhzdvhSElbkOOQ"
  },
  "4kbXbqREDl2r9iwZ3XuJsA": {
    "date": "7/30/2016",
    "text": "I went to the University of Pittsburgh for undergrad and my friends and I would go to mad mex all the time. So when I came back to Pittsburgh for the weekend, I thought it would be cool to stop by MadMex for old time's sake. When we arrived, the place was packed - a good sign. Two men got up from the bar so we told the waitress to get us the next available table and we would order drinks while we waited. Everyone ordered the big azz margs, which is what mad mex was known for when I was in school. I got a frozen mango marg. Sounds good right? Well, the marg itself tasted nothing like mango, it was more of an orange juice flavor. Then, after the first sip I realized that there are chunks of something floating around and getting in my mouth. Even the mango marg on the rocks, which one of my friends ordered, had chunks of something floating around. It was so weird. Then, the waitress comes back saying that there is an available table, and we're like \"great! Lead the way.\" But then she asks us whether we are going to order food. I look at her, confused, and say \"well my friend just ordered food but I think the rest of us don't want anything to eat.\" Then she refused to seat us because we have to buy more food if we want to sit down. I was shocked, and confused, because I had been to Mad Mex so many times in undergrad just to get drinks and I was always seated. When I questioned her she says \"well my manager is right over there, you can ask him.\" I turn, look at him, and question him about this policy. I ask whether we all have to purchase food to be seated. He says, no, so long as at least one of you is ordering something. Ironically he is delivering the chips and cheese my friend had just ordered at that moment, so I say well, \"she ordered something, it's right there.\" He then said that it didn't count because she ordered it at the bar, but she only ordered it there because we were waiting for a table. I understand if it's just easier to separate the bar stuff from the seated table stuff, but this is a situation in which the circumstances called for a little leeway, since we made it clear when we walked in that we wanted a table. So of course I get upset and tell him he can take the order back and start a new one when we are seated. And I was quite serious about it, because this policy was so strange. Had we been seated right away instead of going to the bar, would they have told us to get up and stand when they realized that most of us just came for the drinks? Anyway, I left Mad Mex fuming, and I told myself I would write a review. Not to get back at them because at the end of the day I got the marg , although disappointing, and I was seated at a table. My purpose in writing this review is to let people know about this policy if they plan on going, and to let you all know not to get the mango marg. I still feel like there's chunks in my throat. However, my friend had the strawberry one and drank it all without complaint so if you're going for a marg, that's the one.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7VeB6QJpdKFzF2NFQLQl8A"
  },
  "ZrKkeiIh90sAjgjV9jXfyw": {
    "date": "10/9/2008",
    "text": "Total bargain for students, with 50% food up until 4pm daily.   CA living has made me a bit jaded or that I'm a little older,  but the food here is bit lackluster.  Lots of volume, and very little substance.  Just like college kids!  The menu is creative and offers a lot of variety and a number of veggie options and the prices are great, but its nothing worth driving cross town for.  Ok, maybe that blue cornbread.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "dim5Svrt-B1jvvQsOIX22A"
  },
  "O5eZOoS1Ry674VrKnIXRQw": {
    "date": "1/17/2013",
    "text": "Great chips and salsa and guacamole with a great selection of salsas and sides. We had taco salad, chicken enchiladas and a cheese quesadilla which were all tasty! Great they have free wi-fi. Service is also great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pTBL-Wq-PPcTnkb3mffIIA"
  },
  "SeA912SZe5c8A4ytaMMYrQ": {
    "date": "2/17/2010",
    "text": "As a Pitt alum, I've spent my fair share of time here.  In summary: decent food, strong semi-good drinks, very average service, and too small of a space.  I generally avoid going there unless if it's summer or winter break. The food and drinks are OK, but not nearly good enough to have to deal with Oakland parking/traffic/etc and waiting 45+ minutes to get a table.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "l2S62fnyODeQWChxhIsEjQ"
  },
  "gngm-nSvdZGuxTV-h4AxXw": {
    "date": "2/4/2008",
    "text": "Meh is right.  It's always ridiculously crowded. It's in that generic Cali Tex Mex restaurant chain style where quantity matters over quality. The drinks may be large, but the tequila they use during happy hours is borderline mezcal. The food is mediocre and overpriced. Service is VERY uneven. Dim lighting probably hides a multitude of sins.   Be sure to carry multiple IDs if you are not American. I had issues getting in with my passport. Yeah, are you freakin kidding me?  I guess that's typical of a place where many underage kids try to get in. However if they don't let you in, that might be doing you a favour.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "dHKq-j3rNwNDKQ0xGXRCdw"
  },
  "dSA5osTAs-dZvWCV6zCIdQ": {
    "date": "11/10/2009",
    "text": "Mad Mex reminds me of my time at Duquesne.   I used to run here for the one hour that I could get the Big Azz Margarita for $6 but now I think it's $7 (sometimes before my European Union night class!). My personal favorite is the frozen raspberry Margarita!   Also I love the potato taquitos, who doesn't love a tortilla stuffed with mashed potatoes!!!   I came back after 5 years and Mad Mex is unchanged, hallelujah!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "AEwB-rgAJMzfkM6WnYi9Mg"
  },
  "_cAjZEFiFUiT_5kI8dN1Vg": {
    "date": "6/15/2007",
    "text": "Pretty good Tex-Mex. Mad Mex is part of a chain of semi-themed restaurants by the Big Burrito Restaurant Group. Sometimes the theme-ish-ness can be a little overdone, but I think it's fun.  At night the place gets really loud and filled with college students there for drinks. During the day they have some great lunch specials. It's always really dark.  There's much better Tex-Mex in other parts of the country, but this is some of the best you'll find in Pittsburgh. I enjoy some of their experiments (if you're bored of a particular dish try the shrimp version).  If you're not one for loud, crowded restaurants, I do recommend trying it during lunchtime. You might want to bring a flashlight to read the menu though.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "A_kjbEIjOGTsZnqHNP8FvQ"
  },
  "bNbQopU61Leg0PKx9aWi-Q": {
    "date": "10/3/2011",
    "text": "Probably the worst Mexican food I've ever had, and definitely the worst service. They brought me and my wife back after I complained (something I RARELY do), and again, it was pathetic. Thank you to the GM for trying to keep our business, but your staff totally blew it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Pj91NFPtXWeIDaLp2kuyw"
  },
  "BfOgUB-U-fDNuF7m79EIAQ": {
    "date": "2/25/2009",
    "text": "I used to play in a band and was taken to Mad Mex after a show in Pittsburgh.  Maybe my opinion is swayed by finally getting to eat around 1am, or the half priced burritos, or the cheap beer.  Whatever the reason I dug the place.    As a side note, the guy who took us there was crazy.  He squatted in an abandoned apartment (I opted to sleep in the van).  I asked him how old he was and he said he didn't know... then he started to cry.  That crazy bastard knew where to get a good burrito though.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cv9dgtqH1gJBfL0WMv4Htg"
  },
  "wCO-8YNpcTO47WjRzU6MpA": {
    "date": "7/13/2008",
    "text": "Mad Mex has THE BEST burritos I have ever had hands down. My first visit was sometime during the summer of 2005 and since then been a staple dining place until I moved to Chicago.   Not only is the food delicious but the Big Azz Margaritas are awesome, especially if you're there while they have a special.   I have a love/hate relationship with this location for the simple fact that it is always so crowded. I love the half price after 11 and the food is always excellent but you're often waiting a while for a table.   Ive been to several other Mad Mex locations, and while they don't offer the half price special, the atmosphere seems more like a restaurant than a crowded bar.   seriously awesome food. I can't wait to take a trip back to Pittsburgh and stuff myself with a burrito.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "wxrComr6CCKGJbPtGsvTDg"
  },
  "G6oDaGIMDymEyzrEY7RA5w": {
    "date": "8/12/2019",
    "text": "Just in town for a day to check out CMU and we felt the need for some local Mexican food. Very glad we went off the tourist path (more or less) and found Mad Mex! Eclectic, college-type environment so go prepared for noisy fun, a wide selection of beverages, and some great food (don't deprive yourself the homemade chips and guac). I went for the Spicey Mad Mex burrito which was pleasantly spicy and not overwhelming. The only reason for not 5 stars was due to the way four seriously drunk, disruptively sloppy and loud, middle-aged women were handled. A festive atmosphere is one thing, but these pigs went way beyond that, for the entire time we were there, and I think the management could have gone further to deal with it. But it was a tricky situation, and we were guests to this town, so whatever... Go. You won't be dissappointed!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PeKmjk4n7YACFm2b0AEBfg"
  },
  "g--2UR55UPGp4qnHzu-Pkg": {
    "date": "8/8/2019",
    "text": "Mad Mex's food has disappointed me for the most part, but the deals are good which is why I usually return. However, after this most recent time, I won't be back.   The previous times I've been here I've tried their quesadilla, which was extremely dry and seemed frozen as another user said, and I've had their wings which I was not crazy for. But hey, it's a Mexican place.   The more recent times, however, I've enjoyed their seasonal chicken and corn burrito which was actually  very tasty. But I was once again disappointed at my last visit.   I arrived after 11 for the half priced deal, and received half the quality of the food. I asked for my burrito with no jalapenos as usual, and it came with jalapenos. Didn't bother sending it back because it was half off and I didn't want to be a pain. But now, I wish I did.   I took my first 3 bites of all rice. Continued and had maybe 2-3 pieces of chicken, and boxed the rest. As I eat my leftovers, I can literally count 1 piece of chicken in over half of the burrito. I literally had more jalapenos than chicken. I thought Mad Mex had finally won me over, but I was wrong. Skip the food, just get a margarita.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JacNgFySdAFgCP8kDfRhVw"
  },
  "XPWFsR5VvJdZVROa6V2CTg": {
    "date": "5/10/2019",
    "text": "The worst management I have ever seen. Manager David was very rude and disrespectful . He refused to even have his staff to wish us congrats on the engagement .  Servers were amazing though especially Rico he's the bomb ask for him to be your server !  Bartender was great as well!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PuScH9LJhr42TFhC1uh_-Q"
  },
  "c-1B1m0KfZDpAhBTRD3bPw": {
    "date": "2/24/2019",
    "text": "Having been a Pitt student, this Mad Mex location will always hold a special place in my heart. I love the Day of the Dead artwork and atmosphere, though it can be a bit dark and loud sometimes. When it's warm they open the window and have an outdoor bar that you can sit at, which is nice. The food is always consistently good and you get A LOT of food. Margs are always great, though the frozen mango one clogs your straw a lot with the chunks. I love that they have a ton of vegan and vegetarian options, although they have messed up my orders a few times so be careful to check if you follow a strict diet like that.   You get the best bang for your buck if you go while it is half off food from 11-1am--I got this huge burrito for $6! The half off discount does not apply to tacos, the chimi, or desserts, so be aware of that. Also, it's always crowded during this time no matter the day of the week so you may have to wait a bit.   Overall, Mad Mex is an Oakland staple and I'm grateful to live down the street from it for whenever a late night craving strikes, but it's rare for me to shell out the money for the food at full price.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "P3HqrDMLFvf85Wz0Q673wg",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Super Mad Mex Burrito with portabella",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/P3HqrDMLFvf85Wz0Q673wg/o.jpg"
      }
    ],
    "user_id": "a-p_jg612cvzZnoGPNOgAQ"
  },
  "l7MQnsd7dVoRZUUdqU1I1A": {
    "date": "4/24/2019",
    "text": "Margaritas are okay, a little bit watered down in my opinion. I decided to try to churros for dessert last time I went and they were okay as well. The only problem with it was that is was so extremely sweet I had a stomach ache after I was done. Probably not the best combination to have for dessert, but I would go back for their other food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2Tyc6ZyAA_XFZSmWsFRMZA",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2Tyc6ZyAA_XFZSmWsFRMZA/o.jpg"
      }
    ],
    "user_id": "YujmPASZsHjVAtrYcmRm4w"
  },
  "bv6RV1hrJdBFC-AMTJPJYA": {
    "date": "8/10/2019",
    "text": "Good food, really bad management, if you're Oakland, it is an ok spot to go hang out, but if you can drive to a different mad mex, I definitely would do that instead.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "h7eApdkxRYKiWkOC29ljGA"
  },
  "MtOJ1KF0K5KxIMhGqr6nQw": {
    "date": "8/23/2019",
    "text": "The SLOWEST service of ALL TIME!!!!!!! They took over 30 minutes to get me my food. Definitely a collegiate spot that was trashy!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XKvj8PRTKT5Xqx4MuMQtwA"
  },
  "Lg09OtvMD0x31gbuTCtvgA": {
    "date": "1/21/2019",
    "text": "mad mex is a classic place to grab late night food, especially since it's 50% off after 11pm and honestly that's what it's best for - cheap, greasy food when you're craving it late at night.  however, it gets incredibly crowded and loud and it's difficult to get a table. the restaurant is small and dark, feels cramped even with small groups, and it can be difficult to get service, though the wait staff are nice when they eventually get to you.  we went to grab the famous thanksgiving staple, the gobblerito (which does not qualify for 50% off) and frankly, it was disappointing. tasted just like thanksgiving, but it was all mushy with no variety in texture, wrapped in a bland tortilla.  we were intrigued by the calamari (a \"throwback\" limited time menu item, also not 50% off), and while the sauce and breading were good, we were fishing for calamari amongst the copious breading on the plate. it reminded us that we probably should've asked ourselves - why are you ordering calamari at a college town mexican joint?  the waffle fries were satisfyingly crispy outside and soft inside with tasty dipping sauces, the saving grace of our meal. past experiences with Mad Mex's other burritos, taquitos, and nachos have been mostly average as well.  At 50% off, it's a decent place if you're willing to wait and brave the crowds, but at regular price, it's just ok",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vIinp67oC1HIGXFz559FXw",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. gobblerito",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vIinp67oC1HIGXFz559FXw/o.jpg"
      },
      {
        "img_id": "4DgRaaNJsBAQA_cqYvGVYg",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. waffle fries - pretty solid with good dipping sauces",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4DgRaaNJsBAQA_cqYvGVYg/o.jpg"
      },
      {
        "img_id": "Gg1jCdBIB6nqCph5pRXinw",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. calamari - good sauce, disappointing calamari",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Gg1jCdBIB6nqCph5pRXinw/o.jpg"
      }
    ],
    "user_id": "lRMJ0oztyFvoXQVWqjodYw"
  },
  "MtTkaghV8WzHG5TnS4sZCA": {
    "date": "4/9/2019",
    "text": "When I get sick of eating burgers and standard American bar food, I am glad there is a Mad Mex in Oakland. It definitely provides a nice variety for late-night food spots. The tofu and vegetarian options are a bit lacking, but the food is pretty good overall. The nachos have been my favorite item, followed by the standard burrito. The $5 special available late at night is definitely the way to go. The deals are great and you can get a huge plate of food for $5. The $7 Big Azz margaritas also make Mad Mex a worthwhile place to visit. The staff is always friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "uEpfN2yQ2DMI8k6DW73GWg"
  },
  "fO7cqO69Db7SmUp9sQ-QgA": {
    "date": "10/22/2018",
    "text": "Returned for happy hour & dinner today to the Mad Mex which started it all 25 years ago. If you're a fan of the creative, delicious twist Mad Mex has given to Mexican cuisine over the years, you can't go wrong with a visit to any of the restaurants in my opinion. You have to try one of the special drink and/or food items which they have created for their Plataversary celebration this month. We had the special margarita, draft beer, and the enormous burrito which are on their special menu. The Gobblerito they offer for at least a few more weeks is a treasure as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gLnMv_zeXElbSh1MxjAFmA",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gLnMv_zeXElbSh1MxjAFmA/o.jpg"
      },
      {
        "img_id": "k5QJfQO9T6Gjst-Ug95U1g",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. The Plataversary Burrito",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/k5QJfQO9T6Gjst-Ug95U1g/o.jpg"
      }
    ],
    "user_id": "tR12WeWha2DGhUrKcvTttQ"
  },
  "LVYquIGyzmWkwZH9Wo2U1A": {
    "date": "5/15/2019",
    "text": "Best fried fish tacos in town! The portion size is so big and satisfying that it makes you want to come here again n again. The ambiance is dope!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zIy4qo1h1TFLk-p_ClAoPw",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Crispy Grilled Fish Tacos",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zIy4qo1h1TFLk-p_ClAoPw/o.jpg"
      }
    ],
    "user_id": "WYMUq5sxwyJZ0nrlRspYDw"
  },
  "nYL08Oxk2uai5nLBImmohg": {
    "date": "9/26/2018",
    "text": "Tried the gobblerito for the first time and woah Mad Mex really did invent something that can give you thanksgiving in one bite!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uMb-f1tdPz7ESEuUXvWifw",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uMb-f1tdPz7ESEuUXvWifw/o.jpg"
      }
    ],
    "user_id": "-Ds0hzlQwZUukmOwnapaFg"
  },
  "yJ2AxqnOwPACSjdTtufOVg": {
    "date": "6/16/2018",
    "text": "The food and the drinks here are great, but the service is lacking and the wait is usually quite long. The host/hostess/waters are not very attentive in seating customers, checking in on them, or bringing checks--and this is from multiple visits here. I return because it is in a convenient location as a Pitt student and visiting alum. If you decide to come, I would recommend getting Pickadippa (mixing 3 different salsas and/or dips. My favorite item is probably the chicken chimi. I did not really like the Korean BBQ quesadilla and think it lacked flavor. I will say that the music here is always great and there is bar seating, as well as some outdoor bar seating as well.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ENZbh_u6v1vT_zTUW3vZGw"
  },
  "1nfQlTnQIjrYXDCe6p3VdA": {
    "date": "1/30/2019",
    "text": "Such a classic here in Oakland. Mad mex is my go to when I'm looking to eat a hearty burrito. I always order the classic mad mex burrito. They also have a lot of other options: quesadillas, nachos, wings etc.   Definitely come in the fall when they offer the gobblerito, its thanksgiving in a burrito! (turkey, mashed potatoes, corn, cranberry sauce, etc.) Their apple cider marg is also a favorite! They have lunch specials, happy hour, and late night specials where you can get a Big Azz Marg for $7!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eO2cNB2chfDMTZWafeOGHA"
  },
  "0jYSHVYwx1n2hqA_PKGc-g": {
    "date": "11/6/2017",
    "text": "If I can wait till 11pm to get Mad Mex's half-off wings, I'd come here.  I don't think the tacos are ever discounted, but definitely their burritos, quesadillas, and wings. When my friends and I come here, Jersey Chips (waffle fries), Nachos Grande, any of their quesadillas, and the Mad Mex Burrito or Wing-O-Rito Burrito are the most popular choices. As for wings, I'd get the Southwestern or San Francisco wings.   ** Korean BBQ is now available for quesadillas, wings, and burritos!! ** I've tried the korean bbq wings and it's not what you'd expect to be real korean bbq flavor - pretty sweet and not as spicy. The sesame seeds are a nice touch. It comes with bean sprouts as well but I don't think it really adds to the flavor because unless you go out of your way to eat them with the wings itself, they're kinda just there for the visual. Curious to see how they incorporated it into the quesadillas and burritos, so maybe I'll try those out next time.  The Big Azz Margaritas are also a pretty popular hit. I really like their mango and watermelon flavors. $7 after 9pm, so go get em!!  Mad Mex is in the heart of South O, so it gets pretty busy and crowded. Wouldn't recommend to come here to talk to someone for deep convos, but just to chill and hang with friends while eating good late night food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "h30tWRK43TXCOYgsItJEpA",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Korean BBQ wings (bottom) and Mad Mex Quesadilla (top)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/h30tWRK43TXCOYgsItJEpA/o.jpg"
      }
    ],
    "user_id": "bryAPtwnnMYjbzoOWHzbWg"
  },
  "tuZQJLEa65x1iJV3aMIZdQ": {
    "date": "8/1/2019",
    "text": "They need a new manager and some of the employees really should not be working. I stopped ordering from here a few months ago but my girlfriend ordered through Grubhub recently and it took over an hour and twenty minutes for them to give the food to the driver which wasn't even a big order, they never mark the order as confirmed or ready either and when we called they just lie and say it's ready and they're just \"waiting for the driver\" however the driver was at the store for more than 30 minutes and he called and spoke to her twice explaining the situation very politely unlike the unfriendly staff from the phone. Everyone deserves better, do not recommend!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5YDpq8-8ixEkXyPe2lUqXQ"
  },
  "Xye1PyXT1Hb4pvsVlsHRCw": {
    "date": "10/20/2017",
    "text": "I went here two years ago and didn't have the best experience but tonight was GREAT!  Mad Mex accommodates vegans SO MUCH! I ordered the Happy Hippie quesadilla that comes with mushrooms, spinach and pico de gallo inside. I asked for daiya vegan cheese and they even gave me tofutti sour cream (non-dairy). The quesadilla was delicious! It was stuffed to the brim and I even got a side of guacamole. I loved it.   It was happy hour while I was there so I got a Cidergeist Rose Cider! It was half off! It was super delicious. I literally want to come back here tomorrow!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GD_ymLEykaI7k8MjNRE8_w",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Cidergeist Rosé Cider",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GD_ymLEykaI7k8MjNRE8_w/o.jpg"
      },
      {
        "img_id": "8t9TFY2YWQtU8E_OebWmZg",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Drafts, had the Cidergeist Rosé cider!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8t9TFY2YWQtU8E_OebWmZg/o.jpg"
      },
      {
        "img_id": "kAS8pioPxTBRQ8bJrqaWtw",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. Happy Hippie Quesadilla with daiya vegan cheese and tofutti sour cream",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kAS8pioPxTBRQ8bJrqaWtw/o.jpg"
      }
    ],
    "user_id": "Ib3uXHSWeBed2kK-BKLGSw"
  },
  "rSCGEM0tAG_VKdtdsbYTJQ": {
    "date": "7/14/2017",
    "text": "It's 11pm, you're a hungry, not wealthy college student that's not feeling pizza or burgers. This is the move.  Mad Mex has a discounted menu after 11, unfortunately doesn't include their delicious tacos. From what I remember, their burritos and wings are half off.  Service is always hit or miss here. Kitchen closes at 1am so be mindful of that.  I think I came here right before the 1am mark so we had to order fast.   Their \"BIG AZZ\" margaritas are pretty basic and yummy with several flavors like raspberry or mango (they're $7 after 9pm!!). Wings are always a good choice. I really like their SOUTHWESTERN or SAN FRANCISCO WINGS. I feel like the Shadyside location tastes better but maybe that's just a mind thing because the vibe feels more upscale there compared to the smaller Oakland location.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "E1FJIPr-VRPotG8v6c2kaA"
  },
  "epCUgRDky9qBzdt83w6uXg": {
    "date": "8/8/2018",
    "text": "The food and the service here was terrible, I wish I had read the Yelp reviews before deciding to eat there. My boyfriend and I went there last night for dinner and I had ordered the shrimp taquitos (which were good) and a chicken burrito.  When our food came, the burrito was terrible. Bland rice, bland beans, dry chicken breast. I told the waitress that I didn't want my current burrito and to have her suggest something that tasted good (like the shrimp taquitos), she said there wasn't anything else like that for the burritos and suggested I get a shrimp and mushroom burrito. I said okay to that suggestion and about 10 minutes later the new burrito arrives and it's just as worse as the first one. Still dry, still bland.  When the waitress asked me if I liked it, I said not really and she was just like, \"Oh I'm sorry you don't like it,\" and walked away. Then after that, she never came by to check on us or to refill our drinks. I had to ask another server to find her so that we could get the bill and leave.  Anyways, long story short, this place is a waste of time, money and calories. Avoid at all cost.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q9-40-0KBC0FShsWBUDXoA"
  },
  "Co_Hya2Ghm25ymH27weKHg": {
    "date": "9/24/2018",
    "text": "I was super excited to visit Mad Mex during my recent trip to Pittsburgh. They have redone the Oakland one since I moved away. I have to say I was a little disappointed; the food was a little more bland then I remember and our server definitely seemed over working that night. Also I got the mango margarita on the rocks which I definitely should've gotten it frozen. I forgot how their big ass margaritas are always the best frozen! That being said I still will always visit Mad Mex whenever they have gobbleritos; however, it just wasn't the season yet.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f5zQuo6H1JixeTIOPis7sQ"
  },
  "5Oq8mNSLr7Mio0_ySjpwsg": {
    "date": "9/23/2010",
    "text": "If you're looking for Mexican food this is not the place for you. As a Mexican who grew up in San Diego I was not able to decipher the menu as Mexican. Seems this is a completely different type of cuisine.   First off, it's WAY too overpriced to be called Mexican food.  Second, Mexican food is simple. There are way too many ingredients and not even the right ones in the food.  Third, they do you have great vegan and vegetarian options. My girlfriend was not a fan of her quesadilla but did enjoy her teriyaki tofu appetizer (because you know ... nothing says Mexican like teriyaki!!)  Lastly, it's way too busy and loud. Hard to hear other people at your table since the table next to you is practically sitting in your lap.   Not worth the hassle of parking.   In sum, avoid this place at all costs.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "wzyAH2F7kvh7Mnd_cSfv8A"
  },
  "jG9hOPIyBuOaElZf59N3Eg": {
    "date": "11/14/2010",
    "text": "It is ten after seven on a Sunday night and all I can think about is that big fat Gobblerito sitting there waiting for me at Mad Mex.   When I tried it I ordered it out of morbid curiosity. Thanksgiving dinner in a burrito?! Really?! WHY AREN'T YOU IN MY FACE?! I didn't have very high expectations for it. I figured lunch meat variety turkey, instant mashed potatoes, and some cheap stuffing and canned veggies. I couldn't have been more wrong.   This food is the tops. I'm completely serious. The food was fresh and home cooked. It comes with a side of cranberry sauce and once you eat it (that is if you can finish it, THIS THING IS HUGE) it continues to haunt you.   I can not wait to go back for another one before it disappears until next year.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "yfK0Od09W_D5jzXBzRgnlA"
  },
  "Cp9k7_pDD8B1hhexGbIqOw": {
    "date": "8/5/2011",
    "text": "This place has been reviewed to death, so I'll just make a few points.   1) Decent quirky vegetarian food - vegetarian-friendly. I've never had anything bad nor anything blow-your-socks-off good. 2) They are not \"authentic\" anything, and they have no desire to be. They have a Thai Curry Burrito and the Gobblerito on the menu. Enough said.  3) It is too dark. But your eyes will adjust.  4) Good draft list and happy hour.  5) You can get drunk on margaritas without realizing it. Be careful.    Don't go out of your way here for a romantic dinner. But if you want some good eats and drinks and atmosphere and you happen to be in Oakland, by all means stop on by and enjoy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S1cjSFKcS5NVc3o1MkfpwA"
  },
  "4deH_SJic5mhCsjQ7jHbvA": {
    "date": "10/11/2010",
    "text": "I had a delicious apple cider margarita. My friends told me that their margaritas have 5 shots in them, which I didn't believe because it tasted like applesauce... until I was stumbling around about half an hour later.  We shared some nachos, which were good (but that may just have been the drunk munchies) but the portion was too small to be worth $6. They were stingy with the chips, and it was depressing to have so much cheese sauce left and no (socially acceptable) way to eat it.   The service could have been better. The inside of the restaurant is pretty small and the waitresses were really strict about who could sit down. You could only sit at a table if you personally were eating food. You couldn't even sit with your friend who ordered something unless you were eating it too. Our waitress seemed like she wanted to get us out of there (or at least away from the table) as quickly as possible. I understand that the place is small and tables are precious, but they could have been more gracious about it. That night, there wasn't a line to come inside and most people there weren't eating anyway, so we were standing around blocking the aisles with empty tables everywhere.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "S4xA7um43nZOkJGKzkP_9Q"
  },
  "KKqCVNv3m-_xcseTwSqtsg": {
    "date": "10/10/2013",
    "text": "It was loud in here. I like Mad Mex. This one is a college hang out. The food was good, and so was the service. I'd be back if I was in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5maKYe53uqZXZRqoJEFuJA"
  },
  "qJ_Iq4vldPpGHHVq19McSQ": {
    "date": "5/26/2014",
    "text": "Always has great beer. Wings are my favorite thing to order by far.  Oakland and shadyside locations are my favorite. Shadyside has a big square bar and open garage door windows when it's nice. Oakland is dark and small in a good way. It's best to go here in the afternoon or early evening because it can get crazy and packed with people.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3W-fg0tNga3GHTqU5MAdnw"
  },
  "w7I_kfcZpNbXis9tCFi7Ag": {
    "date": "8/3/2011",
    "text": "I'm pretty sure this is the original Mad Mex, so it's almost like I'm not writing a review for a chain!  Upsides: Blue cornbread that will make your heart melt.  Half price after 11.  Generally awesome food.  Wacky fun wall art.    Downsides: Loud.  Crowded.  Seating uncomfortably close to other tables.  Not enough menu options with queso.  And definitely skip their cheese dip for their nachos... it's pretty lame.  I always have a really tough time deciding what I want at Mad Mex, too.  The menu is cute (though bordering on obnoxious,) but I don't know if it's really laid out that well.  It might be a problem on my end, though... maybe I just suck at reading menus.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_bjA-bwTUEmsw85X_nJT7w"
  },
  "0piApcEwiNERyveWEgvoDg": {
    "date": "8/17/2010",
    "text": "Sunday nights after 9 are half price food and margaritas. Saturdays between 6-8 are also half price food and margaritas.  The margaritas are loaded with booze but taste so good. Lets just say, if you're a lightweight, you'll be tapping after 1. You can either get the regular margarita or one of the flavored one. Or, you can mix two flavors together which is also really good. After 2 of the big ones, you get a very healthy buzz going on. 3 ... well, you'll have a more than healthy buzz and a ridiculous sugar rush. 4.... haven't seen it yet. The sugar usually gets to you first.  As for the food, this is great Mexican food. I usually get a burrito and piggy size it so they put double the meat in. I really don't need to get double meat because the serving sizes are enormous but after doing it the first time, I can't possibly go back. Mad Mex is one of the reasons why a lot of people get the freshman 15 and the sophomore 30. The food and drinks are soo good that you can't just say no.   There usually is quite a bit of a wait if you go for half price food but it's still worth the wait. You can hang out at the bar and grab some free nachos and salso to go with a margarita while you wait for your food.  Definitely worth hitting up.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "MbBhClrXyu8-Mk5wW5y8tg"
  },
  "ghjrL52UgeSVzJgcq6yUiQ": {
    "date": "6/15/2010",
    "text": "My girlfriend is not a big fan.  Yet her mistake is thinking of this as a Mexican restaurant.  I would instead call it, 'mexican themed.'  If you go in and say, this isn't going to be a typical Mexican restaurant but instead mixes mexican dishes with different ingredients, it's really good.  Got the garbanzo bean stew and the taquitos.  Yum.  Price is right, too.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "viMEMVXQExcexc7ctpRdCA"
  },
  "VJyHYBSBSoypL1ODXvz_jg": {
    "date": "5/11/2011",
    "text": "I'm a middle of the road fan of Mad Mex (see my review of the Robinson location if you'd like for more details), but wanted to provide a review based on the location and ambiance of this branch of the restaurant.  Short answer, it may be the worst Mad Mex location and here's why:  The restaurant is consistently too cold, winter or summer  Dim lighting through the restaurant (not in the good ambiance sort of way) or blindingly bright where the only window is located  Super awkward seating (first you get to brush your butt past your table-neighbor's face when you sit down, then it is your turn to show you theirs when they leave!) that is too close together  Difficult to get a parking spot in the neighborhood  I hate to sound picky, but it is True that when you can't feel comfortable in an environment it is likely that you won't enjoy yourself, and that is exactly what happens to me every time I have no choice but to eat at this location. Try one of the many other locations for a better experience if you can!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mdaKaPOKte_-7v3REM7Siw"
  },
  "K5W2YVuf9ZoPC4tmpEHWTg": {
    "date": "6/24/2010",
    "text": "Fond memories of Mad Mex!  This was my favorite bar/restaurant during my college years.  I still come back to Pittsburgh 1-2 times a year and I don't miss an opportunity to visit this fine establishment.  IMO, their spicy steak  burrito is the best in the world.  Combine this with the spicy black bean dip and several margaritas and you have recipe for a great evening.  Mad Mex runs happy hours specials on the drinks as well as discounted food late evenings.  The place can get pretty crowded for the specials, but it is well worth the time and effort.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "pQDPQPgbhRzJs3HXz667Yg"
  },
  "iaagHPIQy9nczNvxDwT1zA": {
    "date": "6/14/2010",
    "text": "See Eric L.'s review for best times to go. Situated right next to CMU and Pitt campuses, Mad Mex mainly caters to college students with HUGE and quite strong margaritas and extremely dark ambiance. The waiters even have small flashlights if you can't see the menu!  So far I've tried a burrito and an enchilada here. The burrito was folded square and is a fork-and-knife kinda burrito. It wasn't exceptionally tasty. The enchilada was better and spicy but again, not mouth-watering. The margaritas and chips and salsa combo are the winners so far.  I do love the art in here. I don't know if it's a chain thing and it's simply outsourced but I like to believe it's painted by local mural artists.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "VFxrLIlgApHIdOCrkAYIGA"
  },
  "ps_Ld8Wve-QEns8rFrgjnA": {
    "date": "5/10/2011",
    "text": "Came here immediately after our flight landed. Was here with a few friends on a recruiting trip and they had gone to school at CMU previously.   We attempted to eat and drink our way to our per diem -- to no avail!!  The 1/2 price menu had our bill for 4 people at 50$. Including massive margaritas, appetizers, and enough food to take home (which of course we didn't, who wants left-over mad mex?!?!).  The scene was pretty horrible tho. very very crowded, and a ton of drunk college kids. Yah, I know, I'm in a college town. Just reminds me of why I moved away from mine, :).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I6WeX_XlwdGwLIsi-06mig"
  },
  "O6oYvhm5lPn1iqNFFz6mrg": {
    "date": "4/2/2011",
    "text": "Happy hour is great!  However, generally a little bit crowded.  Rumors are that there's another opening in Shadyside, so this should help alleviate the crowdedness at the Oakland location.    Wings are great = 1/2 price at happy hour.  My favorites are the San Francisco; saucy, but not too saucy.  Delicious with blue cheese.  And of course, a big azz margarita!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BTKtAXjPHjH5B3xuT4uiIw"
  },
  "jmqDU8oN3P8DZAYlO2J1yQ": {
    "date": "11/29/2012",
    "text": "This place is pretty good but they do ridiculous stuff like serve you a square burrito that you can't pick and have to eat with a fork. Also, instead of hot sauce, the squirt weird cream sauces stuff on their food for reason. Not mexican but close.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VmlTWbWhZDAyc9GXJ45xpw"
  },
  "cdxbiG9yU8Jb2n7b343iSQ": {
    "date": "9/27/2015",
    "text": "In my opinion, this place is OK, not great but OK, but well worth coming when it's half price after 11. Don't get steak anything because the \"steak\" is as tough as shoe leather, but you should be alright with chicken.  I like Kristy's sister's red velvet enchilada...which isn't red, isn't velvet and I have absolutely no idea what it has to do with someone named Kristy and her sister.  Pretty good most times, sometimes it comes out with the chicken chunks as cold as ice but they'll quickly heat it up for you.  Which indicates that the chicken is kept cold and then \"warmed\" when they smother it with sauce.  Assuming you can get it warm, it's pretty good (not great but OK) as are most of the chicken menu offerings. This is not really a Mexican restaurant for those who have lived in LA or Mexico and know what real Mexican food is but the Mad Mex concoctions are, if I may repeat, OK. Parking is tough around here.  Expect to have to walk from a few blocks away. I'm not a drinker but it seems that everybody around me gets the Big Azz margaritas and loves them.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sx8Zq1IiaN1Frdd1exukgg"
  },
  "C2ToRYsdUsJjsqwYLXx3pA": {
    "date": "3/9/2011",
    "text": "The Mad Mex restaurants are one of the more consistently popular chains within Pittsburgh.   For dinner, this one always seems to be packed, no matter the day of the week. It's a small, pretty crowded space. And they pack 'em in! You can't squeeze through without bumping other patrons. Service is hit or miss, regardless of whether it's crowded. I've had fast and really slooww wait times for food.  The ambiance is pretty fun though. The beer selection is decent and the margaritas are fantastic. I don't think I've ever been truly disappointed or blown away by the food itself.  There's lots of different offerings but the flavors in each entree sort of melt together and don't stick out too much. Nothing to get too excited about. I've continued to come back here over the years though because it's a fun place, if you don't mind the crowds.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jZ1ziwykb5EEla5y4D5Ozg"
  },
  "af4bfzptJx2YcHs-rWwm-Q": {
    "date": "7/21/2010",
    "text": "This was the one of the better restaurants I visited in two weeks at Pitt, and the fact that it's getting three stars says a lot about the quality of food in the area.  Still, I can't deny that it was decent.  So, the good.  It was okay.  They actually had salads that didn't taste like they had sat in a refrigerator for several days.  Their beer selection was decent, not just the usual Dos Equis/Corona.    And the bad.  Their tortillas were crap, clearly purchased at the local mega-mart or at least tasting like it.  They really took away from my tacos.  Their taco salad was very underwhelming.  It was nice to have fresh greens, but the meat was greasy and over-seasoned.  Their guacamole is also over-seasoned, though not terrible.  The service is on the slow side, it was very crowded both times I was there, and the music is much too loud for a crowded restaurant without a dance floor.    The second time I was there, our food took at least 40 minutes.  We didn't complain because it had been slow the first time we were there, and we were enjoying ourselves.  Without any complaints from us, our server explained that our ticket had gotten lost, apologized profusely, and took our drinks and appetizer off the bill.  So, high marks for service even if it was generally slow.  Overall, the food was average, the service was okay, the atmosphere had its problems, but it was above average for the area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "slOJAXOw7OZ8LQ2e1tl-SQ"
  },
  "KUDP1DTvpYHaY64fuca32Q": {
    "date": "7/21/2010",
    "text": "This place is over priced and constantly crowded with rowdy college kids trying to get OMG SO DRUNK!!! during happy  hour.  The drink specials are okay, but I personally don't think they are that good.  The \"big azz\" margaritas aren't spectacular or really even that big - an average margarita is probably about 12-16oz, depending on the place.  I don't want to pay $10 for shitty tequila?   The food is average and over priced.  Their burritos are so doughy and lack the taste you can get from even Chipotle.   From all of the big  burrito restaurants, this one needs the most work.  The decor is clever but tacky.  The servers at EVERY Mad Mex I've ever been to are rude and are just trying to get some tips out of you (which is fair, I wait tables and do the same but you can still be nice to your tables if they juts want drinks?).  The drinks are meh and the food is blah.   Comparing this place to Kaya puts it all in perspective - but Big Burrito probably won't change anything since it brings int he college kids spending their parents money.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yahPcmffLfJawrtjTqKzdQ"
  },
  "nRGz_FHGP0GCiVDImTcBaw": {
    "date": "3/8/2012",
    "text": "I love mad mex!  Despite hanging out in Oakland since middle school, I only recently made it out to eat at the mad mex in oakland.  This is the original flag ship restaurant for the entire big burrito franchise, and their food did not disappoint.  Their innovative twist on mexican was creative and delicious.  I've heard it can get crowded and loud in the evening but when I went for lunch on a sunday it was quiet and the service was fast.  Also if you're vegetarian there's a ton of great options catering to you.  I can't wait to go back!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "MDeA-Gx8NScCyAdziq7IeA"
  },
  "idXJHZoYQhexniY8Ta3b-A": {
    "date": "2/7/2014",
    "text": "This is probably the best Tex Mex place in the city. I have to say that I came for the happy hour and was pleasantly surprised by the quality and versatility of the menu. I've eaten here a number of times (and had drinks here even more times), and I always enjoy the chips and salsa and any vegetarian food that I have had. The taco salad is freakin excellent. And of course, the margaritas are arguably the best in the city (on the same tier as the Cantina in L'ville). Go in and try a Big-Azz Margarita ASAP!  I definitely enjoyed the place in Oakland more than the one in Shadyside (I wrote another review for the Shadyside branch)- the place is less crowded, more intimate, and the wait staff is cooler- however, it takes a while to get your food so plan to have a couple of drinks with good company as you wait.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2oTG2GrBpikkonRxQywI7Q"
  },
  "MeuTjqFWTK5fKkQ_zIsO_Q": {
    "date": "12/3/2015",
    "text": "Tasty Tex Mex in Oakland.  Really fresh chips and salsa and solid entrees with a nice beer list.  Get there before the college crowd overwhelms late night.  Music is a bit louder than it should be.  Overall a good spot for your Texmex fix though.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H_ANqdW34opIDdRtC9n98w"
  },
  "ikIedMujDHlJdBI2kjxsaw": {
    "date": "5/16/2016",
    "text": "For the size of their burrito and the price, I was really happy! As a student in Oakland, I never went to Mad Mex but after I tried it for the first time I couldn't believe I didn't try it until my Junior Year. The restaurant is kind of tiny and the staff was alright, but the food was great. I love the Garbanzo Soup as well. I had to ask for a to-go box because it was so filling!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fTVZ2NilluHLJQWFHdLSFA"
  },
  "HJ1zPK2Acy_oovqg_e1V8g": {
    "date": "3/24/2016",
    "text": "I came here about 5 days a week while in college. Service was always great and so is the food. Margaritas are amazing too. Half off every day after 11.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yBUb9jgPvNIFvjPEQOkbGQ"
  },
  "tsE30zJ2bFOzvyRQtIfFow": {
    "date": "3/23/2016",
    "text": "I would give this place a 5/5 just for their unique interior decor . The place really does feel like your having a mad mex experience . The crowd is great too.  We ordered the pickaddipa with guac black bean dip and salsa. Nothing too unique about these but they were averagely delicious . My favorite was the southwestern wings and their margaritas . Great deals ! Definitely going to revisit them for their jerk wings and burritos .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2vJM_T_CeioLRpdYdxu8qQ"
  },
  "Y7lhTpAKdb0Ffore5c8UWQ": {
    "date": "7/18/2014",
    "text": "*A great place to hang w/ friends for late night delicious food and drinks ($7 margaritas) for low prices, good servings. Food is 1/2 off from 11:00PM-1:00AM.   I recommend the Hand Mex Tofu Wrapture ($5) and Pennsyltucky Fried Tofu appetizer ($4) for vegetarians. The Fried Tofu appetizer comes in decent servings and the tofu wrapture..I've never had anything like this before. The wrap tastes great - a really creative spin of a vegetarian Chipotle-burrito. It's completely filling, with mexican rice and tofu with pico de gallo. But what really ties the whole thing together is their wing sauce. I chose Honey Chipotle BBQ and the wrap went from crisp to complex - a mix of fresh ingredients with that subdued but detectable taste of sweet and spicy.  (Street parking, may be a bit annoying to find a space nearby. Luckily we found a spot two blocks away.)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wgsDR7bU1DKepPS6HFiXbw"
  },
  "6YwA3yYcuhxWljYulEu33Q": {
    "date": "1/12/2016",
    "text": "Came here after work, after a recommendation from someone. Not a bad place. It's a little small and loud, but good food and good drinks. Prices are reasonable, and they have some good deals for happy hour. Next time I'll be sure to come for happy hour!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "km_RBZsCuU-QUmLrjn7RnA"
  },
  "KY3YczDo9RTsb9RiGZvgbg": {
    "date": "10/16/2011",
    "text": "A friend recommended this place for its authentic tacos and amazing chicken wings.  Although the food was good - I really wouldn't call this authentic Mexican food and the hot wings I heard were pretty standard.  That being said, if I did have the expectations that I did going in, I probably would have thought this place was alright.  They have a nice bar, the tortilla soup was really good, and the guacamole was fresh.  I also like that they have a sense of humor, the bathrooms were unmarked except for a screw on one door and a nut on the other.  (let me know if you need help figuring this one out.)  umm yeah, that's about it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hcZqq-a16ZTjaM2p2MljTg"
  },
  "9WtSd3y3sdfgREQ6E6C2mg": {
    "date": "2/14/2016",
    "text": "Do not under any circumstances place a carry out order. I rarely write reviews but I am still sitting in my car after being told on the phone that our order would take 1 hour. We arrived right at 1 hour but 30 minutes later, still waiting on my husband who went in to pick up the food. So going on 90 minutes. I don't think they started our order until he arrived.   I understand feeding the people in the restaurant first but if this is the case, they need to be honest on the phone and not accept carry out if they are too busy.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YBi5K7pKaxozvLFGA854pQ"
  },
  "ZJQ-JyjjVDYqCp8b160ArQ": {
    "date": "4/17/2015",
    "text": "Mad Mex and I used to be very well acquainted, possibly too acquainted considering I spent two years living in an apartment above this specific Mad Mex location (both a blessing and a curse but I digress....) I have actually only eaten at this location a few times, but I have drank many more times here, and ordered a plethora of take out to the point where I think I have sampled 95% of the menu. After sampling the majority of the menu, I really can't complain. While it's hardly authentic Mexican food, the menu options are unique and typically flavorful. Portions are large enough to leave you satisfyingly full. My absolute favorite item to order is the Kristy's big sister's red velvet quesadilla (Marinated chicken, grilled zucchini, spicy spinach, pico de gallo and Jack cheese). It's (relatively) healthy And always allows for leftovers the next day. The Carnitas quesadilla (Pork braised in beer, garlic and ancho chili rolled up in a wheat tortilla with roasted green chilis and served with slaw, pico de gallo and Jack cheese) is another stellar option and packs a bit more of a punch when it comes to the spiciness of the dish. As weird as it may sound, the coleslaw actually tastes really good when put inside the quesadilla (don't judge lol). The thai curry burrito (grilled steak, chicken, shrimp, tofu or portobello, with toasted peanuts, pineapple and Thai curry sauce. Topped with bean sprouts. Sweet-n-sour slaw) is another interesting choice I'd recommend and it packs a punch flavor wise as well. The margaritas are amazing, as fellow Yelpers have already detailed. While it may not be the most authentic or best-tasting Mexican in Pittsburgh, it's still an A-OK option in my book!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gFsqraWQfG46ohVFRg_d3A"
  },
  "uwdGJcImge2BaZ95M-_5HQ": {
    "date": "5/30/2013",
    "text": "Mad Mex was my first foray into the Big Burrito group, but actually at the Penn State location.  Once I moved back to the burgh, I was happy to see that one of my favorites from school was available in most of the major suburbs.  One thing I was not happy to learn was that the infamous $5 all you can eat burrito and $5 big azz margarita Monday night special didn't make the same journey back west.  Nevertheless, anytime I can get a consistently decent carnitas burrito with jalepeno cornbread and slaw, I'll take it.  I've been to 4-5 different locations in the burgh and this is definitely the smallest.  Be willing to wait for a table and don't expect to roll-in and easily grab a seat at the bar with both CMU and Pitt anchoring it down.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7aaA3Z0i7_XmjQWkamPlmQ"
  },
  "PceFTjtChiArp_AUJ1saOA": {
    "date": "3/17/2013",
    "text": "Went here for the happy hour, and let me tell you, my 1630-1830 happy hour indeed was a happy one. I went with a couple of co workers on a Tuesday and we all got the \"Big azz margarita\" I chose the 22oz mango margarita on the rocks and it was delicious, a good punch of alcohol and still the mango flavor, which was only 7.00 by the way. I also got the half off wings special as well, got the classic mild buffalo wings, and those too, were a good choice.  The place is a little small but is in a pretty good location right off bates and Atwood. seating is limited but it didn't matter, because the atmosphere Andre servers were very welcoming. I think we found our new happy hour slash pre game spot!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "pPZemHDxjP12seD0DtTkJQ"
  },
  "Bb_RN1GyFppYDv8gMzORtg": {
    "date": "1/30/2017",
    "text": "If you're only getting drinks I'd give mad mex five stars. There's a bartender in particular who's super laid back and cool, which is always nice, coming from a bartender. But their food is very mediocre, if you want a burrito you're better off saving your money and just making one at home and coming here to get your margarita. I got a spicy chicken burrito that wasn't seasoned at all and had no spices...so the food is disappointing but the margaritas are soooo good",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5bL7VOO1ZCrEx4rwZcHClA"
  },
  "epkDmELgggScjhIeSEeDDg": {
    "date": "8/27/2013",
    "text": "Went here for happy hour...only got drinks which were pretty good. It was super crowded so I guess people love it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rErZCGq4SS95wfutUDNUdg"
  },
  "Z-osRU6T2mVcyzslQr21yQ": {
    "date": "3/2/2016",
    "text": "I can't say enough about this Mad Mex location! Great margaritas and they're half price after 10 (only $7). They also have half price food from 11-1 which is awesome to satisfy your late night cravings. My favorite item on the menu is the carnitas burrito, however, my friends and I always order the nachos grande as well. Rochelle, the bartender, is amazing and my friends and I find ourselves venturing in late at night just to see her and have one of her amazing margs. Would highly recommend :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZRdeSie_ZV2Jc8hGJks8cg"
  },
  "gnGdtR52AQhxO2R7O9I9zQ": {
    "date": "7/13/2011",
    "text": "Mad Mex gets super crowded all the time for a reason.  Their \"Big Azz\" margaritas are nothing particularly special, but will knock you on your ass. Factor in their two-a-day happy hours featuring $7 margaritas and you're in for some economical, pleasant drinking.  Food is half-off after 11, so if you're getting drunk munchies after imbibing on one (or three) margaritas at night you're in luck. It's pretty good too, they offer some creative dishes that, while blatantly inauthentic, satisfy. Portions are so big that even with drunk munchies I can only finish 3/4 of my meal.  The service is super patient and quick as well. Even when the place is packed with a bunch of drunk people servers never get snappy. Every time I've been hammered there a waiter has always politely asked me to move, and has put up with my significantly delayed reaction time.  The major con of Mad Mex is how loud and tiny it is. If you're there to drink at the bar there's very little standing room. If you're there to eat at a table expect to be bumping elbows with the person next to you. Even when it's not too crowded the restaurant is inexplicably loud, so don't bring a date here (unless you don't really want to hear what she's talking about, in which case do so as I have in the past).  In summary: go here during off hours for good food to avoid the crowds or during happy hours when you'll be too drunk to care about the crowds. Also, for anyone trying to get in using a fake, they're one of the stricter bars in Oakland so be careful.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yft76ogF5YzCQ4mn6vSQ6Q"
  },
  "KXOYu2rqf50mfhwt5ftwlg": {
    "date": "7/7/2013",
    "text": "Pretty average Tex-Mex food. I usually go for the half off wings which are decent. However the grungy, dark, and cramped interior is most off-putting. Even when I eat at lunch I can barely see my plate.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J5jsI9DKQJ2EIm-ZYmOgyw"
  },
  "LHTsx8o85wEGnYIHbLYvoQ": {
    "date": "2/2/2017",
    "text": "I love that every time our family comes here we are treated like family that hasn't been seen in 20 years. They are always so friendly and treat my children like their kids. I love how much food you get for how much you pay. Way to go!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1WyUSJKCAaXVVZk163RaVw"
  },
  "HuFfLv_BJ_oiC6myFQ1fUg": {
    "date": "4/4/2013",
    "text": "If you want to eat at a restaurant that proudly advertises its attempt to shoehorn an entire Thanksgiving dinner into a burrito (truly a unique contribution to the obesity epidemic) then this might be the spot for you.  Otherwise it's pretty medicore tex-mex.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OxE0QBa6m1399S8BXigIsg"
  },
  "9V9w_pa_6TUtz-AiSz-8gA": {
    "date": "10/1/2015",
    "text": "Good price for wings and drafts during happy hour. As a regular customer, today was fair, though the bartender was so overwhelmed that I kept waving at here for 10mins... that's not decent.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WtPx2adTR89_Qe31CvIILA"
  },
  "E-KN9cYq34urx6FMa4hAPA": {
    "date": "9/21/2016",
    "text": "I've been coming to this Mad Mex location for close to 15 years, and despite the high quality of the food, I'm only awarding them two stars for their consistently disappointing service.   In the past, I've been given trouble for not having my entire party present upon seating time (which I'll give to them since other restaurants do it too, I just find it annoying). I've also been told to wait at the bar for a table open up, only to be told that I had to close out my tab at the bar before they would let me occupy a table.   Most recently, I arrived during happy hour and was told that they were clearing a table for my party, with an estimated wait time of five minutes. About 25 minutes later we were finally seated. We immediately put our order in, and let our server know that we only had an hour as we were trying to make a movie in the south side. To this she said \"I'll try my best, but you did come during happy hour and we're busy...\"  I keep foolishly coming back because the location is convenient for me, but I would suggest eating elsewhere in Oakland. Or, if you insist on eating at Mad Mex, try one of their other 50 locations.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1PsmGwa6A3ZvyZ583_uGwQ"
  },
  "sYkftF0Hbm3E4FgR8v_Rsw": {
    "date": "1/2/2017",
    "text": "Please order the Strawberry and Mango marg... and the black bean dip... and the quesadillas. Mad mex is the place to go to get you drunk and the place to go the next afternoon after you pull yourself out of your bed. Word",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pqwkuq2MEjcWd2sZMKrIKA"
  },
  "BylzhecotwEa3g-2GulMLQ": {
    "date": "10/8/2014",
    "text": "Maybe I was just really hungry, but the grilled chicken torta and casa salad that I got was spot on! It was tasty and fresh. I really enjoyed a mix of the cilantro lime dressing that came with the salad and the chipotle aioli sauce that came with the torta. My friend got a burrito and cleaned his plate. Plus, we ordered past 10pm, so we ended up getting half off our food order!  I also got a margarita on the rocks, which was pretty good. A solid margarita. I liked that they had a variety of drink choices. (Lots of choices for people, like me, who aren't beer fans.) Thinking of trying their sangria margarita next time...  The service was standard. The ambiance was ok. I couldn't hear the people across from me that well because of the noise/music level, but we just had to talk a little louder than usual. I'm basically giving this place five stars because the food was excellent (and everything on the menu looked pretty good); plus, the drinks were good (with lots of drink options). Oh, and it's open for food till later in the night! (There don't seem to be that many other places to go to past 10pm.) I would definitely go back, especially if it's a late night dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vHHjaq9pSuwq8uCrQ85qlw"
  },
  "gJ12Z8ZKE7dPJU74wB1L4A": {
    "date": "8/25/2014",
    "text": "The burritos. So good! Had one at about 2pm on a Saturday and didn't need to eat again all day! The frozen margarita/sangrias are also awesome and delicious. The decor is super cool -- they are totally working the whole \"day of the dead\" theme, and it's great. Service was perfect: friendly, attentive, and informative. Great experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6uzQ715iE_uTcepFqI8zCA"
  },
  "UULdoB7lJbE7nCiC_aKnQA": {
    "date": "12/5/2016",
    "text": "Awful service  Their drink special ends at midnight. Sat down at 11:55, the server didn't come to our table until 12:20. He refused to give us the special because he was \"too busy\" to come to us when we sat down. Will not be coming here again. Go to the shadyside location- they don't employ careless college students",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N8BicboBRG05qAgalE22mA"
  },
  "5-UwaR1HX-CvaunhOOe5Nw": {
    "date": "8/7/2012",
    "text": "We lived right around the corner from this place... SO DANGEROUS. With a half-off late night menu (11pm-1am) which includes pretty much everything minus the tacos and a couple other more obscure items, when our late night munchies came grumbling, this place usually took precedence.   We are big fans of the Pick-A-Dippa. We usually get the pico (usually very fresh and juicy), guac (consistently delicious and chunky), and the pineapple habanero which seems to vary depending on the season/produce. Sometimes it's straight spicy, sometimes it's a perfect balance of sweet pineapple and a spice that builds on the tongue. The color is usually a good indication of the heat (darker = spicier, yellower = sweeter). We always make sure to order a side of sour cream (which they usually don't charge for) to pair with the pineapple habanero... cuts the heat enough so I can enjoy it.   My boyfriend LOVES the wings. Mild San Francisco with blue cheese. He's also a huge fish taco fan and these were some of his favorite in Pittsburgh. I love the house salad with the lime-cilantro vinaigrette (one of the best dressings in Pittsburgh) and the tofu isn't bad either... tofu tacos = yum. Also developed a liking for their quesadillas... I'd usually order one with just cheese, grilled onions and peppers, and corn. Depending on the cook that day, it could be a let-down or it could be amazing. Can't beat the waffle fries which are perfectly crispy or, heaven forbid I forget to mention... the Big Azz Margaritas. I don't like the fact that you can taste the basic pre-mixed margarita underneath all of the fruit flavors, but you can't beat the alcohol content or the size. Be prepared for a very fuzzy, buzzy, brain-freeze.   Oakland is okay for college standards (food and service varies greatly depending on when you go), but go to the Shady Side location if you want the best Mad Mex has to offer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wh7yz5cZKi-nMhyLhUIM0Q"
  },
  "HKER6OAwTcoaHGavRnMgKQ": {
    "date": "12/25/2015",
    "text": "I've had a negative experience each time I went in skin color I guess they seem to cater to whites",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "LPjGzt62VZrYQVfDbA7uFg"
  },
  "ykR3o7LHae5vbA5sfKDXYw": {
    "date": "11/27/2013",
    "text": "Mad Mex will always have a special place in my heart, and my stomach. And probably my liver too. I remember coming here with friends on my 21st birthday, and we all got big azz margaritas. And then some more margaritas. And then some more. And then it got hazy. Same with my senior year in college, when we would come for happy hour. Hazy as well. Given the size and tastiness of the margaritas and the great beer selection, you can see why there's a bit of haziness.  Anyways, I definitely think that out of all the Big Burrito restaurants, Mad Mex is my favorite. The half-price menu at this location makes the deal even sweeter. My buddies and I would usually go to Fuel & Fuddle for half-price, but if we ever wanted to mix it up, we would make the trek to Mad Mex, for some wings or burritos. My favorite items are the Large San Francisco wings with bleu cheese, nachos grande, and the black bean dip. Seriously, that black bean dip is pretty epic, and I've found that nary another restaurant in the country has a black bean dip that good. Also, if you haven't tried the blue cornbread, you should. Incredibly moist, and did I mention it's blue? Overall, the prices are great too, and if all else fails, you can't go wrong with a simple bottomless chips and salsa order either. They're also pretty good at making vegan and vegetarian versions of most of the dishes on the menu, which helps when you've got an herbivore in your group.  I do wish that it wasn't so crowded on the weekends, and to be fair, Mad Mex doesn't really serve authentic Mexican food, or even Tex-Mex for that matter. As long as you can get over these two facts, Mad Mex is an awesome place to have a big azz margarita, and grab some Tex-Mex-ish American bar food. Also, note that the Shadyside location does NOT have late night food specials like the Oakland location.  Nonetheless, I came back not too long ago, and I was glad to see that not much had changed. I'll still never get used to day drinking at Mad Mex. Since it's so dark inside, once you leave the restaurant, the sunlight will almost blind you, and people will think you're more intoxicated than you actually are, even though it's just the burst of light that's disorienting you. And the booze.   As I'll leave you to your Yelp Review reading, Mad Mex is an awesome bar to booze and grab some good food with friends, with a few small flaws here and there. I suggest you look past those flaws and just love it for what it is.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "eSU_HjKOA3Ppt8oS07oYkw"
  },
  "LVJ3zvG2CF7yx2vDrogonQ": {
    "date": "12/28/2014",
    "text": "Food was good. Drinks were tasty. Guacamole was nice. Wish I did the burrito in a bowl though as they're huge. Nice to visit the original mad mex.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aVjR7JMqaxbbA2GLMIx6vg"
  },
  "VBZ3KBKhHGLAFRRCGCsNQg": {
    "date": "2/20/2016",
    "text": "The food here is pretty nasty. I ordered the fajita burrito with steak. The steak was too tough to even chew, and was over cooked. I didn't have a drink here, maybe that would've made the experience better as I hear they have good drinks. However, I think I would have had to be black out wasted to even eat half of a burrito from here. Will not be returning.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BzUD4u8HD9ro14XPuxZA_g"
  },
  "Ns31i4PDzG_5G3gVJGSE9A": {
    "date": "4/12/2012",
    "text": "Mad Mex, you can do no wrong.  I'm not sure if it's the Big Azz Margaritas or the tofu sour cream that makes me want to cry more.  Asides for the wait, I've never had a bad experience here.  I'm a bit of a picky eater at times, but love this place because they let me mix and match my soft tacos.  Usually end up getting one chicken, one steak, one ground beef with all the fixings, albeit variations of the traditional.  I opt for the soy cheese and tofu sour cream.  Gotta have me a piece of the blue cornbread as well.  Not sure what they do with it, but that ooey-gooey part is what I crave.  I'm sure people look at me and think 'what a pig' because of all the food I have in front of me.  If the shoe fits, I'm a pig.  Nothing wrong with chowing down on some of the best Mexican food I've ever had the chance to explore.  Two suggestions for y'all:  1. Opt for your margaritas on the rocks.  The frozen ones do one hell of a job on you when you get brain freeze.  2.  Pay attention to the indicators for the bathroom.  Don't be a goof like me and go into the wrong bathroom on multiply occasions....I still don't think I can get that one right.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ACwBMSJzgW6vOvV7vOrk8Q"
  },
  "r_Nxim7pC-Y66zaHaeU8-Q": {
    "date": "9/1/2016",
    "text": "Been coming to the original Mex for about a year now. While it can be a crowded college bar after 10pm, it's completely reliable with food and drinks no matter what time of day. Everyone who works there, including Raquel and Maria behind the bar, Kirstie, Will, Mara, and all the other servers are top notch serving staff. Would highly recommend it for anyone visiting Oakland!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mWQ87B3rSsctmiTP72WVrg"
  },
  "jtFRQp1X2_OpK3_xk5fI1A": {
    "date": "8/23/2015",
    "text": "I have been to mad mex many many times over the years, but have never gotten around to writing a yelp review until now.... So this is sort of a summary of all my visits over the years but mainly focused on my most recent visit (which was yesterday) .... Overall, the food is pretty mediocre. Really nothing special about it. It's pretty standard Americanized Mexican food.... Not very authentic. Not terrible. Not great. In fact, the best thing on the menu is definitely the chicken wings, which aren't even remotely Mexican. But that said, they have really good buffalo wings. And the San Francisco sauce is outstanding.  As far as the bar / liquor goes, they have some really good drinks and a really nice beer selection.  As far as the service goes, it's a pretty casual restaurant, so the service is so so.  Overall, this place is pretty mediocre.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0ag8aA4SKb5KSp4zEY_Lnw"
  },
  "tE5oxO4Y3w7UYNs1oR9WuQ": {
    "date": "8/27/2016",
    "text": "I absolutely love the food here and I especially love the late night deals. However, last time I was there the place was completely packed. We were told by the hostess to wait for a table because you cannot sit at the bar unless you're 21. 15 minutes later, he points to two bar seats and tells us to sit there. We go and sit down to eat and the bar tender immediately flips out and tells us to leave, because we are not 21 and tried to sit at the bar. I tried to calmly explain to her that we were told to sit there by one of her coworkers and were simply ordering food but she had no sense. Honestly ridiculous and the bartender is rude. Such a stupid mistake and we got kicked out for it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aZ_ZXSh3H9FWtm0KFC1lrw"
  },
  "50u9n2hxUFt2-HzhZATCmw": {
    "date": "8/10/2016",
    "text": "Awesome lunch!!  Waiter was the best. Patrick was his name!!! My hubby had the lunch burrito and I had chick peA chili. Both were excellent. And the beer selection was outstanding!  Try the chips n salsa. They were crisp and warm.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sr49scN20_8mHKu1Q_Y9Lw"
  },
  "FkAw1WcTdXbvw6VXDIt8EA": {
    "date": "12/2/2015",
    "text": "I'm very late on updating this to 4 stars! I only go during half off. If it's after 11 pm, and I'm hungry, this is the first place that comes to mind (even over fuel and fuddle). My favorite thing to order is the dance marathon sub steak on a wheat tortilla. If you're with a group, I'd recommend sharing an order of barbacoa nachos; it'll feed at least 3 people.  $5 22 oz drafts promos are great. The $7 big azz margs are also fun, but I stick to the 12 oz that'll do the job well enough for $3 too. I'm not a fan of the taste of tequila so I stick with the original lime on the rocks (it masks the taste well).  One thing I wish that I knew earlier is that \"Jersey Chips\" are waffle fries. (They're good.)  BTW: Sign up for their (snail) mailing list for a free burrito in your birthday month and their anniversary!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PlGOItOtSgiiHvwpIM__Sg"
  },
  "GKbYLxF02l5zhLG40bcrSw": {
    "date": "12/7/2015",
    "text": "Every time I come in Cody has given great service. Also those margiritas are amazing. Try the happy hippie taco.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3MrVVplWgUdBWRANhNJ6Rg"
  },
  "1xR74z3x37_dVGro_WIV3Q": {
    "date": "12/27/2011",
    "text": "Maybe it is for sentimental reasons that I need to give the Oakland location 5 stars, but it it also because even though I have been coming here for 16 years (God that is creepy), I love it each and every time.    I have never had bad service here (whether they are busy or not),. the bartenders and servers are always attentive and make sure your drinks are always full and replenished.  The dark ambiance creates a mystery about the place (and I am not sure if I would want to see it all lit up after all of these years anyway).  It can be loud from time to time, but seating is always quite intimate so you can hear whomever you are with.  Chips and salsa are yum, fish or chicken tacos are always yum, and of course, the margaritas are always yum (I yearn for the Apple Cider Margarita often because it is only seasonal).  The Gobblerito is a must have in November as well :)    I will continue to patronize this location even though I am many years removed from my years in South Oakland.  Keep up the fab work!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hLVq7VSJBHZwqurwWoCmpg"
  },
  "CpslL1vDHULufDDtkYrj9Q": {
    "date": "12/7/2014",
    "text": "I recommend going to MadMex for half-off late night! So good and so cheap! My huge burrito that I had was less than $5 but it was so filling I couldn't even walk because I was so full. It's a bit small so there may be a wait, but its so worth. And you can always call in to make a reservation. I would definitely recommend the burritos and the buffalo wings.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "26E3I8b44eU-2aWxomN8ww",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/26E3I8b44eU-2aWxomN8ww/o.jpg"
      },
      {
        "img_id": "03pZAs_DYvq3IlvraBMOnA",
        "caption": "Photo of Mad Mex - Oakland - Pittsburgh, PA, United States. buffalo wings",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/03pZAs_DYvq3IlvraBMOnA/o.jpg"
      }
    ],
    "user_id": "PQPDV6w0qWDzcdNRILkz1g"
  },
  "odRoZm8Oa8xicfvjZjQQeQ": {
    "date": "6/16/2017",
    "text": "Food is really good. Margs are okay. It's more expensive than it's worth in my opinion, but I still like it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AvAUBqF7_UNRP58qvQx3gg"
  }
}