{
  "3KkdTbcE-cPQX2sANMFeCQ": {
    "date": "2/5/2015",
    "text": "Honestly, their food is just bland and tasteless. You are better off ordering something from Taco Bell.  We do not plan to return!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yPyXt3P7KPxdlXTzuHonpQ"
  },
  "Ma7LZZyy8kgS7s-7Mj6VOA": {
    "date": "5/16/2015",
    "text": "Been here a few times now, food is mediocre at best. Had a waitress take my order down wrong, brought out a completely different dish. Last time I was there the waitress was very nice and accommodating, ordered the chicken quesadilla, the chicken was super dry. It's hit or miss with this place, but mostly a miss.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ko4AWwz596u596WnJE5T-w"
  },
  "bOCibXoRMgqEQZYPViCdtw": {
    "date": "11/20/2011",
    "text": "I dunno Rach, I was at this Mad Mex yesterday after more house-hunting with Kay, and all that was on my mind was avocados.  As soon as I met eyes with our riot grrrl server, I told her, \"I want guacamole and chips in the worst way, like John Boehner needs a stiff drink.\"  And it came newly prepared, laden with large, lardy chunks of that most decadent of veggies, seasoned ideally, and enhanced with tomatoes and lime juice. They must have used bad 'cado's when Rach went, but they didn't when we lunched here. My only gripe about it was that there wasn't more of it.   Of course their salsa came with it, and it lived up to its usual high standard.   After that, I had no idea what to order, my craving for guac having been quelled.   So, I went with something that sounds like a masked luchador carrying on a legacy; The Super Mad Mex Burrito.   What it resembled was a large, square package dropped off via air-mail. All it was missing was a stamp, printed addresses, and some twine.   It appeared/tasted to be garnished with a chipotle mayo (???), but was almost overstuffed with a winningly tangy blend of rice, spinach, chickpeas, and my choice of steak. The thing nearly gave me indigestion and caused me to leave a quarter of it unfinished. We'll call it a win by countout.   I'll keep it a star shy of a full-on 5 for the much too delicate chips (they couldn't hold the salsa and guac well) and service that was slightly \"off\" if you know what I'm getting at.   And now, because I cannot resist, some Lucha Libre!  <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DdfEckBCIo7U&s=150fc5cffe3b31898f9739416d26ea933563a32a230199d37edf4a60a9655011\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=dfEc...</a>  <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DE62oTk8kf68&s=67654a6fcec8453497f4b60d1069b05dece05ff4151c3356518ceedeb4119314\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=E62o...</a>  I still think they need to show Mexican Wrestling matches and some El Santo and Blue Demon flicks on the telly to make this funky chain all the funkier...  <a href=\"/redir?url=http%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DXr1X8HQVekc&s=a5b0739ce382edbc3479b989e1d809b63f37817f0468dfc9d11fe6f0a76efb2e\" target=\"_blank\" rel=\"nofollow\">youtube.com/watch?v=Xr1X...</a>  This brings me to the decor. I normally don't pay attention to it, but this particular location has some wonderfully creepy yet kitschy tchotchkes hanging on the walls and from the rafters. One could spend an entire day looking for them.  P.S. Those who kvtech about \"authenticity\" need to take a ride down to Guadalajara instead of going to Mad Mex. As they clearly state in their menu, what you're in for is Cal-Mex fusion. Know that and stop holding their quirky take on Mexican food against them.    P.P.S. Kay's younger brother, a trained chef who specializes in Southwestern cuisine, adores Mad Mex. So there.",
    "rating": 4,
    "rated": {
      "funny": 10,
      "useful": 8,
      "cool": 11
    },
    "photos": [],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "PPfRcKP46oxsgkGhKAedpg": {
    "date": "1/24/2015",
    "text": "Service is always great at Mad Mex South Hills.  My previous review was the only such occurrence there.  Stop by during Happy Hour (or anytime) to enjoy a great selection of Microbrews and Tex Mex goodies!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EUKyydrnh8wTvwtuACsUTQ"
  },
  "wvpsW-jd48Hh8iw7hjm5lQ": {
    "date": "11/20/2011",
    "text": "When I was living in Wheeling WV, my friends and I would always go to this place for special occasions. They have an awesome beer selection and all kinds of great food! Plus most of their food has a vegan option!  That being said the food is really good but not great. The tofu is bland and the salsa is not very spicy. But who needs tofu when you have beans and guacamole? They make a good salsa verde as well.  The place has seating inside and out side, both with plenty of seats. There is all kinds of unique south western inspired art all over the place and it makes for a lovely atmosphere.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "2gBnpLchnstAV9DvhczYew"
  },
  "-Yg2wyVrgE280S8Pvsinmg": {
    "date": "12/29/2012",
    "text": "I love this restaurant and I probably go about once a month; however, there's just something about the inconsistency that gets me to just feel like it's not quite there.  Mad Mex offers a funky decor and typically quick service.  If you plan to go on a Friday or Saturday night, I suggest reservations because there's nowhere really to relax indoors when you are waiting for a table.  Being regulars, we have settled into a few choice menu items.  If you bother to read the menu, you'll notice a few jokes hidden in the description of items, so even if you are a regular, it's worth a read.  We always start with some chips and pico or the Picka Dippa and some margaritas.  The black bean dip is to die for.  Slight bit of spice, creamy black beans and a little bit of melted cheese.  The beer cheese isn't my favorite, so that one is never ordered, but we regularly switch up the salsa choices.  For margaritas, we have settled on the Ultimate margarita or the Don Julio VIP.  The burritos are huge.  Seriously, as big as your face type of huge.  At this restaurant, you will definitely use your silverware.  Of course, they are filled with a lot of rice and beans, so I recommend to pay extra for double meat to make a more desirable meat to starch ratio.  The chimichanga is great, but pre-made so they can't accomodate any changes.  The tacos and fajitas are good and come with nice warm flour tortillas.  Enchiladas tend to be oversauced, but overall good.    The food tends to be quite consistant and you get what you expect, but other parts of the meal tend to be hit or miss: 1. I think it's the sour mix, but something about the margaritas tends to be really inconsistant.  Sometimes you get a strong one, sometimes not so strong.... Sometimes you get a sweet one, sometimes you get a sour one.  It's never terrible by any means, but you really never know what you are going to get.  The Greentree location has the most variation in the margaritas while McNight road's margaritas tend to be better more often. 2. As off-season tomatoes tend to be finiky, sometimes the pico is fresh and flavorful, sometimes you get the gritty or cardboard-ish tomatoes. 3. Some of there servers are great while other times you get one that leaves you wanting more from the service.  In contrast to another review, YES, they do appreciate you on your birthday.  None of that childish singing or a flamboyant dessert... if you are on there list, you get a birthday card for a free burrito.  That's better than any of that cheesy crap.  Although a casual dining chain restaurant typically isn't worthy birthday dinner fare, if someone's giving away a free burrito, I am there.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aiRLSX3y6smRItyBL2J6aQ"
  },
  "SzoxmgzCNBbFTzOYawj-nw": {
    "date": "6/15/2016",
    "text": "I didn't finish eating...I asked what I was served and waitress said it's a fusion of American and Mexican food...Just horrible...how can you screw up Mexican food?",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lGChDTKsj_TQUr9Mo1fpWA"
  },
  "TPCi4e0s4maMPtivyXDcOg": {
    "date": "3/31/2016",
    "text": "Went to bar. Waited 10 minutes for drink, waitress got my order wrong. Not worth the trip.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FJYo5dFglM77VFK-AISygg"
  },
  "f0gcDiMBJ2IE73yrJaTcYw": {
    "date": "1/3/2016",
    "text": "Just average. 2nd time in a row the food, drinks and service did not impress. The bar area could use a good dusting/cleaning. I think next time I'll drive a bit to go to Plaza Azteca in Robinson where the drinks, complimentary chips&salsa and service are really good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M3l41fkOhS8qGD-LnRJLYQ"
  },
  "tDbERanz-p8rIbYWYjbwEw": {
    "date": "6/21/2009",
    "text": "The only reason I wouldn't rate this place any higher than a 3 is that it can be a hit or miss. This time was great!   FOOD: I ordered the chopper steak salad, which is grilled steak on top of a bed of greens with half an avocado, cherry tomatoes, corn, onions and a tortilla. The steak was tender and tasty with the ripe avocado. I had it with Ranch dressing. This combination was a light but filling dinner.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "sv5K9wQ04MqxtvytKXORFw"
  },
  "jUNedIyPCFZhz0-lx8EkQQ": {
    "date": "1/23/2016",
    "text": "Service was mediocre but the food was poor. Burnt chicken in the burrito. My friends burrito which was supposed to be primarily vegetables was about 100% rice. There was no mole sauce as described in the dish. The frozen margaritas were horrible although the regular margaritas where decent but nothing to write home about. There was a charge for chips and salsa for sitting across from the bar but nothing at the bar. This was explained to us before we ordered. The more I think about it the more I can understand that policy. It's bizarre that you can't sit at a table in the bar and order the same food as at the bar and be charged the same price. This restaurant has really gone downhill over the last few years. And I'll never go there again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tbfh4Vje_bfR4Sp96yiO4A"
  },
  "yA2HrsLdRJGmSuv2lmVqNg": {
    "date": "12/7/2010",
    "text": "Love their spicy black bean dip and their black bean and pineapple quesadilla... mmmm can't get enough of their black bean.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "FQRB0z2EJ-qXbMgRhFatPw"
  },
  "v8aR3HNT1fdI0q1ROOAyhw": {
    "date": "10/16/2015",
    "text": "Have wanted to try this restaurant for some time. Finally went on a Friday night. It was loud, but expected that on a Friday night. Had a 30 minute wait which seemed strange as there were at least 4-5 tables open. Whatever, there were two seats at the bar and we decided to eat there. Ordered a Yuengling and a margarita on the rocks, no salt. Bartender came back quickly with what looked like watered down lemonade. WORST MARGARITA I HAVE EVER BEEN SERVED!!!! What the heck? It came out of a can?!?! And this is supposed to be a good Mexican restaurant? Anyway....ordered seasonal chicken tacos. Described as being served with butternut squash, Brussel sprouts and cauliflower. Yum! Served and presented nicely. And it was ICE COLD!!! I mean cold to the touch. Didn't even get time under the warmer. OK, SO bartender takes plate, gets a new order and honestly it was pretty tasty. Have never had fall vegetables in my chicken taco and that made for an interesting and flavorful taco. Although I ultimately enjoyed my dinner, I did. It drink 1/3 of my margarita. Glad I tried this place but won't rush back. Sorry, bummer.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hy0NxhG_4xTb1mqHPTxYxQ"
  },
  "2E3Od4F3XMSQ1w7Dy3Xvqg": {
    "date": "12/15/2012",
    "text": "First time. Good experience. We will be back. We had the Chips and 3 types of dips (the Black Bean, Cheese & Hummus) Original Enchilada and the Chicken & Steak Fajita. Very Tasty ! We were a little disappointed that they did not do anything for customers celebrating a Birthday ( like sing or offer the birthday person a treat of some kind). We were celebrating my Wife's Birthday so we were bummed. That aside the food was good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "JCbP3jpvEbXen1OWE8xEzg"
  },
  "gutrOn7mWRYhNt3CxwgVpw": {
    "date": "1/6/2012",
    "text": "We went to the Mad Mex in Cranberry Twp and won't make the mistake of going back.   The food was horribly hot, like they just toss in heat for heat's sake, rather than for taste. I ordered the mole chicken enchiladas and that was NOT any kind of mole I've ever had. The sauce was more like a weak, thin ranchero sauce and both the sauce and the chicken was too hot. Even the guacamole was too hot.   I recognize this restaurant chain is trying to be a trendy \"fusion\" of Tex-Mex and CA, but they failed. Luckily, they are in the same parking lot as a pharmacy so I was able to walk straight over for some Tums.  If you want GOOD Tex-Mex, go to El Campo in Monaca or El Paso Mexican Grill in Chippewa. Both restaurants are excellent examples of good Tex-Mex, similar to the styles typically served in Central California.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F43IUmEt__FB66Fr4c7JiA"
  },
  "MlI64L4-Dt6yIUIFSu5RtQ": {
    "date": "10/11/2012",
    "text": "Always great service at the bar from Tanya and Nikki. Great food and wide selection of draft beers. One of my favorite spots.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SCjNpdsPgUK2HLprz2CiiQ"
  },
  "EMpTPcAkVI-lunjI7TRdMg": {
    "date": "6/15/2011",
    "text": "Not a pleasant experience.  While looking at the menu, we ordered a margarita and a draft beer.  The beer came in a bottle instead of a draft and the margarita had a terrible funky taste - almost a \"plastic chemical\" taste.  Next we chose to have chips and dips/salsa.  We were able to choose three dips/salsas and the server brought one that was incorrect.  To his credit, he promptly corrected the error and brought the right one.  Needless to say we elected not to have dinner and departed after drinks and chips.  There is much better Mexican food and drink in the 'burgh.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KZ40bOby2_SC0ErWnz8gRw"
  },
  "AOhsLF2xeO7DXg4RsnP0Eg": {
    "date": "6/15/2012",
    "text": "Mad Mex is a good go-to spot when you are hungry for lots of food, and lots of people.  The service is standard, really nothing special.  The music is loud, so I always find myself talking loudly just to have a conversation.    In all honesty, this is Big Burrito Company food, so it isn't all that great.  Lots of frozen food heated up and presented nicely, in hopes of you not realizing it was frozen an hour before.  However, they do excel in one area:  Margaritas.  They are great, and not too weak.  They are a bit pricey, around $7 for a medium sized one if I am correct.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "swgXLK7pds3blaG7eBl04Q"
  },
  "vqMPK_1972ECrFvrVVVgUw": {
    "date": "6/28/2011",
    "text": "\"Meh.  I've experience better.\"   I find this fairly overpriced for the quality of food.  I think that the decor of the place and the witty menu drive up the \"like\" of this place b/c it's modern and fun... but it all comes down to the food, and it's not something I'd think about again when I leave, but I wouldn't object too heavily if someone asked me to meet them there again.  They staff is nice, when it's busy they're a little slow.  The food is spicy, like the guacamole and house salsa - I like spicy, but it didn't really add flavor, just made my mouth burn enough to get a second margarita (which was strong - good, but strong w/ low-end tequila, yuck.. paid the extra $$ for better liquor).  The pico de gallo, my alternative to the spicy salsa, was as bland as they come so I settled on \"virgin\" chips.  Everything is just mediocre and pricey... meh.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XdowP0A5JxSY7SXMNwI9og"
  },
  "7aTGx-4i3NifchPYa4MUoQ": {
    "date": "2/26/2011",
    "text": "I take my Mexican food pretty seriously and this place did not disappoint. We went as a group of 10+ and got seated quickly at lunchtime, but did get the seat by the front door so we got hit with draft coming in all the time.  We started off with the chips and dips and they were all pretty good and spicy. I then tried the black bean soup and the chickpea chili. The soup was really good, but the chili was just okay.  For lunch I had the Spicy Mad Max burrito. This thing was huge. The dimensions of this head-sweat triggering burrito was 3\"x6\"x6\" of pure deliciousness.   Drinks were good and service was really good. Definitely going back here again next time I'm in Pittsburgh!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9u9fQhq0hynxjLQgZGpmSA"
  },
  "bcmR8mn1UjqKXaXYO2aKKA": {
    "date": "6/18/2015",
    "text": "This is NOT a good place for lunch unless you have a couple of hours to waste. I ate here twice this week because I love their food but I'm not sure that's enough to bring me back again.  The floor was greasy and slippery. They had only two waitresses both days waiting on the entire indoor and outdoor spaces.  The first lunch it took over twenty minutes to get soup.  In all it took over an hour to order, eat and pay for soup and a salad.  The second day my appetizer and lunch came quickly but all at the same time.  I told my waiter about it, quite nicely I might add, and then he never came back to my table again.  I had to ask other employees for a to go box and my check.  The manager was nice about it but I'm not sure I will be back to this location.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P_mdJ2F74kP3ruyq8fUuTg"
  },
  "lyBchQ9pe8C2r5ID78ACYg": {
    "date": "11/30/2014",
    "text": "I'm in from out of town, and I'm so surprised and disappointed about the level of we received here during a quiet Sunday lunch hour. Our waitress gave us indignant responses to every request, with visible eyerolls to things like sharing fajitas.   When an order came out completely wrong, she said \"Sorry for the mixup, but I don't control the kitchen\" and made no effort to correct the order. Had she showed any effort or contrition, the error really wouldn't have bothered me, but she actually seemed to act like it was our fault.   It really disappointed me to have my dad treated like this on our family meal together on my final day in town. Please train your staff better and treat customers with any level of appreciation or helpfulness.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p85Lwwfy9HTgM7Gepqh9-g"
  },
  "EKBoxg_yM67-Wi3nBOkuhA": {
    "date": "9/25/2011",
    "text": "I'm always the first to say that I love Mad Mex.  I don't care that it's Tex Mex, just give me a supersized Dance Marathon Enchilada and I'm in dance party heaven!    What I was sad about at this location was the gauc,.  It was, how do you say....okay...it was just plain gross.  It tasted rotten!  Not the way you want your gauc to taste.  And for some reason I kept torturing myself by taking little bites to see what the heck was wrong with it!  The waitress, who was incredibly nice, took it back to see what was up with it.  She said she thought maybe it had too much lime in it.  I love lime and I don't really know how lime can make gauc taste rotten, but I was pretty bummed   The good?  My Dance Marathaon Enchilada, as always, was a party in my mouth!  And like I said, our waitress was super friendly and a great server!  She suggested to the seasonal Apple Cider Margarita.  I excited and scared all at once!  I've been digging the ciders lately, but in a marg?  A little scary.  First sip tasted a bit like cinnamon apple sauce.  A tad weird.  A couple sips later, I was into it.  I was also into caramel/sugar lining the rim of the glass!    Solid meal, I just missed the fresh, non weird tasting, gauc.  Until next time...practice safe Mex everyone!",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "4wp4XI9AxKNqJima-xahlg"
  },
  "yPCfBMKqQsStdWPNtH07Lg": {
    "date": "11/1/2014",
    "text": "Beer selection: 4.5 stars Food: 3.5 stars  This location is my favorite mostly because it doesnt seem to get quite as busy as the other locations. As with all Mad Mex's, the draft beer list is always great with a broad range of styles. Youre sure to find a beer youre in the mood for.. And happy hour is hard to beat with half off drafts and wings from 4:30-6:30pm on weekdays. The burritos seem to be a hit, but i think theyre overrated. The nacho grande is huge and loaded, and tastes alright. Wings are pretty decent, especially with their blue cheese. All in all, id say come here for happy hour to feel the full affect of Mad Mex",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CR0D39AqYLrClEpLU31OkQ"
  },
  "4tR1_HyJEEmgixhJRKoiHg": {
    "date": "8/15/2014",
    "text": "Parking = terrible Service = just ok Food = decent Atmosphere = really nice but loud Drinks = margaritas are ok  Coming here I wouldn't get anything else other than the burritos it fajitas. Really disappointed in the quesadilla I had here. Guacamole is pretty bland but the salsa has a nice spicy kick. Neat place to hang out if in the mood for Mexican like food and atmosphere.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XWEbLpANMuEajGXWZ3_CEQ"
  },
  "WFo8f3uMkOkli5AyT7PmPg": {
    "date": "5/29/2017",
    "text": "Alicia Morris 57 orders not one mistake absolutely amazing service and food she was flawless.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1BLWSWXCk6fFKFwORSWAew"
  },
  "OJvuildAnPBuYpZHBJmy0g": {
    "date": "4/12/2013",
    "text": "I am big fan of MadMex. Wonder why everyone loves Chipotle (It must be good! But unfortunately, I'm not a fan!). May be because it's closer to CMU unlike MadMex n I was a student from CMU.  The southwest wings, and the fish tacos are something I can live on everyday! Never get bored of them.  BUT THEN - some of the waiters were total fake/unpleasant! (Well, it got camouflaged by the food they got later though! )",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "ApRtlJbTaYUP1SI5wJ3-lw"
  },
  "s1jTLt4yeEHc2w2wRe6M_g": {
    "date": "4/20/2016",
    "text": "There were four of us sitting in a booth at the bar. The server, Sean (maybe)--sorry I'm terrible with names, was great. He was courteous and never made us feel like we needed to leave. There were a few moments where he was distracted, apologized for our inconvenience and readily went and obtained our orders. By the end of the night we were still having a great night we decided to split our bills.  He was patient, courtiers, and acted responsible for his actions (this goes a long way). We will go back again and hopefully get this server again. We sat behind the bar in a booth along the wall (value, I know)  The drinks were, food and service was great!  Thanks,   --Josh",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t6qc45S8jY-iu05rEbGAoQ"
  },
  "RbzuHClvJ02KSY1H4uJpGQ": {
    "date": "1/1/2016",
    "text": "I absolutely love the atmosphere. Their margaritas are really good. The mango is the best.  Even the original is worth trying.  Get the XX Cheese (queso). The ambience is fun. It's hidden in the back of a plaza so you have to look for it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qRV8StkPI-wqik30qICEHw"
  },
  "nasMw3_3o9n-sQl2D4NCdQ": {
    "date": "3/31/2016",
    "text": "My first visit to a Mad Mex ever and I wasn't impressed. The seating was prompt and the waitress was nice and patient. I ordered a Mad Mex Burrito with steak and shrimp since I wasn't allowed to omit the green peppers in the fajita burrita (I don't remember the name exactly). The wait for the food was short since we were in there early for lunch, around 11:15am. First cut into the burrito wasn't as exciting as I wanted it to be, I kept cutting trying to find the protein...it was about 93% rice inside. Just plain bland rice. Finally made my way to some shrimp and then steak. Still no cheese. Once I got to the opposite end of the burrito there was the partially melted hunk of cheese and a little more meat. A more even distribution would have been better for sure. I mixed the salsa they give you on the side with everything and it spruced it up a lot. That salsa should just automatically come inside of it for the added flavor, but maybe there is one like that I don't know about. I just wasn't all that impressed and wont be hurrying back. If there is a next time, I will try something different.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-DTN9lJ-zyQLOqdC0rTxOA",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States. Big Azz Margarita on the rocks with salt and lime",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-DTN9lJ-zyQLOqdC0rTxOA/o.jpg"
      },
      {
        "img_id": "RfmEKbb3xYXrJq6fsV90Uw",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States. Mad Mex Burrito (rice, steak, &amp;amp; shrimp) with a big azz marg on the rocks with salt",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RfmEKbb3xYXrJq6fsV90Uw/o.jpg"
      }
    ],
    "user_id": "9hozjSNcHV77shHl1aQASQ"
  },
  "C8muW_8JsMuV3uNzxwC_ug": {
    "date": "8/6/2016",
    "text": "I love Mad Mex, but the Greentree location is terrible! First, it's sooooooo dark and LOUD. I understand dark and loud in the bar, but not the restaurant. We could barely see the menu or have a conversation. Maybe it's dark so you can't see the food. We ordered southwest wings. They came out with the wrong sauce so we sent them back. They simply added the right sauce over top of the wrong sauce! What the wut?! The wrong sauce was red, and it was totally visible even after they tried to cover it with the right sauce, which was green-ish. So, the cook thought this was acceptable and the server who had to notice, thought so, too. Unbelievable! They credited the wings and offered new ones, but, no thanks. And when they do get the food right, it's just ok. Definitely won't be back to this location.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SmLQyKPDwHkcqszu7pJl_g"
  },
  "lDe2V9lkJV8tQAngEXkoRA": {
    "date": "11/6/2014",
    "text": "Mad Mex is my \"go to\" place to eat. It could be the awesome beer list which always includes at least a couple of IPAs.   OK, beer is a bonus, but the food is fantastic. My current favorite is the \"wing-o-rito\" a burrito stuffed with boneless wings with your choice of sauce.   I love the insane southwest sauce and go off the board by changing out the chicken for shrimp.   Tonight I used my birthday free entree and got steak and shrimp in my burrito. The second half will be lunch tomorrow!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yJeCEVG1ZR_-ZBXMwcZ2gQ"
  },
  "sndLmyyfRQ7utaG8mK3Vwg": {
    "date": "11/24/2014",
    "text": "I do like my Mad Mex, however predictable and non-authentic it may be.  The portion sizes are mammoth and I come away with a satisfied sense of regret.  Their beer menu is happily extensive.  Charging me $9 for chips and salsa is a bit of crime, wouldn't ya say though!?!  I mean, c'mon!  Our service has most times been lacking--a bit rushed and on the inattentive side.  Also, why do you require your wait staff to not servestraws/ lemons/etc unless asked by cusotmers---weirdness-cut out these odd cost-cutting, anti-service friendly measures please.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "7jo6XSAwCgtcvDU7QhrZ4w"
  },
  "5VsPSzEhLtG7lxRwo1vUFw": {
    "date": "1/24/2016",
    "text": "Haven't been here in a long time because the service and food suck!  Waitress was very nice, polite and attentive.  Ordered the Carnitas Burrito, if I wanted rice I would have gone out for Chinese.  Struggled to find the carnitas and peppers....seriously 95% rice.   That was one of the Worst burritos I have ever, ever had.  Never again Mad Mex South Hills!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4mV9d0H3DzSvogcyOUcgAQ"
  },
  "-Y386sEFDm2XwuxFheBAUg": {
    "date": "9/19/2015",
    "text": "Have always loved Mad Mex with their authentic Tex Mex food. They have a wide selection of beers. If you're a margarita lover then this is the place is for you. Try the margarita on the rocks the classic is the best.  Great burritos and my kids love the mac & cheese. My favorite is the tofu soft tacos very good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LJomnxMBaUitDHcQ1BQsSg"
  },
  "EjPikRdpkg7xGMJxsMWOBw": {
    "date": "8/4/2014",
    "text": "This location has such a different feel than the others around Pittsburgh. Perhaps it's the well-lit bar, or maybe it's that there's a new bartender every time I make it over here. In any case, it doesn't quite have the \"feel\" that North Hills and Robinson have.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "FBd1Qjnnc1Loh7ZY7FD9Zg"
  },
  "Fffw0M4KCcq0wYtBwEme-w": {
    "date": "7/28/2014",
    "text": "I love me some Mad Mex but, I have to say that I have never had anything but the grilled fish tacos.  They are so good that I never felt the need to get anything  else when I order.  Why mess up a good thing.  This specific location is very nice and out of the way but I have to say that the fish tacos at the location in Monroeville, PA are much better than here.  Not sure if it was just an off day because I have eaten here before, but at Monroeville they are VERY consistent on delivering a darn good grilled fish (mahi-mahi) taco.  Today's dish was still very, very good but the fish was slightly dry.  I'm being picky here but that is only because I have eaten at least 50 or so grilled fish tacos from Mad Mex.  Now, in giving my review, know this .... I still got an order to bring home.  YES, I did.  For some reason (like lasagna) they are better the next day.  I will be eating them for breakfast.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ekle67q6Md4dUILPSx4clA",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States. Cozy booth.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ekle67q6Md4dUILPSx4clA/o.jpg"
      }
    ],
    "user_id": "DO3TIDmqypuGlwKfpZqG6A"
  },
  "ghh2TBFkKcuVKM3drywi3Q": {
    "date": "10/5/2015",
    "text": "Awesome beer selection!!!!! This is my second visit and both trips have been great. Excellent salsa and my favorite dish is the black bean quesadilla with pineapples in it. Service has always been good as well. Did I mention the beer selection?  :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XhyCO9sXTXAOLSBiuxvrsA"
  },
  "t0xr7thnTAiSAzGtssEfWw": {
    "date": "11/17/2014",
    "text": "I think its time to sacrifice time and convenience. When we visit the area....this place always lacks the experience that we receive from ShadySide, Robinson, and Ross Park. Even though it closer to my Dad's House when visiting...its time for us to part ways. The food and service is never as good at this location. I love, love, love their tofu tacos...but this was just eh this time...it was as though the thick pieces fell apart and they were small and too crunchy and maybe just old...bleh. I couldn't even finish them, even though I cannot wait to eat them the 3 times a year I get to have them. Total Bummer.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D8PJTlkMlwAyDjow3pup_Q"
  },
  "acZga_0VZ9Qdx55ECpZsOA": {
    "date": "2/22/2014",
    "text": "The food isn't terrible, but not impressive.  I lived in LA for 4 years, so I'm super spoiled when it comes to having good Meixcan food.  We got a burrito, which was just stuffed with fillers such as rice and beans..no thanks.  There was nothing memorable about the taste of it whatsoever.  Who seriously wants a huge burrito like that?  I'd rather have a normal sized one that actually tastes good and isn't filled with crap.  We got the steak fajitas, which were actually pretty decent.  The steak was cooked perfectly as ordered, which I appreciate.  We also got the chips with salsa and guac, which were good, but, come on, it's really not hard to mess those up!  Overall, I'm just not impressed, but I guess you can't really find that great of Mexican food options in Pittsburgh.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZClDLqnxXOqX7hyaaNxnbw"
  },
  "aGhRpWvY1cnQDtBQA0Xc4g": {
    "date": "1/12/2017",
    "text": "Let's start with the good.  The restaurant had a nice atmosphere and the staff is friendly.  Although I was not able to partake, there looked to be over 20 different beers on tap.   Every Mexican restaurant I have ever been to will provide you with complementary chips and salsa once you are seated, but not this place, which was a little disappointing.  The rice had the color of Spanish or Mexican rice, but had the flavor of plain unseasoned white rice.  The shrimp and chicken fajitas were very flavorful and I really enjoyed them.    Not a bad place to eat, j just missed the complementary chips and salsa and I wish the rice had flavor.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yqeZbcEgXD0tgW-909SUfw"
  },
  "RdbnuY6-HpREJ9QktkrMeQ": {
    "date": "9/28/2014",
    "text": "What is not to love about Mad Mex??? Although they are a chain, the food is always A+ and the atmosphere is fun!  I was first introduced to Mad Mex about three years ago. Not knowing what to expect I thought that it was just another Mexican restaurant.  Mad Mex is awesome from their chips and salsa, to their burritos to their margaritas, never a bad meal, drink, or service! I have been here for both lunch and dinner.   The atmosphere is very fun too, the art is pretty cool  and resembles the Mexican Day of the Dead, and it just has a relaxed vibe to it. It is a casual place so you are perfect in jeans!  Their margaritas are really good and reasonably priced. Are you a beer drinker? They have a ton of beers that they serve and a decent amount on tap. Around fall they have an awesome selection of fall beers and they have pumpkin beer.  Also in fall they have this wonderful little thing called a gobblerito.  You must try it,  it is the most amazing thing I have ever tried.  Although to some the idea may sound gross, you MUST give it a try!!! A gobblerito is: turkey, stuffing,  corn, some black beans, and mashed potatoes all wrapped up neatly in a burrito shell. You get gravy and cranberry sauce as a side! A must try for fall!!!!  While I have been to other locations, Greentree is my favorite! !!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "AILBGloVkM67XwEe5aIY1g",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States. The guts of the gobblerito!!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AILBGloVkM67XwEe5aIY1g/o.jpg"
      }
    ],
    "user_id": "l3ryB3Q6WZ3uHDHVe2HgoA"
  },
  "R8jhSlnCONs8YEATqE8B0Q": {
    "date": "4/15/2016",
    "text": "Mad Mex is a pretty cool place and I like the atmosphere a lot. I would suggest using the No Wait app if you want a table during dinner hours, it gets super busy and the wait can be upwards of an hour! Speaking of, last Friday I used the No Wait app for a table for 2. We got there when we were next in line, and the host even said we were next. About 10 minutes later he sat two other 2 person parties ahead of us. Then we were next. It was a little strange? I can get over it, but yes, strange.   Anyway, I would also suggest ordering a marg as soon as you sit because they are phenomenal! Happy hour prices are a great deal, too. I also love their chips and salsas, free if you sit at the bar and the salsa is always fresh and delish! Every meal I've gotten here has been good, but I think my favorite (and my fiance's, too) is the Nacho Mamma Taco Platter. The service is also always great!   Keep making those delicious margs and I will keep coming back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "SJQTqW0Uf4V9MNX1ogtw6g"
  },
  "h_WbwJXH0E-dz3ecwNWE0g": {
    "date": "8/17/2017",
    "text": "Nice atmosphere and bar area. I don't recommend take-out; always cold and never accurate orders. Great place to drink after work!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oGQAMCQebbwePcLvK4S6aw"
  },
  "LLjMrGVClTRUmDmgVDwkKA": {
    "date": "6/27/2014",
    "text": "Fair warning: The servers here are quite unpleasant, surprisingly indifferent.  Being close to where I stay brings me here mostly. Southwestern wings with cilantro and garlic is pretty nice. Another reason to be here is they have ciders available. For main course my favorite are Enchiladas. The Super Mad Mex with chickpea is awesome n very filling. Chicken chimi is another good dish.  Burritos are quite, boring, to be honest. I can get a far better one at Chipotle. Same goes for tacos. Nothing inspiring there.   But despite \"average\" service, I like the ambiance and bar. Not a bad place to hangout.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "TzU30D-CjtPP3XumggK0Mg"
  },
  "glZJJLbl9wCrX-5Xp4V4kg": {
    "date": "7/7/2017",
    "text": "Update: I've been here many times and usually have a very good experience. But I went on Wednesday and it was absolutely the slowest service ever. The restaurant was not full so it's not like they were slammed. Took forever to bring out waters. My sister in law and mother in law both ordered drinks. My sister in laws took about 20 minutes to come and then we had to remind the waiter about my mother in laws, which he said he would go \"look for\" and we had our food by the time it came out. Finally, we asked for our check three separate times, only to continue to wait at our empty table. We had to get up and walk toward the door and tell the hostess we wanted to pay and leave for someone to finally bring our check, and even then the waiter still hadn't run it, so 5 more minutes standing by the door while he did that. As I said usually I have a good experience there but this time the service was way below what it should be. Also, nothing was taken off our bill for the inconvenience!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tjCKsPywTjislyTV0yKB_w"
  },
  "wF4JmYEHo1nvuCKTrxFrxw": {
    "date": "12/30/2017",
    "text": "Service and bar area during happy hour great. Food way way overly salty. Tofu general tso appetizer burnt and soy saucey, not juicy and sweet/sour. Would have loved guacamole made fresh tableside.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QmFyVo0J-IogVfNpzPl7UQ"
  },
  "v2ApnhUpxJ3bqyfonkjfWA": {
    "date": "11/16/2014",
    "text": "First of all, I have to say I didn't even realize there was a Mad Mex location in the South Hills! The location is a little hidden at the end of a shopping center off the main road. But I'm very happy this is here! I foresee myself meeting for margaritas in the future since it's so close to home!  My friend and I came here for our annual Gobblerito Friendsgiving meal. The Gobblirito was good as it is every year. I wish there had been a extra side of gravy or something since it did get a little dry. I'm not sure if it's a new thing this year or just something they do at this location, but there were black beans mixed in with the mashed potatoes, which I thought was a little weird.  I also got a strawberry margarita. I asked for it frozen, but the waitress said their \"frozen thingy was down\" so that was a little disappointing, but it was still good on the rocks.   Service was okay. Our waitress took awhile to get to our table but our food came out fast. I'd like to come back tho this location again to see how the normal menu items are.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iiKmYXcz08ITbyyq5Isetw",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States. Gobblerito",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iiKmYXcz08ITbyyq5Isetw/o.jpg"
      }
    ],
    "user_id": "B3fVQWx-gb3ZEMwbjOjBrQ"
  },
  "wyUmDYKBPeHhs82jPQXPKg": {
    "date": "3/3/2017",
    "text": "Wow! What a disappointing meal. The service was great but we thought the food was awful. I used to work nearby a few years ago and ate their food regularly and usually enjoyed it. We decided to go somewhere different tonight and are regretting our decision. I genuinely enjoy spicy foods, but we got the cheese dip and it was literally too spicy to even eat. We also ordered the potato taquitos as they are our favorite at another restaurant and we found they were severely lacking any flavor. I ordered a taco salad with chickpea chili and it again was overpowered by spice. My boyfriend ordered just regular tacos and they were literally sitting in a pool of liquid. It seemed like the taco meat wasn't drained before putting them in the taco shells so they were completely soggy. The rice was equally disappointing, it was crunchy. I was most looking forward to the Nutella stuffed churros and I was heartbroken when the plate arrived. I'm not sure how they qualify as churros, as they were lacking the standard crispy outside coated with cinnamon sugar. The Nutella was the only flavor apparent. It was stuffed inside a greasy, soggy outside. Even the margarita was extremely disappointing, we ordered a raspberry frozen one and it had this bizarre acidic/sour taste... it burned to drink... so much so that we didn't. We are so disappointed to have wasted a meal out and won't be back. $75 can buy a really delicious meal elsewhere.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YEaYdTrF2JVebGbPVe5K6Q"
  },
  "JzOdYqYAttSjNWJFbS_9ew": {
    "date": "8/27/2017",
    "text": "In my opinion, this is the best Mad Mex location. It's always busy, but never too packed. The wait staff is attentive, and the food is always amazing. Try the Red Velvet Burrito (or Bare-ito)!  It's absolutely delicious and enough for two huge meals!  The margaritas are made with real fruit (can't beat the mango or their seasonal flavors), and the happy hour deals are great. Getting their fresh-made guac to go is a great deal, and perfect for parties since they come in such large sizes with so many of their chips!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c9pKjfFJ_BZOhMETWh1bpg"
  },
  "dkqTlFFs0h2M9iV2EqNKbg": {
    "date": "10/7/2015",
    "text": "Horrible service. I mean HORRIBLE.   Went during a non-peak time. Pretty quiet in there, not a lot going on. Three employees who were sitting around chatting watched me and my my disabled, elderly friend stand and wait for long, endless minutes without doing anything. I finally went over to the bartender - also hanging out and chatting and watching us stand there - to ask if a hostess was available. Her response? \"Oh, I can seat you.\"  Really? Then why did I have to ask you to!?  Then, the young male waiter assigned to our table just laughed when my companion asked where the restrooms are. WTF?  Look, guys, that would be crummy service to anyone, but to treat an elderly person with a disability like that is just unconscionable.   We left and won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "kPhhm_zcIsNYYtQthLX92g"
  },
  "KNAk0YyBsMpywYimPI21Tg": {
    "date": "9/19/2016",
    "text": "The location is a bit odd, but otherwise, this is a stereotypical Mad Mex - and Mad Mex never disappoints. Except when it does...but only a little. I dined with my family group of four on a quiet Sunday night. Long-story-short, our food came out and mine was something other than what I ordered. It happens. No huge deal. Everyone began their meals and I awaited my burrito. It was on its way when the server (who later told me) discovered that it was still incorrect. So, back to the kitchen it went for a 3rd redo. When version #3 arrived it was hot, delicious and perfect. While I appreciated the server attentiveness and the manager (I'm assuming) checking in on me, I'll admit I was surprised that no discount was included on the bill. I don't think every little thing in the world deserves a discount, but when you're eating well past the other guests and extending an otherwise brief dinner to a lengthier event, a discount is probably in order, in my humble opinion. I'll love Mad Mex forever and ever, but I might stick to one of my favorite East side locations next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-ARdx8hOcEWlMDjzwLYZ_g"
  },
  "H_ENA0g1cvUW5MrFx5btKg": {
    "date": "1/15/2018",
    "text": "I've been eating at Mad Mex since they first opened in Pittsburgh. I think I've been to every one and find the food and drink quality at the South Hills location the best. We love the casual vibe, cool decor, but mostly we love the food, drink and service. Everyone is always so nice! And...they make the BEST margarita's and Mexican mules! We are huge fans.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kojWopt74uVEs48PrAfZ8A"
  },
  "LoL93nZOTqLtTbxjI3oM5g": {
    "date": "6/20/2015",
    "text": "Gotta be honest, even though it's a chain it's still one of my favorite places to eat! In fact, it has been one of my favorite places since college when we use to frequent the Robinson location, and contrary to popular belief, I actually named my dog Mad Max after this place (not the movie).  They've got killer happy hours, their house margaritas are some of the best I've ever had (and I hate tequila). Don't get caught up with all the fancy favors they offer. While all delicious, you can't beat the traditional house margarita, on the rocks, with salt.  We've been hitting them up for lunch quite a bit. The lunch menu is a great deal. For under $10 you can grab a burrito, cup of soup & salsa. Here's what I recommend for lunch, but you won't go wrong with any choice.  Mad Mex Burrito (I do it without the burrito shell), add a side of \"insane\" San-Fran sauce, side of habanero pineapple salsa, and a 22oz Big Azz margarita (16oz if it's lunch and you need to get back for a 1:00 meeting).  Oh yeah, they always have a great music playlist going.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KPmEDSuzErRbTqtTZv9kUg"
  },
  "MZhvTgf_JmpzyoVQtIvLLg": {
    "date": "7/22/2013",
    "text": "This place is hard to find in this crazy plaza, but the food makes it all worthwhile.  The Herb O'Vores Tacos are one of the most delicious things I have ever had. I've had them twice in State College and once here. I was tempted to try something new on the menu but our waitress said you can never go wrong with the tofu tacos and she is right. I didn't regret it one bit. I can always try making my own thai burrito or spicy buffalo wrap at home.  You get three tacos filled with fried cubes of tofu which have been tossed in a light sweet General Tso's type sauce topped with bean sprouts, a green salsa with avocado and served with lime wedges, rice, and black beans. So delicious and it all came out of the kitchen pretty quickly.  I love reading their menu. The Mex-Asian dishes all sound awesome. If I lived in Pittsburgh, I would come often to try everything.  They also have Daiya cheese and vegan cheesecake always on their menu. How sweet is that?  My only complaint is that we went just after 5 and it was so dark in the restaurant I could hardly see the menu.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mel3b3nLLYe2wLdHBOwavw"
  },
  "xUcccyo59nXA7wU3SqW63g": {
    "date": "4/20/2016",
    "text": "I'm a big fan of Mad Mex, but this location in particular seems to have some problems. Service is unusually slow and inattentive. On our most recent visit, they advertised the return of the Gobblerito and Pumking beer for one day only. After we were seated, we were told that both had sold out. If you don't have a heavily advertised item available, it's probably a good idea to inform your customers before they are seated.   I'd recommend both the Shadyside and Monroeville locations over this one.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "QtqWMef3-cmbZmCCZslPnA"
  },
  "BlA0Nh39j0MgVhLC7rtfkQ": {
    "date": "1/22/2013",
    "text": "I have a thing for chain restaurants, and I LOVE Mad Mex!  I live in Bloomfield so I frequent the Shadyside location.   This is a great spot for happy hour!  I think the wings are half off--but I don't eat wings so I'm not sure.  They have a pretty impressive beer selection and their maragritas are good too.  I highly recommend the fish tacos.  SO, so, so good.  Get the grilled kind, not the fried.  I seriously have to have them at least once a month.  Maybe more.  This place gets crowded on a weekend but you can wait in the bar and honestly, if a large restaurant is dead on a friday or saturday night would you really want to eat there?  They always say the wait is \"20-40 minutes\" but its always closer to 20.  The service is generally pretty good.  I've been eating at Mad Mex for about 10 years and there was only one time I had an issue with the service and it was years ago.  They've won me back over!  The food is consistent, the service is good, the menu is diverse enough to please everyone, and the vibe of the restaurant is cool.  The only thing I don't like/recommend:  do not get that pineapple salsa.  It is sooo freaking spicy!  You won't be happy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PD3X7S70zXHeOx1NjeicjQ"
  },
  "NWYhfwgt-Gi3SBNNL6pMBA": {
    "date": "10/2/2015",
    "text": "I was really hoping that this place would have good food. I was disappointed to some extent. Latin food is my favorite. I'm always trying to checkout new Latin restaurants in the hopes of finding really good food. I ordered 2 ground beef tacos with black beans and rice. The tacos were decent but the rice and beans were horrible. Both were very dry and lacked flavor. If you come here dont order the black beans and rice.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HxU_6hp1SHZqGp1vcYhiog",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HxU_6hp1SHZqGp1vcYhiog/o.jpg"
      }
    ],
    "user_id": "AxTns0HrHKzxyJ0YCV1AaQ"
  },
  "DbV4m28d1335ys8xo6vhfg": {
    "date": "9/4/2014",
    "text": "I'm a big fan of Mad Mex so why the 3 stars, I guess this is my least favorite location.  I really enjoy the Robinson and McKnight Road locations as I always feel the service and quality of food is excellent.    My disappointment from the Greentree location is the food.  I always order some version of an item that contains the Southwestern sauce b/c I love that stuff - whether it's the Wingo-rito, Tofu Wrapture or Los Wingos wrap - I'll order it!    Typically I order a side of the Southwestern sauce because like I said I LOVE the stuff and it's nice to dip the wrap or fries in it for an extra kick.  Typically when I've order one of my Southwestern sauce smothered wraps/burritos at Robinson and McKnight they douse enough of the sauce on the wrap that I only need to use the sauce on the side for my fries.  The Greentree wrap was so dry and had itty bitty drops of the sauce in the wrap so I'm glad I asked for a side of the sauce.  Also the waffle fries which typically come out hot, fresh and delish, were all welded together that I had to peel each one off the other.  It just seems that the times I've gone to the Greentree location the food isn't as well prepared as the Robinson and North Hills locations.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NnrCwpS1i5mZtkGGzmIk0g"
  },
  "0xQpsDt7-8WVayMHs_qNPw": {
    "date": "1/22/2015",
    "text": "I love love love Mad Mex. The one in University City Philly to be exact but when we moved here life was okay because Mad Mex is here too. We've been here a few times because of how close it is to home and each time there is something that just isn't quite right. The most recent time, which is why I'm writing this review, our food took over one hour to come. We repeatedly flagged down our waitress and she kept insisting that she was \"checking on it\" when finally the huz had it and we were about to let the manager have it and then walk out when the manager walked over and apologized for our order never being put in. They took care of the bill but still, left a really poor impression of terrible incompetence. Our waitress never apologized and acted as though nothing happened when she came back to see how everything was. Extremely disappointed with the service.   I'm giving the 3 stars because of my love for Mad Mex and the big azz margaritas but the Greentree location really needs to step it up.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qIossUhtsJ55_ciRTEqiPQ"
  },
  "yW2IYfRbRyMtfaJsUUEzVg": {
    "date": "12/19/2017",
    "text": "Came here for lunch on a weekday. It is located on the corner of the Scott township shopping complex. We started off with two types of salsas. I then had an order of the southwestern wings for lunch. My friend had the quesadilla. The wings were not as good as I used to remember. They were very chewy. I could tell they were premade and just coated with the cilantro and lime sauce. Overall, nothing special. A very average mexican joint.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gofnmwo5ptoEnQI47zCBYg"
  },
  "mABhwmE6tG9aq3hgWoOEEA": {
    "date": "8/28/2018",
    "text": "The vegan options are plentiful. I'm not vegan, but a burrito isn't the same without sour cream and cheese. I'm lactose intolerant and the bartender always recognizes me and knows my dietary needs. I only wish that this meticulousness would transfer over to their pick up and delivery. I've never had a reaction with those orders but the food is sloppily packed and the temperature is incorrect, that's the only reason I'm taking away a star. My in restaurant experience is perfect, the delivery and pick up not as much.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z2X6UcBt8oCcWF1l1LGY1Q"
  },
  "ZBKQOjCI1RdfiVJ7OZq8HQ": {
    "date": "2/6/2018",
    "text": "My friend and I just had Mad Mex for the first time and we loved it! We had it delivered via Grub Hub and it arrived packaged so neatly! The presentation was great. It was ready in about 15 minutes too! We had the Wingo-Rito and the Marinated Tofu Quesadilla with a side of corn bread and bean dip. The food was phenomenal! I can't wait to try more of their food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "A1rFFmTaBqUdXUzXDmwVCQ",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States. Mad Mex and movie night",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/A1rFFmTaBqUdXUzXDmwVCQ/o.jpg"
      }
    ],
    "user_id": "1o1M3BQxi_gtG9r5yHzW6A"
  },
  "rUA14J8j32HTMLDZBOqQDg": {
    "date": "12/1/2016",
    "text": "I used to LOVE mad mex - i don't know what happened - I still like it ok but now I'll really just go when I have a postcard for a free burrito like I did last night.  Margaritas (original on the rocks with salt) are always delicious plus we got a delicious fried tofu app.  Burrito (I get the mad mex with chicken) is always solid - not mind blowing but solid and hubby got the California salad with blue cheese dressing (usually huge and tasty) but last night had some dried out sprouts on top - a first and hopefully the last time that happens.  Our waiter seemed rushed and then was hard to find at the end so wasn't too impressed with him but at least I know what to expect food wise when come here.  I'm sure I'll come again but won't really be my first choice.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "U_NY7w6XfdPkTn5V2iw69A",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States. Pennsyltucky fried tofu - thumbs up !!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/U_NY7w6XfdPkTn5V2iw69A/o.jpg"
      }
    ],
    "user_id": "hjk--8VuDX3479_atPJQ1g"
  },
  "hFuJpD7U7_INfhiRjXsh_w": {
    "date": "2/10/2018",
    "text": "I've been to this location several times and it's always a pleasurable experience..great food, great atmosphere and great service! Only complaint I have is that it's fairly small compared to other locations which in turn means if you're going on a popular night you can expect a longer wait.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Oxk_fDMsizJRyIG53b9NkA",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States. Double protein shrimp bowl",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Oxk_fDMsizJRyIG53b9NkA/o.jpg"
      },
      {
        "img_id": "iCxBwwyOnaS_51WKnP3kVw",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States. Steak and shrimp fajitas",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iCxBwwyOnaS_51WKnP3kVw/o.jpg"
      }
    ],
    "user_id": "HrcHHVUryL3CIz5O5Uq2YQ"
  },
  "4AWJyfHXRrCjeDNg_ZKwWA": {
    "date": "6/24/2017",
    "text": "Bad. Three times I ate here. Three times bad food & drink, and lousy service. Funny how one restaurant in a chain can fail when a different location is so much better. I have had a completely different experience at the Shadyside location. I mean, Mad Mex food is marginal even for Tex Mex, but, the Highland Ave store, at least, made it look all right and had decent cocktails and attentive service.   I know what to expect from Mad Mex and this store doesn't even clear that so low bar.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "I_irwU6p_g0b2qx7a5AuIw"
  },
  "6lBhnxsElRKTmOFGmKqKTA": {
    "date": "4/16/2018",
    "text": "Ive always liked this chain and I quite like their South hills branch as well. It's a bit small compared to the other ones but I find their little outdoor patio cute. The margaritas are always on point. I love the options they have and went for the pineapple habanero when I was there last. It was a bit less 'habanero-y' than I'dv preferred but tasty nevertheless. The pickadippa where you get a 3 dip sampler is a great idea! Coz who wants just one dip right? The pepita hummus is definitely recommended and a slightly more healthy option and the guac's not too bad either. I ordered the potato taquitos for my entree which was simple, yummy and filling. They've lots of veggie options and almost everything on their menu can be made vegetarian. Service was good and I suspect our waitress had telepathic skills coz she seemed to sense exactly when we were reaching the bottom of our drink and needed a refill and would make it happen! Truth be told - Mad mex isn't the best Mexican food I've eaten, but it's definitely a solid option. I do wish they had the Seitan wings that's available in their Shadyside branch! I can't understand why it's only available there. Make seitan wings happen and I'll prolly find myself here more often than currently.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lW1TktK3EHQHn5otgb8D8g",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States. Potato taquitos",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lW1TktK3EHQHn5otgb8D8g/o.jpg"
      },
      {
        "img_id": "Z-5Fh7WzkY4YzCEc1S-dNQ",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States. Their regular big azzzz margarita! Yummmm",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Z-5Fh7WzkY4YzCEc1S-dNQ/o.jpg"
      },
      {
        "img_id": "aQ-TnbICKv9mnFRQw1Vhuw",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States. Pickadippa - Guac, pepita hummus and tomato chipotle salsa",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aQ-TnbICKv9mnFRQw1Vhuw/o.jpg"
      }
    ],
    "user_id": "2oeFc-L1Ow4UC_j_VOS_kQ"
  },
  "MthEkKBhHkCsyN8927xkvQ": {
    "date": "5/13/2018",
    "text": "I've gone to Mad Mex a few times a few years ago and didn't really care for it. I've had better tex-mex. I've decided to try it again and see if it got any better. I got a vegan veggie burrito, side of black beans and a side of waffle fries. Their fries are extremely crunchy and the perfect way I like my fries. The black beans were pretty spicy so I didn't care for them, I like mild tasting. The veggie burrito was huge and delicious. I didn't care for the vegan cheese and the roasted peppers. Next time I'll skip the black beans, vegan cheese and roasted peppers. All around it was a pretty decent meal. They definitely got better from the many years since I last ate at one. I'm not going to constantly eat here because, I Love True, real, Mexican food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CqBrxPACu1fP5bk5vA6jVQ"
  },
  "b-0VFZo0AtEj6E8lI6713g": {
    "date": "11/21/2018",
    "text": "Drinks took forever, appetizer came out first....without any appetizer plates.  Chips are horrible, plus who pays for chips and salsa!?!  Wait staff is super slow as well.  If you want good food and service, go to ToToPo.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q4_Ng2exl_PZXiEJwECKPA"
  },
  "6jKsuepyJ71aM815raOq3w": {
    "date": "10/12/2018",
    "text": "The people working here lack basic common sense. Ordered takeout and found all of our hot entrees packed solidly on top of the entree salad we ordered. Thanks for the wilted salad. Moreover, the portions for takeout are about half of that when you eat in the restaurant.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HWXWaxpmtwe_1ooJVfNi9w"
  },
  "q5LJ8ZqW0F1RjtyAAY9QGA": {
    "date": "3/31/2017",
    "text": "I have only been to Mad Mex once before, years ago (maybe 6 years), because the service was so bad. I decided to give it another try with friends. I arrived about 15-20 minutes late. Which is very late. I was expecting upon arrival, a delay on everything I ordered because of this and was not expecting anyone to go above and beyond for me. However, I did not get my margarita within any reasonable time and the server confessed that the bar tender did not see my order receipt. Refills on waters were not offered to others in the party as well.  I ordered mahi tacos, which after receiving them, were very very very good! I normally steer away from fish tacos but I am so glad I gave these a shot! I will order this again! I am very aware of how a restaurant works and how it becomes difficult to maintain a well functioning system when the place gets a sudden slam of customers. However, I did notice that one reason why our server was very absent from our table is that she had not only a table of 12, but 3 other tables on our side of the dining room and then was serving another clear across in the bar area. It didn't look like the table assignments were done right, or maybe someone didn't show up for shift. I would love to give this place another shot and see how the service is again. Mid-day rush is just not a good time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "-Qrg6EO96YrryxRT3UAmAA",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-Qrg6EO96YrryxRT3UAmAA/o.jpg"
      },
      {
        "img_id": "oBwr3lUf-pDih3sUIgEcPw",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States. Taco salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oBwr3lUf-pDih3sUIgEcPw/o.jpg"
      },
      {
        "img_id": "Kv02om3Bs2rqTYeKhM1qTw",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Kv02om3Bs2rqTYeKhM1qTw/o.jpg"
      }
    ],
    "user_id": "nzl2KyGKLtV7j8QEfOhC-w"
  },
  "C5M7v_-IV3CIOfAUizdajQ": {
    "date": "12/28/2014",
    "text": "Would you believe me if I said that I never ate at a Mad Mex until recently? I think this once again has to do with little me's disliking of Mexican-type foods and eateries. Fortunately, adult me has much better taste than little me, which means I get to enjoy Mad Mex in all of its glory now.  I've been at this location a couple times the last couple of months and it hasn't let me down yet. The first time I wanted to get in on the Gobblerito trend that half of my coworkers were enjoying during November, so I ordered that and a frozen margarita. Both were pretty darn awesome - I took half of my massive Thanksgiving burrito home and proceeded to eat nothing but that and more Thanksgiving food for the next few days. Most notable from that first visit was the fact that even though the place was hopping, the service was super quick. In fact my waitress came and asked about my drink order before I'd even opened the drink menu - it was just that quick. The kitchen had my meal ready super quickly as well and I was out the door in under a hour. Pretty darn impressive considering just how busy they were that night.  Since then Mad Mex hasn't disappointed. The service hasn't been AS prompt since then but it's certainly been reasonable, and the speed in the kitchen makes up for any order delays. I practically devoured my shrimp, spinach and mushroom quesadilla during my last visit - talk about a meal with lots of my favorite ingredients! Ingredients, I must add, which were all well cooked and seasoned and mixed together in the right varieties, resulting in a well-balanced and flavorful meal. I also remain absolutely in LOVE with their variety of margaritas, which are impressively strong and delicious no matter what size drink you order.  Really, my only complaint is their need to play loud background noise to \"set the mood\" for the place - I'd never want to bring a large group here because of the soundtrack they've got going. One or two people talking to each other over that noise is enough for me. But hey, as long as they've got good food and awesome drinks, I'll keep coming back, annoying background noise or not!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "peJLELhW71_iFTSGOSsAmg",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States. Spinach, shrimp and mushroom quesadilla with a sangria blur margarita, minus a piece of quesadilla.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/peJLELhW71_iFTSGOSsAmg/o.jpg"
      }
    ],
    "user_id": "M9TjYmTgHayJ22cNkyvW_g"
  },
  "XLKpGVihZ_xmHxu0_SdWZw": {
    "date": "8/16/2014",
    "text": "We have been to Mad Mex several times and always have a tasty Mexican meal. The restaurant has cool Mexican inspired decor and atmosphere. The music is very loud and can be hard to hear at times. Food is delivered quick and service is adequate.   All dishes are large in portion size. My favorite dish is the mahi mahi fajitas. They are delicious and always enough for more than 1 meal for me. Guacamole is just ok, salsa has a nice spicy kick. They have many options for vegetarians as well as gluten free and vegan which is nice. The one thing they don't do is give free tortilla chips which many other Mexican restaurants do.   I'll keep returning anytime I'm in the mood for good Mexican food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "mm9WYrFhiNqvHCyhQKw3Mg"
  },
  "jkX7l_eoJ9sFWrosqBDRvg": {
    "date": "3/25/2018",
    "text": "Went here with my wife for lunch. Not at all busy on a Sunday afternoon. We sat at the bar and were the only bar customers. My drink order of a Diet Coke arrived flat and tasted disgusting. When I asked the bartender for a replacement she replied that she'll get it from the back since it's better in the back...I asked for the manager because if it's a known problem why not fix it AND why did you serve me from the front fountain if you know it's better in the back.  All the manager provided was to confirm the bar fountain sometimes is defective and it's the customers responsibility to let them know if something's wrong.  After a listening to her excuses and apologies we decided to go elsewhere. Totopo in Mt Lebanon is a great choice",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MDDDyzYYbQYQS6Jsr_9kmg"
  },
  "rKxhmNPlqvKITKoClGm5xw": {
    "date": "9/26/2016",
    "text": "I am a huge Mad Mex fan but had never been to this location. Given the current Liberty Bridge construction, this was the easiest one for us to get to from Mt. Washington.  I went on a Friday night around 6:30 with my husband and some friends. We put in our name on the No Wait app, so we didn't have to wait long for a table, which was nice. The Gobblerito came back this week so the place was packed. The parking situation here is a bit odd, and the location is hard to find. Luckily my friends knew where it was. There also isn't much space inside to wait for a table. Luckily the weather was nice, so we waited outside.  The food here, like all Mad Mex locations, is delicious. All of my friends got the Gobblerito (and loved it) - I'm a vegetarian so I got the tofu tacos, which are always delicious. The service wasn't great - we had to ask for water refills and he just wasn't super attentive. But I think we just got a server who was overwhelmed.  Also, always get the pick-a-dippa! Lets you get three dips/salsas with unlimited chips. And their margaritas never disappoint!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_oNthTV94Evx9qGkJOTXLQ"
  },
  "Vv8eGrvwK_27hquJwjhsAw": {
    "date": "8/4/2015",
    "text": "My boyfriend and I loved Mad Mex so much that we came back within a week of stopping in the first time! I absolutely loved this place. My first order was the grande nachos and they were amazing. Their ingredients always taste fresh!  You can read more about my love affair with Mad Mex on my blog: <a href=\"/redir?url=http%3A%2F%2Fkaylablogs.com%2F2015%2F07%2Fmad-mex%2F&s=e123b64b3b63d760db771f43c305ae4c134da676ec680599704ae876ae5d677c\" target=\"_blank\" rel=\"nofollow\">kaylablogs.com/2015/07/m...</a>",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6PX75fZEXrjIot0BC09Srw",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States. Grande nachos",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6PX75fZEXrjIot0BC09Srw/o.jpg"
      },
      {
        "img_id": "s0yt0Lr9qZNF2ihb9GshfA",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States. My face says it all!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/s0yt0Lr9qZNF2ihb9GshfA/o.jpg"
      }
    ],
    "user_id": "WfywKHUOxQ6AVJa8Q-luvQ"
  },
  "2HiSJopP0QwIH-4Sce6MuQ": {
    "date": "1/20/2017",
    "text": "This is our go to place when we want to get out with the kids.  Love the menu and that they have been adding seasonal items like the kale salad with winter vegetables, so good!  The kids always enjoy their meals and my husband is never disappointed with the black beanie quesadilla!   Solid place that always delivers a great dining experience!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dgP72Ww5Ngk8Dz5mNjNWaA"
  },
  "tGfmzkGtTjLIfXkefl6jRQ": {
    "date": "5/30/2018",
    "text": "Always on point with food and drink. They care and it's important. Great drink menu too for local beers. Steve is a great bartender.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6jX9FXWuRYw8QMo73-0UCg"
  },
  "_Y61nNr8rLo8br_0RFI8Zg": {
    "date": "10/14/2017",
    "text": "If I'm basing my review on the food,  it would've easily been 5 stars.  I ordered the gobblerito and it lived up to the hype.  My two margaritas that I ordered were really good. After sitting at our table for about three hours we decided to move to the bar and the bartender there was great. Greeted us right away and was friendly and attentive. Overall it good night of food and drinks for myself and my two friends.    However,  the service we had during our dining experience left something to be desired. Service was slow all night.  I can understand it was slower as we got there around 6 when it was packed. However,  as things slowed down in the restaurant the pace of the service did not pick up. Our waiter was not very attentive. After waiting 15+ minutes for her chips and salsa, my friend had to wait for our server to come check on us and inquire about her order as he seemed oblivious to the fact she hadn't received it. The second margarita I ordered (frozen) was given to me on the rocks.  He fixed it after my friend was able to get his attention. Drinks were slow on arrival all night. To finish up the night,  I was incorrectly charged on my credit card.  I was charged the amount of my friends bill. She paid that same bill amount with cash. It was (hopefully) fixed (I'm waiting for the changes to show up on my credit card statement) once we brought it to our waiters attention. However,  I'm not sure how that happened given that I had my credit card and bill on the clipboard and my friend still had hers since she was paying with exact change. Perhaps our waiter was new. Maybe that table all the way in the back gets overlooked.  Either way,  I hope the next time I'm in the service is better!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rxOt4Nlo64-_FlZpwhtoxg"
  },
  "177dCesMWBdelK6BpCYIbg": {
    "date": "1/30/2015",
    "text": "Not so great.  The whole place needs a bit of a scrubbing.  It's kinda greasy.  My menu had dried up food splattered on it.  It's dark in there, too.  I've never been to a Mexican joint that didn't give me table chips (as in free).  So I bought chips.  And they were stale and broken up, like bottom-of-the-bag stuff.  Off to a poor start.  My food was decent, but not stellar.  My server was weak.  Slow, and snarky.  And I was there with my wife and kids.  Thanks very much...  Finally, it's a touch overpriced for this kind of food, and way overpriced for the quality of experience.  Will not be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yVMvS4Q7JTxHALm8CTwSZQ"
  },
  "ejz-dxsxbpGd9Z-Kpxa_sQ": {
    "date": "5/14/2019",
    "text": "Yesterday was my first experience at this mad mex location and it was a good one. The restaurant is slightly hidden at the very end of the strip of stores. There is plenty of parking at lunch time.  We split the pick a dippa- with the black bean dip always being a fan favorite. I ordered the soup/ quesadilla lunch combo. This was the first time I had a shrimp quesadilla. It was super good/ highly recommend.  Our waitress was nice and fast. Very reasonable prices at lunchtime. Not sure when I will be back at this location because it is so far away from me but I won't count it out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HvDBT2whHCalPX7eWgmrqw"
  },
  "6J6BFep76ft8sAD7OvW89g": {
    "date": "10/6/2018",
    "text": "I only really go to Mad Mex for their gobbleritos once or twice a year. It's basically basically a burrito stuffed with thanksgiving food, covered in gravy, and it comes with a side of cranberry sauce. Somehow I manage to eat the entire thing every time because it's just that good. My friend and I both ordered apple cider margaritas this time, and they were awesome! I love their fall specials, and I definitely recommend trying them out.  The only complaint I have is about the service. When we walked in things were SO busy that the hostess couldn't get to us in a proper time. I don't blame her because things were chaotic, however the annoying part was that so many other workers passed by all of us. There were 3 groups of people waiting to be seated and at least 5 or 6 employees all looked at us and kept walking. Maybe avoid this location at a dinner rush on a Saturday.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "WuFgtNBFVIzOs-2FTTQXOg",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States. Gobblerito",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WuFgtNBFVIzOs-2FTTQXOg/o.jpg"
      },
      {
        "img_id": "hIXMDMqALVMvXK1nCO2erA",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States. Apple cider margarita",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hIXMDMqALVMvXK1nCO2erA/o.jpg"
      }
    ],
    "user_id": "jhm1OR3WVUpk_hBTi4Fh3g"
  },
  "B6PIztt0CQ2eN6ZrUMo-JA": {
    "date": "8/22/2019",
    "text": "It's really good!!! Would recommend to friends,go visit 22 times, and has fabulous waiters. I'm no person to complain about this because it's just downright perfect!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DhPp3CKTWMvqAIzbHSBrUA"
  },
  "mV-Hr3wBZ566nIMbKLP_lw": {
    "date": "6/22/2018",
    "text": "Mad Mex is one of my favorite spots for margaritas. The original Big Azz Margarita is my go-to, and there are tons of fun flavors if you want to spice things up. I also love getting the chips and salsa trio.   They've also switched up their menu with some fun taco options, and we tried the fish and steak tacos, which were both delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eGJDD4j7JddtHe-sH84GIQ",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eGJDD4j7JddtHe-sH84GIQ/o.jpg"
      },
      {
        "img_id": "7DXsbaNsF7trc7WVrVaMvQ",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7DXsbaNsF7trc7WVrVaMvQ/o.jpg"
      }
    ],
    "user_id": "bcf5X_2LTrCw-s4YPsCmKg"
  },
  "kKpUAJa6UpXuW_b_z9577Q": {
    "date": "2/26/2019",
    "text": "So what do you do when you get home really late from work and have not planned anything for dinner.  You go to Mad Mex and use your gift card.   The decor is typical Mad Mex, kind of funky and fun. Our service was great.  The place was busy but did have some empty tables.   Decided to skip the nachos and dip and just had Spicy Mad Mex Burrito with flank steak.  The burritos are large at Mad Mex and it was well prepared and tasty.  My partner in indulgence had the fish tacos and was able to eat all three..darn thought I would get one for lunch tomorrow.  So if you are looking for a fun, funky place with some fresh Cal-Mex and some other infused favor options give it a try.",
    "rating": 4,
    "rated": {
      "funny": 7,
      "useful": 17,
      "cool": 16
    },
    "photos": [],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "DW5tUK4ixdq4T7Ecrp7HlQ": {
    "date": "2/27/2018",
    "text": "I had never been to Mad Mex but when I learned they had healthy options I decided to give it a try. Basically it is a sit down restaurant. I was given a lunch menu on top of their regular menu.  I had a very friendly waitress and we discussed healthy options. I learned that I could order the burrito without the wrap and it would come in a bowl. You can pair it with a soup or salad. I opted for the portabella mushroom burrito and a side salad that comes with vegan ranch dressing. Lunch prices are very reasonable and you can get a descent meal for under $15.00.  I was glad I decided to forgo the wrap. I thought the lunch portions would be smaller but in actuality you get the same size. My bowl burrito came not only with delicious portabellas but also with lots of black beans seated on top of a bed of rice. It was very good but I knew I couldn't finish the rice. The salad was also good and I loved the vegan ranch dressing.  I noticed on the menu that anything marked with a \"v\" are usually vegetarian but can be made vegan upon request at no extra charge. Since I had a medical apt nearby the place was fairly empty and service was prompt.  Mad Mex is a Mexican chain restaurant you would find throughout the Pittsburgh area. This one sits at the right far end of Scott Towne Center. They have a few parking spaces clearly marked for customers and some for pick up. You can easily hop on or off Swallow Hill Road that it leads to and head back to Greentree Road without having to go back to the main entrance of the strip mall.",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 15,
      "cool": 13
    },
    "photos": [
      {
        "img_id": "xlbGdg_q3kXRSnOKf4GUPg",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States. Black beans are so good!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xlbGdg_q3kXRSnOKf4GUPg/o.jpg"
      },
      {
        "img_id": "0hwxEBzCYjIZnFk_RwbFmg",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States. Portabella mushrooms burrito with vegan cheese",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0hwxEBzCYjIZnFk_RwbFmg/o.jpg"
      },
      {
        "img_id": "RVikxNBG_kkzJ7C6mwIDcw",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States. Salad with vegan chipotle ranch dressing",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RVikxNBG_kkzJ7C6mwIDcw/o.jpg"
      }
    ],
    "user_id": "fmzIm7RxEdii5Jz44PtO7g"
  },
  "c8hu80ltziH1oNKt8PhREg": {
    "date": "11/24/2018",
    "text": "We came in for dinner and encountered an EXTREMELY RUDE hostess named Noelle. Our party included 4 adults, and 3 children under the age of 4. Check out the pics below, but the dining room was half empty, and we were told that we would have a 45 minute wait. Noelle proceeded to be rude to a member of our party when we asked if we could be seated in the mostly empty dining room.   It was a completely odd experience, although our waitress Alisha was lovely and super helpful.   We will be sure to NOT come back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gr-1_zZ_98d_6eyqa-u3kA",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gr-1_zZ_98d_6eyqa-u3kA/o.jpg"
      }
    ],
    "user_id": "P8n-MNBXD5KHUISKZrrW7g"
  },
  "KS3vJC5MKY_2yiJ2YrJEgg": {
    "date": "6/30/2019",
    "text": "Always have a great meal here even if service can be sketchy at times. Always will return. I did deduct a star cause on their menu they have a cry baby under the Yelp name. Thought that was rude. Why be nasty about it? Yelp isn't your enemy of your a good establishment!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "svIRLln-6OtWMu7Ag_s6wA"
  },
  "QPHmMWF-iijXvjD0K-i0DA": {
    "date": "5/9/2019",
    "text": "I love Mad Mex and this location has a great outdoor section to eat at when the weather is nice! Love the wing-o-rito, wing-o-wrap, and their boneless wings! Their San Fran sauce is awesome! The Queso is a bit spicy so if you're not expecting it watch out. The guacamole is very good. If you love thanksgiving and its that time of year look for the gobblerito, you won't be disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5cuAGCmSZrT510080HNGWA"
  },
  "nhLfo6130hGba2o6-HEdOw": {
    "date": "5/16/2019",
    "text": "Had dinner there today. We've been there many times. It always takes a long time to wait for your food to be served at this place. Today it was even worse. We waited forever for food, for some additional napkins, for boxes, and for the bill. My little one went in very happy but came out screaming and crying because the dinner just took too long. The waitress needed for ever to do anything. It was a terrible dinner.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B31Rj3wd4dCT9rTFEsgkaA"
  },
  "lu74h6qOeoS96gz_TElObg": {
    "date": "11/13/2018",
    "text": "Perfect for friends or family. My wife and child and I had dinner here Saturday night and were extremely satisfied as always. My wife ordered the Gobblerito as we prepare for Thanksgiving. She loved it as always. Huge portion. I ordered a limited time offering. San Diego style burrito with french fries steak and chicken inside of it. After our trip to San Diego a years ago I've been looking for something like this. I couldn't eat the entire meal it was so big. Absolutely wonderful. The wait staff was attentive and kind.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "J7LhrynNpHnAk8VpuvzzIA",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/J7LhrynNpHnAk8VpuvzzIA/o.jpg"
      }
    ],
    "user_id": "m3-4KVeXDkKMjYdFqA2Prg"
  },
  "7RnHRd09pumAVPourBgS6A": {
    "date": "9/17/2017",
    "text": "Mad mex is one of my favorite chains and I really like this location.  The servers are always very personable and work hard to make sure you have a good experience.  I really like the atmosphere inside as well, the lights are dimmed everywhere except right on the tables, which puts the food in the spotlight.  For appetizers we usually get the dip trio and go with the guac, regular salsa, and queso.  The guac is great here, my favorite is the pineapple guac.  The salsa is average.  I am not a fan of the queso.  I think it is too spicy and doesn't have much flavor.  However, a lot of my friends are obsessed with it so this may just be a personal taste thing for me.    My go to meal here is the buffalo wing tacos.  The sauce is really what makes these.  It is a different kind of buffalo sauce and I am not sure what exactly is in it, but it goes perfect with the tacos.  For my side I usually get either the waffle fries or cornbread, both of which are great.  My wife usually gets the fajitas or the goblerito (if in season).  These are both must tries.  They also usually have seasonal drink options which can be very good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qvVPAJD9kYCNwYtvEsDMog",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States. Queso, regular salsa, and pineapple guac",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qvVPAJD9kYCNwYtvEsDMog/o.jpg"
      },
      {
        "img_id": "0Xxcw7jinu-5juPg7NX55A",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States. Cornbread",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0Xxcw7jinu-5juPg7NX55A/o.jpg"
      },
      {
        "img_id": "GRDVwdVbdQUukrgjTx2pYg",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States. Buffalo chicken tacos and waffle fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GRDVwdVbdQUukrgjTx2pYg/o.jpg"
      }
    ],
    "user_id": "1u80DXuswfp7hFW2NN9B-Q"
  },
  "Ms2D1s02RTqfgHgaW6Z_Rg": {
    "date": "2/3/2018",
    "text": "We like Mad Mex and this location is a solid 3 stars. The location isn't the largest in the Pittsburgh area, but they don't appear to get super busy.  We tried this location at about 7:30 on a Saturday night and there wasn't a wait and we were sat right away.  The food is good and the menu is the same as the other Mad Mex locations.  Pros: The food is good The service is prompt and friendly  The place is clean  Cons: The parking can be tricky as the plaza it's in is busy",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7J6tPUjl4iJWBd8rPH3-Xg"
  },
  "hZAwVCFQwPmcN409gOlUeA": {
    "date": "5/10/2017",
    "text": "I don't have a recollection of what past experiences here were like, so I decided to check out their dinner after my eye doctor appointment a few doors down.   The restaurant was mostly empty, not surprising as it was a weekday and only 5:00. We started off with the chips and salsa (ehhh- the chips weren't fresh the original salsa was HOT! I didn't expect it) and a small order of the southwestern wings which were half price for happy hour - their only happy hour food special. The wings were incredible- I haven't tasted a sauce like this but I can only equate it to sort of a salsa verde but amped up with a lot of cilantro. Definitely worth trying!  My boyfriend got the carnitas quesadilla, which he enjoyed, and I got the Street Corn & Steak Tacos- sooo good. The steak was cut into bite sized chunks (slices would have been better) and it was topped with grilled corn, cotija cheese, chipotle aioli (omg amazing), and red cabbage. The tacos were excellent and more importantly the steak was cooked to my liking (medium). The side of beans and rice were easily forgettable, nothing special about them.   The Churros we got to-go were good but odd; they are soft, not crunchy, dough stuffed with a Nutella-ey chocolate spread and they gave us a container of honey and a container of cinnamon sugar. The honey was just weird; of course they are limited by what the menu items are supposed to look like by the upper management, but the churros should just be tossed in the cinnamon sugar with no honey. They were still pretty good, but not worth $6 to me.   Awesome decor, good food, and our waiter (Andrew) was outstanding, and the reason I gave the review four stars instead of three. If you visit soon ask for him - he was one of the best waiters I have ever had! He was friendly, attentive, helpful, and easy to talk to; you could tell he was sincere in asking if everything was cooked okay and made sure that my boyfriend's meal didn't have onions and that they added a side of the tomatillo sauce he wanted to try. I'll definitely be back just for his service.   Side note to Mad Mex- no 'taco Tuesday' specials??? That's so weird to me!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "o34CvKXaNTy-JVm2HMjvLg",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States. Corn &amp;amp; Steak Street Tacos- the chipotle aioli is awesome! 5/5 tacos, 2/5 rice/beans.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/o34CvKXaNTy-JVm2HMjvLg/o.jpg"
      },
      {
        "img_id": "k-9PL2VeN1v-hrrJIQE-aA",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States. Southwest wings - sooo good and 1/2 price on weekdays 4:30-6:30",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/k-9PL2VeN1v-hrrJIQE-aA/o.jpg"
      }
    ],
    "user_id": "3xSglGfW0ZxtJp0vbv3NhQ"
  },
  "AxYmTJf7TGRT7qfvpEZ-CQ": {
    "date": "1/30/2019",
    "text": "Love this place for fajitas.  Always my go to is the steak fajita and add on the shrimp.    Cool atmosphere, smaller place but always a great meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WiD0FRG6E2esk-8plNgYdQ"
  },
  "cjhT-jNlcPM_Z0Gok2O0qw": {
    "date": "9/27/2017",
    "text": "I met some folks for lunch.   It is that time of year where Gobbleritos are in season.   They are phenomenal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "JgOcyMF1lTwSVCarSZrrrA"
  },
  "Sjk7qFhPqgNLlP6_KgH3hg": {
    "date": "5/19/2018",
    "text": "In Pittsburgh trying to find some form of Vegan menu is not always easy.  Found Mad Max and found a square burrito.  The Veggie Burrito was great.  Fresh and solid flavors.  Can't help the water overload from the cooked mushrooms and zucchini but flavor was still there.  If your expecting authentic Mexican food don't come here.  It's Tex mex so know that and you'll enjoy all Mad Amex has to offer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dnof725IP5eaRSivt_JCcA",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dnof725IP5eaRSivt_JCcA/o.jpg"
      }
    ],
    "user_id": "QbXuvbFSSuJZbQROM44tLg"
  },
  "oiHbkUiHCMwwq3nvaBUrsw": {
    "date": "7/29/2017",
    "text": "What can I say about chain restaurants? They never expand their menu and it's the same ole thing.  On this particular Friday the place was packed and the service was good. The food was fairly good but quite frankly I think Chiptole makes a better burrito at a much lower price. The cornbread is to die for bar none. There's NOTHING special at mad Mex to keep me craving more.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Ci7FP9Qh_Kw21Doy9WCYA"
  },
  "dflvKruskjKGAV4gest5Hg": {
    "date": "9/22/2018",
    "text": "Went for dinner this evening with my husband and son. They no longer offer free chips and salsa- it's now $4. My meal was by far the best and most cost worthy. My husband loves their wings, however, they were $10 for 7 wings! They weren't even the full wings. We felt like that was pricey. Our son got kids nachos. We had to ask for his sides and dessert that he got with his meal. The waitress was \"fair\" at best. Felt like they were trying to be skimpy on our meals. I do enjoy their decor and vibes in the restaurant itself but I think I'll go elsewhere next time.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jy6lIYlzDls0-knY789PSg"
  },
  "LpBxybBeXFoL7V6tT636pw": {
    "date": "12/15/2018",
    "text": "Mad Mex has the BEST chicken mole enchiladas, a Mexican staple. So cool that now they even have a non alcoholic marg options called the Nad a Rita, so great for conservative fun. I can always count on Mad Mex for a great playlist including many of my favorites including great covers of songs by miguel. Great ambiance and lighting, makes a great spot for blind dates, surprise marriage proposals, or even a casual get together.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "E2kw2CMCNVYU16dt4cLuOA"
  },
  "twbbW9IOcPv5epV_WyrHiw": {
    "date": "6/11/2011",
    "text": "While visiting PA some friends took me here for some authentic Mexican food and it was great!  The guacamole dip is yum and the burritos are HUGE!  The chips are a bit small and broken which makes it horrible for dipping.  On Fridays they serve what they call Big AZZ margaritas that are pretty good and compliment the meal.   Everything was great and I will return!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dYeMRJic1d_f8flbacX_Cw"
  },
  "M_J06obTmPuAeKdgzlst5w": {
    "date": "12/7/2010",
    "text": "Perhaps our mistake was going on a Sat.night in the summer .Who knew it would be packed to the gills with thirsty college students.  Loud is an understatement. We were crammed into a little table the four of us elbow to elbow with the diners seated on both sides.  This already has put me in a bad mood.I never did well in Europe sharing my table with stranger and in the U.S it irks me even more  It took forever to get our drinks of simply water and soda.  We at last caught our waitresses eye and was told should would take care of us she guessed.....? What the heck she was the same waitress who took the drink order and was delivering the food next to us.  When Ms.Wiffty finally brought our long awaited food it is totally the wrong order.We even considered asking if we could just keep it because we had waited so long, but no off she went to leave us for another 20 minutes.  What we got at long last was so disappointing.  It tasted no better than Taco Bell anywhere in America.Think nacho grande with a side of Guacamole. First and last visit.We did notice on the bill she gave us the wrong check .It was for half the amount of food we ordered and was probably some poor guys check.We waved her over .Her reply was just leave the money on the table I'll come by and get it later................  So we did.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "x22llLkqJas2J9VTJVNk3A"
  },
  "AMWaW4TwvYwOnpScnCKoBg": {
    "date": "8/16/2010",
    "text": "I read a few of the reviews of Mad Mex and quite a few reviewers called their food Tex Mex and I don't see it that way. I see Mad Mex as more Cali Mex with the accent being on fresh ingredients, healthy cooking, and excellent service. The black bean soup is almost fat free and the best I've ever had. (try it Joe D style with a dollop of guac on it instead of sour cream) The lime cilantro salad dressing Is amazing, I've had it on the grilled portobello mushroom salad for a meat free meal. The grilled fish tacos are every bit as good as the famous fish tacos in San Diego. The fish is grilled perfectly, plenty of home made guac, pico, and sour cream accompany this dish. The beer list is a who's who of some of the finest micro brews across the states, including many IPAs which are rotated monthly. You can watch the bartenders squeezing fresh fruits and melons for their huge line ups of margaritas flavors. This little Pittsburgh gem of a restaurant is now opening locations in other cities like Columbus and Philly. There are many locations in the Burgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZTVf4tjVU78WA3nVGX_1OA",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZTVf4tjVU78WA3nVGX_1OA/o.jpg"
      },
      {
        "img_id": "Lg7qzUJLB3HqOMuQVe5QBw",
        "caption": "Photo of Mad Mex - South Hills - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Lg7qzUJLB3HqOMuQVe5QBw/o.jpg"
      }
    ],
    "user_id": "UsmTxWbobLsI6WR1Db0W7A"
  },
  "l2govbB2CtEpgMR-LODMsw": {
    "date": "10/8/2013",
    "text": "I took my niece here last week for lunch and we enjoyed our food.  The guac was really good.  They gave us a lot, and we both had enough for another dinner.  When I was eating my left overs, I came across a piece of wood in my burrito...probably a piece of toothpick, but it was a turnoff and I threw the rest of my food out.  I deducted a star for that.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WOcdhPc9V4ZZ6Ywyp4zO0Q"
  },
  "rJZO8O_aqy3fGsFOprLUpg": {
    "date": "8/2/2007",
    "text": "I totally forgot about Mad Mex. They have a good menu, not that I would eat much of it. They have a great Bike night, getting hundreds of bikes, but not Harley's.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "M3My5CtVoToHpDH0HcbhmA"
  },
  "yon_zIEYnxSvxluwpAWxng": {
    "date": "12/14/2012",
    "text": "I went to mad mex for dinner on a Friday night. It was very noisy and I do not recommend for kids. The chicken fajita was over cooked, dry, and charred. Everything was overpriced; drinks, entrees, and dessert.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1JkSEaxPjRvDHFn6GXBtNg"
  },
  "uwUiUX_l3F-CbN8sATJWig": {
    "date": "1/4/2010",
    "text": "Great margaritas and decent veggie options. Not the best Mexican food, but you don't have a ton of options in Pittsburgh and this place will have to do. The staff and bartenders are always nice. I've always had a great time during happy hours here and keep going back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wJ_p-pNm-TgY3ZSeiw3S0g"
  },
  "m7GaV5xyQhH8xJ8D8sCDDA": {
    "date": "5/29/2007",
    "text": "the big burrito group knows how to do food. This place has margraritas that will do amazing things to you. Watch out or else you can end up in vegas getting married by the end of the night. The food is great, especially the carnitas enchalada. the san fran buffalo wings are a must paired with a cold Pacifico.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9rkf2NYu3r06U6LpndhleQ"
  },
  "M1mifsDBtH0tr40lgzj_QA": {
    "date": "12/23/2009",
    "text": "Hit or miss on quality and ambiance. I have had great service there before, stellar food, a great time at the bar, and then there were the times with a rock in my bean dip, cold food served, and service that was non-existant. The last time I went (Nov -09) everything was just peachy, so perhaps they have ironed out the kinks. Food is good, creative, and filling. Happy hour prices are to be sought out for drinks.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Op2hFnY8W9TyE7cjF2M6LQ"
  },
  "ClIC5-VJ97Qc2SmsFTqqtw": {
    "date": "4/20/2012",
    "text": "staple \"american\" mexican food in pittsburgh  black bean dip the best anywhere (spicy!!!)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yeQ_7p0DoGcHtRC71mE60w"
  },
  "ukKnNqaWVKAsuqbV1DPuHw": {
    "date": "3/19/2012",
    "text": "I have always had a hit and miss experience with Mad Mex.  I love the fact that they have a great beer selection, but the food sometimes seemed expensive for the quality.  Last Saturday night the wife and I went to the Greentree location, and the food was very good.  My wife had a spicy chicken burrito, and my grilled fish tacos were fresh and full of flavor.  Of course, wouldn't you know we had a waitress that simply forgot about us.  No tea or water refill, no interest is selling me a second beer.  Oh well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1EvFI88LpHlfH4guaOtSrQ"
  },
  "vCvS6YxknI0QanwEe4LYMg": {
    "date": "1/3/2009",
    "text": "I am sad to report that Mad Mex will no longer be making my very favorite dish: the three cheese three pepper enchilada. Or, so I was told by the waitress on December 28, when I was lucky enough to pass through Pittsburgh over the holidays. Boo hoo. I am sad.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xZLBbfOEu0D9ui5TOSmeBQ"
  },
  "vvxeQ6wRSy_qlNkqMQ0jvw": {
    "date": "1/9/2011",
    "text": "Such a fun place! I love that there are so many vegetarian options! They also have dedicated vegan options, but I have not ordered them. I thought I would mention it here, because my vegan friends have such a difficult time with restaurant food. The margaritas do not taste strong, but  they are!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8s0UVoGPjVqbBOg85lprxQ"
  },
  "5FEwoJ6Q34C9ZYlfmUNjag": {
    "date": "1/31/2013",
    "text": "Burritos are huge! Margaritas are good,  and they have a good selection of tequila!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dKa12_fEaqYSKnIYwOCYiw"
  },
  "j1NPZKXQDOiGrSfvtVyJkQ": {
    "date": "1/27/2011",
    "text": "Do they still do the half-price late night menu here?  That used to be clutch.  Margaritas are solid and the food is good. They actually steam their burritos, so the tortilla is super-soft and warm.  Like the salsa here too.    All the way down Atwood, this place caps off a string of good multicultural restaurants.  It's the most fun of them all.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N6IhlQC0xbDw5POuTAepPw"
  },
  "lopuM_VBysRd2uwkvRnmGg": {
    "date": "7/24/2014",
    "text": "We got take out from here last night, and their steak quesadillas are amazing! They are a little on the expensive side for take out, two quesadillas and chips was over $30 but the food and packaging was good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zCCoyKfJxdvU0XPq6GL3YA"
  },
  "30LnZXHLYXl8Obbc_80afg": {
    "date": "8/22/2015",
    "text": "The food is great, but the service is very slow for being such a compact place.  My last two visits I ventured to the bar twice to get a beer after waiting extended periods at our table. My wife and I both ordered a beer and they took 16 minutes to arrive! :(",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "daD8AiFPtdGjhlaS259sJw"
  },
  "DFc8ZOBYA6XaSPHnv2SuRA": {
    "date": "5/31/2012",
    "text": "I don't understand why I keep wanting to go back here. Maybe it is the large plate of food and blue corn bread that comes with the Carnitas Enchiladas, my preferred dish. Or maybe it is the kiwi margarita during happy hour, even though it gives me heart burn. I always leave this place thinking the service was mediocre, the food was standard, and that I probably should not have ordered 2 margaritas. I usually feel so stuffed I walk out like I am being pulled from my stomach. I usually need to sit in my car for a few minutes before I can drive away due to how stuffed I feel. I hate feeling this stuffed but I always order the Carnitas Enchiladas and never finish it.   Also, their chimi is frozen. I once asked if they could not put in the mushrooms and they revealed they freeze them, claiming this needs to be done to deep fry it. Not sure how truthful it is, but being a chain and freezing meals is not what I like in a restaurant.  The noise level in this place seems to be high, as in blasting pop music so loud it drains out other tables' conversations and makes you shout to the person in front of you. This is more often than not, yet sometimes it is not that loud.   They have outdoor seating which I say I want every time but when I peak around the corner before entering it reminds me of an outdoor bar or party. People standing at their table or over the fence railing with their drinks chatting. Not the atmosphere I prefer for dinner.   Some notable mentions are that the black beans are spicy, just how I like and the kiwi margarita is very tasty.   I give this place 3 stars because I feel it is mediocre and standard. Plus I always walk away paying more than I want, or think they deserve.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "23iK1BzCGKMeEJwv_z_f8g"
  },
  "SOj6dp8QP16-mlUua23TeA": {
    "date": "8/27/2012",
    "text": "This is a short review because all locations of Mad Mex's food are consistently above average.  I work nearby this one, but one very important piece of information must be shared is that almost every item SPICY.  This does not matter to me, but my colleagues often gripe about it.  It's probably about a 7 or 8 on a high of 10 Spice-o-meter.  None of the other locations have a similar level of spiciness. Otherwise, one item that sticks out is the carnitas burrito if you are lucky enough to order when the meet has just completed cooking.  Unfortunately, I cannot tell you how to time this occurrence.  I ordered it one day and the bartender told me that I had timed it perfectly.  He was right.  It was probably the best burrito I've ever had at a Mad Mex.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xT5Rp0Jx6FrOfbVzixECvA"
  },
  "DRBnIZ6v4iMvs7Xpiiczrg": {
    "date": "2/17/2015",
    "text": "This place is great and veggie friendly.  The tofu appetizer is incredible and the wait staff are all super friendly,  it isa a must have whenever I visit Pittsburgh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "92Kf67o-T-D_STFBzgTfHw"
  },
  "HR6PQwatnFe1SDHCF8bTTw": {
    "date": "7/20/2010",
    "text": "Spent the weekend and Pittsburgh and started out Friday night at Mad Mex for Happy Hour and some dinner. Happy Hour was a pretty good deal with half price wings and cheap drafts. The wings were good and the beer selection is above average.  For dinner I had the carnitas enchiladas (i think). It didn't taste bad but I definitely had better Mexican elsewhere even elsewhere in Pittsburgh.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sf_zGR8Lu9kf9VYn0tw1CQ"
  },
  "DGD-mXHRt4ppwQAz7ipCKg": {
    "date": "6/21/2009",
    "text": "If you're a hardcore fan of authentic Mexican food, this is probably not the place for you.  The enchiladas remind me more of chilaquiles - definitely more layered than rolled.  The burritos are huge but it really drives me crazy how segmented they are.  One bite will be all rice, the next will be all meat.  The tofu tacos are okay, but the bean sprouts seem like a weird addition.  I know, you're probably thinking \"What DOES this girl like about Mad Mex?\"  If you can let go of any previous Mexican food experiences (or if you've never had Mexican food before, as I hadn't when I first went to Mad Mex), some things are ok.  The tofu tacos minus the bean sprouts.  The California grilled salad.  The chickpea chili and black bean soup, the potato taquitos.  Nachos, chips & salsa, and guacamole are all decent.  Their sides are ridiculously huge and the desserts are all ok (except the sopapillas).  Basically, stick to the least authentic stuff and you should be fine.  Additionally, some of their entrees are available with your choice of either chicken, steak, shrimp, portobello mushrooms or tofu.  They have tons of vegetarian options.  They have good happy hour deals and good late night margarita deals.  They have raspberry, strawberry, mango, and kiwi margaritas year round, with one or two seasonal flavors per month, plus a full bar, a bunch of tequilas and a huge, varied beer list that tends to focus on local beers.  So basically: the less you know about Mexican food, the less disappointed you will be.  If you're a fan of authentic Mexican food, either stick to something more basic like a salad, or pick a different restaurant.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "HT97z29oIH7aA8UxlGHeGg"
  },
  "uzKhu2tatMceiDkUhcy06g": {
    "date": "6/21/2009",
    "text": "I wanted to pipe in and give a more favorable review of this place. I have loved going here for years!  I will agree that it is not for the authentic Mexican experience - but because they have a good variety of tasty food and drinks.    I usually go to the Robinson location as it's near my office.  It's a lot more spacious than the Oakland location, which can feel a bit claustrophobic to me on a busy night.  (Though late nights there are fun with half-off food specials after 11...)  I like getting the chips with different dips.  The Yucatan Bean Dip is to die for, and the Dos Equis queso dip and fire-roasted tomato chipotle salsa are also great.  For entrees I usually go with the fish tacos or one of the quesadillas.  They have great lunch specials too.  I can get a huge quesadilla and a salad with their delicious lime-cilantro dressing for like $7!  Good Happy Hour specials, too, on margaritas and drafts.  Authenticity aside, I've been here a million times and I know I will be here a million more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "-c_t-8ORqOZBuKE-jdY8aQ"
  },
  "G70RTdfZyARL04VUdQ31pA": {
    "date": "7/20/2012",
    "text": "The fajitas were really good!!  They tasted a little different from most places.  Service at the bar was very slow and they weren't very busy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FB-VypPy39q5UOo0FMOr1g"
  },
  "fK5J8IsTvt7pw97oDaTFCA": {
    "date": "9/18/2014",
    "text": "While I LOVE Mad Mex, this one is to be avoided.  For whatever reason, they always seem to manage to mess up orders and on a couple of occassions, I've just not felt well after eating there.  Because it's a BB, I just keep thinking I had to be wrong about that.  But after waking up in the middle of the night with all sorts of unpleasant stomach issues, I've had to write this location off.  Go to Robinson instead... (Or BB, please, please get a new KM for this location!)",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AXJJBEnqAfvU6gYjzCVh9w"
  },
  "Ja4tbaA5zND1ACsPJV6VtA": {
    "date": "3/12/2010",
    "text": "Awesome.  Great margaritas. Pineapple habanero salsa and black bean dip FTW.  This is not traditional Mexican by any stretch, and that's a good thing.  It's more of a tex-mex style.  The portions are big so expect to take some home with you.  Other reviewers mention the food being hit and miss.  My mom lives nearby and I make a stop nearly every time I'm home.  I've eaten here more than a dozen times and never had a \"miss\".  Enjoy flipping through the menu looking for their little comedy gags and puns!  The bar gets crowded and closes at midnight.  It's too bad they don't stay open later because it could be a great suburban hangout when you don't want to mess with traffic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "85uM-cor3VXCUyVFEe0YNg"
  },
  "gZ7FsFhfMkTT-h1rlNlGQg": {
    "date": "8/2/2011",
    "text": "Incredible food, very diverse choices.  Waitress had 5 star teeth.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z4VFIl3amIZJ9bb8aKL1Lg"
  },
  "zXdDqF54hkOBLsErZOyzvg": {
    "date": "8/18/2012",
    "text": "Love Mad Mex.Cool place to hang out. Great food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7wmjkbq-iTG1_z62fgnvoQ"
  },
  "3SsqYFJD233yhnxTEas3gQ": {
    "date": "8/11/2012",
    "text": "A bit of a spin on normal Mexican fair.  Service is hit or miss depending on who you get.  Food has tendency to be cold sometimes and takeout orders are often wrong.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mI51fB4hsfCzK_7w3A0KDQ"
  },
  "VY_t7JBUGCO6zctNKjJcSA": {
    "date": "1/5/2008",
    "text": "Great mexican food and margaritas ... and in Pittsburgh of all places!    Big burritos which will really fill you up.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L0hIDvoJUMNHSK_vEWGiFA"
  },
  "tWUti3n_d9dvypsytbw_HQ": {
    "date": "8/20/2012",
    "text": "It's definitely americanized but it's really good. They make it a fun place too. The one in Robinson is fun to stop in for a drink.   We went to the one on Greentree Road and had the potato taquitos. Awesome. I had the Mad Mex Burrito and my wife had a salad. The food was above average and our server was friendly.   I like the decor too. It's different, but still very tex-mex",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WSJpTw7sFqO4Dg5O-Q2iDQ"
  },
  "WR6S2FPhlsJ0fqg2LPU7Aw": {
    "date": "7/25/2011",
    "text": "You have no idea how badly I WANT to like this place. They are incredibly vegetarian/vegan-friendly. I just haven't been impressed by anything I've ordered there. Even the chips and salsa aren't terribly good. I do like the bar-- they have great sangria-- but that's about it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0qbki8EIeJndXajubFOIhQ"
  },
  "GD1VB4zocgj2GuuBhXUQRg": {
    "date": "12/14/2013",
    "text": "This place is okay. The waiter was horrible and barely checked on us. The food was also not too good. It was very bland and didn't have a lot of taste to it. I will not be coming back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KvQXCPMf4TyLbjHZ2OyH_Q"
  }
}