{
  "4fbcgEtMYhTglLSowcI-5A": {
    "date": "1/15/2015",
    "text": "This is the only racist bar in Pittsburgh! I was there with my American friends and the bouncer or some idiot who worked there just came up to our table and asked me to leave. When I asked why, he said he didn't need a reason. Then my friends argued with him and said he can't do that and then he says that I was drunk and so I have to go. We had just had 1 beer that night! I was completely ok! And even if I was drunk, I was just sitting with my friends and talking. That's no reason to throw someone out of a bar! I left and decided never to go to this piece of crap again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "d7mWTz8o5b1C5PpqaZ_5uA"
  },
  "BSlhgLXHPn8y3iPXuGcWuA": {
    "date": "8/28/2011",
    "text": "We continued our search for a fantastic brunch in Pittsburgh by trying Brillobox today.  One major bonus for Brillobox is that brunch is from 12-4pm Sat and Sun, which works well for us who love to sleep in!    Brillobox wasn't crowded for brunch, we were greeted very soon after we sat ourselves and got coffee and water.   I ordered the Huevos Rancheros, black bean tortillas topped with sunny side up eggs, salsa, and sour cream.  My fiance ordered the B Box Scramble, home fries, eggs, and veggie of the day (asparagus) scrambled up with cheese.  Decent menu, although I wish there was more to choose from.    My fiance received his dish first, and I was told that our waitress accidentally dropped my dish on the way out.  She was extremely apologetic and brought me some grapefruit to tide me over.  No big deal for me, I was happy with my coffee and the He-Man movie that was playing above me on the projector screen.  Surprisingly, my dish came out just a few minutes later.    My dish was good, noticeably freshly made with fresh ingredients, just maybe missing something.  It could have used a little more flavorful salsa, or maybe some fresh herbs.  Eggs were cooked perfectly, though.  Portion size was reasonable.  My fiance liked his B Box Scramble, although he wished that it had a meat option.    I will definitely try Brillobox food again, next time for dinner, since I've heard they have the best mac n' cheese in town.  Plus, I'm always impressed by their beer selection and reasonable prices. Our brunch came to 18 bucks total, which is the cheapest brunch we've been to in Pittsburgh so far.  Overall, a pretty decent experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7FdGMEHdKa_nH7NWQOI3pw"
  },
  "cEEDHBBQPu5FjmmA3tlt4A": {
    "date": "10/23/2013",
    "text": "Totally different vibe depending on when you go...   I really enjoy Brillobox around dinnertime, and I also had a pretty good brunch there once. But I've been many times for dinner and drinks, and I really enjoy it. The atmosphere is relaxed and informal, and the food is quite good, especially for bar food. Tons of options for vegetarians but also good burgers and pulled pork for meat eaters. The menu shifts over time, but has been consistently good over the years. The SALAD is one of the best dinner salads - it's not just lettuce, unripe tomato, onion and cucumber; instead, they've got mixed greens, shaved broccoli, carrots, peas, tomatoes, nuts, cheese, etc. in a giant portion for a good price. Very substantial and a nice mix of textures (also has a great fresh herb-y dressing). I also love the vegetarian banh mi - yummy strips of marinated extra firm tofu, pickled vegetables, spicy sauce, and aioli on a nice baguette with a side salad or chips. The mac and cheese is wonderful and creamy with a mix of tasty cheeses - one of the best I've tried in the city. The fries are also satisfying, and they come with 3 or 4 great dips. Great beer selection, and a good cocktail selection. Overall, solid place to drink and eat, and the price is right for a casual weeknight.  On the other hand, late nights are often hot and crowded with hipsters. Crap beer is served in plastic cups and both bars get crowded so you may have to wait awhile before the bartender notices you unless you get pushy. The sound quality has been pretty bad for live bands. But all that's pretty typical for a late night at a popular bar! Some of the events are really fun, and they feature a varied lineup (some more crowded than others).   So... take your pick - there's a little something for almost everyone!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vsa4nLi9LJb-j4Vo6Y6h8g"
  },
  "y_RhYOQnlOiDnf0juRH5Ew": {
    "date": "11/22/2011",
    "text": "This is one of my favorite bars in the city, but I choose to go other places when I'm trying to meet up for a chat (it can get REALLY loud here, even for a bar) or on a night where there's a really crowded event.  The bartenders are friendly but sometimes don't talk to you at all, from my experiences. Sometimes they're up for a chat or recommendation, sometimes not at all. One night I tried to order a beer and was told \"we're all out of that one\" and walked away and came back 5min later to ask me what I wanted. Kind of weird. I've seen them throw hissy fits behind the bar when things go wrong or someone makes a mistake. Um, okay.  The beer selection is amazing, always good local crafts and seasonals on. Pretty affordable and what I would recommend. I've had some good cocktails here too, but I always think of it as more of a beer bar.  Wednesday night trivia is very fun but expect a full night out for it - you have to get there early to get a seat/bar/table space and you will be there for a long time, so grab some beers and those amazing fries with the dipping sauces.  The venue space is also really cool, and the dance parties and live music events upstairs generally turn out to be a fun, packed crowd of people.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "rg5SpALaZpXlu1yCiMl1HQ"
  },
  "jtDRFPIXjjrUZ-oCyWWspQ": {
    "date": "3/6/2013",
    "text": "I love Brillobox! This is with no doubt my favorite dancing bar in Pittsburgh! I always make it on the first Friday of each month for Pandemic night when the awesome DJ \"Pandemic Pgh\" plays amazing global music!! The crowd is pretty diverse with a majority of hipsters. This Pandemic party takes place in the second floor, and they frequently have good bands playing upstairs. The first floor is more like a chilled bar with diner tables andtasty food! very vegan/vegetarian friendly too! Drinks are inexpensive, and bartenders are decently nice. The only downside for this place is the restrooms!! There is only one upstairs and it's a unisex restroom and it's been pretty gross every time I was there!  This is a downside I would overlook because the rest of the place (music, food, drinks, atmosphere) is simply awesome!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "W_QmmtOEBdFTKyDLyfvIZQ"
  },
  "Nc2IkP221m50MboqkUHIDg": {
    "date": "5/7/2007",
    "text": "Great place on a weekday night, as weekends are too crowded for my liking.  Hosts/ed great Pgh bands like Girl Talk and Black Moth Super Rainbow before they made it big.    Good veg fare as well, try the veg reuben.  <a href=\"/redir?url=http%3A%2F%2Fwww.brillobox.net%2F&s=74e94f118092e04bb98560a64ec9485818b234adf163a7c33c082ad4a1cceddd\" target=\"_blank\" rel=\"nofollow\">brillobox.net</a>",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xddBxalWgnfI6IUxzFAaFQ",
        "caption": "Photo of Brillobox - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xddBxalWgnfI6IUxzFAaFQ/o.jpg"
      }
    ],
    "user_id": "otCGq7DjX08YJFChnRhLaQ"
  },
  "qURqFHwNn_ZVEMhnY2Q-uw": {
    "date": "6/18/2015",
    "text": "I hate it here. Super hip rude customers and everything is extremely over priced. I bought  beer and mac and cheese and ended up spending $20. Some of the staff is nice and hospitable, but the majority are all just as rude as their stuck up customers. If you want to have a successful bar for young people, then maybe you should treat your customers with some respect. Everyone that works front of the house at Brillo needs to stop taking themselves so seriously and start being better people, not just employees",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "e7YbF7gEXMW0tvSmjGSnPA"
  },
  "xkJXr5JyhV2vUFR6ZY4jLA": {
    "date": "4/5/2014",
    "text": "A nice place to go and have a drink or a bite to eat.  They have a selection of different cocktails.  They have a garage type door that they open up when its warm out, I thought that was nice.  There's an upstairs where bands can play.  They don't serve wine",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ahl7wBbav9ZoBrvwi3vyew"
  },
  "9hbTcH4kjMdOvxwL0i9FVQ": {
    "date": "11/12/2014",
    "text": "My advice to the upstairs bartender: take a deep breath, sit back, and reassess your career choice if working at a fun, packed show in a cool city is that much misery for you.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "TFVIE7qp7V3N9qwQAfBg7A"
  },
  "_SrOWiZ3k5nHH7EFZGvBTQ": {
    "date": "3/26/2014",
    "text": "Yay! Found another place in Pittsburgh with GREAT cocktails! I loved the Veggie burger too! I will go here many many times in the future :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uy6dw6-sBxpxuZvHpPb8iA"
  },
  "1iVRESkPfD7Eu_3txgoxtw": {
    "date": "9/4/2011",
    "text": "Brillobox is a great little bar across the street from the beautiful new Children's Hospital in Lawrenceville.  They have a garage-door style front wall that opens up to the street.    I've been here a bunch of times and always enjoy their excellent beer selection.  They've got about 15 taps that are constantly changing.  I don't think they order much of each beer, because it's always a completely different selection every time you go.  If you love changing seasonal beers like I do, it offers a great opportunity to sample seasonals from breweries from all over the country.  Both the bartenders and servers are very knowledgeable about the beer.  They're great at describing the choices and making suggestions.  There food is pretty tasty.  I've only had apps, but the wings and hummus and fries are good.  There's only 2 bad things I can say about Brillobox:  they don't open until 5:00pm and they're not open on Mondays.  Brillobox is a great neighborhood bar with a particular focus on excellent beer.  It is another example of the amazing Renaissance that has taken place in Lawrenceville over the last few years.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "9VDrCkfj0I_MDSDPgsPKFA"
  },
  "26Leh0rQuWoo7sX7A6Fymg": {
    "date": "9/24/2011",
    "text": "Went out to Brillobox on Friday night for the first time, and I had a good time! There was an excellent selection of beers, both on draft and bottled. The drinks were reasonably priced, and my mojito was delicious and extra strong. My party also got some french fries that were damn delicious. I'm serious. Probably the best fries I've had in a while. I think they had some kind of curry/garlic seasoning? And there were three delicious dipping sauces. Next time I want to go for food because the menu was veg friendly and looked delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "kYJbHYkHrk5-DVNhXnt-8Q"
  },
  "fSp-S5jW8BP9kmpycVebzA": {
    "date": "6/24/2013",
    "text": "It smells like a dive bar in ocean city - dirty and sweaty. There are only 3 toilets for males and they're in the most inconvenient places - also dirty.  The beer is pretty cheap but don't expect an abundance of the usual domestic beers. I would never try the food considering the cleanliness.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "x73WsQgb2p-Uhi4xY1Buaw"
  },
  "DQ4sj079HsuwefE-85zRJA": {
    "date": "5/20/2011",
    "text": "This is by far my favorite bar in Pittsburgh. The staff are unquestionably the best staff at any bar I have ever been to. They are approachable, fast, pour strong drinks, and above all they are extremely patient and courteous.  The drinks are cheap, and well made. The food is great. The upstairs works nicely as a show space and dance floor, and actually has a good sound system (a rarity for sure in Pittsburgh). As an added bonus, it's non-smoking.  Don't ever change, Brillo.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "z2z5H-a7bkRISDr_VXI9Tg"
  },
  "WOZUqsbD8FqfePl-HIfSZA": {
    "date": "1/2/2012",
    "text": "Usually I like the set up of the place, the interior tree branches and lights decorating the bar.  This time I found the paintings/photos they chose to display to be creepy and they definitely went overboard with the santa decorations and christmas ornaments.  Which might be a plus to others.   I honestly don't know where hipsters come from, but they seem to congregate here.. if you're looking to mingle with any this is the place to come.  as is much of bloomfield and lawrenceville.    My friend was playing oldies songs at brillobox on a sunday night and we ordered a few appetizers and many drinks throughout the night.  Sometimes the bartender is extremely busy and alone which sucks.  They have a great selection of beers and I felt lame ordering a yuengling so that I could stay within my budget.  They also had the church brew works on special for 3 bucks.    On sundays they have a vegetarian dinner for six dollars, most recently it was saag aloo.  They have a korean bbq sauce which isn't authentic by the least and is way too salty.  Their menu is eclectic and includes vietnamese bahn mi along with other dishes.  I would order their fries which are a well seasoned huge portion if you just want something to snack on while drinking beer and cocktails.    I'll probably edit this review as I frequent this place more often, some of my friends live a minute walking distance from here.  It is a fun place to hang out and talk with friends.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zAzCOnCSS1DiceIWXKQQWw"
  },
  "bi5bhv0OlGd8TXOt9MyCUQ": {
    "date": "1/21/2014",
    "text": "The food was really great! The staff was friendly and attentive. I had the Brillo burger and my friend had the hot brown. Both things were tasty and came out in a timely manner. It has a great atmosphere and we will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5hieCXeeuKcNG45PmpHcsQ"
  },
  "twuyax44lf0g9nbc3qx-iQ": {
    "date": "9/14/2011",
    "text": "This place was maybe my favorite stop in Pittsburgh.  Cool atmosphere, wish I'd have been able to make a show here.  Got the Bahn Mi, and for a mayo-hater like me they offered to replace with some straight Sriracha.  Awfully nice.  Also, the folks needed our table for the DJ and so they comped us our drinks for the \"hassle\" (really wasn't an issue).  Would absolutely go back, next time would make it a point to hit a show.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xEzPJcx5Ny6NLm0p974dJA"
  },
  "iHhn3TYPcac1x4P-bLG-iw": {
    "date": "5/15/2010",
    "text": "I've been here several times to see live music, and although amazingly loud, it's a good venue. Music takes place upstairs, but downstairs the bar is a little quieter and has a pretty large selection of beer including local favorites like Big Hop from the East End Brewing Company. The food here is actually awesome - nice appetizers, and locally raised, hormone free meats. The chicken sandwich with bacon and side salad was excellent. A fair number of veggie options as well.   Brillobox is a non-smoking venue which raises it's appeal for me!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "2ZZNOoMQ7WFvFoxDUFw1wg"
  },
  "AlkskmkSLZH2-YWJEl4Tzg": {
    "date": "3/23/2011",
    "text": "Brillobox Brillobox, let me count the ways! 4 stars overall 3 stars for my Birthday night!  For my birthday celebration I decided to come see my friends in action from Boston at the Big Hurry CD release party. J and I arrived before the upstairs band room had opened for my Jersey Shore themed Bday bash! I was Snookin' for a good brawling time! I had my cupcake carousel in tow and a Birthday Tiara sparkling! I have to say that I like to schnook about and this hipster haven wasn't vibing with my goofy Jersyness. Hey it makes me laugh and honestly who cares that much? I'll tell you... hipsters surely do with their piercing snarky looks! Luckily I could give a damn and I did what I do best and focused on my FUN!  I have frequented the Brillobox many a night and I have to say I always have a boppin' time. Come on, Pandemic dance party! Super FUN! So to get back to it, they let us go in before the crowd because of meeting with my band friends and the platter I had on me. However very grudgingly I must add.  I really dislike that there is no seating whatsoever. Lame! I was put in the corner of the bar all cramped and the bartender just wasn't very friendly about my cupcakes at all. They bar wasn't set up and we were fine waiting but when the time came to serve, he ignored us! We waited forever and he clearly knew we were there first! NO problem! I sweetened him up with a mini cupcake and he warmed up and gave me a free drink. Maybe he even flashed me a smile after that. The event sold out and you couldn't move at all. The band was ON, I danced and drank, met new friends and had a great Par tay experience. One thing that did suck was that the show sold out so quick so some friends that I had invited couldn't get in. The early bird catches the scenester I guess  On a side note, J had come to visit me from Cbus and this is where I planned our first date, watching some live music, sitting in a booth talking and laughing makes a fine lighthearted, low pressure 1st rendezvous!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CbmNBkKa9QKNxPiN_whFUw"
  },
  "SYCVMN4CBSo8yIfRW5HZIw": {
    "date": "4/7/2011",
    "text": "Great atmosphere, drinks and staff make this watering hole set up by refugees from New York one of the best bars in Pittsburgh. The downstairs is the main bar area. It's a nice layout that get redecorated fairly regularly. Only drawback is that it can get really crowded on Pub night (Wednesdays) and  weekends. On weeknights, you can usually get a seat at the bar or in a booth. Even when it's busy, though, the bar staff is quick with your order. Brian is an amazing bar tender. Maybe second only to Tim over at Gooski's. They also have a good brunch on Sundays that is open 12pm until late into the afternoon.   Upstairs is basically a variety hour. You can stumble upon almost any kind of music there. A week after seeing the Cults play a 4,000 person venue in Amsterdam from a balcony,  I saw them on Wednesday one person back in the upstairs in Brillo ($8!). Amazing.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XG6Km0GdawTHwZqpP5TfqA"
  },
  "l2hQOBkA8nBeKqbaIu4raw": {
    "date": "7/12/2015",
    "text": "I had the seitan bites with a bourbon BBQ sauce - absolutely amazing. I hear the Banh Mi's are very, very good. There are many different beers on tap. Even on a Sunday evening, it was still pretty lively and loud.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nw97_9RQOHnoo4Vkzim_Dg"
  },
  "crDedH1swlcGqB-1UwCpNw": {
    "date": "6/19/2012",
    "text": "First, a few things you should know about Brillobox. Conveniently situated at the corner of Penn and Main, it was once called Nooners, and then Zooty's. Both were safe havens for morning drunks, pitstops for killing time on the way to the methadone clinic, and hangouts for sightings of the infamous Lawrenceville sweatpants hookers who were shabby-chic in the way that your creepy Uncle Lou's basement gameroom is.  But in late 2005, the '224 started blowing up in a big way, and a New York couple bought the bar and converted it to our beloved Brillo. From that point on, it was destined to evolve into the libations palace for grad students, UPMC pediatric surgery residents, and 1890s moustache fetishists that you know and love today.  Along the way, Brillobox went through an all-too-brief adolescence that was equal parts awkward and beautiful. Notable patrons from its 2006-2008 era included tap pants-clad American Apparel employees en route to the Greenpoint lofts they'd bought with Daddy's money, 30-somethings who preached the importance of tolerance and diversity as they strove hard to shut down Brian & Cooper's Mini Mart because it brought black people into Friendship, and a motley crew of aspiring Rimbauds, Kerouacs, and Burroughses. That last group was alcoholic. Very, very alcoholic. And they smoked like chimneys and they danced like fiends, and they gave that place character, goddamit!  Then, in the dawn of the 2010s, Brillo made its final push toward adulthood, and as all emerging adults do, it made a few bold gestures to demonstrate that it had finally arrived. First, an all-vegetarian menu, designed to delight the meatless denziens of Penn Avenue. Secondly, a smoking ban, to win the approval of yoga-loving bike nuts and stay in compliance with new state laws. And finally, a remodel, enabling the front windows to open in the summer so the sweet sounds of Goldfrapp could be heard as far away as the DaVita Dialysis Clinic.  Now, Brillo's okay. It has a vast beer selection if you love beer. The bartenders still mix the drinks strong, and the service is decent, if a little slow when the place is packed. On weekends, the downstairs room can get loud and crowded, and if you arrive after 9 PM, you probably won't be sitting. But in its evolution from burnout wino bar to upscale microbrew pub, it lost a bunch of character along the way that probably won't be coming back (although the meat has made a triumphant return to the menu).",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "ja77OL6xb4C0m8VnuEaDyA"
  },
  "cX0-Vn--GxHWmAikGDXG1A": {
    "date": "3/12/2012",
    "text": "Solid brunch. The seven of us trickled in slowly but surely after a long previous evening and made our first orders. Some went with Guinness, I tried to order a Bloody but they were having to search for a key ingredient so I opted for a Breckenridge Vanilla Porter instead (get one when you see it, they're deeeelish).  Food menu for brunch is limited, but what we had we all loved. I went with the chicken hash which is really more like an open-faced pot pie or a Shepherd's pie without the mashed potatoes, and is served on croissant halves. It was about as decadent as it sounds, yes. My friend's blackberry French toast was ridiculous (more tart than sweet) and the guys that ordered the salmon omelette were all very pleased, especially with the cumin on the potatoes. Good call, Brillobox.  I hear it's loaded with hipsters as night falls, but this particular Sunday it was wide open and sparsely populated. The bartender was also the server and was just busy enough to cause delays and empty glasses, but it was nothing we couldn't get over with another round of drinks.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "3gE3_MDUsCg-Tay4t1R5nA"
  },
  "nv3LgvKeOYADCcBOYHp8ig": {
    "date": "4/3/2013",
    "text": "I've been meaning to visit this place for quite a while and I finally made that happen few weeks ago on a Friday Night.  We directly ended up going to the 2nd floor since my friend wanted me to check out the scene/music. They did have a $5 cover charge. Draft beers were served in a plastic cup. I felt like I was in one of those college house party. To sum up the upstairs - it's somewhat of a dive version of Firehouse that used to be in the strip. Diverse Music with yet Very diverse crowd.  The downstairs restaurant/bar section had a very good selection of draft beer. Make sure to ask for a sample before ordering since some of them are really strong. I ended up switching my RYE beer. Didn't get a chance to try the food since we couldn't find a place to sit but that's definitely on my list the next I happen to go there.  Whether you're into dancing or drinking, this place definitely has the option.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fBO-AauqOjPX2UBp9RgeQQ"
  },
  "gjRxah5QXFK414AyxBg0sQ": {
    "date": "9/8/2014",
    "text": "Great bar! good drafts selection, nice staff, good events! Top 3 venues in Pittsburgh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EDpARScG-X4LTTpeszVmWw"
  },
  "BnmaWDgS9wnGI0_P2e86wQ": {
    "date": "5/31/2015",
    "text": "My 2nd time at Brillo Box was better than the first.  The bartender was super friendly and my food was good.  The service was actually better than average.  The sound in this place is awesome when bands play.  I'm upgrading my opinion and adding another 2 stars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iAUl8Y6D7e9RNpLjvRCDdg"
  },
  "VE2o_hWXMBtLKRdsiWKoog": {
    "date": "3/2/2012",
    "text": "Friday night and there are children (5-7 year olds!) running around, we ask the bartenders about this, and they say there is nothing they can do- it's up to the owners. Obviously it's the parent's extremely bad decision (plus lack of enforcement? aren't there door guys to check id?) , but just beware- you could come in for an after work drink, and feel like you are in the middle of a daycare. And no one will care (except you!).",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "zRH2w3Jh9FuikiqI4BBzWA"
  },
  "Z1ff6nVwuJD7FDDDESy_QA": {
    "date": "8/18/2011",
    "text": "Oh, Brillobox.  Normally, I enjoy your Wednesday night pub trivia.  We've never cracked the top three, and I've learned to ignore how long it takes you to grade the two rounds.  You have a great beer selection, a good crowd and really challenging trivia.   The beer and the atmosphere typically make up for your slow service and limited and overpriced menu but last night your customer service really turned me off!!  An accountant, especially a stone-cold sober accountant, looks at her bill.  When I questioned the extra beer on my bill ($5.15) instead of giving me attitude, throwing the disputed cash on the bar, making a scene and making me feel guilty, you should have just said sorry about the mix-up and credited my card.  Your error was understandable given that there were only two bartenders/waiters on a crowded night but the way you treated me was not.   I won't be recommending you anytime soon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 10,
      "cool": 0
    },
    "photos": [],
    "user_id": "89R0mC9DUwc-P1UCoh8s6w"
  },
  "nHeXwPznDxA1zKFiYTC9Vg": {
    "date": "6/21/2015",
    "text": "We went to the Brillobox for the \"Title Town Soul & Funk Night\"....well....let me just say, if you are expecting it to be the songs you remember from the 50's, 60's, 70's and 80's...don't waste your time. The music was a hard mix of songs you never heard of but they sounded like a song that you might recognize; played entirely too fast for the original beat. I was disappointed the DJ didn't have the basic Motown funk and groove that I came up with; he didn't even recognize the names of some of the groups from the era of funk & soul; his mixing was at times pieced together poorly.....he needs to work on his skills. But if you don't care about real funk and soul music and you just want to dance like no one is watching or just want something different to do on a Saturday night, go early it's a cheap cover charge and leave when you've had enough.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W_7287izZTNrKaa6BbsGTw"
  },
  "gywVpBawLOZucONIJqdd6A": {
    "date": "8/2/2016",
    "text": "Their veg options never fail and I love that I can always depend on the big screen at Brillo for political coverage and news",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xHPiNyj8XEs55TOkgjEDFQ"
  },
  "SSMWlm8FDXP1RGIUOk0eNg": {
    "date": "4/24/2015",
    "text": "The service is great, the atmosphere is cool. Cluttered, but great seating options for a group. Bartenders could present themselves better. Reminds me of what I look like hungover and forgot to shower. But hey, if that's cool then that's cool. Food is really good. I DON'T SEE ANY LOCAL BEER ON TAP!!!!!!! Not cool. But some places still gotta learn.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YMKr24B2oBr_X-d2raXSGA"
  },
  "0tdeJp14a205PTRrZdaVMQ": {
    "date": "11/11/2012",
    "text": "After dinner, I came here with my friends one night for drinks. We grabbed a booth and just enjoyed good conversation and the atmosphere.  I really liked this place. They had a nice selection of beers and had mixed drinks and liquor as well. The music was good and it wasn't too terribly crowded.  We went on a night where there wasn't an event going on here so our waitress was on point. She came by to refill our drinks and was just really on top of things.  I really like the ambiance of this bar and would probably come back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dvAXqNtZHuxLgTIyTC4omQ"
  },
  "YyjQP5nG7KR-F5hwNqG7Gw": {
    "date": "9/22/2013",
    "text": "Service was absolutely terrible. The servers should be more respectful to customers, she actually took a condescending and negative tone towards patrons attempting to give business to the establishment. Not a friendly or welcoming atmosphere.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "ydmnqBSNb48ViyqdIXJweQ"
  },
  "4IWEoC6LLr7n6rsv_jaPAw": {
    "date": "2/7/2014",
    "text": "This is THE hipster bar to go to, so make sure to wear your skinny jeans and suspenders! Although I have to be in the mood to go here, I generally have a good time. I generally avoid Saturday nights because the place gets way too crowded. The interior is probably the coolest of any place in the city, and there's always a cool band or show upstairs. The drinks and food here are a little pricey, but the beer selection is good and the veggie food is really tasty. Trivia on Wednesdays is a lot of fun, so bring a group of friends and you'll enjoy the night.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2oTG2GrBpikkonRxQywI7Q"
  },
  "GuI0PYL-_7Gf_6pFcQeQFw": {
    "date": "12/28/2011",
    "text": "Since my first review I've found the volume to be a lot better, but it still depends on the night. Brillo is good on the weekends, but GREAT for weeknight drinks.  I liked when we asked the doorman if upstairs was crowded and he shrugged his shoulders. I mean if there's one person in the entire place that would know, it's this guy. And we weren't looking for an exact number - Honestly he could have just lied, but the fact he didn't say anything was lame.. but also kind of awesome.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EpZFiJxo6RO8a6QwDwC7TQ"
  },
  "K4tpoLbAqdN0hHaho3ooEQ": {
    "date": "8/26/2011",
    "text": "Hipsters come here for drinks and nourishment. They also groove to cool music upstairs and occasionally have concerts in between looking at themselves in the mirror.   The best part about the hipsters in Pittsburgh? They are real hipsters. Not these fake 20 something babies flitting around in expensive clothes....no. Honest to goodness hipsters go here.   So, if you like to dance with boys in tighter jeans than your own, you're in luck. Brillo will provide just that, and cheap beer! Go get one now. They're waiting...",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "g0EQGDEVFl4DMN6jfarJFg"
  },
  "4wwq4QQjMqNr1PNvqkZ3yg": {
    "date": "5/2/2013",
    "text": "The people who work here are seriously the lowest of the low; rude and hostile to customers, terrible at actually mixing drinks, and not observant when you go up to order. Not to mention the fact that one of the bartenders refused to serve me saying I was 'pretentious' while another bartender has cornered me multiple times and tried to kiss me - I wish I was joking, but these are the types of people they hire. The entire place reeks of sweat and lack of ventilation, the floors are sticky, and the bathrooms unbearable. All this sort of makes sense given the place was started by a guy from NYC who believes that intrusive and boorish employes can be counter-weighed by hipster decor. I won't be returning.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 1
    },
    "photos": [],
    "user_id": "509vDZBDzdByWwNY-SH3IA"
  },
  "1KjT0jc9s4YiHNqy1wSFTQ": {
    "date": "4/4/2011",
    "text": "The many reasons I like brillobox (despite its hipness), in no particular order:  - I always, and I do mean always, meet interesting quality people there. My group of friends consists mostly of smart, funny, and all-around rad people that I've shared a booth with at brillobox.  - They make a brilliant martini (sorry for the weird Britishism, but drinking their martinis somehow really does make me feel a little smarter and sassier) and at $5.50 they're a steal.  - The bartenders are friendly no matter how busy it gets. Go in there on a Friday or Saturday night and you won't find harder working drink slingers anywhere in the city. There's usually only two people manning the bar, but considering how packed it gets sometimes, the wait is pretty short.  - Their frites ($6) are shoestring style and awesome; they come with curry ketchup, garlic aioli and chipotle mayo.   - The rest of their menu is well-priced pub-grub and the kitchen serves until 11.   - The upstairs dance floor and adjoining bar sometimes have a cover for live bands or djs, but it's generally reasonable and on occasion their dance party themes are pure magic (Sweet Lovely Death: A 1970's punk dj dance party, I'm lookin' at you).   - The atmosphere is relaxed. There are a handful of giant gawdy paintings that are truly ugly, but they're balanced out by bright-red wallpaper and cute dim lamps that create a mellow ambiance and make it look sort of like someone's fashionable Godmother died and left them all her stuff.  - Their beer selection is humongous.   So, I guess when I die I'll have to haunt brillobox, but there are worse ways to spend eternity.",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 8,
      "cool": 5
    },
    "photos": [],
    "user_id": "KidcYew8ArXQStKOMjQ7JQ"
  },
  "em93kceybg3EU4cDFAU4Pw": {
    "date": "10/18/2012",
    "text": "I visited Brillobox for my second time a couple weeks back. My friend and I were on a monster road trip and we stopped in for dinner on one of our nights in town. We got there around 9:30-10 and walked into a night of pub quiz. We did not participate, but the music they were playing along with it was pretty great (\"Gilrs on Film\" by Duran Duran and \"Cool It Now\" by New Edition are 2 examples).   I had a pretty tasty hamburger and my friend had the bbq beef. Hw seemed happy with it. The waiter was attentive and we had a 2nd round of drinks pretty quickly.   I'm particularly fond of the decor of the bar, all red, flocked wallpaper and ravens here and there. The first time I went, it was much less crowded and I was able to get a cushy booth. This time, it was bar stools, which was fine.  The crowd was a bit younger and more hipster than I remembered. This isn't a judgement or points against the place, just an observation.   All in all, I'd recommend Brillobox. The food is tasty and pretty cheap, the atmosphere is groovy, and the crowd is fairly accomodating.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KmKC1eX7AqPGVKsQJrFtSw"
  },
  "RVJ_Vl9EAeCIwU1NkWKfrQ": {
    "date": "7/26/2011",
    "text": "Brillobox is like Kelly's, taken to the extreme. Whereas Kelly's is hipster, in the \"let's drink good beer and include everyone and play indie music\" sense, Brillobox is \"let's drink good beer and play music no one's ever heard of.\" Whereas Kelly's has normal mac and cheese, Brillobox makes theirs with nacho cheese.  Brillobox is admittedly over the top, but I love it. It's a small, intimiate atmosphere, and the music is great. Trivia is really the best reason to come though - it's hard, and the teams get really into it. FInally, drink prices are reasonable, and they will actually come to your table (if you can snag one) to bring you your food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "mtGmYZ-k2YIqrVh0ek6ecg"
  },
  "fULiUlOOjGmdDQn_i-RSGw": {
    "date": "2/21/2010",
    "text": "Five years ago, I'd have loved this place.  Now, I enjoy the brunches but roll my eyes inside, at the sullen service (which is still reasonably good).  Their Sat & Sun brunches are beyond excellent - I recommend the Eggs Benedict, French Toast with cherries or the Breakfast Panini.  It's a little pricey, but ultimately worth it for decent food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "oyLJ6P3EwPZhfwVClagvzw"
  },
  "vW0rfH42TeRnoYaj-zrLiA": {
    "date": "2/15/2011",
    "text": "I had one of my best nights ever at Brillobox.  I don't live in the Burgh, but I will make a point to return here in the future.  The band was great, the sound was good, we got hammered and made friends, we ate, we didn't spend a ton of money.  This place has a nice, chill vibe and they seem to bring in and allow for uniqueness in their live music acts.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O_-4xX-JfhDm6S4guIPNdA"
  },
  "XMOsda92lVi9qExgVAnMYg": {
    "date": "1/19/2011",
    "text": "It's a great place to run into people you might know. I am sad they don't have the tangurittas anymore. Good selection of local beers but not cheap. Food is great. The MAC and cheese is awesome. And the fittest.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q0Bs5ObN4w2U5WHs2gLsPA"
  },
  "YbSAypPjmqe9G7NZN0E8fg": {
    "date": "4/24/2009",
    "text": "I touched Jeff Mangum here. Automatic 5 stars.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 5
    },
    "photos": [],
    "user_id": "1hqTXgFc8P_vohOVL65CMw"
  },
  "vBX6LlcmoDiwuAAeoGLyFg": {
    "date": "9/11/2007",
    "text": "This bar is really well done. It is also a hipster's paradise on Penn and Main. Don't get me wrong, I love Pittsburgh but this bar feels un-Pittsburgh somehow. The interior is decorated well and I remember admiring the wallpaper last time I was there. They have that typical  old movie medley playing on the back wall as well. Hipster grad. students fill this place on a Saturday and Wed. (trivia night) and pretty much every night I've ever been there! I rarely know any of the trivia tid-bits but somehow I still enjoy it anyway. Good place to go for drinks on an off-night. Also, they have really good beers on tap (hop this hop that). Go.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "XW_2RCmNAzuwaWeAsqDmNA"
  },
  "e7Xco8ZrY0Nu6PvVqwIKFA": {
    "date": "12/27/2008",
    "text": "Seriously, one of the best places I've been to in Pittsburgh. Was home for the holidays and went out with friends, and this place seriously rivals the cooler clubs I've been to in New York and Boston. It was apparently funk night, so the music was awesome, and contrary to what I had heard, I didn't get too much of a hipster vibe (which was nice). The dance floor was crowded enough to make it fun, but not so much so that you couldn't move. All in all, a great experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "6TpY88p1NpgYQYlRbZA3Bw"
  },
  "6l6JK5AoeZ6IzQPPPtq-Zg": {
    "date": "7/13/2011",
    "text": "If you are someone who believes that when women are pregnant they become public property, this is the place for you. Legally, a bar cannot refuse serving a pregnant woman alcohol, based on discrimination. However, that's what they do here.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "ECr9XteBXwXyEPs2mMA94w"
  },
  "7V8b-P7RrxoBUtcDWKzzhQ": {
    "date": "2/19/2009",
    "text": "I cant hate a building, but the people who go here are hipster trash. Ask them about global warming, they all care beacuse they rode there on bikes! Drinks are kinda expensive for how shitty the actual bar is. Downstairs is ok but if you go upstairs your gonna smell funk armpit. This place sucks. Go to Thunderbirds!",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rQpbgpBvgiAWWgGlLEgfFQ"
  },
  "c_-a6_TpLF_u7J_-jsohtQ": {
    "date": "5/31/2010",
    "text": "This dive bar is trendy and fun, has a good selection of brews that includes some local and craft beer, and maintains a small menu of pretty decent and reasonably-priced food.  It does, however, get crowded frequently and become very warm.  Also, the hummus doesn't taste like hummus: it's so full of basil that it's rather like eating pesticide and herbs.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U31blLVd1kbMQ3l9hD0rgA"
  },
  "RJJW1Opgtqm78NcezPCSwg": {
    "date": "1/13/2010",
    "text": "Definitely one the best bars in Pittsburgh. It was reasonably priced, not too crazy. I have ordered beer and cocktails here and the service was okay, and the drinks were good. It gets 5 stars on decor, and crowd. It is hard to find a hipster crowd here in Pittsburgh, but its as close as it gets. Also, although the art work or videos played are somewhat obscure, they do serve as interesting  talking pieces. I haven't gone upstairs but I hear they do live music, and bet they get some decent talent. I would recommend this to many, if you are looking for a new mellow hip bar.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JTcHZB6t9INzoigkUrrw7Q"
  },
  "KivXF18hLdeitTFv4fv-zQ": {
    "date": "12/13/2008",
    "text": "rough weeks lead to over the top indulgences when need be.  when plans for friday were cancelled, and i knew one of my favorite bands was gracing the steel city with their musical explosions of happiness, i found myself staying in my car and heading east for the night.  there isn't a crazy stupid thing this girl won't do for that moment of really good live music. this band, to me, is the best it gets, so i was on it like brown on rice (the healthier choice, of course).  the band was playing here, so after the short impromptu road trip i met my friend downstairs in the bar before the show.  i didn't know what type of place i was headed to, but from the looks of it, i hit hipster heaven.  i'm not going to deny i've got more hipster in me than chach, so i was happy.   the people seemed friendly enough, the beer selection was good, and from the looks of it- the food spectacular (i didn't have any, it was just enough to make my mouth water and wonder).  it wasn't too crowded when i arrived at 9 pm, but by 10 it was packed.  sardines packed.  if you want your space or want to eat a meal without heather hipster bumping into you, head there early.  upstairs is a different vibe than downstairs, but still good nonetheless.  as far as music venues go- small.  in cleveland terms, think bela dubby with a few extra feet.  i couldn't turn my eyes away from the wallpaper.  velvety paisley happy wallpaper.  i loved it.  it gives off the vibe of and older house being converted to the cool hangout for your friends.  being that it's a smaller space, it gets loud in there.  i'm practically deaf anyway, so i don't care, but plan ahead:  bring earplugs.  it was a great intimate space to see a band.  if you're in the back, head to the front.  you won't see crap from back there.  and murphy's concert law:  the tallest man imaginable will find a way to stand in front of you if you don't.  so just do it.  really friendly people at this place.  great place to see some live music.  great place to see my favorite band.  and bands playing until 2 am is my idea of a great release to a bad, bad week.  my friend in pitt says the youtube night is a lot of fun, as well as some of the other theme nights the bar downstairs has.  i'd love to come back and check that out.  we don't have anything like this in clevo, so i was a happy camper.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ey-4MP3wXg9byW4QFj2_dg"
  },
  "SSLwORHo1cQFJOq57ka8CA": {
    "date": "6/2/2009",
    "text": "Admittedly, I was there on a Sunday. And during the Stanley Cup. Thus, there was no live music and the crowd was oddly (for me) excited about hockey. I actually would have been fine with that, but they played it with the sound on, and that was too much for me. However, it's totally cute. The decor is trying almost too hard, but the little faux black birds on cherry branches over the bar are pretty cute. It's dim and almost a dive, but with too many frills for that. But the atmosphere is good and the bartenders are better, so I was pretty pleased. Also, Sunday is vegetarian dinner night, so we had that special time. It was a marinated tofu sandwich, which was excellent. Their slaw, which I think was mostly jicama, I thought was pretty good, my friend hated it. Basically, the food was fine but not entirely satisfying. They mix a good whiskey-ginger, something that I found surprisingly hard to find in Pittsburgh. Others were way too watery and not either whiskey-y or ginger-y enough. So that was a sweet relief. Their beer options are also pretty great, and as the fantastic designated driver for the night (we are so not used to having to worry that when accustomed to train-based travel), I was entirely grateful.  No, it's not like Brooklyn. But should it be? I wouldn't have thought so. I didn't go to Pittsburgh to be in Brooklyn. I could have just stayed home for that. It's full of Pittsburgh's finest hipsters, who were no more welcoming as a general crowd in Brooklyn; they were pretty much set in their own little groups and not big on new conversation. It was a Sunday, though, so it could be a little less that way and more lively on a busier night. Mustaches appear to be VERY in. But hey, to each his own.  Mostly, it's cheap and kitschy and pleasant and somewhat friendly and a reassuring sight after the (yes, I can't deny it) horrible bars we had hit on Carson St the night before. I",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EshrtQQT0ODnFpGkU2DWKA"
  },
  "g09nNVUfcB2PbhTUXJtA2w": {
    "date": "3/4/2012",
    "text": "Don't be fooled at the hole in the wall appearance...this is one of the best places that I have been too in a long time.  I travel over an hour just to eat here and it's worth every mile!  The food is great and well priced.  The portions are good.  The burger is superb.  The cheese plate was fantastic.  Wonderful beer selection.  Great atmosphere.  One of my favorite restaurants in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YSo0bTm_XUy5H_Ov9tx6fw"
  },
  "KdMFQd9BDSWEDDMw_MEvbw": {
    "date": "9/26/2009",
    "text": "Brillobox was the first bar I ever went to by myself and I met some lovely artsy folks.  They have delicious imported beer & their bar has a really comfortable atmosphere.  (There's a tree coming out of the bar!)  Upstairs they throw dance parties.  Towards the end of the night I danced my ass off with a bunch of strangers & it was so fun.  I dig the neighborhood a lot (Lawrenceville) & I hope I get to go back to Pittsburgh soon!  I never realized what a cool place it is.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3OPWrnooSQd4TYKV83ow9g"
  },
  "VoUXSF9Uhd55GT6yCeBbZQ": {
    "date": "7/10/2008",
    "text": "The bartenders make a mean Tom Collins and the cook, the best nachos I've ever had. I'd like to cover my bathroom walls with the velvet wallpaper on the second floor.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_oa18XUGoMEo3kM45STj9A"
  },
  "3ryH_Q4-dFDRPiIu8X7NbA": {
    "date": "1/6/2009",
    "text": "super duper fun. probably one of the only places in Pittsburgh that I've been wanting to return to with all my friends. its very funky and drinks are cheap. lots of very interesting cool people here. you will definitely have fun here and they have many different themed nights so you will not get bored.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8YwZ2FCPA7nf8WngszF_Kg"
  },
  "l6kSJjh_izLrCA4QIGv4WA": {
    "date": "6/14/2013",
    "text": "I've heard a lot of things about this place and finally went.  I didn't visit the upstairs because I spent most of my night at the bar.  The place was really crowded with all sorts of strange people. I expected to see throngs of hipsters and punks but instead saw an eclectic mix of everything (hipsters and punks included).   The ambiance was rather nice but I just thought this place seemed a bit stuck up. While the people there were \"eclectic\" they were all unified in their cliques. Then again, what do you expect?",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BkMqpJikNc3r5itc-ui6ww"
  },
  "iW59KmBBDGcSgnk66Q8sKg": {
    "date": "1/25/2013",
    "text": "Let us talk about the food and drink at this place.  Everyone seems to have covered the aesthetic aspect of this place, so I really shouldn't even waste any time on that in this review.  I was hungry, I mean really hungry and just decided to check my Yelp app for nearby places and Brillo popped up.  Scanned their menu and decided this was were I was going to satisfy that hunger in me.  The menu is short but they seem to cover a fair amount of area when it comes to quick bites.  I was going back and forth between the gourmet grilled cheese and the Brilloburger.  Of course, being the burger fan I am I opted for the Brilloburger.  I was quite excited because you got to pick the cheese you wanted on it (at no extra cost).  You also get the option to have either potato chips or a mixed green salad, I opted for the mixed green salad.  When the burger came out, my jaw dropped.  Good thing it did, because is was huge.  So huge it was necessary to cut it in half to devour it.  I swear they make their own buns there, if not they get them locally and fresh daily.  They lightly toast the bun before loading it with that amazing patty of beef.  The burger had to have been a half pounder, juicy and thick (cooked to order).  Lettuce, tomato and red onions top it.  I opted for the smoked Gouda cheese which gave it that extra flavor of goodness.  Thank god for the extra napkins supplied, they were definitely needed.  I'm sure I wasn't a pretty sight eating this monster, but it tasted so good that afterward I swear I should have taken a shower.  The mixed green salad was an amazing side.  Carrot shavings and an amazing balsamic dressing made in house.    Now, for the drinks, they have an amazing mix of drafts and big bottled beer (read that as higher alcohol content).  What I really appreciate about this place is rather than describe to you what the flavor of a beer is they have on draft, they give you a sample and you can make that decision by yourself.  I selected the Brooklyn pale ale and after a nice sample, proceeded to order two more drafts.  Now, the staff were amazing.  A nice compliment to such an awesome place.  They were attentive to our every need.  Checked on us frequently.  And the best part was that it didn't matter who started our order, whenever someone came around, they made sure we were taken care of.  Definitely a return visit in the near future from me.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ACwBMSJzgW6vOvV7vOrk8Q"
  },
  "0kw9jv5orM-gYeUSr4OOfA": {
    "date": "12/12/2015",
    "text": "I really like the atmosphere of this place and the food was good. However I felt like the bar tender put zero effort into any of our drinks. We all had trouble sucking them back because they were so bad. It wouldn't of been an issue if she actually checked on us, but she didn't and that's disappointing for a slow Thursday night.   I would definitely still recommend to friends just because it's such a cool small place. Maybe next time will be better",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kRrmx1ArhyIyOcO1Fts2mg"
  },
  "qSLXl9NCPl9BfTCePU_6cw": {
    "date": "2/5/2013",
    "text": "I love the Brillobox!  I've been coming here for so long where once I used to say, \"It's an older crowd...\" I now find myself saying, \"I just do not understand how these young kids dress!\"  No matter which end of the age spectrum I've found myself, I always have a good time at the Brillobox.  Their draft beer selection is perfect for the craft beer snob who needs to get a life and a less alcoholic hobby (such as myself).  I love all the craft beers and just about every time I come to the Brillobox I discover a new favorite.  I also find the pricing of the beers to be much more reasonable than say, the Sharp Edge.    The bartenders are very friendly and knowledgable.  I've had friends tell me the offering of \"beers I've never heard of!\" is overwhelming.  If you dont know what to order, just tell the bartenders what you like to drink and they'll pick a beer for you that you will enjoy.  The mixed drinks are also very good.  I highly recommend the food here.  If you're a vegetarian, this is a great dining option for you.  A lot of people don't realize the Brillobox has a pretty full menu but this place is great for dinner.   Admittedly it has been awhile since I've dined here so I'm not sure if the menu remains the same but they make a damn good burger, the Israel breakfast sandwich is to die for, and there is a reason you'll see just about everyone ordering the fries:  they are GREAT.  The food is inexpensive for what you get.  I love coming here for trivia night but be warned:  it gets VERY packed.    There's no smoking in this bar, and there are two levels, upstairs for shows, and downstairs for drinking and dining.  If you want to come here on a weekend and you want a seat I do recommend getting here kind of early because this place is going to get packed.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "PD3X7S70zXHeOx1NjeicjQ"
  },
  "wtAG-L_LACz3yvo9uM7EZg": {
    "date": "5/4/2012",
    "text": "What a night of serendipity, surreality, and pop culture. Andy Warhol, eat your heart out.   On a pitstop between Detroit and D.C., my copilot (no, not God, though my best bud is really awesome) and I swung by Pittsburgh for some grub. We ended up at the Brillobox because hey, where else can you get half-decent food late at night besides a hipsterish bar?   I'm a huge sucker for the decor here - it's a mishmash of a bunch of different aesthetics (contemporary, kitschy, antique) and everything ends up feeling warm, inviting, and even a touch magical. The gigantic open-in-warm-weather store front doesn't hurt either.   The crowd was mostly in their 30s - hip but not rocker - more like geeky tech and graphic design industry people. That and so many attractive queer women I almost forgot to eat the meal in front of me (my eyes were feasting elsewhere?). Their presence, I found out later, was probably due to Sharon Needles promo celebration something-something that ended up happening while we were there. Good timing!  The bartender was pretty brusk but efficient. I love no-bullsh*t attitudes but I don't really love you're-not-human attitudes. This guy really teetered on the border. Decent selection of beer. I had something local and tasty.  Food was ok. Overpriced for what it was. The buffalo wings are where it's at. Ate those suckers up. The spicy udon vegetable soup was really heavy on the bouillon and really tomatoey. Other than that, it was fairly bland. The chorizo tacos were good, albeit a little dry.  I liked the tables and booths - and though it was packed, a couple shared their huge table with us. I get the sense people in here are pretty open and generally friendly.  Three 1/2 stars in all. Rounded up to four because I'm stealing some interior design moves from these guys.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "dD1_XwgaHM0oxlx2XeYgZw"
  },
  "w042PEIL-63pA5_F0eUqaA": {
    "date": "9/16/2015",
    "text": "Raspberry beer and the door guy is reading Game of Thrones? Sold! Plus they were playing Prince and had the Pirates game on. Huge plus! Love the Japanese cherry blossoms over the bar! Love it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Xdkzo93edc-1i7ye0JDpng",
        "caption": "Photo of Brillobox - Pittsburgh, PA, United States. Enjoying the dream!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Xdkzo93edc-1i7ye0JDpng/o.jpg"
      }
    ],
    "user_id": "rwDMkAYPnkCrQsXIITCvHg"
  },
  "NAHnRaJH-IrjzeeBsu3M5A": {
    "date": "1/12/2014",
    "text": "Came here to dance to some D's who claimed to have taste in music (Title Town),  They did have good taste in music not excellent but good I asked for some Curtis Mayfield and that was beyond their reach I guess. They also dropped  a record off the table haven't heard a transition that awkward since my raver days.  Anyhow I'm dropping a star for drink prices a medium sized mixed drink runs $6 here with bottom shelf liquor and beers anywhere from 4-6$ a pop. The space is still really cramped it kinda feels like you are dancing in a shipping container that might be dropped in the ocean at anytime.   Also the extreme whiteness is a bit much for me because white people are inside doing things like hogging the top smaller stage dance floor ALL NIGHT. A group of white guys who apparently think they can dance were up there dressed in thrift store threads and resembling a swarm of mosquito's,   They were quite annoying. Completely unaware of their douchebaggery. I am not sure if this is still as annoying on other nights it looks like from the reviews it is. I still had a good night though.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "Bwa7MWEM88FtiNLaXWCkww"
  },
  "gEEyKDNHEq2q5qkDunt8mQ": {
    "date": "9/6/2014",
    "text": "I like Brillobox simply for the wide range of experiences that it offers. I have been here for many, many dance parties upstairs. But I've also had a quiet dinner, or casual drinks on a weeknight with friends. I don't know of too many other places that offer this kind of dichotomy.  The upstairs gets very crowded on busy nights, but as someone who really enjoys a good night of dive bar dancing, I don't mind. It also gets REALLY hot, even in the winter, so dress accordingly. The themed PGH Bro Club parties are fun (e.g. last week was Rihanna vs. Beyonce -- YES PLEASE). I also enjoy Pandemic, which features a wide range of international dance music. The covers for these types of events are pretty reasonable. I like going late but you have to be careful; admission to the upstairs has been cut off early due to reaching capacity in the past.  I haven't had a meal here in a long time, and I can't remember a whole lot about it... I do know it was tasty, though. I recently moved to a new place in Lawrenceville and can walk here, so I plan to stop in for dinner in the near future.  I have been here on \"quieter\" nights too and have also had good experiences in the downstairs bar. The bartenders have been really friendly, and the crowd is pretty chill (gah--I hate that word).   Overall a great place, and one that I am happy to now call my neighbor!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "J9OSJ7Xl9wnS0tL709AIqA"
  },
  "eSQNI5BS1GObtx-WBdb7-g": {
    "date": "3/4/2012",
    "text": "Dined w/ a few friends early one Sat night so the place got progressively packed as the hours went past. While I hadn't heard much about Brillobox's food, I have to say their spicy black bean nachos, generous portioned house salad, and thick well-seasoned burger w/ local cheddar were all very, very tasty. Food was served quickly and hot.  Draft beer selection is ample and includes local favs from Church Brew Works, East End Brewing, and occasional Full Pint selections as well as Breckenridge, Anchor Steam, Victory, and Guinness offerings to name a few. I may have to go back soon just to try a freshly muddled Old Fashioned w/ cherries and oranges and raw turbine sugar. It really looked delish and as soon as patrons observed the preparation, everyone had to try one.  I was already full-on beer committed and not willing to test the old \"beer before liquor\" adage or I would have stepped in line for one of those whiskey heavens.  But the real delight about Brillobox is the outstanding service from all staff. The bartenders also act as wait staff and do a super job of making sure glasses are full and customers are happy. Table service does end at 9pm.   The upstairs area also offers an intimate (read: small) space for live shows from some local and national indy acts. Listings are in the City Paper.  Ladies room was small but neat and well stocked.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "X7mVSZxStPxD4GbN_29pYQ"
  },
  "3gOuCCLBqHMKIbLKTBt28A": {
    "date": "8/22/2014",
    "text": "Dropped by for a late night concert for $13. ABSOLUTELY LOVED IT.  I didn't eat anything, just drank some beer but the prices were reasonable and I was a happy camper. :)   Would love to go again for future concerts!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "llqmK3kUI26iCWZmMnlkAw"
  },
  "srnLmK74Dn3isah1URnYYg": {
    "date": "8/26/2016",
    "text": "Very cool place to hang for young folks.  People are chill and relaxed there.  they just have fun and don't care about nothing else.  The atmosphere is calm and different than the southside mix.  If you looking for something different than that crowd Brillobox is for you.  I hope it hasn't changed much because I have good memories there.  It actually was in a movie that was filmed in pittsburgh \"She's out of my league\"",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s9ycrZf0oe7_hGP8SvylJA"
  },
  "jsUBmGDKAD4k0y_KP-RWmQ": {
    "date": "7/7/2016",
    "text": "$12 for a hamburger that doesn't come with fries.... The weirdest crap on TV ever. I wouldn't send my worst enemy here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HgS1oA7UQA152IAx2Sj2gw"
  },
  "xnDu-Ddz0xsGCh8I3KHsmw": {
    "date": "6/25/2017",
    "text": "This bar is too cool to be True. If you're beating the hipster trail you'll be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yfulJkkS94xX7_wFEnreEQ"
  },
  "DhvT3X4pXPBmgBu2gLhvAg": {
    "date": "8/29/2014",
    "text": "Although the service here was top notch, the signature burger was not. The \"Brilloburger\" was not in a category of best burgers, in my opinion. I believe that the mix of meat was indeed correct, but the seasoning killed the whole thing. They sprinkle (heavily) coarse salt on the burger, then put the cheese and toppings on. The salt took over, and as I actually crunched down on salt, I wondered what the burger would taste like without. No one will know until that element is changed.  They also serve the burger with a mayo topping. Personally, this is not something that should be needed if the meat, cheese, and veggies are all fab.  On the other side of the table, my hubby ordered the pitadilla and Mac and cheese. The \"quesadilla-like\" app was fine. All I can say is that I have had comparable at a Phish concert. Perhaps the finest creation of the meal was the Mac n Cheese. Right on. Right on.  Like I said, the service was impeccable. Food, eh.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_30CnaYWhSp4qzsDJ-LJSQ",
        "caption": "Photo of Brillobox - Pittsburgh, PA, United States. Brilloburger",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_30CnaYWhSp4qzsDJ-LJSQ/o.jpg"
      },
      {
        "img_id": "JAvhtgcUCupF4OGM3eGeKg",
        "caption": "Photo of Brillobox - Pittsburgh, PA, United States. Mac n Cheese",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JAvhtgcUCupF4OGM3eGeKg/o.jpg"
      },
      {
        "img_id": "hZALQ7JoVQYNwugva8eVbg",
        "caption": "Photo of Brillobox - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hZALQ7JoVQYNwugva8eVbg/o.jpg"
      }
    ],
    "user_id": "FBd1Qjnnc1Loh7ZY7FD9Zg"
  },
  "4XH3q2U4RbduvFfU5kgxlg": {
    "date": "10/13/2014",
    "text": "This place is falling apart. Literally... The huge disco ball fell from the ceiling as we were watching a concert. The bathrooms are disgusting and everything needs a good cleaning. With that said it's a nice small venue to see a band, with great acoustics!  We did not eat or drink downstairs so I cannot comment about that.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HlY4Vku7lA1bis1zxsImlQ"
  },
  "J4IoSSAjQKWJ-cVj_XxTwA": {
    "date": "4/26/2014",
    "text": "Great parties with good dance music once a month. If only they like... Gave you oxygen to breathe while you dance.  Sundays (downstairs) they have an amazing vegetarian dinner special. I quite like it.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "InDrrRvQ9f732YGPX4Ixmg"
  },
  "GRf8rWO4_vMq5fmlhhQHxg": {
    "date": "3/11/2014",
    "text": "I had a decent enough time here for weekend bar hopping and band-enjoying. The music was good and I was comfy... given that my friends and I grabbed up the only seats in the whole room. I acknowledge that 'standing-room' vibe they're going for, but a couple small seats against the wall might quell us nay-sayers.   The drink was good, but a little pricey and not made with love (bartender wanted to be ANYWHERE else but there).  Overall though, the entertainment was good and you meet new friends when you have the ONLY BOOTH IN THE ROOM!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4juAamRW_cMcSa_VPU6yqg"
  },
  "QdepJHlqvuBYbX5NNpUSIQ": {
    "date": "5/31/2014",
    "text": "Great bar staff and good beer selection, food wasn't too bad either.  It's a different, I'm not sure if trendy is the word, place as far as decor goes. Feels like the same 30 people are there every time I go.   Not bad though if you are looking for something different",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JSFayCcQmOJcXzvY11sPZA"
  },
  "KPYJxDvmhPceh1HLmLDu8w": {
    "date": "11/9/2012",
    "text": "Ambiance-wise, this place nails it and plays with being quirky, which is awesome in Pittsburgh, where you either have dives or places that try to hard to be what they think  a bar must be like in LA or NYC.  However, this can't say the fact that the bartenders have never been friendly, the food odd and the servers seem very disinterested in serving.  To be fair, I've never been there on an event night or upstairs.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "pKKtTm4oDB_-nIGI0MqxHQ"
  },
  "dOM8xzOb_z0_mFmYRYGhTg": {
    "date": "6/13/2014",
    "text": "Great happy hour specials, and fantastic food. I love their clearly marked vegan offerings, and their starving artist $6 vegetarian dinner on Sundays. Their fries are unbelievably good, I'd argue the best I've had, especially with the vegan sauces you can request. Vegan options tend to be around $10 for a sandwich type dish, which is a little pricey, but it's totally worth it for the quality/creativity of the food. I also love how frequently the decor changes (is it seasonally?), there's plenty to look at and the vibe is pretty sweet for any kind of visit.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "fQB979CfsIXHmcHJhNBuSg"
  },
  "KnMudsqPz2f-XOmKa_4XAA": {
    "date": "4/29/2017",
    "text": "Such a cozy Bar. Great food, great service, & an awesome selection of drinks. Before you die, try their Bahn Mi. (Pork is my preference with this sabdwhich).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eZV_YtKKMZ-pj09fFo0eLw",
        "caption": "Photo of Brillobox - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eZV_YtKKMZ-pj09fFo0eLw/o.jpg"
      }
    ],
    "user_id": "MIVao9J-xjfXUDFf36O5Mw"
  },
  "N14R-DwsMPlrtpOEIGV_7w": {
    "date": "11/4/2015",
    "text": "I visited Brillobox with a friend the Fri. before last.  Given that we were both looking for somewhere where we could get some HH food and grub, and that I had a City Dining Card, it seemed like a good opportunity to hit up Brillobox, so we did.  We started out by taking advantage of the HH special of $3 cocktails.  These cocktails consisted of frozen drinks, so I went with a cranberry margarita, and my friend had a frozen bourbon cider.  They weren't particularly strong, but at $3, I can't complain too much.  For food, we took advantage of the HH special for half price selected apps by ordering the fried and breaded cauliflower, which came with a maple mustard dipping sauce ($3.50).  While the concept seemed interesting, the seasoning didn't strike me as very Cajun, and the dip was just okay.  In addition, I ordered the shells and cheese with chicken ($12 + $2 upcharge), and my friend ordered the Brilloburger ($12).  The cheese sauce with the shells was nice and creamy, and the dish was topped with bread crumbs to add some crunch, both of which I appreciated.  However, the portion of chicken was meager, and the dish wasn't particularly flavorful.  While I can't speak directly about the burger, I suspect my friend felt similarly about it.  During our visit to Brillobox, we sat at one of the tables in the back corner of the first floor.  The decorations above the bar were quite interesting and festive, and made for a cool ambiance.  As others have mentioned, this bar definitely attracts a hipster crowd due to its location, so consider yourself forewarned if this is a turn-off.  Overall, while our visit to the Brillobox wasn't particularly remarkable, it served the purpose of a HH hangout nicely.  Between the HH and City Dining Card discounts, which they let me combine, the price was pretty reasonable.  While I wouldn't go out of my way to return, I certainly wouldn't be opposed to spending another Fri. HH here, by any means.  3.5 stars.",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 17,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "xVi1Z5b57Q4kgsM9LbNd_w",
        "caption": "Photo of Brillobox - Pittsburgh, PA, United States. Brilloburger",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xVi1Z5b57Q4kgsM9LbNd_w/o.jpg"
      },
      {
        "img_id": "lo_7J8MZh85ROxXcE3dr6Q",
        "caption": "Photo of Brillobox - Pittsburgh, PA, United States. Cajun cauliflower bites",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lo_7J8MZh85ROxXcE3dr6Q/o.jpg"
      },
      {
        "img_id": "-QA-iGnUd3p5plND056gSQ",
        "caption": "Photo of Brillobox - Pittsburgh, PA, United States. Shells and cheese w/ chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-QA-iGnUd3p5plND056gSQ/o.jpg"
      }
    ],
    "user_id": "135DbbQnr3BEkQbBzZ9T1A"
  },
  "ZeDLNl2uf00JIVq78ZAkgA": {
    "date": "9/15/2018",
    "text": "The creole cauliflower with maple mustard is amazing, especially if you're a vegetarian that really misses chicken strips and honey mustard--this is the best cauliflower variation I have ever had. The aesthetic and music is very eclectic and cool. The staff can be a little prickly, but it gets busy so it's understandable. Honestly, I'd recommend this place to anyone looking for solid veg/vegan options and an interesting new place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "URu8c8f7-kQpXLiUVp7LMg"
  },
  "dyRB-HdQfrQ_qJvqNgPzfQ": {
    "date": "11/19/2017",
    "text": "Such a cool place- the decor is so fun, you find your eyes just strolling around the room. We went on a Friday night, and the crowds were surprisingly low. Nevertheless, our service was embarrassing (for them). The people working there seemed \"annoyed\" to have to tend to us..... so they didn't. Never checked on us, never asked us if we were all right/ needed anything, never even came over with more water. They went rushing by us a dozen (or more) times without even making eye contact (we tried- it became a funny game we were playing) The food was good. Fried cauliflower, tomato soup, veggie burgers- all yummy.  But I can get plenty of attitude back home in NY, I don't need to pay for it in PGH.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QWAAN9q8AogGED4oDH7pvg"
  },
  "s6XWCS7-DTV8JRASK3_Xkg": {
    "date": "12/16/2016",
    "text": "1st time visitor. Pretty cool place, it was all decorated up for the holidays and it was fun. Tried the veggie burger for my vegan friend and I tried the regular burger. I honestly like the veggie burger better than the regular one. Kind of weird buns though. Shared a cone of fries and they were awesome. Cool dipping sauces like pickle aoili and some spicy aoili were very good. Great draft list and the prices of the food and beer were pretty ok. One guy who took our bill who had a full beard and slouchy hat was a real buzz kill. He seemed put out taking my 50 dollars I just paid cause he didn't even really acknowledge us at all.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0tpLWXsk3Uyx_qyxcN_tEA"
  },
  "JXMKXC5500qGjv-QadAH0A": {
    "date": "11/18/2017",
    "text": "Pretty nice place. Cool vibes and nice server. However, she was really slow to get our order. She visited the table like twice and kept walking around us after that before finally taking our order. Maybe she thought because we were a larger group (6 people) we needed more time, but we were very hungry!  Food was pretty good. I got the chicken banh mi, which was flavorful, but oh my was the chicken salty. I ended up pulling out a lot of it because of the salt.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pCRC8kiqjv-gfzckGYsIGA"
  },
  "iJoPh36spF8UJk313aRIpA": {
    "date": "5/4/2016",
    "text": "THIS WOULD REALISTICALLY BE A 3.5 STAR RATING. Brillobox is just fine.  It has solid bar-esque food, and is vegetarian friendly.  I have been here a few times and have never been disgusted, nor blown away.  I don't know what it says, but I couldn't tell you anything I've eaten there...and it's not like I've been intoxicated while eating.  It's just forgettable.  I do remember them having pretty good french fries though.   It is trying a little hard to be hip, but it doesn't feel phony, so I let it slide. Maybe I'm just too old and don't \"get it\" anymore, as I used to really enjoy it more (for the bar, which used to make a mean bloody mary).  If you are in your 20s, you might enjoy it a lot more (as long as you're not rocking Trump swag, which I suspect could earn you a side of cook-saliva with your food order).  IF THIS RESTAURANT WERE A MUSICIAN/BAND:  Bright Eyes:  Worshipped by a few (at least 10 years ago), but if you're over the age of 27, you probably won't get much out of it.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "iaF-nkYNGNrhujsh90EcxA"
  },
  "yzDwI8WdBrdEn-4BxCMA-w": {
    "date": "1/5/2017",
    "text": "First timers to this small bar/restaurant that has great options for vegetarians and carnivores alike! Today I tried the shells and cheese which was dynamite. My partner got the tofu shepard's pie that was out of this world. And my plate of choice was a classy and filling veggie burger! Two thumbs way up, not disappointed. Will return in the future!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cSUwLkkyK718Xhx--NPIpQ",
        "caption": "Photo of Brillobox - Pittsburgh, PA, United States. Left to right: tofu shepard&amp;#39;s pie, shells and cheese, veggie burger and chips. Taste great!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cSUwLkkyK718Xhx--NPIpQ/o.jpg"
      }
    ],
    "user_id": "UYFFPOh8pkyVCT_l5hmpwg"
  },
  "wXxnGaDk6U7siwQ67GIqgg": {
    "date": "2/11/2015",
    "text": "First of all I must say that I have completely grown to like Brillo from the first couple of times that I have been here.  My girlfriend and I have been frequenting Brillo every Tuesday after our weekly Salsa lessons. So let me tell you about Tuesdays.  The space is intimate and confined with a mixed expression of hipster and a cool kids lounge. We sit at the corner bar with our regular barkeep Brian who promptly tell us what new dark beers he has on draft. [I am a huge dark beer fan and with the winter season I cannot get enough of my chocolate stouts :)] If we are unsure or have not found an immediate favorite there he happily gives us small samples.  This week - Southern Tier Brewing Company - Choklat was the clear winner. Warning - quite heavy and rich in flavor but be careful when you drink it at 10% ABV.  Tuesday nights we are informed - is locals night. You get a delightful sample of the neighborhood mid 20 and 30 years olds who have a taste for a rotating craft assortment advertised meekly by a large chalk board. Around us, a couple of friends were enjoying a heaping of garlic fries served in a triangular stand with a sampling of ketchups and aioli. I've had them - they totally hit the spot.  The lighting is dimmer and there are tree branches hanging from the ceiling as decor. The space itself is mostly booths and one of two free standing tables, so towards the weekend or when you come with groups it can get quite packed. So tuesday are nice for that reason also.  On occasion I have visited Brillo for other reasons. Wednesday night there is a trivia DJ which isn't overly crowded, however do make it a point to come before the 9:00 pm start-time. I have been told there is an upstairs where the bar hosts bands and events; some day I will make it to one of those.  All together it's great week after week and I will frequent the bar often just to keep unlocking badges on my untappd-app.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "X2AiYF7z32_0Oitl4aYXwg"
  },
  "5_AfXQ0ewcktJX34fD-Qiw": {
    "date": "6/9/2014",
    "text": "My friends and I ate at Noodlehead in Shadyside and started walking westbound down Penn towards Lawrenceville. One friend was sore from running a half marathon earlier that day and would not stop complaining. We saw several people enjoying themselves in this bar and decided to stop in for a couple drinks. I liked the tree behind the bar and the red, circular vinyl booths. There were some intriguing women inside which only added to my appreciation of the place. The bartender was a really friendly guy and the beer selection was good. Those booths captured my attention more than the beautiful women sitting in them. Tom Waits lyrics have been stuck in my head since.   \"Warm Beer And Cold Women\"  One of those nights.  It's warm beer, cold women, no I just don't fit in. 'Cause every joint I stumbled into tonight is just how it's been. All these double knit strangers with gin and vermouth. And recycled stories in the Naugahyde booths.  And the platinum blonds, tobacco brunettes. I'll be drinkin' to forget you, I'll light another cigarette. And the band's playin' something by Tammy Wynette And the drinks are on me tonight.  All my conversations now I'll just be talkin' about you babe. Borin' some sailor as I try to get through. I just want him to listen now, I said that's all you have to do. He said, \"I'm better off without you\" until I showed him my tattoo.  And now the moon's rising ain't no time to lose. Time to get down to drinking tell the band to play the blues. And the drinks are on me, I'll back up a round. At the last ditch attempt saloon.  Warm beer, cold women, no I just don't fit in. Every joint I stumbled into tonight that's just how it's been. All these double knit strangers with gin and Vermouth. Receeding hairlines in the Naugahyde booths.  With the platinum blonds, tobacco brunettes. I'll just be drinking to forget you baby, I'll light a menthol cigarette. And the band's playing somethin' by Johnnie Barnett And the last ditch attempt saloon.",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "FsOM272et1cXadHHd0gTnQ",
        "caption": "Photo of Brillobox - Pittsburgh, PA, United States. Positive Energy Activates Constant Elevation (P.E.A.C.E)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FsOM272et1cXadHHd0gTnQ/o.jpg"
      },
      {
        "img_id": "RcBfQWKE8AT47eXTc8OJNw",
        "caption": "Photo of Brillobox - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RcBfQWKE8AT47eXTc8OJNw/o.jpg"
      }
    ],
    "user_id": "dt9IHwfuZs9D9LOH7gjNew"
  },
  "65O0uE3659iRZIM4nNvCpA": {
    "date": "12/20/2015",
    "text": "Oh, Brillo. How the mighty have fallen.  I remember a time - and not all that long ago, actually - when the question 'where do you want to go tonight?' would often be answered with an enthusiastic, 'BRILLO!'  And now... it's just like... the thing we want to see is being hosted here; let's hope we don't have to use the bathroom all night.  Do not despair - I will tell you, in time, why it is still worth it to come out to this relic of our yester-Lville.  I haven't eaten there in a good while, and last I did, the food was yummy. We haven't seemed to make it during kitchen hours lately, but I do remember the food fondly.  The drinks? Eh, not so much. I would say, stick to wine or beer if you're drinking here. Single-spirit mixed drinks - like a vodka-soda, etc - are a pretty safe bet as well. But anything past that? Not impressed.  Now, on to the *real* reason you want to come here: DANCE NIGHTS.  Title Town has moved here after the closing of the Shadow Lounge (::tears::). This is hosted the second Saturday of every month, and is $3 before 10pm, $6 after, but worth every penny, no matter what time you arrive. The DJs are fantastic (J Malls & Gordy & maybe another guest DJ or two), the music is all old funk, soul, & R&B, and you will dance until you fall over.  The second, also fantastic dance night is Second Skin, which is generally hosted every other month, although the days of the week appear to change. (Your best bet here is to like Second Skin on Facebook so you can get notifications of when the dance nights are.)  Second Skin is a gothy dancefest. You don't have to be goth to love it; believe me, there are plenty of hipsters out there shaking it on the dance floor as well. But it's all really, REALLY well-curated goth dance music. Post-punk, new wave, little bits of industrial. Basically, if you could dance to it dressed in all black, you will hear it from the wonderful Erica Scary & crew. Now that Eclipse has closed and we've lost our other goth night in the city, this is the event to look out for every other month.  The negatives of Brillo: the upstairs bathroom. A bathroom so heinous that the Trainspotting bathroom told it to maybe clean its act up. The floor will be wet (it's real slippy, yinz watch aht!). There will probably not be any toilet paper. Someone may have used paper towels in place of the toilet paper, so you may have a scary situation. Be warned. Hold it as best you can, or make your way downstairs to the less-nightmare-inducing bathrooms.  On the subject of wet floors: the dance floor at Brillo ALWAYS seems to be wet. Spilled drinks I guess? Or sweaty humans? Perhaps some combination of the two? Regardless, just be careful when you are dancing your brains out that you don't slip, bump your head, and actually knock some brains out.  And it *will* be crowded. Always. It will always be crowded at some point of the evening. Be ready for it. And try your hardest to watch that your elbows don't go into someone else's dancing real estate (looking at you, my flaily hipster friends). We can all get along in this smelly, sticky, slippery space.  And all the negatives will be worth it, because you will dance so hard you forget they all exist.",
    "rating": 3,
    "rated": {
      "funny": 6,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "r98FaAOAoJDCPp384XpcYA"
  },
  "YdS5twqWrpmi_ZhOVoI58A": {
    "date": "12/1/2015",
    "text": "I really like this place. Went here in the middle of the week to check out a band I discovered while I was living in Austin. Loved the hipster vibe. There is a small stage above the bar which is where I went on my first visit. The place was pretty cool, the bartenders quick and there were small built in tables on the side to rest your beer while enjoying the show. Def a great place for an intimate concert.   On my second visit, I checked out their bar. Loved the decor, there are tvs and some random movie was playing on their larger TV. They have a decent selection of beer, which I enjoyed. There are a variety of high tops and also some really nice comfy booths. Definetely plan on returning. Love the hipster vibe this joint has and apparently they have some good happy hour deals.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "i3lHb48oSkgrjFuA1t4ApA"
  },
  "IrOW-eexrIChWxt0bOwCgg": {
    "date": "12/26/2014",
    "text": "This place is different most other bars in Pittsburgh and definitely fun to try on a weekend night. I went here with some of my lady friends, and we split the fries as well as some sort of fried kale appetizer and got a round of beers and a hard cider for me. The kale was crispy and unlike anything I'd ever had before. I really enjoyed it. The fries came with three dipping sauces and were fine...the presentation (in a tall wire cone with a paper liner and three little cups for the sauces) was by far the best part. I prefer my fries thick-cut, so these were a little on the small size for my taste. The service was also fine. Nothing to write home about but nothing to keep me from coming back again either. In short I enjoyed the fried kale and loved the dark red interior. Everything else was rather unmemorable.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zPwZQEVmFg9cbmsEwLpA6g"
  },
  "tnlCZ5y6ZEJeRxgBjb2_5Q": {
    "date": "2/1/2017",
    "text": "My wife and I left the country for four months and where did we go the first night we got back and had a babysitter? BRILLOBOX! We usually share the mac and cheese triangles but after being away for so long I refused to share with my wife and made her get her own! LOL!!  The bartenders are always so nice and have great stories to tell.   Even though my wife and I are both around the corner from 50 this place reminds us of being young and dumb, and that is said with much much love.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1WyUSJKCAaXVVZk163RaVw"
  },
  "cGEljXO17N5wlbi5eLVJlQ": {
    "date": "11/30/2015",
    "text": "Brillo is a nearly weekly occurrence for me and I absolutely love it.  A pro tip: go early --between 5 and 7--to get a table (and don't go on Monday, because you will be sad that they are closed).  Otherwise resign yourself to the bar; people tend to park it in the relatively small number of tables.    Brillo is cozy, has fun decor and a great draft list, and the food is pretty insanely tasty.  I like the Sunday Night Veg dinners, which rotate every week and vary in quality from Meh to Delicious, but for $7, it is a deal.  They removed a few favorites from the menu (bring back the seitan French dip pleeeeze!), but the banh mi, the fried cauliflower, seitan wing appetizer, the veggie \"meatball\" sandwich, and the frites with a variety of dipping sauces are all the jam.   My only picayune complaint is that they could be even better by offering a discounted draft or other beer special from time to time.  Your bar tab will likely rack up quickly.   The wait staff is always friendly, approachable, and attentive-- never had a bad experience.  I also avoid going when they are slammed after 9 pm like the plague, which may have something to do with it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "koJypUmFGpyKIeLsuMXwJA"
  },
  "DisLQSWrkKJHrjkhOYlGFw": {
    "date": "11/20/2016",
    "text": "went there for drinks at night and we had some french fries too, drinks were okay, fries took forever. Next morning we went for breakfast, ABSOLUTELY TERRIBLE FOOD. Coffee was watered down, \"Hash browns\" were a pile of pepper flavored potatoes, eggs were a pile of mush. Toast was good. It also took well over an hour to get our meals and we ordered eggs and bacon. Do not go there to eat!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BzYjjuF6cB4KNohqNwaafg"
  },
  "BlnXXEGQAF774f4XTfOQFw": {
    "date": "3/15/2017",
    "text": "Great local bar with really cool and quirky decorations that change with the seasons! Always enjoy grabbing a bite and drinks with my coworkers here! Great beer selection and nice bites to eat",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z146DMjYlRbBNB0xRELJXA"
  },
  "SyX0UU460ngFAnVD95BlMg": {
    "date": "5/18/2015",
    "text": "Let me start with the fact that I've always wanted to check this bar out. Went last weekend with a large group for a friends birthday.   We arrived around 11 so I didn't have a chance to eat but the menu seemed decent. We had no problem with the service however I could see the potential attitude they had if anyone got out of line, understandable.  I wasn't too happy with the beer selection, I know ipa's are \"in\" but there's other types of beer out there! Bottled beer was miller high life, miller lite, yuengling, IC light, and corona. I don't want a hipster beer OR a bro beer so I'm stuck with liquor. To add to this displeasure, medium sized mixed drinks with bottom shelf liquor were $5. Even upstairs (where they charged a $5 cover) the drinks stayed the same price. I've never heard of a place that charges cover and still expects you to pay $5 for bankers club whiskey, other bars around this place would charge half and hook it up!   The crowd was a bit cliquey. You'd be looked down upon if you weren't trendy, fashionable, or the like. A few people in my group felt a little out of place and unwelcome because of this. It was 'hits from the 2000's' night and the dj was pretty good.   All in all, I'd go back but stick to first floor bar. The atmosphere was much more relaxed and best part, no cover!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "3VSXGpollr0CAee0_BROtw"
  },
  "xbt57Q8K1Mt38gJGyoIAxg": {
    "date": "3/29/2013",
    "text": "I've always loved this place - used to go every Friday after work, since it's around the corner. Great place to enjoy a few beers with friends - they have a great rotating selection. This place really shines on their 'bar food' though. Their menu is great - I recommend their pommes frites and their brilloburger, but pretty much everything I've ever had there was awesome - hummus, nachos, banh mi, etc!  I'm not sure if they still play the 'Dallas\" re-runs on the projection TV, but the ambience is great, especially when they can open up the garage door in the front of the place and let the outside in. Hmmmm... maybe it's time to re-institute the weekly tradition with friends from work!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "4r33dXcE1oYZxjONrhxTiA"
  },
  "lmuZt0f--FMoIf1URKBjug": {
    "date": "10/19/2012",
    "text": "It's been a REALLY long time since I've visited the Brillobox. Therefor, I felt like I needed another visit to justify a review. I have heard the mixed reviews about the food and environment for a while, but considering I had only hung out in the upstairs for a DJ set long long ago, I really wanted to try the food.  We bellied up to the bar and grabbed a delicious seasonal brew, Great Lakes Red Ale... they have a mega list of brews that makes me happy! But it makes me extra happy to see seasonal brews on the list as well!   What I do remember was how delicious my grilled cheese and tomato soup was! It wasn't just your plain old grilled cheese... it was a delicious gourmet treat! Ooey gooey Gouda cheese, tomato and caramelized onions. Yumm-o! I was in cheesy heaven! I wasn't sure about the tomato soup because it had fennel in it. I'm not a big fan of fennel, but the more and more I kept digging in, the more I liked it! It was the perfect accent to the already delicious meal!  Of course there's your requisite judgmental hipster crowd, but I ignored it and enjoyed my amazing meal and tasty beer. The hipsters can have their ultra dive bars, but I want to share this one!",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "4wp4XI9AxKNqJima-xahlg"
  },
  "SU_JDnI_bwTqqgdiv5lgVQ": {
    "date": "7/13/2019",
    "text": "I've been coming to Brillobox for years, it's one of my staples in the East End. The food is always awesome and there are a ton of options I really enjoy. My go-to, though, has always been the nachos as they are seriously the best nachos in the city (and I do not say that lightly.. I've searched far and wide for excellent nachos and Brillo's were the real deal!) I was pretty devastated when I just learned that their new menu (while still awesome) does not include nachos!!! Often times, I come here exclusively for the nachos (as I had today), so I sadly can only offer four stars.   Brillo, if you read this, pleaseeeee bring back the nachos.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AsM7T6SuBMgfaaNtSqq4WQ"
  },
  "AljBMoeovlTF8LOtqLsSzg": {
    "date": "6/24/2018",
    "text": "Stopped by for a bite to eat after seeing that they had so many vegetarian and vegan things on the menu! The atmosphere is basically a really interestingly decorated bar with some booths and a huge cherry blossom tree hanging overhead.   First, we ordered some fried cauliflower. I liked it and liked the sauce, but wished the cauliflower was cooked just a teeny bit longer to make it softer. Huge portion. It might have been almost a whole head of cauliflower, or definitely at least half a head!  I had the veggie burger which was made of kale, black beans and quinoa. I opted for the vegan version. $2 upcharge for fries. The burger was thick and a bit crumbly, but good. It can be hard to make a vegan burger. I loved the avocado on top. The fries tasted waaaayyy better than they look. They were not hard or crispy, although they look brown. Not overly salted, which I liked. Overall, a good meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "Wsy8TAq-Kw8RI5z_HWfCpA",
        "caption": "Photo of Brillobox - Pittsburgh, PA, United States. Cauliflower",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Wsy8TAq-Kw8RI5z_HWfCpA/o.jpg"
      },
      {
        "img_id": "NT-xi7cXti5zVK0l-4KlzQ",
        "caption": "Photo of Brillobox - Pittsburgh, PA, United States. Burrito bowl",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NT-xi7cXti5zVK0l-4KlzQ/o.jpg"
      },
      {
        "img_id": "GUjd2v3qWYkKr8nKywtzZA",
        "caption": "Photo of Brillobox - Pittsburgh, PA, United States. Brillo Veggie Burger",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GUjd2v3qWYkKr8nKywtzZA/o.jpg"
      }
    ],
    "user_id": "xhmBgIT3xHgojioDq_c_fg"
  },
  "8FK3Ukc56L2bOBUYzmUp2A": {
    "date": "6/23/2019",
    "text": "One star review for the \"new\" bahnmi sandwitch - so sad to write this! Brillobox has been a favorite since we moved to Pittsburgh 7 years ago - and the Tofu Bahnmi is my staple.  I crave this sandwich and get it every time!!! I got it tonight and I disappointed for the first time ever!!! It was raw tofu!  No special sause!  Bread soggy!  I am so shocked and disappointed!!! The bartenders are still super  amazing and super understanding.  Please bring back the old tofu bahn mi!!!  It was the best in Pittsburgh!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-QaYYCBshxDYLvVrwiiyRA",
        "caption": "Photo of Brillobox - Pittsburgh, PA, United States. Brillobox &amp;#34;new&amp;#34; tofu bahnmi",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-QaYYCBshxDYLvVrwiiyRA/o.jpg"
      }
    ],
    "user_id": "JGrBQCpzeJRmiOJlvaaIVQ"
  },
  "2hzWXoc2DkjWpQ0h2V3A5w": {
    "date": "8/20/2019",
    "text": "I am a longtime Brillo regular but I'm not loving the new menu. The pork in the pork banh mi has changed preparations and sauce for the worse. Katsu fries soggy.  I get the desire to serve more upscale food but why mess with a good thing?",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zc3xtHHgt8P-mqHXW0T-OA"
  },
  "yWr6zseSd4BVZPtRDRBALw": {
    "date": "6/26/2018",
    "text": "It's been years since I've sat down and eaten at Brillobox. So I did it this past sunday. The staff was friendly and accommodating. The food was delish. Our table ordered some tap beers and: Fried cauliflower Hot Seitan \"wings\" Tofu burrito bowl Regular wings with dry rub The cubano The bahn mi with pork.  Everyone loved their food immensely. My seitan was spicy as all hell and it was AWESOME. It was the best idea post Bloomfield Pool on a sunday. I will definitely try to make it a point to go back to brillo. I used to go there a lot when they first opened and it was all cigarette smoke and debauchery.  I stopped going because it got too crowded for my tastes/age. I guess it's a decent option when we're looking for bar food thats good and drinks that are cold.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "EWkQxKg-KOzujC38Z_40wg"
  },
  "7s8XWKzx-AipTdMuDJgzow": {
    "date": "5/12/2019",
    "text": "Love the vibe and upstairs stage! They change their funky decor seasonally and this time I went they had a huge cherry blossom-like tree with dangling lights hanging over the large bar. There are a 4-5 retro, red-laminated booths and a couple tables in the back, and they open up the garage door front on nice days! Went there on a Friday night and the service was quite slow - but they were busy so we just ordered from the bar even though we were in one of the booths. We ordered nachos and fries and the portions were big and tasty! Highly recommend for bringing friends, dates, exes you get along with, and just about anyone you want to show a good time!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vcXAnhLFvmCHKgRGHBszCA"
  },
  "nmwn1Z5Uzrnzuog2BtfQQg": {
    "date": "9/5/2018",
    "text": "Went here for the Wednesday night trivia game.   Had a watermelon margarita for $7. Very tasty and fresh.   Had the tater-tots to munch on. They were huge!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bz89Y6z7EuCutYcGf8Wqcw"
  },
  "un7V6oF0Or2L5IQh31tMnA": {
    "date": "4/4/2017",
    "text": "I really could have sworn I gave Brillo a review a long time ago. I very well may have as I had another Yelp account but just could never remember my login lol. Anyway, been here lots. It's in my hoodish; maybe a ten minute walk from home. Have attended anti-war benefits, charity benefits and more here. Have come to see many friends that are local performers when they had shows, and stop in for a bite now and again. Not an extensive menu but what they have is so good.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "7YR3sfAITiCqntUeJMkabw": {
    "date": "9/29/2018",
    "text": "I came this weekend with two cousins to see a comedy-improv show. Brillobox has a pretty awesome two-level setup: the ground floor is a small but beautiful bar with booth seating; a long, old fashioned wooden, curved bar; a huge plasma tv; amazing (whimsical!) decorations; and cool, mellow lighting with set up over a sweet sound system. The upper level is like a black box theater with a the addition of a small stage, a killer sound system, and a bar at the back!  We got some Moscow mules ok the lower level from our awesome bartender (who just so happened to be the owner as well!) and took them to the second floor for the show. The second floor has limited drinks, but they DO allow you to take drinks up and down, so that's no problem. In any case, the drinks were strong and reasonably priced, so I was more than content.  The comedy show was also really fun. They do a lot of different events up there from comedy to music to dancing, so you're never bored!  Love this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Vmz8Q_EcMA3btZt6RoAOw"
  },
  "NL7KGhcKtJeCGlDw7p7kvw": {
    "date": "11/27/2017",
    "text": "Brillobox is an interesting food joint.   We tried the mcbrillo burger and to my surprise it didn't come with fries. Fries are extra. $6 extra. Your side choices are broccoli, chips and salsa or something else that I normally wouldn't have as a side with a burger. I chose chips and salsa. Not even good chips and salsa. The burger itself was good, tasted really fresh but nothing special. Nothing really stood out to me. I don't know if they didn't put enough sauce on it or what but I wouldn't pay $12 for it again.  I was thrown off by the poor seating. There's bar seating, the booths are great for groups, but theres a few TINY round tables for two people, they're so small and in the most awkward place, it just feels like everyone walking by is on top of you. Even the waiter kept having to move out of the way for people walking by while he was taking our order. I wanted to ask if we could move to a booth that just cleared up but didn't want to be rude if a group walked in. Basically this place is crowded in my opinion.   That brings me to the service... they kinda just float around. They aren't really attentive. I had to flag them down. Not sure if I would return.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jOEognQVurpHjMT2lxXSuw"
  },
  "7Fx8Mq0c79mIMp3OuXS5bg": {
    "date": "8/24/2017",
    "text": "Brillobox was such a great place to eat! The atmosphere is unique and casual and the food and drinks were not only vegan friendly but also extremely tasty!  We got fries, hummus, and seitan wings (mild) for the table and the group had the bbq tofu sandwich and veggie burgers!   Starting with the apps, we could have skipped the humus and pita as there was not really anything special about it. The fries were AMAZING and come with ketchup, vegan shallot aioli, and maple mustard (this mustard is perfect, blew our minds!). I really liked the seitan wings, they are not breaded and have a great texture and flavor. We go mild sauce since we has some wussies at the table and they said they felt it was still spicy. So if you don't like spicy at all opt for bbq. We got vegan ranch with ours as a dipping sauce. The only reason I give a 4 on this review is because we were brought out a non vegan sauce instead of this ranch at first and someone did eat some before we figured it out. To me that is a pretty serious thing.   The burger and sandwich were both great and the burger comes with a chipotle aioli instead of the shallot, again if you don't like spicy food ask to replace with shallot!  We hung around a little and drank watermelon margs before heading out and really enjoyed the place. I will for sure be back here and recommend giving Brillobox a visit!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nfo2pym2-Tcjtd5sxYAbCA",
        "caption": "Photo of Brillobox - Pittsburgh, PA, United States. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nfo2pym2-Tcjtd5sxYAbCA/o.jpg"
      }
    ],
    "user_id": "xgnEhvJPkmh4SKs7I5vAHA"
  },
  "bL6u3lVeMnzsmeqDg5y-LA": {
    "date": "7/14/2018",
    "text": "My boyfriend and I went to Brillobox for dinner and drink on a Friday night around 6:30, it was his first time there (I've been there before). The service was great in the beginning but towards the end of our meal it was pretty slow even though it wasn't very busy. The beer selection was on point as usual, the Unibroue Strawberry & Rhubarb Ephemere was really good! We started with the Creole Cauliflower which was great as always, the maple mustard is the best! I had the Tofu Melt vegan and he has the McBrillo, I know some people complain about it but I love that the sandwiches come with a small salad on the side instead of fries. The dressing is fantastic and the greens are fresh. The Tofu Melt was really really well done. I was a little bit skeptical because making it vegan would remove the cheese and mayo with out substitutions but man! It was yummy, I would definitely order again. One note - when they made it vegan I think they used oil instead of butter to crisp up the bread which made the bread just a little bit greasy. Apparently the McBrillo was great (I didn't try it so I can say first hand) and it was a huge sandwich!   I also have to say the fact that their happy hour goes until $7 on Friday is awesome! The Cauliflower is only $5 and draft beers are $1 off (there are a bunch of other specials too - $5 margaritas anyone?!).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "63zz_AmyzzaIsqSai4Pf7Q"
  },
  "Ippdjqik-03lY3m8kBA2BQ": {
    "date": "9/28/2018",
    "text": "I've been to Brillo dozens of times and love it every time. Drinks are good and affordable, ambiance is super unique, and I always run into an old friend. The second floor is a good bonus and most of their dance nights are low key but fun. Stopped by for improv last night and it was hilarious. Won't be stopping my patronage any time soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m7Wu3LLzq0hHJPB9lS5SUw"
  },
  "mjkssPvcnDbxEKlrjd5agQ": {
    "date": "4/18/2018",
    "text": "Brillobox's Sunday vegetarian dinner has been on my list for awhile and I was finally able to make it a couple of weekends ago. They had just unveiled their spring cocktails menu that night as well as their spring decorations and I just couldn't get enough of how pretty their spring decor is! The huge bough of blossoms over the bar area is absolutely gorgeous and makes for an interesting contrast with the rest of the room. I ordered the guava margarita - ok, a tad on the sweeter side for me. I'dv preferred salt on the rim and kind of assumed it'd come that way but it didn't, so if you're like me and like salt-rimmed margaritas, remember to ask! They also didn't have a couple items on their drinks list that day which I found wierd because their social media post invited people to come check out their new spring drinks menu. For the food, I ordered the Seitan wings which were hard, chewy and I think overdone). Totally skip Seitan wings here. I also got their veggie dinner dish, which that day, was curry flavored rice with vegetable pakodas (which is batter fried fritters). The pakodas were excellent but the rice was quite flavorless and bland. I wish we could've just gotten another portion of just the pakodas!! I'm also not sure that the crispy pakodas and rice which is quite dry go together as a combination. The rice definitely needed a sauce or something that could offset its dryness. I get the feeling that their Sunday dinner can be hit or miss. But they only reveal the dish a couple of hours before they open and you're going to have to take that chance if you want to try it. Brillobox often also hosts a lot of music events which seem like a lot of fun and could perhaps make up for the food being so-so. I'm going to give Brillobox one more shot before I make up my mind.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IH3AXOARnGbl31hiwnwwew",
        "caption": "Photo of Brillobox - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IH3AXOARnGbl31hiwnwwew/o.jpg"
      },
      {
        "img_id": "jB30JtT9qMiziLIMdrDU6g",
        "caption": "Photo of Brillobox - Pittsburgh, PA, United States. Seitan wings",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jB30JtT9qMiziLIMdrDU6g/o.jpg"
      },
      {
        "img_id": "bTjVgue-ceLt8IXONavh7g",
        "caption": "Photo of Brillobox - Pittsburgh, PA, United States. Sunday Veggie Dinner - Curry flavored rice with vegetable pakodas (fritters)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bTjVgue-ceLt8IXONavh7g/o.jpg"
      }
    ],
    "user_id": "2oeFc-L1Ow4UC_j_VOS_kQ"
  },
  "w6Wiil9UqbpMutb4gCqCoA": {
    "date": "6/21/2018",
    "text": "If you need punk in your life and, a little Rock and Roll. I must say, I don't like to boast. I just appreciate everything Brillobox provides! Thanks, to the 2nd floor for a good show, thanks to the 1st floor for my snack. I have vague memories of fun times. 10/10.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6gy0qQRQ8QgCukMZfLKzvA"
  },
  "ZNFOLZP7z3QqIADffVT8hg": {
    "date": "4/6/2018",
    "text": "So this place is an absolute gem as long as you're not hungry. The service is mediocre and the food is also. My partner and I got the McBrillo burgers which seemed very delicious but they were SUPER DUPER SALTY!!! the fries with the three dipping sauces was the best part, the fries are totally worth it..I hear their vegan food is pretty good as well...my only concerns is being that their burgers are super salty how is the vegan food being prepared?..anywho check it out! I heard they have really good shows there from time to time",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "BQJp0zg-3vW69opTYMBRZA"
  },
  "xQjBVICnn4iwC22isrKAaA": {
    "date": "9/16/2015",
    "text": "Ate dinner at Brillobox last Tuesday and was extremely pleased with my overall dining experience. This summer (2015) they released a new menu with tons of great additions-new apps, salads and sandwiches, most of which are vegetarian/vegan and all are very different so options are endless. My boyfriend and I sat at the bar and for 9:00 PM on a Tuesday the place was very lively.   Ambiance: unique eclectic decor inside. Several different paintings, artwork, and lights strung around the restaurant. Retractable side wall opens up entirely on warmer days to the fresh air. Aside from the bar and tables around the restaurant they have a few couches & comfortable chairs in front of the retractable wall as well. Very cozy spot.    Staff: friendly staff. Not only was our particular waiter so welcoming but the rest of the staff was eager to offer refills or ask if we needed anything. Our waiter was very knowledgeable of the different menu items and the beers on draft, offering us his honest opinion of the food as well as beer samples.     Food: Delicious! For an appetizer we had the creole cauliflower - flash fried exactly as the description reads, with the perfect amount of spice and a delicious tangy maple mustard dipping sauce. I ordered the veggie burger and it was actually a burger with substance and flavor that didn't crumble upon biting into it. Served on a very fresh Kaiser bun with fresh topping and a side salad -one of the best veggie burgers I've had in Pittsburgh! I will definitely be back to order that again. My boyfriend ordered the \"b.r.b.\" roast beef sandwich on baguette - he too loved his meal. It was packed with flavor and tons of toppings. Overall food was delicious, ingredients were exotic, everything was so fresh, portions were large, and the large draft menu topped it off. We will certainly be back for more and to try the new menu items soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HdEM0xeldw4QAweECyOwcQ"
  },
  "Qwm-5o_I0uS4FYr0C1DmDQ": {
    "date": "6/25/2017",
    "text": "Wow wow wow. I had brunch here just now and it's delicious. Great vegan selections. I had the tofu scramble (usually I don't like them because they have the weird nutritional yeast flavor overpowering, but this one was perfection egg substitute), the most amazing thick slices of sourdough bread smothered in vegan butter, salted and peppered fresh hash browns. I wasn't a fan of the sausage they had with it but the other things were dynamite. My friend ordered the cardamon blueberry pancakes and I dipped my sourdough in that sauce and it was tasty! Service here was perfect. Right balance between checking up on us and giving us space to eat and talk. Good temperature. Music wasn't too loud. Definitely coming here again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DL6YzvEFCnFYz3GsC64fzg",
        "caption": "Photo of Brillobox - Pittsburgh, PA, United States. Vegan seitan BBQ wings with vegan ranch. Soooo good.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DL6YzvEFCnFYz3GsC64fzg/o.jpg"
      },
      {
        "img_id": "YGiKPf97ShwIktddakDFQQ",
        "caption": "Photo of Brillobox - Pittsburgh, PA, United States. Vegan Vietnamese sandwich with seitan.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YGiKPf97ShwIktddakDFQQ/o.jpg"
      }
    ],
    "user_id": "MI3xUHHC3N5cQzd_zGOgDw"
  },
  "Rb3lOkLQ3UNtcwmJaK8CrQ": {
    "date": "11/1/2018",
    "text": "I am giving this place a 3 star but I honestly should give them a 2. Service is extremely slow... took me about 15 mins just to get acknowledged by the bartender. Had it not been for my waving I'd  probably stil wouldn't have a menu... I guess this area is serve if you know. Ambiance is nice but no diversity. Sad my experience with this place was crappy. Has lots of potential for improvement. Food was okay too!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zd8dUnFBn-bUrLK92cTUQA"
  },
  "y9P0jlziYW8-Qp-duH6nAw": {
    "date": "1/20/2018",
    "text": "We were in town for the Steelers/Jags game. I am vegan and my boyfriend is not. This place catered to both of us equally. It was refreshing to find a place that has an equal number of vegan options as meat eating options. And not just \"you can make it vegan by taking everything off it\" options. I'm talking vegan toppings, sauces, etc. The creole cauliflower was AMAZING, and the cucumber salad side was delicious too. Definitely would go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5ikztTSc72rzw1yshPKoXw",
        "caption": "Photo of Brillobox - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5ikztTSc72rzw1yshPKoXw/o.jpg"
      },
      {
        "img_id": "mIvhlKmT3HDXgPdO2PbjZw",
        "caption": "Photo of Brillobox - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mIvhlKmT3HDXgPdO2PbjZw/o.jpg"
      }
    ],
    "user_id": "tI6wmsW_EOy6iA5cjK6UwQ"
  },
  "TjtvUcIIbpsRzMr595Un5g": {
    "date": "8/4/2012",
    "text": "The place was cool, the beer list was long and had some good pics, my husband got a great mixed drink (margarita with a coronita).  We didn't eat but the food list had a ton of vegetarian foods that looked (and smelled) awesome as people around us got food.  We'll definitely be going back for food and drinks.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sTNMHO1sxiuMp7QTOlne-Q"
  },
  "B6D-06PMdL8pX9X2HMn4dg": {
    "date": "1/20/2008",
    "text": "I agree with some of the posts that this is not a typical place for Pittsburgh.  I could see this being in Bucktown or Wicker Park in Chicago.    Any place that has a good beer selection and plays old 1950's commercials at the same time makes the cut in my book.   The crowd is very mixed, but skews towards more hipsters than anyone else.   I'd recommend giving this place a try if you haven't already.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5WteJv2aZPGPf8OAkOmBfQ"
  },
  "2aKGDIyiSfOguYzh5Tk6xw": {
    "date": "5/29/2012",
    "text": "Pretty chill evening drinking spot for the hip crowd. A little expensive for Pittsburgh. Amazing french fries. Friendly bar staff. Interesting cocktails and a wide selection of brews. Nice big projector screen for weird movies and (sigh) sports when the PGH teams are on. Haven't been upstairs but I guess they have dance parties too. Would happily return again here, we even found an open booth on a Saturday night. I love Pittsburgh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hmvqH5zaWAAgJxan5eHilw"
  },
  "Cyeyzm6wzkHojE3DXfEqPA": {
    "date": "2/17/2011",
    "text": "Hip joint, full of cool kids and good beers, I wouldn't recommend to anyone who wants a quiet drink or a chill setting for a square - but if you're young and wearing plaid with an appreciation for canned american pilsner, then right on.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "396srm0Kn4gdjRQ1-aPrmQ"
  },
  "MNjCwC-gjt4Bpr4hxla_xg": {
    "date": "12/19/2011",
    "text": "Great beer selection, good prices, fun neighborhood, beards, and drag shows.  Sold.  If I lived in Pittsburgh I'd frequent this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LruOyCDYa-hfSwJkOt46VA"
  },
  "5CZBEGhZ5wTk15HCAGlzkA": {
    "date": "8/5/2013",
    "text": "As many other reviews have said, this bar has some pretty awful staff members.  They're extremely unprofessional and rude.  The girl who works the door is a complete jerk.  She screams at people for no reason, and likes to ignore customers trying to get it, and prefers to talk to her friends and get drunk instead.  The bartenders ignored me for actually 15 solid minutes once.  I was trying to get my first drink, and I had to go downstairs eventually.  People are a little snobbish.  Belvederes is a thousand times better if you want good dancing and drinks...oh and their staff actually cares about you.  Really not a fan of this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nGOehtpx-OZvVq0snTN4Iw"
  },
  "csTalxBgZ80ZDvD_v3wmIQ": {
    "date": "12/10/2008",
    "text": "The hipster bar.  Dancefloor upstairs, bar with food downstairs.  Non-smoking now, so the smoking section is outside/out-front.  The dancefloor doesn't seem to get going until late, and can fill up pretty quickly for popular stuff.    The food was actually pretty tasty, and accomplishes what it sets out to do; it's an interesting and well done vegetarian fare.  It's not an out-of-the-park dining experience; the food probably wouldn't stand alone if this were a restaurant.  That said, I order the food every time I'm there, and leave a little happier than when I walked in.  They started stocking Hendricks gin, which is a winner in my book.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "BWFF5dX7oE5F-IB8hc36Kg"
  },
  "5PZGrHWP8lpjXGxMifkz9g": {
    "date": "10/2/2012",
    "text": "The Brillobox is generally a good place to go if you want to see a live Pittsburgh band or if you want to go to a drag show. It is very smelly on the second floor and it is by far one of the dirtier bars/restaraunts that I've been to in the city. Sometimes when you walk into even the first floor of the bar you can smell a strong scent of body odor and rankness. Some of the bartenders are very nice and a few of them are extremely rude. The food is mediocre at best and it honestly isn't worth spending your money on. The bar's decor is interesting as there is a lot of local Pittsburgh artwork hung on the walls. The crowd that generally populates this bar is lowbrow hipsters, artists, and musician types. You can count on about half of the people in the bar being gay on any given day. This is nice if you have a gay friend because there is an even chance of both of you meeting someone. The prices (for drinks) are about average. Not super cheap but not overly expensive. Their selection for beers and drinks is decent but not awesome.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "da0ch0T6RundYP9QfBQmBw"
  },
  "Ge7oce-Reihx3gWuqVcbUQ": {
    "date": "2/8/2011",
    "text": "It's not a dive bar, it's not a total hipster lounge.. rather this place rests on the inbetween, and I love inbetweens! Music lovers seem to consider this place somewhat of a staple, and I can't blame them. Among great stiff drinks (how I like them), this place has some very intersting foodie options. I was definitely taken aback at my first glace of the food menu. There were several items I would have never expected to have seen just by judging from the outside.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5z2KEodDuIA_yqJNX6nuAw"
  },
  "FRvUMbg3AY4GGB4bbRKYqA": {
    "date": "7/14/2008",
    "text": "Still loving the Brillo Box...my tshirt design business Family Dinner for One just participated in Make Shop Rock 2 at the Box this weekend, and it was fantastic, with a great turn out!    The menu has changed since last year, and is all veg now...delicious.  My bean taquitos rocked. But the rest is the same...same great staff, same great drinks, and lots of fun.  I could do without the smoke, but I can't subtract a star for that, since the 'Burgh goes smokeless in less than a month!  Hooray for everybody's lungs!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "og4MN7v405a4p9IgqHbBZw"
  },
  "KglWCFBawemFEp-x1e-P6w": {
    "date": "7/6/2011",
    "text": "The Brillo Box has been reborn after a previous life as the dive bar Nooner's and sits in 100% Lawrenceville, atop the hill across the street from the new children's hospital.  The vibe is pure hipster with lots of beards and ink. Stay away if you don't like loud music, but the staff and clientele are friendly. Most of the interior decorating serves as great conversation pieces. We didn't eat but I look a look at the eclectic menu. Options included everything from Vietnamese to nachos to hummus to wings.  They have a pretty impressive collection of \"Big Ass Bottles\" including Hoptimum and good Belgians. Draft list featured some local stuff from Penn and the Church as well as GL Dortmunder, Moylans IPA, Maudite. Aside from the fun atmosphere, what I liked best about the Brillo Box was the draft serving size. As bars everywhere raise prices while at the same time shrinking the glass, here I got a Great Divide Espresso Yeti in a \"pint\" glass. That plus a Moylans IPA and a coke was $12.50. Love it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "5laOS0tBZ3z0SUqVfNaXjQ"
  },
  "BKwQ-4Ab0hQdgknZul2kkw": {
    "date": "1/8/2011",
    "text": "When I went for my review on a Thursday night I tried my best to keep other's comments about the place from skewing my own opinions. The first thing I noticed entering the Brillo Box was its unique decor. Dim lighting, old school Merry Melodies cartoons playing on the TVs, and strange unrelated relics and trinkets displayed behind the bar kept me mesmerized. It's sensory overload, but by all means I don't mean that in a negative way. I felt like I was in some strange world far away from Pittsburgh. I usually find this sort of funky decor to be a distraction and a gimmick, but in the case of the Brillo Box it works.  One complaint I'd heard before my review was that Brillo Box was a hipster-only scene. Though there was a good number of people that one may classify as hipsters, everyone I met while drinking at the downstairs bar was friendly and extremely welcoming. To be honest, Brillo Box might be the friendliest bar I've been to in Pittsburgh. Within five minutes of sitting down with a pint of Dale's Pale Ale in my hand a group at the corner of the bar had already struck up a conversation with me. Furthermore, the bartenders are cordial too. They have in-depth knowledge of the beers they sell (a good number of micro-brews) and never hesitated from striking up conversations with the patrons. One bartender even gave me two of their latest micro brew drafts and put it on the bars tab.  The prices here are pretty expensive for Pittsburgh standards (I live in San Francisco now and the brillobox would be considered cheap here). I chose from the plethora of draft beers and each was around $5. The man sitting next to me was drinking Patron Margaritas (4 Shots) for $16.50 a pop. The cheapest beers on special that night was Straub and Miller Lite bottles for around $3.  As I was sitting at the downstairs bar I kept hearing talk about a DJ and dance party going on upstairs. Now I don't really like to dance (probably because I really suck at it) so I usually stay away from the DJ dance party scene, but since I was here for a review I thought I might as well head up and check it out. I'm glad I did because it really was a pleasant surprise. After paying the $4 cover, which was pretty bush-league for Pittsburgh (great deal in SF), I entered to see that the place was really bumping for a Thursday night. The dance floor was pretty good size along with a small bar near the back for dancers to re-fuel. The DJ was set up on the stage in front beneath a large projection screen showing intriguing videos somehow related to the music playing. Mind you, by that time I was pretty ripped so I have a hard time remembering if the videos were actual music videos or something else. The DJ was mixing rap with indie rock and a whole bunch of other genres I wasn't really familiar with but everyone else seemed to know.  Even upstairs on the dance floor, Brillo Box's friendly atmosphere shined on. I was merely satisfied to stand at the side and watch everyone else dance around making fools of themselves, but a group of young ladies pulled me out to the dance floor and after much pleading finally got me to dance. And the best part of it was they only laughed a little at how bad I was.  I ended up really enjoying the time I spent reviewing the Brillo Box, so much in fact that I will definitely be back. The friendliness of the patrons and staff mixed with a good beer selection gets great marks in my book. The decor might be a little over the top, but it really was a nice change of pace and something you don't see every day in the Pittsburgh bar scene.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4IlFpxJ-HU1iBKo89WV7IQ"
  },
  "lr25KQ1t482PM8pssxzz0A": {
    "date": "2/6/2012",
    "text": "Fun place! I've been here quite a few times. I usually go for Pandemic, which is great world music and lots of dancing! They have a good variety of live music and an excellent atmosphere. Definitely not a huge place but it's not too small either.  It gets shoulder to shoulder crowded on most weekends but that's the case with a majority of good bars/venues in this area. Also, the bartenders are really friendly and the drink prices are decent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ezv-TTU7JkEC2t0Zrokdaw"
  },
  "6OIenucR7hfPqP_CtBeJ1w": {
    "date": "10/29/2010",
    "text": "I've been to the Brillobox on two occasions, both under very different circumstances and at opposite times of the day.  The first occasion: I was here on a weekend night, attending a show my boyfriend's band was performing in. Being, the stereotypical \"groupie girlfriend\", I was exiled to mingle among the peons (err, \"crowd\", that is) while my boyfriend and his bandmates set up the stage with the other bands.  The space upstairs where the show was held is wonderful. The decor is enough to keep one's eye consistently entertained, the beer selection is on point, and the sound fills up the entire room without being overbearingly loud. In addition, it was fairly empty for a weekend night, thus making it easier to order libations, talk without screaming, and not have to fight through a sea of sweaty bros. The staff also seems very laissez-faire when it comes to operating the venue, a welcome change from the uptight and anal doormen I know oh-so-well from DC and New York bars.  The second occasion: In a sheer act of desperation, my boyfriend and I (sorry to be that Yelper that always writes \"my boyfriend and I\") came here on a late Sunday afternoon for brunch. Since I had been here for a show, I certainly wasn't expecting their brunch to be anything decent, as I know from experience that venues tend not to have the greatest food.  Oh, how wrong I was. And wonderfully so!  I ordered the Farmhouse French Toast, quite possibly one of the best french toasts I've ever had. (Coming from a self-proclaimed french toast connoisseur, that says a lot.) The venue was completely empty, save for a small group of diners who may or may not have worked there. Unlike most french toasts, the bread was not an eggy, fluffy challah bread, but rather a thick slab of country seed loaf. Also unlike any french toast I've ever had, it was smothered in warm, dripping peanut butter and agave nectar, topped with a thin layer of apple compote. First off, peanut butter and apples go together like Thelma and Louise. Second off, WARM PEANUT BUTTER ON FRENCH TOAST?! Simple as it may be, whoever came up with this is brilliant. The slices were toasted - thus crisp and crunchy on the outside, but soft on the inside. The agave nectar was the perfect sweetener to this dish without being disgustingly sweet (as many maple syrups tend to be).  To top off our last-minute brunch savior, the service was excellent. There was an amazing stop-motion claymation video playing on the projector, which I kindly asked the waitstaff about. They didn't seem to know who it was, but returned moments later with the DVD and information about the director. That's some pretty badass service.  While many complain about the obnoxious American Apparel hipsters that frequent Brillo, I didn't have any issues with the clientele. So long as they stay within their plastered-on skinny jeans and keep to their unhygienic selves, I really don't care.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fIIg8HER3zBQ4ZAZyKewiA"
  },
  "Lar6HsQqY5rNZ352xywVfw": {
    "date": "2/27/2010",
    "text": "The downstairs bar is very nice and really well decorated and lit, but for whatever reason, they pump up the music to a volume that is incredibly uncomfortable, and your waiter will actually have to scream in your ear, and you in his to accomplish only a slightly correct communication.  Seriously, I'm not at a fucking rave in Ibiza and when you deafen your waitstaff, things will get messy.  The upstairs is kind of douchey.  I get that the PBR thing is to hipsters what Natural Ice is to frat boys, but I stand by my belief that there is no need to have it on draft.  Downstairs beer selection is pretty cool, but truly not worth the hassle.",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Fr6nMhzpaaicLsx_ZBczgg"
  },
  "yl86Uq2P4Kajvd2RJV-qsA": {
    "date": "1/4/2011",
    "text": "came in for New Years Eve.  $8 cover = not bad.  well drink = not that strong.  music = mildly sucky.  light show = reminiscent of jennifer lopez's \"waiting for tonight\" video about the 2000 new years.  temperature = near 1000 degrees.  i waited in line for the bathroom for about ten minutes just so i could take off my tights.  bartenders = sometimes attentive, sometimes more concerned with maintaining the cleanliness of the bar.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vxZzibySSjksk76DS4sAvw"
  },
  "gKrNtL1Tah8AhoV5VWvVWw": {
    "date": "1/22/2011",
    "text": "Hmm...still not my favorite, but I think it has improved (It just depends on the night). If I could give it a 3.5, I'd probably go with that. Yes, there are sometimes dance parties where people are too cool to dance but I've always had a great time during Hot Mess and I spent New Years at Brillo (which was perhaps the best New Years ever...they brought in all of the DJs from the biggest dance parties in Pittsburgh). Also, I like the downstairs bar and hadn't really spent much time down there before. The bartenders are great. They pour really really strong (be forewarned) and its cheap. They also have Bulleit which makes me a happy camper and the beer selection is still good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cU6f0FfwVwGwj4NYf2cdcg"
  },
  "V2_Z9Z99wtK2rIiD7ol3CQ": {
    "date": "4/1/2009",
    "text": "Going to the Brillo Box after you've lived in Brooklyn for a year is being asked five hundred times \"Isn't this like Brooklyn?!?!\"  No.  It's not like Brooklyn, It's like the some tryhard joint in the fuckin LES with trees and projection cartoons and god damn.  Their drinks were okay. And cheapish.",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 7,
      "cool": 3
    },
    "photos": [],
    "user_id": "yKFeQD-gcsPKj1BIs813oQ"
  },
  "dVIYonlpZCSF9BUUCiv0Kw": {
    "date": "12/4/2009",
    "text": "Nice-looking mellow bar with odd videos playing on projector screens. I wouldn't go as far as call it the hipster bar of Pittsburgh but it does draw a crowd of funny-dressed people who like to talk about their latest art piece they made while going through a breakup with yet another boyfriend. Drinks are okay, the downstairs bar gets packed fast and is small, good luck finding a place to stand without getting constantly bumped. And I have not ventured upstairs.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "VFxrLIlgApHIdOCrkAYIGA"
  },
  "WtM-54-ZYfPjCiq6mreZ-g": {
    "date": "4/26/2011",
    "text": "Awesome hipster vibe that's reminiscent of something you would find in New York or Chicago. Great vegetarian options and has super nice service. It can get busy at times, so be prepared to stand for a bit before a table opens up.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6ZXF0Veg64GPobMnSMfcyA"
  },
  "meKPfhxs09Zod4KkLA_crA": {
    "date": "3/1/2011",
    "text": "As a brunch connoisseur I was surprised this place managed to sneak under my radar ( I always just thought it was a hipster music venue).   We went here on Sunday for some bloody marys and brunch.  I got the B-Box scramble which was good but not awesome. It wasn't sure if it was missing something or overloaded with something. I was hungry though so I ate it up! Bloody mary was good but a bit olive juice heavy for my taste.   PROS: CHEAP $8 entrees and $4 bloody marys, wild decoration, friendly service, bars that serve breakfast are always a plus  CONS: Food was decent not amazing.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "IKnLl7SbuP0u6HS34jwHhw"
  },
  "brIe4TPJgM_BK7ZdopudEQ": {
    "date": "2/27/2013",
    "text": "used to pop in here when they first opened 5 or 6 years ago for Pandemic and to see the occasional hipster band with my then-g.f. who was in love with the place... The cigarette smoke upstairs was a huge turn-off and still is ... I'd be standing there wondering \"how the hell can the fire marshall be ok with this many people packed in here ?!!\"  The downstairs lounge-y area is more my speed, these days as the crowd is older/less bratty than upstairs ... (i'm definetly one of the eldest in the room at any given time, however .)  Good beer selection.  LOUD .  Perhaps too precious-hipster-y for my tastes, lately.  Just feels a bit too pretentious and \"aren't we all just making quite the scene\"-like .  Shrug .",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_ekUMPGWf4QB5uj6yAvGIw"
  },
  "wUh--APPqHlYNq4eX48UbA": {
    "date": "6/22/2012",
    "text": "this is a place i've been hearing about since before i even moved into pittsburgh. now, i've only been here once, but i'm definitely eager to go back and try some more different kind of drinks and the food! i'm a fan of smaller bars, so i liked the size of the place but it made it extremely crowded and i think  we were pretty lucky to get a seat when we got there. i'm a fan of the vibe though and the bartenders were really nice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5QWtZdJlAxO_Ye4t6YB1jQ"
  },
  "aFgbB7LKGelNRfuDCM0j8w": {
    "date": "8/22/2015",
    "text": "I have always enjoyed this bar. I've had a lot of fun at the upstairs party too. Friendly bartenders, good beer selection, hip atmosphere. My only complaint is that I have had a couple bad cocktails there, so I stick to beer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XjDf-JHBUSfbhfEOlszyvA"
  },
  "pUAqQdx779XXPUg16AIpzA": {
    "date": "2/20/2013",
    "text": "Fun place and always offers something new. It's different than other bars in Pittsburgh and doesn't attempt to only cater to one crowd constantly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-2OB54nQ6FsGLUM-R1KXnA"
  },
  "8NqKObdigT58P1c7FOQD0Q": {
    "date": "4/25/2011",
    "text": "Great place for peaceful drinks on the 1st floor. Great place for fun dancing on the 2nd floor. Fun crowd and really good music on most of the nights.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2FHBMoBI4pEsp-WYrrcYoQ"
  },
  "1EpSF2dkQdqDd1XCHO8f2Q": {
    "date": "5/19/2009",
    "text": "A hipster hideout in Pittsburgh! I thought I'd never live to see the day that hipsters could congregate openly and proudly in this 'tahn (town) apart from at a couple of off-color coffeeshops with miserable coffee or at the odd event at the Andy Warhol museum. But alas, about a year after I graduate college, the Brillobox opened. Upon my return visit to the 'burgh, I couldn't have been happier (or more jealous of current college kids).   Brillobox presents a distinctly Pittsburgh interpretation of hipsterism that I'm in love with. Sure, it's skinny pants and odd attire and funny hats and people smoke cigarettes outside. But, the Pittsburgh part of it makes all the things you hate go away. It's clean, the people are NICE, yes - NICE, the place is well-designed for multiple experiences, and you wouldn't even mind having a whole meal there. Perfect.  The downstairs bar is a really great place to chill with friends and have one of their many great beers or some other drink. It's dark, swanky, and artsy...in a good way. The upstairs is the musical performance space. When I went there, there was a hipster-come-bluegrass-rock-revival type band playing at absurdly volumes. But the crowd was into it, and it wasn't half bad either.  A place like this would never fly in any other city. In SF, LA, or NY, it would be mocked for being faux-hipster, pretentious, superficial and for trying too hard. In other less urban towns, it would be mocked for being too \"cool\", for being for smokers and druggies and drop-outs, and for trying too hard to be something it's not. But Brillobox fits Pittsburgh like a glove - modern and urban, yet sensible and unpretentious, all at the same time. It's the reason why Pittsburgh is succeeding where other similar rust-belt cities are fading. It's why, for the first time, I can honestly say to myself, \"I want to go visit Pittsburgh sometime soon!\"",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 7
    },
    "photos": [],
    "user_id": "KKdBQXnUlVUZ0ZNTfMQoEA"
  },
  "HYb_qc0TIFXoC1exn3pDkw": {
    "date": "11/23/2006",
    "text": "\"Oh, it's very popular Ed. The sportos, the motorheads, geeks, sluts, bloods, waistoids, dweebies, dickheads - they all adore it. They think it's a righteous place.\" - Grace, Ferris Bueller's Day Off, remarking about Brillobox  Brillobox restores my faith that we really can just all get along. You'll find quite a mix of people here, and that's fun. Downstairs is cool, funky bar complete with red, cushy, vinyl couches. Upstairs is the live music venue/dance floor. Drinks are a fair price and there is a decent menu. Since it's not large place, it can get rather crowded late at night. More places like this would raise the hipness factor of Pittsburgh substantially.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "xUW7iv-obnK90pw-A4Rzng"
  },
  "z4kj9XBt19x0V98w5MQcqQ": {
    "date": "9/7/2008",
    "text": "I attended a party for Viva Radio upstairs.  First of all, the bouncer wasn't much of a bouncer.  I felt like I could poke him over with my pinky finger.  Then, there was no Guinness at the upstairs bar.  However, the bartender poured a generous drink.  The dancing was fun.  I liked looking at the crazy Jesus figurines.  I couldn't figure out the decor, but it was kind of like \"Diner meets the Last Supper in Neonville\" or something.  People like to throw this word \"hipster\" around.  I feel like I saw a lot of people who could be classified as \"hipsters\" -- but only if you use that term hatefully.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "U4KYlRjP3KmavdPbtfOWJQ"
  },
  "Idr1qMuighmKZvxHArUqXw": {
    "date": "1/23/2011",
    "text": "I wish I could take this place, pick it up with all the people and everything, and bring it with me to Los Angeles.  I visited the Brillo Box late Saturday night with family; my cousin described it as (the place across the street where all the cool kids go).  The decorations are awesome (mixture of 60's era fixtures, plastic christmas decorations, stars), the people are neat (throngs of masked/courpse-painted hipsters as there was a masquerade upstairs), AND their jukebox is well-stocked (Wire, CSS, ELO, etc.).  Everyone was very courteous as I moved from one corner of the place to the other, no pretentiousness, no hostility.    Why can't every place be this awesome?  Good drinks, good people, good time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WskZfjIXKRRR5ewhClCWyA"
  },
  "dhvePGMLjWvl4fhk9lgxew": {
    "date": "8/15/2014",
    "text": "I come to Brillo Box all the time. My friend, who is 28 and us from Turkey was not let in tonight... For dinner and drinks. The guy working the door needs an attitude adjustment and just because a place has been raided in the past, does not mean you don't act like a civilized human being. A Turkish ID that says 28... Should be enough. Shame on you Brillo Box. I am done with you and your awesome food. Get a new bouncer!!!!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "duBMalLZU-Ro7zMLsyfo7w"
  },
  "-YYx8i5sl1Eno0UBt0YgNw": {
    "date": "11/2/2011",
    "text": "Everytime I go into Brillobox it gets better and better...I even like the bartenders a little more than usual. Great events and fun people. Definitelty my favorite neighborhood bar.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "LBJtqmgl4antuUBTI2xTtQ",
        "caption": "Photo of Brillobox - Pittsburgh, PA, United States. Cheese Plate",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LBJtqmgl4antuUBTI2xTtQ/o.jpg"
      }
    ],
    "user_id": "LUlKtaM3nXd-E4N4uOk_fQ"
  },
  "rkaiqqY6H8kHUwI-T_rE2w": {
    "date": "7/21/2007",
    "text": "I like this place a lot.  I agree that you will see a diverse crowd, of a younger crowd, at least.  Great jukebox, tasty food, and good specials.  They mix things up a lot - have you ever tried a Tang Margarita?  Maybe it's time that you did.    I haven't yet made it to one of the Quiz Nights on Wednesdays, but I have heard that it is the place to be!  They also have a Drink-and-Draw event every other Tuesday with live models.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-c_t-8ORqOZBuKE-jdY8aQ"
  },
  "ZnbwM6i9rI1fkAZIHaSovA": {
    "date": "12/31/2009",
    "text": "This is one of my favorite bars in Pittsburgh. The bartenders are fantastic. Even when the bar is packed, they do a pretty good job at getting to customers as soon as they possibly can. Once the recognize you as a regular, you'll get even better service. Be prepared, though -- they make STRONG drinks.  I haven't had much of their food or heard much about it, so I can't comment there. I generally enjoy the atmosphere and strong drinks as mentioned above. I also like having the option to check out the DJ/band upstairs. I like that the cover isn't paid by everyone when coming in the front door, but instead, only people interested in the actual event can go upstairs and pay the cover charge.  It's been fairly hit or miss there lately as far as how crowded it is. Your best bet to get a table is to go earlier in the night (8-9 PM), though, in my experience.  One last thing... I saw that someone mentioned in an older review not being able to stand the smoke at Brillobox. It's all non-smoking now, so that's no longer an issue.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "l2S62fnyODeQWChxhIsEjQ"
  },
  "ZQxNDHqzcnSCAVEZDJmIAw": {
    "date": "12/4/2012",
    "text": "When I was drinking some sort of alcoholic apple cider all night I knew this place was different  As soon as you walk in you might be a little taken back by your weir surroundings but take it in and revel in the fact that you are the best dressed person there.    I would highly recommend going to see a show just google the bands before hand and see if you like them.  The bands we saw were right up my alley and the last band playing wolf parade really made the whole night for me.  If your worried about hipsters I would say HEY QUITCHA WORRYING cause most of them were really nice.  Once after taking a break from the concert I walked back upstairs and showed the girl my mark to let them know I already payed.  She gave me the \"oh isn't that cute he wants to be nice\" look and I thought it was funny.  Also the bouncers remember you were already there if you step outside.    Overall I like good music but don't wear flannel everyday and I still felt welcome at this bar because of all the friendly people. Don't let it's hipster reputation stop you from checking this place out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yeXK5fSSFSXR4Pq_0mNG_w"
  },
  "0-FB0AgJ7p2QvZbN0FWf7g": {
    "date": "12/9/2007",
    "text": "Went here with a few friends a few Saturday nights ago, and we had a good time. I'll agree with Jessica that this bar is very un-Pittsburgh; I now reside in Chicago, and Brillobox feels a lot more like a bar you would find in Wicker Park than in the hills of the 'Burgh. Beer was pretty cheap and their appetizers (we had the nachos; a friend had the bean dip) were out of this world.  After an hour we went upstairs to the dance floor and I was kind of disappointed; apparently depending on the DJ they play either sweet indie rock or a lot of electronica, and we were there on an electronica night. Still, major props for playing a Madonna remix. I got my dance on.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "dhZkTd9cxYIlagRwGguqsQ"
  },
  "jQ4tCIGAS90qQyKFBVnRaQ": {
    "date": "8/1/2011",
    "text": "I've only been for shows, not food.  The venue has cool wallpaper and I like the window behind the band.  Very cozy.  I've been for a few post-rock shows, and once for an indie-pop band.  All good shows.  My biggest pet peeve with this venue is how difficult it is to hold a front row spot, even if you get there at doors and stand there the entire time.  I know this can happen anywhere, but it seems worse at the Brillobox because (1) the stage is less than a foot off the floor, so you can't hold your ground by leaning on it; and (2) the band needs to walk through the crowd to get on stage, opening up more possibilities for people to push you back.  Very annoying when you're only 5' tall and genuinely need that spot to see anything.  At the last show, the guy next to me actually put his foot up on the stage, but even he lost his spot between sets.  Aside from that, everyone else seems cool enough.  I've chatted with a few random folks, and they were all very nice.  And once the music starts, the between-sets annoyance wears off quickly.  Overall, I've really enjoyed all the shows I attended there.  And of course, if you're just there for a dance party, it's all good :D.  The one indie-pop show I attended was a lot of fun.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "8heSpevri02f06W9VeNz0g"
  },
  "EFBM-l26ul3SAFVSe82Bhw": {
    "date": "7/7/2011",
    "text": "Brillobox is many different things. On any given night it can be a bar, a restaurant, a dance club, a venue, a movie theater, or just a hipster-watching mecca. Some nights, maybe most nights, it is all of these at once.   The bar/restaurant portion of Brillobox offers mostly standard fare for this type of bar in the area. A decent draft beer selection that changes regularly at OK($6ish) prices, a food menu of slightly upscale pub grub(French Fries? Sorry, we only have 'Pomme Frites') - Appetizers in the $6-10 range, entrees in the $9-14 range, and a large liquor selection with some cool additions at times(Can't wait to see another vessel of pineapple infused tequila grace the shelves). To me the bartenders are friendly in general, as long as you don't waste their time, and they'll generally pour a stronger drink. The downside is that the best I can say about the food is that it is inconsistent - sometimes wonderful and sometimes bland. Also, the bar can get packed at times so don't always expect to get a seat. At a certain point in the night(8 or earlier), they card everyone at the door, so minors be aware.  Every Wednesday they have a Trivia night around 9pm that features a wide range of questions, including a video round and a name-that-song round. The trivia questions are usually well thought out - difficult, but not impossible with a diverse group(6 or less), and third through first competes for a free appetizer, a $10 gift card, and a $25 gift card, respectively. Ties are settled by arm wrestling.  Every Sunday at 6pm they have a $6 vegetarian dinner special that goes 'until they run out'. I have yet to attend this, but it is high on my list of to-dos. They also serve a brunch on Saturday and Sunday which I have not been to, and many other events throughout the week.  The venue/dance club portion of the Brillobox is upstairs and depending on the night usually opens around 8 or 9, and there is usually a cover to get in. There is no seating up here save for one vinyl booth, and table space is limited, so get there early if you need either one of those things. The upstairs is small, narrow, and loud, and tends to get packed, so if you aren't looking for a party, then don't bother coming up and paying the cover just to be miserable. On the bright side, if that is your kind of thing, then a dance party night is definitely a place to be. Shows here tend to be decent, and are always 21+. There is also a smaller bar up here.  The crowd is filled with the hipsters of Bloomfield, Lawrenceville and the Garfield Arts District, but I've never noticed much elitism among their ranks.  The music mostly caters to them - sometimes it has substance, sometimes it doesn't. If it's a dance party, you can't and shouldn't, ask for much.  In general, Brillobox offers a pretty fun time for almost any kind of night you're looking for",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "B5FTjNWSgkAQ9UjOKVjGhw"
  },
  "J8-VtMa8TTCk6woFGXHdCQ": {
    "date": "9/9/2008",
    "text": "I feel like we have reached a tipping point where, in calling the Brillobox a hipster hotspot, you are either a hipster yourself, or a parrot.   True: A lot of the DJ Dance Parties are stocked with the over-styled, over-funded, pretentious, Pittsburgh arty elite. It's \"a little bit of NYC in Pittsburgh,\" and we all sort of cringe when we think of that description ( I Hope!). If you love crazy dance parties and stylish posturing, stop by on any given Fri or Sat.   Also True: The prices are good. The beer selection is acceptable. I may be biased because I like the magic hat brewery and I seem to remember they always have 1 or 2 of those sweet numbers on draft, but the taps are clean regardless. The cocktails are strong, and they dial up beverages inspired by Tang on the regular.   The food is decent, though. I heard the menu was going all veggie, which wouldn't be a stretch for their kitchen. Every time I have eaten here, it has been delicious, flavorful, and tasted fresh & local. Go earlier to avoid the crowds. Go on a Sunday night for their $5 \"starving artist\" dinner (vegetarian till the food runs out) and stay for some quality brews and YouTube karaoke.   Quiz night is wildly popular. Take some friends, form a team, prove your mental prowess. The happy hour specials are decent. The atmosphere is well-suited for the \"artistic graduate student set.\" Good for a meet-up with old pals. Not a great spot to take your folks, but then, I have been trying not to go to bars with my parents lately...   One small thing: if you go on a quiet night, you can sometimes play patsy cline on the juke box. This is the surest way for a bar to win my heart.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pXrnDnTioMArO-wn6OF0Aw"
  },
  "28M0FmjfPKWz5BsbQiX-MA": {
    "date": "5/20/2008",
    "text": "I want to like to go to the Brillo Box.  I really do. The music, the dancing, the quirky events, the starving artist dinners.  Perhaps it's a little over-trendy, but it's not so trendy that I can't stand it.    However.  I cannot stand the smoke.  The smoke on the second floor is absolutely unacceptable.  There is terrible ventilation.  The only times I've truly enjoyed myself here have been when smoking is not allowed on the second floor.   It's so easy to fix too.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kl8AuylxMbwHrNB1TJa-7Q"
  }
}