{
  "wdkRoXQ7J5hhgy-Ml_9ffw": {
    "date": "12/26/2013",
    "text": "One of the best over all Chinese restaurants in the 'burgh. Great selection on the menu. Always seem to be quality ingredients.  I have been here many times ordering different items and have never been disappointed with anything   Staff has always been great and welcoming.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vgx-TZLq55PZnEumT-NOXA"
  },
  "43MLnph16-3e5vSNhMCiaQ": {
    "date": "3/8/2015",
    "text": "I know many people love and rave about this place. However, my first and only visit to Silk Road left me with horrific food poisoning right before Christmas. This ruined my holiday that year, as well as my love for General Tso's chicken for life.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "7C-jeTirZ5sDT4jUMl5nhw"
  },
  "2LJDnTpL7vLJNv7hAM1j0w": {
    "date": "8/15/2010",
    "text": "Note: They do offer delivery, but according to the menu, it is very limited. I'm guessing they only deliver within the neighborhood of Whitehall.  One again, Caste Village proves to be the South Hills' lost world  of well-kept secrets.   It's basically another suburban shopping center, but come here and you'll find some pretty cool places, Silk Road's Gourmet Chinese  being just one example.   From the outside, all you can see is a sign and a tinted doorway. Like most Chinese restaurants in the Pittsburgh area, you'd assume that the inside is modest with a small amount of dining space and that they mostly do takeout.    Well to think so in this case was folly. Probably the most lavishly decorated and spacious Chinese eatery I've ever gone to, I kept thinking there couldn't be much more to the place until I kept walking back. I almost wanted a guided tour!  Large, flat, abstract sculptures floated over our heads. We ate in some sort of enclosure made of brick and wood. When I peeked around the corner, I saw another enclosed area with circular ceiling drapes for privacy.   No, we were not in Highland Park. Whitehall, kids, Whitehall.   I was ready to give Silk Road 5 stars before we even started our early dinner. The fine Chinese fare only reinforced my preconceived rating.   I went with 2 apps: Beijing Style Potstickers and Skewered Sacha Prawns.   According to the menu, they use pork for the potstickers, and other than that, I have no idea what else they put in them. The potstickers compare favorably to Dormont's Amazing Wok which also have doughy wrappers and obscenely rich meat. There are 6 to an order, plated extravagantly on an artful, rectangular dish.  Pssst. I had forgotten how much fun it can be to eat-in at a Chinese restaurant. It's a totally different deal than takeaway.   My Skewered Sacha Prawns were also aces. I forget how many you get with an order (I think I got 6), and I cannot remember what the marvelous sauce was made of (the takeout menu is barebones in terms of info, but the in-house menu had all the details, and I wish I had photographed the pages or something, arrgh...), but they basically took something you'd get from a Strip District vendor, put it in a limo, and sent it to Mt. Lebanon. Sweet, savory, select.   They have desserts as well, which is uncommon for a Chinese establishment. I almost got the Fried Ice Cream, but instead me and my ladyfriend opted for the Milky Coconut Puffs, and we were glad to have made such an exotic choice. They were like a cross between macaroons and the Indian confection known as Gulab Jamun. Deep fried, honeyed, and not overly sweet, they were a welcome diversion from the sizeable decadence of so many other restaurant desserts.  Not that I don't love sizeable, decadent desserts, now.  I'm not wimpin' out on yas, but the Milky Coconut Puffs were a nice change of pace for me. I'm glad we rolled the dice.   As far as the service goes, the staff was efficient and attentive but were also a little harried, curt, and somewhat impersonal, as if they were really busy and were just trying to get us in and out. It didn't affect my experience enough to knock off a star, though.   Journey southward onto the Silk Road and find yourself cruising into a gastronomic Tian.   All right,  that was a little over the top. Just go. It's pretty frickin' good Chinese.",
    "rating": 5,
    "rated": {
      "funny": 9,
      "useful": 9,
      "cool": 7
    },
    "photos": [],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "cTPukGWyI2eHqBEnOG_SSg": {
    "date": "3/21/2013",
    "text": "Absolutely loved this restaurant...  Try the ginger roll, general tso tofu and the chicken with green bean......  Service is wonderful, nice atmosphere and plenty of parking if you don't mind the strip mall...  I highly recommend this place!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "oCoWpOCiTckIyFM6qhuKyw"
  },
  "HSy1zuLzFagKmTM4foGCXw": {
    "date": "6/25/2015",
    "text": "Sushi rolls are 75% rice, and for the price an absolute rip off.  Their Pad Thai noodles are the angel hair of Pad Thai noodles.  Their only saving grace is that fact they do not have any better competition in the area, and individuals who don't travel often do not know any better.  My friend liked their mango chicken, but I thought it wasn't any good.  He of course has never left Pittsburgh.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QMf-uity7_ox85hjLNmb2A"
  },
  "PZ10DOFlSSQH8LjN3zzUSg": {
    "date": "3/18/2015",
    "text": "This is by far the best Chinese Restaurant in the city.  The food is incredible and the staff is very friendly.  Whether you want Chinese food, sushi or hibachi, this is definitely the place to go.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "r0VNjfoS4t11OJH4Arghpw"
  },
  "KmdYLnEHZEZo1Ecjx-iIWw": {
    "date": "2/8/2015",
    "text": "Our first visit last night. Sushi was wonderful! We sat at the sushi bar and the chefs took good care of us. Unfortunately, we were never visited by any wait staff. I know the place was packed but all of us at the sushi bar were ignored and the sushi chefs were pulling double duty by taking our orders and getting us our checks. Despite the service issues, the food was great and we will definitely visit again--perhaps when it isn't so busy. Or maybe we will call In an order and bring it home.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "F6dZu6y0ts76_jxeqgOAkA"
  },
  "JeFJRHjqmfsjcVSOTMQtzw": {
    "date": "1/17/2015",
    "text": "If you're dining for two this is the WORST place to go! We sat there for twenty minutes waiting for our waitress to come to our table. If they have other tables that have more guests they spend all of their time pleasing them and forget about you. Food is great but the service isn't worth it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ej75ch9LFMm4bCZLbmFB2Q"
  },
  "D2CWsxU3k7jZtqd1wN0cPA": {
    "date": "2/6/2012",
    "text": "I know I've said this before but \"My Favorite Chinese\".  This tends to be our go to place when not sure what we want to eat and decide to go out.  So here it is, Saturday night and no plans.  Haven't been to SR for a few months, so we decide to go.  Yum, we were not disappointed.  There are certain items on the menu we tend to order and many are the Chef's specials noted on the menu.  The Egg Rolls were delicious.  The Stir Fry General Tso's is so good and does not have all the breading of the normal Gen. Tso's.   Another good thing is there are left overs for lunch!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "A3EnuZvRjgBVVdUj7lYl5Q": {
    "date": "9/25/2014",
    "text": "The Silk Road is one of my favorites, when ever I'm in the mood for Chinese we call the silk road and put an order in. I've eaten in there a few times and it's very clean and looks nice. The servers are all nice also. The prices aren't too bad and the portions are huge! I recommend it to anyone for great Chinese food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lD_8ob0NCminnct-xP1hTA"
  },
  "64Vd-wqC-UGnah5C-V2YRw": {
    "date": "11/4/2014",
    "text": "Great food, great service... Super surprised and pleased to find something so nice in caste village. Not much else to say.. The reviews speak for themselves!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QAu8AKKP3IePBFfPmHXdIg"
  },
  "2cU4E5jThIYBcu795llJhg": {
    "date": "7/2/2015",
    "text": "GREAT Chinese restaurant, really nice decor  and environment inside, friendly workers, fast service and really really good high quality food. I would definitely recommend this place to anyone looking for a good place to eat out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WP9e2YqFJRX_qIy_ThVkow"
  },
  "KPyIm9TKkIYiPpl5W-2OKg": {
    "date": "6/7/2015",
    "text": "Hands down the best Chinese food I have had.  General tso chicken fried or sauteed is amazing.  My husband gets a beef with scallions that he loves.  Decor is nice and the wait staff is friendly and prompt.  This is a must try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_-B4IHj-1kforTa4p4kwNw"
  },
  "NN2Ud63svAbPX7VUyVUycA": {
    "date": "9/27/2011",
    "text": "Service is excellent, food was very.good. I got general tso's, was crispy and not fatty like at some places. Rice was perfectly sticky, just how i like it. My friend had a stir fry of chicken, beef, and shrimp with vegetables, said it was very good. I also got the milky coconut puffs because of someone else's review...not a fan. Very strange gelled coconut center, batter dipped and fried, then topped with a sugar-peanut crumb mixture and honey.   The prices were reasonable, portions were big (i have lunch for tomorrow too).  I will definitely be going back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "70A6oonhct1PftwOtQfBCg"
  },
  "fwyFSHjBdOvH-fzkVva46g": {
    "date": "3/13/2014",
    "text": "You know, I have been going to this place for years and have never had a problem.  I typically only review places that I love because I wish all good business people the best.  I honestly believe the management of this restaurant has the best interests of the customer in mind but is facing the wrath of the all mighty landlord.  This episode began with my family's desire for the Hibachi experience at Silk Road which we have done a few times prior.  We went in and asked for a Hibachi table and were told it would be a twenty minute wait.  We did not want to wait twenty minutes to get waited on and although it did not seem busy, we said we would just sit at a regular table.  It was not crowded at all and we felt we would get waited on faster.  We sat down and waited about 15 minutes before anyone came over to get us drinks.  Our drinks came about 5 minutes later then the waitress disappeared for another 10 minutes or so before she took our order.  We all ordered entrees and were surprised that we were not asked what sides we wanted with our meals such as soup, tea, or what type of rice.  When we finally were served our meals, we discovered that there were no sides.  Most came with white rice .... period and if you asked for fried, it was a $1.50 up-charge.  I asked for celery to be added to my shrimp with garlic sauce and it was charged $1.00 extra to be added to the meal.  No soup came with the meal, no tea, nothing.  The meal was awesome as it always is, the service, the wait, the lack of chefs for the Hibachi experience, was not awesome and was just plain bad.  The restaurant is clean, the management is very welcoming and friendly, but over the years, the service, and the up-charges for regular sides, and other small details have made for a less exciting experience.  Honestly, I will continue to eat here because the food is good and the place is clean. It is just disappointing to see the effects of our economy taking hold of past favorites on my list of restaurants.Perhaps the Silk Road Fortune Cookie should read....\" Beware not to overlook your past successes as they may become your future failures.\"",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9iUVQEnIHZnMmvSvJPCDBw",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9iUVQEnIHZnMmvSvJPCDBw/o.jpg"
      }
    ],
    "user_id": "0xBrS_K7dxTB8kBRgTmPTw"
  },
  "v-MVTt0RZbksU-AfuMIQSg": {
    "date": "7/11/2014",
    "text": "Great tasting food no matter what I get! Favorites are the chicken lo mein and general tso's chicken. Generous portions too. Egg rolls and spring rolls are crisp and have good filling and sauce. Takeout is always done in 15 minutes and the place is well kept inside. It is also large inside and I have never had to wait for a table. Highly recommend for good Chinese  food everytime!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XWEbLpANMuEajGXWZ3_CEQ"
  },
  "PpuyUVtXXkXljxvdfEbOQg": {
    "date": "12/11/2015",
    "text": "This place has overcharged me TWICE for to go orders. The prices they have listed online are different than what they actually charge. When I noticed and said something the second time, the owner asked if I \"really want the server who took my phone order to have to pay the difference out of her paycheck.\" Thumbs down.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7B1TwO1-4lACZ7XNrWCPRA"
  },
  "u--7ANLMGgMYqatcZCgEBg": {
    "date": "7/14/2015",
    "text": "This was the worst service I have ever had in my life! The menu said noodles rice vegetables and ice cream for kids and noodles rice and meat of choice for adults! We only got rice only no choice and was never told about this. My daughter never got ice cream and then I was told the menu was wrong. Then my daughter and boyfriend were sitting there and the OWNER has the nerve to ask where her parents were and my daughter points to us and says right here. Because my daughter is mixed she tried to insult us because we were not in the nicest cloths gets make over 100,000 dollars a year. I tried to say something to the lady at the end and she grab my debit card out of my hand and slide my debit card never acknowledged me and said nothing. I am so disgusted with my purchase Chinese is my daughters favorite and I will never return for food here again! If I could give this place a zero I would. The most ignorant rude and unprofessional people I have ever encountered. I do not recommend to anyone!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "quP16hbZDREdhwpateyCZQ"
  },
  "K3ObT7V2phytTcR8KSjuKg": {
    "date": "6/7/2014",
    "text": "This is our favorite Asian restaurant in Pittsburgh. I would suggest the Amazing Roll and the Mystical Vegetarian. A+++",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4HaOKJWATCCZoR8KcEzU3w"
  },
  "iM0egtLmNe-_5QRQgDaT0A": {
    "date": "1/9/2014",
    "text": "Totally love this place. They have the BEST chicken egg rolls I have ever had anywhere. The fried rice is so tasty as well, I always get the pink shrimp sauce with my rice. Yummo! Love the staff, they always remember what I will order every time. I try to get here as much as I can. I would recommend it to anyone looking for great Chinese food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "H4sowuhvnTan0d2ZeVrOkw"
  },
  "FX8he-NnScOm0r4l9h4jgg": {
    "date": "1/28/2017",
    "text": "The food was very good, but I haven't experienced that horrible of service in years. No host stand made for an awful experience on a busy looking night. However we discovered most of the people were standing around waiting for take out. We were able to get our name in with a worker behind a bar. And then couples walking through the door started getting seated ahead of us. After pointing out that we were skipped we were seated about 10 minutes later. It then took us 15 minutes to get a menu and at least 20 additional to put in a drink order. Our food eventually came out 1 hr+ from been seated. It was still like pulling get teeth to get any attention while eating so we finally gave up and got boxes 15 minutes later. I may order delivery or take out again, but will not ever dine-in there. It is a shame because it is a nicely designed restaurant.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hZfutVo1FySj4_sl1DgkLA"
  },
  "vt0Xc2YcipdRd1NJGT3ksw": {
    "date": "8/24/2016",
    "text": "Not sure what everyone else is finding so special about this place.  Granted, the at atmosphere is nice, but that's about where it ends. Four of us showed up at 8pm on a Wednesday evening. From the hostess to the hibachi cook, service was terrible and slow - - lack of drink knowledge....sushi ordered as appetizer never arrived before dinner.... soup and salad plates not cleared.... Wrong food items distributed to wrong people by Chef.....one bottle of non-alcoholic beer in the whole place.  And the food was marginal at best.... Wonton soup was ok... Ginger salad dressing was watery and bitter.... Seafood and steak cooked with WAY too much soy sauce.... Rice and veggies were ok.   I definitely won't be going back here for hibachi anytime soon!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UbDf--9fk_q5-bEdQ_oC9g"
  },
  "fTQhNlF__OBPQdfZFaN6qg": {
    "date": "1/9/2017",
    "text": "Delicious Chinese food!!!   The Kung pao chicken is really good.  They also have the best hibachi in Pittsburgh in my opinion.  Definitely worth a visit",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "64wygRIVMtyJtViyN-5OQw"
  },
  "_tmlg2bjDji8QA14LVzeAw": {
    "date": "5/14/2016",
    "text": "I ordered food to go last night. Food tasted terrible, nothing fresh and overpriced...I couldn't eat for second bites, had to throw away all of them. So disappointed and never come back. One advice if you want to waste your money and eat the bad food, this is the place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "kkS5sC1i-Er-MPxOBcHUTQ"
  },
  "Q9TjY6GXVEQJgp2acH1Mog": {
    "date": "10/5/2016",
    "text": "Excellent food liked just as much as Rice Inn.  Recommend shrimp/scallop general Tsos and shrimp Pad Thai.  Both very good.  Didn't like waiter touching top of my glass when they give no straws.  Had to wipe clean before drinking.  Just sayin",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p9V3QHJi3XSb6ga4qf2HRQ"
  },
  "6eIrR3pUlOfvNIcOloNl2A": {
    "date": "7/1/2016",
    "text": "Went again tonight and tried the pineapple beef. Awesome! Actual slices and chunks of beef- not cheap meat like you'd find at a Chinese delivery place. Lo Mein would've filled 4 plates if we made it that far.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "67ci-zI-Z6ABxAxTJRsd_Q"
  },
  "Wvu2ro6D2d_ib1hgR_OKeQ": {
    "date": "8/8/2015",
    "text": "Great food; a little too fast on the service. It was too fast, in the sense that it felt that the food wasn't fresh, that it was already cooked. It literally took less than five minutes from order to getting the food to my table.  Aside from that, it was great and will visit again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MEXVE2ClUaHZ0li3EIR1-A"
  },
  "gQtCORUbdrEJuZu_k1Y_ZA": {
    "date": "2/13/2016",
    "text": "We had such a lovely couples dinner last night at Silk Road. We've heard great reviews from friends and online so I've been dying to try. First, the staff at SR is so welcoming and friendly, I almost felt like I was with family. Their menu is quite extensive and fairly priced. We ordered a variety of options and no one was disappointed. Appetizers came out in perfect sequence and no one felt rushed between apps and dinners. Waters were also constantly refilled. Lots of leftovers so we can continue to enjoy our meals. I can't wait to go back and try more!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "jCerZmbitsWZsHKIe_VbKw"
  },
  "E_m9K7zgi8YWbWjhk0wdjQ": {
    "date": "12/17/2015",
    "text": "Usually big fans of Silk Road until yesterday. My husband and I decided to have the hibachi for dinner, we both ordered the scallops. They cut the scallops horizontally in half (probably to save money) and the \"chef\" cooked the super thin scallops for about 10 minutes before drenching them in teriyaki sauce. My husband asked if we could have normal size scallops and the manager made up excuses and was not accommodating or even seemed like she cared. More disappointed in her reaction then the scallops we wasted. Will definitely not be going back for while :(",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "qVlyiC1FfSIBjSMCJOCHDA"
  },
  "oCrZ2RkOfhG30nLudn0NzQ": {
    "date": "2/15/2016",
    "text": "I can't believe I waited this long to try Silk Road! Let me say that if you did not like Silk Road when it was on Bower Hill Road, you need to give it another try. The atmosphere was beautiful and open. We were asked by everyone who walked by if we needed anything - not just our server. But it didn't feel intrusive at all. When I opened the menu, I couldn't believe the prices which were very reasonable. I'd say $18 was the average for an entree. When the food came, I was even more pleasantly surprised. I had to force myself to box some of it up so that I didn't get too full! We will definitely be going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "VaxZDy9sOmFT8w-pilWG1Q"
  },
  "9ZW-EExvhEhwRjYhc4bofw": {
    "date": "2/3/2016",
    "text": "Great Chinese food AND they deliver.  Like others have said, it's buried in Caste Village (across from Giant Eagle).  The inside is modern and clean, but I only entered to pick up food I had ordered earlier.  Our second experience was takeout, which was fast and food was still hot.  I am a fan of the Chicken + Walnut--it's in a lighter brown sauce with water chestnuts, broccoli, peppers and the honey glazed walnuts make it.  My husband got the Beef with Scalliions--which is exactly what it sounds, but was actually delicious and fresh.  We had General Tso's (which they made with all white meat for me) and Chicken Lo-Mein--which were both great. The GT sauce was more tangy than sweet, which is not my preference, but it was still delicious.  There's so much of the menu I still need to attempt, so keep those recommendations coming! I highly recommend this place if you live nearby or are in the area.  Great price, awesome food.  Update: We've explored the menu more.   1) Clay pot chicken:  the eggplant was cooked well and the garlic sauce was fine, definitely not spicy.   2) Mandarin chicken: Meh. Lots and lots and lots of Spanish onion.  Must love onion.  3) Milky coconut puffs.  Will not get again.  Square chunks of almond custard--which was flavorless and a grainy mushy texture in a moderately fried shell.  The sauce was honey which was thickened with sugar and was disgustingly sweet and not spreadable.  It made the fried dough soft.  There were a few peanut shards sprinkled on it.  I can't recommend this. Unless you don't have taste buds.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YPyrFh8AImi-sgLDbt1-8A"
  },
  "LnCRjuAk8wi5s3ZiWLAtUw": {
    "date": "9/11/2011",
    "text": "I love Chinese food. There I said it. Now I can get this review properly underway.  I'm not that familiar with the south hills because I'm a city kid. I don't venture outside unless I have reason to. A friend invited me out that way for dinner here knowing how much I enjoy Chinese food and she said she just knew I would like it. Boy was she right.  Silk Road is located in the heart of Caste Village in Whitehall (which that itself I need to explore more). It's modestly decorated and basically looks like your run of the mill sit down Chinese restaurant.  Every time I go to Silk Road I order the following:  Appetizer: Spicy Wontons. I was turned onto the spicy wonton at Silk Road and have been loving them ever since. It's the traditional wonton from your wonton soup with a spicy peanut sauce. I believe you get 8 of them for $6.  Snack: Egg roll. They probably have one of the best egg rolls ever.  Entire: Pineapple beef. I NEVER order a beef dish when I eat Chinese except for at Silk Road. The pineapple beef is probably THE best Chinese meal I've ever eaten. I feel horrible because I feel any description I give it will not to it justice. The portion is enormous so no matter how greedy I'm feeling there is always plenty to take home (side note: I always ask for extra rice)  Dessert: Fortune Cookie, duh.  Please, please, please go eat there! And maybe try something else because I'm not sure if I can be persuaded to change my order anytime soon.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 5
    },
    "photos": [],
    "user_id": "dsX3MiQiTy3OVI8MKn0I4w"
  },
  "zjwLcSoZlrJxJDHwuewXgA": {
    "date": "4/18/2017",
    "text": "Was in town visiting family and tried their rolls. Had a simple but delicious and fresh California Roll with the Avocado Eel, which was equally fresh. The woman who took the order was super friendly and the order took a reasonable amount of time to appear. Def recommend if you are looking for fresh sushi",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tLjmkKHf8yKwMW3uEXbc1w"
  },
  "ffKMtfHTufZ6W6n4kEPodA": {
    "date": "12/9/2015",
    "text": "Really good hibachi dinner. I got the chicken and my husband got steak and shrimp. It included soup, salad, fried rice, and vegetables. Everything was perfect!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "usABOW5RfMsVH1BViNrCgQ"
  },
  "vvi-pCAsTLVAgTLC8LI97w": {
    "date": "12/8/2015",
    "text": "This is a quality restaurant tucked in a little shopping plaza, so there's always good parking available. I've eaten in several times and have not had complaints. The owner is nice, the staff is very polite and friendly, and the food is prompt. The ambiance and decor are beautiful and create a feeling of intimacy, and the music is soft and relaxing.  I've tried a good portion of their food, ranging from the appetizers, soups, lo mein, and chef specials. They're all very delicious. I'm particularly fond of the general tso's chicken/shrimp and sesame chicken/shrimp. I've tried a couple of their special sushi rolls; I can't remember their names, but again, they tasted yummy and fresh. I have yet to try out their hibachi which is attached next door, so I can't speak on that.   The only disappointment I have ever experienced from this place is when I ordered delivery twice. First off, delivery is prompt. It took no longer than 20 minutes both times. But for some reason, the general tso's chicken tasted mushy and old when it was delivered. I'm guessing it was from the heat trapped in the container when it was being delivered? I'm not sure. The chicken sort of fell apart into pieces when I put my fork in it, and it did not taste good. Because of this, I try to eat in only, or order something that is not battered when getting delivery. This is the reason for the 4 stars instead of 5.  So overall, I certainly recommend this place. Definitely check out Silk Road if you haven't already.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jqmaBlwq5Zy3kwSYEScRsA"
  },
  "WAGDf0nX6S1ajsIvmdLAgg": {
    "date": "12/3/2015",
    "text": "Absolutely love this place. The food is top notch quality at a lower price than other Japanese steakhouses such as Saga or Nakama. I wouldn't put it on the same level as Benihana in terms of experience but its great. Everything on the menu has fresh ingredients and no matter what protein you order, its gonna be a good cut of meat. The chicken is tender, lightly fried and and doesn't get stringy like the cheap meat that most places use. Haven't had their hibachi yet but their regular menu is perfect for what I want. Anyone looking for a high quality but really delicious meal should order chicken fried rice with a side of the shrimp sauce. Its not cheap but you'll want to eat it everyday. I can't wait to come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ylXy0YLMOKj7wWO9OjG6eQ"
  },
  "JGY-7IgQ1j1xBzUJAoRCOw": {
    "date": "10/15/2013",
    "text": "Out of 5:  1.0 - egg drop soup: way too salty, perhaps from evaporation 2.0 - hot and sour soup: not too hot or sour.  Good and subtle taste, but lacking texture (lack of corn starch) 3.5 - pan fried noodles 3.0 - clay pot chicken 3.5 - long grain rice",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "GvHK50CjK0Fr9i3YAM6gAA"
  },
  "2o6JqiIa_EpHHSdMtIXiPw": {
    "date": "6/15/2015",
    "text": "Hello my new friend....Wow.  Just had dinner there at the behest of friend who recommended.  So glad we did.  Nice place, classy and clean!  Had  the hot and sour soup to start - tasty, hot and spicy, then fresh spring rolls, crunchy and fresh with nice dipping sauce.  My husband had the stir-fried (note, not deep fried chicken doughnuts) General Tso and I had the spicy beef with broccoli and cauliflower.  Outstanding.  Fresh, spicy, beautiful and just well done.  Service was wonderful.  Our server was charming and helpful.  We will return, soon I'm thinking.....",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "duaJxYWc5pxKuYll6L7sOg"
  },
  "Oq6CdwxFICxAn0BRjsDFeA": {
    "date": "6/30/2016",
    "text": "This place has gone down hill.. Terrible customer service and it's very slow.  There was barely any customers and it was still slow.  If you have a food allergy, don't bother.. The third time they finally got it right.. Don't waste your time or money it's terrible.. There's better places out there",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "A4B1lAZhqc6h_etKRc05dA"
  },
  "5wn3K3UM3_jbTjECVEF_hg": {
    "date": "6/19/2014",
    "text": "Great food and decent service on our first visit. Sushi was very fresh and tasty. Wish they weren't out of the Spicy Won Ton, was looking forward to trying that appetizer. Will definitely come back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0BZqqr0a_ULd5f-xkyajaA",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States. Great decor and very clean",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0BZqqr0a_ULd5f-xkyajaA/o.jpg"
      }
    ],
    "user_id": "pgowTZSEQp8WpQz4Yhhs_A"
  },
  "J7zhBrl32wOxK8wOHtNxoQ": {
    "date": "4/16/2014",
    "text": "This is one of our favorite Chinese restaurants to dine when in Pittsburgh.  We have had numerous items on the menu and you can't go wrong.   The sauces are all great, the food is fresh and the quantity is large.   Also, everything is served hot (temperature), which is a big pet peeve of mine, so I love it here.  You could easily share one entree, but we like the leftovers for lunch.  Service is excellent and prices are reasonable.   This could be a place you easily walk or drive by and think nothing of it, but you should take the time and search it out.   You won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "AXBsPgSbyjGkAqPLSwiTYg"
  },
  "oIUYYgKFOKiquH82v4OLPg": {
    "date": "8/15/2018",
    "text": "Best Chinese food that I have found in the area.  Great menu, fresh ingredients, nice atmosphere, good service and decent wine selection. We had the Silk Road Sole and early bird shrimp with vegetables.  Both were very good and we loved that both meals came with lots of fresh veggies, not just 2 pieces of broccoli like a lot of places.  Definately returning!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xfcNM10L2bi1MMXS7D__6w"
  },
  "iFxnqko5xATx3_dGxCWSkg": {
    "date": "2/8/2018",
    "text": "Love love love their sushi. This is our favorite sushi place in all of Pittsburgh. Their hibachi and Chinese is very good too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tQnk-w4DAppSpFvLrQZE9A"
  },
  "QViQA3PKspNgYAaXKpM7UA": {
    "date": "1/29/2017",
    "text": "3 stars because service for dine in is a 1, but the food is a 5.  I recommend getting take out if you want to try this place.  We waited for over 20 minutes to be seated and realized they weren't going in order of arrival.  When finally seated we had no menus and had to wait another 5 or so minutes for those.  Drink order about 5 minutes later.  Food order about 15 minutes after drinks came.  Food arrival a good 45 minutes after being seated.  The food thankfully made up for the ridiculous wait, but by that point we were out of drinks and even after asking for refills waited another 15 minutes or so for them to arrive.  The waitress constantly reminded us that \"they were busy\" which began to make us feel like an inconvenience to her since it never was accompanied with an apology for the wait.  Now the food was excellent.  I highly recommend the spicy wonton appetizer (not very spicy at all) in the peanut sauce, wonton soup, and cashew chicken.  All were very good and I would consider getting them via takeout in the future.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "35RyoPGV6El0AaJwNsGCBg"
  },
  "UkfDS-lRWC3JHD1eLvXU6Q": {
    "date": "9/6/2013",
    "text": "I had take out, and sometimes you just taste better in a restaurant than at home.  We tried crab Rangoon, which was meh.  The standout was hot n sour soup which was flavorful and full of veggies.  The general tsos tofu was listed as a specialty of the house.  I love tofu but only when its fried or pan seared.  I specifically asked does this have steamed tofu in it because I don't like steamed tofu and the woman on the phone assured me that it was fried, not steamed.  What I got worried diculous leak unnecessarily large chunks of steamed tofu covered in a sauce that was pretty good but had the overall consistency of slime.  So bad!  I'd come back, but I'd get something else.  So far I have found this place to be overpriced and underwhelming but I'm willing to give it another try.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "t-51IAO6IZml_hU0kbkwEA",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States. General Tso&amp;#39;s tofu.  Ridiculously slimy tofu in a pretty decent sauce.  I really wouldn&amp;#39;t recommend ordering this",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/t-51IAO6IZml_hU0kbkwEA/o.jpg"
      }
    ],
    "user_id": "PD3X7S70zXHeOx1NjeicjQ"
  },
  "YzbSdEC5-35JHb-81mWOkQ": {
    "date": "2/2/2018",
    "text": "Probably the best Chinese I've had in years, especially since Sesame Inn went downhill ages ago. Everyone on staff is friendly, the menu has the classics of American Chinese cuisine but has a lot of original, unique dishes to choose from as well. Have eaten here several times now, and I can say that the high quality is consistent! Will keep going in the future.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kn24voDYweHbhp6NEuYx1Q"
  },
  "WusuUkYiI2qelhAQeX4mdw": {
    "date": "1/19/2017",
    "text": "Silk Road is fresher than any other Chinese restaurant I've ever been too. As a vegetarian, fresh vegetables are a must. My veggies are always brightly colored and still crisp. Make sure to specify that you are vegetarian.... I've ordered vegetable Pad Thai a few times and was disappointed that it had chicken in it. Their sushi is just as fresh. I try to be careful with what I eat and can even have the hibachi without feeling guilty. They are always happy to prepare the food to meet my needs. It's also really nice to support a family owned restaurant with a very hands on family.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YEaYdTrF2JVebGbPVe5K6Q"
  },
  "04uopa-KGDUwwBHGO8DeTg": {
    "date": "11/18/2017",
    "text": "Service was slow despite the fact that there were tons of workers around.  Food was even worse.  I've gotten take out and dined in, each time It keeps getting worse.   We had the Pad Thai and Lo Mein, I love noodle dishes and order them often, this was the by far the worst.   I'm not sure what's going on with this place when it first opened it was great, but over the past 3 years the food has gone downhill.    Also super overpriced in my opinion.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w6UETLBvimcxfKkiMt5UOQ"
  },
  "Oo1XtvSJqWL8OMRtbJttwQ": {
    "date": "3/26/2015",
    "text": "I'm so sorry I neglected to take pics of our wonderful food.  I was too busy devouring it to bother with remembering to photograph it for my review.  I have to admit to not knowing where the heck I was in the scheme of Pittsburgh neighborhoods.  I had work done on my car nearby so Yelped for restaurants in the area.  This one caught my eye with its reviews so here is where we ended up. (BTW, Yelp directions lead you across the street at the Giant Eagle scratching your head until you ponder and think, well, maybe it's across the street in the strip mall.  Sure enough, we found Silk Road there with only \"Silk Road\" on the banner atop the restaurant entrance.)    When you step inside, it's so much more than any ordinary Asian restaurant.  The decor and ambiance are top-notch.  Our server was quick, efficient, and pleasant.  Our food arrived quickly and there was an abundance to spare (so much so, we ended up taking quite a bit home with us).  I ordered the Moo Shu Pork and my husband ordered the Szechwan Chicken with Garlic Sauce.  Both dishes were absolutely wonderful both in presentation, quantity, and flavor.  And the prices were good, as well, 13.00 and 12.00, respectively.   Love this place and wish it was closer to home but I can see myself making a special trip to return.  It was just that good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "GMKoemATfrXg1deaXxt2jA"
  },
  "fLM3uDEVuJysZ8JbezQwpw": {
    "date": "6/15/2018",
    "text": "Everything was great. Upon entering we were greeted nicely and speedily taken to our table. The service was second to none. Our food came out within minutes and it was extraordinary. I would definitely recommend this place to anyone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RVCWanYGmS5grqQJc5m-vA"
  },
  "xlB1iFMtPS_Lr8ojq8Bsqw": {
    "date": "7/26/2017",
    "text": "Silk Road chicken dish is so delicious and the sauce is filled with flavor. Great sushi, dragon roll was ... great service too",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "XlzKcSwC6R4W_2EIjbu0UA"
  },
  "UZ21BZ1v5wEPYcmduPnDsg": {
    "date": "1/11/2015",
    "text": "This is a Vietnamese owned, Chinese and Japanese restaurant. All I can say is, \"wow\". Usually, the restaurants that serve different types of Asian food aren't very good, but Silk Road is on point. If you are looking for authentic Chinese and Japanese food, this place is not for you. If you are looking for Americanized Chinese and Japanese food, this place is for you. Everything is cooked very well and tastes delicious. My boyfriend and I frequent here for Chinese food.   The service is also very good. It was madness on New Year's Eve. We placed a very large order for sushi and Chinese food. We were surprised when they said only 45 minutes. We came and picked up, it was a full house and a ton of takeout orders, but everything was done quickly and correctly. The employees, despite being under a tremendous amount of pressure, were courteous and efficient.   I definitely recommend this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "snpRU4OG_HmIRofCjRLz2w",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States. Godzilla roll, Futomaki roll, and General Tso&amp;#39;s chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/snpRU4OG_HmIRofCjRLz2w/o.jpg"
      }
    ],
    "user_id": "4yR91m8fSLHTBGvPeHJHOQ"
  },
  "ee1mbqdYqz9MOFNOuDAlcA": {
    "date": "6/8/2016",
    "text": "Excellent food for the price. At ones very crowded so give yourself a little time but it's one of my favorites.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "7FmHFmKsaUKyAHwdMqG2aw"
  },
  "N-1XMYgtXITA0YyrdutKEw": {
    "date": "4/20/2018",
    "text": "I get Silk Road at least once a week.  I enjoy their Chinese dishes, but really like their sushi.  The lunch special is a great price and always fresh.  The staff is extremely friendly and this is one of my favorite places for a quick bite in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nPfk8oc6YHNIdrIg2aTkMA"
  },
  "dIgBbbpfzK4RR0B318y2VA": {
    "date": "6/29/2014",
    "text": "I was visiting family in the area and I needed to get my sushi fix so I found Silk Road on yelp and headed over to try it out. I got a to-go order with a variety of things because there were so many things on the menu I wanted to try! The guy at the front of the house was so nice, and he was very personable with everyone that came in asking about their dog, business or the football tryout. Clearly the repeat business is solid (and for good reason) but I love a place that cares about its customers! The restaurant itself is attractively decorated and not at all what you'd expect in a strip mall! Now let's talk about the food!   Spicy Tuna Roll - I was reassured it wasn't actually spicy, which it isn't. It was SO GOOD, especially the sauce with just the right amount of crunch.   The Amazing Roll - Well what can you say except it's amazing! I see returning for some more in the near future!  Mango Heaven Roll - It was good but a little too overwhelming on the mango side for me, but if that's your thing, you'll love it.  I will definitely return because I still want to try the mummy roll, pink lady, complete chaos (one of my friends went the night after me and said they loved that one!) and of course the sexy model. For all the rolls, I liked the rice they used, plus everything was fresh and packed nicely.  Egg roll/Shanghai Roll - It was good, nothing to write home about. I preferred the Shanghai Roll.  Eight Pearl Duck - mouthwatering and delicious! Don't be deceived by the amount of veggies on top, there's A LOT of duck underneath and it's cooked perfectly. Also in the dish is shrimp, crab meat and scallops which you might not think go together but it works. Veggies were steamed and fresh.  Chef Wu's Lamb - This dish was a smaller portion size which I think is fine if you are going to be getting a sushi roll or another appetizer. It was cooked well but the real star of this dish was the sauce! So good.  Don't think about it, just go! You won't regret it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "luJvYWTE_9U8qLgFqL4pBg",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States. Spicy Tuna Roll, Mango Heaven, Eight Pearl Duck, Chef Wu&amp;#39;s Lamb &amp;amp; Amazing Roll",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/luJvYWTE_9U8qLgFqL4pBg/o.jpg"
      }
    ],
    "user_id": "wGl9Cr2srF3gzutYVFvbww"
  },
  "3JeK6FfypI4nTiB67gi3Lw": {
    "date": "6/11/2017",
    "text": "Amazing decor, doesnt feel like your in a strip mall at all. I recommend wearing pants or bringing a sweater bevcause they keep it cool in the summer. They offer authentic chinese dishes off the menu.. if you know of a dish it doesnt hurt to ask if they can make it  for you :).... also the sishi is amazing. The best in the city... they use high quality ingredients and their sushi guys are trained in newyork and asia.... try the natruto roll for a low carb option or thr steamed salmon with broccoli!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aI5bKMFYMPD0eg3PGaiB8g"
  },
  "E7IBFKznkV4Sb1PYy4K8yQ": {
    "date": "9/4/2015",
    "text": "This is hands down the best Chinese restaurant in the Burgh. It's tucked in to a small shopping plaza called Caste Village. It's decorated beautifully. It's gives a nod to the traditional Chinese but takes it to a contemporary level.   One of my favorite things to eat here is the Egg Drop soup. It's unlike any that I've ever had. Instead of being a bright almost neon yellow with egg floating, this is an off white with pieces of chicken, carrots, mushrooms and tomatoes, along with some egg. I'm drooling just thinking about it.  My favorite dish to eat is Cashew Chicken. It's carrots, celery, peas, chicken and cashews in a clear garlic-y sauce. I also live their General Tso's which you can get traditional that has a coating and is fried or you can get it without the coating. Going without the coating saves you a few calories and makes better left overs since their is no coating to get soggy.  A couple of years ago they added sushi to their menu as well as Hibachi tables. I haven't had their sushi but their Hibachi is very good.   Their waitstaff is very nice and they make sure you and your table is well taken care of.  Great food and great service!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "b20PYBePMhqeJHNivyxSmw",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States. Cashew Chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/b20PYBePMhqeJHNivyxSmw/o.jpg"
      },
      {
        "img_id": "9C7PEVemXrhRnIjWPOhckA",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States. Cashew Chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9C7PEVemXrhRnIjWPOhckA/o.jpg"
      }
    ],
    "user_id": "5JVY32_bmTBfIGpCCsnAfw"
  },
  "Kv5kMHaChLnxeGBJizdQ8w": {
    "date": "5/1/2015",
    "text": "Tonight we had the combination Pad Thai. I've ordered Pad Thai at other area restaurants. (My wife and I don't like a lot of heat- when given the option, we choose mild). It's not that the Pad Thai at the other restaurants was not good. But the Silk Road's Pad Thai was so much better that the meal alone deserves a five star rating. The ingredients all LOOK the same, the noodles are tender, the chicken and shrimp delicious, but the flavor puts it in a league of it's own. We've always been pleased with whatever we've ordered at the Silk Road. But, for a real treat, order the Pad Thai.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "l1n_55QxX5p8XLeykbCJxA"
  },
  "XOhJ6ekntfOs9SzvHdrYVg": {
    "date": "12/29/2016",
    "text": "Great place hidden in Caste Village Shops. Nicely decorated and clean spaces throughout. Especially love the General Tso's Shrimp and Scallops-generous portions of LARGE scallops and shrimp with a great sauce and lots of steamed broccoli. My wife had the Walnut Shrimp which was delicious as well. In-laws had the Triple Delight (shrimp, chicken, beef) which was a huge serving and the General Tso's Chicken, both winners! Definitely give this place a try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xkTO2AWcC-9StbEKwoL0Dw"
  },
  "kAB8f7CA96HZtekDV4R5xw": {
    "date": "5/23/2016",
    "text": "I have eaten at the Silk Road for years. My meals have always been very good in the service has been excellent as well. Unfortunately, service lately has been terrible. The last time we visited not only did the server fight with my wife about giving our children plastic cups for kid's drinks, the food was prepared incorrectly as well. At the end of the meal you receive a bill in on the bill will be the word party which they say is the gratuity but beware because this seems to be calculated at their own determination and not based on any normal percentage. I'm not sure I'll go here again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "CC8CjFzY8YjqFsFoCmp69A"
  },
  "20HLMw7vCHG2B_wmLsotNw": {
    "date": "7/26/2016",
    "text": "I love Silk Road!  It's not far from where I live so I'm here to dine in or pick up takeout to satiate my constant sushi craving about once a month.  My SO and I strolled in last night around 9:10pm (they close at 10) and were the only people in the restaurant. Part of me felt bad because they probably thought they were going to have an early night, but they rolled out the red carpet for us.  The service was just as excellent as it always is, our sushi arrived quickly, and they even turned the music back on for us so we weren't sitting in silence.    Having worked in the restaurant industry, I remember how frustrating those straggler customers can be, but the staff here treated us as they would any other customer.  The one gentleman, I believe the sushi chef, checked on us multiple times.  We made sure to give high praises for our sushi selections, as they were all excellent in flavor and preparation.  I started off with the tuna avocado salad, which is always a treat.  Iceberg lettuce topped with thinly sliced avocado, raw tuna, and spicy mayo.  I could eat this every day!!    For our sushi selections, we decided on the the Ginger roll, Naruto roll, and tuna avocado roll.  My favorite was the Ginger roll, which caught my eye on the menu and I decided to give it a shot. I'm extremely glad that I did because it might be my new favorite roll of all the sushi places I frequent!  They use the perfect amount of rice in their rolls here, though one of the rolls we selected (Naruto roll) has no rice at all!  It's a thinly sliced cucumber rolled with tuna, salmon, and yellowtail. All three of our rolls were fresh, light, and just filling enough.   Even though my experiences here have always been top notch, I've seen some less than stellar reviews for Silk Road and I'd encourage people to give this place another go or look past the dated reviews and experience it for themselves.  My boyfriend has been coming here for years and has remarked lately how much it has changed for the better, from the staff to the menu.  I always look forward to visiting this establishment and plan to check out their hibachi offerings during one of my next visits!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 11,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "dIp6QtU_mkKQ0yij6GQPzg",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States. Ginger roll - this caught my eye on the menu and I&amp;#39;m glad it did. One of the best rolls I&amp;#39;ve ever had!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dIp6QtU_mkKQ0yij6GQPzg/o.jpg"
      },
      {
        "img_id": "fdO1D0EiUJUMWpwbo4cUYQ",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States. Naruto roll - cucumber roll filled with tuna, salmon, and yellowtail. Excellent!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fdO1D0EiUJUMWpwbo4cUYQ/o.jpg"
      },
      {
        "img_id": "DoALgioNtPZiX3uzoiXQtQ",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States. Tuna avocado salad... Just lettuce, tuna, avocado, spicy mayo. So light and yummy!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DoALgioNtPZiX3uzoiXQtQ/o.jpg"
      }
    ],
    "user_id": "fp6wXrr5r3poOg6YhL4yvQ"
  },
  "32rgzLdvZ4vV0I0tVDjbTg": {
    "date": "9/22/2016",
    "text": "I've only been here to order take out so I can't speak of the dining in experience. I usually get sushi and for my fiance I'll usually get him the general tso stir fry chicken. They do have regular dining and hibachi setting available inside.    On this particular visit I just got sushi and shrimp dumplings. Their sushi is always very fresh. There menu says it comes in daily from Hawaii. I usually like all their sushi except this time the eel tsushi I got was a little soggy. It wasn't bad enough that I didn't eat it! I also got the rainbow roll which was great. The shrimp dumplings weren't for me. They were bland and just rubbery chewy. I'll never get those again!   They also delivery if you live close by. And delivery is pretty quick.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "uZtcLM_ean7NiDKY-1HB0g",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uZtcLM_ean7NiDKY-1HB0g/o.jpg"
      }
    ],
    "user_id": "WgEKUJoh5msZlOlTCKnKtg"
  },
  "mpfjt0KUHJgw2Uy5szhWog": {
    "date": "10/7/2017",
    "text": "As I sit in the restaurant I'm tempted to give them a higher rating because of the food however, the service was so appalling it took all enjoyment out of the meal.  To start with, the waiter never asked for our drink orders. A simple mistake that could have been overlooked had he not later disagreed that I had not ordered ikura and brought out something different. He proceeded to stand over me, taking the plate while yelling to someone else at the table. I have PTSD and anxiety and this was a trigger.   The photo attached is everyone having their meal brought out except one individual. The waiter had forgotten to bring it out and took another 5-7 minutes to do so. He barely gave us time to eat before asking for if we wanted boxes.   Good food, disgusting service.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zjy1qPEygmnfD4AqPT3QDg",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zjy1qPEygmnfD4AqPT3QDg/o.jpg"
      }
    ],
    "user_id": "QL9C8e15CGQFsLo3r_Ab4A"
  },
  "yOJgY3EUYbhQiEgKKFLHew": {
    "date": "2/6/2018",
    "text": "Their sushi is the best. I don't really care a lot for their Kung Pao chicken. The sauce is very watery. But their sushi is what's up and there's not a lot of options around here for good sushi.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jet0QZQqYFQkvyzLZbFBQQ"
  },
  "ztuGjEhnMYj7KwWVG9DF9A": {
    "date": "4/8/2018",
    "text": "Love it here. Been going for years and the food has never been short of delicious! Ma la string beans, stir fried General tsos, eccentric chicken breast, & beef with banana peppers are my personal favorite! The sushi is pretty good too, and although I haven't tried it yet they also do hibachi. The restaurant itself is very clean and decorated beautifully! The only reason it's short a star is because the service can SOMETIMES be iffy. It's also is AMAZING at times as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EOxmDIA_t5lcBWeYyOv9vw"
  },
  "IcfOf9ASjlKIUUOCaDo3dg": {
    "date": "12/28/2017",
    "text": "I have been hearing great things about Silk Road, and I wasn't disappointed. They had a lot of signature rolls to choose from, and of course had the classics that everyone loves. We tried a variety of different rolls, including the ginger roll and silk road signature roll, we also got chicken lo mein, and miso soup. Everything was fresh and delicious. The signature roll was a lettuce wrapped shrimp with a mango sauce. It wasn't what we expected, but it was so good! Sometimes I get a little worried with sushi take out but, everything was awesome. I will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "iCXJ3gO2GhopYHmfmnktfw"
  },
  "mDKlKX3Sa0sIkPPrhnTSww": {
    "date": "4/22/2019",
    "text": "Been there many times. Service is sometimes not great but sushi makes up for it. Exceptional sushi. Main/hot dishes are good ... hibachi is standard. Sushi rolls: out of control and Fantastic are my go to selections.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V05OWZXS8O4i8KHA1AivPQ"
  },
  "KvlC_7K6mP12-ccD4Yjbkg": {
    "date": "7/24/2017",
    "text": "This is one of the better Chinese places in the area.  The food is very good and service is usually on point as well.  Most recently I had the general Tsos chicken.  While it is not the best I have ever had, it is definitely above average and way better than any takeout type Chinese place.  The chicken pieces that come with the meal are way too large in my opinion.  You have to cut almost every single peace multiple times and it can be annoying.    I have also had the sushi here.  Again, it is above average, but nothing very memorable.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1u80DXuswfp7hFW2NN9B-Q"
  },
  "4hlXoiaWrmh1QIMw-75adA": {
    "date": "12/13/2017",
    "text": "How did we not find this fantastic restaurant just up the road (Baptist Rd) until last evening?  Was headed to a Wigle Distillery labelling party downtown on Smallman but the snow and traffic caused us to bail.  Silk Road had been suggested by a friend last week so decided it was a great place to circle to from 88 to 51 to the Caste Village strip mall to wait out the snow and traffic.  Love the lay-out, plenty of privacy here. The food was outrageously good.  I had the Pad Thai Noodles, perfectly sauced.  She ordered the Yang Zhou Fried Rice and it was the best we've had in years, maybe ever.   Huge portions of both.  Excellent service.  Now planning to go back frequently for the amazing lunch deals and must try out the sushi bar, hibachi, etc.  5 stars for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "HDbaAzgWwyWD0yUuHr1qcg"
  },
  "bpu_aKlu0sTYgyBUQJAzLg": {
    "date": "9/21/2018",
    "text": "This place has the most delicious sushi, Chinese, Japanese food in the Pittsburgh area. Everyone is friendly and the food is fresh! I'm just sad it took me this long to try this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YllDN6v-L17f8_uP4Pyn-A"
  },
  "i6iA6Vj84lRKKrPR32AlfQ": {
    "date": "10/30/2016",
    "text": "Haven't dined in here yet but take out was pretty good! The food preparation took only 15 minutes and the entree portions were HUGE (fed me and my husband for three solid meals). However, being such a cheapie, I will say our crab rangoons were pretty darn expensive at over a dollar a piece! $6 for 4 small wontons was a bit of a rip off.   Food quality felt a bit better than most other Chinese restaurants and the flavoring was neither too salty nor too bland. With take out being rather decent, I'm looking forward to dining in the restaurant!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "2jKzO_01d12oiu-2bOYcYg"
  },
  "yYyaba0-2YbUCRP1w1S5ew": {
    "date": "7/6/2018",
    "text": "Terrible! We used to really like it here, but tonight was awful. First of all the bathrooms were not working, which we were unaware of until we were already eating.They told us to go to Panera to use the restroom!!! I thought it was illegal to run a restaurant without a bathroom? The vegetables were not cooked in any of our meals, the beef was tough. The fried rice was bland. Terrible!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8d8raQbN7a6xYFaok37YZg"
  },
  "dXWXG7N7wsp_tiYL3klswA": {
    "date": "1/4/2019",
    "text": "Not sure why everyone is hyping this place, but my experience here was very mediocre. The food was horrible. The menu doesn't even have a description of the food and my friend ordered the stir fry which only had slices of chicken drenched in an overly sweet sauce. It did not look appetizing in the slightest. We also ordered the cashew chicken and there was so much water in the dish. The service was mediocre. We did not receive much attention and it was slow. Would not recommend.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "30mWDTIYgYw_cM8_mlj5PA"
  },
  "G8Zee42gGBpIrQtERpc1kg": {
    "date": "12/27/2018",
    "text": "My absolute favorite Chinese food! I always pick up takeout there, but the dining area is very nice if you are thinking of eating out! I highly recommend their general tsos chicken!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eSrvVYGQqDGIXCm3Zr5S1Q"
  },
  "Mnb-vK-Vmre8tudxrxvApw": {
    "date": "7/17/2018",
    "text": "I enjoyed the Kung Pao Chicken, it had just the right amount of peanuts to spice ratio.  My partner said their General Tso's was some of the best they'd had ina while.  This isn't far from the office, so we plan on making this a regular part of the lunch rotation.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bbW91jAJHAP2rU8rfzYuFQ"
  },
  "sgVznTCsJ9B0pb_N7iYETw": {
    "date": "12/1/2018",
    "text": "Recently ate at the restaurant for dinner and my boyfriend and I both ordered General Tso's- one spicy and one non spicy. Needless to say both were not spicy and sauce was very very sweet. The part that aggravated me most was cutting into the large pieces of \"chicken\". It was 40% breading, 40% fat or filling and 20% chicken. Service was horrible- very slow and they charge 75 cents per refill of soda for a small glass filled mostly with ice- who charges for refills in 2018? \"Gourmet Chinese\" it is not.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jX0HRNvLY6XP9O_Kief71Q"
  },
  "I9ybxK9P8HfRI667r1xf2A": {
    "date": "2/17/2015",
    "text": "I eat at Silk Road regularly and think it is a too notch place to get a good meal if you are in the mood for Chinese cuisine. I have never done the Hibachi and always eat in the dining area. The decor is modern and atmosphere intimate. They can accommodate large groups as well. The staff has always been both helpful and friendly.   I am a big fan of their lunch special which includes tea, soup and entree. Some of my faves are the General Tso's and Lo Mein. The only thing I had and didn't like from here was the chicken and vegetables with brown sauce. I thought the sauce had a strange flavor but this could be because I love the Chicken and broccoli from Sesame Inn. The sushi is always delicious and fresh too!   Take out recommended!   If you like Chinese food, give Silk Road a chance!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "higRMImwqvP9ZH6JRf606g",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States. Steamed buns - just ok",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/higRMImwqvP9ZH6JRf606g/o.jpg"
      },
      {
        "img_id": "t1cSJIectAAFLGcipM5OBg",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States. General tso&amp;#39;s with fried rice",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/t1cSJIectAAFLGcipM5OBg/o.jpg"
      },
      {
        "img_id": "pFRmW30ndXJI-YvEPNEVFg",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States. Vegetable lo mein",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pFRmW30ndXJI-YvEPNEVFg/o.jpg"
      }
    ],
    "user_id": "mm9WYrFhiNqvHCyhQKw3Mg"
  },
  "nqXmwYmequtrBT37qSbg-A": {
    "date": "4/27/2016",
    "text": "Brenda is such a big fan of this place that I had to try it.  Now I'm sad that I didn't come here sooner.  Chinese food hasn't been high on my list for years now.  Too much oil, sugar and fried food.  It's hard to find much to eat at these places that isn't really ridiculously bad for you.  I've been twice now.  Yesterday I had a lunch special.  Kung Pao Chicken.  It says on the menu with tea and soup.  I picked hot and sour and was delivered won ton.  No matter.  I liked it just fine.  The Kung Pao was perfectly spicy for me and a good sized lunch portion.  It was good.  I wasn't offered any tea.  I first visited a week or so ago and my wife and I shared the mu shu pork and the szechwan chicken.  I loved the mu shu, it was a great example of this dish.  Not greasy and plenty of those cloud mushrooms I really like.  The chicken dish was perfectly cooked.  The chicken was moist and tender.  It was too sweet for my taste but the flavors all in all were really good.    The service is friendly and the food comes out lightning fast.  I like this place a lot.  They play classical music and it works with this really upscale interior.  The prices here are very fair.  I would return again and try to find more things on the menu that won't do me in.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "QQtoHnP0cP7nzNnUob_1CQ"
  },
  "sMNOS9-KxC3e4N3TWtQuzA": {
    "date": "1/25/2016",
    "text": "Came here last week for a birthday celebration. It was snowing out so there weren't many people dinning. The hostess was incredible. She showed us to a hibachi table took our drink orders and even answered our questions while we waited on our server who she informed us had just walked in a bit late due to the weather. No biggie because she was great and more then accommodating.   I started out with sake because what celebration doesn't start out with a good drink. After reviewing the menu I decided on tuna. Included in the meal was soup of your choice and a house salad. I loved the dressing. Our hibachi chef was fun. Not the best I've seen but still put on a good show. My tuna was overcooked but still tasted descent. The fried rice was a bit bland and could have used a bit more seasoning. I also ordered plum wine which is a favorite for me. Over all it was a descent dinner and the 2 other people at the table made for great conversation. I would like to come back and order off the main menu. I feel this place has untapped potential.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 12,
      "cool": 10
    },
    "photos": [
      {
        "img_id": "caL7GYDUF9mv5W0FUlLk_w",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/caL7GYDUF9mv5W0FUlLk_w/o.jpg"
      },
      {
        "img_id": "NnLXTJOT4vO-f2FrXI7Vkw",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States. Tuna hibachi",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NnLXTJOT4vO-f2FrXI7Vkw/o.jpg"
      },
      {
        "img_id": "gGRXR_c1G1YaQtjK1PWu-Q",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States. Plum wine",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gGRXR_c1G1YaQtjK1PWu-Q/o.jpg"
      }
    ],
    "user_id": "U92V-gp13uMZL-sl_naTHA"
  },
  "wFqqQt-m8SdaMvA7sg9hOg": {
    "date": "4/19/2018",
    "text": "Silk Road is my favorite Chinese restaurant in Pittsburgh. I've had many dishes from this place and each dish I've tried is great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "am0arrzxAfSm65zyatG7Mg"
  },
  "Z8beZbTbnHx2sqQcp_1aDA": {
    "date": "5/17/2019",
    "text": "The best Chinese and Japanese in the area! We just moved to Whitehall, and are so happy we found Silk Road. When we aren't at the restaurant, we are always getting delivery, because they are so quick! Excellent food and service every time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2anjIk8lCbrs9eTWbuLdXg"
  },
  "lXzKms-4iyyYdh928k77RQ": {
    "date": "3/31/2019",
    "text": "Wasn't thrilled...  1. The wait to get a table was not bad, BUT, once we were seated, it was about 15-20 mins until we saw a server. She was very nice, but that's along time to wait w kids. 2. They do NOT have any kids portions or \"kids meals\". Which is ok for older kids, but not for 1-3 year olds. I would have likely just taken our food to go initially if I knew that upon sitting down. (See above wait for server) 3. Appetizers arrived in a timely manner, but were just OK.   We ended up taking our entree to go because it was getting a bit silly as we had been there for over an hour at that point. I did hear people at the tables next to us complaining about the food, however, our main dish was OK. Not bad, just not terribly good and it was still a $60 meal   To go - if you're in a pinch. Dine in - def NOT",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "us2nGNYHDYqzG6cdBCtymQ"
  },
  "lg97qzlKeapqNweTXYTO7g": {
    "date": "2/28/2019",
    "text": "I've been to Silk Road numerous times and have never really been a fan. The general Taos chicken pieces are way too big and chewy. The veggie pot stickers are green and taste strange. However, it is the closest Chinese restaurant to our house so tonight we ordered take out.  We ordered steamed chicken with veggies, steamed buns which had pork inside and a veggie spring roll.   Upon returning home, my husband takes a bite of his steamed buns and they are RAW. I don't mean undercooked. Legit raw. How DISGUSTING! I then take a bite of my veggie spring roll and there is shrimp inside. Ew! I do not eat seafood so I was not happy.  At this point we decide to return our food to the restaurant which is super inconvenient considering my husband had to be at work.   When showing the workers the RAW food and wrong type of egg roll they offered NO apology. They simply offered us a new egg roll. They did take the buns off the bill, but offfered no explanation as to why they were raw.  Mind you this is an expensive Chinese restaurant. So we still ended up paying $20 and were inconvenienced and unhappy.  We get home with my new egg roll. THERE IS SHRIMP IN IT!!!!! So now I'm on my way back AGAIN!  Update: upon going back the manager was extremely nice. He did comp my meal and give me a couple of spring rolls which I greatly appreciate. He is a great guy, and it's unfortunate he had to have the backlash of the kitchens mistakes.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "afK5a8JUjs-SJ9VwLLoqkw",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States. Raw steamed buns",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/afK5a8JUjs-SJ9VwLLoqkw/o.jpg"
      }
    ],
    "user_id": "eY8pzn82zhVO95vBi-mzkQ"
  },
  "gkcfM5WbZqTmiwOMsdHiaw": {
    "date": "6/16/2019",
    "text": "I should had known to not get sashimi at a hibachi place. Their menu said they get their fish shipped from Honolulu everyday, so I got the chirashi. It was kind of underwhelming. My friends got hibachi and they loved it. We came on a sat evening, and it seemed understaffed. Took them a while to even take our orders. The atmosphere and decorations were very nice. The servers were also very friendly, they just weren't around very much. Probably won't come back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pOp2hULTM9HxNfwuEl5nxA",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States. Chirashi",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pOp2hULTM9HxNfwuEl5nxA/o.jpg"
      }
    ],
    "user_id": "Jrr9reObcbJ6U7ywKRmp6w"
  },
  "5eBNcty-GwYdd-EZCzbOAw": {
    "date": "12/10/2018",
    "text": "Tasty American Chinese restaurant. The prices are a bit higher than other Chinese restaurants but the portions are generous.  Together we had Sushi (The American Dream), hot and sour soup, Mongolian lamb with green onions, Stir Fry Vegetables, Hunan Shrimp, some other shrimp dish and crab Rangoon for our appetizer.   The sushi was particularly delicious and tasted especially fresh. The Mongolian lamb had a very mild lamb flavor almost tasting like beef (which is good since I often find lamb too gamey) and the shrimp was also excellent. I was less impressed with the hot and sour soup.   The one thing that I did find frustration with was that the waitress kept trying to take our plates away multiple times before we finished them! As such, I unfortunately had some of my food taken away before I was able to finish it and I also had to keep correcting her to not take the plates away and that made things a little stressful. I do really hope they fix this because it is a nice restaurant otherwise!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Gl02eAD-5Kb1aqQkQ1ZMqQ",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Gl02eAD-5Kb1aqQkQ1ZMqQ/o.jpg"
      },
      {
        "img_id": "alNgNOBcypzzfLNTRzArzg",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/alNgNOBcypzzfLNTRzArzg/o.jpg"
      },
      {
        "img_id": "oFz2C4oLG31HvSa4QGz_Dw",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oFz2C4oLG31HvSa4QGz_Dw/o.jpg"
      }
    ],
    "user_id": "cgecfJZ46npwKX2iOIbVWg"
  },
  "6sHjX6pfQ6pIK8BhUxvmHg": {
    "date": "9/4/2018",
    "text": "Atmosphere- with a location in a strip mall, you will be surprised how nice it is inside. Although relatively small, the restaurant seems very comfortable. The layout is long and narrow. The dining areas are separated by partitions. Tables are spaced apart comfortably and suitable for a business meeting or a romantic meal.   Service - I have dined here several times over the years and service is always attentive and friendly.   Food - in a word, excellent. I always order the hot and sour soup and it is some of the best I have ever had. I had the Kung Pao Chicken with fried rice, which is also excellent.   Value - portions are generous and the prices reasonable for what is provided.  If there is a better Chinese restaurant in the south hills of Pittsburgh, it has eluded me.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "eBnedff2L15dAxfD_btx-Q"
  },
  "lW6FXXXwcHL2R8qzmrwvig": {
    "date": "7/17/2018",
    "text": "I stopped over here for lunch enroute to the gym to try it out. When I arrived I was seated immediately and given lunch menus. In addition to their regular lunch cuisines you can get a combination of sushi and either miso soup or salad or you can order an hibachi which is made tableside.  I wasn't sure what to order but my waitress told me that anything on the menu made spicy can be made non spicy. Take out and delivery are also available. I ordered the garlic chicken with vegetables and fried rice which also came with a cup of won ton soup.  The soup was nothing to write home about but when I saw the generous portion of my entree I was overwhelmed! The chicken was a little hard to cut but it wasn't dry and combined with the vegetables it was very tasty.  The waitress was very attentive to my needs and when she brought my check I got 4 fortune cookies (these are the kind you would find in a box in the grocery store). Yet for all that food my bill came to slightly under $10.00. Not bad for a filling lunch!  They do have vegetarian options on their menu. They have a more extensive menu for dinner but there was so much on my lunch entree I doubt I could even finish a dinner there.  Located in the Caste Village shops near Armstrong's restaurant, the shoppes have their own parking lot.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 11,
      "cool": 12
    },
    "photos": [
      {
        "img_id": "NVBdorRSfMQUXDc__ye9tw",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States. Garlic chicken with vegetables and fried rice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NVBdorRSfMQUXDc__ye9tw/o.jpg"
      },
      {
        "img_id": "n88Jb5FH5eeWm6grbmsbJA",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States. Won ton soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/n88Jb5FH5eeWm6grbmsbJA/o.jpg"
      },
      {
        "img_id": "XhivjP1_nc9_x22x7F7sXg",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States. entrance",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XhivjP1_nc9_x22x7F7sXg/o.jpg"
      }
    ],
    "user_id": "fmzIm7RxEdii5Jz44PtO7g"
  },
  "xE11qQCE6gSir4SToXENhg": {
    "date": "11/1/2018",
    "text": "We have eaten here many times. We have never been disappointed. My dinner was called TWO STARS. It features shrimp and scallops with great veggies and garlic sauce.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Gc38w6buJaL1InAqP51F2w",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States. Large scallops and shrimp.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Gc38w6buJaL1InAqP51F2w/o.jpg"
      }
    ],
    "user_id": "Ivaiwkm8UOm7EHyH8trQ7g"
  },
  "F--vuaOcLn9LPV0tWOwtyg": {
    "date": "7/10/2018",
    "text": "We returned for dinner and found the same high quality food as we had at lunch. The portions are very large and are basically served family style for sharing with others.  I had a chicken, mango, and peppers stir fry in a white sauce.  Others in my party had the General Tso's stir fry, the Seafood Treasure stir fry, and Zha Jiang Mian, which was not the authentic recipe but I was told still tasted very good. The white rice was so-so. Neither the worst nor the best I've had.  The wine list is also quite good.  I had a Johannesburg Riesling and really enjoyed it.  They offer paired suggestions with meals on their menu.   The service is great and the restaurant is often packed with people.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VZrUiNi1X43XGhS0ukGXVg",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VZrUiNi1X43XGhS0ukGXVg/o.jpg"
      },
      {
        "img_id": "udwMfsxvDrLXLFndCotyYQ",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/udwMfsxvDrLXLFndCotyYQ/o.jpg"
      },
      {
        "img_id": "8yucfkYScmKOhCZObEo7Lw",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8yucfkYScmKOhCZObEo7Lw/o.jpg"
      }
    ],
    "user_id": "0TepUIxnE03u98E3JUdrlg"
  },
  "p68lWMbLKvWdMZwwa0zA7Q": {
    "date": "8/29/2019",
    "text": "Great place for American/Chinese food, incredible hibachi, and pretty good sushi for the money.  All food is reasonably priced, and my wife and I really can't get enough of the place!  We strongly recommend the Moo Shu Pork or chicken!  Also ordered the Love Boat, and if you're into high quality raw fish, you can't beat it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zOi_0IFgT9tE763CnfnJMg"
  },
  "nc28zQxKRz15ocqmaC2Vzw": {
    "date": "7/12/2019",
    "text": "We went to Silk Road with high hopes, we left with $50 wasted. There were only 2 of us but the meal of General Tso's Chicken and Cashew Shrimp with Vietnamese Spring Rolls cost $50 (insane in my opinion). The Spring Rolls are served cold and are mostly lettuce with 2 pieces of shrimp cut in half. The shrimp was so fishy tasting it went to waste. The chicken in the General Tsos was so chewy we cut it in half to find mostly fat and some pink looking chicken. The shrimp from the Cashew Shrimp tasted beyond fishy, to the point that it tasted dirty. There was a hair on the garnish, and in my shrimp dish (which i didn't eat) there were maybe 10 shrimp and what looked like 8 celery stalks, and 5 large carrots cut into bits, defiantly not worth $17.  We ended up taking to to go and tossing it into the garbage can in the parking lot. Would not go there and would never recommend",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XJBoFUbgUP-2s9WnphuQQQ"
  },
  "0u2DPHFOu2llhu4d2Pz5UA": {
    "date": "12/29/2018",
    "text": "As a girl from the South Hills, I have eaten at Silk Road in Caste Village many times as a teenager. I loved it, but somehow I haven't been there in years until recently. I decided to order take-out one night when I was in the area. I went with fried rangoons and chicken fried rice. The order was ready quickly and the folks working were super friendly. The food was just as delicious as I remembered. Can't wait to go back soon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "DeXKbQYNx52OlOizobOLJw"
  },
  "GaWRdrwTnFsBcin_A9arEQ": {
    "date": "11/6/2018",
    "text": "I stopped in to Silk Road based on some recommendations that I received. I ordered five rolls of sushi for takeout. I was neither blown away nor disappointed with the sushi. It was average quality and on par with any other Chinese restaurant that I've been to. It is conveniently located in Caste Village. I would return in the future to order from here and try the other offerings that they have on their menu.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "wrsj5oMHsRzouMNuZlatbg"
  },
  "dv6DjMenvi-lOngMzINPZQ": {
    "date": "12/25/2018",
    "text": "The food was good, but the service was very bad. Avoid this place when it's full.   First we had to wait more than half an hour to be seated, which is understandable because it was full and we did not have a reservation. However, the hostess was very rude when we asked her after a while how much longer we would have to wait.  After we were seated, the waitress told us to order now so she could get the order quickly, but we hadn't yet looked at the menu so we asked for some time.   When we were ready to order, she was nowhere to be found. We had to keep raising our hands for several minutes until she saw us.   We ordered an eccentric chicken and fried rice, and asked for a sushi roll menu. She took a long time to bring it. After she brought it, we did not see her any more until she brought the check.   We had to ask a different waiter for the sushi we chose, which came quickly, but he did not bring the soy sauce, which is essential. It took an eternity for the chicken and the fried rice to come.   We asked our second waiter to bring us the soy sauce, and he brought an almost empty jar.   When we were finished, our original waitress brought us the check pretty quickly. The only thing that they got right all night, of course.   We had come before when it was not full and it was a completely different experience. We doubt now that we will ever come back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sNryTbcKfdMoV-YeiSXpsA"
  },
  "YFT47uVdJBHkBYY_VNmiTQ": {
    "date": "5/11/2019",
    "text": "Food is decent but they are very rude.  Very pretentious. Do not expect good service or to be greeted warmly. They act like they do not want your business. Ive eaten here twice and never felt comfortable here. So now I avoid this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tow80SY2wMwbVtSVpx2bmg"
  },
  "6zO-z6jC10UDw99qAfZBcg": {
    "date": "4/21/2019",
    "text": "Today is Easter Sunday and after church we decided to stop in for lunch at 1:30 PM. There were less than 10 tables occupied when we arrived. 15 minutes later we still had not seen a server. So we got up and left.  We saw plenty of staff wandering around. So they lost a customer even before they had a chance to earn one.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tJfVLJReHofjspf5FQjVGg"
  },
  "5_5S7wTgC2SZnaJgXCdTfA": {
    "date": "10/14/2018",
    "text": "We ordered delivery from here the other night for the first time. I can say everyone was friendly from the lady on the  phone to the delivery man. Delivery took a little over an hour and the food was decent. We ordered general tsos, white rice, crab rangoon, and egg rolls. The portions were large and filling which was a plus. The crab rangoon was not filled very much. The rice was unique tasting in my opinion. I enjoyed the general tsos. I heard the sushi is good, so next time I will try that instead.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XVTqV_zHUWC6BOfOsq3nRg"
  },
  "wUWswsbUiujk6D9Uj9Djkw": {
    "date": "3/15/2019",
    "text": "Outstanding food!! Service was remarkable!!! Not just your average Chinese restaurant!!! Delish!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Mwe3dfKVOGOjox4U5LigA"
  },
  "Qoa0w_ZMtiJymT2cgKdP7w": {
    "date": "2/19/2019",
    "text": "Had sushi which was good and shrimp balls.,Everything we had was very fairly priced. Wonderful service. Good atmosphere",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D3rjpwkJOT0aytjx-Dvg3g"
  },
  "DtoxDlt_WnX0udspdRT6ng": {
    "date": "2/6/2019",
    "text": "Adequate. Nice atmosphere, good portions and value. Fair service. Hot and sour soup was one note, vinegar and did not have all the lovely things in it I come to expect: wood ear, tofu, bamboo shoots etc, one mushroom and pork shreds. Wonton soup tasted like cat food. General Tso was ok. Again not the complexity of flavors I wish they have but a bit on the sour side, Perhaps vinegar was dominating again. If someone was treating me, I would go again, but won't go back on my own .",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Iq_-UfNcdi7xi9oVjGfwnw"
  },
  "mBIXeBQrIGpOD_RFrE7-2A": {
    "date": "9/26/2014",
    "text": "I have never been disappointed here.  I've been there maybe 5 times now, and the scallops are my favorite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i3TzBw4kCGVsrxKtp_04aA"
  },
  "-mOcC-GxATeLWwtk89-Yng": {
    "date": "6/27/2013",
    "text": "After hearing good things from the \"locals\" (we just moved to the neighborhood a few months ago) we decided to give SR a try. Upon arrival on a Saturday night, we were rather surprised to see that the restaurant was only about half full. The majority of the clientele were older folks with few families mixed in. The decor seems to be simple yet authentic. The menus (there are two!) are quite extensive. Sushi? Check. Chinese? Check. Hibachi? Check. Something for everyone? Check-unless you're craving Italian. We started with our staple-the edamame. Nothing to write home about. Next I ordered the Sate combo with shrimp, chicken, beef and vegetables. On the menu there is one star to indicate mildly spicy. I did not choose to eat sushi but my husband couldn't resist. My meal arrived promptly while hubs had to wait for his sushi. Happens frequently in this type of restaurant. It worked to our advantage this time as he could finish feeding the baby while I ate my entree. In regard to my entree, there is not much to say. It lacked a certain something. Well, anything. Although the meat and veggies were plentiful. They were also tasteless. And that mild spice they warned me about (and I was eagerly looking forward to)? Couldn't find it no matter where I looked. The left overs are still sitting in my fridge and will probably remain there for the next few days until they make their next stop, the garbage can. On the other hand, my husband really enjoyed his sushi and thought the fish was very fresh (claims to be flown in from Hawaii daily) but still not on the level of our go to Little Tokyo.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "ftUrNSpxUr8eWCyOlsZVgg"
  },
  "mEoi3t_9YBHbMqh7pb3ErA": {
    "date": "12/12/2011",
    "text": "I visited this restaurant with high expectations that were met with good service, a charming upscale atmosphere, and sub-par Chinese meals. The General Tso's chicken was delivered luke warm and my friends Mandarin Chicken was bland and mixed with frozen peas and carrots from grammy's refrigerator. I will definitely visit again to see if the meals have improved, however for a mid-scale \"gourmet\" Chinese establishment the meals were unfortunate.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "w6qL4hCHF3ROBXDo8gRc0A"
  },
  "EgbDApFJ59kKp5c_TLN1BA": {
    "date": "1/11/2014",
    "text": "I will start off by saying it has been my families Christmas Eve tradition to eat hibachi, we chose this location for the last 2 years. We have also ordered out from here very often. Was always good. The last time I ordered out for delivery it took 1 hour 45 minutes, it arrived at my home dried out and not edible. When I called to complain the owner told me that wasn't possible and they wouldn't have delivered it that way. After calmly explaining that in fact it was dried out. She stated, that if I would like to drive it back down there she would look it over and that she would not help me in any other way than that. I was home with a baby in bed asleep. I wasn't able to, nor did I feel that was my responsibility, I instructed her to come and get it if she needed to see it that bad. She refused. Long story long, I will never eat there again and unless you want to eat somewhere who treats their patrons like liars I suggest you go else where. Shame on them.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "o9nnPkM8mlePU01COwpLYw"
  },
  "0agf0xvVAyAlIqblx6nm0A": {
    "date": "6/17/2012",
    "text": "One of the best Chinese restaurants in the area.  I feel very fortunate that it is only 5 minutes from my house.  I guess the de facto premiere Chinese restaurant is Sesame Inn but Silk Road is every bit as good if not better.  There are only a couple of dishes I've had that I didn't like.  It's not that they were bad they just weren't for me.  My go to dish is usually the stir fried General Tso's chicken.  Much better than the fried version.  My only complaint is I like my food a little on the spicier side and there version could use a little \"kicking up a notch\".  Otherwise very good.  I'm interested to see how the hibachi and sushi additions will turn out.  I hope they are of the same quality and standard that I've been accustomed to.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8VaCl2D4ihKnMWVx3flq1g"
  },
  "_WNpNsJg3B9fjqgMmTHZnQ": {
    "date": "8/13/2011",
    "text": "Silk road is a very good Chinese restaurant. The atmosphere is really nice and it is safe to say that it is always quiet and the service is always good. Everything on the menu is basically what every other Chinese restaurant has but everything I have ever ordered from there has been consistent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "VsWLiO3lR4qYR3K_FEnCrw"
  },
  "jhml1NpAKvEO6mtsIGP_Tg": {
    "date": "12/23/2011",
    "text": "A very nice and surprising addition to this area of Pittsburgh, which has been without a good Asian restaurant in all the 30 years I've been coming to this area. Service was friendly, if a touch slow on a busy night. But the food was worth the wait. Highly recommend the Eight Pearl Duck and the Red Orchid Shrimp. There are several other house specialties, along with the more standard Chinese fare. Steamed Shrimp with vegetables was fresh and well-cooked, not rubbery.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AWne95e4SWqqfWrF_JIrAw"
  },
  "MRk1FbvQkiibstOKpjnu6w": {
    "date": "8/16/2013",
    "text": "The stuffed eggplant is excellent as is everything else I've eaten here. Tends to be busy, and for good reason.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fEo1C7GJlK8HlfRfNouLbw"
  },
  "DNEY3RT13ATK9vyqwqm1ZQ": {
    "date": "5/17/2013",
    "text": "Ate here with my dad and husband, my fellow sushi lovers. Their menu is very vast, and I definitely want to return to try their entrees. The Restaraunt is located in Caste Village, which is a shopping plaza, so it's not as spacious, but beautiful nonetheless. The ambiance is veer fancy yet low key. We all ordered tuna sashimi salads, which were essentially your typical salad with ginger dressing with  sliced avocado and tuna sashimi. The ginger dressing was a tad spicy for me but very good.  Upon ordering sushi I tried to mix it up as always, and ended up getting a roll that was wrapped in cucumber, which gave my sushi a nice crunch and cool texture. One of my favorite things in sushi is the marriage of the fish with things like cucumber or avocado, so I liked this roll very much. Nice presentation of sushi as well.  Very deliscious sushi, will definitely come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ik3pu6ypuBcDAhV-gAE7yw"
  },
  "l6QcVHOd5xpoERq6T3EqBQ": {
    "date": "3/6/2015",
    "text": "My favorite restaurant in the burgh!!  I loved the Chinese food before they ever opened the sushi bar and hibachi..  That just made the place even better!!    The sushi bar is the best!!  Their hibachi tables are fabulous.. There are only 3 so it's quite quaint..  Easy to talk to everyone at the table unlike those big places that have multitude of tables and too much noise..  The staff has always been extremely accommodating ...  And as I said the food is fabulous!! I also get a lot of take out from there too. It's pricey but I don't mind paying when the food is so good...  They have a stir fry general Tso's that we love because it is not breaded and fried.. And every time I have ordered the shrimp with asparagus.. Asparagus is done perfectly even for take out (it's very easy to over cook asparagus and it can be come mushy.. But Not here!!  We always get 2 meals out of the Chinese dishes..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NfUeP5jPTc_D0b0e2aul5A"
  },
  "1edBYtBwCdCBwc0347hrEg": {
    "date": "8/20/2011",
    "text": "service excellent. amazing food. great atmsphere. suggest steamed buns and stir fry general tsos chicken",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tzBdRkF9m5uCgmEKGiBawQ"
  },
  "IYpAlZPkfWS19zdOErxNhA": {
    "date": "7/13/2014",
    "text": "The best sushi in the south hills, hands down. We love these folks and the service. Highly recommend if you want to introduce someone to sushi for the first time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3dPgNXMaHNtRYTJ-DAAjrA"
  },
  "L9ib9rpEaEGLEAYrBnJsHg": {
    "date": "6/8/2013",
    "text": "Awesome food and sushi. I love this place. Always fresh and consistent. This is my to go place now for sushi, chinese and Japanese food. They now have hibachi. Ive been to many Asian restaurants during my life and this is up there as one of my favorites.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "9MiZDZ_JPAHZJnRaE3YwPA"
  },
  "-EHQy04YjL2AJ993zmWjMg": {
    "date": "3/29/2013",
    "text": "This is the best kept \" secret\" in the South Hills! I LOVE this place!!! Yummy!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tC7MoM-Hes2cKl-s_4JIMg"
  },
  "NCYGf_h3arduvDZMOGqBTw": {
    "date": "11/14/2013",
    "text": "My favorite Chinese restaurant in Pittsburgh. You can't order wrong. It's all delicious. Beijing Potstickers are a fave!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "URH7mgjWmZ6chyJudA_6aA"
  },
  "mBi5YkfKIx8HSfOCP7RIVA": {
    "date": "9/26/2010",
    "text": "High quality ingredients. Very good flavor. Nice interior surroundings. Waitress was \"'Shu Wyn\" did a fantastic job. Highly recommended.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "t_wwHeKgyztfNnUD4puKLA",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States. Pan Fried Noodles with Shrimp, Scallops &amp;amp; Chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/t_wwHeKgyztfNnUD4puKLA/o.jpg"
      },
      {
        "img_id": "ubUSWPs3yJukQq7KhCPOaA",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States. Beef With Banana Peppers",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ubUSWPs3yJukQq7KhCPOaA/o.jpg"
      },
      {
        "img_id": "jMUtRLirE6UD0fL6ojssSQ",
        "caption": "Photo of Silk Road Gourmet Chinese - Pittsburgh, PA, United States. Partial interior",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jMUtRLirE6UD0fL6ojssSQ/o.jpg"
      }
    ],
    "user_id": "blrWvPePSv87aU9hV1Zd8Q"
  },
  "w40RfZSFWmi-q1-ddmOUyg": {
    "date": "9/26/2012",
    "text": "The atmosphere is nice and the food is, you know, pretty okay.  Silk Road is right down the street from where I live, so we have been there several times, because it is so handy.  I wouldn't travel any amount for the average food, though.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "VmIalBrQjh8rcTxsS_kX3Q"
  },
  "WqfTPG5A5cvbsQSlFxRkHg": {
    "date": "6/19/2015",
    "text": "Soooo good!! Shrimp and scallop general tso. I ate so much till I was sick. Wonton app was amazing!!!!! O goodness I'm in love",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0iM7kMlPNYMwPBe6_NnpYA"
  },
  "PxGOCXyD2Ytc42xvy8hyFg": {
    "date": "11/12/2015",
    "text": "Kao ping shrimp was made perfect, spicy and not overcooked or rubbery.  Their soup are large an filling. Great place to stop for sushi as well. Highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d0dMo8zkQIWHJe8bFGLgMQ"
  },
  "93l2I0HY4w_NUMB0UVe8TQ": {
    "date": "6/26/2013",
    "text": "One of my favorite Chinese restaurant  in the south hills. They have a nice variety of Chinese and Japanese food. They offer vegetarian options as well. I had the tofu general tsos and a California roll.  Both were excellent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P3B7FfBpXERa-KdxwIGkHA"
  },
  "mxNy8i5P6OI8DPvqnhbJqw": {
    "date": "4/14/2014",
    "text": "Go. Now. No. NOW.  This place is hands down the best of its kind. I have never had bad food. The egg rolls are killer, the salads are crisp and fresh, the tea is perfectly brewed...I could go on and on. Boyfriend always gets the stir fried general tso's and it is the best sauce I've ever tasted over perfectly cooked, unbreaded, white meat chicken. I always go for the sushi and have had every roll on the menu. My favorites are the pink lady, amazing roll, lost mummy, angel roll, and the plain, old, spicy tuna. This is some of the freshest sushi I have ever had. It rivals that of the 5 star restaurants in vegas for half the price. Insanely good. Everything they do, they do very well. Customer service, cleanliness, food, you name it. This place is a gem. If I hadn't read the reviews, I never would have found it. Do not be put off by it being in a little strip mall.  Why are you even still reading? GO! Oh, almost forgot...the black dragon roll...also A+. And they have a sushi lunch combo menu until 3:30. All good things.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "8aqeLmE0nS7BFrxTm5B4GA"
  },
  "1h0h18aDh3np21eEEQinAA": {
    "date": "8/30/2014",
    "text": "I have been a long time customer of the Silk Road, Last night I was extremely disappointed with the food . The broth for the  wonton soup had absolutely no flavor, it was basically dumplings in warm water. The shrimp Kung pao and the Mandarin chicken, both had the same flavorless taste. The majority of the Kung pao  plate was over loaded with \"cheap\" chopped celery.  The prices at Silk Road have gone up, and the quality has gone down.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XIi1scKUsv29B6Nb5r-dfQ"
  },
  "Pp77Tsq-U5V8VNiIIzZhhw": {
    "date": "10/12/2012",
    "text": "After several dozen extremely enjoyable trips to Silk Road, my wife & I tried the new hibachi that they have down there tonight. All of the food (fried rice, veges, soup) were underseasoned. The salad dressing was nasty. I ordered the calamari & it was slightly overcooked & underseasoned like everything else.  I will stay on the Chinese side from now on. The Chinese is excellent, the hibachi leaves a lot to be desired.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AGiuxNVAYMMfes3Z4-M1OQ"
  },
  "6VewY6bl6nmkHjLNLUeDMA": {
    "date": "4/11/2014",
    "text": "Had a party for my Wife's birthday and called for the hibachi side. We had 19 people which required three tables. The restaurant called my house and asked me wife how many people would be coming. This was a surprise party for her. Than we got to the restaurant and we only had two tables because they only scheduled two chiefs. Some of our party had to be seated at tables away from us. I liked this place until this. Never go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-JU1D3XY9nohwoSe8owEvA"
  },
  "Mf_Z7FMR1X6CI9j-OI1bMw": {
    "date": "5/12/2012",
    "text": "BEST...FOOD...EVER!!!  A little pricy, but well worth the best Chinese in town!  General Tso's was excellent!  Portions so big, it's like getting 2 meals.  Can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0h0dqG04fxblNb2LbwkAPA"
  },
  "o-N5Br3s0pMTxei9W80-Pw": {
    "date": "10/15/2011",
    "text": "This is the Chinese restaurant to go to in South Hills.  Forget Sesame Inn, Silk Road has more interesting dishes.  The barbecue spare ribs are fantastic.  So is the noodle salad app.  The service is top notch.  Our server, she was so funny, made sure we were totally satisfied.  Also, the decor is very modern and the interior is clean and well done.  A great atmosphere!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "SYxZMSwr9m-_xAqIFdihTg"
  },
  "-0vYrZGAydMHOa2HxO2TPQ": {
    "date": "4/26/2012",
    "text": "Absolutely THE BEST Chinese food in Pittsburgh. Good food, Good prices, Good people. Simple as that. I recommend Silk Road to everyone. You will not be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZoeFVzeGr6o02iWRre2P3w"
  },
  "gMjBc0ByeohgNqx5ZaaWuw": {
    "date": "12/30/2013",
    "text": "I have been here several times.   This was once a good stop in the South Hills. Seems to be moving in the wrong direction. The food was just okay. The place needs a make over.  The atmosphere is not great.  Needs a good cleaning.  There was food on the wall in my booth.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "-eOFKYF-uO37XmP43fx-vw"
  },
  "uX_GVuQMSSicJIeAb89T6Q": {
    "date": "4/30/2012",
    "text": "We really enjoy this place. Never a bad meal. Favorites are the clay pot chicken and seafood hot and sour soup.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "N9vSvQbERcy9nwzXXJ7VsA"
  },
  "wCyjNNVPBtzR4IPviPYrXA": {
    "date": "11/21/2011",
    "text": "Honestly the best Chinese I've ever had...  (and I live in NYC now).  The \"Silk Road Staples\"  ....  mongolian beef, general tso's chicken (stir fried), chicken fried rice, chicken corn soup and crispy shrimp (not on the menu).  This place is amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ArMK2zATHUEjeX-w5nJs4A"
  },
  "SeJEOGwwDsWXcjDfhbrb8Q": {
    "date": "1/29/2013",
    "text": "The sushi here is absolutely amazing.  Better than any other Sushi place ive been to in the burgh.  The hibachi is pretty awesome too.  Ask for Kobe!  The Chinese food is also bomb!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uDmQMOo4y478HJUvT2RN3g"
  }
}