{
  "2ns23N1uCTyJ1FfEaykg6g": {
    "date": "4/9/2016",
    "text": "My friends got their wings because they are open late. So bad. Worse than their pizza.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nGn9zcQTfxJkqJu6nr3dSg"
  },
  "k-dDQJ5eaTrFOHRS2H2knw": {
    "date": "12/30/2015",
    "text": "Delicious!  The homemade appetizers are wonderful; we especially love the pizza rolls.  The Buffalo Chicken pizza is a favorite and their regular sauce is always good.  I've never eaten in the restaurant, so I can't comment on the service there, but delivery has always been good to us. Their online ordering is convenient and a deal because you get free breadsticks for a $20 order.  We had an issue with it once and the management took care of it right away, which is something I can't say about other pizza places in the area that I've since stopped ordering.  Their delivery has always been fast for us; I've probably ordered 15 times here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V2-P2oEtDhbsNsyJeTlE9Q"
  },
  "eJZrJ1b9UlWvqFRSw93P0A": {
    "date": "9/3/2014",
    "text": "They are a hidden gem on a boulevard containing many pizzerias and restaurants. Stop by to enjoy terrific food or order and have it delivered quickly while it's still piping hot! My favorite is the breaded cauliflower but my husband's is the pizza, \"any pizza, they're all good!\" Free delivery after $10. Nearly nightly I see their driver on his way to deliver to someone in my plan.  Plus, every time they deliver you get more coupons. Why keep reading reviews? Give them a try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "y8BCoTseSWZpmUSN9Fqc3A",
        "caption": "Photo of La Felice Pizza and Pasta - Pittsburgh, PA, United States. First pg of the menu showing some of their coupons",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/y8BCoTseSWZpmUSN9Fqc3A/o.jpg"
      }
    ],
    "user_id": "g5QSBG-usQ7WFnOGAaUVrg"
  },
  "r5U0ZMn01ki6UDo_FQUSNw": {
    "date": "11/29/2015",
    "text": "So Good!!! Called 20 minutes before closing time! They where more than happy to take my order & deliver it. Always so nice! Delivery guy is so sweet! I would say the Spinach & feta wedge was up there with the best I've ever had! And their breadsticks are by far the best we have ever had. Thank You.. Especially for being open so late on a Sunday!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RMoovEf5lN4m3w7BDCJDsw"
  },
  "_E3CmYc7zZx3rViBIX2Fvg": {
    "date": "4/24/2015",
    "text": "Pizza here is pretty solid, but they have the BEST buffalo chicken wrap I've ever eaten. I love hot sauce and get buffalo chicken quite often. This one here is absolute perfection. Tender, grilled chicken with a unique (very spicy) hot sauce, onions, lettuce and ranch dressing. Phenomenal. Have the ability to order online and any order over $20 gets you a FREE order of breadsticks. I've never gotten anything here that wasn't good. Definitely recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vt9Mx7h4TdKp4QaZ5g4CaA"
  },
  "UFe1FT0DMkiG4emK2b7IEg": {
    "date": "9/24/2014",
    "text": "Very friendly service, reasonable prices, food is made quick delivery is really quick.  Tastes great we've had hoagies and pizza.  This is a really great business.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7kKmVOZhJzhN12Onrh0OLA"
  },
  "gObgGJfbfD_Q9-MxxBGaDQ": {
    "date": "7/7/2015",
    "text": "Good stuff, people were great.  The buffalo chicken wrap was to die for. Definitely will go back a few more times to say the least.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GDVpvPsXEdXLTcL9eilYWw"
  },
  "sl642mSHAbxyA7_onB8xxg": {
    "date": "12/29/2015",
    "text": "So pizza places are a dime a dozen here in Pittsburgh. When I order from a place that's new to me, I expect the experience to be satisfactory at least. This place was well below the satisfactory bar. We ordered half a steak hoagie, chicken Caesar salad, mozzarella sticks, and a 2 liter. The food did come fast, but when we checked our order it was disappointing. My hoagie looked awful and the toppings were scarce. My wife's salad had old lettuce and extra toppings on it that did not state on the menu. The marinara cup that came with the mozzarella sticks was less than half full. The 2 liter was a 20oz bottle. Then my wife told me that the delivery driver made a inappropriate comment to her. So I called to resolve the multiple errors with our order. The man who answered the phone just said hello, no name of the company. I had to ask if it was LA Felice. They said the would fix it. Then when the delivery driver called when he arrived again, he said another inappropriate thing to my wife. Needless to say this place is a joke. Their food was awful, and they are extremely unprofessional. DO NOT ORDER FROM HERE. I know I will going forward.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "38VoRicXqCq9XQ9u9qQTnQ"
  },
  "4V1D08zq89OQ82yFmZ-O0w": {
    "date": "10/6/2014",
    "text": "Love there buffalo chx pizza. Best in Pittsburgh! They are very quick. Only take like 15-20 minutes to get the order",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DyzjZrYWFqmdz4NigqxCIA"
  },
  "Bbx4Eq8xvXO0bq_KlQqgww": {
    "date": "12/8/2013",
    "text": "I work in the area and I always read reviews before I try a new place.  Even though the reviews were split on La Felice, I decided to try it out because their prices were extremely reasonable and because of the convenience of online ordering.  I placed an order for pick up as I was leaving work and the pizza was ready by the time I arrived 10 min later.  I planned to take it home to have for dinner, but it smelled so good that I couldn't resist trying a slice on the way home.  The sauce was delicious and the cheese/sauce ratio was spot on.  The crust is thin and chewy... I like mine a little crispier so I used my pizza stone to reheat the slices later that night- fantastic!  And the True test of a good pizza- can you eat it cold for breakfast the next day?  Ayup!  Great spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fvpU1TDzy-m-MYlI_Khyvg"
  },
  "aFdXxkBOcNFrPM131hGPmQ": {
    "date": "6/18/2013",
    "text": "My wife and I ordered from here quite regularly. Because the food was good. One night we had company and placed a 60$ dollar order and the food was undercooked and the wings were raw. We called back and complained naturally and they said all they could do is give us a discount off our next order. We waited about a month and called them back. Pizza and wings 10 bucks! Great (what we had thought). That night she was vomiting and into the next day I couldn't stay out of the bathroom. Coincidence I think not!!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "1sfqW57F-uIroSSNYPgv7w"
  },
  "vWY-zyV3EmhW4Elh6Tt4qg": {
    "date": "3/20/2015",
    "text": "RUDE. Don't get delivery from them. They're drivers don't have GPS's for some reason even though it's 2015. I had a driver call me to get directions, couldn't understand him at all and while trying to give him directions he hung up on me. Someone else called me back and he also hung up on me. I gave them 2 stars because they're food is good (except the wings) despite their terrible customer service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZPPZLHzJrF7JUj7b8KF_4Q"
  },
  "jqG53gAcxPUeqRBWEme8Pw": {
    "date": "12/28/2015",
    "text": "Their food has always been consistent, but I have noticed a decline in their delivery people. I ordered this evening, and when I received a call that my food he said that he couldn't find me. We recently moved down the street, and I had forgotten to update my information online, so that confusion was my fault. But when I tried to explain to him my new address, he didn't understand me. At all. We eventually understood each other, but it caused far more frustration than necessary.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lmPhEpqtcuGzUwYK1_1GXg"
  },
  "gomzDZAMikI-fgFvB-sq2A": {
    "date": "10/12/2015",
    "text": "I have not found any food from La Felice that I do not like. Their pizza is excellent and their appetizers are so good! We order drom them a lot and friends from out of town ask for it when they visit now. The staff there are friendly and always get our order right. Fast and efficient delivery as well, they always say 45 minutes but always deliver within 30. I highly recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pqjyoD-VDQazp2V4G2Ok7Q"
  },
  "eiwR9tD8zV0yabMHGl2sDQ": {
    "date": "12/28/2014",
    "text": "The bread sticks are soft, large and fabulous! The pizza has a nice thick crust and the sauce is just right! The shop has a small, cozy  eat in area too! I have found my new favorite north hills pizza shop!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G82Z36IQwfm4gyi0SPWEKQ"
  },
  "YTMLQiko_PjGZKIqkUX4bA": {
    "date": "3/3/2016",
    "text": "Ordered delivery for lunch. Love that I can order online and not have to call. They have a great menu with variety. I opted for a small cheese lovers and a garden salad with cheese. came out to $24 with tip.  They are very generous with the cheese on pizza and salad (I love cheese so this is great!) pizza smells and tastes delicious. The crust is a little thick for my liking (I like it thinner like New York style). The salad had fresh greens in it.. Not big chucks of gross lettuce.  Overall good experience.   My only compliant was the delivery driver knocked on my door one time and was walking back to his car when I got to the door like I was taking too long for him. I answered the door as soon as I heard him, but oh well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nR7aHhdO06RA1qakIAQQBg"
  },
  "OoaeoqlLFfj16nIzC7XBRw": {
    "date": "12/29/2015",
    "text": "I hate posting lousy things about local businesses because i feel like yelp is sometimes used unfairly. This time,  however,  I think the terrible service I just paid for absolutely warrants what I'm about to say.  This place is the worst - at least for delivery.  My husband and I order take out several times a week and thought it'd be nice to try something new....  I wish now we'd have stuck with one of our regulars. The delivery driver hit on me more than once. If I'd met him in the street and he'd been so inappropriate (commenting on my appearance and the way I smell) I certainly wouldn't have invited him to my home. Because I expected a reasonable degree of professionalism, I made the mistake of doing so. I might have overlooked that if the food hadn't been so terrible.  My Caesar salad was wilted, with rubbery cheese, dry chicken and weird extra toppings. The marinara cup that came with the mozzarella sticks was literally less than half full. My husband's sub was hardly \"deluxe\" - a small portion of steak, no extra cheese and scarce toppings....  My advice?  Try Riviera. They have basically the same menu,  prompt and polite employees, much better food.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "QC3T0B3WRKQLY5R5SkBnKg"
  },
  "4RxQGGshwEYBApbopDoH-Q": {
    "date": "3/25/2018",
    "text": "Food was great and on-time. We ordered for delivery and when it arrived, it was still piping hot. I will definitely order from here again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B5j7cHHIyzvSm_Zj3u6sNQ"
  },
  "HSJNeHhICLPlpIPQMGDPOw": {
    "date": "3/27/2017",
    "text": "Always great service whether it's take-out or delivery. Pizza is good and prices are even better. New go to pizza joint",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uk1CJ-rDJ3RiudNfjc-w_A"
  },
  "VdLUhLH4lO5WE8gbsAuhSQ": {
    "date": "5/11/2017",
    "text": "Awesome . Every single time. I have been going there since day one. I have always had great service, great attitudes, exceptional value and awesome food. Pizza is #1 with these folks. Subs are good, calzones are good too. Try this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wjnM63U_xsjQ80tpY0rJwA"
  },
  "3XiuA2LLK3j0qKdWQ46SeQ": {
    "date": "12/27/2015",
    "text": "Placed an order online..when the order got here it was 4 dollars more then what it said online..and the delivery was 10 minutes late..lets talk about the food...the Sicilian pizza tasted like cardboard..i mean everything was cooked ok but it had absolutely no flavor..i also ordered buffalo chips (fries) everyone was rock hard. I also. Ordered a haogie that was pretty good..it was a pretty good hoagie.. if as a last resort i order from there again it will just be a hoagie..unless im brave enough to try something else",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mBrBcRDB2pPZmTn0AEJhVA"
  },
  "nedJz-IBcAaZMAdzpKQ8KA": {
    "date": "1/22/2017",
    "text": "I love their pizza and appetizers. The sauce is always excellent. It's never too sweet or too spicy. The ranch dressing included is excellent for dipping the crust in. The appetizer sampler gives a good taste of the choices.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aU080-NIwFsOotEyeWuemg"
  },
  "hQqUyNiHqCMs2cFGpt5v0A": {
    "date": "8/3/2016",
    "text": "The best part was the fries, they had a great crispiness to it. The price was good bc of the deals they offered. The bread sticks were average. The pizza is a solid three star, but you can not mess up pizza. I can pick four better pizza places. The toppings I ordered were really lacking. For almost $2 dollars a topping I expected my pizza to have toppings in the middle of the pizza, but it was nothing but cheese. The toppings that was on there was very minimal.  The gyro had frozen meat just thawed out on it. It was the texture of seitan I am assuming bc it has high amounts of filler in it. The chicken wings were fine, but once again the BBQ was cheap out of the bottle.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XTf_KSMPo66PKYZaF1kC0g"
  },
  "j-EmxunT9aTeJ8GJMiXvAA": {
    "date": "8/19/2016",
    "text": "This was our first time to try La Felice Pizzeria, and we definitely were impressed! We ordered (delivery) a meat lover's pizza and bread sticks, and everything was great. I think this was the first time I ever had salami, bologna, etc. on a pizza. Fantastic! We definitely will savor La Felice pizza again, the next time we're in town!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OhnALTDVbffslbYNzhw4qQ"
  },
  "J5kyFFKVWbPcqfYW1RLeIg": {
    "date": "11/9/2014",
    "text": "When it comes to pizza, these guys knock it out of the park. The crust is foldable and chewy, the sauce has a great zesty flavor, and they use just the right amount of cheese, it's not heaped on by the handful. Their pizza comes with a side of homemade ranch which is killer. I also tried the hot wings; they were light on the sauce, but still had great flavor. A medium three topping pizza and 6 wings set me back $21 and were delivered in about 20 minutes. La Falice just made its way on to my short list of go-to pizza joints.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9zp28KSKFTDENyVoQrQcow",
        "caption": "Photo of La Felice Pizza and Pasta - Pittsburgh, PA, United States. Hot wings, a little light on the sauce but still great",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9zp28KSKFTDENyVoQrQcow/o.jpg"
      },
      {
        "img_id": "j5KIBB4CVNzFMRmrAgrCzQ",
        "caption": "Photo of La Felice Pizza and Pasta - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/j5KIBB4CVNzFMRmrAgrCzQ/o.jpg"
      }
    ],
    "user_id": "DOajn8AtMjNtCZ87YoIlwA"
  },
  "_Yngg_MUnDkrFLVqKVRkfg": {
    "date": "3/13/2015",
    "text": "We gave up meat for lent, so keeping in mind that we didn't order anything with meat...  This place was really good, and I'm looking forward to going back when I can order meat-filled items!    We got cheesy bread sticks, a seafood calzone, and a caprese salad.  The breadsticks were pretty good.  The seafood calzone was weird...but...well...no meat, so we wouldn't have normally gotten that.  The caprese salad was a standard salad.  Not much to say.  They have house ranch, though, which is pretty good.  There are a bunch of coupons for this place if you look around.  I think we may have found one of our go-to pizza places :-)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BTKtAXjPHjH5B3xuT4uiIw"
  },
  "PjgOlwB1icZQ6HEh57IdsA": {
    "date": "6/5/2014",
    "text": "All things considered, La Felice is an OK place to eat.   I ordered a chicken burger, soda, and an order of sugar balls because I had no clue what they were and figured, worst case scenario I can give them to someone else at work.  What I liked: The convenience of ordering online, the chicken burger was crispy and the bun toasted. It looked appetizing. The fries were yummy and perfectly made.   What I disliked: Despite specifying that I did not want pickles, I received my burger with 6 sliced pickles underneath it. Because pickles are wet and the burger had a bun, the whole bottom was saturated in sour grossness. It took away from the otherwise tasty sandwich. As for the sugar balls, they were just kind of fried bread with a pinch of powdered sugar over them (seriously not enough for one ball, let alone the 20+ that were in there). The chocolate sauce they served it with was warm Hershey's syrup. I guess I just expected something with a little more effort.   Decide for yourselves. I don't like saying a place is bad- it could always have been an off day or something- but I do think my order was put together carelessly, and to me, that is a red flag. I will not be back.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "gWLeQBH2tgHk6OsBAUzNxA"
  },
  "8zuQU0lWNQoMYY1IPJnIEg": {
    "date": "12/28/2017",
    "text": "If I could give negative stars, I would. WORST PIZZA in the North Hills area,hands down. I have definitely never felt more ripped off from a pizza joint. I ordered a large two topping pizza. When it was delivered, it was ice cold. Keep in mind I am 4 miles from the Ross location. Totally unacceptable. The worst part was not only the pizza was ice cold but the toppings were not even attached to the pizza!!! They were falling off all over the place because they didn't add the toppings originally when they made my pizza. Instead they took a cheese pizza that was ordered previously by someone else and just threw raw toppings on top. This was my first time ordering from them and definitely my LAST.  La Felice you really know how to screw up the easiest dish in the world. My best pizza experiences have been at Bellisarios and Supremos Pizza! Check out those two places and don't make the same mistake I did going to this garbage place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "rXbV15JVNaibIDDw8l696g"
  },
  "hLBxhfSSBx1CAM20qZpV_A": {
    "date": "5/27/2017",
    "text": "This is one of my favorite pizza places in the north hills area. The sauce has a different (sweet) taste to it, which is refreshing and very good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LdimaG6T_CXFI0jyrZwgag"
  },
  "coPJxTpBQ22wkYIgDRGiFg": {
    "date": "8/3/2017",
    "text": "The food is pretty decent. It has been too greasy on some occasions though. Delivery is usually prompt and they always get the order correct. In the past, drivers have not always been prompt and the food has arrived cold, which, combined with the overwhelming grease at times, is why I give three stars. The portions are average as compared to other places.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HhYFGSspHdiQp220Ogz82Q"
  },
  "ITLj1Cgr1MKe48pgAgaISw": {
    "date": "11/21/2015",
    "text": "We ordered on a Friday night. Order arrived on time about half an hour. Food delicious. We ordered an extra cheese pizza with their homemade marinara sauce cheesy breadsticks popcorn chicken and a Caesar salad. Cost about $31. Will definitely order again. Family pretty fussy about pizza. This place pleased all of us!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Df7P77yFrrYnPUlo7LmFJA"
  },
  "vzOrnjXMHWMNCNFxh9v39g": {
    "date": "3/26/2014",
    "text": "Went to this little family owned restaurant for the second time tonight because I have some coupons for it.  The food is pretty awesome.  I got a 16\" Hawaiian pizza and are four of the twelve slices there, and since getting home I have already eaten two more.  Boyfriend got the tuna hoagie and really liked it as well.    The only thing I dislike about the place is that all of the drinks are bottles and cans.  Oh well.  Will definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VBViK-GO_Nl_VKACX0uhNg"
  },
  "J8a9E3NlVNHjgAWw98yjeQ": {
    "date": "9/5/2013",
    "text": "I stopped by here a couple of Tuesday's in order to pick up a to go pizza.  My fiance, a friend and I were trying pizza from three different places and Le Felice was one of them.  Whenever I called the restaurant and placed the order for a large cheese pizza, I was asked if I had any coupons.  I responded that I did have an ad in my hands but could not locate any coupons on it that I could use.  He then told me to bring it in and he could see if there was anything I could use.  About 45 minutes later (I was told 15 minutes but it took me awhile to get there) I arrived at the restaurant ready to pick up my pizza.  The inside of the restaurant is decent looking with the pickup counter and kitchen right in front of you whenever you walk in with a dining room off to the right.  Whenever I explained to the guy behind the counter that I had the ad but no coupon on it, he decided to give me the Large take-out special (ironically this new ad would come in the mail the next evening) which I was thankful for. As for the pizza itself it was a fairly thin crust with more cheese than sauce.  The sauce was also a little sweet but not too sweet which was nice and the cheese on the pizza was good as well.  Overall, it was a solid pizza and while not being my favorite of the three that I tried that night, it was the one that we ate the most of.  The bottom line for me is that I might stop back here again in the future.  I really liked the customer service that I received and the pizza itself was pretty good so it may be a change of pace pizza place for me.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4m9NXICYBC5i9t4aTt-I6w"
  },
  "mFGT_kSfeB9Ny9AbyWsiTA": {
    "date": "12/17/2015",
    "text": "Stopped in for their $5.99 half hoagie and fries lunch special. For the price paid, the portion was huge. Ordered the buffalo chicken hoagie and it was excellent... I would highly recommend trying it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IXD-jdycm7m34b_Nliy82g"
  },
  "MFyI9DkvutEUGjJm5YAEjA": {
    "date": "7/12/2015",
    "text": "Ok, I used to order form this place all the time.  Love their food, and I had put up with the poor service because of it.  Until tonight.  The driver had trouble finding my place, probably for the 5th time or so, and I got upset on the phone trying to help them find my place.  I finally got my food, then about 45 minutes later, I started getting multiple threatening and explicit phone calls from someone at the restaurant.  If the phone calls don't stop I'm considering calling the police.  Order at your own risk, just understand the type of people you're dealing with if you do.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "HHGNvnfW5eNtrR7uL2mmug"
  },
  "1j1b4E7T52Z-Z3GSBlc8Gg": {
    "date": "9/1/2019",
    "text": "Good food. Ordered pizza, french fries and wings which are hot and good as for the first time order. We are enjoying hot food in bad rains and thunder special thanks to the delivery person and the restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OmOAPeyDo9Fc_rZaoWQ8vA"
  },
  "XCholbAZe35eHztT4v-sOg": {
    "date": "8/21/2019",
    "text": "I love the way they provide prices. And meals taste really good as well. Always friendly service and fast delivery time. One of the best places to eat at north hills.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7SFwzU78BPoYWGHZJlfbQA"
  },
  "aupLOgBkSqExthRzfPthQA": {
    "date": "8/2/2019",
    "text": "I rarely give small businesses bad reviews even if I'm dissatisfied but In this case HERE I AM! If I could give a negative star I would. Most people  would've done more. I simply ordered food from a pizza shop and to my surprise my personal information was given away. I tried reaching out to them and was ignored. Therefore they're just grimey all around. Unless you like compromised personal info included in your delivery I'd say make a Tostino's before ordering from them.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2SmevBPMQ44gcoTD23mZJQ"
  },
  "nSzxfj2j0bfC1Ljoes33yw": {
    "date": "5/4/2019",
    "text": "It has become our favorite weeknight pizza place like seriously! I didn't know they served such amazing sandwiches as well I was skeptical and avoided ordering them for a long time only until recently, I was in a weird mood as ordered there chilling chicken sandwich and I absolutely love it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ikPwq0HweyVcywKcUJcqVA"
  },
  "77lGS7rOD7XHqYZXo8HlUw": {
    "date": "1/21/2018",
    "text": "I gave it to my dogs    See photos   Worst pizza in my life.  Thin burnt pepperoni , smelly dark sausage   Nobody at home liked this crap   Spongy crust was nothing like Sicilian is supposed to be  I should have gone to Luciano's! Or Italian oven. Or even Pizza Hut",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WBw28WvwBeEGeY8YCY6KiQ",
        "caption": "Photo of La Felice Pizza and Pasta - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WBw28WvwBeEGeY8YCY6KiQ/o.jpg"
      },
      {
        "img_id": "92FkckeWTsLGJ0FLDqu40Q",
        "caption": "Photo of La Felice Pizza and Pasta - Pittsburgh, PA, United States. Gave to the dogs",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/92FkckeWTsLGJ0FLDqu40Q/o.jpg"
      }
    ],
    "user_id": "iH_fFp5HO4DI1DmZM4vQcA"
  },
  "30dn9uY9Hj_JWsaLtWnF_Q": {
    "date": "9/17/2018",
    "text": "Someone recommended to try this place out because It was the best.  I think they need there taste buds checked, or to each there own I guess. I have to just add this into my category of another average Pittsburgh pizza shop. Nothing special. Wouldn't order again unless it was the only option.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FL17sG6mYmFMnX2rWdgvEw"
  },
  "Nf9XxEKx2t9rRLhYB_93UQ": {
    "date": "4/12/2019",
    "text": "This restaurant uses unlawful, deceptive sales practices. They offer $10 off $20 on the cover of Clipper Magazine if you guy a gift certificate through an outside company. At no point during the purchase of the certificate is it disclosed that the offer is dine-in only. Then they refuse to offer delivery. I don't know who is running this place but they aren't Italian-American.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hSDdUXGmyewQPcIGO5GVFw"
  },
  "8iAGncxgjPAUGH5MOMh9vw": {
    "date": "7/30/2018",
    "text": "Close your eyes, and think of a pizza that isn't bad; but, isn't good. This is la Felice navidad Pizza. Don't get Boggs wrong the pizza wasn't bad but the more I thought about my night and how inebriated I was, the more I reconsidered what my taste buds were telling me. I wish I could give this place more stars, as they were extremely fast with the order. I don't know where they were getting their ingredients, but my guess is out of a box from the biggest chain store in the world (no free ads) instead of Italy. If it is almost midnight after some hippie concert or after a Stiller game where Big Ben and Jeff Reed plan to flirt with some women afterwards; then, get this pizza. If that isn't the case with how your night is going, don't.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qedlu5vtyu8CecIiCj26Gw"
  },
  "AZI_NdDK8F4Y4nlNW0BgAA": {
    "date": "1/15/2018",
    "text": "Got an XL pizza from here: half hawaiian and half pepperoni.  It was pretty big for the price and fed 3 people easily.  It's nothing crazy but it satisfied the cravings.  The best part was probably the pepperoni, it was those smaller ones that curl up when you cook them.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_hsruQCw6UTnjlQiuSpScg"
  },
  "dd06Zsy6fyMM-AJKnbruyQ": {
    "date": "3/22/2019",
    "text": "Always quick delivery and food is awesome! Go to order is the family deal, has a little bit of everything for a great price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ERNJhhTfpfwcQ_c9nYhCTg"
  },
  "PNTQN5WxvcHNrMshtZLdvg": {
    "date": "9/20/2018",
    "text": "My favorite pizza place. Love the pizza. Quick service and very friendly delivery drivers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TMjMYhGB06njPz4gSkPgQA"
  },
  "NyfO3HrLDdjotrprXXZZ9Q": {
    "date": "7/29/2018",
    "text": "Here's a good rule to follow:  Buy pizza from a pizza establishment owned and run by Italians, not by middle easterns.    Threw away 99% of what was purchased at LaFelice... a large pizza and calzone, neither of the overpriced items were representative of the usual pizza fare.  So, if you're expecting great pizza, please purchase from those who KNOW what pizza/calzones are!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AY3s_vwETHwC_4l1kP0vIw"
  },
  "mJ2N6uOZ8d_XmbkiugiAKg": {
    "date": "1/16/2019",
    "text": "I don't feel like there's any heart in this place. Every time I order it amazes me how low quality the ingredients are. The steak hoagie is very bland. The gyros are also terrible unfortunately. I ordered a bacon pizza and there was barely any cheese or bacon. For $17.00 for a large bacon at-least make it decent. I got cheese fries and the fries were cold and stuck together and unsalted, the cheese was cold, as if it was in the fridge. Never ordering here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ReunqZGx697zdEwk_URdgA"
  },
  "XEWZWbojDTfewFVzoZfGZA": {
    "date": "7/28/2017",
    "text": "Placed pick up order on a Friday night. We had the cheese lovers pizza which includes five or so different cheeses as well as the chicken salad. The pizza was delicious, still piping hot once I had made it back home. The chicken salad was top notch as well. All the vegetables were fresh and crispy. Being from NY, I have high expectations when it comes to pizza and I am always skeptical when trying a new place. So glad we did.  The service was great too. Upon my arrival, a delivery driver who had just got back from a delivery greeted me in the parking lot and held the door open for me. These folks understand good customer service and quality food. We are truly excited to have discovered them and will definitely be back again soon. A big thanks to the other yelpers for their reviews as this is why we chose them to try out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OaOIqneT1MZEJYk4B1L_Fg",
        "caption": "Photo of La Felice Pizza and Pasta - Pittsburgh, PA, United States. Cheese lovers pizza which includes five or so cheeses. This one was minus the feta. So good!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OaOIqneT1MZEJYk4B1L_Fg/o.jpg"
      },
      {
        "img_id": "a5qd4ggLuZhBAb2VucUQ9A",
        "caption": "Photo of La Felice Pizza and Pasta - Pittsburgh, PA, United States. Grilled chicken salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/a5qd4ggLuZhBAb2VucUQ9A/o.jpg"
      }
    ],
    "user_id": "IawHNXWc1ciu7axnLCzpMg"
  },
  "v7PO62Hfb8gMovfDsCxSbg": {
    "date": "11/15/2018",
    "text": "The 2 seafood pasta dishes aren't anything like the pics on the website. They show muscles, clams, big shrimp, scallops and linguini. All they come with are salad shrimp and imitation crab meat with penne pasta. No Thanks. Don't use images off the internet to advertise your food!! Especially if its not even in the same ballpark. If your proud of that crap then use images of YOUR food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2VfgTeoUW_TUU90O-qn9dQ"
  },
  "4FfFYrVFbS3e5wsIFwIkyA": {
    "date": "12/16/2017",
    "text": "False Advertising!  Be warned that what you see on their website isn't necessary what you are going to get.  I ordered the Hot Sausage Sub.  On their website, they had an image of a big juicy sausage link.  When the sub came, it contained a handful of pizza topping crumbled sausage, and it was simply awful.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "OcIFpzBcRMMFa2d-bVFAxw"
  },
  "OrF5TOmgqJWRfebmSbFk1g": {
    "date": "7/20/2017",
    "text": "This is best Italian dinner delivery in North Hills. The food is delicious without a high price tag. I ordered Tuscany chicken pasta, just the right combination of chicken, artichoke hearts, my favorite, roast red peppers and spinach, another favorite, served over pasta with garlic butter!!  Wow, Yes,  I ate the whole dinner and carved for more, check this out if your tired of pizza and wings for dinner, Oh they have that too on a hugh menu, the Tuscany chicken salad was awesome!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KvTrP3Udzug7qxCBmGuhVQ"
  },
  "HCsy4RhWxYfIQdEYvI3lyg": {
    "date": "2/11/2018",
    "text": "Food is absolutely delicious!  Order here once/week..quality food, fast delivery, and delicious!  Prices are great for the quantity/quality of meals!!!  Will definitely continue to order!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7JIm-L0jvYn0QZN0DPj36Q"
  },
  "T32x_2f862lqZ7n0SO_TDg": {
    "date": "12/17/2017",
    "text": "Delicious food and very friendly service!!! The food is always on time, hot and delicious! Would highly recommend this place if you live in North hills!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UmV9Zn_aVrp9MQxXl_pRXQ"
  },
  "pCGNTK8P-OmRZ7fJ-Af_dA": {
    "date": "9/15/2016",
    "text": "Ordered a steak hoagie and hot wings. The hoagie was ok, but nothing you couldn't get at any other pizza place. The hot wings would have been really good as the hot sauce was great, but there was next to no sauce on the wings (see my pic). It looks like they took the wings out of the fryer, put them right into the to go container, and just used a squeeze bottle to drizzle tje sauce on. One wing was compmety sauceless. It isn't that hard to put the wings in a bowl and actually toss them in the sauce.  I won't be ordering from this place again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8TQ2wGk1bNfPTIwRGB9z2Q",
        "caption": "Photo of La Felice Pizza and Pasta - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8TQ2wGk1bNfPTIwRGB9z2Q/o.jpg"
      }
    ],
    "user_id": "MHJP-72r0cfEyndzOYWfQQ"
  }
}