{
  "wa-21si1pmTdJaptZMutuQ": {
    "date": "6/12/2012",
    "text": "Overall:  Impressed by the quality for moderately-priced, suburban sushi.  Service was friendly but inefficient, as described below.  Sat at a regular table (not hibachi or sushi bar).  We ordered a couple of appetizers, soup, a couple of specialty rolls, and a hot noodle dish.  All the food was very good.  Not fantastic by big city or West Coast standards, but definitely a place I would recommend and go to again.  Specifically, the specialty rolls were good sized, and they included some standard combinations and some unusual ideas that sound good (rather than just eye-catching novelties).  Seafood udon dish was very good but slightly soupier than ideal.  I would have liked to see Japanese standards like ohitashi and perhaps grilled fish (e.g., hamachi kama) and grilled mushroom appetizers.  The service was pleasant, but we were someone frustrated by the time we left.  Despite there being many employees per customer while we were dining (early on a Tuesday), it took a long time after we were obviously done eating to get our check and an even longer time for the credit card to be picked up.  With so many staff members walking around, it would be appropriate for someone other than our waitress to pick up and run the credit card.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "96ZCAjP-Enu3Na-GaeoaTw"
  },
  "Ib_vhWQhzxxmi6oegQmHXg": {
    "date": "12/19/2014",
    "text": "Use to be good, gone way down hill. Last time there (tonight) they didn't have heat, floor was filthy, my hibachi dinner came out before the sushi appetizers. This has exceeded it's life much like all hibachi do. Go else. where",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CduG1dKRfBxiP3DOHPAlrA"
  },
  "mZCrCmjIjd6VHfD2H9S9Kg": {
    "date": "5/13/2013",
    "text": "Gross! Our server greeted us at the front while smoking and talking with his friends. We wanted to sit at the sushi bar which was dirty and un-bussed, as well as the entire bar and 3 tables in the front half of the restaurant. They out of cold saki and we poured our own beers. Every specialty roll was fried and had some sort of mayo component. Not good!!!!!!!!! Will never go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SZVZSYKZFCf4lpdydX3eMg"
  },
  "bUge1ny4dwmbzPPrrveEtQ": {
    "date": "7/7/2014",
    "text": "I went here for lunch since I was looking for a place nearby that served japanese, but I dont think I'll go back.  Im not a fan of hibachi so I decided to have sushi/sashimi instead.  I ordered the 10 pc sashimi lunch and was disappointed that they did not serve egg (tomago) on their sushi menu, especially since its my favorite. Although they were out of mackerel also it wasn't a problem, so I ordered 10 pcs off of the menu.  The salad that came with it was horrible with some type of mayonaise dressing on it instead of ginger. I didnt finish it. Then my sashimi came and besides the cuts being slightly undersized, I had to ask for some wasabi or ginger since it wasnt on my plate?!    The sashimi itself didn't taste bad, but the whole experience made me feel as if sushi/sashimi was not really their thing. Nothing special.  Hopefully the specialty rolls, entrees, and hibachi are better, but if im dissapointed by the basics I'm not interested in returning.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YoTgwjLhd4QJC-0WEM8AZA"
  },
  "se5YBZWfPNYkebZaRa7-Rg": {
    "date": "2/16/2012",
    "text": "Great great great sushi and atmosphere.  The Mummy Roll and Sweetheart Roll are a must.  I'm a huge fan of their ginger dressing on the salad as well. I will be returning and highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "Y_g7cI-Ivk6Tq6ONdy72ow"
  },
  "xNBuYllrlwu13dH2gHkmjA": {
    "date": "3/10/2015",
    "text": "Used to be a frequent guest at Yamato but this has changed recently.  We usually go on Wednesday which is their sushi special day. The rolls were always delicious and a decent size. Recent times we've gone there, the rolls are significantly smaller and not filling. I think they skipped mixing up the ingredients for the spicy crab roll and just threw everything in and rolled it up. It did not taste good and we only ate one of two of the rolls. I hate complaining but we told our waitress that it didn't taste good and we didn't want it. She apologized and took it away but when we got our bill WE HAD TO PAY FOR IT!!! This is not the first time there has been a problem and we have never received any type of discount or even a coupon for our next visit. It's like they didn't want us to come back. On a positive note, their hibachi is the best around in my opinion and their ginger dressing is AMAZING (they even sell it in two different sizes at a reasonable price)! The hibachi chefs are friendly and really know what their doing. I will probably return on occasion, but not nearly as much as I used to.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HKbqew3wZk9_RukDCfYoAA"
  },
  "uNHeaPB1rRZFLwzSa7Z8mw": {
    "date": "6/25/2013",
    "text": "This was our first time coming to Yamato and it definitely won't be our last. We were there with a larger group for a birthday party and the service we received was amazing. Our waiter was very attentive and personable, and the hibachi chef was awesome. We had the shrimp tempura and dragon roll to start with and both were delicious. What I liked most about our hibachi dinner was the fact that you could get 2 for $25, which I didn't think was bad. I had the shrimp and swordfish and my husband had the steak and chicken. Of course we both tried each-others and thought they were delicious, especially the swordfish! If you've been thinking of going here but haven't, you should definitely go try it out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-aZgXq9igO3kOOIuJPXc2w"
  },
  "JkzjpBHK4aVjmEQhbVISMQ": {
    "date": "6/9/2015",
    "text": "The food was good. My main complaints about this place are the extremely slow service.  I have been here twice and both times it took forever to get started, even though the restaurant was not crowded.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K19BaP1TS5_ojYV5raTLGQ"
  },
  "B5of-xpIPdx5g5eou2bZQQ": {
    "date": "1/17/2012",
    "text": "This is my Sushi place of choice now. After moving across country from Los Angeles where great sushi places are on every other corner, it was great to find a place that ranks up there with those LA places right around the corner.   Walked in while exploring the neighborhood and was convinced to sit down and try something. So we did. The sushi was fantastic. Andy, the head sushi chef was amazing to watch. He is an artist. All the chefs are fantastic, but Andy is elite status.  The hibachi is delicious and entertaining. Have been here 3 times in 3 weeks since discovering the place and will be returning often.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "WpqE8HrZOOIhgMalytry-w"
  },
  "8nLPgz2paiCa-hg5ctg1LA": {
    "date": "4/19/2012",
    "text": "Came for dinner Saturday. Reservation was on time and setting is nice.   3 of us had hibachi, I had sushi. The hibachi people said is was OK, but preferred Shogun. The hibachi cook was Balinese, and was interesting to talk, too. Didn't put on the big knife and flame show, which I didn't miss.  Sushi was good, but better can be found nearby at Taipei Tokyo.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZFeF1ogvwSyRhvTcn_2mJg"
  },
  "5a0UFqhqNr0PqgUIK-DrVw": {
    "date": "12/14/2011",
    "text": "I'm going to agree with the first post! Best sushi around here! Fresh taste and presentation.The hibachi chef's r the best I have seen ever! The staff is great! If u didn't know that they just opened you would think they have all been doing this for years. Have to give props to the manager for training them all the correct way I have not 1 complaint! I will b a frequent in Yamato",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nz2ZmUJPig2gzIZS6lOWZg"
  },
  "q2HHe3FKJmMV8jqNVv-jUg": {
    "date": "2/28/2013",
    "text": "The service was extremely slow.  Many people in my party ended up going to the bar themselves to get drinks. The waitress was extremely nice though.  The manager at the restaurant probably should have had another waiter/waitress help her since we did have about 20 people in our party.  Most of the people in my party got hibachi dinners, but I got sushi, and they forgot to put my order in.  My husband had to go ask someone about my meal.  I've had better sushi though.  The slices of fish were quite thin.  I also had the tuna tartar, which was delicious, and would recommend that to anyone who likes raw tuna.  My husband said the mushroom soup and the salad dressing was really good as well.  The hibachi cooks were extremely nice and put on a great show.  We had kids in our party, and they had a lot of fun with the cook asking for special stuff.  They gave me $5 off my meal, and another $5 coupon for the problem with my meal, so at least they did something to rectify the situation. The ambiance was really nice, very trendy but not in a snooty way.  All in all, I've been to better hibachi restaurants, with better sushi, but it is still a nice place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nxWJkFawfVhp_F9Rg9Ye7g"
  },
  "ZDxfyQhOa4Yc5Ios6gaLmQ": {
    "date": "1/19/2012",
    "text": "The food was ok but the service was very slow and the music was too loud. It's a little over priced as well.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lkvzrSbL8GJmMcSuG17gpg"
  },
  "4B2OvR3nF6QulTH4uk9rHw": {
    "date": "1/2/2012",
    "text": "It was just what I was expecting. The sushi was rolled really loose and that was tricky for a beginner. Wasn't bad, wasn't amazing. Nice decor.  I just don't know how they are going to compete with the three or four other places that are EXACTLY like it around the corner.  So.... nothing special.  But not any different then the rest. So try it if that is what you are looking for.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6-BE7PjmmHDKQNzsepwImw"
  },
  "Etsb_d__w65M6xZqCUKn7A": {
    "date": "2/5/2016",
    "text": "Went out to this place for my friends birthday dinner. I told her there were better places and she decided to go here because the food is good and the place is clean. The food was decent, a little too much teriyaki sauce for a hibachi style meal. But the service was horrendous. In fact, we finished our meal and could not leave that restaurant for 45 minutes because our server had not come around with the checks, boxes, etc. He was nowhere to be found most of the night. He finally came to drop off checks but left so fast, I couldn't get to tell him that I needed a box and a glass of water. As a server, I understand that there may be nights where you are slammed and other employees call off making it difficult to juggle tables but this was terrible. The table across from us had been seated for 10 minutes without anyone even taking a drink order. I will never come back. Do yourself a favor and check out Shogun by the post office in Monroeville. There is a reason it has been around for 20+ years! Other than the service, the food is okay, prices are comparable to other hibachi restaurants, and the hibachi chefs are entertaining.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5S_zqSrwvY1qDnThxHFmSw"
  },
  "eH4B_N-n8Xyx1Pbi33kKqg": {
    "date": "11/18/2013",
    "text": "My husband and I celebrated our anniversary here after seeing some positive reviews and getting excited about Toro. The atmosphere was nice and impressive. The service was very slow, however. I'm not sure if it was because another party at our table arrived later and they wanted to take the orders all at the same time. We were there for almost two hours and there was a good bit of waiting. We were served Toro sushi instead of the sashimi ordered but kept it as is. It was a little thin but very good. We also ordered a volcano sushi, which was also good. The hibachi portion of the dinner was very entertaining...not all the same tricks and jokes and the chef had us laughing a lot!  I was impressed with the size of the shrimp and also the Chilean sea bass was cooked very well. Fully cooked but not over cooked and nice. The steak had a nice flavor. It was all good and fine but we probably wouldn't return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G2hOfzXQFNkHm-xsItPd8g"
  },
  "VzAhV4ZsBBkjF4T6tqAaow": {
    "date": "10/19/2012",
    "text": "My son and his friend went here and I wanted to pay for their dinner with my credit card over the phone.  Somehow, like even any pizza shop in America can figure out, they can't figure out how to run a credit card over the phone.  I'm not sure how intelligent the management and staff is at this place, but apparently they better never work at any place that has deliveries or take out, because they aren't smart enough to process a credit card payment over the phone.  Further more, they aren't intelligent enough to work at any catalog company, either, as they take credit cards on the phone, too.  It frightens me that any restaurant that can't figure out how to take a credit card over the phone can actually run a safe place to eat.  Never, ever, again and I'll make sure everyone I know is told how they treated my child, especially in front of his friend.  Maybe they should have let him operate the credit card machine as he seems to be smarter than anyone in the place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gjqVMjWhRrH8FuYbJSwfmA"
  },
  "YAf0KGmFI9bcY49EnqZ3oQ": {
    "date": "1/21/2012",
    "text": "I went with a group a few days ago.  We got both hibachi and sushi, both were amazing.  By far the best sushi I've had in a long time.  Also, the prices were really reasonable, especially the lunch specials.  We got one of the lunch specials as an appetizer, 3 sushi rolls and soup for only $10 and they were delicious. The servers were very nice and helpful.  I will definitely be going back :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bz20ywkIcocATmfUQv2aMg"
  },
  "6vL-ARSceG69VOIQVsynqg": {
    "date": "4/7/2013",
    "text": "Really good sushi and specials. Service is hit or miss, but everyone is very friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iZimnyYB7itoIYAD4mvhgw"
  },
  "IT3b9az7SZY0kTzK1r6qeQ": {
    "date": "2/15/2012",
    "text": "A friend and I stopped for a drink and apps because we discovered our original destination, Ray Azteca (Mexican) next door does not have a bar.  Big mistake.  After we ordered two martinis ($8.50 a piece during HAPPY HOUR?!)  and two appetizers, the Pear martinis arrived and they were terrible.  Cough syrup comes to mind.  We asked the bartender to \"tweak them\" so they were drinkable,  (mind you, we had to carry them back to the bar because at this point we were basically not important--there were obviously some big tippers at the bar and we were at a table.)  I took my drink up to the bar a second time because it really was horrible.  A that point both bartenders saw me waiting, and both walked away and acted as if they hadn't seen me.  One of the bar patrons even noticed it.  At that point the apps came;  more disappointment. the shrimp was heavily breaded and chewy, and the spring rolls (normally a favorite) were greasy and doughy.  The sauce with the shrimp was heavy on mayo.  I truly believe the appetizers were frozen from a box, did not taste at all homemade.  But really the bar service was terrible, unless you really enjoy blondes with lots of fake cleavage, then you may enjoy the female bartender.  I never tip less than 15% but between the two of them they got a very small tip.  This visit confirmed our attitude about food in suburbia--sub par for the masses. 42 bucks for this?  I will stick to drinks and sushi in the city.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "fVqSrfSPqiiUVjeS4h21Jw"
  },
  "RyFkCMBb4ryRE1VVJXW6aQ": {
    "date": "6/13/2015",
    "text": "This is definitely one our favorite restaurants. The staff is so entertaining and friendly. They go out of their way to make sure that the guests are satisfied and happy. The food is really really fresh and tastes great. Always a great time at Yamato.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1o3OJnFCuUP4V1rvQfBMhg"
  },
  "YG405nTskqqAaKoT0s8aow": {
    "date": "2/24/2012",
    "text": "So happy we came here this week.  The place was pretty quiet, but we had the best hibachi chef in the world.  no joke....i know the jokes are lame and everyone's seen the smoking onion stack, but this guy was amazing.  It may have had something to do with the free sake he was squirting in our mouths from 5ft away, of course :)  Next time I'm in Pitt, I'll be going back.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "MhulcOVGHzK0SOHG13ln8Q"
  },
  "1f3q5VBl4qkx3MI8009VEA": {
    "date": "5/29/2015",
    "text": "I order from here only out of convenience.  The owner or who I presume is the owner confuses me.  Rushed service and def has come take out order issues.  It seems at times he does not want to take an order.  It's confusing since he is in the restaurant business yet customers clearly seem to bother him.  If this were not the closest sushi spot close to me I would never give them business again. The food is decent but the service is the worst.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "62Gi1YZ9dKh60Jx0nnIbaw"
  },
  "OyDjEJmHjGeYnmdIHd1WNg": {
    "date": "9/11/2016",
    "text": "Service was average as was the food. I ordered the Salmon and my wife had shrimp. The experience was subpar, but then it got more interesting...I got the check and gave them my credit card. A short time later the server returned and stated that their credit card machine did not work. I stated that between my wife and I we did not have the cash to cover the check. The told me I would have to walk to an ATM to get cash. I was new to the area and didn't know where the ATM was and they had no suggestions. I had to walk across a busy four lane highway in order to get to an ATM. Upon my return I asked to speak to the Manager because I found the whole situation to be enraging. The manager smiled and almost laughed when I asked if there was anything they could do due to the extreme circumstances of the day. He responded by saying that it was too bad and that I should have known better (whatever that means). I would not recommend this place to anyone.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3xbhMb4RMAP4Hgb1MP6iQQ"
  },
  "I-yKKPmjAxTSGPAUr-GYIw": {
    "date": "4/5/2012",
    "text": "I have been on a Pittsburgh sushi quest since I arrived year ago and had yet to find something I even wanted to just try (aside from Andy's in Wholly's).  I made my way all the way from the city over to Monroeville just to try this.  Definitely worth it.  The sushi was delicious, and that toro was killa.  I had two specialty rolls and the hamachi and toro sashimi.  All were very tasty.  The rolls are huge and difficult to get into one bite, which is awesome on a first date!   My only complaint (and a big one) is that there is no sake list.  The only way to even know they have sake is by asking.  Then, they say \"yes, see those bottles up there on the top shelf at the bar?  Those are the ones we have.\"  I asked if they  had a specific sake and she didn't even know.  So basically, I just picked the color of a bottle to pick out a sake.    For the amount you pay for a bottle of sake, I want to know the name, price, and description of flavor.  Come on, this is normal!  I can't read japanese, can barely see the bottles up there, and have no clue what they taste like or if it's a $50 bottle.  I felt pretty stupid doing this (on a first date).  Anyway, I'll be back but I hope they fix this kink.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Gx5NcBYODF7zTgD8IbaGYw"
  },
  "ySEKWlKuIDSF_Eo2fpMNmg": {
    "date": "8/10/2012",
    "text": "We took my stepson to Yamato (he loves hibachi), and it was a pretty good experience overall.  It was totally dead on a Thursday night, but I think that was mostly because the Steeler preseason game was on - they had it on the TV though, so we could see it from our table.  Everything was pretty typical - we all got hibachi dinners and my husband and I split an order of sushi (spicy crab).  Nothing bad, but nothing great either.  I just felt like there was no ambiance - again probably due to the lack of people and energy (we were literally the only people seated in the hibachi area for most of our dinner).  Our chef was very nice, but it took a very long time to pay our bill (not sure why since virtually no one was there).  They food also wasn't quite as good as Saga.  I might go here again, but I'd probably choose Saga or Shogun (or Nakama of course) first.  I just don't know how this place will last long with 2 other Japanese steakhouses very nearby.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vX72EYVC9tff84HgGWPv_Q"
  },
  "dkKLvzWE23MktWG75SNOyA": {
    "date": "8/10/2016",
    "text": "Is there a worse rating?  Okay, so we were sat with another group (which is very normal), but let's just start this little ditty off by mentioning that they left...  So my kids got their drinks 20 minutes after we sat down, and one was flavorless.  5 minutes later when our beers had not arrived, I walked to the bar and told the manager about the pop being out of syrup, he poured it out in the sink and meandered to the back room.  My beer is still just taunting me from the server station as our waiter stares blankly at a computer screen not even touching it ( a normal part of our dining experience).  After 35 minutes our order was placed, our neighbors now across the street eating tacos, We stared indulgently at the other tables enjoying their food, all the while my kiddo is still waiting for his first drink, I had to approach the waiter who was justifying the problem and sat unwilling to help telling me his manager is confused... Now finally after an hour our chef shows up and proceeded to display a hibachi routine straight out of The Muppets, flailing food around the hibachi in some sort of slapstick comedy routine on Saturday Night Live.  Food was okay, it was a high caliber of Filet and the quality shrimp were undeniable.  Paid our bill with a $50 gift card and our Visa, and after 20+ minutes of folly at the register, we were returned a gift card receipt showing a balance of $6.33 left on the gift card, all the while a charge on the Visa?!?!?!?  While the bottle of Saki that was likely shot down my throat in an hour and a half was a good time, this dude just kinda wanted his steak, ya know?  Manager was a total knucklehead, I unfortunately had several interactions with him and the thousand mile stare I was greeted with was both creepy and unhelpful.  Would not recommend.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "wgeRb-F1nUk8hj_rP5yMHw"
  },
  "EKnxa4oyuoLXjzrM4PbiUQ": {
    "date": "4/14/2016",
    "text": "Best hibachi in Monroeville! Highly recommend the filet. Not sure why some people give it a negative review. Never had a bad meal here. Compared to other similar restaurants this one has the freshest food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W_gjVyhdkeOwtG9pCAyxGA"
  },
  "WpQqlkHpOB_hWg55ecYcnw": {
    "date": "3/1/2014",
    "text": "The best spicy salmon hand roll I ever had.  And the most representative tempura ice-cream I had in years. Must try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k3ClwiHchnvKvwGHSUTcxg"
  },
  "4k4RGjWFaU5SrQBldJ_zHg": {
    "date": "8/31/2013",
    "text": "Sushi was great well prepared, I did not like my entry or my boyfriends.  He got the mango chicken and I got the seafood noodles. The atmosphere was great and I would go back for sushi or maybe to check out the hibachi.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "mOZXeg4rzQNpUcqUknxYbg"
  },
  "bsDuDnd1nLqpB8FWGU27YQ": {
    "date": "11/9/2013",
    "text": "This was my trip to Yamato. It's a little dark for lunch, but otherwise the atmosphere is great. I got a maki sushi combo of three rolls. I expected only two or three pieces of each and was surprised to get a total of 18 pieces for just $10! The spicy crab was my favorite and had a really fresh flavor to it that I can't put my finger on. The rolls have a good balance of rice to filling (?). I will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s53lg6FLUHubh2WQAStz6w"
  },
  "jzeCOl7xEDNlk2gLNHSspA": {
    "date": "12/20/2013",
    "text": "Both Mummy roll and sweet potato tempura are amazing. One of your better atmospheres when it comes to sushi and hibachi restaurants. Service staff was friendly and had great attitudes..... I will be back!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yo6IEXd_96yXEAGmGx1A5Q"
  },
  "O3dbNiZiY-pHIv8KbT_WbQ": {
    "date": "7/24/2013",
    "text": "I have been here two times so far. Their mixed drinks are the best I have had. I actually crave their drinks more than their food. The sushi and Pad Thai are very good and so far the best sushi I've had in Monroeville. There is just one thing that bothers me, why have a classy looking restaurant when your water cups and dishes are made of plastic? At least all the alcoholic beverages are served in glassware.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6gaxwVD2d1C0_qIBOkDkJg"
  },
  "keR676yNPWxAeUqhZdRu5g": {
    "date": "11/25/2013",
    "text": "I have no complaints about this place. The waiters have lots of personality, and they speak very clearly. They have a sushi special, half off some rolls, on Wednesdays. Great place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6b1TrqxJ6iK11tUtu3b2hw"
  },
  "uwrjo0hzDSn17-kHsFkO9g": {
    "date": "1/1/2013",
    "text": "Definitely better than Taipei Tokyo.  New, clean and service was excellent.  Had the spicy tuna, and a few other rolls which were good.  4 stars because there's nothing else this good as far as sushi goes in the Monroeville area.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tOMztypmq06beq-zncxjiw"
  },
  "Tjm764jor0_xt0UeBvgrOA": {
    "date": "11/19/2012",
    "text": "Multiple visits over the course of the last 2 months.  I've done the hot noodle dishes like Pad Thai, ordered from the hibachi grill and had it brought to the table, had the various sushi and maki combinations along with a few appetizers (rock shrimp really does rock!!) and recently a hibachi table dinner with the entire family.  Everything has been fantastic, really!  Drinks are reasonably priced, as well.  I can't get enough of this place--love it!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "70sSlkooEgL_TEjWDQbr3A"
  },
  "Ttt2zcbW6Ek_noyMDfsVBg": {
    "date": "1/3/2016",
    "text": "Great and fun experience. Get the big glass of sangria!!! It's handmade right there. Hibachi was excellent and sushi is delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SEWXKf5WDE8KJEqkpfX-jA"
  },
  "UGl1IxhFBZa_2A4VB0yh2A": {
    "date": "3/8/2012",
    "text": "My husband and I have been here twice, both times for lunch.  We sat in a booth in the bar area as we were not planning to order from the hibachi.  The amount of food we received for the price was great.   Lunch includes a starter soup - I chose mushroom, which was very good. For my main I chose 3 rolls of maki sushi for $10.  The sushi was great!  It was so fresh and beautifully displayed.  You can tell they use the freshest ingredients.  I am now hooked on their spicy crab roll.  The crab meat is not imitation crab. 3 rolls of sushi gave me 18 pieces. I was stuffed.   My husband ordered the chicken PTHM for $9.  It also came with a starter soup.  The portion was huge, maybe a little big for lunch.  I tried a bite of it and liked it enough that I ordered the veggie PTHM on our second visit.  It was loaded with veggies and I was surprised to find asparagus mixed in there.. I loved it.  I really appreciated the decor in the bar area.  It's somewhat dark inside with colored lights, almost giving it a neon glow.  It definitely felt hip and modern.  As for the mention that there are \"three or four other places that are EXACTLY like it around the corner\".. there is nothing with the same quality food as Yamato in the western area of Monroeville.  Granted, if you go further down 22 there are more hibachi restaurants.  However for someone living in the Penn Hills area, who doesn't want to drive through Monroeville bustle to get a delicious meal, it's in a perfect location.  All together, great food, great value and great location!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bSl2qmOI75CSqBYXiZRuqQ"
  },
  "GpVTMLTDFKI7dL2ed6fXsw": {
    "date": "9/27/2015",
    "text": "Excellent food and service. Even worked well for my near 4 year old grandson. Some theatrics at the hibachi grill to entertain, but not excessive. All in all a great evening out wit family and good food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0IKifcEr7pcTRAd1JfOH9Q"
  },
  "CVq6K0-9yvYTLe9l2RsZWw": {
    "date": "1/21/2014",
    "text": "The Atmosphere is slightly above average, The service is very good, the entire staff is friendly and attentive.  The Sushi is awesome (that is a main reason to go to a Japanese restaurant). The reason it does not get 5 stars is that the Hibachi is on the sweet side.  This is due primarily to the fact that the Saki they use is sweet. Don't get me wrong, the Hibachi is still good and I have eaten hibachi more than once but I am looking more for savory than sweet in this type of meal.  Savory is there but masked a little by the sweetness.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LcauZUG849-FSOCQ6YLRlw"
  },
  "E4emM04b39avEwyss2MpWg": {
    "date": "10/12/2015",
    "text": "Second time at Yamato for a business trip to Monroeville, and I'm still pleased! I sit at the bar and have had the same bartender, maybe owner (?) both times. He is very friendly and pours a generous wine:) Not to mention the sushi rolls are amazing! Beautiful presentation and worth the price. I think this place is a gem in Monroeville and will keep coming back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "l-CxN2a7pwFJVongIeJdIw",
        "caption": "Photo of Yamato Hibachi &amp; Sushi Bar - Pittsburgh, PA, United States. Egyptian Pyramid Roll - Spicy Tuna, Shrimp Tempera, Avocado, Spicy Mayo, Siracha and Eel sauce. Simply wonderful.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/l-CxN2a7pwFJVongIeJdIw/o.jpg"
      }
    ],
    "user_id": "vZTtkAx0kO5wx3xUYsaVCA"
  },
  "6ekPxCqwa9JV0ApdWAbc2A": {
    "date": "2/16/2015",
    "text": "I wanted to like this place and have tried it several times but each time it has been disappointing.  I can't speak for the hibachi side of the restaurant but the food on the other side could be greatly improved along with the service.  The sushi is presented nicely and isn't bad, but it isn't anything exceptional considering all of the competition that's now around the area.  The miso was bland and just ok and the bento box was a bit expensive for the quality and taste.  I would not order either one again.  Service is very slow and pretty poor, even when the restaurant is not busy.  Unfortunately you will be saddled with an 18% gratuity that is automatically added to your bill whether you feel it is appropriate or not for the service quality.  The pros of this place are the parking is easy, it is in a convenient location, and the ambiance inside is great!  You can get a decent sushi roll here.  High ceilings and modern looking, there is a nice sushi bar to sit at and a nice bar if you want to enjoy a night out with friends or alone.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "US96tM4NDGxsWRohb142SA"
  },
  "BO6K4Z6HVhjamOvu_FRXhQ": {
    "date": "11/13/2017",
    "text": "This is our favorite sushi place.  We are always treated very well and they were very patient with us when we were needed help with ordering. My favorite is the Alaska And eel rolls but the chef's choice platters have been very enjoyable.  We never had hibachi but the cooked Mango shrimp was very good.  Also try their cocktails, they do not skimp.  .  I haven't gone to enough sushi places to give it five stars but I would recommend trying it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y5xNpShVUorcKHt2LwhtoA"
  },
  "hy8x31Pd9zCEPq8woiMLtw": {
    "date": "10/7/2015",
    "text": "It was typical hibachi fair, but not the best or the worst..... middle of the road. The steak was done perfectly the veggies really mushy and overcooked. The rice was a little bland also",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qzrj78qBXrjluzHMlaSvcw",
        "caption": "Photo of Yamato Hibachi &amp; Sushi Bar - Pittsburgh, PA, United States. Ragoons",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qzrj78qBXrjluzHMlaSvcw/o.jpg"
      },
      {
        "img_id": "FBCL6X7wboWm_FHz6emdQg",
        "caption": "Photo of Yamato Hibachi &amp; Sushi Bar - Pittsburgh, PA, United States. Standard salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FBCL6X7wboWm_FHz6emdQg/o.jpg"
      },
      {
        "img_id": "BTR25DCZp5jzPweGYUtd6g",
        "caption": "Photo of Yamato Hibachi &amp; Sushi Bar - Pittsburgh, PA, United States. Filet mignon and chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BTR25DCZp5jzPweGYUtd6g/o.jpg"
      }
    ],
    "user_id": "AKqMnr1bEFIZDG_zQzX8sA"
  },
  "5uko0DXuWhGohJ10wtU_bg": {
    "date": "12/17/2014",
    "text": "I was impressed- fairly busy for a Wednesday, and great sushi discounts on Wednesdays. The fish was fresh, and there was a good selection. Definitely recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fNNzm5MMOJOFiQkIHPVYfQ",
        "caption": "Photo of Yamato Hibachi &amp; Sushi Bar - Pittsburgh, PA, United States. Mummy roll, rainbow roll and Sapporo",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fNNzm5MMOJOFiQkIHPVYfQ/o.jpg"
      }
    ],
    "user_id": "SNik3IiCR9UC4V5kjamfBQ"
  },
  "cyWxL1qksD9a5RWtD-B15w": {
    "date": "6/21/2016",
    "text": "Worst restaurant experience ever. I came in for dinner one night and got seated quickly. After ordering the waiter came by every 30 minutes to tell us they were working on the order. After an hour he came by to say that he forgot to put in the order and couldn't expedite it so it would be another 35 minutes until we got our food.  Our waiter lied to us repeatedly about putting in our order. We eventually left without food after over an hour!! Btw green mango is way better. If you find yourself waiting more than 30 minutes for your food, just give up and go next door. We were seated and eating within 15 minutes.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HxK8ZBF6Ke2sXd6oDIk5VQ"
  },
  "sOVwWjd0w1Eyy1RFumfrQA": {
    "date": "6/29/2017",
    "text": "A damn fine meal. The food is flavorful and is presented well. The service was slightly slow but only because it was the lunch rush.  I honestly couldn't get enough of the food... it was crazy good. I ordered the new york strip and I tried my grandfather's ramen soup and both were fantastic.  The waitress was polite but mildly inattentive. You have to try this place!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J6gU4wI8g5MzYKz0LUfSYQ"
  },
  "XGBhr5EqKVgN9b5bxY9f7g": {
    "date": "12/12/2011",
    "text": "For a place that just opened, it certainly deserves more traffic that what was there on a Monday night. Perhaps they are going for a \"soft opening\".   Everything is very clean and well decorated.   Menu prices were compatible to other hibachi restaurants in the area.  We started with sushi that was very fresh and impeccably designed on the plate.  We both went for the basic chicken with fried rice and noodles. The accompanying miso soup and ginger dressing salad are traditional fares and also tasty.     The chef was quite funny and not as old-school corny like we we expecting.  He actually had some jokes and tricks that we hadn't sat through a hundred times before.   We will certainly be returning but there is plenty of competition for them in the monroeville area.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "EA49P-rkdAIzuZm4rEqRUQ",
        "caption": "Photo of Yamato Hibachi &amp; Sushi Bar - Pittsburgh, PA, United States. Rainbow roll that lights up!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EA49P-rkdAIzuZm4rEqRUQ/o.jpg"
      }
    ],
    "user_id": "HaJKcZtbInBEC7CBfx0rEw"
  },
  "0-R1nL7xoocx5VD23DDrkw": {
    "date": "5/16/2017",
    "text": "The food was okay. The people were nice. A little overpriced for how not great the food is. But they have Japanese beer. So that's cool.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YbYUQex2hEhX0mNr1drvRA"
  },
  "BijVtUCZF8iqB60HqKYytw": {
    "date": "7/31/2016",
    "text": "The sushi was actually pretty decent, but they sat us at a dirty table. There were crumbs all over it. The floor was disgusting. There were napkins and crumbs everywhere. If they would clean up I would be interested in going back. But if they can't even keep the front of the restaurant clean, what's going on in the kitchen?...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fBZmEe_OkLwK3RCnYwFVzw"
  },
  "MIYwjA8F41WDiHJYgAe_VQ": {
    "date": "10/9/2014",
    "text": "Always get premium food here & bartenders/servers bend over backwards.  Everyone that works here is friendly & engaging.  Clientele are awesome...feels like everybody's friends and accepting.  Always meet the best people here.  Home away from home.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "emxGOLkLsekdjVLdXYhGVQ"
  },
  "9ZrHDdFMt0BNnAOdzmu4BQ": {
    "date": "1/27/2014",
    "text": "It's been a while since I've been to this establishment but the 2x that I went here I thoroughly enjoyed myself. My husband and I took advantage of the \"create your own\" sushi roll option and made some delectable concoctions. I love the atmosphere, the regular rolls & special rolls are all superb and the staff is very professional & attentive. The next time we to to Pitt we will be paying a visit!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rErZCGq4SS95wfutUDNUdg"
  },
  "unwRKTLPNMoaZR4JDpdpkA": {
    "date": "6/28/2015",
    "text": "After trying 3 other hibachi places, this is the best hibachi around!!! Great food, great service, great show! The sushi chef is GREAT too!! He personally picks the fish used, will talks about what he's doing and where it's from. I will go back without a doubt!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qZC1TGnm2ydEqrDkcjwA7A"
  },
  "trnON4UKekE83zkMI-w_lA": {
    "date": "6/15/2013",
    "text": "I was looking for some good quality sushi and did not want to eat at a buffet, so why not try this place.   Service: very friendly and proper. Attentive as well but I was the only one there at 3:30pm  Food: I ordered Fried Calamari and the Angel Dragon roll. The roll consist of asparagus wrapped with seaweed and rice and tuna and eel. The fried calamari was thin and tasted like a tempura onion ring. You couldn't tell that it was calamari. The roll was small as well. Small pieces of fish and eel. I was disappointed because the  was $14 and I got mall quality food.   Overall, the food was extremely overpriced and small. Moving from CA May have caused me to be biased but I should have just gone to AYCE sushi. Bring your wallet if you're coming here.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7RnxOD4CzVFlYf0yLqcTnA"
  },
  "VfFtMpfJt9cur4KbdYz_Tg": {
    "date": "2/19/2017",
    "text": "The hibachi is excellent. I always loved Ichibon, but I honestly think Yamoto is better. The food is great and you will have more than enough for lunch the next day. The show is excellent. A gentleman named Adi was our cook and is absolutely fabulous! The kids loved it. We will be back! Thank you Yamoto for a great experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mcs4-8yZcAnQN6mPk-T_fQ"
  },
  "h7TOJndTcYJVTAfX_RmCmw": {
    "date": "8/5/2014",
    "text": "Went to dinner last night with my girlfriend and her sister. I love Hibachi and had an ok experience (food quality wise) the first and only other time I visited this restaurant. Last night they had piss poor service and the food was very average for the money we ended up WASTING there. The service started with us walking in and the guy running the hostess stand looked at us, looked away, and then when he found it convenient got up and came to sit us...on his time.  I ordered shrimp, chicken, and steak Hibachi. My girlfriend and her sister enjoy eating on the healthier side so they ordered shrimp hibachi. They do not like their food cooked with butter or sweets. The menu DID NOT say the shrimp would have terryaki sauce. When the girls asked \"Please do not cook the food with butter and just use a little oil\" it seemed like they had cursed at the waitress by the way she reacted. She was psychically upset and gave plenty of attitude.   The food came out and mine was ok and so was my girlfriends. My girlfriends sister's food however came drenched in Terryaki. When we told our waitress, she freaked out, grabbed the plate and went in the kitchen (Which I had a clear view of) complaining in her foreign language...about us I am guessing.  The manager came out and we pointed out that the menu does not say the shrimp came with Terryaki. 25 minutes later they brought out the shrimp, then the vegetables, then the rice. Last but not least, the manager came over to \"guide\" us on how to order last time. I obviously stopped him, and explained we did things correctly.  Definitely, DO NOT recommend this restaurant. Just the service itself was pitiful.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W1IVMYxLMDOrY8UPxzg-5w"
  },
  "VrKiRgwLMcLW_aPO6yGMsw": {
    "date": "1/20/2013",
    "text": "Yamato is like a mine field in a disco.  Disco's are fun.  Mine field's are not.  Make one wrong step, and boom, your dining experience has exploded into an eruption of mediocrity.  All the specialty rolls we got were both creative, large and delicious, the \"promenade\" and \"outstanding\" rolls are particularly recommended!  The tempura battered cheescake for desert was also decadent, inventive and beautifully presented.  But I also got the sashimi dinner which I thought would be plenty.  Unfortunately instead of having thick cut generous pieces of fish I'm used to, I just got a few sad slivers.  They weren't very fresh, and the white rice they were served with tasted like it had been left in the steamer for a few hours too long and was dry and hard.  The service was fast and friendly, and we also got a garden salad and side of fried rice which were good.  So It's not that Yamato isn't worth going to.  I would go back, you just have be careful what you get.  They have some delicious choices (Specialty sushi rolls being at the top of that list) and they have some very unimpressive offerings as well.  Like walking a mine field, if you go, consult the other reviews as your map, plan your attack ahead of time and choose wisely!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "MDeA-Gx8NScCyAdziq7IeA"
  },
  "Y3GIJPFJzeitQwPBs8bYkw": {
    "date": "5/18/2014",
    "text": "I will use the two elements of a good restaurant, service and food quality. (Bonus- Hibachi). I went here with family from Ohio.  Food Quality- Opening Miso soup had a bland flavor throughout, and tasted like soy sauce and water with no zest. The hibachi however was amazing. The shrimp was juicy and succulent, better than most hibachi. The chicken had a rubbery consistency. The veggies were juicy, and made well. The fried rice is to die for! (4/5 Stars)  Service- Cook was very personable. He had a warm personality. (4.5/5 Stars)  Bonus- Hibachi cook was very skilled +.5 Stars  Average- 4.75 stars",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9ZvmYUMf8vRflVMhvlRknQ"
  },
  "kcvyca5r4WRiEgYSsNfTlg": {
    "date": "11/27/2016",
    "text": "This place is very good! Very good portions of food not stingy at all you definitely get what you pay for here!!! I love there shrimp tempura rolls very delicious",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A1ROHa7Sa9CI7ZzOwhd9Eg"
  },
  "RfRjhS5StFP8N0KaZfzcSw": {
    "date": "1/26/2012",
    "text": "Toro, Toro, Toro. Yes lovers of Fatty Tuna, I have found it here. And it was very delicious. Fresh and melt in your mouth delicious. Just went there first time last night to try their sushi and found a real winner. Started with two orders of Fatty Tuna Sashimi and went on to other, sushi and Makis from there. All were exceedingly fresh and delivered in beautiful preparations. The tastes were fabulous and compare well with some of the best Sushi I have had in all my travels across the US.  This review is really just for the Sushi at Yamato. This new restaurant is now in the former site of Buffalo Wild Wings in Penn Center East, between Churchill and Monroeville. This place has been beautifully designed and decorated. The lighting design in the bar area is awesome. There are really four components comprising the restaurants offerings and service. First they have a full service bar with bar stools, high tops and booths. Second, well obviously they have a Sushi menu with a Sushi counter. Third they have a regular 'kitchen' menu and seating. Fourthly they have Hibachi with eight tables I think and an interesting looking menu. I will be back to try the Hibachi and Kitchen someday.  Back to Sushi..... After the Toro, I tried the Spicy Tuna, very nice and spicy as I like it. Next had the Eel with avocado Maki. This was some of the best Eel I have had in Pittsburgh, or could be tied with Umi's unagi. I followed with Dynamite (a complex maki with spicy yellowtail, asparagus with salmon, avocado, masago, wasabi mayo and sriracha sauce - YUM), Dragon (crab, avocado, cucumber, with eel and eel sauce) , and Spider (soft shell crab, masago lettuce, cucumber with eel sauce)  rolls. If you are wondering, Masago is Capelin or Flying Fish roe and Sriracha sauce is a type of hot sauce of a Thai nature.  Somewhere in between the rolls I had the Salmon Roe (ikura) with its wonderful moist explosion of flavor in your mouth. Hard to beat if you love roe.  These were all of excellent quality and taste. Unfortunately I could not stuff anymore into my bod, or I would have kept working my way through the Sushi menu. So I am making a promise to myself to get back often. I now have favorites for repeats and many other options to try.  For Sushi lovers in Pittsburgh, I strongly suggest this is a must try for you. But save some for me.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "WysuU79VrNdnzbR4XDc2aQ",
        "caption": "Photo of Yamato Hibachi &amp; Sushi Bar - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WysuU79VrNdnzbR4XDc2aQ/o.jpg"
      },
      {
        "img_id": "lNKErPj8c166QW_Cw44W6w",
        "caption": "Photo of Yamato Hibachi &amp; Sushi Bar - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lNKErPj8c166QW_Cw44W6w/o.jpg"
      },
      {
        "img_id": "fF39ym43n-6j2_-BDVLg4A",
        "caption": "Photo of Yamato Hibachi &amp; Sushi Bar - Pittsburgh, PA, United States. Dynamite Maki",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fF39ym43n-6j2_-BDVLg4A/o.jpg"
      }
    ],
    "user_id": "AyYKTOCL5qM8589oBsqbfA"
  },
  "ygY4rksjwYW3eGEAZVCn5g": {
    "date": "10/16/2015",
    "text": "Visited this place with some friends and family for a weeknight get-together. Ordered a Sangria Bowl - bartender John said it could be a 1-2 person drink; I would definitely say it is a 2 person drink! It was on special that night so I decided to try. Very tasty. Wednesday nights are 50% off sushi, creating a fantastic and yummy deal. The sushi is what you'd find at an ordinary sushi restaurant, although this place sticks mostly to the most popular types of sushi eaten in this area. The shrimp tempura roll was my favorite of the night, followed by the spicy crab roll.  Nice place to relax with friends and family for a drink (or a drink bowl!) and some yummy sushi.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3xSglGfW0ZxtJp0vbv3NhQ"
  },
  "tXcl0uQdearbDuMWRCZuoQ": {
    "date": "2/11/2018",
    "text": "Went back for round 2, and yes, I'm still comfortable with my 3 star rating. Better sushi this time (that's on me and my selection, not on them), but the service was still SOOO SLOW! We tend to go during their sushi special days so they're busy and I'm sure that plays a part in the service, but it doesn't change how annoying it is. Just plan ahead- if you're going (especially on a Wednesday) know that you're going to be there for a while.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Az_JgEpXqAii_5EDkw2tw"
  },
  "1Rh8C3UcmDO7au4aNUX-_A": {
    "date": "5/10/2017",
    "text": "I love Yamato. Their sushi is far better than popular Nakama. I always get their sweet potato tempura as well as their specialty rolls.  On Wednesdays select rolls are 50% off. Fun cocktail selection too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oL8RzMJFgrgahm8Ew2QeMQ"
  },
  "46u5amV9ZK1dbccl0zdRgg": {
    "date": "3/2/2019",
    "text": "The only saving grace for our visit was that our sashimi and CA rolls were good.  I don't know if the sashimi dinner was worth the $25 tag, especially since my soup never showed up (which I never bothered to ask for based on below experiences), but it's what i was looking for. Beyond that, it was a fail.  We ordered the calimari app and son's kids dinner first.  Even when server returned, we were undecided on entrees, then ordered sushi on the servers next check back.  Despite that, and after a respectible wait, she returned empty handed and asked if we wanted our sushi first because they just received 5 take out orders and were behind in kitchen.  How do you delay an in house diners meal for sake of delivery orders?! So there we were with sushi and son empty handed, then calamai came, then finally his dish arrived and we could eat.  Calamari...horrible, but not as bad as the dipping sauce that tasted like rubbing alcohol. Sons amazing chicken ok, but $5 to add brocolli too steep.  Needless to say, we wont be back and don't recommend.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SwWRjz0i00gj4kQfegEUsQ"
  },
  "1I6vhTlhIjIvGqdwTaSsLw": {
    "date": "1/31/2019",
    "text": "I ordered sushi, and it was above average but not great. I would have given 4 stars for above average food, but the clueless waitress caused them to loss a star. Clearly, she knows nothing about Japanese food. I ordered an Asahi as my drink. She brought me a warm sake. Ok fine. \"Asahi\" and \"a sake\" do sound alike. The bar guy brought me a cold Asahi afterwards and didn't charge me for the sake. Then when it was time to order food, I ordered a sushi dinner with an additional order of ikura. The waitress had no clue what an ikura is. So I told her it was salmon roe sushi. She brought me a salmon roll (maki) and when I tried to get her to bring me the ikura, she argued with me that what she brought me was right, it was a salmon roll sushi. Grrrr. There is no such thing as a salmon roll sushi. A sushi is a sushi and a maki is a maki. I specifically ordered in Japanese to avoid this confusion and look what I got. The error was eventually corrected and the food was above average. This waitress needs to learn the menu, hard.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9cAgltTZkKr29i50NlJRyg"
  },
  "lyeM8wd4uhF_ip3-MSDY0A": {
    "date": "1/31/2018",
    "text": "Finally decided to try it here and I'm glad I did!  Was very pleasantly surprised.  Service was excellent.  I had known what I wanted to order upon arrival, and the server made sure I knew there was a lunch special for that item.  The soup was very good!  Much better than most as had much more flavor.  All the food was very good honestly.  I'll definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "am2h3gC7QMLd_uuo0UNsIg"
  },
  "Vji1aSLU9ohl5zDtkUTCUQ": {
    "date": "9/1/2015",
    "text": "Went here on my husband's birthday and was really disappointed that this high-strung place offered zero birthday deals for it being a $$$ place. While it might be listed under $$, it was definitely in the $$$ price range. The waitress said we could pay $3 for a slice of birthday cake. Um, no thank you.   Every sushi place I've been to (expensive or not) offers a soup AND salad for entrees. At Yamato, everything is an added charge. A sad salad will be $3 extra.  Hubs got the Sushi and Sashimi Supreme and everything from the price, the presentation to the amount of food fell flat when compared to other Japanese establishments. Our local Azan Wok served up a gorgeous Sushi and Sashimi Supreme with many varieties of sushi and fish in a blue-lit martini glass. That entree was $30 and my simple beef entree was another $20. Yeesh!   I do like that there's ample parking since it's located in a small shopping area. The location isn't the great though because it's still rather far from the middle of Monroeville and Murrysville. Service was okay; nothing spectacular. We were the only customers on Sunday afternoon and it still took a long time for food to come out. Tried and done. Not coming back here and not recommending.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "8DclOINSPldMTgiEbuCdoA"
  },
  "FHlVBVgVXNkoNlzAHWUEMA": {
    "date": "7/10/2016",
    "text": "I love this place they have half off sushi every Wednesday there happy hour is great too 5-7pm you have to try the sake yummy and the food is 100% yummy .. This is a great place for a 1st date or may more.. So check this place out my yelpers",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "FydN48GJL4DSO3uP8G2SqQ",
        "caption": "Photo of Yamato Hibachi &amp; Sushi Bar - Pittsburgh, PA, United States. Just me",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FydN48GJL4DSO3uP8G2SqQ/o.jpg"
      },
      {
        "img_id": "9vmPfckeuA05LlYvzLhtFA",
        "caption": "Photo of Yamato Hibachi &amp; Sushi Bar - Pittsburgh, PA, United States. Seaweed salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9vmPfckeuA05LlYvzLhtFA/o.jpg"
      },
      {
        "img_id": "9m8gYjqrHlL3K3zEqcKUpg",
        "caption": "Photo of Yamato Hibachi &amp; Sushi Bar - Pittsburgh, PA, United States. Yum yum chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9m8gYjqrHlL3K3zEqcKUpg/o.jpg"
      }
    ],
    "user_id": "uLWWpi62JJLnTh7UciJFHg"
  },
  "IEGXELLspye-MLdaHzULwQ": {
    "date": "9/24/2016",
    "text": "Got carry out because it was very tricky finding a sushi place near enough to Edgewood area to either get delivered in under an hour or carry out from that wasn't a 20 minute (plus) drive. Fantasy roll was delicious! As were a la carte sushi selections :) made the drive back just fine!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GDdzsY7LsVOT4L3BIGwiWw"
  },
  "3cpd0flvoMrVb8G3frK-Vw": {
    "date": "6/19/2018",
    "text": "By far my favorite hibachi restaurant! Good food and great entertainment. Audi is the best chef and through our visits there has even become a friend. Would recommend to anybody who wants a good experience with great food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sIEAiidJTJ9zd26AvFh-pw"
  },
  "3U6qtli4g-LOqevX_5PeOQ": {
    "date": "7/13/2017",
    "text": "Simple surroundings, pine tables and booths. Service is quick and pleasant. The place is very clean. The whole idea of a Japanese restaurant in Kittanning is hard to get your head around. The food came out hot and tasty. My wife had Hibachi chicken  13.00, I had Yaki soba.8.95. Will add to the review as we try out the Sushi.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "9iIK7vplA9Ynh3VOBgJ-CA"
  },
  "5Ay49kbLSRfLIGjgJcPOfQ": {
    "date": "5/10/2017",
    "text": "The only reason this doesn't get one star is because I've actually been to a WORSE hibachi place and this wasn't it.   However, I want to preface this review by saying that we used to go here for a lot of special occasions and love it. Now? Not so much.  We reserved the back room for a large party. They knew well in advance how many people we would have. At every stage, something was just off. We were there for 30 minutes before drink orders were taken - only to have to wait 20 more minutes for them to come out. The coke machine was out, then they refilled it, then it made bad coke, then it was broken. That was a 30 minute ordeal. One side of the table got orders taken and the other didn't. Then the other side would get drinks and the other wouldn't. They served the soup and salad at the same time which really took away the feel of the staged meal. They ran out of spoons for people's soup. The chef brought their loaded up carts into the room - laden with raw meat - and just left them there for about 10 minutes just hanging out in a hallway. The hibachi itself was way out of order in its prep and so the food wasn't enjoyable. The checks took SO long to come and our service was SO poor that we didn't even know if they wanted our money. We stuck around and paid, but it sucked to have that forced gratuity on there when the whole thing was a sh!t show.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "V0pP_PQnWdtyKpF-pifiaw"
  },
  "WObjJyFl_lUbV2NyYutcVw": {
    "date": "5/12/2016",
    "text": "Overall not the best Japanese/steak house out there, but it has its positives. One of the best is that on Wednesday, there is a half price sushi menu.  A lot of specialty rolls and about eight regular rolls are half price!  I was able to get three rolls and a beer for under $20. The sushi was pretty good.  It had flavor, held together well and tasted fresh.  The down side is that the specialty rolls seemed to lack imagination.  A lot of them only had a one or two ingredient difference.  I had the T. rex and volcano  roll and both had a very similar overall flavor. Service can be hit or miss.  The first time I was there they were very attentive and answered questions.  The next time I felt like I had to beg for water refills and attention.  Another visit was somewhere in between. The hibachi experience is similar.  I think, like the service, it depends on who you have.  They can be very entertaining and fun or they can look and feel like they are going through the motions.   I do like that you can order hibachi without needing to sit at the hibachi table.   Overall a decent experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_VTEyUzzH92X3w-IpGaXVA"
  },
  "U82kXeJ97MYZCy8E4Dx3Lg": {
    "date": "4/27/2018",
    "text": "Ended up here by accident for lunch but decided to roll with it and this was such a pleasant surprise for somewhere so tucked away. I got the amazing chicken for lunch and it lived up to the name. Great service and atmosphere, I'll definitely be coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gex1UUS3ztuIUI6edklZ-w"
  },
  "wxgxnRAxMWq0e8aVak9wPg": {
    "date": "8/14/2017",
    "text": "I don't know what happened to this place. It used to be soo good. Now it is just terrible...terrible. From slow service to old sushi, the decline of this once fine establishment had been remarkable. I vowed never to go back and yet like an idiot I did. But this was the final straw. I went this last Sunday and had to wait almost an hour to get my sushi. Before this, the waitresses were almost non-existent. When the sushi did arrive, it was obvious it had been sitting awhile. The edges where hard, the rice was stale tasting and even the wasabi was old, hard and crusty. I truly feel like I have been robbed. I don't care if their rolls are half off or even 99% off on Wednesdays or any day....I am never going back. There are two other places in Monroeville alone that serves sushi. They are not great, but better then Yamato.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_65Iaqh-Ouf1rv7suZeSIQ"
  },
  "cyUBBusN0oqAPCwLr_akUA": {
    "date": "8/5/2017",
    "text": "The hibachi chefs are so much fun here!  My brother in law said it's his favorite hibachi place and now mine too.   It always helps when you have 4 or more people in case you have to share a table with lame people not willing to have a good time.  Our faces hurt from smiling and laughing.  The sake flowed freely.  \"More sake, more fun!\"   We each got fillet, the guys also got lobster, I had scallops and one of us got shrimp.   Fillet was done med rare and medium as requested, melted in our mouths.  My scallops were also tender and delicious.   Plenty of rice and vegetables too.   This will definitely be our go to place for hibachi.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VvymeaW9sUOpjP0cSlg5zQ"
  },
  "bak4MWfe2EwAvtKb9JJpuQ": {
    "date": "3/13/2017",
    "text": "Ordered twice, received food once.   Yamato is close to my continuing ed classes in Penn Center. Tax writeoff + hot hibachi meal = amazing. Right?   Wrong.  First order of chicken teriyaki with vegetables came with onions. Just onions. I choked it down but just assumed they'd run out of real vegetables. No big deal.  Second order a week later, I cite in the comments \"no onions please. broccoli carrots mushrooms squash bell pepper snap peas zucchini all acceptable\"  Patiently waiting for my food - I notice how empty the place is. Yikes. All the other hibachi style restaurants are at least 70% full on the weekdays.  The manager informs me there will be an extra charge. Um, okay, why? \"Chicken Teriyaki only includes onions.\" My response \"Well, the definition includes certain vegetables. If you don't include some of the, it's not chicken teriyaki. It's just chicken with noodles, which doesn't sound appetizing.  Very sad, he began raising his voice. 20 minutes after I ordered, the food was still not ready.   Waste of my time. Disappointed -- as the daughter of immigrants, I love to frequent and reward immigrant owned businesses.   Restaurant lies about the contents of the food. Horrible customer service, fake \"teriyaki\". Do not eat here!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VKrXZY_OjTZ1yg7a3HH_4w"
  },
  "xKMjeKTB2Y9nzdPuBFmWbQ": {
    "date": "2/6/2016",
    "text": "Visited on a Saturday night.  One of the worst dining experiences I've had in Pittsburgh since moving here 8 months ago.  Were we seated quickly and had out drink orders taken.  We sat in a booth which was next to another booth.  The seat had no stability so every time anyone on either side of the connected seat moved it pushed back or forth.  I had two fat adults on the other side of me so it was very frustrating.  So, we got our drinks and we sat.  We waited, and waited, and waited.  Others came in, were sat, given drinks, and we watched as their orders were taken.  FINALLY our server arrived and just said \"You guys ready?\".  No apology for having us wait 20 minutes (estimated).  He didn't seem to care that much.  Our sushi came fairly quickly.  The rolls were average in taste, but very small.  We finished them pretty quickly and were still hungry.  After our food came our waiter filled our drinks but never returned to see how everything was.  Glad i didn't want to order more or needed some side sauce or something.  During our dinner I noticed rubbish under our table from a previous party..wonderful.  The place wasn't even that busy, I have no clue why service was so poor.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-kE5zO-54cQUmcG6zvfZtA"
  },
  "2pwkPUs-txN8gEy0gqwI6Q": {
    "date": "9/18/2016",
    "text": "The best sushi I have found in the burgh! I was fresh and delicious. Wednesday nights are half off. If you are a sushi fan, this place is a must!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hJFSuk7W0stwyGX0bpMhjw"
  },
  "Km1Jp3FEXKlw8p4WEO7fNA": {
    "date": "8/13/2017",
    "text": "DO NOT GO TO YAMATO HIBACHI AND SUSHI!!!  I wish I could give them 0 stars  It's in Monroeville. I do not even know where to start. I made reservations almost a month ago for there party room for 25 people. They called me last week to confirm for last Sunday when the party for today. I should have known then they didn't have it together there. We started arriving at 5:45 got a 6:00pm reservation. I was told to grab the manager/bartender/hostess once everyone was there. Everyone was all there by 6:15 so I grab the guy to come start taking at the very least our drink orders. In the meantime the guys go up to bar to try and get drink and he tells them \"No to go sit down.\" He sends 1 waitress back about 10 minutes later and she takes our drink order.... I ordered 6 waters for my family and a handful of people around the table ordered alcoholic beverages. So it's now 6:40 and she brought back half of the drinks and no alcoholic beverages. So I said something to that guy who was also the bartender and 10 more minutes goes by without the rest of the drinks and the alcoholic beverages. At this point this is a waste of everyone's time. We are now 1 hour past our reservation still without all the drinks let alone ordering. Not to mention it was 300 degrees in the back room. They also had told me to give them a head count so they could have room set up for the right amount of people... they didn't have it set up right, I had to go out front to request menus, and then after complaining to him 4 separate times, he came back and said he's working on getting us taken care of. Like seriously quit talking and saying your trying when your the bartender and you still haven't got the handful of drinks for everyone. You knew for almost a month about this party of 25.... why wasn't your restaurant staffed appropriately? And to top It off they only had two cooks working for the whole restaurant. He was just an overall douchebag who had no idea what he was doing. He lost a good $1000 but us leaving but honestly as I'm at home posting this we would probably still be waiting on a beer. It's pretty sad we had to move a birthday party of 25 people to another restaurant because someone like him was given a permit to run a business. Take your business to Shogun!!! They accommodated us better there in the 10 minute notice we was coming then Yamato did in the 1 hour we spent there with the 1 month notice....",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "tDp9b3M0R0eAkgEyLeIhFg"
  },
  "u3hoVKWiTwkcqUr3_cZ2Qg": {
    "date": "5/5/2019",
    "text": "Went here for Hibachi on valentines day. We had a blast. The cook was amazing! They squirt saki on your mouth. It was a great time. This also happened to be the best tasting hibachi I ever ordered. Definitley check the place out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RFFmAqgTPR0_kQLhhkjBPA"
  },
  "gfmN_zB2g50rs7Dk5KWkRA": {
    "date": "6/29/2019",
    "text": "STAY AWAY GO ELSE WHERE !!!   Horrible is the only word I can describe. I don't recommend. I will NEVER return. I have absolutely nothing nice to say.  Food is not fresh, preparation is horrible, I was sick all night.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "3egcdazws_x1wW35jgXfNw"
  },
  "0XyaJoExjKbfe7QCfogvUw": {
    "date": "12/16/2018",
    "text": "I think overall it's time to create new tricks when cooking hibachi. This was a pleasant surprise I have to admit. The dressing on the salad is usually tart due to too much ginger. They have a delish salad dressing and I really enjoyed it. I thought the lunch menu was very accommodating. The portions were ok and the show was just ok but I've seen it enough that I knew what to expect. I had shrimp and scallops with rice and veggies. The food was cooked to my liking and the service was great. I was a bit put off by the server giving away too much info about splitting the tips with the cook. That was not necessary in my opinion. I tipped the cook and tipped above the amount of gratuity so it was received as him warning groups against tipping the cook going forward. I'll go back but I won't change my tipping routine.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "pr8_C12oHakeNB4ZPp_dig"
  },
  "COwr26j3ov5hbO4Sd0PwXA": {
    "date": "1/3/2019",
    "text": "Good hibachi spot to try. The place is clean, the staff prompt and courteous, and the hibachi chef was entertaining and made us a good meal. My son loves getting his hibachi and sushi...we both give this place a thumbs up!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "rs3pq6wRmaSIADCInQXp9g"
  },
  "v80CVGViUnImsElQel8UzQ": {
    "date": "6/11/2019",
    "text": "Bugs!! Fruit flies everywhere. We changed tables twice and they wouldn't go away.    I am visiting from out of state and the service was also pretty terrible, in addition to the bugs flying around. We had to cover our drinks so the fruit flies wouldn't get in them.   We ordered 2 glasses of wine, which came out after we received our soup and salad. The salad was wrong and not the salad we ordered. After it being sent back, the right salad came out and we STILL didn't have 2 simple glasses of wine.   There were only 3-4 other tables in the whole restaurant so it's not like they were busy, especially for a weekday. Another woman came out shouting at our waiter stating that she waited over an hour for her food and her whole family was already done eating.   The only reason this has two stars instead of 1 is because the sushi actually tasted great! Despite all the bugs flying around in our soy sauce.   Overall- Good food, bad service, and fruit flies.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U22KQeyxDrAT9WeNmcouhw"
  },
  "oAWinefxtklT2wxX8WZ0_Q": {
    "date": "5/19/2019",
    "text": "I've eaten at many hibachi and loved the food prep and taste. Tonight I had salmon (tail end) which was very over cooked and impossible to eat. The rice , soup and salad were good, too much teriyaki sauce on the salmon and vegetables. My sons sushi was good. Disappointed in meal prep and timing of offerings. One waitress for a large party of 18. No drink refills. I've had simple hibachi at seafood buffet which were better.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zbKOvsEoXjKDco78rr_ffA"
  },
  "gKxS8cyBeVege5ElJljbqA": {
    "date": "4/18/2019",
    "text": "Amazing sushi takeout and hibachi. I can't get with to return for a birthday celebration. So fresh and friendy!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wZcKMibTiO3zr94Gbdbdqw"
  },
  "WlM2Zo2saZec6jSJfhcMOQ": {
    "date": "11/11/2018",
    "text": "Well first time we were here the food was very good.....ok the fried rice was good. So truth is I wish I could state in words how disappointing this (my last) here was. So I had a Beef Negimaki......stay clear. It taste like it was on a team table for 6 hours and they threw it on top of onions drozzled some I er cooked sause on it...oh my date got her food cold...it was to be stir fried tofu. NEVER AGAIN. I would avoid this place at all cost. Well my date said I should not pay for it....i have now thrown up the two pieces I ate. Literally was like eating at a bad buffet right befor closing. This was by far the worst dining experience I have ever had.....that includes a few bad buffets an some transit beans that I had in Hawaii.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fGWWjdyBVidBege1IVmcsg",
        "caption": "Photo of Yamato Hibachi &amp; Sushi Bar - Pittsburgh, PA, United States. Meat was about 6 hours old. Held in a steam table. Don&amp;#39;t go here.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fGWWjdyBVidBege1IVmcsg/o.jpg"
      }
    ],
    "user_id": "es1dnkfEDJ4AqctGmF169Q"
  },
  "DAjwYQ2wyt7Z3NJBF4qzBQ": {
    "date": "8/16/2018",
    "text": "Shockingly bad. Went in to satisfy a craving for sashimi at lunch, sort of to treat myself for some recent awesomeness that I've accomplished - and spent the rest of the day sick as a dog. It's not full blown food poisoning but it's turned my quiet little celebration of a W into a full blown L.  Also some notes on the experience: The expected sushi bar ambiance was non existent, loud noise from kitchen, staff apparently eating lunch squatted down behind the sushi bar (disturbing sight!), some kind of loud beeping from the host station going on forever totally shattering the calm atmosphere I'd hoped for, then some kind of rap music but like Korean rap maybe... totally not fitting for the chill lunch time sushi bar experience one would expect... All around disaster!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2tavxf3qmdLY1n1BjmU_YQ"
  },
  "sTIUkavIchAhbxNdgSsn5A": {
    "date": "5/4/2019",
    "text": "Horrible!   There was a sticky film on everything!  My friend's toddlers shoes are filthy from the floor.  All of our meals were over cooked.  I sent a drink back to the bar because something was floating in it and the waitress brought back the same drink with the same thing floating in it.  When I spoke with the owner/manager/busboy he did not care at all.  Very disappointed in a restaurant I once liked!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b1nL4dPVn6QN7c4yGR_8ig"
  },
  "X4m03O5eVra0iW9H5F5bOA": {
    "date": "1/6/2019",
    "text": "Orderee take out the other day (uber eats) and the food was amazing!  They have a great vegetarian selection and everything was so fresh.  Will definately be ordering more soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JrKwyswZxtesGyLhmYOjPQ"
  },
  "DQJEiouaelKHPGTRECjF1g": {
    "date": "5/3/2019",
    "text": "Service was slow, was here for 3 hours. Waitress was extremely rude and disrespectful. Asked for a drink 3 times and didn't get it until the very end of the meal. Gave out the wrong checks and completely wrong food on the checks. Overpriced, I recommend Saga in the monroeville mall or Shogun instead.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lqCMPg6Y_o0yW05JTcRI9g"
  },
  "ba73OUYyzDmExRySfNNYWw": {
    "date": "10/18/2018",
    "text": "My friend and I ordered food through UBER EATS.  We ordered veggie hibachi, ginger salad, mushroom soup, chicken skewers, and lots of yum yum sauce.  The driver picked up the food, and the restaurant had it packed in a paper bag.    What restaurant in this century puts wet ingredients in a paper bag?!?!?! So, when the UBER driver arrived, she got out the car to hand us our food and it fell through the bottom of the bag.  Our UBER driver was very apologetic and contacted the restaurant on our behalf to try and refund our money or get us new food.  The food was placed in a secure container in the car to protect food and vehicle.  Therefore, it was the restaurants fault for packing 2 meals in a small paper bag, and not sealing the food well enough for delivery! If I had picked it up myself, the same thing would have happened to me!!  Our UBER EATS driver tried, but the restaurant refused to refund or replace our food.  This is extremely frustrating when you have eaten all day and you want to come home to what you ordered!!!! This place has poor customer service! I will never order food from here again, nor will I be giving them a visit.  UBER EATS is trying to get my money back... that good customer service!! I'll definitely be using INER EATS!! As for YAMATO...I HOPE THEY ARE ENJOYING MY FREE MONEY!!!!! Never again!!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Eyf4c65bY13Wsr-2thpBw"
  },
  "kmoQh6ZGZ5KcbFBdUqn3dg": {
    "date": "4/25/2018",
    "text": "Random stop in. Menu was large and lots of options.  Wednesday night was half off certain maki rolls.  Tried the mummy and dragon rolls. Good for the special but not worth the full price. Fish was good but not superb. Amazing chicken was good and large portion.  Had to try the dessert so we had the tempura ice cream,  tempura cheesecake,  and mochi ice cream.  Disappointed with the mochi.  The skin was very hard and ice cream was melted by the time it was brought out to the table.  The cheesecake was okay,  didn't care for the tempura batter on it.  The tempura ice cream was delicious,  filled with chocolate ice cream. Ice cream was partially melted but not as bad as the mochi.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uKwt16aAq6OBdnZw7jLTsw",
        "caption": "Photo of Yamato Hibachi &amp; Sushi Bar - Pittsburgh, PA, United States. Green tea mochi,  mango mochi,  tempura ice cream,  tempura cheesecake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uKwt16aAq6OBdnZw7jLTsw/o.jpg"
      }
    ],
    "user_id": "ZiqHvrWd9KYF730zo37Hkg"
  },
  "RTj3T_XCkdngOpdVhjC1fw": {
    "date": "4/17/2017",
    "text": "If you like sushi this is a great spot.  Wednesday nights they have 50% off select rolls and it's well worth it.  We try to always get Alex as our server.  He makes the whole experience even better.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mxG8FneB1mk9bdg7_Zn3DQ",
        "caption": "Photo of Yamato Hibachi &amp; Sushi Bar - Pittsburgh, PA, United States. Dynamite and Volcano rolls",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mxG8FneB1mk9bdg7_Zn3DQ/o.jpg"
      },
      {
        "img_id": "hyRw3FRJ48JF6tEj7a1Onw",
        "caption": "Photo of Yamato Hibachi &amp; Sushi Bar - Pittsburgh, PA, United States. Sushi delux",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hyRw3FRJ48JF6tEj7a1Onw/o.jpg"
      }
    ],
    "user_id": "HKdCl7uryk0M0_G4SNDKZg"
  },
  "w-5onkFG_YpdFLDAG1SVXg": {
    "date": "1/25/2018",
    "text": "Two stars because the vegetables were cooked well and the friend rice was okay.   I ordered one order of salmon nigiri (2 pieces) and one order of sirloin steak hibachi for lunch.  The salmon is always what I use to test out a new place I've not been to. If you mess that up, then I'm out. The fish was very fishy, although it was cut OK, it was just awful. The rice was dry and unseasoned.   The hibachi was fine but I ordered my steak medium rare and it was well done. Very chewy.  The server asked me twice, both during the sushi and the hibachi being served, how everything was. I told him exactly what I said above. To the sushi he just apologized and said they got their fish yesterday. To the steak I said I didn't have time for it to be remade so he offered me....a knife to cut it with... seriously dude?  Another run of the mill overpriced hibachijoi t with pretty decor.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Zv1DkDIgAAFt0S88a2qROg"
  },
  "tUNuGYoblZKwwdjjQrYbeA": {
    "date": "2/17/2019",
    "text": "Havent ordered from here in a while since the last time we were here my boyfriend got sick off their food. finally decided to try this place again and now I remember why we didnt bother coming back. we placed an order for take out and didnt realize until after we got home that our two salads were missing. our cheese wontons were cold and we only live 5 minutes away so they shouldn't have gotten that cold that quickly. my roll was gross and was basically all rice and smelled funny. overall the food was bland. the end. *okkkurrt*",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9zsC6b-1i2sUT-dhl-g16w"
  },
  "IOoUR2-q_McMtxQVh2cNEg": {
    "date": "10/18/2017",
    "text": "I ordered takeout on Saturday afternoon. Originally The website said it would be 45 minutes, but I received an email after I ordered saying that it would only be about 15 minutes. I've never been to Yamato before, but the lobby was clean and inviting. I would definitely eat in sometime. The sushi I ordered was really good! Everything as I ordered and they even gave little cups to put my soy sauce in-- a lot of sushi places don't do that, so it was a plus. They also have a variety of rolls I've never heard of, so it was neat to be able to try out new things. Overall my experience here was good and I will definitely return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "K515IDRsyrZskeKl0ydtYg"
  },
  "xbAv_a0ihSWKNomPJYVmvw": {
    "date": "10/18/2017",
    "text": "very disappointed with this place. the sushi is way too expense and not that good. Waitress barely have time for you and \"the owner\" is wandering around aimlessly.  The worst part of this is the owner Paul (so he said he was) I had a $200 sushi take out order that he would not take for the next day. I just wanted to make sure it was ready at 5pm tomorrow. he said he takes lots of expensive orders and no big deal not to get mine. WOW. I can take being ripped off but a bad attitude on top of that. I wish the community would acknowledge this type of behavior and boycott this place",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vcE_EbSPJPb4MepPcVIXhQ"
  },
  "IYCDAe2hEsF4UX7cxWtx_w": {
    "date": "12/10/2018",
    "text": "I ordered takeout from here through doordash, I ordered the California roll, shrimp tempura roll and the chicken teriyaki which came with a miso soup. The rolls were good, tasted like your usual traditional rolls but they were pretty small and the miso soup was okay. The chicken teriyaki on the other hand was very disappointing, for the price my expectations were high but it was definitely mediocre. The chicken was bland, the sauce didn't taste that great, I didn't enjoy the addition of the caramelized onions it added an unusual taste and the rice was oily. Definitely not worth $17.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DRqnYy_ANjTbMjEmJZ60wQ"
  }
}