{
  "2IUwn58vXKUfO-KXYbG4fg": {
    "date": "7/20/2015",
    "text": "A group of 6 of us had dinner here on Friday and were very pleased with everything! Our table was ready as soon as we arrived and service was quick and friendly even though we probably weren't the easiest table. I loved the variety of beers and mixed drinks, most items were things I had never had before or don't see very often. The beers were definitely pricy, but I felt like the food was inexpensive so it balanced out. I really enjoyed the Farm Pasta which that day had green tomatoes and squash. One of my fellow diners love the Kafta Burger, saying it was one of the best burgers he ever had and the taco special, though a bit small, was really enjoyed by the two who ordered it. This was our second time here and we left just as impressed as the first time, can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "YJX8QlS3Q078Au8cA7NSgA",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Spanish-Style Gin &amp;amp; Tonic",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YJX8QlS3Q078Au8cA7NSgA/o.jpg"
      }
    ],
    "user_id": "IgWmGFhI0lred6xgBa_9xA"
  },
  "pZGMStjHZH0rsjRgwkxZjg": {
    "date": "9/2/2015",
    "text": "Just recently discovered this place. Im in love! Awesome selection of all delicious locally brewed beers that upon request you can get canned (their version of a growler is a large aluminum can) to go! Great idea! I hope other bars do the same! I stopped on a Thursday night and they were featuring authentic tiki drinks. Worth a try for sure. We sat at the bar and after a drink or two we decided to try their wings. Now my new favorite wings. They were small but absolutely perfect. They come tossed in a homemade whiskey BBQ sauce and served with a side of homemade gorgonzola sauce for dipping. What a treat! I cant wait to come back to this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KhKEwwCskHftcKTFhC1RvA",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. My beautiful tiki drink",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KhKEwwCskHftcKTFhC1RvA/o.jpg"
      }
    ],
    "user_id": "AETS5qadPhUAvpblh_tQ0Q"
  },
  "DkUgQ_AC8hprWZqzUhz1ew": {
    "date": "3/7/2015",
    "text": "Tim and I took a brief walk-about Squirrel Hill on a Saturday and stopped by IBC for a quick brew. We arrived about a half hour before dinner, which we were thankful for because we decided not to eat there and the place was calm and quiet.  Service was great even though we didn't eat! The servers were attentive, but they also let us chat without disturbing us. Though, I do wish IBC had a print out of their beers for the day - we sat in the dining area and half of the menu was blocked by people in the bar area. All in all, we both loved the beers we had - he had a Grist House that I don't remember the name of and I had a Brew Gentleman White Sky (amazing). I am excited to go back and eat!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "1C-aJJRIilfZRB4IxMZplg"
  },
  "Dq1Jz_bu0QXtsNBtKH2VFA": {
    "date": "7/12/2015",
    "text": "So close, but...   I've been here several times since it opened. Great spot on Shady Ave, usually 12-14 beers on tap. Nice menu with small and large plates. Food is a solid 4. Service is mediocre, it seems like the wait staff are always overwhelmed. I've been served the wrong beer, waited 10+ minutes for water and been completely ignored when trying to send food back due to a previously discussed allergy. If they could get their service game down, this place would be so much better!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FzojxZ0mmCuiJs4fecpimQ"
  },
  "Gbe7NjNBUHUmeaV0wBZKpw": {
    "date": "3/2/2015",
    "text": "The beer selection is great. The only \"complaint\" is that if you find something you like, it may not be back in a few weeks. They also let you have \"tastes\" if you'd like to explore or simply unsure of what to order. (And of course they have great \"sampler\" flights.)  We've been very pleased by the food. There's a mix of bar food appetizers and some really nice entrees.  Saturday, I had one of the best pork chops of my life (only slightly behind Casbah's) and I order them quite frequently. It was cooked to perfection, with a great beer-mustard sauce. The potatoes had a hint of middle eastern seasoning and there were some great brussels sprouts.  I've had food here 4-5 times now and it's ranged from good to excellent. I think they're just starting to hit their stride, and I look forward to what they have planned for the space next door.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "nF3hisFt-zKpmWgy9U340g"
  },
  "PWnLeKOsnWvl3dYBz4BRNg": {
    "date": "9/29/2015",
    "text": "Independent brewing company is the place to go for local brews. They have a great selection of locally brewed beers and most are even reasonably priced. They even regularly have Brew Gentlemen on tap and it's awesome. Like, totally awesome. You really have no idea until you try their beer, or most other local Pittsburgh beers for that matter.  The fries are good and the Mac and cheese was fought over at my table.   The ice cream sammich was meh. It wasn't the best, or the worst, ice cream sandwich, but I probably wouldn't order it again.   The bartenders and servers are very professional and prompt. They very clearly know how to do their jobs.  My main complaint- it is very small and usually busy. I'm happy this small business is thriving but I wish it were twice the size that it is. I hope they expand sometime in the near future. (I'll probably squeeze in somewhere anyway.)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cqQ3apyUYUIY_-wCzX989Q"
  },
  "2tvgYWksyhjIRPz7m0p0vA": {
    "date": "6/9/2015",
    "text": "Independent Brewing carries local beers.   They don't do any brewing themselves.  The beer selection is pretty good.  I was surprised at the balance.  Most bars are all IPA anymore.  Everyone in my party was pleased.  The food was pretty good.  Service was a little lacking.  I was there on a Tuesday.  Maybe it was an off day for them.  I had to wait a while to get initially served.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sbb2XUj9aYh5zP6gTJ14lw"
  },
  "vtBrgqlu-4g2cQB5aRDuQQ": {
    "date": "8/3/2016",
    "text": "So.. first off, this is not a brewery. After trying to get some type of service we finally were sort of waited on. Sad when a patron sitting at the bar was more of a hostess than actual employees.  They do have a good selection of micro brews on tap if you can read the chalk board to figure out what they have on tap and thats about the end of any good. The place is loud, as in  small and bad acoustics. After being there a short time I had an instant headache. Not sure if it was the two large partys we were seated next to or the young child who had said daddy about 100 times with no response. We ordered the brussel sprouts as an appetizer, and since the only two burger choices where lamb or a vegetarian we both opted for the chicken sandwich. The brussel sprouts came out with the food, and they were very crispy and burnt, after a few bites we moved to the chicken and fries. Everything was very over done and dry as dry could be, and coming from me that really says something. Even expressing our displeasure with the food and hardly eating much of anything we were still forced to pay the full bill without any questions what may have been wrong. The only thing this place seems to be good for is maybe stopping in and tasting a few local brews either way we will not be back. The funny thing is, when we were walking to it we past it up and ended up in the restaurant next door... I think maybe we should have stayed there, it was the restaurant gods trying to tell us something. Lastly: They put a suggested gratuity on the receipt, I never mind tipping as long as someone did a decent job, I actually tip pretty well.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PZ94fGSenlZ-c8L3ff7EfA",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Best pic I could take, very dim lighting, and yes the sauce cup came out empty.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PZ94fGSenlZ-c8L3ff7EfA/o.jpg"
      }
    ],
    "user_id": "q3dIqTQTC_PFk95q_aEhHw"
  },
  "ksFiZKRm2tBB8zgoaP_2ig": {
    "date": "9/18/2015",
    "text": "Squirrel Hill's only hipster bar. The mixed drink selection is fantastic, as is the beer selection. As for food, I'd stick to appetizers or their international French fries on French fry night. Service can be a bit dodgy as I think the waitstaff is spread a bit too thin, but otherwise everything is pretty good here.  It's nice to have a few different bar choices in Squirrel Hill.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pSSLTk9jVfki0MxinUOH8Q"
  },
  "jHs4cirbcn0b3j5a1kBw3g": {
    "date": "5/28/2014",
    "text": "After opening just 5 days after buying the building, the bar was sparse at first. It was, however, filled with delicious food that is ever changing, a draft selection that is also always in rotation, barreled and bottled cocktails during the week, and always some fantastic and inventive cocktails on Saturday nights, when their \"Cocktologist\" is in. Now, a few months later, the remnants of the previous bar are all stripped away, and the walls are filled with classic records, and wonderful prints by talented and local artist Matthew Buchholz of Alternate Histories. I love this place.  To address some previous reviews: Local Beers The taps change constantly, because there are a TON of breweries within 150 miles of Pittsburgh. And there's NOTHING wrong with featuring only local brews. To the guy that's posted on here, and their Facebook, and everywhere else that they should have a guest brewery: If you want beer from outside of the local area, go to any other craft beer bar in Pittsburgh. There are tons of them. The Independent Brewing Company is the ONLY bar in Pittsburgh that features ONLY local beers, and even offers ALL the locally produced spirits.   The Food v Cost Are you people insane? Look at the various menus they've posted online on Twitter and Facebook. The cheapest thing on the menu is about $5, and the most expensive has been about $15. And this is too expensive for you for fresh made food that doesn't use frozen or manufactured food?!? Really? Everything is made fresh. By hand. No frozen fries, no prepackaged crap. And the most expensive dish I've seen was $15. You can pay more than $15 for an entree at TGIFridays.   Decor They opened 5 days after taking control of the bar. It's previous incarnation, Fanatics, was the embodiment of every trashy Pittsburgh sports bar, with nicotine stained tin signs, neon signs, TUBE television sets hanging from the ceilings (Yes, TUBE television sets, multiples), and 30 years of dinginess. They reopened 5 days later...FIVE. No contractors, just the owners and the helping hands of close friends to make it presentable enough to open. This included a handmade mosaic with the IBC logo, great chairs, and some other minor renovations. Now the joint is covered in prints from Alternate Histories, which are hilarious. Take the time to look at them. Totally cool. And a huge selection of records....because iPhones and digital playlists are verboten.  Cocktails v Cost Gone are the days of $6 cocktails with rubbing alcohol quality booze, that are overly sweet, and come in a pint glass. Deal with it Pittsburghers. A good bar means good cocktails, and not just good cocktails, but inventive cocktails made with only the best ingredients. The resident Saturday night bartender, Adam Henry, has done a damn fine job of creating a cocktail program for the bar. Not only can you get delicious bottled and barreled cocktails during the week, but he's there every Saturday with some of the most interesting cocktails in the city. Dry ice, emulsification, liquid nitrogen, obscure ingredients, and some really great presentation. Don't believer me? Order the London Fog, or the Sex Panther. Even if you don't see it listed on the chalkboard. Just make sure you're sitting at the bar.  And for those of you wondering, I'm not an owner, or friend of the owner put up to writing this review. I've just gone enough to write a proper review, and thought it might be helpful to have all the info. Thanks for taking the time to read it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 10,
      "cool": 2
    },
    "photos": [],
    "user_id": "d3CJhxAJ2xRzJRtNdKGv0Q"
  },
  "AAEi7EpWVKaATqA1iTsARw": {
    "date": "5/20/2015",
    "text": "I like it hear.  Great craft beer (I usually start with the $4 Daily Special), great custom cocktails, I liked all the food I've had so far (plenty of vegan too), and the record player is a nice touch.      Obviously, it is what it is, you won't get a basket of wings and a Wild Turkey with a Yeungling back here. Not that kind of place.  At first I thought the place might be lousy with hipsters, but most of them hang out at the Cage, so they can smoke,",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "6uJbsF_YaXqnffQpLTW47A"
  },
  "8krTKpAf1hseQEOcsnnTGg": {
    "date": "6/21/2016",
    "text": "I expected a typical brew house madhouse. This place is laid back and cool. No TV on the walls. Vinyl playing in the background. Great place to have a beer and a conversation. They specialize in local craft brews, with the selection changing with the seasons. Good food, but if your idea of adventurous is trying something new at Applebee's, go somewhere else. Lots of Mediterranean flavors. Vegetarian and vegan options if you are into that.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BfY8vaOBsEUOQtr1uP7taw"
  },
  "B_GEKDfmIaKq00poaLIztQ": {
    "date": "9/12/2014",
    "text": "I've only been here once to get drinks, so I can't rate the food, but here goes:  Atmosphere is nice. Bartenders are nice, although we did wait 10 minutes to get our check.The vinyl records are cool for ambiance but seem really inefficient since the poor bartender had to change the record every 2 songs.   BEER: disappointing. I really want to like this neighborhood bar and I like the idea of only local beers; however, the beers they had on tap the night  were not good. We ordered a taster with three beers and a pint from Brew Gentleman and East End. I couldn't finish the beer- even the tasters because they were just not good. I feel like out of all the local beers they could choose, there are so many better ones. Pittsburgh does have good beers, just not the ones on tap the night we were there. Might give it another try to see if maybe it was just a fluke....I hope so!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "m2NwyEGXLPzARWSWbH6Ciw"
  },
  "lLipG4V5YjW3NrvnTZiibQ": {
    "date": "5/5/2014",
    "text": "I'll definitely be coming back to Independent Brewing Company. I met some friends here on a Friday night and we all had a great time. They have about 6-8 rotating drafts all sourced by local breweries, a great looking cocktail menu which included house bottled cocktails, and a short but creative menu.   I liked all of the beers I tried and I thought they did a good job of providing a mix of styles. I also ordered the fried brussel sprouts tossed with a mustard vinaigrette and blue cheese, it was killer. That dish made me want to come back and try other menu items.   A few things to note: This is not the place to come watch a Pens or Steelers game. Actually there are no TV's in this bar, you have to talk to people to be entertained. The horror, I know.  There is no juke box, instead there are stacks of records that you can thumb through. When you find the perfect one you hand it to the bartender and he puts it on the record player for you. I ordered a Four Seasons Get Down Brown which prompted the bartender to ask me \"Can you find me some James Brown in that stack over there?\"  Overall, great bar, great concept, great people.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 7,
      "cool": 4
    },
    "photos": [],
    "user_id": "DOajn8AtMjNtCZ87YoIlwA"
  },
  "FUbBiGMJf-Tpbd30a2n2Hw": {
    "date": "7/22/2014",
    "text": "I wish I could give this 3 starts as the service was great (quick and friendly) and the place is neat. I love the idea that they only serve local brews however they should just forget about serving brunch.  Went with a group of 6 on a Sunday afternoon and we were the only people in the place. Totally fine but was expecting much more from the menu as they only had 5-6 options to choose from. I went with the omelet of the day which was tomato, arugula and mozzarella.  It came with toast (they had no jelly) and a small salad. Everything was just ok and for $10 I  left still hungry.  Others in my party would not even eat their meal (the shrimp and grits was tasteless and over priced at $12).  You know it is bad when half the people leave and head to Dunkin Donuts afterwards.  I do hope to go back (probably hard to convince my friends) and try the beer and regular dinner menu.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "bu1mtWwxuayzV6b3VScWLw"
  },
  "XEAIruVG-ybaJ7hfyZqizw": {
    "date": "8/7/2015",
    "text": "Ok, let me start by eating a banana and saying that I like this place. However....they can be very pretentious, and even be very passive aggressive. Today's, my friends and i were celebrating an event, and maybe we're being a little loud. Instead of saying, hey you guys are being a little loud, the hipster wanna be cool bartender in the drivers cap said....\"did I hear somebody fall? Did something bad happen?\" Because of attitudes like that, our return is questionable.  ************** Also, just had some cold \"queso\" bean dip.  If I wanted cold ass cheese and cold ass bean mush I could have pull some mold out of my cheese drawer.  That said... Manhattans are still top notch.  Get a goddamn microwave",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jmi-TsujqAG7WQ1u-wxrtQ"
  },
  "kYKwUSUvirlKPXbkqfRRWg": {
    "date": "7/9/2014",
    "text": "I lived in Squirrel Hill a number of years ago and knew that this neighborhood was lacking in decent bar choices, but also understood that what makes Squirrel Hill so family-friendly is this \"lacking.\" Does every neighborhood really NEED a craft beer bar? Probably not. Does it make it slightly more attractive to come to Squirrel Hill? Perhaps.  \"Independent\" features all PA craft brews and cocktail concoctions. It was nice to see a couple of breweries I didn't initially recognize including Costar (been living outside of PA for 3 years). Their saison they had on tap wasn't half bad and it was served in a tall glass. I did like that they served the beers in their proper glassware for each type.  What surprised me the most was that 2 of their cocktails were offered in a draft form, and I almost wished I had tried those instead of having a beer. One was called the Roman Holiday with some kind of blood orange bitters while the other one seemed like a spiced up gin and tonic.   My friends that came with me were long-time Fanatics bar-goers so they didn't know what to think of the craft beer bar set up in its place except that it felt \"odd.\"   I liked the atmosphere of this place, but I still don't think I would warm up to it being in the more low-key, quiet Squirrel Hill neighborhood. Perhaps a place like this needs to exist in East Liberty (although Kelly's Bar probably has the beer-cocktails thing covered in that neighborhood). I might have to give this place a second try on my next trip to the Burgh.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "CzKDjQdYk2j0ZFxxWspwIQ"
  },
  "6vJO8EsxFNdzrIW2-ABglw": {
    "date": "10/20/2016",
    "text": "Solid beer and food selection. I typically stick to appetizers, and I've never been disappointed. Good portions. The bartenders are knowledgeable with awesome skills.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q2x4xyiPdPzb1Jjl9BSvAw"
  },
  "RD6iohnp8IhjvdznM7yA6w": {
    "date": "1/15/2015",
    "text": "I was so thrilled when IBC came to the neighborhood. Local beers and Arsenal Cider? Vinyl spinning in the background and themed movie nights? Right up my alley. I needed a neighborhood bar where I didn't leave smelling like an ashtray [read: Squirrel Cage], and the Independent Brewing Company is a definite step-up from the underwhelming sports bar atmosphere that Fanattics (the previous bar occupying the space) had offered.  The beer selection is great -- they always have the seasonal and special session beers. You can sample a few and find a new favorite. The cocktails on tap generally fit in with their weekly/monthly theme nights and can be pretty delicious. I recently tried the unique Spanish Gin & Tonic and was able to try a few gins that I'd never heard of.   And yet, I just can't love IBC because of the food. Firstly, the space in the bar/dining area is awkwardly arranged (mostly a holdover of the old Fanattics set-up), and it's nearly impossible to read the beer/cocktail list while seated at one of the tables. The food is also severely hit or miss. I've dined there 4 times (because I love the bar! And so much bike parking!), but this fall, I had the WORST GNOCCHI that I had ever eaten in my life. It was a sage cream sauce, but the plate was little more than orange mush. On another occasion, the deconstructed sandwiches were poorly conceived, and the gumbo wasn't very flavorful or particularly spicy as advertised.   Come for the drinks, and skip the food other than the french fries or bar snacks. The portions are also small, so if you have a big appetite, you're likely to leave with a less than sated tummy and a disappointed palate.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iA9dCx1okkRB9dmln1eHCA"
  },
  "ndnSoq3eIh6eHuEmI1ZtCw": {
    "date": "7/23/2016",
    "text": "Fantastic neighborhood spot. Great service, good food and extensive selection of local beers. One of the highlights is the no TV environment, invites more conversation.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AmcHggjp44SsY2nHzXtETQ"
  },
  "eemjB0zaxKEHEfNB3imUCg": {
    "date": "7/21/2017",
    "text": "I heard good things about their beer and mac n cheese and my boyfriend wanted highly over-priced salad. So we went there for some food and drink before we went to watch Dunkirk premier. Sadly my food never came so I had to stare at my boyfriend while he ate. Turned out that the waiter forgot to put my order. We asked for the bill and he offered a free fries to go, but the fries didn't come either. We had to rush to the theater or we were gonna miss the start of the movie. Wee! What a fun night out!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1PEC5M0vQfGrTj8J2dI4uw"
  },
  "QfTrruVgKpwBUSDZdgmYgg": {
    "date": "11/23/2014",
    "text": "They have the best on tap beer selection in the city and always have at least one tasty beer on special for cheap.  But the friendly bartenders and waiters and awesome Vinyl collection make this a Pittsburgh watering hole necessity unless you like Tom Brady style \"uppity\" bars with no character.    Also, bring along your favorite Vinyl album and definitely check out their special events they host. They're unique, fresh, and fun.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8uYwuh0MIcEu4fDnBiDb6Q",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Rock on, great bar.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8uYwuh0MIcEu4fDnBiDb6Q/o.jpg"
      }
    ],
    "user_id": "rp007n5XVLGJwIOTh9U0-g"
  },
  "O05l1o6UcykUdhF4jZ-WHA": {
    "date": "5/11/2016",
    "text": "My star rating is most specifically for the lamb burgers. oh, my, god. they are so delicious. I've been looking for a good lamb burger that doesn't break the bank and I've found it. The menu in general has a Mediterranean theme for which I am more of a fan! They have a great beer selection too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "zg6lm7DLKJArzFxLDILhwQ"
  },
  "jpQy6MwaHVKL3r5SpknkRQ": {
    "date": "8/24/2016",
    "text": "Came here for dinner and drinks with two friends.   First of all, the place is pretty loud, and it's not big. You might have to wait to be seated. I was annoyed because the host told us we'd have to wait about 30-45 minutes. We asked him if they could call us when the table was available...and his response was \"people loooove to wait at our bar, just go over and open a tab.\" I was a bit annoyed by this, because I didn't really feel like drinking before dinner. I think that he could tell that I was annoyed...because magically, he found an open table.  I ordered wine, and my two friends ordered cocktails. I really didn't like my wine, but they liked their cocktails.   We ordered the brussel sprouts as an appetizer, which were the only bright spot about this place. They were excellent - and I would definitely recommend trying them.   I ordered the falafel sandwich with some fries. Truly, the falafel sandwich was awful. It was just a giant falafel patty and was extremely dry. The bread made it even worse. The fries were fine, but nothing special. My one friend ordered a lamb burger and liked it, and my other friend ordered the salmon and said that it was good.  They don't have dessert - they said that they used to, but no one ordered it. That was kind of a bummer for me since I was still a bit hungry after my lousy sandwich.   I definitely would not come back by choice.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nzm6MM_2mc2TN3EyiceqvQ"
  },
  "EoPZvhaj8tGtqiFv0sSh4A": {
    "date": "6/4/2016",
    "text": "Fast becoming our favorite watering hole in the neighborhood. Always an interesting selection of beers, almost all local and something for everyone. The cocktails on tap are phenomenal as well, specifically the Spanish style gin and tonic. Had dinner last week, the special was a hanger steak with hummus and salad on the side. Gave it a delicious Mediterranean or Middle Eastern flair. Wish they would add that as a permanent item.  The atmosphere is pretty cool as well, especially at night and if they can open the doors to the street.  Lots of space at the bar and there is A secondary window bar that looks down on the main dining area.    Every bartender I have dealt with has been extremely friendly, knowledgeable and eager to give tastes of what's on tap.  Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fIySfdebw0FcEhRooxa0cw"
  },
  "yfpzhbQ_YWrpYGyB4D4C-w": {
    "date": "4/11/2016",
    "text": "I didn't have to think twice before giving all five stars to Independent Brewing Company. I have to preface this by saying that I attended for a Yelp Elite event but I think my overall impression still stands. Here's some highlights of drinks and bites I tried:  --Czech Pilsner from All Saints Brewing Company in Greensburg - Not only am I personally a fan of pilsners but this specific variety truly exemplifies not just quality brewing but the concept that beer tastes best right away.  --The salty halloumi crostini and Pink Boots Big Boots Gose's lime-y salt-y brew were a perfect match - This was my first gose - and I'm glad to have had it in a best case scenario like this.  --Mac & cheese with the Trompe le Monde Belgian Golden Strong from Roundabout Brewery in Lawrenceville - I have to preface this by saying I'm already a huge fan of Roundabout; however, the creamy mac & cheese with the savory rosemary quality of the beer made this my favorite duo.  --Lamb kafta slider with the Gus IPA from Full Pint Brewing Company in North Versailles. I'm not a fan of IPAs but it was a great partner for the slider, which I could have eaten ten of.  Outside of the event itself, it's clear that Pete and the other co-owners are highly knowledgeable about beer - evidenced in part by the fact that this is the only place in the city where you can find Roundabout on tap outside of Roundabout's own taproom. Chef Monique cooks Middle Eastern gastropub food with expertise and flair that makes her dishes inviting and satisfying. The excellent tunes on the turntable and unique artwork on the walls contribute to creating a simple, comfortable, welcoming ambiance in an intimate space.   And let me just say that the prices are more than reasonable. And the fact that I can go to one place for fresh, local food and beer puts Independent Brewing Company at the top of my Pittsburgh Bucket List. It's places like this that make it easy to brag about Pittsburgh! Cheers!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "YNkbvkPhLMFlOFYH2PLMwA"
  },
  "Xa2sE3DFNVRrHsYV34eGEg": {
    "date": "9/8/2017",
    "text": "IBC still has great service, cocktails and beer, but what happened to the great food? Did the chef leave? Stopped in for dinner tonight, and the food was barely passable - mac-n-cheese that tasted like it was right from a box, fatty, flavorless brat sandwich that looked more like grocery store kielbasa, bland fries...more reminiscent of Sysco, cafeteria-style meals than the excellent food we've had in the past.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5qx-z_jbl9Uc4hS4oWMXxw"
  },
  "0lcW7zxDEnxgxPiyOpyDqg": {
    "date": "10/12/2014",
    "text": "High price, average beer.   While the decor was \"trendy\" and \"hip\" I just didn't buy it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BkMqpJikNc3r5itc-ui6ww"
  },
  "55EEMV10pUNHKdsIFiWukQ": {
    "date": "4/17/2016",
    "text": "I have only been there once.   I had a cider and it was good. I had some of the Mo fries. They were decent, but the cumin spice they put on the fries isn't my cup of tea.  My boyfriend had the daily special and really enjoyed it. I can't remember what it was exactly but it was a very good portion for the price.   It's one of those places where there's not much negative that I can say, but nothing that stands out as being great either. That being said, I would like to return to try more.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aA2111nsy74eNaZeE1wpTw"
  },
  "UpOH79Rl45b9yeqKVlgACg": {
    "date": "3/30/2016",
    "text": "Punch bowl fun-ness! The environment is kind of fun to be in with a small group of friends. You won't be able to fit a very large party inside. Although the drinks to me are not my type (I like them a bit sweeter), but their punch bowl is really fun to drink!  Never had dinner there, but I know the kitchen closes early and if you want food late at night, they only have some cold packaged appetizers from the fridge. Overall a decent place to visit at least once if you have never been, but personally I prefer Hidden Harbor right next door a little more.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xpkdFgOVRX43fV0begAaOQ"
  },
  "BVkDrkwNwA4ApvTu0CJkXg": {
    "date": "5/30/2017",
    "text": "Sounds like a brewery by the name but they don't brew. Limited food menu too. Not  what we expected.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GN_KOSBxWicS4A2CG5BENA"
  },
  "Ck4v8aqIjKE2tBc-m8JLlQ": {
    "date": "6/23/2017",
    "text": "The waitress was so kind and the service was speedy. Their mac and cheese and Brussel sprouts are insanely delicious! I can't say I have a single complaint. With reasonable prices, high quality food, and amazing service...I can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iMwbO1M03a2SR36sLMsttg"
  },
  "ZhNngkaJd1QFZ2QLZ2CjUg": {
    "date": "7/22/2014",
    "text": "I came here for brunch on a Sunday afternoon with six friends.  We had a reservation but certainly didn't need it - besides our group there was one other table with two people.  I guess the word isn't quite out yet that Independent Brewing Company is a brunch destination?  I liked the decor - simple wooden tables and chairs and decorated with cool posters.  LOTs of great local beer selections and a full menu for mixed drinks.  I was there for brunch and only had coffee so I can't comment on the Bloody Marys this time.  I was a bit disappointed  with my meal.  I chose the whiskey shrimp and grits and while it is served beautifully with nice spring greens on top and grilled shrimp it was fairly bland.  I even made it \"hipster\" by adding some Siricha sauce.  That didn't do the trick - it was still really bland.    My fellow diners ordered mac-n-cheese (must have been good because it disappeared quickly) and omelets.  No complaints, but no, \"oh my God is this good\" coming from my friends.  I think I'll try again but will come for dinner and a beer (or two) next time.  So far, I'm not that impressed with brunch, but am not ready to throw this place out based on one meal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CYTpi63Tv_UTjsaTMCZUvg"
  },
  "MkG5mmrhOS4IMagc5gm47w": {
    "date": "7/10/2015",
    "text": "I do like this place - the beer selection is good and they emphasize local beer, and I am always a fan of Pittsburgh pride and supporting Pittsburgh business. So I feel a little bad to write a review filled with nit-picky complaints, but somehow they've just rubbed me a little bit the wrong way. The name is a bit misleading - they don't brew their own beer, but instead serve local independently brewed beer. I feel like a brewing company should be a company that does brewing, but maybe that's just me. If you go to their website, it is actually named after a historical group of brewers that collectively called themselves by the same name in the early 1900s. But still, you can't expect everyone to visit your website to learn about your name before being disappointed to find out you don't actually brew beer.  I was also going to complain about the vagueness of their menu, but now I'm looking at their menu and it's different from the one I ordered from not too long ago. This new menu is actually descriptive, without calling things just \"Sandwich\" and then offering not much further describing factors. The sandwich that I did order was actually pretty good, though.  On another plus side, they also have dessert (although I'd never had cheese for dessert before and I'm not sure it's actually my kind of dessert, even if it comes with chocolate). Which as far as I'm concerned should be a legal requirement for all drinking establishments. Because dessert is great and drunk people love ice cream.  Really where they lost the most points for me, though, was pretentiousness. I wanted a soda because I had to drive, and the waitress snapped at me that they don't serve that \"mainstream\" stuff. As if it's a sin to drink a diet coke. When I pressed further for non-alcoholic beverages, the answer was basically \"no.\" I've never been treated like that before for not drinking a beer (especially after I'd already had one). They pitch themselves as a \"tavern for independent spirits\", when really they seem to only qualify you as an independent spirit if you conform with their feelings about \"mainstream\" beverage.  Rant aside, the food is good and the beer is good and if you're in the market for trying out some local beer and food, you should really go here. Just whatever you do, don't try to order a diet coke. You will be shunned.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "cDlPrFkMDXYqVzzjaerHSA"
  },
  "W18O-GHcVyV-m6e2mqgHDQ": {
    "date": "3/24/2017",
    "text": "Love the variety in beverage choices. Food is also great. Nice relaxing atmosphere and their outdoor seating in the summer is really nice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IszJZily6eK_OfOxIjno_Q"
  },
  "ZRDWKpoefs3AHxlzwN0s8w": {
    "date": "12/12/2017",
    "text": "I've been going to IBC for several years now. Love the atmosphere, drinks are good, beer is good. Only wish there were more different styles of beer.Always seems to be a lot of IPAs , by I know that I'm the minority when it comes to IPAs. But my biggest issue is the food! Where did the good food go? Poutine fries are gone! And everything seems a little lac luster compared to before. It was a little pricey before but the food was good so I didn't have a problem paying it. now it's OK at best. I'll continue going here for drinks, but I'll skip the food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kdeELpnkA_z9Iy9cNGb1ug"
  },
  "Yym7imrVlESmwN1ykNR4aA": {
    "date": "1/31/2015",
    "text": "TL;DR: The drinks are great--the entrees, not so much. Read on for details...  I came here on short notice last night for a double date between CM and I and a couple of friends of mine. The couple we were meeting, who live in Squirrel Hill, didn't feel comfortable driving to Lawrenceville to meet at the Allegheny Wine Mixer, per our original plan, due to the weather. In order to keep the date, I proposed that we meet at IBC for dinner and drinks instead. None of us had visited before, and everyone was game, so we made a reservation.  I'm certainly glad we did so, since it was packed when CM and I walked in at 6:30pm.  We started off by ordering some drinks. All of us opted for cocktails, since we're not beer drinkers, and my friends didn't notice that Arsenal Cider was on tap until I pointed it out after they ordered. CM and I split the Allegheny Rum Punch, and my friends had the Rust Belt. The Allegheny Rum Punch was on the sweeter side, but not overwhelmingly so, with the flavor reminding me slightly of sweet tea (my favorite non-alcoholic drink).  It was sufficiently strong, but didn't taste overwhelmingly alcoholic--it was an excellent, well-balanced drink.  I tried a sip of my friends' Rust Belt, which was described as a mash-up of a Rusty Nail and a penicillin, and it was definitely evocative of the former (I've never had the latter, so I can't judge the similarity there).  Despite being quite different than the Rum Punch, it was also a great, well-balanced drink--if you prefer a more traditional apertif, you'll probably enjoy it.  As for the food, we started off by ordering the haloumi small plate, per the suggestion of my friends, who'd tried this thick, meaty cheese in the UK.  Though I'd never had it before, I greatly enjoyed its flavor and texture, though I wish the plate had come with more.  Due to the small size of the Haloumi plate, CM and I ordered a plate of the Mo' Fries--hand cut fries with feta, cumin, and garlic to share as well, per my suggestion, since I'd heard good things about the fries.  As gourmet fries, the Mo' Fries were decent, but didn't quite reach the level of the truffled gorgonzola fries at Burgatory.  While the plate did come with a decent helping of them, two of the entrees came with fries on the side (which I didn't realize upon suggesting them--otherwise, I may have opted for a different second small plate), so we only ended up eating about half of them.  For our entrees, we ordered the following: Gnocchi with pork belly (me), sandwich with falafel (CM), sandwich with veal sausage (one of my friends), and wild mushroom risotto (the other of my friends).  Given that I'm a huge fan of gnocchi, butternut squash, sage, and pork belly, all of which were ingredients of my entree, I was excited to try it, and it looked promising (see photo).  Unfortunately, however, my entree ended up disappointing on several levels.  The flavor of the butternut squash sauce was too sweet, monotonous, and underseasoned, and the pork belly didn't add enough saltiness and flavor to complement it well.  The addition of some salt and pepper helped rectify these issues, but couldn't fix the texture of the gnocchi, which was irredeemably soft and gooey, rather than al dente, as I like it.  I hate to say it, but the other reviewer who pointed out this issue with the gnocchi, saying that it made for the worst version he'd tried, was dead on--even Joe Mama's gnocchi, which was the worst I've had to date, beat this version.  The only redeeming feature of this dish was the fried sage, which was savory and crispy, adding a welcome dash of variety in flavor and texture.  In addition to my gnocchi, I sampled my friend's risotto, which was quite bland (he politely described it as \"very subtle\") and texturally homogenous. Ensuring that my sample included pieces of mushroom didn't solve these problems, unfortunately.  I didn't sample my date's or my other friend's sandwiches, but they seemed to enjoy them (my date mentioned that the falafel was quite good).  Despite that they were one of the the less expensive options on the menu ($10), the sandwiches, which each came with a side of fries, were reasonably sized. On the other hand, both my friend and I felt that the gnocchi and the risotto were undersized, especially for the price ($16 and $12, respectively).  While I don't have a problem with the smaller size of entrees at many upscale restaurants, I expect the quality of the preparation to increase accordingly, and these entrees didn't meet that standard.  Due to the underwhelming preparation and portion size of the entrees, I was somewhat disappointed in IBC on the food front.  Additionally, I was underwhelmed by the service we received, which was rather inattentive (e.g., no quality check, and no asking if we wanted more drinks until we'd finished our entrees).  As a result, I'd recommend IBC only for drinks and snacks (small plates), and would avoid coming here for a full meal.",
    "rating": 3,
    "rated": {
      "funny": 11,
      "useful": 17,
      "cool": 12
    },
    "photos": [
      {
        "img_id": "Th9SmqmV6CJyngPkT6tTOw",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Gnocchi w/ winter squash cream and pork belly",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Th9SmqmV6CJyngPkT6tTOw/o.jpg"
      },
      {
        "img_id": "hejb_kVrrWALRaAtLzDU5Q",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Falafel sandwich",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hejb_kVrrWALRaAtLzDU5Q/o.jpg"
      },
      {
        "img_id": "nZW2_ZkoKrNe7HZViCjYXA",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Haloumi platter",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nZW2_ZkoKrNe7HZViCjYXA/o.jpg"
      }
    ],
    "user_id": "135DbbQnr3BEkQbBzZ9T1A"
  },
  "_3KJ1FxUJCX2MoTYwk_bDw": {
    "date": "6/21/2016",
    "text": "Short: Wouldn't recommend except for local beer sampling. Long: Recently visited (from San Diego). Loved the idea that I could hit one place and sample local-only beers -- a great concept. Oddly enough, Independent Brewing Company doesn't brew any beer of their own. Good vibe for a pub but noisy. On a busy street with an open storefront and vinyl sides playing overhead. Loved the \"zombie apocalypse\" themed art on the walls. Overall quality was adequate. Service was adequate although staff were not aware enough to offer beer suggestions (offered samples though). Smaller menu than most places though adequate (modified regularly). Had the Mo' Fries, Brussels Sprouts (too much/overpowering mustard), Wild Mushroom Ragu (mushrooms missing, overdone Chinese egg vermicelli; cold and gloppy) and a small flank steak (overspiced/underwhelming). Beer selection was decent enough although info about style, ABV, IBUs, locale of origin was lacking (not on chalkboard; no links on website). No strong themes. It's as though they don't know what they want to be.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "IYwU9gzb_vJlc-asyM2pSg"
  },
  "Lgy4Lh3EBEtwTCEZxRC1BQ": {
    "date": "4/4/2016",
    "text": "Excellent beer selection and delicious food.  The Brussel Sprout appetizer was one of the best things I've ever eaten.  I didnt have to wait for a table and the host and waitress were very friendly.  I would definitely recommend this place, good for a date night or dinner with family or friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r0VNjfoS4t11OJH4Arghpw"
  },
  "qhNuqeAb6VPKDdkY2IOdbw": {
    "date": "12/13/2016",
    "text": "I have been here so many times, just now finally getting to writing a review. beer selection is on point, always rotating, and always good/interesting options! Pints are normally between 5-7, so can be pricey but they always have a beer special of the day, a boilermaker of the day, and a nice happy hour. My partner and I like going on Monday nights for their 5 dollar mac and cheese (sooo soo yummy and creamy). We got the lam burger (Kafta Burger) and it was heavenly! Juicy, perfect balance of flavors and so filling. do the up charge for the Mo'fries (feta, cumin, garlic goodness).   We finished our meal off with one of their yummy, well made cocktails for the perfect meal! Also want to note, Kelsey, our server last night (and several other times we have been) is such a dream. Shes attentive, friendly, and always has great advice on what to try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hkp5vEq8tc-_eOucy3CROA"
  },
  "awxv-_BA6Ify6JIaw6D3WQ": {
    "date": "4/24/2014",
    "text": "Really cool place. Good drinks and just a good vibe. Went with a group, but really think this place has the perfect ambiance for a date. Planning to go back for an international fry day (Tuesday french fries).  It's all drinks from Western PA. Arsenal Cider=delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "s6d8zWbBzjUUQxGgvmukFA"
  },
  "IkPim_vN2E6AFrJxCS0I9g": {
    "date": "4/1/2014",
    "text": "I came here on a Sunday afternoon with a friend. The bar staff is friendly and they'll let you try samples of the beers. They have the draft list on a big chalkboard. Since all of the brews are not big names, it'd be helpful to have a printed menu with descriptions. The vibe is very hipster for squirrel hill. The bar tender had a big hole in the middle of her shirt, which bothered me a bit since if it is your place of employment put a little more effort into the appearance of your clothes. However it fit into the ambiance of the place. They play records which is unique. I'm glad that squirrel hill finally has a decent bar, but it seems just like another knock off hipster place in Lawrenceville. I live in monroeville so I doubt that I'll ever come back here just for drinks. It just wasn't my scene.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6b1TrqxJ6iK11tUtu3b2hw"
  },
  "ACkcZEjfpRMtg4VXRCwXuQ": {
    "date": "7/4/2014",
    "text": "Very good beer selections along with liquor/ cocktail.  Like the flight options.  Will come back again when in town.  Good job.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gOXlb2NsF2Je-pCOCzNjXA"
  },
  "JphZLvJjkkXiKdoqT2PJXw": {
    "date": "5/25/2014",
    "text": "Great atmosphere and people. Only down side is that I wouldn't mind a \"guest brewery\" outside of their 150 mile radius.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-igc74bRfd0yc4IchA0ElA"
  },
  "oBeiP9Co63ku-g2iIuizsw": {
    "date": "3/24/2014",
    "text": "Went on a Friday afternoon/early evening.  Small group turned into a medium group of 10 or so.  Service ramped up accordingly, and did a great job.  Great beer selection.  Sometimes places trying too hard on beer end up with a whole set of undrinkable taps, but that is not the case here.  Very good range including pale ales, IPS, coppers, and so on.  Limited food selection, but the mac and cheese and the roasted brussel sprouts were a bit hit.  Good music, and a classy feel.  This is a huge addition to the Squirrel Hill scene.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "vXl7YnY97se9O2lq5dC4PQ"
  },
  "g4i533T1CNqW6OPu02aiDg": {
    "date": "6/22/2014",
    "text": "Have been there 3 times for Sunday brunch and a couple of times just to sit at the bar.  The beer selection is outstanding.  The bartenders know the beer well and make great recommendations.  They are not at all stingy with samples either!  The brunch is fantastic - good selection, tastes good and excellent presentation.  This week they had live music which was great.  We also sat in the in outdoor seating and brought our dog.  The waitress immediately brought over a water bowl for her and she got a lot of attention from the rest of the staff, which of course she loved.  I love this place and that it is walking distance from my house and I can bring my dog is a complete bonus.  If you haven't been here for brunch, you need to try it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "h5Wass-NW9UGguXjMX0mdQ"
  },
  "aGfALEljEN8sLRmIx_ZEGw": {
    "date": "8/23/2014",
    "text": "As a beer place only, I would give 3 stars. While the customer service has improved greatly, the food is still significantly overpriced and the cocktails are unimpressive. Patio seating is comically slanted, and half of the restaurant can't see the chalk menu.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QzKVXhF-zQt87o9m820Dlg"
  },
  "UZgSnSy7efWjW6O9msgSEw": {
    "date": "6/23/2015",
    "text": "Live around the corner and decided to give this place a try. Never been to the previous place fanatics but was curious to see what the place was about. Looked a little hipster /retro which really isn't my style but decided I had to check it out because Its so close to my apt. And bars are limited in squirrel hill  Went in after a long days work with 2 friends. We Didn't seem to fit as everyone else was in plaid button downs and fedoras ( my friends and I in tshirts and carpenter jeans ) but nothing wrong that, diversity and welcome ness  is one of the reasons I love squirrel hill ( and Pittsburgh for that matter.) . Was kind of expecting the classic small craft brewery intensive description of the different type of beers - or a least a recommendation  but the Bartender just pointed chalk board so we ordered 3 of the same IPAS  Thirsty for a fresh brew after a 12 hour day in he sun the bartender grabbed our glasses put them under the taps then,here we go in come 2 button down Bros with golf shorts and grab a seat on the other side of the bar. Now instead of pouring our beers and serving us to my astonishment he starts giving these guys samples of the beers on tap. Now I'm no judge but we order our beers then  I see these guys walk in the doors after were in there ( and our beers ordered) and he's giving them samples. Chit chatting away with them meanwhile our 3 lonely glasses are just hanging out under the tap for 5 minutes. Just kinda got the vibe that there trying to keep the crowd hipster / look like you have money /dress nice  and the blue collar guy / pabst drinking ripped jean guy out. I say this for that reason and because after serving our beers the bartender was pretty stand off ish and as we were leaving didn't even offer a thank you or goodbye . Also read in the Squirrel magazine the 2 owners were lawyers and found it funny that they were taking up 2 bar seats ( all sears were taken ) discussing seating plans / decor and then moving after realizing customers needed seats during peak business hours then continued walking around the bar pointing things out. Personally I'd save that for after business hours. Beer was good tho but unlikely till go back - unless I have my skinny jeans and plaid shirt so I'll be treated normal .",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ttf6CzMqqjpYKXIeH8REhg"
  },
  "keQEWURbdW0gdMU9vAq4cQ": {
    "date": "3/24/2014",
    "text": "Cocktails are very good. Beer is fine. Snacks are also very good. Try the satay, the fries, and especially the taco-thingies. They also make a nice salad if you're trying not to overeat. Ambience is just right for Squirrel Hill.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9BSoQ_mlQ-Zfe_DVuX8fuQ"
  },
  "xLEN0tGmOKAuDP8KNFY2bw": {
    "date": "3/8/2014",
    "text": "The space is very inviting and a great place to relax. Very enjoyable beer selection. Ordered the fries, they were great. The big disappointment was the service. There were three servers/ bartenders which is appropriate for the size of the place and they were all super friendly and nice - but incredibly not with it. Our beer glasses stood empty for awhile before anyone came around which is totally inexcusable.also a server would come around to one table and have their back to the others  and just walk away without turning around to see if we needed anything, they were most always just out of reach and not paying attention to the tables. We waited an inordinate time for our check as well - no one was coming around. Inattentive and slow service really makes me not want to return.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "BwbAj6h9Tx1m_cOx8Tm54Q"
  },
  "8SZWm9_qQfWiexpyG7XOow": {
    "date": "5/6/2015",
    "text": "I had a really nice experience when I went here for the first time a few weeks ago. The beer selection was fabulous - they had a beer for everyone. It was very crowded - seating is limited, so you really need to be careful about when you go, but luckily, I got a seat at the bar. I ordered a small appetizer (fries with spices and feta), and it was not  that great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O11q3pNvHAaufMVX5fpZ_A"
  },
  "zjhvU1Jq-0Nwme86JbyP0A": {
    "date": "4/16/2014",
    "text": "In terms of all the other (few) Squirrel Hill bars, this one is by far the best. However, basically my review will be a summary of all the previous reviews. They didn't put a ton of effort into the interior or exterior (since there is no sign). The concept of a chalkboard beer sign makes sense (because the beer is constantly in rotation), but it is so poorly written and dimly lighted that you can't quite read anything. I was trying to read the list of cocktails, which is written at the bottom of the board, and a bartender was standing in front of it; so I had to give up. The fries are great, but the other food is small for the price. Also, I get why their kegs might kick often but for being a beer place, the bartenders, servers, owners aren't totally knowledgeable. When asking for a beer that recently kicked, the owner offered up a beer that was just being added. The newly-added beer was on the opposite spectrum of the kicked beer, and it was overly carbonated. Suggestions: work on service (mainly attentiveness and beer knowledge) and consider a different method of supplying the beer listing. Lastly, don't have a mixologist who can't act as a regular bartender (I think he made maybe one drink while I was there and the rest of the time just leaned on the counter).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gP0ssVYaIFX5miYWrMllZA"
  },
  "lmmnrmauTMN9Y8Lb7GNDgw": {
    "date": "3/1/2014",
    "text": "Go for the beer list. It's extensive and local. Or the cocktail list - creative and fresh. Eat somewhere else - the food was overpriced and not very good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0FEOHdgPuvRf_Jy48wwa4A"
  },
  "FQqN99WTtSMcg3ZbgFOXeQ": {
    "date": "6/5/2018",
    "text": "One of my favorite atmospheres around. Beer selection is always great and food menu fits in well with the vibe.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rc-hG9g0GEDVl-410oK99Q"
  },
  "wNWGnj8NZt2ZByslzqiROQ": {
    "date": "10/18/2016",
    "text": "Four Seasons Session Pale Ale is the beer I enjoy when here. I like this brewery a lot. We're lucky to have so many good ones in Pittsburgh and these guys are at the top of my list. A fun space to make your local. Prices are comparable. I've yet to try the food but it always looks and smells good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ye279dBWL0f8TR0X2_2D7w",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Four Seasons Session Pale Ale.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ye279dBWL0f8TR0X2_2D7w/o.jpg"
      },
      {
        "img_id": "SH45WmZHchS7pEiv7p9-kg",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Independent Brewing Company-bar shot.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SH45WmZHchS7pEiv7p9-kg/o.jpg"
      },
      {
        "img_id": "rbq8Np7Vg4Ck4sFTNWZd8g",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rbq8Np7Vg4Ck4sFTNWZd8g/o.jpg"
      }
    ],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "PFstWtHcgLjBMEdR53meLA": {
    "date": "10/9/2017",
    "text": "Great food and great beer! I sat outside and enjoyed people watching in Squirrel Hill whole I had an amazing sandwich and beer. They have seasonal craft beers and reasonably priced food. I love the area this restaurant is in and there is always plenty of street parking! They also have great French fries to snack on if you are just going for some drinks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CpeYAF5DeYLdD2Y8GF8EUA",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CpeYAF5DeYLdD2Y8GF8EUA/o.jpg"
      }
    ],
    "user_id": "pI_JD192pI7LqCraLhHBBA"
  },
  "G75gVDViOh4j8ZP7ZlsYRw": {
    "date": "6/18/2017",
    "text": "This place is a great place to meet up with friends without going too far into the city. I usually come here on weekends around 7-9 and while it can get crowded, I've never waited too long for a table. They have a good selection of beer that's written on the wall, but the food selection is overrated. Their lamb burger and beer cheese fries with pulled pork are the only items worth the price. Overall nice atmosphere and friendly staff.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "3IBiLPp5TIivhTo1eJbPEQ"
  },
  "13a2SEgue1NtbkuMBSzwJA": {
    "date": "1/31/2018",
    "text": "This is my favorite bar in Pittsburgh. The staff are nice, funny and personable and the beer selection is always on point. They are excellent at capturing both the mood of the season, as well as featuring trending styles and flavors alongside classic brews. The hardest part is picking a beer, but since they know so much about what's on tap it takes the guessing out of the whole experience. The music selection is always fantastic and I can say without any hesitation that I've never ordered a dish I didn't love.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "oZ3-Ww1t4HAI6AYGxpfOhw"
  },
  "9BmqDfYHLHUr1hDLeilLRg": {
    "date": "2/2/2017",
    "text": "Smaller venue but cool place to grab a drink and a bite to eat after work - I came here with co-workers and it was a pretty chill vibe. It can get loud because of all the people who are fitting into a smaller space but you will definitely enjoy yourself.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "zC70QZxr3nhQP3TKF3uTjA"
  },
  "d8jR_ur-nAlp9PiUa_7KfQ": {
    "date": "5/4/2016",
    "text": "There are a couple of things that I really like about the Independent Brewing Company. Everything they sell is from local people. The beer, the vodka, the food. Their selection of beer is huge and after tasting a couple of different beers at a yelp event, I am sure there's a beer for everyone's taste buds. The staff is so friendly and approachable. Feels like a second home. Their cocktail selection is small, but the spanish gin tonic and the lime Daquiri that we had were delicious. They also offer some small bites and I have tried a couple of those at a yelp event. The Mac&Cheese was so good (and I am usually not a big mac&cheese fan), and so was their lamb slider.  Finish all of the above with a cozy and laid back atmosphere and you have the perfect Sunday afternoon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "N9OrheT7uEgVXsMJnY92eA",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Daiquiri and the Spanish gin tonic!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/N9OrheT7uEgVXsMJnY92eA/o.jpg"
      }
    ],
    "user_id": "j55llTI5f_Xth68rqJpqUQ"
  },
  "4rgbK3rK4gOcZNW71lFNUQ": {
    "date": "3/22/2016",
    "text": "Um, I love this place. First time there and I can't wait to go back. We saw it as we went into Hidden Harbor and decided to check it out afterwards. As much as I liked HH, this is my kind of place. It was dark and hipster-ish? But also not? Haha.  It wasn't very busy for a Saturday night, which from the reviews, is unusual, so I am considering myself lucky. We scooped up two bar stools and felt right at home.   I got the Permanent Yard Sale by Brew Gentlemen (phenomenal) and my friend got a Manhattan. He said it was the best Manhattan he's ever had! He chatted up the bartender afterwards, very social and polite.   Definitely check this place out! Fantastic bartenders and great selections.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "XYCIjBLP7VAJTIr5Ig0uwA"
  },
  "dKFJ6YGBox_3Y3dpeUUtpg": {
    "date": "1/24/2016",
    "text": "I love the concept of this place. They love their local Brewers and serve beer on draft and alcohol from around the area. The inside vibe is great too, with a casual but trendy feel. The only downfall is how small it is. On a snowy Saturday night, the bar was full and every table was as well but we found some stools in the middle back bar area to sit and grab a drink and chat. I had an Arsenal cider, which is always delicious.   It wasn't overly loud with all those people and the wait staff was super nice as well. We didn't get a chance to try the food but it looked intriguing. I'm looking forward going back again and trying some more things!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "SZOdhu_-4uFQfIbzU0qeFw"
  },
  "3twaEQWCcd5mukgjeiZweQ": {
    "date": "1/22/2018",
    "text": "Man, I dig this place. It had the coolest, coziest vibe as I tucked into a corner of the bar with some work friends on a rainy evening. The draft list is, of course, expectedly phenomenal--on the night we were there, they had one of the drafts on special to benefit a local charity. I was able to try sips of my friends' cocktails, which were simply well-done and delicious. I can't speak for it personally beyond some longing glances from my vantage point, but I've heard (and seen) that the burger is great. IBC is a good choice for dates as well as small group, low key happy hours.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tQ5H_hjnseZZVqjPAwSeEQ"
  },
  "TPcO2ZWyn_sGuDMVZUAymQ": {
    "date": "8/18/2018",
    "text": "New food menu is incredibly good. Changes executive chef has made are just incredible. Who thinks of watermelon gazpacho with shrimp? It was superb. The eggplant with pork was crazy good! Drinks have always been awesome. Wait staff and hostess were also great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ikPLio1IQIuu63xh1OZ9cQ"
  },
  "FWvX0JyOVwDrQ5HR_wLgGg": {
    "date": "10/30/2017",
    "text": "This is the killer neighborhood bar. The food is unique and definitely good. Cocktails are awesome and the Brews are just as good. I will go back",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9OE5LoUwJQ-Sis8Fbp3rvw"
  },
  "w5uz4EW_xcN2MSc2ANER0A": {
    "date": "1/18/2016",
    "text": "Good drinks, friendly staff, open late ... all you need for drinking on weekend. I ordered food (crab cakes) once here and it was just ok. The portion was small but the taste was fine.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZbJ_IVVjY-k2y4-g273qKg"
  },
  "oXvlGBhI6Jjk9sPsUWbgzw": {
    "date": "12/15/2017",
    "text": "Visited the Independent on a Thursday evening about 5:30pm.  Parking is a challenge in this end of town.  Not to be defeated we walked a couple of blocks in the cold to enter the inviting warmth of Independent Brewing. The deco is cozy and place was hopping.  The bar area has an adjacent bar section across from the main bar. We snagged a couple of seats at the bar.  Great selection of beers posted on the chalk board as well as the paper menu.  There is even a cider on the list.  A full cocktail bar is available also, but I was there for the beer.   The Shakes Coffee Porter  by Hitch Hiker Brewing- oh my how delicious and rich tasting.  Happy Hour goes until 6pm and gives $2 off a draft.  The cheese board we ordered was large enough to share.  Next visit I will be sure to order the Brussels sprout salad saw it from another patron and the salad looks like a winner.  Bartender is knowledgable about the beers on tap, and service is good.  Independent is worth the walk if you can't park close.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_0T-7hxM6AY3TcGDMHfMEA"
  },
  "bQmXEEjMStNvPe2Mk6SBjg": {
    "date": "10/1/2016",
    "text": "My family and I had an excellent meal/experience here.  Don't listen to the reviewers that are upset about waiting for a table...there's a wait 'cuz the food is amazing!  And yeah, the place is tiny, but it's got a great vibe and the personable staff offer stellar service.  So if you've gotta wait, head to the bar and relax.  Order one of a dozen-or-so delicious, hand-picked locally sourced brews & let your mouth water while you peruse the menu.    Rum-fired Haloumi along with an order of Brussel Sprouts were terrific, shareable appetizers.  Among the entrees we tried: Kafta Burger, Mac n Cheese w Pulled Pork, and the Shrimp n Grits special.  Every dish was smartly prepared and perfectly portioned.  The menu is traditional pub/comfort fare with hints of middle eastern/Mediterranean flavors sprinkled throughout.    I was really diggin' the vibe, the smart flavors, and the well-sourced local brews.  Great staff, great space.  Really looking forward to my next visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "7TfpbVFe2E4q_iM__W8zWw"
  },
  "kM9LLeA70MolnvzUjkSaMA": {
    "date": "12/1/2014",
    "text": "Why on earth would a place called The Independent Brewing Company be one of my favorite bars/restaurants in Pittsburgh when beer (damned gluten) is verboten to me? Because the expertly crafted cocktails and creative, well thought out food in this warm, comfortable and friendly spot makes for a perfect evening, that's why.  Let's start with the cocktails. (One should always begin with cocktails, right?) Adam is a genius behind the stick! Whether one has in mind a classic tipple or one of Adam's own creations, the attention to detail is nothing short of a marvel. His handcrafted syrups, boozy cotton candy, molecular creations of spheres and foams and such are only the icing on the cake of the expertly prepared cocktail before you. Try the London Fog to experience one of his best!  Besides Adam, there's a constantly rotating bevy of the best bartenders in the Burgh behind the bar. You'll regularly find talent from Butcher and the Rye, Meat & Potatoes, Butterjoint and the like serving a specially created drink menu for the night. It might be themed - Big Lebowski comes to mind - or not. One never knows what surprise libations might be encountered!  Then there's the dining menu. Some of the best fries in town can be found here. Handcut, fresh fried French fries. Boom. Pork belly, shrimp and grits, salads, sandwiches, steaks, desserts...all with an international spin. So good!  Last of all, the space is so comfortable and friendly. Bar patrons chat across to one another sharing recommendations...and sometimes even a taste of this cocktail or that particularly delightful dish. Fancy, it isn't. A great place for a casual meal, great drink and a fine, locally made beer it is! Go.",
    "rating": 5,
    "rated": {
      "funny": 8,
      "useful": 15,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "XZf6XSTbfpwyrj7wT-YvMQ",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Sailor&amp;#39;s Warning",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XZf6XSTbfpwyrj7wT-YvMQ/o.jpg"
      },
      {
        "img_id": "o5h8A6MEZRGhCPeT6QMJ7g",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Shrimp n&amp;#39; grits.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/o5h8A6MEZRGhCPeT6QMJ7g/o.jpg"
      },
      {
        "img_id": "F2YlFo5GUUazgYMGnwy3fA",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Pineapple Ramos Gin Fizz",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/F2YlFo5GUUazgYMGnwy3fA/o.jpg"
      }
    ],
    "user_id": "ca___2Qaf5FFyPCf6T2eZA"
  },
  "ga1Vs8r7MDO9HtKEVptHlQ": {
    "date": "12/1/2014",
    "text": "I've liked I.B.C and its focus on local breweries since it opened, but recently they re-vamped their food menu and it's even better!  They took a few of the duds off the menu, and the things that are left are really tasty and a fun combination of food types and flavors (halloumi, mac-n-cheese, steak salad, shrimp and grits with Moroccan flavors).  The offerings definitely exceed your standard Bar Food menu.  They also have a great-looking cocktails and spirits menu, which I never noticed before or they've recently printed.  Haven't tried any yet, but other friends raved about how great they were.   My only real quibble with this place is that the food portions are off-puttingly tiny.  The halloumi, for example, was like the size of a deck of cards, maybe? It was 2 bites for each of the three of us.  My salad was also Wee; I probably would have been annoyed had it not also had the steak on it.  I am someone used to small plates and fancy food, so I am not expecting giant, American-sized portions that could serve a family of four.  It's just that their primary identity is as a beer place.  For a place with such an empasis on beer, you'd expect a bit more hearty, satisfying fare.  My friends and I enjoyed everything we ate, but were hungry two hours later.  Perhaps we just picked the smaller/ less filling items.    This place is a nice middle ground between classy and casual; fussy and unpretentious.  As much as I enjoy their concept and what they have going on, my only worry is that they will alienate people by serving food that errs a bit on the side of  not a good value for the cost.  I think they could go a long way to avoid that possibility if they offered more happy hour specials on food and drinks.   Regardless, I'm really looking forward to going back soon and trying the sandwich and fries, or possibly the eggplant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HP3ddh3Na9odWXtVcyM3sw",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HP3ddh3Na9odWXtVcyM3sw/o.jpg"
      }
    ],
    "user_id": "koJypUmFGpyKIeLsuMXwJA"
  },
  "mQnyochGCm5fzr9SDR9CuA": {
    "date": "2/7/2017",
    "text": "Decent drinking hole with a wide selection of beer, mead & wine. Food is really good - especially the fries. Negatives: Too few waiters for a busy weekday evening. Gets crowded at times, and you're going to wait. Positives: The quality of food (presentation & portion size), value for money and location.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wlmE9C8joSV-n6LM3V2HgQ"
  },
  "bHmKUlCE2FwGVzD6mXrMmQ": {
    "date": "8/22/2016",
    "text": "This is one of my favorite places on the planet. If I could be buried anywhere, it would be at the Independent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "cQL-bGnsz3gK5p9O6ZkwxA"
  },
  "fHPlutdRMFVg5s9yJC-R_A": {
    "date": "9/24/2016",
    "text": "Why did I wait so long to eat here!  This place is amazing...  Great food, atmosphere and just all around a nice joint!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "76nfgqXhVjImxvmWqyz45Q",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. And they have wine, for those of us who no longer do the brew.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/76nfgqXhVjImxvmWqyz45Q/o.jpg"
      },
      {
        "img_id": "NLBMqkdv2WNI0peuhIddbA",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Falafel burger.  Wow!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NLBMqkdv2WNI0peuhIddbA/o.jpg"
      },
      {
        "img_id": "F_AfZsZkl7pSLCsR2si1vg",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Arugula and lentil salad.  So good!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/F_AfZsZkl7pSLCsR2si1vg/o.jpg"
      }
    ],
    "user_id": "ZNLbTdx3_vaxAYRB5n-gLQ"
  },
  "HFjmGVAIQmpZocD58V6Z2Q": {
    "date": "7/14/2018",
    "text": "Beer was delicious, food was okay, staff was super friendly. Plenty of room and fast service. Reasonably priced. I would go back",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "-Ds0hzlQwZUukmOwnapaFg"
  },
  "4MGtd95m6FFqZFw0f7iLoA": {
    "date": "4/7/2019",
    "text": "This is a very wonderful restaurant.  The waiter was very nice and made sure our food was alright. My appetizer was the Bibb lettuce salad with avocados and pistachios. This was so delicious because it was simple but yet very tasty!! Then the main dish came out which was the steak serve with grits and wine sauce. It was very good and would highly recommend that you check this out. Thank you so much :-)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nN8L2cByceUKJGFhx3chHg"
  },
  "Q7pSK0dkdJI-jJPQK5gmOQ": {
    "date": "12/24/2017",
    "text": "When I called to make reservations at Hidden Harbor, they asked if I was calling for HH or Independent Brewing Company because they have the same phone line. I had no idea these two were side by side. My friend and I decided to go to both. We didn't make reservations for IBC though and didn't have any trouble getting a table.   We arrived around 9 and noticed the bar was pretty full. It's not the biggest place so I wouldn't come here if you have a large party of 10 or more. The interior is rather intimate with dim lighting and gives off colonial/tavern vibes. We ordered a cheese board and a side of fries to accompany our sour beers. We ordered the Alvinne (Wild West, Primitivo, Wild Ale with Zinfandel Grapes, 6.0%). It was on the darker side which I typically do not gravitate towards, but it was perfectly tart and yet smooth. They offer happy hour $2 off until 6 pm.   The cheese board was good. Was it the best? No. But I was a big fan of the cheese of the day which was gouda and fontinella. Those are two of my favorite cheeses. You get three slices of each. It also comes with pickled eggs (not so pickled), pickled red onions, pickled cucumbers, cranberries, and 4 slices of pita. The pickled red onions and cucumbers were very good! I was hoping there would have been more pita on the board. 4 slices just isn't enough to share between 2 people. Thankfully, my friend isn't into pita bread so I scooped them up. The fries were very tasty and I was a big fan of the curried ketchup. I have never had curried ketchup before and I guess this is something that is very popular in Germany. I haven't been able to stop thinking about it since. I love that they have a variety of local breweries beer on tap and I will definitely be back soon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9Y9VNNOYrVB0RGAHLTZvAg",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9Y9VNNOYrVB0RGAHLTZvAg/o.jpg"
      }
    ],
    "user_id": "mYJW4-M4tcRygSwdT3A6Ww"
  },
  "3J1r4k7MrWn-xz2SRjzpbQ": {
    "date": "1/20/2019",
    "text": "This may be my new favorite place.  Walked in and found the atmosphere cozy and inviting, with Leonard Cohen playing in the background.  Good draft list, including offerings by Levante and Main Brewing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Q0FESf36rmp6g-A77bo1Tw"
  },
  "qLL4bb8YEtaOu22w_rXryg": {
    "date": "6/19/2019",
    "text": "Thoughtfully curated selection of local and not so local brews in a friendly and funky venue. Gracious staff. They play good music on their turntable. Happy hour is fantastic!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bE7y-PVHGzAaWOX_fq4Ulg"
  },
  "oRyMZeEjSLc824ODLLopcQ": {
    "date": "10/9/2017",
    "text": "Cute place with endless beer options and a full bar. Came here on a Sunday to have some drinks and munch on snacks, but we were told their kitchen is closed on Sundays. Instead, they have a taco stand right outside the bar which was AMAZING! The ingredients were super fresh and the fish tacos were AMAZING. I'm pretty sure it's not some independent taco place, but just their staff working.  The drinks are fairly priced and the service was friendly. I wouldn't mind coming back here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "uNuPyXHbbtHnhWhPLamESQ"
  },
  "iZdkso2T0zsIASI3rGE3vA": {
    "date": "1/8/2019",
    "text": "This is my favorite spot in Pittsburgh! They have an excellent beer selection, a warm and glowy vibe and a large selection of records (they take record requests!!) I am in town on a business trip and I went to independent brewing company last night with my coworkers after a long day. We drank triple IPAs and listened to Carol King till closing time!  what a magical location :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8WObLbtvFlbBa4Q8Er5jOw"
  },
  "wMKbsQ-kNKjSosI1DBJsvg": {
    "date": "3/7/2018",
    "text": "Great atmosphere- records, no screens. Huge selection of specialty- local & international brews & cocktails. The food is delicious & great service too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "0_rsVtUZlnjpryMjRZ-O-g"
  },
  "hu7CwLugKICQGsHrjML1Cw": {
    "date": "4/20/2016",
    "text": "Amazing local beer selection... But ughhhhh that Lamb Burger though. So good. Seriously. I love lamb and I love lamb burgers even more and it's phenomenal. You'd probably be surprised to hear the menu has a Mediterranean influence. But it doesn't stop there. They also offer a deliciously creamy mac n' cheese, of course, made with cheese and beer.   But back to the beers. They have a great selection of all different local beers from around PA. I am currently obsessed with the Pink Boots Gose, but that kicked fast (probably because it was so good). I've also had some great Grist House brews. But seriously, there's so many local breweries, this is a great option to try a good amount of them in once place!  Another surprising fact, they also make a fantastic cocktail. They have great bartenders cooking up new cocktails, as well as the classics. So really, you can come here for the lamb burger with your cocktail and beer loving friends!",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 11,
      "cool": 7
    },
    "photos": [],
    "user_id": "4wp4XI9AxKNqJima-xahlg"
  },
  "GNyT1lu_eymuNYVMMj2ugw": {
    "date": "5/6/2017",
    "text": "This place has my favorite cocktail that I have had thus far in my adult drinking life. It is called a Gold Rush and it is to die for. Independent is typically known for its local brews and growlers. To my knowledge they only carry brews from western Pennsylvania. However, they also have legitimate cocktails. They are pretty pricey but that is because they do not skimp on the spirits at all. You will feel it even with a single drink.   This place also has pretty fantastic food. Typically their best meals are the specials of the night. Once I had a brisket that just melted in your mouth and had a great side of smashed potatoes. We have had really good lamb burgers here. They also are famous for their Brussels sprouts and mac n cheese.   The location is extremely small though so either make a reservation or come with a small group. I've only ever successfully walked in and gotten a table once. Every other time I have ate at the bar.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "xBVhng8rfcP7ivF-trUhZg",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. The menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xBVhng8rfcP7ivF-trUhZg/o.jpg"
      },
      {
        "img_id": "llX2eeIZAuxNIF4coNiA7w",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Fall apart brisket",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/llX2eeIZAuxNIF4coNiA7w/o.jpg"
      },
      {
        "img_id": "Ghjtrc6DxPuHdhBFVZbxzA",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Chops",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ghjtrc6DxPuHdhBFVZbxzA/o.jpg"
      }
    ],
    "user_id": "ghh1PKzKpVSIvYqoMXU6wg"
  },
  "O2YaTryzVmrXvUv1YHGVBg": {
    "date": "4/20/2018",
    "text": "The hubs and I choose to visit IBC for our anniversary dinner tonight.  We are relatively new to Pittsburgh and I can honestly say this is the best meal I've had thus far while exploring our new city.    The beer list can't be beat.  If you are looking for a good representation of local breweries, search no more!    The food menu, while small is packed full of flavor and great for sharing.  We wanted to try the Beef Empanada but they were sold out so went with the Pork Meatballs.  Yum!  For our main dishes, we went with the Sweet Potatoes, Korean Fried Chicken, and Duck Leg Confit.  I love sweet and savory and the potatoes were just that!  So many flavors with both the chicken and the duck.  I could've easily ordered anything on that menu.  Last but not least, we tried the Basil Panna Cotta for dessert.  A perfect way to end our dining experience.    Some other reviews noted the prices seemed a bit high.  I felt they were on point for the quality.  I will be keeping an eye out for seasonal menu changes and can't wait to go back.  Cheers to Chef Borges for killin it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SCqi8N3vP4qIcF5ezzWzzQ"
  },
  "K_hvbqnLflPgBzeflg9W3g": {
    "date": "4/12/2018",
    "text": "The name may be deceiving - it's not a brewery in itself - but this is a cool spot to hang for anyone who likes the hip things in life, especially craft beer. They play records and have a collection from which you are welcome to choose what you'd like to hear next. I also appreciate their dedication to the weird and unknown things in life, such as their art parody wall featuring paintings and photographs with UFOs and giant octopuses discreetly added to the scenery. Even their house pint glasses feature an image of the kraken submerging an unfortunate sea vessel. I've been here a couple times because my brother lives in the area, but it's been a little while and I'm looking forward to visiting again in the nearest future possible.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4rwNRpAQ0BKreXqW3KnaUQ",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. There&amp;#39;s something about that replica of Starry Night.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4rwNRpAQ0BKreXqW3KnaUQ/o.jpg"
      },
      {
        "img_id": "jvsMBPMrnw13J2aSJgkSrQ",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Release the kraken!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jvsMBPMrnw13J2aSJgkSrQ/o.jpg"
      }
    ],
    "user_id": "1XAJ7iFmIcsiH8irvY5cRQ"
  },
  "8kgdSNpuLi696Z4BfKYz0g": {
    "date": "11/6/2018",
    "text": "Really amazing food here, great and different selection of beers.  Awesome atmosphere with humorous artwork, overall a great place to hang out.  Pricey but worth it all the way.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z6E5qKl83U1RV3WkV4k8Bg"
  },
  "8KFVqoK3cGn3bGWrTuYmLw": {
    "date": "2/13/2017",
    "text": "We stopped here this past Saturday before heading to their sister restaurant/bar next door.  Independent Brewery's niche is only carrying and supporting locally (Pennsylvania) beers.  I came here last year for a yelp event and thought it seemed a whole lot better at the event.  The venue is small, and the layout is too tight, not to mention the place was definitely above capacity as there was nowhere to sit and many people were just standing behind occupied tables and barstools.  It wasn't comfortable, and we only stayed for one drink.    I know the same people that own Hidden Harbor also own Independent, but in my opinion they have a much greater concept/product at Hidden Harbor.  The locally supported craft bar isn't anything new, a lot of places are doing this.  Maybe not exclusively, but there are still plenty of establishments that you can order several local craft beers.  That being said, they certainly weren't hurting for business so it's just my personal preference.  I think I will just be sticking with Hidden Harbor on all reoccurring visits.",
    "rating": 3,
    "rated": {
      "funny": 15,
      "useful": 21,
      "cool": 25
    },
    "photos": [],
    "user_id": "_5fx5gexi9OeZIuukV2gHQ"
  },
  "T_qvyMFqnmQoTvhkfsMGXQ": {
    "date": "11/11/2018",
    "text": "A great cozy place to have a beer in the heart of Squirrel Hill.  I like the vibe and they serve only (or primarily) local beers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ASOJSBvDEN97TJWJz-4gug"
  },
  "74SXeP7oO3lcrmaO0EbJpg": {
    "date": "2/15/2017",
    "text": "We came here after dinner on a Saturday night looking to just get a drink or two.  My wife had been here before and I wanted to check it out because we often visit Hidden Harbor next door but I had never been here before.       We walked in and it was packed.  It's a cute place but it was so loud.  I know it was Saturday night and it can get busy but it wasn't relaxing.  We found one spot at the bar to share and we ordered some beer.         They have a lot of draft beers on tap but I couldn't find one that I liked.  There were a lot of IPA's and I'm not a big IPA fan.  Regardless if I had a good drink or not this place just wasn't for us.  If it wasn't as busy would it have been better?  I'm not sure.         Still it looks nice inside, they are busy so business is good, and a lot of people were having a good time but it just wasn't for us.  Also I didn't see a television to watch any sports too.  You don't always need one to have a good time but when your drinking it's nice to watch a game.",
    "rating": 3,
    "rated": {
      "funny": 7,
      "useful": 15,
      "cool": 11
    },
    "photos": [],
    "user_id": "WO-8BmpIuaJJnzgEU5D42g"
  },
  "0O7qPpdsGNpfv7D45sASEA": {
    "date": "2/22/2017",
    "text": "Great pub in Squirrel Hill.  Cool, Hipster vibe.  They have a great selection of local Pennsylvania beers.  I really like this aspect.  You can try all the local beers but not have to go to the individual breweries.   Just do not try to drive home afterwards.  The beers are good and so are the prices.  The food is surprisingly good.  Definitely a good spot for some grub.  You will need some food to absorb the beer.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "VCj__r1jfuZVpnBRrzuTNA"
  },
  "1F6eifYh-4xH8U0xGoFENg": {
    "date": "9/22/2017",
    "text": "Great service.  Innovative local beer selections, great tunes and totally friendly staff who care about the product.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "yXMcfH0qS2yhKINCRNI4nw"
  },
  "VASUli6mwdhlQ9cuXIILrg": {
    "date": "5/27/2015",
    "text": "Drinks Only.  First of all, I enjoy the rustic atmosphere and the friendly bartenders. Not everyday I get to enjoy a bar like this in the dc/md/va area. So great job IBC for being creative! AND being creative is definitely shown with their mixologist.   The drink menu is displayed on their blackboard. It's uniquely designed based on what they have stocked. What's interesting is that even if something may not be on the board, the bartenders ask you a few questions to match your taste. During my time there, they've been on point.   My favorite that I have tried besides the beer is the Roman Holiday. Seems to be a popular and interesting choice. Recommend it as a dessert drink. It's refreshing and mildly sweet. If you don't prefer that, then go for the Blood of the French Revolution (for those into history, Pittsburgh is filled with history). The cocktail kind of taste like chocolate covered cherries.   I honestly can't wait to return. Visitors should give this nice little bar a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "K1Wbh1Kxqop3Fs4a1Vl7NA",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Cozy bar. Great bartenders.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/K1Wbh1Kxqop3Fs4a1Vl7NA/o.jpg"
      },
      {
        "img_id": "r901yy1iYO4XY_EthI4mTw",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Blood of the French Revolution.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/r901yy1iYO4XY_EthI4mTw/o.jpg"
      }
    ],
    "user_id": "sp0NdHV5lZQ0DwLdxpqyRg"
  },
  "I7Y4eBmhQFIDlOa99TfO_w": {
    "date": "6/3/2018",
    "text": "Don't be turned away by the small menu. Everything I ordered was amazing. I highly recommend the empanadas. I could have eaten 10 of them. We went around 7, and it was not crowded. Around 8 it started filling up. I will be coming back here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qao1gDw4qtRuSgZl6k7y9g"
  },
  "Nr3FDth8ToVuOTCLb6QKMA": {
    "date": "5/7/2019",
    "text": "The food lived up to all of the hype. I had the duck confit and it was just perfect. My wife had the rigatoni and it was amazing! Then for our 2 and 3 year old kids, they had wings (which were some of the best ever), perogies, and grilled peanut butter and jelly sandwiches. All of which were hits for the kids.  We had a table of 8, including 4 young children. They were very accommodating to the children and the service was excellent. It's really difficult eating out with young children, but they made every effort to make it a great time for us. I want to point out that Yelp has this business listed as not good for children, but i found quite the contrary. I called in advance to verify and they very much welcome children. Which I am very thankful for!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "bP0AXiumVp51e9AjvTB4lw"
  },
  "1RrbLn0WpkopgwQgLfVtrg": {
    "date": "4/16/2019",
    "text": "Very hipster bar with thoughtful drink menu, music, and decor. Bigger than it looks and you can generally find a seat, even on busy nights. Also, there are tables on the sidewalk for drinking in nice weather.   Of course, with the fancy beer selection and vinyl playlist, you get some high prices. Still, the atmosphere is perfect for getting together with friends - not too loud and something for everyone.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "o3Rk2FeW_DQO9kLKg4ufCg",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/o3Rk2FeW_DQO9kLKg4ufCg/o.jpg"
      }
    ],
    "user_id": "Q3-Y0zoVvMM8Jr5MB1mBgQ"
  },
  "oLYsfcCsAQ0hjltvf79x3Q": {
    "date": "3/17/2019",
    "text": "Independent has a very very very good selection of local and far, far away craft brews. Ownership/management has obviously put a lot of thought into doing this right. The bartenders are nice and thoughtful, the food is good, the vinyl on tap is great, esp. if you like music from the '70s, and the bar is within walking distance for many of thousands of persons.  The food is of really fine quality, though I DO wish there was ONE (just one) inexpensive item for heavy drinkers with the munchies, i.e. a $4 simple fries thingie for someone who had just spent $9 on a high ABV stout!   One little caveat : You may not be seated at a table unless you can commit to ordering food beforehand. Even expressing that you're likely to order food may not be good enough, and at that point you can only hope there will be space at the bar.   Also -- I hope that the owner(s) brings back the chalkboard bartender picks of great thematic songs!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "84LmO6nxLC79Q7jW0ZiAVw"
  },
  "-RaVlWNni02yfp8iqSo3xQ": {
    "date": "8/9/2019",
    "text": "I had a very nice time at the Independent! Staff was nice as was the atmosphere. The seats outside were packed on such nice night but there was space inside and at the bar. The drinks list was a good length; a variety of choices without being overwhelming. I ordered the aviation; a drink I was happy to see on the list as it is one of my favorite cocktails and sometimes bartenders don't know how to make it or have all of the ingredients. It was good but a bit heavy on the lemon. I also ordered the baby eggplant which was very nice! Definitely an appetizer not a main even though they group all of the savory food options together. The food and drink was a bit pricey (especially some of the beer options) but expected from such a local and \"hipster\" establishment.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wFHt71P3u6HztG-bav8XoQ",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Draft menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wFHt71P3u6HztG-bav8XoQ/o.jpg"
      },
      {
        "img_id": "DToZuoKybqFZA_xz4yoclw",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Cocktail menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DToZuoKybqFZA_xz4yoclw/o.jpg"
      },
      {
        "img_id": "76OKLH-QMxnN49jRK9bFmQ",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Baby eggplant",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/76OKLH-QMxnN49jRK9bFmQ/o.jpg"
      }
    ],
    "user_id": "9XbTAoX0ZX2rjDwZxGJqKw"
  },
  "K8KrhaSYOkDRpxoD4P9Knw": {
    "date": "2/14/2019",
    "text": "A hidden gem! I came here yesterday for a Galentine's meal with my friends and was pleasantly surprised to find that the food was DELICIOUS.   It's important to note that the restaurant is sectioned into two parts: a standing bar, which you walk into at first, and a sit down table area. When my friend first walked in to snag a table, she thought had walked into the wrong place since she was the youngest one there at the bar. However she was soon escorted to the seating area. This area had walls covered in what seemed like vintage framed posters- with a twist. The table itself was nicely decorated with flowers and intimate candle lighting.  We decided to order the steak $26, sweet potato ravioli $19, and fried chicken bucket $30 (recommended for two but we shared for three). We also got their pork meatballs $6 and Brussels sprouts $9. I have to say the meatballs were tender- fantastic- and the Brussels sprouts sweet but crispy. I'm not the biggest fan of Brussels sprouts but these were worth it. The ravioli tasted like a savory dessert and the chicken was very crispy. It had been dusted with seasoning and served with a side of mashed potatoes and coleslaw.   The waitress was kind and came to check up on us/refill our water many times. We didn't order any drinks, but the meal itself was satisfying enough. I will say that the food is pricy. A $$$ kind of place. Also, the drink menu is definitely longer than the main menu. But overall, I enjoyed the atmosphere, decor, and food of this restaurant. I would come back again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dwHiHfCCTxyki7NLVtsWVg",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Meatballs on left, Brussels sprouts on right",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dwHiHfCCTxyki7NLVtsWVg/o.jpg"
      },
      {
        "img_id": "izIUil1bFo0GyYmUZhmciA",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Ravioli at the top left, steak top right, chicken and sides at the bottom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/izIUil1bFo0GyYmUZhmciA/o.jpg"
      }
    ],
    "user_id": "Go2GaPE609qgJI0jCMvmrg"
  },
  "119yk6WeqYlsBRtkssVEig": {
    "date": "1/23/2019",
    "text": "\"Thanks for trying everything on out menu,\" our waiter said as we closed our tab.  We weren't sure if he was being serious or sarcastic, as we did try quite a few items.  This was after he asked if we wanted anything else as if we weren't going to order food after we received our drinks.  Dude had no idea.  Independent Brewing Company has been on my short list of places to try for a long time.  The pictures of their menu items posted on social media always make my mouth water.  But the space is limited and they are only open for dinner, so getting there has been tricky.  I used an out-of-town friend as an excuse to finally give it a try since she often asks me when we're going because she also sees their food pictures on Facebook.    It's a small space, maybe 15 tables total.  So getting there early is key.  We arrived just before opening and there was a line of people waiting for the doors to be unlocked.  I took that to be our first good sign.  While drooling over all the menu items and ordering a beer from the selection of crafts on draft, my friend and I decided on several things.  First, we started with two appetizers : the carrot pierogies made with carrots and ground pork and the fried brussel sprouts served with macadamia nuts and a honey and lime sauce.  I don't know that I've ever had a pierogie I didn't like and these were very flavorful.  And while I do have a love/hate relationship with brussel sprouts I did devour half the order (I think that honey and lime sauce was they key).  We each ordered our own entree (my friend ordered the scallops, I ordered the hanger steak) and we shared a third entree (sweet potato ravioli).  The ravioli was good and came with these amazing little pecorino crisps.  I could have eaten a whole plate of just those.  My steak came with smashed sweet potatoes, crispy onions and a herb butter.  When I see hanger steak on a menu, I will usually order it.  Here at IBC, this was not a mistake.  After dinner I ordered a cocktail (rock and rye) and we decided to share a  dessert.  The sticky whiskey toffee cake stood out from the choices so we went with it.  This proved another good idea.  The only thing that really took away from this being a 5 star experience was our waiter.  It seemed like we were bothering him by being there and ordering food.  I wasn't sure how I'd feel about the small dining area, but we ended up talking to an older couple next to us and had a lovely conversation.  I sometimes think these smaller restaurants hope for that as a way of making their establishment feel more welcoming.  The food was as good as expected even with our high expectations and I will both return and recommend IBC.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Whln7w94FaLllPsfBOsGNg",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Sticky Whiskey Toffee Cake",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Whln7w94FaLllPsfBOsGNg/o.jpg"
      },
      {
        "img_id": "75GeG_CEKpxYrNjJ4LB49A",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Rock and Rye",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/75GeG_CEKpxYrNjJ4LB49A/o.jpg"
      },
      {
        "img_id": "MLoSKMMOH6dYtAQIX28avg",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Scallops",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MLoSKMMOH6dYtAQIX28avg/o.jpg"
      }
    ],
    "user_id": "WoKCLSctS7G2547xKcED-Q"
  },
  "XDKrXoll8XBVGppIY1T-KQ": {
    "date": "8/6/2019",
    "text": "Excellent spot in Squirrel Hill. This isn't actually a brewing company: they only sell lots of Pennsylvanian brewed beers. No matter. Beer selection was great. Bar food was delish! Love this meatballs! Very cool music (all vinyl) and atmosphere. Outdoor seating.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "cXzOD8-ExSEikkvvfsqdSg"
  },
  "lczzjlg5HX19_FiinXSRgA": {
    "date": "4/29/2018",
    "text": "A great place for beer, mixed drinks and surprising food.   I love IBC. The drinks are varied and delicious. The food is adventurous and tasty. And the staff is just wonderful - really friendly and knowledgeable.   We recently decided to do progressive dinner and drinks through Squirrel Hill - with one stop being IBC. I struggled choosing between beer and a mixed drink, but landed on my standby: an Old Fashioned. It was a perfectly balanced, tasty cocktail.   But my wife won the drink choice. She went with the Indian-Spiced Dark & Stormy. This was out-of-this-world delicious. The masala-infused rum was subtle, yet oh so good.  We ended up splitting the Pork Meatballs and the Sunchoke Cream Soup. The Meatballs were nicely sized and perfect for sharing. I would have liked a little more of the tomatillo sauce, but they were delicious nonetheless. The Sunchoke Cream Soup was the real star though. This soup looked and tasted great! The creamy, satisfying soup paired perfectly with soft mushrooms and crispy croutons.   If you like high-quality drinks and unique, tasty plates - give IBC a try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "vg0xfP02tul2MMl6q4Rj0w"
  },
  "AACpsBHVnCJwVT3J764-Iw": {
    "date": "5/25/2019",
    "text": "The stout was smooth but not creamy, with good coffee flavor. Do try if you like stouts  Crowded and popular hangout ..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WAqZM0CdKp_eAzkB_-zmTA",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Barrel aged woke coffee stout",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WAqZM0CdKp_eAzkB_-zmTA/o.jpg"
      }
    ],
    "user_id": "D2eBiwGgN2ueTaAfHkEObA"
  },
  "jNBUpx8z-a9tWMK0BMW9Gg": {
    "date": "9/16/2018",
    "text": "Let's start off with the good, the bar had a lot of great beer options and friendly bartenders   The bad: the servers are extremely rude and unpleasant, they ignored the table for a long time and make no effort whatsoever. I literally had to go up to the bar and order things because the servers was always MIA and rude when he came back   The place over all seems nice and pretty lively. This review is only regarding the drinks and the way the servers are, nothing related to the food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "nKa_r2ajf6YCELH2qmckrg"
  },
  "wnPptt59X5iWawnPppnH2w": {
    "date": "8/21/2018",
    "text": "We came here on a Friday evening (we made a reservation ahead of time) to celebrate a friend's birthday.  While Independent Brewing Company can get crowded very easily, it was still a nice place to get together.  It did seem a bit loud and I had to shout to my friends, but it didn't completely distract from our get together.  I ordered an heirloom tomato salad, and my friends also ordered various items.  Our waitress was helpful even when we could have easily frustrated her as we switched orders in the middle of ordering.  I don't drink but my friends do and they tried a few of the specialty drinks and were all pleased.  The menu changes, so I would be interested in giving Independent Brewing Company another shot.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "agGWDhkVvIHaf8w16jLTng"
  },
  "Ymt46zYQmEcYYlh5ld_lqg": {
    "date": "4/29/2019",
    "text": "A small and cozy bar with walls adorned with fake historical photos and music chosen straight the record collections. The vibe is almost as amazing as the seasonal menu from an award winning chef or the extensive local and worldly draft list.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LuISv7jKya07q3jzdiUAIw",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Crispy sweet potatoes with pea butter",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LuISv7jKya07q3jzdiUAIw/o.jpg"
      },
      {
        "img_id": "W5s3C3K5m9RjAPcwfHZeCg",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Potato chips with ramp hollandaise",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/W5s3C3K5m9RjAPcwfHZeCg/o.jpg"
      },
      {
        "img_id": "-iuez2p4I7zBeMpjYCY1Sw",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Whole Branzino, salsa Verde",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-iuez2p4I7zBeMpjYCY1Sw/o.jpg"
      }
    ],
    "user_id": "EiyCia2uZiVl3T3TEb6kiA"
  },
  "Q2fUZNQgLNGn-63-W73xYA": {
    "date": "4/7/2018",
    "text": "Let me start by saying I love negronis. This place serves a great one: reasonably priced with an orange twist and a gigantic cube. Yum. Beyond that, they have a pretty solid cocktail list, mostly classics with some sort of twist (ex \"Spanish style gin and tonic\"). While I tend to drift to mixed drinks, this place does specialize in beer, if that's your preference, and they also serve arsenal cider!  Food: I like the snack/appetizer options, especially after they recently redid the menu. I personally would not come to dinner here - I think their entrees are a little on the pricey side, but I haven't tried them, so maybe they're great  Service: All the staff are very friendly and knowledgeable, but I wish they had a few more people working as service can be a little slow. It doesn't bother me too much since I usually come here to hang out for awhile, but if you're in a hurry, it might be a problem.  Atmosphere: the crowd varies, but mostly professionals in the 30s or so. It can get pretty crowded on the weekends, but it's usually not to hard to find a table or a spot by the bar. During the week it is the perfect balance of not too crowded and not to empty. I quite like that the don't play sports games here, definitely a different vibe than typical pittsburgh bars  Overall: Great bar for low-key drinks during the week or weekend, especially considering limited options in squirrel hill!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PE-XnZO2Ce5zjFD07ly9CA",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Negroni; &amp;#34;penicillin&amp;#34;; cosmopolitan 5/5 stars!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PE-XnZO2Ce5zjFD07ly9CA/o.jpg"
      }
    ],
    "user_id": "YhKdhoEhxD8A7ldxdhPPOw"
  },
  "ahoXsfjwCam9zQ0xFPJvmg": {
    "date": "4/23/2019",
    "text": "The bar is very creative with decorating style. So it was fun to read and laugh at the poster on the wall about Alternate Histories where monsters and zombies conquered the world! Pale Ale was good, my Mr.Blue Sky turned out to be pink not blue as I expected :))",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GUyaa3YKU_0jj9z6lQDHRg",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Pale Ale",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GUyaa3YKU_0jj9z6lQDHRg/o.jpg"
      },
      {
        "img_id": "INc13UGOfk2DA-AujIiv8A",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Mr. Blue Sky",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/INc13UGOfk2DA-AujIiv8A/o.jpg"
      }
    ],
    "user_id": "A4PDFygykiIe7L0cdEiXbw"
  },
  "g0ohgqgadslCLZqP7xIioA": {
    "date": "12/24/2017",
    "text": "A friend and I went out for drinks this past Friday and decided to check out Independent Brewing Company since it was right next door to Hidden Harbor. It's a cute little place with a intimate feel. They have a bar area with a few tables for seating as well. They have a large selection of beer so anyone is bound to find something they like. I saw that they had a lot of beers from some of our local breweries such as Grist House, Dancing Gnome, and Arsenal Cider. I thought this was really cool. Got to support your fellow breweries, right?!  I wasn't real familiar with the beers they had on tap and our waiter was very helpful asking what we liked and offering suggestions. He ended up getting us a few samples before we made our decision. We each ended up getting on of the beers he recommended to us and I thoroughly enjoyed it. It was a little pricey for a beer but I was celebrating so I didn't mind.  I came here saying I wasn't going to order food but little did I know they were going to have some German food. I lived in Germany growing up so the minute I saw fries with mayo and curry ketchup I was thrilled. It is so hard to find curry ketchup anymore and I've been missing it all these years. It was delicious and everything I remembered it being. In addition to the fries we also decided to split a cheese board. Overall, it was a pretty well rounded cheese board. It had some pickled veggies, cheese, pita, dried fruit, and a spread. My only real complaint was that the pickled egg just tasted like a regular hard boiled egg. It didn't have much pickled flavor to it. For $10 though, it was well worth it in my opinion. I've paid double that for about the same thing other place so the price point was definitely right",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Y6tXYPYqeVy37-L5p0rMw"
  },
  "UQO18RWhzvbh8U9QohiRsA": {
    "date": "10/12/2018",
    "text": "This was my first time here and I'll absolutely be coming back! The beer was really good, I got a Saison and my friend got a latte stout which was shockingly tasty. It's intimate and trendy without being crazy expensive. I'm excited to come back and add some apps!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "y15vqKddeH1tArRdF4SRnw"
  },
  "SoJgL6obZVh9bTUXwDgfxw": {
    "date": "6/2/2019",
    "text": "Great beer options.. There were four of us and we just got drinks and two appetizers, which were really good - would recommend the chips and dip",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_9kpCgV3hK_02gAvBWh0cg"
  },
  "9Ff-P54YUTvJK6-Ae4dwyw": {
    "date": "7/7/2018",
    "text": "Really enjoyed this spot! The beer was great and we also ordered some meatballs. They were delicious! The bartender was great with helping my wife settle on a drink choice. She's not a big beer drinker but they also have some other great options for wine.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "r_7c_eQjHEHOVElS9gLWcQ",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/r_7c_eQjHEHOVElS9gLWcQ/o.jpg"
      }
    ],
    "user_id": "0H_n0mdiBBCfFuLYibod_Q"
  },
  "Ehwo0XBPecH3iwdnkJEZMA": {
    "date": "7/27/2019",
    "text": "First visit. What a great spot!! Awesome & friendly service, interesting & varied beer selection and the food was delicious. Go here!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lemPYZHs1LkAlfwOz4arcA"
  },
  "4HAz3Eu3W6pdN9JUMb3fUw": {
    "date": "2/27/2018",
    "text": "What a great neighborhood hang out--classy but welcoming, friendly but intimate. We ordered the fries and pickled trout to accompany our ciders and beers, and we were fans of everything.   They have such sweet servers, nice decor, inviting-looking outdoor tables for warmer weather, and big windows to watch the world go by when it's cold. And I absolutely love the art!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "_kSbuZlcen8sjeiVhKj4Fg"
  },
  "Crv_IF-XGov0fcC98gDPLw": {
    "date": "12/31/2016",
    "text": "Good drink selection, nice atmosphere.  But it's a bit pricey for the portion size and food quality.  Probably better for just getting drinks and splitting apps with friends.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "37K6vypdZBWCZPF5RaZM5A"
  },
  "TGIgRSOAwkOoJHx2Kgncgg": {
    "date": "6/29/2014",
    "text": "Finally, a bar for adults. No smoking. No TVs. No internet jukebox. Just all the taps pouring local beer, which gets to highlight the terrific microbrewery renaissance happening in SouthWestern PA right now.  Outdoor seating and the doors that open outside are great on a pleasant night. Service is friendly, if a bit disorganized when they first opened - but it's gotten great. The food has also gotten really good - props to the grilled romaine salad, and I love their barreled cocktails and innovative guest bartender nights. Plus the $4 nightly beer keeps things on the cheap, no-frills (in a  good way) side.  I don't understand anyone who is upset that there are no TVs here. Almost every other bar in Pittsburgh (Kelly's is the only exception I can think of) has a TV, often gigantic TVs that are always on, no matter what is happening. If you want to watch sports, great - go to every other bar in Pittsburgh! If you want to have an evening of fun conversation with adults, come to the Independent. Now if we just had 5-10 more bars like this in Pittsburgh...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "wSyyIXD587rqo4Ep_DPFaQ"
  },
  "T-Lr-D4xWI78HFaBKWQ6Xg": {
    "date": "1/22/2015",
    "text": "This is a fairly new addition in the neighborhood and we were very excited to visit this place.  It is a very nice small bar/restaurant, with a great selection of drinks and a nice food menu as well.  The ambience is very nice, perfect for a relaxing hung out (but also for a date).  Be aware that the place is fairly small, so you will either have to wait for a table (during the rush hours) or you can sit on the bar and have both drinks and food.  This is actually what we did and we both tried their sandwich.  Both versions of it (with falafel and with sausage) are delicious and so is their chaloumi (this nice Cypriot cheese :)) appetizer that we also ordered.  We will be definitely going back to that place to try out more of their menu and drinks!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SfRlZcoYPw76lNsw7TEO7w"
  },
  "BIo7uA8CtWkKWZatFWzKbQ": {
    "date": "9/5/2014",
    "text": "Always a surprise what will be on tap. That means no counting on your favorites, but it's a great place for beer lovers and foodies who appreciate a little culinary adventure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "oXPF98YCc4e98U1eh324Tw"
  },
  "z3JFkNlFK1jQjTXlFEY6lw": {
    "date": "10/25/2015",
    "text": "The beers are all great - all local, and some that I haven't seen elsewhere.  They are also maintained very fresh.  The food is good, but a little bit pricey.  There also is not a lot of space so it tends to get crowded, even on weeknights.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-u790YrzgmALW1c7UAD5qw"
  },
  "47ZKTT_dMEi1hGW2T3HQDA": {
    "date": "2/22/2015",
    "text": "If ever there is a magical place where delicious food, flavorful cocktails, delightful and friendly service existed, my friends, this is it. I will continue to return time after time. You can't go wrong here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "zIhwZwLNSmJvUhqs9ETXrQ"
  },
  "hP5Shbc9E3QGlZ98POV9NQ": {
    "date": "8/14/2015",
    "text": "Independent Brew Company ia great in every way. All local, small, wonderful selection.  Done.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OfGknWfffsCADFFqBKS18A"
  },
  "SdruTNfJAFCqAIFo-97_2g": {
    "date": "7/12/2014",
    "text": "If you are not friends  of the bar.srvice is a joke. Don't waste your time, Better service serving the same. Is close by  try silky's. Food is non existent and little consideration of customers.   Save your money and certainly your time",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "0mXfzmIF5yxCnIw5XVAN-w"
  },
  "CoNQ0EhTpEL_61X9YswDAA": {
    "date": "7/7/2016",
    "text": "I'd say this is just the place for the foodie and microbrew lover. It's not a brewing Co itself, but a bar serving selections of Pittsburgh's independent breweries so you can try them out in just one location! The food was very interesting and combined American bar food fare with exotic spices. It gets pretty crowded on a weekend night though, so either come early or make reservations!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O2a7daBECA404rb59H-XEA"
  },
  "juULsyHMGAWK-a_H5WE6ug": {
    "date": "8/28/2015",
    "text": "IBC is an outstanding bar; the beer selection, cocktails and staff speak for themselves. It's food is underrated, though. It complements the drinks very well, but it's also great in its own right. I pop in now and then just for the brussels sprouts, or to see what's new on the menu. The kitchen is very inventive (lots of variety in the tacos, especially), but there are also great comfort food favorites like mac and cheese and ice cream sandwiches. (With big chocolate chip cookies that would be desserts on their own in lots of other places.)  There are top-tier local restaurants with bar programs whose food is better (and correspondingly more expensive), but for a standalone bar, IBC brings it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lh8bhp4ZnIOoo9CXljNEFw"
  },
  "TJLdVvQZAig6jVDzEHB7Xw": {
    "date": "5/28/2015",
    "text": "Independent Brewing Company knows how to make a drink!  Cocktail lovers should not be turned off by the misconception that this establishment only caters to brews.  Nice bourbon and whisky selection as well as flaming drinks on Tiki (thurs)night.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gs7GyYLTxuQAfu-3o2PmIQ"
  },
  "VnajOhbdwowKZWvBdJsr7g": {
    "date": "3/15/2014",
    "text": "Finally a non-smoking bar in downtown Squirrel Hill! The beer selection is great (yeah Arsenal Cider!) but the food is eh.  Small portions and high prices. The atmosphere is quite sparse -- plain old school brown tables.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "rpK40ZN2rNFJLhfdlQqS-Q"
  },
  "qYaioBQPt2x1yUK5_eX0Fg": {
    "date": "8/6/2015",
    "text": "I really have enjoyed all of the western PA beers that I have tried at Independent Brewing company. They seem to rotate their draft list frequently and have many beers on tap that I have never seen before (an accomplishment considering how many beers I have tried). A great beer spot within Squirrel Hill.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IhGfAZWFeo7LrXqTA-8-7g"
  },
  "2yDI_CGLVtbeFPr7MtNjlw": {
    "date": "5/11/2015",
    "text": "My husband loves the beer selection - I take issue with the fact that they don't have diet soda.  They don't have a very unique cocktail menu, which we enjoyed.   We went with another couple and we all agreed that the food was delicious, but the portions were TINY and much too expensive.   We would go back if we just wanted to get a few drinks, but we won't go for dinner again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e5vZmEUvdo7PylvzcfuB-g"
  },
  "wI_dGbPcLOuHzh69kb7_vA": {
    "date": "4/26/2014",
    "text": "I'd love to review this place but my friends and I went in, sat at one of the booths for 15 minutes, the waiter walked by twice and never asked what we wanted. Would have liked to have tried a beer. We left and went elsewhere. Didn't want to put any stars.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "yU-sLsv0Yh2uKy183WtXkQ"
  },
  "HB-4aA9_g4FUOXWPbsJbRQ": {
    "date": "5/27/2014",
    "text": "Yeah!!! You have to get the Roman Holiday. It's a bottled drink and tastes just like Italy. Very bitter and lemony fresh. I haven't had the food yet because it seems overpriced, just like the drinks. The atmosphere is great and I would give it 5 stars if they would just drop the prices down like $2. I got two drinks this weekend: my staple Roman Holiday, of course, and some Fish House Punch, which was good, but now AS good as my Roman Holiday... and I spent $22!! I'd go here every week if it wasn't so crazy expensive, but next week I'll be shopping around for another delightful brewery environment.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DD05qqwWDtY2TWRyiMov0A"
  },
  "uAEzrrOA7ZtY-2wYIOi90A": {
    "date": "6/24/2015",
    "text": "The Independent Brewing Company is one of my favorite dinner spots. They have a wide selection of beer that changes often. If you're looking to expand your beer horizons, look no further. Their food is eclectic and delicious. It's very vegetarian friendly as well. I tried their beer ice cream sandwich on a whim recently--it's phenomenal! The mo'fries are delicious.   My biggest complaint about the food is a lack of consistency. The brussels sprouts were one of my favorite items on the menu, but after ordering them multiple times and receiving wildly different dishes each time, I'm now wary. At their best they are crispy and flavorful. At their worst they are soupy and swimming in mustard and cheese. The mac and cheese is a similar story -- very different dish on different days!  I wouldn't mind the inconsistency so much if it weren't for the price. Nothing irks me like a lackluster dish with a high price tag. I definitely recommend the IBC for dinner or snacks and a beer. Just be prepared for some variability.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aWzo-gjsk1Qivwqxngflfg"
  },
  "vJYA47reiwA56sgjDHUmuQ": {
    "date": "8/24/2015",
    "text": "Let me tell you about my experience-here we go- it's a Sunday evening-six customers at the bar-four customers outside-we were not greeted at all when we walked in the door and sat at the bar-there are two bartenders-one is mixing a cocktail and cannot take his eyes away from making a cocktail for even a second to say hello-the other walks by us twice and doesn't utter a \"hi.\" Interestingly enough, friends of the one bartender come in and are greeted appropriately with an explanation of cocktails and beer that they have available. How nice for them! Since we are just mere patrons wanting to spend some money and drink some good drinks-we are finally gazed upon by one of the bar tenders and we order a draft and a pre-made cocktail. After we finished our drinks-the drinks sat there empty for about five minutes-the bar was still not busy for two bartenders to handle in a timely, efficient manner. We had to flag one of them down to get another round. So I suppose if you are friends of the bar staff or a regular-you will have superb service-if not, then good luck with your experience! We definitely planned to spend a lot more money at the Independent, however the poor service prevented us from doing so and our money was taken to a place with much better service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 8,
      "cool": 1
    },
    "photos": [],
    "user_id": "D0_EDhZvO5z3UEPszmxiYg"
  },
  "PRwnDjkgccqv10K93wJoHQ": {
    "date": "5/8/2015",
    "text": "Awesome beer selection and great service! Small plate menu but everything is very tasty. And inexpensive. Win-win! New favorite place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qHG7h-U771tX-hOC6fHnTw"
  },
  "T5xcnSHl93OYvu0ElP9ffg": {
    "date": "1/25/2015",
    "text": "What becomes one of my favorite spot in Pittsburgh! The server, the owner are great folks! The beer selection changes regularly and provides only local AND great brews you do not see in other places. Why only 4 stars? Well, the food is not great and clearly overpriced. I loved the place but I avoid to eat there regularly. This is not terrible and is still good but for this price, you can get better elsewhere ... or just at home!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e-8d1xSb2qDKgg7q7VfY-A"
  },
  "EX_ZgBMacD6LXl7iGWpvzQ": {
    "date": "11/14/2014",
    "text": "Get in here now.  IBC is a wonderful addition to squirrel hill!  The selection rotates all the time and the beer is always fresh.  The record selection is great too and the bartenders are always pleasant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OdKBhTfnPeiFH8r-RZOYxw",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Milkman Pitt City Peppermint Porter.  Great porter with subtle peppermint notes.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OdKBhTfnPeiFH8r-RZOYxw/o.jpg"
      },
      {
        "img_id": "KXerOEwtgE2lN9jhO_-Z4w",
        "caption": "Photo of Independent Brewing Company - Pittsburgh, PA, United States. Arsenal Snowbound Cinnamon Cider.  Strong cinnamon opening, nice sour finish!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KXerOEwtgE2lN9jhO_-Z4w/o.jpg"
      }
    ],
    "user_id": "f4FvdC0zuwVDLWzejZrZ1w"
  },
  "CK4R7h7ZwFKMvIag-urCtA": {
    "date": "1/19/2016",
    "text": "the cocktails are great the beer selection rotates often and so does the menu. The last few times we have eaten here for dinner the food was underwhelming and overdone or revolved around cheese. I would say it's good for bites and a single round but not much more.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "fU8qJksd9F-Sh-6ZnoNhAw"
  },
  "ynbiKEyZaW160CFcp2GXJQ": {
    "date": "6/1/2014",
    "text": "The best bar in Squirrel Hill imo and the first non-divy place in the neighborhood (nothing against dive bars really, but diversity's good). Also patrons don't smoke inside and it's nice not to stink when you exit the bar (just my personal taste - no offense, smokers).  The space is lovely, with space to stand up, a few high tables, and tables to sit smaller or larger groups. A few tables outside for warmer nights. It does not feel crowded, even when a few more people come in. It was not packed saturday evening (go there, help it thrive!), but neither was it empty. People were coming in and enjoying themselves.   Great cocktails and a wonderful list of beers, many of which (all of which?) were local.  We'll be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "LMl9Z43ZVPh5wrz4LeYd6Q"
  },
  "aKe6MTJd3TJx6p8o62aw5Q": {
    "date": "4/3/2014",
    "text": "Eh.  I had high hopes for Independent Brewing Company.  A bar that only serves local beer, has some great small bites and that is forging some great relationships in the community...  awesome.  Unfortunately, we had a mixed experience.  On a random Thursday night we decided to grab a drink after dinner at Umi, managing to catch the tail end of happy hour.  We were greeted by a pleasant bartender and the owner, both of which seemed thrilled to have the bar full and people having a decent time.  From there though, I just felt somewhat underwhelmed.  It seemed like half the drafts they had were either kicked, over-agitated (they had moved the kegs and kicked up too much yeast/sediment) or over-carbonated.  After two requests for beers on the board being turned down, I finally settled on a nitro brown and was greeted with a, \"sure thing!\"  By this point, we weren't really feeling a bar snack anymore, so we skipped on that option.  Maybe it's a symptom of catching the tail end of what seemed to be a bumping happy hour, or it's just a new business working the kinks out, but I'm willing to give it another try the next time I'm in the Squirrel Hill area.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "7aaA3Z0i7_XmjQWkamPlmQ"
  },
  "4H2Yi63ZnH-cfwx95P3SHw": {
    "date": "3/4/2014",
    "text": "A taproom serving only local craft beer is a nice concept, but it would work a lot better in a city with a better brewing scene than Pittsburgh, which has plenty of decent breweries but no real standouts. I found nothing exciting on the list when I visited, and several of the better local breweries (Full Pint, Draai Laag) were not even represented.   Don't get me wrong; IBC is a classy bar and a huge improvement over Fanattics. If you're looking for a place to discover local craft beer, you can do no better. As a hardcore beer nerd, however, I want something special if I'm going to pay upwards of $6/pint.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "vd5wfQ2L8fszYBHDPza9yw"
  },
  "ezlD_KGw3W4W0opsN7z_Ig": {
    "date": "5/29/2016",
    "text": "I've been here a handful of times and I've always had a good time. I like the ambiance: casual enough for hanging out with friends, but classy enough to have good food and drinks, or come here for a date. The waitstaff are also polite and friendly.   I visited last yesterday and ordered the bramble cocktail (gin, blackberry cordial, lemon) and the hallumi. The cocktail was delicious, but after a few sips I got the aftertaste of artificial sweetener which marred it for me. I imagine it was something in the blackberry syrup in the cordial, but I'm just guessing. The hallumi was good, and came with the perfect amount of bread so that there wasn't extra bread or cheese (which is the biggest struggle when it comes to deconstructed bread and topping/dip dishes).   I would definitely come back again. I probably wouldn't get the same cocktail, but I'd be willing to give another one a try. And they do have a decent beer selection, though there were no stouts yesterday (possibly because it's summer).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T2KRQSCZFXpj925mpNe1Hg"
  },
  "ckqCETvRknNh1aGCPjujhg": {
    "date": "11/28/2014",
    "text": "I was glad to see another non-smoking bar option in Squirrel Hill.   The beer selection, as others have mentioned, is focused on local or regional brewers. This generally means a good selection of tasty beers. I haven't seen the situation that other reviewers have mentioned in terms of running out of beers but that would seem to make sense given the above.  The food was indeed the biggest disappointment. The portions are very small, the options are limited, and I didn't find them all that great. Good, just not great. It seems like the owners are envisioning this as a beer/cocktail bar with some side to munch on while enjoying the drinks. Unfortunately for me, I was hoping for something a little different.  If they improve the food situation, this would vault into my top 3 bars in the city. Until then, I'm still very happy to have this option in Squirrel Hill.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zif8mMqckZy5FIkqCzpevg"
  },
  "0HTLwoSerk48-q9TDai1Tg": {
    "date": "5/12/2015",
    "text": "Love the atmosphere, the beer list, and the location.   The lamb burger with Indian spices is amazing! Juicy and flavorful. The macaroni and cheese entrees are very small and lacking in the flavor that you expect for the price tag.   The beer selection is never disappointing as there is something for everyone.  From delicious stouts to sweet ciders.  I highly recommend this casual and fun restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3XDzF843WAR62tBkB2Ls8w"
  },
  "h6czolAG3tZIFq1lXmETTA": {
    "date": "5/2/2015",
    "text": "I love Pittsburgh, one reason being that it doesn't have many pretentious over-priced places like this one. Beers are $6.50 and up, usually $7-$8. We ordered fries (a tiny portion) and they really weren't good but limpy and greasy, but, hey, they serve them in a cute little metal bucket so I guess it's worth it. We also had a brussle sprout appetizer which was a greasy charred mess drowned in blue cheese which was unfortunately the only spicing. Ok, 2 beers, 2 small appetizers $30! And to top it off gratuity was conveniently already added which of course most people at our table wouldn't have noticed which is what they are clearly counting on so you end up tipping double on already ridiculous prices.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jg7DwAS98SeV7jvy5E8rng"
  },
  "kWaLDQM9-SBmVeW1wvAxiQ": {
    "date": "4/4/2014",
    "text": "Met my boyfriend here for a drink on a Thursday night around 10:45 - apparently just in time for last call (BEWARE! THEY CLOSE AT 11 PM!), which I wasn't expecting!   I had an Arsenal Cider - one of my faves - but was fairly unimpressed by the lack of decor. There just really wasn't much goin' on inside - or outside. I don't think they have their outdoor signage up yet.   I know they're just starting out, so hopefully there are some fun improvements on the horizon! I'm not a big beer drinker, but their selection seemed pretty good with a varied mix of local brews.   Looking forward to going back in a few months!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "KrfFkLbWRZFpou1iOIXHHA"
  },
  "upWrMs8qD5bMKVK4Mc3-CA": {
    "date": "4/17/2016",
    "text": "We stopped here after a disappointing visit at East End Brewery down the road. We loved it here. We arrived at 3 right when it opened and within 15 minutes, the place was full, but not crowded and not a loud obnoxious atmosphere. They serve about 10 or so beers on tap from local breweries so if you are unsure of which breweries you want to try in the city, just stop here and taste a little from all of them. I had a DELICIOUS white stout from Rock Bottom which was my first white stout that I have been able to find since our honeymoon in San Fran. BrewGentleman beers are also always top notch. Very cool hangout spot and we will def. be back again. (they also looked like they can serve up a mean cocktail too but we were just there for the beer)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bs1_fWaJ4454GkB87Jo1mw"
  },
  "TXeFLWU6XUAuZnJUdsvpag": {
    "date": "2/25/2016",
    "text": "The menu online was quite different than the one in the bar when we got there. The food was okay, but nothing killer. Their beer selection was awesome and service was great. I'd go back for beer but probably not for food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JtVxBYcJohBtyR-MmbMFHw"
  },
  "H_tvYdEcwZfPeQd_cjI75w": {
    "date": "1/20/2016",
    "text": "I went there a couple days ago for a date and it was a great experience! The decor is solid and the variety of beer/cocktails was great! Brett, the bartender, made a great old fashioned and also made a couple great beer recommendations. I didn't try the food but it smelled delicious. I highly recommend it, especially if Brett is working.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "H8J0k54ILqVhQGShx96CAA"
  },
  "__sr490pDDmh2fn8OzFYcg": {
    "date": "6/10/2014",
    "text": "Not bad, not bad I must say.  No smoke anymore, plenty of place to sit, even outside.  The beer selection is great.  I really really do like the atmosphere there, and I will definitely be coming back.  As far as the food goes, we only had the fries so I can only comment on them, and they were pretty delicious, maybe nothing absolutely off the wall spectacular but delicious nonetheless.  The place was pretty crowded so I can understand the servers being slammed (it was a little slow). Huge props to the guy that walked a block to give one of us, his card back - great dedication right there.  The signature cocktails are only till 11? I'm not just sure why.  I wouldn't mind the kitchen being open a bit later.  Nonetheless, an excellent place sq. hill oh so needed. I actually have a reason to visit sq. hill now, and not smell like smoke (double yay!).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KN1MNPLVPUGsfaOssJQggg"
  },
  "eKwcc6U5dq3tPPfWij0f1w": {
    "date": "2/19/2017",
    "text": "I went here for happy hour on a Friday.  It was packed!  The beer is awesome and the snacks are pricy but tasty- definitely check out the brussel sprouts.  They save the tables for folks ordering dinner so keep that in mind!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yuSuzAo5BcJLono1klyY8w"
  },
  "Femdww4BwBFOiXMR4QC-CQ": {
    "date": "10/6/2015",
    "text": "Great selection. Excellent bartenders. They play solid albums and serve smart drinks. The beers are local, so a bit all over the place but the bartenders usually take the time to tailor their recommendations to what you like. The cocktails are where this place really shines. Witty and well executed.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Yglc3dJfBWAKf_uyTgRaCg"
  },
  "Jm-iTkmBbg71da_TQrI3Lw": {
    "date": "3/31/2016",
    "text": "Delicious. Enjoyed a local beer but was sorry I didn't try the boiler maker special. Next time. Grilled salad was very tasty. Good value for the money. Over all, very good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RwS7M7VegDbEwqzZrgptKA"
  },
  "9RBfhJtWSzGjkonmMxeeIg": {
    "date": "1/19/2016",
    "text": "We were in town from Boston and went to dinner here on Thursday night. Great local beer selection as well as fun Tiki cocktails that were on special that night. The food was great, I especially recommend the appetizers and the lamb burger, delicious. I wish we lived closer because I would definitely come here all the time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fiKJviKcDnIWaFi0gMO_Qg"
  },
  "wqjk8PCPKgJtxhkP_v0p_w": {
    "date": "2/17/2014",
    "text": "Great new spot in squirrel hill!  Loving it so far!!   Fresh beer, tasty food, awesome staff & owners. No Smoking & loved the Vinyl records playing :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hiq56qJ0uYQjYGTyMgl5XQ"
  },
  "_gqAecDkiq2ftMuR6Z_9kg": {
    "date": "11/26/2014",
    "text": "Love this new place right in my neighborhood!  I love their focus on local craft beers, so it gives me a convenient opportunity to try a lot of the new great beers from local breweries without having to travel all over town.  The servers and bartenders also are always very knowledgeable of the beer in case you have any questions.  Besides beer they also have some interesting cocktail options but I haven't tried them yet. Service is always very friendly and efficient.  When they first opened they had a very limited menu but they seemed to have expanded recently.  Their food also tends to focus on local products.  I've enjoyed several options there including their cheese plate, mac-in-cheese, and shrimp and grits (not the traditional southern kind, but it had sort of an indian or middle eastern flair to it with curry flavors, but still quite good).  It has a nice artsy atmosphere with some interesting artwork and vintage items, with seating both at the bar or tables and outdoor sidewalk seating.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "3bo1FXvQnxw2hmO0CHH4Nw"
  }
}