{
  "eBQbPbjy5WO7ds-n6nh_Ng": {
    "date": "11/24/2013",
    "text": "Wow! Placed my order - a sub and liter of coke - (1:31 p.m.); It is still not here at 3:05 p.m. The \"tracker\" said the order is on its way 30 minutes ago. I am 2 miles from their store!!!! Never again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "t-TcuG_3tNaAG0XESjpeXw"
  },
  "4Mj37puYRswi1yKl6Ov-wQ": {
    "date": "8/31/2014",
    "text": "I spoke with one of the employees for 14 minutes.   She had a really hard time taking my address.  Then the pizza was cold and tasted like balls and Jing weeds.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "zCvtp5YwKi6I8rAZpqN70w"
  },
  "9kzwjtiWwHTOCfzaPMBdLQ": {
    "date": "9/15/2014",
    "text": "Had an incredible $1.99 large one topping pizza deal but it took over two hours to get here and was cold!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DznSfAM4Vn4eSeAaKypipQ"
  },
  "cCghztMOs25Agsy0msxVEQ": {
    "date": "4/20/2015",
    "text": "NO, just no. Inedible chicken pizza. Not up to domino's low standards. Go to any other place than this.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DgkmsL1kCa1gq7UDAfRoWw"
  },
  "N6RYhIl-vZJepXsCc6u-Fg": {
    "date": "5/15/2014",
    "text": "I would give this place 0 stars if it was possible.  I placed an order at 11:52 - it said it would take 22-32 minutes to be delivered. At 1:25, the order did still had not shown up.  I called to check and the person on the phone was not only rude but hung up on me.  When I called back, they said they did not see a point in conversing any further.  I would not suggest ordering from this place.  There are plenty of other pizza places in the city with better service, better pizza, and cheaper prices.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LOtlelg50X_6_riWqehfXQ"
  },
  "2l-FUKeP1_gL5rJEoat2Ig": {
    "date": "4/11/2010",
    "text": "I have to admit the ads drew me in!  I figured I'd give them a try.  First, the website was pretty cool.  I found it easy to navigate and place my order.  When you finish ordering an \"order tracking\" screen appears.  It is supposed to indicate when your pizza is made,\" in the oven\", \"quality-checked\" (laughable) and \"out for delivery.  It even tells you your delivery guy's name (mine was \"nick\").    40 minutes after my pizza was \"out for delivery\" - still no pizza. I checked in on the tracker and to my surprise my pizza was already delivered and I was enjoying it!   Thinking someone else was enjoying my pizza, I called the store and the person on the other end assured me that contrary to what \"tracker\" told me, my pizza just left the store minutes earlier and that it would arrive piping hot.  10 minutes later, I get a call from \"padma\", aka \"nick\", telling me he is outside.  Padma/Nick was polite.  Predictably, the pizza was barely warm.  The sauce was very thick and there was a lot of it (Although, I'll take responsibility for that since the website did offer me the option of \"light\" sauce).  The cheese tasted fake, the peperoni was OK.  The crust had a lot of garlic - which I like.    Overall, the pizza was a grade or two above school cafeteria pizza.  Delivery time was terrible for a Sunday afternoon.  The website was cool but F.O.S!  I suppose the \"tracker\" is there to pacify hungry customers!    Dominos needs to go back to the lab!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "JPm0d-YAvD6kWO6xYD4dyg"
  },
  "VzM2TcT3j7Xzk5SBorRx2w": {
    "date": "11/27/2014",
    "text": "Ah, what's a guy to do when he wants pizza on Thanksgiving?  What, you say? Domino's is open? And you can order and track the pizza online? I'm in! They were (honestly) the sixth pizza place I called this afternoon when I realized that I was hungry and and the grocery wasn't even open. So they definitely get props for that. I got the two medium two toppings deal for $12. The pizzas were a bit late on arrival, but only about 10 minutes later than they estimated. They actually tasted a bit better than I thought they would (particularly after reading some abysmal reviews here). I would (and probably will) order from them again sometime.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "2oTG2GrBpikkonRxQywI7Q"
  },
  "HXy0fsTdRpxkrEdCf2OfRQ": {
    "date": "7/23/2016",
    "text": "HELP.!!!!!!!!!!.  I love pizza, and pizza loves me. HOWEVER, the app for Dominos has too many bugs. I ordered my beloved specialty buffalo chicken pizza, after 20 minutes I checked the tracking app, and it told me that there was no order to be processed/delivered. My pizza gave up on me, so I gave up on my pizza. 30 minutes later I checked my phone and had missed calls from my pizza deliverer. I missed my one True love. In short, I paid for my pizza, but the app told me I never should have received it in the first place. Can you please refund me or send me a free pizza???!!? Dominoes 5 ever but the app 5 never  HELP!!!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FNPlWXGr4ohkTjjrio1UOQ"
  },
  "jEYaodf9CA0F_3VbK0w_Qw": {
    "date": "7/18/2016",
    "text": "Look, the pizza at this place always comes out tasting great (for a Domino's pizza), but it arrives so late. They always take so long that I get anxious that my order was misdelivered or one of my enemies was waiting in the bushes and sabotaged my pizza. My orders take an average of 50 minutes to arrive, far past their suggested 30 minutes. To top it all off, they never bring it up to my door, I have to go out and walk down my driveway and get it myself.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a1qCiLY6M7qwEhmzIE7acQ"
  },
  "sxXkv6_NE3zOXd__8HmG5w": {
    "date": "6/13/2017",
    "text": "After four phone calls to the manager and four hours of waiting, our pizza finally arrived. I have never been so horrified by service before. All I did was order a medium pizza at 6 PM and one didn't show up until 10 PM. Please save yourself the time and energy and order from elsewhere. I certainly will not be ordering from here ever again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "f9x6nE4yd5Eui2Kq6a-5tw"
  },
  "aJGquacSXLI_OVxunAhzQA": {
    "date": "3/25/2017",
    "text": "I love dominos and this is my own fault but I fell asleep waiting for my pizza and yall should just leave it on the porch cause I was still hungry when I woke up and now I'm down $16. Dominos is bomb tho like definitely underrated",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GWJEDw-Biphadt4xjjDUmA"
  },
  "z-xp8YfQfrRWIseJVnpalA": {
    "date": "1/1/2016",
    "text": "Not pleased AT ALL. I received an email saying the order would be delivered in 15-20 minutes. It's 3:31am (well past the order time) and not only have I NOT received my order but the store has decided not to answer their phone. Funny thing how you'll send over a confirmation email but you won't deliver the pizza. You lost my business.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jtbc4G2bN3qb64JMNsgQzA"
  },
  "lLLG_PKUqiWa2l_qDdoHgQ": {
    "date": "4/27/2016",
    "text": "Consistently saying delivered but wrong, don't call because it won't expedite anything. The food is standard though, so if you don't care about time, then you are fine. I just can't stand that online they say delivered and it takes like 30 minutes after that.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kqdkGIOX3GsCaQm04PoRjw"
  },
  "As3FpVecm-wKIViujlwiCw": {
    "date": "7/5/2014",
    "text": "This Domino's used to be VERY VERY BAD but the pizzas and the service is alot better. I no longer try to have them deliver because the drivers from the past were always 30 mins to a hour late and I only live 8 minutes from there. Now I place my order online or on my app and the pizza is always good and ready within 10 minutes so its all good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ymvt7XIuiKvVM2ChMJu9Tw"
  },
  "EXrXTcHS-8UyEDoXRoXV-Q": {
    "date": "11/24/2015",
    "text": "This place is okay if you want inexpensive food in a moderately short time frame. But it does have its problems, one of which is rude/incompetent employees. I wouldn't suggest ordering from here frequently, but it's usually not that bad of an experience. Make sure you're clear with the directions you give them. Special instructions sometimes go ignored.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PZNJFD35ex91hk7IPo1wmQ"
  },
  "cP15KVqgW4Oi4KjKHjCH9g": {
    "date": "2/1/2017",
    "text": "rude service. cold food. disgusting. they always mess up.  we will never support any dominos again",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1WyUSJKCAaXVVZk163RaVw"
  },
  "hb-5V6uuHfwU8FVo77mB4w": {
    "date": "7/6/2015",
    "text": "Pizza took forever to arrive - again. Promised a free pizza in my phone number - again - (free pizza credit doesn't exist.) And someone awful, named Raji yelled at me when I called to check my food's progress.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sYBgfT4Qpbg8qe1-nckazQ"
  },
  "NIbcFssTO8ELEAQ7Cdypyw": {
    "date": "9/11/2015",
    "text": "First and foremost let me start by saying that I made a Yelp account so that I could write this review, that's how strongly I feel about this Dominos.   Let me set the scene for you: 1:30am I order drunk pizza for my friends and myself. I was told that it would be delivered in 30 minutes. By the time 3:00am rolls around I have no pizza, have called the store multiple times, and am ready to go to bed. Problem is they have my credit card information and I don't want to be charged for a pizza I'm not getting. The store promises that my pizza will be there in 10 minutes, that it will be 50% off, and that I will get a free pizza the next time I call. FINE. Well the guy shows up at 3:30am, pulls my pizza out of the trunk of his car (not from a warmer) and hands me a cold pizza. Whatever. I give him the money and go upstairs. Well apparently the sore didn't communicate with the driver that I was told my pizza was 50% off so he repeatedly called my cell phone and rang not only my apartment's buzzer but all of the buzzers in the apartment complex at 3:00am. He then proceeded to continually honk his horn on the street. As a young woman, I felt very unsafe.   The next day I called the store, was promised my entire order for free the next time I call, and was apologized too. I was annoyed but felt better about the store's attempt to rectify the situation.   When the day came for me to cash in my free pizzas, I called the store, the gentleman asked for my phone number associated with the order, and then claimed to have no record of my phone number. Ever. Harassment incident by the delivery driver aside, I have ordered drunk pizza from this Dominos enough times that there is no way they don't have a record of my phone number being associated with any order.   I will never, ever order pizza from this Dominos or any Dominos ever again.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uadYbCd9Mh7rcwis1Adeiw"
  },
  "KL6Amx5dLB7oonzvAt3a7A": {
    "date": "8/22/2014",
    "text": "The Manager refused to correct my order and said it was my fault in a rude tone after a computer glitch from ordering online. They have the worst costumer service. Would not recommend to anyone, However the driver was nice and professional he should be running the store.  Update:  I moved this review from a one star to a three star because an hour later they brought me a new pizza, so I truly appreciate the service. I just wished he would believed me before I had to scrape the cheese off the first pizza.   Will order again over phone but maybe not online for a while!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "iNMOOxmB6uPO4WrTfQBJng"
  },
  "tmMiXe5uS8aIlI_rA_Tpsw": {
    "date": "9/20/2014",
    "text": "Ordered 2 medium pizzas for $5.99/each at 1 am on a Saturday night. Got my pies within 30 mins. Fast, cheap, decent quality; would buy again.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "YSsOxlllNb8dP-vmXb_OIQ"
  },
  "wb_VrjBHy87HwP3JHlO7Sg": {
    "date": "3/16/2014",
    "text": "Worst place ever I ordered my food in there was a bug melted into my cheese . Then they asked me if I wanted another pizza HELL NO service was rude n food SUCKS",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "M3p6gn50ghJLNwTDwDtr7Q"
  },
  "roj8yp6j7LKssrHRDQQqxw": {
    "date": "7/12/2015",
    "text": "Off the bat, I would give them 0 stars if it were possible.  I had ordered a medium pepperoni and a 2 liter at 1:13 a.m. thru grub hub. Got a confirmation of delivery between 2:45-3:00. Thought that was odd considering it was a Wednesday and couldn't be that busy.       3 a.m. came and went. Called dominoes and they said they had not received my order.  Grubhub did, why didn't they??  Was going to forget the whole thing but, through his very bad english, I had thought he said he'd give me a cheese pizza as well as my order. A freebee, cool.    He had gotten here around 4 A.m. and went to the door. I knew order was messed up right away.   No 2 liter and there was a box on top of the pizza box.  Looked thru it. Not only no 2 liter, but gave me a plain pizza and some Chix nuggets.  He then said $15.36.  Heck no I was not paying for this. We went back n forth for a minute or so until I got fed up, grabbed the food and shut the door on him, without paying.      The pizza was lukewarm and clearly a leftover pizza from the store, due to the color n texture of the cheese. Reheated a minimum of 2x's.  Forced down 3 slices and had to throw away. Same as the nuggets.  Never again and will be letting corporate know the unprofessional ism of this chain store!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mS7wtPVBVf8_eTG2rO8hxw"
  },
  "QvsB2wz-SCG9Xhoct6DLqg": {
    "date": "1/6/2012",
    "text": "Dominos is like a roller coaster.  Sometimes very enjoyable, sometimes a long wait, and sometimes you puke at the end.    10 years ago, Dominos Pizza was disgusting.  In the past few years, they dramatically improved their pizza.  I have been amazed at some of the pizza I've had from Dominos at other locations.  Unfortunately, the pizza I got from this location was sub-par for current-day Domino Pizza standards (still way better than 10 years ago).  Delivery was very prompt.  This is pretty impressive considering the reason I was ordering pizza for delivery was because I thought the roads were too sketchy for me to go and drive on.  The thin-crust pizza, while normally very crispy and full of flavor, was a little soft and dull.  I still have hope though.  Dominos still has a relatively high \"good\" pizza percentage as a corporation.  Hopefully this pizza was just a fluke from this location.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "eNUttpTjk6Q5TlSAYV-kMg"
  },
  "FC9oR9kxx9a0dGAundY3Kg": {
    "date": "12/23/2013",
    "text": "i placed an online order this morning at 10:42am. after placing the order I received a confirmation that my order would be ready in 20-30 minutes. According to the pizza tracker the order was in the \"quality check\" stage for 20 minutes before being out for delivery.  At 11:16 my order was marked as \"out for delivery\" I did not receive the pizza until 11:50 (35 minutes later!!)  Altogether the process took over an hour and i am lead to believe (according to the tracker) that the pizza was out of the oven for 40 minutes before it got to me. The pizza was decent and the driver was polite but the wait time is absolutely ridiculous! i would not recommend to anyone. next time ill pay the extra few bucks and go to pizza hut.  only gave them 2 stars instead of 1 because the pizza was decent. definitely not worth the wait.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "0W1ofOgdPUMIaHXY2CEi5A"
  },
  "CbKCARU8HrGgsZZuBINZxQ": {
    "date": "1/21/2015",
    "text": "AVOID!   The management and workers are so rude and incompetent. I ordered my food at 7:54 and it got to me at 9:32. I called 5 times and they were rude each time and seemed like they did not care at all.  The delivery driver claimed he had called me and I did not answer so he left. Unfortunately that is far from the truth bc I had the pleasure of speaking to him and getting hung up on. I tried to call him back 5 times and my call got ignored each time. I called the place again and they told me I did not answer my phone or come out when he was there. I sat outside for 25 minutes in the snow just to prove I was outside. While on the phone with them the driver called in to say he was here but this time since I was waiting outside I could confirm he was not there. I received no type of apology after being blamed for not being outside or opening the door. Eventually I had to walk and meet him at the end of my street because he was not able or lazy. I called back because obviously after an hour my pizza was cold and after offering me a credit (which means i have to order from this shit hole  again)  and before hanging up the person on the other line slipped in \" make sure you answer your phone next time.\" They are so rude and unprofessional. When I decide to use my credit i will go there and order when I get there, so I can watch them make it. This way they cant spit in my food, which seems like the type of people they are.  Go to the dominos in south side!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yO2wEKql-HTvTMZJVnKJ2w"
  },
  "EbDDGijQQG9pvQKZ5iQuFw": {
    "date": "5/21/2016",
    "text": "This is the 2 time that the charges for the order exceed the advertised price by greater than 10%.  Fair warning to all who order here.  Price padding seems to be a common mistake.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MBDkJvmQKYAXevS9dw7Xsw"
  },
  "UA0FiyeaWzXmg59vtIlxJQ": {
    "date": "7/2/2016",
    "text": "This place is pure garbage. Shit staff, shit pizza, takes 2 hours to deliver 5 minutes away.  Fuck Domino's.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "yhyHXFUOtEDUOhYTqf-xUw"
  },
  "UtCYYy-hXGSNXrVn1bNW0w": {
    "date": "12/17/2018",
    "text": "This is legit the worse pizza joint in Pittsburgh Pennsylvania. I ordered a SMALL pepperoni pizza at 4:50pm on a Monday and the guy said it would be here in 45 minutes. Cool. (Not even going to mention the fact that this guy didn't understand what I was saying and I had to call back on 3 different phones before he could understand me slightly)... my friend called me to confirm it wasn't my phone and she heard me fine. Okay so it was 6pm and over an hour so I called for a delivery status... the guy said it's our for delivery now. That was at 6PM. 6pm. So it was 6:30pm now and no SMALL pepperoni pizza still so I called back. I gave my number and none of them could find my order so they created me a new one and said it would be here in 20 minutes. Fair enough. So 7:15, a nice guy shows up with my pizza. I give me the money (because yes, 2 hours late and several phone calls later, they still made me pay), I get inside and open the boy and it's the wrong pizza. How do you mix up a pepperoni pizza and give me a garlic parm with sausage and muchrooms instead? Long story short, I'm starving at work, $15 broker, and no pizza. Don't go here. Legit come to my house and I'll cook you a pizza that's 10 times better and faster for half the price",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gA0rVTath-HCKmT2X8OL1w"
  },
  "a8X04bZROwU4ZG7d00uFqA": {
    "date": "7/1/2015",
    "text": "This location always runs a terrific pick up special...  Friendly and efficient service, busy location, great menu items, and budget friendly good food.   This location is really a delivery or take out location. They have no seating just a small waiting area.   Otherwise, great pizza place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ueutKtIYlc6FDxb1IbqdQ"
  },
  "dT9ZjdnfmEgm2xCamv0jXg": {
    "date": "8/12/2017",
    "text": "Literally never ever on time. The food is the same as any dominos pizza, the staff is polite, but the tracker always says it's been delivered and then my food shows up a half hour after that. If they were honest about their time, I know that dominos corporate would not be happy (because I worked at one) but I would be happier with a late delivery if I wasn't seeing that it was delivered a half hour before the driver even leaves the store.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "iMwbO1M03a2SR36sLMsttg"
  },
  "cxS3vdimRosRiZP_7ytLSA": {
    "date": "4/22/2016",
    "text": "Big mistake. I had a lapse in judgement. I never eat here but I'm sick with the flu and had a coupon. They sent me the wrong order and when I called they hung up on me.   I didn't think I could feel worse while being this sick but this food made me forget my illness as I could only focus on how bad it was. Had one slice because I'm literally dieing from this flu and couldn't eat any more.   This is the most intense grease bomb I have ever seen. Each slice is dripping in oil. The entire box is soaked through. I probably would have felt better eating the box. The crust isn't bread but grease held together by just enough flour to keep it solid.   To all of you who order Dominos once a year and are on yelp to consider it because of a good deal or the late night delivery, DON'T DO IT. You will feel so much shame and regret and will swear off dominos until the same time next year when your memory of this horrible day has faded.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "YMlcRrH3o8aG_gbo28b69A",
        "caption": "Photo of Domino's Pizza - Pittsburgh, PA, United States. haha who would even send this?",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YMlcRrH3o8aG_gbo28b69A/o.jpg"
      }
    ],
    "user_id": "7qVz4pG4efGiFLU978RL5g"
  },
  "NCHU6dZhnadInuydiCVoiA": {
    "date": "4/13/2017",
    "text": "the pizza tracker is literally always wrong. im not sure who is responsible for marking my pizzas as prematurely delivered, but its pretty annoying.  otherwise, good stuff",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q__V7XbYVUBh3yCgFB-teA"
  },
  "PDXxNk45NadhX1qQHyz1SA": {
    "date": "12/11/2016",
    "text": "1 mile from the store and takes 1.5 hours to come. Pizza arrived cold, like cardboard and was reheated. The thermal order paper on it had turned black due to the heat, thus was a giveaway.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "62Iyl1t9NdCUbduTwvv2Hg"
  },
  "hjFR1qLq8JyxsvuwbDacAA": {
    "date": "5/3/2017",
    "text": "I was very disappointed. The food came two hours after I ordered two appetizers. The breadstick nuggets were hollow and burnt.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MFvsyVPWZk5Hc-zjQGvyfQ"
  },
  "JhZTPx1Ru6GooLCIubQecA": {
    "date": "12/16/2015",
    "text": "Gluten-free Crust If you're looking for a gluten-free pizza option, definitely give Dominos a try! We were pleasantly surprised with the crispy crust. It had a nice flavor and did not get soggy or mushy after a minutes on the table.   Toppings We ordered the first sauce on the list which was \"robust\" something. It was spicy in a weird way. We didn't like it. Also, I ordered spinach and olives. Although I saw a typical amount of olives, the spinach was scarce.  Note: This location does NOT deliver to Squirrel Hill. However, order and pickup were easy. We used the Dominos app, and we got exactly what we ordered, and it was ready in 10-15 minutes. Another great benefit of the app is the wide selection of coupon codes. There's literally a section of the app that is just a list of all the specials going on. Whoo hoo!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rpK40ZN2rNFJLhfdlQqS-Q"
  },
  "5cKBAxRJkAL2-dW17sRPuQ": {
    "date": "11/30/2016",
    "text": "Waited two hours for one pizza and breadsticks. Never came. Place will not even pick up their phone. Disgraceful service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "1sdUcTIpr3ocoULNDNstNg"
  },
  "WtDUu6qAvVgMjhOYLHUBTQ": {
    "date": "1/7/2018",
    "text": "I placed an order online at 10am (they don't open until 1030) since i had a meeting and wanted to have pizza for lunch.  I requested delivery to be 1145am. At 1215, I thought I would call to see if the order was going to be delivered soon.  The person who answered the phone was extremely rude.  He told me that delivery would take another hour. That meant 1245pm.... (Side note,  when I ordered I requested a call if they didn't think they could deliver on time. If course there was no call so I thought everything would be fine. )  my meeting was going to be over at 1pm, so I really wanted to feed these people beforehand.   The confusing pay wad that The online tracking said The food was out for delivery.... Ughhh.   Well in about 20 minutes the delivery guy finally called to say he couldn't find the address.  Needless to say, I placed this order online with the proper address,  not sure how that could be messed up but it happened.  Overall experience was not pleasant!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "txGCZr12kYBFfmvuQtHZ7A"
  },
  "9RX9eEhNWebDW4OU3TazJg": {
    "date": "10/23/2015",
    "text": "Ordered on EatStreet, had the option to upgrade my Large to a Deep Dish so I did. Got it and it was just a hand tossed, called the store and they said they don't do large deep dish and they are apparently aware of the issue that it allows you to order them yet they do nothing about it and just keep giving people pizzas that are cheaper than the one they ordered and doing nothing to rectify the problem or recompense the customers they are ripping off.Your review helps others learn about great local businesses.  Please don't review this business if you received a freebie for writing this review, or if you're connected in any way to the owner or employees.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "mqf5Tw12vnr7edPWLKCUKA"
  },
  "a_asWhYQ9dYyywOx-nKuRA": {
    "date": "12/19/2016",
    "text": "Websters Dictionary defines pizza as  a dish of Italian origin consisting of a flat, round base of dough baked with a topping of tomato sauce and cheese, typically with added meat or vegetables. Well this isnt pizza this is shit. Shit is defined as feaces. Pretty safe to say shit is a closer definition to describe this horrifically putrid disgrace to america. i rather kill my first born son roast him in the pits of hell's firey oven and eat him, while sniffing satan's un-wiped ass, then even catch the slightest whiff of a dominos shitzza",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TlTbzQFCi5QOTugTLv7I1w"
  },
  "b_XVw5JoJyflSUlMA1k9zQ": {
    "date": "5/6/2015",
    "text": "I hadn't ordered Domino's in quite a while and I saw an ad on TV about how they improved the pizza.  They had a mix and match $5.99 and thought I'd give it a try.   I ordered 8 hot and spicy wings, an pasta carbonara, and a medium pizza.  The pasta carbonara was better than the pasta at Pizza Hut.  I ordered it w/ extra sauce and there was no extra sauce, there was actually no sauce because it had been baked/broiled in an oven and the liquid either baked off or was absorbed by the pasta, it had a gluey consistency.  I would rate it one and a half stars and it was the \"best\" dish.  The wings were not spicy and they were undercooked and rubbery.  They were also the smallest wings I've ever seen (maybe hummingbird wings?).  I ate part of two of them and threw the rest away.  The pizza was cold and undercooked.  Heating it up made it taste worse.  I ate part of a slice and threw the rest away.  In the \"special delivery instructions\" I asked the driver to buzz my intercom and I'd meet him at the door.  Instead my phone rang and went I got to the front door, he was parked across the street.  He just sat there in the driver's seat and after a few minutes it was apparent he wasn't going to cross the street and meet me at the building, so I had to go to him.  Minor and nit picky, I know, but I was tired and hungry and I paid for delivery, but I guess not to my door.  All the major chain pizza is not great, but this is the worst I've had.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "4pRehidpIXTZsTK3sBrUeQ"
  },
  "Wt75r1pYXvSj_56ws7pwIw": {
    "date": "4/6/2017",
    "text": "I wonder if the workers here can actually read. I order from here quite a bit, despite my disappointment. I suppose that's my own fault. Let it be known: if you order from here and want a dipping sauce of some sort with your cheesy bread, wings, what have you... you're probably not going to get it. Going on four fucking times now.   Edit: called them back after the delivery order, and there was barely any flexibility from management.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ppvq-ZYD73ciwefK2eL8NQ"
  },
  "vSQPeI3HQZwAeq93APdMZg": {
    "date": "2/3/2015",
    "text": "If there was a way to give ZERO stars I would.  Ordered from here twice.  The first time the driver took over 1 hour and 30 mins on a late nite delivery when I live 8 minutes away.  NO CALL what so ever! I took that as to never order from them again.    My roommate ordered from there tonight and HE had to call after 2 hours of no food or phone call.  The online order even said it was delivered!  As he called they apologized and said they've been 'backed up'...on a Tuesday....we could have walked to the closest grocery store, bought the raw ingredients, stopped for a beer, came back, preheated the oven and made our own before this Dominos was delivered.   After the apology (with no offer for a discount) they told my roommate the driver should be there soon.  He wasn't..my roommate then took another 20 mins deciding where else he should order, placed it and then called back to cancel the Dominos order.  EXTREMELY rude and careless and not only that tried to blame my roommate that he did not answer his phone when \"they called twice and were outside\"...we have a big window in the front of our house..no car was ever there.    I don't understand how they keep this business running.  Save your frustration and go with one of the local pizza shops.  Plus way better quality food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "v05Gm3lJTZhZ5L4E3MWr4g"
  },
  "j6b3bu5hxsbsv67KG4UG6w": {
    "date": "10/28/2017",
    "text": "Deliver hilariously late. Tracker said that the pizza had been delivered 45 minutes before I actually got it (waited for like 1.5 hours total). Don't order delivery from here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TH9xshxCmTeg-tZY-QgeDA"
  },
  "vVCv3Pe_Ty8SACVwzRvzTQ": {
    "date": "3/21/2017",
    "text": "Great customer service when ever I carry out from this location! Pizza tasted great and was to my order. Small but clean pick up area. Will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hzTEMRcKRCkvSHIH77Mv0Q"
  },
  "yeh1fPuOgNZkxvDxgwxlxA": {
    "date": "3/1/2015",
    "text": "The first time we ordered from here we ordered 2 cheese pizzas with a side of garlic butter. It took them over an hour and a half to deliver the pizza. By the time we received them they were cold and they forgot our garlic butter. Plus the cheese pizza was a little burnt.  That was over a year ago so we decided to try it again. We ordered 2 cheese pizzas and cheese bread with a side of garlic butter and marinara. It took them an hour and 15 minutes to deliver the items. The pizza was not up to other domino pizzas we've had, there's was hardly any garlic on the crust. Also they forgot both the dipping sauces we paid for. We called the first time and they told us they could give us store credit and then they hung up on us. I called back and said that we would like the dipping sauces now because we're not ordering again so we will not be using the credit. They said they would get the sauces to us in 25 minutes, she apologized once and then hung up the phone. We never received the sauces, never ordering from this location again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "vrB2Ae6-fX0ZRBx7HBIskQ"
  },
  "QoWLNxzX_EfwGOx2HzpLKA": {
    "date": "8/23/2016",
    "text": "For a chain restaurant this pizza is adequate. A 75 minute wait time for delivery is unacceptable. Pizza was almost black on the bottom and the breadsticks were horrible. I will not order from them again",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rBxmO-GhJdwfGd_0lRKRkQ"
  },
  "NwWsXll73vKmAO48W-1ftg": {
    "date": "6/15/2019",
    "text": "Omg the food delivery within a nice amount of time food is always very hot ( good thing) and ready to eat. And ommmmggg there is this cute worker who always drops off my pizza might ask him out  but seriously my favorite dominos",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UWXHB_pM5Q_lP-xddn-FVA"
  },
  "7UATK-3hNspzE5lLyiwiGg": {
    "date": "3/12/2019",
    "text": "I order Domino's like once every 3 years. When that 3 year mark comes around and I make the mistake to try them again I've always regretted it.  Ordered 1 pizza after 11am. Estimated arrival was 20-30 minutes. Took 2 hours, ignorant on phone. Ignorant driver, ice cold pizza (not even warm). All of these Pittsburgh Domino's are rated garbage. All owned by idiots that could give a da*n about the customer. If you complain to corporate they just say sorry we don't own them, the restaurant will contact you. (they never do).  9 years of crap reviews. They must give out business degrees free in Saudi Arabia.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mkIt8BaYxqGGhaVHt6BxQA"
  },
  "TJQ1yWtX8FgTBCTTlU2lLA": {
    "date": "8/25/2019",
    "text": "I make my order via the Dominos app, painless. 30-35 min later, I was notified the driver left the store with our dinner, a store which is barely 2 miles from my hotel. Fast forward 30 some-odd minutes, nothing. I call to check on the status, apparently the driver had either just left or was leaving. I told the employee, if that's the case, I'd like to just cancel the order and receive a refund. He puts me on hold, comes back on and tells me the driver is 5 min away (just about what maps saids the drive is). I reiterated that I'd like to just cancel the order, that I'd go downstairs and get something. He cuts me off mid-sentence, says a refund will take a couple days then hangs up on me.  I wouldn't recommend spending your money at this location.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A40oJtmy0ZvPOtoEpnj4jg"
  },
  "WaJ3sqIKaxcj8hO5uGoiUQ": {
    "date": "5/9/2018",
    "text": "We called in for an ETA of 35 mins. It has been over an hour. We called to check and was informed that the driver was coming straight to us, but it has again been over 20 mins. I am very disappointed in Domino's service.  Have been staring out the window for a while now..",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cS4os_6u9sqVaKH7k9-7HA",
        "caption": "Photo of Domino's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cS4os_6u9sqVaKH7k9-7HA/o.jpg"
      }
    ],
    "user_id": "6l1uYFkhg83oZeut1NQWdg"
  },
  "5HJHCMBYkP3f_QZjXmYPvg": {
    "date": "1/10/2019",
    "text": "I was craving a thin crispy crust pizza. I thought Domino's would be a good choice for quick food. Wrong. This pizza took an hour and a half to be delivered at 6:30 on a Thursday. Then the food came it was warm at best. There was no crunch to the crust, no flavor, absolutely worst pizza.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QNzALAcmmoT-liKG3vZkqA",
        "caption": "Photo of Domino's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QNzALAcmmoT-liKG3vZkqA/o.jpg"
      },
      {
        "img_id": "XFPuqc8fSIweQH15MZoUpA",
        "caption": "Photo of Domino's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XFPuqc8fSIweQH15MZoUpA/o.jpg"
      }
    ],
    "user_id": "lx9Jmu-TO-9wybzSGP42MA"
  },
  "TK4uS2z0z-6NUTijtj-AVw": {
    "date": "6/5/2019",
    "text": "This was the closest thing open that delivered by my hotel so I gave it a shot. It took two hours to get my wings and pizza. TWO HOURS! Let's be real, Domino's is the McDonalds of pizza, it is what it is and you have low expectations going in but two hours to deliver cold pizza and wings is just unacceptable. The best part was trying to communicate with the driver who barely spoke a lick of English. Needless to say this location is not an option, ever.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c2leFYAnxelhoc8LhNaK_g"
  },
  "cfgh8DnKXPf1LGHlUgm4eQ": {
    "date": "1/26/2019",
    "text": "I ordered my pizza online and that's the only way I could recommend ordering. My pizza was made quickly; just 10 minutes after ordering. When I got there the phone was ringing off the hook and everyone was making the pizza. After a few minutes someone asked about my order. They had to ask my name twice to find it. At this point there was a line of 5 people behind me and the phone was still not answered. My order was correct though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9XbTAoX0ZX2rjDwZxGJqKw"
  },
  "_VPd_qyAR8mnpKRUIUCd-A": {
    "date": "10/27/2018",
    "text": "As college students looking for a late night meal, friends and I ordered a buffalo chicken on hand-tossed crust and a bbq chicken on thin crust. I was very excited because their online delivery ordering is easy, convenient, and very usual friendly.  When the pizzas arrived 45 minutes after leaving the store, they were cold and unimpressive. The cheese on the buffalo was not fully melted. The thin crust on bbq chicken was pretty unappetizing. The crust was super flaky and was more cracker-like. It had a distinct cardboard flavor.  Earns a single star for their phenomenal website. I wish the individual store would put that effort into their operations and cooking as well.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WLcxvSuumq64GvHr7zF2CQ",
        "caption": "Photo of Domino's Pizza - Pittsburgh, PA, United States. Cheese was only 3/4 of the way melted. Arrived pretty cold and had to put it in the oven myself at home.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WLcxvSuumq64GvHr7zF2CQ/o.jpg"
      }
    ],
    "user_id": "4rGCGP1Qwg61fAqpdWK-vg"
  },
  "51pr2qkessKZKl62MHiPRQ": {
    "date": "6/3/2018",
    "text": "It's great because there open late and after reading the reviews we figured we better pick it up instead of having it delivered. We were in an out in a few minutes and decided to also buy the lava cake desert. It was really good but very sweet definitely a sugar rush. The pizza was alright but it taste alot better eaten hot than cold because we picked it up by the time we got home it was lukewarm.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "kw5ifNNm8YREu1hbsqv8Zg",
        "caption": "Photo of Domino's Pizza - Pittsburgh, PA, United States. Our order was correct",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kw5ifNNm8YREu1hbsqv8Zg/o.jpg"
      },
      {
        "img_id": "yDGxVGnIVUsX0c2QY2H1jA",
        "caption": "Photo of Domino's Pizza - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yDGxVGnIVUsX0c2QY2H1jA/o.jpg"
      }
    ],
    "user_id": "3xBFFH866WoySDG7uuwBSQ"
  },
  "tTzEx4XZPlqScb2v5kJDGw": {
    "date": "2/21/2019",
    "text": "Every time I order from this dominos I end up waiting for like an hour and a half at least, while the app will say it was \"delivered\" after 30 mins. I'm done making the mistake of ordering from this dominos, and you shouldn't bother either.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2yDJ6cTQunxonJPzL0NkEg"
  },
  "9kocxRiG9aFkLZ04N8FXWA": {
    "date": "12/10/2018",
    "text": "This might actually be one of the worst Domino's Pizza in the city. The food was pretty average, if not below their typical subpar quality; however, the service was absolutely atrocious. My order came roughly an hour and a half after I placed it. After waiting nearly 100 minutes, it was no surprise that the food arrived cold. Prior to it coming, I called the store to inquire about their average delivery time, but nobody answered the first time and I was hung up on the second two tries. Save yourself the money and frustration by going to a local pizzeria with friendly workers and delicious food.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GE7wLQ5sryR1jOCtAE2xWQ"
  },
  "T37Oox2Elsh2W7D0Ri2z1w": {
    "date": "12/12/2018",
    "text": "Order for delivery takes over an hour on a good day. Order from your local pizza chain or Pizza Hut who always delivery within the hour.  Below is the only tip I want to give: Provide decent service if you want tips.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AnwBja-lhfKP51McXjKA8w"
  },
  "V0CSfo6a0vI3dsS2JtpdeA": {
    "date": "10/20/2018",
    "text": "I ordered pepperoni, onion and green peppers, and got pepperoni and a sprinkle of onions and green peppers. Sloppy work",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9mLQrZfub2nOK0w3aWdfXQ"
  },
  "hN1zU9ZJIHj9AkGRhriaKQ": {
    "date": "10/19/2018",
    "text": "I live close to this location and I will never order from them again. I've gave them several chances and each time it's worse and worse. Takes easily over a hour and a half and the delivery is over 1/2 that time so when you get your food it's barely warm. I called to check last time because it said 30-40 minute range and it was going on an hour and a half and whoever answered the phone had a terrible attitude and hung up on me. I realize it is the McDonald's of the pizza world but the only thing not garbage is you can order from the app.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nolFVHf5hz-ZS3wm3vqmcA"
  },
  "FgSF_nzRT_zRL8qfjcd8pg": {
    "date": "1/13/2019",
    "text": "Worst domino's I have ever ordered from. Usually delivery times from this location are well over an hour, but my most recent order was not delivered in over 2 hours, at which point I had to leave the house. When I called the store to inquire about the location of the driver/order, the employee I spoke to was rude and told me that 'I am not the only person who ordered food to be delivered'. Will never order from this location (or likely any dominos) again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0wrhNEZnS7_ZG9jfJK4hJg"
  },
  "lnpuA99ZXAeyvg94eKiI3g": {
    "date": "2/14/2018",
    "text": "Everytime I order from here it's the worst service. The food come LATE as hell, 2 hours and the order is wrong. And the guy who answers the phones is rude as hell. If it's late and everything is closed but this place your better off starving",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "RBS0oMjH94-rLpBsH6bDPA"
  },
  "YUpFKrwadjEq18rFRG__VQ": {
    "date": "12/13/2017",
    "text": "I have given the employees at this location the benefit of the doubt numerous times. However the same exact problems continue to occur each time. The pizza tracker is never right, the delivery time takes 65-90 minutes to reach my location, they always mess up something on my order, and my pizza is always cold when it arrives. The drivers appear lethargic most of the time and never seem fazed for being late or forgetting something on my order. I would give this place zero stars if I could.   The last time I ordered from them they made the wrong pizza, took two hours to deliver it, and the driver did not care at all. I gave this place a chance for a full year but they have completely lost my business.   Save yourself the hassle and order somewhere else.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "rTvOIjtGbZfM1g-sCA3igg"
  },
  "z64RUY70CcU7ywHWplvIGg": {
    "date": "11/18/2017",
    "text": "Even in your most wild dreams of possible turnarounds, DO NOT THINK this place will deliver in a reasonable time with hot (or warm) food. Hear me: DO NOT ORDER FROM HERE... Oh you did? Let me guess... You wull fret and call and check the fake tracker and then you dinally call and rhey say its on the way and the 40 more minutes pass and  then you call and will try and cancel and they will LIE and tell you the driver is right outside and you have to pay... DON'T. Get your refund and NEVER ORDER FROM HERE AGAIN. TRUST. DON'T. Oy.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "5iTdaHwTbms9D-Th3DNweQ"
  },
  "_ynzneDwHZxQz74WoOguaw": {
    "date": "8/14/2018",
    "text": "Just purchased Domino's Chicken Alfredo pasta $10.69. Worst pasta I have ever had.  What a rip-off.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gkoXngbnbmzxKI5S2-LGIA"
  },
  "Zk603XMRsRN7WSdQspWk6w": {
    "date": "7/4/2018",
    "text": "The food is good but the service is ridiculous. in the past 6 months, today is the third time out four that they have sent me an incomplete order. Every single time they forget to send me the dipping sauce with the cheesy bread. By the time they send it back, the bread gets cold and the cheese tastes different. I've had guests over at 2 of the 3 occasions and it gets embarrassing.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YuasjDsNY3VKfPZM0TgnWg"
  }
}