{
  "MFTdmM0jdYKHYgiTlC3qkA": {
    "date": "1/10/2012",
    "text": "My friend and I decided to try this place ever since it opened and we finally did. It was a major disappointment.  I originally decided to give this place one star which I've never done on any other restaurants, however, I changed my mind to 1.5 and rounded up to 2-star thinking I might was being a little too harsh on it.  I had a salad which I do not remember the name of but it sucked... Looking out the window and seeing Panera across the street, I couldn't help but only comparing these 2 places.  My friend ordered some kind of pan-fried noodle and it was pan-burnt.  I will never go back to this place to eat.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UFKm0aqCsjiRQhx8ilIa0A"
  },
  "8DtLd0PAE-2ZM2cbpRE9Wg": {
    "date": "3/7/2013",
    "text": "I love everything about this noodle place and wish more franchises would open. So you can choose your own pasta (whole wheat, regular and dozens of shapes), sauce, and protein.  Its basically a quick fancy meal that is made the way you like it and most importantly, FRESH.  I loved the steak stroganoff, mac n cheese with pulled pork, and pad thai.  Will be back for more!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sizkZALG8OJH5JUZL9Abqg"
  },
  "3n1FQU5hcie08KXyP7JHJA": {
    "date": "1/4/2012",
    "text": "Noodles & Company is a chain restaurant, yes, but as far as I'm concerned it's a welcome addition to the available array of Oakland eateries.  It's kind of like Chipotle for noodles--you pick from a menu that has menu noodle dishes that fall into American, Asian, or Mediterranean categories.  I have tried a couple different things here and so far everything has been pretty good.  The Penne Rosa is definitely my favorite!  The only downside is that the restaurant is ALWAYS packed and pretty loud--but things move quickly, even so.  If you're in Oakland and feel like you've tried everything around, stop here.  You won't be sorry!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "TkFcPIHDPx43OqnqZ_ElPQ"
  },
  "80RZFwhArmhFzl6Eu56uyg": {
    "date": "2/22/2015",
    "text": "Nice spacious place with friendly workers. The portions are pretty good as are the flavors. I've heard mixed reviews about their pad thai and I've had a lot of pad thai from different places and I have to say, I was pretty satisfied with their pad thai. I can't wait to try their mac and cheese with buffalo chicken!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vaLlOKH-f_XNmtIcrYo6kA"
  },
  "1hVLhB-tiRrh0Lpz8LoDgQ": {
    "date": "8/26/2012",
    "text": "They have good noodle dishes, the price is just a bit high. I prefer Lulu's Noodles on Craig street (better food and prices and more choices). Gets really crowded at lunch.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "no-rv9pUWRJ750HjugnoGA"
  },
  "sCS9iDEbMKy-XufuE7ETDQ": {
    "date": "10/9/2012",
    "text": "I dig this place. I, too, have had the Pan Fried Noodles and Truffle Mac, and liked both a lot. I liked that this place had so many vegetarian options. The unsweetened, fresh-brewed, flavored iced tea was also more than worth it! The service is a nice combination of being served the food without being constantly checked on.  They also make very good cookies. Good cookies are important.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u6WE_x626TiEt3o2cUE8JA"
  },
  "ZLctDIRDa4XuvBMWz6wBJQ": {
    "date": "7/3/2012",
    "text": "Have to make it brief cause I'm not wasting my time on this.. went to enjoy the Pgh Regatta w/ friend and her 2 daughters. Decided on dinner here. Ordered meatball sub n ceasear salad. Lets just say the pretzel at the vendors was more appealing. First off, 95 out and felt like a/c wasn't even on,. Meatballs clearly were under a warmer for quite a long time. Had one bite and that was it. Asked my company how their \"food\" was and basically said \"adequate\". Was the downtown shithole.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mS7wtPVBVf8_eTG2rO8hxw"
  },
  "D79xAqMoaKMkCyQCD9IiTA": {
    "date": "1/30/2012",
    "text": "eOn my first visit I tried the Japanese pan noodles with shrimp and made it a triple combo with a small bowl of the thai curry soup.    The thai curry soup was actually quite delicious with pieces of spinach, mushrooms and carrots but the noodles were a little undercooked making them hard and almost unpalatable.  The pan noodle in the small portion is quite small and the sauce was good (super salty!!) but but the noodles were on the dry side.  The shrimp were a little gross, they weren't fresh and had the weird taste that cheap frozen shrimp have.  There were about 6 small shrimp in the dish.   On my second visit I ordered the pad thai and was completely disappointed.  There were barely any pieces of egg and what was in the dish were dried precooked pieces of egg that were thrown in when the dish was assembled.    This place is unique in that it offers many different types of pasta and noodle dishes but it is far from authentic when it comes to the Asian choices from what I've tried so far.  The novelty of this place has caught Oakand's attention as this place is constantly busy and always has a line during peak times.  It is convenient and relatively fast and the prices are on par with the panera across the street.  But I highly recommend that Pitt students and others take their money to the numerous small businesses in Oakland.  Noodles & Company is a chain that tries to grasp authenticity but never quite makes it there.  I suggest Lulu's noodles on Craig street for pad thai, their scrambled eggs for the pad thai are made to order and not scant in quantity like in N&C's meager and almost pitiful dish.    I looked on their website and they do offer a free meal to people who sign up for their email list on their birthday, I signed up as my birthday is in a few days.  I find that I will probably frequent this place more than I honestly wish to.  I gave this chain three stars for the convenience, speed and overall package of this place; at least its not another mcdonalds.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zAzCOnCSS1DiceIWXKQQWw"
  },
  "XJh_DzC1BEEChcfNLGOSUQ": {
    "date": "10/3/2014",
    "text": "We had three fine meals here recently and I was happy to see restaurant nice and clean and music was set at a reasonable volume.  Much better than past visit here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "--7gZYIAVGCaPT4k0qbbrw"
  },
  "lC2L_JvmwwuD72aHgCMIow": {
    "date": "1/16/2012",
    "text": "After a long weekend of traveling, I was treated to a meal at Noodles & Company. Upon inspection of their menu, I was surprised to see that there were not a lot of soup based noodles but finally settled on the Japanese pan noodle dish. It came out quickly and was delicious, especially after adding some saracha. My only con about the dish was that the sprouts were not cooked but placed on top raw. The kitchen is in back of the cashiers which is nice so you can kind of see what is happening and this is a seat yourself place. I like there are some high tables and low tables for which you can sit at and the service was friendly. There was a homeless man who wandered into the store asking for money at each of the tables but one of the workers stepped in to ask the man to leave, made sure that the homeless man left and then apologized to the patrons which I thought was handled very nicely. There were quite a few people eating at this establishment at about 8pm on a Sunday. I think I will go back and try a pasta dish.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "57tf_RmT5o3BiFj2gpV-Jg"
  },
  "tzIpAoovIoV4CE4_tmniBQ": {
    "date": "1/4/2012",
    "text": "This place is among my favorites in Oakland. Wide range of choices on menu + tasty dishes + healthy foods + quick services + reasonable price... wow, it is almost PERFECT for me (well, at least for now, when it's still new and exciting)! One thing to note is that their portion size is quite small! I would usually go for their \"trio\", with small size noodle choice + meat + salad.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AyhF9VDkrReBv_cO-oI-JA"
  },
  "etGU9JRtllUorqO-xPcHyg": {
    "date": "9/6/2012",
    "text": "This place is decent. The service is good and fast, but the food is not great. It's edible, but not good enough for me to go back a second time. I had the Pad Thai and added chicken, which cost me an extra $3. The chicken turned out to be fake and the noodles gummy. I would really not recommend.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KM9_K-zfILo5EWwKxKbhCw"
  },
  "WzBtJnXaUtu1mz-665abEQ": {
    "date": "8/21/2012",
    "text": "The very basic of every restaurant is to serve delicious foods. I had tried all Asian noodles and their basics are awful. At least, if you want to have Asian noodles, please consider other places.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vpvBh4nWgI3I9ZeU42WlfQ"
  },
  "7s_SP-CMPzdBBWxxa1Zuwg": {
    "date": "1/5/2013",
    "text": "Basic, inexpensive comfort food for a cold afternoon. I had the American buttered noodles which I enjoyed. The Asian options, sampled on previous trips, aren't so successful as the straightforward American ones. Don't come here expecting too much & you wn't be disappointed. My only problem was with the meatballs which have a rubbery texture and are difficult to cut without a knife. I'll skip those the next time. Decent iced tea, unsweetened, is a good alternative to sodas.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3_YQh7RNj6Tjny8EydACzA"
  },
  "zKN3sWetj21QmSITqJAo3A": {
    "date": "1/13/2012",
    "text": "I'm giving this place 3 stars because I think it is a great concept and a welcome addition to the Chipotle/Panera/etc scene, and the experience that I had at the downtown eatery was great (where I ordered selections off of the Asian menu). This time my husband had the Penna Rosa, which was great, but I had the Truffle Mac N' Cheese, which was a major dissapointment. I would never pick cheddar cheese as the base for this kind of dish- it was pretty terrible. We ordered the Wisconsin Mac N' Cheese for our kids. They ate it, but honestly, it was a little sub-par. Noodles and Company could take a cue from the delicious Mac N' Cheese served up by Panera on the other side of the street. This place is doing well and has great potential, but they really need to work on their 'American' menu. Not ready to give up on it yet, though. Also, l know this location is primarily a student place, but it would be nice to see maybe one more four-top low table in the restaurant for young families or disabled patrons.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mORLEyoro9d012KUbdna6A"
  },
  "uzCAUqanlxHVkeULfCKX9Q": {
    "date": "6/17/2013",
    "text": "If you're a young college student with disposable income and haven't yet mastered the application of heat to liquid dihydrogen monoxide until rapid vaporization of the aforementioned substance, then you'll love Noodles & Company.  Noodles & Company isn't particularly affordable, and in Oakland, you'll be able to find better Pad Thai or meatballs spaghetti in other establishments within a 3 minute walking radius from Noodles & Company - so I have a tough time understanding the niche this particular franchise seeks to fill.   I had the BBQ Pork Mac and Cheese and Tomato Basil Bisque. The mac and cheese, while perfectly acceptable, reminded me of the Kraft variety you'll find in virtually every Freshman dorm. The bisque, also perfectly acceptable, could have been replicated by thickening a canned offering from Campbell's with some sauteed onions and a dash of heavy cream.  The service required at Noodles & Company isn't complicated - and consists of a cashier taking your order, line cooks doing their thing and a runner will bring it to your table. Yet somehow the staffed struggled with the orders in our party of eight during a relatively small lunch-crowd. In addition, the runner decided to offer unsolicited commentary on the volume of food we had ordered.   While I don't believe that America's tipping culture necessarily guarantees good service, you can certainly tell when a Sphincter ani externus in the service industry isn't counting on tips to live (Noodles & Company's policy prohibits tipping).  At least the soda machine was cool.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "htWrBQxfHXwxNXw_LBZTJw"
  },
  "gG2JttCAxAn6idkxKgESsQ": {
    "date": "8/28/2013",
    "text": "The soda machine is the key reason to go here. It's cool. You pick a type, e.g., Diet Coke, and you can put like 6 different syrups into it. Yum! They also have 3 flavors of iced tea.  The food, however, is eh and overpriced. I usually get the mac & cheese, and my daughter likes the pesto. They're fine. You can put things into the dish which we usually do, e.g., chicken and extra veggies. However, doing so increases the price and quickly adds up. I also don't like how they put raw spinach into my dish. It's a hot dish. The spinach should be cooked.  The service is iffy. They sometimes have clueless people working the register which I cannot understand because a) it gives a negative impression and b) it slows things down. My register person could not answer simple questions like, \"Are there mushrooms in that dish?\" (yes) or \"Can I switch out for the gluten-free noodles?\" (yes).   The food runners are usually quick to bring your meal to the table, and so far, it's always been hot.  They do have gluten-free noodles! Yeah!  Bottom line: You get the same things (except the awesome soda machine) faster and cheaper within a few blocks.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rpK40ZN2rNFJLhfdlQqS-Q"
  },
  "q6yX9kDObQmgaXsNcfj9Qw": {
    "date": "11/4/2014",
    "text": "Delicious food the first few times (when it opened)...then a noticeable decrease in quality while the prices kept rising. Now it's  more expensive to get less food....I'd suggest Red Oak or Eat Unique if you want healthy around here...otherwise, this place doesn't sustain the average college student.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z6-cjss7psd-Vb2h1josRA"
  },
  "9F7ictqzeFVlc_1xJBgdPQ": {
    "date": "7/21/2015",
    "text": "My noodles were just fine. I got the Japanese curry dish, featuring rice noodles. It was kind of bland; I thought it would be spicy but the only heat came from the peppers. Definitely the highlight of the meal was the fancy soda machine that allows you to mix flavors into sodas. It's fine for a quick cheap meal, so can't complain.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nw97_9RQOHnoo4Vkzim_Dg"
  },
  "mhW14RIsfw8IKPVwCWZN5Q": {
    "date": "7/23/2014",
    "text": "This place is one of the healthier options for lunch in Oakland, and a good alternative to the fast food joints in the area.  As the name suggests, they specialize in noodles, which includes American and Italian-inspired types as well as the Asian-inspired ones you might think of.  I've tried several varieties here and at the downtown location, including the penne rosa, pesto cavatappi, and mac and cheese.  Although the dishes may not be the most exciting ones you'll find in the area, all of them have been served hot, have tasted good, and have been filling, providing for a solid lunch (or dinner, in the case of my downtown excursions).  The small size is perfect for a lunch portion, whereas the larger size is better for dinner, and meat can be added for an upcharge.  I've tried the parmesan chicken (on the pesto cavatappi) and the BBQ pork (on the macaroni), and both have been tasty and have gone well with these dishes.  Although I don't usually order a drink, as other reviewers have mentioned, they have the Coke freestyle machine, which provides for unlimited flavor customization options. However, there is another establishment down the street that has a Boylan soda fountain, so if I'm feeling like a soda, that's more my speed. 3.5 stars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "135DbbQnr3BEkQbBzZ9T1A"
  },
  "XkPRf-jN5vf4-v9oW3ic8w": {
    "date": "10/30/2013",
    "text": "Pleasantly pleased, I went here when visiting my daughter and the food was rather tasty. I like the idea of noodles with your choice of toppings or just plain buttered noodles - simplistic yet good. The soda machine was a neat novelty. Friendly staff and good menu to choose from, even soup and sandwiches if noodles aren't your thing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HH20fC6-RX3ktTEyeZCMuA"
  },
  "OTKE4QuNNF8i7FflzQNjoA": {
    "date": "1/11/2013",
    "text": "This place is pretty good.  They have a variety of different noodle dishes, including those that are Italian or Asian inspired.  Looked like they had some sandwiches and soups too but seemed like most people go for the noodles.  It's definitely not authentic Italian or Asian by any means, but it's good tasty food that has fresh ingredients.  They also try to be creative in some of their combinations--for example, I had the bbq and mac-n-cheese special that also had crispy onions on it and it was very tasty.  Good portions and reasonable prices.  You order up at a counter then they bring it to you, but the servers also come and check on your to see if you need anything and they were all really friendly and fast. Plenty of tables to sit at and was a comfortable atmosphere.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3bo1FXvQnxw2hmO0CHH4Nw"
  },
  "2y4xOZnZCIPKB7DpYXJhvQ": {
    "date": "7/27/2015",
    "text": "The food is pretty good, and the prices are fairly reasonable considering the portion sizes; however, what really stood out to me was the service.  I ordered food online and picked it up.  Upon leaving and then later beginning to eat it, though, I realized that they didn't include shrimp in my meal.  Normally, I wouldn't care all that much, but since I had paid extra for it I decided to go back for either a 2.00 refund or to see if they could add shrimp.  Anyway, the guy really apologized and insisted on giving me a whole new fresh meal.  Since mine was partially eaten and I felt bad wasting the rest of it, I said that wasn't necessary and asked if they could just add shrimp to it.  The guy did, and then insisted on giving me a card for a free meal the next time come.  Very impressed by that.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sV3xGQ-mFG48hzJcArlLZw"
  },
  "IgrLpl8kM50vB46neNyd7Q": {
    "date": "6/7/2015",
    "text": "Out of the two times i visited the store, this is not too bad of food, considering that they are just a chain store and they have both asian and western (somewhat of a bad combination in most cases) noodles, so yeah, they are not all too bad for a fast food store.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EnbcN0V12D96soMlJb2zsg"
  },
  "j0Fd6sXUHarlMbhMNK7m1w": {
    "date": "9/28/2016",
    "text": "Love the food and love this place. I have ordered almost everything on the menu and have enjoyed it all. I have lost about 15 pounds since I started eating here regularly. I go on average three times a week. I cannot understand how anyone can write a bad review about this place. Keep up the good work.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "geEpiXM1wHwgQgWRc9tt7Q"
  },
  "n3E9rmsohZ_zhjznB-GqbQ": {
    "date": "8/22/2012",
    "text": "This place is pretty close to both the Pitt and CMU campuses and has decently priced (sub $10 - you can get a dish plus soda for about $7.50) and decent food for the money. If you want more food for the money Chipotle may be a better option. They also have good a good, clean seating area and get your food to you fast.  I've had the Japanese Pan Fried Noodes, Indonesian Peanut, and Truffle Mac. Of these, I would have to recommend the Truffle Mac. It's more expensive than the other dishes (it was $11 for it and a soda), but it tasted really good. Friends I've went with also enjoyed in the regular Wisconsin Mac and cheese.  They have a Coke freestyle machine (the one with the touchscreen so you can choose your flavor of Fanta, Coca Cola, Sprite, Root beer, etc.), which is fun to use to test new combinations.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "eR3vG4mZ6ZiP2E9wkU6wxg"
  },
  "aWRpLLoDZNrp1aC-YaPEZg": {
    "date": "12/24/2012",
    "text": "For me, Noodles & Company is a nice change of pace, with a good variety to satisfy most people in your party.  I've been here a couple of times, as well as locations in other cities.  I don't disagree, Noodles  may not be the best value for a college student.  Good thing I have a job!  I appreciate the variety offered, with standard American fare (mac and cheese, meatballs) to Asian flare (Japanese noodles, pad thai).  Granted, none of the bowls will astonish you in the taste bud department, but I think it's a nicer option than your other Forbes Ave. choices, such as Chipotle, Primanti's, or Five Guys.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q9DAJCpeKdzS6WuMvWOX4w"
  },
  "juUVSL2mBqZFWCdGIP0NbQ": {
    "date": "8/27/2016",
    "text": "I can't speak for everyone working there, but one older woman was extremely rude and unaccommodating. I am vegan and asked if there was a way to take off any cream or butter and she was very passive and clearly annoyed. Horrible service I wouldn't recommend to anyone ever!!!!!!!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z1tkRuQKqP7TKL0HnbHKsQ"
  },
  "kpG7-6GU0rI8jrKNLzrK-w": {
    "date": "12/14/2012",
    "text": "My favorite hole in the wall place in Oakland was closed for the holidays, and since I was hankering for asian food with not a lot of time on my hands, I chose Noodles & Company.  It was a Thursday night around 6 and the place was busy.  It's not a huge place to begin with (seats maybe 35?), you're all kind of close in, so no privacy.  It didn't bother me, but it did noticeably bother two girls that sat adjacent to me.  The thing that did bother me was the noise.  With all of the hard wall/floor/ceiling surfaces, but we're all kind of packed in a small area, plus everyone's talking, the tipping point on the noise was the piped in music.  It was Loud with a capital L.  Was this a nightclub or a casual restaurant?  Since I was there by myself it wasn't a deal breaker, but I would have had trouble carrying on a conversation with a mealmate.  The service at the counter was pleasant and efficient and it took very little time to get my food; I ordered the bankok curry noodle dish (regular) vegetarian style.  The Japanese-style soda machine is kind of cool.  I chose Diet Raspberry Diet Coke.  In a word:  don't.  Raspberry goes well with Sprite and iced tea, but Diet Coke?  Not so much.  Noodles & Company is a healthful alternative to fast food.  It you keep your dish as is without adding meat/tofu, with a drink it's about $7.50.  If you have a more hearty appetite, you'd do better at Chipotle or Qdoba, or if you're hankering Asian food, nearby non-chain Spice Island.  Final verdict:  does in a pinch, when I'm not starving, but not a restaurant I'd actively seek out to eat.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4pRehidpIXTZsTK3sBrUeQ"
  },
  "K1Fu42091cfImj3UvllhWA": {
    "date": "6/21/2013",
    "text": "I am indeed a fan.  I have gone thru most of the noodle and soup menu (no salads and no sandwiches yet).  I tend to order by the calorie count - so as to preserve the ol' waistline - and if their calorie count can be trusted, then their fare is a tasty and healthy treat.  I find the asian noodle dishes to be my favorite.  And I am always very satisfied with the portions ( I order the small bowl).  In fact, the tasty goodness of the noodles typically causes me to keep eating even after my brain is telling me \"hey buddy, you are full\".  In the winter, I was getting chicken noodle soup and  the small noodle bowl and that was A LOT of food.    Today I ordered the small Indonesian w/ Chicken, a large soda and a rice crispie treat (so good), and the total bill came to $9.38.  I find that to be pretty darn reasonable for Oakland faster-food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9H9JKZYYT_9KLc-GMxC-Iw"
  },
  "CXHi6W0PVTYALW0XBEU3-g": {
    "date": "7/3/2012",
    "text": "\"Delicious food\" is the first thing I will say. It probably helps that they have noodles as their main dish, but the noodles that they serve you are nigh perfect. I specifically recommend the Japanese Pan Noodles (without the marinated steak though). My noodles were served with a bit of cilantro (for breath-neutralization, I assume) and the iced tea is awesome. Just don't get the sweet tea. Seriously, the market for sugar must have had a noticeable increase the day Noodles & Company brought out their sweetened iced tea.   The atmosphere is very modern. It makes me think of IKEA mixed with Asian minimalism. And I mean that as a compliment, not a criticism. Lunch is pretty noisy, but go in the late afternoon and you will be able to eat in solace.   All and all, if you are looking for a good noodle restaurant but don't want the \"divey\" feel of LuLu's Noodles (or you *do* want the clean feeling of a modern restaurant), I would definitely recommend Noodles & Company",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UbUJwrEbBU259H3jfIQcYQ"
  },
  "mw8g-uV0tmoDFgfDixXrzA": {
    "date": "2/22/2016",
    "text": "I got the spinach and fresh fruit salad and it was drenched on balsamic dressing. I normally love balsamic but this was barely edible. I added grilled chicken and it was cold. Not appetizing at all.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y62M8gpd_XcUxRBh5_C1cQ"
  },
  "akP4gcGyPdYfxZNZRzBjiA": {
    "date": "9/10/2014",
    "text": "Pasta Fresca, Japanese Pan Noodles, and Tomato Basil Bisque. The three entries were fantastic, the tomato bisque was fantastic! There was plenty of food for a very good price, I was extremely impressed! I ordered online and specified a time in which I arrived at 2 minutes after and my food was read (they were extremely busy) and still warm and not reheated. The people were friendly and professional and the establishment was clean. I really enjoyed the food and was very happy with the price!! Would recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ndkyUOQlrwp7wq7gSOmV3Q"
  },
  "NLpOtpI9gEXmot_8jPOXNQ": {
    "date": "10/16/2014",
    "text": "Best Mac and cheese I have ever had. Love the variety and clean modern environment. Great for lunch or dinner. Fast service and great quality food. Came here with some friends for lunch and was not disappointed. Definitely recommend this for anyone in the mood for pasta/noodles.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xTF4aJVRUCvd-ZGECiJUqQ"
  },
  "ap3OlCd6Rbg7O64_sNeLlQ": {
    "date": "5/19/2013",
    "text": "They have a good selection of different noodles: spaghetti and meatballs, pad thai, pesto cavatappi, japanese pan noodles. They offer a bunch of variety. The prices are alright, but the portions are slightly on the smaller side, and some of the choices don't include any meat unless you pay extra. Service is quick, and they have a free style coke machine.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tjX2Ii0NT-v7vvocb3HPdA"
  },
  "pb3OSa4FQzqS9n8tnY5T1A": {
    "date": "4/24/2017",
    "text": "Not enough non-spicy options. Even the Pad Thai is too spicy for me, which is not supposed to be. However, the Korean BBQ meatball is excellent and if I come again I would definitely get the meatball.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eJsdSZ7-IyatMVD2Us-lGg"
  },
  "Rq5kj5m7paDFGKsZd9EmeA": {
    "date": "4/20/2017",
    "text": "Ordered the Korean beef noodle dish to go ($9.30).   -Literally waited for 20 minutes to get the food. -When I opened the bowl back in the office, it filled less than half of the bowl (Looks like they only used the equivalent of 1 ramen instant noodle pack). -There was no beef. The image of the dish clearly depicts pieces of beef in the bowl, same as the written description.  Will not ever go there again, don't want to get swindled again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5eDVrtIoitprfoa7jawwbQ"
  },
  "kpOAKgWxEpEcoT5W0o64Zg": {
    "date": "5/7/2013",
    "text": "The beef stroganoff was really good, I highly recommend that one.  The truffle mac and cheese was pretty good... but I am not sure how much I liked it.  It was actually pretty bland.  The truffle was subtle, but the cheese sauce was watered down and very not cheese at all.  It kind of tasted like Kaft mac and cheese with a spritz of truffle oil.  It would be much better if if the sauce were thicker, creamier, and cheesier... and with bacon bits!    I have never been to other Noodles and Company, but the service at this location was very good.  The staff was really nice.  And the take out containers are really cute!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "KDw1B6VZ-c0cSobzgRx06A"
  },
  "ZuyVqdZJdSkTOVKIldKNxg": {
    "date": "4/9/2015",
    "text": "I usually do not write reviews about food establishments. But my experience here has compelled me to share it with you guys. Here is my take:  1) The staff is extremely incompetent esp during the rush hour. You have 4 guys and 1 girl shouting at each other over the counter. Honestly, having lived in 4 continents and 11 countries, I have never seen such incompetence,  2) During the rush our (11:30 to 1 pm), the food is often undercooked and is unnecessarily oily.  3) I ordered Pad thai to go (hoping for a quick bite), and after waiting for 55 minutes my food did not arrive. When I approached them again, they did not have my order in their system!! I kept my calm, and asked them to cancel my order. It took 3 guys, and over 15 minutes to figure out the refunds!  so a word of advice? RUN!! RUN FOR YOUR LIVES!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "pOk9Bah4nZso18ikLpLCOg"
  },
  "b0ThvtzfdDMn7QuzzHAC-g": {
    "date": "1/12/2015",
    "text": "Everything was up-to-par with my expectations for your average chain \"fast casual\" restaurant, but sub-par in taste. My Japanese Pan Noodles were soaked in a greasy, sweet sauce that just made me feel bloated afterwards. Although it seems to be a healthier option, I'm extremely skeptical, as the taste of the food felt much heavier than what the calorie counts had listed on the menu. I suppose that's none of my business, but I thought I would warn the potential consumer.   Bottom line, better for you than Primanti's, obviously, but beware of what you order if you are trying to be healthy.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "2_X5tC1F2sYmicko_f7Nxw"
  },
  "TRm8PpeogzvsC52q6PIX8g": {
    "date": "11/28/2012",
    "text": "I used to appreciate chains because I can always go expecting a reliable meal, and thought I knew what to expect here. But this particular store needs work.  Was forced to eat here twice in one day by friends who love the drink machine (really? just syrup dropped into your typical drinks that make it taste even more artificial, but to each his own...). Got pan noodles - soggy, overly seasoned noodles. It was so salty I couldn't finish it. Had chicken noodle to go with it, and it came lukewarm and tasted strangely heavy in one spice that I couldn't identify.   Got penne rosa (my other usual staple here) and it was bland that time! The tomato bisque was okay though, but again was lukewarm for some reason. I would assume soups are made in bulk and spooned out as they're ordered, so are they simply not kept in proper containers?   I know not every noodles and co is bad, but there seems to be a lack of standardization. I don't think I'll be coming to this particular one anymore. Will simply go elsewhere next time in Oakland.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "jXX-G_goCYZZrLSDY8qXdg"
  },
  "Vf32fhivmzNwvuUoRIWEwg": {
    "date": "2/2/2016",
    "text": "This isn't my go to place-- I only visit when I have a coupon.   The Asian-themed choices are not so great. It's a good attempt without have an expensive. price (for a college campus). For example, with the Thai curry and the pad Thai, it's the right general direction for the flavor, but it just misses its mark. For more authentic Thai dishes, I would go someplace else.   However, I still prefer the Asian noodle dishes over the Italian and other choices-- so if I did somehow decide to like Italian in the future, my opinion of this place might change after trying the other items.   There are a lot of options, so I would take some time reading the menu that they have hanging on the right side of the line to the cashier. The menu behind the cashier doesn't have the same descriptions. Many items don't include meat, by the way-- it's an extra $2.50+. So if you do want a meal with meat in it, it comes out to ~$10+  The menu appears to be organized in a certain way that I really don't understand. The first impression is that it's sorted by price, however some items have different prices listed under them. (You'll notice what I mean when you're right in front of it.)  The workers have always been super friendly, and it's regularly filled with students, so I'm guessing they're doing something right.   P.S. Sign up for their email list for BOGO free coupons.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "PlGOItOtSgiiHvwpIM__Sg"
  },
  "cRY1hOVoWziU_45RimKz3g": {
    "date": "4/28/2016",
    "text": "Noodles and company simply disappoints when comparing what you paid for with the amount of food received. Relative to nearby restaurants, it's more so expensive. For quality of food, the Asian dishes are bland while lacking in vegetables. The penne rosa with chicken is really the only thing worth getting here. Wait times are normal. The ambience is very disconcerting. Music is blasting in your ears when you're simply trying to enjoy your meal. Mercy please. Overall, I rarely visit unless I, for some odd reason, feel like overpaying for craving penne rosa.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xp6WAIOBn1_gp1g0aQumAw"
  },
  "AbVFsySeG9Ser2rhBZMR7Q": {
    "date": "6/28/2016",
    "text": "Noodles and co is a great casual dining place with a ton of different options inspired by noodle dishes from around the world. The portions are good for one large meal, but not enough for two smaller ones. I almost always get takeout and they are pretty quick about getting me my order. The food stands up really well to refrigeration and reheating, the spinach and tomatoes are always still perfectly juicy/crunchy, the noodles don't feel soggy, and the sauce can look a bit odd but always tastes delicious. I've only had a few of their dishes but I like what I've. My favorites go between their Alfredo Montamore and the Pesto Cavatappi with pork. I also enjoy the mac and cheese, which is good with the pork or the parmesan encrusted chicken.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a1qCiLY6M7qwEhmzIE7acQ"
  },
  "Ni2unBJS3snD2oc-7pOXvw": {
    "date": "9/30/2017",
    "text": "My friend and I love the noodles and company chain and were extremely disappointed with our experience tonight. I found a label in my noodles, and she found a long dark hair in her mac and cheese (shes blonde). All in all, very poor.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BfwldWfjv5Y3DWcdPuVKyw"
  },
  "pXHe6z18i2Jeh2D6w6yHXQ": {
    "date": "6/3/2014",
    "text": "First of all, I definitely wouldn't classify this as Chinese food as is listed here! It's a variety of noodle preparations \"from around the world\" including Asian, Mediterranean, etc. I have been going to various locations for 10 years and always come back: although there is an occasional error or less than ideal situation, you can't beat the variety, price, and convenience if you are a pasta lover like myself. I have had most of the dishes dozens of times- here are some thoughts:  Japanese pan noodles: the noodles are thick with a great mouthfeel. The sauce is a little spicy and tasty. Sometimes they don't put enough on there though and it winds up on the flavorless side  Buttered noodles: literally butter and noodles (and a very nice seasoning plus parm) but the egg noodles are very tasty and I often use this as a vehicle to add whatever fresh ingrediants they have in seasons ( mmm corn and asparagus)  Steak stroganoff: really tasty sauce but rich. Would get the small size   Pasta fresca: one of my go-tos. It has delicate wine sauce that I can't get enough of. Nice veggies as well  Penne rosa: I sometimes feel like the sauce tastes like vomit   Mac and cheese: literally don't understand why people like this! So plain and basic!  Pad Thai: inedible. You are much better off going to a Thai restaurant   Indian curry: delicious! Not a lot of noodles but good if you want more of a mix of veggies   Pesto cavatappi: a nice dish but I would ask for extra sauce because often it runs a little low   As you can see, sometimes the dishes are inconsistent, which is my biggest complaint. I find that this is worse with takeout too so I would try and eat in if possible !",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "jtCNkOL7zdYkzds5lSQmEw"
  },
  "iYCGnGG3eYqEbG6i8vsEPA": {
    "date": "11/11/2014",
    "text": "Today, I got the Bangkok Curry with Chicken. I can't really tell if it tasted different than the Indonesian Saute. It was good, don't get me wrong, but it tasted like many peanut sauce dishes. The chicken was cut up and cubed, there wasn't much of it, but it was ok. The sauce and veggies were delicious so it made up for the mediocre chicken. I like coming here mostly because of the soda machine. It is the one that you can pick flavors of the Coke. I like the Dasani Sensations (fizzy water with a little bit of flavor). The noodles are good, not GREAT, but they are good. And one of the most important things to say is that for Oakland during the lunch rush, your food will come quick. Also, they keep the restaurant very clean and have their staff come around to clear your plates for you just like a real restaurant!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-hietrA8M58asfpyJkCyiA"
  },
  "pPbASG4T3YJj2KEXsqC3PQ": {
    "date": "3/8/2015",
    "text": "The environment is nice, but the food is not worth it. I ordered the Bangkok Curry. The rice noodles were all stuck together, and the sauce was just sweet. Not much more flavor. It was terrible. In addition, there wasn't much else other than noodles. I didn't add protein, but there weren't many vegetables on my plate, either.  My dad ordered the Japanese Pan Noodles, which didn't look much better.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sXBAUjajALeLI1WNAtG2uA",
        "caption": "Photo of Noodles &amp; Company - Pittsburgh, PA, United States. Japanese Pan Noodles (far dish) and Bangkok Curry",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sXBAUjajALeLI1WNAtG2uA/o.jpg"
      }
    ],
    "user_id": "Figs8mO8s_aPRq2W7W0cYQ"
  },
  "jRGVlOzg0sFbTq8SVHgv0w": {
    "date": "1/26/2016",
    "text": "I'm going to keep this short and sweet. I simply ordered a pad Thai and a small ceasar salad as a side. The pad Thai was a lot spicier than I imagined & quite bland. Although it was not terrible, I would prob not order it again. And I'll just leave this here....I asked for croutons in the ceasar salad and I got ONE. ONE crouton.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HyEEyEU6CN3d6Qk9zol8nQ"
  },
  "rcsBqvwa5gtXGfbbnX_pIg": {
    "date": "8/10/2012",
    "text": "The place is convenient, reasonably priced, and pretty good food.  I've come here a number of times for lunch with colleagues, as it is a nicer sit-down place not too far from campus--it's clean, spacious enough, and comfortable.     The menu consists of several noodle options--American (Mac, spaghetti & meatballs), Asian (Japanese pan noodles, pad thai, bangkok curry), and Mediterranean (Italian pasta) and several salad and sandwich options.  All the meals are vegetarian by default with small (about $4.50) and regular (about $5.50), though you can add meat (chicken, steak, shrimp, meatballs) or tofu for about an additional $2.50.  I recommend the noodle options--after all, it is called Noodles & Co.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "O33C6dL_tYTP86xDu1OJ9w",
        "caption": "Photo of Noodles &amp; Company - Pittsburgh, PA, United States. chicken pad thai",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/O33C6dL_tYTP86xDu1OJ9w/o.jpg"
      }
    ],
    "user_id": "H6KpNWM0nJwwjOOZv5WpfQ"
  },
  "jSMugrpwsL9Yh0AC1U96Mw": {
    "date": "1/4/2012",
    "text": "So I guess I have no one to blame but myself for this one... as much as I want to give them 2 stars, I have to give them three for my poor decision making on getting the Shrimp Pad Thai here when I knew my obsession for Thai food was not going to benefit me at a place like this.  I should have opted for a different dish (perhaps Mac and Cheese or sorts or some Italianish sort of thing).   Despite the location being new, everyone seemed to have already been through the pains of being a new store.  Very busy too even though it was during the seasonal break (which was why we opted to venture there when we did).  Service was quick and good!  I will definitely come back, but the next visit will definitely not include Pad Thai!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hLVq7VSJBHZwqurwWoCmpg"
  },
  "VTfFdb_CTqzVHNgUfwlixg": {
    "date": "11/17/2015",
    "text": "This place is great for college students on a budget. Their portions are generous and their prices are pretty reasonable. My only complaint is that their consistency is a bit off, but it isn't extreme enough for me to not come back to this place weekly. I highly recommend the Pad Thai, Macaroni and Cheese, Penne Rosa, and Whole Grain Tuscan Fresca. Steer clear of the cheesy garlic bread.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FvxYptCO2VzMWJWZjB_TwA"
  },
  "EPGoSkjRe4N_80YLX_t28w": {
    "date": "4/1/2014",
    "text": "Love their noodles a lot",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uPYDsomc6GLxuRWuNGcrUQ"
  },
  "c_efb-EuHFcyA2GhpxtIiw": {
    "date": "1/12/2017",
    "text": "It's part of a chain. Their main specialty is noodle dishes with different twists along with three choices of sharable appetizers and soups. The noodle dishes themselves come in two different sizes (small or regular), the appetizers, and the soups themselves also have two different sizes, each at different prices. Depending on the season they might rotate a couple noodle dishes in here or there for a limited time (seasonal). While I found the selection of noodle dishes rather plentiful, I can't help but feel that the noodles themselves are at best average, especially for the price that I'm paying and considering that I can get better noodle dishes at surrounding joints for cheaper prices. Although I haven't tried all of menu choices, my favorite noodle dish is the spicy korean beef noodles. There's something nice about the simplicity of the dish, the sauce used in the dish is wonderfully tangy (though labeled sweet and spicy, it's actually not that spicy at all) the taste of it is a wonderful reminder of my Asian roots. In general, some of the other dishes tend to be more heavy in calories and biased towards Italian roots, which kinda kills the variety even though there are so many menu items. The cheesy garlic bread is pretty dope as an appetizer and the marinara that comes along with it is good. Location itself is well-kept and clean. Just be aware that it's near campus so it's usually busy during normal meal times (lunch and especially dinner)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MLf4JUa1uzQkDLrBJ5yJHA"
  },
  "cwyNiy5XeygkWgPmfP3KlQ": {
    "date": "2/2/2012",
    "text": "Noodles & Co offers quick service and reasonably priced, competently prepared noodle dishes. Good option for someone who wants a meal of decent quality with not enough time or money for a casual restaurant (unless you're craving Asian noodles, but more on that later).  The noodles taste fairly fresh and are all cooked to a nice al dente, a rarity in Oakland's mass of mushy noodles. The Italian and American offerings are all fairly satisfying, albeit lackluster. The dishes don't knock you away with bold, exciting flavors, but it's decent comfort food.  Steer clear of the Asian noodle plates. Seriously. Not only is this section of the menu awkward, but a quick stroll to similarly priced Taiwan Cafe, Szechuan Express, Burma Tokyo, or Spice Island Tea House will get you far superior Asian noodles (be they Thai, Indonesian, Chinese, or what have you).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yft76ogF5YzCQ4mn6vSQ6Q"
  },
  "tplAW-YFAIlAu2C6pXPy1Q": {
    "date": "3/26/2019",
    "text": "Noodles and Company is always a good experience! Used to visit the location in Wexford, but since it closed last year we have been going to the market square and Oakland locations. Safest bet is always the Wisconsin Mac and cheese, I haven't tried anything else and definitely don't need to. The only thing that sucks is parking in both locations.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cx5x9mo1oeetWZ0Q_LoPrg"
  },
  "SqDzow-OFk6X-KzhW10Zcw": {
    "date": "2/10/2019",
    "text": "Solid location.  This place has everything you'd want from a Noodles and Co. The selection is great, they have Truffle Mac :0 and there's lots of space to eat and hang out with your friends! Portion sizes for the food are big, which is great for people who are hungry and those who want some leftovers for later.  I recommend trying some of the heat spice they have next to the drink machines. It's not that spicy but adds a slight heat and smoke flavor to whatever you're having.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "5p9gDV1U_YdaLEUEZgidug",
        "caption": "Photo of Noodles &amp; Company - Pittsburgh, PA, United States. BBQ mac",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5p9gDV1U_YdaLEUEZgidug/o.jpg"
      }
    ],
    "user_id": "RTTMsplbxNb61fujtFz23g"
  },
  "1fjf3JjytC8gq1biqbS_7Q": {
    "date": "3/22/2019",
    "text": "I love the zoodles option and Lucy is amazing. Everytime I come here she is so freindly and thoughtful. Zoodle Truffle Mac is my favorite",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4FvrM9S76kkP5u50G81Nhg"
  },
  "jNXNlSK0b1VhjOMN9Raqsw": {
    "date": "2/11/2018",
    "text": "Me and my 14 year old son was on break from a chess tournament and decided to grab something to eat. As soon as I walked in I seen that the picture on the menu are misleading. It shows the bowl filled and the bowl they give you are huge.. However they dont even fill the bowls half way. Now mind you I am a big eater and this review will be based on that.  I ordered the Pasta Fresca with chicken and my son got the Buttered noodles. We received our order and we got exactly what I noticed. My son loved his buttered noodles and I loved the taste of the Pasta Fesca. However, I expected more for the the price I paid for it since pasta and noodles are so cheap. Me and my son was both hungry after a couple hours later.  This review is based on a big eater. So if you are use to eating with small portions, I would rate this as a 4 or 5. However I will only give a 3 on this and debating if I should give it a 2.   It is such a shame since it is so close to the university and students are on a budget. They probably would get a lot more customers from them if they gave bigger portions or cut down on the price.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GQFRQyqHDunrDW_CnAys3Q"
  },
  "3GM8mgT96wmgbERqVn3XlA": {
    "date": "6/5/2018",
    "text": "Love this place!! Under new management and this place is really turning around.... food is great and they even have a gluten free option!! Super awesome :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "LQrkhlBReTeGMvC2z7cYtw"
  },
  "IZnDO4KsaZ7iHXGxIux3YQ": {
    "date": "8/6/2018",
    "text": "When I ordered the Japanese pan noodles, what I got is half plate of badly burned noodles and half plate of salt. Haven't had a chance to try other foods since this will be my last time come here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KTYavUMvqsZz2f55H2aqSg"
  },
  "DGIhnRdurCGhoNfoWaH-aQ": {
    "date": "12/1/2017",
    "text": "The food was probably a 3.5/5... very standard Noodles&Company, but a tad on the salty side. However, there was plentiful seating, a clean eating space, and 5/5 service! The employee who took my order was super friendly and a manager asked me how my food was. Overall a great experience and I'd recommend it to others, but personally I'm just not a big fan of the types of pasta Noodles and Company offers.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JFrf0l-DSNxWLxnrEra4RA",
        "caption": "Photo of Noodles &amp; Company - Pittsburgh, PA, United States. Pesto cavatappi with grilled chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JFrf0l-DSNxWLxnrEra4RA/o.jpg"
      }
    ],
    "user_id": "9MU6L4v83qo9jmutekcWMQ"
  },
  "ZECyqUcPEQgRvxVA_a2DQQ": {
    "date": "8/15/2017",
    "text": "The section of food is surprisingly diverse.  Excellent noodles and pastas. The Korean meatballs were a tasty surprise.  Quick, efficient and friendly service is something I've come to expect from this location. So far they have been top notch!  Plenty of seating! Is on Pitt campus and is a favorite of the students.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "h17R7CRl3mLrTSfUEz5EQw"
  },
  "tfDAX7l_-Cc1czRiforRhg": {
    "date": "3/26/2017",
    "text": "Well, yup, the noodles here are pretty good. So, yup, if you're gluten free, they will accommodate your pasta if you pay more money. Eh, yup, they forgot to add the chicken I ordered in my Pad Thai, so I had to send it back. Um, yup, there was a HAIR in my Pad Thai when they \"fixed\" it. No, yup, it wasn't just in the dish, I noticed it as it was in my mouth. I flossed my teeth in Noodles & Company last night with a nasty, jet-black, protein rich 5-incher of human head hair last night.  Obviously, this is going to bring down my review, but the food here is still good. The manager made me a new dish free of charge and threw in a rice krispie treat on the house. I'll still eat here.",
    "rating": 2,
    "rated": {
      "funny": 5,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nx_htQFv1Ck4iCCyfJl7_g"
  },
  "VH4vZ52cYF5TZgj06D4J7A": {
    "date": "4/28/2016",
    "text": "I've been going to this place for quite awhile. If you love noodles, then this is the place for you! You can get noodles made in multiple global cuisines! Also, they have the virtual soda machine (I love this type of stuff)! Need I say more?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Zmdlh7-9xxBhplVsMymdAw",
        "caption": "Photo of Noodles &amp; Company - Pittsburgh, PA, United States. Penne Rosa to go!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Zmdlh7-9xxBhplVsMymdAw/o.jpg"
      }
    ],
    "user_id": "UyXqGEKod-veD6m6Hq0EDw"
  },
  "khefahQFt_uH0p4rrmqlwA": {
    "date": "9/3/2018",
    "text": "Tonga one of the managers was fantastic. He worked with me to sort out a group order that would nt go through on line.  He even delivered it himself and would nt even take a tip. Great fella and very helpful",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KzRXl0-7S250gtMnE6CDPQ"
  },
  "kIXBC8BTSoiTPIGVOBToXg": {
    "date": "1/28/2018",
    "text": "Noodles have always been my top 1 comfort food but the Japanese pan noodles at this place did not bring me comfort. Quite the contrary, I experienced nothing more than a bloated stomach and an overly sweet greasy taste lingering in my mouth. The prices are low but the serving size is also proportional to the price.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EU5dSjk-UzILTp5kcg-dOQ"
  },
  "TmmN6t-Yyx3XEuZi1t2nlQ": {
    "date": "1/20/2017",
    "text": "We ordered in trays for a coworker's retirement luncheon. It was a great idea, it was a massive amount of food for 15 people. I've previously eaten with the Cranberry Township location and I'm not a fan as the food tastes processed but I really enjoyed the Alfredo pasta creation. If I was craving quick pasta, I would go here for the Alfredo.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "agGWDhkVvIHaf8w16jLTng"
  },
  "iAnycCN-qJAp2mn-1B79Lg": {
    "date": "9/7/2017",
    "text": "I've been going here for a while and the employees have never been overly friendly or even motivated to do their jobs well. I went there today and my friend ordered the spaghetti and marinara sauce, and specified that she did NOT want cheese or meatballs on top, she even repeated this twice. So when they brought out our food of course there were meatballs on top. She told the man that she asked for no meatballs and so he brought it back, came back three minutes later with the same bowl of spaghetti except now it had 5 meatball indents where the meatballs had been... it was almost comical the way it looked. Did they really think this was acceptable? They didn't even ATTEMPT to make it look like they gave a sh*t about their presentation. So she brought it back again and asked him if they just took the meatballs off and he said yes, and she asked if she could have a whole new one because she's vegan and can't eat anything that has touched meat. So 25 minutes pass, still no food. When she goes over to ask where her food is, they tell her that they haven't even started making it yet. Meanwhile people who had come in 25 minutes after us were getting their food already. So by the time she finally got her pasta we had been there for an hour. The worst part? The girl who had messed it up in the first place was laughing at my friend as if she was an idiot or doing something wrong. Very poor customer service. So disappointed and will not be returning.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fGGiyO_aXTbiB2GmFc6_AQ",
        "caption": "Photo of Noodles &amp; Company - Pittsburgh, PA, United States. Pasta with sauce and 5 meatball indents on it, after asking for spaghetti with no meatballs",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fGGiyO_aXTbiB2GmFc6_AQ/o.jpg"
      }
    ],
    "user_id": "q6VjAjGHu6I293bigWbJQA"
  },
  "2kgnmXABGXwsBMNHkiQDYQ": {
    "date": "1/17/2015",
    "text": "I like noodles and company and I enjoy their food. However, I have one major complaint. They focus too much on the noodles and not enough on the vegetables.   Sure it's a pasta/noodle joint, but when I order \"whole grain linguine with balsamic, olive oil, white wine and roasted garlic, red onions, tomato, spinach and parmesan or feta\" I expect to get just that. Out of all the times I've gone, which is about 5, my meals have lacked vegetables. Maybe one or two pieces of tiny broccoli, 3 spinach leaves, or just even a few chunks of tomato. I enjoy the vegetables and they should be present in the dish, but they aren't.   I may be expecting too much since I'm a vegan, don't worry I didn't order cheese, but they list vegan and vegetarian items on their menu so they should be more sensitive to us. This is something this location definitely needs to work on.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UaoKpRgpWdgP9_lFdNWjqw",
        "caption": "Photo of Noodles &amp; Company - Pittsburgh, PA, United States. Whole grain tuscan fresca with little to no vegetables :(",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UaoKpRgpWdgP9_lFdNWjqw/o.jpg"
      }
    ],
    "user_id": "uVNvbVgh4tz48NN3w38Njw"
  },
  "i2AuNYb6TLglBengKt7VHg": {
    "date": "8/13/2016",
    "text": "I don't know what happened to this location because it used to be great, but my last few orders have been a lot less flavorful than they used to be. My friends have noticed this as well. Feels like they're skimping on their sauce :( used to go all the time but probably won't be back",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3ew6BEeK14K6x6Omt5gbig"
  },
  "tagARrgqqXobZ0BpdV-iDw": {
    "date": "4/14/2018",
    "text": "The quick pickup is sadly not very quick. I still love the food even though mine was cold after waiting for my friends food",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sPrWDRyYU20ri_pIC66b6w"
  },
  "YzPw0nkfrz-3mBae1N7U6g": {
    "date": "7/23/2014",
    "text": "Unfortunately I'm going to judge Noodles & Company a little tougher than I normally might because the Thai/Asian market in Oakland is well represented and if you want people's business then you really need to step up your game.  Here is one thing I really appreciate at Noodles and Company - the caloric value is listed for each dish.  Talk about an eye opener - if you don't choose wisely, you better have a date with the gym later in the day because there's a dish on the menu (fettuccine) that is over 1,200 calories.    I had the Bangkok curry on my visit today and I thought the flavor was nice, not overpowering for a curried dish, and it was a nice size portion.  The caloric count wasn't bad and I felt full.    My colleague who dined with me did a soup and salad combo and said that the spicy Caesar chicken sandwich was indeed spicy.  This is not my go to noodle destination, but, it's not on my list of \"don't ever come here again\" noodle places.  I'd describe it as, \"it is what it is\", nothing to write home about but nothing to write a bad review about either.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CYTpi63Tv_UTjsaTMCZUvg"
  },
  "GISBQejww9114ntRunHIhA": {
    "date": "11/2/2014",
    "text": "Small portions, Large price.   I went in with low expectations and came out feeling affirmed.   I got the Bangkok Curry and it was just..okay.  The whole experience of the food was just...okay.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BkMqpJikNc3r5itc-ui6ww"
  },
  "adZ6OAOqpZZNAReB6t7vUg": {
    "date": "9/4/2013",
    "text": "Yum! I really like Noodles & Company, which while not the cheapest stop for food is still pretty reasonable in my experience.   I remember when this location first opened so I have to say, seeing the evolution of the shop has been kind of cool. The general layout hasn't changed - this location has that cozy college campus feel to it - but what has changed is the menu and displays. I remember when I first came here the only options were noodle soups and, well, noodles! Now you can find salads and sandwiches, and even better for those of us watching our waistlines, there's calorie measurements next to the entree listings.  The soups are all delicious, the veggie sandwiches are also quite simply wonderful, and the noodle dishes I've had have been tasty enough considering that what I'm ordering isn't as expensive as the pasta dishes at my favorite Italian places. For a chain store the food is much better than you might expect and it's never disappointed me when I've needed a filling, affordable and quick meal.   Not a fan of the \"make your own soda\" machine, I think those things are pretty disgusting. But otherwise this is a pretty reasonable quick stop for food in Oakland - the downtown location is good, too. I'll be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "M9TjYmTgHayJ22cNkyvW_g"
  }
}