{
  "KNpKwVhmChcPvJzggXyueQ": {
    "date": "11/22/2014",
    "text": "I've been eating here on my regular visits to Pittsburgh for nearly 2 years. Food is always great. Prices are reasonable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EJmii6kbeoglweJFC1FllQ"
  },
  "zf1Ldtd1CQlzJU_2c0gO7w": {
    "date": "4/28/2016",
    "text": "80s is right and full of suits on lunch break. That said it was good service and I was in and out in about 50 minutes. I would come here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "twFGUPUZ5Q0nFzE9Tjs_bg"
  },
  "m-L5SO3tVs7HTed39jUaNg": {
    "date": "12/13/2013",
    "text": "I have no idea why people like this place, none, nada, no clue. We stopped in for drinks and lunch after a funeral. I needed a stiff drink! Ordered a martini (vodka), 10 freakin 50? Really? Am I buying the entire bottle? Didn't matter, it was noon, right after  a funeral, I need it. Looked over the menu, not much for a vegan to choose from, had a salad, had another martini. Paid the bill, 36 bucks with tip. This place reminds me of a fifties restaurant in dire need of a facelift, menu change, and anyone know when Robert Irvine will be back in the area? I got a restaurant impossible for ya!",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UsmTxWbobLsI6WR1Db0W7A"
  },
  "EJteGTGxaV89Oqh0voYvRw": {
    "date": "5/9/2011",
    "text": "Experience: Culinary Education @ Johnson & Wales University, Providence Rhode Island Date of Dining:09 May 2011  We went here on Mothers day because my mother had been here before and wanted to come back. The location is a little odd as its located in a business park in a business building, but th parking lot was full, so it must be good right! I will review this using several categories (1) Menu/Food (2) Atmosphere (3) Service (4) Overall  (1) Menu/Food: This was mothers day, so the menu was different from their normal menu, but had a good variety including Veal, Chicken, Pork, Fish, Pasta. I ordered the Veal, which was good and my grand mother had the same thing, she liked it as well. My wife, brother and mother ordered the crab stuffed chicken. My wife said it was \"OK\" and was a little dry. We had a couple starters, the fried zucchini and mushroom caps. They were both very good. The prices were reasonable $15-$19 per dish, and the portions were good.   (2) Atmosphere: From what I understand, this is a newer restaurant, but to be honest, it looked like something that hadn't been updated since 1979. The furniture looked user, the carpet was dirty and it just reminded me of places we went when I was a kid in the 1970-80's. Very dark. It has a nice location on the hill, they should work on their interior and get some modern furniture. Why do Italian restaurants in American feel like they need \"Old\" looking furniture. Every restaurant I have been to in Italy is modern and updated.   (3) Service: This is where they fell down....Although out waitress was very pleasant and nice to us, she was SLOW....Not just SLOW, but brutally SLOW. I did not think they were super busy as there were empty tables, so they cannot use them being busy as to why they were slow. I guess they are not normally open on Sundays, so maybe they had a problem getting staff, but come on, its mothers day.   (4) Overall: The food was average, the atmosphere sucked, and the service was slow, so I honestly would not recommend this place unless you are over 60 as it might be a place you would enjoy. They need to modernize their restaurant, clean the carpet, get some new furniture, and improve their service. The menu can be more traditional northern Italian (their menu had a lot of southern Italian influence to it).",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "ha2SwGmllMpOk9YlqMyGew"
  },
  "s6ioRTDzyzWsYxwsUk1RPA": {
    "date": "3/18/2016",
    "text": "Great service! Always willing to go above and beyond to help their guests! Food is amazing and quick! Great place for business meetings. Very great dining experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YopHQacQjz0Cm3Pwaa8qug"
  },
  "KLbsgrkJZDVqL5Y9Lh93NA": {
    "date": "7/16/2013",
    "text": "The service is spotty.  Water and bread appeared shortly after we were seated.  But, we waited for more than 5 minutes before the waitress asked for drink orders.  The food is good; not outstanding.  I ordered a vodka martini.  I was charged extra for the brand of vodka I requested (which can be standard for some restaurants) but I was really annoyed to pay $2.50 for blue cheese olives.  I have ordered martinis in many restaurants (Pittsburgh as well as other cities) and have never been charged for blue cheese olives.  Little extras like cheese on your salad, blue cheese olives, etc. should be built into the cost of the entree.  I really hate to be nickeled and dimed!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LENsMS1C9UfxiXMwB8tgOw"
  },
  "AGC29xBjAebGYisqgKYbkA": {
    "date": "1/4/2011",
    "text": "Good overall. Service was great. Decor I think is trying a little too hard to be fine dining. The food is good, family style italian. Huuuuuuugggeeee portions, you will definitely not leave here hungry, or without lunch for the next day. We had a coupon for a discounted entree under 15 dollars which drove the already good value through the roof. Skip Olive Garden and eat here you wont be disappointed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "8pwiMI6l-0qZ2cwWhRqYNg"
  },
  "T0WYGK_rw4wA9tDLwIyOsQ": {
    "date": "11/10/2017",
    "text": "Can't go wrong. Great people, delicious food, large portions and good value. What more could you ask for. We eat here at least once a week when we are in town. Love the house salad, the spots and the pasta. One of my favorites.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "Jw2bmq2Z4JLyJKkEFfFjvQ"
  },
  "1bscHHCEoBtKrrXxUy4TXg": {
    "date": "10/22/2017",
    "text": "My husband and I went to Scoglio's for our 18th anniversary. Upon entering the restaurant, we noticed the interior design that looked like it was from the 1980s. The waitress took our order several minutes later. We waited about 45 minutes for our appetizers to show up. The crab-stuffed mushrooms and broccoli soup were 4 stars. Our entrees showed up 15 minutes later. Our filet mignon was 3 stars because of the seasoning and being overcooked. The accompanying shrimp and crab cake were 4 stars. Because of the slow service and medicocre steaks, we will not return in the future.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FW5F5QzzMoeRdIib1OyNOw"
  },
  "6qJqvEagvaGmcJ_DJLH0OA": {
    "date": "7/17/2017",
    "text": "This is good stuff. \"Old School\", Same with the decorations, But , i must say , I got what I was was hungry for. The Bruchetta is dynamite, and you cant go wrong with the fish. The place is mostly filled with the over 60 crowd but I was looking for quiet and relaxed and I got it! Don't mind the decor, have a glass of wine.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "1iTKSdOMzfBzosaa-n5oOw"
  },
  "3Mz06x-C34kNVjzYcArWig": {
    "date": "3/13/2017",
    "text": "This is a excellent family owned restaurant. Everything is clean and the food is always great. We eat here about once a week and since day one we have always had awesome food and service. Everyone goes out of their way to make sure lunch or dinner is perfect.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "DecPgdMdR5GPJIjkhRkWdw"
  },
  "03-zjkE1nHUQR1AOZWVSiw": {
    "date": "4/13/2018",
    "text": "My wife and I met some friends for dinner and they picked this restuarant, to be honest I was a little worried after reading some reviews but went in with an open mind and belly. The decor is a little dated but I thought it was nice and spacious and very clean. Our server Jess was very friendly and helpful with recommendations for our foursome, They had a nice selection of specials that included a couple of fish dishes and also a couple of grilled meat selections as well as a nice diverse menu. We all enjoyed our meals and I recommend the fried zucchini as it had a very light batter and wasn't so heavy where you over do it before your meal arrives. Some of the reviews commented on the age of the clientele being in the 70-80 range and it made me chuckle when I was looking at people sitting around the restaurant and coming in as that was the most accurate part of any review that I read.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7taFT1LpO3yuLhFJToXCgQ"
  },
  "lQCTZAEme8SwMRjdxAA0QA": {
    "date": "2/10/2017",
    "text": "Eating dinner at this establishment last night made me feel like Gorden Ramsey is just waiting to walk in for another episode of Kitchen Nightmares.  The dull, drab decor along with the low seats with wheels on them is an experience you cannot make up.  My wife and I have an appointment at Patete Kitchen and Bath and decide to stop here for a quick bite.  The waitress takes our drink orders and brings me my glass of wine.  I order the shrimp scampi and my wife orders the Caesar salad with chicken.  Both of our meals come with soup, and mine also comes with a dish of pasta.  The soups are salty with over cooked pasta.  When my dish arrives, I wonder if I am eating what I ordered.  I get six shrimp on a plate, covered in a buttercream sauce for $25.  Shoot for that price I could get a whole bag of shrimp and do a better job myself.  My wife's salad chicken topping must have been previous days leftovers.    Throughout dinner, I am asking my wife if the Delorean is still in the parking lot because we need to get back to 2017.  Please do not eat here, it is some of the worse food in the area.",
    "rating": 1,
    "rated": {
      "funny": 6,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "hLoIBboTeBdIzDI6TXd-qA"
  },
  "qOJ5ghl6EhnOW08Y1m1sIg": {
    "date": "1/24/2014",
    "text": "Hidden in a sprawling office park (building #7 to be exact), Scoglio's apparently exists to serve the archetypal company man or woman. It is a place for the annual Christmas party where Barb in Finance gets tipsy and does karaoke or for the after work drink during which colleagues vent and tell each other how they really feel about the CEO.  Kay and I stopped in for dinner in the thick of the Yuletide Season, driving around for a few minutes before coming upon it (remember kids, Foster Plaza, Building #7). A holiday get-together was underway, so we were seated near the bar by a server with a Santa Claus hat and snowflake earrings on. We knew at that moment that we were in for a meal of Italian tradition and not fusion, tapas, or anything fussy or trendy. As my regular readers know, that's kosher with me.  A stunning house of cards that was Scoglio's take on fried zucchini was whisked past us, but due to its serving being intended more for five than two (I would have snapped a photo but wasn't fast enough) we instead went with a serving of Baked Rotolo to begin our supper. Spinach, ricotta, prosciutto, and mozzarella are rolled in a carpet of housemade pasta with a Farlenaise sauce. Some research indicates that the creamy, tomato-imbibed gravy is either a creation of the restaurant or another sauce (Alfredo? Bechamel?) modified or renamed. Regardless, this was essentially a successful hybrid of a Swiss roll and a ravioli with the salty-sweet ham rising above the cream of the cheeses and the mysterious sauce. An entree in itself, it almost seemed unfair for this to be considered an appetizer.   The signature, house-dressed, feta-topped Scoglio Salad acted as a tangy, chilly, fresh, palate-wiping prelude to the Stuffed Sea Scallops, a quartet of thick, quivering mollusks filled with tuna salad's warm crustacean equivalent in Crabmeat Imperial. Dressed with a milky, chowder-ish spinach sauce, the newly captured scallops bled sea water, mingling with the flavors of the broiled crab and its lardy, hearty binder.  Dessert was a Pecan Ball Sundae garnished with seemingly fresh whipped cream (cream ruled everything around this meal let me tell you) and chocolate sauce, recalling fried ice cream with that crunchy, nutty, sugared shell that covered the globe of frozen vanilla.   Despite our obvious non-affiliation with whatever businesses occupy Foster Plaza, Kay and I were absolutely doted on by our server as if we'd been dining there for years. On a cold, winter evening, we felt as if we had dropped in on a loving relative who didn't care that we were disheveled after having put in a hard eight and just so happened to have dinner ready with enough left over for the two of us. I half expected her to introduce us to everyone in the room.   Scoglio's won't expand your tastes or cause upheaval in your personal culinary world. Rather, they'll merely charm you with smashing, impeccably realized renditions of the classics, and in an era of blurring innovation, a plate of truly  tasty, carefully homemade spaghetti is sometimes preferred over the next molecular gastronomy experiment.",
    "rating": 4,
    "rated": {
      "funny": 12,
      "useful": 19,
      "cool": 13
    },
    "photos": [
      {
        "img_id": "ImPAsU7I0bZbgnzzIqY14g",
        "caption": "Photo of Scoglio's Green Tree - Pittsburgh, PA, United States. Pecan Ball",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ImPAsU7I0bZbgnzzIqY14g/o.jpg"
      },
      {
        "img_id": "fgs40lKrr_zdrl7Dn3B74A",
        "caption": "Photo of Scoglio's Green Tree - Pittsburgh, PA, United States. Risotto",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fgs40lKrr_zdrl7Dn3B74A/o.jpg"
      },
      {
        "img_id": "ZjwKUTCwZ19uwTw0KhBFoQ",
        "caption": "Photo of Scoglio's Green Tree - Pittsburgh, PA, United States. Stuffed Sea Scallops",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZjwKUTCwZ19uwTw0KhBFoQ/o.jpg"
      }
    ],
    "user_id": "rCWrxuRC8_pfagpchtHp6A"
  },
  "OPOCN-G64_3_4Sz3dAHBXw": {
    "date": "11/16/2015",
    "text": "Has been a long time since my last visit.  Had a lunch meeting at Scoglio.   The restaurant has not been updated since before it was Soglio's, over 20 years is my guess; it could use some updates.  It is a popular place, was crowded.  Our server was friendly and did the refills but seemed to be in a busy and not to friendly mood. Fresh bread came out immediately and was welcome by my stomach since I as famished. My salad was good with an assortment of greens, with tomato and cucumber.  My crab cake was just OK.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 4
    },
    "photos": [],
    "user_id": "Lfv4hefW1VbvaC2gatTFWA"
  },
  "mTnSsY35kldJMfIYl486EQ": {
    "date": "12/20/2017",
    "text": "Our group arrived early for a bereavement lunch and Linda did her best to take care of us quickly. Lori was an excellent server for our large group and did a great job making sure everyone had what they needed.  From my elderly uncle to my young niece, and all of us in between, we were very pleased with the service and the food here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "j4L7n2vGeDJk_K0CmoaOpg"
  },
  "D6SsuZe--tKm2nhgLcCygg": {
    "date": "10/22/2016",
    "text": "Dining here was a bizarre experience.  I felt like I was at my Italian mother-in-laws house where the food is good and you are surrounded by grumpy women and tacky decor. The hostess MUST be family and/or owner because there is no way a savvy restaurant owner would employ this miserable woman to greet customers.  We arrived for a 5:00 dinner without a reservation after a 9 hour drive to be scolded by this troll, handed her business card and told to call first next time!  Too many other great places in this city to go back and put up with that kind of treatment.  Their \"regulars\" keep this place open but since they are all in their 70's and 80's I predict that in 5 years this place will be gone.  Do yourself a favor and spend your hard - earned money elsewhere.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "SPa1s75PY0acB6iFcPt4-Q"
  },
  "fTE9vBFWma2WASDg_rUGRA": {
    "date": "12/9/2017",
    "text": "I have placed Scoglio on the back burner of the many restaurants at which I dine.  I am going to spend my money at establishments which provide a warm welcome and an outstanding experience from start to finish. Great food is not enough to make a great meal in and of itself. When I am snubbed by a hostess at a Chinese buffet restaurant at which I am paying $6.69 for a quick meal in a casual atmosphere, it is one thing.  When I am snubbed by a hostess at a restaurant at which I am paying close to $100 for two for a sit-down Saturday night meal, it is another.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j1jXmA4__4UWIplZk6MJMQ"
  },
  "QZI7i_I_iahGSkceLRt99g": {
    "date": "6/19/2017",
    "text": "I was pleasantly surprised. In my area we don't have dinner establishments in a business park location. The food was excellent . The best veal Marsala we've ever had. The wine list is short but good and the service was friendly. It does seem to have an older crowd but for an Italian restaurant with a bunch of older Italians having dinner I perceive this as a two thumbs up.I would recommend this to anyone . And the back of the parking lot gives great sunset views.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "YC7HM2XfFs7IkP5WwMaIdQ"
  },
  "SfGAktqrDu-1EDm5PKAHKg": {
    "date": "8/3/2016",
    "text": "The fish (spot and salmon with vinaigrette) are really good. Service is also good. The risotto that comes with the food is okay and the bread doesn't taste fresh and was cold.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e_VJa6d-k1c81N4Fc_7Arw"
  },
  "q7loBR0I8hfETslRlJCS8w": {
    "date": "7/2/2016",
    "text": "Food was great, server and bartender were spot on! However, decor was confusing.  I thought I was walking into a nursing home cafeteria-not an upscale dining experience.  Would have turned around and left if I was not meeting for business dinner.  Not a place to take clients.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YgtozrSN_gOTliNh605EjA"
  },
  "_iy7RyT4qjcgF_aq2GSnXw": {
    "date": "4/13/2014",
    "text": "Diamond in the... Office park?  This is our place on Friday nights. Paul always makes my family feel like we're a part of his whenever we're there. My son was treated like royalty the last time we visited.   There's not a bad dish to be had. My brother-in law loves the swordfish, while I'm more of a fan of the simpler bolognese. You may be skeptical because of its location, but don't be. It's worth the visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "KtZjhrmMwluf3ESmN6UYzg"
  },
  "W9i4q3HSJlL9bJ3JxQ0PyQ": {
    "date": "2/22/2017",
    "text": "Meh.   Dirty and outdated decor.  Understaffed.  Had the surf and turf and I've had the same quality steak in Cancun and Jamaica.....flavorless.  The shrimp was chewy and twice cooked.  Like they used cocktail shrimp and reheated on a grill.  Super fishy tasting.  Avoid",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HDn1_QQQlr5N0B4t-7rcUg"
  },
  "F_ncWlHsmilnQaJSCp6EiQ": {
    "date": "3/27/2017",
    "text": "This is my favorite restaurant.  We have enjoyed many family gatherings at Scoglio's.  I recommend this place to everyone i know because you do not get this type of service many places anymore.  my husband has a very special diet, is very picky and they always make his food exactly as he asks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QRGI7Q6w89uHp6ZPPo77Fw"
  },
  "posm0k8UHmXGnVe-XuR9mQ": {
    "date": "11/9/2012",
    "text": "Awesome experience! My in-laws love this place and wanted us to try it. I have to say I  didn't expect much after reading the reviews. We were cheerfully greeted at the door and seated immediately. My first impression was how beautiful the sunset looked through the panoramic windows. The decor has an 80's feel but in a good way. Chairs are cushioned - soft and comfortable but perfect for the tables. We even joked about buying similar ones for home. A large chandelier dominates the ceiling. Overall, the restaurant was warmly lit, clean and welcoming.   My In-laws said they hadn't seen children at the restaurant before and called ahead to see if my 14 month old daughter was welcome.  And yes, the staff was fantastic with her. I'll think nearly every waitress stopped by to talk to her.  One even read her a couple pages from a story book.  Our service was great! The staff anticipated our needs by clearing plates and refilling drinks before we even realized we needed them. And I never felt like anyone was hovering over us.   Food - again great! We started with calamari, which was the huge crowd favorite, and zuccinni. Both were good and huge. We had a table of 5 adults and the 2 apps were a little too much though you would never know it because we cleared the plates! We all ordered something different for an entree, and happily agreed that we would order the same again.   Afterwards, the waitress took my left overs to the kitchen to wrap - rather than tossing me a box to do it myself. When I got home I noticed that she even covered the box with plastic wrap so it didn't spill in the car.   A real class act!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 10,
      "cool": 1
    },
    "photos": [],
    "user_id": "RyV9s9itlNQhBvrr2vyo5A"
  },
  "wm37lppEc_jb8hvDa1bZrw": {
    "date": "8/21/2015",
    "text": "Great food fast service ... Best Italian soon I the west end!!!!... I have ordered their fries zucchini and fried calamari both of which are unmatched in Pittsburgh..... Their salads awesome also... Definitely a great place to eat",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "c3feZVlnab1fb5qZfadAfw"
  },
  "HQsgUDQIyuUr9vxvhJYg7A": {
    "date": "2/5/2013",
    "text": "Awesome local Italian restaurant!  Great food and even better staff did exactly what all the other reviews said and were friendly and easy to talk with.  A little pricey but what Italian restaurant is not.  Thanks YELP!  TC",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LIhSfZsU7_Vtt7U0GoHCHQ"
  },
  "z71m6I4XInB5j8piCIf52A": {
    "date": "9/5/2019",
    "text": "I love this place! The food is always great and the service is awesome! I usually sit in the bar area, the servers take time to get to know you and remember your likes/dislikes which keeps us coming back. One of my favorite places!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BOmx0JP81clhtcFfYaPGng"
  },
  "JE43AgpOK6nm-O6voTf9sg": {
    "date": "3/1/2019",
    "text": "This place was good. It was convenient to access from Greentree and there was lots of free parking. The restaurant is kind of dated but the food was delicious. I was a little bit disappointed by the homemade ravioli which seemed to be a rather small portion for the amount of sauce and the price we paid. I was told I got the very last of it because the person who makes it didn't come into work that day. So not quite as fresh as normal. My fiance made her own pasta combination with mushrooms and chicken. She barely put a dent in it and had leftovers for 2 more meals. We may be back again, but only if we're in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "la8hDU4VinR6Zu-toURkrQ",
        "caption": "Photo of Scoglio's Green Tree - Pittsburgh, PA, United States. Mushrooms and chicken with linguini.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/la8hDU4VinR6Zu-toURkrQ/o.jpg"
      },
      {
        "img_id": "Jk61Qi9vIk5l6-5xUMQWdA",
        "caption": "Photo of Scoglio's Green Tree - Pittsburgh, PA, United States. Ravioli and sauce, minus the ravioli... Haha",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Jk61Qi9vIk5l6-5xUMQWdA/o.jpg"
      }
    ],
    "user_id": "sz1RIlawtaJzAhW9BwWeFA"
  },
  "mJJwkwCvatSMNcP2YQMhWw": {
    "date": "8/3/2019",
    "text": "Great food as always.  Chrissy gave excellent service.  This restaurant is a family favorite and never disapoints.  We love coming here.  Lovely dining room and atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yrCH4VrIt6EnicxJSCpRNw"
  },
  "qYkqMll1479bDy-aAzwviQ": {
    "date": "8/22/2019",
    "text": "We visited for a late lunch to meet as a small team for a few hours. They were beyond courteous over our needs and comfort!  The lunch menu is vast and certainly offers something for everyone!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M32QJ97npvkG2LlEdIV2Jg"
  },
  "WJIK5Sb5TGiwgUPencqEGQ": {
    "date": "5/1/2019",
    "text": "My organization held regular private meetings at this location. We held 7-8 meetings a year for 7 years with an average of around 27-30 members per meeting.   The food: If you like a slice of cheese melted on top of chicken with sauce, this is your place. It tasted mediocre, nothing to write home about. We couldn't try a lot of other options though, because the manager said she \"didn't make enough money\" on some dishes so did not allow us to order them.  The manager: Linda was rude and very difficult to work with. She requested communication with our social chairman via text messaging, only to claim she did not receive his messages (she had an iPhone that verified she received them). Multiple times she made changes without notifying us. If we asked for any changes or had a question, we were treated as a huge inconvenience or that our request was outrageous. Also, if our RSVP was more than one person off, we were told how disrespectful we were. We once had to set up the place settings as her staff was \"too overwhelmed\" to handle 36 members instead of the 34 we RSVP'd. That was after she told the late arrivals that they were not permitted to eat. A 10 minute discussion was needed before she understood that she was out of line and gave them food.  One example: We once had a member that was lactose intolerant. We asked about a dish containing cheese and told Linda that the person was lactose intolerant. She stated it did not have cheese but when it arrived, it was made with other dairy ingredients. When we brought this to the waitresses attention, Linda proceeded to blame us for the issue. A manager should have identified and prevented this.  It turned out Linda was treating us this way due to us \"crowding her restaurant\". I always understood this as a goal for most businesses. She also claimed we were disruptive to her other patrons. I find that difficult to understand as more than half of our members are above the age of 65, not the most rowdy of crowds. She kept this all to herself until one day she exploded on us.  Over the years, we have spent a large sum of money at this restaurant. However, we were treated as though they were paying us. I would not suggest booking a party of any kind with this restaurant.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "jFlrDfWW3_PHLVwb4At1mQ"
  },
  "oLkDxDJzlHCMznDpHfND8A": {
    "date": "1/10/2018",
    "text": "Very good food and fast/friendly service. Weird rule about not being able to substitute (even for a fee) wedding soup for the one they offer a cup of with your pasta (and warning, their menu link on their website starts out on the LUNCH menu), but the prices are well worth it. I got a TON of food including some of the biggest scallops ever in my Scoglio. Delicious food and large portions. I hadn't heard of it before it was suggested for book club, but it was really good.  They also have a ramp (completely unmarked - lawsuit waiting to happen) on the way to the restrooms, so beware!  I'm downgrading my review to 3 stars (from 4) after the management defended their ridiculous policy of offering one of their 4 soups (all the same price on the menu) for free with the pasta and not even allowing a substitution for another soup of the same menu cost for an up charge). We will NOT be going back. Plenty of great Italian restaurants in the area that are very good (and most of them are less expensive).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "tc79WBMQtLXX4nFp1rxGtA",
        "caption": "Photo of Scoglio's Green Tree - Pittsburgh, PA, United States. Soup included with pasta and wedding soup on the menu - though all soups are the same price, one cannot substitute any of the other 3. Nuts.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tc79WBMQtLXX4nFp1rxGtA/o.jpg"
      },
      {
        "img_id": "AYobbekSuqKU93T0O3f9bQ",
        "caption": "Photo of Scoglio's Green Tree - Pittsburgh, PA, United States. Scoglio with Capellini",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AYobbekSuqKU93T0O3f9bQ/o.jpg"
      }
    ],
    "user_id": "ZnIaEvJwrxlBUjimIpx2Qw"
  },
  "QRVmsY3ohP-BHVGhF34UEA": {
    "date": "8/6/2019",
    "text": "Waiters were attentive and thoughtful.  Veal Marsala was good and plentiful.  Sides of pasta was family style and distinctly not plentiful.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dgxX2hETMBY4Z1mfd6Y9Yw"
  },
  "ul2GG1kKdv-mRob1cU0PHg": {
    "date": "8/21/2018",
    "text": "Warning: HUGE 60\"+ TV at bar with Fox News playing loud and clear. If your a right wing type this is your place. Old decor, older crowd. Had the portabella capellini pasta dish, was fantastic. Issue was I was losing my appetite listening to the TV.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "YRbh2IAC6UbN8xUXECZnQg"
  },
  "r0Si4j5Dbanlau9L9PvkXA": {
    "date": "2/11/2019",
    "text": "We came here for an anniversary dinner. Everything was amazing. From our service to our food to our drinks! I got the Scoglio seafood pasta which was just amazing. The portions were huge, so I don't think I even put a dent in it! The location is a little hidden and hard to find - I thought we were in the wrong place since it's in a business plaza. The decor is a little outdated but I don't mind. I recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "scXixoPyudQlNi7TJ7WQ5g"
  },
  "243_6u7zJaK7iUV9cJ_g3w": {
    "date": "4/22/2019",
    "text": "Pass on the breaded zucchini. It's a huge portion but not anything to write home about. Fish dishes are just okay. Crab cakes don't have a ton of filler which is nice. Fried fish was okay and the Mac and cheese was standard. Some of the white fish dishes lacked flavor. I'd stick with the pasta or the salads.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AJ6oDR8G5eVbOLMvlZpKeQ"
  },
  "7Aaiwb7qCW-O4QlCCYBBKQ": {
    "date": "10/9/2018",
    "text": "The service was impeccable and the food was terrific. We brought the entire family together for a huge announcement and when the chef learned that we had two vegans with us, he or she immediately made a vegan friendly version of eggplant parm. Thus place is terrific! :-)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g5QSBG-usQ7WFnOGAaUVrg"
  },
  "gftCQwEcM8fROV02Ysxotg": {
    "date": "2/10/2019",
    "text": "Love this place!  Great service. You are able to relax and enjoy. Food is great, lots of choices. Best chicken prepared in different ways!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d0cvlePbZG1EoOCTuwCm-g"
  },
  "Qm9k4dnuVmtn09v3hRx_dQ": {
    "date": "7/6/2018",
    "text": "One of my favorite Italian restaurants around Pittsburgh! Usually eat in the bar unless we have a larger crowd. Try the Farlenese sauce, it's tomato basil cream and easily the most delicious sauce on the menu, but the meat sauce is yummy too. Another favorite of mine is the crab cake.  The homemade cheese ravioli are delicious as well. They also always have a variety of great specials to choose from.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "31PH59uQsAXBGxftJhbXuQ"
  },
  "BbmB1XID2SFLSye1lWTkxQ": {
    "date": "4/30/2018",
    "text": "I will say that the first time I walked in here about 6 years ago, I was pretty surprised at the rolling dining chairs and dated decor. However, every meal I have had from here has been delicious. It has impressed my Brooklyn-raised Italian family who had yet to find a red sauce they enjoyed in the Burgh. I almost always go for the seafood here (specifically the scallops - either the meal or the bacon salad) but my boss always goes for the veal, coworker gets the spots, and other coworker ventures mostly towards the crabcakes. Their chicken pastina soup could cure a cold. It is delicious! They have great lunch sandwiches also. They have always been extremely accommodating, even helping my handicapped aunt with access through the side door into the restaurant. I will say that while the decor is nothing to write home about, and that the clientele all seems to be older folks or business folks, the food makes it feel like home.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qBUpsQJdUrXhVVKM5S1vjQ"
  },
  "fukbyrtfSxY_NIDXebwdKQ": {
    "date": "2/15/2018",
    "text": "WOW. All I can say is wow. This restaurant far exceeded any expectations that I had. I was looking for an Italian restaurant close to home. The service was so on point, The waitress tried to meet our every need. The romantic atmosphere, the great selections. I love seafood,had a dish with shrimp,scallops and lobster with linguini in a tomato basil sauce,my husband had cheese ravioli, great dishes. The appetizer of fried zuchinni was so light and airy. Even the homeade ice tea. We will definately be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "QT9AxJiOHcf0SDO99OwyyQ"
  },
  "WK3rJTrvNrR4ASlU2Oa5UA": {
    "date": "2/18/2018",
    "text": "Call me a snob, but I was not a fan of the food at Scoglio's. My husband and I went on a Saturday evening and were not a fan of our dinners. The waitress and other workers were very nice, but it wasn't what we expected in terms of taste. Now, again, my husband and I are foodies, and have eaten all over Italy, so maybe this place just isn't for us, as it was packed on the night we were there....but both of us felt as if our meals were a resounding \"meh.\"",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qxWnJmASGRht_08h-4bO4Q"
  },
  "USYhVzSkV45DZNHrJq5PTg": {
    "date": "11/3/2018",
    "text": "Food was great. Dining room is very loud. Debbie, our waitress, was obviously in a hurry to get us in and out. Interrupted us several times to get our order. Abrupt. Rude. Basically awful. She should never wait on tables.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8JFEoPWoH32C8h-PjmobMA"
  },
  "YpcqrJrfClxhI3mDxacx3Q": {
    "date": "12/30/2017",
    "text": "Wonderful restaurant hidden in Greentree's Foster Plaza. Great food, fabulous service and always a warm welcome. Scoglio Salad is amazing as are the soups and pasta dishes. Phenomenal seafood! Highly recommended for lunch or dinner. Recently remodeled, too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "W4su_z7eAvBDEJRiyPGDUA"
  },
  "x9Q0K6qxtz37cBRlCqHMpA": {
    "date": "8/8/2018",
    "text": "My first time, bottom line - my server upcharged the crap outta me!  I ordered the Veal Parm (this was pretty yummy). It came with a soup or salad and a side. I got a tossed salad with blue cheese. The salad dressing was kinda runny and tasteless and an extra $2.50. Yikes.  But lots of restaurants upcharge for blue cheese and it was probably listed as an upcharge on the menu  so no biggie.  Then I ordered the pasta - this is the part that put a bad taste in my mouth (literally, since I wasn't a fan of the tomato basil sauce recommended by my server). The server told me it's a half portion when I ordered it. I said ok thinking the side was just small. However, when I got my bill I was charged for a whole second lunch worth of pasta. The server said she told me it was \"a la carte half sized.\" Now, I don't mind paying extra for extra food or anything - just seemed like I was duped into it. $25 later for lunch (with no drink) - I don't recommend this place and wont be back.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "QUhEAgPJhr2SgGIcmc5zcw"
  },
  "AkNgBDeYc50xdKaM3owryg": {
    "date": "12/29/2017",
    "text": "Great food & service, very generous portions, great prices. Seriously, lovely atmosphere & very clean.   Personal experience: I belong to a local group that had the annual holiday party there in early Dec and we all raved about the food: The Virginia spots, chicken parm perfect. Cheers for that! Easy choice for me to choose for a family party of  4 a week later. Our guests arrived early, waited for us in the very pleasant bar area (separate from dining rooms.)  The house soup, the scallops stuffed w/ crab meat fantastic, the veal marsala wonderful. Can't remember what the others ordered but was very good & generous. We all took doggy bags home. A note to out of towners, visitors who are staying in many of the local hotels in Green Tree please consider Scoglio's for a great lunch or dinner, Many wonderful & iconic places just down the road but why fuss with P'way traffic & parking issues?  My review is biased because I do live in Green Tree and I like to eat, shop & buy local, brag/ share about the best places in my community. Special thanks to Karen & Debbie, super severs who took very good care of our party. Disclaimer: honestly I am not related to or friends with any of the management or staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "hqCCI4v-2ozjyIUXNzFLKg"
  }
}