{
  "MxUY-E8HBa1QXE4GJ20RZg": {
    "date": "12/30/2016",
    "text": "Best Indian restaurant in town!! Food is delicious! The chili  chicken was amazing!!  The staff is so nice and the service is on point!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "do2X03UOYghnENXbP6HBtw",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States. Best Indian restaurant in town!! Food is delicious! The chili  chicken was amazing!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/do2X03UOYghnENXbP6HBtw/o.jpg"
      }
    ],
    "user_id": "BfmZea7a_pa_wDpxr-6kww"
  },
  "-wH1_nfp713x-3zLVDAPQQ": {
    "date": "12/21/2016",
    "text": "Just went here tonight and it was AMAZING! We are so excited to have this awesome addition to aspinwall restaurant options!  We had the vegetarian appetizer platter, two soups and two entrees. The vegetarian platter was SO good. The fried paneer was so delicious and nothing I'd ever had before.   My bf got Chicken Vindaloo, spicy 10. He had tears in his eyes by the time he finished. Super tasty and super spicy!  I got baigan bharatha on recommendation from the waiter.  It is not something I would normally order but it was out of this world good! One of the best Indian dishes I've ever had. Ordered a spicy 6 and it was the perfect amount of heat for me  If you're thinking about going here, do it! Food is amazing, service is friendly and attentive and it's BYOB with no corkage fee.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TrtGKhPUmbHpypkzo8CMTA"
  },
  "fZhd3FcTTKOZnQp4XLDH9w": {
    "date": "12/20/2016",
    "text": "I had the chicken curry and vegetable samosa. My Wife and i both loved the food! She especially loved the samosas and sauce. The curry was perfectly spiced for me. The chicken and rice were delicious as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sQnkMTCD-taELygcAok_8w"
  },
  "1wH9vFq57fjF8zIh9zcA0Q": {
    "date": "10/2/2017",
    "text": "This Indian restaurant is the tastiest place we have eaten lately. The wait staff is amazing. We had chicken Korma, chicken tikka masala, and the mixed grill. It came with rice and a wonderful garlic naan. We also had vegetable somosa and Gobi Manchurian, and for dessert we had rasmalai. The prices are not expensive, you get enough to eat, (and to take home!) and the food,as I said at the beginning, was the best tasting food I have had in a long time!! Definitely recommend this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bNxXEnpjR6-6bwbSZmPuQA"
  },
  "abpIndPKwrzfCoTnNkdrOg": {
    "date": "6/15/2017",
    "text": "Great addition to the area.  This restaurant is located where three others haven't lasted.  The lunch buffet is excellent with lots of choices.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zKOZ_Cv3fXI-uwlv4QIbLg"
  },
  "djrC1-YEYbVoCeipFjzu2A": {
    "date": "9/21/2017",
    "text": "I have been here several times and every time I have had amazing food and awesome service.  Lunch is displayed through an array of colors and flavors on their buffet menu.  Dinner is always relaxed either inside or outside on their patio.  Great selections of their menu.  My three year old and 10 month old love their food.  The staff remembers us every time and caters to our ever need.  We will definitely be back soon!!!  They are also BYOB with no corkage fee!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YdpQWlu1BDE_FCiTc_bSSQ"
  },
  "uyNcj-8mSGpAE3i2Bf9azw": {
    "date": "4/3/2017",
    "text": "This place has intense, really lovely flavor profiles! I would give it a 4.5 if I could, but Yelp only goes by whole numbers... Right from the get go, the papadum chutneys were delicious, especially the coriander one. Throughout the meal you could tell that everything was quite fresh, and each bite brought a bit of an explosion of flavor. This food is definitely spicy! Which I really enjoy. Honestly, we had a lot left over, and I've been enjoying it for days. Every day it's just as good, if not better! My small issues for the half star reduction are thus: the acoustics, the amount of smoke (from the kitchen area), and the amount of cream used. The acoustics in the restaurant are terrible; a few people make for a very loud room. That being said, they have a really nice outdoor area, so I'm sure that's great in the warmer months. The dining room also was quite smoky throughout our meal. I didn't even notice it that much until I went downstairs to the restroom and returned to a haze... they just need a better ventilation system. My final small issue is the use of cream. They use it liberally! And while it's delicious (of course), I wasn't expecting that much of it in a dish like saag... it also made the food very filling, which is why we had so many leftovers - not that I'm complaining about enjoying it for longer! It just wasn't expected, and I know my waistline doesn't need anymore help expanding ;) Again, all said and done, it's delicious and I really recommend giving it a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9z8jGHimbdno4SJGG_3esA"
  },
  "4WkxV8xVy7nRkMFMfk5QvQ": {
    "date": "4/26/2017",
    "text": "We had dinner for four there.  The food was quite good, with some interesting offerings.  The restaurant itself is pleasant, with a very nice outdoors eating area.  It is byob and they did not have a bottle charge or anything like that.  I appreciate that.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FAja8B0rEMX0cicuQuZLaQ"
  },
  "1_zWRK343mEy5_CpAbFhfw": {
    "date": "5/26/2017",
    "text": "Don't really get the very high reviews. Food was hot and fresh, and there was a pretty decent selection. Most dishes were quite average, with none standing out as good or great. Probably the worst tikka masala I've ever had. Giant eagle brand sauce in a jar has more flavor.  Tea was good. Scratched an Indian food itch, but I'm not clamoring to return.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XKtjOUqhHYndu__CYmsidg"
  },
  "MtZtZBeU00mvjyzuc1XZlw": {
    "date": "4/30/2017",
    "text": "Excellent lunch buffet with lots of vegetarian options! We will definitely be going back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YldgsjnWzqC1sVl4-FrQzA"
  },
  "0p04JZls8mPQakiSjPWroQ": {
    "date": "3/27/2017",
    "text": "Best Indian food ever! Ordered chicken masala, chicken makhani, lamb curry, daal, onion naan, garlic naan, roti and mango chutney. All delish! Going back again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G911aHUrGq0d7Vzv1Si5Jw"
  },
  "jjwoTtJraDI1uFqGF-41Rw": {
    "date": "4/6/2017",
    "text": "Maybe a la carte is a more hospitable experience.  The lunch buffet was mediocre at best.  While their sign says they serve til 2:30, don't let that reel you in.  By 2:10 the cook staff are serving themselves.  Nothing is refreshed or replenished within an hour of the end of the buffet.   Perhaps it was the soccer game on in the bar area that made the waiters routinely remind customers--we close at 2:30.  Places like Tamarind, Taj Mahal and Indian Palace are far superior in both the quality of their cuisine and in the sincerity of their hospitality.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qcyJEGA2WrBcjHEbiJ_Leg"
  },
  "-26588eWNmycrs6aw-V7pQ": {
    "date": "1/12/2017",
    "text": "We had the cauliflower appetizer and the samosas.  The cauliflower was amazing.  The chicken makhni and palak paneer were delicious as was the lamb biryani. So happy to have an Indian restaurant in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FBBy39Pj2xQE1Q-mURZGTg"
  },
  "PmHPKvCtNTXGAcj3pdAXyg": {
    "date": "3/9/2017",
    "text": "Food is amazing. Different vegetables have different gravies and different taste. They have the whole bunch of authentic food. The staff are really good and show respect to the customers. You should definately visit the place again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ntm9yPOqnjmphenzwq-ibw"
  },
  "OdulkMAtLM6CYO4AO0EKWg": {
    "date": "2/26/2017",
    "text": "Good basic Indian food. Went to the lunch buffet. No spice level at all so would be good to take first timers for a variety of Indian cuisine. Raita has too much raw onion for my taste. Biryani and chicken dishes were OK.  Next time we will order for dinner so we get a better spice range. Pakora and samosas were cold and lost their crispness on the buffet. For buffet, Taj Mahal has the better option. Will try for take out and review again",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O-frog8VhICKAT0grMKiwQ"
  },
  "K5Vll_ShugzOVLZbe_7pRA": {
    "date": "3/10/2017",
    "text": "I love Indian food. I have also lived in India for a short time. In the US, Indian food is pretty standard Americanized Indian food. The food here was standard. Each table receives roti and chutney to start with. The vegetable samosas were good. The palak paneer (spinach and paneer cheese) tasted like it was canned spinach. The naan was very good. My stomach did not enjoy the meal... The service was good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "AemcaZdZBVW7sO9KsT3UnA"
  },
  "v_61oL49mdIskRz7dIsD8Q": {
    "date": "4/25/2017",
    "text": "Perfect food for the healthy diet. Plenty of plant based items to choose from. Wait staff and management are kind and accommodating. Great place all around!! Will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "p8DS5p4jkiQGehWnT-P5_Q"
  },
  "4HaUiQU1UclM92IAMdGzbA": {
    "date": "8/24/2017",
    "text": "Awesome experience for a first time Indian food eater. Cool outdoor environment and BYOB. But above all else, our waiter was top notch. He made us feel comfortable about the menu, gave recommendations, and made the experience a blast. And there was a nice amount of food at a good price! We will certainly be back to this gem!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wuuE6UnZV3oBbEA2YJW1VA"
  },
  "vPmrZfEbWXpMH0zv1RkqUQ": {
    "date": "10/8/2017",
    "text": "Best Indian food around. I've never had a bad meal and their customer service is excellent. Real people making really good food. I hope they continue to do well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8sVC9M5PoY_KrqfrYGaTIQ"
  },
  "9q85N1tEuDVAZCWZc3lNEA": {
    "date": "2/25/2017",
    "text": "Excellent food and outstanding service! I love it and cannot wait to go back again. The owners are delightful and such great hosts. They care about customer service and strive for perfection- it was evident in every aspect of our experience. A+++",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "FwNW5K4Aj1FuJ8pDhZ0GMQ"
  },
  "ikfu0cyUkElIA54vzNejDg": {
    "date": "5/15/2017",
    "text": "So nice that there is an Indian lunch buffet on the weekends! I'm not that great at ordering Indian so I really appreciated having all the options available to me. The chai tea offered was incredible. Other favorites were the curry fries, lamb vindaloo, and butter chicken!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sr696bqeUXLr7rB3iIvQlQ"
  },
  "N3sA9J8N-8fKi4ihyIe2IA": {
    "date": "8/19/2017",
    "text": "They're fantastic! Don't listen to anyone who says it isn't flavorful or delicious. & anyone who said their entrees aren't spicy enough have no one to blame but themselves: You Set The Spiciness of Your Entree! But everything is delicious & flavorful. The staff has always been attentive & polite. The lunch buffet is set to a lower general Spiciness but still delicious & so many options! Dinner can be a few bucks (rather relative) but the lunch buffet is extremely affordable at $10 for adults, cheaper for kids as I recall. Lots of vegetarian AND vegan options!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lOtrfiL41pmlQCdFIL2sFQ"
  },
  "vc51eItz0vSiITkWbk0rVQ": {
    "date": "12/30/2016",
    "text": "Everything on point. Tried Chili chicken, chicken makhni, paneer shahi korma, and kofta with garlic naan.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VyFQoeWOU9B5nCW1PiE0PQ"
  },
  "vBFs5UmqSFJoVCpX1Lk1Ow": {
    "date": "1/14/2018",
    "text": "Great food with a variety of unique dishes! Excellent brunch with so many offerings and warm naan served! Meal and service were wonderful. My favorite was the palak paneer.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yCnJY1yi0PcAzNiE1NpluA"
  },
  "x1Aw-H4D3KjwLhC6nc1Afg": {
    "date": "4/6/2017",
    "text": "By far the best Indian restaurant in the burgh! Lunch buffet has a nice variety of dishes. Dinner menu has a great selection of quality Indian food + the place is BYOB. Our to go place for Indian food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0h3BONM1PfKxASGAvPtY4w"
  },
  "ftjY_3I6tGhTSaiFVg0eIQ": {
    "date": "1/23/2018",
    "text": "This Is the first yelp review I've ever written, but this food deserves one. It was the best takeout I've ever had. It was my first tome eating here and i couldn't be more impressed. verything was delicious and tastes homemade. The ingredients were fresh, the service was excellent, and I'm upset I didn't get more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R14Q1EPmv1uJVbgDMPFsVg"
  },
  "8X-HaVh0a-WXE9rmXGA37g": {
    "date": "2/26/2017",
    "text": "We've been here 3 times for dinner, and every meal has been excellent. We've really enjoyed the vegetable samosas and pakora for appetizers, and the mixed tandoori grill is delicious with its blend of fresh chicken, shrimp and lamb. We love spicy food and have found that their \"6\" or \"7\" are plenty hot. The very reasonable prices and the fact that it is BYOB bump this restaurant up from a high 4 stars up to a well-deserved 5 stars in my opinion.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dnPpFc0EV_xH-wo8E2gXGA"
  },
  "homB08_X3c8w3oVYdcaQRw": {
    "date": "1/16/2017",
    "text": "Went with my daughter for lunch buffet.  This is our favorite Indian buffet to date--delicious vegetarian and meat options and the food was freshly prepared and hot.  There were four chicken options on the buffet (mango chicken, chicken tikka, chicken tikka masala, and tandoori chicken) as well as veggie options (e.g. Malai kofta, muttar paneer, and a few others), fresh salad and pickles/chutney/sauces, and several appetizer options (samosas and pakora).  We had to wait a few minutes for some of these things to be refilled but it was a small price to pay for a hot, fresh samosa instead of a gummy, lukewarm one, and the waits were not long.  Fresh bread (plain naan) was brought to the table.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "amIZAs1U-ooyHYLdobV-UA"
  },
  "H7w14Q7oJpNnzFFkIzJEKA": {
    "date": "1/8/2018",
    "text": "Born and raised in Pittsburgh, my family has tried every Indian restaurant that has been around this area and we hands down feel Spice Affair has the best taste True to our Indian/Desi authentic foods.  The service and staff are commendable and very helpful especially with suggestions and special requests.  Always happy and smiling and friendly.  Not really found in other Indian restaurants (even ones I've tried in other cities and countries).  Would highly recommend it- and if Indian customers are recommending it, you know it's damn good :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H6IWvygJ4FBVx1CHYpbFRA"
  },
  "LEdRua53-7N2Ugputj10Vg": {
    "date": "12/30/2016",
    "text": "Amazing food and staff is very nice and courteous. We were here for my wife's birthday and we loved the food. We ordered Chicken Makhni and Malai Kofta they were really good. Service was quick.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dul-b9eopH9YtUUZMeN69A"
  },
  "jwbNkHdcn7XH47lNAqz0vA": {
    "date": "4/12/2017",
    "text": "I'm on Yelp, browsing countless reviews, an unhealthy amount during the day. Many of Pittsburgh's restaurants have tempted me to actually write a review but I'm typically too lazy to commit. Until now. (Keep in mind that last night was my first experience with Indian food, so I don't have any reference for comparison).   The restaurant is BYOB, which is always a plus in my book. The ambiance is cozy and the restaurant was very clean. There is an outside awning-covered patio available for seating in good weather. From the beginning, the staff was extremely personable, friendly, and helpful. Once seated, our food came quickly and was honestly INCREDIBLE. My boyfriend and I shared an order of Shrimp Pakora for an appetizer; it was the perfect way to start the meal. For my entree, I ordered the Chicken Makhani (butter chicken) at a spice level of 3 out of 10. The spice was very appropriate (it should be noted that I am a complete sissy when it comes to heat). The flavor of the sauce was the real star - I ate until I was physically uncomfortable. The garlic naan we ordered with our entrees was perfect for eating on its own or for sopping up the generous portion of sauce we received. The portions lean toward the big side, in my opinion; I had enough for lunch the next day, which I'm eagerly looking forward to.   I honestly can't wait to return (and already have plans to go tomorrow) and try more of their extensive menu. This place is an awesome addition to the already immensely charming Aspinwall. Go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VZJQyci9Lhg4QANZQJQ2TQ"
  },
  "rPxvbbRtQSV0svR2Llse6w": {
    "date": "1/28/2017",
    "text": "This is new and a welcome addition to the neighborhood. Very tasty. Spacious so you can get a table, a bit noisy but not overwhelming. The food is authentic and very good. A little bit sweeter than I like, and \"medium\" is not spicy enough. But flavors are very savory and cooked well. Service was prompt and friendly. Family owned, a plus. Overall very good and will come back, but only rated 4 stars compared to our favorite Bangal Kabab House.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g7fPWlhCztg9xBFpi5NpAw"
  },
  "R_RCfXtgTkOAxqlfDxljyA": {
    "date": "1/25/2017",
    "text": "Great food. So happy that there is a good Indian restaurant in FC area. 1st time was a home run. The Tikka was awesome",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "71DxavFEGk3BPY5gG-XoKA"
  },
  "xFqSnuuouFN5LD22rbxUmQ": {
    "date": "12/31/2016",
    "text": "My mother and I came for dinner tonight and we were so pleasantly surprised that we were offered the buffet for $19.99 per person. The selections and the preparation were both amazing. I really had a taste for Indian tonight and it perfectly exceeded my expectations! We can't wait to come back please see the following photos for more information",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dAzv715wNUOqHrLSzDdaPw",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dAzv715wNUOqHrLSzDdaPw/o.jpg"
      },
      {
        "img_id": "Ta1eB-fScNX2wl0bkODYDg",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Ta1eB-fScNX2wl0bkODYDg/o.jpg"
      },
      {
        "img_id": "S-nDNQXoL7UpTL54yi-Ikw",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/S-nDNQXoL7UpTL54yi-Ikw/o.jpg"
      }
    ],
    "user_id": "xxElvGY21ujS-b79sgBG2Q"
  },
  "OjBhnfOR-w6xSgDBC6TONA": {
    "date": "1/20/2017",
    "text": "The food is delicious! That's usually all that you need to know. However, this restaurant also features a warm & lovely interior, multiple rooms and seating options, and the family that owns and runs Spice Affair are the tops. They have been taking care of us for years at the People's Garfield location. So seeing a new and slightly more upscale - without being stuffy - and even more welcoming new endeavor is just wonderful. Can't wait to come back next week!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K96BWvBK8cx5detU2MQ_-A"
  },
  "92do6uKoD_ZE7PtYW6Ju8Q": {
    "date": "11/20/2017",
    "text": "Spice Affair has got options on options.  I didn't see the buffet option for dinner.  But the place was packed.  In comparison to downtown Indian food, Spice Affair has better quality and variety.  I liked their cheese naan and goat curry best.  The chicken soup was also very nourishing on a cold day.  I plan on coming back to try the rest of the menu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "evxG8WxjD7r0Z7XIjXWHmQ"
  },
  "oKcKPP_yYnxbnhQuMFq9EA": {
    "date": "3/27/2017",
    "text": "It is great to have a new Indian restaurant in the neighborhood. I hope this place last as it was dead when we stopped in on as Friday night. The portion sizes are enough for 2 and the spices were on point. I was a little disappointing with the Gobi Manchurian as it was a bit soggy for my taste. I will be back to try the buffett.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "z2YVGKKcup6mjQmDQ6arEg"
  },
  "Mrrk0RcIAT4gkZouMUBBwQ": {
    "date": "1/11/2017",
    "text": "I am not the biggest fan of Indian food. I think you need to know that before reading further. This place is really good!! Great flavors with a terrific selection. Great for veggies. The staff was super nice and helped me to find good options. They are BYOB for now. Oh....The spice level on each dish can be tailored to your palate. Try it! I think you will be very pleased with this new choice in Aspinwall.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "BJUY0UadA-STNQfNGnpTjg"
  },
  "H9zV4F7gc2v-sf-5bBeIAQ": {
    "date": "12/1/2017",
    "text": "I am not the biggest fan of Indian food, but when I am in the mood - this place hits the spot. I have had a number of dishes here and thought they were all very well executed. I like the experience of eating in since you get all the dips with your naan, but we have enjoyed takeout as well. Happy to have it as an option in Aspinwall.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "WQehNNdRkPD5WPqjc51-LA"
  },
  "lDG--RIO-lQLwSYhNzcKnQ": {
    "date": "2/22/2017",
    "text": "I was home visiting family in Pittsburgh and was thrilled to see an Indian restaurant easily accessible to the Aspinwall/Blawnox communities.  Their buffet has a nice selection of dishes you traditionally see at Indian buffets - not many surprises.  All were done well though it would be nice to see homemade samosas.  The smallish bite-size samosas seemed pre-made and had more of a filo dough outside. However, the giant pakora more than made up for it.  They had quite a few chicken dishes, and the chicken tikka masala was spiced nicely for a buffet.  However, it would be great to see a few non-chicken dishes too in the future.  Perhaps some Aloo Gobi and a few more vegetarian options.  The restaurant itself has a polished look.  It's possibly the first Indian restaurant I've visited that has a shaded patio which will be especially nice during warmer weather.  Bathrooms were spotless and roomy (always a plus).  Good luck to the owners of Spice Affair for taking a chance in this neighborhood!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lE26_anRJgsJtvMQn9Jxfg"
  },
  "8kWsB9JnkYUQyrirvQ9fOg": {
    "date": "11/21/2017",
    "text": "Came here for a quick lunch with my coworkers, and we opted for the buffet. We came just as they opened so it was strange to me that most of the food was already lukewarm. They had a decent size selection with all the standard dishes (except no saag sadly). I thought the food was just alright too, temperature aside - I wasn't blown away with the quality of the food and I've definitely had better Indian buffets in Pittsburgh.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wgTvhNy5-Q1razSWHhWs9w"
  },
  "XxA_rOCwV13N2EM6a1VJcw": {
    "date": "3/2/2017",
    "text": "We had a great experience at this restaurant. Our server was so funny and personable I would go back just because of him.  Our food was pretty good. The biryani needed some work but our korma was decent. The same family owns people's on penn Ave so the food is pretty much the same. The highlight of our meal was the appetizer sampler",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "omwBX6tSFifgJ4xZU8a1CA"
  },
  "slP0CEjLEmGEauNlxJijUA": {
    "date": "12/21/2016",
    "text": "This is a welcome addition to Aspinwall's little downtown scene. We came for the buffet, which is only offered during lunch time. It's not the largest buffet in town but has enough variety to offer enough for everyone and is priced right ($9.95). The buffet is about the size of Prince of India's (downtown on 5th) with similar selections.  Vegetarians will be happy to see several options for them on the buffet (vegetable samosas, pakoras, potato curry, mixed vegetables in cream sauce, aloo phalia, and a small American salad section) along side the usual chicken-based dishes (tikka masala, butter chicken, chicken curry, malai kebabs, tandoori chicken). Everything tasted fine for my white-boy palate but perhaps just a little too mild, as buffets often do to accommodate everyone.  The restaurant is new (and therefore quite clean) so there were only two other parties seated in the dining area but our host was friendly and attentive to all. The tables all have elegant tablecloths and the atmosphere is slightly upscale but we weren't the only ones there in jeans and a sweater. The place is casual enough for that.  If I had my choice, I would choose All India (N Craig St) and their buffet every time. However, I live within walking distance of this new place and will be happy to patronize them regularly. They have an extensive dinner menu and deliver as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GkE5ssiGzOTwqPwMaT_pBw"
  },
  "fkdVrPkQLKF8fjZJaYTMww": {
    "date": "12/31/2016",
    "text": "Very good Indian food.   Clean inside seating,nice outdoor seating once weather warms up.  Workers are very attentive and friendly.  Pricing is very affordable and the portions are generous.  Went two times already, some variability in the spice \"scale\", but otherwise a great restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "g1fwdKZT1uCD5_Wek0JCVw",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States. More dinner buffett",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/g1fwdKZT1uCD5_Wek0JCVw/o.jpg"
      },
      {
        "img_id": "EmOxdtem3uzafYkLmJ2m5Q",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States. Buffett-- really good Paleek Paneer, Chicken Tikka Masala and more!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EmOxdtem3uzafYkLmJ2m5Q/o.jpg"
      },
      {
        "img_id": "cam62ihuNM7XZTC0Ga0Xfg",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States. Dinner buffet for NYE",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cam62ihuNM7XZTC0Ga0Xfg/o.jpg"
      }
    ],
    "user_id": "oYQ7MgPOQSgwYAlZ-FNu-A"
  },
  "77DRlnGhzvJTmgG0tmdhgA": {
    "date": "7/12/2017",
    "text": "This was so disappointing because we drove 2 hours directly to come here and arrived at door at 2:20 and told buffet over. Although sign and online said until 2:30. I get you have to start shutting things down for a buffet but BEFORE advertised time? Come on. Put buffet is until 2:00 then to clear by 2:15 if that's the goal. Not before customers expecting to be open. Plus we paid for parking.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "MIS7Bsgzrmnl17_4vVK3Pw"
  },
  "RMpoNi5-eVy2LIrFYgnqFg": {
    "date": "5/22/2018",
    "text": "Consistently delicious! Clean restaurant and delivery is timely. Don't feel like gross meat is hidden in the sauces. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WUwIekZis7huPymVL26KVA"
  },
  "hCR23UFGo8eHJQH4kuZYFw": {
    "date": "12/23/2017",
    "text": "Biryani contains dry fruits in it... The rest rooms are not need... The taste of the food is horrible",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-e_VRRaMK42Sr-uf78PiWQ"
  },
  "qleot2hSvVWJUAs5BoN7Bg": {
    "date": "8/31/2017",
    "text": ";place was really nice and clean food was amazing and prices are good. I had the buffet and will get it again. server was great and friendly. A must stop if in area or looking for Indian food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oGvs4aDSHrd76hPo073F1g"
  },
  "_WhkaD7bNhameIz8Lc73Hw": {
    "date": "7/2/2017",
    "text": "Wide variety on the buffet especially for a picky eater like myself. Can't beat the lunch special and great service. Will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "KN8PAZ4FkcWOQqg_N-23TQ"
  },
  "ZME8NitBPDqGekvFbGDNEQ": {
    "date": "12/3/2017",
    "text": "I was looking for a good buffet closer to home for that brunch excess on an occasional weekend, and discovered Spice Affair! Great selection of meats, lentils, veggies and desets, and very authentic north Indian flavors. Been back a couple of times since then, and the quality seems consistently good. A very good find, and at $9.99, a great bargain!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tBzNVcNMipEZ539DbtI2CA",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States. Great buffet selections!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tBzNVcNMipEZ539DbtI2CA/o.jpg"
      },
      {
        "img_id": "eTGe6v-bxd-KTzAubOv-VQ",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States. Great buffet selections!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eTGe6v-bxd-KTzAubOv-VQ/o.jpg"
      }
    ],
    "user_id": "7GkPz7xjKSSmsxi3S80HTw"
  },
  "wgu0xLUQEW5WsAZRVbsNOQ": {
    "date": "3/18/2017",
    "text": "Ordered food from here 3 times so far and finally went to go dine in here. Food has been amazing every time. Very welcomed addition to pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "oyCsqlq7UnyZzl9WVcRyqQ"
  },
  "j7bTnG-aZAi9rdqf9cmmqw": {
    "date": "4/15/2018",
    "text": "Good service. Food ok. All around this restaurant was just ok. I'm not an Indian food expert, but have enjoyed many Indian restaurants in different cities. We ordered about 6 dishes, none of which were memorable. Nothing was very spicy, which is kind of ironic given the name of the restaurant. The atmosphere was pleasant and the service was very friendly and attentive.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bRN42wJnFMJzY4ZzKqqz1A"
  },
  "HDMJI6ocpvcB4MLmTT12BQ": {
    "date": "8/5/2017",
    "text": "BYOB  Arrived for the lunch buffet @$9 each.  There was a decent amount of selections in their buffet.  I wish I would have written down all the dishes but I do think they change them up daily.  There is hot and cold dishes, salad, soup ad naan bread.  All the dishes were clearly labeled, full of flavor and none of them were too spicy.  I did try a little bit of everything and it was all delicious.  If I was to guess, there was probably around 15 different options plus, salads and dessert.  I would totally recommend going for the buffet and trying everything ....  I'm pretty sure you will be delighted.  I did take a look at their regular menu, it is pretty extensive with a lot of vegetarian options.  You can also take out from the buffet at $5.50 lb. The place was very clean and the service was friendly and attentive.  There is outdoor seating with an awning.  Parking is metered and on the street.   Very good food, lots of options and the buffet is wonderful.  Don't miss out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DO3TIDmqypuGlwKfpZqG6A"
  },
  "7JJqkOoJKPanV94lo4GOrA": {
    "date": "5/12/2017",
    "text": "I've been here for dinner and lunch. The dinner entrees and the lunch buffet were both very good, probably some of the best Indian food I've had in the Pittsburgh area. The staff is also very friendly, and was happy to go into detail about various dishes to help us decide what to order for dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OkHFIaLJH7zTCNhzLV4lAg"
  },
  "78FC5MQKHHTxgjjsBWmcnA": {
    "date": "3/18/2017",
    "text": "This place is a gem! The servers are personable and the food is more flavorful than any other Indian restaurant I've found in the region. They make all of their own spice blends fresh and I could really taste the difference. We are so thrilled to have found Spice Affair!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hrUFEModQ73A5B5Q_YRQhQ"
  },
  "neRUi4dRDijK9Iw6GfZoWg": {
    "date": "10/26/2017",
    "text": "Bring on the buffet! As a person who isn't very familiar with Indian cuisine, Spice Affair was the perfect place to eat. Lots of variety from rice pudding to salad to curry chicken. A group of 5 was seated near the window overlooking the beautiful Aspinwall neighborhood. Lots of parking around (and a lot) and greeted immediately with smiling faces. If you're looking for a unique Indian dish, try the Spinach Pakora with Tandoori Chicken! I'm so happy I found this little spot to go to and if you need great Indian food, stop searching and go here now!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "RwnPg2JLpDsc0HM2N0L_XA",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RwnPg2JLpDsc0HM2N0L_XA/o.jpg"
      }
    ],
    "user_id": "zg6LAy9gGLVH9JtcYP9gJg"
  },
  "VJs5A3Uemz-OiVmyD0gJ0Q": {
    "date": "5/17/2018",
    "text": "An okay Indian place. Staff are always friendly and the service is good.  Not very impressed with the food though. Their chaat snacks are good. But I've never been impressed with any of the entree dishes or their biriyanis. Foodwise, there definitely are much better Indian restaurants in Pittsburgh.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0U6xD-bVms1uG8AR4P5rag"
  },
  "5ZQsVRJX4rO6RpVt4znoqw": {
    "date": "10/7/2017",
    "text": "Delicious!  I do not consider myself a learned connoisseur of Indian food, despite one of my best friend's mother's spoiling me with amazing home-made dishes throughout my College years, but I will say that this place was amazing!  It's a nicely situated space, right on Brilliant Avenue in Aspinwall. Street parking isn't difficult, and it's free after 5, I believe - make sure to check the meters because you don't want a ticket! If it's nice out, sit on the deck; ignore the trains that pass by as they are the price of your enjoyment and to be honest, aren't very frequent. We only had one go by, right in the beginning. The deck is nice, and it's fun to people-watch. Seriously, sit outside and enjoy quaint Aspinwall.  The menu is intimidating has hell, but I bet that folks who know their Indian dishes would feel very comfortable with it. It's like 500 pages long. I still found bliss in it, though. Can't go wrong with some samosas, naan, and chicken tikka masala if you're not yet facile with the huge selection.  Now, your waiters will probably tell you that their portions are reasonable. Don't believe them!! They are lying - the portions are Pittsburgh-sized and will bust your gut! Don't worry if you over-order like we did, though. We took home 3 boxes of that deliciousness! (All kidding aside, they don't try and upsell you or push you into things - they are super nice, and will definitely help you with your selections.)  They do like their spice, so unless you are very experienced, don't go hot! I found everything to be super tasty at the mildest level of heat, but more sensitive eaters might want to have a taste of someone's food before committing. My kids did perfectly well at spice level 1.  Their rice is great, as were all of our dishes - tandoori chicken, chicken tikka masala, aloo mattar, and chana paneer were awesome. The Samosas are enormous - there's no way a normal human could eat the two that come in one order. Well, maybe Kayser Soze could, but I'm pretty sure they said that Chuck Norris gave up after eating 1.5 because he was so stuffed. Don't eat both - you won't eat your dinner. Trust me.  The naan was delicious - as one might expect. It had a nice mix of char and buttery flavor to it, and was wonderful to use in consuming the delicious choices as we made our way through the meal.  Overall, a flavorful, fun, and good value for a nice night out in Aspinwall. We shall definitely be back - it was great. Oh, and try their mango beverages, too. Delicious! I hear their lunch buffet is insanely good - hmm... will definitely be back for that!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4r33dXcE1oYZxjONrhxTiA"
  },
  "Rp_FEgHhGB2SunlPA7D9Ew": {
    "date": "4/25/2017",
    "text": "I was ecstatic to try Spice Affair but have to say, I was very disappointed. The stars are for the effort the waitress put forth, but the experience still fell very flat.  We arrived and were one of only a few tables occupied. We scoured the menu, there around 90 options if not more so making a decision was pretty tough to narrow down. Nothing is labeled as vegan, only vegetarian but it seems they can accommodate dietary restrictions for the most part.   We ordered two entrees, naan and two garden salads. The salads and Naan were to start and to be followed by the entrees and rice that it comes with. As everyone else around us was served their fragrant food, we drank water and stared at our empty plates.  40 minutes passed, and they notified us that some employees had called off, which was understandable. Unfortunately as soon as I heard someone who just walked in order the same dish we did, and they rushed in out in less than 5 minutes I grew frustrated.  When our food finally arrived, it was simple and one note. It tasted exactly like dishes I've eaten many times before. The salad does not come with dressing, only a lemon to squeeze on top. The naan was thin and dry, likely because they had to omit the butter (no vegetable based butter available to my surprise). And I hate to say it, but the chickpea masala was identical in taste to a frozen dish I buy from Trader Joe's.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "LyOvu_aELfY7XEBnJycW9Q",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States. Garden Salad (doe not come with dressing, only a lemon).",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LyOvu_aELfY7XEBnJycW9Q/o.jpg"
      },
      {
        "img_id": "lKyepP-0fWHCO5R5uTON2Q",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States. Vegan Chana Masala",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lKyepP-0fWHCO5R5uTON2Q/o.jpg"
      }
    ],
    "user_id": "QDZ7U3gcZap4MJrWzOWCPA"
  },
  "nhXe0wGNunC5o-yNKGDTsg": {
    "date": "3/30/2019",
    "text": "Cozy setting.  Outdoor area is enclosed and can contain kids decently.  Everything has been delicious on our multiple trips.  I like their spice blends and I like that the meats are cooked to almost fall apart in your mouth. It brings back fond memories of dinners in college with my Indian friends.  One of the best restaurants for Indian food that I've been to in Pittsburgh.  I can't wait to try their buffet and sample more!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rKfbo4Pe_T0ZCH2y9i3YQQ"
  },
  "WojTSOlQMQjj1YKFuncKfA": {
    "date": "2/6/2017",
    "text": "This is one of the best Indian restaurant experiences I've had in a long time.   Food; variety of Indian dishes spanning all points of the continent. Food was hot, fresh, and at the exact spice level we requested. The Baingan Bartha and Samosa chaat in particular were the best I've ever had; easy to eat and perfectly prepared. Portions are enough for 2 people. Even the naan is thicker and larger than other places.  Location: easily accessible from the highway and only 10min from downtown Pittsburgh. Convenient street parking. The Inside is clean and modern w/ traditional Indian accents. This place easily works for a causal dinner with friends or an intimate setting.  Service: This staff understands customer service; they were organized, attentive, friendly, professional and truly add to the experience.   This place is a Can't Miss for Indian food in Pittsburgh!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 8,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "2OB3nPnOGxmC6UwwyOZDjQ",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States. Chana Paneeer",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2OB3nPnOGxmC6UwwyOZDjQ/o.jpg"
      },
      {
        "img_id": "tKlqHDGLZPHSWVcZUlsdpA",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States. Aloo Tiki appetizer",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tKlqHDGLZPHSWVcZUlsdpA/o.jpg"
      },
      {
        "img_id": "9ouMe3a2QkdFIJ7kTF8gtg",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States. Shahi Paneer",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9ouMe3a2QkdFIJ7kTF8gtg/o.jpg"
      }
    ],
    "user_id": "RiW5gqBzM97uSqhQA0p0Ow"
  },
  "PNZDlx6t-uLWFkFM-j0RDA": {
    "date": "6/3/2018",
    "text": "My boyfriend and I's  favorite Indian restaurant in Pittsburgh. The food is exceptional! The atmosphere is superb. The wait stuff is Jiggy accommodating and pleasant. By far, the best Indian food you can get in Pittsburgh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "3G5u8x1YijMDqiZ0Lo94zQ"
  },
  "AUrbevQ3_N4lEY5AUQ56DQ": {
    "date": "3/18/2019",
    "text": "Finally went a while back (it's a long drive for me, but it was worth it). The food is great. Probably the best Indian food I've had anywhere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ag-R3bk0cTXhFvDzhBwDtA"
  },
  "1MM2kKBdUHiGi5aEXqS75g": {
    "date": "5/19/2018",
    "text": "When I went to spice affair to get takeout for my 91 year old great grandmother and great grandfather so they could try Indian food for the first time in there life time. The waiters and waitresses were very friendly the food was great and there was decent parking I will return very soon",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "YTuksHb6YsMI62BqEG_eRA"
  },
  "tdANwSpnssd9c2WzYmVgqA": {
    "date": "1/6/2017",
    "text": "Stopped by here for their lunch buffet and was not disappointed at all. Greeted warmly as I entered and tried various items on the buffet. Fresh hot and authentic Northern Indian food. I should know as I am Indian. My favourite was the malai chicken kebab and the chicken makhini was tender and flavorful.   The hot chai and rice pudding for dessert hit the spot. I will be coming back for sure. Great location in the heart of Aspinwall and only 10 minutes to drive from downtown.   Try this new place. The service and food is exceptional and I had great service by Vic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zQ3hw0Q7-mjPofGl5wKCcg",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States. Fresh hot tasty lunch buffet plate.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zQ3hw0Q7-mjPofGl5wKCcg/o.jpg"
      }
    ],
    "user_id": "cA8_7apjrrZouRuVwNZgFQ"
  },
  "fk4ygYok8zz_pnGaO4MOZw": {
    "date": "3/31/2018",
    "text": "I love Spice Affair. Just be aware that the menu prices on their website are grossly incorrect. They are at least 25% more overall.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9VBTIOO66O7G3f0aCcE_7A"
  },
  "JJg0PsB8xR2Kmr18QWrarg": {
    "date": "1/6/2018",
    "text": "The staff is super friendly, even when they're busy, and I can't believe how good their dishes were. I'd gone on the recommendation of friends that live locally and do not regret it!   Their samosas and aloo were top notch!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DzJopI8uiC-v_zZzR6DMgg"
  },
  "vt4c0HZaOpuTr6QlZYWNkQ": {
    "date": "5/12/2018",
    "text": "We had reservations the Saturday before mother's day. I must say the service was poor. No one came to our table for about 20 minutes. The server came over and dropped off a wine opener for us to open our bottle of wine. We ordered appetizers and it took another 30 minutes for the server to come and take our order. I ordered a 1 spice level and it was so hot I couldn't eat it. We were handed a check with our dishes not cleaned up. I think we we over charged for the bread but there wasn't anyone one around to question the bill. We were charged $4 for the sauces for the bread. I have never posted a yelp review but this dining experience prompted me to start.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Ycf-VA_zODVhh6U-eREvA"
  },
  "7u6bUeD_c6EpPWCdiOxGfw": {
    "date": "5/10/2017",
    "text": "We ordered delivery of a few items--lamb samosa, dal makhani, and chicken curry.  The samosas--the dough was a little thicker than typical, but cooked through. My biggest quibble with these was the amount of lamb...there was only an ounce or two of meat between the two samosas in the order, which I'm not sure rationalizes the $3 upcharge from vegetarian.  The dal was delicious, but be warned--it was not a mild dish. I hadn't put a spiciness rating on this one (all the dal I've had before has been \"mild\" by default), and it was just at the edge of my comfort zone (I usually get a 6-7/10 at Thai places).  By contrast, the chicken curry that was ordered at a 6/10 was quite mild, but it was still very tasty. There was a lot of sauce relative to the amount of meat, so much so that we froze some to make more!  The food was all pretty tasty, and Pittsburgh was in need of some better options for Indian food (I can only show up hungry at friends' house so many times!). But, if they plan to do a lot of delivery business, a little explanation on the menus for those of us ordering from afar would be very helpful. Also, I would LOVE the option to order naan instead of rice...right now you can only order sides or samplers of naan in addition to the basmatic accompanying your order.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ri4xmSrehzGEqbR1EWAhAw"
  },
  "jaiguLQcddV2TrUNhd1IQw": {
    "date": "4/28/2018",
    "text": "We moved into the Gibsonia area March 2017.  I immediately started looking for Indian cuisine near us and Google gave us a few hits, one of which was Spice Affair. It was a great experience and a delicious meal, we have enjoyed dining outside on the patio in front all spring and summer.   Our daughters live in the city so we've been coming to the burgh for several years before moving here last year and had tried several Indian restaurants, mostly in the city during that time.   Living in the suburbs now and without a doubt the Spice Affair is our go-to location at least twice a month or more. We also tried the the Indian restaurant over on McKnight and it didn't come close to the food quality or atmosphere.   We're not Indian food snobs by any stretch of the imagination, but we know what we like. We have other relatives up and down the east coast and have tried too many Indian restaurants to count, not to mention trips to Europe and even Indian cuisine in Austria of all places.   Our in-laws are Indian medical professionals and there's always great home-cooked meals to be had at family gatherings. Needless to say I believe we know what we like.   So we tried Spice Affair when we moved here last spring and have continued to enjoy our favorite meals there quite frequently.  The BYOB is a big plus and the staff will make sure you enjoy the dining experience.   I highly recommend them. You won't go wrong by choosing them. BTW, the lunch buffet is to die for. I work nearby on the RIDC campus and have lunch there when I can as well as the Indian employees in the office.   It's delicious food and priced very wel",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LwImFGL1rRHiJnD9wBHBow"
  },
  "vW_alfxCOhKBPZAhMv9E1Q": {
    "date": "1/1/2018",
    "text": "Horrible experience. We arrived New Year's Day at 5:30, shortly after they opened, since we brought our 15 month old with us for a family dinner. We were the first customers of the evening, so appetizers came out in a timely fashion. We got aloo tikki chat and chili paneer. The chickpeas left a lot to be desired, they were well-cooked but completely bland in a watery gravy. The aloo tikki had a mushy texture and a taste that was lost in the chickpeas (probably by absorbing all the water in the gravy). Chili paneer was so heavily breaded that it actually hurt my teeth to chew on the breading. It seemed like it was prefried and then microwaved prior to serving judging from the texture. The paneer itself was also very dense and rubbery, again a sign of reheated food not made to order.   That's all good and fine but our 15 month old started showing signs of exhaustion so we asked for our two entrees, navratan korma and shahi paneer to be packed. They had already cleared the appetizers and brought out dinner plates so we knew the food was ready and it was just a matter of transferring the meals to take out containers. After waiting a longer then reasonable time, I walked over to the server with toddler in tow to say \"I have an uncooperative toddler, which is why we asked for the food to be packed up. How much longer will it take? To this he became confrontational and started complaining that it will take time and it's all my fault because we placed an order for here and then asked for it to go. One of the rudest responses I've ever gotten from a server ever. To top it all of when we finally got home  there were two orders of shahi paneer and no navratan korma.  Bad service just got worse. And also note we were informed portions in the restaurant are smaller then if you order take out. Deceiving business practice if you ask me.   I would like to say this is my first and only bad experience with this restaurant. But unfortunately it is not. We visited in feb of 2017 shortly after they opened, while we were visiting Pittsburgh to search for apartments. It was a crazy busy Saturday night and it took them almost an hour to get us our meals. They were understaffed then just as it seems like there were tonight. We were very understanding then, It was a new restaurant and some delays were to be expected until they found their groove. But unfortunately almost a year later it still doesn't look like they've figured it out or have mastered customer service and professionalism when speaking with customers.   Shortly after moving to Aspinwall summer of 2017 we decided to order take out and placed an order for malai kofta and for paneer makhni . Take note that I'm from the NYC area and have eaten at authentic Indian restaurants all over the world from local joints in NYC or in queens, to Jersey City, Edison, Washington DC, Philadelphia, London and all over India. As well as, seemingly obscure locations in France, Peru, Turks and Caicos and Canada. I have yet to come across a restaurant that does not have paneer Makhni on their menu or doesn't make it (similar to Starbucks' secret menu) for those who ask. So back to spice affair, they heard me order paneer makhni but instead of telling me they don't or won't be able to accommodate the order they chose to substitute it with another entree that happened to have the same gravy as the malai kofta. In the end my summary of spice affair is it is an arrogant and amateur restaurant that needs to improve flavor, attitude, and service.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y4BSq68-jSIAyq52qyGHTg"
  },
  "YeVPVnGq0fUKufr9nuub_A": {
    "date": "2/27/2018",
    "text": "My husband and I had an impromptu date night here tonight, never trying this place and not even looking up reviews to see if it was good or not. We drove by it, saw the cute twinkle lights and Indian food sign and quickly pulled over. Sooo glad we did! We just moved to Pittsburgh from the west coast, we eat a lot of Indian food and this place is in our top 3!! The service is fantastic, and the whole staff is super friendly. Will be coming back for more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "zYeaXM86W6onX9Kmd8C0-w"
  },
  "qJ0WtVVsKRiBE0bXjaNazA": {
    "date": "7/24/2017",
    "text": "I was thoroughly impressed. My boyfriend and I came around 5:30pm for a Monday night dinner. To start, they bring you crackers with three different sauces to try. I should have asked what they each were, but they were all amazing! I ordered chicken tikka masala and my boyfriend ordered lamb vindaloo. The portion sizes were very large - I definitely have leftovers for the next day (which is a good thing in my book). Our glasses of water were never empty and they have a lovely patio that you can sit outside and eat your flavorful food. I want to come back for the lunch buffet soon! I only wish they had a dinner buffet.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XOWEP2gelH5PMNCFVJ4pNw",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States. The complimentary pre-meal sauces",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XOWEP2gelH5PMNCFVJ4pNw/o.jpg"
      },
      {
        "img_id": "w5cS_vkAZIjpqiMWQruryQ",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States. Naan basket (potato, garlic, and traditional naan)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/w5cS_vkAZIjpqiMWQruryQ/o.jpg"
      },
      {
        "img_id": "wB6q6L2ODL15skCGjO3R6A",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States. Chicken tikka masala",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wB6q6L2ODL15skCGjO3R6A/o.jpg"
      }
    ],
    "user_id": "BBg_86FEejn3dNzj0JOR9Q"
  },
  "sCKdcl59X5y403Q3ZJrngQ": {
    "date": "3/22/2017",
    "text": "Came here for lunch after having an early day due to my boss being sick to find that this place offers a $9.95 lunch buffet ($8.95 for kids) during the lunch hours (11 AM - 2:30 PM) on weekdays and weekends, which immediately perked my interest and led me to abandon all thought of ordering separate items from the menu (whoops :3 ... I'll have to do so another time haha) Was pleasantly surprised to find the number of choices available here food-wise. Lots of meats, lots of curry, lots of dessert options (oi!), and also salad bar is great as well. Food here is pretty fresh, great to taste (spice level they put in most items is just about perfect), and extremely filling (go for the meats!). Would like to see more meat choices if possible, service can be hit or miss in terms of drink refills (if they notice you or not, varies by how many people are dining in establishment at same time), but other than that, great thoughts about this place. Planning on making a return at some point to try separate menu items ... the possibility is extremely likely.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "jjrIRSQxenHchKwoIN1gWQ",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States. Sample plate from lunch buffet ($9.95 + tax)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jjrIRSQxenHchKwoIN1gWQ/o.jpg"
      }
    ],
    "user_id": "MLf4JUa1uzQkDLrBJ5yJHA"
  },
  "3_jLFYd42XHhdzNPyxwJaw": {
    "date": "3/8/2017",
    "text": "This place is hands down the best. I love restaurants that offer free chai during buffets! I am fighting the temptation to go back two days in row. The wait staff is super nice and funny!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "XImR8FdsuTMorIXcmBN4Qg"
  },
  "dY27hUYPSSsOX0X0X1g9cA": {
    "date": "4/22/2019",
    "text": "We had a great meal at Spice Affair this past weekend! Happened to be around Aspinwall and Indian food sounded like a great way to end a rainy day.   The interior of the restaurant looks very warm and clean. The service is very friendly as well! After we ordered, a waitress brought over some chips with three accompaniments: onion chutney, coriander sauce, and a sweeter brown glaze sauce. It was a great appetizer and really tasty!   We ended up getting the chicken pakora, keema naan, and the house biriyani. The pakora was crispy and delicious. The keema naan tasted very fresh and savory as well. The biriyani was delicious! The house biriyani had a mixture of chicken, lamb, and shrimp, along with vegetables with the rice. Along with the chutneys provided earlier, the meal was very filling. We ended up taking half of the naan and biriyani home since we filled up pretty quickly.   I also got a rose lassi which was lightly sweetened and fragrant too. A great compliment to the savory meal. Would definitely return again for another meal and to try some dessert items!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MoFYvOoufOMyVTmUFAhRxQ"
  },
  "Atf72xUM-ORK-HXzLjpkeA": {
    "date": "9/2/2019",
    "text": "When comes to Indian fare, Spice Affair fits the bill for me.  I have had a variety of different dishes and all were quite delicious.  In the beginning, the pita type chips that are served with the three sauces: a hot salsa like dip, a heavy dark sweet sauce and a green minty dip.  The overall flavors of their curry is very good and probably one of the better ones I have been to in Pittsburgh.  The garlic naan bread works great as for dipping with the curry or ask to keep the reddish salsa from your pita chips to spread!",
    "rating": 4,
    "rated": {
      "funny": 13,
      "useful": 20,
      "cool": 19
    },
    "photos": [
      {
        "img_id": "9w8sdZy-M6Ha51twbyQQDQ",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9w8sdZy-M6Ha51twbyQQDQ/o.jpg"
      },
      {
        "img_id": "-AUMGKPocmbe210U61nC2g",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States. pita chips and dip",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-AUMGKPocmbe210U61nC2g/o.jpg"
      },
      {
        "img_id": "iEQ_HUz09G2Om0VjvRulCA",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States. Gobi Manchurian",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iEQ_HUz09G2Om0VjvRulCA/o.jpg"
      }
    ],
    "user_id": "6tbXpUIU6upoeqWNDo9k_A"
  },
  "b111sNihJS2qoqEFI4KRyw": {
    "date": "7/22/2019",
    "text": "The food here is nothing short of spectacular! The menu has so many options and sometimes it's overwhelming because I am so indecisive. The samosas are EVERYTHING!  I also love the chicken vindaloo. I can't wait to get back to the neighborhood to grab a bite.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "6Ki3bAL0wx9ymbdJqbSWMA"
  },
  "aF7LIHEmeAP5WbonNBKWsg": {
    "date": "9/15/2019",
    "text": "Went to try out this place while visiting Pittsburgh. Good location, we sat outside. The owner was warm and welcoming. Two stars because the food did not meet our expectation. How it was explained it was not cooked like that. Food can be much better. Presentation was good but...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T577X8ljCN2aOmcAO0zFxw"
  },
  "Vccwy9E7ReSi1akGgAjAhw": {
    "date": "7/23/2019",
    "text": "This has become my favorite place for Indian food. Friendly, knowledgeable staff. (A real bonus with my gluten free status.) The deck is a nice setting for dining, weather permitting. The one complaint I have is that it's so hard to decide what to order, because everything I have tried is so good. It's BYOB if you want to enjoy an adult beverage with your meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Beo8qoIWwsy5NHAb39xkKQ"
  },
  "7fZd2nqgaBdqUDcwe1OK-Q": {
    "date": "4/19/2019",
    "text": "Had a very large group reservation here last month. They took great care of the 17 of us. The food was delicious (get the veggie pakoras for sure!). Everyone was very happy with their meals. We had many English people in our group and we know the English love their Indian food. All agreed that it was the best they have had in Pittsburgh. We will definitely return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YEUSn63CFm79Cr3o0hTUtQ"
  },
  "h4ERr4edvdTgjtiTcybWLg": {
    "date": "9/8/2019",
    "text": "On August 30th, my wife and I ate dinner at Spice Affair. I'd rate the food as average for an Indian restaurant. The problem we had was in paying for the meal. We tried to use a \"local flavor\" $20  coupon which my wife just purchased. The coupon was on her phone and when we presented the phone along with cash the waitress told us that the coupon had already been redeemed. We said that is not possible and wound up paying the bill without the coupon. On Monday we called \"local flavor\" and they told us the coupon was redeemed at 6 PM on August 30th. It had to be redeemed by a Spice Affair employee while we were there,  and NOT credited to us. We called the restaurant, spoke to the manager who was very irritated and insisted that his employees were \"well trained\" and would never make such a mistake. Bottom line is we are out $10 for the coupon and were berated by the manager. We will not be going back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UFiXNk9yBoDZ2wZrOQWwZg"
  },
  "jDnKJs5y0xFnLN0E6XlxWg": {
    "date": "6/26/2019",
    "text": "Delicious!  As an Indian food newbie I started with the chicken tikka masala, and was so impressed that I've started ordering takeout regularly.  The Butter chicken and Chicken Vindaloo are also excellent.  Great Spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "P5cHxlTejSUvZ9qtSnkKsw"
  },
  "NMonwVoSBTGE7LM7pHxjjQ": {
    "date": "3/18/2019",
    "text": "So. Delicious.   We live right across the street and the smell from this place... I could literally eat here every day.   They have a large menu with so many options for chicken, shrimp, and veggie options. Everything is so fresh and fragrant, my mouth is watering as I write this review.   I believe this place is BYOB, so make sure you grab some booze beforehand.   Lunch is a buffet; my hubby took his brother here on the weekend and they said it was great.   The restaurant is clean and cozy, and the staff here are super friendly and attentive.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nh8aGXMAB2AphpD05ymBqA"
  },
  "YQRoW9paE-EAWsMegdtCMA": {
    "date": "2/4/2018",
    "text": "Many ingredients are fresh and one can tell! The dishes we had were delicious.   We started with a vegetarian appetizer sampler. This was pakora, samosa and fried paneer. For dinner we ordered butter chicken, chicken tikki masala, lamb curry, and I had the malai kofta. We also ordered a bread basket...this was plenty of naan for the 4 of us. My dish was full of flavor but too salty for my taste.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-zoKnhRd4Knnj_P-qO0GPQ"
  },
  "NyG0nTFAiQANr77kbk3frQ": {
    "date": "5/31/2019",
    "text": "This is my favorite restaurant! They get the spice levels perfectly. My favorite is the butter chicken with the perfectly creamy sauce and juicy tender chicken. The garlic naan is amazing! Love this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bvYLHwwS454ho6eHNHwmzQ"
  },
  "vL0BffFNr2XIZ-vXcUQXNQ": {
    "date": "7/21/2019",
    "text": "Best samosa and tandoori chicken I've ever had. Buffet is excellent. I wish they would give a little more protein in the orders which is why I prefer the buffet but the taste is excellent. So glad they are reopened now!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QoK6znrMd8soosJCfQxEuQ"
  },
  "oT5CMVHrlGrEJ_JTz0xXzA": {
    "date": "3/30/2019",
    "text": "Always delicious saag chicken and chicken tikka! Best Indian in the north/east of Pittsburgh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q9X2aeQWTninY2NLBu6Fcg"
  },
  "YGH-4AhjdmuBpzdvI2CJuQ": {
    "date": "4/24/2018",
    "text": "I don't ever go out for Indian food but everything was better than expected. The staff was very personable and the service was rather quick. We nixed the buffet because we wanted something made to order and to try other things. It didn't look all so appetizing but everyone at the restaurant seemed to really enjoy it.   Our meal was delicious and looked delicious. My favorite was the Naan bread and the Butter Chicken. The mango chutney was interesting. Probably wouldn't order again but that is to my liking. Great first experience and would definitely recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "51DcQdWuiazKLMmnEGNj1g",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States. Butter Chicken w/ Basmati Rice, Chicken Masala, &amp;amp; the Naan Bread Basket",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/51DcQdWuiazKLMmnEGNj1g/o.jpg"
      }
    ],
    "user_id": "RI0RQJR1ylayjn09QCaXTw"
  },
  "e5uHQ6uf-FC-97V-hikeyg": {
    "date": "1/12/2017",
    "text": "We FINALLY have an Indian food restaurant in our neighborhood...yayyyyy! I have already visited four or five times since they opened last month (yeah, this might become a problem!), mostly for takeout.  So far I've tried their chicken tikka masala, chicken vindaloo, malai kafta, aloo matar, naan, and veggie samosas. I've been quite pleased with the food. Their sauces are really flavorful and creamy without being too rich or heavy. The chicken has always been perfectly tender in the meat dishes. And their veggie samosas may be the best I've ever had. Their naan is the one item that I think could use some improvement. I've always ordered the garlic naan, and some of the time it's tasted a little tough without much garlic flavor, almost like it wasn't fresh. Other times, the naan has been chewy, soft, fluffy, and packed with garlic flavor like good garlic naan should be.   True to their name, they certainly include lots of flavor and spice in their dishes, although I have found their heat scale to be a little inconsistent (you can choose your desired spice level from 1-10).  I tend to like things on the spicier side (not burn-your-tongue-off spicy, but enough to break me into a minor league sweat). Depending on the day, the heat levels seem to differ. I've had everything from a level 7 that barely tickled my tongue to a level 5 that had me reaching for the water several times during my meal. So until they get a little more consistent with their heat, I'd recommend going conservative on your spice level selection.  Every time we've ordered takeout, our food has been ready within 20 minutes and the workers were very friendly when we came to pick it up. The food is also always packaged very thoughtfully, which is a nice touch (e.g., plastic wrap around the take out containers to avoid the dreaded soggy-bottom-of-the-bag-due-to-sauce-spillage).  Most new restaurants have growing pains and need to work out the kinks at the beginning, so it bodes well that my experiences here have been positive right out of the gate. I must admit that this is still not my favorite Indian food in the 'Burgh (at least not yet), but it definitely holds its own. Considering that this is a short walk away from me, they will continue to see a lot of my hungry face in the future. I can't wait to try their lunch buffet. Oh, two final nuggets of info...it's BYOB and they also deliver!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "TcrhbFsSs8qBB_UJzWSFVQ",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States. Veggie Samosas (takeout)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TcrhbFsSs8qBB_UJzWSFVQ/o.jpg"
      },
      {
        "img_id": "3r1SEwhvgtOVE64SBAZ1kQ",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States. Malai Kafta (takeout)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3r1SEwhvgtOVE64SBAZ1kQ/o.jpg"
      },
      {
        "img_id": "hjlQo_9Ie3Pc4Xs5b5It8g",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States. Garlic naan (takeout)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hjlQo_9Ie3Pc4Xs5b5It8g/o.jpg"
      }
    ],
    "user_id": "0EhPIlDozxGKpbbHRr6vZg"
  },
  "PKHZIenM6CO_A0EnOGSyCw": {
    "date": "1/11/2017",
    "text": "Very exceptional all the way around. Very authentic Indian food prepared fresh and delicious. They have a full page of vegetarian options.   The spice level the use (1-10) is essentially the same as People's Restaurant.   We had an excellent vegetarian appetizer sampler plate that I highly recommend.  Portions are generous. Prices are very reasonable.  They have an authentic clay open used to bake traditional breads.  Romantic decor and no corkage fee (BYOB).",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "jB35MD4pGfEUuqoeI_3sVQ",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States. Naan",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jB35MD4pGfEUuqoeI_3sVQ/o.jpg"
      },
      {
        "img_id": "ssxeQYaOKqxVnuTXvDWMbQ",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ssxeQYaOKqxVnuTXvDWMbQ/o.jpg"
      },
      {
        "img_id": "CQ3bLi8IEQJPi2paR3U7_Q",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CQ3bLi8IEQJPi2paR3U7_Q/o.jpg"
      }
    ],
    "user_id": "8AwcaBJjiMpQ__FPxktwwQ"
  },
  "baw9Avi3HXqalAh3L_oLEg": {
    "date": "5/21/2018",
    "text": "I am no expert on Indian food.    Nice outside patio.  Started with the Aloo Parantha to start.  I had the Tofu  Moilly.  It was excellent.  I will be back again.  My girlfriend had the Lamb Karahi.  Great taste and well prepared.    Go check it out.  BYOB",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "gciGZsXZH1xZjt5Taq5lFQ"
  },
  "Fg0bRdpswsP4i_Vt-rQHVg": {
    "date": "12/15/2018",
    "text": "its back open!!!!! food is better than ever! Come get the best Indian food in Pittsburgh!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "z668GNDd234bE9pgwQosFA"
  },
  "D-63LAtgxcz5Idm_ZbbJCw": {
    "date": "9/24/2017",
    "text": "Round 2: the lunch buffet!!  Wow, in my 28 years of being alive and eating at many Indian restaurants around the world, this is the best Indian buffet I've ever had. All of the food was fresh, delicious, and of high quality. The buffet spread was plentiful and all for such a reasonable price. I will not be trying any other Indian restaurants in my PA stay as I've found all that I need in this one.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "48ILCpEr3zLYAWtt4PYIwA",
        "caption": "Photo of Spice Affair - Pittsburgh, PA, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/48ILCpEr3zLYAWtt4PYIwA/o.jpg"
      }
    ],
    "user_id": "9oAJVnCd9LWZxWbtoose-A"
  },
  "L5LPB_iwA4t-rab17aNnAg": {
    "date": "4/14/2018",
    "text": "The lunch buffet is a great deal, but the food isn't super amazing so I guess it's a trade off. I was pretty disappointed there was no saag and the chicken tiki masala was sub par. For me the highlights were the chana masala, samosas, tandoori chicken, and the curried veggies.  If you want a filling, decent lunch for a great price, then go here. But if you want top Indian food in the Pittsburgh area I would recommend Mintt of Tamarind.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VO16w17eBZOXO-evJrLvBw"
  }
}